{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Deedra Waters <dmwaters@gentoo.org>", "subject": "Re: gentoo dropping speakup support", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nOn Sun, 17 Jun 2007, Michael Whapples wrote:\n\n> Date: Sun, 17 Jun 2007 23:22:19 +0100\n> From: Michael Whapples \n> Reply-To: Speakup is a screen review system for Linux.\n>     \n> To: Speakup is a screen review system for Linux. \n> Subject: Re: gentoo dropping speakup support\n>\n> While it is a shame that you find this, thank you for saying what the\n> exact problem is. If speakup won't compile on x86-64 either now, I am\n> sure that soon someone will fix that as it probably affects quite a\n> number of users.\n\n- From what i gather it's not building with  .22 in general though i could\nbe wrong. However, not building on x86-64 does effect a lot of users,\nbecause a lot of the blind folks  i've talked to lately are using amd64\nand other similar systems.\n\n>\n> Other than the install of gentoo, I don't think the impact is as bad as\n> it is for other distros as gentoo users may tend to want to compile a\n> custom kernel anyway. The install probably isn't such a problem as I\n> think if you are doing an install from the internet then it doesn't\n> matter what version of gentoo the CD is as the installed system will be\n> the latest, so a user could use the last release with speakup to install\n> with speakup (unless they are doing an install without internet access,\n> for which there may not be a solution).\n\nactually, most gentoo users use the gentoo-sources kernels because they\nhave several aditional patches. You are right in that gentoo users can\nuse an older livecd to install the system, which is what i suggest\npeople do since any newer releases won't be able to talk because of the\nspeakup support being removed.\n>\n> On a different note, while I don't know enough about the kernel to be\n> certain, but is this problem to do with speakup and the way it accesses\n> the serial ports? As I remember from some previous discussions about\n> speakup and serial port access, I think it was said that if speakup used\n> the standard serial port driver then it should be possible to use serial\n> ports not built on the motherboard. So would this also help in solving\n> such a problem as found in gentoo? If so might it be time to say it must\n> be done?\n\nYou are right, that is the problem here. Williamh and i talked a great\ndeal before he wrote that email. While i don't like this idea, i think\nit's time that speakup be put into user space as daniel has said in the\nbug. If you really must have the boot omessages you can get them from\ndmesg, or at worst, use the kernel config option to get your kernel to\ndump panics in swap space, stick the machine on a livecd and get the\npanics that way. Unfortunately, i'm with daniel on this one i really\nthink it's  time to put speakup into user space.\n>\n> Unfortunately I currently cannot help with this as I am a python\n> programmer so would need to learn C before I could do anything, probably\n> something I should do as so much opensource software is written in C.\n>\n> From\n> Michael Whapples\n> On Sun, 2007-06-17 at 15:00 -0500, William Hubbs wrote:\n> > -----BEGIN PGP SIGNED MESSAGE-----\n> > Hash: SHA1\n> >\n> > All,\n> >\n> > because of this bug [1], gentoo linux will be dropping support for speakup in its official kernels starting at 2.6.22.\n> >\n> > [1] http://bugs.gentoo.org/show_bug.cgi?id=177794\n> >\n> > Is there any possibility at all that speakup could be moved into user space as the bug suggests?  I feel that if we can go into user space this will b a better approach.\n> >\n> > Thanks,\n> >\n> > - --\n> > William Hubbs\n> > gentoo accessibility team lead\n> > williamh@gentoo.org\n> > -----BEGIN PGP SIGNATURE-----\n> > Version: GnuPG v1.4.7 (GNU/Linux)\n> >\n> > iD8DBQFGdZLWblQW9DDEZTgRAsCOAJoD/roDmHTKu7ji8qTXZ2eoX47T1ACeIivJ\n> > j/qhb9Z6KNpfitEvr7Onrug=\n> > =mpb2\n> > -----END PGP SIGNATURE-----\n> >\n> >\n> >\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n\n- -- \nDeedra Waters - Gentoo accessibility and amd64 -\ndmwaters@gentoo.org\nGentoo linux: http://www.gentoo.org\n\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.7 (GNU/Linux)\n\niD8DBQFGddVyU5AGPOTGNc8RAviEAJ9iETquiB3Si3ZqpOYheC4bO+xDcwCgrp7l\nZTDkY7qgDJ79AJcw1y9qiq0=\n=yvTG\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}