{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS News Early Show <cbsnews___early_show_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Harry Smith: When Lightening Strikes", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n \n \n\n\n \nMay 17, \n      2007\n \n\nHi, \n      everybody,\n \nOur crazy spring continues in New York. \n      Yesterday, right around \n      suppertime, noisy thunderstorms rolled through the city and the suburbs. \n      There was a dramatic picture of lightening striking above the Empire State \n      Building. And, it brings to mind how dangerous lightening can be. We \n      talked today with meteorologist \n      and lightening safety expert \n      John Jensenius who reminded us that in a average year more people are \n      killed by lightening strikes than hurricanes and tornados. We showed the \n      dramatic video from Texas of two school children who narrowly missed being \n      hit by a bolt of lightening. If you haven't seen it yet, take a look. \n      \n \nWe had a nice chat with \n      our friend Bob Schieffer about the ongoing dissatisfaction among \n      Republicans with the candidates who are running for the Republican presidential \n      nomination thus far. Bob said he thought former \n      Tennessee Sen. Fred Thompson would \n      eventually enter the race, and maybe \n      Newt Gingrich, too. But the real \n      interesting turn in our talk came when we discussed New York \n      City Mayor Michael Bloomberg. A brand new poll out this \n      week from the New York Daily News shows New Yorkers think \n      Bloomberg is a better mayor than Rudy Giuliani and New Yorkers think \n      Bloomberg would make a better president, too. Bloomberg is worth billions of \n      dollars and has more that enough money to mount a national campaign out of \n      his own pocket. If Bloomberg were to run, it's \n      a pretty good guess that he would run as an Independent. I \n      asked Bob if he thought an Independent could be elected president and he \n      said yes. \n \nAlso on the show, Hannah \n      had a nice chat with Antonio Banderas (he's \n      in \"Shrek the Third\"), Julie got to grill \n      brats and hot dogs with Bobby Flay (I'm seriously jealous) and you'll want to take a look at \n      a segment by our new contributor, \n      Mary Lou Quinlin. She has some really interesting observations that \n      you'll really enjoy. \n \nTomorrow, Mary Lou \n      will be exploring what women really think about motherhood. Also \n      tomorrow, Mike Myers will be here to talk about his role \n      as \"Shrek\"; we'll have a behind-the-scenes look at the \n      \"CSI: Crime Scene Investigation\" season finale tonight; and we'll learn \n      how to protect our kids from online sex offenders.\n \n      \n\nHarry SmithEarlyShow@cbs.com \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}