{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Janell Wise\" <jowcodealotnos@codealot.com>", "subject": "Melt away pounds with Anatrim", "body": "\nMake your fat friends envy you\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most exciting product for weighty people is now readily available – As were told on ABC.\n\n\nDo you retain all the situations when you asked yourself to do any thing for being delivered from this quickly growing pounds of fat? Luckily, now no big price is to be paid. With Anatrim, the ground-breaking weight-reducing mixture, you can get naturally health mode of life and become really slimmer. Have a look at what our customers say!\n\n\n\n\"I hate to confess but I was an awful food addict. \n\n\nI greedily ate all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis torment passed away when I started course with Anatrim! \n\n\nOh, God,\n\n\n\n\n my appetite decreased, \n\n\nmood improved and I turned to the happiest person in the world 29 pounds in 2.5 months. \n\n\n\n\nI can tell you now I turned to the happiest person!\"\n\n\n\n\n\nAmely S., Chicago\n\n\n\n\n\n\"Since my early childhood I was a weighty boy. \n\n\nYou can't even fancy how I hated being derided at school. \n\n\n\n\nI detested my plumpness and I abhorred myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nIt literally pulled me out of this fearful nightmare! The warmest thanks to you, guys.\"\n\n\n\n\n\nSteve Doubt, Washington\n\n\n\n\n\n\"You know what? Anatrim kept my marriage intact! I got into the circle, depression – eating more – more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOne my best friend pointed to your web page and I called for my pack of Anatrim right off. \n\n\nThe final result was magnficent, my appetite came to acceptable level, I was in good spirits oftener, and, be sure, I tightened my belt with no regrets. And you see me, the bed became cool also!\"\n\n\n\n\n\nMichael\n\n\n\n\n There are lots of testimonial letters happy people leave after trying Anatrim. Why don't you join the thousands and thousands of slim men and women and try this original appetite-suppressing power increasing product now!\n\n\nDo not decline the chance!\n\n\n\n\n"}