{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "This Weekend on BBC Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nALAN SHEARER ON THE FA CUP FINAL\nSaturday sees the FA Cup final return to Wembley after a seven-year absence for what will be a very special day.\n\n\nI had the honour of a sneak preview of the stadium about a month ago and if I had to sum up it up in one word I'd simply say, fantastic.\n\n\nIt really is very impressive. The spirit of the old Wembley remains, but the FA have delivered a brand new sparkling stadium of which we can all be proud.\n\n\nWas it worth the wait? Well I think we would all have liked to have seen it delivered sooner, but I've no doubt everyone will be mightily impressed with it.\n\n\nAnd what better way to celebrate than with the best two teams in the country slugging it out?\n\n\nAll week I've been asked to predict the outcome of the final, but this is a game that's just too close to call - you might as well flip a coin.\n\n\nManchester United had the upper hand in the Premiership and will probably go into the match in better mental shape than Chelsea, but whether that will be enough to win the Cup I don't know.\n\n\nChelsea will feel they have a point to prove, and are a very talented and resilient side.\n\n\nThe FA Cup is the only domestic trophy Jose Mourinho hasn't won at Chelsea, and he's not a man who accepts failure.\n\n\nBig games bring out the best in big players, and there will be plenty of those on show on Saturday - Drogba, Rooney, Terry, Ferdinand, Scholes, Lampard.\n\n\nBut I have to reserve special praise for Manchester United's Cristiano Ronaldo.\n\n\nThere's no doubt this has been the Portuguese winger's season. He's been brilliant.\n\n\nTo perform the way he has in the face of so much criticism after the World Cup is very impressive and he thoroughly deserves his player of the year awards.\n\n\nEnjoy the Cup final,\n\n\nAlan\n\n\nAlan Shearer was an FA Cup finalist with Newcastle in 1998 and 1999. He will be a guest in the Match of the Day studio at Wembley on Saturday.\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nFA CUP FINAL ON THE BBC\n bbc.co.uk/football\nSaturday\nFull coverage all day on bbc.co.uk/football; Match of the Day Live: FA Cup final - Chelsea v Man Utd (1240 BST, BBC ONE; kick off 1500 Radio Five Live/online). FA Cup highlights (2250, BBC ONE).\nSunday\nFA Cup highlights loop (until midnight) on the red button (BBCi).\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\tMatch of the Day's Cup final coverage includes features on Cristiano Ronaldo and Didier Drogba and a tour of the new Wembley with architect Lord Foster. Guests include Alan Hansen, Alan Shearer, Mark Hughes, Marcel Desailly and Peter Schmeichel. Plus a whole lot more.\n\t\t\t\t\t\n\n\n\n\n\nMOTORBIKES\n bbc.co.uk/motorbikes\nSaturday\nMotoGP: Le Mans qualifying (1245-1400, BBCi).\nSunday\nMotoGP: Le Mans live (1230-1430, BBC TWO); NW200: highlights (1430-1600, BBC TWO and BBC Sport website).\n\n\n\n\n\n\nMORE SPORT ON THE BBC\n bbc.co.uk/tvandradio\nSaturday\nCricket: England v West Indies (1045-1900, Radio Five Live Sports Extra/online).\nSunday\nCricket: England v West Indies (1045-1900, Radio Five Live Sports Extra/online); Inside Sport (1130-1230, BBC TWO); Rugby League: Super League Show (1300-1400, BBC North and BBC Sport website); Rugby Union: Heineken Cup final - Leicester v Wasps (1430-1630, Radio Five Live/online); Athletics: Great Manchester Run (1600-1730, BBC TWO and online). \n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\tMONDAY: Don't miss the next edition of Inside Sport - more interviews with the biggest names in sport and studio banter, hosted by Gabby Logan. 2305 BST, BBC ONE. \n\t\t\t\t\t\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tFA Cup final select XI\n Who would you pick in your dream team?\n\t\t\t\t\t\n\t\t\t\t\t\tWatch Inside Sport\n Download the best bits of the show\n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}