{"category": "ham", "to_address": "B.Baker@neu.edu", "from_address": "James Packard Love <james.love@keionline.org>", "subject": "[Ip-health] Re: [thaifta] Bangkok Post, Thailand considers revoking C.L. on Merck's efavirenz", "body": "I believe many of these news reports are poorly informed.  I don't\nthink there is any real change in Thai policy.  People sometimes hear\nwhat they think they should hear.   If Merck is not the low priced\ncompany, it will not be selling much product in Thailand, I\npredict.     Jamie\n\n\nOn May 24, 2007, at 9:57 AM, B.Baker@neu.edu wrote:\n\n> Like Brazil in the recent past, Thailand is playing into drug\n> companies\n> hands if it backs down on implementing compulsory licenses for\n> short-term\n> gains in the form of price discounts or even sweetheart\n> licensing/technology transfer deals.  Developing countries need to\n> understand that their greatest strength is in numbers - in their\n> willingness to aggregate markets to energize generic entry and then\n> robust\n> generic prices that will drive the costs of medicine lower and\n> lower over\n> time.  Brazil thought it had gotten good deals three times in the\n> past only\n> to discover that the advantages of temporary and partial price\n> discounts\n> were overrun by the dynamics of generic competition, often aided by\n> behind-the-scenes efforts by the Clinton Foundation.\n>\n> It may be hard for Thailand to justify paying higher prices for a\n> generic\n> product in the short run, but the advantages of having multiple and\n> more\n> local suppliers to prevent stock-outs and the advantages of helping to\n> create a highly competitive generics market outweigh the temporary\n> advantages.  Likewise, although Thailand may feel that it needs to\n> back\n> down because of the intense pressure being exerted by the US, by Big\n> Pharma, and by right-wing think tanks, the issuance and enforcement of\n> compulsory licenses will get easier over time as developing countries\n> overcome the first-mover problem and more and more countries jump\n> on board.\n>\n> The need for compulsory licenses in producing countries and/or in\n> exporting\n> and importing countries will become more intense over time as Pharma\n> patents its newer medicines more intensively in developing\n> countries and as\n> all the major producing countries have now been required to adopt\n> product\n> patents and to issue patents on post-TRIPS medical innovations.\n> Hopefully,\n> Thailand can become convinced to do no more than suspend, rather than\n> revoke the compulsory license, or better yet continue to source\n> generics\n> because of the long-term and collective advantage of doing so.\n>\n> Brook\n>\n> Bangkok Post, May 24, 2007\n>\n> http://www.bangkokpost.net/News/24May2007_news02.php\n>\n> DRUGS PATENT ROW / INFORMAL TALKS WITH US PHARMACEUTICAL FIRM\n>\n> Govt considers revoking compulsory licence for Efavirenz\n>\n> APIRADEE TREERUTKUARKUL\n>\n> The government is considering revoking the compulsory licence\n> issued for a\n> generic version of the HIV/Aids medicine Efavirenz after a\n> promising start\n> to informal talks with patent holder Merck & Co Inc in the United\n> States\n> yesterday.\n>\n> Public Health Minister Mongkol na Songkhla said Merck representatives\n> proposed several interesting options for the anti-retroviral\n> medication\n> which could lead to a win-win solution for both sides.\n>\n> ''Who wants to buy generic drugs for treating patients if the\n> original drug\n> is more affordable?'' he said during a teleconference from the United\n> States.\n>\n> His unexpected comment came just one day after he said the trip to\n> the US\n> had failed to make any inroads into ending the disagreements between\n> Thailand and US pharmaceutical firms.\n>\n> US Secretary of Commerce Carlos Gutierrez was reported to have put\n> pressure\n> on the Thai team to abandon its policy of compulsory licensing.\n>\n> The Public Health Ministry last November issued a compulsory\n> licence to\n> import a generic version of Efavirenz from Indian drug maker\n> Ranbaxy which\n> would cost 540 baht per month per patient _ considerably cheaper\n> than the\n> original drug, which costs 726 baht per month per patient.\n>\n> Dr Mongkol did not give details of the options proposed by the New\n> Jersey-based pharmaceutical firm but said it could be a good\n> example for\n> other drug makers whose patents for Aids and blood thinning drugs\n> had been\n> overridden.\n>\n> Dr Mongkol insisted the government reserved the right to use\n> compulsory\n> licensing if a problem of access to affordable medicines occurred\n> with any\n> life-threatening disease in Thailand.\n>\n> Thai Public Health, Commerce and Foreign Affairs ministry officials\n> were in\n> the US to explain to US representatives from various sectors,\n> including\n> pharmaceutical firms, the government's decisions to bypass patents\n> on Aids\n> drugs Efavirenz and Kaletra and the heart drug Plavix.\n>\n> Billy Tauzin, president and chief executive of the Pharmaceutical\n> Research\n> and Manufacturers of America, representing the leading US\n> pharmaceutical\n> research and biotechnology companies, also made it clear to the health\n> minister that leading American drug firms remained deeply troubled by\n> Thailand's use of compulsory licensing.\n>\n> ''Pursuing such drastic measures, as the Thai government has done,\n> not only\n> hurts the innovative engine that helps economies around the world\n> prosper.\n> Worse, it could also limit access to new breakthrough medicines for\n> patients suffering from life-threatening diseases such as HIV/Aids and\n> cancer,'' he said. ''Clearly, Thai patients deserve better.''\n>\n> But Dr Mongkol argued that Washington had received misleading\n> information\n> about Thai policy.\n>\n> Virat Poorahong of the Thai network Living with HIV/Aids expressed\n> concern\n> at the government's indecisiveness.\n>\n> ''We do not support the government threatening drug companies by\n> announcing\n> compulsory licensing. But we want the government to think and act\n> fast,''\n> Mr Virat said.\n>\n> ''We're talking about the lives of half a million HIV-positive\n> people and\n> many more cancer patients who could be short of life-saving\n> medications.''\n>\n>\n>\n\n----------------------------------------------\nJames Packard Love\nKnowledge Ecology International\nmailto:james.love@keionline.org\ntel. +1.202.332.2670 / U.S. mobile+1.202.361.3040, Geneva mobile\n+41.76.413.6584\n\n\"If everyone thinks the same: No one thinks.\" Bill Walton\"\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}