{"category": "ham", "to_address": "Ip-health <ip-health@lists.essential.org>", "from_address": "James Packard Love <james.love@keionline.org>", "subject": "[Ip-health] Pharmalot - Should The US Invade Thailand?", "body": "--\n[ Picked text/plain from multipart/alternative ]\nhttp://pharmalot.com/2007/04/should_the_us_invade_thailand.php\n\nPharmalot - Should The US Invade Thailand?\nApril 26, 2007\n\nShould The US Invade Thailand?\nNo one is suggesting such a move, at least not yet. But the rhetoric\nover the controversy between the Thai military government and big\npharma is getting pretty hot.\n\nA conservative group, USA for Innovation, has been issuing press\nreleases all week urging the White House and Congress to get tough\nwith Bangkok. The group's founder and executive director is Ken\nAdelman, a current member of the Defense Policy Board, which advises\nthe US Defense Secretary. He's also a senior counselor at Edelman\nPublic Relations, whose clients include Abbott Labs, which\nintensified the row with Thailand by threatening to withhold new meds\nfrom the country after a compulsory license was issued for its\nKaletra AIDS drug.\n\nToday, USA for Innovation took its message to the public,\nparticularly investors, and paid for a full-page ad in The Wall Sreet\nJournal imploring Washington to \"take retaliatory action in the form\nof trade or economic sanctions or the removal of military aid.\"\n\nHaggling is never easy and posturing is part of the game. So far,\nthough, Abbott doesn't have much to show for its hard-line stance. Of\ncourse, the flap is nowhere near its end, and Abbott may yet gain\nsomething from playing hardball. The drugmaker has that right. On the\nother hand, all this public saber rattling appears a wee bit\ninflammatory, given that the US Trade Rep has acknowledged Thailand\nhasn't violated world trade rules.\n\nSo Ken, even if sanctions are issued, what happens if that doesn't\nwork? Will you ask Johnny to get his gun?\n\nHere's the press release with the full text of the ad; http://\nusaforinnovation.org/news/display_article.cfm?ID=20\nA list of the group's press releases;  http://usaforinnovation.org/\nhome/index.cfm\nA little something about Ken Adelman; http://usaforinnovation.org/\nabout/display_about.cfm?id=8\nA snapshot of Edelman PR. http://www.odwyerpr.com/pr_firms_database/\nprfirm_detail.htm?prid=%7BACFF8E63-A98F-4765-9373-288B524C24FB%7D\n\nPosted by Ed Silverman\n\n\n---------------------------------\nJames Packard Love\nKnowledge Ecology International\nmailto:james.love@keionline.org\ntel. +1.202.332.2670 / mobile+1.202.361.3040\n\n\"If everyone thinks the same: No one thinks.\"  Bill Walton\"\n\n----------------------------------------------\nJames Packard Love\nKnowledge Ecology International\nhttp://www.keionline.org\njames.love@keionline.org\nWashington, DC +1.202.332.2670\n\n\"If everyone thinks the same: No one thinks.\" Bill Walton\"\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}