{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nRisk Management 101: Managing Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nEPRI's Value \n\t\t\tand Risk in Energy Markets - Introduction & Principles\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nETRM Software Implementation: Facts and Figures (UtiliPoint.com - Jun. 1, 2007)\n\n\n\nUtiliPoint.com - Jun. 1, 2007 - During the period of March and April, 2007, UtiliPoint International, Inc. (UtiliPoint) conducted an electronic survey into the implementation of Energy Trading, Transaction and Risk Management (ETRM) software.\n\n\nJun 1, 2007 PowerMarketers Industry Publications\n\n\n\nFuture Mergers (EnergyBiz Insider - Jun. 1, 2007)\n\n\n\nEnergyBiz Insider - Jun. 1, 2007 - Groupings of mammoth super-regional utilities in the United States won't happen any time soon.\n\n\nJun 1, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jun. 1, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 1, 2007\n\n\nJun 1, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for June 1, 2007  \n\n\n\nFirst Enercast Featured Articles for June 1, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nJun 1, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nPipeline projects approved: Laterals would connect to new natural gas route\n\n\n\nJun. 1--Construction could start early next year on six pipeline connectors in eastern Wisconsin that would link to a new natural gas pipeline planned to run from Jefferson County to Green Bay.  The state Public Service Commission on Thursday approved the projects proposed by Wisconsin Public Service Corp. of Green Bay and We Energies of Milwaukee. We Energies will spend nearly $43 million to ...\n\n\nJun 1, 2007 Knight Ridder Tribune Business News\n\n\n\nElectric bills could rise $10 a month\n\n\n\nJun. 1--Electric rates would rise 14.2 percent or $10.25 a month and natural gas rates 4.5 percent or $3.25 a month for a typical residential customer in Wisconsin under a proposal Xcel Energy will file this morning with the state. Commercial and industrial customers would see an average electric rate increase of about 15 percent and a natural gas rate increase of between 1.5 percent and 3 ...\n\n\nJun 1, 2007 Knight Ridder Tribune Business News\n\n\n\nPower up: Duke asks for N.C. rate hike: Residential customers would pay about $90 more per year\n\n\n\nMay 31--Duke Energy, citing its growing customer base, said Wednesday that it wants to raise base rates for the first time in 16 years in North Carolina.  The Charlotte-based utility, the largest in the Carolinas, will ask state regulators this week for permission to add about $7.20, or 8.5 percent, to the typical homeowner's monthly power bill. The increase, which would raise $140 million a year ...\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nBlowin' in with the wind\n\n\n\nMay 31--Duke Energy Corp.'s purchase of an Austin-based company that generates wind energy power will create more wind projects in the Permian Basin.  On Tuesday, Duke Energy purchased Tierra Energy, a small wind energy company that has started two projects in the Permian Basin. One is at Notrees and the other is in Big Spring. David Marks, former president of Tierra Energy and now senior vice ...\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nBioEnergy Solutions wins approval to convert dairy waste into natural gas\n\n\n\nJun. 1--A Bakersfield-based company has become the first in state history to receive California Public Utilities Commission approval for large-scale conversion of dairy waste into natural gas.  Bakersfield-based BioEnergy Solutions received PUC approval a week ago for a 10-year agreement it signed with Pacific Gas & Electric Co. late last year to sell the utility natural gas collected from cow ...\n\n\nJun 1, 2007 Knight Ridder Tribune Business News\n\n\n\nTVA blueprint calls for more nuclear plants and conservation\n\n\n\nJun. 1--COLUMBUS, Miss. -- The Tennessee Valley Authority plans to build more nuclear plants while promoting more energy conservation in the next decade. With a leaner staff and improved productivity, TVA officials said Thursday they hope to improve the utility's capacity and its environmental performance without raising TVA's debt. Excluding adjustments for fuel costs, TVA predicts it can spend ...\n\n\nJun 1, 2007 Knight Ridder Tribune Business News\n\n\n\nAquila boosts natural gas rates: Typical residential customer will pay $3.64 more a month\n\n\n\nJun. 1--Bills for natural gas are going up in Lawrence, effective today.  Aquila Inc. said Thursday that it had received approval for collecting another $5.1 million a year from its 106,000 customers in Kansas, including about 33,000 in Lawrence. The increase, approved by the Kansas Corporation Commission, means that the typical residential customer will pay another $3.64 a month, while ...\n\n\nJun 1, 2007 Knight Ridder Tribune Business News\n\n\n\nPSC unveils plan to cut state's energy usage: Goal of reducing electricity use 15 percent by 2015,\n\n\n\nMay 31--successful, could lower utility bills, pollution levels  The initiative, known as the Energy Efficiency Portfolio Standard, would also seek to reduce natural gas consumption. On May 16, the PSC staff started to work on a proposal, taking advice from groups and people around the state under the guidance of an administrative law judge. The judge must provide a status report to PSC ...\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nNIPSCO, utilities ready for summer surge\n\n\n\nJun. 1--NIPSCO told state regulators on Thursday that it is ready to meet peak summer electricity use when customers crank up the air-conditioning.  \"We have a safe, secure, reliable supply of power this summer to meet customer demand,\" said NIPSCO spokesman Tom Cuddy. The utility will be using its own power plants as well as 500 megawatts of power purchased from other utilities to keep reserve ...\n\n\nJun 1, 2007 Knight Ridder Tribune Business News\n\n\n\nUCAN says power line more than San Diego needs\n\n\n\nJun. 1--A new power line isn't needed until 2018 to keep the lights on in San Diego County, and it's not needed at all to deliver electricity from the energy-rich Imperial Valley, according to a consumer group's analysis set to be filed today.  San Diego Gas & Electric disputed the report, saying the county faces an electricity shortage in 2010, and the utility says it needs a major transmission ...\n\n\nJun 1, 2007 Knight Ridder Tribune Business News\n\n\n\nUtility files for transmission line\n\n\n\nJun. 1--In West Texas, 70 miles is nothing, and that's how close a newly proposed transmission line comes to the planned Panhandle Loop.  Lone Star Transmission, a subsidiary of FPL Energy, filed an application Thursday to build a line from the area south of Big Spring and Abilene to the Dallas area. That puts its west edge close to the proposed Panhandle Loop.\n\n\nJun 1, 2007 Knight Ridder Tribune Business News\n\n\n\nState OKs $250 million Langdon wind farm\n\n\n\nMay 31--A $250 million, 160-megawatt Langdon Wind Energy Center will be built in Cavalier County this year, nearly doubling the state's existing wind energy output.  The North Dakota Public Service Commission on Thursday approved the application from FPL Energy, a subsidiary of Florida Power and Light. The company plans to start construction this month, with completion slated for December.\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nColumbia will raise price of gas in summer\n\n\n\nJun. 1--Columbia Gas of Virginia will raise natural gas prices an average of $5.45 a month during the summer.  Starting this month, the average bill will climb from $50.94 to $56.39. That average is based on using 3,500 cubic feet, or ccf. Virginia regulators have approved a plan by Columbia Gas to freeze the cost of delivering gas -- about 35 percent of a customer's bill -- through the end of ...\n\n\nJun 1, 2007 Knight Ridder Tribune Business News\n\n\n\nSale fails, NiSource flails\n\n\n\nMay 31--MERRILLVILLE, Ind. -- Months of anxiety for NIPSCO workers and consumers ended Wednesday with parent company NiSource Inc. announcing it had broken off sales talks with potential buyers.  The announcement that the NIPSCO sale had fallen through came as part of a long-promised update on a comprehensive strategic review that took well longer than one year.\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nCoal plant critics urge MEA to say no\n\n\n\nJun. 1--PALMER -- Matanuska Electric Association is asking its members to help select the sites for two new power plants, one coal-fired, the other gas-fired, but anti-coal groups say MEA should be asking whether, not where, that plant should be built.  \"They're sort of asking for window dressing after the main event has passed,\" Utility Watch president Jim Sykes said Tuesday.\n\n\nJun 1, 2007 Knight Ridder Tribune Business News\n\n\n\nFirst Energy says nuclear power station will meet new security rules\n\n\n\nMay 31--SHIPPINGPORT -- Security personnel at the Beaver Valley Nuclear Power Station in Shippingport are in \"good shape\" to meet new security regulations, a spokesman for plant owner FirstEnergy Corp. says.  The Associated Press reported Tuesday that federal regulators are revising work rules to make sure that security guards at nuclear plants remain alert, and that they don't work so many hours ...\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nElectricity providers optimistic on supply\n\n\n\nMay 31--Power should be plentiful in Wisconsin this summer, but utility officials say there still could be problems getting electricity where it's needed.  And big factories around the state want to make sure they are not forced to shut down so that people in Ohio, for example, have enough power to go around. For the first time in years, Wisconsin is not ranked among the nation's top spots for ...\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nPower rates going up effective today: Two increases will hit your bill ? one is due to low water supplies, the other stems from a court ruling. Get the details in our Q&A.\n\n\n\nJun. 1--Just as a potentially record-setting heat wave strikes Southwest Idaho, you may want to think twice about cranking up that air conditioner. Starting today, the average Idaho Power residential customer will see monthly bills jump by more than 20 percent.  State regulators Thursday approved two increases that take effect today. The increases will raise the bill of the average customer using ...\n\n\nJun 1, 2007 Knight Ridder Tribune Business News\n\n\n\nNo consumption boost as debt remains high\n\n\n\nJun. 1--The government will not introduce a policy to stimulate domestic consumption even though the inflation rate remains low because household debt is still high, says Deputy Prime Minister Kosit Panpiemras.  Officials will instead focus on a policy to stimulate local investment, he added. Household debt has jumped to 130,000 baht per household from 60,000 baht in 2002 due to the previous ...\n\n\nJun 1, 2007 Knight Ridder Tribune Business News\n\n\n\nDrought could cost TVA $300 million\n\n\n\nJun. 1--COLUMBUS, Miss. -- The lack of rain is drying up cash reserves for the Tennessee Valley Authority, TVA President Tom Kilgore said Thursday.  TVA estimates it has lost $200 million of hydroelectric power generation over the past eight months due to one of the driest years on record in the Tennessee Valley. Without sufficient rainfall, TVA may end up losing $300 million for all of fiscal ...\n\n\nJun 1, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nPacifiCorp to Construct Transmission Lines Through West\n\n\n\nThe Digital Utility  Vegetation Management  PacifiCorp yesterday announced plans to build more than 1200 miles of new 500-kV transmission lines originating in Wyoming and connecting into Utah, Idaho, Oregon and the desert southwest. The two lines are set for completion in year 2014. The $4 billion-plus investment plan includes existing projects in the company's 10-year business plan and ...\n\n\nJun 1, 2007 Transmission & Distribution World\n\n\n\nTVA board adopts 10-year Strategic Plan\n\n\n\nNORTH MISSISSIPPI The Tennessee Valley Authority (TVA) board has approved the 2007 Strategic Plan, which provides the framework and high-level direction that will guide TVA's strategic decisions for the next decade. After holding nine public meetings throughout the Tennessee Valley, along with employee briefings on a draft plan presented to the board in March, TVA said it strengthened several ...\n\n\nJun 1, 2007 Mississippi Business Journal\n\n\n\nEnergy Bill Compromise Reached\n\n\n\nHouse and Senate leaders said late Thursday night they have agreed on an energy re-structuring bill that they expect to be approved Friday. House Speaker James A. Amann, D-Milford, and Senate President Pro Tem Donald E. Williams Jr., D-Brooklyn, declined to release a detailed summary. Amann called the compromise 'fragile.' 'It's just about baked,' Williams said.\n\n\nJun 1, 2007 Hartford Courant\n\n\n\nFirstEnergy to Install Powerspan's Emission Control Technology\n\n\n\nFirstEnergy Corp. recently announced its plans to install an Electro-Catalytic Oxidation (ECO) system on units 4 and 5 of its R. E. Burger Plant in Shadyside, Ohio. Combined, the units produce 312 megawatts (MW) of electricity, or enough to serve approximately 190,000 homes. ECO is a multipollutant control technology for coal-based electric generating plants that was developed by Powerspan Corp., ...\n\n\nJun 1, 2007 Industry Week\n\n\n\nNorth Dakota regulators OK $250 million wind farm\n\n\n\n-- North Dakota utility regulators have approved a 159 MW, $250 million wind project being developed by FPL Energy, Minnkota Power Cooperative and Otter Tail Power Co. The farm will have 106 wind turbines and will be the largest wind farm in the state to date, covering some 47 1/2 square miles in Cavalier County. FPL officials said construction will start this month and should be completed by the ...\n\n\nJun 1, 2007 Power Engineering\n\n\n\nDNR says university power plant is violating clean air rules, too\n\n\n\nMADISON, Wis. - An aging coal-fired power plant operated by the University of Wisconsin-Madison has violated the Clean Air Act by upgrading its boilers without installing new pollution controls, according to the Department of Natural Resources.The news came just days after the DNR warned the same plant was violating the Clean Water Act by allowing coal runoff to seep into storm sewers that drain ...\n\n\nMay 31, 2007 Rhinelander Daily News\n\n\n\nGroups form alliance for solar / SolarTech will help train installers and facilitate permitting\n\n\n\nHoping to cement the Bay Area's lead as a solar energy center, an alliance of industrial, academic and policy leaders will unveil an organization today, SolarTech, aimed in part at helping homeowners finance solar arrays and at training workers to install them. 'We could need 20,000 to 40,000 workers in the Bay Area alone,' said Tom McCalmont, chief executive of REgrid Power, a solar energy ...\n\n\nJun 1, 2007 San Francisco Chronicle\n\n\n\n\n\nNew Jersey Natural Gas Announces Prices to Remain Stable Going into Next Winter's Heating Season\n\n\n\nWALL, N.J.--(BUSINESS WIRE)--New Jersey Natural Gas (NJNG) today submitted its annual Basic Gas Supply Service (BGSS) filing to the New Jersey Board of Public Utilities (BPU) and announced that natural gas prices for its residential and small commercial customers will remain stable going into the upcoming 2007-2008 winter heating season. Whenever we can hold the line on prices that is good news ...\n\n\nJun 1, 2007 Business Wire\n\n\n\nPSE&G Proposes Modest Increase in Winter Natural Gas Bills\n\n\n\nPublic Service Electric and Gas Co. (PSE&G) today proposed a modest 2 percent increase in residential gas bills effective October 1. The state's largest electric and gas utility proposed the change in its annual gas supply filing with the New Jersey Board of Public Utilities (BPU).     The adjustment is necessary because wholesale supply prices are expected to remain high.\n\n\nJun 1, 2007 PR Newswire\n\n\n\nUSEC Signs Power Contract with TVA\n\n\n\nBETHESDA, Md.--(BUSINESS WIRE)--USEC Inc. (NYSE:USU) has signed a five-year contract with the Tennessee Valley Authority (TVA) for electric power for USECs gaseous diffusion uranium enrichment plant in Paducah, Ky. TVAs board of directors approved the terms of the new power agreement at its board meeting yesterday. The new contract, which replaces a one-year pricing agreement that expires today, ...\n\n\nJun 1, 2007 Business Wire\n\n\n\nMaritimes & Northeast Pipeline Launches Open Season\n\n\n\nAssessment to Determine Interest in Expanding System -- Expandable pipeline is ideally situated to capture new East Coast supply      -- Potential sources include offshore, onshore, and LNG suppliers   -- Seeking customer interest for natural gas transportation in 2010-2012     HALIFAX, Nova Scotia and WALTHAM, Mass., May 31 /PRNewswire/ -- Maritimes & Northeast Pipeline is launching an open ...\n\n\nMay 31, 2007 PR Newswire\n\n\n\nLandmark Decision Orders Delaware Utility To Negotiate Long-Term Purchase Power Agreement From Proposed Offshore Wind Park - the Nation's First\n\n\n\nThe Delaware Public Service Commission and three other state agencies made a landmark decision last week to order Delmarva Power & Light to negotiate a Purchase Power Agreement with Bluewater Wind LLC for what could be the nation's first offshore wind park. Bluewater Wind proposed a 600 megawatt (MW) wind park consisting of 200 3-MW turbines located 11.5 - 17.3 highway miles off of  the Delaware ...\n\n\nMay 31, 2007 PR Newswire\n\n\n\nThe US is the World's Second Largest Producer of Copper and Gold, Exporting Over $26 Billion Worth of Minerals and Materials a Year\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c58678) has announced the addition of Analyzing the Mining Industry in the United States to their offering. The United States mining industry is an important contributor to the nations economy and employs over millions of workers in this great endeavor to utilize the nations resources for growth and ...\n\n\nJun 1, 2007 Business Wire\n\n\n\nMike Cherry Joins ARSC as VP-Marketing, HydraStax(R) Rollout First Priority\n\n\n\nAmerican Security Resources Corporation (OTCBB: ARSC) announced today that Mike Cherry, founder of Computer Automation  American Security Resources Corporation (OTCBB: ARSC) announced today that Mike Cherry, founder of Computer Automation Systems, Inc., predecessor company to ARSC, has rejoined ARSC as Vice President of Marketing to develop the sales and distribution channels for all Company ...\n\n\nJun 1, 2007 Internet Wire\n\n\n\nNew Era in U.S. Electricity Industry Starts June 18\n\n\n\nAs of June 18, 2007, U.S. utilities and other bulk power industry participants that violate any requirements of 83 reliability standards will face enforcement actions by the North American Electric Reliability Corporation (NERC) under federal law, NERC president and CEO Rick Sergel said today. The electricity industry has spent years preparing for this new era in which compliance with reliability ...\n\n\nJun 1, 2007 PR Newswire\n\n\n\n\n\nANSI Seeks Comments on Proposal for New ISO Field of Activity\n\n\n\nThe  (DoE) has submitted a proposal to the American National Standards Institute (ANSI) for a new  (ISO) field of technical activity on the subject of energy management systems standards (MSS). According to the DoE proposal, the growing global constraints on energy supply and the significance of energy efficiency in mitigating greenhouse gas emissions deem advancements in energy management system ...\n\n\nMay 31, 2007 American National Standards Institute\n\n\n\nAfter Months of Increases, NorthWestern Lowering Rates in July\n\n\n\n- 3:28 p.m. HELENA, Mont. (AP) - NorthWestern Energy said it will slightly reduce its Montana residential electrical rates in July, after gradually increasing its rates over the past year in anticipation of the end of a contract with PPL Montana that would lead to higher prices. 'We've been adjusting for the higher cost of (the) new portfolio over the past several months, which has created a ...\n\n\nJun 1, 2007 Canadian Business Magazine\n\n\n\nIllinois lawmakers to continue debate on electric rate relief\n\n\n\nLexington, Kentucky (Platts)--1Jun2007 Illinois lawmakers were unable to reach a last-minute electric rate relief solution for millions of customers late Thursday night and has moved into overtime. Scheduled to adjourn at midnight Thursday, the spring legislative session was continued through June after a furiously sought 11th-hour agreement eluded lawmakers, Commonwealth Edison, Ameren and the ...\n\n\nJun 1, 2007 Platts\n\n\n\nUS' Orion Ethanol, GreenHunter Energy to merge in $150 mil deal\n\n\n\nOrion Ethanol and alternative energy company GreenHunter Energy have agreed to merge in a stock-for-stock transaction valued at around $150 million, the companies said early Thursday. Based in Grapevine, Texas, GreenHunter Energy was formed in 2005 and has a portfolio of alternative and renewable-power projects, including wind, biomass, methanol and biodiesel facilities, along with six wind farm ...\n\n\nMay 31, 2007 Platts\n\n\n\nEntergy: Finding of Tritium in Indian Point Sewage Was Incorrect\n\n\n\n- 3:43 p.m. BUCHANAN, N.Y. (AP) - The lab results that showed radioactive tritium in sewage from the Indian Point nuclear power plants last month were incorrect 'false positives' and follow-ups have determined that there is no contamination, the plants' owner said Friday. Entergy Nuclear also said it has found no tritium above normal levels at the sewage plant in Buchanan or anywhere else outside ...\n\n\nJun 1, 2007 Canadian Business Magazine\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nSpain Energy Sector Outlook Report Helps Clients to Analyze the Leading-Edge Opportunities Critical to the Success of Energy Industry in Spain\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c58658) has announced the addition of Spain Energy Sector Outlook to their offering. This report on 'Spain Energy Sector Outlook' provides extensive research and objective analysis of Spanish Energy Industry. This report helps clients to analyze the leading-edge opportunities critical to the success ...\n\n\nJun 1, 2007 Business Wire\n\n\n\nRWE Power to invest 100m in Polish wind farms\n\n\n\n- RWE Power, in cooperation with its Polish partner, Polish Energy Partners, is to build two wind power plants with an installed capacity of 70 MW at two selected locations in Tychowo, West Pomerania, and Suwalki, Masuria. To implement this plan, two project companies will be acquired in which RWE Power will have a stake of 70 per cent and PEP a stake of 30 per cent.\n\n\nJun 1, 2007 Power Engineering\n\n\n\nBush calls for summit on greenhouse gases\n\n\n\n- The Associated PressWASHINGTON &#151; Under international pressure to take tough action against global warming, President Bush on Thursday called for a summit of the United States and other nations that create the most greenhouse gases.The goal: Set a long-term global strategy for reducing emissions, and counter allegations that the United States is foot-dragging.The White House said the ...\n\n\nJun 1, 2007 Portland Press Herald\n\n\n\nArgentina Cold Snap Causes Energy Woes\n\n\n\nBUENOS AIRES, Argentina (Map, News) - A cold snap in Argentina led to electricity and natural gas shortages this week, idling factories and taxis and causing sporadic blackouts in the capital. Beset by the coldest May since 1962, millions of residents fired up space heaters, straining Buenos Aires' electrical grid for three nights and forcing authorities to slash power supply nationwide and ...\n\n\nJun 1, 2007 San Francisco Examiner\n\n\n\nGermany's Largest Power Supplier Will Halve Carbon Emissions By 2030\n\n\n\n-- E.ON, the biggest power supplier in Germany, plans to reduce its carbon emissions to half of their 1990 levels by 2030, chief executive Wulf Bernotat said on May 31. 'Our ambitious target is to reduce our CO2 (carbon dioxide) emissions to roughly 0.36 tons per megawatt-hour by 2030, 50% less than in 1990,' Bernotat said. 'Along with a massive expansion of our renewables capacity, we plan to ...\n\n\nJun 1, 2007 Industry Week\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}