{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "4/10 815p Update: Shuttle launch target now June 8", "body": "\n\n\n\n\n4/10 815p Update: Shuttle launch target now June 8\n\n\n\n=================================\n\nCBS NEWS Coverage of STS-117\n\nCBS NEWS STS-117 STATUS REPORT: 08\nPosted: 08:00 p.m. EDT, 04/10/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-05 (03/15/07): Tank assessment continues; meeting next week to discuss options\n   SR-06 (03/21/07): NASA holds off on tank decision; still hopeful for May launch\n   SR-07 (04/05/07): NASA managers order shuttle propulsion system inspections\n   SR-08 (04/10/07): NASA hopes to launch Atlantis, with repaired fuel tank, around June 8\n\n=================================\n\n08:00 p.m., 04/10/07, Update: NASA hopes to launch Atlantis, with repaired fuel tank, around June 8\n\nLaunch of the shuttle Atlantis on a hail-delayed flight to the international space station is slipping to no earlier than June 8, officials said today, to give engineers more time to repair damaged foam insulation on the ship's external fuel tank.\n\nThe decision was made after assessing the progress of repairs to date and extensive testing and analysis to evaluate how those repairs will stand up to the thermal and aerodynamic rigors of launch. While agency managers were forced to give up any hope of launching before the May 21 end of the current launch window, the assessment showed it made more sense to stick with the current tank and launch in early June than it did to switch to a new tank.\n\n\"If we continue at this pace of repair, we should be looking at a vehicle rollout to the launch pad perhaps as early as May 6 and launch that would come ... no earlier than June the 8th,\" said shuttle Program Manager Wayne Hale. \"What we're doing, of course, is letting the work drive the schedule instead of the other way around. We are proceeding with a great deal of caution.\"\n\nHale said NASA hopes to launch the shuttle Endeavour on the next flight in the sequence as early as Aug. 5 and, if no major problems develop, two more flights in October and December.\n\n\"We sent out the potential manifest to review to all the parts of the shuttle program,\" Hale said. \"We are going to come back Monday afternoon, April 16, and review what people think of that. But I will tell you it depends entirely on when we get done with these ET repairs and launch STS-117. I mean, that's the first part of flying the rest of the flights this year. I would tell you that flying four flights is not outside the realm of possibility, but we want to do this in a safe and orderly manner and we'll just see how it works out.\"\n\nNASA managers had hoped to launch Atlantis on mission STS-117, the first of five planned 2007 shuttle missions, March 15. But during a freak storm that thundered over pad 39A on Feb. 26, the shuttle's external tank was blasted by hail, suffering thousands of pits and gouges in its foam insulation. Wind gusts reached 62 knots and hail up to 1.5 inches in diameter was found at the pad.\n\nAtlantis, shielded by moveable weather protection panels, was unscathed. But NASA managers ultimately decided to move the shuttle back to the Vehicle Assembly Building for detailed inspections and, if possible, repairs.\n\nAs it turned out, most of the damage was restricted to the upper liquid oxygen section of Atlantis's tank. Only a handful of dings were found lower down on the hydrogen section and while two dozen heat shield tiles on the orbiter were scraped by hail that worked its way behind the weather protection panels, detailed inspections show the ship's critical carbon composite wing leading edge panels and nose cap were undamaged.\n\nJohn Honeycutt, deputy manager of the external tank project, said today some 2,664 areas of damage requiring repair have been identified. Two areas, one near the tip of the tank that had between 1,000 and 1,600 hits and the other lower down on the side of the oxygen tank with 200 or so tightly packed impact sites, were so heavily pitted that engineers opted against individual repairs.\n\nInstead, the damaged foam will be sanded down and fresh insulation will be sprayed on by tank engineers. About 700 dings and pits will be fixed by boring them out and pouring in fresh foam. Honeycutt said about half of those repairs have been completed to date. The remainder of the damage will be fixed by so-called \"sand-and-blend\" techniques or simply flying as is.\n\nFoam sprays normally are carried out robotically at Lockheed Martin's Michoud Assembly Facility in New Orleans. The repair sprays will use a different type of foam and it will be applied manually. These are \"non-standard\" repairs and extensive testing was ordered to make sure the foam will provide the proper pre-launch insulation and also stand up to the rigors of launch without shedding any debris that could damage the shuttle's heat shield.\n\nToday, managers concluded the engineering team has a reasonable chance of completing the repairs and getting Atlantis off around June 8. Hale said recently ordered inspections of the shuttle's main propulsion system fuel lines will be completed under the umbrella of the external tank work.\n\n\"The repairs as they're tracking today, leading to a rollout about the fifth or sixth of May - and again, that's going to depend on how we do with the repairs - but assuming we get out then, we could not launch within the May window, which closes on May 21,\" Hale said. \"That pushes us into the June 8 window.\n\n\"If we were to decide today to switch to the new tank (slated for use by Endeavour) we could launch no earlier than June 19. ... We'd like to avoid ... all the effort that's involved in switching tanks. So as long as we're on a good path to repair the hail-damaged tank, we should stay with it.\"\n\nAssuming the repair work goes as planned and the ongoing analysis shows the repairs will, in fact, be safe, liftoff of STS-117 will be targeted for around 7:34 p.m. on June 8. If that schedule holds up, the shuttle would dock with the international space station June 10, spacewalks would be carried out June 11, 13 and 15, with landing on tap the afternoon of June 19. Launch times for subsequent days in June are posted on the CBS News STS-117 Quick-Look page:\n\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nThe shuttle Endeavour, which had been scheduled for launch in June, will instead slip to around Aug. 5.\n\nEndeavour's crew includes teacher-astronaut Barbara Morgan and Clay Anderson, who will replace station crew member Sunita Williams. Williams was launched to the outpost Dec. 9 aboard the shuttle Discovery and if she remains in space until mid August, she will set a new U.S. single-flight duration record of some 250 days.\n\nBill Gerstenmaier, NASA's chief of manned spaceflight operations, said today NASA is looking at what might be needed to rotate Williams home early aboard Atlantis if the flight faces any additional delays. But barring major problems, he said, she will come home as planned aboard Endeavour.\n\nFor her part, Williams said today she was not overly concerned about increased exposure to space radiation or any other aspects of a longer-than-planned stay in space.\n\n\"Well, you know, I've been in constant contact with my flight surgeon and he's keeping me up to date on the concerns we have,\" she told reporters during a news conference earlier today. \"I think eight months is fine from all the indications I've heard, we're at a time right now where we're not getting too much extra radiation from activity on the sun. So I think right now, all indications say that's no problem.\"\n\nWilliams' current crewmates - Expedition 14 commander Mike Lopez-Alegria and flight engineer Mikhail Tyurin - are scheduled to return to Earth April 20, along with U.S. space tourist Charles Simonyi, aboard a Russian Soyuz spacecraft. Lopez-Alegria and Tyurin were launched Sept. 18 and on landing, Lopez-Alegria will set a new U.S. single-flight endurance record of 214 days.\n\nLaunch dates for downstream shuttle flights are still under discussion and will be assessed during a shuttle/station management review April 16.\n\nBut a proposed manifest change would move the third flight in the sequence to just after a Russian Soyuz flight in mid October and delay a high-profile flight to launch the European Space Agency's Columbus module to early December. Again, those dates will require agreement by shuttle and station managers.\n\nIn the meantime, Hale said, Atlantis's crew remains in good spirits. Moving the flight to June 8 means what had been a deep overnight mission will instead be conducted during afternoon and evening hours U.S. time. Here is a summary timeline (in mission elapsed time and EDT). A more detailed flight plan is posted on the Quick-Look page.\n\nDATE/EDT.......DD...HH...MM...EVENT\n\n06/08/07\nFri 07:34 PM...00...00...00...STS-117 Launch\n\n06/09/07\nSat 01:34 AM...00...06...00...Crew sleep begins\nSat 09:34 AM...00...14...00...Crew wakeup (begins flight day 2)\nSat 01:59 PM...00...18...25...Heat shield survey begins\n\n06/10/07\nSun 01:34 AM...01...06...00...Crew sleep begins\nSun 09:34 AM...01...14...00...STS crew wakeup (FD-3)\nSun 04:15 PM...01...20...41...Atlantis docks with space station\nSun 06:34 PM...01...23...00...S3/S4 power truss unberthing\n\n06/11/07\nMon 01:34 AM...02...06...00...STS crew sleep begins\nMon 09:34 AM...02...14...00...STS crew wakeup (FD-4)\nMon 02:09 PM...02...18...35...Power truss bolted in place\nMon 03:24 PM...02...19...50...EVA-1: Airlock egress\nMon 08:04 PM...03...00...30...Photo-voltaic radiator deploy\nMon 09:49 PM...03...02...15...EVA-1: Airlock repressurization\n\n06/12/07\nTue 01:34 AM...03...06...00...STS crew sleep begins\nTue 09:34 AM...03...14...00...STS/ISS crew wakeup (FD-5)\nTue 01:04 PM...03...17...30...1A mast deploy to 100 percent\nTue 02:34 PM...03...19...00...3A mast deploy to 100 percent\nTue 04:14 PM...03...20...40...Crew off duty time\n\n06/13/07\nWed 01:34 AM...04...06...00...STS crew sleep begins\nWed 09:34 AM...04...14...00...STS crew wakeup (FD-6)\nWed 11:19 AM...04...15...45...P6-2B retraction attempt\nWed 02:34 PM...04...19...00...EVA-2: Airlock egress\nWed 03:14 PM...04...19...40...EVA-2: P6-2B retraction attempt\nWed 08:59 PM...05...01...25...EVA-2: Airlock repressurization\n\n06/14/07\nThu 01:04 AM...05...05...30...STS crew sleep begins\nThu 09:04 AM...05...13...30...STS crew wakeup (FD-7)\nThu 12:04 PM...05...16...30...P6-2B retraction window opens\nThu 03:29 PM...05...19...55...P6-2B retraction window closes\n\n06/15/07\nFri 01:04 AM...06...05...30...STS crew sleep begins\nFri 09:04 AM...06...13...30...STS crew wakeup (FD-8)\nFri 02:04 PM...06...18...30...EVA-3: Airlock egress\nFri 08:29 PM...07...00...55...EVA-3: Airlock repressurization\n\n06/16/07\nSat 12:34 AM...07...05...00...STS crew sleep begins\nSat 08:34 AM...07...13...00...STS crew wakeup (FD-9)\nSat 11:34 AM...07...16...00...Crew off duty time\nSat 06:49 PM...07...23...15...Joint crew news conference\nSat 07:49 PM...08...00...15...Farewell ceremony\nSat 08:04 PM...08...00...30...Egress and hatch closure\n\n06/17/07\nSun 12:04 AM...08...04...30...STS crew sleep begins\nSun 08:04 AM...08...12...30...STS crew wakeup (FD-10)\nSun 12:12 PM...08...16...38...Atlantis undocks from station\nSun 04:14 PM...08...20...40...Heat shield survey begins\nSun 10:49 PM...09...03...15...STS crew sleep begins\n\n06/18/07\nMon 07:04 AM...09...11...30...STS crew wakeup (FD-11)\nMon 10:34 PM...10...03...00...STS crew sleep begins\n\n06/19/07\nTue 06:34 AM...10...11...00...Crew wakeup (FD-12)\nTue 01:41 PM...10...18...07...Deorbit ignition (orbit 171)\nTue 02:43 PM...10...19...09...KSC Landing (approximate)\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}