{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Leigh Driver\" <wufescueladeastrologiapab@escueladeastrologia.com>", "subject": "Women will love your new figure", "body": "\nBe leaner and slimmer by next week\n\n\n\n\n\nAnatrim – The latest and most delighting lose flesh product available – As were seen on BBC\n\n\n\nDid you realize superfluous body kilograms kill very much people every year? We know you hate the unsightly appearance of people like those and the low status they obviously have in modern society. \n\nOr, maybe, you can’t withstand a siege of baneful eating habits of yours. If you think it sounds familiar, then we got something for your consideration!\n\n\n\n\n\nHere Anatrim comes, the new product for the elimination of your body’s extra weight. The most astonishing thing is that Anatrim improves the quality of your life, repressing the feeling of hunger and always cheering you up. Look at some e-mails from our customers:\n\n\n\n\n\n\"It is wonderful! \n\n\nI stopped watching TV continually and stuffing myself with food \n\n\nI became keen on doing exercise.\n\n\n\n\n\n\n Anatrim placed me back on the right track.\n\n\n I have a great form now and lots of men devour me with their eyes!\"\n\n\n\n\n\n\nVictoria K., Boston\n\n\n\n\n\n\n\"Passive weight burning was of no result to me. I could not restrain my ravenous appetite. \n\n\nOnce I heard about Anatrim from my very best friend and I was really impressed at the information.\n\n\n I had tried to take it, and my wife told me I had changed for the better since then, 5 months later. \n\n\n27 pounds have gone away and I keep still losing them! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nMikkey Fox, Bellevue WA\n\n\n\n\n\nAnatrim helps you to realize you doesn’t have such a great need for the constant eating. It raises your spirit, provides you with extra energy, and attacks unnecessary kilos. All thanks to its powerful distinguished formula!!\n\n\n\nWorm out more!\n\n\n\n"}