{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nMonday, 21 May, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nMorgan agrees takeover of Wolves\nSir Jack Hayward is to sell 100% of the shares in Wolves to Steve Morgan for only £10 - on the condition £30m is invested in the club.\n\n\n\n \nRobson to be named Blades manager\nSheffield United will name Bryan Robson as their new manager, according to BBC Five Live.\n\n\n\n \nEriksson backs England to qualify\nSven-Goran Eriksson talks about England's past and future and his treatment by the media in an interview with BBC One's Inside Sport.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nHarrington eyes Wentworth bonus\nNewly-crowned Irish Open champion Padraig Harrington is targeting a £680,000 bonus this week in the BMW PGA Championship.\n\n\n\n \nHarrington claims Irish Open win\nPadraig Harrington becomes the first home winner of the Irish Open in 25 years after beating Bradley Dredge in a play-off.\n\n\n\n \nJohnson captures Atlanta Classic\nMasters champion Zach Johnson wins a sudden-death play-off against Japan's Ryuji Imada to take the Atlanta Classic in Georgia.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nHamilton plays down Monaco hopes\nLewis Hamilton says he is \"realistic\" about winning the Monaco Grand Prix on his Formula One debut in the Principality.\n\n\n\n \nChina's F1 track chief dismissed\nThe head of China's Formula One track and two others are fired over Shanghai's ongoing pension corruption scandal.\n\n\n\n \nVermeulen wins in rainy Le Mans\nSuzuki's Chris Vermeulen wins a rain-swept French MotoGP at Le Mans.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nHamilton plays down Monaco hopes\nLewis Hamilton says he is \"realistic\" about winning the Monaco Grand Prix on his Formula One debut in the Principality.\n\n\n\n \nChina's F1 track chief dismissed\nThe head of China's Formula One track and two others are fired over Shanghai's ongoing pension corruption scandal.\n\n\n\n \nMosley steps up push for green F1\nFormula One boss Max Mosley is proposing a raft of changes to help accelerate the adoption of \"green\" technology.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nPavey races to Manchester victory\nBritain's Jo Pavey produces a world-class performance to win the Great Manchester Run.\n\n\n\n \nSayers sets new UK javelin record\nGoldie Sayers breaks the British javelin record with a throw of 65.05m at the Loughborough International meeting.\n\n\n\n \nGB trio shine in Great Wall test\nBritain has three top-10 finishers in China's Great Wall Marathon as Salvador Calvo smashes the record in one of the world's toughest 26-mile races.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nNapolitano dashes to Giro victory\nDanilo Napolitano wins a mass sprint to claim the ninth stage of the Giro d'Italia.\n\n\n\n \nLandis denies doping at hearing\nFloyd Landis again denies taking performance-enhancing drugs at a hearing in Malibu.\n\n\n\n \nArvesen claims eighth Giro stage\nNorwegian Kurt Asle Arvesen snatches the eighth stage of the Giro d'Italia beating world champion Paolo Bettini in a sprint finish.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nVictory is sweet for Pete\nPete Doherty scores the winner as his side win football event\n\n\n\n \nComment: Cup of little cheer\nRobbo gives his verdict on \"dull\" FA Cup final \n\n\n\n \nReview of the week\nMovie legend to strip if team go up, as the hunt for Mourinho's dog goes on\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}