{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "heterodox: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Thursday, July  5, 2007\nheterodox \\HET-uh-ruh-doks\\, adjective:\n1. Contrary to or differing from some acknowledged standard, especially in church doctrine or dogma; unorthodox.\n2. Holding unorthodox opinions or doctrines.\nThey fight with members of other faiths, who seem to challenge their claim to a monopoly of absolute truth; they also persecute their co-religionists for interpreting a tradition differently or for holding heterodox beliefs. -- Karen Armstrong, Islam: A Short History\nMost of the Kurds were Sunni Muslims, but perhaps a quarter or a third adhered to heterodox varieties of Islam that preserved traces of earlier religions. -- Susan Meisalis, Kurdistan: In the Shadow of History\nMoreover, heterodox behaviour -- in the form of eccentric chess moves -- was even encouraged, if it led to good results. -- Jon Speelman, \"Chess\", Independent, October 24, 1998\nMr. Buckley is an American exotic of the far right, who wins some sympathy for his frankness and boldness since, in this sorry world, the heterodox are always laughed at whether right or left. -- Richard L. Strout, \"All That Is Out of Joint and Needs Setting Right\", New York Times, April 28, 1963\nHeterodox comes from Greek heterodoxos, \"of another opinion,\" from hetero-, \"other\" + doxa, \"opinion,\" from dokein, \"to believe.\"\nDictionary.com Entry and Pronunciation for heterodox\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-10186071-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}