{"category": "spam", "to_address": "captains@flax24.uwaterloo.ca", "from_address": "\"Kerry Dotson\" <wufescsystemworkspab@escsystemworks.com>", "subject": "Healthy living with less fat", "body": "\nSay goodbye to extra pounds\n\n\n\n\n\nAnatrim – The latest and most exciting product for weighty people is now easily available – As could be seen on BBC\n\n\n\nDo you realize that redundant body kilograms kill a lot of people for every new year? We believe you hate the unattractive appearance of people like those and the social prejudice against them. \n\nMoreover, you can’t resist an assault of ruinous eating habits of yours. If it all sounds familiar, then we have something for you!\n\n\n\n\n\nHere comes Anatrim, the later product for the elimination of your body’s extra weight. The amazing thing about Anatrim is it raises the quality of your life, repressing the feeling of hunger and giving you better spirit. Look at what people write on this product:\n\n\n\n\n\n\"This is wonderful! \n\n\nInstead of watching TV and eating anything close at hand \n\n\nI became rather more interested in doing sport.\n\n\n\n\n\n\n Anatrim placed me back on the right path.\n\n\n I have a great shape now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nSilvia D., San Diego\n\n\n\n\n\n\n\"I tried some passive weight burning, but all came in vain. I could not restrain my ravenous hunger. \n\n\nOne day I heard on Anatrim in the media advertisement and it brought a great influence on me.\n\n\n I had tried using it, and my wife told me I look very good now, 4 months later. \n\n\n27 pounds have gone away and I keep losing them! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nSteve Burbon, Las Vegas\n\n\n\n\n\nAnatrim gives you an opportunity to understand you got no such great need for the constant eating. It lifts your mood up, supplies you with additional energy, and attacks useless kilos. All thanks to its powerful comprehensive formula!!\n\n\n\nWorm out more useful information!\n\n\n\n"}