{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "SM eNews <SMeNews@harmshalts.net>", "subject": "Alert! Auction Firm OTC RCAU Receives $7.25 Target", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVisit Them On The Web\nLearn more about Rocket City Auto \n\nLearn more about CompleteAuto \n\nLearn more about  IT Lagoon \n\nLearn more abouteAutoDrop\n\nMonday April 16th,\nYesterday's Rocket City News Includes a $7.25 Target Price, a Dividend to Investors and the Next Evolution in Automotive and Online Auction Services!\nThere was a lot of great news from Rocket City Automotive Group, Inc. (OTC: RCAU) yesterday! The company first announced that it continues to break new ground within the automotive and online auction industries by offering eAutoDrop to automotive retailers around the country. Following that press release, the company announced that it will be paying a ten percent (10%) stock dividend on Monday, May 28, 2007 to all shareholders of record on April 20, 2007. And finally, that the company has received a $7.25 from Market Advisors Research.\n\n\n\n\n\n\n\n\n\n\n\nAccording to the first press release, Marketed as a stand alone franchise offering and compliant with UFOC and FTC guidelines, eAutoDrop, an RCAU subsidiary, will give dealers around the country the ability to offer full scale online auction services on behalf of the retail consumer, thereby providing a entirely new retail service and revenue stream to the marketplace.\n\neAutoDrop will be marketed to the nearly 400-strong database of existing CompleteAuto/RCAU clientele. In addition to its own database of clients, RCAU has agreements in place with several automotive service companies that allow for the direct marketing to an additional 2,300 dealers across the country. Previously forecasted dealer targets for the CompleteAuto Company were concluded with a projection of nearly 5,300 new dealer contracts by the end of the 2008 year. These projections provide the eAutoDrop Company access to an estimated 5,900 total dealer contracts.\n Highlights from the Market Advisors Report include:\n-  The company recently announced that it has elected to retire a large majority of insider stock. This comes from stock held by insiders of RCAU and not by current outside shareholders. This is very positive and increases non-affiliate shareholder value.\n\n- RCAU's vehicle listing solution is employed by Dodge, Chrysler and Jeep dealers across the country. This renders recurring monthly compensation to the CompleteAuto Company.\nRCAU began trading on March 26th at $2.00.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCOMPLETEAUTO has developed state-of-the-art listing software that is the COMPLETE answer to all your automotive auction needs. There is a vast array of features and options that easily create your listing, manage your auctions and close your sale!\n\nCompleteAuto offers eAutoDrop Center licensing agreements only to licensed dealerships to assist private consumers with the sale of their personal vehicles on eBay Motors.\n\n COMPLETEAUTO has developed state-of-the-art listing software that is the complete answer to all your automotive auction needs. There is a vast array of features and options easily at your disposal, from creating the listing, managing the auction to closing the sale.\n\nCreating Listings:\nThe company offers tools such as custom templates, photo managers, visual condition reports, vin explorer, sound upload options and description builders to help you create the perfect listing.\n\n Auction Management\nCOMPLETEAUTO offers management tools like inventory management, integrated email and live chat.\n\n Closing Sales\nOnce a sale has closed COMPLETEAUTO offers buyer assistance links, auto report integration links and automated report generation.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRCAU was formed to acquire, manage supervise and operate corporations specializing in eBay, eBay Motors services, eCommerce, software development and retail automotive operations. RocketCity holdings include IT Lagoon LLC, eAutoDrop, Inc. and CompleteAuto which functions as a certified solution provider for eBay Motors and offers proprietary software, personnel and design solutions to hundreds of automotive dealerships around the country. RocketCity believes in the enormous growth opportunities in the $1 trillion automotive retailing industry. The experienced management team will continue to execute strategic initiatives to maximize operations in this marketplace with their products and services.\n\n\n\n\n\nIT Lagoon, LLC\n\nRocket City\n\neAutoDrop\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYOU BRING IT: Bring your vehicle to an eAutoDrop location. The company will take professional photographs of your vehicle, and provide expert advice, so you get the most for your vehicle!\n\neAutoDropLISTS IT: Using the company's state-of-the-art software, the company will create an attractive, professional listing that will get your vehicle noticed. The company's beautiful photo layouts and visual condition report give potential buyers an accurate representation of your vehicle. The company will also write a detailed description of your vehicle's features and options, verified by our powerful VIN exploder. When the listing is complete, it is uploaded to eBay Motors, the #1 automotive site on the internet.\n\neAutoDrop SELLS IT: The company will handle all aspects of the sales process for you, including contacting potential buyers and closing the sale. The company can assist the buyer in arranging pickup, or shipping, of the vehicle. With the company's high feedback scores and industry expertise, the company will get top dollar for your vehicle.\n\n\n\n\n\n\n\n\n\n\nRECENT NEWS\n04/16/07 Rocket City  Receives $7.25 Price From Market Advisors Research. Detailed Analyst Report Released.\n04/16/07 Rocket City Launches the Next Evolution in Automotive and Online Auction Services with eAutoDrop. Innovative Franchise Offering an Industry First. Potential Two Year Revenue Projections Reaching Nearly $150M.\n04/13/07 Rocket City Announces Issuance of Stock Dividend\n04/12/07 RCAU Board of Directors Makes Preliminary Vote to Retire Large Majority of Insider Stock.\n04/12/07 RCAU Announces: Dodge, Chrysler and Jeep Dealers Nationwide Select the CompleteAuto Software. Complete Auto Signs Software Contracts With 27 Dodge, Chrysler and Jeep Dealers Resulting in Over 5,200 Vehicle Listings.\n04/11/07 RCAU Announces: CompleteAuto Software Campaign Showing Notable Growth. Contracted Dealers Increased over 600 % Resulting in an Increase of 3,400% in Vehicle Listings since It's Launch. Over 5,500 New Dealer Contracts Estimate\n04/10/07 Rocket City/ Automotive Group  Corners the Lucrative European Auto Market by Providing the Only Listing Solution in Europe. Revenue Possibilities Three Times the Size of the U.S. Market. Frankfurt, Germany Offices Now Open.\n04/09/07 RCAU Announces: CompleteAuto Launches Listing Software Into the $15 B Motorcycle Industry. World's Largest Full-Line Honda Motorcycle Dealer First to Adopt New Listing Solution.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}