{"category": "ham", "to_address": "perl6-language@perl.org", "from_address": "\"Chas Owens\" <chas.owens@gmail.com>", "subject": "Re: Web Module (Was: Perl6 new features)", "body": "On 6/22/07, Daniel Hulme  wrote:\n> On Fri, Jun 22, 2007 at 02:07:35PM -0400, Chas Owens wrote:\n> > On 6/22/07, chromatic  wrote:\n> > >I also like to proceed from the assumption that the only core modules\n> > >should be those required to install other modules.\n>\n> > Please, god, no.  Or at least make two distributions: Bare Perl 6 and\n> > Perl 6.  Many companies have a \"Only Core Perl\" policy.  They refuse\n> > to install CPAN modules because \"We don't trust them\".  Yeah, it is\n> > stupid, but as a contractor I have limited ability to fight their\n> > ignorance.\n> Sounds like a bare Perl 6 distribution might be just what you need to\n> get them to weaken their restriction to \"only modules with a good\n> cpanrating\" or, best of all, \"evaluate each module according to its\n> merits.\" Well, actually, I'm not sure that last one would be best, as\n> getting each module evaluating would almost inevitably entail getting\n> five or six high-up people together, none of whom have any interest in\n> you getting your job done, and who probably hate each others' guts, and\n> getting them to commit to some form of responsibility-generating paper-\n> trail.\n>\n> Call me cynical if you like, but I prefer to call it, \"experienced.\"\n\nMost of the time the policy is enacted by lower-case-l lazy sysadmins\nwho can't be bothered to type\n\nperl -MCPAN -e install Foo::Bar\n\nMy normal route around them is to install the module into the home\ndirectory of the user who is going to run the script, but I have had\ndifficulty with this before when it comes time to move to production:\n\"Where is the code review for that code?\".  My answer of \"where is the\ncode review for that (often open source) database install you just\ndid?\" doesn't tend to hold the weight I wish it did.  For some reason\nbinary blobs make some types of sysadmins feel all fuzzy and warm\ninside.\n\nAs to whether a bare bones Perl distribution would help or hinder the\nprocess of getting people to accept modules, well, all I can say is\nthat it is hard enough to get Perl into some companies.  If I had to\ntell them \"Oh, and we have to install all of these modules before we\ncan start coding.\" their response would likely be \"Java already can do\nthat.  Use it instead.\".  Yes, I have been told that before (related\nto some XML stuff).\n\n"}