{"category": "spam", "to_address": "smiles@flax9.uwaterloo.ca", "from_address": "THE NATIONAL ECONOMIC INTELLIGENCE COMMITTEE <contact6@ozu.es>", "subject": "PAYMENT PRE - ADVICE (RECONFIRMATION OF YOUR  ACCOUNT DETAILS)", "body": "\n     \n                   THE NATIONAL ECONOMIC INTELLIGENCE COMMITTEE \n                               The Presidency, Federal Secretariat Complex,\n                                         Plot 101 Federal Secretariat Drive Ikoyi,\n                                                    Lagos  Laison office  \n                                                   Lagos -Nigeria \n                     FROM: PROFESSOR IBRAHIM AYAGI CHAIRMAN (NEIC)\nTO: THE BENEFICIARY\n\n                                                    PAYMENT PRE - ADVICE\n \nSEQUEL TO YOUR NON RESPONSE, BY THE AUTHORITIES OF THE PRESIDENCY, AND IN LINE WITH THE ENABLING DEGREE 512 \"A\" IN CONSULTATION WITH THE RELEVANT BODIES, THE CENTRAL BANK OF NIGERIA (CBN), THE NATIONAL ECONOMIC INTELLIGENCE COMMITTEE (NEIC) AND THE FEDERAL MINISTRY OF FINANCE (FMF) WE HAVE RESOLVED THAT ALL OVERDUE PAYMENTS BE RELEASED THIS QUARTER IN ABSOLUTE OBEDIENCE TO THE I.M.F AND WORLD BANK MANDATORY CONDITIONALITIES OF SERVICE TO OUR FOREIGN CAPITAL DEBTS. BE INFORMED THAT YOUR FUND IS APPROVED FOR REMITTANCE.\n\nHOWEVER, REPORTS REACHING THIS OFFICE FROM THE VERIFICATION UNIT OF THE CBN INDICATES THAT A SWISS CITIZEN NAME PHILIPMAN JOHN IN COLLABORATION WITH SOME NIGERIAN REPRESENTATIVES HAVE JOINTLY REQUESTED FOR A CHANGE OF BENEFICIARY'S ACCOUNT ON THE SAID APPROVED FUND, BUT WITHOUT VALID POWER OF ATTORNEY WITH REGULAR SIGNATURE.  FOR THIS REASON, YOU ARE REQUESTED TO URGENTLY CONFIRM AS STATED BELOW:\n\nTHAT THE APPLICATION FOR CHANGE OF YOUR ACCOUNT NUMBER HAS BEEN AUTHORIZED BY YOU. THAT THE APPROVED CONTRACT FUND BE REMITTED INTO A NEW ACCOUNTANT NO: 90-38-003 OF BANQUE CONTO-NALE AT VAUDOSIE IN SWITZERLAND.\n \nIF ALTERNATIVELY YOU NEVER PERMITTED SUCH REQUEST, THEN STATE YOUR OBJECTION AND RESTATE AUTHENTIC RECEIVING BANK ACCOUNT DETAILS, YOUR FULLANMES, COMPANY ADDRESS, PHONE FAX NUMBER  AND ANY OTHER RELEVANT INFORMATION IMMEDIATELY TO THIS OFFICE FOR RECONCILIATION AND RELEASE OF YOUR FUND WITHOUT DELAY.\n\nFINALLY, NOTE THAT INSTRUMENTS OF CREDIT HAVE BEEN RAISED FOR ADOPTION AT DIFFERENT DESIGNATED LIAISON PAYMENT CENTERS PENDING YOUR CLARIFICATION, SINCE THE NATIONAL ECONOMIC INTELLIGENCE COMMITTEE (NEIC) IS READY TO BACK YOU UP WITH YOUR REQUEST ON THIS MATTER.\n\nONCE MORE YOU ARE ADVISED FOR THE INTEREST OF YOUR ESTEEMED PERSON/ FIRM TO CONTACT THIS OFFICE EITHER THROUGH EMAIL  WITHIN 48 HOURS FROM NOW, AS NATIONAL ECONOMIC INTELLIGENCE COMMITTEE (NEIC) WILL NOT BE HELD RESPONSIBLE FOR ANY WRONG TRANSFER.\nI AM AWAITING YOUR  EMAIL.\n \nTHANKS FOR YOUR CO-OPERATION.\n\nYOURS FAITHFULLY,\n\nPROF. IBRAHIM AYAGI \nCHAIRMAN (NEIC\n\n\n\n"}