{"category": "spam", "to_address": "producttestpanel@flax9.uwaterloo.ca", "from_address": "Grant Seekers <Devine@flare.bestmortgageanswer.com>", "subject": "Get Access to Thousands of Grants", "body": "You registered to receive this and similar offers from  on .\n\nURGENT! There Could be BIG changes in your future due to Government\nGrants.\n\nThousands of people receive F R E E MONEY from the US Government every\nmonth in the form of government grants.\n\nAccording to the Government Accountability Office there's over $460\nBillion Dollars Available.\n\nhttp://flare.bestmortgageanswer.com/t/l?h4-uav-1-n75-678d\n\nIf you are an American citizen over the age of 18 you may be eligible\nfor some kind of government grant.\n\nImagine what you can do with $25,000, $100,000 or more!\n\n-Buy a Home\n-Invest in Real Estate\n-Start a Business\n-Get an Education\n\nAND... with Your F R E E  Government Funding CD all you need to do is\nfigure out how much you need and this CD will help you take care of the\nrest.\n\nVISIT HERE TO GET YOUR F R E E CD SHIPPED TODAY!\n\nhttp://flare.bestmortgageanswer.com/t/l?h4-uav-2-n75-678d\n\n\n\n\nYou can stop receiving email from this advertiser by using the link\nbelow.\nor mail to: Ultimate Grant Secrets, Remove Dept, 108 Arapahoe, Evanston,\nWY 82930-4532  678d\n\nIf you'd like to opt-out, please go here:\nhttp://flare.bestmortgageanswer.com/t/l?h4-uav-3-ank-678d\n\nIf you no longer wish to receive these commercial emails, you may remove yourself from our mailing list by clicking here http://flare.bestmortgageanswer.com/remove?r.Devine.12-91d048e-20e1.speedy.uwaterloo.ca.-producttestpanel?r click here or by calling our unsubscribe hotline at 864-752-1051. Please note this phone number is used solely for unsubscribe requests. Please allow up to five business days for your request to be processed.\n\nYou may also contact us by writing to us at our postal address: Montague| 9600 Great Hills Trail, Suite 150 W| Austin, TX 28759\n\n\n\n\n803-790-8381 x262\n3830 Forest Drive, Suite 207\nColumbia , SC 29204\nUSA\n\n\n\n\n"}