{"category": "ham", "to_address": "Andrew <ktwarwic@SPEEDY.UWATERLOO.CA>", "from_address": "\"Organic Consumers Association\" <ronniecummins@organicconsumers.org>", "subject": "Organic Bytes Special Issue: FDA & USDA Declare War on Consumers", "body": "\n\n\n\n\n\nOrganic Bytes: Sustainability News, Alerts and Tips\n\n\n\n\n\n\n\n\n\nHello Andrew,\nORGANIC \n            BYTES #107\n          Health, Justice and Sustainability News Tidbits with an Edge!\n\n4/20/2007\n\nWritten \n            and edited by Craig Minowa and Ronnie Cummins\n\nSafe Unsubscribe: \n          NOTE: \n          This is a special jam-packed issue of Organic Bytes. We are currently \n          facing a barrage of anti-consumer/anti-small farmer regulatory changes \n          proposed by the FDA, USDA, and EPA. If we don’t take action now, \n          Big Food, Big Pharma, and indentured government bureaucrats will continue \n          to restrict our access to healthy foods and natural herbs and medicines, \n          and undermine our inalienable right to know what’s in our food. \n          We encourage you to take the time today to learn more about these issues, \n          and take action. And of course, please forward this newsletter to anyone \n          you think might be interested in these topics. Remember, if you ever \n          have problems with the email version of your Organic Bytes, you can \n          always view a web version here: http://www.organicconsumers.org/organicbytes.cfm \n          Thanks for your support!\n\n\n\nIN \n                THIS ISSUE\n\nALERT: \n                  FDA SEEKS TO REMOVE LABELING REQUIREMENTS \n                  FOR IRRADIATED FOODS \nALERT: \n                  FDA SAYS ALMONDS LABELED AS 'RAW' CAN ACTUALLY BE PASTEURIZED \n                  \nALERT: \n                  NEW PROPOSED USDA ORGANIC REGULATIONS COULD DRIVE THOUSANDS \n                  OF SMALL ORGANIC FARMERS OUT OF BUSINESS \nGOOD \n                  NEWS OF THE WEEK: FDA FORCED TO EXTEND PUBLIC COMMENT \n                  PERIOD ON FOOD FROM CLONES \nALERT:\nFDA RELEASES 'GUIDANCE' DOCUMENT REGARDING \n                  POLICING OF NATURAL HEALTH\nSURVEY \n                  OF THE WEEK: CONSUMER REPORTS SURVEY FINDS MOST U.S. \n                  CITIZENS HEAVILY DISSATISFIED WITH FDA \nTIP \n                  OF THE WEEK: ASK FOR ORGANIC PET FOOD\n\n\n\n\n\n___________________________________\n\n\n\n\n\n \n\n\n\n\nALERT: \n                FDA SEEKS TO REMOVE LABELING REQUIREMENTS \n                FOR IRRADIATED FOODS \nThe Food and Drug Administration \n                (FDA) has proposed new federal regulations that will allow manufacturers \n                and retailers to sell controversial irradiated foods without labeling \n                them, as previously required by law. Consumers are justifiably \n                wary of foods bombarded with nuclear waste or powerful x-rays \n                or gamma rays--since irradiation destroys essential vitamins and \n                nutrients, creates unique radiolytic chemical compounds never \n                before consumed by humans, and generates carcinogenic byproducts \n                such as formaldehyde and benzene. Although irradiation, except \n                for spices, is banned in much of the world, and prohibited globally \n                in organic production, U.S. corporate agribusiness and the meat \n                industry desperately want to be able to secretly \"nuke\" \n                foods in order to reduce the deadly bacterial contamination that \n                is now routine in industrial agriculture and meat production. \n                OCA and other public interest groups have repeatedly pointed out \n                that the best way to reduce or eliminate America's 78 million \n                cases of food poisoning every year would be to clean up the nation's \n                filthy slaughterhouses and feedlots, stop contaminated runoff \n                from intensive confinement feedlots from polluting adjacent farms \n                (as in the recent spinach e-coli outbreak), and to stop feeding \n                animals slaughterhouse waste and manure. Instead, FDA and corporate \n                agribusiness have apparently decided, with the backing of the \n                nuclear power and weapons industry, to take away consumers' rights \n                to know if their food has been irradiated or not. \nLearn more and take action: http://www.organicconsumers.org/rd/irrad-label.cfm\n\n\n\n___________________________________\n\n\n\n\nALERT: \n              FDA SAYS ALMONDS LABELED AS 'RAW' CAN ACTUALLY BE PASTEURIZED \n              \n              Under pressure from industrial agriculture lobbyists, the FDA has \n              quietly approved a new regulation that will effectively end distribution \n              of raw almonds, while putting many family farmers out of business. \n              The rule requires pasteurization of almonds, including organic, \n              yet allows those same almonds to continue to be labeled as \"raw\". \n              Nutritionists point out that raw, organic almonds are far superior, \n              in terms of nutrition, than pasteurized almonds. One of the FDA-recommended \n              pasteurization methods requires the use of propylene oxide, which \n              is classified as a \"possible human carcinogen\" by the \n              International Agency for Research on Cancer and is banned in Canada, \n              Mexico, and the European Union. Organic and family-scale almond \n              farmers are protesting the proposed rule, saying it will effectively \n              put them out of business, since the minimum price for the pasteurization \n              equipment is $500,000. The FDA claims pasteurization is necessary, \n              since there have been two food contamination incidents with raw \n              almonds since 2001. But both of these incidents, in fact, were the \n              result of blatant mismanagement on large industrial-scale almond \n              farms. Take action now to demand that the FDA re-open this proposed \n              rule to public comments: http://www.organicconsumers.org/articles/article_4859.cfm\n\n\n__________________________________\n \n\n\n\n\n\nALERT: \n              NEW PROPOSED USDA ORGANIC REGULATIONS COULD DRIVE THOUSANDS \n              OF SMALL ORGANIC FARMERS OUT OF BUSINESS \n              A controversial new directive from the USDA threatens to deny organic \n              certification to thousands of small organic coffee, tea, banana, \n              rice, sugar cane, cacao and other farmers around the world. The \n              USDA's directive would eliminate the longstanding practice of certifying \n              organic and Fair Trade family farm cooperatives as a group, rather \n              than forcing each coop member to pay for individual certification. \n              Thousands of organic and Fair Trade farming cooperatives around \n              the world have been established over the past few decades to help \n              low-income farmers in financing and marketing, and in acquiring \n              otherwise cost-prohibitive certification for their farms. Most of \n              the world's small-scale organic coffee farmers take part in these \n              cooperatives, so eliminating group certification, will drive thousands \n              of family farmers out of business while giving large-scale commercial \n              coffee plantations a competitive advantage. Though the OCA supports \n              careful monitoring of all organic farms, we are adamantly opposed \n              to the elimination of group certification for low-income farm cooperatives. \n              \nLearn more and take action: http://www.organicconsumers.org/rd/usda-coop.cfm\n\n\n__________________________________\n\n\n\n\n \n\n\n\nGOOD \n              NEWS OF THE WEEK:\n              FDA FORCED TO EXTEND PUBLIC COMMENT PERIOD ON FOOD FROM CLONES \n              Over the past few months, the FDA has received over 100,000 letters \n              from OCA network members and other consumers, rejecting proposed \n              federal regulations that would allow meat, eggs, and dairy products \n              derived from cloned animals to be put on the market, without safety-testing \n              or labeling. Thanks to this massive public backlash, the FDA has \n              been forced to extend its public comment period another 30 days \n              (expiring May 3). If you have not yet informed the FDA about your \n              position on cloned animals and food, please learn more and take \n              action now: http://www.organicconsumers.org/rd/clones.htm\n\n\n\n___________________________________\n\n\nWe \n              rely on your donations to continue our work on these important issues!\n\n\nhttp://www.organicconsumers.org/donations.htm\n\n___________________________________\n\n\n\n\n\n\n\nALERT: \n                  FDA RELEASES 'GUIDANCE' DOCUMENT REGARDING POLICING OF NATURAL \n                  HEALTH\n                  The FDA has released a new directive that is causing major concern \n                  in the natural health community. Although the document does \n                  not specifically propose any new federal laws beyond those already \n                  in place, the OCA and our allies are keeping a close eye on \n                  what this directive might mean in terms of future proposed regulations. \n                  Specifically, the FDA's guidance statement elaborates on current \n                  regulations that state that any product, food, or supplement \n                  making health claims must be carefully policed by the FDA. This \n                  has been a longtime FDA rule. Notably, the document suggests \n                  that foods such as vegetable juices making health claims must \n                  undergo federal monitoring. Because this is a \"guidance \n                  directive,\" rather than proposed legislation, the OCA is \n                  not currently calling for a mass letter writing campaign. But \n                  we do encourage organic and alternative health consumers to \n                  learn more about this directive, to offer individual comments \n                  or queries to the FDA, and to remain vigilant.\nLearn more: http://www.organicconsumers.org/articles/article_4893.cfm\n\n\n\n\n\n\n_____________________________\n\n\n\n\n\n\nimage \n                    parody\n\n\n\nSURVEY \n                OF THE WEEK: \n                CONSUMER REPORTS SURVEY FINDS MOST U.S. CITIZENS HEAVILY DISSATISFIED \n                WITH FDA \nAccording \n                  to a survey published last week by the Consumer Reports National \n                  Research Center:\n\n4 \n                    out of 5 Americans think big pharmaceutical companies have \n                    too much control over the FDA.\n96 \n                    percent believe the government should have the power to require \n                    warning labels on drugs with known safety problems. According \n                    to Consumer Reports, \"Right now, the Food and Drug Administration \n                    must negotiate safety warning labels with a drug maker.\"\n84 \n                    percent believe that advertisements for prescription drugs \n                    with safety concerns should be outlawed.\n92 \n                    percent oppose the FDA's practice of allowing drug companies \n                    to submit only positive clinical trials of new drugs while \n                    burying negative drug trial results.\n93 \n                    percent are troubled by the fact that the FDA has no power \n                    to do follow-up safety studies of drugs after they have been \n                    allowed to enter the market.\n\nLearn \n                  more: http://www.organicconsumers.org/articles/article_4842.cfm\n\n\n\n_________________________________\n\n\n\n\n\n\n\nimage \n                  parody\n\n\n\nTIP \n                OF THE WEEK: \n                ASK FOR ORGANIC PET FOOD\n                More than 60 million packages of pet food were recently recalled \n                from store shelves after thousands of pets were poisoned by products \n                containing contaminated wheat gluten, imported from China. Following \n                this disaster, thousands of the nation's pet owners are switching \n                to organic pet foods. Natural and organic pet food sales increased \n                by 46% last year, and will likely increase even more this year. \n                As more and more pet owners are learning, conventional pet foods \n                are loaded with a host of shocking fillers, including contaminated \n                slaughterhouse waste and preservatives that are considered too \n                dangerous for human foods. It's no wonder that cancer rates for \n                cats and dogs are skyrocketing. So, next time you're shopping \n                for pet food, consider going organic. If organic pet foods are \n                still hard to find, ask your favorite natural food store or coop \n                to order some for you. \nLearn \n                more: http://www.organicconsumers.org/articles/article_4751.cfm\nOrder \n                Organic Pet Food Online: http://www.greenpeople.org/PetFood.html\n\n\n\n\n\n__________________________________\n\n\n\nWe \n                rely on your donations to continue our work on these important issues!\n \nhttp://www.organicconsumers.org/donations.htm\n \n\n\n******** messages from our supporters*********\n\n\n\n\n\n\nCLONE \n                  ON THE RANGE\nWould \n                  you eat cloned meat? The FDA says food from cloned animals is \n                  safe to eat, but the public doesn't buy it. Get the latest on \n                  the livestock cloning debate, how it affects you, and other \n                  green trends with The \n                  Green Guide.\nThe \n                  Green \n                  Guide is the go-to source for green living tips, \n                  product reviews, and environmental health and wellness information. \n                  Get well-researched, credible answers to your most important \n                  questions about everyday health and environmental issues for \n                  yourself and your family. Learn \n                  more about The Green Guide's special offer here.\n\n\n\n__________________________________\n\n\n\n\n\n                  Healthy Products to Improve Your Life\n\n\nGOOD \n                CAUSE WELLNESS:\n                A SIMPLE APPROACH TO HEALTH AND NUTRITION\n                You'll notice that Good Cause Wellness is a different kind of \n                company as soon as you start reading the labels on this company's \n                products. Short ingredient lists. No cheap fillers. Nutrient dense \n                superfoods. Good Cause Wellness keeps it simple so you can easily \n                incorporate serious nutrition into your routine. Good Cause Wellness \n                products offer outstanding taste and high-quality ingredients \n                with benefits that are simple to understand. Every order supports \n                organizations like the OCA because Good Cause Wellness pledges \n                10% of sales to Good Causes. \nLearn more: http://www.GoodCauseWellness.com\n\n\n__________________________________\nPlease \n                                                forward this publication to family \n                                                and friends, place it on websites, \n                                                print it, duplicate it and post \n                                                it freely. Knowledge is power!\n_________________________________\nORGANIC \n                                BYTES is a publication of:\n                                ORGANIC CONSUMERS ASSOCIATION \n                                6771 South Silver Hill Drive\n            Finland, Minnesota 55603\n                                Phone: (218)- 226-4164 Fax: (218) 353-7652\n__________________________________\nSubscribe: \n                                http://www.organicconsumers.org/organicbytes.htm\nSafe \n                                Unsubscribe: http://organicconsumers.org/unsuborganicbytes.cfm \n                                \n                                You are subscribed as: ktwarwic@SPEEDY.UWATERLOO.CA \nChange \n                                your subscription settings to receive Organic \n                                Bytes as plain text here:\nhttp://www.organicconsumers.org/campaign.cfm \n                                \n__________________________________\n\n\n\n   \n\nxaxa1014138\n \n\n\n"}