{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Spie Sutherland\" <spie@proficio.ca>", "subject": "Re: TTSynth Is Available Again", "body": "Luke said:\nWhile making a tarball would be easy, the person using it would  have to\nbe sure they had the libstdc++-libc6.2-2.so.3 shared library, which is\n from gcc 2.95. Luckily, Ubuntu/Debian and Fedora still carry this, but I\n doubt very much whether other distros do, and it would certainly not be\n trivial to build it.\n\nSpie adds:\nIt's not trivial but it is doable. I have in fact done exactly that with the\nibm tts in the past, both on LFS and slackware. It does take some\nconsiderable work, because we're talking raw guts of toolchain here.\nThere various parts of toolchain of specific version that are known to\nwork with specific versions of the other parts, like any given gcc will\nwork with some version of binutils and glibc etc. But I can say it is\ndoable and satisfying to get it done. It is also an opportunity to use\nthe knowledge gained in LFS toolchain build to good use. It is even\npossible to actually have two different glibc versions on a system.\nI wish I would have kept specific notes on what I did, but oh well.\nActually some of my notes may be in the archives of this list, I seem\nto recall posting at least some info about what I did to make it work.\nAfter changing distros, kernels, versions, etc so many times I gave\nup on ibm tts, but I really do love that product. It's a shame that\nibm gave up on it, I recall an IBM engineer explaining that they\nspent millions on it and could not keep doing that for free. I think\nhowever that most of that work was on the recogniton part. The\ntts was tiny compared to the recognition engine and it was clear\nthat their focus was on recognition. They were and are a bit out\nof touch because tts has much more direct useful application\nwhile the recognition was not worth it for me, it was cool to\nplay with but not accurate. It seems they have since shifted their\nefforts in two other directions instead of regular old linux, they\nfocused on speech on embedded systems, and rolled their\nspeech strategy into websphere, where they make gazillions\nof dollars selling to big enterprise. I suppose we should just\nbe glad that linux work is still available. It was a strange idea\nhow they did the tts, you could buy it .. or not. It was free\nbut you could buy it! And they wondered why nobody did.\nStill chuckling over that.\n\n  -- Spie\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}