{"category": "ham", "to_address": "\"Brown, Rodrick\" <rodrick.brown@lehman.com>", "from_address": "\"Tom Phoenix\" <tom@stonehenge.com>", "subject": "Re: Charting Module", "body": "On 5/9/07, Brown, Rodrick  wrote:\n\n> I have a few data points I would like to graph not sure the best way to\n> go about this with Perl. A basic search on cpan points me to GD and\n> WriteExcel anyone using perl for charting/graphing with moderate\n> success?\n\n???\n\nGD::Graph is a popular and well-maintained module for drawing graphs\nand pie charts.\n\n    http://search.cpan.org/~bwarfield/GDGraph-1.44/Graph.pm\n\n> This message is intended only for the personal and confidential use of the\n> designated recipient(s) named above.  If you are not the intended recipient\n> of this message you are hereby notified that any review, dissemination,\n> distribution or copying of this message is strictly prohibited.  This communication\n> is for information purposes only and should not be regarded as an offer to sell\n> or as a solicitation of an offer to buy any financial product, an official confirmation\n> of any transaction, or as an official statement of Lehman Brothers.  Email\n> transmission cannot be guaranteed to be secure or error-free.  Therefore,\n> we do not represent that this information is complete or accurate and it\n> should not be relied upon as such.  All information is subject to change without\n> notice.\n>\n> --------\n> IRS Circular 230 Disclosure:\n> Please be advised that any discussion of U.S. tax matters contained within this\n> communication (including any attachments) is not intended or written to be used\n> and cannot be used for the purpose of (i) avoiding U.S. tax related penalties or\n> (ii) promoting, marketing or recommending to another party any transaction or\n> matter addressed herein.\n\nNo wonder you can't write clearly; you've got a bad case of the lawyers. :-)\n\nHope this helps!\n\n--Tom Phoenix\nStonehenge Perl Training\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}