{"category": "ham", "to_address": "<november-d@november.org>", "from_address": "\"Rachel Morton\" <rachelmk@jps.net>", "subject": "Nov-D: Article: California Prison package hailed (rehabilitation policy seen as a major shift)", "body": "\n\n\n\n\n\n\nhttp://www.sacbee.com/111/story/167168.html\n \nSacramento Bee\n\nPrison package hailed\n\nAt signing ceremony, rehabilitation policy seen as a major shift.\nBy Andy Furillo - Bee Capitol Bureau\nPublished 12:00 am PDT Friday, May 4, 2007Story appeared in MAIN NEWS \nsection, Page A1\n\nGov. Arnold Schwarzenegger and legislative leaders promised a new era for \nCalifornia corrections Thursday, one where the prison system's operative \nphilosophy of the past two decades -- warehousing inmates -- will give way to \noffering them a chance at rehabilitation.\nAt a signing ceremony on the Capitol's east steps, Schwarzenegger hailed the \nprison package contained in Assembly Bill 900 as representing a \"monumental \nshift in how we manage prisons.\"\nIn the short term, the state is hoping that the $7.9 billion plan that adds \nspace for 53,000 prison and jail beds will dissuade federal judges from imposing \npopulation caps that could lead to early releases of inmates from California's \njampacked prisons. In the long run, the hope is that it will keep prisoners from \nreoffending.\n\"Our job is far from done,\" Schwarzenegger said. \"We have made the commitment \nto provide the infrastructure we need to relieve overcrowding. And now we must \nfollow through on the rehabilitation programs that we need to make sure that \ninmates who get released can lead productive, law-abiding lives so that our \ncommunities will stay safe.\"\nAt the end of the 2005-06 budget year, only 10,572 of the 171,900 inmates \nincarcerated at that time were enrolled in academic education programs and only \n7,953 were in vocational programs. About 8,500 more prisoners were in drug \ntreatment programs.\nUnder the bill Schwarzenegger signed Thursday, all of the proposed 40,000 new \nbeds expected to come on line in the California Department of Corrections and \nRehabilitation will be linked to mental health, vocational, education and \ndrug-treatment programs.\nJoan Petersilia, head of the University of California, Irvine, Center for \nEvidence-Based Corrections, said that AB 900 represents a \"historic turning \npoint for California,\" where 172,344 inmates are being housed in spaces designed \nfor about half that many.\n\"We're going to build the space so people can learn jobs,\" Petersilia, who \nhas worked as a consultant to the state prison system for the past three years, \nsaid at the signing ceremony. \"We're going to increase their literacy rate. And \nwe can provide good, solid substance abuse treatment programs.\"\nPetersilia added, however, that \"we should not underestimate the difficulty \nof implementing this package.\" In an interview afterward, she cited staff \nvacancies throughout the prison system, its culture of \npunishment-over-rehabilitation and skepticism in the public mind as critical \nbarriers the state has to overcome to make the program work.\nThe plan calls for building space for 16,000 beds at existing prisons, 16,000 \nmore at 30 or so \"re-entry\" centers to be located around the state and 8,000 \nadditional beds at new correctional hospitals. The other 13,000 beds are slated \nfor county jails, which are now releasing 18,000 inmates a month due to \novercrowding.\nSacramento County is one of about 25 communities around the state that have \nexpressed an interest in housing a re-entry facility. Its district attorney, Jan \nScully, said in an interview she believes the public will support the idea.\n\"I think that citizens are always concerned about whether or not it's in \ntheir own neighborhood, so I think there is going to have to be a lot of \ndiscussion, and the community is going to have to feel that it's in their best \ninterest to have such a facility close by,\" Scully said. \"I think it's going to \nbe important for the Board of Supervisors to hold public hearings and those \nkinds of things. There's going to be a lot of homework to do first.\"\nScully described herself as \"a big proponent of re-entry opportunities\" and \nsaid she would help to get one located in Sacramento.\nThe bill breaks the construction program into two phases. The second can only \nproceed if the state proves it has met the rehabilitation requirements in the \nfirst, 32,000-bed phase of the program.\nThe 16,000 new beds would go into 10 existing prisons around the state to \nreplace emergency housing in which triple-bunked inmates are sleeping in gyms, \ndayrooms and classrooms.\nAB 900 also includes legislative approval of Schwarzenegger's emergency plan \nto ship 8,000 inmates -- against their will, if necessary -- to out-of-state \nprisons. The transfer plan has been held up by lawsuits filed by the California \nCorrectional Peace Officers Association and Service Employees International \nUnion Local 1000.\nAnother provision in the bill will convert 4,000 existing prison beds into \ndrug-treatment slots for inmates.\nThe bill contains an urgency provision that allows corrections officials to \nbegin construction immediately. Schwarzenegger said Thursday he expects the \nconstruction to be completed within 18 months.\nOpponents of the bill such as state Sen. Gloria Romero, D-Los Angeles, said \nit represents just another prison construction plan for the state and that the \nadministration missed a chance to incorporate a major sentencing overhaul and \nparole changes into the package, items that opponents said might reduce the need \nfor new incarceration spaces in the future.\nSchwarzenegger pledged Thursday that he is open to discussing sentencing and \nparole changes later in the legislative session. He also said he will continue \nto push a plan to relocate 4,500 nonviolent female offenders to community-based \nfacilities to open up prison space to more dangerous offenders.\nAssembly Speaker Fabian Núñez, D-Los Angeles, said nobody got everything they \nwanted in AB 900. In signing the bill, Schwarzenegger made \"a contract with the \npeople of California\" and \"the Legislature is going to be watching\" to make sure \nthe prison agency follows through on the rehabilitation benchmarks, Núñez \nsaid.\n\"This would have been an easy problem to solve if we were simply willing to \nbuild prison after prison, like houses on a Monopoly board,\" Núñez said. \"But we \nweren't.\"\nAssembly Republican leader Mike Villines of Clovis said the package \nrepresents bipartisan cooperation at its finest.\n\"Republicans and Democrats put their differences aside,\" he said. \"We put \nCalifornia first.\"\n\nGo to: Sacbee / Back to story\nThis article is protected by copyright and should not be printed or \ndistributed for anything except personal use.The Sacramento Bee, 2100 Q St., \nP.O. Box 15779, Sacramento, CA 95852\n"}