{"category": "spam", "to_address": "<theorize@plg.uwaterloo.ca>", "from_address": "\"roughshod\" <bxkb@mutualofomaha.com>", "subject": "Must have a BSCE and a PE certification.", "body": "GERMAN MARKETS ARE TAKING OVER! T3R.F IS A HIDDEN GEM! WATCH IT ON\nWEDNESDAY MAY 23!\n\nCompany: SKYFLYER\nSymbol: T3R.F\nPrice: 0.36\nTarget: 0.98\nWKN : A0LCMC\nISIN : US83082R1077\nMarket: Frankfurt\n\nFRANKFURT IS WHERE THE NEXT BIG GAINS ARE! WATCH THE GROWTH WITH YOUR\nOWN EYES! ADD T3R.F TO YOUR RADAR NOW!\n\nQualified engineers will be responsible for producing structural\nengineering designs and details for non-residential building\nconstruction using design software. Position may also have\nresponsibility to help determine budget estimates and staffing\nrequirements for the defined scope and schedule.\nPosition is in a normal office environment with occasional trips to\nplant sites which requires ability to walk and climb stairs in a plant\nor industrial environment. These positions will also require a Chartered\nor Professional Engineering status.\nYou need to be able to mobilize ASAP!\nREADY FOR A NEW CHALLENGE? budgeting, project management, its, new\njersey, traffic impact, traffic proposals Questions you will be asked -\nDo you have any experience in traffic design within the State of New\nJersey?\nA worldwide leader in professional services for the electric power\nindustry is very actively searching for a Structural Transmission Line\nEngineer. Where are you located now? Per diem will be considered for\neligible candidates. How many years working on Heavy Industrial or\ngovernment projects? NCEES record preferred. Questions you will be asked\n- Describe your educational background and any certifications or\nlicenses you may hold. Must have a working knowledge of steel\nstructures, a BSCE plus an EIT or PE certification.\nMust have a BSCE and a PE certification. Responsibilities will be to\nwork on multiple fast track capital projects.\nYou need to be able to mobilize ASAP! Relo is available for qualified\ncandidates.\ncomJob Description:thinkenergygroup.\nMust have strong PC, MS office application skills. Relocation to job\nsite is available.\n\n"}