{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 124", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Tomb Raiders Threaten Mayan City's History\n      (Museum Security Network Mailing list)\n   2. Italy. Convegno sul recupero, la tutela e la valorizzazione\n      dei beni culturali (Museum Security Network Mailing list)\n   3. Egipto reclama 17 piezas al Museo Egipcio de Barcelona\n      (Museum Security Network Mailing list)\n   4. New Zealand. Pair deny role in theft of restaurant sculpture\n      (Museum Security Network Mailing list)\n   5. US. Artist Forgives Burglar (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Mon, 28 May 2007 15:57:02 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Tomb Raiders Threaten Mayan City's History\nTo: \nMessage-ID: <005901c7a130$11b70e20$35252a60$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nTomb Raiders Threaten Mayan City's History\n by John Burnett \n\nall photos and relevant links:\nhttp://www.npr.org/templates/story/story.php?storyId=10416454\n \n View Gallery Peter Breslow\nDr. David Freidel stands in front of a tunnel dug by looters trying to get\ninside a royal burial tomb at El Peru-Waka, Guatemala. NPR \n\n \n \n \n Enlarge A map showing the location of the ancient Mayan city El Peru-Waka,\nwhich means \"centipede place with water in it.\" Courtesy David Freidel ?\n2007 \n\n \n \n \nIn the Series\nPart One\nU.S. federal agents report that the looting of the world's archaeological\nsites is epidemic. One archaeologist working in Guatemala has launched a\nbattle to save an ancient city from the ravages of looters.\n\n\nPart Two\nThe rules have changed for museums, dealers, collectors and auction houses.\nLooted relics have become as contentious as they are beautiful. In Part Two\nof this report, we examine the tomb robbers' global marketplace.\n\n\n \n \n \n \nMartin Asturias\nA researcher is lowered into an underground chamber at El Peru-Waka.\n\nTake a tour of David Freidel's excavations at El Peru-Waka. Credit: Martin\nAsturias \n \n \n \n Enlarge This 8-foot-tall carved limestone monument, or stela, depicts the\nMayan king K'inich B'ahlam II, or Sun-Faced Jaguar, carrying out a ceremony\nin Waka, in A.D. 692. The carved surface of the stela was sawed off in the\nlate 1960s, removed from Guatemala and sold. Today, it is in Fort Worth's\nKimbell Art Museum. Kimbell Art Museum \n\n \n Morning Edition, May 28, 2007 ? At the famed Kimbell Art Museum in Fort\nWorth, Texas, you can sit in the cafe, have a slice of basil pesto quiche,\nand gaze up at stunning evidence of the looting of the ancient world.\n\nThe dining room is dominated by an 8-foot-tall carved limestone monument, or\nstela, of a Mayan king. \n\n\"He's shown in all his regalia, with an elaborate headdress, various\nornaments hanging from his belt and jade belt pendants,\" says Timothy Potts,\nthe Oxford-educated director of the Kimbell. \"It's so rich. It's so lively.\nIt's a tapestry; every square inch is covered with something.\"\n\nDespite his obvious admiration for the stela, Potts says that it was likely\nlooted from its original site in the 1960s, taken out of Guatemala and sold.\n\n\nSo how did this stela get from the jungles of Central America to a Forth\nWorth art museum? \n\nEl Peru-Waka\n\nIn Guatemala's Peten Province, not far from the Mexican border, is the\narchaeological site of the Mayan city El Peru-Waka, which means literally\n\"centipede place with water in it.\" The city of about 4,000 people\nflourished between 100 B.C. and A.D. 800, with plazas and pyramids and\norchards. It was ruled by the dynasty of the Centipede Kings.\n\nNow, all that's left of the limestone structures are great mounds covered\nwith vegetation. In the trees, militias of howler monkeys defend their real\nestate. \n\nDr. David Freidel, a Mayan archaeologist at Southern Methodist University,\nhas been trying to protect this site. For five years, Freidel has been\ncoming to El Peru-Waka, trying to decipher the hieroglyphics that tell us\nwho the ruler-priests were, who their queens and enemies were, how they\nworshipped, and why they fell.\n\n\"When looters dig into mounds, they destroy history,\" Freidel says. \"When\nyou lose that history, you often cannot replace it.\" \n\nLooters generally look for tombs, five of which have been found at Waka by\nFreidel and his Guatemalan colleague, archaeologist Hector Escobedo. \n\nThree of the burial chambers are royal ? filled with beautiful painted\nceramics, and objects of jade, obsidian and onyx. \n\nWord has gotten out about the tombs' treasures, and Freidel has had to hire\nhis own guards.\n\n\"Despair and poverty drive the system,\" Freidel says. \"Everybody's on\nsurvival mode. If I left, they would definitely loot it to pieces.\" \n\nHe is fortunate to share his camp with a garrison of Guatemalan soldiers.\nThe army moved in because of the cocaine traffickers active in the area;\nthey appreciate the Pet?n's isolation and proximity to Mexico. \n\nDrug smugglers are also moving antiquities. Last June, police raided a house\nin the area and discovered a large amount of marijuana along with 135 pieces\nof Mayan pottery. \n\nWalking through the underbrush, it appears the scavengers have been\neverywhere. Freidel squats in the opening of a looter's tunnel that has been\ngouged into the base of the main shrine in the center of Waka.\n\n\"The looters started this tunnel thinking they were going to perhaps find a\ntomb, and then they stopped,\" Freidel says. \"They gave up fairly soon in the\ngame.\"\n\nThe Origin of the Sun-Faced Jaguar\n\nThe culprit who stole the stela that is now on exhibit in Fort Worth is\nthought to be a Mexican logger who sawed off the carvings and hauled them\nout on muleback. That was back in the 1960s, when an oil company put the\nfirst road in. The Harvard archaeologist who first excavated here in the\nearly 1970s tracked stolen stelae to private collections and museums in the\nUnited States and Europe.\n\nIn a clearing amid trees festooned with vines and epiphytes, Freidel stands\nover an assemblage of smooth-faced stones that appears to have been one\nmassive stela, sawed into sections. The Maya erected stelae like huge\ngravestones on the forest floor. \n\n\"This is the carcass of the stela that's in Fort Worth: K'inich B'ahlam,\" or\nSun-Faced Jaguar, Freidel said. \"And over there is the carcass of stela 34 ?\nhis wife, Lady Kah-bel.\" \n\nFreidel said he is excited that the Kimbell Art Museum has agreed to pay for\na precise replica of the sun-faced jaguar that will be erected here on-site.\nHis queen, stela 34, currently resides in the Cleveland Museum of Art,\nwhich, according to a spokesperson, has no such plans. Both stelae are\nlegally owned by the museums because they were taken before 1970, the year\nof the first international treaty prohibiting the trade in stolen\nantiquities. \n\nBut at the Ministry of Culture in Guatemala City, the director of cultural\npatrimony, Salvador Lopez Aguilar, is not as thrilled as Freidel.\n\n\"This is the irony: That in place of them keeping the replica and us getting\nthe original, now they are giving a replica to the poor Guatemalans, when it\nshouldn't be that way,\" Lopez Aguilar says.\n\nFor Lopez Aguilar ? an archaeologist and a native petenero ? the legacy of\nthe looters has been horrific. Some sites, such as the ancient city of El\nNaranjo, have been destroyed by rapacious treasure hunters.\n\nHe estimates that nearly every one of the roughly 1,000 important Mayan\nsites in the Pet?n has been looted. \n\n\"If we don't increase our level of vigilance, if we don't pass stronger\nlaws, our country will continue to be at the mercy of those looters, and our\ngrandsons will be condemned to go to the United States to know their\nhistory,\" Lopez Aguilar says.\n\nToday, Guatemalan schoolchildren can visit the National Museum of\nArchaeology in Guatemala City, and see room after room filled with the\nartistry of the ancient Maya. \n\nBut many masterpiece carvings, masks and vessels that Guatemalans believe\nshould be in their national museum are not. They reside in collections\naround the world ? evidence of 40 years of unrestrained pillaging.\n\nProduced by Peter Breslow\n\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Tue, 29 May 2007 08:45:40 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Italy. Convegno sul recupero, la tutela e la\n\tvalorizzazione dei beni culturali\nTo: Museum Security Network Mailinglist \nMessage-ID: <465BCC14.1030600@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nConvegno sul recupero, la tutela e la valorizzazione dei beni culturali\n\nL?iniziativa ? di Provincia ed Arma dei Carabinieri ed ? in programma mercoled? 30 maggio alle 9.30 nella Sala dei Grandi del palazzo della Provincia\n\nLe opere d?arte, come dimostra il successo della mostra \"Piero della Francesca e le corti italiane\", sono un bene prezioso per la loro fruizione e, conseguentemente, per lo sviluppo del territorio, ma altrettanto importante ? il loro recupero e la loro tutela. Per questo motivo la Provincia di Arezzo e l'Arma dei carabinieri hanno promosso un convegno dedicato proprio a recupero, tutela e valorizzazione dei beni culturali in Italia, in programma mercoled? 30 maggio nella Sala dei Grandi del palazzo della Provincia.\n\n\"E? un?iniziativa importante ? spiega il Presidente della Provincia Vincenzo Ceccarelli ? ed ? particolarmente significativo che si svolga proprio nel periodo della mostra su Piero, che va nella giusta direzione della valorizzazione dei beni culturali. Le opere d?arte sono spesso oggetti di furti, anche su commissione, ed anche le opere di Piero della Francesca lo dimostrano visto che negli anni passati proprio due sue opere, la Madonna di Senigallia e la Flagellazione, sono state recuperate dal Nucleo Carabinieri per la tutela del patrimonio culturale\".\n\nProprio per questo il Comando provinciale dei Carabinieri ha proposto alla Provincia questa iniziativa, come spiega il suo Comandante Marco Mochi. \"Quando nel maggio del 2006 fu presentata la mostra su Piero, ci mettemmo subito a disposizione per organizzare un evento e collaborare a questo grande progetto. Il convegno ci consentir? di spiegare le attivit? del nostro comando specializzato e anche di evidenziare un aspetto del nostro territorio, cos? ricco di opere d?arte. Del resto l?Italia ha un patrimonio artistico diffuso nel territorio, cos? come lo ? l?Arma dei Carabinieri\", conclude il Colonnello Mochi. Particolarmente significative le presenze dei relatori del convegno: \"saranno presenti Salvatore Settis, Vicepresidente del consiglio superiore del Ministero per i beni culturali ed autentico paladino della difesa del patrimonio artistico, il Generale Giovanni Nistri, Comandante del Nucleo Carabinieri per la tutela del patrimonio culturale, Cristina Acidini, \nSoprintendente del Polo museale fiorentino, e Carlo Bertelli, uno dei curatori della mostra\", annuncia l?Assessore provinciale alla cultura Emanuela Caroti.\n\nI lavori cominceranno alle 9.30 con il saluto del Presidente della Provincia Vincenzo Ceccarelli, del Sindaco di Arezzo Giuseppe Fanfani e del Colonnello Marco Mochi e proseguiranno con gli interventi dei relatori. \n\nhttp://www.arezzonotizie.it\n\n\n\n------------------------------\n\nMessage: 3\nDate: Tue, 29 May 2007 08:45:43 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Egipto reclama 17 piezas al Museo Egipcio de Barcelona\nTo: Museum Security Network Mailinglist \nMessage-ID: <465BCC17.5090801@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nEgipto reclama 17 piezas al Museo Egipcio de Barcelona\n\nLas autoridades arqueol?gicas egipcias van a enviar una misi?n a Barcelona para estudiar el caso de 17 piezas del Museo Egipcio de la ciudad de las que tienen sospechas sobre su autenticidad o la legalidad de su adquisici?n.\n\nSeg?n explica Ibrahim Abdul Maguid, jefe del sector de recuperaci?n de objetos del Consejo Supremo de Antig?edades (CSA), el viaje ?a?n no tiene fecha? y es fruto de los ?amistosos contactos entre los responsables del museo y el CSA?.\nAunque excluy? que exista ninguna animosidad en esta gesti?n, la misi?n viajar? acompa?ada por abogados para examinar los tr?mites legales en caso de que se formule la reclamaci?n.\nEntre las piezas destaca por su valor 'La princesa Nafrat' ('La bella' en lenguaje fara?nico), esculpida en piedra caliza coloreada, y que data de la V dinast?a fara?nica (2.465-2.323 a. C.), precis? Maguid. La pieza, de 43,5 cent?metros de altura y en buen estado, seg?n Maguid, fue sustra?da durante las excavaciones realizadas en los a?os 90 por el arque?logo egipcio Abdel Munem Abu Bakr en la zona de Giza, al suroeste de El Cairo.\nPor su parte, el secretario general del CSA, Zahi Hawas ha expresado sus dudas sobre la autenticidad de la pieza, al recordar que los antiguos egipcios no acostumbraban a fabricar piezas gemelas y que existe una similar ya en Egipto. Pero, advirti?, si se demuestra que la pieza es aut?ntica, la comisi?n reiterar? su reclamaci?n al museo barcelon?s. En relaci?n a la adquisici?n de la pieza, un portavoz de la Fundaci?n Clos, propietaria de la pieza asegura que la escultura fue comprada de buena fe a una galer?a suiza especializada, importada legalmente, declarada en la aduana y pagado el IVA correspondiente. Asegura que el 13 de marzo de este a?o se inform? a la Embajada Egipcia en Espa?a que, representantes de los propietarios de la pieza, se entrevistaron en El Cairo con autoridades de aquel pa?s y que entonces se comprometieron a devolver la escultura si se demostraba que es falsa. Seg?n esa comunicaci?n, prometieron hacerlo de manera inmediata, incluso renu\nnciando a la indemnizaci?n que, por ley internacional, les corresponder?a. Sin embargo, el Museo Egipcio de Barcelona, a trav?s de su abogado, Ildefonso Falcones, asegur? que ?el Consejo de Antig?edades de Egipto no se ha puesto en contacto con nosotros en relaci?n a ninguna pieza?.\nSin embargo Maguid asegur? que su pa?s ya ha iniciado los tr?mites para la reclamaci?n de la estatua y otras 16 piezas, y asegur? que hab?a llevado el caso incluso a instancias judiciales catalanas. Tambi?n explic? que la reclamaci?n la hicieron despu?s de que una arque?loga espa?ola que hab?a trabajado en el museo informase a la Fiscal?a catalana de que las 17 piezas hab?an sido robadas a Egipto. Seg?n el abogado, la Fiscal?a investig? esta denuncia y el Juzgado de Instrucci?n n?mero 29 de Barcelona dict? dos autos firmes en los que ?se establece que las obras son propiedad del museo y que fueron importadas legalmente en Espa?a?.\nHawas lanz? hace cinco a?os una amplia campa?a internacional para recuperar miles de piezas que en las ?ltimas d?cadas han sido sacadas de contrabando fuera del pa?s.\n\nhttp://www.homines.com/\n\n\n\n------------------------------\n\nMessage: 4\nDate: Tue, 29 May 2007 08:45:48 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] New Zealand. Pair deny role in theft of restaurant\n\tsculpture\nTo: Museum Security Network Mailinglist \nMessage-ID: <465BCC1C.60600@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nPair deny role in theft of restaurant sculpture\n5:00AM Tuesday May 29, 2007\n\nTwo men charged with receiving a one-tonne sculpture and involvement in an attempt to blackmail the artwork's owners appeared before a jury in the High Court at Wellington yesterday.\n\nBrenden John Marshall, 39, and Benjamin Horace Way, 23, are jointly accused of receiving a 3m by 3m sculpture, stolen from outside a restaurant in Waikanae, north of Wellington.\n\nMarshall also allegedly blackmailed the sculpture's owners, threatening to cut up the $250,000 artwork and sell it to a scrap metal dealer.\n\nThe sculpture, taken on October 6, 2005, was called Long Horizon. It was moulded and cast by Palmerston North artist Paul Dibble.\n\nWay was accused of helping Marshall avoid arrest through his complicity in accompanying the older man to the Waikanae churchyard where the bronze was swapped for $10,000.\n\nThe men pleaded not guilty to all charges.\n\nCrown prosecutor Kenneth Stone told the jury Marshall made a video of the sculpture, delivering it to the owner through the editor of the local Kapiti Observer newspaper, Diane Joyce. One of the sculpture's owners, Maggie Mouat, watched the film and agreed to pay $6000 to get it back.\n\nLater, Marshall called her to increase the ransom by $4000, Mr Stone said.\n\nThe court was told that some days later, the two accused met the owners for the exchange.\n\nWay was arrested shortly afterwards, but Marshall disappeared and did not reappear until seven months later, when he handed himself in to police in Otaki, Mr Stone said.\n\nMarshall's lawyer, Tim Blake, told the jury his client was merely a go-between, a broker helping the owners get their statue back.\n\nWay's lawyer, Paul Surridge, said his client was at the scene of the hand-over merely to help his friend move the tonne of bronze.\n\nhttp://www.nzherald.co.nz\n\n\n\n------------------------------\n\nMessage: 5\nDate: Tue, 29 May 2007 08:45:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. Artist Forgives Burglar\nTo: Museum Security Network Mailinglist \nMessage-ID: <465BCC20.7080005@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nArtist Forgives Burglar\nPOSTED: 7:29 pm CDT May 28, 2007\n\nSAN ANTONIO -- An artist said someone burglarized his gallery over the weekend, but he said he's not holding a grudge.\n\nRick Whittlesey said two paintings that he describes as special pieces in his collection were stolen from his gallery at the intersection of McCullough and Huisache roads.\n\nWhittlesey kept his gallery open on Monday and placed a plywood sign over a window that had been smashed by the burglar with a message that read, \"Thief, you are forgiven.\" The message also incuded the Bible verse Matthew 6:19-21.\n\nWhittlesey said he had planned to sell the paintings, worth more than $2,500, at a July fundraiser.\n\nhttp://www.ksat.com\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 124\n****************************************\n\n"}