{"category": "ham", "to_address": "Sarah Rimmington <srimmington@essentialinformation.org>", "from_address": "Sarah Rimmington <srimmington@essentialinformation.org>", "subject": "[Ip-health] Comment on Congressional Letter Opposing USTR Pressure on Thailand", "body": "*NEWS RELEASE\nFor More Information Contact: Robert Weissman or Sarah Rimmington (202)\n387-8030\nFor Immediate Release: June 20, 2007 *\n\n\n*Essential Action Comments on Waxman letter regarding USTR Pressure on\nThailand for its Lawfully Issued Compulsory Licenses\n*\nFollowing is the statement of Robert Weissman, director of Essential\nAction, regarding a letter sent today by Representative Henry Waxman and\nnearly three dozen Members of Congress to the U.S. Trade Representative.\nThe letter protests USTR's inclusion of Thailand on the \"Priority Watch\nList\" for issuing lawful compulsory licenses, and is available at:\nhttp://www.house.gov/waxman/pdfs/thailand%20letter%20to%20ustr%2006-20-07.pdf\n\n\n\nBy using legal methods to authorize price-lowering generic competition\non overpriced AIDS and heart-disease drugs, Thailand has shown the world\nwhat it means to place public health over commercial considerations.\nThailand has been very clear that the savings it accrues will be used to\nexpand access to important medicines.\n\nUSTR's retaliatory placement of Thailand on the priority watch list was\ndesigned to punish the country for prioritizing public health over the\ninterests of Big Pharma, and to send a message to other developing\ncountries that they will be penalized for issuing compulsory licenses\nand utilizing the public health flexibilities available in the World\nTrade Organization's intellectual property agreement.\n\nBut the times are changing. The letter released today by Representative\nWaxman and signed by nearly three dozen Members of Congress reflects\ngrowing sentiment in Congress that U.S. policy on access to medicines\nquestions must change. This emerging view is that developing countries\nmust be permitted to take legal measures to reduce the price of\nmedicines and make them more widely available. These Members of Congress\nrecognize that the U.S. government damages the nation's commitments,\nreputation, aspirations and legitimate national interest when it\nreflexively adopts Big Pharma's agenda overseas.\n\n\n--\nSarah Rimmington\nProject Attorney\nEssential Action, Access to Medicines Project\nWashington, DC\nOffice: (202) 387-8030 x34\nMobile: (202) 422-2687\nwww.essentialaction.org/access\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}