{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "This weekend on BBC Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSTEVE PARRISH ON THE BRITISH MOTOGP\nCasey Stoner goes into the British MotoGP at Donington Park with a lead of 14 points over the legendary Valentino Rossi.\n\n\nRossi is chasing his eighth career victory at the Leicestershire track, but that won't faze Stoner.\n\n\nDespite being only 21 years old, the Australian from Kurri Kurri in New South Wales is showing the MotoGP world that he is made of stern stuff.\n\n\nHe proved beyond any doubt in the last race in Catalunya that he is a proper threat to Rossi.\n\n\nThe Italian has been known to screw with people's heads in a bid to unsettle them, but Stoner seems to be well ahead of all that. \n\n\nIn fact, in terms of psychology, Stoner has got the upper hand after he won that stunning duel in Spain.\n\n\nA couple of the laps during that race were as good as you are ever likely to see in motor racing. \n\n\nStoner told me that it was the first time he really got stuck in and thought, \"a podium would be nice, but I want to win this one.\". \n\n\nRossi calls Donington his second home, but Stoner pointed out that everywhere seems to be his second home and he thinks he says it to try and unnerve the other riders. \n\n\nWhat isn't in doubt is the popularity the charismatic Rossi will enjoy from the British crowd and that will be a big boost for him.\n\n\nThe track generally produces some good races. \n\n\nWhat I also love about it is how family and spectator friendly it is and there are some great vantage points to watch the action. \n\n\nThis is in marked contrast to somewhere like Silverstone which seems very wide open, expansive and a little clinical. \n\n\nThat takes away a lot of its atmosphere, which is something Donington certainly doesn't lack. \n\n\nIn fact, the only thing missing for the public on Sunday is a British rider.\n\n\nEnjoy the race,\n\n\nSteve\n\n\nSteve Parrish commentates on the British MotoGP on the BBC on Sunday. During his racing career he won the 1978 and 1979 British Motor Cycle Championships\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nMOTOGP\n bbc.co.uk/motorbikes\nSaturday\nBritish MotoGP: Qualifying (1355-1500, BBCi and BBC Sport website).\nSunday\nBritish MotoGP: Race live (1215-1400, BBC TWO and BBC Sport website; 1300, BBC Radio Five Live/online); MotoGP Extra (1400-1430, BBCi and BBC Sport website).\n\n\n\n\n\n\nATHLETICS\n bbc.co.uk/athletics\nSaturday\nEuropean Cup: 1255-1625, BBC ONE and BBC Sport website; 1400, BBC Radio Five Live/online.\nSunday\nEuropean Cup: 1400-1600, BBC TWO and BBC Sport website; 1415, BBC Radio Five Live/online .\n\n\n\n\n\n\nHORSE RACING\n bbc.co.uk/horseracing\nSaturday\nRoyal Ascot, day five: 1415-1645, BBC TWO and BBC Sport website; 1430, Radio Five Live/online.\n\n\n\n\n\n\nMORE SPORT ON THE BBC\n bbc.co.uk/tvandradio\nSaturday\nTennis: Eastbourne (1230-1415, BBC TWO and BBC Sport website); Boxing: Ricky Hatton v Jose Luis Castillo (0300, Radio Five Live/online).\nSunday\nRugby League: Super League Show (1300-1300, BBC North and BBC Sport website); Rowing: World Cup - Amsterdam (1300-1630, BBCi and BBC Sport website and 1600-1715, BBC TWO and BBC Sport website).  \n\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tWimbledon on the BBC\n When you can watch all the action on the BBC\n\t\t\t\t\t\n\t\t\t\t\t\tFederer v Nadal\n Who do you think will come out on top in SW19?\n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}