{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Carl Haines\" <nofdeheerenrod@deheeren.nl>", "subject": "Become fit and happy again", "body": "\nHealthy living with less fat\n\n\n\n\n\nAnatrim – The latest and most attracting product for corpulent people is now available – As seen on Oprah\n\n\n\nDid you realize that redundant body kilograms kill very much people around the whole world? We believe you hate the ugly appearance of people like those and the social prejudice against them. \n\nOr, maybe, you have not the will to withstand an assault of your terrible eating habits. If you see it sounds familiar, then we got something for your consideration!\n\n\n\n\n\nHere Anatrim comes, the new product for the elimination of your body’s extra weight. The most astonishing thing is that Anatrim improves the quality of your life, making you eat less and always cheering you up. Here you may read some notes received from our customers:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of eating anything close at hand and watching TV constantly \n\n\nI became rather more interested in doing sport.\n\n\n\n\n\n\n Anatrim set me back on the right track.\n\n\n I have a great figure now and lots of men fix their eyes on me!\"\n\n\n\n\n\n\nVictoria K., Chicago\n\n\n\n\n\n\n\"I tried some passive weight losing, you know, but with no result. This terrible appetite would just kick in and spoil everything. \n\n\nOnce I heard on Anatrim in the media advertisement and it brought a great influence on me.\n\n\n I had tried using it, and my wife said that I’m not more a weighty man now, 3 months later. \n\n\n25 pounds off and I keep still losing them! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nSteve Doubt, New York\n\n\n\n\n\nAnatrim helps you to realize that you doesn’t have such a great need for the constant eating. It lifts your mood up, gives you energy, and attacks needless kilos. All thanks to its powerful comprehensive formula!!\n\n\n\nWorm out more!\n\n\n\n"}