{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "Deep Flung <DeepFlung@bigdickmedia.com>", "subject": "SEXUALLY-EXPLICIT:Every HOLE is ready to be PLUGGED gnitpick [updated]", "body": "\n\ngnitpick one rod in every hole 04/24/2007 19:00:47\n\n\n\n\n\n \n \n \n \n \n \n \n \n \n \n\n\n\n\n\n\nIf you cannot see images on this page, please Refresh Here.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ngnitpick,14 sites with many extreme categories to choose from\n\nEvery Hole is ready to be plugged 04/24/2007 19:00:47\n\nJokes of the day\nThe name of your wife\nSt. Peter is questioning three married couples to see if they qualify for admittance to heaven.\nWhy do you deserve to pass the Pearly Gates? he asks one of the men, who had been a butler.\nI was a good father,\" he answers.\nYes, but you were a drunk all your life. In fact, you were so bad you even married a woman named Sherry. No admittance.\nSt. Peter then turned to the next man, a carpenter, and asked him the same question.\nThe carpenter replied that he had worked hard and taken good care of his family.\nBut St. Peter also rejected him, pointing out that he had been an impossible glutton, so much so that he married a woman named BonBon.\nAt this point the third man, who had been a lawyer, stood up and said, Come on, Penny, let's get out of here.Picking a punishment\nThis guy dies and is sent to Hell. Satan meets him and shows him the doors to three rooms and says he must choose one of the rooms to spend eternity in.\nSo Satan opens the first door. In the room there are people standing in cow manure up to their necks. The guy says No, please show me the next room.\nSatan shows him the next room and this has people with cow manure up to their noses. And so he says no again.\nFinally, Satan shows him the third and final room. This time there are people in there with cow manure up to their knees drinking cups of tea and eating cakes.\nSo the guy says, I'll choose this room. Satan says O.K. The guys is standing in there eating his cake and drinking his tea thinking, Well, it could be worse, when the door opens. Satan pops his head around, and says O.K. tea-break is over. Back on your heads!Qualifying for Heaven\nRecently a teacher, a garbage collector, and a lawyer wound up together at the Pearly Gates. St. Peter informed them that in order to get into Heaven, they would each have to answer one question. \nSt. Peter addressed the teacher and asked, \"What was the name of the ship that crashed into the iceberg? They just made a movie about it. \nThe teacher answered quickly, That would be the Titanic. St. Peter let him through the gate. \nSt. Peter turned to the garbage man and, figuring Heaven didn't really need all the odors that this guy would bring with him, decided to make the question a little harder: How many people died on the ship? \nFortunately for him, the trash man had just seen the movie. 1,228, he answered. \nThat's right! You may enter. St. Peter turned to the lawyer. Name them. \n\n\n\n\n\n \n \n \n \n \n \n \n \n \n \n\n\n\n"}