{"category": "spam", "to_address": "Mail <mail@flax9.uwaterloo.ca>", "from_address": "Nicole Walker <puckett@gkec.tu-darmstadt.de>", "subject": "Virgin penetrator", "body": "\n\nOnline pharmacy presents top products that will make you healthy! You do not need to go to your local drug store, you can buy here any pill that you need.\nGo to the shop\nAbsolutely legal, licensed and CHEAP pills at your choice. Confidential purchase. Instant shipping\nVisit us\nSecure and confidential purchase. We are verified by VISA!\nWith best regards,\nNicole Walker\n \n \nI inogo vyhoda, kak doveritsia emu, ia Prosto ne videl. Dopolnitelnoj Strahovkoj sluzhilo oruzhie legkij pistolet-izluchatel marki maks pod Levoj podmyshkoj i paralizator son pod pravoj. Otlichno Otrepetirovannyj i postavlennyj spektakl. Gorel kamin, rasprostraniaia zhivitelnoe teplo po zalu, dvojki-trojki Zavsegdataev veli negromkie besedy za nebolshimi kvadratnymi stolikami, ne Zabyvaia smachivat luzhenye glotki, kto kislinom i voniuchkoj, esli v karmane Zvenelo ne slishkom mnogo manov, a kto raznomastnym dro, esli s manami vse bylo v Poriadke. \nNe ogliadyvaias na mesto poboishcha, vsadniki rezvo vyehali na kamenitovoe Polotno Bolshogo Tornogo puti i stremitelno poneslis na vostok. I v etoj Zhutkoj razrushitelnoj kartine, v samyj neozhidannyj moment razvernuvshejsia Pered ego glazami kak naiavu, v kartine vtorgshegosia v ego mozg Razrushitelnejshego videniia, plameni tozhe hvatalo. Tiazhelo vorochaias na trotuare, ia potianulsia za oruzhiem. I medlenno prihodil v sebia. Krug manil ego tak zhe, kak i menia, no esli by ne eta sluchajnost. Emu eshche Povezlo. Ia skolznul glazami po plavnym izgibam ee tela i nichego ne otmetil v Dushe nikakih teplyh chuvstv, nikakoj reakcii ploti. Konechno, srazu eto tebe ne Udastsia, no postepenno, esli ty budesh userdnym uchenikom, tvoj mozg Privyknet delat eto avtomaticheski. \nV svoem otnoshenii ko mne, Kogda proiznesla slova liubvi, na kotorye ia ne smog otvetit. ZAMENA Kogda ia prishel v sebia, den kak raz perevalil cherez seredinu. Plan svoditsia k sleduiushchemu, rovno prodolzhal Dos. Naskolko mne bylo izvestno, eti mashiny obladali ochen vysokoj Stepeniu zashchity i primenialis v nekotoryh mirah Federacii dlia vedeniia Lokalnyh vojn, a takzhe razlichnymi ohrannymi i patrulnymi sluzhbami Mnozhestva planet. ejisuminyon XFNaWHVCQlZRUUgcRkNURVdBWFpeHFBV\n \n\n\n"}