{"category": "ham", "to_address": "\"Gabor Grothendieck\" <ggrothendieck@gmail.com>", "from_address": "\"Greg Snow\" <Greg.Snow@intermountainmail.org>", "subject": "Re: [R] Reasons to Use R", "body": "The licences keep changing, some have in the past but don't now, some\nyou can get an additional licence for home at a discounted price. Some\nit depends on the type of licence you have at work (currently our SAS\nlicence is such that the 3 people in my group can all have it installed,\nbut at most 1 can be using it at any 1 time, how does that affect\ninstalling/using it at home).  I may be able to install some of the\nsoftware at home also, but for most of them I have given up trying to\nfigure out the legality of it and so I have not installed them at home\nto be on the safe side.\n\nSome of the doctors I work with who are also affiliated with the local\nuniversity have mentioned that they can get a discounted academic\nversion of SAS and could use that, but my interpretation of the academic\nlicence that one showed me (probably not the most recent) said (in my\ninterpretation, I am not a lawyer) that if they published the results\nwithout paying a licence upgrade fee, they would be violating the\nlicence (the academic version was intended for teaching only).\n\nThe R licence on the other hand is pretty clear that I can install it\nand use it pretty much anywhere I want.\n\nYou are right in correcting me, R is not the only package that can be\nused on multiple computers.  I do think it is the most straight forward\nof the good ones.\n\n-- \nGregory (Greg) L. Snow Ph.D.\nStatistical Data Center\nIntermountain Healthcare\ngreg.snow@intermountainmail.org\n(801) 408-8111\n \n \n\n> -----Original Message-----\n> From: Gabor Grothendieck [mailto:ggrothendieck@gmail.com] \n> Sent: Monday, April 09, 2007 10:44 AM\n> To: Greg Snow\n> Cc: Lorenzo Isella; r-help@stat.math.ethz.ch\n> Subject: Re: [R] Reasons to Use R\n> \n> I might be wrong about this but I thought that the licenses \n> for at least some of the commercial packages do let you make \n> a copy of the one you have at work for home use.\n> \n> On 4/9/07, Greg Snow  wrote:\n> > Here are a couple more thougts to add to what you have \n> already received:\n> >\n> > You mentioned that price is not at issue, but there are other costs \n> > than money that you may want to look at.  On my work \n> machine I have R, \n> > S-PLUS, SAS, SPSS, and a couple of other stats programs; on \n> my laptop \n> > and home computers I have R installed.  So, if a deadline \n> is looming \n> > and I am working on a project mainly in R, it is easy to \n> work on it on \n> > the bus or at home (or in a boring meeting), the same does not work \n> > for a SAS or SPSS project (Hmm, thinking about this now, \n> maybe I need \n> > to do less in R :-).\n> >\n> > R and S-PLUS are very flexible/customizable, if you have a certain \n> > plot that you make often you can write your own \n> function/script to do \n> > it automatically, most other programs will give you their standard, \n> > then you have to modify it to meet your specifications.  \n> With sweave \n> > (and the odf and html extensions) you can automate whole \n> reports, very \n> > useful for things that you do month after month.\n> >\n> > And what I think is the biggest advantage of R and S-PLUS \n> is that they \n> > strongly encourage you to think about your data.  Other \n> programs (at \n> > least that I am familiar with) tend to have 1 specific way \n> of treating \n> > your data, and expect you to modify your data to fit that programs \n> > model.  These models can be overrestrictive (force you to \n> restructure \n> > your data to fit their model) or underrestrictive (allow \n> things that \n> > should really be separate data objects to be combined into a single\n> > \"dataset\") and sometimes both.  S on the other hand allows many \n> > different ways to store and work with your data, and as you analyze \n> > the data, different branches of new analysis open up depending on \n> > early results rather than just getting stock output for a \n> procedure.  \n> > If all you want is a black box where data goes in one end and a \n> > specific answer comes out the other, then most programs \n> will work; but \n> > if you want to really understand what your data has to tell \n> you, then \n> > R/S-PLUS makes this easy and natural.\n> >\n> > Hope this helps,\n> >\n> >\n> > --\n> > Gregory (Greg) L. Snow Ph.D.\n> > Statistical Data Center\n> > Intermountain Healthcare\n> > greg.snow@intermountainmail.org\n> > (801) 408-8111\n> >\n> >\n> >\n> > > -----Original Message-----\n> > > From: r-help-bounces@stat.math.ethz.ch \n> > > [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Lorenzo \n> > > Isella\n> > > Sent: Thursday, April 05, 2007 9:02 AM\n> > > To: r-help@stat.math.ethz.ch\n> > > Subject: [R] Reasons to Use R\n> > >\n> > > Dear All,\n> > > The institute I work for is organizing an internal \n> workshop for High \n> > > Performance Computing (HPC).\n> > > I am planning to attend it and talk a bit about fluid \n> dynamics, but \n> > > there is also quite a lot of interest devoted to data \n> > > post-processing and management of huge data sets.\n> > > A lot of people are interested in image processing/pattern \n> > > recognition and statistic applied to geography/ecology, \n> but I would \n> > > like not to post this on too many lists.\n> > > The final aim of the workshop is  understanding hardware \n> > > requirements and drafting a list of the equipment we \n> would like to \n> > > buy. I think this could be the venue to talk about R as well.\n> > > Therefore, even if it is not exactly a typical mailing list \n> > > question, I would like to have suggestions about where to collect \n> > > info about:\n> > > (1)Institutions (not only academia) using R (2)Hardware \n> > > requirements, possibly benchmarks (3)R & clusters, R & \n> multiple CPU \n> > > machines, R performance on different hardware.\n> > > (4)finally, a list of the advantages for using R over commercial \n> > > statistical packages. The money-saving in itself is not a reason \n> > > good enough and some people are scared by the lack of \n> professional \n> > > support, though this mailing list is simply wonderful.\n> > >\n> > > Kind Regards\n> > >\n> > > Lorenzo Isella\n> > >\n> > > ______________________________________________\n> > > R-help@stat.math.ethz.ch mailing list \n> > > https://stat.ethz.ch/mailman/listinfo/r-help\n> > > PLEASE do read the posting guide\n> > > http://www.R-project.org/posting-guide.html\n> > > and provide commented, minimal, self-contained, reproducible code.\n> > >\n> >\n> > ______________________________________________\n> > R-help@stat.math.ethz.ch mailing list\n> > https://stat.ethz.ch/mailman/listinfo/r-help\n> > PLEASE do read the posting guide \n> > http://www.R-project.org/posting-guide.html\n> > and provide commented, minimal, self-contained, reproducible code.\n> >\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}