{"category": "ham", "to_address": "mirod <xmltwig@gmail.com>, beginners@perl.org", "from_address": "Andrew Curry <andrew.curry@pa-sport.com>", "subject": "RE: XML Parsing", "body": "XML::LibXML is also a good one for general xml parsing/manipulation. \n\n-----Original Message-----\nFrom: mirod [mailto:xmltwig@gmail.com] \nSent: 26 June 2007 08:47\nTo: beginners@perl.org\nSubject: Re: XML Parsing\n\nOn Jun 25, 3:47 am, mick...@frontiernet.net (Mike Blezien) wrote:\n> I need to parse a fairly largeXMLresponse file and would like some \n> suggestions on whichXMLmodule would work the best. We've been using \n> theXML::Simple module, but I don't think that's the right one for the \n> job. Below is theXML file we need to parse. In particular getting the \n> data from the elements within the  Would \n> theXML::Twigmodule work better for this ?? Any suggestion would be \n> much appreciated.\n\nHi Mike,\n\nXML::Twig would probably work fine, you can for example do XML::Twig->new(\ntwig_roots => { message => sub { push @messages, $_-\n>text;  $_->purge;}, },)\n               ->parsefile( 'file.xml');\n\nmessage texts will be in @messages\n\nIf you need more information than just the text of the message elements,\nthen you can use twig_handlers instead of twig_roots, look at the docs for\nthe difference.\n\nThat said if the files are the size of your example, that's really small, so\nthere should be no need to switch from a module that loads the entire file\nin memory. OTOH if message elements can contain mixed content (embedded\nmarkup like  for example), then that would be a reason to avoid\nXML::Simple.\n\nI hope that helps.\n\n--\nmirod\n\n\n--\nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org For additional\ncommands, e-mail: beginners-help@perl.org http://learn.perl.org/\n\n\n\nThis e-mail is from the PA Group.  For more information, see\nwww.thepagroup.com.\n\nThis e-mail may contain confidential information.  Only the addressee is\npermitted to read, copy, distribute or otherwise use this email or any\nattachments.  If you have received it in error, please contact the sender\nimmediately.  Any opinion expressed in this e-mail is personal to the sender\nand may not reflect the opinion of the PA Group.\n\nAny e-mail reply to this address may be subject to interception or\nmonitoring for operational reasons or for lawful business practices.\n\n\n\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}