{"category": "spam", "to_address": "the00@plg2.math.uwaterloo.ca", "from_address": "dimple <fqqb@telia.com>", "subject": "duke aristocrat", "body": "Brokers Move On ERMX!\n\nEntreMetrix Inc. (ERMX)\n$0.18\n\nHeavy trading today as ERMX announced its launch of digital support\ntools for its portfolio companies. Brokers are getting ahead of this\nsteady climb as they grab up large blocks of shares for there clients.\nLook at the numbers and get on ERMX Friday morning!\n\nGAS FIELDS ARE ALSO SUBJECT TO FLOODING DOWNSTREAM.\n\nSTAY OUT OF THE SUNSHINE AND IN AN AIR-CONDITIONED ROOM IF POSSIBLE\nDURING THE AFTERNOON HOURS.\n\nDEHYDRATION AND HEAT STROKE CAN OCCUR QUICKLY IN THESE EXTREME\nTEMPERATURES.\n\nSTOP OUTDOOR ACTIVITIES. THE FLOOD WARNING CONTINUES FOR THE RED RIVER\nNEAR DEKALB TEXAS AT PECAN POINT.\n\nMOST THUNDERSTORMS WILL BE NEAR LAKE MINCHUMINA INTO THE NORTHERN\nKUSKOKWIM MOUNTAINS. DRINK PLENTY OF WATER EVEN IF YOU ARE NOT THIRSTY.\nEQUIPMENT AND LIVESTOCK SHOULD BE MOVED TO HIGHER GROUND.\nRAINFALL HAS DIMINISHED IN AREAL COVERAGE ACROSS CHOCTAW COUNTY.\n\nNATIONAL WEATHER SERVICE METEOROLOGISTS DETECTED PATCHES OF VERY LIGHT\nRAIN ACROSS CHOCTAW COUNTY IN SOUTHEAST OKLAHOMA.\n\nMOST THUNDERSTORMS WILL BE NEAR LAKE MINCHUMINA INTO THE NORTHERN\nKUSKOKWIM MOUNTAINS. FROM THE NATIONAL WEATHER SERVICE IN LITTLE ROCK.\n\nHUALAPAI RESERVATION.\n\nEXPECT CLOUDY CONDITIONS TO PERSIST WITH ISOLATED RAIN SHOWERS AND\nTHUNDERSTORMS TO PUSH INTO THE NORTHEAST PORTION OF THE VALLEY. THE\nNATIONAL WEATHER SERVICE DOPPLER RADAR IN SHREVEPORT INDICATED SHOWERS\nAND THUNDERSTORMS ACROSS NORTHEAST TEXAS.\nEXPECT THE RED RIVER TO SLOWLY RECEDE TO NEAR FLOOD STAGE AND HOLD\nSTEADY NEAR FLOOD STAGE THROUGHOUT MOST OF JULY DUE TO RESERVOIR\nRELEASES FROM LAKE TEXOMA AND HUGO RESERVOIR. NORTHWEST LOUISIANA AND\nTEXAS. OR UNTIL THE WARNING IS CANCELLED. IN SOUTHWEST ARKANSAS.\n\nRAINFALL HAS DIMINISHED IN AREAL COVERAGE ACROSS CHOCTAW COUNTY. This\nsame information is available in other file formats including the XML\nbased RSS and CAP formats.\n\nRESIDENTS AND ESPECIALLY TOURISTS WHO ARE NOT ACCLIMATED TO THE DESERT\nHEAT ARE URGED TO PLAN OUTDOOR ACTIVITIES DURING THE EARLY MORNING AND\nLATE EVENING HOURS. ARKANSAS RIVER AT OZARK LOCK AND DAM AFFECTING\nFRANKLIN. AN EXCESSIVE HEAT WARNING IS ISSUED WHEN TEMPERATURES ARE\nFORECAST TO REACH DANGEROUS LEVELS THAT WILL STRESS THE BODY IF\nPRECAUTIONS ARE NOT TAKEN. MAINLY OVER HIGHER ELEVATIONS TO THE EAST.\nWITH ISOLATED HIGHER AMOUNTS UP TO SIX INCHES POSSIBLE OVER EAST TEXAS.\nCLEAR SKIES THIS EVENING AND THROUGH THE NIGHT WITH A FEW HIGH THIN\nCLOUDS MOVING THROUGH OCCASIONALLY.\nGAS FIELDS ARE ALSO SUBJECT TO FLOODING DOWNSTREAM.\nIT WOULD BE WISE TO COMPLETE AS MUCH OUTDOOR ACTIVITY AS POSSIBLE IN THE\nEARLY MORNING WHEN THE SUN AND HEAT ARE LESS INTENSE.\n\nDANGEROUSLY HOT TEMPERATURES OVER MUCH OF THE MOJAVE DESERT WILL REMAIN\nTHROUGH FRIDAY.\n\nAFTER THE RED RIVER CRESTS.\n\nAND FARMERS WITH INTERESTS ON THE RED RIVER IN SOUTHEAST OKLAHOMA. DRINK\nPLENTY OF WATER EVEN IF YOU ARE NOT THIRSTY. IF YOU MUST BE OUTDOORS.\n\nALTHOUGH IT IS NOT EXPECTED TO BE QUITE AS HOT.\n\nTHIS AREA IS MOVING FAIRLY SLOWLY SO EXPECT CONDITIONS TO LAST FOR THE\nNEXT FEW HOURS.\n\n"}