{"category": "ham", "to_address": "r-packages@stat.math.ethz.ch", "from_address": "Thoralf Mildenberger <mildenbe@statistik.uni-dortmund.de>", "subject": "[R] [R-pkgs] new package benchden 1.0.0 : benchmark densities for\n nonparametric density estimation", "body": "The new package \"benchden\" 1.0.0 implements 28 benchmark densities for\nnonparametric density estimation that were introduced by A. Berlinet and\nL. Devroye (\"A Comparison of Kernel Density Estimates\", Pub. Inst. Stat.\nUniv. Paris, XXXVIII, fasc. 3, 1994, 3-59,\nhttp://cg.scs.carleton.ca/~luc/devs.html ). This collection includes a\nvariety of densities with different degrees of smoothness, different\ntail behaviour, different number of modes, with and without infinite \npeaks and also some standard densities like the normal and the uniform. \nThere is also a small intersection (e.g. the claw density) with the \ncollection of normal mixtures introduced by Marron and Wand and \nimplemented in R in the package \"nor1mix\".\nSimilar to the test bed functions by Donoho and Johnstone (Blocks, Bumps\netc.) commonly used in regression or the \"Peppers\" and \"Lena\" images\npopular in image analysis, the densities in this collection should be \nuseful for testing and comparing new and existing density estimators.\n\"benchden\" 1.0.0 contains functions for the generation of random\nvariates as well as density-, distribution- and quantile-functions.\nEverything is implemented in typical R-style and the package should\nreduce the programming effort needed for simulation studies in\nnonparametric density estimation. It also allows for better\nreproducibility of the results.\n\nThoralf Mildenberger, Henrike Weinert and Sebastian Tiemeyer\n\n_______________________________________________\nR-packages mailing list\nR-packages@stat.math.ethz.ch\nhttps://stat.ethz.ch/mailman/listinfo/r-packages\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}