{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Jari Oksanen <jari.oksanen@oulu.fi>", "subject": "Re: [R] dist label names", "body": "  uea.ac.uk> writes:\n\n> \n> Hello,\n> \n> I am trying to do a multi-dimensional scaling of the World Bank's quality\n> of governance indicators for the Balkan region. I am having trouble\n> labelling my plot. Could some kind person help me out. How do I set the\n> attribute Label by a variable (say, \"Code\")? At present I get this:\n> \n> >qog.dist<-dist(Balkans.data, method = \"euclidean\", diag = FALSE, upper =\n> >FALSE)\n> labels(qog.dist)\n>  [1] \"1\"  \"2\"  \"3\"  \"4\"  \"5\"  \"6\"  \"7\"  \"8\"  \"9\"  \"10\"\n> \n> I know this must be a really basic questions, but none of the 5-6 books on\n> my shelf nor a web search have proved much help. In case you hadn't\n> guessed, I am pretty new to R.\n> \n\nNot very much detail here, but I assume you use isoMDS (MASS package), and you\nhave reasonably current version of MASS and R. Further, I assume your data.frame\n(Balkans.data) has row names, and thes row names are saved as dist labels. If\nany of these is not true, correct the situation (install new MASS or VR bundle,\ngive rownames to your data frame -- there was a brief period when the names were\nnot correctly transferred from dist to isoMDS). \n\nIf the problem was to label your dist result, you can do it like this\n\nrownames(Balkans.data) <- typenamesorgiveavariablenamecontainingnames\n\nand now dist will be labelled correctly, and the names are transferred to isoMDS\nresult. \n\nNow your isoMDS result should have the labels as rownames to points. Then you\ncan do something:\n\nmod <- isoMDS(gog.dist)\nplot(mod$points, asp=1, type=\"n\")\ntext(mod$points, rownames(mod$points))\n\nI hope this helps. However, it is new to me that Euclidean distance is an\nappropritae metric for governance indicators (but none of my business).\n\nCheers, jari oksanen\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}