{"category": "ham", "to_address": "Seth Falcon <sfalcon@fhcrc.org>", "from_address": "ml-r-help@epigenomics.com", "subject": "Re: [R] Unit Testing Frameworks: summary and brief discussion", "body": "\nanthony.rossini@novartis.com wrote:\n[...]\n> ============= From Seth Falcon:\n> \n> Hi Tony,\n> \n> anthony.rossini@novartis.com writes:\n>> After a quick look at current programming tools, especially with regards \n> \n>> to unit-testing frameworks, I've started looking at both \"butler\" and \n>> \"RUnit\".   I would be grateful to receieve real world development \n>> experience and opinions with either/both.    Please send to me directly \n>> (yes, this IS my work email), I will summarize (named or anonymous, as \n>> contributers desire) to the list.\n> \n> I've been using RUnit and have been quite happy with it.  I had not\n> heard of butler until I read your mail (!).\n> \n> RUnit behaves reasonably similarly to other *Unit frameworks and this\n> made it easy to get started with as I have used both JUnit and PyUnit\n> (unittest module).\n> \n> Two things to be wary of:\n> \n>   1. At last check, you cannot create classes in unit test code and\n>      this makes it difficult to test some types of functionality.  I'm\n>      really not sure to what extent this is RUnit's fault as opposed\n>      to limitation of the S4 implemenation in R.\n\nI'd be very interested to hear what problems you experienced. If you \nhave any example ready I'd be happy to take a look at it.\nSo far we have not observed (severe) problems to create S4 classes and \ntest them in unit test code. We actually use RUnit mainly on S4 classes \nand methods. There are even some very simple checks in RUnits own test \ncases which create and use S4 classes. For example in tests/runitRunit.r\nin the source package.\n\n\n>   2. They have chosen a non-default RNG, but recent versions provide a\n>      way to override this.  This provided for some difficult bug\n>      hunting when unit tests behaved differently than hand-run code\n>      even with set.seed().\n> \n> The maintainer has been receptive to feedback and patches.  You can\n> look at the not-so-beautiful scripts and such we are using if you look\n> at inst/UnitTest in: Category, GOstats, Biobase, graph\n> \n> Best Wishes,\n> \n> + seth\n> \n[...]\n\nBest,\n\n   Matthias\n\n\n-- \nMatthias Burger                     Project Manager/ Biostatistician\nEpigenomics AG    Kleine Praesidentenstr. 1    10178 Berlin, Germany\nphone:+49-30-24345-371                          fax:+49-30-24345-555\nhttp://www.epigenomics.com           matthias.burger@epigenomics.com\n--\nEpigenomics AG Berlin           Amtsgericht Charlottenburg HRB 75861\nVorstand:   Geert Nygaard (CEO/Vorsitzender),  Dr. Kurt Berlin (CSO)\n               Oliver Schacht PhD (CFO),  Christian Piepenbrock (COO)\nAufsichtsrat:   Prof. Dr. Dr. hc. Rolf Krebs (Chairman/Vorsitzender)\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}