{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "penchant: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\nFind out how to release your inner genius and ace your exams\nin Teresa Bolen's epochal book, MASTER PLAN TO MASTER EXAMS:\nHOW TO DISCOVER YOUR HIDDEN ABILITIES TO CREATE THE SUCCESS YOU DESIRE.\nYou'll get a package of wonderfully empowering F-R-E-E Bonus Gifts from\nsome of the world's leading success and learning experts -- take action NOW.\nRelease Your Inner Genius Abilities Today\nADVERTISEMENT\nWord of the Day for Wednesday, May 16, 2007\npenchant \\PEN-chunt\\, noun:\nInclination; decided taste; a strong liking.\nBen was a dreamy little boy, recalls Hiddy, who always thought her brother's penchant for reveries might lead him to become an artist or a great philosopher. -- Thomas Maier, Dr. Spock: An American Life\nField, in his personal comportment, maintained a penchant for austerity, a contempt for frivolity, and a \"steely cold\" disdain for any decision not based on fundamental business principles. -- RolandMarchand, Creating the Corporate Soul\nEven as an adolescent bookkeeper in a trading house in Cleveland, Rockefeller minutely recorded his charitable donations in ledgers, which confirm that from an early age he had a penchant for giving money no less than for making it. -- Ron Chernow, \"Mystery of the Generous Monopolist\", New York Times, November 18, 1998\nPenchant comes from the present participle of French pencher, \"to incline, to bend,\" from (assumed) Late Latin pendicare, \"to lean,\" from Latin pendere, \"to weigh.\"\nDictionary.com Entry and Pronunciation for penchant\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9611453-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}