{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"Health Week\" <mailings@mail.cnn.com>", "subject": "This Week in Health", "body": "\n\n\n\n\nCNN.com - Health Week\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFriday, June 15, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFDA advisers reject Sanofi-Aventis weight-loss drug\nFederal health advisers unanimously rejected the weight-loss drug rimonabant this week, voting 14-0 that the manufacturer, Sanofi-Aventis SA, had failed to prove that it is safe. A Food and Drug Administration medical officer had told the panel that the drug increases the risk of suicidal thoughts and other psychiatric problems. The FDA usually follows the advice of its advisory panels but is not required to do so. It's decision is expected by July 27.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudy: Race disparity in medical care persists\nBlack people were far less likely than whites to get specialized care after a heart attack and were more likely to die within a year,  says a study showing persistent racial disparities in medical care.\nFULL STORY\n\n\n\n\n\n\nVaccine-autism link claims get day in court\nThe first test of nine test cases alleging that autism was caused by common childhood vaccines began this week; a victory could pave the way for thousands of autistic children to receive compensation.\nFULL STORY\n\n\n\n\n\n\nPossible early ovarian cancer signs ID'd\nFor the first time, cancer experts are advising women of certain symptoms that might alert them to ovarian cancer, a medically infamous \"silent killer\" that is hard to spot early and is one of the deadliest cancers.\nFULL STORY\n\n\n\n\n\n\nCDC: Lyme disease cases in U.S. doubled since 1991\nThe number of cases of Lyme disease has doubled in the United States since 1991 and these numbers are probably underestimated, the Centers for Disease Control and Prevention says.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Health Week email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}