{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Clark Corona\" <maccazarzaquemadadoc@cazarzaquemada.com>", "subject": "Get your ideal weight with this natural method", "body": "\nCheck out the wonders of pound melting\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting lose flesh product is now readily available – As were seen on CNN\n\n\n\nDo you realize that excessive body kilos kill very much people around the planet? We believe you hate the ugly appearance of people like those and the social stigmata attached to them. \n\nMoreover, you have not the will to withstand a siege of your pernicious eating habits. If it all sounds familiar, then we got something for your consideration!\n\n\n\n\n\nHere Anatrim comes, the recent product for the reduction of your body’s extra weight. The astonishing thing about Anatrim is it improves the quality of your life by repressing your feeling of hunger and giving you better cheer. Here’re what people write on this product:\n\n\n\n\n\n\"It is outstanding! \n\n\nInstead of always glutting myself with food and watching TV continually \n\n\nI became keen on doing sport.\n\n\n\n\n\n\n Anatrim set me on the right track.\n\n\n I have a great form now and there are lots of men in my way!\"\n\n\n\n\n\n\nSilvia D., San Diego\n\n\n\n\n\n\n\"Passive weight reducing was of little result to me. This terrible appetite would just rush in and spoil everything. \n\n\nOnce I was told about Anatrim my very best friend by and I was really effected at the information.\n\n\n I had attempted taking it, and my wife said I'm a different person now, 4 months later. \n\n\n34 pounds off and it is still far to an end! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nDave Klark, Boston\n\n\n\n\n\nAnatrim helps your brain to understand that you doesn’t have such a great need for that much food. It lifts your mood up, gives you energy, and attacks useless kilos. Especial thanks to its powerful comprehensive formula!!\n\n\n\nWorm out more information!\n\n\n\n"}