{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nThe scourge of terrorism got worse last year. A\n  new report says attacks worldwide jumped 25 percent — and that's not\n  all. David Martin at the Pentagon will have the latest on what the report\n  means for the war on terror.\n \nA victory in that war was won in Britain today. Five defendants\n  were found guilty of plotting a massive terrorist attack. They were\n  discovered during one of the country’s most intensive surveillance\n  operations ever. Sheila MacVicar will have the latest.\n \nA woman known as the D.C. Madam has everyone talking\n  inside the Beltway and beyond. She says she's not naming names —\n  exactly. Instead, she has handed over her phone records, which reportedly\n  list prominent individuals — among them executives, the head of a conservative\n  think-tank and an administration economist — as clients. Bob Orr will\n  have the story.\n \nVenezuelan president Hugo Chavez claimed today that\n  Cuban president Fidel Castro is back \"in charge\"  after being\n  out of the public eye for more than nine months while recovering from\n  intestinal surgery. But is the 80-year-old Castro well enough to lead? Lara\n  Logan, our chief foreign correspondent, will report from Cuba.\n \nWe will also take you to Shandong Province, China,\n  known as the world’s salad bowl — it exports more produce than\n  anywhere else on the planet. It's an open secret that manufacturers there add\n  melamine to pet food to boost apparent protein content — a fact that\n  has brought the entire region under intense international scrutiny. Can Shandong convince the\n  world its products are safe to eat? Barry Petersen will report.\n \nHad you heard of melamine before it tainted pet\n  food? The chemical can to be used to coat tabletops, fertilize crops and even\n  masquerades as a protein. Nancy Cordes will have more.\n \nCigarettes and drugs can be addictive, but what\n  about your PC? Daniel Sieberg will begin our series \"Caught in the\n  Web\" with the story of a family torn apart by computer-game addiction. \n \nFinally, our chief White House correspondent Jim\n  Axelrod will report on White House press secretary Tony Snow’s return\n  to work five weeks after doctors discovered a recurrence of his cancer. Snow\n  said he feels \"unbelievably lucky and unbelievably blessed.\"\n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}