{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nOur top story tonight is the U.K. terror plot, which is being investigated\n  on both sides of the Atlantic. We have a\n  trio of correspondents working on the story from London,\n  Glasgow and here in the United States.\n \nMark Phillips will have the very latest on the\n  investigation into the London and Glasgow attacks as authorities\n  have raised their threat alert to its highest level –\n  “critical.” The British government has linked the attempted car\n  bombings to al Qaeda, and several suspects, including three doctors, have\n  been arrested in connection with the plots. Sheila MacVicar will tell us more\n  about these suspects.\n \nIn response to the overseas threat, what is the United States\n  doing to secure its transportation infrastructure? Nancy Cordes will have the\n  latest from airports around the country.\n \nIn Iraq,\n  a U.S. military official\n  is accusing Iran\n  of using its militant group Hezbollah to arm Shiite militants. Our chief\n  foreign correspondent Lara Logan reports the American military believes that Hezbollah\n  had prior knowledge of a deadly attack killing five Americans in Karbala earlier this\n  year.\n \nTurning our attention back home, our chief White\n  House correspondent Jim Axelrod will report on the race for ’08. Now\n  that Barack Obama boasted a donation bankroll of $32.5 million – $10\n  million more than Hillary Clinton earned this quarter – Clinton is calling on Bill,\n  her not-so-secret weapon.\n \nA congressional report criticized the CDC for\n  wasting hundreds of millions of taxpayers’ dollars – and wait\n  until you hear the lavish details. Sharyl Attkisson will have this surprising\n  story.\n \nFinally tonight, Cynthia Bowers will report on a\n  sting operation of sorts – or at least an operation by ex-cons who\n  could get stung by the bees they keep.\n \nI hope you’ll join us tonight,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}