{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "What's advergaming? If you've got kids you'll want to know.  That story tonight on the CBS Evening News with Katie Couric. ", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n \n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening \n            News | 48 Hours | 60 Minutes | The Saturday Early \n            Show | CBS Sunday \n            Morning | Face The \n            Nation\n\n\n\n\n\n\n\n\n\n(CBS) QUOTE OF THE DAY\n“Yesterday I was a dog. Today I'm a dog. Tomorrow I'll probably \n      still be a dog. Sigh! There's so little hope for advancement.” - \n      Charles M. Schulz \n\n\n\nTODAY’S TRIVIA A capon is a castrated rooster. \n      \n\n\n\nTONIGHT ON THE CBS \n      EVENING NEWS Here's an early look \n      at what we are working on for tonight's broadcast of the CBS EVENING NEWS \n      from Anchor and Managing Editor, Katie Couric... Hi everyone, \n      A legendary figure of the religious right has passed away. The \n      Rev. Jerry Falwell died this afternoon. The cause of death wasn’t \n      immediately disclosed but he’s had a history of heart trouble. In his \n      life, he was seen as a visionary to some conservatives and an archenemy to \n      liberals. Falwell leaves a legacy of founding the Moral Majority, \n      bolstering the evangelical community and sculpting it into a major \n      political force. Our Richard Schlesinger will tell the story of \n      this influential man’s life. We’ll also have a slate of in-depth \n      interviews with religious leaders, academics and public figures about Rev. \n      Falwell’s impact on religion and politics in America. In other \n      news, the search continues for information about three U.S. soldiers \n      feared captured by an al Qaeda group during a weekend ambush in Iraq. \n      Troops have detained 11 people and questioned hundreds in connection with \n      the attack. Sharyn Alfonsi is at Fort Drum, New York, where the \n      troops killed and kidnapped last weekend were based. One of the \n      savviest ways companies are reaching kids is through the Internet. But \n      forget old-fashioned pop-up ads. What’s targeting your children is fun for \n      them and highly profitable for the advertisers – it’s called \n      “advergaming,” and John Blackstone will report on the phenomenon \n      for tonight’s installment of “Gotta Have It: The Hard Sell To \n      Kids.” Please join us tonight for \n      these stories and more. Katie For more on two of the \n      stories noted above, please click on the following links...\n\nRev. Jerry Falwell Dead At 73 Click Here Gas Hits Record \n      Prices; Will It Go Higher? Click Here Here's an early look \n      at one of the stories we are working on for Wednesday's broadcast of the \n      CBS EVENING NEWS... Cell phone companies are now targeting TWEENS .. \n      selling them those special phone features that fatten up the bill. Part of \n      our series -- GOTTA HAVE IT, The Hard Sell to Kids. That, and much more, \n      Wednesday night on the CBS Evening News. If you would like more \n      information on the broadcast, please click on the following address and \n      e-mail us: evening@cbsnews.com TONIGHT ON \n      DAVID LETTERMAN Comedian Don Rickles joins Dave tonight along with \n      actor Michael Imperioli… Also, don’t miss a Top Ten List presented by \n      actor Masi Okawill. Plus, musical guests Wilco! \n\n\n\nWEDNESDAY MORNING ON THE EARLY \n      SHOW Harry Smith, Julie Chen and Russ \n      Mitchell anchor THE EARLY SHOW from \n      New York. Dave Price will bring us the weather. Hannah Storm \n      is off. Along with the top news of the day, we will also have \n      the following stories: FAREWELL TO BOB BARKER: Tuesday \n      night on CBS, Bob Barker is hosting a special high stakes money \n      game...The Price is Right One Million Dollar Spectacular. After \n      thirty-five years, the legendary game show host is preparing to step down \n      and enjoy his golden years. EARLY SHOW \n      National Correspondent Hattie Kauffman will have more on his long \n      and stellar career. JUST ASK A WOMAN. . . ABOUT WORK: It \n      comes as no surprise that women ask a lot of questions. So this week we \n      decided to try and answer those questions in a new series Just Ask A \n      Woman. Wednesday morning, we’ll take a look at generations in the \n      workplace. This month alone millions of more women are joining the \n      workforce. And age differences can make for a challenging office \n      environment. Pretty soon one of those younger women could be your boss. \n      Are you ready? And can it really work? We visited one woman in Chicago who \n      is giving a whole new meaning to what it means to be a young boss. Our new \n      EARLY SHOW Contributor Mary Lou \n      Quinlan will join us with more. SHREK THE THIRD \n      PRINCESSES: Shrek The Third reunites all your favorite \n      characters from the first two films with some very funny additions. When \n      there is a coup in the kingdom of Far, Far, Away, Shrek's wife Fiona is \n      joined by some familiar princesses to help save the Kingdom. Cameron Diaz \n      returns as Fiona, Cheri Oteri plays Sleeping Beauty, and Amy Sedaris plays \n      Cinderella. Wednesday morning, we’ll ask the three lovely ladies - Cameron \n      Diaz, Cheri Oteri and Amy Sedaris – what it was like working on the film. \n      CHIC ON A SHOESTRING: With temperatures rising, dressing \n      comfortably for work is of the utmost importance. So how can you achieve \n      casual, effortless style without losing the spirit of summer? Cheryl \n      Kramer of Redbook magazine will join us with some warm weather \n      options perfectly appropriate for a day at the office. SUPREME \n      DISCOMFORT: CLARENCE THOMAS: Clarence Thomas has long been a \n      controversial figure and one who, says author Kevin Merida, is a \n      conflicted man. Is Thomas an affirmative action success story? Or an \n      example of forgotten roots? Thomas has opposed affirmative action and \n      shied away from the liberal agenda. Now, a new profile of the Justice, \n      Supreme Discomfort: The Divided Soul of Clarence Thomas, examines \n      the fascinating figure. Wednesday morning, author Kevin Merida will join \n      us to discuss the man behind the book. WOMEN AND EXERCISE: \n      How much exercise is enough to improve your health? It turns out, just \n      fifteen minutes a day could be all you need to stay healthy. We’ll have \n      the information you need to know before your next workout. \n      JERRY BRUCKHEIMER ON PIRATES OF THE CARIBBEAN: AT WORLD’S \n      END: In his 30-year career as one of Hollywood's hottest producers, \n      Jerry Bruckheimer’s films have taken in over $14 billion dollars. Not bad \n      for a guy who started off as a commercial producer. His latest blockbuster \n      is Pirates of the Caribbean: At World's End, in which the gang sets \n      off on a quest to free Captain Jack Sparrow, and the romance between Will \n      and Elizabeth heats up. Producer extraordinaire Jerry Bruckheimer will \n      join us Wednesday morning with all the details of the latest Pirates \n      flick. If you would like more information on any of these stories \n      or the broadcast, please click on the following address and e-mail us: \n      earlyshow@cbs.com \n\n\n\n\n\n\n\nTO SUBSCRIBEClick here to subscribe to \n      the Inside Scoop.TO UNSUBSCRIBEUnsubscribe information \n      is included in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, \n      click here.Contact: Email Administrator, \n      CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n      10019Help | Advertise | Terms of \n      Service | Privacy \n      Statement©MMVII, CBS \n      Interactive Inc. All Rights Reserved. \n\n"}