{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Henrik Nilsen Omma <henrik@ubuntu.com>", "subject": "Re: heretical thoughts was Re: Speakup dropped from Ubuntu", "body": "Gene Collins wrote:\n>> I'm not qualified to comment on the technical merits of a kernel vs. a \n>> user-space solution, but I know that from a maintenance point of view we \n>> would prefer it.\n>>\n>>     \n> Well, you haven't told us how Speakup adds to your mainttenance\n> problems.  I mean  the only thing extra you are doing is running a\n> checkout script, in order to patch speakup into the kernel.  After that,\n> you are just doing a make oldconfig with the .config file from your most\n> recent kernel.  \nThe kernel is a complex beast. Anything you put into it can have \nunpredictable consequences on the whole. We ship the distro to millions \nof users every 6 months. Those versions all need to be maintained with \nupdates for 18 months, and with LTS for 5 years. Any extra non-standard \nkernel code becomes a maintenance burden. If you have to merge in a \nsecurity patch from kernel.org it helps if your kernel is as close as \npossible to what kernel.org was when you released. Obscure patches with \nlight testing that you have applied earlier on will become a burden.\n\n\n> The problem with having only software synthesis on the system is that\n> when there is a problem, the software synthesis is often the first\n> thing to stop functioning.  \nAgain, that's a bug and a community like this one would do well to help \nfind and resolve those. That would help a much larger, less technical \ngroup in the long term. That is also my main focus. I had hoped this \nhighly skilled community would help me with that.\n\n\n> But when blind folks ask for a solution like speakup and a hardware\n> synthesizer which will function even during a kernel panic sometimes,\n> sighted folks seem to have real trouble understanding the need for\n> reliable access.\n>   \nThat is completely false. The way that speakup made its way into ubuntu \noriginally was that a visually impaired member of our community \nsuggested it for inclusion. He drew up a proper specification for it \nwhich we discussed at the Ubuntu Development Summit in Paris. We held a \nworkshop session about speakup where I and our kernel team was present. \nThere was no lack of understanding for the importance of accessibility \nanywhere in this process. (we regularly invite users and developers with \nvisual impairment to our dev summits, in November we have a a whole \nmini-conference about this).\n\nWe agreed that we would include speakup in our default kernel for Edgy, \nbut the maintainer expressed concerns about future maintainability \nalready at that point. We agreed that we would engage with the speakup \ncommunity and offer help with getting it into mainline. I did that, but \nnothing much came of it. For gutsy we have changed our policy to \nactively reduce the number of non-mainline patches. Speakup is clearly \nnot on track for inclusion at this point and so falls under that policy.\n\n> I don't recall seeing any requests here from Ubuntu folks for help with\n> maintenance issues for Speakup.  \nhttp://speech.braille.uwo.ca/pipermail/speakup/2006-October/040394.html\nhttp://speech.braille.uwo.ca/pipermail/speakup/2006-October/040435.html\nhttp://speech.braille.uwo.ca/pipermail/speakup/2006-October/040639.html\nhttp://speech.braille.uwo.ca/pipermail/speakup/2006-November/040979.html\nhttp://speech.braille.uwo.ca/pipermail/speakup/2006-November/041049.html\n\nLots of debate. Little or no direct involvement from the speakup \ncommunity in ubuntu to help improve our support for it or help maintain \nor move it forward.\n\n> It appears to me that what we have here\n> is a group of sighted folks who don't use the technology making\n> decissions about what blind folks need or don't need, want or don't\n> want.  In my view, that's inappropriate.\n>   \n\nYou are not doing yourself any favours by making this into a blind vs. \nsighted issue. The blind/vi Linux community is quite numerous and could \nhave a massive impact on progress in general accessibility on the \nplatform and could help other weaker groups in the process. But to do \nthat you have to get organised into a community structure and engage \nconstructively with other parts of the free software community. That's \nhow things get done in the free software world.\n\nThis list seems to be doing a god job at providing peer-help using the \nexisting tools, but I see little innovation and reaching out to other \nprojects going on. I don't see a roadmap or advocacy campaigns for example.\n\n> I make my living as a computer consultant.  It will be to bad if I'm\n> forced to recomend that folks stay clear of Ubuntu because of it's lack\n> of support for text console accessibility, but if that's the choice I'm\n> force to, then that's what I'll do.  I hope the folks managing Ubuntu\n> will reconsider their decission, but if not, all I can do is steer clear\n> of distros that insist on causing me grieff.\n\nThis is what I mean by 'not engaging constructively with the wider \ncommunity'.\n\nHenrik\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}