{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Danny Dye\" <maccbsuccessdoc@cbsuccess.net>", "subject": "Losing weight has never been so easy", "body": "\nMake your fat friends envy you\n\n\n\n\n\nAnatrim – The very up-to-date and most enchanting product for weighty people is now readily available – As were seen on BBC\n\n\n\nDid you see excessive body kilograms kill a lot of people around the world? We know that you hate the ugly appearance of people like those and the low status they have in modern society. \n\nMoreover, you can’t withstand pressure of fatal eating habits of yours. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nWe are proudly introduce you Anatrim, the later product for the reduction of your body’s extra weight. The amazing thing about Anatrim is it raises the quality of your life by soothing the feeling of hunger and giving you better spirit. Here are some notes received from our customers:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of gorging everything close at hand and watching TV constantly \n\n\nI became rather more interested in doing exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I have a great shape now and lots of men devour me with their eyes!\"\n\n\n\n\n\n\nRita R., Bellevue WA\n\n\n\n\n\n\n\"I tried some passive weight burning, but almost with no result. I could not restrain my ravenous appetite. \n\n\nOne day I was told about Anatrim the media by and I rather liked the information.\n\n\n I had attempted using it, and my wife told me that I look very good now, 5 months later. \n\n\n33 pounds off and it’s not a limit! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nMikkey Fox, San Francisco\n\n\n\n\n\nAnatrim helps you to realize you doesn’t have such a great need for the constant eating. It lifts your mood up, provides you with extra energy, and attacks useless kilos. Especial thanks to its powerful distinguished formula!!\n\n\n\nPry out more information!\n\n\n\n"}