{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Jaime Gutierrez\" <nofdeliartrod@deliart.com>", "subject": "End the annoying obesity now", "body": "\nMelt away fat easily\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most exciting lose flesh product is now easily available – As were seen on CNN.\n\n\nCan you remember all the situations when you plead to yourself to do anything for being delivered from this fastly growing number of kilos? Luckily, now no major offering is necessary. With Anatrim, the ground-breaking kilos-melting medley, you can get naturally health lifestyle and become really slimmer. Just look at what people say!\n\n\n\n\"I hate to confess but I was a junk food addict. \n\n\nI devoured all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis suffering stopped when I started course of taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my craving for food decreased, \n\n\nspirits improved and I turned to the happiest person 17 pounds in 2.9 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person on the planet!\"\n\n\n\n\n\nSilvia D., San Diego\n\n\n\n\n\n\"I had problems with over-weight since I was a boy. \n\n\nYou can't even fancy how I hated being ridiculed at school. \n\n\n\n\nI detested my weight and I abhorred even myself. \n\n\nAfter trying this and that I heard about Anatrim. \n\n\n\n\nIt literally pulled me out of this nightmare! The very sincere thanks to you, fellows.\"\n\n\n\n\n\nMikkey Fox, San Francisco\n\n\n\n\n\n\"Know what? Anatrim kept my marriage intact! I went into this circle, depression – more eating – even more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nOnce my friend pointed at your web site and I asked for Anatrim right away. \n\n\nThe result was excellent, my appetite came to admissible level, I was often in good spirits, and, be sure, I tightened my belt with no regrets. And you see me, the bedroom became cool, too!\"\n\n\n\n\n\nLuis\n\n\n\n\n There are lots of thanks happy people leave after trying Anatrim. Don’t you wanna add yourself to the tens of thousands of slender women and men and try this original appetite-decreasing energy lifting product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}