{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "clamber: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Friday, June 15, 2007\nclamber \\KLAM-buhr; KLAM-uhr\\, intransitive verb:\n1. To climb with difficulty, or on all fours; to scramble.\n2. The act of clambering.\nAt one point a whole horde of them fell over a shallow cliff. Plumes of red dust rose in the air as they struggled to clamber back up. -- Thomas Beller, The Sleep-Over Artist\nIt was nature's deep spring of sweet water that he fell into when he was just old enough to say a few words, reaching to retrieve his only toy, a tin cup -- and somehow did not drown but clambered out in time to meet his frantic mother racing down the path. -- Roy Reed, Faubus: The Life and Times of an American Prodigal\nThey rowed decrepit whaleboats up and down the harbor and clambered up into the rigging of the ships. -- Nathaniel Philbrick, In the Heart of the Sea\nHe dithered for a moment, during which time Mrs Hardy, wailing like a banshee, rushed from the dining room and clambered clumsily up the stairs. -- Beryl Bainbridge, Master Georgie\nClamber is from Middle English clambren, probably a modification of climben, \"to climb.\"\nDictionary.com Entry and Pronunciation for clamber\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9928020-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}