{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Collin Ames\" <nexcantonhomeswod@cantonhomes.us>", "subject": "Summer is almost here, be ready", "body": "\nDoctors and Celebrities endorse Anatrim\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most exciting flesh loss product is now available – As told on ABC.\n\n\nDo you hold in your memory all the situations when you appeal to yourself to do anything to get rid of this desperately growing number of kilos? Luckily, now no major price is to be paid. With Anatrim, the ground-shaking kilos-melting medley, you can achieve naturally health lifestyle and become really thinner. Have a look at what our customers write!\n\n\n\n\"It’s difficult to admit it but I was an awful food addict. \n\n\nI greedily devoured all this garbige \n\n\nand was unable to stop. \n\n\n\n\nThis misery stopped after I started taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite abated, \n\n\nspirits increased and I became the happiest person in the world 29 pounds in 2.1 months. \n\n\n\n\nI can tell you now I’m the happiest person on the planet!\"\n\n\n\n\n\nLusia R., New York\n\n\n\n\n\n\"I had weight problems since I was a boy. \n\n\nYou can't even fancy how I detested being mocked at school. \n\n\n\n\nI detested my stoutness and I detested even myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nIt literally dragged me out of this awful nightmare! A plenty of thanks to you, my friends.\"\n\n\n\n\n\nSteve Burbon, Washington\n\n\n\n\n\n\"Do you know what? Anatrim kept my marriage intact! I went into the circle, depression – more eating – just more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nOnce one of my friends pointed to your web page and I ordered my pack of Anatrim at once. \n\n\nThe result was excellent, my appetite came to normal level, I was in good spirits oftener, and, be sure, I tightened my belt with no regrets. And you know, the sex became fantastic, too!\"\n\n\n\n\n\nMichael\n\n\n\n\n There is a great number of gratitudes delighted people leave after trying Anatrim. Don’t you gonna join the thousands and thousands of slim buyers and take this natural appetite-suppressing energy increasing product now!\n\n\nDo not miss the chance!\n\n\n\n\n"}