{"category": "ham", "to_address": "\"Pietrzykowski, Matthew (GE, Research)\" <pietrzyk@research.ge.com>", "from_address": "Marc Schwartz <marc_schwartz@comcast.net>", "subject": "Re: [R] R 2.5.0 Help - problems with search", "body": "On Thu, 2007-05-10 at 08:29 -0400, Pietrzykowski, Matthew (GE, Research)\nwrote:\n> Hello-\n> \n> I recently upgraded from R 2.4.1 to R 2.5.0 and have tried to used the \n> search engine with minimal results.  When I enter the command,\n> \n> > help.start()\n> \n> My browser opens with the main html interface.  When I click the link\n> for the search engine,  the search page comes up, but when I enter a \n> search term the result is always \"undefined\".\n> \n> I am looking on my end for browser setting options, but would like to\n> know\n> if there was an error in installation that I am not aware of.\n> \n> Thanks,\n> \n> Matt\n\nYou don't indicate what OS you are on, but your message headers suggest\nWindows.\n\nWhen you get to the Search Engine page, take note of the following text\nbelow the search buttons:\n\n\n\"For search to work, you need Java installed and both Java and\nJavaScript enabled in your browser.\n\nOn the Mozilla/Netscape family of browsers you should see `Applet\nSearchEngine started' at the left edge of the status bar. For help\nconsult the R Installation and Administration manual.\n\nOn Mozilla-based browsers the links on the results page will become\ninactive if you return to it: to work around this you can open a link in\na new tab or window.\n\nEven if this search does not work on your system, you can always use\nhelp.search at the R prompt.\"\n\n\n\nCheck on the above, including the additional information on the manual\nlink page and if you still have no resolution, post back with further\ndetails.\n\nHTH,\n\nMarc Schwartz\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}