{"category": "ham", "to_address": "R-help@stat.math.ethz.ch", "from_address": "Robert A LaBudde <ral@lcfltd.com>", "subject": "Re: [R] [Not R question]: Better fit for order probit model", "body": "At 01:29 PM 6/17/2007, adschai wrote:\n>Thank you so much Robert. Please find the information below.\n>\n>The scale 1-10 are subjective physical condition ratings scored by \n>inspection engineers at the site. 1-5 are in very bad conditions \n>(bridge close down to seriously deteriorated). The rest from 6-10 \n>are categorized as good condition.However, the proportion of samples \n>in my data are as follows. Bridges with 1-5 scale covers about 2-3% \n>of total population. The majority of the bridges are in 7-8. \n>Certainly, I have enough data for model estimation but the mix of \n>the proportion is good. I attached the detail of condition rating \n>scale at the end of this message.\n>\n\nMy guess is that you really have two distributions here: 1) Bridges \nthat are basically under proper supervision and repair (Categories \n6-10), and those that are not Categories 1-5). These two classes \nwould probably have dramatically different relations to the \ncovariates your are using.\n\nSo my recommendation would be to consider splitting your response \ninto two classes (0/1), each with 5 sub categories.\n\nKeeping the two classes merged together in a single group is \nequivalent to merging two different distributions with a weighting \nfactor. This may be causing a bimodal distribution which is giving \nyou problems.\n\nYou could try your modeling on each of the two classes separately \nbefore continuing with your full dataset modeling. You may learn \nsomething useful to help you with your problems.\n\nFor the full model, you would need to include a full set of \ninteraction terms with \"class\".\n================================================================\nRobert A. LaBudde, PhD, PAS, Dpl. ACAFS  e-mail: ral@lcfltd.com\nLeast Cost Formulations, Ltd.            URL: http://lcfltd.com/\n824 Timberlake Drive                     Tel: 757-467-0954\nVirginia Beach, VA 23464-3239            Fax: 757-467-2947\n\n\"Vere scire est per causas scire\"\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}