{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] WHO public health, innovation and intellectual property discussions", "body": "WHO public health, innovation and intellectual property discussions\nresumed at 10:00 AM in Committee Room B at the Palais des Nations.\n\nCurrently, the World Health Assembly is discussing the draft Brazilian\nresolution, A60/B/Conf. Paper No.3 Rev. 1 (21 May 2007) will be\ndiscussed.  This is a revised text.\n\nNew additions to the declaratory language include:\n\n\n\"Welcoming, with enthusiasm, the commitment of the Director-General to\nthe process spearhearded by the Intergovernmental Working Group on\nPublic Health, Innovation and Intellectual Property:\n\nEXPRESSES appreciation to the Director-General for her commitment and\nencourages her to guide the process to draw up a global strategy and\nplan of action that will provide a medium term framework for\nneeds-driven essential health research and development;\"\n\nSome additions to the operative language include:\n\n\"2.  REQUESTS the Director-General:\n\n\n(1)  to provide technical and policy assistance to countries that want\nto make use of the TRIPS flexibilities to increase access to medicines,\nvaccines, diagnostic tools and other healthcare products in\nimplementing the Doha Declaration on TRIPS and Public Health;\n\n(2) to provide technical and financial support for regional\nconsultative meetings in order to set regional priorities that will\ninform the work of the IGWG;\n\n(3) to encourage the development of proposals for a health needs-driven\nR&D system for discussion at the IGWG that separates paying for the\ncost of R&D from the price of medicines, vaccines, diagnostic tools and\nother healthcare products.\n\n\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}