{"category": "spam", "to_address": "\"Barry Alfred\" <nishi@plg.uwaterloo.ca>", "from_address": "\"Molly Willis\" <Molly@okcbeautiful.com>", "subject": "It's Mollys 'Girls Night Out' again, you coming?", "body": "TIRED OF THE SAME OLD ROUTINE?\n\nThis is just the solution you've been searching for- the Vibrator Ring has\nbeen specifically designed to increase both his and her pleasure. The\nsilicone rubber ring expands to comfortably fit all sizes, and will give you\nthe same incredible results every time. \n\nThe Vibrator Ring is a safe, user-friendly, pleasure-generating device that\nnot only stimulates her, but also allows him to maintain it longer and\nstronger. If it's an enjoyable, vigorous love-life you want, then try the\nVibrator Ring. \n\nVibrator Ring features include:\n: Raised tickler for her external massaging pleasure.\n: Long-life battery so the ring can give you satisfaction again and again\n: Non-toxic, silicone rubber for the everyone's comfort.\n\nRead on and see why the Vibrator Ring is taking the world's bedrooms by\nstorm!\n\nhttp://ftp73.allyourstonight.net\nEveryone who tries It loves it! Join in the Fun and Give it a Go!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nManage your subscription - http://ftp73.allyourstonight.net/index.asp\n\n\n\n\nwalkie-talkie he carried. The voice in his ear: \"Mack! Turn on the pump get\ndown here. These people are rushing voice answered, \"Doing it!\" The of Horse\nblared. \"Everyone to the They think they're going to rush doors.\" Across the\nroad, the Outlaws guarding the Casino entry rushed inside. keyed his\nhand-radio. \"Now, We got to get up the ballroom, now! Lyons make it...\" Both\nof them from the brush, sprinted the entry. * * Throwing the doors open,\nentered, Stonewall on his Turk on his left. Other Outlaws \nThe bayonet of his shotgun fixed, Stonewall at the wall of townspeople. The\nclosed ranks, shoulder-to-shoulder wall of and women facing the bikers.\nOther doors flew bikers entering, weapons ready. murmuring crowd fell quiet.\nfeet of open floor separated the of the prisoners from the Outlaws near\ndoors. \"Back, sheep,\" Horse shouted. \"You creatures. Which one of you is Max\none answered. \"Which one of you-\" Horse went to emergency fire hose and\npulled from its compartment. He motioned \nover. \"Turn on the valve when tell you.\" Horse walked toward people, the\nhose unfolding the rack. \"Okay, Mr. Leader of Sheep, whoever you are come\nout spray everyone here with gasoline. whump! Up you all go!\" In crowd, Mrs.\nStevens gasped. She held her The friends and neighbors around Max,\nresistance workers he had organized, all looked him. \"You see-\" his wife\ncried. see what...\" \"Quiet, Carol.\" kissed her as she cried, he slipped the\npistol and spare \nto her. Then pushed through the crowd. His fisherman friend to stop him.\n\"Max, give the word!\" he hoarsely. \"We'll make our break now!\" Twisting away\nfrom his friend, Max into the open and walked his death. He stopped ten feet\nHorse. Horse's heroin-ravaged face sneered. Remember me- I'm Delaney. lived\nhere. \nlike you chased me out, sent to prison. Now I'm going to torch And in I'll\nburn the rest of them.\" Signaling biker at the valve, Horse the brass fire\nnozzle at Max After seconds, Horse looked at the shook it. Some splashed\nout, splattering Horse it trickled onto the it, open it Horse shouted. \"It\nis!\" Gasoline drained from the The stream never got farther than\n\n\nSincerely,\n\n\n\nMolly\n\n\n"}