{"category": "spam", "to_address": null, "from_address": "martins email <akathebest18@hotmail.com>", "subject": "", "body": "\n\n\n\n\nThanks for giving me your time. I am Sir. James Martins .A, a consulting auditor attached with a private Banking Services in London - UK. I am contacting you concerning a customer of our bank who had an investment placed under the bank's management 3 years ago valued at 14.2 Million United States Dollars which he wished to have us turn over on his behalf.\n \nIn August 2004, he asked that the money be liquidated because he needed to make an urgent investment requiring cash payments. He directed that I liquidate the funds and had it deposited with HANDELSBANKEN, a top Swedish bank but due to the complexities of the task he was asking of us, he later instructed the transfer to be stopped and told me he would use the money upon his arrival from the States. This was the last communication we had since then. The bank has launched an investigation to know his where about but to no avail. In his bio-data form, he listed no next of kin this is because in the field of private banking, opening an account means no one will know of its existence, accounts are rarely held under a name. Depositors use numbers and codes to make the accountsanonymous.\n \nAs things stands now, there is 18.5 Million USD as value for his investment and the bank has no single idea of the history or nature of the deposit. They are simply awaiting for instructions to release the deposit to any party that comes forward. This bank has spent great amount of money trying to track the man's family and have investigated for months but found no known relative. After going through your profile, I decided to contact and place you in a position and instruct the bank to release the deposit to you as the closest relation. Upon receipt of the deposit, I am prepared to share the money with you and no more. That is, we share the proceeds 85% for me and 15% for you. All the expenses to ensure a smooth and successful transfer of the fund to your account will come from my side. I only need your full co-operation and to be following my instructions strictly. \n     \nGet back to me with the following to enable us proceed accordingly:  (1) Your correct bank account information for the transfer. (2) Your direct telephone numbers where you can easily be reached to enable me contact you for us to have a heart to heart conversation. (3) I want you to re-assure me that you will never let me down either now or in future.\n \nHope to hear from you.\n \nSir. James Martins \nakathebest01@excite.com\nakathebest01@hotmail.com\nakathebest01@yahoo.ca   +44-702-407-3432Explore the seven wonders of the world Learn more!\n"}