{"category": "ham", "to_address": "Andrew Niccolai <andrew.niccolai@yale.edu>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] Follow up:  surfaces and digital terrain model", "body": "I believe you are looking for the function contourLines() in package \ngraphics.\n\nAt some point in the intervening years there was a clines package on CRAN, \nand if you know that you can find it at \nhttp://cran.r-project.org/src/contrib/Archive/C/clines_2.0-2.tar.gz\nThat confirms it has been superseded by contourLines.\n\nBTW, it is Paul Murrell (two l's) we have to thank for this.\n\n\nOn Thu, 31 May 2007, Andrew Niccolai wrote:\n\n> I realize that as of yesterday, this message thread is 4 years old but can\n> someone possibly post the clines function that Renaud mentions in the\n> posting below?  That would be wonderful and most appreciated.\n>\n> Thanks,\n> Andrew\n>\n>\n> Andrew Niccolai\n> Doctoral Candidate\n> Yale School of Forestry\n>\n>\n>\n> From: Renaud Lancelot \n> Date: Fri May 30 22:37:02 2003\n>\n> Yesterday, I posted the following:\n>\n>>> I have computed a digital terrain model from a set of points (x, y, z)\n>>> using the function interp() in package akima. I want to predict flooded\n>>> surfaces given target values of z. I can display the flooded surfaces\n>>> with contour() or image(), but I don't know how to get the polygons\n>>> delimiting the surfaces. Did anyone write a function for this purpose ?\n>\n> Many thanks to Roger Bivand, Paul Murrel, Deepayan Sarkar, Barry\n> Rowlingson and Thomas W Blackwell for their replies and their help. Paul\n> Murrel provided me with a function \"clines\", kindly ported to Windows by\n> Duncan Murdoch. This function does exactly what I need, i.e. it returns\n> a list of polygons corresponding to target value(s) of z.\n>\n> I wrote a function to compute (hopefully !) what I want, i.e. predicted\n> flooded surfaces given target values of z (managing the cases of several\n> independent watered surfaces, possibly with islands). Provided that Paul\n> Murrel agrees to share his function, I will be happy to send it to\n> anyone wishing to use and improve it (and debug it ;-) ).\n>\n> Best regards and thanks again,\n>\n> Renaud\n>\n>\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}