{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "Direct2Drive <owner-d2d_cp_announce_list@news.ign.com>", "subject": "Download Killer Deals on Direct2Drive.com Today!", "body": "\n\n\nDirect2Drive\n\n\n\n\n\n\n\n\nApril 20th, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlayboy: The Mansion - $19.95\nLive the Playboy Lifestyle - What use is a stylish pad if you can't share it with hundreds of celebrity friends? Spend the afternoon poolside with a bevy of beautiful women, and then change into your finest pajamas for an evening of decadent dancing with chart toppers...\n \n7 Sins - $19.95\n7 Sins is an action-oriented life simulation that immerses mature players in a world of celebrity and greed... \n \nTitan Quest - $19.95\nFrom Age of Empires co-creator Brian Sullivan and Braveheart writer Randall Wallace comes an innovative, all-new action role playing game set in ancient Greece, Egypt and Asia.\n...\n\n\n \n \n \n \n \n\n\nSid Meier's Railroads! - $19.95\nThe Golden Age of railroading is back with Sid Meier's Railroads! Combining the best of real-world and model railroads, Sid Meier's Railroads! puts you in charge of building your own railroad empire...\n \nFar Cry - $9.95\nAfter escorting an inquisitive journalist to a remote tropical island, Jack Carver finds himself stranded in paradise, hunted by an unrelenting team of highly trained mercenaries...\n \nTom Clancy's Ghost Recon: Advanced Warfighter - $19.95\nToday's lethal weapon is technology, but on the battlefield you still need to make your way through enemy lines.  \n\n\n \n \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\nSTALKER: Shadow of Chernobyl\n$39.95\n6\n\n\n24 Season 6 Latest Episode\n$1.99\n\n\n2\n\n\nThe Elder Scrolls IV: Oblivion - Shivering Isles Expansion\n$29.95\n7\n\n\nTitan Quest\n$19.95\n\n\n3\n\n\nSupreme Commander\n$49.95\n8\n\n\nMatrix Online\n$19.99\n\n\n4\n\n\nVanguard: Saga of Heroes\n$39.99\n9\n\n\nSid Meier's Railroads!\n$19.95\n\n\n5\n\n\nTitan Quest Bundle\n$44.95\n10\n\n\nCivilization 4\n$39.95\n\n\n\n\n\n\n\n\n\nTo Unsubscribe: Click Here.\n\t\t\t\nYou have received this e-mail because you are a registered user of GameSpy and have opted-in to receive GameSpy email updates concerning new products and services. If you believe you're receiving this e-mail in error or prefer not to receive promotions from GameSpy.com, reply to this message to opt out of future promotional mailings. Our privacy policy is viewable at http://corp.igngamespy.com/privacy.html. You may still receive other e-mails from GameSpy. To update your e-mail address or manage your account, visit GameSpyID.com. It may take up to 10 days for adjustments to your email preferences. If you have questions about this offer or your services, you can reach Customer Service here.\n\t\t\n\t\tYou may mail inquiries to: IGN Entertainment, Inc., 8000 Marina Boulevard, 2nd Floor, Brisbane, CA 94005\nCopyright © IGN Entertainment, Inc. All rights reserved.  \n\n\n\n\n\n\n\n\n\n\n\n\n"}