{"category": "ham", "to_address": "<Ip-health@lists.essential.org>", "from_address": "\"charlesclift@tiscali.co.uk\" <charlesclift@tiscali.co.uk>", "subject": "[Ip-health] Economist Article", "body": "Drugs companies' patents are under attack. Will this really help the\npoor?\nJun 7th 2007 | NEW YORK\n>From The Economist print edition\n\nNOBODY could fault Thailand for want of ambition. At the recent Bio\nconference, the largest annual gathering of the biotechnology industry,\nit pitched itself hard as an emerging pharmaceutical power, with a\ndazzling pavilion, visiting luminaries and free drinks for all.\nInstead, the arguments with Thailand are over means, not ends.\n\nAt the end of last year the Thai government stunned the drugs industry\nwhen it said it would overrule international patents for Efavirenz, an\nanti-retroviral drug made by Merck, an American firm, and switch to a\nThai-made generic copy at half the price. The country had signed the\nAgreement on Trade-Related Aspects of Intellectual Property Rights\n(TRIPS), which protects drugs patents. But that deal allows \\u201ccompulsory\nlicensing\\u201d only under special conditions\\u2014conditions that some\ncomplained Thailand did not fulfil.\n\nIn the months since then, Thailand has said it would overrule the\npatents on two more drugs, and it may soon add a further pair to the\nlist. Moreover, other countries have followed its lead. Brazil declared\nlast month that Merck was charging too much for Efavirenz. In recent\nweeks the health ministers of India, Malaysia and Kenya have also\nmuttered about pursuing compulsory licensing.\n\nAll this has sparked an almighty row. Many global-health advocates\\u2014\nincluding Bill Clinton, whose foundation works on HIV\\u2014have applauded\nthe trend, arguing that access to cheap generic drugs will greatly help\nthe poor. Last month the World Health Organisation passed a resolution\nsupporting compulsory licensing. America objected vociferously, but\nother rich countries supported the motion.\n\nDrug executives are furious. Jon Pender of GlaxoSmithKline, a British\ndrugs giant, insists that compulsory licensing was meant to be used\nonly \\u201cas a last resort\\u201d. He argues that although compulsory licensing\nis legal, TRIPS rules allow it only under limited circumstances, such\nas national health emergencies, and only after lengthy efforts to\nnegotiate prices with firms.\n\n\\u201cIt is easy to see Big Pharma as a source of evil,\\u201d laments Daniel\nVasella, chairman of Novartis, a Swiss drugs giant. His firm is\ninvolved in a closely watched patent case in India that involves\nGleevec, a cancer drug. Without innovation, he insists, future\ngenerations will have fewer life-saving drugs\\u2014\\u201cwhich is equally\nunethical as lack of access now.\\u201d And as Fred Hassan, the boss of\nAmerica's Schering-Plough and head of the international pharmaceutical\nlobby, warns, \\u201cwithout intellectual property there is no innovation.\\u201d\n\nAt first sight, this row reflects an old dilemma that pits today's\npatients against tomorrow's. Compulsory licensing means that more Thais\nwill get HIV drugs now, but it also means that drugs firms will be less\nkeen to invest in drugs for Thailand in the future. Yet look closer and\nthis is more than a fight between the poor-country sick and rich-world\ndrugs companies. What makes it different is the role of two new actors:\nmuscular middle-income countries and the rising generics industry.\n\nThis controversy has been sparked not by the poorest countries, which\nalready get most of their drugs at low cost, but by middle-income ones.\nThey have long used the threat of compulsory licensing to win\ndiscounts, but by actually imposing such licensing they shift the\nbalance of power. Rudolf Van Puymbroeck, a former senior lawyer at the\nWorld Bank, likens compulsory licensing to other sorts of compulsory\nstate purchases: \\u201cFirms are upset not because this is illegal, but\nbecause they are in a very weak position to negotiate compensation\nafter expropriation.\\u201d\n\n\n\nFollow the money\nA perverse result of this trend is that middle-income countries are\ngetting cheaper drugs, whereas quieter and perhaps more deserving\nneighbours are not. Thailand's poor no doubt need treatment, but the\nmilitary regime is wealthy enough to spend more on health care. Richard\nEpstein of the University of Chicago law school has observed that there\nis nothing to stop AIDS organisations or foreign governments from\nbuying these products at a negotiated price and then giving them away\nfree. \\u201cCharity can come from anywhere, not just drug companies,\\u201d he\nnotes.\n\nEven experts devoted to the cause of helping the poor get access to\ndrugs see the trend as worrying. \\u201cBrazil is not Rwanda, which cannot\nafford to pay,\\u201d says Tadataka Yamada of the Gates Foundation, a giant\ncharity. Victoria Hale, head of OneWorld Health, an innovative non-\nprofit pharmaceutical firm, reckons that compulsory licensing could\nprove \\u201cthe last blow\\u201d that pushes the drug industry away from looking\nfor cures for diseases of the poor world, which are already woefully\nneglected.\n\nWhether or not the poor end up suffering in the long run from\ndiminished innovation, a sure winner from the trend towards compulsory\nlicensing is the generic-drugs industry. Under a provision of the TRIPS\ntreaty, countries that invoke compulsory licensing but lack domestic\nmanufacturing are allowed to import generic drugs from another\ncountry.\n\nThis promises a gold rush for generics firms. Canada encourages\ndomestic firms to produce copycat drugs for precisely this reason. But\ntheir costs are so high that such exports cannot hope to compete with\nthe cheaper pills produced by India, argues Amir Attaran of the\nUniversity of Ottawa. Small wonder that executives at Cipla, one of the\nIndian firms already making generic versions of HIV drugs, warmly\napplaud the trend and welcome Brazil's support for compulsory\nlicensing, which they say \\u201chelps protect the rights of citizens\\u201d.\n\nDoes the future therefore belong to compulsory licensing? If so, there\nmay be trouble ahead for both pillmakers and punters. Dr Yamada fears\nthat compulsory licensing could prove \\u201clethal\\u201d for the industry. He\nsuggests that drugs firms and middle-income countries ought instead to\nuse a sliding scale, based on GDP per head, to determine prices. Bruce\nLehman, a lawyer who worked on the TRIPS accord in the Clinton\nadministration, thinks it is cynical for middle-income countries \\u201cto\navoid paying their fair share of drug-discovery costs\\u201d. In doing so, he\nfears, they risk provoking a backlash from Americans who will, in\neffect, have to pay more as a result.\n\nBut things may not get that ugly, thanks to the growing influence of\ninnovators in developing countries themselves. Even in India drugs\npatents have their defenders. Ranbaxy is a local firm that made its\nname by manufacturing knock-off drugs. But ask Ramesh Adige, a member\nof its board, about the current trend and he is quick with his reply:\n\\u201cWe do not encourage compulsory licensing.\\u201d He explains that his firm\nhas 1,100 researchers and invests 7% of its turnover in research and\ndevelopment. It already has process patents, and within two years hopes\nto have patents for novel drugs (for malaria, possibly). \\u201cWe are very\nsupportive of intellectual-property rights, as innovations must be\ngiven their reward,\\u201d he says.\n\nThe reason Ranbaxy has gone from ignoring patents to defending them is\nthat it now has inventions of its own that it wishes to protect. Even\nYongyuth Yuthavong, Thailand's science and technology minister, seems\nto acknowledge the risk his country is taking. \\u201cAs a scientist myself,\nI know the value of intellectual property,\\u201d he says. \\u201cIn future, we\nshould develop our own drugs industry.\\u201d\n\n\n\n\n\n\n\n___________________________________________________________\n\nTiscali Broadband only £9.99 a month for your first 3 months! http://www.tiscali.co.uk/products/broadband/\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}