{"category": "ham", "to_address": "\"S Ellison\" <S.Ellison@lgc.co.uk>", "from_address": "Martin Maechler <maechler@stat.math.ethz.ch>", "subject": "Re: [R] Boxplot issues", "body": ">>>>> \"SE\" == S Ellison \n>>>>>     on Fri, 22 Jun 2007 13:02:20 +0100 writes:\n\n    SE> Boxplot and bxp seem to have changed behaviour a bit of late (R 2.4.1). Or maybe I am mis-remembering.\n    SE> An annoying feature is that while at=3:6 will work, there is no way of overriding the default xlim of 0.5 to n+0.5. That prevents plotting boxes on, for example, interval scales - a useful thing to do at times. I really can see no good reason for bxp to hard-core the xlim=c(0.5, n+0.5) in the function body; it should be a parameter default conditional on horizontal=, not hard coded.\n\n    SE> Also, boxplot does not drop empty groups. I'm sure it used to. I know it is good to be able to see where a factor level is unpopulated, but its a nuisance with fractional factorials and some nested or survey problems when many are known to be missing and are of no interest. Irrespective of whether my memory is correct, the option would be useful. How hard can it be to add a 'drop.empty=F' default to boxplot to allow it to switch?\n\n    SE> Obviously, these are things I can fix locally. But who 'owns' boxplot so I can provide suggested code to them for later releases? \n\n\nLegally speaking, I think that's a hard question the answer of\nwhich may even depend on the country where it is answered.\nI would like to say it is owned by the R Foundation.\n\nSuggested improvements of the R \"base code\" should be made and\ndiscussed on the R-devel mailing list. That's exactly the main\npurpose of that list.  \nSuch propositions typically make it into the code base\nif you are convincing and you provide code improvements that\nconvince at least one member of R core that it's worth his time\nto implement, document, *and* test the changes.\n\nAlso, as on R-help, it helps to work with small reproducible\n(ideally \"cut-n-pastable\") R code examples.\n\nRegards,\nMartin Maechler\n\n    SE> Steve Ellison\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}