{"category": "ham", "to_address": "samba-technical@lists.samba.org", "from_address": "\"Stefan (metze) Metzmacher\" <metze@samba.org>", "subject": "Re: svn commit: samba r22731 - in branches/SAMBA_3_0/source: . tests", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nderrell@samba.org schrieb:\n> Author: derrell\n> Date: 2007-05-07 03:02:24 +0000 (Mon, 07 May 2007)\n> New Revision: 22731\n> \n> WebSVN: http://websvn.samba.org/cgi-bin/viewcvs.cgi?view=rev&root=samba&rev=22731\n> \n> Log:\n> \n> - Fix bug #4594.\n>   \n>   configure.in determines if -Werror-implicit-function-declaration is\n>   available, and if so it enables that flag if --enable-developer is\n>   specified.  Since the configure tests themselves did not use that flag, it\n>   was possible for a configure test to succeed, followed by a failed\n>   compilation due to a facility being available but not having a proper\n>   declaration in a header file.  (This bit me with readahead().)  This patch\n>   ensures that if implicit function declarations will kill the build, the\n>   feature being tested is deselected so the build will succeed.\n> \n>   The autoconf manual suggests using return instead of exit in configure\n>   tests because the declaration for exit is often missing.  We require this\n>   now, since we error if prototypes are missing.  See section 5.5.1 of\n>   http://www.gnu.org/software/autoconf/manual/autoconf.html.  This patch makes\n>   these changes, because in fact, an external declaration for exit is missing\n>   here (and likely elsewhere).\n> \n>   I've verified that the features selected (here) with the original\n>   configure.in and the new one are the same except for, in my case,\n>   readahead.  I've also confirmed that the generated Makefile is identical.\n> \n>   These changes are not being applied to the 3.0.26 branch because it does not\n>   exhibit the initial problem this patch is supposed to solve since it doesn't\n>   attempt to use -Werror-implicit-function-declaration.\n\nHi Derell,\n\nI don't think it's correct to use -Werror-implicit-function-declaration\nwithin the configure checks. Because the configure result now may\ndiffers between the normal and developer build.\n\nThe correct fix would be to use a AC_CHECK_DECL() or AC_HAVE_DECL()\nfor the specific function.\n\n(But I like the exit -> return cleanups :-)\n\nmetze\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.5 (GNU/Linux)\nComment: Using GnuPG with SUSE - http://enigmail.mozdev.org\n\niD8DBQFGPtFSm70gjA5TCD8RAtQrAJ0XUIO1nCWoZAHoCrEvBrvcLVG4zwCcDumq\nmkR4QwCqI+N9y88RmivKG6s=\n=Ucou\n-----END PGP SIGNATURE-----\n\n"}