{"category": "ham", "to_address": "smiles@flax9.uwaterloo.ca", "from_address": "TopCoder Competitions <competitions@topcoder.com>", "subject": "Yodlee to Sponsor SRMs with Cash Prizes!", "body": "Hello sm1lies,\n\nTopCoder and Yodlee have paired up to bring you Single Round Matches well worth competing in.  Not only will you get a chance to improve your rating, but you'll also have a chance to chat with a Yodlee representative about their employment opportunities and cash prizes are being distributed to the winners of the matches!\n\n***Yodlee will be giving away $5,000 per match!***\n\nThink financial services is boring? Think again. At Yodlee, we're taking a whole new look at what the Internet can do to transform the way people access, manage, interact with, and transact upon their finances to enable greater insights, control, and 'action'. Come join our revolution...\n \nYodlee today powers online and mobile financial solutions used by nearly 8 million consumers at more than 30 of the top 50 global financial institutions. At Yodlee, you will be working with the latest Web 2.0 technologies, building out a complex infrastructure to support millions of payments and transactions each day across a rapidly growing global network, built from scratch by Yodlee. As an ASP with stringent up-time requirements and enormous scalability and security issues, Yodlee offers unique challenges for developers. Our systems have to scale from mere hundreds to 10s of millions of users. We don't run vast datacenters - our systems have to provide speed, with minimal hardware, and support half a million e-Commerce sessions per hour with sub second response times. \n \nIf you're looking for an environment where innovation and creative approaches are valued, where there are no boundaries for what can be accomplished, and where your work will ultimately transform the online experience for millions of people, then look no further. Yodlee is the place for you!\nhttp://www.topcoder.com/tc?module=Static&d1=sponsors&d2=yodlee\n \nCheck out more information about all that Yodlee has to offer: www.yodlee.com  \n\nDon't forget about the first SRM that Yodlee will be sponsoring on Tuesday, May 29 at 7:00 AM EDT (GMT/UTC -4).  The chat session will start one hour prior to the match. Yodlee will also be the sponsor of SRM 345 on June 14 and SRM 357 on July 12.\n\nBest of luck to you in the arena!\n\n - The TopCoder Competitions Team\n\n\n===================================================================\nYou have received this email because you indicated in your TopCoder profile that you want to be notified of TopCoder News & Events.  If you no longer wish to receive these emails, login to www.topcoder.com/tc and click on 'Update My Profile'.  In the 'Email Notification' section of your TopCoder profile, you have the option to enable or disable receipt of various types of TopCoder emails.  Be sure to save any changes to your member profile.\n\nwww.topcoder.com\nTopCoder, Inc.\n703 Hebron Avenue\nGlastonbury, CT 06033\nPhone: 1-866-867-2633\n\n\n"}