{"category": "ham", "to_address": "R packages list <r-packages@stat.math.ethz.ch>", "from_address": "\"Michael H. Prager\" <Mike.Prager@noaa.gov>", "subject": "[R] [R-pkgs] Update of X2R sent to CRAN, 16 Apr 2007", "body": "X2R is a bundle of three software libraries allowing the user to pass \nstructured data easily from Fortran, C/C++, or AD Model Builder to R.\n\nAn update to X2R has been sent to CRAN today and should be available at \nmirrors shortly. This fixes a bug in the ADMB2R and C2R components in \nwhich data frames were not written correctly when the user did not \nspecify row names. Several other minor improvements also have been made.\n\nThe new version is supplied as files X2R.zip and X2R.tar.gz, which are \nequivalent.  The version and release date can be identified from the \ncontents of file \"VersionInfo.txt\" in the root of each archive. The new \nversion bears date April 16, 2007.\n\n                                * * *\n\n From the original announcement:\n\nX2R is composed of three related software libraries: C2R,  ADMB2R, and\nFor2R (together, X2R). Each contains output routines to simplify\ntransfer of complicated data structures from models written in a\ncompiled language to R.  The user's data can be written as a structured\nASCII file which, when read by R (note 1) with a single dget() function\ncall, will become an R data object of type list. The list, may contain\ncomponents such as data frames, matrices, and other lists.\n\nThese are NOT R packages; rather they are subroutine libraries to be\nused with programmers' own modeling codes.  Limited testing indicates\nthat they are compatible with S-PLUS, as well (note 1, note 2).\n\nLanguages supported are Fortran 95 (with For2R), C and C++ (with C2R)\nand AD Model Builder (with ADMB2R) (note 1, note 3).  Source code and\nusers' manuals are supplied.\n\nThis work has been tested and used by the authors. However, any software\nmay contain bugs, and these works are classified by NOAA as\n\"Experimental Products.\"  Although the software is supplied with no\nwarranty whatsoever, bug reports, suggestions, and extensions are\nsolicited (send to Prager or Martin).  The authors will attempt to fix\nall bugs promptly and to add requested features.\n\nSoftware is now available at CRAN,  http://cran.r-project.org/ .  Look\nunder \"Software / Other\" for the current X2R distribution.\n\n\nMichael H. Prager - mike.prager@noaa.gov\nAndi Stephens\nSoutheast Fisheries Science Center\nNational Marine Fisheries Service, NOAA\n101 Pivers Island Road\nBeaufort, North Carolina 28516 USA\n\nJennifer L. Martin - jennifer.martin@noaa.gov\nNortheast Fisheries Science Center\nNational Marine Fisheries Service, NOAA\n166 Water Street\nWoods Hole, Massachusetts 02543 USA\n\n\n* Note 1.  Use of product names (commercial or otherwise) does not imply\nendorsement or recommendation by any U.S. government agency, nor by the\nauthors in their government capacities.\n* Note 2.  S-PLUS is a commercial product, released by Insightful\nCorporation.\n* Note 3.  AD Model Builder is a commercial product, released by Otter\nResearch.\n\n_______________________________________________\nR-packages mailing list\nR-packages@stat.math.ethz.ch\nhttps://stat.ethz.ch/mailman/listinfo/r-packages\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}