{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"John Heim\" <jheim@math.wisc.edu>", "subject": "Re: Software speech opinions", "body": "\n----- Original Message ----- \nFrom: \"Spie Sutherland\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Tuesday, June 26, 2007 12:37 AM\nSubject: Re: Software speech opinions\n\n\n>I made no mention of corporations, they go for where the huge\n> bucks are, but what I was saying is that there may be a more\n> indirect relation, to things like insurance. In any event, there is\n> something seriously wrong with the assistive tech market as a\n> whole. I used to have a huge collection of links to assistive\n> tech of all kinds. Check out some of these prices as just one\n> example.\n>\n> https://www.assistivetech.com/cgi/shopper.cgi\n>\n> A six foot wheelchair joystick cable is $109. A lightwriter\n> with dectalk voices is $4425. Something is not right.\n\nI was looking into the cost of braille displays a few weeks ago and was \nshocked at the prices. But what makes you think these prices are out of \nline? I mean, maybe it just costs that much per unit because of the low \nvolume. If you figure in R&D costs, support costs, and manufacturing costs, \nmaybe it just costs that much. If not, then why doesn't somebody put out a \n$1000 braille display and wipe out the competition?\n\nAdmittedly, I can see a point on the other side too. We all believe in \ncapitalism but corporations exist in the real world too. There is an ethical \ncontradiction in our society where corporations get legal status as a person \nbut nobody  expects them to act morrally. In  fact, in some circles, if you \nsay corporations should behave as if they have a concience, you're passed \noff as a crazy liberal.\n\nWe don't praise a human being for devoting all of his time and all of his \nenergy toward making money. But the mere suggestion that a corporation might \ndevote some of it's resources toward something other than making money is \nconsidered crazy. But if a corporation is going to be given the right to \nfree speech, for example, then why is it unfair to expect it to have a \nconcience as well?\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}