{"category": "spam", "to_address": "<the00@plg2.math.uwaterloo.ca>", "from_address": "\"Hetty\" <ira@umich.edu>", "subject": "The Howard TV guys had some of the half-time show that they're going to have on Howard TV.", "body": "CDPN Moves To Corners GPS Market In China!\n\nChina Datacom Corp.\nSym: CDPN\nClose: $0.065\n\nCDPN announced Friday that is has acquired all outstanding shares of\nGeneral Link Information Systems, Chinas only GPS vehicle monitoring and\nmanagement system. GPS systems are huge; controlling that market is even\nbigger. Read the news and get on CDPN first thing Monday!\n\nThat also led to Howard talking to Artie about his work schedule and how\nhe could work in some working out even when he's doing the stand-up\nthing around the country. Artie wondered how many he could actually do\nso Howard told him to go give it a try.\nHe then went off on Double A saying that not everyone gets an\ninheritance like he did so not everyone can go out like he does. Howard\nread another one from a guy who was upset with the way he made Mutt take\ndown the pictures he had taken at his private party. She knew who was on\nthe phone and didn't want to talk to him at all. She said that Artie had\nnailed it when he said J-Date. Jon Hein said that they'd be talking\nabout that and about Bubba's ''black voice'' today.\nHoward asked JD if he wanted to hear another clip of his girl in a porn.\nthen he'd beg for her not to tell his boss, but she would tell his boss\nand he'd get fired and go to jail. Howard mentioned that JD is part of a\nfootball game that they're going to be playing during the Super Bowl\nhalf time. Howard said that Mutt can do whatever he wants but he\nshouldn't have posted those pictures from a private party.\nLisa said that he ripped off  a radio there. Howard asked JD what's\nwrong with him because nothing seems to make him happy.\nHe said they'll be talking to Kimberly Kane about her weekend with JD.\nHoward said that the greatest story in the paper is about this psychic\nSylvia Browne.\nThe guys talked about how disturbing Carrot Top looked in the video.\nAt the time the guy bought 150 acres and kept 50 acres for himself. JD's\nfather told some stories about his son and Artie shared some stories\nabout his own life.\nHoward's Noisy Heating System Keeping Him Awake.\nHoward told Bob that he could stick around during the Steve Langford and\nJon Hein updates if he wanted. Howard said that guy will do anything.\nHoward said that a bunch of people got together to fight the possible\nmerger of XM and SIRIUS.\nHe wondered how JD did in the game.\nHoward asked how Lisa met this guy. He said Montel should throw that\nwoman off his show. One person wrote in and said that JD really should\nhave his own show.\nHe said the lawyer who handled his business had bought the land from\nsome other guy. Howard said that Larry Flynt is tough to listen to.\nHoward said we have the most gullible people in this country. Howard\nplayed some more clips of JD's girlfriend getting fucked as he was\ngetting ready to go to break.\nHoward told him he should do the whole Wrap-Up Show in his black voice.\nThat led to Artie asking Howard about his run with Beth and what kind of\nfood he was eating. Howard told JD he sees why he's so messed up after\nhearing the Wrap-Up Show.\n\n"}