{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "Hugo Mallinson <hfm21@cam.ac.uk>", "subject": "Re: etc floppy install question", "body": "Hey Dave, thanks for the quick reply.\n\nIt's the Etch floppy installer image, dated 03/10/07. I'm booting  \nwith the boot and root images, and then loading both net-drivers  \ndisks as well when prompted. The installer immediately goes into the  \nnetwork detection routine, loads the PCMCIA subsystem, and tries to  \nfind the network card. Then it says it can't find anything and offers  \na list of cards, from which I can pick the xirc2ps module. At this  \nstage I've quit the network install and gone back to the main menu to  \nlaunch the terminal, modprobed i82365, then gone back to the main  \nmenu and re-run the network autodetection. I also tried opening the  \nsecond tty and doing the modprobe i82365 while the \"load drivers from  \nfloppy\" window was still up, i.e. before the network autodetection.  \nNeither method gets the card recognized though, either automatically  \nor after I specify the module explicitly.\n\nOn Apr 26, 2007, at 7:19 PM, Dave Patterson wrote:\n\n> * Hugo Mallinson  [2007-04-26 17:01:59 +0100]:\n>\n>> Hi, I have a pretty complicated (at least to me) problem with a DEC\n>> HiNote Ultra 2000. I don't have the CD drive, so I'm trying to do a\n>> network install. The onboard ethernet and modem are handled by a\n>> Xircom combo card in an internal i82365 socket. The external PC card\n>> socket uses the yenta driver. Because of how the init scripts run,\n>> the yenta socket is detected and scanned, but once it's found the\n>> i82365 is ignored. This means I can't get access to that onboard NIC.\n>\n> Which installer are you using, exactly where in the install process  \n> are\n> opening the terminal, and exactly what is the error return on network\n> detection?\n>\n> Ciao,\n>\n> Dave\n\n\n-- \nTo UNSUBSCRIBE, email to debian-laptop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}