{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nRisk Management 101: Managing Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nEPRI's Value \n\t\t\tand Risk in Energy Markets - Introduction & Principles\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for June 5, 2007  \n\n\n\nFirst Enercast Featured Articles for June 5, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nJun 5, 2007 PowerMarketers Industry Publications\n\n\n\nUtiliPoint International Releases Results of ETRM Software Implementation Survey (UtiliPoint.com - Jun. 5, 2007) \n\n\n\nAlbuquerque, New Mexico&#8212;June 5, 2007&#8212;UtiliPoint&reg; International, Inc. (UtiliPoint) announces the completion and release of its report on Energy Trading, Transaction and Risk Management (ETRM) Software Implementation Projects.\n\n\nJun 5, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jun. 5, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 5, 2007\n\n\nJun 5, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nRell signs energy bill into law\n\n\n\nJun. 5--HARTFORD -- Gov. M. Jodi Rell Monday signed into law a Democratic energy bill aimed at long-term conservation and power generation, but used a rarely employed \"line item veto\" to cancel two money-related sections.  Rell said in her veto message that the $100 million she canceled from the energy bill should instead be part of an overall budget plan that still is being negotiated. ...\n\n\nJun 5, 2007 Knight Ridder Tribune Business News\n\n\n\nPower back on for most DTE customers who lost it in storms\n\n\n\nJun. 4--Nearly all of the 20,000 Detroit Edison customers who lost power over the weekend because of heavy thunderstorms have had their service restored. Detroit Edison, a unit of DTE Energy, said about 1,000 residents and businesses are still without power as of this morning. But company officials expect electricity to be back in service by the end of the day.\n\n\nJun 4, 2007 Knight Ridder Tribune Business News\n\n\n\nTXU Energy agrees to record settlement: PUC says firm didn't get explicit consent from users for year contracts\n\n\n\nJun. 5--TXU Energy Retail has agreed to pay a record $5 million settlement to state regulators to resolve claims it violated the law by signing up customers to one-year contracts without their explicit consent.  According to filings with the Public Utility Commission, Dallas-based TXU sent notices to about 4,000 small commercial customers whose contracts were about to expire, telling them their ...\n\n\nJun 5, 2007 Knight Ridder Tribune Business News\n\n\n\nPark Service opposes LS Power coal plant project\n\n\n\nJun. 5--An independent power producer is meeting opposition from the National Park Service about potential air pollution from a planned coal-fired power plant, but a spokesman for Nevada's electric utilities expects no problem with their similar project.  The park service has sent stinging comments in response to an Environmental Impact Statement that was filed for the White Pine Energy Station ...\n\n\nJun 5, 2007 Knight Ridder Tribune Business News\n\n\n\nPUC nominee advocates energy plan\n\n\n\nJun. 5--Gov. Ed Rendell's latest nominee to the state Public Utility Commission sees his goal as helping to bring about a comprehensive energy plan to mitigate increases in electricity and natural gas rates.  It's probably no accident that Ty Christy's goal ties in neatly with the energy independence plan drawn up by Rendell and Kathleen A. McGinty, state Department of Environmental Protection ...\n\n\nJun 5, 2007 Knight Ridder Tribune Business News\n\n\n\nMore challenges leveled at power line\n\n\n\nJun. 5--NORTH COUNTY -- Electricity would be less expensive for area ratepayers if San Diego Gas & Electric Co. chose to rely on new natural-gas-fired power plants in metro San Diego rather than build a power line through the backcountry, according to an analysis by a utility competitor.  In filing a report Friday on behalf of Dynegy, Inc., the company that wants to replace the aging South Bay ...\n\n\nJun 5, 2007 Knight Ridder Tribune Business News\n\n\n\nFormer Enron exec gets 2-year sentence\n\n\n\nJun. 5--HOUSTON -- A former executive of Enron Corp.'s broadband unit, whose testimony was key to the convictions of Enron scandal mastermind Jeffrey Skilling, was sentenced Monday to two years in prison for his role in the once mighty energy company's financial collapse.  Kevin Hannon, 46, former chief operating officer for the broadband unit, pleaded guilty to conspiracy in August 2004 for ...\n\n\nJun 5, 2007 Knight Ridder Tribune Business News\n\n\n\nUnit 1 connects to TVA power grid: Spokesman says Browns Ferry reactor faces 2 more shutdowns for tests\n\n\n\nJun. 5--ATHENS -- Eleven days after restarting the Unit 1 reactor at Browns Ferry Nuclear Plant, operators connected it to the Tennessee Valley Authority power system grid.  Terry Johnson, TVA's Browns Ferry spokesman, said if all goes well, the unit should be running full out within the week. But within 30 days of achieving 100 percent power, operators will shut down the reactor twice during ...\n\n\nJun 5, 2007 Knight Ridder Tribune Business News\n\n\n\nJudge says no to leniency request: Former Enron broadband executive receives two-year federal sentence\n\n\n\nJun. 5--A judge squashed a former Enron broadband executive's hope to avoid prison Monday, tossing aside his request for probation in favor of two years in a federal cell.  \"The sentence will remain as stated,\" U.S. District Judge Vanessa Gilmore said despite earnest pleas from one of Kevin Hannon's lawyers for the same leniency other judges have granted six ex-Enron executives -- who are ...\n\n\nJun 5, 2007 Knight Ridder Tribune Business News\n\n\n\nUSEC, TVA pact renewed: No danger: The government says workers were never in jeopardy from phosgene in spent uranium canisters at the Paducah Gaseous Diffusion Plant.\n\n\n\nJun. 5-- -- A new five-year power contract should help stabilize the Paducah Gaseous Diffusion Plant, but union leaders say it's too early to speculate if the deal will extend 1,100 jobs.  \"The fact that TVA was willing to enter into a long-term agreement definitely was a positive,\" said Rob Ervin, president of the plant nuclear workers' union. \"I think if they felt USEC was on very shaky ground ...\n\n\nJun 5, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nBig natural gas pipeline has Buckeye concerned\n\n\n\nThe thought of a massive natural gas pipeline only a few feet underground and running through a master planned community in Buckeye has town officials cringing. Transwestern Pipeline Co. wants to build the pipeline through areas of Buckeye that have planned development along Sun Valley Parkway. The 259-mile underground pipeline would run from Ash Fork in Coconino County, south through Yavapai and ...\n\n\nJun 5, 2007 Tucson Citizen\n\n\n\nReview Halted On Plan For Natural Gas Terminal\n\n\n\nBOSTON -- A proposed liquefied natural gas terminal in southeastern Massachusetts hit another roadblock Monday, when state environmental regulators halted their review of the plan, The Associated Press has learned. The state Department of Environmental Protection says it will stop its review of permit applications by Weaver's Cove Energy and Hess LNG, citing concerns about the project raised ...\n\n\nJun 5, 2007 Hartford Courant\n\n\n\nO'Malley names energy administrator\n\n\n\nWoolf: State needs to embrace efficiency to deal with rising energy costs The Associated Press ANNAPOLIS, Md. //  Maryland needs to embrace efficiency and conservation measures to address rising energy costs, the new director of the Maryland Energy Administration said today. Malcolm Woolf, who was named to the position by Gov. Martin O'Malley, steps into the post after having worked at the ...\n\n\nJun 5, 2007 Baltimore Sun\n\n\n\nCanadian Wal-Marts Dim Lighting to Conserve Energy\n\n\n\nJUNE 05, 2007 -- MISSISSAUGA, Ont. -- Wal-Mart Canada stores across the country yesterday began reducing lighting by one-third for the summer in 240 of its stores, a strategy aimed at helping the company meet its plan to lower carbon emissions by at least 19,000 tons this year. As a result, Wal-Mart Canada expects to slash carbon emissions by over 4,500 tons, help control summer smog conditions, ...\n\n\nJun 5, 2007 Progressive Grocer\n\n\n\nNew commissioner of state Division of Energy Resources named\n\n\n\nBOSTON - Energy Affairs Secretary Ian Bowles on Monday named Philip Giudice as the states new Commissioner of the states Division of Energy Resources. Giudice takes office July 1. The Division of Energy Resources is responsible for reviewing energy efficiency plans of electricity distribution utilities and requiring that power suppliers obtain an increasing amount of their electricity from ...\n\n\nJun 4, 2007 Boston Herald\n\n\n\n\n\nCalifornia Public Utilities Commission Approves Agreement Between Pacific Gas & Electric and Energy Curtailment Specialists\n\n\n\nEnergy Curtailment Specialists, Inc. (ECS), the largest demand response provider in the United States, announced approval of its Demand Response Purchase Agreement with Pacific Gas and Electric Company (PG&E) by the California Public Utilities Commission (CPUC). Under the agreement, ECS will provide PG&E with a minimum of 40 megawatts of electricity over the next 5 years.\n\n\nJun 5, 2007 PR Newswire\n\n\n\nMacy's Goes Green In California\n\n\n\nSAN FRANCISCO--(BUSINESS WIRE)--Macys today announced it will install solar power systems and significantly reduce energy consumption in 26 stores throughout California in partnership with SunPower Corporation (Nasdaq:SPWR), a Silicon Valley-based manufacturer of high-efficiency, commercially available solar cells, solar panels and solar systems. SunPowers subsidiary PowerLight will install ...\n\n\nJun 5, 2007 Business Wire\n\n\n\nAGL Networks Announces Chandler Route Expansion: Names New Sales Director\n\n\n\nAGL Networks today announced the 27 route mile expansion of the company's fiber footprint into the Chandler and south Tempe markets. The expansion, which expands the network owned and managed by AGL Networks to 157 route miles, will enhance customers' alternatives for fiber bandwidth, network diversity and path redundancy. This is the first of several planned expansions and will be available for ...\n\n\nJun 4, 2007 PR Newswire\n\n\n\nTioga Energy Launches with Funding by NGEN Partners, Draper Fisher Jurvetson and Rockport Capital Fund\n\n\n\nTioga Energy, Inc., a solar electricity services provider that offers comprehensive power purchasing services to organizations and industry, launched today with an initial funding round of more than $10 million. Leading the investments were venture capital groups NGEN Partners, Draper Fisher Jurvetson, Rockport Capital, DFJ Frontier and Kirlan Ventures. 'We are very excited to help support Tioga ...\n\n\nJun 5, 2007 PR Newswire\n\n\n\nTraining Seminar On Installation of Renewable Energy Products Hosted by Solar Night Industries at Alberici Corporation's LEED Platinum Certified Building, located in St. Louis, MO\n\n\n\nST. LOUIS--(BUSINESS WIRE)--Solar Night Industries (Pink Sheets:SLND) is hosting this unique, 3 day installation training seminar, June 25th-27th, in St. Louis, MO. They will also preview their new Solar Synapse Pre-Wire Kit for New Construction, designed to help Builders increase energy efficiency of new homes and qualify for additional LEED points. The seminar training on Solar and Wind, will ...\n\n\nJun 4, 2007 Business Wire\n\n\n\nCMS Energy Announces Debt Tender Offer\n\n\n\nJACKSON, Mich., June 5 /PRNewswire-FirstCall/ -- CMS Energy Corporation (NYSE: CMS) today announced that it has commenced an offer to purchase for cash (the 'Tender Offer') any and all of its outstanding 7.5% Senior Notes Due 2009, CUSIP No. 125896 AH3 (the 'Notes'). CMS is offering an early tender payment of $20 per $1,000 principal amount of Notes to holders who validly tender their Notes ...\n\n\nJun 5, 2007 PR Newswire\n\n\n\nDPL Director, Ernie Green, Retires from Board\n\n\n\nDAYTON, Ohio--(BUSINESS WIRE)--DPL Inc. (NYSE:DPL) announced today that long-time Director Mr. Ernie Green has chosen to retire from the DPL Board of Directors effective immediately. Mr. Green has been a member of the DPL Board since 1991. Ernie has served the shareholders and customers of DPL admirably for 16 years, said Glenn Harder, DPL Chairman of the Board.\n\n\nJun 4, 2007 Business Wire\n\n\n\nCastle & Cooke to Build Hawai'i's Largest Solar Farm on Lana'i\n\n\n\nLANA'I CITY, Hawai'i--(BUSINESS WIRE)--Castle &amp; Cooke, Inc. today announced that it has signed a contract through its subsidiary, Lana'i Sustainability Research, LLC, to build the largest solar photovoltaic farm in Hawai'i and the fourth largest in the United States. The 1.5-megawatt solar farm will be built on a 10-acre site in south Lana'i by SunPower Corp.\n\n\nJun 5, 2007 Business Wire\n\n\n\nUtility Customers Exposed to Predatory Lenders: Report Documents How Hundreds of Payday Lenders Act as Utility Payment Agents\n\n\n\nUtilities that direct customers to pay electricity, natural gas and telephone bills at payday loan stores make those customers targets for marketing of predatory loans, a National Consumer Law Center report has found. 'Utilities and Payday Lenders: Convenient Payments, Killer Loans,' a report released today by NCLC, found more than 650 instances where payday lenders act as authorized bill payment ...\n\n\nJun 5, 2007 PR Newswire\n\n\n\nGreen Energy Resources (GRGR) Looks to US Biomass Markets as Export Market Flourishes\n\n\n\nGreen Energy Resources(PinkSheets: GRGR)  Green Energy Resources(PinkSheets: GRGR) begins push to supply US biomass markets as the export market continues to flourish. GRGR expanded its supply capacity through the recent southern US forest fires by nearly one million tons of pulp logs. The company plans to utilize provisions from the US Energy bill for transportation subsidies of forest fire ...\n\n\nJun 5, 2007 Internet Wire\n\n\n\nFitch Rates Great River Energy (Minnesota) $1.2B 1st Mtge Bonds, 2007A 'A-'\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch Ratings assigns a senior secured rating of 'A-' to Great River Energy's (GRE) $1.2 billion first mortgage bonds, series 2007A. In addition, Fitch also assigns an 'A-' senior secured rating to the outstanding tax-exempt pollution control bonds issued by the City of Underwood (ND) and Mercer County (ND), solid waste disposal bonds issued by Anoka County (MN), McLean ...\n\n\nJun 5, 2007 Business Wire\n\n\n\n\n\n>> Appeals Court Blocks Equitable Resources From Buying Dominion Peoples\n\n\n\nAppeals Court Blocks Equitable Resources >From Buying Dominion Peoples, Following FTC Line Joe Mandak PITTSBURGH (AP) - A federal appeals court has blocked a $970 million bid by Equitable Resources Inc. to purchase Dominion Peoples Gas and become the state's largest natural gas utility. The order, issued late Friday by the 3rd U.S. Circuit Court of Appeals, stems from the Federal Trade ...\n\n\nJun 5, 2007 Canadian Business Magazine\n\n\n\nLoan agreement: ADB approves $150m loan for KESC\n\n\n\n* Investment will increase electricity generation by 785 megawatts, from 1,500 megawatts todayStaff Report ISLAMABAD: The Asian Development Bank (ADB) on Monday signed an agreement to provide Karachi Electric Supply Corporation (KESC) with a $150 million loan to help it increase power supply and coverage in Pakistan's largest city and industrial and commercial heartland.\n\n\nJun 5, 2007 Daily Times\n\n\n\nIBM unveils plan to reduce data center energy use\n\n\n\nIBM recently announced it is redirecting $1 billion per year across its businesses, mobilizing the company's resources to dramatically increase the level of energy efficiency in IT. The plan includes new products and services for IBM and its clients to sharply reduce data center energy consumption, with the goal of transforming the world's business and public technology infrastructures into ...\n\n\nJun 5, 2007 FMLink\n\n\n\nUS FERC rejects Canadian request to suspend LNG proceedings\n\n\n\nThe US Federal Energy Regulatory Commission on Friday denied requests by the government of New Brunswick, Canada, to suspend indefinitely consideration of two proposed liquefied natural gas terminals in Maine in light of Canadian concerns about LNG tanker traffic through the Head Harbour Passage. The issue stems from a February letter from Michael Wilson, Canada's ambassador to the US, which told ...\n\n\nJun 4, 2007 Platts\n\n\n\nCalifornia Senate approves bill for renewable power purchases\n\n\n\nSan Francisco (Platts)--5Jun2007 A bill that would allow investor-owned utilities in California to recover above-market costs for renewable power purchases was approved by the state Senate late Monday. The bill by California Senate President Pro Tem Don Perata, SB 1036, aims to help the state meet its renewable portfolio standard of requiring IOUs to obtain 20% their power from renewables by ...\n\n\nJun 5, 2007 Platts\n\n\n\nPower prices increased 4.7% in past year, consultant NUS says\n\n\n\nThe average price of power for large customers of investor-owned utilities increased 4.7% over the past year, reaching 9.28 cents/kWh javascript:handoff()from 8.86 cents/kWh in 2006, NUS Consulting Group said Monday. In its annual survey of 24 of the largest investor-owned utilities in the US, NUS said the 4.7% increase in 2007 followed a 10.9% increase in average prices among large customers in ...\n\n\nJun 4, 2007 Platts\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nAmbitious New Lamp Industry Initiative Shows How Europe Can Cut Annual CO2 Emissions from Domestic Lighting by more than 60% by 2015\n\n\n\n08:53 AM Eastern Daylight Time Ambitious New Lamp Industry Initiative Shows How Europe Can Cut Annual CO2 Emissions from Domestic Lighting by more than 60% by 2015 BRUSSELS, Belgium--(BUSINESS WIRE)--Europes lamp manufacturers have today published details of a highly ambitious initiative1, which if adopted by the European Union2, would lead to the phase-out of the least efficient lamps in the ...\n\n\nJun 5, 2007 Business Wire\n\n\n\nChina's Shenzhen Energy to Invest $1 Billion in Power Plants\n\n\n\nResearched by Industrial Info Resources (Sugar  Researched by Industrial Info Resources (Sugar Land, Texas). China's Shenzhen Energy Corporation will invest $1.04 billion in Huiyang city and Huidong county to build a coal-fired power plant with four 1,000 MW ultra supercritical thermal power generator sets. Both the county and the city are several hundred kilometers northeast of Shenzhen, which ...\n\n\nJun 5, 2007 Internet Wire\n\n\n\nGrowing Opportunities in the Power Plant MRO Market in Sub-Saharan Africa\n\n\n\nThe market for power plant maintenance, repair, and overhaul (MRO) in sub-Saharan Africa is growing and becoming more competitive. The number of refurbishment deals in the region has multiplied in recent years, most notably in Southern Africa, due to an increasing demand for electricity. 'The re-commissioning of previously mothballed stations and substantial investments in electricity generation ...\n\n\nJun 5, 2007 PR Newswire\n\n\n\nSmartCool commences testing in lucrative Chinese telecommunications marketplace\n\n\n\nVANCOUVER, June 5 /PRNewswire-FirstCall/ - SmartCool Systems Inc. (TSXV: SSC) is pleased to announce that Smartcool International Inc., a wholly owned subsidiary, has signed a 'Trial Period Agreement' for its ESM(TM) technology with Wuhan Eco-Energy Systems Co. Limited (China) ('EES China'). The location selected is China Telecom's Huangshi Telephone Exchange, located in Hebei province.\n\n\nJun 5, 2007 PR Newswire\n\n\n\nUganda Outgrows Its Electricity Supply\n\n\n\nKAMPALA, Uganda -- Samuel Kizito gives his business a month before it goes belly-up. Uganda, once one of the fastest-growing economies in Africa, is suffering through a power crisis that makes doing business here difficult, expensive, and -- for Kizito, at least -- not worth the trouble. Kizito said his blanket manufacturing company, which employs 300 people in the Ugandan capital, Kampala, is ...\n\n\nJun 5, 2007 Newsday\n\n\n\nUganda, once East Africa's powerhouse, outgrows its electricity supply\n\n\n\nAssociated Press Writer KAMPALA, Uganda (AP) -- Samuel Kizito gives his business a month before it goes belly-up. Uganda, once one of the fastest-growing economies in Africa, is suffering through a power crisis that makes doing business here difficult, expensive, and -- for Kizito, at least -- not worth the trouble. Kizito said his blanket manufacturing company, which employs 300 people in the ...\n\n\nJun 5, 2007 Charleston Daily Mail\n\n\n\nARCADIS Develops New Landfill Gas Installation in Brazil\n\n\n\nARNHEM, The Netherlands, June 5 /PRNewswire-FirstCall/ -- ARCADIS (NASDAQ: ARCAF, EURONEXT: ARCAD), the international consultancy and engineering company, today announced that its affiliated company BIOGAS has brought online an installation to extract methane gas generated by the Sao Joao Landfill in the city of Sao Paulo, Brazil. The gas is extracted from the 150 acre Sao Joao landfill where ...\n\n\nJun 5, 2007 PR Newswire\n\n\n\nGet An Understanding Of The New Wholesale And Retail Analysis Relating To Europe's Key Gas And Power Wholesale Markets\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c58901) has announced the addition of Monthly Price Brief - A Review Of European Gas And Power Price Trends: February 2007 to their offering. The growing role of wholesale traded energy markets across Europe creates a greater need for players throughout the value chain to be aware of wholesale and ...\n\n\nJun 5, 2007 Business Wire\n\n\n\nAMD Empowers PC Industry to Deliver Innovative Small Form Factor Solutions With DTX and New Energy-Efficient Processors\n\n\n\nTAIPEI, Taiwan--(BUSINESS WIRE)--Further advancing the availability of energy-efficient platforms, at Computex today, AMD (NYSE:AMD) announced the finalization of the DTX specification, an open standard initiated by AMD to enable the development of small form factor PCs. AMD also introduced new 45-watt energy-efficient processors based on 65nm technology, the AMD Athlon X2 dual-core processor ...\n\n\nJun 5, 2007 Business Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}