{"category": "spam", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Mr Huge <MrHuge@ourdick.com>", "subject": "SEXUALLY-EXPLICIT: He Bangs Movies ktwarwic", "body": "\n\nktwarwic 05/24/2007 11:37:05 wine and vodka are liquor\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nktwarwic, She doesn't know what she's getting into...\n\n\nOMG! How Can She Make Her Way Out of This?05/24/2007 11:37:05\n\nJokes of the dayReal advertisements\nHave several very old dresses from grandmother in beautiful condition. \nTired of cleaning yourself? Let me do it. \nStock up and save. Limit: one. \nWe build bodies that last a lifetime. \nFor Rent: 6-room hated apartment. \nMan, honest. Will take anything. \nWanted: chambermaid in rectory. Love in, $200 a month. References required. \nMan wanted to work in dynamite factory. Must be willing to travel. \nSupposedly, these are actual advertisements that have appeared in papers across the country.\nLost: small apricot poodle. Reward. Neutered. Like one of the family. \nA superb and inexpensive restaurant. Fine food expertly served by waitresses in appetizing forms. \nFor sale: an antique desk suitable for lady with thick legs and large drawers. \nFour-poster bed, 101 years old. Perfect for antique lover. \nNow is your chance to have your ears pierced and get an extra pair to take home, too. \nWanted: 50 girls for stripping machine operators in factory. \nVacation Special: have your home exterminated. \nIf you think you've seen everything in Paris, visit the Pere Lachasis Cemetery. It boasts such immortals as Moliere, Jean de la Fontain, and Chopin. \nMt. Kilimanjaro, the breathtaking backdrop for the Serena Lodge. Swim in the lovely pool while you drink it all in. \nThe hotel has bowling alleys, tennis courts, comfortable beds, and other athletic facilities. \nToaster: A gift that every member of the family appreciates. Automatically burns toast. \nSheer stockings. Designed for fancy dress, but so serviceable that lots of women wear nothing else. \nWe do not tear your clothing with machinery. We do it carefully by hand.\nWanted: Unmarried girls to pick fresh fruit and produce at night. \nDog for sale: eats anything and is fond of children. \nModular Sofas. Only $299. For rest or fore play. \nWanted: Hair-cutter. Excellent growth potential. \nWanted. Man to take care of cow that does not smoke or drink. \n3-year-old teacher need for pre-school. Experience preferred. \nOur experienced Mom will care of your child. Fenced yard, meals, and smacks included. \nOur bikinis are exciting. They are simply the tops. \nAuto Repair Service. Free pick-up and delivery. Try us once, you'll never go anywhere again. \nHolcross pullets. Starting to lay Betty Clayton, Granite 5-6204. \nIlliterate? Write today for free help. \nUsedCars: Why go elsewhere to be cheated? Come here first! \nWanted. Widower with school-age children requires person to assume general housekeeping duties. Must be capable of contributing to growth of family.  \nMixing bowl set designed to please a cook with round bottom for efficient beating.  \nSemi-Annual after-Christmas Sale.  \nAnd now, the Superstore-unequaled in size, unmatched in variety, unrivaled inconvenience.  \nWe will oil your sewing machine and adjust tension in your home for $1.00.  \nGirl wanted to assist magician in cutting-off-head illusion. Blue Cross and salary.  \nFor Sale. Three canaries of undermined sex.  \nGet rid of aunts: Zap does the job in 24 hours.  \nChristmas tag-sale. Handmade gifts for the hard-to-find person.  \n\n\n\n\n\n\n\n\n"}