{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Denny Irvin\" <lazclownaroundlabow@clownaroundla.com>", "subject": "Healthy living with less fat", "body": "\nControl your weight and appetite\n\n\n\n\n\n\nAnatrim – The newest and most exciting product for weighty people is made available now – As could be seen on ABC.\n\n\nDo you count up all the times when you told yourself you would do any thing for being rescued from this fastly growing pounds of fat? Fortunately, now no big sacrifice is demanded. With Anatrim, the ground-shaking pound-melting blend, you can achieve naturally health life style and become really thinner. Have a look at what our customers state!\n\n\n\n\"I hate to confess but I was an awful food addict. \n\n\nI devoured all this garbige \n\n\nand could not stop. \n\n\n\n\nThis ruinous passion passed away when I started taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my craving for food disappeared, \n\n\nspirits improved and I became the happiest person 24 pounds in 2.7 months. \n\n\n\n\nSo, I can tell you now I became the happiest person!\"\n\n\n\n\n\nSilvia D., New York\n\n\n\n\n\n\"I had weight problems since a boy. \n\n\nYou can't even fancy how I detested being mocked at school. \n\n\n\n\nI abhorred my stoutness and I detested even myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nThis stuff literally took me out of this terrible nightmare! Many thanks and a great respect to you, fellows.\"\n\n\n\n\n\nMike Brown, Bellevue WA\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was saved! I fell down into the circle, depression – eating more – more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nOne my best friend pointed to your web page and I ordered up my pack of Anatrim immediately. \n\n\nThe results I achieved were great, my appetite became normal, I was in a good mood oftener, and, of course, I tightened my belt with no regrets. And you see, the bed became cool also!\"\n\n\n\n\n\nRikky\n\n\n\n\n There many and many testimonial letters left by happy people trying Anatrim. Don’t you gonna add yourself to the tens of thousands of slender customers and take this original appetite suppressing energy raising product now!\n\n\nDo not miss the chance!\n\n\n\n\n"}