{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nMonday, 30 April, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nI'm staying at Bolton, says Nolan\nBolton captain Kevin Nolan tells BBC Sport he is looking forward to playing under Sammy Lee - and says Sam Allardyce told him he does not have a job lined up.\n\n\n\n \nLee appointed manager of Bolton\nSammy Lee is confirmed as Bolton's new manager after the shock resignation of Sam Allardyce at the weekend.\n\n\n\n \nLeeds issue appeal to investors\nLeeds chairman Ken Bates appeals to potential investors to help the club recover from their impending relegation to League One.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nDonald errors hand Verplank win\nA three-putt proves costly for Luke Donald as Scott Verplank pounces to win the Byron Nelson Championship.\n\n\n\n \nSchwartzel claims title in Madrid\nEnglish duo Simon Dyson and Mark Foster have to settle for joint-fourth as South African Charl Schwartzel wins the Spanish Open in Madrid.\n\n\n\n \nWorried Woosnam quits Madrid Open\nIan Woosnam pulled out of Madrid Open after suffering a recurrence of a mystery leg complaint.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nF1 races are 'boring' - Briatore\nRenault team boss Flavio Briatore says changes aimed at livening up Formula One have not worked.\n\n\n\n \nToseland extends lead in Holland\nJames Toseland stretches his World Superbikes championship lead with a win and second place at the Dutch Grand Prix.\n\n\n\n \nButton 'wants to stay at Honda'\nJenson Button has no plans to leave struggling F1 team Honda, according to his manager.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nF1 races are 'boring' - Briatore\nRenault team boss Flavio Briatore says changes aimed at livening up Formula One have not worked.\n\n\n\n \nButton 'wants to stay at Honda'\nJenson Button has no plans to leave struggling F1 team Honda, according to his manager.\n\n\n\n \nToyota team boss will stand down\nToyota team boss Tsutomu Tomita will stand down at the end of June and be replaced by Tadashi Yamashina.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nBack injury for Aikines-Aryeetey\nWorld Junior 100m champion Harry Aikines-Aryeetey returns to London after suffering a back injury during training in the United States.\n\n\n\n \nMason jumps to shock win in Dakar\nGermaine Mason wins the high jump at the IAAF World Athletics Tour event in Senegal.\n\n\n\n \nRadcliffe not in GB marathon team\nGB's marathon team for the World Athletics Championships is named but does not include Paula Radcliffe at this stage.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nUnder-fire Basso parts with team\nIvan Basso quits the Discovery Channel team after an investigation into his role in a Spanish doping scandal is reopened.\n\n\n\n \nDi Luca up for Giro after big win\nDanilo Di Luca is looking forward to challenging for glory in May's Giro d'Italia after victory in the Liege-Bastogne-Liege race.\n\n\n\n \nWiggins welcomes Basso suspension\nBritish star Bradley Wiggins says the decision to suspend Ivan Basso is \"good news for cycling\".\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nComment: Big Sam, big loss\nRobbo on why Bolton could struggle without Sam Allardyce\n\n\n\n \nCaption Competition 354\nThis week's cap comp features Jose Mourinho and Didier Drogba\n\n\n\n \nHolloway column\n\"Alan Ball threw me the keys to his Merc and said: 'Come on, find us a caff'\"\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}