{"category": "ham", "to_address": "Stefan Grosse <singularitaet@gmx.net>", "from_address": "Dirk Eddelbuettel <edd@debian.org>", "subject": "Re: [R] JGR, Java and Kubuntu 7.04 ...", "body": "\nOn 15 June 2007 at 12:32, Stefan Grosse wrote:\n| You could download the latest R (2.5.0) directly from CRAN, this just as\n| a side remark, You find instructions here:\n| http://cran.au.r-project.org/bin/linux/ubuntu/README\n\nYes indeed, thanks for our fearless backporters.\n \n| With java you should make sure that you have the Java 5 JDK installed. \n| I dont know how it is with Ubuntu but on fedora I have to set the java\n| alternative (sun java installation does not change the default java\n| there). Which java is installed you can check with java -version there\n| you see it it is properly installed and a R CMD javareconf also\n| indicates if your java is configured correctly. Additionally on Fedora I\n| had to set JAVA_HOME to the JDK directory manually.\n\n\"It all worked\" -- I don't run Java much myself, but I think starting with\nthe previous Ubuntu release and the actual Sun packages directly acessible\nvia apt-get, it worked.\n\nHowever, with the current packages in my Kubuntu setup at work, I do get a\nsegfault once JGR is up and loaded.   I suspect, as Stefan said here, that\nthis is due to the Java 6 packages in Ubuntu.  As I said, sun-java5-jdk seems\nto have work along with 'sudo R CMD javareconf', Simon's powerful Java\nparameter setter for R.\n\nIn any event, we should carry this over to r-sig-debian.\n\nDirk\n\n| \n| Stefan\n| \n| -------- Original Message  --------\n| Subject: [R] JGR, Java and Kubuntu 7.04 ...\n| From: John Logsdon \n| To: r-help@stat.math.ethz.ch\n| Date: 14.06.2007 19:16\n| > R-ists\n| >\n| > Yet again Java rears its ugly head.  \n| >\n| > I have Kubuntu 7.04 running the Kubuntu-repository version of R 2.4.1-1.      \n| > Yes it isn't the  very latest version but this is not the issue here.  \n| >\n| > I want a Windows-like environment and everyone is talking about JGR.\n| >\n| > I downloaded it and installed it along with rJava.  Both compile and install \n| > satisfactorily.\n| >\n| > But when I come to run it:\n| >\n| >   \n| >>> library('JGR')\n| >>>       \n| >> Loading required package: rJava\n| >> Error in dyn.load(x, as.logical(local), as.logical(now)) :\n| >>         unable to load shared library\n| >> '/usr/local/lib/R/site-library/rJava/libs/rJava.so':\n| >> /usr/local/lib/R/site-library/rJava/libs/rJava.so: undefined symbol:\n| >> JNI_GetCreatedJavaVMs Error: .onLoad failed in 'loadNamespace' for 'rJava'\n| >> Error: package 'rJava' could not be loaded\n| >>     \n| >\n| >\n| > When I first tried to run it without Java being installed, I got a message \n| > saying that JDK wasn't installed but mentioned 1.4.2.  The version of Java \n| > actually installed as the latest from the Ubuntu repository is Sun 1.5.0.11.  \n| > I don't see the point in installing old versions of Java just for one \n| > application because the language, or at least the writing, should be \n| > backwards compatible.  \n| >\n| > In all aspects I have seen Kubuntu is a very impressive in checking \n| > compatibility.  Unfortunately this is frequently not the case with Java.  I \n| > steer clear of Java as much as possible.  \n| >\n| > Can anyone suggest what I should do?  Use Windows perhaps?  Run Windows in a \n| > kvm virtual machine just to run R?  Put my head in a bucket of cold water?  \n| > Is there an alternative IDE?  Is there a later JGR somewhere that is not yet \n| > on CRAN?\n| >\n| > TIA\n| >\n| >\n| \n| ______________________________________________\n| R-help@stat.math.ethz.ch mailing list\n| https://stat.ethz.ch/mailman/listinfo/r-help\n| PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n| and provide commented, minimal, self-contained, reproducible code.\n\n-- \nHell, there are no rules here - we're trying to accomplish something. \n                                                  -- Thomas A. Edison\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}