{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "vitiate: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\nFind out how to release your inner genius and ace your exams\nin Teresa Bolen's epochal book, MASTER PLAN TO MASTER EXAMS:\nHOW TO DISCOVER YOUR HIDDEN ABILITIES TO CREATE THE SUCCESS YOU DESIRE.\nYou'll get a package of wonderfully empowering F-R-E-E Bonus Gifts from\nsome of the world's leading success and learning experts -- take action NOW.\nRelease Your Inner Genius Abilities Today\nADVERTISEMENT\nWord of the Day for Tuesday, May 15, 2007\nvitiate \\VISH-ee-ayt\\, transitive verb:\n1. To make faulty or imperfect; to render defective; to impair; as, \"exaggeration vitiates a style of writing.\"\n2. To corrupt morally; to debase.\n3. To render ineffective; as, \"fraud vitiates a contract.\"\nMacNelly is one of the few contemporary political cartoonists who can use humor to accentuate, not vitiate, his points. -- Richard E. Marschall, \"The Century In Political Cartoons\", Columbia Journalism Review, May/June 1999\nTheir religious convictions and conduct were held to be vitiated by hideous error. -- David Vital, A People Apart\nWhatever a \"real contradiction\" might be, \"apparent contradictions\" are quite sufficient to vitiate a doctrine of biblical authority that is based on the supposedly apparent reading of the text. -- Robert M. Price, \"The Psychology of Biblicism\", Humanist, May 2001\nIt seems churlish to say of a book that is beautifully written, richly allusive, learned, elegant, Proustian in tone and mode, that precisely these qualities vitiate its ostensible purpose, distracting attention from the subject and focusing it upon the very gifted author. -- Gertrude Himmelfarb, \"A Man's Own Household His Enemies\", Commentary, July 1999\nIt is conceivable that an error could be so serious as to vitiate the entire body of the work. -- Linda Hawes Clever and Lois Ann Colaianni, \"Uniform Requirements for Manuscripts Submitted to Biomedical Journals\", Public Health Reports, May/June 1997\nVitiate comes from Latin vitiare, from vitium, fault. It is related to vice (a moral failing or fault), which comes from vitium via French.\nDictionary.com Entry and Pronunciation for vitiate\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9596805-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}