{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "New Politics?", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tFRIDAY 22 JUNE 22:30 BST - BBC TWO\n\n\n\n\n\n\n\n\t\t\t\t\t\tOn Newsnight my phone rarely rings at 6.14 am. But it did this morning. It was our deputy editor Robbie Gibb who was looking after Zombie Brown: Prime Minister's Questions, a special programme for News 24 and Newsnight in which the soon-to-be-PM was to face questions from a panel of the BBC's sharpest minds. \n\n\nRobbie was involved in a last minute flurry with Mr Brown's people over the exact seating arrangements for the programme, which - because of the EU summit - could only be recorded at eight in the morning. It was symptomatic of a process of negotiation to get Mr Brown onto the programme which was at times tortuous and always subject to change. \n\n\nBut when Mr Brown swept into the studio - at roughly twenty past eight - he was a vision of relaxedness. The make-up lady remarked how warm and chatty he was - more so in fact than Blair - his warm-up small talk was easy, his jokes surprisingly good. And when the intense and wide-ranging grilling from Martha Kearney, Evan Davis, Nick Robinson, and John Simpson began, the old Brown, sticking rigidly to his sound bites, seemed to have disappeared. No prudence, no steering a steady course, not even much listening and learning. Could it be that Mr Brown - famously uptight and brooding as Chancellor - will, like Nicolas Sarkozy, find the top job strangely relaxing?\n\n\nPeter Barron is Editor of Newsnight\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}