{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Reinaldo Yazzie\" <pofchmielewskityd@chmielewski.info>", "subject": "Obesity is dangerous, stop it", "body": "\nStop the painful craving for more food\n\n\n\n\n\n\nAnatrim – The newest and most exciting lose flesh product is now easily available – As were told on BBC.\n\n\nCan you retain all the cases when you plead to yourself to do any thing to get rid of this desperately growing number of kilos? Luckily, now no big price is to be paid. Thanks to Anatrim, the ground-shaking kilos-melting blend, you can achieve healthier lifestyle and become really slimmer. Have a look at what people say!\n\n\n\n\"It’s quite difficult to confess but I was dreadfully addicted to food. \n\n\nI greedily swallowed up all this rubbish \n\n\nand was unable to stop. \n\n\n\n\nThis suffering left off when I started taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite abated, \n\n\nmood increased and I’m the happiest person 25 pounds in 2.4 months. \n\n\n\n\nI can tell you now I turned to the happiest person!\"\n\n\n\n\n\nRita R., Chicago\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nIt’s difficult to fancy how I abhorred being ridiculed at school. \n\n\n\n\nI detested my stoutness and I abhorred even myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nIt literally pulled me out of this horror! The warmest thanks to you, fellows.\"\n\n\n\n\n\nSteve Burbon, Colorado\n\n\n\n\n\n\"Know what? My marriage was saved thanks to Anatrim! I got into the circle, depression – more eating – even more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nMy best friend showed me web page and I ordered Anatrim immediately. \n\n\nThe final result was excellent, my appetite came to admissible level, I was often in good spirits, and, of course, I went some belt holes back. And you see me, the sex became fantastic also!\"\n\n\n\n\n\nFrank\n\n\n\n\n There are lots of sincere gratitudes happy people leave after trying Anatrim. Don’t you wanna join the thousands and thousands of slim buyers and try this original appetite-suppressing power boosting product now!\n\n\nDo not decline the chance!\n\n\n\n\n"}