{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Michael Whapples <mwhapples@aim.com>", "subject": "Re: gentoo dropping speakup support", "body": "While it is a shame that you find this, thank you for saying what the\nexact problem is. If speakup won't compile on x86-64 either now, I am\nsure that soon someone will fix that as it probably affects quite a\nnumber of users.\n\nOther than the install of gentoo, I don't think the impact is as bad as\nit is for other distros as gentoo users may tend to want to compile a\ncustom kernel anyway. The install probably isn't such a problem as I\nthink if you are doing an install from the internet then it doesn't\nmatter what version of gentoo the CD is as the installed system will be\nthe latest, so a user could use the last release with speakup to install\nwith speakup (unless they are doing an install without internet access,\nfor which there may not be a solution).\n\nOn a different note, while I don't know enough about the kernel to be\ncertain, but is this problem to do with speakup and the way it accesses\nthe serial ports? As I remember from some previous discussions about\nspeakup and serial port access, I think it was said that if speakup used\nthe standard serial port driver then it should be possible to use serial\nports not built on the motherboard. So would this also help in solving\nsuch a problem as found in gentoo? If so might it be time to say it must\nbe done?\n\nUnfortunately I currently cannot help with this as I am a python\nprogrammer so would need to learn C before I could do anything, probably\nsomething I should do as so much opensource software is written in C.\n\nFrom\nMichael Whapples\nOn Sun, 2007-06-17 at 15:00 -0500, William Hubbs wrote:\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA1\n> \n> All,\n> \n> because of this bug [1], gentoo linux will be dropping support for speakup in its official kernels starting at 2.6.22.\n> \n> [1] http://bugs.gentoo.org/show_bug.cgi?id=177794\n> \n> Is there any possibility at all that speakup could be moved into user space as the bug suggests?  I feel that if we can go into user space this will b a better approach.\n> \n> Thanks,\n> \n> - -- \n> William Hubbs\n> gentoo accessibility team lead\n> williamh@gentoo.org\n> -----BEGIN PGP SIGNATURE-----\n> Version: GnuPG v1.4.7 (GNU/Linux)\n> \n> iD8DBQFGdZLWblQW9DDEZTgRAsCOAJoD/roDmHTKu7ji8qTXZ2eoX47T1ACeIivJ\n> j/qhb9Z6KNpfitEvr7Onrug=\n> =mpb2\n> -----END PGP SIGNATURE-----\n> \n> \n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}