{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 18, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESGaza Falls Deeper Into Chaos\nIsraeli planes continue to pound Hamas targets, and Fatah and Hamas gunmen clash on the streets of Gaza City. Hamas rockets\n                        continued to fall on the Israeli border town of Sderot, to which Israel said it had to respond. More...Watch: Israel Steps Into Mayhem\n• Immigration Deal Faces Uncertain Future\n                     \t\t\t\t\t| Watch• 2 ABC Journalists Killed In Iraq\n                     \t\t\t\t\t| Watch• Senators Press CIA To Release 9/11 ReportU.S.$500M Treasure Ship Found In Atlantic\nDeep-sea explorers said they have mined what could be the richest shipwreck treasure in history, bringing home 17 tons of\n                        colonial-era silver and gold coins from an undisclosed site in the Atlantic Ocean. Estimated value: $500 million. More...\n• Rain Helps N.J. Firefighters, Winds Don't\n                     \t\t\t\t\t| Watch• LeMond Bombshell At Landis Hearing\n                     \t\t\t\t\t| Watch• \"Bloomberg Gun Giveaway\" Draws Crowd• More StoriesWorld2 ABC Journalists Killed In Iraq\nABC News announced that two of its Iraqi journalists in Iraq were killed in an ambush as they drove home from work. Also,\n                        insurgents attacked a U.S. base, resulting in six of them being killed, and the search for three missing soldiers continues. More...Watch: Search Continues For Soldiers\n• Gaza Falls Deeper Into Chaos\n                     \t\t\t\t\t| Watch• Deadly Blast At Historic Indian Mosque• New French Leader Names Cabinet\n                     \t\t\t\t\t| Watch• More StoriesPoliticsImmigration Deal Faces Uncertain Future\nA bipartisan immigration deal that would grant legal status to millions of people in the country unlawfully is drawing criticism\n                        from across the political spectrum. The deal will face intense scrutiny and debate in Congress next week. More...Watch: Immigration Law Deal\n• Campaign Donations Used For Legal Fees• Wolfowitz On His Way Out At World Bank• Dems Seek No-Confidence Vote On Gonzales• More StoriesHealthPrescription Drug Use Up In Teen Girls\nThe number of teens, especially girls, taking prescription drugs for type 2 diabetes, sleep problems, and other illnesses\n                        is up, according to a new report from Medco Health Solutions. More...\n• Anheuser-Busch Pulls \"Spykes\"\n                     \t\t\t\t\t| Watch• 7 In 10 Puzzled By Slew Of Cancer Messages• What's In A Name? Face Shape, Maybe• More StoriesSciTechTime For Whale Rescue Plan B\nPlaying sounds of other humpback whales failed to lure them back down the Sacramento River to San Francisco Bay and the Pacific\n                        Ocean, so now biologists will try something else. The pair are believed to be a mother and calf, and are injured. More...Watch: Whale Rescue In California\n• South Florida Drought Damaging Economy• Army Lab Uses Sports Science On Soldiers• Ocean May Be Absorbing Less Carbon Dioxide• More StoriesBusinessChina Moves To Cool Sizzling Economy\nChina is taking steps to let its currency appreciate faster against the dollar and to cool its sizzling economy ahead of what\n                        are expected to contentious talks in Washington over Beijing's soaring trade surplus. More...\n• $500M Treasure Ship Found In Atlantic• Meet \"Generation Plastic\"\n                     \t\t\t\t\t| Watch• South Florida Drought Damaging Economy• More StoriesEntertainmentLeMond Bombshell At Landis Hearing\nThe three-time Tour de France winner testified that Landis' manager had threatened to reveal that LeMond had been sexually\n                        abused as a child if LeMond showed up at the doping hearing of fellow Tour champ Landis. The manager was then fired by Landis. More...Watch: Shocker In Landis Doping Trail\n• Madonna Releases New Song for Charity\n                     \t\t\t\t\t| Watch• Johansson to Play Mary, Queen of Scots• Manson: Divorce Left Me With \"No Soul\"• More StoriesOpinionClinton A Vexing Foe For Opponents\nHillary Clinton is not your typical female presidential candidate, which, as The New Republic points out, requires\n                        those running against her to find new ways to blunt the advantage provided by her gender. More...Watch: Debating Dems\n• Dumbed-Down Intelligence\n                     \t\t\t\t\t| Watch• Speed It Up• The Old Time Hypocrisy Hour\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Celeb Spot: LeMond Bombshell At Landis Hearing\nThe three-time Tour de France winner testified that Landis' manager had threatened to reveal that LeMond had been sexually\n                        abused as a child if LeMond showed up at the doping hearing of fellow Tour champ Landis. The manager was then fired by Landis. More...Watch: Shocker In Landis Doping Trail\n• EARLY SHOW: Just Ask A Woman ... About Motherhood\n                     \t\t\t\t\t| Watch• CBS Evening News: Meet \"Generation Plastic\"\n                     \t\t\t\t\t| Watch• 60 Minutes: U.S. Coast Guard's Deepwater\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nPanda's Birth Breaks RecordsAt the age of 14, Panda Jini gave birth to a female cub after 324 days of pregnancy. China claims Jini is the oldest panda\n                                    to have a baby and the longest pregnancy period. Russ Mitchell reports.\nTOP VIDEOS\nMike Myers On Ogre Life\nImmigration Bill: Amnesty?\nWhale Rescue In California\nShocker In Landis Doping Trail\nCleaning Business Turns Green\nFire Burns Down N.J. Homes\nCBS' New Primetime Lineup\nSay Goodbye To Cellulite\nSex Offenders On MySpace\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMike Wallace profiles GOP presidential hopeful Mitt Romney, this Sunday, 7 p.m. ET/PT.48 Hours MysteryDeath Of A Dream:An aspiring Broadway dancer is murdered. Did her secrets contribute to her death? Erin Moriarty\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}