{"category": "ham", "to_address": "\"Matthew Johnson\" <debian@matthew.ath.cx>", "from_address": "\"Jason Spiro\" <jasonspiro4@gmail.com>", "subject": "Re: Could you please forward this proposed license to Teosto? (was: Re: Choosing a license for Frets on Fire songs)", "body": "Hi Matthew,\n\n2007/4/26, Matthew Johnson  wrote:\n> On Thu Apr 26 16:25, Jason Spiro wrote:\n> > Copyright (C)  \n> >\n> > Permission is hereby granted, free of charge, to any person obtaining\n> > a copy of this work (the \"Work\") to use, modify, copy, publish,\n> > distribute, publicly perform, and/or sublicense copies of the Work,\n> > and/or to charge a fee for the physical act of transferring copies,\n> > and/or to offer warranty protection for a fee, and/or to permit\n> > persons to whom the Work is furnished to do all of the aforementioned\n> > actions, subject to the following conditions:\n> >\n> > * Persons distributing the Work to the general public may only do so\n> > if the Work is distributed and/or bundled with game software.\n> > * No person may musically rearrange the Work or modify the lyrics of\n> > the Work unless that person obtains permission to do so from either\n> > the author or the copyright holder.\n>\n> This contradicts \"Permission is hereby granted, ... to use, modify,\"\n> above.\n\nI don't know much about how to write licenses, and this is the first\none I have ever written.  I figured that everything after the \"subject\nto the following conditions:\" would automatically override the initial\npermissions I gave.  I guess I was wrong?\n\n> May I suggest using a CCby licence and adding 'may only be\n> distributed with the game' rather than cobbling together your own\n> inconsistent one...\n\nCC-BY-ND doesn't let anyone put additional restrictions on covered\nworks; it says:  \"Licensor shall not be bound by any additional\nprovisions that may appear in any communication from You.\"  And we\ncan't use a CC-BY-NC-ND license with additional permissions either:\n\"...the game's music can't be distributed with a CC license. The\nproblem is while the songs can freely be distributed with the game,\nthey can't be distributed or otherwise used independently of the game\nwithout a specific license from Teosto.\"[1]\n\nIt *is* possible to make new licenses by copying and editing the text\nof Creative Commons licenses.[2]  Perhaps I or someone else could\nmodify the text of CC-BY and add restrictions on redistribution\nseparate from game software, musical rearrangement, and changes to\nlyrics?  But since CC-BY is a much longer license wouldn't it'd be\nharder to wrap one's head around it in order to modify?  Maybe it'd\njust be easier for us to fix the license I wrote.\n\nAnd then again, I wonder if Teosto will accept *any* license we write.\n Maybe we should just send them the license I wrote (after it's\nfixed), ask them if they'll accept it, and if not, ask if they could\nkindly either change it to their liking or write their own.\n\nMaybe it'd be more worth it just to get more DFSG-compliant music out\nthere instead of spending more effort on this.  It can't be that hard\nto find good open-content music and to get the artists to release the\nindividual tracks so we can remix them for FoF, can it?\n\nCheers,\nJason\n\n[1] http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=383316#125\n\n[2] http://creativecommons.org/policies#license says:  \"We do not\nassert a copyright in the text of our licenses. Modified versions of\nour licenses, however, should not be labeled as 'Creative Commons'\nlicenses.\"\n\n[3] For those just tuning into the conversation now:  Teosto is the\nFinnish songwriters' copyright collection agency.  They collect\nroyalty payments on behalf of most Finnish musicians.  See\nhttp://en.wikipedia.org/wiki/Teosto\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}