{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "Joy <zvyvi@cablespeed.com>", "subject": "Excellent understanding of Fixed Income performance attribution from the US and global perspective.", "body": "\n\n\n\n\n\n\nExcellent understanding of Fixed Income performance attribution from the\nUS and global perspective.\nAccountable for the project management and schedules of the business\ncritical projects for the regional projects.\nIf that describes you, we'd like to hear from you. Hands on Application\nSupport and Management responsibility f\nThis candidate will also be responsible for providing strategic\ndirection and targeted business knowledge to the application development\nefforts for the Index Arbitrage desk. Ability to work well in a team as\nwell as independently.\nServices firms demand that software managers and software developers\nhave an extremely solid business background. This is a Senior role and\nthis individual will be expected to guide the team in terms of\nattribution techniques and keep the team on the cutting edge of\nattribution and other Analytics. Experience of messaging and\nasynchronous programming models in distributed systems, including Tibco\nbased SOA environments. Experience in relational database and SQL\nprogramming, network programming, Java performance tuning, and\nexperience with developing scalable, robust, high performance systems.\nResponsible for prioritizing initiatives with business sponsors from the\nsales and trading communities.\nDevelopment on substantive application software products. The scope of\nthis role extends to cover significant street or industry wide\ninitiatives such as Sox and BaFIN.\nGood communication skills and inter-personal skills are expected as the\nAnalyst will need to interact with users widely throughout the firm.\nThis candidate will join a development team designing and implementing\nFixed Income Trading and Position Management Applications.\nSpecific knowledge of street wide compliance initiatives such as SOx and\nother industry regulated initiatives.\n\n\n"}