{"category": "ham", "to_address": "speakup@braille.uwo.ca", "from_address": "Deedra Waters <dmwaters@gentoo.org>", "subject": "Re: gentoo dropping speakup support (fwd)", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nI understand the concerns that both of you as well as others have. I\nspent 2 hours this morning arguing on both sides of this argument with\nthe amd64 lead for gentoo as well as other people. Here's the bottom\nline.\n\nThe kernel folks have said that \"speakup's code sucks\" the gentoo kernel\nfolks have said the same thing in the bug.  The bottom line for them is\nthe code sucks there's less and less reason to support speakup, and now\nit's breaking on more and more arches. You 2 at least seem to think that\nif you sit back and wait, sooner or later it's going to get fixed. The\nreality is that from what i can tell speakup has 1 main coder, kirk. I'm\nsure that kirk has other things besides speakup he's working on, While\nthere may be a fix, it's not going to be a quick fix and the reality is\nthat the only fix that has been found for this problem is to bring part\nof it out into user space, see comment 8 i think it is on the bug. So\nthe reality is it's being slowly dragged into user space anyway, you\nmight as well do it right and make it decent code in the process so that\ndistros can start supporting it again.\nOn Sun, 17 Jun 2007, Zachary Kline wrote:\n\n> Date: Sun, 17 Jun 2007 19:30:52 -0700\n> From: Zachary Kline \n> Reply-To: Speakup is a screen review system for Linux.\n>     \n> To: Speakup is a screen review system for Linux. \n> Subject: Re: gentoo dropping speakup support\n>\n> Hello,\n>     I agree.  It is simply not going to work if it is forced into user\n> space.  The fact I have a supported hardware synthesizer means that I'm able\n> to read everything as it comes up, debug things that don't, etc.  I couldn't\n> go back to even software speech, because with software speech you don't get\n> that, and the reason is user space.  Speech-dispatcher and speechd-up and\n> such are userspace programs, and so if the machine doesn't get to a point\n> where they can launch we're dead in the water.  I for one am going to be\n> attending a university in the fall, and don't look forward to having to ask\n> a sighted person to tell me what the kernel panic says or how the FSCK is\n> coming.\n> Please, if possible reconsider this decision.  It is extremely unproductive\n> in the longterm.  Any problems Speakup may have building with 2.6.22 will be\n> fixed in due course.\n> Thank you,\n> Zachary Kline.\n>\n> ----- Original Message -----\n> From: \"Travis Siegel\" \n> To: \"Speakup is a screen review system for Linux.\" \n> Sent: Sunday, June 17, 2007 7:20 PM\n> Subject: Re: gentoo dropping speakup support\n>\n>\n> >I have to strongly disagree here as relates to bootable messages.\n> > Speakup makes linux the *only* os where blind users can see the boot\n> > up as it happens.  Even dos can't do that, and I have more than once\n> > managed to fix a machine with linux because of the speakup capability\n> > to speak *all* bootup messages.  Dumping them to a logfile, booting\n> > with a live cd, then reading the log may work for users who are\n> > advanced enough to figure it out, (or are lucky enough to have simple\n> > enough configurations this can be done) but by doing so, you're\n> > basically saying that those who want to troubleshoot their own boxes\n> > w/o sighted assistance are sol.\n> > And, if the hd is bad, then your logging isn't going to work anyhow.\n> > Not to mention, this isn't a process that can be done w/o sighted\n> > assistance.\n> > While I'm more of a slackware user than anything else, having speakup\n> > work out of the box is something I've enjoyed almost since speakup\n> > was released, and I for one would be extremely sorry (not to mention\n> > irritated at the lack of access it would mean) to have it removed\n> > into user space.  There's already programs for user space access\n> > (yasr anyone) and while those work for normal usage, they aren't\n> > usable for troubleshooting and/or fixing a broken machine.  I've been\n> > doing my own technical support since 1990 (or thereabouts) and having\n> > this capability now removed would be the equivalent of moving to\n> > vista before any screen readers were specifically targeted to it.\n> > Sure, you could use the system, but you're not going to get anywhere\n> > near the full use out of your system you'd otherwise get.\n\nDeedra Waters - Gentoo accessibility and amd64 -\ndmwaters@gentoo.org\nGentoo linux: http://www.gentoo.org\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.7 (GNU/Linux)\n\niD8DBQFGdfcnU5AGPOTGNc8RAtU/AJoDWWvMqJmhkLSanU6w4SxbSHLGWACfVV0W\nRjtdEqnDQbb0As0tGK+kZ3g=\n=r+dK\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}