{"category": "ham", "to_address": "R-help@stat.math.ethz.ch", "from_address": "Robert A LaBudde <ral@lcfltd.com>", "subject": "Re: [R] Windows vista's early terminate Rgui execution", "body": "At 03:28 PM 6/10/2007, adschai@optonline.net wrote:\n>Hi,I have a frustrating problem from vista that I wonder if anyone \n>has come across the same problem. I wrote a script that involves \n>long computational time (although, during the calculation, it spits \n>out text on the gui to notify me the progress of the calculation \n>periodically). Windows vista always stopped my calculation and \n>claimed that 'Rgui is stop-working. Windows is checking for \n>solution.' And when I looked into task manager, windows already \n>stopped my Rgui process. I am quite disappointed with this. I would \n>really appreciate if anyone finds a solution to go around this \n>windows vista problem? Particularly, how to turn off this feature in \n>vista? Any help would be really appreciated. Thank you!- adschai\n\nYou probably need to contact Vista periodically so it knows you are awake.\n\nJust include a line that does a call to Vista that doesn't do output, such as\n\nuseless <- dir()\n\nplaced in some outer loop that satisfies the \"drop dead\" time between calls.\n\nAlternatively, you can attempt to find out how to change the registry \nentry corresponding to the wait time and increase it to a value you \ncan live with.\n\n================================================================\nRobert A. LaBudde, PhD, PAS, Dpl. ACAFS  e-mail: ral@lcfltd.com\nLeast Cost Formulations, Ltd.            URL: http://lcfltd.com/\n824 Timberlake Drive                     Tel: 757-467-0954\nVirginia Beach, VA 23464-3239            Fax: 757-467-2947\n\n\"Vere scire est per causas scire\"\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}