{"category": "spam", "to_address": "<kedda@flax24.uwaterloo.ca>", "from_address": "\"HealthSport Inc. News\"<Vicki.Gudenau@angaree.com>", "subject": "HSPO Target Price $4.00 by Beacon Equity Research", "body": "\n\n\nHSPO Target Price $4.00 by Beacon Equity Research\n\n\n\n\n\nHSPO Target Price $4.00 by Beacon Equity Research\n\n\n\nHealthSport Inc. Rated 'Speculative Buy,' Target Price $4.00 by Beacon Equity Research\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nHealthSport Inc. Rated 'Speculative Buy,' \n                              Target Price$4.00 by Beacon Equity   Research\n\n\n\n \n\n\n\n \n\n\n                          In the report, the analyst writes, \"HealthSport, Inc. develops, manufactures and   markets nutritional supplements in a unique edible film strip delivery system.   The Company currently markets its electrolyte strips under the Enlyten   SportStrips™ in   lemon-lime, orange and sour orange flavors. The strips are used as nutritional   supplements to replenish energy during periods of exertion.\n\n \n\n\n\n\n \n HealthSport is   currently focused on the sports activity replenishment segment. In addition, the   Company is developing other edible film strip products for hangover recovery,   mineral replacement and a variety of other applications.\"\n\n                      In addition to introducing new products, the Company plans to   grow through acquisitions. In April 2005, HealthSport contracted with InnoZen,   Inc. to jointly develop a film strip product containing electrolytes. In May   2007, the Company acquired InnoZen. This acquisition will facilitate   HealthSport's ability to formulate and develop new edible film products and   delivery systems for nutritional supplements and over-the-counter drug   applications. The Company has also entered into joint venture agreements with   various companies for the formulation and development of electrolyte strips.\nInvestment Highlights\nDemand for easy-to-swallow   formulations fuels market growth\nThe market for edible strips is in an early   development stage, with an anticipated growth of 40% annually over the   medium-term. Easy to swallow, convenient handling (compared to energy drinks),   and rapid absorption in the blood stream are key delivery system advantages   fueling industry growth.\nStrong portfolio of   innovative products \nHealthSport produces novel products in film strip   form that dissolve quickly in the mouth and provide nutritional supplements to   the body during periods of physical stress. The Company is also developing   products in strip form for hangover recovery, mineral replacement and other   applications. These products are more portable than drinks and tablets, easier   to administer and more cost effective than traditional nutritional solutions.   Market acceptance of these products is increasing and creating favorable growth   opportunities for HealthSport. \nAcquisition strategy enhances   growth\nHealthSport recently acquired InnoZen Inc. for $40   million and plans to develop new edible film products and delivery systems for   nutritional supplements and over-the-counter drugs. The Company also recently   acquired Cooley Nutraceuticals, Inc. which owns a formula that provides relief   from hangover symptoms. These acquisitions extend the  Company's   capabilities, product offerings and revenue opportunties.\nEffective marketing strategy \nThe Company is aggressively promoting its existing products   while continuing to develop new products. Enlyten, Inc., HealthSport's marketing   and distribution division, has a multi-year deal with the Buffalo Bills NFL   football franchise to integrate Enlyten SportStrips into the player's    training program.  The Company has also signed US   women's professional soccer player, Brandi Chastain, as a celebrity spokesperson   for Enlyten SportStrips.\n\n \n \n\n\n \n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}