{"category": "spam", "to_address": "producttestpanel@flax9.uwaterloo.ca", "from_address": "Mortgage Rates <Devine@jsvolsvmwc.excelmortgagegroup.net>", "subject": "Get mortgage quotes from multiple lenders", "body": "You registered to receive this and similar offers from  on .\n\nDid you know that you're paying too much for your home?\n\nIf you're tired of hearing about \"lenders who compete\" for your\nbusiness, and want results, then we have the solution for you.\n\nhttp://jsvolsvmwc.excelmortgagegroup.net/t/l?h4-ptv-1-k80-678d\n\nOur technology has matched your individual profile against thousands of\nmortgage options across the country, and has determined what company in\nyour area can best serve your needs.\n\nTo find out what option we've selected for you, apply for a freel, no\nobligation loan analysis at:\n\nhttp://jsvolsvmwc.excelmortgagegroup.net/t/l?h4-ptv-2-k80-678d\n\n\n\nYou are receiving this message because you agreed to accept electronic\nmail from the publisher listed below. To unsubscribe from the \npublisher, please see their instructions at the bottom of this message.\nIf you would prefer to continue to receive electronic messages from \nthe publisher, but no longer wish to receive messages promoting National\nMortgage Leads, you may contact us at: LTOPTOUT, ATTN:  \tNational\nMortgage Leads, 269 S Beverly Drive, #346, Beverly Hills, CA 90212 678d or\nplease type the following URL into your browser's \naddress bar:\n\nhttp://jsvolsvmwc.excelmortgagegroup.net/t/l?h4-ptv-3-c9b-678d\n\n\nIf you no longer wish to receive these commercial emails, you may remove yourself from our mailing list by clicking here http://jsvolsvmwc.excelmortgagegroup.net/remove?r.Devine.12-90ffe62-2227.speedy.uwaterloo.ca.-producttestpanel?r click here or by calling our unsubscribe hotline at 864-752-1051. Please note this phone number is used solely for unsubscribe requests. Please allow up to five business days for your request to be processed.\n\nYou may also contact us by writing to us at our postal address: Montague| 9600 Great Hills Trail, Suite 150 W| Austin, TX 28759\n\n\n\n\n803-790-8381 x262\n3830 Forest Drive, Suite 207\nColumbia , SC 29204\nUSA\n\n\n\n\n"}