{"category": "ham", "to_address": "Volker.Lendecke@SerNet.DE", "from_address": "\"Gerald (Jerry) Carter\" <jerry@samba.org>", "subject": "Re: a way to disable ADS in winbind in samba3", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nVolker,\n\n> I think this particular one is missing DNS on the DCs,\n\nWe should have better fallback code in this case to\ndetect failure and fall back to the winbindd_rpc methods.\n\n> I myself have not seen that. This is the cluster that Tridge\n> is testing on. I myself have several applications where I\n> want winbind to authenticate for squid in a DMZ, and I only\n> want it to do the NTLM auth proxy. Nothing else. And for\n> security reasons the connection between the DMZ and any DC\n> should be shut down as much as possible. I know, 445 is\n> pretty bad, but it's better than everything necessary for\n> AD.\n\nMy experiences are not quite the same as yours an Tridge's.\nCenteris is making a living from selling a winbindd based\nsolution into AD environments and our experience has been\nthat the majority of the time, the domain environment is\nsetup correctly and the AD admins are pretty competent folks.\n\nThe reason why I'm opposed to reverting the \"use winbindd_ads\nwhenever possible\" is that if penalizes everyone who uses\nSamba for the benefit of a few broken installations.\nI'm a little surprised since you have been the main proponent\nof getting rid of any distinction between security ads and\nsecurity = domain.\n\nHowever, it there really has to be a way to deal with this,\nI would have to vote for Tridge's patch.  As much as I\nhate new parameters, at least this one would not change\nthe current default behavior which I believe to be correct.\n\n\n\n\n\n\ncheers, jerry\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.4 (MingW32)\nComment: Using GnuPG with Mozilla - http://enigmail.mozdev.org\n\niD8DBQFGWvHjIR7qMdg1EfYRAguBAJ9HKQlqSDh6orKEGYqJXEaCzAHM0gCg3SkH\nB4bW4ZZAnatSE98uFO7Fvno=\n=4IXN\n-----END PGP SIGNATURE-----\n\n"}