{"category": "spam", "to_address": "undisclosed-recipients:;", "from_address": "williamsjame002@aol.co.uk", "subject": "Re: Opportunity", "body": "\nMr James Williams\nNational Westminster Bank Plc,\n41 Lothbury,London, EC2P 2BP, United Kingdom\n \nDear Friend,\nI got your contact through the internet and I decided to reach you because presently I am in desperate need of a trust worthy foreign person for this proposal. I am James Williams Head Computer Department, National Westminster Bank Plc. In 2004, one of our customer (foreigner) who is a consultant/General contractor here in United Kingdom, made a numbered time Fixed) Deposit, valued at $11,500,000.00 (Eleven Million, Five Hundred Thousand United States Dollars), for twelve (12) calendar months in my Bank branch.\n  \nUpon maturity, we sent a routine notification to his forwarding address but got no reply. After a month, we sent a reminder and finally we discovered from his contact  employers that he is no longer on earth. The said fund is still in my Bank and the interest is being rolled over with the principal sum at the end of each year. in accordance with the British banking and Financial Law, at the expiration of 4 (four) years, the money will be revert to the ownership of the British Government if nobody come for the claim.\nConsequently, I shall present you as the next of kin, hence you are a foreigner it will be easy for us to claim the money and the money will be share in the ratio of 60% for me, 40% for you. There is no risk involved as I will use my position as the Head Computer Department to secure approvals and guarantee the successful execution of this transaction within 7 working days. If this proposal interest you,please include your private phone and fax number, full contact address, date of birth and occupation for the legal documentation of the said fund.  I will like you to furnish me with the following above information through my Email: williamsjame_01@yahoo.com.hk\n  \nThanks and remain bless.\n  \nBest regards.\n  \nMr James Williams \nNational Westminster Bank Plc\n\n\nGet a FREE AOL Email account with 2GB of storage.  Plus, share and store photos and experience exclusively recorded live music Sessions from your favourite artists. Click Here for more information.\n\n"}