{"category": "ham", "to_address": "Jim Lemon <jim@bitwrit.com.au>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] to draw a smooth arc", "body": "On Tue, 1 May 2007, Jim Lemon wrote:\n\n> Paulo Barata wrote:\n>> Dear R-list members,\n>>\n>> I would like to draw a smooth arc. I can draw an arc\n>> parametrically, but this produces an arc too coarse,\n>> even allowing for different increments in sequence t\n>> in the example below. Function \"symbols\" (graphics) does\n>> produce a smooth circle, but it cannot produce an arc.\n>>\n>> Please see the following example, drawing complete circles:\n>>\n>> plot(-5:5,-5:5,type='n')\n>> ## draws circle with function symbols (package graphics)\n>> ## - inner circle is very smooth:\n>> symbols(0,0,circles=2,add=TRUE)\n>> ## draws circle parametrically - outer circle is too coarse:\n>> pi <- 4*atan(1)\n>> t <- seq(0,2*pi,0.02)\n>> lines(4*cos(t),4*sin(t))\n>>\n>> Package \"plotrix\" has a function \"draw.arc\", but arcs produced\n>> with this function are also either too coarse or too polygonal,\n>> depending on the number of polygons used to approximate the arc.\n>>\n>> Is there a way to harness the characteristics of function\n>> \"symbols\" (graphics) to draw a smooth arc, not just a complete\n>> circle?\n>>\n> Hi Paulo,\n> I may be misunderstanding you, but have you tried to increase the number\n> of segments in the arc using the \"n\" argument?\n>\n> draw.arc(1,1,1,n=100)\n\nPut it another way, drawing arcs is not a primitive in the R graphics \nsystem but drawing circles is.  So there is no low-level way to draw an \narc of a circle except via line segments.  (Quite a few graphics devices \ndraw circles via line segments, but not all and vector-graphics systems \nlike postscript can often do better.)\n\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}