{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@speedy.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "refractory: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\nMore Brain, Less Drain!\n\nOne brain-building, quick-hit email a day\nhelps keep mental decline at bay.\nPump up your brain - fast!\n\nClick here to Get KnowledgeNews now\nADVERTISEMENT\nWord of the Day for Sunday, April 15, 2007\nrefractory \\rih-FRAK-tuh-ree\\, adjective:\n1. Stubbornly disobedient; unmanageable.\n2. Resisting ordinary treatment or cure.\n3. Difficult to melt or work; capable of enduring high temperature.\nIt's a head shot of Lucien Bouchard peering out of the dark, openmouthed, teeth showing, eyes glittering and appearing not to have shaved in a week. In another age, the shot might have been held up to a refractory kid with the warning, \"The boogeyman will get you if you don't watch out.\" -- George Bain, \"Whose Reality?\", Time, October 13, 1997\nAnd even those most refractory infections of all, those caused by viruses--formerly dismissed as untreatable because viruses disappeared into the inner labyrinths of the living cells, merging into the very genomes--were becoming amenable to early treatments. -- Frank Ryan M.D., Virus X\nBauxite is mined in only a few places. It is used to make aluminum, iron, copper and dozens of refractory products such as the bricks used to line blast furnaces. -- Robert Goodrich, \"Melvin Price Support Center's Bauxite Will Be Sold\", St. Louis Post-Dispatch, August 10, 2000\nRefractory comes from Latin refractarius, \"stubborn,\" from refragari, \"to oppose, to withstand, to thwart.\"\nDictionary.com Entry and Pronunciation for refractory\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9300895-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}