{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Ben Finney <bignose+hates-spam@benfinney.id.au>", "subject": "Re: help with crafting proper license header for a dual-licensing project", "body": "Shriramana Sharma  writes:\n\n> A company X which creates a product A, has decided to dual-license\n> their project under the GPL and a commercial-license.\n\nThe GPL *is* a commercial license; all free software is entirely open\nto commercial activity, by definition. To imply otherwise is to\nconfuse the issues of free software, for yourself and all you converse\nwith. You've made this error here before and been corrected; please,\ndon't propagate it further.\n\nYou should instead be contrasting \"GPL and a proprietary license\", or\nsome other term that describes properties of the other license that\n*are* opposite to the GPL.\n\n\nAs for the header itself, one overall comment is: it's trying to say\ntoo much, especially repeating things that don't need to be in the\nheader of every file. The more wordy you make this header the less\nlikely people will read it at all.\n\n> /*\n> Copyright (C) 2007, Company X, Country Y.  All rights reserved.\n>\n> This file is part of Product A Open Source Edition.\n\nGood so far; clear and concise.\n\nYou would be best to make clear the fact that there are multiple\nlicense choices before presenting them; this would also reduce the\nverbiage when you transition later in the text.\n\nPerhaps follow the above statements with \"You may, at your option,\nreceive a license to this work under either the GNU General Public\nLicense or the FooCorp Proprietary License, as explained below:\"\n\n> This file may be used under the terms of the GNU General Public\n> License version 2.0 as published by the Free Software Foundation and\n> appearing in the file LICENSE.GPL included in the packaging of this\n> file.\n\nYou should change references to \"this file\" to \"this work\", so that\nit's clear the license applies to many files in aggregate, not just\nfile-by-file.\n\nThere's no \"version 2.0\" of the GPL, only \"version 2\".\n\nYou might want to consider a \"version 2 or, at your option, any later\nversion\" clause.\n\n> Please visit http://www.companyxwebsite.com/licensing/ to ensure\n> that the use you have in mind for this file will meet the\n> requirements of the GPL.\n\nThe company's website is probably not the best place to direct the\nreader for \"ensur[ing] the use you have in mind ... will meet the\nrequirements of the GPL\". Better would be to point them to the GPL FAQ\nat the FSF website.\n\nReally, though, this isn't something that should be in a license\ndeclaration at all; I'd leave it out.\n\n\nThe following disclaimer should be prefixed to make explicit that it\nis conditional only on licensing the work under the GNU GPL;\ne.g. \"When receiving this work under the GNU GPL, ...\"\n\n> This file is provided AS IS with NO WARRANTY OF ANY KIND, INCLUDING\n> THE WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n> PURPOSE.\n\n\"This file\" -> \"This work\".\n\n> NOTE:\n>\n> The most important requirement for using Product A under the GPL is\n> that any works based on Product A -- whether dependent on Product A\n> or derived from Product A -- must also be licensed under the GPL.\n\nThis is commentary that can be read in the GPL text. It's cruft to put\nit here.\n\n> If you wish to base a work on Product A but desire to license it\n> under your own terms, e.g. a closed source license, you may purchase\n> Product A Professional Edition from Company X.\n\nStrictly, one would purchase a specific *license* to Product A.\n\n> The Professional Edition is content-identical to the Open Source\n> Edition but it is licensed under a commercial license,\n\n\"commercial\" does not distinguish it from the GPL, as noted\nabove. Please don't put this error into the file header.\n\n\"commercial\" -> \"proprietary\".\n\n> which gives you -- under certain conditions -- the right to use any\n> license you wish for your work based on Product A. It also fetches\n> you limited support from Company X.\n\nAgain, cruft. Since this part isn't legally binding, simply direct\nthem to the place where they can read about it, instead of making the\nheader larger.\n\n> For details on this dual-licensing policy and the full terms of the\n> commercial license,\n\n\"commercial\" -> \"proprietary\"; or, better, the full name of the\nlicense, e.g. \"FooCorp Proprietary License\".\n\n> please visit: http://www.companyxwebsite.com/licensing/\n\nThis is probably best, since if you include the license text *in* the\nproduct, it may confuse the user into thinking they already have\nreceived that license to the work. (This is unlike the GPL, which\n*should* be included in the package, since by receiving the work at\nall they have it licensed under the GPL.)\n\n> Users of the Product A Open Source Edition may also purchase support\n> for Product A as a service, provided the developers' time schedule\n> and workload allows it.\n\nCruft, remove.\n\n> The names of the authors or of the copyright holder (Company X) must\n> not be used for promoting any product or service which uses or\n> contains Product A. However, the trademark names 'Product A' and\n> 'Product A Inside' may be used for promoting such products or\n> services.\n> */\n\nUtterly irrelevant in a copyright statement, and no need to state any\nof this for it to apply under trademark or representation laws. Cruft,\nremove.\n\n\nHope that helps.\n\n-- \n \\     \"Once consumers can no longer get free music, they will have to |\n  `\\     buy the music in the formats we choose to put out.\"  -- Steve |\n_o__)                                  Heckler, VP of Sony Music, 2001 |\nBen Finney\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}