{"category": "ham", "to_address": "Martin Maechler <maechler@stat.math.ethz.ch>,\n   Sam McClatchie <Sam.McClatchie@noaa.gov>", "from_address": "Michael Dewey <med@aghmed.fsnet.co.uk>", "subject": "Re: [R] digest readability/ thunderbird email client/ R-help", "body": "At 21:00 28/04/2007, Martin Maechler wrote:\n>Hi Sam,\n\nI posted a request for information on how various mailers handled \nthis so I could summarise the results and put it on a helpful \nwebpage. Nobody was willing to sing the praises of his/her favourite \nmailer so the only one I can suggest is the one I use myself, Eudora, \nalthough that is now no longer under development.\n\nMy offer is still open if anyone has anything to contribute.\n\n\n> >>>>> \"SamMc\" == Sam McClatchie \n> >>>>>     on Fri, 27 Apr 2007 11:21:56 -0700 writes:\n>\n>     SamMc> System:Linux kernel 2.6.15 Ubuntu dapper\n>     .......\n>\n>\n>     SamMc> Has anyone figured out how to make the R-help digest\n>     SamMc> more easily readable in the Thunderbird mail client?\n>     SamMc> I think the digest used to be more readable than is\n>     SamMc> currently the case with all of the messages as\n>     SamMc> attachments.\n>\n>     SamMc> I know the work around is to get individual messages\n>     SamMc> rather than the digest, use another mail client, or\n>     SamMc> just look at the archives on the web...\n>\n>     {and there are at least two alternatives to the standard\n>      archives, notably Gmane.\n>      BTW: Just found an URL that should list all R lists carried\n>           by them :  http://dir.gmane.org/search.php?match=.r.\n>\n>\n>It had been pointed out more than once that Thunderbird\n>unfortunately is not adhering to the standard(s) of such\n>digests-- too bad it still is not.\n>\n>One alternative is to get the digest as \"plain\" digest\n>((which BTW another standard-complying digest format, that\n>  e.g. emacs Rmail or VM can easily deal with))\n>which will most probably just appear as one long e-mail in\n>Thunderbird, with \"table of contents\" of all the subject lines,\n>but nothing \"clickable\"\n>\n>Regards,\n>Martin\n>\n>Martin Maechler, ETH Zurich\n\nMichael Dewey\nmed@aghmed.fsnet.co.uk\nhttp://www.aghmed.fsnet.co.uk/home.html\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}