{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "\"Rochelle and Bethea\" <rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, here's your forecast for May 28th - June 3rd", "body": "\n\n\n\n\n\n\n\n\nMemo, to ensure that your weekly forecasts are delivered correctly to your inbox, please add our email address Rochelle@myhealthwealthandhappiness.com to your address book.\n \n\nFull Moon, May 31, 9:05 PM EST\n\n\n\n\n\n\n               \n\n\n\n\nDear Memo,\n\n    Because of all the good fortune surrounding you now, my good friend, I want to make sure you make this your time!\n    To do this easily, it helps to write your hopes and wishes down on a sheet of paper, making sure you are enthusiastic about each one and that they are specific.  If you are not quite sure what kinds of goals you should be writing down, let me give you an example of what I am talking about…\n    Here are the dreams I wrote down for myself before I became a well-known psychic:\n\n    1.  I want to buy my mother a grand house where she can entertain her family and friends and where she can watch the ocean.\n    2.  I want to strengthen my powers so I can use my gifts to help people better their lives.\n    3.  I want to write books that will show people how to take advantage of good fortune, so they can easily fulfill their dreams.\n    4.  I want to travel the world.\n\n    When I started working on my dream of becoming a professional astrologer 30 years ago, I had no training, and no proven value.  I was not a celebrity in the field as I am now, and I didn't have an instant entrée into the profession.  However, I did have a dream.  I had a dream of making a living doing the one thing I loved…and that was using my psychic power to help people.  Step by step, I made my dream come true, and so can you.\n    My friend, as much as you may believe you have selected your dreams, Bethea and I both believe that your dreams select you.  The Universe pushes you to use your special gifts and talents.  So please, allow it to happen.  Especially now.  Give yourself up to your dreams and follow them wherever they take you.  There is no doubt that you will enjoy the trip.\n\n                      Until next week,                          \nP.S.  Memo, this week Bethea and I are very excited to introduce a brand new feature to your forecast, a personalized Biorhythm reading.  Just click on the Biorhythm button and you will see your reading for today!  Each day you click on it, you will receive your up-dated Biorhythm reading.  We hope you enjoy it!\n\n\n\n\n                       \n\n\n\n\n\n\n\n                 \n\n\n\n    We've reached the sweetest part of the year and, with Mercury moving into Cancer, it is time to reach out to friends and family.  The Full Moon occurs on the 1st and, as it is in fiery Sagittarius, well within striking distance of both Mars and Jupiter, it could be pretty high energy, Memo.  By Sunday the 3rd everyone will have calmed down a little and will really appreciate a laid back day of dining and socializing.  You really could be the focus of everyone's affection if you provide the venue.\n\n\n\n\n\nMemo             May 28 - June 3             \n\n\n\n\n \n\n\n\n    Memo, I want you to take maximum advantage of the luck coming your way this week. From my calculations, Thursday is going to be your lucky day for this period.  And your Lucky Numbers are 02, 04, 09, 17, 25, 32.  I hope you'll make the best of them.\n\n\n\n\n\n\n\n\n\n\n\nMay 28th for Memo\n\n\n\n\n\n\n\n\n\n    There comes a time when actions speak louder than words.  This could be such a time.  Especially when it concerns a disagreement that you may have had with an associate.\n\n\n\n\n\n\n\n    Why not contact siblings, family members, neighbors and associates with some of your ideas today?  This would be a good time for planning sessions, reunions or special meetings.  Speak what's on your mind.\n\n\n\n\n\n\n\n\n\n\n\nMay 29th for Memo\n \n \n \n \n \n\n \n \n    The keyword for now is balance.  When communicating with partners or friends try to understand their point of view.  You'll come out on top, if you are willing to listen to them.\n\n\n\n\n\n\n\n\n\n\n\nMay 30th for Memo\n\n \n \n \n\n\n \n \n    A stimulating talk with an unusual person could prompt you to take up an intellectual pursuit.  It's so important to have hobbies, my friend.  They keep you young, happy, and enthusiastic.\n\n\n \n\n \n \n    Avoid disagreements now so that you don't get involved in any bad feelings.  Keep spirits upbeat in your environment so that little annoyances don't get you down.\n\n \n \n \n \n\n\n\n\n    Your creative imagination and artistic talents are stimulated today. My dear, you are a romantic at heart and will find ways to display your affections for those close to you now.  Be cautious in gambling.   \n\n\n\n\n\n\n\n\n\nMay 31st for Memo\n  \n \n\n \n \n \n    You could find the opportunity to put a creative idea into action today.  Watching the idea take shape and turn into a real, workable situation will be a big thrill.  Pat yourself on the back.\n\n\n\n\n\n\n\n\n\n\nJune 1st for Memo\n  \n \n \n \n \n \n    Participation in sporting events, recreational activities, outdoor endeavors or creative undertakings look promising, dear one.  Make a little time for romance, candlelight and life's simpler pleasures.\n\n\n \n\n \n \n    Let your affections out in the open.  Your fondness for someone can be expressed in many ways--and all of them will get through with the desired affect.\n\n\n \n\n\n \n \n    Spending the evening with a close friend can be a delightful success. Make sure it's a colorful get-together.  Candlelight always puts people in a mood to relax and unwind.\n\n \n\n \n \n\n\n\n\n\n\n\n\nJune 2nd for Memo\n  \n \n \n \n\n \n \n    There's plenty of room for love today, my dear, to whatever degree you choose, and with whomever is fortunate enough to be in your sights. Good aims can bring success.\n\n\n\n\n\n\n\n\n\n\nJune 3rd for Memo\n \n \n \n \n \n \n \n    Your effort and dedication can take a toll if you work too hard today. Make sure to take breaks, because you can become anxious or overtired if you work without stopping.  You can get it all done.\n\n\n  \n\n \n \n    If you feel like denying certain feelings, then look to see if you are avoiding some important issues, my dear.  Look for ways to reduce stress, pressure and restrictions in both your work and domestic life.\n\n\n  \n\n \n \n    A friend may ask you to watch over their home while they're away.  You may feel inspired to adopt a pet after taking on this job; helping others brings out your nurturing side.\n\n \n\n \n\n\n\n\n\n\n\n\n    Next week could be fun, Memo!  There even could be some unexpected news or breakthroughs of some kind.\n\n                       Best Regards, \n                        \n\n\n\n\n    If at any time you no longer wish to receive your weekly forecast, you can simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400, and I will stop emailing them to you. It's as simple as that. My only desire is to help you, Memo.\n\n"}