{"category": "ham", "to_address": "Perl Beginners <beginners@perl.org>", "from_address": "Rob Dixon <rob.dixon@350.com>", "subject": "Re: Global varables", "body": "Ben Edwards wrote:\n> On 23/05/07, Rob Dixon  wrote:\n>> Ben Edwards wrote:\n>> >\n>> > Ime a bit confused about globals, I know they should be used with care\n>> > but....\n>> >\n>> > Currently I am using $::var witch seems to work.\n>>\n>> There's no reason to use $::var - it's the same as $main::var so use that\n>> if it's what you mean.\n>>\n>> > 'our var' also seems to work.\n>>\n>> Work how?\n>>\n>> > Cant find any documentation with a discussion of this that answerers\n>> > my question totally.\n>>\n>> And that question would be...?\n>>\n>> > what is the conversion with globals?\n>>\n>> I can't imagine what you mean by this. There is no conversion.\n>>\n>> What are you trying to do Ben? It's actually quite unlikely that you need\n>> 'global' variables (by which you mean package variables) at all. What \n>> can't\n>> you do if you declare everything using 'my'?\n> \n> Ime changing some very badly written - almost everything is done in\n> callbacks.  We are slowly re-writing it but as it is a production\n> system we dont want to take a  bit bang approach yet.  This is partly\n> cos there is stuff that we probably dont need but I need to get to\n> know the perl better to verify this.\n> \n> The main thing that I think is going to be a global (for now) is the\n> database connection.\n> \n> We have something like\n> \n> $dbh = DBI->connect....\n> \n> For now I want to make $dbh available throughout the whole script and\n> am using $::dbh, but as you said maybe this should be $main::dbh.\n> \n> By conventions I mean good practice, if there is such thing for globals;)\n> \n> Is this any help?\n\nYes it is, thank you. But there's still no need for package variables unless\nyou're using multiple packages or multiple source files and need to share the\nsame data across more than one. Typically a database handle would be declared\nlexically and assigned at the start of your program, and a simple\n\n  my $dbh = DBI->connect($dsn, $user, $pass);\n\nwill allow you to access the handle through the rest of the file.\n\nYou may need more than this, however, if your script is spread across multiple\nsource files.\n\nHTH,\n\nRob\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}