{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Candy Dotson\" <neddtxdesigndoq@dtxdesign.com>", "subject": "Make yourself more attractive to others", "body": "\nSummer is coming, time to tone up\n\n\n\n\n\n\nAnatrim – The newest and most exciting product for weighty people is made available now – As seen on ABC.\n\n\nDo you hold in your memory all the cases when you asked yourself to do anything to get rid of this fastly growing number of kilos? Luckily, now no big price is to be paid. With Anatrim, the earth-shaking pound-melting blend, you can achieve naturally health life style and become really slimmer. Take a look at what people write!\n\n\n\n\"I hate to admit it but I was an awful food addict. \n\n\nI devoured all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis fatal passion finished after I started course of taking Anatrim! \n\n\nGod,\n\n\n\n\n my inclination to eat constantly abated, \n\n\nmood increased and I’m the happiest person on the planet 20 pounds in 2.3 months. \n\n\n\n\nI can tell you now I became the happiest person!\"\n\n\n\n\n\nLusia R., Colorado\n\n\n\n\n\n\"Since my early childhood I was a weighty boy. \n\n\nIt’s pretty hard to imagine how I detested being mocked at school. \n\n\n\n\nI detested my weight and I detested even myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nIt literally pulled me out of this horror! The warmest thanks to you, my friends.\"\n\n\n\n\n\nRikky Martin, Chicago\n\n\n\n\n\n\"Know what? Anatrim preserved my marriage! I went into this circle, depression – more eating – just more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nOnce one of my friends showed me web page and I asked for Anatrim immediately. \n\n\nThe results I achieved were magnficent, my appetite came to normal level, I was in good spirits oftener, and, be sure, I tightened my belt with no regrets. And the bedroom became cool also!\"\n\n\n\n\n\nKarl\n\n\n\n\n There many and many testimonial letters left by delighted people trying Anatrim. Why don't you add yourself to the tens of thousands of slim customers and take this all-natural appetite-decreasing energy increasing product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}