{"category": "spam", "to_address": "<IPLACEREPORTS@flax9.UWATERLOO.CA>", "from_address": "\"LouisNavellier@InvestorPlace.com\" <LouisNavellier@InvestorPlace.com>", "subject": "4 Best Stocks Under $24", "body": "\n\n“Greedy for  Big Pops  In  Cheap Stocks?”\n\n\n\n\n\nWe love giving our InvestorPlace.com members benefits like access to this timely message. \n\n In order to ensure you keep receiving special alerts and offers like this one, please take a moment to click on any of the links in this message to reconfirm that this is the email address where you want to receive emails from InvestorPlace.com   \n     \n\n\n\n\n\n\n\n\n“Greedy for\nBig Pops\nIn\nCheap Stocks?”\n--Louis  Navellier\n\n\nAre  you greedy for big moves in little stocks?\nMe  too.\nLow-priced  stocks are on a rampage right now and here is why: investors want more bang for  their buck.\nConsider:  If the Dow had kept up with the S&P Small-Cap Index over the past 8 years,  it would stand, not at 13,000 today, but 27,000!\nSo  I went out and looked for the ABSOLUTE BEST low priced stocks—and came up with  4 fantastic winners.\nHere  are the filters I put them through:\nFILTER #1.  Nothing under $5, nothing over $25.  Stocks under $5 are hockey pucks for  the traders and we’re not traders.   Over $25 and these companies are a little beyond the inflection point in  their growth.  But in between,  you’ve probably found a company that’s out of the garage—but still under the  radar.\n\nThink:  Dell at $11 in September, 1990, which is when Emerging Growth subscribers snapped it  up.  Then think about the $22,000,000  that a $100,000 grub stake in Dell would have become.  Got the idea? Ok, let’s look at...\n\nFILTER  #2.  Extremely strong sales growth.  Nothing less than 50% will do here—and  100% is better.  Why?  This rate of sales growth signifies  market acceptance.  By their  nature, these are innovative companies, but we don’t want the RISKS of  innovation (especially the waiting!).\n\nExample:  Apple spent $500 million on the ill-fated Newton PDA before it was pulled off  the shelves.  That made Apple a  dangerously expensive stock at $9, which is where it languished before the iPod  era. \n\n        But when the iPod sales kicked in, we bought—and  rode the stock up to $85. \n\nFILTER  #3.  Exploding margins.  The four stocks I’ve uncovered are  currently improving operating margin at 200% dip—or close.  This means that the strong sales are  not being bought at too high a price.\n\nExample:  We were impressed with Hansen Natural soft drinks business when it was a $3  stock posting sales that were doubling.   But the clincher was the rate at which Hansen was growing its margins in  2004-—Emerging Growth subscribers have multiplied their money 10 TIMES since  then.\n\nFILTER  #4.  The Holy Grail: earnings  growth.  Expanding operating earnings generally  lead to earnings growth going at warp-speed.  \nA good clue here is to track how analysts are  revising their consumers earnings estimates.  The more they do this, and the bigger their adjustments, the  more you can be certain that the stock will pop on earnings surprise at the end  of the quarter—and hand you windfall profits.\n\nExample:  Holly, the refinery, was a $12 stock with 105% sales growth and profit margins  doubling when we bought it.   Analysts were so befuddled, they couldn’t revise their earnings growth  numbers fast enough.  That’s when we  knew we had to step in.  The  stock’s up nearly 400% since.\n\nWhat They’ve Done\nFor You Recently\nThese  are our 4 filters.  How have they  worked for Emerging Growth subscribers recently?\n\n\nAcergy\nWAS  $11.66\nIS  UP 83%\n\n\nAmerica  Movil \nWAS  $11.77\nIS  UP 306%\n\n\nEZcorp\nWAS  $12.10\nIS  UP 22% \n\n\nGuess  Inc.\nWAS  $18.43\nIS  UP 120%\n\n\nHolly  Corp\nWAS  $11.90 \nIS  UP 398%\n\n\nBolt  Technology\nWAS  $14.14\nIS  UP 142%\n\n\nBoots  & Coots\nWAS  $2.21\nIS  UP 25%\n\n\nGiga  Media\nWAS  $8.21\nIS  UP 68%\n\n\nHansen  Natural \nWAS  $3.29\nIS  UP 1,051%\n\n\nNutriSystem\nWAS  $20.12\nIS  UP 160%\n\n\nSimulations  Plus\nWAS  $6.14\nIS  UP 62%\n\n\nU.S.  Global Investors\nWAS  $11.73\nIS  UP 120%\n\n\nThis list is taken from our current buy  list.  If I listed all the  Under-$24 stock we’ve made at least a double in, using these same 4 simple  criteria, it could take up 3 computer screens and exhaust your patience.  Take it from me: Emerging Growth became the #1 advisory  for 20 years on stocks under $24 that passed these filters.      \nThe Envelope, please:\nInvest With\nThe Masters\nPentagon code-breaker  and math wizard Jim Simons earned $1.7 billion last year in fees.  That works out at about $680,000 an  hour.\nWant  to know how he did it?\nHis  hedge fund locked up an 84% gain in 2006.\nWhich  makes you wonder:\nWhat’s  Jim buying now?\nAnswer: A lot of one tiny company  stock that Emerging Growth subscribers were snapping up before him, at around $12.  (It’s still at $14.) \nWhat  is attracting the attention of a super-quant, crypto-analyst genius?\nFat\nIn  particular, the fat on your hips and especially the fat on your stomach, where  it is most liable to cause a heart attack.  \nA tiny company (144 employees) in St. Paul,  Minnesota has made a breakthrough in diagnosing and managing heart attack  risks.  The diagnostic piece of the  business opens a big opportunity, but it is the risk-management piece that is  genuinely thrilling.\nIt’s  no secret that heart problems are linked to weight, but until now no one has  been able to really help ordinary people get the weight off—and keep it off.\nThis  is a quest that has ALREADY made scores of Emerging Growth subscribers, all over  the country, very rich.  You see,  NutriSystem, which delivers every meal to your home, is a fantastic idea.  The stock was $20 when we bought it and  it just flew through our filters.  Emerging  Growth subscribers are up 160% in short order in NutriSystem.\nBut  this new weight-loss system should do even better—because the solution is based  on personalized feedback as you go through your exercise routine.\nHow Does It\nWork?\nThree weeks ago and, I’d  guess, with Jim Simons’ billions, this tiny diagnostics company hooked up with  Garmin, the GPS people.  Now Garmin  is a company that is likely to do for GPS what Apple did for MP3s, make no  mistake.  \nGarmin has a fitness device for a niche group of  running enthusiasts, but by hooking it up to our company’s metabolic training  program, it gives you voice-guided instructions to encourage you through a  personalized routine.\nWell, even I’d give THAT a try (and I’m allergic  to exercise!).\nAnd  when it hits the market, I bet millions of people will say the same!\nLet’s Look At\nThe Numbers\n\nSales       growth: 53%\n Earnings        growth: 550% in the past 4 quarters\nOperating         margins: tripled\nSelling          at: 19 times forecasted earnings\nPEG Ratio:  a microscopic 0.04\nPotential: $25 in 6 – 9 months—a double        \n\nYou don’t have to        be a math genius like Jim Simons to figure—this is a screaming buy.\nDetails?  Of course you want details!  Go here.\nWant        More?\nIn today’s issue        of Emerging Growth, just posted, I give you the skinny on 3 more under        $24 stocks that have passed our rigorous tests.\n\nthe        seismic surveyor that specializes in “gentle” exploration in        environmentally sensitive areas.         Sales growth: up 135%.         Earnings growth: up 900%, thanks to rapidly expanding operating        margins.  Analysts are        scrambling to revise estimates higher, so look for a big surprise when        earnings are released.  This        is a $9 stock, with a Price-to-Earning ratio of 9, packing a 900%        earnings growth.  They just        don’t make a lot of these! Details here.\n\n\nThe        laboratory that cuts down on one of the leading causes of death—the        medicines themselves.  Over        120,000 deaths a year are the result of drugs’ unique effect on women,        children and the elderly.         Now this lab has a way of predicting the effect on different        patient-groups.  Sales        growth: up 78%.  Earnings        growth: up 140%.  Snap it up        under $11 if you can (be careful—follow instructions so you don’t chase        it away!).  The stock’s up        over 400% since September, but earnings growth has kept pace sufficiently        to make this STILL a bargain. Details here.\n\n\nThis        pocket rocket develops hacker-proof security systems for big        clients.  It only has 184        employees and most of the stock is locked up in institutional portfolios        but this is the best company in a fantastic growth area.  Sales growth: 93%.  Earnings growth: more than        quadrupled—up 333%.  Analysts        were embarrassingly wide of the mark.  Amazingly, this is still a $13 stock—but it’s on its        way to being $25 this year.         Again, details here.\n\nI        Know Where Of\nI        Speak\n The 4 stocks under        $24 I’ve recommended today have a similar potential to Hansen Natural,        which we bought—STOLE, I should say—at $3.29.  That one could have made you 8,000% richer. \nJust        ask my Emerging Growth subscribers about their hefty share of        those profits.\nAnd        while you’re at it ask them, please, about Iris International (up 3,248%)        and Amedysis (up 3,181%).\nAsk        them about Chico’s FAS (up 2,367%), Quality Systems (up 2,142%) and Holly        (up 1,752%).\nAnd        don’t forget to ask my Emerging Growth subscribers about        NutriSystem (bought at $20.12), which is, as we speak, a TRIPLE for us! \nFor the last 27        years Emerging Growth has had one simple mission.  This mission has made Emerging        Growth the        top-performing advisory of the last two decades, so it is worth stating        that mission clearly:\n\nEmerging        Growth’s mission        is to find companies—small, undiscovered gems that are using change to        turn whole industries upside down.  \n\nLow priced stocks        give you easy access to big gains.         Gains that could amount to 42,000%--which is what our Buy List has        achieved over the last 27 years.\nJoin us at Emerging        Growth now.  Just follow this        special link.\nEMERGING GROWTH is        where you would have made\n\n786%        in 18 months in 4 Kids Entertainment\n1,579%        in 14 months in Optical Coating\n794%        in 21 months in Best Buy\n1,704%        in 45 months in Environdyne\n820%        in 24 months in LA Gear\n1,229%        in 15 months in CMGI\n963%        in 15 months in Go2Net\nand        scores more, all up over 500%\n\nToday, investors        want more.  They’re finding        it in low-priced stocks.  The        best ones are in Emerging Growth.\nBuy the 4 stocks        under $24 I’ve told you about today.  You’ll thank me.         Click here.\n\nLouis Navellier,        Editor\nEmerging Growth\n“#1 for 20 years,        1985 - 2005”\nP.S.  IT’S A SECRET.  I don’t know of ANY analyst on        Wall Street who’s figured out that quant genius Jim Simons and his        billions are behind our weight management stock.  It’s a stunning move—and it makes        this $14 stock worth double, overnight.  Details here.\n\n\n\n\n\n\n\n\n---------------------------------------------------------\n      \nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you.\n        Please tell us if your email has changed by visiting here:\nhttp://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice  from InvestorPlace advisors, you can let us know by visiting\nhttp://www.investorplace.com/u/?p=8BP197-1&e=IPLACEREPORTS@SPEEDY.UWATERLOO.CA\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,\n        2420A Gehman Lane\n        Lancaster, PA 17602\nCopyright (c) 2007 ACP Phillips Investment Resources, LLC.\n        All rights reserved.\n05/16/2007 5:16PM\n\nThank you for subscribing to InvestorPlace.com. Please note  that we cannot be liable for any missed bulletins caused by  overzealous spam filters. To ensure that you continue to receive this  valuable part of your service please take a moment to add (LouisNavellier@NavellierEmerging.com) to your address book. Click here for instructions: \nhttp://www.investorplace.com/whitelist.php?eml=LouisNavellier@NavellierEmerging.com\n\nee==8BP197 \n\n\n\n\n\n\n"}