{"category": "spam", "to_address": "producttestpanel@flax9.uwaterloo.ca", "from_address": "New Clubs <Montague@yvepoggked.greatbigsports.com>", "subject": "Play golf with a new set of Taylormade r7 Superquad Driver and Irons", "body": "You registered to receive this and similar offers from  on .\n\nIt's the perfect time of year for golfing and why not do it with a new\nset of clubs?\nGet Taylormade's new r7 Superquad golf set on us!\n\nhttp://yvepoggked.greatbigsports.com/t/l?g4-ovd-1-jls-8jdp\n\nBy completing our incentive gift program the set is yours!  It includes\nthe Superquad Driver and Irons so act fast!  Practice your swing with\nall new equipment that some of the pros are using!   \n\nhttp://yvepoggked.greatbigsports.com/t/l?g4-ovd-2-jls-8jdp\n\n\n\nThis is an advertisement. Promotion sponsored exclusively by\nProduct Test Panel and is subject to terms and conditions. Please see\nwebsite for complete details. Participation eligibility is restricted to\nlegal US residents 18 and over. Product Test Panel is an independent\nrewards program and is not affiliated with, sponsored by, or endorsed by\nany of the listed products, retailers, or manufacturers. Trademarks,\nservice marks, logos, and domain names are the property of their\nrespective owners. This email was sent by an affiliate of\nProduct Test Panel. Product Test Panel authorizes affiliates to\npromote its offers to permission based email lists subject to our\naffiliate terms which include (but are not limited to) providing a\nworking unsubscribe mechanism, not using any third party trademarks such\nas the names of the manufacturers of the gift items we offer in email\nfrom lines, and a subject line which accurately describes the content of\nthe promotional message. If you wish to unsubscribe from this\naffiliate's list, please use the instructions provided by the affiliate.\nIf you would like to place your email address on Product Test Panel's\ndo not contact list, please visit\nhttp://yvepoggked.greatbigsports.com/t/l?g4-ovd-3-3w-8jdp and input your email address,\nor you may write to us at Product Test Panel 3830 Forest Drive, Suite\n207, Columbia, SC 29204. 8jdp Offer not valid to residents of Ohio, and is\nvoid where prohibited by law.\n\nIf you no longer wish to receive these commercial emails, you may remove yourself from our mailing list by clicking here http://yvepoggked.greatbigsports.com/remove?r.Montague.25-90e79ec-16bb.speedy.uwaterloo.ca.-producttestpanel?r click here or by calling our unsubscribe hotline at 864-752-1051. Please note this phone number is used solely for unsubscribe requests. Please allow up to five business days for your request to be processed.\n\nYou may also contact us by writing to us at our postal address: Montague| 9600 Great Hills Trail, Suite 150 W| Austin, TX 28759\n\n\n\n\n"}