{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "cmbrannon@cox.net (C.M. Brannon)", "subject": "Re: TeX", "body": "\"Zachary Kline\"  writes:\n\n> Hello,\n>     I have heard a great deal about the use of TeX and LateX by the blind to do 'structured documents'.  I'm wondering if this package would be appropriate for things like essays, with fairly specific formatting requirements.  (I could always use a Windows word processor to do the same, but I get less feedback with those than I feel comfortable with.)\n> If this is indeed the case, could anybody recommend a good site for learning the fundamentals?  I've heard of a publication called the TeXbook, but can't find an accessible version.\n> Thanks much in advance,\n> Zack.\n\nYes, this is the case.  I prepare all my printed documents with LaTeX.\nIt is especially well-suited to mathematical documents.\nAs an aside, I'm a computer science student.  In several cases,\nassignments have required me to draw various sorts of tree structures,\n(E.G., binary trees in an algorithms course, proof trees in a logic\ncourse, and so forth).  There is a LaTeX package called qtree that\nallows one to draw these things using LaTeX typesetting\ncommands.\nYou can also prepare slides (a la Power Point) using LaTeX.\n\nThe fundamentals of LaTeX are really easy to learn, because a LaTeX\ndocument is nothing but an ASCII text file with some markup commands.\nTry googling for \"LaTeX by Example\".\nThis should turn up some useful pages, including an electronic book\nwritten by one of my former professors.\nOnce you learn the fundamentals, you'll probably pick up the rest by\nosmosis.  I've been learning LaTeX for 5 years; it seems to be a\ncontinual process.\n\nPS. I don't think you want to read the TeX book, even if you can find\nan accessible version.  I get the impression that it is *not* for\nbeginners.\n\n-- Chris\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}