{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Michael Lee <extreme_loco@gorby.us>", "subject": "Tired of your poor health?", "body": "\n\nCan't satisfy your girlfriend? Do you want to?\nGo to the shop\nWe have pills for any disease: ED, Weight loss, Antibiotics etc. Instant shipping, perfect support!\nGo to the shop\nJust buy medication called Viagra or Cialis and you'll have unbelievable sex 24/7!!!\nWith best regards,\nMichael Lee\n \n \nBigman Eski po klichke shest, byvshij pilot kosmicheskih korablej i Byvshij prestupnik Iskariona-9, potrepannyj zhizniu brodiaga s razrushennymi Mechtami, dusha kotorogo, nesmotria ni na chto, ostalas verna romantike Stranstvij, narushitel zakonov sobstvennogo mira, on teleportirovalsia Priamo v pylaiushchee iadro Prokolda, sam sebia prevrativ v raziashchee kope. Povertev sigaretu v palcah, Kengsh slabo usmehnulsia: Prokliatie galtov, sovsem zabyl: teper Dos ne smozhet ee zazhech. On kak by spit. Sharahnuvshis ot maga, temnye vertkie tvari tut zhe brosilis k dvigavshemusia Sledom Leksu. \nIa Byl dostatochno liuboznatelen i nastojchiv, chtoby v redkie chasy dosuga smotret Po vizoseti ne tolko razvlekatelnye programmy s pyshnogrudymi krasotkami, Obladaiushchimi polnym naborom neotrazimyh prelestej, no i izuchat specialnye Infobloki, pozvoliaiushchie zanimatsia samoobrazovaniem. Mne lish bylo porucheno Otyskat ili ego samogo, ili hotia by kakie-nibud ego sledy. No on ne mog pokazat mne ee zhivoj i zdorovoj, i emu Nichego ne ostalos, kak tolko napast. Da net, eto ih nastoiashchij oblik. Ne shevelis. Okazyvaetsia, on prosto podzhidal nuzhnogo momenta. Kogo eto neslo v takuiu ran, tma ih zabodaj? Ne daiut otdohnut Normalnomu cheloveku. Tak zhe bystro smeshchalsia vektor ognia, otstavaia ot linii smeshcheniia Chuzhogo lish na kakie-to doli sekundy. \nMy dvigalis v polnom molchanii okolo chasa, prezhde chem vid ravniny nachal Izmeniatsia. Teper ia dam emu silu, skazal-polyhnul Nkot. Navernoe, mne na rodu napisano nosit na rukah vsiu vashu Semiu, neskolko neukliuzhe poshutil ia zatem. Kak by eto ne sluchilos uzhe posle togo, kak vse my spiatim Ot etoj lihoradki, ohvativshej nash razum. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}