{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 13, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIES3 U.S. Troops Killed In Iraq\nThree U.S. soldiers and two Iraqi translators were killed in two attacks south of Baghdad, the military said on Friday. Meanwhile,\n                        Iraqi lawmakers expressed outrage one day after a suicide bombing inside Baghdad's U.S.-guarded Green Zone. More...Watch: Commander On Iraq Security\n• Rutgers Team Accepts Imus' Apology\n                     \t\t\t\t\t| Watch• Rove Lawyer: E-Mail Deletion Unintentional\n                     \t\t\t\t\t| Watch• Interracial Marriages On The Rise U.S.Storm Builds Steam And Heads East\nWeather experts are keeping close watch on a storm system in the central Plains and central Rockies that is likely to bombard\n                        much of the Northeast and South this weekend. One forecaster calls it a storm that happens \"once every 20 years.\" More...\n• Interracial Marriages On The Rise • Ex-Duke Players Ponder D.A. Lawsuit\n                     \t\t\t\t\t| Watch• In U.S. Illegally, But Still Paying Taxes• More StoriesWorldExiled Tycoon Fomenting Russian Coup?\nA British newspaper reports that an exiled Russian billionaire, already wanted by the Kremlin, is calling for the forced overthrow\n                        of President Putin's government. Boris Berezovsky claims he has support from top-level Kremlin insiders. More...\n• 3 U.S. Troops Killed In Iraq\n                     \t\t\t\t\t| Watch• Strong Quake In Mexico City, Acapulco• Pakistan, China Forge Energy Alliance• More StoriesPoliticsAlleged \"D.C. Madam\" Names A Name\nThe alleged proprietor of a Washington prostitution ring identified the military strategist who developed the \"shock and awe\"\n                        theory as a regular customer. She said he's \"only one of dozens\" of the high-profile clients she will expose. More...\n• World Bank Chief Has Girlfriend Problem • The Democrats' Dollars Doyenne• New Jersey Gov. Still Critical After Crash\n                     \t\t\t\t\t| Watch• More StoriesHealthTiming Enhances Allergy And Asthma Drugs\nFor best effects, take allergy drugs at bedtime and asthma drugs in the late afternoon, a National Jewish Medical Center allergist\n                        advises. More...Watch: Relief From Allergies\n• Will Australia Ban Immigrants With AIDS?• Alarm Bells Ring Over China Food Imports\n                     \t\t\t\t\t| Watch• Light Plus Suction Promising For Acne\n                     \t\t\t\t\t| Watch• More StoriesSciTechNASA: Mars Probe Doomed By Human Error\nHuman error triggered a cascade of events that caused the battery to fail on the Mars Global Surveyor last year, according\n                        to a preliminary report. More...\n• Pakistan, China Forge Energy Alliance• Monkey Gene May Help In Drug Development• New Evidence Links Birds To Dinosaurs • More StoriesBusinessOffice Fires: Danger Ignored By Many\nYou'd have only minutes to get out, perhaps only two, says The Early Show consumer correspondent Susan Koeppen.\n                        Would you know how? Koeppen offers tips from experts. More...Watch: How To Escape An Office Fire\n• Menu Foods CFO Sold Shares Before Recall• Nestle To Buy Gerber For $5.5 Billion• Last-Minute Tax Filing Tips\n                     \t\t\t\t\t| Watch• More StoriesEntertainmentChris Rock Paternity Suit May Move To N.Y.\nA Georgia woman who filed a paternity suit against Chris Rock in her home state last month will refile it in New York, according\n                        to a published report. More...Watch: Chris Rock Laughs It Up\n• Australia Gives Kidman Its Highest Honor• Halle Berry \"Empowered\" In Latest Flick\n                     \t\t\t\t\t| Watch• This Week: Let's Hear It For The Girls\n                     \t\t\t\t\t| Watch• More StoriesOpinionThe Lazy Republican We Need\nIf a Republican has to win the White House in 2008, let it be Fred Thompson, says The New Republic. Having no real\n                        passion and maybe being a little lazy, he's unlikely to do much damage. More...Watch: GOP Nomination An Open Race\n• McCain's No Longer A Media Darling\n                     \t\t\t\t\t| Watch• Imus, The Duke Boys And Our Bloodlust• Oil Is Root Of All Ills \n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Susan Koeppen: Office Fires: Danger Ignored By Many\nYou'd have only minutes to get out, perhaps only two, says The Early Show consumer correspondent Susan Koeppen.\n                        Would you know how? Koeppen offers tips from experts. More...Watch: How To Escape An Office Fire\n• ShowBuzz: Movies: Halle Berry \"Empowered\" In Latest Flick\n                     \t\t\t\t\t| Watch• EARLY SHOW: Don't Trade One Bad Fat For Another\n                     \t\t\t\t\t| Watch• EARLY SHOW: Time To Plant Summer Bulbs\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nCreating A Summer GardenApril is usually a good time to plant warm-weather flower bulbs. Landscape designer Michael Weishan shows Harry Smith how\n                                    you can get started on your summer garden.\nTOP VIDEOS\n'Katrina Dolphins' Have Babies\nWater Fest Marks Thai New Year\nThe Healing Power Of Curry?\nGrasshoppers Invade City \nNotebook: Nature Meets Nurture\nTeam Accepts Imus' Apology\nFirst Look: The Substitute\nCorzine Critical After Crash\nIraqi Parliament Mourns Dead\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesThe exonerated Duke lacrosse students give their first interview to Lesley Stahl, just days after all remaining charges\n                           against them were dropped. Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryThe Puppet Master:A couple is gunned down, the triggerman is known. But who was pulling the strings behind the\n                           scenes? Troy Roberts reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}