{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Lifestyle Newsletter June 21, 2007", "body": "June 21, 2007 \nRSS | lifestyle\nThis Week's Highlights:\nHow the FBI WorksCNN's First Broadcast\nHow Amber Alert WorksHow Surfing Works\nHow Product Placement Works \nInside Yellowstone National Park - Going on an adventure this summer?  Before you take your own pictures of Yellowstone, here's a few we've collected for this new image gallery.   This week's trivia question:\nWhich sci-fi action movie depicted a future where all restaurants are Taco Bell? Click here   \n \nHow the FBI Works \n- The Federal Bureau of Investigation is the most powerful government agency in the United States. Some call it the largest law enforcement agency in the world. In its 100-year history, the agency has been at the heart of several infamous cases -- some successful, some controversial. In the age of terrorism, the FBI is as complicated and powerful as ever. In this article, learn about the history of the FBI, how the organization is structured, which weapons and tools FBI agents use and how to join the FBI.   \n  This week's video:CNN's First Broadcast\n - When CNN first launched 27 years ago this month, many people thought that the idea of a 24-hour news network was silly, but the network has since become one of the world's most prominent news organizations. In this video from HowStuffWorks, watch as Ted Turner launches CNN and see the first story ever aired on the network. \n     Also at HowStuffWorks:\n \nHow AMBER Alert Works\n - A child being kidnapped is a parent's worst nightmare. However, it is a reality that thousands of parents must face each year. In the United States, nearly 800,000 children are reported missing each year. In response to this tragic problem, many states have established a missing-child response network, commonly called AMBER. Find out how AMBER alerts help to spread information about missing children, and learn about some AMBER alert success stories. \n \nHow Surfing Works\n- Surfing is an extremely popular sport that has been around for\nhundreds of years. Learn about the basics of surfing, the dangers of\nsurfing and some tips to improve your surfing technique.  \nHow Product Placement Works - The 30-second ad spot is becoming less and less effective. Find out how integrating products into TV shows, movies, music videos and even Broadway shows is becoming a key tool for advertisers. \nSponsored By: \n   \nComing Soon:How Guide Dogs WorkHow the Mafia WorksThis Month in History - July   \n\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please unsubscribe here\n or change your preferences using our profile manager.To view this email as a web page, click here.\nHowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved"}