{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle and Bethea<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, one of the world's most incredible days will soon be here...it may change your life forever", "body": "\n\n\nMemo, next week a day unlike any other will shine for you...\n\n\n\n\n\n\n\n\n\n\n\n\n\nMEMO, DON'T MISS THIS CHANCE TO ENJOY\n  YOUR 365-DAY LONG LUCKY STREAK...\n\n\nDear Memo,\n    I recently sent you an email  in which I explained, with proof, the special place Friday the 13th holds in world history and what you, Memo, could hope for from this date of extraordinary luck!\n    However, I haven't heard back from you.  Even more seriously, I'm worried that you might miss this chance to gain the immense benefits that could be yours. The incredible forces that will be set in motion on Friday, July 13th, 2007, the second and last Friday the 13th of this year, has the power to launch you on an unbelievable lucky streak that will last for 365 days!\nBELIEVE ME, GREAT LUCK CAN COME IN SWIFT AND DRAMATIC FASHION DURING THIS MAGICAL TIME.\n    Why? Because, contrary to popular superstition, Friday the 13th can (especially for certain individuals) actually be a day of significant good fortune and opportunity.\n\n\n\n\nAnd I will show you exactly how you can beone of those certain very lucky individuals! \n    I have here in front of my eyes, letters from friends who got my help in discovering the secrets of how to turn bad luck into powerful good luck and positive breakthroughs. Here is an example: \n    \"I just have to share with you my piece of good luck.  A few days ago, after I received your predictions...I won $1000!  I had never won $1000 before.  It was such a blessing and an answer to my prayers.  Thanks again and God bless you for using your gift to help others...\" \n- A.M.A., VA\n    With the huge number of people who have written about how they have profited from the power of this day, I could go on forever.  But the purpose of this letter is not to make you regret what you might've missed in the past, but to offer you YOUR VERY OWN CHANCE to benefit from the forces set in motion by this \"day unlike any other day.\"\nTHIS IS NOT MERELY IDLE SUPERSTITION! \n    The power of Friday the 13th is serious business!  Whether you believe in superstitions or not, their power to affect innumerable aspects of every day life is undeniable. \n    For example, baseball, \"America's game\", is famous for its superstitions.  In 1996 John Wetteland, closing pitcher for the New York Yankees, refused to change his cap for the entire regular and post baseball season. He ended up leading the Yankees to their first World Series win since 1978, broke an eighteen-year streak of bad luck, and was ultimately voted Most Valuable Player of the championship series.\n    Streets named by numbers often skip the number 13, and in high rise buildings, the twelfth floor is almost always followed immediately by the 14th floor.  The 13th floor is simply \"skipped\" over or given a \"safer\" label.\nScience itself has proven the power of superstitions ingeneral and of Friday the 13th in particular...\n    Every Friday the 13th coincides with a measurable economic downturn.  On that day people tend to avoid travel, business transactions, and contact with the outside world.  As a result the restaurant, vacation, and entertainment industries lose billions of dollars.\n    But there's more to it than just people's fears. Scientific studies performed in Britain proved that although fewer people drive on Friday the 13th, the number of collision-related hospital admissions is significantly greater than on normal Fridays.\n    Are people just driving \"spooked\" on Friday the 13th...so that they're jittery and more prone to foolish mistakes?  Does the economy take a dip because nervous people simply stay home?  Do superstitious practices just enhance a baseball player's sense of security and confidence and help him succeed?\n    Possibly, but I think it's something more than that, don't you?\nI want to tell you a secret: Friday the 13this actually an incredible force for good luck and prosperity\n    The legend of the number 13 itself goes back to 600 B.C. and the philosophy of Pythagoras, who believed that 13 did not mean a cutoff, but rather a chance for evolution and change.  It did not point to warnings of endings but rather to new beginnings.  Thus, it was a number to be favored and a favorable date on which to enter this world.\n    Friday the 13th was also a holy day in the Church. A true miracle occurred at St. Paul's Cathedral, in London, on Friday the 13th in December, 1940.  The lives of hundreds of people were saved when the famous church remained untouched during one of the worst air raids in the history of World War II.\n    This magical day has even made baseball history! On Friday, July 13th, 1984, Pete Rose hit a double off Jerry Koosman in Olympic Stadium to become only the second player to reach the 4,000-hit level, after Ty Cobb.\n    Regardless of Friday the 13th's history, there is an inexplicable sense that luck can be dramatically altered on this date -- a feeling so strong that, as studies have shown, it affects the fortunes of millions of people throughout the world.\n    But, unlike you, Memo, these people do not know how to take the power of Friday the 13th and turn it into a force for incredible good luck and prosperity!  That is why I don't want you to miss...\nYOUR CHANCE FOR HAPPINESS!\n    And believe me, because the event in July will be the last Friday the 13th to happen this year, you must not UNDER ANY CIRCUMSTANCES miss this tremendously lucky opportunity while there's still time!\n    I'M GOING TO TELL YOU A SECRET, MEMO...\n    Do you know that most people wait for beneficial events to come to them?\n    This is a mistake!  Not only will they have to wait a very long time before any beneficial event occurs, but on top of that, there is no evidence to show that, if a person is not ready to receive them, these happy events will ever come to pass!\n    The only truly successful method I know of for taking advantage of beneficial events is to be one step ahead of them...to actually encourage wonderful things to happen to you.  This is the way - the only way - you stand any chance of winning something.\n    If, on the other hand, you choose (as I would) to be one step ahead of these beneficial events, I can help you.  I can reveal to you, among other things, how to obtain from this day of blessings, and the other 365 days following it, benefits you will treasure for the rest of your life.\n    You can be one of the few, lucky individuals who gains from this day.  You'll be free and empowered to buy lottery tickets, change jobs, purchase homes, travel to gambling casinos and engage in any and every other conceivable activity where fate might have an opportunity to give you a happy pat on the shoulder.\nNO ONE WILL BE AS PREPARED FOR GOOD FORTUNE AS YOU.\n    Why?  Because unlike most people who only hope for good luck, your luck is already waiting for you to draw it in. Fortunately too, I stand ready to assist you in ATTRACTING as much luck and good fortune as possible, helping you to capitalize on Friday, July 13th's own POSITIVE energy.\n    How?  By providing you with a very special Talisman that will help you to function as a virtual \"psychic magnet\" so that you can pull in all the money, romance, power and good fortune that my senses tell me will soon be within your reach.\nHERE IS WHAT YOU MUST DO TO DRAW MAXIMUM BENEFIT FROMTHIS DAY BLESSED BY THE GODS!\n    First of all, it is absolutely vital that you wear, for the 365 days after you receive it, a very specially energized talisman...\nTHE \"MEDALLION OF HOPE\"\n    Crafted in genuine 24K gold vermeil, for purity and protection, I had the \"Medallion of Hope\" made to reflect the design of an ancient talisman that has brought me incalculable success and happiness over the years. \n    I want you to have this medallion, so you too can uncover its secrets and invaluable benefits.\n    Prominently featuring three mystical symbols, the \"Medallion of Hope\" has the power to attract and magnify your good luck following this unique Friday the 13th (the last of two such occurrences this year).\n\n\n\n\n\nThe Dragon:Energetic, strong-willed and tough...and celebrated as a symbol of prosperity and good fortune in Chinese culture...the Dragon represents success in business and financial matters.\n\n\n\nThe Ankh:The ancient symbol of both physical love, the union of male and female, and spiritual love, the Ankh represents harmony and oneness between heaven and earth.\n\n\n\nThe Eagle:The soaring symbol of rebirth represents the triumph of spiritual power over sickness and the ability to see the world around you, zero in on an opportunity, swoop in and seize it.\n\n\n\n\n    Your 24K Gold Vermeil \"Medallion of Hope\" has been designed around one of the most powerful metaphysical symbols known, The Mandala.\n    This symbol represents the intersection of cosmic events and earthly experiences. The circle enclosing the square represents the heavens surrounding the earth. The cardinal points, representing entrances, one on each side of the square, represent transitional axes where the transfer of energy between heaven and earth takes place.\n\n\n    The Mandala is believed to concentrate the positive energy of the universe within its form.  You might even feel a mild tingling when you wear your Medallion.\n    As you can see, the symbols I've already told you about, by themselves, make this an incredibly powerful piece.  However, I have incorporated additional symbols in your \"Medallion of Hope\" to enhance and extend its considerable power.\nThe Torch:The emblem of Eros and Aphrodite, it symbolizes the flame of love.  \nThe Compass:Contained in a circle of perfection and quartered by the four points, it is a symbol of reason and knowledge. \nThe Key:A symbol of both opening and closing, it represents the ability to unlock hidden secrets.\nThe Laurel Garland:This symbol of purity represents victory and success. \nPlus, you'll get the purity and protection of gold andthe calming, healing power of silver\n    Your precious vermeil \"Medallion of Hope\" is forged from two of the most powerful precious metals on earth --Sterling Silver and a genuine 24K Gold. For millennia, Gold has been prized for its purity and wealth-attracting energies.  And lustrous Sterling Silver, with its superlative reflective properties, radiates with energy of healing, calm, and protection.\n    With your \"Medallion of Hope\" you can immediately prepare yourself for an incredible year of change that will be set in motion on Friday the 13th, July 2007!\nIf you prepare yourself for good fortune, Memo, positive vibrations of destiny will shower you with good luck and prosperity!\n    In this way, Friday the 13th will bring new beginnings and change to your life - but not just any beginnings or change.  It will help draw dynamic opportunities of the kind you have long dreamed of!\n    As you wear your medallion, don't just sit back and let things happen to you.  This is a time to take action!\n    Remember, extraordinary things happen when the number 13 combines with Friday to create a magical vibration.  That's because this is when the auspicious number 13 is combined with the powers of Venus, the planet of love and good fortune that rules Fridays.\nAn incredible value, exclusively for you \n    With the tremendous power of its unique, ancient symbolism -- forged in genuine 24K gold vermeil -- the \"Medallion of Hope\" is a truly rare and incredible value, unavailable in stores or on the web.  But I'm providing this precious opportunity to you now because your happiness is so important to me.\n    That is why it is a pleasure for me to offer you the \"Medallion of Hope\" at a very special price of $6.95 to cover shipping, handling and insurance, so you can have 30 days to use and enjoy your medallion.  If after those 30 days, you choose to keep your \"Medallion of Hope,\" you will be billed in four easy installments of only $19.95.  That's right, it's that simple, Memo!\nWHAT PROOF DO YOU HAVE THATEVERYTHING I HAVE TOLD YOU IS TRUE?\n    There is no other explanation, to my knowledge, for all the beneficial events that happen due to the power of Friday the 13th.\n    But if by chance no particularly beneficial event brightens your existence within the 365 days following Friday, July 13th, 2007 -- or if at any time, for any reason, you are not happy with your \"Medallion of Hope\" -- I promise here and now to reimburse you fully, including all shipping, handling and insurance costs, immediately,...with no explanation necessary. \n    That's right, Memo!  You can get your \"Medallion of Hope\" and keep it with you to seize all the Good Fortune that will surround you in the 365 days that follow Friday, July 13th -- and on every Friday the 13th in the years to come -- and you can send it back to me at any time and receive a complete refund.  That is how much I believe in the power of this rare talisman and why I am extending you my personal unconditional lifetime moneyback guarantee, with absolutely no hesitation.\n    So, what can you possibly lose by seeing for yourself, the incredible power of this lucky talisman?  Why not try to draw a shower of wealth, romance, and other wonderful benefits to yourself?\n    Thanks to the \"Medallion of Hope,\" you will be more receptive to the positive rays emitted on Friday July 13th, 2007, and your good fortune will carry over, powerfully, for a whole year.\n    Over those 365 days, at least three beneficial, if not miraculous, events will change your life.  These events may be such unexpected blessings as winning a million or more dollars in the lottery...the return of a lost love...an unexpected offer of work...the solution to a problem that seems impossible to you...any of these wonderful things that you've wanted for such a long time. \n    You are quite likely to see them happen within the next two months...BUT DON'T FORGET THE TWO THINGS YOU MUST DO BEFORE YOU ENJOY THE BLESSINGS OF THESE 365 DAYS:\n\n\n\n1.\nYou must wear your personal energized Medallion for the 365 days that begins Friday, July 13th, 2007.\n\n\n2.\nYou must follow my advise in the \"Secret Mystical Report on Friday the 13th,\" that I will provide, in a sealed envelope, as my FREE gift to you.  These instructions are so powerful they can completely turn your luck around for the best.  But I will provide them to you FREE, of course, as my gift to you.\n    Here is a quote from yet another of the people who have benefited from my advice. For instance:\n\n    \"It has helped me so much.  This is the first time I ever felt like a winner.  Thanks again for your help.  It changed my outlook for good.\" \n- F.L., Martinsburg, W. VA.\n    Don't let the luck generated by Friday the 13th pass you by.  It really would be a pity for you, your family and those close to you.  Even more so since, as I have already told you, I have assumed all the risk, so you have absolutely nothing to lose and everything to gain by accepting my proposition.\n    So don't waste a minute, Memo, to begin your Special \"365 days of Happiness,\" just click the button below today.\n    Hurry, time is running out rapidly! It really would be a pity to let such happiness pass you by just because of a question of time.  Act quickly, Memo - it's in your own best interest.\n    Your friend,\n    \n    P.S.  One last reminder, Memo.  Everything leads me to believe that this Friday the 13th will bring you to a real turning point in your life. That's why, when you request your \"Medallion of Hope,\" I will send your FREE gift, your \"Secret Mystical Report on Friday the 13th,\" to help you activate the energies of protection, prosperity and good luck your Medallion will bring you.\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for offers and discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply \nclick here or send a letter to me at 167 Cherry St. PMB 292, Milford CT 06460-3400.\n\n\n"}