{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Ondrej Certik\" <ondrej@certik.cz>", "subject": "slepc license", "body": "Hi,\n\nI would like to package SLEPc eigenvalue solvers[0] into non-free, the\nlicense is below. There is a line \"A modified version of the software\ncannot be redistributed\". The debian package can be built without\nmodificating the upstream sources though, so my question is, can it go\ninto non-free? And if not, the upstream authors asked me what words\nshould be added to the license in order for the Debian to be able to\ndistribute it in non-free?\n\nThanks very much,\nOndrej Certik\n\n[0] http://www.grycap.upv.es/slepc/\n\nThe SLEPc license:\n\nCopyright (c) 2002-2007, Universidad Politecnica de Valencia, Spain\n\nThis software is provided 'as is', with absolutely no warranty,\nexpressed or implied. Any use is at your own risk. In no event will\nthe authors be liable for any direct or indirect damages arising in\nany way out of the use of this software.\n\nThe user will acknowledge (using reference [1]) the contribution of\nthe software in any publication of material dependent on its use.\n\nThe user can modify the code but at no time will the right or title to\nall or any part of this software pass to the user. A modified version\nof the software cannot be redistributed. The software (or a modified\nversion) may not be sold.\n\nThis software is free for academic and research use. This means that a\nperson working in an academic or research institution such as a\nuniversity or a government laboratory can use the software without\nformally requiring a license.\n\nFor commercial use, it is necessary to sign a software license\nagreement. This includes all users working for a private company, even\nif the software is going to be used only for in-house research\nactivities. A reasonable testing period is allowed before asking for\nthe license.\n\n\n[1] V. Hernandez, J. E. Roman and V. Vidal (2005), SLEPc: A Scalable\nand Flexible Toolkit for the Solution of Eigenvalue Problems, ACM\nTrans. Math. Softw. 31(3), 351-362.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}