{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWEDNESDAY 9 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER CAROL RUBRA\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tTonight,\n\n\nIn an attempt to make the Home Office \"fit for purpose\", it has been split into two separate ministries; one will focus on counter-terrorism and the other will manage the prison and justice system. Yet the architect of this makeover, John Reid, has announced he's leaving before the job is done. Will the Home office ever be \"fit for purpose\"?  In a special programme, we examine the key issues facing an incoming Home Secretary and new Prime Minister.\n\n\nSECURITY\n\n\nWill the newly structured Home Office, with its greater focus on counter-terrorism, ensure that the mistakes made leading up to the 7th July bomb attacks never happen again? With four people arrested today in connection with the bomb attacks in London we have been in Beeston. The man who warned West Yorkshire police about Mohammed Sidique Khan, two years before the attacks, tells us that the police failed to respond to his warnings. Could they have intervened earlier and prevented the 7th July bombings? \n\n\nPRISONS AND THE JUDICIARY\n\n\nThe challenges facing the newly formed justice ministry are just as pressing. The prison population is rapidly approaching capacity and some senior judges have severe reservations about bringing the prisons and courts into the same department. Today, Lord Falconer has unveiled his blueprint for his ministry - but will it work? \n\n\nASYLUM\n\n\nCan the asylum system ever give protection to those who need it while preventing the thousands who seek to abuse it from doing so? Paul Mason has the story of a Zimbabwean Trade Union activist whose two adult children applied for asylum in the UK. One was granted asylum, the other was refused. What does this say about the state of the asylum system?\n\n\nBLAIR\n\n\nAnd it's possibly been one of the most stage-managed departures in political history. David Grossman takes a look at some of the preparations which are under way ahead of Tony Blair's much trailed announcement of when he is stepping down as Prime Minister.\n\n\nAll at 10.30pm.\n\n\nCarol \n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nSARKOZY'S CHALLENGE\n\n\t\t\t\t\t\t\tThe new French President is preparing keep the promises on which he stood for office\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}