{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Jordi Gutierrez Hermoso\" <jordigh@gmail.com>", "subject": "Re: Request for suggestions of DFSG-free documentation licences", "body": "On 26/05/07, Ben Finney  wrote:\n> Jordi, please follow the code of conduct for the mailing lists\n> .\n> Specifically, don't send a separate copy of list messages to me, as I\n> haven't asked for that.\n\nOops, sorry. I forget. Other non-Debian mailing lists have different\ncodes of conduct.\n\n> \"Jordi Gutierrez Hermoso\"  writes:\n[snip]\n> > GFDL\n[snip]\n> > what's the big deal?\n\nOn 26/05/07, Ben Finney  wrote:\n> The GPL also requires that any derivative work that one distributes\n> must be licensed under the GPL terms.\n>\n[snip]\n> The document author, by placing only *some* parts of the work under\n> the GPL, is essentially determining for the recipient what parts they\n> will find useful to combine with other parts of the software.\n[snip]\n> Further, when parts of a work licensed under GPL are combined into the\n> FDL-licensed work, the result is *not redistributable at all*,\n[snip]\n> Hopefully you now have a better understanding of some of the\n> problems.\n\nKinda, but not really. It seems that Debian's objections against the\nGFDL are highly academic and unlikely to arise in practice. I mean,\nhow many of those objections have actually worked against Wikipedia,\nthe largest collection of \"software\" (as Debian calls it) under the\nGFDL? In practice, the GFDLed docs can be copied and modified as much\nas they need to be; the further modifications Debian claims they need\nare not needed; invariant sections are *tiny* in comparison with the\nrest of the GNU manuals and relatively as visible as attribution and\ncopyright clauses that have to go into free software anyways.\n\nSmall excerpts (e.g. an Emacs reference card from the Emacs info docs)\nare probably covered under Fair Use. I doubt that the FSF would sue\nfor GFDL compliance because someone made a small Emacs reference card\nwithout the invariant section. Also, it just doesn't make sense to\nmodify some things, e.g. the news article previously distributed with\nDebian's Emacs by permission of the author, but that doesn't mean that\nit can't be useful and even freedom-abiding to distribute such\nunmodifiable content. And then we have stuff like the GSL docs with\neight pages of invariant sections, six of which are license texts\nwhich are already invariant anyways as previously discussed in this\nlist (and no, I'm not going to file a bug against gsl-doc-pdf because\ntwo pages out of a total of 490 endorse free documentation; you go\nahead and do it yourself if you wish).\n\nPerhaps the clause intended to work against DRM was vague, but again,\nis the FSF going to sue anyone because they encrypt their own hard\ndrive and just happen to have GFDLed docs in the hard drive?  At any\nrate, the GFDL's DRM clause has gotten clarified for GPLv3.\n\nHeck, even OpenBSD, who argue that the GPL isn't free enough to put it\ninto the OpenBSD kernel and who are strong freedom advocates in their\nown way like Debian and the FSF, even OpenBSD thinks that the GFDL is\ngood enough for distribution alongside with free software. Debian\nreally is the odd distro out here by considering GFDL docs non-free.\n\nJust as the FSF is accused of endorsing the GFDL so that it can put in\nthere its invariant sections, I have my own caricature of Debian in\nthis regard:\n\n\n\n                       THE DEBIAN / GFDL FIASCO\n         A most lamentable tragedie of Incompatible Philosophies\n                             in three ackts\n\n   \t     A producktion of the debian-legal players with special\n                      collaboration by Jordi G. H.\n\n\n                              ACKT 1:\n\n     FSF: Here you go! Have a GNU manual. You can give it to anyone\n     and you can modify it just like you can modify GNU\n     software. We also have it in a format that's comfortable for\n     modification, for your benefit.\n\n     Debian: Great! We'll put it in our repositories with the rest of\n     the other nifty GNU products. Isn't it fantastic you and I are\n     such good friends?\n\n\n                              ACKT 2:\n\n     FSF: Oh, by the way, free software needs free documentation, here\n     is how you can contribute to the GNU project and this is what the\n     GNU project is all about. Spread the word!\n\n     Debian: Whoa, wait a minute there, mate. How dare you attempt to\n     impose your fascist hippie tree-hugging communist philosophy on\n     us? Non-free, non-free, NON-FREE!\n\n\n                              ACKT 3:\n\n     FSF: Er... Maybe we can work something out?\n\n     Debian: What? Wait, I'm busy... There! Your filthy propaganda has\n     been moved to non-free. Ha! Now when users type \"man gcc\" they\n     get \"No manual entry for gcc. See 'man 7 undocumented' for help\n     when manual pages are not available.\" That's it, no further\n     clarification or explanation as to why what's seemingly an\n     essential manpage for an essential package and which should be\n     there according to our very own policy manual is missing. None of\n     that! Only confused users and essential software\n     undocumented. How do you like that, corrupter of youth?\n\n     FSF: Well, I must say --\n\n     Debian: SILENCE, ENEMY OF LIBERTY! You have until the next\n     version of your license to make everything under the sun\n     modifiable. Until then, we're not talking about this matter any\n     further.\n\n                              CURTAIN\n\nLike I said, I don't like Debian's position on the GFDL very much. :-)\n- Jordi G. H.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}