{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 102", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Berlin's Museum of Egyptology rebuffed a threat from Egypt's\n      top antiquities official to block all art loans to Germany\tunless\n      the \"world's most beautiful woman, \" Queen Nefertiti,\tgoes home\n      to Cairo. (Museum Security Network Mailing list)\n   2. Pronto volver?n a la Argentina dos toneladas de f?siles\n      (Museum Security Network Mailing list)\n   3. Italy will return to Libya an ancient Roman statue taken from\n      the former North African colony - a move Rome hopes will help\tits\n      own campaign to retrieve allegedly looted antiquities\tfrom\n      museums worldwide. (Museum Security Network Mailing list)\n   4. Pakistani museums plagued by theft. * 7 cases reporting 401\n      missing items registered since 1996 (38 of the Gandhara items\n      were found in New Jersey, US in 2004)\n      (Museum Security Network Mailing list)\n   5. Thousands of Nazi-Looted Works Are Held by Museums,\tSurvey\n      Says (Museum Security Network Mailing list)\n   6. Three men who worked together to steal Edvard Munch's\n      masterpieces \"The Scream\" and \"Madonna\" were sentenced to\tprison\n      on Monday for their roles in the brazen daylight\theist. Both\n      paintings were recovered, but were damaged.\n      (Museum Security Network Mailing list)\n   7. Nazi-looted art: German manual makes claims easier\n      (Museum Security Network Mailing list)\n   8. British museum hands over Aboriginal remains\n      (Museum Security Network Mailing list)\n   9. discovery of an object looted from the Iraq Museum Baghdad in\n      2003 and found in a house in Beirut. Interpol in Beirut\tseized\n      the object,\thaving learned about it from a TV program that was\n      showing the decor\tof a house & the head \"decorating\" it\n      (Museum Security Network Mailing list)\n  10. Met's art theft squad has to go cap in hand: Budget cut leads\n      to vain quest for private backers: Specialist unit accorded\tevery\n      low priority' (Museum Security Network Mailing list)\n  11. EN UNA GALERIA DE BARRIO NORTE;\tRecuperan cuatro obras de\n      arte robadas en Mendoza (Museum Security Network Mailing list)\n  12. Aydin Ibrahimov's punishment commuted\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Fri, 27 Apr 2007 06:34:58 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Berlin's Museum of Egyptology rebuffed a threat from\n\tEgypt's\ttop antiquities official to block all art loans to Germany\n\tunless the \"world's most beautiful woman, \" Queen Nefertiti,\tgoes home\n\tto Cairo.\nTo: \nMessage-ID: <001901c78885$6b3d0ee0$41b72ca0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\n17 April 2007\n\nBerlin (dpa) - Berlin's Museum of Egyptology rebuffed a threat from Egypt's\ntop antiquities official to block all art loans to Germany unless the\n\"world's most beautiful woman,\" Queen Nefertiti, goes home to Cairo. \n\nThough one eye is missing, the 3,000-year-old painted limestone bust of the\nqueen is celebrated as one of the finest female representations ever\ncreated. It was taken to Germany from Egypt under a 1913 contract. \n\nDietrich Wildung, the museum director, said on the radio channel Deutschland\nradio Kultur he was not too concerned at the threat, since Egypt had not\nlent any art to Germany since 1985 anyway. \n\n\"Even without loans we can manage comfortably and put on a good show,\" he\nsaid. \n\nZahi Hawwas, head of Egypt's antiquities authority, told the parliament in\nCairo on Sunday that if Germany refused to lend the bust to Cairo, he would\nhalt further cooperation with German museums and archaeologists. \n\nWildung said Nefertiti would not look so special in Cairo among all the\nother treasures on display. \n\nAnja Kuhr, a spokesman for Culture Cooperation, a German group campaigning\nfor the bust to be lent to Egypt, meanwhile attacked the claim by the museum\nthat the bust is too fragile to be transported. \n\nGermany's state minister for culture, Bernd Neumann, had said Friday a loan\nwould be \"irresponsible.\" \n\nKuhr called for Neumann to obtain an expert report on Nefertiti's\nrobustness. She said the museum would be in trouble if the bust had decayed.\n\n\nGerman art lover James Simon bought the bust from Ottoman authorities in\n1913 and it is a top tourist attraction in Berlin. \n\nNefertiti was the wife of the Egyptian Pharaoh Amenhotep IV and\nmother-in-law of the Pharaoh Tutankhamun. Her name roughly translates to\n\"the beautiful one is come.\" \n\nhttp://www.expatica.com/actual/article.asp?subchannel_id=52\n\n&story_id=38840\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Fri, 27 Apr 2007 17:15:14 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Pronto volver?n a la Argentina dos toneladas de f?siles\nTo: \nCc: list@leidennetwork.net\nMessage-ID: <003b01c788de$db2d8820$91889860$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nPronto volver?n a la Argentina dos toneladas de f?siles (in La Nacion, 26\nApril 2007)\nElisabetta Piqu? Corresponsal en Roma \n\n26 avril 2007\n\n\nROMA.- Dos toneladas de f?siles que se hab?an sacado ilegalmente de las\nprovincias de Santa Cruz, Neuqu?n y Chubut, e incautados en Arizona, Estados\nUnidos, donde se hace una feria anual de bienes paleontol?gicos, volver?n en\nbreve a la Argentina. \n\n\"Normalmente damos malas noticias, pero ahora estamos recuperando\", dijo a\nLA NACION Am?rico Castilla, director nacional de Patrimonio y Museos de la\nSecretar?a de Cultura, que anunci? la buena nueva en la ciudad eterna. \n\nCastilla viaj? hasta aqu? junto a la embajadora Mar?a Susana Pataro,\nfuncionaria de Parques Nacionales y asesora de la Direcci?n Nacional de\nAreas Protegidas, para participar en un seminario organizado por el Centro\nInternacional para la Conservaci?n y Restauraci?n de Bienes Culturales\n(Iccrom), organismo mundial de la cultura creado por la Unesco, y el\nInstituto Italo Latinoamericano (IILA). \n\nEn este encuentro de expertos latinoamericanos en el que por primera vez se\ndefini? un programa de largo plazo sobre la conservaci?n del patrimonio\ncultural en Am?rica latina, se habl? de varios temas, entre ellos el tr?fico\nil?cito de bienes culturales. \n\n\nAl respecto, Castilla ilustr? la campa?a de prevenci?n que se est? haciendo\nen la Argentina, que apunta a que la gente aprenda \"que no tiene que irse\ndel lugar que ha visitado con un pedazo de cer?mica prehisp?nica de\nrecuerdo. En Am?rica latina es recurrente el tr?fico il?cito de bienes\nculturales, sobre todo en pa?ses como Per? y Bolivia, que han sido\nexpoliados\". \n\nSe trata de pi?as f?siles, restos ?seos de dinosaurios y de aves, que al\nparecer intentaron venderse en una feria anual que suele hacerse en Arizona.\nGracias a que un cient?fico argentino que reside en los Estados Unidos\ndetect? estas valios?simas piezas, la Argentina -despu?s de Mongolia el pa?s\ncon la mayor riqueza paleontol?gica del mundo- present? un recurso, y ahora\nse espera que concluyan los tr?mites con Interpol para que los f?siles sean\ndevueltos. \n\nCastilla, que es adem?s director del Museo Nacional de Bellas Artes, tiene\nexperiencia en este tema. El a?o ?ltimo, de hecho, fue ?l quien viaj? a\nPar?s para buscar tres cuadros impresionistas (de Gauguin, Cezanne y Renoir)\nque hab?an sido robados de ese museo en 1980. \n\nAl margen del tema del tr?fico il?cito de bienes culturales, en el\nseminario-taller que tuvo lugar en el cuartel general del Iccrom, en el\nbarrio de Trastevere, se habl? tambi?n de la importancia de la educaci?n\npara que haya una mejor conservaci?n natural y cultural del patrimonio y de\n\"turismo responsable\". \n\n\"En un pa?s como la Argentina, donde ahora, debido a la paridad cambiaria,\nel turismo ha adquirido una importancia muy grande, incluso el cultural, se\nhace m?s que necesaria la conservaci?n del sitio -dijo Pataro-. Si bien los\nturistas traen recursos, que pueden ser una fuente importante de\nfinanciaci?n para la conservaci?n del patrimonio, tambi?n pisotean, tiran\nbasura y pueden robarse piezas de valor.\" \n\nEl deterioro que en su momento tuvo la famosa Cueva de las Manos, en Santa\nCruz, por ejemplo, \"no se debe a la lluvia ni a los animales, sino a la\ngente, que dibuj? graffitis en ese alero pictogr?fico\", denunciaron Pataro y\nCastilla, que coincidieron en que para prevenir este tipo de cosas es\nfundamental que haya una estrategia de manejo, planificaci?n y gesti?n\nintegrada del sitio. \n\n\"La educaci?n es fundamental, porque lo que no se conoce no se quiere y no\nse cuida\", sintetiz? Pataro, que adelant? que como en esa zona de la\nPatagonia hay muchos m?s aleros ahora se est? pensando en ampliar el sitio,\npara que tambi?n sea \"m?s comprensible para el visitante\". \n\nCon ese mismo motivo, el pr?ximo 19 de mayo, que es el D?a Internacional de\nlos Museos, se inaugurar? un nuevo Centro de Interpretaci?n de las Misiones\nJesu?ticas de San Ignacio, sitio que tambi?n fue declarado hace a?os\npatrimonio mundial de la humanidad por la Unesco. \n\n? NoticiasFinancieras - ? GDA - La Nacion - All rights reserved \n\n\n\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Fri, 27 Apr 2007 17:23:50 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Italy will return to Libya an ancient Roman statue\n\ttaken from\tthe former North African colony - a move Rome hopes will\n\thelp\tits own campaign to retrieve allegedly looted antiquities\tfrom\n\tmuseums worldwide.\nTo: \nMessage-ID: <004201c788e0$0ea402f0$2bec08d0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nVenus finally makes her way home \n\n    April 24 2007 at 02:25PM  \n \nRome - Italy will return to Libya an ancient Roman statue taken from the\nformer North African colony - a move Rome hopes will help its own campaign\nto retrieve allegedly looted antiquities from museums worldwide.\n\nThe statue of the goddess Venus was brought to Italy after it was found in\n1913 by Italian troops near the ruins of the Greek and Roman settlement of\nCyrene, on the Libyan coast, the Culture Ministry said on Tuesday.\n\nA date for the 2nd-century statue's return has yet to be set, ministry\nofficials said. The statue is now housed in Rome's National Roman Museum.\n\nThe headless marble figure of the goddess of love is a copy of a Greek\nstatue that has never been found, said Silvana Rizzo, an archaeologist at\nthe ministry.\n\n\"When we talk about Roman copies of Hellenistic statues we are talking about\nvery important works, because most of the time they are the only traces of\nthe original works that were later destroyed,\" she said.\n\nLibyan authorities requested the statue in 1989, but the process was slowed\ndown by a protracted judicial battle initiated by a group that considered\nthe work part of Italy's cultural heritage. \n\nLast week, an administrative court ruled in favour of returning the statue\nto Tripoli, the ministry said in a statement.\n\nThe ruling constitutes \"a useful precedent to promote the return, in favour\nof Italy, of antiquities that were looted by other states,\" the statement\nsaid.\n\nItaly is aggressively campaigning to recover antiquities it says were\nsmuggled out of the country and sold to museums worldwide. \n\nIt also has made some restitution to countries that had their own treasures\nlooted by Italians.\n\nIn 2005, Rome returned to Ethiopia the 1 700-year-old Axum obelisk taken in\n1937 on the orders of fascist dictator Benito Mussolini.\n\nNew York's Metropolitan Museum of Art and Boston's Museum of Fine Arts have\nagreed to return antiquities to Italy, but negotiations with the J. Paul\nGetty Museum in Los Angeles have been stalled for months.\n\nItaly has placed former Getty curator Marion True and art dealer Robert\nHecht on trial in Rome for allegedly knowingly receiving dozens of\narchaeological treasures that were stolen from private collections or dug up\nillicitly. The two Americans deny wrongdoing. - Sapa-AP \n\nhttp://www.iol.co.za/index.php?set_id=1&click_id=588&art_id=nw20070424130818\n872C895693\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Fri, 27 Apr 2007 17:33:50 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Pakistani museums plagued by theft. * 7 cases reporting\n\t401\tmissing items registered since 1996 (38 of the Gandhara items\twere\n\tfound in New Jersey, US in 2004)\nTo: \nMessage-ID: <004801c788e1$74879450$5d96bcf0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nPakistani museums plagued by theft\n\n* 7 cases reporting 401 missing items registered since 1996\n\nBy Hina Farooq\n\nLAHORE: Theft of artefacts from museums all over Pakistan has been a problem\nfor a very long time. Seven cases reporting 401 missing objects have been\nregistered since 1996. Of those, only 44 have been recovered so far. The\nremaining pieces are still being found. \n\nTibbi Police is still looking for ornaments of Ranjit Singh's horse, which\nare missing since 1996 from the Armoury Gallery at Lahore Fort Museum.\nFurthermore, 39 valuable tones were stolen in 1965 from the Archaeological\nMuseum in Taxila, along with 71 items from the Gandhara civilization in\n1971. Out of these, only 11 stones have been recovered. Forty gold and\nbronze coins, and 12 bronze statues were stolen from the National Museum of\nPakistan in Karachi in 1986, which have not been found. The Archaeological\nMuseum in Mohenjodaro reported 38 Indus seals and two tablets missing in\n2002. \n\nSince 2004, 2,080 smuggled artifacts have been seized, of which 38 of the\nGandhara items were found in New Jersey, US in 2004. About 1400 pieces,\nwhich consisted of Gandhara, Indus, pre-Indus and Islamic art, were seized\nat the Karachi port in 2005. Other recoveries include six artefacts from\nLahore in 2006, now in the possession of the Customs; 619 artefacts from\nKarachi airport also in 2006, currently held by the Culture Department, and\n17 items from France, which are still held by the Frech government.\n\nhttp://www.dailytimes.com.pk/default.asp?page=2007%5C04%5C27%5Cstory_27-4-20\n07_pg7_49\n\n\n\n------------------------------\n\nMessage: 5\nDate: Fri, 27 Apr 2007 17:33:50 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Thousands of Nazi-Looted Works Are Held by Museums,\n\tSurvey Says\nTo: \nMessage-ID: <004901c788e1$749fd740$5ddf85c0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nThousands of Nazi-Looted Works Are Held by Museums, Survey Says \n\nBy Catherine Hickley\n\nApril 27 (Bloomberg) -- Museums are hoarding thousands of artworks seized by\nthe Nazis and doing too little, especially in Germany, to trace the prewar\nJewish owners or their heirs, the authors of a new handbook on art\nrestitution say. \n\nDuring Hitler's 12-year rule, about 650,000 works were plundered in the\nbiggest art heist ever, the New York-based Jewish Claims Conference\nestimates. Restitutions such as the city of Berlin's return last year of\nErnst Ludwig Kirchner's 1913 ``Berlin Street Scene'' are only a start, said\nGunnar Schnabel, who compiled ``Nazi Looted Art'' (Proprietas Verlag) with\nhistorian Monika Tatzkow. The book will be published in English in June. \n\n``It's like hiding a nuclear bomb under the bedcovers,'' Schnabel said in an\ninterview in Berlin before an April 23-24 congress on looted art held in\nnearby Potsdam. ``There are so many cases that need to be cleared up,\nthousands of them in Germany alone.'' \n\nBefore World War II, Jewish art lovers were behind some of Europe's greatest\nprivate collections. The Nazis created a bureaucracy devoted to looting\nthem. Hitler appointed a commission to hunt down old masters for a planned\nmuseum in his home town of Linz, while Hermann Goering scoured Europe to\nexpand the private collection he kept at his country estate near Berlin. The\nGestapo ransacked museums and homes for ``degenerate'' modern artworks. \n\nIn the five years after the war, looted art was collected by the allies and\nreturned to their countries of origin. Yet until the collapse of communism\nin 1989, little was done to find the rightful owners, says Christian\nKennedy, the Special Envoy for Holocaust Issues at the U.S. State\nDepartment. \n\n``Sixty years later, we are still trying to put the pieces together,'' he\ntold delegates in Potsdam. \n\n`Fair Solution' \n\nFor Germany, where the legal deadline for restitution claims was 1992, the\nnon-binding Washington Principles agreed by 44 countries in 1998 are the\nframework for returning loot. The signatories agreed to identify stolen art,\nopen up archives, publicize suspicious cases, establish a central registry\nof looted art and ``achieve a just and fair solution'' for the Nazi-\npersecuted prewar owners or their heirs. \n\nWhile the Netherlands and Austria have almost completed their provenance\nresearch of public collections, Germany isn't living up to its commitments,\nsaid Georg Heuberger, head of the Jewish Claims Conference's Frankfurt\noffice. \n\n``The rupture in civilization that was the Holocaust can only be overcome\nthrough restitution,'' Heuberger said in an interview during the Potsdam\nconference. ``Instead of making special efforts, Germany is backpedaling.\nThat disturbs me.'' \n\nBig Business \n\nCulture Minister Bernd Neumann last year called a meeting of museum\ndirectors that pledged to coordinate provenance research nationwide and make\nrestitution more transparent. The government is discussing funding of as\nmuch as 5 million euros ($6.8 million) for museums to conduct research,\nNeumann's spokesman Hagen-Philipp Wolf said in a telephone interview. \n\nLawyers, art detectives, genealogists and auction houses are filling the gap\nleft by slow government action to help victims and heirs track down art.\nWith every side taking a cut and art prices at records, restitution has\nbecome big business. \n\nThe lack of a central help desk means victims and heirs ``are forced to go\nto a lawyer or private researcher,'' Heuberger said. ``They then have to\npromise them 30 percent or 50 percent of the auction price to even get\nstarted. It's not a good situation for the heirs.'' \n\nAnita Halpin, the London-based heir of ``Berlin Street Scene,'' sold the\npainting for a Kirchner record of $38.1 million at a Christie's\nInternational auction in New York -- after talks with the Berlin Senate\ncollapsed on a purchase that would have kept the work in Berlin's own\nBruecke Museum. \n\nCosmetics Mogul \n\nThe buyer was cosmetics mogul Ronald S. Lauder's Neue Galerie on New York's\nFifth Avenue. The gallery also purchased a Gustav Klimt portrait of Adele\nBloch-Bauer, restituted by the Austrian government, for $135 million last\nyear. \n\nThe Kirchner return unleashed what Neumann termed an ``emotional debate'' in\nGermany. Bernd Schultz, head of Berlin auction house Villa Grisebach, wrote\nin the Frankfurter Allgemeine Zeitung of ``unscrupulous, sharp restitution\nlawyers in the U.S.'' seeking ``to break open all the German museums as a\nboost for the international art market.'' \n\nSimilar criticism surfaced in the Netherlands, where a court in February\nordered the heir of gallery owner Jacques Goudstikker to pay her lawyer 7.9\nmillion euros ($10.7 million) for his help in recovering more than 200 works\nfrom the Dutch state. \n\nLaw Firms' Cut \n\nDavid Rowland of the New York law firm Rowland & Petroff, the lawyer who\nsecured the return of ``Berlin Street Scene,'' said that the real issue is\njustice for the heirs. He declined to disclose the percentage his firm\ncharges. \n\n``These claims that the law firms are taking all the profit, it's certainly\nnot true in our case,'' he said in an interview in Potsdam. Though his firm\nworks on a contingency basis -- charges a percentage only if the claim is\nsuccessful -- ``it certainly doesn't approach the level of 50 percent,'' he\nsaid. ``It varies according to the circumstances.'' \n\nA German panel set up to settle disputed cases has only ruled on two, and\nthe Kirchner painting is not one of them. The patrons' association of the\nBruecke Museum, where ``Berlin Street Scene'' was previously housed, says it\nshould have been, and blames the city government for the picture's loss. \n\nLudwig von Pufendorf, head of the association and a restitution lawyer, has\nfiled a complaint against former Culture Senator Thomas Flierl and his\ndeputy, Barbara Kisseler, for breach of trust. Berlin prosecutors said this\nweek that they'll investigate it, after rejecting a previous request. \n\nMuseums and Money \n\n``We have to find the money'' to do the provenance research, Martin Roth,\nthe director of Dresden's public museums, said in an interview in Potsdam.\nHe conceded that there may be ``hundreds'' of looted objects in Dresden's\ncollections. \n\nAnother obstacle, Schnabel and Heuberger say, is that museums neglect to\npublicize art that is suspected of being stolen for fear of losing important\nworks. \n\nThe public database http://www.lostart.de , where museums should list art of\ndubious provenance, mainly contains art lost through Soviet plundering after\nthe war. Only a handful of ``the suspicious cases'' are included, Schnabel\nsays. \n\nThat contrasts with the U.S., where a portal set up by the American\nAssociation of Museums has drawn 155 museums listing 25,424 artworks that\nmay have been looted by the Nazis. \n\nTo contact the writer on this story: Catherine Hickley in Berlin at\nchickley@bloomberg.net . \n\nLast Updated: April 27, 2007 01:58 EDT\n\nhttp://www.bloomberg.com/apps/news?pid=20601088&sid=aTk1ztqGBb_I&refer=muse\n\n\n\n------------------------------\n\nMessage: 6\nDate: Fri, 27 Apr 2007 17:33:50 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Three men who worked together to steal Edvard Munch's\n\tmasterpieces \"The Scream\" and \"Madonna\" were sentenced to\tprison on\n\tMonday for their roles in the brazen daylight\theist. Both paintings\n\twere recovered, but were damaged.\nTo: \nMessage-ID: <004a01c788e1$76c612a0$645237e0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nCorrection to This Article\nAn Associated Press article in some editions of the April 24 Style section\nincorrectly said that three men convicted of stealing Edvard Munch paintings\nincluding \"The Scream\" were ordered to pay $262 million in compensation to\nthe city of Oslo, which owns the works. The amount was $262,000. \nThieves Sentenced in Norway For Heist of Munch's 'Scream'\n\nAssociated Press\nTuesday, April 24, 2007; C05\n\n\n\nOSLO, April 23 -- Three men who worked together to steal Edvard Munch's\nmasterpieces \"The Scream\" and \"Madonna\" were sentenced to prison on Monday\nfor their roles in the brazen daylight heist. Both paintings were recovered,\nbut were damaged.\n\nOne of the gunmen, the getaway driver and the mastermind of the 2004 theft\nat Oslo's Munch Museum were convicted last month. The second suspected\ngunman died in November before charges could be filed.\n\nTwo years after the theft, police recovered the paintings, which were\nscraped and punctured, their paint dislodged. The museum is considering\nusing an eye surgeon to remove glass shards embedded in the canvas after the\nframes were broken.\n\nThere are four versions of \"The Scream,\" probably Munch's best-known work,\ndepicting a waiflike figure apparently screaming or hearing a scream. The\nimage has become an icon of modern human anxiety.\n\nPetter Tharaldsen, 35, was sentenced to 9 1/2 years in prison for driving\nthe getaway car. His term also included a sentence for an unrelated robbery.\n\nBjoern Hoen, 39, convicted of masterminding the theft, was sentenced to nine\nyears. Tharaldsen and Hoen were also convicted of being part of an organized\ncrime group.\n\nStian Skjold, 31, was sentenced to 5 1/2 years as one of the two gunmen who\nraided the museum. The three defendants were also ordered to pay a total of\n$262,000 in compensation to the city of Oslo, which owns the paintings.\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Fri, 27 Apr 2007 20:43:14 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Nazi-looted art: German manual makes claims easier\nTo: \nMessage-ID: <011e01c788fb$eb0c5010$c124f030$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nNazi-looted art: German manual makes claims easier \n\n \n\nOriginal article: www.ejpress.org/article/16326 \n\nBy Emsie Ferreira Updated: 27/Apr/2007 15:39 \n \n \n \nBERLIN (AFP)---In the wake of sensational sales of art that was seized by\nthe Nazis, German authors have published the first handbook to help Jewish\nfamilies win back masterpieces that are still in the wrong hands. \n\nThe 528-page tome \"Nazi Looted Art - Art Restitution Worldwide\" is sold as a\ndo-it-yourself law manual for heirs of Holocaust victims hoping to confront\nmuseums and collectors in different corners of the world in a bid to recover\nlost canvasses. \n\nCo-author Gunnar Schnabel makes an educated guess that \"there are still\nthousands of masterpieces and tens of thousands of lesser paintings that\nshould be returned to the rightful heirs. \n\n\"For example, some 30,000 art works were taken out of France, but 16,000\nnever resurfaced. It is the museums' policy to keep all of this top secret. \n\nThere are works in basements and vaults,\" Schnabel, a lawyer who handles\nrestitution claims, told AFP. \n\nEven before it hit the shelves in March, the book he wrote with historian\nMonika Tatzkow was adding to pressure on the German government to return a\npainting from the Biedermeier era featured on its cover. \n\nThe work, \"Fiat Justitia\" by Carl Spitzweg, formed part of the German\ngovernment's art collection for decades after World War II. \n\nBut it originally belonged to Jewish trader Leo Bendel who died in the\nBuchenwald concentration camp in 1940. \n\nIn February, as articles about the book appeared in most Austrian and German\nnewspapers, the German finance ministry announced that it would return the\npainting to the Bendel heirs. \n\nGerman museums \n\nSchnabel and Tatzkow say they hope to force museums to investigate the\nprovenance of their works and come clean on art they obtained thanks to the\nNazis' systematic seizure of Jewish collections which peaked in the early\n1940s. \n\nGerman museums panicked last year when Berlin's Bruecke Museum had to part\nwith Ernst Ludwig Kirchner's \"Berlin Street Scene,\" a prized Expressionist\npainting looted from a Jewish shoemaker. \n\nWhen the claimant let Christie's auction the work and it was bought by US\ncosmetics magnate Ronald Lauder for 38 million dollars (28 million euros),\ncurators began bracing for a flood of claims from heirs hoping for a\nwindfall from a buoyant art market. \n\nLauder is famous for collecting restituted art and an obvious target for\ncriticism that a moral issue is being commercialised. \n\nHis first piece was a Van Gogh drawing discovered by Tatzkow which he bought\nfor seven million euros, but in 2005 he paid a record 135 million dollars\nfor \"Adele Block Bauer I,\" an iconic portrait by Secessionist -- the\nAustrian name for Art Nouveau -- artist Gustav Klimt, after it was\nrestituted to the sitter's niece. \n\n\"It's only about money and speculation,\" Martin Roth, the director of\nDresden's State Art Collection, complained recently. \n\nMuseums like the Bruecke say they cannot afford to follow the example of\nVienna's Leopold Museum which invited scrutiny of the origins of its\nunrivalled Egon Schiele collection. \n\nIt has also spent millions contesting a claim for the Austrian artist's\n\"Portrait of Wally.\" \n\nConference \n\nBut ahead of an international conference on looted art taking place in\nPotsdam near Berlin next week, historian Julius Schoeps said: \"I think the\nmuseums also lack the will.\" \n\nHe advised museums to loan out works to raise funds to pay out claimants as\na way of keeping their collections intact. \n\nSchnabel thinks there \"is not enough money to buy back all the paintings the\nNazis stole,\" but said in his experience museums are not prepared to pay\neven modest reparations. \n\n\"Initially, with the Kirchner painting, the granddaughter was happy to\naccept a sum below the market price but the museum refused.\" \n\nTatzkow accuses museums of playing for time in the knowledge that the\ngeneration of Jews whose parents perished in the Holocaust will not be\naround forever. \n\n\"They are trying to sit the problem out, to wait for time to pass,\" she\nsaid. \n\n\"The story of a missing artwork will eventually get lost in a family. The\nchildren will know something but once they are dead, restitution becomes\nmore difficult.\" \n\nClaims \n\nTheir book discusses 109 claims, successful and otherwise, filed from France\nto the United States to Australia, to illustrate the legal precedent in\ndifferent countries. \n\nIt spares no reputations and hints that Jewish dealers joined in the\nlucrative business of trading looted art after the war. \n\n\"At that time it did not matter to them,\" Tatzkow said. \n\nShe insists that despite the fortune to be made on the re-sale of some\nrestituted works, the art's main value for heirs remains sentimental. \n\n\"A restituted painting gives a family back a part of the past. Sometimes a\nwork of art is all that survived the war and getting it back also helps to\ntell the story of what happened to the owner.\" \n\nShe disputes claims that the market value of looted paintings is enhanced by\ntheir tragic history. \n\n\"If a work was believed to have been lost for 50 years and it resurfaces, as\nhappened with a Schiele, this adds to its value. But it is simply the\nprolonged absence from the market that pushes up prices.\" \n\nSchnabel said heirs trying to find their way through the maze of restitution\nlaws have said they found the book, which will be published in English in\nJune, useful. \n\n\"A 78-year-old lady who is trying to reclaim an Impressionist masterpiece\nsaid it gave her the confidence to stand her ground in meetings with people\nwho say they have the work.\" \n\nBut it has not always been welcomed by fellow lawyers. \n\n\"A number of my colleagues are not happy. They asked me why I give away\nexpertise that they sell for a very high price,\" Schnabel smiled. \n\nhttp://www.ejpress.org/article/news/germany/16326#\n\n\n\n------------------------------\n\nMessage: 8\nDate: Fri, 27 Apr 2007 20:44:02 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] British museum hands over Aboriginal remains\nTo: \nMessage-ID: <011f01c788fc$081330c0$18399240$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nBritish museum hands over Aboriginal remains\nEmail Print Normal font Large font Julia May, London\nApril 28, 2007\n\nTHE Tasmanian Aboriginal community is claiming a partial victory in its\n20-year battle to bring home the remains of its ancestors, as Britain's\nNatural History Museum has agreed to hand over four of the 17 remains it\nholds.\n\nBut the Tasmanians have another fight ahead as they take on Britain's two\nmost famous universities and a second national museum for Aboriginal remains\nthey possess.\n\nTwo representatives from the Tasmanian Aboriginal Centre, Greg Brown and\nCaroline Spotswood, arrived in London yesterday to start mediation with the\nNatural History Museum. They are trying to stop it from scientifically\ntesting the remains of 17 Aborigines it holds. Those remains are due to be\nreturned to Tasmania for burial.\n\nOn the eve of their departure, the museum agreed to hand over four remains\non which it has completed testing. The handover ceremony was due to take\nplace yesterday London time, at the museum in South Kensington.\n\nIn a statement Ms Spotswood said: \"These remains, together with those of 13\nmore of our people, were removed without any Aboriginal consent from\nTasmania during the 1880s and we have been fighting since the 1980s for\ntheir return. Greg and I are both proud and honoured to be able to take them\nhome to lay their tormented spirits to rest.\"\n\nA spokeswoman said the museum was trying to stick to a previously agreed\ndeadline of March 31 for the return of all 17 remains. \"We wanted to keep\nour original promise,\" she said.\n\nThe Tasmanians will also attempt to reclaim remains held by Oxford and\nCambridge universities and National Museums Scotland.\n\n\"Here is an opportunity for them in goodwill to say, 'OK, because of what's\nhappening (with the Natural History Museum) . we would like to offer you the\nremains while you're here,' \" Mr Brown said.\n\nHe said the universities and the Scottish museum had not released any\ndetails of testing. \"We would be extremely disappointed if they are being\ntested on,\" he said.\n\nLast year two other representatives from the centre, Leah Brown and Adam\nThompson, met the three organisations to lobby for the remains.\n\nCambridge University holds four Aboriginal skulls and possibly two jawbones.\nA spokesman said that it was still developing its policy on human remains.\n\nOxford University confirmed that the centre had requested the return of four\nAboriginal hair samples that it has tested for DNA. In the 2006 discussions,\nthe university suggested that it may not even deem hair to constitute human\nremains.\n\nLast year National Museums Scotland showed Ms Brown and Mr Thompson an\nAboriginal skull. It told The Age that repatriation requests were considered\non a case-by-case basis.\n\nMediation between the Tasmanians and the Natural History Museum will start\nnext Wednesday to bypass a costly hearing in the British High Court. The\nTasmanians are trying to stop further scientific tests. These include\ndrilling into bones and teeth to extract DNA and making plaster casts of\nteeth and jaws.\n\n\"Testing is culturally offensive to us; we see that for us to lay our old\nfellas and their spirits to rest, we need to bring them back intact without\nthis experimentation,\" Mr Brown said.\n\nThe case is so sensitive that each side has appointed a co-mediator to\nensure independence: the former NSW chief justice Sir Laurence Street, for\nthe Tasmanians, and a respected British legal reformer, Lord Harry Woolf,\nfor the museum.\n\nSir Laurence said he was confident the two parties could reach a conclusion.\n\"We'll work it out,\" he said.\n\nI'm sure that Lord Woolf and I will have no trouble finding a rapport and\nfinding a way to move forward.\"\n\nhttp://www.theage.com.au/news/national/british-museum-hands-over-aboriginal-\nremains/2007/04/27/1177459980652.html#\n\n\n\n------------------------------\n\nMessage: 9\nDate: Fri, 27 Apr 2007 21:07:21 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] discovery of an object looted from the Iraq Museum\n\tBaghdad in\t2003 and found in a house in Beirut. Interpol in Beirut\n\tseized the object,\thaving learned about it from a TV program that was\n\tshowing the decor\tof a house & the head \"decorating\" it\nTo: \nMessage-ID: <012d01c788ff$49ca9640$dd5fc2c0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nAn illustrated article was published in As Safir newspaper in Lebanon\nyesterday (in Arabic). It's \nabout the discovery of an object looted from the Iraq Museum Baghdad in 2003\nand found in a house \nin Beirut. Interpol in Beirut seized the object, having learned about it\nfrom a TV \nprogram that was showing the decor of a house & the head \"decorating\" it: \n\nhttp://www.assafir.com/Article.aspx?EditionId=620&ChannelId=13504&ArticleId=\n2309 \nor \nhttp://tinyurl.com/2wl4ls \n\n\n\n\n------------------------------\n\nMessage: 10\nDate: Fri, 27 Apr 2007 21:09:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Met's art theft squad has to go cap in hand: Budget cut\n\tleads\tto vain quest for private backers: Specialist unit accorded\n\tevery low priority'\nTo: \nMessage-ID: <013101c788ff$8c72a4b0$a557ee10$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nMet's art theft squad has to go cap in hand: Budget cut leads to vain quest\nfor private backers: Specialist unit accorded every low priority' \n\nThe Guardian\n21 April 2007\n\nC Copyright 2007. The Guardian. All rights reserved. \n\nThe dramatic scaling down of Scotland Yard's once renowned arts and antique\nsquad has left organised criminals free to plunder the nation's heritage,\naccording to a leading fi ne art insurer. \n\nPolice have sought private money to finance the squad after its annual\nbudget of some pounds 300,000 was halved earlier this year. But the Guardian\nhas learned that Scotland Yard has failed to secure a penny from insurers or\nauction houses, after months of discussions. \n\nBritain's art market is second only to the US and experts claim up to pounds\n200m worth of stolen art and antiques are sold in the UK each year. INTERPOL\nestimates that art theft is the fourth largest organised crime after drugs,\npeople trafficking and arms. \n\nAnnabel Fell-Clark, chief executive of Axa Art UK, which pays out tens of\nmillions of pounds a year to reimburse vic- \n\ntims of art theft, condemned the slashing of the unit's budget. She warned\nthat scaling down the unit was already having an impact on pursuing art\nthieves who target Britain's stately homes and museums. \n\niWe have seen that they [the team] are increasingly overstretched and being\ntreated as a very low priority. At the moment we have very good information\nwhich we are wanting to pass on, which would bring arrests, if not\nconvictions. But we are not being treated particularly seriously, let's put\nit that way. \n\niWe want to see criminal gangs brought to justice, and in some instances\nlack of interest from the squad has stopped us being able to pursue further\nrecovery. We want and need to work with the police. \n\nShe said Axa was aware the government was seeking funding for the squad but\nthe company had decided it would not con- sider paying directly for the\nunit, adding that attempts by the Home Office and the Metropolitan Police to\nfind private sponsors in the art world were shortsighted. \n\nIt would be a conflict of interest for us to get involved, she said. We have\nslightly different agendas. As insurers, we are interested in recovering the\npieces however we can, and are not that bothered about finding and\nprosecuting the perpe- trators. We are concerned that this aspect of law\nenforcement is not taken particularly seriously right now. \n\niVery often when you are investigating art theft connections are uncovered\nwith organised crime in relation to drugs and \n\narms dealing, so it doesn't make sense to ignore this aspect of criminal\nactivity. \n\nThe London based arts squad was formed in 1969 to pursue and prosecute\ncriminals who operate in the second biggest art market in the world. In the\npast the unit, which is called in to investigate 120 cases a year, was\ninvolved in recovery of art works across the world. \n\nAccording to art crime sources, officers from the squad worked with Spanish\ninvestigators to help crack one of Europe's most spectacular art robberies -\nthe theft of 19 paintings valued at pounds 30m from the Madrid penthouse of\nEsther Koplowitz, Marquesa of Casa Penalver and Cardenas. \n\nOther successes include the uncovering of a multimillion pound British\nsmuggling operation in which precious antiquities and archaeological\nartefacts were stolen from Egypt, some of which were sold at \n\nSotheby's. \n\nLast year the unit arrested a gang allegedly responsible for stealing tens\nof millions of pounds of art and antiques from \n\nstately homes over four years, including pounds 30m worth of antiques from\nRamsbury Manor in Wiltshire. \n\nMark Dodgson, of the British Antique Dealers Association, said: iThe idea of\nValue of stolen art and antiques sold in \n\nthe UK annually, according to expertspounds 200m people in the art world\nfunding the squad seems wrong. My members pay taxes already, and surely\npaying for the police is what their taxes are for. \n\nScotland Yard confirmed that as yet no private investors had been identified\nto provide the 50% funding required for the unit by the next financial year.\n\n\n\n------------------------------\n\nMessage: 11\nDate: Fri, 27 Apr 2007 21:09:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] EN UNA GALERIA DE BARRIO NORTE;\tRecuperan cuatro obras\n\tde arte robadas en Mendoza\nTo: \nMessage-ID: <013201c788ff$8def0b80$a9cd2280$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nEN UNA GALERIA DE BARRIO NORTE; Recuperan cuatro obras de arte robadas en\nMendoza \n\nClar?n\n23 April 2007\n\n?Clar?n Contenidos \n\nEran buscadas por INTERPOL. En conjunto est?n valuadas en 250.000 pesos. \n\nLas pinturas, valuadas en unos 250.000 pesos, hab?an sido robadas de un\nmuseo de Mendoza. La Polic?a empez? a investigar y finalmente las hall? por\nla denuncia del due?o de una galer?a: estaban en Barrio Norte, en plena\nCapital Federal. Seg?n fuentes del caso, hasta anoche por el caso no hab?a\ndetenidos. \n\nLa obras recuperadas son una acuarela sobre papel denominada \"Botes\", de\nJorge Larco, otra sobre papel llamada \"Ma?ana en Venecia\", de Aquiles Badi,\ny dos ?leos sobre tela: \"3Pensativa\", de Horacio Bultler, y \"Pasan... 1939\",\nde Raquel Forner (ver qui?nes son...). \n\n\"Estas cuatro obras desaparecieron entre febrero y marzo de este a?o del\nmuseo de Bellas Artes de San Rafael, Mendoza. Son las ?ltimas obras robadas\nde una cadena de desapariciones, que en su inventario suman m?s de 30\ncuadros en 15 a?os\", explic? a Clar?n en aquella provincia el artista\npl?stico Luis Freire. \n\nA partir de la denuncia de la desaparici?n de las obras, el juez Gabriel\nOscar Ravagnani Navarrete, titular del Juzgado de Instrucci?n 3 de San\nRafael orden? a la Divisi?n INTERPOL de la Polic?a Federal que investigue. \n\nSeg?n Freire, la obra m?s costosa de las halladas es \"Pasan... 1939\", de\nForner. \n\n\"INTERPOL empez? a buscar las obras pero sin ?xito. Finalmente la misma\ngaler?a de arte donde fueron halladas las pinturas robadas fue la advirti?\nque el cuadro 'Pasan' aparec?a en un cat?logo como parte de la colecci?n del\nmuseo de San Rafael. Entonces sus due?os decidieron realizar la denuncia\npolicial\", cont? una fuente del caso. \n\nFue as? que el s?bado a la tarde agentes de INTERPOL fueron a la galer?a de\nBarrio Norte y secuestraron las obras. \n\n\n\n\n\n------------------------------\n\nMessage: 12\nDate: Fri, 27 Apr 2007 21:14:15 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Aydin Ibrahimov's punishment commuted\nTo: \nMessage-ID: <013801c78900$409a7c60$c1cf7520$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nDay.Az\nAydin Ibrahimov's punishment commuted \n\nDay.Az\n21 April 2007\n\n(c) 2007. Day.Az, DLS. All rights reserved. \n\nPreliminary court proceeding on case of Aydin Ibrahimov, who is accused of\nstealing art works from State Art Museum, was held at Azerbaijani Court of\nGrave Crimes. \n\nOgtay Gerekmezli, lawyer for Ibrahimov petitioned for commuting his arrest\nto house arrest taking into consideration his disease and contributions for\nthe country. The court granted the petition. Ibrahimov was released.The next\nlegal proceeding was fixed to April 25. \n\nIbrahimov faced charges on robbery and smuggling. \n\n274 art works were stolen from State Art Museum in 1993. As a result of\njoint operations with national central bureaus of INTERPOL in Washington,\nWiesbaden and other, the stolen art works were found in the US. \n\nAll persons involved in the crime were held accountable and INTERPOL issued\ninternational notice on Aydin Ibrahimov. \n\nHe left the US for Azerbaijan in September this year and gave in. APA \n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 102\n****************************************\n\n"}