{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Common Dreams <commondreams@mail.democracyinaction.org>", "subject": "Obnoxious? Maybe. Necessary? Yes!", "body": "\n\n\n\n\n\n \n\n\n\nJune 28, 2007\nDear Friend of Common Dreams,\nYou're probably familiar with the NPR method of fundraising. You know, those dreaded weeks when your favorite NPR reporters put down their notebooks, pick up their microphones, and turn into shameless beggars?\n Just when you've had it with the annoying interruptions and phones ringing in the background, the station meets its goal, returns to its regular programming . . . and you remember why you keep listening. \nCommonDreams.org takes a similar approach to fundraising. We don't interrupt our regular programming - it's there for you to read 24 hours a day, 7 days a week. So in that respect, our fundraising drives are a lot easier to take.\nBut a few times a year, we place a thermometer on the homepage and we email repeated requests for support. \nObnoxious? Maybe. But we think it's better to be obnoxious for a few weeks at a time, and then stop - than it is to keep up a steady stream of requests, all year long. \nRight now, we're  a little more than halfway through our summer  pledge drive, and slightly more than halfway to our goal. Thank you to everyone who has pitched in so far. Every single donation has helped push us higher. \nIf you haven't yet donated, can you help now? So we can meet our budget and turn this drive off?\nI hear from many of  you that you like CommonDreams.org because of its uncluttered, easy-to-read format. We're committed to keeping it that way.\n No advertising. Just the News & Views. \nBut that means we rely 100% on you, our readers,  for our funding.\nWhether you choose to donate during each drive, or once a year, or by signing up for a monthly donation -- if you haven't already, can you help now? \nYou can make your secure, tax-deductible online donation right now here. Or, you can print our donation form and mail it back to us with a check here.\nWe say it all the time, but it's true: We can't do it without you.\nThanks, and have a great summer!\n\nCraig Brown \nfor the CommonDreams.org team \nP.S.\nOur readers are our only source of funding. We'll send everyone who pitches in a free \"Out of Iraq NOW!\" bumpersticker.\nAll contributions to Common Dreams are now tax-deductible to the fullest extent allowed by law.\n\n\n \n You may\n  make a secure on-line donation right now or print & mail a contribution form:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\nWe respect our supporters privacy. Information provided    by you will never be sold, rented, exchanged or \notherwise disclosed to any other organization.       Read our privacy policy here. Our Postal Address:Common DreamsPO Box 443Portland, ME USA 04112 \n\n"}