{"category": "spam", "to_address": "Myrtless <myrtless@flax24.uwaterloo.ca>", "from_address": "Richard Bradshaw <overstreetc@gonulluyum.org>", "subject": "Supersex", "body": "\n\nOnline pharmacy presents top products that will make you healthy! You do not need to go to your local drug store, you can buy here any pill that you need.\nGo to the shop\nWith Viagra from RX Online Drug Store you will have perfect sex.\nGo to the shop\nMust have products.\nWith best regards,\nRichard Bradshaw\n \n \nParen otvetil ne srazu. Znaiu ia tvoi priznaki. Ostalnaia vataga beshenym galopom rassypalas po lesu, ohvatyvaia uchastok Tornoj dorogi shirokim kolcom. Eto kto, lysuny? prosheptal Kvin v spinu sotnicy. \nVsego lish zamshelaia legenda, Voland. Kakoj lysun ego za piatku ukusil, kogda emu vzbrelo v golovu Podatsia v etot poganyj Kordos i odnu golovnuiu bol smenit na druguiu, nichem ne Luchshuiu? Pochemu on srazu ne zastavil sebia zabyt ob etom chuzhake? Teper emu Usilenno prihodilos dumat o tom, kak otsiuda smytsia bez vreda dlia sobstvennogo Zdorovia Poka nastroenie diadiushki ne izmenilos i tot ne predostavil emu inoe Mesto dlia prozhivaniia syroe i mrachnoe, pod zamkom, gde na stenah v rzhavyh cepiah Grozdiami visiat skelety byvshih uznikov. Szadi netoroplivo zabuhali kopyta, gluho tarania doski prichala. Ne vopros! vypalil Kvin, otprianuv ot kosiaka i vypriamivshis. Ego gibel sluchajnost, ot kotoroj ne zastrahovan nikto, ia Uveren, chto smogu vziat halda bez osobyh problem. Iz grudi vyrvalsia ston dosady Klinok dazhe ne shelohnulsia, slovno slivshis s zemlej v odno celoe. Dengi shli na pokupku razlichnoj tehniki, nulevyh Bankosov i prochih, neobhodimyh i ne ochen, veshc!\nhej u zaezzhih torgovcev s Drugih planet. Dvoe strazhnikov vdrug vspomnili o predstoiashchih razvodah v karaul i prochih Neotlozhnyh delah, chetvero dorodnyh torgovcev vdrug spohvatilis, chto ne Podschitana eshche dnevnaia vyruchka, dozhidaiushchaiasia v kassovyh iashchikah. \nSlovno prikosnovenie Klinka Nkota srabotalo kak parol, dopustiv Soznanie k zakrytym sheptunom-dorriksom uchastkam pamiati. Ty dejstvitelno vodil korabli? Ia izumlenno ustavilsia na Bigmana. Eto sovsem ne to, Niks. Zheltoglazyj odnim dvizheniem palca snimet, on na eto gorazd. ejisuminyon XF5FVVtTW1Z0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}