{"category": "ham", "to_address": "\"General Copyright Discussions \\(questions, organizing,\n\tetc\\)\" <discuss@list.digital-copyright.ca>", "from_address": "Russell McOrmond <russell@flora.ca>", "subject": "Re: [d@DCC] Following up the item on \"IP rights\" from Russell's Blog", "body": "Charles MacDonald wrote:\n> I do think that the trademark issue needs to be trated carfully.\n\n   I would even separate counterfeiting from other trademark issues. \nTrying to pretend to be someone else, or pretend to be approved/etc by \nan organization, is different than simple confusion in the marketplace \naround brands.\n\n\n   One issue that is important is the unauthorized use of standards \nlogos when the product/service has not been approved.   An example would \nbe putting the CSA approved logo on a product that had not been CSA \napproved.\n\n   This is one of the problems with the IPR language in that it mixes \nentirely unrelated things together as if they are related.   While I \nbelieve that stronger enforcement of things like labeling is necessary \n(And lets include controversial products and techniques such as GMO's \n-- something parliament has consistently voted against), but that the \nexpansion of exclusive rights in the form of copyrights and patents are \nentirely different.\n\n\n> Perhaps - since the report seems to come close to attempting to lump\n> this market in with the real scum folks who would pass off JUNK as a\n> brand name product.  there may be an argument to point out that the\n> advice the committe has received was lead by the self interest of the\n> \"witnewsses\" rather than the interest of thehLegitamate consumer.\n\n   In my letter to Industry committee members I am trying to make clear \n(and in as small a letter I can) that the issue is the 1996 WIPO \ntreaties which have nothing to do with \"counterfeiting\" or \"piracy\" in a \nmore reasonable definition of those terms.\n\n> My own personal opinion thought about and written at home on my own time\n> and all that\n\n   Since you can have your own opinions for this forum, why not in \nletters to your MP?   This really is an issue where the primary problem \nis that they are only hearing from one side of the debate.  While there \nis some blame on parliamentarians and the government, we also have some \nblame for not spending adequate time making ourselves known to MPs.\n\n   All I hope is that people try to speak to their own MP, and if they \nhave availability MPs in ridings near them.\n\n\n   Anyone live in or near any of the members of Industry committee?  The \nridings are listed at the bottom of the message: \nhttp://www.digital-copyright.ca/node/4025\n\n-- \n  Russell McOrmond, Internet Consultant: \n  Please help us tell the Canadian Parliament to protect our property\n  rights as owners of Information Technology. Sign the petition!\n  http://www.digital-copyright.ca/petition/ict/\n\n  \"The government, lobbied by legacy copyright holders and hardware\n   manufacturers, can pry my camcorder, computer, home theatre, or\n   portable media player from my cold dead hands!\"\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}