{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "rob@robmyers.org", "subject": "Re: [cc-community] Does BY-SA extend to a newspaper?", "body": "Quoting \"Benj. Mako Hill\" :\n\n> CC seems to have a taken a position that the license basically stops at\n> the edge of a photograph. Basically, this means that if you don't modify\n> the content of a photograph, you can basically do what you want with it\n> under an an SA license (of course, Evan's comments, and a few things he\n> didn't say, still need to be kept in mind).\n\nCC have limited SA's copyleft to derivative works. This is a  \nreasonable position but doesn't always meets people's expectations or  \nmodel the existing \"social contract\" for use of different kinds of work.\n\n> This is one reason a number of photographs who upload to Wikimedia\n> Commons prefer the GFDL\n\nThe GFDL seems to define both texts and images as \"documents\" and  \nreplace the concept of derivation with the concepts of modification  \nand combination. The reason that photographs would work as expected  \nunder the GFDL would be because it defines a modified version as:\n\n\"... any work containing the Document or a portion of it, either  \ncopied verbatim, or with modifications and/or translated into another  \nlanguage.\"\n\nBut this crucially assumes that an article illustrated by a photo  \nconstitutes a \"work\". From the discussion of using photography for  \nillustration I'm not sure that it does. If it doesn't, it might be the  \ncase that you can just use the photograph under the GFDL's unmodified  \ncopying permission, which is how you can use a photo as an  \nillustration under BY_SA.\n\nIANAL, TINLA.\n\n> and its related to the reason why Larry Lessig\n> has analogizing NC clauses and copyleft for software -- although I\n> personally disagree with Lessig's argument in this respect.\n\nYes. I'm very glad that Lessig is talking about this and urging a  \nbroader discussion though.\n\n- Rob.\n\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}