{"category": "ham", "to_address": "IP-Health <ip-health@lists.essential.org>", "from_address": "Benjamin Krohmal <ben.krohmal@keionline.org>", "subject": "[Ip-health] Australian Democrats party supports medical innovation prizes", "body": "The Australia Democrats Party has adopted a pharmaceutical prize\nmechanism as part of their party platform/action plan.  Kudos to\nCAPPE for their efforts to make this happen.\n\n\n\nFull text of the relevant sections:\n\nAccess to medicines in developing countries\nOne-third of the world\\u2019s population lacks access to essential\nmedicines; in the poorest\nparts of Africa and Asia this figure rises to one-half.  This is\nbecause many drugs are\ntoo expensive or are no longer produced.\nLittle research is being carried out into the illnesses which are\nwidespread in developing\ncountries because drug companies gear their research towards wealthy\nmarkets.\nFollowing recent global agreements and bilateral agreements with the\nUS, product\npatents now give pharmaceutical companies near-global monopolies,\nallowing them to\ncharge prices that often reach 15 times the cost of production.\nDeveloping countries do\nnot have the means to develop new drugs independently, so are reliant\non drugs\nprovided at affordable prices.\n\nPharmaceuticals\nUntil 2004, Indian law allowed only patents on processes, not on\nproducts. As a result,\nIndia\\u2019s thriving generic pharmaceuticals industry cheaply supplied\nmedicines for poor\npatients throughout the world\\u2019s poor regions. In 2004, however,\npressure from the rich\nnations forced India to pass legislation that blocked the manufacture\nand export of\ngenerics. Pharmaceutical company Novartis is taking the Indian\ngovernment to court in\norder to force changes in the new laws that would make them even more\nprotective of\nthe profits of the global pharmaceutical companies.  Millions of poor\npatients are dying\nbecause pharmaceutical companies insist on vetoing the manufacture of\ngeneric drugs\non the grounds that they, with their superior resources, managed to\ndevelop them first.\nThese problems should be addressed by international agreement on a\npublic-good\npatent scheme funded by rich and poor countries in proportion to\ntheir means.  This\nwould give pharmaceutical innovators the option of taking out a\npublic-good patent\nwhich would give them no veto powers over others\\u2019 use of the\ninvention, but would\ninstead reward them, out of public funds contributed by cooperating\ngovernments, in\nproportion to the health impact of their invention.\n\nThe number of women in their child bearing years is expected to be\n1.6 billion by 2015,\nwith most of these in developing countries where access to\ncontraceptives is limited.\nBut funding for reproductive health programs which includes\ncontraceptive supplies is\ngoing backwards.\n\nDemocrats Action Agenda\n\\u2663 Impose price-volume caps on all new drugs where any higher volumes\nthan that\nagreed are paid for at a lower price;\n\\u2663 Establish a new, independent regulator for pharmaceutical\nmarketing with\nresponsibility for an improved and legislated code of conduct;\n\\u2663 Strengthen sanctions for breaches of the pharmaceutical marketing\ncode of\nconduct;\n\\u2663 Increase funding for the National Prescriber Service for more\nindependent drug\ndetailers to replace drug reps to visit GPs to inform them about new\ndrugs on the\nmarket;\n\\u2663 Replace the practice of pharmaceutical sampling with trial\nprescriptions at reduced\nprices;\n\\u2663 Ban pharmaceutical promotion in doctors\\u2019 prescribing software;\n\\u2663 Regulate to ensure appropriate separation between funding to\npatient support\ngroups and pharmaceutical companies;\n\\u2663 Tender PBS-listed pharmaceutical distribution rights;\n\\u2663 Tender government purchase of generics and remove subsidies for\nbrand name\nproduct once out of patent;\n\\u2663 Conduct periodic reviews of the listing and price of drugs and\ntighten regulations on\nusing expensive drugs for conditions where they are not warranted;\n\\u2663 Remove tax deductibility for PBS listed pharmaceutical promotion\nexpenses;\n\\u2663 Extend the PBS into public hospitals;\n\\u2663 Fund research on complementary medicines;\n\\u2663 Extend the PBS safety net to same sex couples and families;\n\\u2663 Provide free of charge, nicotine replacement products and quit\ntherapies;\n\\u2663 GST-free status for complementary health medicines, such as\nglucosamine\nsulphate, that are demonstrably effective;\n\\u2663 Software to advise GPs on the evidence for complementary medicines;\n\\u2663 Oppose the deregulation of pharmacies;\n\\u2663 Support international trade rules such as differential pricing\nmechanisms and\npublic-good patents that protect peoples' access to essential goods\nsuch as life-\nsaving medicines and so that resource-poor countries can access cheaper\nmedicines in a transparent and predictable manner;\n\\u2663 Advocate for the development of a global framework on essential\nhealth research\nand development which overhauls the way medical research and\ndevelopment is\nprioritised and financed so that drugs are rewarded in proportion to\ntheir impact on\nthe global burden of disease.\n\n\n\nBenjamin Krohmal\nCoordinator - Project on Medical Innovation\nKnowledge Ecology International\nTel: +1-202-332-2670 ex. 17\nFax: +1-202-332-2673\nben.krohmal@keionline.org\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}