{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nWednesday, 25 April, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nLive - Chelsea v Liverpool\nChelsea host Liverpool in the first leg of their Champions League semi-final.\n\n\n\n \nWorld Cup winner Ball dies at 61\nEngland World Cup winner Alan Ball has died of a heart attack at the age of 61.\n\n\n\n \nRoma & Man Utd fined over trouble\nRoma and Man Utd are fined after crowd trouble at the Champions League quarter-final first leg tie at the Stadio Olimpico.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nWoods expects tough US Open test\nTiger Woods says the Oakmont course at this year's US Open will be a harder test than the recent Masters at Augusta.\n\n\n\n \nMickelson signs up coach Harmon\nPhil Mickelson turns to swing coach Butch Harmon in a bid to improve the accuracy of his long game.\n\n\n\n \nMuirfield seniors bow for Faldo\nNick Faldo will return to the scene of his 1987 and 1992 Open wins for his Seniors Tour debut in July.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nRaikkonen urged to get technical\nKimi Raikkonen's former team boss hints the Finn could be even better if he paid more attention to his role outside the car.\n\n\n\n \nPedrosa should be ready for China\nHonda's Dani Pedrosa should be able to ride in the Chinese MotoGP despite crashing out in Turkey last weekend.\n\n\n\n \nTurkey to keep F1 race until 2021\nFormula One supremo Bernie Ecclestone guarantees the future of the Turkish Grand Prix for at least the next 15 years.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nRaikkonen urged to get technical\nKimi Raikkonen's former team boss hints the Finn could be even better if he paid more attention to his role outside the car.\n\n\n\n \nTurkey to keep F1 race until 2021\nFormula One supremo Bernie Ecclestone guarantees the future of the Turkish Grand Prix for at least the next 15 years.\n\n\n\n \nBMW may offer Heidfeld new deal\nNick Heidfeld's impressive start to the season could go a long way to landing a new deal with BMW Sauber.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nRadcliffe not in GB marathon team\nGB's marathon team for the World Athletics Championships is named but does not include Paula Radcliffe at this stage.\n\n\n\n \nYamauchi voices Osaka heat fears\nMara Yamauchi warns conditions in Osaka at the World Athletics Championships will be even tougher than during the London Marathon.\n\n\n\n \nRunner dies after London Marathon\nA 22-year-old runner who was taken ill after completing the London Marathon dies in hospital.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nCooke misses out on Belgian win\nNicole Cooke loses out to main rival Marianne Vos in the Belgian stage of the World Cup, the Fleche Wallonne.\n\n\n\n \nTour of Britain route is revealed\nOrganisers unveil the route for this year's Tour of Britain, which will begin in London on Sunday, 9 September.\n\n\n\n \nHoy to help with Velopark design\nOlympic champion Chris Hoy will sit on the panel choosing the design for the Velopark cycling venue at the London 2012 Games.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nQuotes of the Week\nRafa Benitez on his Scouse daughter, plus Mick McCarthy and St Albans chant\n\n\n\n \nChris Evans talks to Steve Thompson\nEngland Rugby World Cup  winner Steve Thompson talks to Chris Evans about his binges on beer and takeaways since retirement. Chris and sidekick Jonny Saunders have a different sporting guest every evening on their Radio 2 show.\n\n\n\n \nWednesday's gossip column\nClaudio Ranieri is linked to Fulham, plus other rumours\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}