{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "James ARKINSTALL <James.ARKINSTALL@paris.msf.org>", "subject": "[Ip-health] Stiglitz on China: country must avoid \"unbalanced IP\"", "body": "\n\n\n\nToday's Zaman\nhttp://www.todayszaman.com/tz-web/detaylar.do?load=detay&link=108251\n\nChina\\u2019s New Economic Model\n\nChina's success since it began its transition to a market economy has been\nbased on adaptable strategies and policies: as each set of problems are\nsolved, new problems arise, for which new policies and strategies must be\ndevised.\n\nThis process includes social innovation. China recognized that it could not\nsimply transfer economic institutions that had worked in other countries;\nat the least, what succeeded elsewhere had to be adapted to the unique\nproblems confronting China. Today, China is discussing a \"new economic\nmodel.\" Of course, the old economic model has been a resounding success,\nproducing almost 10 percent annual growth for 30 years and lifting hundreds\nof millions of Chinese out of poverty. The changes are apparent not only in\nthe statistics, but even more so in the faces of the people that one sees\naround the country.\n\nI recently visited a remote Dong village in the mountains of Quizho, one of\nChina's poorest provinces, miles away from the nearest paved road; yet it\nhad electricity, and with electricity had come not just television, but the\ninternet. While some rising incomes came from remittances from family\nmembers who had migrated to coastal cities, the farmers, too, were better\noff, with new crops and better seeds: the government was selling, on\ncredit, high-grade seeds with a guaranteed rate of germination.\n\nChina knows that it must change if it is to have sustainable growth. At\nevery level, there is a consciousness of environmental limits and the\nrealization that the resource-intensive consumption patterns now accepted\nin the United States would be a disaster for China - and for the world. As\nan increasing share of China's population moves to cities, those cities\nwill have to be made livable, which will require careful planning,\nincluding public transportation systems and parks.\n\nEqually interesting, China is attempting to move away from the export-led\ngrowth strategy that it and other East Asian countries have pursued. That\nstrategy supported technology transfer, helping to close the knowledge gap\nand rapidly improving the quality of manufactured goods. Export-led growth\nmeant that China could produce without worrying about developing the\ndomestic market.\n\nBut a global backlash has already developed. Even countries seemingly\ncommitted to competitive markets don't like being beaten at their own game,\nand often trump up charges of \"unfair competition.\" More importantly, even\nif markets are not fully saturated in many areas, it will be hard to\nmaintain double-digit growth rates for exports.\n\nSo something has to change. China has been engaged in what might be called\n\"vendor finance,\" providing the money that helps finance the huge US fiscal\nand trade deficits, allowing Americans to buy more goods than they sell.\nBut this is a peculiar arrangement: a relatively poor country is helping to\nfinance America's War on Iraq, as well as a massive tax cut for the richest\npeople in the world's richest country, while huge needs at home imply ample\nroom for expansion of both consumption and investment.\n\nIn fact, to meet the challenge of restructuring China's economy away from\nexports and resource-intensive goods, China must stimulate consumption.\nWhile the rest of the world struggles to raise savings, China, with a\nsavings rate in excess of 40%, struggles to get its people to consume more.\n\nProviding better social services (public health care, education, and\nnation-wide retirement programs) would reduce the need for \"precautionary\"\nsavings. More access to finance for small and medium sized businesses would\nhelp, too. And \"green taxes\" - such as on carbon emissions - would shift\nconsumption patterns while discouraging energy-intensive exports. As China\nmoves away from export-led growth, it will have to look for new sources of\ndynamism in its growing entrepreneurial ranks, which requires a commitment\nto creating an independent innovation system. China has long invested\nheavily in higher education and technology; now it is striving to create\nworld-class institutions.\n\nBut if China wants a dynamic innovation system, it should resist pressure\nby Western governments to adopt the kind of unbalanced intellectual\nproperty laws that are being demanded.  Instead, it should pursue a\n\"balanced\" intellectual property regime: because knowledge itself is the\nmost important input in the production of knowledge, a badly designed\nintellectual property regime can stifle innovation - as has been the case\nin America in some areas.\n\nWestern technological innovation has focused too little on reducing the\nadverse environmental impact of growth, and too much on saving labor -\nsomething that China has in abundance. So it makes sense for China to focus\nits scientific prowess on new technologies that use fewer resources. But it\nis important to have an innovation system (including an intellectual\nproperty regime) that ensures that advances in knowledge are widely used.\nThat may require innovative approaches, quite different from intellectual\nproperty regimes based on privatization and monopolization of knowledge,\nwith the high prices and restricted benefits that follow.\n\nToo many people think of economics as a zero-sum game, and that China's\nsuccess is coming at the expense of the rest of the world. Yes, China's\nrapid growth poses challenges to the West. Competition will force some to\nwork harder, to become more efficient, or to accept lower profits.\n\nBut economics is really a positive-sum game. An increasingly prosperous\nChina has not only expanded imports from other countries, but is also\nproviding goods that have kept prices lower in the West, despite sharply\nhigher oil prices in recent years. This downward pressure on prices has\nallowed Western central banks to follow expansionary monetary policies,\nunderpinning higher employment and growth.\n\nWe should all hope that China's new economic model succeeds. If it does,\nall of us will have much to gain.\n\n--------------------------------------------------------------------------------\n* Joseph Stiglitz is a Nobel laureate in economics. His latest book is\nMaking Globalization Work. © Project Syndicate, 2007\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}