{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Felecia Guerrero\" <lazcloudcreekbow@cloudcreek.org>", "subject": "Join the thousands of people who got slim", "body": "\nStop the painful craving for more food\n\n\n\n\n\n\nAnatrim – The newest and most delighting product for corpulent people is made available now – As were told on ABC.\n\n\nDo you remember all the situations when you told yourself you would do anything for being delivered from this desperately growing number of kilos? Happily, now no big offering is expected. Thanks to Anatrim, the earth-shaking weight-reducing blend, you can get healthier lifestyle and a really slender figure. Just look at what people say!\n\n\n\n\"It’s unbearably difficult to acknowledge it but I was an awful food addict. \n\n\nI greedily devoured all this trash \n\n\nand could not stop. \n\n\n\n\nThis misery left off when I started taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my appetite disappeared, \n\n\nspirits improved and I’m the happiest person in the world 24 pounds in 2.3 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person!\"\n\n\n\n\n\nRita R., Boston\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nYou can't imagine how I detested being mocked at school. \n\n\n\n\nI hated the weight and I detested myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nThis stuff literally dragged me out of this dreadful nightmare! The warmest thanks to you, fellows.\"\n\n\n\n\n\nMikkey Fox, San Diego\n\n\n\n\n\n\"You know what? Thanks to Anatrim my marriage was saved! I went into this circle, depression – eating more – just more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nMy friend pointed at your web site and I ordered up my pack of Anatrim right away. \n\n\nThe results were great, my appetite became normal, I was in a good mood oftener, and, be sure, I became able to tighten my belt on some holes. And you see, the bed became cool also!\"\n\n\n\n\n\nKarl\n\n\n\n\n There is a great number of gratitudes delighted people leave after trying Anatrim. Don’t you wanna add yourself to the thousands and thousands of slim clients and try this natural appetite decreasing power increasing product now!\n\n\nDon’t lose the opportunity!\n\n\n\n\n"}