{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 131", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Switzerland. Fire in synagogue damages library\n      (Museum Security Network Mailing list)\n   2. Culture minister George Voulgarakis Sunday said that he was\n      seeking the return of three ancient stolen artifacts to Greece,\n      which are on display at an Atlanta museum in the United States.\n      (Museum Security Network Mailing list)\n   3. Police sketches of suspects who stole a pricey etching from a\n      Michigan Avenue gallery aren't exactly Rembrandts,\tbut\n      authorities are hoping they may help lead them to one.\n      (Museum Security Network Mailing list)\n   4. Jane Avoids Rain, Other Burpee Museum Exhibits Ruined\n      (Museum Security Network Mailing list)\n   5. USA. A small fire at Old Sturbridge Village's Freeman\n      Farmhouse has temporarily closed the building,\tbuilt between 1810\n      and 1815,\taccording to officials at the living history museum.\n      (Museum Security Network Mailing list)\n   6. Recuperato un Tiepolo rubato a Roma\n      (Museum Security Network Mailing list)\n   7. Recupero opere Accademia Scalabrino\n      (Museum Security Network Mailing list)\n   8. CARABINIERI RECUPERANO 166 DIPINTI COLLEZIONE SCALABRINO\n      (Museum Security Network Mailing list)\n   9. Harold Mann's boxing medals stolen\n      (Museum Security Network Mailing list)\n  10. 'Clueless' thieves sell ?1million Tiepolo painting for ?350\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Tue, 5 Jun 2007 06:03:18 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Switzerland. Fire in synagogue damages library\nTo: \nMessage-ID: <00f701c7a726$7318f600$594ae200$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nBundespr?sidentin Calmy-Rey verurteilt Synagoge-Brandstiftung\n\nGenf, 3.6.07 (Kipa) Bundespr?sident Micheline Calmy-Rey hat die\nBrandstiftung in der Genfer Synagoge Malagnou \"auf das Sch?rfste\"\nverurteilt. Sie habe mit Best?rzung und Besorgnis auf die Verletzung dieser\nKultst?tte reagiert, erkl?rte sie am Samstag, 2. Juni, in einer\nStellungnahme.\n\nAbkl?rungen der Genfer Polizei hatten ergeben, dass der Brand in der\nSynagoge mutwillig gelegt worden war. Wie Untersuchungsrichter Michel Graber\nam Freitag, 1. Juni, mitteilte, k?nne eine technische Ursache wie auch ein\nZufall ausgeschlossen werden. Man habe in der N?he des Brandherds einen\nZigarettenstummel gefunden. Es gelte nun die DNA-Analyse abzuwarten.\nVerd?chtige gibt es Graber zufolge vorerst nicht.\n\nAlfred Donath, der Pr?sident des Schweizerischen Israelitischen\nGemeindebundes, sagte, der Brand habe ihn aufgew?hlt und schockiert.\nSchmerzhafte Erinnerungen sei in ihm wachgerufen worden. Ein antisemitischer\nHintergrund lasse sich nicht leugnen, meinte Donath gegen?ber dem\nWestschweizer Radio.\n\nEin Feuer hatte am fr?hen Morgen des 24. Mai die Synagoge Malagnou in der\nStadt Genf weitgehend zerst?rt. Am st?rksten besch?digt wurden die\nBibliothek und der Gebetsraum.\n(kipa/ag/fram)\n\nhttp://www.kipa-apic.ch/\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Tue, 5 Jun 2007 06:03:18 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Culture minister George Voulgarakis Sunday said that he\n\twas\tseeking the return of three ancient stolen artifacts to Greece,\n\twhich are on display at an Atlanta museum in the United States.\nTo: \nMessage-ID: <00f801c7a726$755cf290$6016d7b0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nGreece to reclaim stolen artifacts from US museum\nJune 4, 2007\n\n\nATHENS --  Culture minister George Voulgarakis Sunday said that he was\nseeking the return of three ancient stolen artifacts to Greece, which are on\ndisplay at an Atlanta museum in the United States. \n\nThe Eleftherotypia newspaper reported Sunday that a marble statue dating\nback to Hellenic times, a ceramic jar from the 6th century, and a\nsarcophagus from the Minoan era had been stolen and sold to the Michael C.\nCarlos Museum in Atlanta. \n\n\"These prominent antiques left the country illegally and there is enough\nproof to justify their restitution,\" he said, adding that Greek police and\ngovernment authorities had already started the process to get them back. \n\nAccording to the paper, the items were sold to the Carlos Museum in 2002 and\n2003. \n\nVoulgarakis reiterated that Athens was seeking the return of all stolen\nhistorical works of art. It has managed to repatriate four key antique\nobjects from Los Angeles' famed Getty Museum and has asked the Louvre in\nParis to stop displaying a statue loaned from the Cleveland Museum, which it\nsuspects was stolen. \n\nThe statue dates back to the 4th century BC.\n\nhttp://www.metimes.com/\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Tue, 5 Jun 2007 06:03:18 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Police sketches of suspects who stole a pricey etching\n\tfrom a\tMichigan Avenue gallery aren't exactly Rembrandts,\tbut\n\tauthorities are hoping they may help lead them to one.\nTo: \nMessage-ID: <00fa01c7a726$77252f70$656f8e50$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\n\nhttp://www.chicagotribune.com/news/local/chi-070604hilligoss,1,7685000.story\n?coll=chi-news-hed&ctrack=1&cset=true \n\nPolice release sketches of suspects in artwork theft\n  \n \nBy Angela Rozas\nTribune staff reporter\n\nJune 4, 2007, 6:46 PM CDT\n\nPolice sketches of suspects who stole a pricey etching from a Michigan\nAvenue gallery aren't exactly Rembrandts, but authorities are hoping they\nmay help lead them to one.\n\nAuthorities have released computer-generated drawings of a man and woman\nsuspected of stealing a nearly 370-year-old Rembrandt etching from a\nMagnificent Mile art gallery May 20. Police valued the artwork at $55,000.\n\nThe lifelike sketches were made with the assistance of Hilligoss Galleries\nemployees who saw the man and woman enter the gallery and noticed the\netching was missing moments after they left. The etching, titled \"Adam and\nEve,\" was hanging in a preview room on the gallery's first floor, just steps\naway from a receptionist's desk.\n\nPolice say they have no new leads in the case but are hoping someone might\nrecognize the faces in the sketches.\n\n\"It would be so great to know art helped us catch these bad guys who stole\nart,\" said Tom Hilligoss, owner of the gallery at 520 N. Michigan Ave.\n\nThe man was described as about 55 to 60 years old, 5 feet 9 inches tall, 195\npounds, with gray hair and dark-rimmed glasses. He wore a dark navy golf\njacket and gray dress pants and carried a gray baseball cap. The woman was\nsaid to be 40 to 45 years old, 5 feet 4 inches tall, 125 pounds, with short\nblond hair. She wore a tan trench coat.\n\nThe couple had apparently been in the gallery several times before, police\nsaid. On the day of the heist, both gallery employees were busy with other\ncustomers when the couple walked in. Hilligoss said Monday he suspects those\nother customers might have been in on the scam.\n\nThere was only one security camera in the gallery, trained on an elevator on\nthe street-level entrance to the store. Hilligoss said he is working on\nimproving security at the gallery.\n\nThe etching, which measures 6 by 9 inches but was in a 16-inch-by-14-inch\nframe, was made in 1638. It was the oldest piece in the gallery and was on\nconsignment from an estate. It was insured but not for its asking price,\nHilligoss said.\n\narozas@tribune.com\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Tue, 5 Jun 2007 06:03:18 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Jane Avoids Rain, Other Burpee Museum Exhibits Ruined\nTo: \nMessage-ID: <00fb01c7a726$773f4720$65bdd560$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nJane Avoids Rain, Other Burpee Museum Exhibits Ruined   \n \n \nBy Smita Kalokhe\n\nBurpee Museum closes it doors temporarily to clean up after storms flood\nexhibits. Burpee staff say it could have been worse.\n\nIn all, it'll cost between $20,000 and $30,00 to clean up and replace some\nof the exhibits. But museum administrators consider themselves lucky since\ntheir prized possession is okay. President Lew Crampton says, \"It was not a\nbunch of happy campers wandering around here on Saturday.\"\n\nHeavy rains left 750 gallons of standing water on Burpee Museum's roof. And\nit all came pouring in when two drain systems failed. The water rushed\nthrough two holes about six inches in diameter and directly into the Native\nAmerican exhibit. Crampton says, \"The rugs were very squishy.\"\n\nDisplays in glass cases are okay, but some hands-on works will need to be\nreplaced. The main concern: Jane. Rockford's favorite dinosaur sits directly\nbelow the Native American collection. \"She died in a flood 66 million years\nago, but she survived this one!\"\n\nCleaners drilled holes in walls to make sure mold doesn't build up. There\nisn't any structural damage but carpets will need to dry and be cleaned. The\nmuseum could open as early as Friday, but it's already feeling a hit in\nrevenue. Crampton says, \"This is a pretty good season for us. The school\ngroups are still coming in, but our tourist are starting. We turned away\nseveral groups, several families just this morning.\"\n\nThis isn't the first time the museum experienced water damage. Crampton says\nthe sprinkler system broke back in 1999. It left 10 feet of standing water\nand caused half a million dollars in damages.\n\nUpdated: June 4, 2007, 7:22 pm\n\nhttp://www.wrex.com/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Tue, 5 Jun 2007 06:39:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] USA. A small fire at Old Sturbridge Village's Freeman\n\tFarmhouse has temporarily closed the building,\tbuilt between 1810 and\n\t1815,\taccording to officials at the living history museum.\nTo: \nMessage-ID: <015e01c7a72b$86775bb0$93661310$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nFire damages Old Sturbridge Village farmhouse\nPosted by The Republican Newsroom June 04, 2007 20:34PM\nBy LORI STABILE \nlstabile@repub.com \n\nSTURBRIDGE - A small fire at Old Sturbridge Village's Freeman Farmhouse has\ntemporarily closed the building, built between 1810 and 1815, according to\nofficials at the living history museum. \n\nSturbridge Fire Capt. John C. Marinelli today said the fire, reported just\nafter midnight on Sunday, was not suspicious, but caused approximately\n$50,000 in damage. Marinelli said fire officials believe a hot ember from\nthe fireplace, used the day before for a cooking demonstration, spread the\nfire in the kitchen. \n\nThe fire broke through the roof, and Old Sturbridge Village security\nofficers, who were alerted by the fire alarm, responded within four minutes,\nfollowed by Sturbridge firefighters. The security officers used a fire\nextinguisher to contain the fire, according to a press release from Old\nSturbridge Village. \n\n\"Our security officers are to be commended. They likely saved the building\nfrom sustaining much more significant damage,\" Old Sturbridge Village chief\nexecutive officer James Donahue said in a statement. \n\n\"This is a real-life reminder to us that fire was a constant concern to\nfamilies in the 1830s. The kitchen fireplace was the hub of the home and\nfamilies depended on it for their main source for heat, light and cooking.\nAs we make repairs, we will examine and upgrade fire safety measures,\"\nDonahue added. \n\nOld Sturbridge Village officials stated that it appeared the fire started\ninside the paneling and framing surrounding the fireplace and chimney. \n\nMarinelli said 10 Sturbridge firefighters were on scene, and the Southbridge\nFire Department also assisted. \n\nOld Sturbridge Village marketing coordinator Pamela S. Lozier said the first\ntwo rooms in the building were not affected by the fire, and will be opened\nto visitors as soon as possible. \n\n\"None of our artifacts were actually damaged,\" Lozier said. \n\nRepairing the kitchen area may take several weeks, she said. Meanwhile,\ncooking demonstrations will be moved to either the Fitch House on the common\nor the Townhouse. Freeman Farm, located in the \"countryside\" area,\npreviously featured the only cooking demonstrations at the village, which\nrecreates New England life in the 1830s. \n\nThe Freeman Farmhouse is a 1?-story gambrel-roofed house that was built on a\nsite two miles from its current location at Old Sturbridge Village. In 1828,\nit was home to Delia and Pliny Freeman and their children, and the kitchen\nwas added shortly after they moved in. \n\nhttp://blog.masslive.com/\n\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Tue, 5 Jun 2007 06:43:07 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Recuperato un Tiepolo rubato a Roma\nTo: \nMessage-ID: <015f01c7a72c$03343060$099c9120$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nRecuperato un Tiepolo rubato a Roma\n\nPORDENONE (4 giugno) - Un quadro di Gian Domenico Tiepolo, del valore di un\nmilione di euro, ? stato recuperato dai carabinieri del Comando Provinciale\ndi Pordenone a Portogruaro (Venezia). Il dipinto, rubato qualche mese fa a\nRoma nella casa di un collezionista, era stato poi venduto per poche\nmigliaia di euro in un mercatino del Nordest. Si tratta di una tela datata\nintorno al 1765 e intitolata \"Scena carnevalesca\", che misura 89 centimetri\nper 110.\n\nInsieme al \"Tiepolo\" i carabinieri hanno ritrovato altre 93 opere d'arte.\nQuattordici (sempre dipinti di olio su tela) sono risultate rubate a\nfamiglie nobili e a liberi professionisti, compresa una preziosissima icona\ngreco-ortodossa che, secondo gli esperti, proverrebbe da Costantinopoli, e\nil cui valore ? inestimabile. Delle altre opere, soprattutto quadri e tele,\nnon si conosce l'esatta provenienza e, pertanto, state sottoposte a\nsequestro preventivo in attesa di accertarne l'origine e i veri proprietari.\nL'operazione ? stata messa a segno nel corso di quasi cinquanta\nperquisizioni condotte in Friuli Venezia Giulia, Veneto, Lazio, Emilia\nRomagna e Lombardia. \n\nSecondo i Carabinieri di Pordenone, le opere d'arte venivano rubate in case\ne ville, soprattutto a Roma e nel resto del Lazio, e venivano poi immesse\nsul mercato da un'organizzazione fortemente strutturata, circa dieci\npersone, che effettuavano operazioni finanziarie con l'obiettivo di\nnascondere i traffici. \nPer rivendere le opere rubate l'organizzazione utilizzava il canale dei\nmercatini di Roma e dintorni, ma anche rigattieri e rivenditori di mobili e\noggetti usati nel Nordest. \nLe indagini, scattate lo scorso ottobre, sono state condotte dai Carabinieri\ndei reparti speciali del Comando Provinciale di Pordenone e coordinate dalle\nProcure della Repubblica di Treviso e Pordenone. \n\nhttp://www.ilmessaggero.it/\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Tue, 5 Jun 2007 06:43:07 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Recupero opere Accademia Scalabrino\nTo: \nMessage-ID: <016301c7a72c$0595c710$10c15530$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nRecupero opere Accademia Scalabrino\nANSA -    \n \n(ANSA) - MONTECATINI TERME (PISTOIA), 4 GIU - Sono state recuperate 159\nopere d'arte per un valore di circa due milioni di euro trafugate da\nMontecatini Terme.Le hanno recuperate i carabinieri per la tutela patrimonio\nculturale di Firenze e sono parte delle 190 trafugate all'accademia d'arte\n'Dino Scalabrino' di Montecatini Terme (Pistoia).\nL'ex responsabile dell'organizzazione delle mostre dell'accademia e' stato\ndenunciato per appropriazione indebita, truffa e commercio illecito di opere\ncontraffatte.\n\nhttp://it.news.yahoo.com/\n\n\n\n\n------------------------------\n\nMessage: 8\nDate: Tue, 5 Jun 2007 06:43:07 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] CARABINIERI RECUPERANO 166 DIPINTI COLLEZIONE\n\tSCALABRINO\nTo: \nMessage-ID: <016401c7a72c$068ef420$13acdc60$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nCARABINIERI RECUPERANO 166 DIPINTI COLLEZIONE SCALABRINO        \nluned?, 04 giugno 2007 17:02  \n  Firenze, 4 giu. - (Adnkronos) - C'e' anche la 'Donna sotto la doccia' di\nRenato Guttuso tra i 166 dipinti recuperati dai carabinieri del Nucleo\nTutela Patrimonio Culturale di Firenze, in un'operazione condotta assieme ai\ncolleghi di Pistoia e Montecatini Terme. Le 166 opere d'arte contemporanea\nfanno parte delle 190 mancanti appartenenti alla collezione dell'Accademia\nd'Arte 'Dino Scalabrino' di Montecatini Terme (Pt) e alcune appartenenti a\nprivati, avute in prestito dall'Ente e mai restituite ai legittimi\nproprietari, per un valore complessivo stimato in due milioni di euro. Una\npersona e' stata denunciata in stato di liberta' all'Autorita' Giudiziaria\ndi Pistoia per appropriazione indebita.\n\nL'Accademia d'Arte 'Dino Scalabrino' e' un ente che ha come scopo la\ndivulgazione dell'opera artistica italiana e straniera attraverso attivita'\ninterdisciplinari quali una scuola, l'organizzazione di mostre e\nl'istituzione di un centro di arte contemporanea. La collezione e'\ncostituita da una importante raccolta di opere di artisti italiani e\nstranieri dalla fine dell'Ottocento a oggi, in gran parte donate da artisti\ne collezionisti. Inaugurata nel 1972, dopo lavori di riallestimento e\nrestauro, la raccolta e' stata riaperta al pubblico il 27 marzo 2005.\nCustodisce sculture, ceramiche, pitture, disegni, oggettistica, manoscritti,\ndocumenti storici, spartiti musicali, strumenti musicali. Tra le opere,\nalcune di artisti quali Annigoni, Guttuso, Bueno, Fattori, Chini e Viani.\n\nIl 6 febbraio 2007 Alberto Scalabrino, presidente del Consiglio di\nAmministrazione, denunciava che il dipinto 'Donna sotto la doccia' di Renato\nGuttuso ed un'altra trentina di quadri, tra i quali lavori di Lorenzo Viani,\nuna tela di Fernand Leger e una di Hans Arp, erano stati trafugati dalla\ncollezione dell'Accademia, con un danno quantificato in un milione di euro.\n\nI militari del Nucleo Tutela Patrimonio Culturale di Firenze, coadiuvati dai\ncolleghi di Pistoia e Montecatini Terme (Pt), hanno accertato l'ammanco di\ncomplessive 190 opere. Coordinati dalla Procura della Repubblica presso il\nTribunale di Pistoia, gli investigatori hanno individuato le persone che,\nper la loro funzione o attivita', avevano avuto rapporti professionali con\nl'Accademia Scalabrino. Nel frattempo sono state acquisite le denunce di\nalcuni privati, preoccupati dalle notizie ampiamente riportate sulla stampa,\ni quali non erano tornati in possesso delle opere concesse in prestito nel\ncorso di eventi culturali.\n\nSui soggetti verificati sono stati condotti accertamenti bancari e, fra\ntutti, emergeva la figura di un professionista, dal 2004 responsabile presso\nl'Ente dell'allestimento di eventi artistici nazionali e internazionali.\nIntestatario di molteplici conti correnti, uno in particolare richiamava\nl'attenzione dei militari perche' riferito a una societa' dallo stesso\ngestita con un nome estremamente simile a quello dell'Ente montecatinese.\nSul conto venivano notati versamenti di numerosi assegni, tutti di discrete\nsomme.\n\nIdentificati i soggetti che avevano emesso i titoli di credito, i militari\ndell'Arma si sono recati presso le loro abitazioni. Gli acquirenti hanno\nconfermato l'acquisto di opere dall'indagato. Accertata la provenienza\nillecita delle opere, fino ad allora ignorata dai detentori, queste sono\nstate prese in consegna dai militari. L'operazione si e' svolta a\nMontecatini Terme (Pt), Altopascio (Lu), Firenze, Prato, Montopoli Val\nd'Arno (Pi), Buti (Pi), Vercelli, Torino, Roma e Forli'.\n\nhttp://www.nsd.it/content/view/5088/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 9\nDate: Tue, 5 Jun 2007 06:45:23 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Harold Mann's boxing medals stolen\nTo: \nMessage-ID: <016a01c7a72c$546c93f0$fd45bbd0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nHarold Mann's boxing medals stolen   \nby Jim Swanson, Citizen sports editor     \n \nThe Harold Mann display at the Prince George Sports Hall of Fame Priceless\nmemories belonging to Harold Mann, the decorated local boxer and former\nnational and international champion, have gone missing from their display\ncase at the Prince George Sports Hall of Fame. \n\n(Submitted photo:\nhttp://www.princegeorgecitizen.com/index.php?option=com_content&task=view&id\n=84254&Itemid=239.)\n\nPrince George RCMP have launched an investigation that includes questioning\nall staff at the Exploration Place, home to the P.G. Sports Hall of Fame\ngallery. As well, anyone who has had access to the gallery will be drawn\ninto the probe. \n\nPolice are treating the case as a theft, said Tracy Calogheros, executive\ndirector of the Exploration Place. \n\nMissing are three Canadian amateur boxing championship gold medals and\nMann's gold medal from the British Empire Games (now known as the\nCommonwealth Games). Mann, a member of the Hall of Fame who sits on the\nlocal athletic commission, had loaned the items to the Hall, along with two\ncommemorative coins. \n\nCalogheros said it was the Tuesday following the May long weekend when staff\nrealized the items were missing. \n\n\"There isn't any other explanation than they've been taken,\" said\nCalogheros, adding that security camera video of that portion of the gallery\nis being examined by investigators. \n\n\"The items are not in our building. I'm so hurt for Harold. Having spoken to\nhim a number of times over the last week, I can't imagine anyone would do\nthat to that man. I'm angry someone violated the public trust. More\nimportant than anything is getting them back because these items are\npriceless and cannot be replaced. What has been done is beyond wrong.\" \n\nCalogheros said this is an isolated incident, and that other museum and\nSports Hall of Fame artifacts are safe. \n\nhttp://www.princegeorgecitizen.com/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 10\nDate: Tue, 5 Jun 2007 06:46:57 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] 'Clueless' thieves sell ?1million Tiepolo painting for\n\t?350\nTo: \nMessage-ID: <017d01c7a72c$8c156340$a44029c0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\n'Clueless' thieves sell ?1million painting for ?350\nLast updated at 20:54pm on 4th June 2007\n \n \nA ?1 million painting stolen by a gang of 'clueless' thieves was discovered\non sale at a flea market for ?350. \n\nGiandomenico Tiepolo's Scenes from a Venetian Carnival was stolen last year\nfrom a private collector. \n\nIt was recovered from Pordenone, near Venice, along with more than a dozen\nother works of art worth more than ?2.5million, following raids on a number\nof markets across Italy. \n\nPolice also arrested several members of a gang of art thieves who had\ntargeted homes in Rome. \n\nA spokesman said yesterday: \"This gang was peddling works of art worth\nmillions for just a few hundred euros. They were completely clueless and had\nno idea of the real value. \n\n\"In fact to call them clueless would be a compliment.\" \n\nTiepolo, whose works are characterised by vivid colour and movement, was\nborn in Venice in 1727. \n\nhttp://www.dailymail.co.uk/\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 131\n****************************************\n\n"}