{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "855p 6/20 Update: MMT clears Atlantis for entry", "body": "\n\n\n\n\n855p 6/20 Update: MMT clears Atlantis for entry\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 83\nPosted: 8:54 PM, 6/20/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-79 (06/20/07): Astronauts pack up for Thursday landing\n   SR-80 (06/20/07): Deorbit timeline; updated backup landing times\n   SR-81 (06/20/07): C-O-R-R-E-C-T-I-O-N (fixing times for second landing opportunity)\n   SR-82 (06/20/07): Entry flight director outlines landing strategy; MMT meets to clear final issues\n   SR-83 (06/20/07): MMT clears Atlantis for entry; final issues resolved\n\n=================================\n\n8:54 PM, 6/20/07, Update: Mission Management Team clears Atlantis for entry\n\nNASA's Mission Management Team late today cleared the shuttle Atlantis for entry Thursday, weather permitting, after unanimously resolving a few final technical questions.\n\nMMT Chairman John Shannon scheduled an unusual night-before-entry meeting late today to discuss three last-minute issues:\n\n*** A final imagery assessment to determine, if possible, the nature of debris seen floating between the shuttle and the space station after undocking on Monday.\n\n*** An aero-thermal assessment to make sure a small bit of unraveled thread that serves as the upper edge of a \"gap filler\" between an outboard leading edge panel on the left wing and an adjacent row of heat-shield tiles poses no threat for significantly higher downstream heating during entry.\n\n*** Consideration of a revised analysis of the heat experienced by Atlantis' left-side rocket pod during ascent when one corner of an insulation blanket peeled back. The blanket was repaired during a spacewalk, but because engineers underestimated how hot the underlying structure got during the climb to space, Shannon ordered a final discussion to make sure no one had any concerns.\n\nThe evening meeting lasted less than two hours. A NASA spokesman said engineers do, in fact, believe the debris seen after undocking was close to the shuttle and, as a result, small and no threat to the orbiter. As for the rocket pod analysis, the MMT concluded the graphite-epoxy material making up the left-side Orbital Maneuvering System rocket pod is not in any danger of over heating, thanks in part to the repair job carried out during a spacewalk last Friday.\n\nFinally, the MMT concluded the protruding gap filler thread will not cause any problems during entry. The spokesman said the decision to proceed with entry, weather permitting, was unanimous.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}