{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Carmella Chen\" <wufeskolaahpab@eskolaah.org>", "subject": "Women will love your new figure", "body": "\nBecome fit and happy again\n\n\n\n\n\nAnatrim – The very up-to-date and most enchanting flesh loss product is now readily available – As seen on Oprah\n\n\n\nDid you realize that superfluous body kilos kill more and more people around the planet? We believe that you hate the unattractive appearance of people like those and the social stigmata attached to them. \n\nOr, maybe, you have not the will to resist an assault of ruinous eating habits of yours. If it all sounds familiar, then we got something to propose to you!\n\n\n\n\n\nWe are proudly introduce you Anatrim, the later product for the elimination of your body’s extra weight. The astounding thing about Anatrim is it raises the quality of your life, making you crave less food and always cheering you up. Look at what people write to us about this product:\n\n\n\n\n\n\"It’s outstanding! \n\n\nInstead of eating everything close at hand and watching TV \n\n\nI became more interested in doing sport.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I have a great form now and lots of men stare hard at me!\"\n\n\n\n\n\n\nRita R., Boston\n\n\n\n\n\n\n\"I tried some passive weight losing, but with little result. I could not restrain my ravenous hunger. \n\n\nOnce I was told about Anatrim the media by and I was really effected at the information.\n\n\n I had tried using it, and my wife said that I’m not more a weighty man now, 5 months later. \n\n\n33 pounds off and I keep still losing them! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nCharley Mock, Colorado\n\n\n\n\n\nAnatrim gives you an opportunity to understand you doesn’t have such a great need for the constant eating. It raises your spirit up, supplies you with additional energy, and attacks useless kilos. Great thanks to its mighty original formula!!\n\n\n\nElicit latest intelligence!\n\n\n\n"}