{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Travis Siegel <tsiegel@softcon.com>", "subject": "Re: security precautionswith iptables?", "body": "If you turn off the various utilities in the inetd.conf file that you  \ndon't use, that can help too.\nI.E. since you're using ssh, you won't need telnet and rlogin.   \nSimply comment them out.  That way, no matter how many packets go to  \nthat destination port, it won't do a bit of good.\nYou are of course welcome to block any ports you like, and it's  \nlikely that'll help too, but the inetd daemon is a nice way to secure  \nthe machine as well.\n\nAs for the problem with the outgoing ping packets, there are ways to  \nspecify incoming/outgoing packets, but I've not fiddled with ip rules  \nfor several years, so i don't remember the syntax.  However, there's  \na very good how-to on the linux how-to site explaining ipfwadm and  \nipchains.  One of the examples in there is how to secure the machine  \nfor a particular service (don't remember which one) but it covers  \nthat exact problem (if I remember correctly)\nTry to see if you can find it.  If not, I'm sure I have it *somewhere*.\nBut, just so you know, there is a solution, I (unfortunately) no  \nlonger remember what it is though.\n\n\nOn May 20, 2007, at 11:34 AM, Littlefield, Tyler wrote:\n\n> Hello list,\n> I've been told to block ping requests with iptables. I made the  \n> following rule:\n> iptables -A INPUT -p icmp --icmp-type echo-request -j DROP\n> The only problem with this, is it drops all pings incoming as well,  \n> which causes a slight problem.\n> Any way around this?\n> Also, is there anything else that can be done in order to make the  \n> system more secure? I was told to block fragmented packets. I know  \n> what they are, but don't know enough about tcp in order to be able  \n> to do much with them.\n> Help is appriciated.\n> Thanks,\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}