{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Ervin Friedman\" <tyccellardesignsal@cellardesign.com>", "subject": "Burn pounds off with Anatrim", "body": "\nA simple and safe way to weigh less\n\n\n\n\n\n\nAnatrim – The newest and most exciting product for corpulent people is now easily available – As could be seen on BBC.\n\n\nDo you count up all the situations when you appeal to yourself to do anything for being rescued from this desperately growing pounds of fat? Happily, now no major price is to be paid. Thanks to Anatrim, the ground-shaking weight-reducing mixture, you can get naturally health mode of life and become really slimmer. Just look at what people say!\n\n\n\n\"It’s quite difficult to acknowledge it but I was an awful food addict. \n\n\nI ate all this rubbish \n\n\nand could not stop. \n\n\n\n\nThis fatal passion left off after I started course of taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my inclination to eat constantly decreased, \n\n\nspirits increased and I became the happiest person on the planet 26 pounds in 2.9 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person!\"\n\n\n\n\n\nSilvia D., Las Vegas\n\n\n\n\n\n\"I had weight problems since I was a boy. \n\n\nYou can't even fancy how I hated being mocked at school. \n\n\n\n\nI detested the weight and I abhorred even myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nIt literally took me out of this terrible nightmare! The very sincere thanks to you, my friends.\"\n\n\n\n\n\nSteve Burbon, Washington\n\n\n\n\n\n\"Do you know what? My marriage was saved thanks to Anatrim! I got into this circle, depression – eating more – just more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nOnce one of my friends pointed to your web site and I called for Anatrim as soon as it was possible. \n\n\nThe results I achieved were magnficent, my appetite became normal, I was in good spirits oftener, and, be sure, I went some belt holes back. And you see, the bedroom became cool, too!\"\n\n\n\n\n\nFrancis\n\n\n\n\n There is a lot of thanks happy people leave after taking Anatrim. Don’t you gonna join the thousands and thousands of slim buyers and try this original appetite-suppressing power increasing product now!\n\n\nDo not lose the opportunity!\n\n\n\n\n"}