{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"Law Watch\" <mailings@mail.cnn.com>", "subject": "Law Watch: Legal News and Analysis from CNN.com", "body": "\n\n\n\n\nCNN.com - Law Watch\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTuesday, June 19, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDisbarred Duke lacrosse D.A. faces ruin\nHis law license lost and reputation in tatters, Mike Nifong seemingly can fall no further. But the disgraced prosecutor faces an uncertain -- and likely troubled -- future. \nFULL STORY\n\n•  Cleared players settle score with Duke\n•  Duke prosecutor disbarred\n•  Cop: D.A. pushed case despite doubts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNANCY GRACE Airs on Headline PRIME, 8 p.m. ET\n\"Nancy Grace\" is television's only justice-themed interview and debate show. Nancy Grace challenges guests\non the most controversial and high-profile legal issues of the day by drawing on her unique perspective\nas a former violent crimes prosecutor and as a crime victim herself.  Send your questions and comments.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHilton prosecutor hushed up crash \nHe got Paris Hilton locked up. On Monday, L.A. City Attorney Rocky Delgadillo apologized for keeping quiet a crash involving his wife, a suspended license and his city-owned car.\nFULL STORY\n\n\n\n\n\n\nMob trial promises to be a hit\nIt seemed like a good idea at the time. A gang of burglars decided to break into the home of Tony Accardo, one of the most powerful men in organized crime history.\nFULL STORY\n\n\n\n\n\n\n$54M lost pants case on last leg\nA lawsuit against a dry cleaners has focused on the term \"satisfaction guaranteed\" and where to draw the line when a customer demands satisfaction.\nFULL STORY\n\n\n\n\n\n\n'Junior' Gotti's going south\nJohn \"Junior\" Gotti is selling his estate and preparing for an eventual move to the South, far from the region where his father was a notorious mob boss.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Law Watch email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}