{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 151", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. FORBIDDEN COLLECTIONS? Ethical issues at the Dutch National\n      Museum of Antiquities (Museum Security Network Mailing list)\n   2. US. Art theft robbed the community. Copper Copse\n      (Museum Security Network Mailing list)\n   3. India. Losing heritage, an Indian habit\n      (Museum Security Network Mailing list)\n   4. Czech Republic. Owners of privatised companies may start\n      worrying as Prague court sets precedent in restitution battles\n      (Museum Security Network Mailing list)\n   5. UK. Antique stolen from Taunton Museum\n      (Museum Security Network Mailing list)\n   6. Argentina. Por el robo de 17 cuadros, la Comuna pide ser\n      \"particular damnificada\" (Museum Security Network Mailing list)\n   7. Germany. Gestohlenes Kunstwerk aus Frankfurter Liebieghaus\n      wieder aufgetaucht (Museum Security Network Mailing list)\n   8. Germany. Dem Welterbekomitee fehlt der Mut\n      (Museum Security Network Mailing list)\n   9. 1st lawsuit on American stolen Chinese relics filed\n      (Museum Security Network Mailing list)\n  10. Germany. Kunstraub im Medical Park Bad Rodach\n      (Museum Security Network Mailing list)\n  11. Austria. Five years for theft of baroque salt-cellar\n      (Museum Security Network Mailing list)\n  12. Frida Kahlo still stirs controversy in Mexico\n      (Museum Security Network Mailing list)\n  13. Swedish heiress loses fight for Warhol painting of Elvis\n      (Museum Security Network Mailing list)\n  14. Mexico. Denuncian saqueo de objetos prehisp??nicos en Hidalgo\n      (Museum Security Network Mailing list)\n  15. US. Theft of 200-year-old whaling harpoons a baffling case,\n      FBI joins investigation of maritime instruments missing from Cape\n      May County Museum (Museum Security Network Mailing list)\n  16. US. Man could face longer sentence in art market scheme\n      (Museum Security Network Mailing list)\n  17. No guarantee Japanese art safe in diplomatic missions\n      (Museum Security Network Mailing list)\n  18. US. Statue Missing From Cornell\n      (Museum Security Network Mailing list)\n  19. US. Reviving faded history, Archivists, librarians get help\n      to save withering documents (Museum Security Network Mailing list)\n  20. US. FBI says secretary took Pearl Buck typescript. In the\n      case of the purloined Pearl S. Buck manuscript: The secretary did\n      it. (Museum Security Network Mailing list)\n  21. Italy returns stolen artifacts to Pakistan\n      (Museum Security Network Mailing list)\n  22. Giro di prostitute e opere d'arte, cinque arresti\n      (Museum Security Network Mailing list)\n  23. US. Shallow Okeechobee reveals pool of artifacts\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Fri, 29 Jun 2007 14:16:15 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] FORBIDDEN COLLECTIONS? Ethical issues at the Dutch\n\tNational Museum of Antiquities\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684F80F.30702@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n12 June 2007\nFORBIDDEN COLLECTIONS?\nEthical issues at the National Museum of Antiquities \n\nThe exhibition ?Forbidden Collections?? at the Dutch National Museum of Antiquities (Rijksmuseum van Oudheden) devotes full attention to the ethical and museum-related issues the museum faces nearly every day. The National Museum of Antiquities is jumping in the current debates in the international museum world. Dilemmas concerning human remains, authenticity, de-accessioning and provenance are discussed, illustrated by authentic objects from the museum?s own collection. The museum chooses a position in each dilemma and visitors are invited to take part in the discussion. The exhibition opens its doors to the public on 12 June. \n\nThere is a great deal of discussion about what is and what is not permitted in museums. Questions such as ?what should be done with art expropriated during World War II? or ?objects originating from an illegal excavations? and ?should unwrapped Egyptian mummies be exhibited to a large public?? are questions the National Museum of Antiquities faces regularly in collecting and exhibiting its archaeological collections. In the modern and confrontational design of ?Forbidden Collections??, the museum offers visitors a glimpse behind the scenes, based on fifteen current issues, divergent viewpoints and objects from its own collections. Visitors can actively participate in the discussions by voicing their own opinions at an ?interactive table?. This also offers the opportunity to explore the issues in more detail. \n\nThe dilemmas of the exhibition are illustrated with authentic objects from the museum?s own collection. A bronze cuirass that the Italian government claimed a few years ago to be illegally excavated and a painting from the Goudstikker collection as an example of looted art, are central to the theme of ?Provenance?. Mummies of Egyptian children, mummy heads and human skulls from excavations from the Netherlands illustrate the issues connected to ?Collecting and exhibiting human remains?. The thousands of Roman oil lamps in the museum depot are on display as part of the ?De-accessioning? theme. In addition, a series of false and authentic Etruscan bronze statuettes and heavily to minimally restored Greek vases are food for thought about the ?Authenticity? of museum objects. \n\nWhile the exhibition is on display, there will be public debates in the museum?s Temple Hall and a lecture about the exhibition (programme at www.rmo.nl).\n\nThe exhibition was made possible with the support of the Mondrian Foundation. \n\n\n\n------------------------------\n\nMessage: 2\nDate: Fri, 29 Jun 2007 14:48:44 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. Art theft robbed the community. Copper Copse\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFAC.4060506@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nArt theft robbed the community\nWednesday, June 27, 2007\n>From a recent post:\n\nCOPPER COPSE\n\nAs crimes go, it was not the most sensational in recent memory, certainly not the most serious. No shots were fired, no one was killed or injured and there were no reports of threats or intimidation, even though the witnesses lie mum.\n\nEven so, the theft of four sculpted copper trees on display at Spring Grove Cemetery & Arboretum was an insult visited on the entire community.\n\nThese trees, called \"Copper Copse 2007,\" were the work of local artist Alicia Emley, who works under the name of Lish. There were five trees with thick copper tube trunks, each with stylized willowy whips, tangled branches or palm-like fronds made from metal tubing. They were part of Spring Grove's first Bi-Annual Sculpture Show until somebody cut four of them off at the ground last week and hauled them away.\n\nThe value of art is incalculable. It's measured in the joy and inspiration it brings to those who view it. It may inspire, provoke or entertain. The thieves saw none of that, probably selling them off for their worth as scrap - the latest in a recent upsurge in copper thefts that have been reported in the area. Police alerted local scrap dealers to be on the lookout for the distinctive pieces, but the trees may well have been shredded, compacted or melted down by the time the report was made.\n\nThese thieves (it's hard to imagine a single person lugging away 5-foot high metal trees) were vandals. They destroyed as well as stole, clearly having no understanding, or desire to understand, what they were taking.\n\nThe sculptor told Enquirer arts reporter Sara Pearce that while she was shocked at the audacity of a theft from a fenced, gated and patrolled site, she was particularly saddened for Spring Grove and the patrons of the show. \"I think this situation makes a powerful statement about how public works of art deserve respect and protection.\"\n\nSpring Grove is a national landmark. Recognized as an arboretum as well as a cemetery, it also is the setting for frequent concerts, tours, walks and now, in conjunction with Summerfair, an art show. This theft violated that public function.\n\nDavid Wells\nhttp://news.enquirer.com/\n\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Fri, 29 Jun 2007 14:48:54 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] India. Losing heritage, an Indian habit\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFB6.70002@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nLosing heritage, an Indian habit\nNilanjana Bose\nCNN-IBN\nWednesday, June 27, 2007 at 22:47\n\nNew Delhi: ?12,000 ? that is the price attached to Mahatma Gandhi's last legacy, a letter, which goes under the hammer on July 3 at the famous auction house Christie's in London.\n\nAnd even as India frets over the auction, losing our heritage has become a habit and a practice.\n\nThe most well-known from this list is the Kohinoor diamond ? all of 105 carats ? originally from Andhra Pradesh and then part of Queen Victoria's crown and finally to the Tower of London.\n\nThen, there's the Peacock Throne or the takht-e-tavous, originally built for the Mughal emperor Shah Jahan. The Throne, set with jewels, was stolen by Persian ruler Nadir Shah in 1739. Thereafter, it too got lost.\n\nYet another throne, belonging to ruler Ranjit Singh was found when Punjab was annexed in 1849. In 1853, it was sent to the East India Company's museum and it was later sent to the Victoria and Albert Hall ? where it still stands.\n\nA painting of Maharaja Ranjit Singh, on what is probably his favourite horse, also lies in the same museum.\n\nIn fact, the Victoria and Albert Museum in London has several pieces of invaluable heritage.\n\nInnumerable Mughal paintings, priceless documents, statues and ornaments are today lost or being displayed in museums outside India. Or worse, being auctioned like the Maharaja of Baroda's pearls that went under the hammer for $7.2 million at Christie?s earlier this year. However, how Christie?s got the necklace is still a mystery.\n\nAnd it's not just objects, Mughal emperor Bahadur Shah Zafar's descendants have been trying for years to get his ashes back from Rangoon and none knows whether freedom fighter Subhash Chandra Bose's ashes are really at Renkoji temple in Tokyo or not.\n\nIt seems losing out on heritage has become part of our own history.\n\nhttp://www.ibnlive.com\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Fri, 29 Jun 2007 14:48:51 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Czech Republic. Owners of privatised companies may\n\tstart worrying as Prague court sets precedent in restitution battles\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFB3.2070206@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nOwners of privatised companies may start worrying as Prague court sets precedent in restitution battles\n[27-06-2007] By Dita Asiedu\n\nThe Prague City Court has made a ruling that could set a precedent in restitution battles. It has become the first court in the country to order compensation for confiscated property to come from the property's latest owner and not from the state.\n\nThe Koh-i-noor factory in Prague is one of the country's biggest producers of snaps, pins and other metal fittings. The company was founded in 1902 by the brothers Jindrich and Zikmund Waldes. By the end of the Second World War, it employed some 500 people and was thriving only to be nationalised in October 1945 under the Benes decrees - less than three years before the Communists took power. Until the communist regime fell, the factory stayed in state hands and was sold into private ownership for 188 million crowns at the end of 1993.\n\nSince then, the heirs of the Waldes brothers have been waging court battles to get back the property that was taken away from their forefathers. After five unsuccessful verdicts, the Prague City Court has now ruled in their favour. Half the company estate as well as 19 valuable paintings are to be returned to them. Among the paintings - a painting of a woman with a press button in her left eye made by famous Czech painter Frantisek Kupka. Used as a model for the company logo, it is said to be the most famous Czech portrait of a girl ever painted.\n\nThe Koh-i-noor board of directors is outraged, saying that the factory was pulled out of debt and has enjoyed massive investment in recent years. The company's lawyers claim the verdict contests the constitution as, with few exceptions, restitution claims only pertain to property taken away by the Communist regime after 1948. General director Pavel Bohuminsky:\n\"The court's reasoning was that even though the factory was nationalised in 1945, the Waldes family was never compensated and so the nationalisation process was not valid. But the family did receive compensation. It was on January 29th, 1982 as part of a bilateral agreement between Prague and Washington. That's because the Waldes family lived in the United States at the time. But the court did not take that into consideration.\"\nSo, should other private owners of companies that were nationalised in 1945 start worrying? Pavel Bohuminsky is optimistic. He says, unlike the other five preceding courts, the Prague City Court made its ruling without knowing the facts:\n\"The organisation was privatised by the state under the coupon privatisation process. This means that there were some 12,000 shareholders. Today, there are 4,000 who could all lose their assets. But what the court seems to have forgotten is that there is a specific law from 1994 that regulates the transfer of ownership from the state to private hands after October 1991. This law is still in place and clearly states that in a case like ours there are no rights to restitution.\"\n\nAccording to Mr Bohuminsky, the company will appeal with the Supreme Court. If that should fail, the Koh-i-noor shareholders - all 4,000 of them - will demand compensation from the Czech government with the reasoning that the state had sold it \"stolen\" property in 1993.\n\nhttp://www.radio.cz\n\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Fri, 29 Jun 2007 14:49:50 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] UK. Antique stolen from Taunton Museum\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFEE.90404@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nAntique stolen from Taunton Museum\nBy Chris Alder\n\nPolice are appealing for information to trace an antique glass sewing case stolen from Taunton Museum.\n\nThe case, described as being green, egg-shaped with a lid, and dated between 1875-1920s, was stolen from the museum sometime between June 15 and 22.\n\nIt contains a thimble, scissors and needle case, all gold coloured, and was removed from a glass display cabinet.\n\nAnyone who has seen the item for sale should contact Taunton police station on 0845 4567000.\n\nhttp://www.somersetcountygazette.co.uk\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Fri, 29 Jun 2007 14:49:28 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Argentina. Por el robo de 17 cuadros, la Comuna pide\n\tser \"particular damnificada\"\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFD8.1040706@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nPor el robo de 17 cuadros, la Comuna pide ser \"particular damnificada\"\n\nLa justicia investiga la desaparici?n de varias pinturas que estaban en el Instituto Cultural de la Comuna. Si bien el faltante hab?a sido denunciado por el titular de la entidad, Guillermo Davis, la oposici?n pidi? su renuncia. Se trata de determinar las responsabilidade en el hecho\n\nLa Municipalidad de Bah?a Blanca solicit? ser considerada como particular damnificado en la causa que se investiga el presunto robo de 17 cuadros del dep?sito del palacio comunal.\n\nHasta el momento, dicho expediente no cuenta con personas ni entidades que hayan tramitado la citada calificaci?n. Sin embargo desde la Comuna se est?n tomando todos los recaudos a nivel jur?dico para evitar futuras implicaciones en la inestigaci?n.\n\nCabe recordar que d?as atr?s la oposici?n pidi? que por la desaparici?n de unos 17 cuadros, entre ellos obras de reconocidos pintores argentinos, se separara del cargo al flamante titular del Instituto Cultural, Guillermo David.\n\nEl funcionario hab?a denunciado la desaparici?n de ese material, en los d?as posteriores al incendio del despacho comunal en el que falt? un cuadro de benito Quinquela Mart?n. En esa oportunidad dijo: \"que hace poco menos de un mes\", ni bien asumi? en el cargo \"puse a todos los museos y tambi?n a la Comisi?n de Patrimonio a chequear en qu? situaci?n estaban los distintos elementos\".\n\n\"Despu?s de un relevamiento exhaustivo, encontramos una situaci?n an?mala en el dep?sito del Museo de Bellas Artes: hallamos un faltante de 30 cuadros. Se trata de 20 cuadros y unos cuantos grabados, entre los que se encuentra una obra de Antonio Berni de los a?os '60 titulado El pullover negro y otra de Eduardo S?vori Retrato de Carlos Pellegrini, de 1908\", dijo David.\n\nConsultado sobre si se est? cien por ciento seguro de que se trata de robos, David respondi? que s?. \"Encontramos siete marcos vac?os; entre ellos, el de Berni\", afirm?.\n\nEn tanto, el hecho est? siendo investigado por la Unidad Funcional de Instrucci?n y Juicio N?4, a cargo de la doctora Leila Scavarda. \n\nhttp://www.diariohoy.net/\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Fri, 29 Jun 2007 14:49:21 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Germany. Gestohlenes Kunstwerk aus Frankfurter\n\tLiebieghaus wieder aufgetaucht\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFD1.3040900@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nGestohlenes Kunstwerk aus Frankfurter Liebieghaus wieder aufgetaucht\n26. Juni 2007 | 14:57 Uhr \n\nEin aus der Skulpturensammlung des Frankfurter Liebieghauses gestohlenes Evangelisten-Relief ist wieder aufgetaucht. Ein Obdachloser habe das fast 600 Jahre alte Relief aus Alabaster offensichtlich entwendet und auf dem Flohmarkt verkauft, teilte die Polizei am Dienstag mit. Ein Sammler aus Aschaffenburg hatte das Kunstwerk ?in gutem Glauben? f?r nur 70 Euro erstanden. Nachdem der 49-J?hrige aus den Medien von der Herkunft des Reliefs erfahren hatte, ?bergab er das Kunstwerk der Polizei.\n\nFrankfurt/Main (ddp). Ein aus der Skulpturensammlung des Frankfurter Liebieghauses gestohlenes Evangelisten-Relief ist wieder aufgetaucht. Ein Obdachloser habe das fast 600 Jahre alte Relief aus Alabaster offensichtlich entwendet und auf dem Flohmarkt verkauft, teilte die Polizei am Dienstag mit. Ein Sammler aus Aschaffenburg hatte das Kunstwerk ?in gutem Glauben? f?r nur 70 Euro erstanden. Nachdem der 49-J?hrige aus den Medien von der Herkunft des Reliefs erfahren hatte, ?bergab er das Kunstwerk der Polizei. Die Polizei nahm auf dem Frankfurter Flohmarkt einen 34-J?hrigen fest, gegen den bereits zwei Haftbefehle wegen anderer Eigentumsdelikte vorlagen. Der Sammler aus Aschaffenburg gab an, in den vergangenen zwei Jahren h?ufiger Gegenst?nde am Flohmarktstand des Festgenommen gekauft zu haben. Das Relief aus dem Gesamtensemble ?Kreuzigungsaltar aus Rimini? war Mitte Mai herausgebrochen und gestohlen worden. Das um 1430 entstandene Kunstwerk besteht aus einer mehrfi\n\ngurigen Darstellung Christi mit den zw?lf Aposteln und ist seit 1913 im Besitz des Liebieghauses.\n\nhttp://www.ad-hoc-news.de\n\n\n\n\n------------------------------\n\nMessage: 8\nDate: Fri, 29 Jun 2007 14:49:12 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Germany. Dem Welterbekomitee fehlt der Mut\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFC8.9040703@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nDem Welterbekomitee fehlt der Mut\n28. Juni 2007 \nVon Dieter Bartetzko\n\nSteht eine zweite Ablehnung Heidelbergs bevor?\n\nDas Welterbekomitee der Unesco findet Geh?r in der Welt. J?hrlich reisen Journalisten aus aller Herren L?ndern zu seinen Jahreskonferenzen. Diesmal, in Christchurch in Neuseeland, waren die deutschen G?ste besonders gespannt, drohte doch wegen des Bauprojekts ?Waldschl?sschenbr?cke? dem Dresdner Elbtal die Streichung von der Welterbeliste. Geb?hrend erleichtert nahm man Anfang der Woche die Gnadenfrist auf, die das Komitee Dresden bis zum 1. Oktober zur Vorlage neuer Entw?rfe zugestand. Doch folgte am n?chsten Tag eine neue kalte Dusche: Heidelbergs Antrag auf einen Listenplatz werde wegen M?ngeln in den Bewerbungsunterlagen wahrscheinlich abgewiesen, verlautete von Teilnehmern.\n\nDeutschland scheint momentan - gelinde gesagt - ein Sorgenkind der Unesco zu sein: Lebhaft im Ged?chtnis ist noch die Versetzung des K?lner Doms 2004 auf die Rote Liste des gef?hrdeten Erbes, die 2006 aufgehoben wurde, als die Stadt ihre beanstandeten Hochhauspl?ne im Umfeld der Kathedrale aufgab. Im Fall Dresden versch?rfte das Komitee sein Vorgehen: Die Streichung von der Liste w?re ein einmaliger Fall. Und die Zur?ckweisung Heidelbergs w?re insofern eine Neuigkeit, als die Stadt damit zum zweiten Mal abgelehnt w?rde; sie hatte sich bereits 2005 vergeblich beworben.\n\nKein Weltuntergang - ohne Welterbestatus\n\nDer K?lner Dom wird vorerst nicht weiter verbaut\n\nDas Sorgenkind ist aber auch ein Musterknabe. Denn kaum eine Nation reagiert so besorgt auf die Schelte der Welterbeh?ter wie die deutsche. Daran ?ndert wenig, dass momentan Trotz zunimmt. Sachsens Ministerpr?sident Milbradt, strikter Anh?nger der diskreditierten Waldschl?sschenbr?cke, sagte mehrfach, dass der Verlust des Welterbestatus kein Weltuntergang w?re. Weiter ging der Vorsitzende der s?chsischen FDP, der Werbefachmann Holger Zastrow: ?Wir haben in Dresden drei Dinge, mit denen wir uns der Welt pr?sentieren: Frauenkirche, Gr?nes Gew?lbe und Semperoper.? Sie, auf denen die gesamte Tourismusbranche beruhe, gl?nzten weltweit auch ohne die Unesco. ?hnlich reagierte jetzt Heidelbergs Baub?rgermeister Raban von der Malsburg mit dem Satz, die j?hrliche Besucherzahl der Stadt von mehr als vier Millionen werde ?durch den Welterbetitel nicht weiter steigen?.\n\nDiese bissigen Repliken enth?llen schlagartig das fragw?rdige Fundament, auf dem sich jenes ruhmgl?nzende Ehrenmal erhebt, das Welterbestatus hei?t: Wo die Unesco kulturell unverzichtbares Erbe sieht, sehen die unmittelbar Betroffenen oft nur Magneten des Massentourismus, denen der Titel zus?tzlich Zugkraft verleiht.\n\nDer aberkannte Welterbestatus w?re kein Weltuntergang f?r Dresden - meint Ministerpr?sident Milbradt\n\nDer Tourismus wiederum bedeutet oft erh?hten Verschlei? und steigende Gef?hrdung des Erbes. Diesen Teufelskreis hat das Welterbekomitee seit der Gr?ndung im Jahre 1972 erkannt. J?ngstes Zeichen hierf?r ist die gerade beschlossene Plazierung der Galapagos-Inseln, die 1978 als erster Gesamtort Welterbe wurden, auf der Roten Liste. Grund sei, so das Komitee, die ?unkontrollierte Entwicklung des Tourismus. Die Zahl der Tage, die Passagiere von Kreuzschiffen dort verbringen, ist in 15 Jahren um 150 Prozent gestiegen.?\n\nGegner Profitgier\n\nDie Rote Liste ist l?ngst auch ein Zeugnis der Schw?che der Unesco. Ungeachtet ihrer Stammpl?tze dort steigern zum Beispiel die beiden weltber?hmten italienischen Erbest?tten Pompeji und Herculaneum unger?hrt ihren Tourismus und dulden zugleich den rapiden Verfall der antiken Ruinen. Angkor Wat, die nicht minder ber?hmte tausendj?hrige Tempelstadt in Kambodscha, kam wegen vorbildlicher Restaurierungen 2004 von der Roten Liste in die Erbeliste zur?ck - was dort weiteren Kunstraub nicht verhindert.\n\nEin Teufelskreis: Tourismus verschlei?t - und Welterbe sorgt f?r Tourismus, so auf den Galapagos-Inseln\n\nProfitgier, sei es durch Tourismus oder Raubgrabungen und anderen organisierten Diebstahl, sowie kunstfeindlicher Fanatismus, wie ihn etwa die Taliban bewiesen, als sie die Buddhas von Bamijan weltweiten Protesten zum Trotz in die Luft sprengten, sind un?berwindliche Gegner der Erbeh?ter, deren Waffen im Appell an Anstand, Ethik, Piet?t und Kunstsinn bestehen. T?glich, ob in Pal?stina, dem Kosovo oder in Iran, in Indien oder Italien, Florida oder an der Schwarzmeerk?ste, werden Welterbest?tten durch Kriege, Pl?nderer, Diebe und Touristen zerst?rt. Und ebenso regelm??ig wie ?berwiegend folgenlos bekunden die Welterbeh?ter ihr Bedauern, warnen und beschw?ren, ja drohen sogar manchmal.\n\nMusterknabe Deutschland\n\nDoch es ergeht ihnen wie vielen Weltorganisationen: Alle Welt (im Fall der Unesco 182 Staaten, die die Welterbe-Konvention ratifiziert haben) bekundet Respekt - und handelt weiterhin gem?? den ureigenen Interessen. ?Heritage at risk? lautet der Titel der internationalen Ver?ffentlichung, die j?hrlich die gef?hrdeten St?tten vorstellt. Das Risiko des Welterbekomitees besteht - nicht rechtlich, aber tats?chlich - in seiner v?lligen Machtlosigkeit, aber auch in der Gro?z?gigkeit, mit der Jahr f?r Jahr weitere St?tten aufgenommen und die Kriterien des Erbebegriffs erweitert werden: Es gibt Weltkultur- und Weltnaturerbest?tten, wozu in nunmehr 137 L?ndern 628 Kulturdenkm?ler und 160 Naturdenkm?ler z?hlen. Daneben werden schriftliche ?berlieferungen, inzwischen aber auch Lieder, Sitten und Br?uche zum Welterbe gerechnet. Selbst mit weitgehenden Befugnissen ausgestattete Organisationen k?nnten diese stetig steigende F?lle kaum noch bew?ltigen.\n\nDie Restaurierung 2004 sorgte f?r die Wiederaufnahme in die Erbeliste, doch der Kunstraub geht weiter: Angkor Wat\n\nMut zur strengeren Auswahl und Mut zu lautstarkem Widerstand muss man dem Welterbekomitee w?nschen, soll sein Anliegen Zukunft haben. Und weniger Mut, sich ausgerechnet dort zum haarspaltenden Obersch?tzer aufzuwerfen, wo der gr??te gute Wille vorhanden ist. Denn Deutschland, das bei Welterbe-Schelte erstarrt wie das Kaninchen vor der Schlange, hat unter den 16 Staaten, die die gr??ten Summen f?r die Unesco spenden, einen der vorderen Pl?tze inne.\n\nText: F.A.Z., 28.06.2007, Nr. 147 / Seite 1\nBildmaterial: AFP, AP, dpa\nwww.faz.net\n\n\n\n\n------------------------------\n\nMessage: 9\nDate: Fri, 29 Jun 2007 14:49:47 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] 1st lawsuit on American stolen Chinese relics filed\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFEB.8020201@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n1st lawsuit on American stolen Chinese relics filed\nSource: CRI | 06-25-2007 16:46\n\nThe first ever lawsuit to retrieve China's lost cultural treasures has been filed against a Spanish American\nfor his ancestor's having stolen two heads from the Longmen Grottoes in Luoyang, central China's Henan\nprovince.\n\nLiu Yang, the lawyer who filed the case last weekend to Luoyang's Intermediate People's Court, is a\nmember of the All China Lawyers Association and a senior collector of relics. The lawyer told the local media\nthat the case, which was earlier rejected by several other courts, will target the Spanish American whose\nancestor had grabbed two heads of Buddhist sculptures through illegal means in the 1930s from Longmen\nGrottoes, known as one of the four greatest grottoes in China.\nLiu says he appealed to the court to ask the American who lives in Los Angeles to return the Chinese\nhistorical treasures.\n\nWhen asking experts to give his treasures a proper evaluation early this year, the Spanish American\naddressed the American Chinese Collectors Association that his ancestor was in China in the 1930s and\nabetted locals by offering only two silver dollars to help stole two heads of Buddhist sculptures, which were\nthen secretly transported to the US and remained deserted in his backyard for a long time. The man hoped\nto commission relevant organs to sell the pieces.\n\nAs this is the first ever lawsuit concerning reclaiming stolen cultural relics, some key issues will accordingly arise, Liu added.\nFirst, for example, who will be the plaintiff ? Procuratorates, cultural relics bureau, an individual or\nState-owned Assets Supervision and Administration Commission are among the possible plaintiffs,\naccording to law experts.\n\nAn official from the Luoyang Intermediate Court said that an individual is not excluded as an accuser, but\nthe Luoyang Municipal Cultural Relics Bureau sounds more appropriate.\nAnother question is: the defendant. Since the man's ancestor is long dead, is it proper to accuse the man?\nLiu Yang responded by saying that, as long as the article was gained through inappropriate means, it's\nreasonable to reclaim it from its current holder.\n\nLiu Yang said his first thought of the idea has come from an Egyptian lawyer who had taken the British\nMuseum to court in order to reclaim his country's cultural relics.\nChinese experts have estimated that more than 10 million Chinese cultural relics have been lost overseas.\nAccording to the Chinese Cultural Relics Society, most of the cultural relics were stolen and smuggled out of\nChina, rather than destroyed, before the founding of the People's Republic of China in 1949.\n\nhttp://www.cctv.com\n\n\n\n\n------------------------------\n\nMessage: 10\nDate: Fri, 29 Jun 2007 14:49:24 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Germany. Kunstraub im Medical Park Bad Rodach\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFD4.5020303@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nKunstraub im Medical Park Bad Rodach\nDienstag, 26. Juni 2007 13:47\n\nDrei ?lgem?lde entwendete ein unbekannter Kunstliebhaber im Verlauf der letzten Wochen aus dem Bad Rodacher Medical Park.\n\nSeit Ende Mai waren dort im gro?en Veranstaltungsraum des Klinikums und auf den Fluren die Bilder einer Bamberger K?nstlerin ?ffentlich ausgestellt. Jetzt musste sie feststellen, dass drei ihrer Gem?lde illegal einen neuen Besitzer gefunden haben. Die gerahmten Bilder haben etwa eine Gr??e von 30 x 50 cm und zeigen die Motive \"Anemonen\", \"Fr?hlingsblumen\" und \"Winter auf dem Lande\". Die Beute des Kunstdiebes hat einen Wert von 370 Euro.\n\nhttp://www.kanal8.de/\n\n\n\n\n\n------------------------------\n\nMessage: 11\nDate: Fri, 29 Jun 2007 14:49:34 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Austria. Five years for theft of baroque salt-cellar\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFDE.7000207@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nFive years for theft of baroque salt-cellar\nJun 26, 2007, 10:23 GMT \n\nVienna - A man charged with the theft of a priceless 500- year-old baroque Saliera salt-cellar was sentenced to five years imprisonment Tuesday in Austria's most spectacular art-theft.\n\nRobert Mang, a 51-year-old 'gentleman burglar' had stolen the gold and enamel sculpture by Benvenuto Cellini from Vienna's Fine Arts Museum in May 2003.\n\nA Vienna court had handed down a four-year sentence to Mang, who became an instant celebrity in Austrian media. But in September 2006, Austria's supreme court ruled the trial had to be repeated due to formal reasons.\n\nThe court took into account that Mang had no previous criminal history as well his confession when coming to a relatively lenient sentence for breaking and entering, burglary and attempted blackmail, the head judge said.\n\nThe Viennese security expert always maintained he had broken into the museum and stolen the inadequately guarded sculpture as a prank while drunk after a night partying in Vienna's clubs.\n\nScaffolding and steps outside leading to the first floor of the museum had made entering relatively easy apart from the inadequate security cameras and alarm systems.\n\nMang had hidden the salt-cellar, worth around 36 million euros (48.4 million dollars) for two years, first under his bed and then buried in a forest. He sent several ransom notes to the museum's insurance company, saying he would melt the unique artwork down, if he was not paid 10 million euros.\n\nMang was arrested in January 2006, after being caught on security cameras when buying a phone used for his blackmail attempts. The verdict is not final. \n\nhttp://news.monstersandcritics.com\n\n\n\n\n------------------------------\n\nMessage: 12\nDate: Fri, 29 Jun 2007 14:49:15 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Frida Kahlo still stirs controversy in Mexico\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFCB.7000508@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nFrida Kahlo still stirs controversy in Mexico\n\nLooks as if Frida Kahlo, one of the Modern era?s most enigmatic artists, has been keeping a few more mysteries tucked inside her tehuana outfits.\n\nSince opening in Mexico City two weeks ago, the massive exhibition honoring the ever-popular painter has been drawing overflow crowds, critical praise and controversy. On Monday, the Mexico City daily newspaper Reforma published a story in which Raquel Tibol, a respected art critic and author of a new biographical study of Kahlo?s husband, Diego Rivera, raised questions about the authenticity of two of the works in the Kahlo restrospective at the Palace of Bellas Artes.\n\nOne of those works, a portrait of one of Kahlo?s first lovers, Alejandro G?mez Arias, which she painted in 1928, reportedly was discovered in a piece of furniture by his heirs after his death in 1990. G?mez Arias was riding with Kahlo during the fateful bus accident that fractured her spine.\n\nThe painting was included in the large Kahlo show hosted by the Tate Modern in London in 2005. Tibol has challenged the provenance of that work as well as an undated drawing, ?Portrait of Isolda Pinedo Kahlo.?\n\n?I consider that they don?t correspond to the hand of Frida,? Tibol is quoted as saying in Reforma. But two of the exhibition?s curators have countered that the disputed works come from respected collections and that their authenticity is supported by documentary evidence.\n\nhttp://latimesblogs.latimes.com\n\n\n\n\n------------------------------\n\nMessage: 13\nDate: Fri, 29 Jun 2007 14:49:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Swedish heiress loses fight for Warhol painting of\n\tElvis\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFE5.6010300@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nSwedish heiress loses fight for Warhol painting of Elvis\nAssociated Press\nJune 25, 2007\n\nNEW HAVEN, Conn. -- Elvis left the building with the right owner, the Connecticut Supreme Court ruled in an opinion released Monday.\n\nA 1962 Andy Warhol silk screen featuring 36 identical images of Elvis Presley's face was at the center of a court battle in Connecticut.\n\nSwedish heiress Kersten Lindholm of Greenwich appealed a court ruling that declared newsprint magnate Peter Brant the rightful owner of \"Red Elvis,\" a 6-foot-tall painting worth as much as $12 million.\n\nBrant bought the painting seven years ago from Lindholm's art dealer, who was later convicted of stealing it.\n\nThe high court ruled unanimously that Brant is the rightful owner of the art work.\n\nSuperior Court Judge Chase Rogers, now the state Supreme Court chief justice, ruled in 2005 that Brant made a reasonable effort to confirm that Swedish art dealer Anders Malmberg was authorized to sell the painting.\n\nThe Supreme Court agreed, noting that Brant hired an attorney to conduct an investigation and insisted on a formal contract.\n\n\"We conclude that these steps were sufficient to conform to reasonable commercial standards for the sale of art work under the circumstances and, therefore, that the defendant had status as a buyer in the ordinary course of business,\" Justice William Sullivan wrote.\n\nLindholm had filed a civil suit alleging that Brant and Malmberg conspired to buy the painting without her permission.\n\nBrant, a longtime Warhol collector, paid $2.9 million to buy the painting from Malmberg, who had represented Lindholm in many art transactions, according to court documents. The painting is now in Brant's private collection.\n\nBrant bought the painting while it was on exhibit in Europe as part of a Warhol tour put on by the Guggenheim Museum of New York.\n\nIn 2003, Malmberg began serving a three-year term in Sweden on criminal theft charges in connection with the sale of \"Red Elvis.\"\n\nhttp://www.stamfordadvocate.com\n\n\n\n\n------------------------------\n\nMessage: 14\nDate: Fri, 29 Jun 2007 14:49:57 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Mexico. Denuncian saqueo de objetos prehisp??nicos en\n\tHidalgo\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFF5.4050600@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nDenuncian saqueo de objetos prehisp??nicos en Hidalgo\n\nEn el municipio hay pinturas rupestres y un centro ceremonial, que ser??n rescatados por el INAH.? \n\nPachuca, Hgo.- Autoridades del municipio de Ajacuba denunciaron ante el INAH el saqueo de objetos prehisp??nicos, por parte de bandas de contrabandistas quienes realizan excavaciones en sitios arqueol??gicos de la cultura tolteca.\n\nMiguel S??nchez, secretario de Turismo de Ajacuba, precis?? que el saqueo de figuras prehisp??nicas se extiende en los parajes del Monte Espinoso, o cerro de Ponzh??, en donde se estableci?? una comunidad de la cultura azteca con influencia tolteca.\n\nA??adi?? que el hecho ya fue reportado ante el Instituto Nacional de Antropolog??a e Historia, al se??alar que en el lugar ya se realizan los estudios para determinar la posible presencia teotihuacana.\n\nDe acuerdo con el funcionario municipal, los bandidos furtivos han arado en laderas y sobre los mismos restos de esa cultura, en busca de ??dolos y objetos de la vida cotidiana de esa comunidad, como vasijas, platos, puntas de flecha y jade.\n\nAsegur?? que se desconoce con exactitud la cantidad de material robado de este sitio prehisp??nico, as?? como de otros que se ubican en distintos puntos del municipio con presencia de la cultura tolteca.\n\nRecord?? que en el municipio hay varios sitios catalogados como prehisp??nicos, como la Pe??a del Aguila, en la que se han encontrado algunos vestigios toltecas y en la que se descubri?? que gente experta ha realizado excavaciones para extraer posibles objetos de esa cultura.\n\nAsimismo, dijo que en el municipio hay pinturas rupestres y un centro ceremonial, que ser??n rescatados por el INAH, los que por ahora se encuentran abandonados, y que aprovechan los saqueadores para traficar con piezas de la cultura tolteca.\n\nhttp://www.milenio.com/\n\n\n\n\n------------------------------\n\nMessage: 15\nDate: Fri, 29 Jun 2007 14:49:37 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. Theft of 200-year-old whaling harpoons a baffling\n\tcase, FBI joins investigation of maritime instruments missing from\n\tCape May County Museum\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFE1.1070006@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nTheft of 200-year-old whaling harpoons a baffling case\nFBI joins investigation of maritime instruments missing from Cape May County Museum\nBy BRIAN IANIERI Staff Writer, (609) 463-6713\nPublished: Tuesday, June 26, 2007\nMIDDLE TOWNSHIP ? Call me Agent Ishmael.\n\nThe FBI has been called in to help township officials solve the case of the missing whaling harpoons.\n\nIt's an odd crime that took place at the Cape May County Museum three weeks ago, involving the disappearance of various whaling implements used in the early 19th century.\n\nTownship police and the FBI's Art Theft Program are investigating the theft of six whaling harpoons, a whaling gun and several other maritime instruments, police Capt. Scott Webster said Monday.\n\nAuthorities have been monitoring online auction sites in case the 200-year-old harpoons make an appearance, Webster said.\n\n?It's an ongoing investigation,? Webster said. ?The FBI has a division that does a lot of background on art thefts and that type of theft, and we've been dealing with them.?\n\nNot surprisingly, the harpoon thefts do not place on the FBI's ?Top Ten Art Crimes,? as listed on their Web site.\n\nNor does it rank alongside the millions of dollars worth of stolen Norman Rockwells and Claude Monets.\n\nBut the harpoon thefts has been somewhat baffling, if but for one simple question: Who in the world would steal heavy, pointy pieces of metal that may or may not have been inside a whale?\n\nMuseum officials have said they believe the culprit was a collector and someone who knows his harpoons. Only six were stolen from a glass museum case that contained other harpoons, bone spades, blubber pikes and another harpoon gun.\n\nThree sailor's palm thimbles ? used in sail making ? and a sextant also were stolen from the maritime exhibit.\n\nThe exhibit is located in a locked barn, and museum workers believe someone unlocked the doors from the inside before returning later in the day or night.\n\nA museum worker noticed the missing items the morning of June 5 while plugging in the lighted display.\n\nThe county museum is by no means a hotbed of crime. Officials could recall only a few instances of anything being stolen there.\n\nIn one case about two decades ago, someone attempted to steal old arrowheads in a glass casing from the museum, said Somers Corson, a former museum curator.\n\nBut a resident of a nearby nursing home noticed the burglary, and the arrowheads were recovered quickly, Corson said.\n\n?I'd almost forgotten about that until the harpoons were stolen,? Corson said. ?It's just somebody looking for financial value is all, or else they're a real enthusiastic collector. Of course, it's hard to tell ?someone must have known what they wanted, because they were the best ones they took.?\n\nAnyone with information about the missing harpoons should contact Middle Township police at (609) 465-8700 or anonymously to Cape May County Crime Stoppers at (609) 465-2800.\n\nhttp://www.pressofatlanticcity.com\n\n\n\n\n------------------------------\n\nMessage: 16\nDate: Fri, 29 Jun 2007 14:49:18 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. Man could face longer sentence in art market scheme\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFCE.7020203@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nMan could face longer sentence in art market scheme\nBy The Associated Press\n06/26/2007 06:39:56 AM MDT\n\nSANTA FE ? A Santa Fe businessman sentenced to 34 years in prison for deceiving people who invested thousands of dollars in a defunct capital city art market could face more prison time.\n\nThe state attorney general's office has filed additional information alleging that Michael Soutar was convicted of assault in Bernalillo County in 1991 and forgery in Maricopa County, Ariz., in 1997.\n\nSoutar, 48, admitted to the convictions Monday in state district court.\n\nIt's unclear if the convictions mean Soutar will face an extra two years or eight years, said his attorney, Dan Cron.\n\nSoutar's sentencing is scheduled for July 9.\n\nState District Judge Michael Vigil had sentenced Soutar in May after he determined that Soutar could not pay up to $200,000 in restitution that had been agreed upon as part of a plea deal several months earlier.\n\nVigil sentenced Soutar to nine years for racketeering and another nine years on counts of securities fraud. He added 16 years to Soutar's term for being a habitual criminal.\n\n???\n\nInformation from: The Santa Fe New Mexican, www.sfnewmexican.com\n\n\n\n\n------------------------------\n\nMessage: 17\nDate: Fri, 29 Jun 2007 14:49:44 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] No guarantee Japanese art safe in diplomatic missions\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFE8.5050808@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nNo guarantee Japanese art safe in diplomatic missions\n06/26/2007\nTHE ASAHI SHIMBUN\n\nDozens of valuable art works hanging at Japanese embassies and other Foreign Ministry missions overseas have been thrown out with the garbage or lost, according to officials.\n\nIn total, 46 works of art have disappeared since 2002, the Foreign Ministry said, citing a survey it conducted in response to requests for information by Yukichi Maeda, a Lower House member of Minshuto (Democratic Party of Japan), and Muneo Suzuki, a Lower House member of New Party Daichi.\n\nThe finding sparked anger among Japanese artists who sold the works at discount prices or donated them in the expectation that the Foreign Ministry would take good care of them.\n\nThe artists were clearly honored that their works would be displayed at Japanese diplomatic missions abroad and had hoped the pictures and other works would contribute to greater understanding of Japan's culture.\n\nMinistry officials said the art works in question were thrown away or disappeared because they were damaged beyond repair. Officials contended that the paintings were stored appropriately in all cases.\n\nTwenty-nine of the paintings were created in the Showa Era (1926-1989). The others were copies of works by old masters, such as Taikan Yokoyama and Gyokudo Kawai.\n\nEleven of the 29 Showa Era works were Japanese-style paintings while six were done on ceramic ware.\n\nThe others included four Western-style paintings, four prints and two pieces of calligraphy.\n\nOf those 29 art works, five were donated while eight were purchased for about 1.16 million yen in total between the 1950s and 1980s. The individual purchase price ranged from 8,000 yen to 400,000 yen.\n\nOfficials said no records existed of when the Foreign Ministry purchased the remaining 16 items, nor how much it paid for them.\n\nThe one item that inexplicably vanished is a Japanese-style painting titled \"Ushio no Mai\" (Dance of waves) by Kotaro Doi in Morioka.\n\nThe Foreign Ministry purchased the work in 1992 for 580,000 yen.\n\nThe painting went missing around April 2006 when it was displayed at the Japanese Embassy in Uzbekistan.\n\nThe embassy notified local authorities about a possible theft but the item was never recovered.\n\nThe painter, Doi, voiced his anger at the ministry's sloppiness.\n\n\"I had absolutely trusted the Foreign Ministry when I sold it, feeling as if I had parted with my own child,\" Doi said. \"I felt honored (that the ministry had selected my work) and I sold it at about one-tenth of the price I would normally have charged.\"\n\nA bereaved family member of a late Japanese calligrapher also expressed anger that the work donated to the Foreign Ministry in the 1980s had been lost.\n\n\"It is an insult,\" the family member said.\n\n\"(Calligraphy items) will not easily deteriorate if appropriately stored. I can't believe the explanation that it was discarded (because its condition had deteriorated).\"\n\nAccording to the Foreign Ministry, Japanese embassies, consulates-general and other overseas diplomatic missions have in excess of 4,000 items of art.\n\nAn official of the ministry's Overseas Establishments Division said the ministry had instructed its overseas missions to pay careful attention to temperature and humidity control in managing works of art.\n\n\"The items were thrown out because they had deteriorated to a point beyond repair, through mold and other stains,\" the official said.(IHT/Asahi: June 26,2007) \n\nhttp://www.asahi.com\n\n\n\n\n------------------------------\n\nMessage: 18\nDate: Fri, 29 Jun 2007 14:49:31 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. Statue Missing From Cornell\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFDB.6010306@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nStatue Missing From Cornell\nLast Update: Jun 26, 2007 11:29 PM\n\nIthaca (WSYR-TV) - Cornell University Police are looking for a 350 pound plaster of paris Greek goddess wrapped in a toga.\n\nThe school says someone has taken the statue from its usual resting place on campus.\n\nRight now they figure it was sometime over the weekend that somebody came through the white doors of Sibley Hall and took a 350 pound sculpture that was resting just inside.\n\nSimeon Moss says, \"The building manager discovered it was missing on Monday morning. This statue is part of a collection that was very large collection; it was acquired by the first president of Cornell.?\n\nThe statue is a plaster of paris replica of the statue Sleeping Ariadne, a character in Greek mythology.\n\nIt's estimated to be worth between $5,000 and $20,000. Moss says a utility cart is also missing, they figure it was used to move the six foot long three foot high statue from its resting place inside Sibley Hall.\n\n?There was some plaster material that left kind of a trail to a parking area in between two buildings Rand and Sibley Hall and so the working assumption is that it was loaded into a vehicle and taken away.\"\n\nCornell is not saying right now whether or not they think this may be a prank or not, they're treating this like a theft.\n\nCornell says right now it hasn't found anybody who witnessed what might have happened at Sibley Hall during the weekend. \n\nhttp://www.9wsyr.com\n\n\n\n\n\n------------------------------\n\nMessage: 19\nDate: Fri, 29 Jun 2007 14:49:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. Reviving faded history, Archivists, librarians get\n\thelp to save withering documents\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFC0.6080404@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nReviving faded history\nArchivists, librarians get help to save withering documents\n\nBy BO EMERSON\nThe Atlanta Journal-Constitution\nPublished on: 06/28/07\n\nThe caller on the phone did not identify himself, but Augusta historians call him \"Deep Throat.\"\n\nHave a van outside the courthouse at a certain hour, the caller said. Be prepared to load up several garbage bags full of documents.\n\nIn fact, the cache of historic records would eventually fill 40 to 50 boxes, and would include pre-Revolutionary War papers, some of them autographed by signers of the Declaration of Independence.\n\nBecause someone with connections didn't want to see those documents go into a landfill, the Augusta Genealogical Society received an anonymous tip.\n\nIf their contact had not placed a call, Button Gwinnett's signature, and others, would have been trashed, said Thomas Dirksen, Augusta historian, and past president of the society. \"Those records would have disappeared, and no one would have thought twice,\" he said.\n\nRecords vanish. They are stolen, lost, thrown away or simply stored out of sight and out of mind. They're eaten by moths, dust, mold, insects and mice. In Georgia, the humidity turns improperly stored papers to mush.\n\nThis week archivists, librarians and curators from Georgia and around the country are gathering at the Smithsonian Institutions in Washington, D.C., to learn how to keep local history from slipping through their hands.\n\nOrganized by the nonprofit group Heritage Preservation and the Institute of Museum and Library Sciences, the summit is a response to a discouraging survey conducted recently that demonstrated how fast America's historic archives are disintegrating. According to the survey:\n\n? More than half of the country's 30,000 libraries, museums and archives have had articles that were damaged by moisture.\n\n? 26 percent of collecting institutions have no environmental controls, including 40 percent of libraries.\n\n? 80 percent of collections have no disaster plan.\n\nThe lack of such emergency plans came into focus after Hurricane Katrina. \"I saw historical societies completely wiped out,\" said David Carmicheal, director of the Georgia Archives, who visited Mississippi after the flood. \"Those places will never really recover a sense of their history.\"\n\nBut everyday disasters may do the most damage.\n\nMoldy and crumbling\n\nSome maps from Georgia's gold rush days were stored in the glorified closet that's called the archives room at the Lumpkin County Library, until an air conditioner concealed above the acoustic tile ceiling began leaking.\n\nOn a recent muggy Friday in picturesque Dahlonega, information specialist Debra Capponi opened the door of the tiny storage room at the library and gestured to the boxes, documents, maps, scrapbooks and bound volumes stacked in every corner. \"It's looking good, believe it or not, compared to what we had before,\" she said.\n\nCapponi showed the stained and curled maps, portions rendered illegible by damage from dripping water. While the leak has been fixed and the moldy ceiling tile replaced, the maps need restoring, which neither Capponi nor anyone else at the library is trained to do.\n\nCapponi will learn about restoration at the summit in Washington. More important, she'll learn about applying for grants, organizing volunteers and developing emergency plans. Besides, when it comes to restoration, even more serious problems are at hand in Lumpkin County.\n\nIn another box are ledgers from a general store in Auraria, the boom town that popped up after gold was discovered in the Georgia mountains in 1828. A writer, in a loose, handsome script, records 1897 sales ? of coffee, eggs, butter, a hoe ? and notes payments (in the form of bags of gold.)\n\nSome of these ledgers, and others from the sheriff's department recording crimes from the 1880s and 1890s, are crumbling, the leather covers chewed by either animals or time, the pages a riot of colorful molds.\n\nElsewhere are scrapbooks from the 1950s, many of them prepared by tireless Dahlonega booster Madeleine K. Anthony. They document everyday life in the mountain town and helped convince state and federal officials of the town's historic significance. Unfortunately they were glued together with some corrosive compound and are also fading, while emitting a sharp smell of vinegar.\n\n\"We're going to lose a lot of this,\" said Capponi.\n\nSaved from trash bin\n\nThat Lumpkin County has so much to lose is due in large part to the redoubtable Anthony, who saved records from becoming trash when the old courthouse was turned into the Gold Museum. She stored documents in her house for 20 years, while barnstorming to raise funds for a new library.\n\n\"I think her beds were a little higher than usual for all the boxes stored underneath,\" said Sallie Sorahan, a Dahlonega retiree and volunteer, who catalogued the Anthony collection, which came to the new Lumpkin County Library after it was built in 1983. Anthony passed away in 1989.\n\nNot every county has a Madeleine K. Anthony. In LaGrange, courthouse records dating to the founding of the county were stored in an unheated outbuilding at the Troup County jail. \"I'm thinking it was a garden shed,\" said archivist Kaye Minchew. \"Archivists in Georgia love to talk about how 'my cockroaches are bigger than your cockroaches,' but I'm sure theirs were big enough.\"\n\nLuckily, historians and county officials came together, and, with the help of the Callaway foundation, created the Troup County Archives in a historic bank building, which now has about 12 million pages of records.\n\nMinchew, director of the archives, is also attending the summit, and plans to seek new ideas for funding sources.\n\nAnne-Imelda Radice, director of the Institute of Museum and Library Services, said the news from the survey is depressing, but the result of the study has been positive. \"It has galvanized us,\" she said. \"We've got a call to save our collections.\"\n\nhttp://www.ajc.com/\n\n\n\n\n------------------------------\n\nMessage: 20\nDate: Fri, 29 Jun 2007 14:49:07 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. FBI says secretary took Pearl Buck typescript. In\n\tthe case of the purloined Pearl S. Buck manuscript: The secretary did\n\tit.\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFC3.2000800@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nFBI says secretary took Pearl Buck typescript\nBy Andrew Maykuth\nPosted on Wed, Jun. 27, 2007\n\nIn the case of the purloined Pearl S. Buck manuscript: The secretary did it.\n\nU.S. Attorney Patrick L. Meehan disclosed in Philadelphia on Wednesday that a former personal assistant apparently stole the treasured manuscript of Buck's Pulitzer-prize winning masterpiece, The Good Earth, along with a trove of about 100 letters to Buck from world figures.\n\nIn announcing the recovery of the documents four decades after they mysteriously disappeared from the Nobel laureate's home in Bucks County, Meehan said no charges would be filed against a relative of the secretary's who took the papers earlier this month to a Philadelphia auction house to be appraised and sold.\n\nAn auctioneer at Samuel T. Freeman Co. alerted the FBI, and the consignor of the collection relinquished her claim of ownership after investigators told her the items were stolen.\n\n\"We do not believe there is criminal intent on the part of the people who turned the documents over to us,\" Meehan said.\n\nHe said Buck's former secretary, whom he declined to identify, was no longer alive. The documents apparently had been stored for many decades without her family's knowledge, said Robert K. Wittman, senior investigator with the FBI's Art Crime Team.\n\nMeehan and Jody Weis, the FBI special agent in charge of Philadelphia, lauded the recovery of the typewritten, hand-edited manuscript of one of the 20th century's most important novels, which won the Pulitzer Prize in 1932, was adapted into an Oscar-nominated movie in 1937, and was instrumental in Buck's winning the Nobel Prize for Literature in 1938.\n\nThe novel of family life in rural China introduced the Western world to the isolated nation, where Buck spent much of the first half of her life as the daughter of West Virginia missionaries. The book's huge success made Buck wealthy and set the stage for her later life as a humanitarian and pioneer in interracial understanding.\n\n\"It's a masterpiece of American literature,\" said Janet L. Mintzer, president and chief executive of Pearl S. Buck International, the philanthropy the author established and to which she donated much of her personal property. It is headquartered in Perkasie on Buck's farm, a National Historic Landmark that also contains the writer's gravesite and a museum in her two-story farmhouse.\n\nJanice Walsh, 82, the eldest of Buck's seven adopted children, who joined Mintzer on Wednesday at a news conference at the Federal Building, said she believed the manuscript and letters should be displayed at the Bucks County museum.\n\nBut ownership of the documents might be fiercely disputed.\n\nSince Buck's death in 1973 in Vermont and after six years of squabbling over several disputed wills, her heirs have clashed repeatedly with the foundation over ownership of her legacy.\n\nThe Pearl S. Buck Family Estate, headed by Edgar S. Walsh, 70, one of Buck's adopted sons, filed a claim June 12 with Meehan's office, asserting that it owns the manuscript and the letters. The estate controls the literary rights to Buck's works, which generate income for the heirs.\n\nEdgar Walsh, who is overseas and did not attend the news conference, said in a recent interview that the heirs might want to sell the collection to raise money. He cited the millions of dollars raised recently by the sale of the collected papers of Norman Mailer and the Rev. Dr. Martin Luther King Jr.\n\nBut last week the Bucks County foundation filed a claim of ownership of the recovered letters and other papers, Mintzer said. The nonprofit promotes international adoption and addresses issues of poverty and discrimination against mixed-race children in Asian countries.\n\nMintzer described the letters as \"a valuable addition to the Pearl S. Buck collection that will enhance our knowledge of Pearl Buck.\" She expressed hope that they would be exhibited at the Perkasie museum.\n\nMeehan said the FBI would retain custody of the manuscript and the letters until the parties, or a court, could determine ownership.\n\n\"We're hopeful the parties, the institution and the family can sit down and work this through themselves and create a method by which the documents can be retained so they can be available to future generations,\" Meehan said.\n\nWearing white gloves to protect the fragile documents, FBI investigator Wittman spread the papers on a table for display Wednesday.\n\nThe 400-page typescript, its pages yellowed and its edges worn, had been kept in a red Macy's Christmas box.\n\nThe trove included letters to Buck from luminaries such as former President Harry S. Truman, Eleanor Roosevelt, former Supreme Court Justice William O. Spielas and Jawaharlal Nehru, India's first prime minister. The correspondence, contained in a manila file that Buck had labeled \"famous letters,\" appeared mostly to be from the late 1940s.\n\nThe entire collection was in a worn, cloth-bound suitcase in which it apparently had been stored for four decades.\n\nThe letters may provide insights into Buck's life. A 1946 letter from Truman, for instance, apparently was a response to a note from Buck expressing concern about growing hostilities between America and the Soviet Union after World War II.\n\n\"Candor compels me to say that I cannot follow the reasoning which leads you to the conclusion that we are creating a situation which will bring about war with the USSR,\" Truman wrote before inviting her \"to have a full and frank talk.\"\n\nSeveral 1933 letters between Buck and her publisher, Richard Walsh - they married two years later and carried on a collaborative literary partnership until his death in 1960 - attest to the trust they had established, as well as an awareness of the historical value of The Good Earth manuscript.\n\nIn a handwritten letter to Walsh, Buck ceded him ownership of The Good Earth manuscript for safekeeping. In response, a surprised Walsh accepted, conditionally.\n\n\"But I do wish to say to you that I do not believe that valuable manuscripts should remain in the possession of any individual, or that they should be sold for profit at any time,\" he wrote. \"Therefore, I shall want to provide by some sort of documents, including my will, that the collection should at some proper time in the future be turned over to a library.\"\n\nhttp://www.philly.com\n\n\n\n\n------------------------------\n\nMessage: 21\nDate: Fri, 29 Jun 2007 14:49:53 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Italy returns stolen artifacts to Pakistan\nTo: Museum Security Network Mailinglist \nMessage-ID: <4684FFF1.6040808@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nItaly returns stolen artifacts to Pakistan\nwww.chinaview.cn 2007-06-26 06:55:49\n\nROME, June 25 (Xinhua) -- Italy Monday handed back to Pakistan a precious haul of stolen antiquities.\n\n   Italy's art police spotted the 100 or so figurines, bowls and terracotta works, some dating back to 5,000 BC, at a northern Italian antiques fair in 2005.\n\n   The vendor was trying to pass them off as earthenware from Thailand.\n\n   The police, helped by experts on Oriental art, succeeded in establishing the true provenance of the artifacts and their huge value, the local media reported.\n\n   Italy will send a team to Pakistan to help restore the artifacts.\n\n   Handing over the articles to Pakistani Ambassador Mirza Qamar Beg, Italian Culture Minister Francesco Rutelli said: \"Italy returns works to countries with legal title to them and wants to get its own works back from museums which have them\" -- a reference to a long-running dispute with the John Paul Getty Museum in California.\n\n   Rutelli said Italy had started talking to museums worldwide to secure the restitution of plundered artifacts.\n\n   \"Some of them have understood and are giving back what was stolen, while others have not understood.\"\n\nhttp://news.xinhuanet.com\n\n\n\n\n------------------------------\n\nMessage: 22\nDate: Fri, 29 Jun 2007 14:50:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Giro di prostitute e opere d'arte, cinque arresti\nTo: Museum Security Network Mailinglist \nMessage-ID: <4685001B.5030608@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nGiro di prostitute e opere d'arte, cinque arresti\n26 giugno 2007 - ore 2,50\n\nOperazione Eden, sgominata una organizzazione che sfruttava la prostituzione e rubava oggetti interesse storico ? archeologico. Cinque gli arresti.\n\nRecuperato il quadro di Sant'Antonio trafugato dalla chiesa di Sana Francesco a Capranica.\n\nAlle prime luci dell?alba di ieri ? scattata l?operazione Eden.\n\nI carabinieri della compagnia di Civitavecchia hanno arrestato di cinque pregiudicati della zona di Cerveteri, accusati dei reati di sfruttamento e induzione alla prostituzione e alcuni di loro anche di associazione a delinquere finalizzata al furto e ricettazione di opere d?arte o di interesse storico-archeologico.\n\nLe indagini, durate alcuni mesi, sono state condotte dagli uomini della stazione carabinieri di Cerveteri, coordinati dal procuratore capo Consolato Labate e dal Pm Margherita Pinto di Civitavecchia.\n\nHanno permesso di smascherare gruppo di persone che, come proprietari e/o gestori di due notissimi locali notturni il ?Geo Club? e l'?Eden?, reclutavano e sfruttavano la prostituzione di giovani ragazze, in gran parte dell?est europeo, per un giro d?affari di diverse centinaia di migliaia di euro.\n\nIl costo della prestazione nei locali notturni, era di 60 euro all'ora, e veniva poi diviso a met? tra la prostituta e i proprietari dei locali.\n\nDalle indagini, ? inoltre emerso che alcune persone coinvolte nel giro di prostituzione avevano partecipato ai furti di 38 opere d'arte.\n\nSono stati recuperati tra gli altro oggetti: il busto del Generale Masi, rubato dal Gianicolo; un prezioso quadro del 1600 di Sant'Antonio da Padova, due calici in argento, una patena in argento ed oro,  un cofanetto dorato, due teche antiche trafugati dalla chiesa di San Francesco di Capranica ad aprile del 2007.\n\nhttp://www.tusciaweb.it/\n\n\n\n\n------------------------------\n\nMessage: 23\nDate: Fri, 29 Jun 2007 14:50:40 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. Shallow Okeechobee reveals pool of artifacts\nTo: Museum Security Network Mailinglist \nMessage-ID: <46850020.9070905@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nShallow Okeechobee reveals pool of artifacts\nBY AUDRA D.S. BURCH AND KATHLEEN McGRORY\nkmcgrory@MiamiHerald.com\nWed. Jun. 27, 2007\n\nBELLE GLADE --\nThe epic drought gripping Lake Okeechobee has opened a mud-spattered window into Florida's prehistoric past.\n\nSince March, falling water levels have exposed 21 archaeological sites -- for now, the locations a secret to the public. Thousands of artifacts have been unearthed, including pieces of pottery, shell pendants, candleholders, arrowheads and fishing weights.\n\nHuman bones, too.\n\nArchaeological teams from the state and Palm Beach County are hunting for still more relics before the rains take hold and they are lost to the lake again.\n\n''It isn't exactly Indiana Jones,'' said Briana Delano, a state archaeologist.\n\nAnd yet, the endeavor evokes just that image.\n\nThe journey to the sites starts in an airboat. Outfitted with backpacks and small computers, the team -- airboat captain, archaeologist, intern and consultant -- ventures forth from a small dock near Belle Glade. They encounter otters, flamingos and the occasional bald eagle.\n\nSometimes, when the water level is too low, they take ATVs instead.\n\nThe sites are seven miles from shore. By midday, team members say, the sun is blazing. The mosquitoes are relentless. Archaeologist and crew wear high boots to protect their legs from cottonmouths and sawgrass, all the while hoping to avoid confrontations with gators.\n\nFor this muddy, mosquito-ridden labor of love, they can thank Boots Boyer.\n\nAlmost all his life, Boyer has cherished this great lake, and even as a boy from nearby South Bay, he fished and water-skied and camped at Lake Okeechobee.\n\nOne Friday a few months back, just as the sun began to fall, Boyer scoured the lake's southern shoulders -- normally under water -- for pond apple seeds. He's in the tree business. Boyer was under a canopy of trees and a thick coat of moonvine when he saw what appeared to be a shallow grave for gator and perhaps panther bones and broken brown pots, chunks as big as his hands.\n\nCurious, he drew closer. What he discovered were layers of history: a double-framed, 16-foot, catfish boat from the early 1900s; human bones and 2,000-year-old American Indian pottery and tools.\n\n''Awesome. Just awesome to find this kind of treasure,'' said Boyer, 36, a grower who specializes in tree restoration. ``I had seen bits of pots before, but nothing like this. It didn't take long before I realized I had happened on something significant.''\n\nExperts believe the lake was seven- or eight-feet deep in prehistoric times, as compared with the 16-foot depth the Army Corps of Engineers and the South Florida Water Management District try to maintain now.\n\nPalm Beach County archaeologist Chris Davenport says there was a large village of indigenous people in the area. They built earthen mounds on the water -- little artificial islands -- as fishing platforms and burial sites.\n\n''They died off from diseases long before the area was colonized,'' Davenport said of the early lake dwellers. ``We're hoping this will provide some insight.''\n\nThe discoveries have piqued the interest of the shore-dwellers, many of whom have watched the archaeologists' daily trips with curiosity and bemusement.\n\nFearing that the sites would be disturbed, leaders of the project have kept their location a secret and refused to let reporters look over their shoulders. And still, within days of Davenport's initial trip, several sites had been pillaged.\n\nAt one site alone, someone dug more than 30 gaping holes into the earth. It wasn't clear what, if anything, was stolen.\n\nSince then, the Florida Fish and Wildlife Conservation Commission has been charged with guarding the sites. Officers now patrol the lake bed from the sky and ground level.\n\nIt is illegal in Florida to take any ancient artifact from a historic site. At least three people have been arrested, said Jorge Pino, a conservation commission spokesman.\n\n''Some people have showed up at the site with shovels and pails,'' Pino said. ``Looking is one thing. Stealing is another.''\n\nAs the airboat captain, Boyer plays a pivotal role in the daily excursions. He is also an unofficial watchdog, patrolling the lake in an airboat, rifle in hand, ready to chase away thieves, vandals and the plain curious.\n\n''The lake is so special to me,'' said Boyer, who earned his nickname lumbering about in his daddy's rubber work boots. ``I didn't want to see anything happen to the artifacts.''\n\nPalm Beach County is the lead government in the archaeological mission. The state's role, in addition to issuing permits, is to safeguard any human remains and plot their whereabouts.\n\nThe state also informs local American Indian tribes when graves are found.\n\n''We like things to stay where they are,'' said Delano, the state archaeologist who specializes in human remains. ``When you excavate a site, you're actually destroying it. What you have on paper becomes your only record.''\n\nDavenport and his team are taking GPS readings at each of the sites. When they spot an artifact, they remove only a small sample and bring it to their West Palm Beach office for analysis. They don't dig. The clock is ticking, and they want to get to as many of the sites as possible.\n\n''We have to survey as much as we can before Mother Nature raises the level of the lake again,'' Davenport said. ``It's like a race against time to document what we can with the people that we have. Once the lake level rises, these artifacts will be lost again.''\n\nhttp://www.miamiherald.com\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 151\n****************************************\n\n"}