{"category": "ham", "to_address": "Joe Smith <unknown_kev_cat@hotmail.com>", "from_address": "\"Suraj N. Kurapati\" <skurapat@ucsc.edu>", "subject": "Re: BSD & MIT licenses compatible?", "body": "Joe Smith wrote:\n> \"Suraj N. Kurapati\" wrote:\n>> So when I appended bsd.c to mit.c, did the entire mit.c become \n>> licensed under both licenses?  That is, did the originally-MIT \n>> portions of mit.c inherit the extra condition from the BSD\n>> license?\n> \n> That is an easy way to view it. Technically, what you had said\n> before is perfectly correct, but thinking of the file as being\n> licenced under the combination of the conditions is also\n> perfectly valid (as long as you realize that if the parts are\n> seperated, the original lices still apply, of course).\n> \n> In summary, just make sure you meet all the terms of both, and\n> you are fine.\n\nTo further my understanding, please consider the following:\n\nSuppose that you take the original, pure versions of mit.c and bsd.c\nand combine them into a combined.c file, like this:\n\n  cat mit.c bsd.c > combined.c\n\nAfter receiving the combined.c file from me, you make some\nmodifications and save the file as combined1.c\n\n1. When you redistribute combined1.c, you have a choice of placing\nthe modifications under either BSD or MIT license, but not both.\n\n2. Whoever receives combined1.c from you still has the ability to\nextract the new (including your modifications) BSD or MIT portions.\n\n\nThe pattern I am seeing here is: \"united we stand, divided we fall\"\n\n[united we stand]: When we distribute a bunch of code, the\nconditions of all licenses that apply to that code must be satisfied.\n\n[divided we fall]: Once a person obtains the distribution and\nextracts the files, the code is once again separate (i.e. different\nfiles/portions of the code remain under different licenses -- as if\nnothing happened).\n\nSo the special case (application of conditions from all licenses)\nonly applies during distribution.\n\n\nIs this correct?\n\nThanks for your consideration.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}