{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "WHAT DID THE FDA KNOW ABOUT FOOD CONTAMINATION AND WHEN DID THEY KNOW IT?  ", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\nQUOTE OF THE DAY\"She had a pretty gift for \n      quotation, which is a serviceable substitute for wit.\" - W. \n      Somerset Maugham \n\nDID YOU KNOW?\"Rhythms\" is the longest English word \n      without the normal vowels, a, e, i, o, or u. \n\nTONIGHT ON THE CBS EVENING NEWSHere is \n      an early preview of what Awe are planning for tonight’s CBS EVENING NEWS \n      from Anchor and Managing Editor, Katie Couric… Hi \n      everyone, Hundreds of Americans have been sickened by – and some \n      have died from – contaminated spinach and peanut butter in the past year. \n      A report in today’s Washington Post revealed that the FDA has known \n      for years about contamination problems at the facilities that produced \n      these products. Nancy Cordes will have the full story, and we’ll \n      also take a look at whether the FDA has the financial ability to fix the \n      problem. Classes resumed today at Virginia Tech one week after the \n      shooting rampage that left 32 students dead. Sharyn Alfonsi has our \n      report from Blacksburg, Virginia. Jim Axelrod will bring \n      you the latest on Attorney General Alberto Gonzales, who has just received \n      another vote of confidence from President Bush. Gonzales has promised to \n      stay in his post as long as he can “continue to serve \n      effectively.”Politics has become a popular pastime in France. At \n      least 84 percent of the country’s voters cast ballots in the first round \n      of presidential elections. Now, it is down to two candidates with very \n      different visions for the country’s future. Sheila MacVicar will \n      report. Boris Yeltsin, the man who engineered the final collapse \n      of the Soviet Union and brought a market economy to Russia, died this \n      morning. Elizabeth Palmer will report on Yeltsin’s effect on \n      democracy in Russia. She’ll also give you a peek into some of the \n      lesser-known events of the former president’s life. Back in the \n      United States, a judge exonerated a man – after he had served 25 years in \n      prison. Jerry Miller had been found guilty of rape, robbery, aggravated \n      kidnapping and battery in 1981. Today he became the 200th prisoner \n      exonerated due to DNA evidence, according to a group that works to free \n      wrongly-convicted inmates. Byron Pitts will have the story. \n      The soundtrack of the young generation is hip-hop music – and its \n      biggest consumers are young white males. It is an industry where sex and \n      violence sell – but not everyone’s happy about that. Bill Whitaker \n      will examine the debate over vulgar, violent lyrics. Remember \n      those funky, flimsy 3D glasses from decades ago? NASA is bringing them \n      back. It has compiled images of the sun from two orbiters and laid them on \n      top of each other for a three-dimensional effect. Jerry Bowen will \n      give you a look. Thanks, and I hope you’ll join us. \n      Katie For more information on these stories, \n      please click on the following links: Classes Resume At \n      Virginia Tech Click Here Ex-Russian Leader \n      Boris Yeltsin Dies Click Here And here's a look at \n      one of the stories we’re working on for Tuesday’s broadcast:\nAt a CERTAIN Harlem charter school, math scores have shot through \n      the roof. We'll share their equation for success. That story and much \n      more, Tuesday, on the CBS Evening News. \n      If you would like more information on any of these stories or the \n      broadcast, please click on the following address and e-mail us: \n      evening@cbsnews.com \n\nTONIGHT ON DAVID \n      LETTERMANDave sits down with news anchor Brian Williams... \n      Don't miss a Top Ten List presented by former American Idol \n      contestant Sanjaya Malakar. Plus, comedian Steven Wright! \n\nTUESDAY MORNING ON THE \n      EARLY SHOWHarry Smith, Hannah \n      Storm, Julie Chen and Russ Mitchell anchor THE \n      EARLY SHOW from New York. Dave Price \n      will bring us the weather. Along with the top news of the day, \n      we will also have the following stories: A NEW TREND IN JOB \n      HUNTING: Applying for a job via video? It may not be as crazy as it \n      sounds. Video resumes are a relatively new tool, but recent surveys found \n      that a surprisingly high number of managers would consider viewing them if \n      an applicant did submit one. Video resumes could be of great value in an \n      increasingly competitive working world. CBS News Science and Technology \n      Correspondent Daniel Sieberg will join us with the latest. \n      SIMPLE SOLUTIONS: THINGS WITH DOUBLE USES: Everyday things \n      with a little thought can actually do more than their original purpose. \n      And the editors at Real Simple magazine are always looking for \n      double uses for everyday items. Tuesday morning, Kris Connell from Real \n      Simple magazine, will join us with a few of her favorites. \n      SECRETS OF SEXUAL ATTRACTION: Have you ever wondered if \n      there is any rhyme or reason why we fall for certain types of people? Have \n      you ever wondered why you keep dating the same \"type\" of guy or why you \n      were attracted to the man you eventually married? Well, there are a few \n      good reasons we fall for the men in our lives. So we decided to ask Kate \n      White, Editor-in-Chief of Cosmopolitan magazine, to help us figure \n      out why opposites can, but do not always, attract, and why a “slow-burn \n      love” may be the most surprising one of all. Tuesday morning, Kate White \n      will join us with secrets to sexual attraction that you won’t want to \n      miss. HOME THEATER: THE QUEEN: Led by the critically \n      acclaimed performance of Helen Mirren, The Queen was one of the \n      biggest sleeper hits of 2006. Tuesday, it makes its way to video stores. \n      EARLY SHOW Entertainment Contributor and \n      People magazine Assistant Managing Editor, Jess Cagle, will \n      join us with his review and all the inside details. SHAPE UP \n      JUST IN TIME FOR SUMMER: Minna Lessig’s new workout DVD, Tank Top \n      Arms, Bikini Belly, Boy Shorts Bottom will have everyone working their \n      way to tighter abs and a firmer backside. Tuesday morning, Minna will join \n      us once again; this time, to focus on bellies and bottoms and some great \n      exercises that are easy for you to do as summer quickly approaches. \n      WEDDING IN A WEEK: WEDDING FASHIONS: How can you find the \n      perfect wedding dress, groom’s suit as well as bridesmaids and groomsmen \n      attire? It’s easier than you might think. As we continue our special \n      Wedding in a Week series, renowned event planner Colin Cowie will \n      join us to take a look at the best options for our soon-to-be married \n      couple Lisa and Stephen. He will tell us all about the trends in wedding \n      fashions beginning with the bride’s beautiful gown. Colin and Lisa were \n      lucky enough to meet up with Mark Ingram in his New York City salon where \n      he made gown shopping a fun filled learning experience! If you \n      would like more information on any of these stories or the broadcast, \n      please click on the following address and e-mail us: earlyshow@cbs.com \n      \n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help \n      | Advertise | Terms \n      of Service | Privacy \n      Statement©MMVII, CBS Interactive Inc. All Rights Reserved. \n      \n"}