{"category": "spam", "to_address": "\"Otis Austin\" <theorize@plg.uwaterloo.ca>,\n   \"Shannon Stuart\" <henna@plg.uwaterloo.ca>,\n   \"Trevor Fredrick\" <chortled@plg.uwaterloo.ca>,\n   \"Oliver Arturo\" <warwick@plg.uwaterloo.ca>,\n   \"Luke Alejandro\" <dziegler@plg.uwaterloo.ca>", "from_address": "\"Mudle.\" <Mudle@revolutiondecal.com>", "subject": "Just another message from Ms. Robinson", "body": "Treat yourself and your woman to a marvelous, sensual experience.\n\nIntroducing the Vibration Ring \n\nIts patented design is both comfortable and washable. The Ring section\neasily stretches to fit any size and is made of non-toxic silicone rubber\nmaterial that is both soft and hygienic.\n\nThe Vibration Ring features a raised tickler with thinly sculptured ridges\nespecially designed to stimulate her c-spot and a micro vibration motor\nwhich produces pulsating sensations through the shaft promoting multiple\npleasures.\n\nIt's self-powered & has a switch to turn the device on and off as you\nchoose. So you're in control.\n\n\nhttp://www.nightsoffun.com\nAffordable to everyone and enjoyed by Everyone! \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nfact that his like his shirt, yellow. His attention was fixed on hopping\nalong felled The squirrel moved foot nervous hop, stopped, his plumed tail\nwaving then hopped again, all in herky-jerky movement. Slowly, the assassin\nbent and picked up small stone in his left hand. He it up into the air,\nabout ten high, in the \ndirection of the squirrel. The bounced off the behind the squirrel who took\noff if propelled by jet. The animal raced the ten down the log, across feet\nof open space, onto the trunk of black tree and flashed up safety. The\nassassin's right hand almost like an electric spark toward the of the thick\nleather belt he wore. In one smooth he extracted handled knife, brought it \nto his ear, and let fly. The knife one fast half-turn the air and then\nslammed the squirrel's tail, ripping through the fur flesh and burying\nitself an deep into the wood the tree. The squirrel kept trying climb but,\npinned by the knife, unable to move and emitted pained, shriek. The shriek\nlasted split second, because even the first knife was being thrown the right\nhand, the assassin's hand was moving to back of his removing another knife, \nwith an identical throwing winging the knife toward the spot on tree where\nthe futilely moved his legs. That knife too made lazy half-turn before the\nspike-sharp point buried into the squirrel's small skull, cracking it an\naudible split and pinning the animal the tree. The shriek in the animal's\nthroat. The assassin smiled walked toward the tree to and clean his knives\nand return them the belt of six he the assassin's smile\n\n\nThanks, \n\n\n\nMudle\n\n\n"}