{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Ronald Stephens <neglias@greggig.com>", "subject": "Penis power", "body": "\n\nCan you satisfy your girlfriend? Or you are afraid that she meets with someone who is better than you in bed?\nClick here to have a nice dick\nU can restore your health right now. Doesn't matter what the problem is - we have pills to cure everything. Erection Dysfunction, Weight loss, Anti-Depressants, Antibiotics and even more! \nBuy medications at RX online drug store!\nGet licensed mediations that you need!\nWith best regards,\nRonald Stephens\n \n \nNa etot raz my vospolzuemsia tvoimi sposobnostiami. Tak i sledovalo postupit. Ia umolk, soobraziv, chto perestaralsia. Esli tolko zasfernik ne reshit Vernutsia tem zhe sposobom, kakim togda unessia na shvatku s Drahubom bystree Vetra, inache dal-rokty poiaviatsia zdes ranshe ego. \nOdezhda zaskoruzla ot griazi, vmesto volos temnye sputannye kosmy, Hudosochnoe istoshchennoe lico pechat nishchety i goloda. To li eshche budet, hmuro predpolozhil ia. Onni Beltzhe, ne zamedliaia shaga, Reshitelno prosledovala dalshe. No ego Ulovka ne udalas ia ne tronulsia s mesta i uderzhal gotovuiu dvinutsia Nori. Fajl, prosvetivshij menia v mestnoj denezhnoj sisteme, ia Prochital eshche v Sudnom Dne, kogda prishlos rasplachivatsia za uzhin. Na svete sushchestvuet mnozhestvo sposobov uderzhat cheloveka tam, gde eto Neobhodimo. chto eto ty imeesh v vidu? Chto ia nedostojna?! Da kak ty. Samye prytkie pobegi, oprometchivo otorvavshiesia ot obshchej Massy i ustremivshiesia na osvoenie eshche ne zaniatoj territorii, v konce koncov Hireli i bezzhalostno podzharivalis na solnce. \nOni Mgnovenno sorientirovalis, otyskav menia vne kruga, i v obrashchennyh ko mne Vzgliadah chitalos bezmernoe voshishchenie, prichem sovershenno iskrennee, bez Vsiakih zadnih myslej i chuvstv, ia eto znal. Chto oznachaet tolko odno shefir znaet, gde my sejchas. Nebo, solnce, zemlia vse nikuda ne godilos. Bolshe net vremeni na boltovniu, Niks, muzykalnyj golos Nkota vraz Rasterial obertony, pridavavshie emu ocharovanie, i ego slepiashchij vzgliad zelenyh Glaz pogruzilsia v menia, zatmiv vse ostalnoe vokrug. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}