{"category": "spam", "to_address": "<mack@speedy.uwaterloo.ca>", "from_address": "\"Gladys\" <jsx@shaw.ca>", "subject": "healthful", "body": "\n\n\n\n\n\n\n\nI reply: Because of their tribal system, if you \nkill the leader, it is over. This duplicity is especially dangerous, given that many \nFrench-speaking African countries have majority-Muslim populations - Muslims who are \nnot anti-American. In contrast, West Africans know that their relatives imprisoned \nin the suburban slums of Paris or Lyon have no hope of getting ahead, but suffer \nrelentless discrimination.\nBut the winds of freedom have been blowing, often \nin unexpected places.\nFoccart was even more forthcoming in Foccart Parle: \nEntretiens avec Phillip Gaillard 1 which was published in 1995. Francis Nyamnjoh \nGeorge NgwaneGeorge Ngwane is a prominent author, activist and intellectual. Muslim \nor Christian, northerner or southerner, the one commonality I found among the people \nof Ivory Coast was that they all now hate the French.\n1, 60-74 (2006)] Early in October 1960, Dr. \nMeanwhile, the French know they're in trouble.\nBut the winds of freedom have been blowing, often \nin unexpected places.\nDo you have any intelligence?\nFormer lead guitarist of Rocafil, led by Prince \nNico Mbarga.\nBut things would not go as planned. Following \nstrong criticism of the law, the ruling party agreed to drop the controversial \nclause to encourage a positive view of France's colonial past. Implying none too \nsubtly that \"white powers should stick together, after all,\" they misread the times \nand they wildly misread America.\nI reply: Because of their tribal system, if you \nkill the leader, it is over. And Africans want real freedom this time, not French \ncolonization in disguise. This is the simple truth that the Security Council, ECOWAS \nand the African Union should understand, rather than blindly following President \nafter having for a long time monopolised exports and the retail trade. In Abidjan, \nin Ivory Coast, I even found myself in the unusual position of defending the French, \narguing that nobody could be as omnipresent and cagey as my local friend believed \nFrench agents to be.\nSurprised that anyone knew of his whereabouts at \nthat moment, Moumie left the table to answer the phone. As a result of the botched \noperation, the Swiss police quickly realized that Moumie was the victim of foul \nplay.\nWe will probably never know if this was a simple \nact of vandalism or yet another chapter in the decades-long attempt to erase the \nmemory of Felix Moumie and other historic leaders of the UPC. He did not touch his \naperitif.\nMeanwhile, the French know they're in \ntrouble.\nThe old devil knows and the entire world also knows \nthat the easiest way to bring down a black man, is to use another black \nman.\n"}