{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Cullen\" <qcog0-7pw@coldtaste.com>", "subject": "Your new line of credit has been approved.", "body": "\n\n\n\nNPP\n\n\n\n\n\n\n\n\n\n\nproducttestpanel@speedy.uwaterloo.ca, records show you have been granted a large line of credit.\nSee here\n\n\n\n\n\n\n\n\n\nThis email was sent by a third party on behalf of National Platinum Plus. National Platinum Plus does not have your email address. To stop receiving email regarding this ad only, visit this site or contact National Platinum Plus, Mail Center 2 Wisconsin Circle, Suite 700 Chevy Chase, MD 20815 Attn: Customer Care.\n\n\n \n\n\n \nThis offer comes to you from national Platinum Plus, the nations fastest growing providers of credit services. This offer comes to you from national Platinum Plus, the nations fastest growing providers of credit services. This offer comes to you from national Platinum Plus, the nations fastest growing providers of credit services. This offer comes to you from national Platinum Plus, the nations fastest growing providers of credit services. This offer comes to you from national Platinum Plus, the nations fastest growing providers of credit services. This offer comes to you from national Platinum Plus, the nations fastest growing providers of credit services. This offer comes to you from national Platinum Plus, the nations fastest growing providers of credit services. This offer comes to you from national Platinum Plus, the nations fastest growing providers of credit services. This offer comes to you from national Platinum Plus, the nations fastest growing providers of credit services. This offer comes to you from national Platinum Plus, the nations fastest growing providers of credit services. This offer comes to you from national Platinum Plus, the nations fastest growing providers of credit services. \ntrmedia11200703105\n\n\n\nNo More Mail\nor write to:\nStickRange\n\n1 Research Court\nSuite450\nRockville, MD 20850\n"}