{"category": "spam", "to_address": null, "from_address": "Zurich Lotterien <reiemedew@charter.net>", "subject": "CONGRATULATIONS!!! YOU HAVE WON ONE MILLION EURO.", "body": "Zürich Lotterien\nCentral Office.\n \nZürich Lotterien draws was conducted from an exclusive list of 20,000,000 e-mail addresses of individual and corporate bodies picked by an automated random computer ballot search from the internet as part of our international promotions program which we conduct every year. No tickets were sold.\n \nThis program is organized by the international lotto and games subcommittee, endorsed by the European lottery guild in conjunction with NGO organizations in Switzerland. \n\nAfter this automated computer ballot, your e-mail address attached to serial number 02-87-87 drew the lucky number 4-11-41-26-02-62, which consequently emerged as one of first ten (10) lucky winners in the United Kingdom category.\n \nYou have therefore been approved for a lump sum pay off of \\u20ac1,000,000.00 (One Million EURO) in cash credited to file ZL/07/4007. This is from total cash prize of \\u20ac50 Million Euro shared amongst the first fifty- (50) lucky winners all around the world. Your funds are now deposited in an offshore bank with a hardcover insurance.\n \nPlease note that your lucky winning number falls within our European booklet representative office in London. In view of this, our affiliate bank in the Europe would release your \\u20ac1,000,000.00 (One Million Euro) to you in the United Kingdom.\n \nTo claim your prize funds, you are required to come directly to our UK office for direct claim. If you have problems with coming to our office you can make a wire transfer of your funds to your private bank account. You can also employ the use of a courier service company to deliver your winning cheque to your home or office address.\n \nFor a telegraphic transfer of your funds to your private bank account, you are required to send your name and address in full, phone number, bank name, bank address, next of kin, account number, Swift/Routing/Sort Code, so as to facilitate the release of your funds to your stated bank account.\n \nFor a courier service delivery ,you are required to send your name, phone number, information of next of kin, mailing address(home or office address),  so as to facilitate the release of your Funds to your desired address.\n \nYou are required to send the necessary information as regards your chosen option to our help line below: \n\nZürich Lotterien\nInformation and Payment Bureau:\nLondon Representative Office\nHelp Service Contact\nE-mail:helpcontact@katamail.com\nYou will be assisted in the processing and remittance of your prize funds as regards your chosen option.\n \nNote that all prize funds must be claimed not later than 10 days. After this date all funds will be returned to the LOTTERY TREASURY as unclaimed. please endeavor to quote your Reference Number:ZL/07/4007 and Lucky numbers:4-11-41-26-02-62 in every correspondence with your help service. \n\nCongratulations once again from all members of our staff and  thanks for being part of our promotions program.\nMrs. Kirt Loberg.\nPromotions Manager.\nZürich Lotterien\n\n"}