{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "Louise Lawrence <yvvsj@cisp.spb.ru>", "subject": "EXPECT CLOUDY SKIES WITH LIGHT RAIN SHOWERS TO CONTINUE PUSHING IN FROM THE EAST.", "body": "ERMX Grabs Edge Of US Trade With China And Moves Into Nitride Devices!\n\nEntreMetrix Inc. (ERMX)\n$0.16\n\nCongress's push to increase trade agreements with China gives ERMX huge\nadvantage as they enter joint venture to manufacture Nitride Devices for\nmilitary, energy and technological solutions in China. This is huge. Get\non ERMX Monday!\n\nTHE PRIMARY HAZARD WILL BE CONTINUED HEAVY RAINFALL OF AN ADDITIONAL ONE\nTO TWO INCHES IN A SHORT PERIOD OF TIME. AREAS OF LOW CLOUDS AND FOG ARE\nQUICKLY DEVELOPING ACROSS MUCH OF NORTHEAST ALABAMA EARLY THIS MORNING.\nCLOUDY SKIES WITH A FEW SPRINKLES DEVELOPING THROUGH THE EARLY MORNING\nHOURS. PATCHY FOG WITH ISOLATED SHOWERS THROUGH THE EARLY MORNING HOURS.\nCLOUDY SKIES WITH A FEW SPRINKLES DEVELOPING THROUGH THE EARLY MORNING\nHOURS.\n\nCLOUDY SKIES AND LIGHT WINDS.\nAND ADDITIONAL RAINS WILL LIKELY RESULT IN PONDING OF WATER AROUND LOW\nLYING AREAS AS WELL AS STANDING WATER ON SOME ROADWAYS.\n\nIF TRAVELING THIS MORNING.\n\nGREEN AND WASHINGTON COUNTIES.\n\nTHE LOW CLOUD DECK AND AREAS OF FOG ALONG THE COAST LINE WILL CREEP\nWESTWARD AND SLIGHTLY SOUTHWARD THROUGH THE EVENING.\n\nAND ADDITIONAL RAINS WILL LIKELY RESULT IN PONDING OF WATER AROUND LOW\nLYING AREAS AS WELL AS STANDING WATER ON SOME ROADWAYS.\nRAINFALL AMOUNTS WILL BE UP TO ONE QUARTER OF AN INCH.\n\nTHE STEESE HIGHWAY FROM TWELVE MILE SUMMIT TO FOX WILL CONTINUE TO HAVE\nRAIN SHOWERS. CLOUDY SKIES WITH A FEW SPRINKLES DEVELOPING THROUGH THE\nEARLY MORNING HOURS. CLOUDY SKIES WITH A FEW SPRINKLES DEVELOPING\nTHROUGH THE EARLY MORNING HOURS.\n\nONE TO TWO INCHES OF RAINFALL HAS ALREADY FALLEN ACROSS PARTS OF GEORGE.\nCLOUDY SKIES AND LIGHT WINDS.\n\nTHE LOW CLOUD DECK AND AREAS OF FOG ALONG THE COAST LINE WILL CREEP\nWESTWARD AND SLIGHTLY SOUTHWARD THROUGH THE EVENING.\n\nDO NOT DRIVE YOUR VEHICLE INTO WATER COVERED ROADWAYS. THE RAIN IS\nEXPECTED TO CONTINUE TO DECREASE IN COVERAGE AND WEAKEN OVERNIGHT.\nTHE DEPTH MAY BE TOO GREAT TO ALLOW A SAFE CROSSING.\nSTRONGEST WINDS NEAR LYNN CANAL. PATCHY FOG WITH ISOLATED SHOWERS\nTHROUGH THE EARLY MORNING HOURS. This same information is available in\nother file formats including the XML based RSS and CAP formats. This\nfile is usually updated about every two minutes. IF TRAVELING THIS\nMORNING. DECREASING SLOWLY THROUGH THE NIGHT.\n\nTHE STEESE HIGHWAY FROM TWELVE MILE SUMMIT TO FOX WILL CONTINUE TO HAVE\nRAIN SHOWERS. MOSTLY NEAR THE ELLIOTT HIGHWAY. AND WELL INLAND EAST OF\nBARROW.\nTHE RAIN IS EXPECTED TO CONTINUE TO DECREASE IN COVERAGE AND WEAKEN\nOVERNIGHT.\nCLOUDY SKIES WITH A FEW SPRINKLES DEVELOPING THROUGH THE EARLY MORNING\nHOURS.\n\n"}