{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Maryanne Lehman\" <macccastondoc@ccaston.com>", "subject": "Losing weight has never been so easy", "body": "\nSummer is coming, time to tone up\n\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting product for over-weight people is now easily available – As were seen on Oprah.\n\n\nDo you remember all the situations when you asked yourself to do anything to get rid of this desperately growing pounds of fat? Happily, now no major offering is required. Thanks to Anatrim, the ground-shaking kilos-melting combination of elements, you can achieve healthier life style and a really slender figure. Just look at what people say!\n\n\n\n\"It’s rather difficult to confess but I was a junk food addict. \n\n\nI greedily swallowed up all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis torment stopped after I started course of taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my craving for food disappeared, \n\n\nmood increased and I turned to the happiest person 29 pounds in 2.9 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person!\"\n\n\n\n\n\nVictoria K., Las Vegas\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nYou can't even fancy how I detested being mocked at school. \n\n\n\n\nI abhorred my plumpness and I hated myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nIt literally dragged me out of this nightmare! The warmest thanks to you, fellows.\"\n\n\n\n\n\nSteve Doubt, Chicago\n\n\n\n\n\n\"Do you know what? Thanks to Anatrim my marriage was saved! I went into the circle, depression – eating more – more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nOne of my friends pointed at your site and I called for my pack of Anatrim right away. \n\n\nThe final result was excellent, my appetite came to normal level, I was in a good mood oftener, and, be sure, I tightened my belt with no regrets. And the bed became cool, too!\"\n\n\n\n\n\nRikky\n\n\n\n\n There is a lot of testimonials left by delighted people trying Anatrim. Why don't you add yourself to the tens of thousands of slender men and women and try this all-natural appetite-decreasing energy boosting product now!\n\n\nDo not miss your chance!\n\n\n\n\n"}