{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 83", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. The thief wanted tools and lawn equipment,\tnot King George\n      III-era furniture, jewelry and ornaments,\tdetectives said. So the\n      career criminal sold his million-dollar booty\tof English antiques\n      for a mere $300. (Museum Security Network Mailing list)\n   2. Pr?s de 60.000 oeuvres d'art vol?es recherch?es en Russie\n      (Int?rieur) (Museum Security Network Mailing list)\n   3. Les 2 auteurs du vol d'un monument ? Chaville sur le g?nocide\n      arm?nien mis en examen (Museum Security Network Mailing list)\n   4. Opere d'arte rubate in chiesa, 8 denunciati: anche negozianti\n      (Museum Security Network Mailing list)\n   5. Pakistan. Call for protection of Sindh's cultural wealth\n      (Museum Security Network Mailing list)\n   6. THIEVES who have preyed on Melbourne's Aboriginal art dealers\n      for the past two years have struck again.\n      (Museum Security Network Mailing list)\n   7. Bari: furti in chiese, ritrovate opere d'arte.\n      (Museum Security Network Mailing list)\n   8. Peru. Recuperan Cristo de bronce robado de iglesia en Pisco\n      (Museum Security Network Mailing list)\n   9. Is the U.S. Protecting Foreign Artifacts? Don't Ask\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Sun, 8 Apr 2007 16:47:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The thief wanted tools and lawn equipment,\tnot King\n\tGeorge III-era furniture, jewelry and ornaments,\tdetectives said. So\n\tthe career criminal sold his million-dollar booty\tof English antiques\n\tfor a mere $300.\nTo: \nMessage-ID: <001f01c779ec$c5f5c6d0$51e15470$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\n\nhttp://www.orlandosentinel.com/news/local/state/orl-vantiques0607apr06,0,370\n4791.story?coll=orl-news-headlines-state \nPricey antiques sold for $300: Thief busted\nLeon Fooksman\nSouth Florida Sun-Sentinel\n\nApril 6, 2007\n\nWEST PALM BEACH -- The thief wanted tools and lawn equipment, not King\nGeorge III-era furniture, jewelry and ornaments, detectives said. So the\ncareer criminal sold his million-dollar booty of English antiques for a mere\n$300.\n\nTwo months after a trailer carrying the 4,000 pieces disappeared from a\nhotel parking lot near West Palm Beach, authorities began recovering many of\nthe missing items from a Lee County home, a West Palm Beach warehouse, a\nRiviera Beach-area canal and empty fields off the Bee Line Highway.\n\n\"We thought this was a well-organized ring, but it turned out to be one of\nour local thieves looking for a trailer with lawn-service equipment that\ncould be taken to pawn shops,\" Palm Beach sheriff's Detective Walter\nRobinson said Thursday. \"These pieces were way out of his league.\"\n\nDetectives plan to bring theft charges against the man accused of stealing\nthe 16-foot-long, 9-foot-tall dark-blue trailer Jan. 23 from the Hampton Inn\non Vista Parkway South. They also will pursue charges against another West\nPalm Beach man who bought the antiques from the thief and sold many of them\nfor another $300 to a third man near Fort Myers.\n\nAuthorities declined to name the three men, saying their investigation is\nstill open. The original thief is in jail on unrelated charges.\n\nIt was the Fort Myers man, an electrical contractor, who broke the case,\nRobinson said. He called the collection's owner, Lake Forest, Ill.-based\nWellesley House Ltd., last week after realizing the value of the stolen\nitems. Andrew Vogel, the company's president, notified detectives who\nquickly connected the people involved in the theft. The items had Wellesley\ntags on them.\n\n\"We're blessed and very fortunate that it worked out the way it did,\" Vogel\nsaid.\n\nVogel's collection was taken while he was in Palm Beach County for the\nWinter Antique Show in West Palm Beach. When he looked out his hotel window,\nthe antiques from the 1700s to 1900s that took him 13 years to accumulate\nwere gone.\n\nInvestigators recovered a $22,000 tortoise shell vanity kit from 1820, a\n$15,000 tortoise shell stationery and folder set from 1860 and $2,300 Cuban\nmahogany candleholders from 1820. They found 11 oil paintings with beach\nthemes.\n\nBut several pieces of furniture, including ornate dressers, were destroyed\nafter they turned up in a canal in Riviera Beach.\n\nThe South Florida Sun-Sentinel is a Tribune Publishing newspaper.\n\n\n\n------------------------------\n\nMessage: 2\nDate: Sun, 8 Apr 2007 16:47:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Pr?s de 60.000 oeuvres d'art vol?es recherch?es en\n\tRussie (Int?rieur)\nTo: \nMessage-ID: <002301c779ec$c9261f30$5b725d90$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nPr?s de 60.000 oeuvres d'art vol?es recherch?es en Russie (Int?rieur) \n 21:48 | 06/ 04/ 2007  \n \n\nIAROSLAVL, 6 avril - RIA Novosti. Pr?s de 60.000 oeuvres d'arts vol?es font\nactuellement l'objet de recherches polici?res en Russie, a d?clar? le\nvice-ministre russe de l'Int?rieur Mikha?l Soukhodolski lors d'une r?union\norganis?e ? Iaroslavl avec des repr?sentants du minist?re de la Culture et\ndes sp?cialistes du gardiennage des mus?es.\n\nSelon M. Soukhodolski, le nombre d'atteintes port?es aux valeurs culturelles\nne cesse de cro?tre.\n\n\"Si en 2001, le pr?judice moyen caus? par un vol (de ce type) ?tait\nd'environ 500.000 roubles, en 2006, il a atteint 1,5 million de roubles\",\na-t-il fait savoir.\n\nD'apr?s lui, environ 50 vols commis dans les mus?es, salles d'exposition,\ngaleries d'art et archives sont enregistr?s tous les ans en Russie.\n\n\"Les vols se font de plus en plus astucieux, mieux pr?par?s et perp?tr?s\nsouvent avec la complicit? de conservateurs de mus?es. Ce dernier facteur\nles rend particuli?rement dangereux, car il faut parfois des ann?es pour\nd?couvrir le d?lit\", a ajout? M. Soukhodolski.\n\nSelon le vice-ministre, l'une des causes essentielles des vols d'oeuvre\nd'art r?side dans les d?fauts qui caract?risent leur gardiennage et leur\nrecensement.\n\nEn 2006, des autorit?s comp?tentes ont proc?d? ? l'inspection de plus de\n19.500 ?tablissements culturels. Elles ont constat? que 5.735 d'entre eux\n?taient gard?s par des unit?s parapolici?res, 450 par des structures\nrelevant du minist?re de l'Int?rieur, 5.106 par des concierges recrut?s\nparmi les employ?s de ces ?tablissements et 558 par des agences de\ngardiennage priv?es.\n\nCette inspection a permis de d?couvrir plus de 13.000 manquements aux r?gles\nde s?curit? ?tablies pour les sites culturels.\n\n\nhttp://fr.rian.ru/\n\n\n\n------------------------------\n\nMessage: 3\nDate: Sun, 8 Apr 2007 16:47:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Les 2 auteurs du vol d'un monument ? Chaville sur le\n\tg?nocide arm?nien mis en examen\nTo: \nMessage-ID: <002201c779ec$c90cf1e0$5b26d5a0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nLes 2 auteurs du vol d?un monument ? Chaville sur le g?nocide arm?nien mis\nen examen\n\n\nvendredi 6 avril 2007, St?phane/armenews\n\nphotos:\nhttp://www.armenews.com/article.php3?id_article=31002\n\n\nDeux hommes, soup?onn?s d?avoir vol? en octobre 2006 ? Chaville\n(Hauts-de-Seine) un monument de bronze, aujourd?hui d?truit, d?di? aux\nrescap?s du g?nocide arm?nien, ont ?t? mis en examen mercredi par un juge\nd?instruction de Nanterre et rel?ch?s sous contr?le judiciaire, a-t-on\nappris jeudi de sources polici?re et judiciaire.\n\nL?un des deux suspects, arr?t?s mardi, a reconnu les faits, selon une source\npolici?re.\n\nLe monument, une sculpture repr?sentant l?alphabet arm?nien coul?e dans 300\nkilos de bronze, avait ?t? dessoud?e et enlev?e dans la nuit du 13 au 14\noctobre 2006, deux jours apr?s le vote ? l?Assembl?e nationale d?une\nproposition de loi p?nalisant la n?gation du g?nocide arm?nien.\n\nLes enqu?teurs ont ?cart? toute motivation politique ? ce geste, qui a ?t?\ndict? par l?app?t du gain, selon une source polici?re.\n\nLe monument, d?une valeur de 50.000 euros selon la municipalit?, avait ?t?\noffert en 2002 ? la ville de Chaville par la communaut? arm?nienne en\nm?moire des rescap?s du g?nocide arm?nien.\n\nIl n?existe plus, puisqu?il a ?t? fondu dans une fonderie que les enqu?teurs\nont localis?e, a expliqu? une source judiciaire.\n\nLes deux suspects, ?g?s de 26 et 24 ans, sont des membres de la m?me\nfamille. Ils avaient d?j? ?t? interpell?s d?but d?cembre 2006 pour le vol de\ntuyaux de cuivre ? Issy-les-Moulineaux (Hauts-de-Seine). Au cours de leur\ngarde ? vue en d?cembre, ils avaient ni? leur implication dans le vol du\nmonument.\n\nIls ont ? nouveau ?t? interpell?s chez eux mardi ? Arcueil (Val-de-Marne)\npar le service d?partemental de police judiciaire des Hauts-de-Seine (SDPJ\n92), charg? de l?enqu?te.\n\nL?un d?eux a d?clar? avoir \"revendu au poids\" le m?tal du monument pour une\nsomme qui n?a pas ?t? pr?cis?e, selon une source polici?re. \"L?affaire n?est\npas termin?e\", a-t-on soulign? de source judiciaire, sans plus de pr?cision.\n\nLes vols de m?taux en France sont en forte hausse depuis l?explosion du co?t\ndes mati?res premi?res.\n\n\n \n\n\n\nR?agissez ? cet article    \n\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Sun, 8 Apr 2007 16:47:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Opere d'arte rubate in chiesa, 8 denunciati: anche\n\tnegozianti\nTo: \nMessage-ID: <002601c779ec$c9b73ba0$5d25b2e0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nOpere d'arte rubate in chiesa, 8 denunciati: anche negozianti \nL'inchiesta coordinata dalla Procura di Lucca e condotta dal nucleo\ncarabinieri tutela patrimonio culturale di Firenze\n\n\n07.04.2007 \nOtto persone sono state denunciate con le accuse, a vario titolo, di\nricettazione, incauto acquisto e alienazione abusiva di opere vincolate,\nperch? trovate in possesso di sette dipinti e una scultura in legno dei\nsecoli XVII e XVIII, per un valore complessivo stimato intorno ai 200 mila\neuro. Le opere erano state rubate o erano scomparse da chiese e conventi\ndelle province di Torino e Genova. L' inchiesta, coordinata dalla procura di\nLucca, ? stata condotta dal nucleo carabinieri tutela patrimonio culturale\ndi Firenze. Fra gli otto denunciati ci sono negozianti e proprietari delle\ncase in cui i militari hanno recuperato i dipinti. Le abitazioni si trovano\nnelle province di Lucca, La Spezia e Bergamo. Le indagini, coordinate dal\nprocuratore capo di Lucca, Giuseppe Quattrocchi, hanno permesso di\nrecuperare un busto in legno raffigurante San Silvestro Papa, un' opera del\nXVIII secolo rubata nella chiesa del Santissimo Nome di Ges? di Moncalieri\n(Torino) nel gennaio del 2002, e sette dipinti di grandi dimensioni, tutti\ndel XVII secolo, provenienti dal convento dei frati cappuccini di Genova\nSestri e scomparse alla fine del 2004. Il traffico illecito di opere d' arte\n? stato scoperto grazie agli accertamenti in negozi della provincia di\nLucca, svolti nell' ambito di una precedente inchiesta sempre sul mondo dei\nbeni culturali. I dati raccolti, confrontati con quelli della banca dati del\ncomando carabinieri tutela patrimonio culturale di Roma e delle\nsoprintendenze, hanno permesso di accertare la provenienza illecita delle\nopere.(ANSA). \n\n\n\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Sun, 8 Apr 2007 16:47:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Pakistan. Call for protection of Sindh's cultural\n\twealth\nTo: \nMessage-ID: <002401c779ec$c93a1c60$5bae5520$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nCall for protection of Sindh's cultural wealth \n \n \nBy our correspondent\n\nHYDERABAD: The Centre for Environment and Development (CEAD) has expressed\nconcern over the ongoing activity in the Pir Lakho graveyard, an\narchaeological site in Thatta district. \n\nIn a special meeting here on Saturday the CEAD representatives said the\nauthorities are engaged in the destruction of the archaeological sites. \n\nIt was decided that court would be moved to halt the damage being done to\nthe Pir Lakho site and a committee was formed to undertake preparatory work\nin this regard. \n\nThe CEAD representatives said theft of antiquities is increasing and the\nweak state infrastructure can neither prevent it nor it is able to punish\nthose engaged in this activity. \n\nThey said political will is required to save the cultural wealth of Sindh.\n\nThe CEAD representatives appealed to the authorities concerned in the pubic\nsector and Unesco to take notice of the ongoing mining/quarrying in the Pir\nLakho site in Thatta district. \n\nThey said environmental impact assessment, which is mandatory under the\nPakistan Environment Protection Act, 1997, should be undertaken in any such\nactivity. \n\nThe Antiquities Act, 1975 and the Sindh Cultural Heritage Preservation Act,\n1994 are considered quite effective and comprehensive and these should be\nimplemented in true spirit, they said. \n\nhttp://www.thenews.com.pk/\n\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Sun, 8 Apr 2007 16:47:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] THIEVES who have preyed on Melbourne's Aboriginal art\n\tdealers\tfor the past two years have struck again.\nTo: \nMessage-ID: <002001c779ec$c7348860$559d9920$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nAboriginal art shops burgled\n\nMark Buttler\n\nApril 07, 2007 12:00am\nArticle from: Font size: + -\nSend this article: Print Email \nTHIEVES who have preyed on Melbourne's Aboriginal art dealers for the past\ntwo years have struck again.\n\nTwo burglars struck at Kimberley Art in Flinders Lane in the city and\nanother in Armadale in the past week. \nThe thieves escaped with valuable artworks both times. \n\nIt is estimated the total value of artworks they have stolen since their\nspree began in December 2005 is now more than $500,000. \n\nIt is believed the men, who wear masks, got into one gallery by smashing the\nfront window. \n\nThat was the same method of entry used in other thefts. \n\nThe pair struck three times in January and February this year at High on Art\nin Armadale, the Aboriginal Gallery of Dreamings in Bourke St, city, and\nAboriginal Art Galleries of Australia in Spring St. \n\nHigh on Art was also burgled in 2005 and 2006. \n\nPolice earlier this year warned art dealers to watch for anyone trying to\nsell Aboriginal artwork.\n\nhttp://www.news.com.au/\n\n\n\n------------------------------\n\nMessage: 7\nDate: Sun, 8 Apr 2007 16:47:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Bari: furti in chiese, ritrovate opere d'arte.\nTo: \nMessage-ID: <002701c779ec$ca33e5b0$5e9bb110$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\n07 apr 07:07 \n Bari: furti in chiese, ritrovate opere d'arte \n\nBARI - I carabinieri del Nucleo tutela patrimonio culturale di Bari hanno\nrecuperato diverse opere d'arte rubate nelle chiese e in Enti pubblici del\nSalento. Una persona e' stata denunciata per ricettazione e detenzione di\nreperti archeologici. Tra i beni ritrovati, un crocifisso ligneo attribuito\na Vespasiano Genuino, un olio su tela attribuito a Jusepe De Ribera e dodici\nframmenti di affresco staccati da alcune cripte e databili tra il '400 e il\n'500. (Agr) \n\nhttp://www.corriere.it/\n\n\n\n\n------------------------------\n\nMessage: 8\nDate: Sun, 8 Apr 2007 16:47:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Peru. Recuperan Cristo de bronce robado de iglesia en\n\tPisco\nTo: \nMessage-ID: <002101c779ec$c8388ae0$58a9a0a0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nRecuperan Cristo de bronce robado de iglesia en Pisco \n \nOperaci?n policial hallo crucifijo con imagen de Cristo en bronce, que fue\nrobada del sal?n parroquial Juan Pablo II, en la ciudad ique?a de Pisco.\n\nUna r?pida intervenci?n policial permiti? recuperar una cruz de m?s de un\nmetro de altura, con la imagen tallada del Cristo Crucificado de bronce y\npedestal del mismo metal.\n\nSeg?n inform? RPP, pol?cias del sector Gonzales Posada, del Cercado de\nPisco, capturaron al autor del robo sacr?lego. Este fue identificado como\nMiguel Huam?n (38), alias \"Cacharpa\". \n\nEl detenido confes? haber vendido el objeto religioso a V?ctor L?pez (40),\nalias \"Cara de p?a\", que tiene una chatarrer?a. La cruz hab?a sido cortada\nen tres partes.\n\nHace unos d?as, un desconocido rob? una pintura de la catedral de la ciudad\nde Huancavelica cuando el sacerdote oficiaba una misa. \n\n\nEl cuadro, que representaba la cuarta estaci?n del v?a crucis de Jes?s,\ntiene un valor incalculable, y se encontraba en la nave izquierda del\ntemplo. \n\nhttp://www.peru21.com/ \n\n\n\n------------------------------\n\nMessage: 9\nDate: Sun, 8 Apr 2007 16:47:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Is the U.S. Protecting Foreign Artifacts? Don't Ask\nTo: \nMessage-ID: <002501c779ec$c9521130$5bf63390$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nApril 8, 2007\nIs the U.S. Protecting Foreign Artifacts? Don?t Ask \nBy JEREMY KAHN\nWASHINGTON\n\nTHE rumor swept through the aisles of the Seventh Regiment Armory in New\nYork as art dealers traded gossip with collectors: Dina Powell was going to\nChina. \n\nNormally a routine overseas trip by a government figure ? Ms. Powell is an\nassistant secretary of state ? would hardly warrant attention from experts\non Song dynasty ceramics or Buddhist statuary. But in their minds, this time\ntheir very livelihoods were at stake. The fear was that Ms. Powell, who\nheads the State Department?s bureau of educational and cultural affairs, was\ngoing to Beijing to announce a sweeping ban on the import of Chinese art and\nartifacts predating 1911. The Chinese requested the ban in 2004, arguing\nthat an insatiable American demand for such objects was spurring the looting\nof valuable archaeological sites in China. \n\nAs it turned out, the rumor was false: The State Department says that Ms.\nPowell is not planning a June visit, although it refuses to say when or how\nthe United States will rule on the Chinese request. But the panic sowed by\nthe gossip, in the midst of New York?s annual Asia Week sales last month,\nsuggests the high stakes riding on the American decision.\n\nAt the center of the controversy is not a ranking official but an obscure\nState Department advisory panel that has become the b?te noire of collectors\nof everything from Roman vases to African statuary. The panel, the Cultural\nProperty Advisory Committee, has been the focus of fierce battles between\narchaeologists, who say the art market fosters the looting of historic\nsites, and dealers, who say that broad import restrictions threaten\ncollecting by private individuals and museums in the United States. \n\nCongress established the committee in 1983 to balance the interests of these\nadversaries, deterring pillage abroad while also protecting the legal\nantiquities trade. But critics claim that it now tilts heavily in favor of\nthe archaeological lobby, even in cases when the foreign countries seeking\nimport restrictions have not met the criteria set down by the law.\n\n?I don?t think the committee has been fulfilling the intent of the original\nlegislation,? said Meredith Palmer, a Manhattan dealer in 20th-century art\nwho worked on cultural patrimony issues at the State Department in the 1970s\nand helped establish the Cultural Property Advisory Committee, known as\nC.P.A.C. \n\nKate Fitz Gibbon, a dealer of Asian art in Santa Fe, N.M., and a former\nmember of the committee, said some members of it now seem to have a\nfull-blown ?prejudice against collecting?: so much so, she argued in an\ne-mail message, that they seek to bend the law to ?meet a perceived need to\nend the trade.? \n\nJust how did an entity intended as a grand compromise and welcomed by\narchaeologists and dealers more than 20 years ago come to be seen as the\nenemy of the commercial art market? \n\nDealers and collectors argue that the State Department?s professional staff\nhas manipulated the nominations process in recent years so that a majority\nof committee members at any given time lean toward broad import\nrestrictions. Archaeologists counter that unscrupulous dealers are still\nonly too happy to profit from looting by selling items of ambiguous origins,\nand that import restrictions are an important tool for reining them in.\n\nAt the same time it is clear that recent restitution battles by countries\nlike Italy and Egypt have sensitized American officials and the public to\nthe principle of cultural patrimony, the idea that each nation has a right\nto possess and protect its historical treasures.\n\nThe United States government currently has agreements with 11 nations to\nrestrict the import of culturally significant artifacts. To this day it has\nnever failed to grant an initial request for import controls. \n\nBut current requests have collectors and dealers up in arms. They argue that\nChina?s petition is so broad that it would include 19th-century ceramics\nthat were mass-produced for export. And Cyprus is asking that an existing\nban on imports of Classical and Byzantine material be expanded to include\nancient coins, a category of artifacts that has not been included in other\nimport restrictions. \n\nMs. Palmer argues that Congress intended the committee to protect only the\nmost significant artifacts from pillage, not grant broad restrictions on the\nimport of entire categories of objects. James Fitzpatrick, a lawyer who has\nrepresented dealers and collectors before the committee, agrees. ?There is\nno attempt by C.P.A.C. today to differentiate between items of great\nsignificance and those that are produced in the hundreds or multiple\nhundreds of items,? he said. \n\nBut archaeologists say that the import restrictions have been critical in\nhighlighting the problem posed by looting. ?It has proven to be a fairly\neffective tool for raising awareness of looting because the U.S. is such a\nlarge art market,? said Ricardo Elia, an archaeologist at Boston University.\n\n\nRenata Holod, a curator at the University of Pennsylvania Museum of\nArchaeology and Anthropology, said many ancient sites in Iraq and elsewhere\nnow look like ?a moonscape? because of all the illicit digging. ?That is a\nfeature of the existence of a market in antiquities,? she said drily. While\nthe American restrictions do not stop pillaging completely, she added, they\ndo send a message to the rest of the world that the United States opposes\nthe destruction of other countries? cultural property. \n\nIn many cases, archaeologists say, Western museums have been willing to turn\na blind eye to murky provenances if they could get their hands on uniquely\nbeautiful or rare artifacts. In recent years institutions like the J. Paul\nGetty Museum and the Metropolitan Museum of Art have agreed to return\nobjects to their countries of origin after being confronted with evidence\nthat the artifacts had been exported illegally.\n\nBut dealers and museum curators reply that they oppose looting too, and that\narchaeologists fail to see that an object?s aesthetic value and its\nsafekeeping are at least as important as its cultural or historical\nsignificance. \n\nSome dealers say that archaeologists harbor class resentments of monied\ncollectors and are uncomfortable with the idea that history can have a\nprice. \n\n?In a lot of anti-collecting bashing or museum bashing that goes on there is\nalways a background of quasi-socialist sentiment,? said William Pearlstein,\na lawyer at Golenbock Eisenman Assor Bell & Peskoe in New York who has\nrepresented art dealers. ?You always hear archaeologists hissing about\nmoney.?\n\nThat collision of worldviews was on vivid display on March 15 in a\nconference room in Washington where the committee held a public hearing. The\nissue was an extension of import restrictions on objects from Guatemala and\nMali. Speaking in favor was David Friedel, an archaeologist at Southern\nMethodist University who has carried out excavations of Maya ruins there. \n\nWith barely restrained disgust he told the panel that a single Olmec\nserpentine figure might bring $70,000 at Christie?s auction house. Ripped\nfrom its context in a Maya tomb, however, its testimony to how the Maya\nvenerated the earlier Olmec civilization would be lost, he said.\n\nLater in the hearing Claire Hilmer, representing the nonprofit group Saving\nAntiquities for Everyone, expressed dismay at the high prices ancient\nstatuary from Mali brought at auction. That prompted pointed questioning\nfrom James Willis, a dealer in African art who is one of the sales experts\non the committee. \n\n?Do you think it is a good or a bad thing that these things are worth the\nmillions that you say they are?? he asked. ?If there were no international\nmarket and these wealthy people willing to spend this money on these\nfigurines, what would happen to them? If those objects had little to no\nvalue, do you think they would survive??\n\nUnder the current law a foreign nation must meet certain criteria to obtain\nrestrictions. It must document the extent to which pillaging jeopardizes\nimportant cultural sites and objects. It must provide evidence that it is\ncombating looting inside its borders. It must establish that the American\nmarket in these objects is large enough to warrant more control and that\nother methods to address looting are not available. And the law says that in\nmost cases import limits should be created only if other nations are\nimposing similar restrictions, so that American dealers and collectors are\nnot unfairly disadvantaged. The committee investigates whether these\ncriteria have been met and issues a recommendation to the State Department,\nwhich makes the final decision. The department almost never fails to follow\nthe recommendation. \n\nBy law the committee consists of 11 unpaid members appointed by the\npresident: three each from the art trade and archaeologists, three who\nrepresent the wider public and two who represent the interests of museums.\n\nBut this system has gone awry, according to dealers, collectors, former\ncommittee members and others familiar with the committee?s workings. While\nnominally balanced, they say, in practice a number of the museum and public\nrepresentatives on the panel have been drawn from the archaeological camp. \n\nFor instance, the most recent museum representatives on the panel both came\nfrom the Field Museum in Chicago. Unlike many other top museums in the\nUnited States, the Field sponsors archaeological digs and no longer\npurchases items on the art market. Asked about the balance on the committee,\nthe State Department referred that question to the White House. Citing a\npolicy of not commenting on personnel matters, a White House spokeswoman,\nEmily Lawrimore, declined to explain how the president chooses nominees.\n\n\nThe committee?s critics also say State Department lawyers have used\nconflict-of-interest rules to nudge the committee toward import\nrestrictions. James Lally, the noted New York dealer in Asian art, declined\na seat on the panel in 2000 after State Department lawyers told him he would\nnot be able to discuss or vote on any petition from a country in whose art\nhe traded. ?I was approved after a long process of investigation,? he said,\n?and then they said, ?Oh well, you cannot speak about any Asian art.? This\nmade less than no sense. This is a perversion of the intent of the law.? \n\nArchaeologists, on the other hand, have not been asked to recuse themselves\nfrom deliberations or votes involving countries where they have taken part\nin excavations. Yet dealers protest that these are also conflicts of\ninterest, since archaeologists must rely on the good favor of these foreign\ngovernments to receive continued permission to dig.\n\nThe committee has also been faulted for its secrecy. The State Department\nclassifies almost all material presented to the group to aid its\ndeliberations, including press clippings and information available on the\nInternet. It also withholds the original petitions for import restrictions\nthat foreign countries submit as well as the recommendations that the\ncommittee makes to the department. \n\nCommittee members are also told they cannot independently investigate the\nfacts related to a country?s petition or discuss the matter with outside\nexperts apart from those who appear at the committee?s infrequent hearings.\n\nPatty Gerstenblith, who is chairman of the Archaeological Institute of\nAmerica?s cultural property legislation committee and served as a public\nrepresentative on the committee from 2000 to 2003, said she saw good reason\nfor the secrecy. She said that as a committee member, she might have felt\ninhibited from speaking candidly in deliberations if she thought her\ncomments might later become public. \n\nShe also said information presented to the committee might, if released,\n?become a road map for looters? interested in pillaging sites. \n\nBut the committee?s current chairman, Jay Kislak, a real estate magnate and\ncollector of pre-Colombian artifacts, bristles at the secrecy under which\nthe State Department has the panel work. \n\n?In my opinion the restrictions, regulations and lack of transparency under\nwhich we are asked to operate in pursuing our duties at C.P.A.C. are to say\nthe least unusual, and in many cases they are unbearable, immoral and maybe\neither extra-legal or in contradiction? of the law, he said. \n\nC. Miller Crouch, deputy assistant secretary of state for educational and\ncultural affairs, said that the law that created the committee explicitly\nexempted it from public disclosure requirements that apply to similar\nfederal advisory committees.\n\nGiven the secrecy surrounding the panel?s deliberations, it is difficult to\npredict how the State Department will rule on China?s request. What is\ncertain is that the controversy over the committee is not going away. With\nlooting on the rise worldwide, according to Interpol, the number of\ncountries requesting import restrictions is only likely to grow, and the\nclash between archaeologists and collectors will continue. \n\nhttp://www.nytimes.com/\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 83\n***************************************\n\n"}