{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTHURSDAY 31 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER, KAVITA PURI\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nTORY U-TURN?\n\n\nThis weekend David Cameron called Tory MPs who disagreed with his policy not to have more grammar schools \"inverse class warriors\".\n\n\nBut today a senior Tory MP has said it could be possible to build more grammar schools in some areas. That's a u-turn! shouted Labour.\n\n\nThe Tories say it's existing policy - so who's right? \n\n\nThe Conservative's answer to grammar schools and aiding social mobility are city academies.\n\n\nBut we have evidence tonight that some academies are selecting by the back door and risk \"increasing social segregation\".\n\n\nBUSH AND CLIMATE CHANGE\n\n\nPresident Bush has unveiled his strategy on climate change ahead of next week's G8 summit. Tony Blair says \"it's a big step forward\".\n\n\nWe'll be assessing just how big it really is.\n\n\nAFGHANISTAN\n\n\nWe have a powerful film from Alastair Leithead on the often forgotten story of civilian casualties in Afghanistan.\n\n\nMADELEINE McCANN\n\n\nIt's four weeks since Madeleine went missing in Portugal. Her parents have cooperated heavily with the media to keep her in the public eye in the hope of finding her.\n\n\nBut some are beginning to feel uncomfortable about the campaign and the coverage it's been getting. Has the media been right in giving the story such prominence?\n\n\nWe've had an incredible response on our website to the question. You can join the debate here\n\n\nDo join Jeremy at 10.30pm on BBC TWO.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}