{"category": "spam", "to_address": "<kedda@flax24.uwaterloo.ca>", "from_address": "\"BioStem Annnouncement\"<lisa.lynch@leadtraffics.com>", "subject": "BioStem announces Cryobanks'International Licensing Campaign", "body": "\n\n\nBioStem announces Cryobanks'International Licensing Campaign\n\n\n\n\n\nBioStem announces Cryobanks'International Licensing Campaign\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nBTEM\n                                Announces: Cryobanks' International Licensing\n                                Campaign \n                                Propels Forward as Eight Facilities\n                                Are Now Under Contract; Campaign \n\n                                Targets 11 Additional\n                                Countries Producing Over $25M in Revenues\n\n\n\n \n\n\n\n \nATLANTA,\n                            GA--(MARKET WIRE)--May 23, 2007 -- BioStem, Inc.\n                            (OTC BB:BTEM.OB - News)\n                            announces: Cryobanks International (Cryobanks), which\n                            has agreed to be acquired by BioStem, Inc., has implemented\n                            an expansion to its global marketing campaign due\n                            to the heightened demand for licensing of its world-recognized\n                            cord blood technology. In addition to the eight facilities\n                            presently under contract, the marketing & sales\n                            campaign will now encompass over 11 countries with\n                            revenue projections exceeding $25M.\n\n \n\n\n\n\n \nCryobanks, which possess one of the world's largest\n                        cord blood stem cell inventories, intends to implement\n                        its cord blood technology through multiple international\n                        licensing agreements through representation by contracted\n                        industry experts. Through each licensing agreement, Cryobanks\n                        will receive large initial compensation as well as annual\n                        royalties.\nAccording to Cryobanks' CEO, Dwight\n                          Brunoehler, \"The\n                        overwhelming demand for the unique service that Cryobanks\n                        provides taxes our in-house staff to the limit. Having\n                        local representation on the ground in each targeted country\n                        will help to identify and prioritize our opportunities.\"\nAt the time of writing, Cryobanks has facilities in\n                        Athens, Greece and Delhi, India. Of the eight facilities\n                        under contract, the Bangkok, Thailand location is expected\n                        to open within the next 60 days. Detailed revenue breakdowns\n                        as well as progress updates covering the presently operating\n                        facilities will be released in the near future.\n \n\n\n \n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}