{"category": "spam", "to_address": "undisclosed-recipients:;", "from_address": "\"Mrs. Sara Berkley\" <saraberkley2@gmail.com>", "subject": "YOUR OVER DUE INHERITANCE FUNDS", "body": "FROM  PROFESSOR ANTHONY OKOLIE,\nFUND REMITTANCE DIRECTOR,\nCENTRAL BANK OF NIGERIA\nTE: +\nE-MAIL: infoaccessbankcustomercare_info@yahoo.com\n\nURGENT ATTENTION,\n\nYOUR OVER DUE INHERITANCE FUNDS\n\nTHIS IS TO NOTIFY YOU THAT YOUR OVER DUE INHERITANCE FUNDS HAS BEEN  \nGAZETTE TO BE RELEASED, VIA KEY TELEX TRANSFER (KTT) -DIRECT WIRE  \nTRANSFER TO YOU OR THROUGH ANY OF OUR CORRESPONDENT BANK NOMINATED BY  \nTHE SENATE COMMITTEE FOR FOREIGN OVER DUE FUND TRANSFER.\n\nMEANWHILE, A WOMAN CAME TO MY OFFICE FEW DAYS AGO WITH A LETTER,  \nCLAIMING TO BE YOUR TRUE REPRESENTATIVE. HERE ARE HER INFORMATION'S  \nFOR YOU TO CONFIRM TO THIS OFFICE IF THIS WOMAN IS TRULY FROM YOU OR  \nNOT SO THAT THE FEDERAL GOVERNMENT WILL NOT BE HELD RESPONSIBLE FOR  \nPAYING INTO THE WRONG ACCOUNT NAME:\n\nNAME JANET WHITE\nBANK NAME: CITI BANK\nBANK ADDRESS: ARIZONA, USA.\nACCOUNT NUMBER: 6503809428.\n\nPLEASE, DO RECONFIRM TO THIS OFFICE, AS A MATTER OF URGENCY IF THIS  \nWOMAN IS FROM YOU. YOU ARE REQUESTED TO FILL AND SEND THIS  \nINFORMATION'S FOR VERIFICATIONS PURPOSES SO THAT YOUR FUND VALID  \nUS$12.5M US DOLLARS WILL BE REMITTED INTO YOUR NOMINATED BANK ACCOUNT.  \nTHIS FUND IS AS A RESULT OF INHERITANCE ON YOUR BEHALF. INFORMATION  \nNEEDED FROM YOU FOR VERIFICATION IS AS FOLLOW:\n\n1. YOUR NAME:..............................\n2. YOUR FULL ADDRESS:...................................\n3. YOUR TELEPHONE ..................................\n4. FAX...................................................\n5. AGE..................................................\n6. SEX:....................................\n7. YOUR OCCUPATION:......................................\n\nAS SOON AS WE RECEIVE THIS, WE WILL COMMENCE WITH ALL NECESSARY  \nPROCEDURES IN OTHER TO REMIT THIS MONEY INTO YOUR ACCOUNT. THE CENTRAL  \nBANK GOVERNOR, EXECUTIVE, BOARD OF DIRECTORS AND THE SENATE COMMITTEE  \nFOR FOREIGN OVER DUE INHERITANCE FUND HAVE APPROVED AND ACCREDITED  \nTHIS REPUTABLE BANK WITH THE OFFICE OF THE DIRECTOR, INTERNATIONAL  \nREMITTANCE/FOREIGN OPERATIONS, TO HANDLE AND TRANSFER ALL FOREIGN  \nINHERITANCE FUNDS THIS FIRST QUARTER PAYMENT OF THE YEAR 2006.  \nHOWEVER, WE SHALL PROCEED TO ISSUE ALL PAYMENTS DETAILS TO THE SAID  \nMRS.WHITE, IF WE DO NOT HEAR FROM YOU WITHIN THE NEXT SEVEN WORKING  \nDAYS FROM TODAY.\n\nWE ARE SORRY FOR ANY INCONVENIENCE THE DELAY IN TRANSFERRING OF THIS  \nFUND MUST HAVE CAUSE YOU\n\nBEST REGARDS,\n\nPROF CHARLES SOLUDO\nCENTRAL BANK OF NIGERIA\nD/L:+\n\n\n"}