{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Jose Mayer\" <paxeoiservicetuf@eoiservice.com>", "subject": "Getting thinner can be enjoyable", "body": "\nSay goodbye to extra pounds\n\n\n\n\n\n\nAnatrim – The latest and most fascinating product for corpulent people available – As seen on Oprah.\n\n\nDo you count up all the times when you appeal to yourself to do anything for being delivered from this quickly growing number of kilos? Fortunately, now no great price is to be paid. Thanks to Anatrim, the earth-shaking pound-melting medley, you can achieve healthier mode of life and become really thinner. Just look at what our customers write!\n\n\n\n\"It’s difficult to confess but I was extremely addicted to food. \n\n\nI greedily devoured all this rubbish \n\n\nand could not stop. \n\n\n\n\nThis misery ceased when I started course of taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my inclination to eat constantly disappeared, \n\n\nspirits increased and I became the happiest person in the world 22 pounds in 2.3 months. \n\n\n\n\nI can tell you now I turned to the happiest person!\"\n\n\n\n\n\nAmelia B., New York\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nIt’s pretty hard to imagine how I hated being derided at school. \n\n\n\n\nI hated my stoutness and I abhorred even myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nIt literally pulled me out of this awful nightmare! A lot of thanks to you, guys.\"\n\n\n\n\n\nDave Klark, Chicago\n\n\n\n\n\n\"You know what? Thanks to Anatrim my marriage was saved! I went into the circle, depression – more eating – just more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOnce my friend pointed to your web site and I ordered Anatrim at the same time. \n\n\nThe result was excellent, my appetite became normal, I was in good spirits oftener, and, be sure, I went some belt holes back. And you see, the bedroom became cool, too!\"\n\n\n\n\n\nFrank\n\n\n\n\n There is a great number of gratitudes delighted people leave after trying Anatrim. Why don't you add yourself to the tens of thousands of slim women and men and try this natural appetite-decreasing power raising product now!\n\n\nDon’t miss the chance!\n\n\n\n\n"}