{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Jacob Schmude <j.schmude@gmail.com>", "subject": "Re: can speakup be used in bsd?", "body": "Hi\nThe short answer is that the BSDs are quite a bit different from  \nLinux, and that speakup will not work with BSD. I've provided more  \ndetailed responses under each of your questions.\n\n\nOn Jun 8, 2007, at 8:56 PM, Jeremy wrote:\n> . First of all, what are the biggest\n> differences between the bsd systems such as FreeBSD, NetBSD, OpenBSD,\n> and the linux distros, gentoo, debian, etc? From researching and\n> reading it seems that there are people that either love or hate one\n> or the other.\n\nNow, this is quite a large area for discussion. The biggest  \ndifference, as I see it having used both Linux and the avrious other  \nflavors of UNIX, is that BSD is an entire operating system (kernel,  \ntools, utilities, etc), while Linux is simply the kernel. The rest of  \nwhat most people consider \"Linux,\" is what a particular Linux  \ndistribution decides to provide. The basics are always the same, such  \nas some of the core unix commands like ls, cp, rm, mv, etc. However,  \nbeyond that, many things are specific to one distribution or another,  \nsuch as system maintenance tools, configuration file locations, the  \nway certain subsystems are configured by default, and things like  \nthat. Also, Linux is based almost entirely around the GNU project for  \nits utilities, while the various flavors of BSD are less so. For  \ninstance, in Linux most of your basic commands are provided by the  \nGNU project, via packages such as fileutils (for ls and similar). In  \nBSD, these basic commands are not written by the GNU project, rather  \nthey are either written or adapted from the original BSD by the  \ndevelopment teams. This usually isn't important to most people,  \nexcept for some slight syntactical differences in which command-line  \noptions are used and in what order arguments should be given. When  \nthese differences become important, however, is when you're trying to  \nexplore the system, and/or troubleshoot it. If you're using Linux,  \nyou have to worry about what distribution and all the factors that go  \ninto that. Among some of the lesser-used distributions, information  \nis not always as easy to find. In addition, the problem of different  \npackaging formats comes up much more often between various Linux  \ndistributions, as does the issue of binary compatibility (what was  \ncompiled for one set of libraries will not necessarily work with  \nanother version of the same libraries provided by another distribution).\nIn contrast, FreeBSD, NetBSD, and OpenBSD are operating systems, not  \ndifferent distributions of BSD. If you say you're using FreeBSD, then  \nthat's it. No worrying about distributions, libraries, binaries, and  \nwhere the files are located. You just need to look up information  \npertaining to the version of FreeBSD/NetBSD/OpenBSD you have, and  \nyou've got the information you need.\n> From a security standpoint, what is more secure?\nThat's a question not easily answered. Statistically, however,  \njudging by the amount of holes reported in one system or the other,  \nOpenBSD seems to have a slight edge so far in this field. It's the  \nsmallest and least hand-holding of the BSD systems, though there's  \nplenty of documentation if you want to use it. Incidentally, it's my  \npersonal favorite for servers, since if you know what you're doing it  \ndoesn't get in your way at all.\n>\n\n> Also,\n> if bsd is like linux, as it seems to be, could speakup ever be made\n> to work with it?\nThe current version of speakup couldn't just be ported over to BSD,  \nas speakup is a patch to the Linux kernel and the BSD kernels are so  \ndifferent that comparing them would be like comparing apples and  \noranges. I have no doubt that a screen reader like speakup could be  \nwritten for the various BSD systems, but you can't just run speakup  \non BSD.\nThis is not to say that BSD isn't useable the way Linux is. While  \nthere's no screen reader for the BSD command line (save for YASR  \nwhich I've seen no work done on in a few years), you can install BSD  \nvia serial console using a Linux computer over a serial connection.  \nThis renders the BSD installation process just as accessible as  \nLinux, and once you have the system running you can ssh into it from  \nthe network. As far as the GUI screen readers go, you can install  \ngnome on BSD easily enough and, so long as you have a speech engine  \nsupported that works on whichever BSD flavor you're using, the Gnome  \nscreen readers will work.\n\nWow, I'm out of breath now. Grin.\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}