{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Anthony W. Youngman\" <debian@thewolery.demon.co.uk>", "subject": "Re: Final text of GPL v3", "body": "In message <20070701175022.GB1055@dario.dodds.net>, Steve Langasek \n writes\n>Um, no.  \"You shouldn't have used GPLv3\" doesn't have any legal force to\n>resolve the inconsistency.  If I license my work under the GPLv3, I *as the\n>copyright holder* can still modify the terms of my code's license however I\n>damn well want, regardless of what the GPLv3 itself says about whether that\n>is permissible, because the GPLv3 is not binding on *me the copyright\n>holder*.\n>\n>If I go to the effort of writing\n>\n>    This program is Free Software: you can redistribute it and/or modify\n>    it under the terms of the GNU General Public License version 3 as\n>    published by the Free Software Foundation, with the exception that the\n>    prohibition in section 7 of the license on additional restrictions does\n>    not apply and the permission in section 13 is not granted.\n>\n>then I have *explicitly addressed* the clause in GPLv3 which purports to\n>prohibit additional restrictions.  Which statement is going to take\n>precedence?  At best I've created a lawyer bomb because my intentions are\n>not clear; at worst I've succeeded in licensing my code in a manner that's\n>incompatible with the GPLv3.  But that's exactly the same problem that we\n>had with GPLv2, so what was the point of adding this clause?\n\nAnd as I see it, if I say \"My program is licenced under GPLv3 with the \nfollowing exceptions ...\", if the user ignores the exception, they have \nbroken the terms I set for them to use the program, and the GPL doesn't \napply, so they can't take advantage of the clause allowing them to \nremove the exception ...\n\nAt the end of the day, the intentions of the licensor are important, and \nif those intentions are made explicitly clear, it's a bit difficult for \nthe GPL to contradict them.\n\nThe main effect of this clause will probably be to discourage people \nfrom doing this sort of thing - I'm not at all sure that clause would \nactually have teeth in a court of law.\n\nCheers,\nWol\n-- \nAnthony W. Youngman - anthony@thewolery.demon.co.uk\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}