{"category": "spam", "to_address": null, "from_address": "MR WILLIAMS SMITH SMITH <w.smith_g18@hotmail.com>", "subject": "URGENT HELP ", "body": "\n\n\n\nMR WILLIAMS SMITH TEL: +27-83-546-2533 FAX: +27-86-636-5957 PRIVATE e-mail:williams_smith1978@yahoo.comJOHANNESBURG SOUTH AFRICA\nATTN: MANAGING DIRECTOR,\n                                                                     URGENT HELP \nPLEASE NOTE: YOU CAN CONTACT ME THROUGH MY PRIVATE E-mail: williams_smith1978@yahoo.com\nDear Sir, I am writing you this letter with due respect and heart full of tears I need your help, I got your contact through the South African Information Exchange (S.A.I.E) here in South Africa and I decided to write for your assistance. For the purpose of introduction. I am Mr. WILLIAMS SMITH, 29 years old man, not married and the only Son of late Mr. GREEN SMITH and late Mrs. LEBO SMITH. My father (MR GREEN SMITH) was a very rich and wealthy Gold and Diamond Trader in JOHANNESBURG the REPUBLIC OF SOUTH AFRICA. I want to let you know that my late father was poisoned by his business associates while my mother died when I am little, and my father took me so special because I am his only son, before the death of my father on 2nd  march 2006 in JOHANNESBURG HOSPITAL, he told me that he has the sum of (US$14.5M Fourteen Million, Five Hundred Thousand United State Dollars) which he deposited in the Private Security company here in JOHANNESBURG. The fund was deposited in one box as a consignment and was declared as family treasure, with the Security Company to avoid seizure and also to avoid high demurrage from the Security Company. My late Father was a dealer of Gold and Diamond and he make this money there. He also told me that it was because of this money he was poisoned by his business partners while on a business trip with them and he instructed me to look for a foreign partner who will help me transfer this fund (money) out of republic of South Africa, and invest it for me, my purpose of contacting you is to  help me transfer this money to your country before this people who kill my father will kill me , this people who kill my father are after my life and they want to kill me and claim this money from me , that is why I'm  hiding my self here in South  Africa, so that they will not see me. Please I need your help urgently. I promise to give you 30% of the money for your help to transferring this money to your nominated bank account in your country ,Then while 10% will be set aside for local and international expenses and 60% will kept for me,  but you have to assure me that you will help me fully to transfer this money to your Bank account, l hope you will not betray the trust I have in you, because this money is my only hope in my life ,and moreover you will also help me to come over to your country were I will settle down for my life, and you will help me to invest this money in your country as one family. With the full trust and truth together with the bond of oath, for whoever betray other will face the judgments from GOD. This money is an inheritance from my late father. I am looking for your urgent reply, God bless you and your family Amen. Best regards, MR WILLIAMS SMITH.Hotmail to go? Get your Hotmail, news, sports and much more!   Check out the New MSN Mobile\n"}