{"category": "ham", "to_address": "debian-devel@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Wouter Verhelst <wouter@debian.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "On Thu, May 24, 2007 at 10:54:36AM -0700, Don Armstrong wrote:\n> On Tue, 22 May 2007, Sam Hocevar wrote:\n> >     3. Nexenta: Despite their incompatibility, Debian accepts both the\n> >  CDDL and GPLv2 as valid free software licences and would welcome any\n> >  solution to the distribution of a Debian system based on OpenSolaris.\n> \n> This is not the case, unfortunatly, and it really would be wise in the\n> future to consult with people who are familiar with the arguments\n> surrounding such licenses before expressing Debian's opinion to the\n> FSF.\n> \n> The CDDL's clause 9 is very much not appropriate for works in main,\n> and to the best of my knowledge, works licensed solely under the CDDL\n> have never been accepted in main.[1]\n> \n> To underline, the following clauses in the CDDL are problematic:\n> \n>    9. MISCELLANEOUS \n> \n>    [...]\n>    This License shall be governed by the law of the jurisdiction\n>    specified in a notice contained within the Original Software\n>    (except to the extent applicable law, if any, provides otherwise),\n>    excluding such jurisdiction's conflict-of-law provisions. Any\n>    litigation relating to this License shall be subject to the\n>    jurisdiction of the courts located in the jurisdiction and venue\n>    specified in a notice contained within the Original Software, with\n>    the losing party responsible for costs, including, without\n>    limitation, court costs and reasonable attorneys' fees and\n>    expenses.\n>    [...]\n>    You agree that You alone are responsible for compliance with the\n>    United States export administration regulations (and the export\n>    control laws and regulation of any other countries) when You use,\n>    distribute or otherwise make available any Covered Software.\n> \n> It's not appropriate for a Free Software license to require users of\n> software to give up rights that they would normaly have in their own\n> jurisdiction.\n\nI understand that argument, but I do think it requires a leap of logic\n(or at least some creative interpretation) to get from the DFSG to this\nposition. While I can see why some people do not want CDDL-licensed\nsoftware in main for the above reason, I do not think it is fair to call\nit the Debian position that this is the case; at least not yet.\n\nCounter-arguments:\n* The bit \"(except to the extent applicable law, if any, provides\n  otherwise)\" means you don't necessarily have to give up all your\n  rights. There are parts of copyright law in most jurisdictions that\n  give unalienable rights to users; those fall under the above\n  provision, by definition. The net result of your first clause\n  therefore may be, depending on circumstances, that users actually get\n  _more_ rights than what they started out with if that provision wasn't\n  there, because their own copyright law doesn't give them nearly as\n  much rights as the copyright law in the country where the software was\n  written would.\n* Your second quote is a non-issue. The same is true for GPL-licensed\n  software; if not, then why did we have to consult two lawyers back\n  when we moved crypto to main? And why do we still have such insane\n  procedures today when some crypto-using software gets through NEW?\n  (you don't see them because ftp-masters handle them, but they're still\n  there).\n\nAdditionally, personally I don't think it's unreasonable for people to\nsay \"if you use my software in a way that I didn't want you to, I'll sue\nyou in a court that works by a set of rules that I'm actually\ncomfortable with\". You know, it makes fighting those who do not follow\nyour license the way you intended them to quite a bit easier.\n\n-- \nShaw's Principle:\n\tBuild a system that even a fool can use, and only a fool will\n\twant to use it.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}