{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Dustin Henderson <isthisart@gravestock.net>", "subject": "Want to be a hero in bed?", "body": "\n\nCan you satisfy your girlfriend? Or you are afraid that she meets with someone who is better than you in bed?\nClick here\nWe have only high-quality national medications at low prices. There is no need for someone to know about your sexual problems. \nClick here to have a nice dick\nLicensed medications you can buy right now!\nWith best regards,\nDustin Henderson\n \n \nDva shaga, slovno dva pryzhka cherez bezdonnuiu propast, slovno dve Beskonechnye mili. Znachit, i vo vremia iniciacii Chto-to proizoshlo so vremenem. Kazhetsia, dazhe Chto-to razbil, chto pod ruku popalos. Ia otpravliaius za chuzhakom. \nVprochem, chto tam? Ia hotel by lichno vozglavit otriad presledovaniia. Uhodiat. On poproboval ujti iz-pod moih ruk ryvkom vniz, popytalsia sognut nogi I vyvalitsia iz szhimaiushchih ego tiskov, rvanutsia v storonu i vverh, a zatem Oprokinut menia nazad. Eto oni tak dumaiut. Vozmozhno, on ne dozhdalsia vsego kakih-to schitannyh dnej, ne Znaiu telo davno okochenelo, no razlozhenie ego ne kosnulos, chto moglo byt Svojstvami dannogo mesta. Vysokij toshchij parenek let trinadcati, na kotorom svetlyj ksomoh poslushnika Visel meshkom, Evrial, hvastun i zadira, uveriavshij vseh, chto ego zhdet nechto Osobennoe, medlenno podoshel k kraiu bolshogo kruga, raspolozhennogo v centre zala, Sharkaia sandaliiami po sherohovatomu polu, slovno k ego nogam byli podvesheny giri Katorzhnika. Ved sliianie prodolzhalos uzhe posle gibeli Nkota! Znachit li eto, chto kakim-to obrazom leshuk ucelel, pust i vne Fizicheskogo tela? Nkot? neuverenno pozval ia myslenno. Da nu tebia, Onni, vechno ty so !\nsvoimi nravoucheniiami. \nProshlo vsego neskolko sekund, i chelovek bezzvuchno ruhnul v zarosli Daleko pozadi nas, treska padeniia iz-za gula dvigatelia ia ne uslyshal. Esli ne bylo znamenij, esli Krug Prichastiia ne Zval tebia v svoe lono lichno, posylaia veshchie sny, da eshche otsutstvovali Priznaki To i nechego bylo tuda sovatsia v nadezhde na to, chto on vdrug priznaet tebia svoim Zabludshim synom. Za Pravo razdelat etogo malogo na otbivnye ia budu dratsia s kem ugodno. Chto molchish? Skazhi chto-nibud. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}