{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Yesenia Crosby <pellon@globalyachtcharters.com>", "subject": "Spermgun", "body": "\n\nThere is no need to let everybody know that you have health problems. \nClick here\nErectile Dysfunction is one of the most serious problems that a man can get in his life. The best cure nowadays are Viagra and Cialis.\nOur pharmacy\nInstant shipping worldwide! Confidential purchase!\nWith best regards,\nYesenia Crosby\n \n \nOhtan besstrastno vzglianul na mertvoe telo byvshego Zakazchika vozle svoih Nog, na ego diko oskalennyj rot, na korotkij izognutyj mech, votknuvshijsia v Shcheben riadom. Da-a, ne samyj podhodiashchij moment, da i perekusit bylo Nechem. Neozhidannaia, no svoevremennaia mysl zastavila menia dejstvovat inache. Civilizaciia Ottesnila etih zveriug v glub dremuchih lesov planety, no tak i ne smogla Unichtozhit polnostiu dazhe spustia tri stoletiia totalnogo istrebleniia. \nI chto dalshe? proburchal prygun, vytiraia lico rukavom zatertogo Plashcha. Prirost skorosti na tret sverh obychnoj, no Utomliaemost, k sozhaleniiu, vozrastaet vdvoe. Sejchas ty mne rasskazhesh, chto k chemu, i Potom ubirajsia ko vsem chertiam, priamo hot v ih liubimye bolota, i sidi tam azh do Samogo prihoda tmy. Ia hotel ee uvidet. Otkuda takaia Uverennost, chto ty ee ne vydash, esli ona tebia ne znaet? Celitel ulybnulsia: Nichego udivitelnogo. Eto moe delo, Bigman shest, spokojno vozrazil vtoroj. On i ranshe ne obladal vysokim mneniem ob umstvennyh sposobnostiah Plemiannika. Pary spirtnogo Privodiat nubesov v krajne vozbuzhdennoe i agressivnoe sostoianie, Za chto mne i Prihoditsia tut stradat. \nTut shalnoj okonchatelno soobrazil, chto proizoshlo, i vzgliad ego lihoradochno Zametalsia po zasnezhennomu lesu. Prover. I golos takoj golos ne mog Prinadlezhat chelovecheskomu sushchestvu. Zhelaiushchih porazvlechsia okazalos hot otbavliaj, no inogo ia i ne Ozhidal. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}