{"category": "spam", "to_address": "Gnitpick <gnitpick@flax24.uwaterloo.ca>", "from_address": "Tatiana Carroll <orders@gokinetic.com>", "subject": "Your dick is not only for pissing", "body": "\n\nGoing to have sex with two ladies at the same time? You need a strong erection, or they will have to satisfy each other. You really need Viagra!\nVisit us\nMake your dreams come true with licensed medications from Online Pharmacy! Any pills of your choice. \nClick here\nNo one will know that you are using medications.\nWith best regards,\nTatiana Carroll\n \n \nZato vozmushchennyj vopl tolstiaka-korda byl slyshen na ves traktir: Steregushchego na tebia net, Sudzhet! U menia zhe iz-za tebia many v Sferu ushli! Pod svist i uliuliukane bojcy soshli so shchita, peredav duelnye mechi Dozhidavshejsia svoego vyhoda sleduiushchej pare, zabrali u priiatelej prichitaiushchuiusia im Chast deneg iz obshchih stavok i v obnimku otpravilis k stojke, gde ih davno Podzhidal Puzatyj Bochonok Pora bylo promochit gorlo. Ne ozhidal ot tebia takoj pryti. I Vtoroj kto by mog podumat, sily Zla! nenavistnyj Bigman shest! Vse v tom Zhe nagluho zastegnutom plashche i durackoj shliape s shirokimi poliami, bez kotoroj Sheltiane muzhchinami sebia ne schitali. Kak ty eto sdelal, Zver tebia zavorozhi?! Sdelal chto? Nu priamo samo nedoumenie! Vot zasranep! Ego ulybku mozhno bylo skoree pochuvstvovat, chem zametit. \nNe hvatalo, chtoby eshche ty raznes menia na sotniu Malenkih celitelej. Skazat, chto posle toj derevni ia chuvstvoval sebia ploho, znachit nichego ne Skazat. Izvini, Nori, no eto dopolnitelnaia strahovka protiv gorodskih, Besstrastno poiasnil ia. Kogda on natknulsia na rossypi razdroblennyh kostej i dospehov, razbrosannyh Sredi ogromnyh, poluizedennyh magicheskoj kislotoj valunov, to ostanovil charsa i Nahmurilsia. Nu, klyki i klyki. Moj vnutrennij mir pod vzgliadom chuzhogo sezhilsia do razmera bulavochnoj Golovki. Da, Vpolne mozhet byt. Chto tam u nas est eshche? Sily Zla, udar Na tolkuchke! Kengsh upal zamertvo s nozhom v briuhe, prichem dlina u etogo Orudiia chelovecheskoj nesovmestimosti byla takova, chto ono vpolne moglo Protknut prostogo smertnogo naskvoz. \nMy kak raz prohodili mimo odnogo dostatochno blizko, Chtoby mozhno bylo rassmotret, i ia razvolnovalsia ne na shutku. Poetomu posle dolgoj i napriazhennoj pauzy ia ochen rovno Skazal: Uspokojsia, svetochtimaia. I snova ia byl prervan. Oshchushchenie bylo prenepriiatnym, budto lishilsia chasti samogo sebia. ejisuminyon VVFcRlhQUVh0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}