{"category": "ham", "to_address": "langa3@flax9.uwaterloo.ca", "from_address": "\"Windows Secrets\" <Editor@WindowsSecrets.com>", "subject": "A crusade against bad EULAs [Newsletter Comp Version]", "body": "\n\nA crusade against bad EULAs\n\n\n\n\n\n\nIf your software garbles this newsletter, read \nthis issue \nat WindowsSecrets.com.\n\n\n\n   \n\n\n\n\n\n\n \n\n\n\n\nYOUR NEWSLETTER PREFERENCES\nChange\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nLocale: United States 90210\nReader number: 83107-13329\n\n\n   \n\n\n\n\n\n   \n\n\n\n\n Home \n Newsletter \n WinFind \n Reviews \n Polls \n Contact \n \n\n\n\n\n This issue \n Past issues \n Upgrade \n Prefs \n Unsubscribe \n \n\n\n\n\n   \n\n\n\n\n\n   \n\n\nWindows Secrets Newsletter • \nIssue 110 • \n2007-06-07 • \nCirculation: over 270,000\n\n   \n\n\n\n\n\n\n   \n\n\n\n \nContents\n\n\nINTRODUCTION: Readers win a Housecall from Fred Langa\nTOP STORY: A crusade against bad EULAs\nKNOWN ISSUES: Get OEM discounts when you upgrade your PC\nWACKY WEB WEEK: See the end of the world in 90 seconds\nWOODY'S WINDOWS: Vista time-saver #7 — resize pictures quickly\nPERIMETER SCAN: Firefox is becoming a more important target\nKNOWN ISSUES 2: More ways to get Microsoft products discounted\n\nYOUR SUBSCRIPTION: How to change your address or unsubscribe\n\n   \n\n\n\n\n\n\n   \n\n\nFor links to every subtopic in this issue, scroll down to the \nIndex\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nForget Vista, make your XP system faster\nPC Pitstop's Optimize Scan 1.5 is easy-to-use software  that will automatically diagnose problems with your PC and give you a custom report detailing issues that are hurting your PC's performance. Run this free scan now!\nwww.pcpitstop.com\n\n\n\n\n\n\n\n\n\n \n\nDeep Six anti-spam appliance for SMBs\nPatented technology stops spam at the network edge. Designed for SMBs: the DS200 is the lowest cost, most accurate solution available. Easy to install and maintain. Recent firmware release features new Management GUI and enhanced tools. Try it risk-free.\nwww.tyrnstone.com\n\n\n\n\n\n\n\n\n\n \n\nLearn Windows Vista from A to Z\nMaster Vista with 19+ hours of video training that covers everything. Step-by-step instruction guides you through \nwhat's new in Vista, Installation, Group Policy, Security, Networking, Administration, IE7, and lots more. View our free demo now!\nwww.TrainSignal.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\n\nINTRODUCTION\n\n\nReaders win a Housecall from Fred Langa\n\n\n\n\n\n\n\n\n\n\nBy \nBrian Livingston\n\nIt's not every day that a motorcycle roars up to your house \nand its rider takes off his helmet to help you fix your ailing PC.\n\nBut that's the experience several lucky readers of the \nWindows Secrets Newsletter will have when Fred Langa, our editor-at-large, \nbrings his patented Housecall to their doors.\n\n\n\n\n\n\n\nMany applied, four were chosen\n\n\n\n\nI announced in the \n Apr. 19 newsletter that Fred (at left in riding gear) was taking a sabbatical. \nHe certainly deserves a break, after 10 years of writing for \nthe LangaList (and Windows Secrets, after the two newsletters \nmerged in November 2006).\n\nFor Fred, taking a break means riding his beloved motorcycle \nacross the United States and back across Canada. He said he'd \nchoose four readers to visit during his journey, tuning up their \nPCs and listening to their tales of woe with Windows.\n\nMore than 3,000 readers applied to receive a Housecall. Out of \nthe pleas that our readers submitted, Fred selected four \ncases where he thought he could be of help. The winners \nare:\n\n\nFranz Shattuck, Hillsboro, New Hampshire\n\nJohn Rice, Longmont, Colorado\n\nGene Foster, Tacoma, Washington\n\nDaniel Amsler, Mississauga, Ontario\n\nFred has promised to write columns explaining what he's found, \nstarting in September. Even if you didn't win a Housecall \nfrom Fred, you may very well learn something you didn't know. \nWe'll all be winners!\n\nBrian Livingston is editorial director of WindowsSecrets.com and the co-author of \nWindows Vista  Secrets and 10 other books.\n\n\nContents\n Index\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nBack up just got easier with Backup4all\nWhat happens when your hard disk dies? Will your business survive if your documents are lost? What about losing those precious photos of your children growing up? Back up with Backup4all to avoid such risks! Windows Secrets readers get a 25% discount\nwww.backup4all.com\n\n\n\n\n\n\n\n\n\n \n\nBackup your data with ZipBackup\nFinally, a backup program that is easy to use.  ZipBackup's Wizard makes backups a snap for beginners. Filtering,  scheduling, and disk spanning make it a powerful tool for experts. For a limited time, Windows Secrets readers receive 25% off.\nwww.zipbackup.com\n\n\n\n\n\n\n\n\n\n \n\n New add-on for parental control software\nNew software is a great addition to any parental control suite. BuyBlock \nprevents kids from shopping, filling out registration forms, and signing onto \nsocial networks. No setup or monitoring required. Get your free trial here!  \nwww.buyblock.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\nTOP STORY\n\n\n\nA crusade against bad EULAs\n\n\n\n\n\n\n\n\n\n\n\nBy\nScott Dunn\n\nFor at least a decade, InfoWorld veteran Ed Foster has been writing about the \nuses and abuses of end-user license agreements (EULAs).\n\nWhat began as examples of bad service \nagreements that were more funny than dangerous has become a crusade against \ncomplicated language and outrageous requirements and penalties. I talked to \nFoster about fighting the good fight.\n\n\n\n\n\n\n\n\nBad EULAs are anticompetitive\n\nFoster's chief gripe against EULAs is their anticompetitive nature.\n\n\"One of the most insidious clauses, and one that is always there, \nis the prohibition against reverse engineering,\" says Foster. \"Every software uses it.\" \n\n\nFoster cites the case of Blizzard v. BnetD, in which three programmers created an \nopen-source software product that allowed users to play Blizzard games on their \nown set of servers rather than on Blizzard's Battle.net \nservice. In this case, the court stood by the EULA and suppressed the BnetD \nsoftware, even though (as Foster \nreported), it does \nnot violate any copyright.\n\nThe problem is that \"the EULA doesn't define reverse \nengineering. It just stops you from studying the product to make a better one — \neven if you don't look at the code,\" says Foster. \"Just looking at what the software \ndoes can be considered reverse engineering.\"\n\n\n\n\nEULAs also censor consumer reviews\n\nOther EULAs attempt to censor users from \npublishing evaluations of the product. For example, a few years ago, Foster \ndocumented \na clause in the McAfee VirusScan license agreement that stated, \"The customer shall \nnot disclose the results of any benchmark test to any third party ... and will \nnot publish reviews of the product without prior consent from Network \nAssociates.\"\n\nFortunately, New York Attorney General Elliott Spitzer took McAfee \nto court and won.\n\nThat, however, has not stopped others (including Microsoft) from trying the same \nthing: The EULA for Vista Home Premium states that you have the right to conduct \nbenchmark testing and that \"you may disclose the results of any benchmark test \nof those components, provided that you comply with the conditions set forth at \n[Microsoft's  Web site].\" \n\n\nIn his column, Foster noted that \nalthough the terms are relatively reasonable, the EULA restriction itself is \ntied to a specific Web page that can be changed at any time. Moreover, he notes \nthat EULAs for other Microsoft products, like SQL Server or Visual C++, have been \nusing censorship clauses for years.\n\n\"Those clauses have never been enforced by the courts that I know of,\" Foster \ntold me. \"But they still have a chilling effect. Who wants to be the one to \nchallenge Microsoft?\"\n\n\n\n\nBad EULAs are anticonsumer\n\nEULAs aren't just bad for the software \nindustry. \"The basic EULA mentality makes it hard for the customer to know what \nthe real deal is,\" Foster says. \"What are the real terms of the deal? Do you \nhave a warranty? What kind? Are there any limitations on usage? Can you resell \nit?\" Consumers are expected to read thousands of words of legalese just to know \ntheir rights and limitations.\n\nAs an example of anticonsumer behavior, Foster recalls the EULAs in the case of \nGateway Computers, which was sued in 1995 for selling a computer with components \nthat were not as advertised. But as he noted in his\nMay 2005 \narticle, the arbitration \nclause of the license agreement required the parties to pay a nonrefundable \nUS$2,000 to involve an arbitration body in France — more than the original \nproduct was worth.\n\n\n\n\nEULAs attempt to legitimize spyware\n\n\n\n\"Probably the most outrageous example is the whole spyware phenomenon,\" Foster \nsays. \"If spyware had always simply been the criminals, the guys in Russia \npurveying software, it never would have become the problem it did.\"\n\nAccording to Foster, \nspyware became a problem because companies like Claria/Gator, WhenU, and \nDirectRevenue use EULAs to gain customer \"consent\" when installing pop-up adware.\n\nUnfortunately, most consumers aren't aware of the license or what its language \nmeans when they click their agreement to the license and installation.\n\nOne egregious example is the case of FriendGreetings.com, which required users to \ndownload and install a reader to see its electronic greeting cards. Customers \nhad to consent to two seemingly harmless license agreements, the second of which \nstated that the company would be using the customer's Outlook contact list to \nsend encouragements to download the software.\n\nAs if accessing your Outlook contact list wasn't enough, Foster reported in a \n\nNov. 1, 2002, article that the \nsoftware \"also apparently deposited several spyware/adware agents that needed to \nbe sought out and eradicated before they caused trouble.\"\n\nIn a  Dec. 2004 article on \nthis subject, Foster composed what he would consider an honest adware notice:\n\n\n\"Warning: This program will display innumerable pop-up ads over content you \nmight wish to see. It will watch what you do on the Internet and report that \ninformation to people of questionable motives. It might automatically download \nadditional software from other parties that will also display ads and/or collect \ninformation about you. Installing this program will thus inevitably degrade the \nperformance of your computer until it's a useless piece of garbage. Do you \nagree, bozo?\"\n\n\n\n\nAre EULAs even necessary?\n\n\n\nFoster has never understood the need for a \nlicense agreement. \"Copyright law applies to software whether you have a EULA or \nnot,\" he points out. \"You don't need a EULA to keep people from infringing on \nyour copyright. The documents are trying to make us all become lawyers in order \nto buy software. At the same time, it's not really doing \nanything to protect the basic copyright on the software, which would be there \nregardless.\"\n\nHis contention is supported by \nCircular 61 from the U.S. Copyright Office, which states that \"copyright protection \nextends to all the copyrightable expression embodied in the computer program.\" Naturally, \nsome aspects of software (like ideas and logic) cannot be copyrighted, but that holds \ntrue for books and all other copyrightable products as well.\n\nFoster has written more on this topic on his \n Gripe Line site.\n\n\n\n\nWhat can be done?\n\n\n\nLucky for us, Foster has not sat around waiting for others to improve the \nsituation. He belongs to Americans for Fair Electronic Commerce Transactions \n(AFECT), which is associated with the \nFairTerms Web site, and has joined \nforces with those trying to block industry-supported legislation like UCITA \n(Uniform Computer Information Transactions Act) that would give EULAs even more \npower.\n\nIn addition, he started a \nWiki site \nwith a EULA library, where users can post examples of good and bad EULAs. He \nhas also \n drafted a FEULA, or fair EULA, to serve as a model for \nsoftware developers.\n\nBut what should the rest of us do? I asked Foster what \nhe thought of EULA analyzing tools, such as the free \n  EULAlyzer from \n Javacool Software. \nEULAlyzer looks for keywords and attempts to alert the user to undesirable behavior \nor unexpected requirements in the license. \"Conceptually, I think it's certainly \na good idea,\" he said. But, he adds, it depends on what issues the analyzer \nis looking for.\n\nIn addition, \"if the EULAlyzer finds one way of phrasing it, they \n[software companies] will find another way to phrase it. They can make them as \nobscure as they want to, and they do.\"\n\nAnother way to avoid \nproblem agreements is to use open-source software, a practice Foster has \nadvocated in his column:\n\n\n\"Open-source equivalents for most major types of productivity applications are \navailable and mature enough to use; the rest are maturing quickly. Some are \nsurpassing their closed-source counterparts,\" he writes. \"I pretty much never \nbuy software any more myself, despite having a Windows box — where possible, I \nuse free software, with the only real exception being blockbuster games.\"\n\n\nConsumers need to be more vocal. \"I don't believe everyone should \nalways be forced to read the EULAs they encounter in daily life,\" Foster told \nme. \"We'd spend most of our lives reading obscure language. If you see a company \nthat's asking you to read 10,000 words of gobbledygook, tell them no, you don't \nwant to. As consumers, try to push back.\"\n\n\n\t\t\t\tReader, please rate the above article:\n1: Poor \n\t\t\t\t2: Fair \n\t\t\t\t3: Good \n\t\t\t\t4: Great  5: Superb\n\n\n\nScott Dunn is associate editor of the Windows Secrets Newsletter. He is \nalso a contributing editor of PC World Magazine, where he has written a \nmonthly column since 1992, and co-author of \n 101 Windows Tips & Tricks (Peachpit) with Jesse Berst and Charles Bermant.\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nGet your product seen by 270,000 readers\nDoes your company offer a product or service? Now you can place an ad in the Windows Secrets Newsletter and be seen by more than 270,000 active buyers of PC hardware and software. Bid as much or as little as you like to get the ideal ad placement.\nwww.WindowsSecrets.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\n\nKNOWN ISSUES\n\n\n\nGet OEM discounts when you upgrade your PC\n\n\n\n\n\n\n\nBy \nScott Dunn\n\nThe \n\nMay 24 issue \ncontinued our discussion of OEM software, explaining that any hobbyist can be \na system builder and buy these products at a discount.\n\nAdditional documentation from Microsoft's Web site makes it even more clear \nthat you neither need to build a computer from scratch nor join \nthe Microsoft Partner Program to qualify for the lower prices.\n\n\n\n\n\n\n\nOEM Preinstallation Kit (OPK) not always required\n\n\n\nThe \n\nMay 24 issue suggested that if you buy a single copy of the OEM \nversion of Windows, you need to join the Microsoft Partner program to obtain \na special kit to install it. But reader Sean Toner writes in with a correction:\n\n\n\n\"You are correct that a 1-pack Vista OEM package does not include the \nOPK.\n\n\"However, according to the OEM License, the requirement to use the OPK \napplies 'when \nyou distribute an individual software license for a desktop operating system.' \nBut presumably the requirement does not apply to an enthusiast who installs OEM \nVista on a single machine for his own use.\n\n\"Also, I understand that a 1-pack Vista OEM DVD will install itself \nquite easily without requiring the use of the OPK.\"\n\n\nWhat you say makes perfect sense, Sean! Thanks for pointing out this \nlanguage in the\n OEM license agreement. There seems to be little reason for the average \nhobbyist who is building his or her own system to join the Microsoft Partner \nProgram or download the OPK.\n\n\n\nRefurbishers are also 'system builders'\n\n\n\nConcerning the topic of who qualifies as a \"system builder\" \nand, therefore, for an OEM discount, Chris Miller writes:\n\n\n\n\"Good article on Microsoft's OEM licenses. I wonder how much of a system I would \nneed to build before I could qualify as a 'system builder.' I've never built a \nsystem from the ground up — motherboard, CPU, disk drive, etc. — because \nI don't consider this a profitable use of my time, but I've changed most of \nthese components at one point or another.\n\n\"If I wanted to upgrade my Windows XP system to Vista, I'd certainly need a new \nhard drive and graphics card (probably memory, too). Leaving aside the question \nof 'how would they ever know?', would such a change be sufficient to make me a \n'system builder'? Or do we need a court case to decide?\"\n\n\nThe OEM license agreement defines a \"system builder\" as \"an assembler, \nrefurbisher, or pre-installer of software on computer systems.\" The license does \nnot define \"refurbisher,\" but another Microsoft document (in Acrobat PDF format) \nfrom the Microsoft Partner Program site, the\nChannel \nDiscussion Guide, states that \"Refurbished PCs are those PCs where the \ncomponents have been changed or upgraded\" (page 2).\n\nCertainly, that would include \nchanging any of the components you listed. See the item below for more \ndetails.\n\n\n\nRepairing a broken PC doesn't invalidate OEM license\n\n\n\nReader Brett Sheaffer is concerned that he might have discovered another \nrestriction on OEM software:\n\n\n\n\"I just called a Microsoft representative last week to ask the pros and cons \n(straight from the horse’s mouth!) of OEM vs. retail versions of Windows. I \nwas considering signing up for their Partner Program (as a 'system builder') in \norder to save money by using the OEM versions.\n\n\"One of the limitations I was made aware of (that so far has turned me off to \nOEM versions) is that once the OEM software is installed, a new license or disk \nmust be purchased if any one of these components fail and need to \nbe replaced: motherboard, hard drive, or processor.\n\n\"For large system builders who turn a good \nprofit and can buy OEM disks in quantity while providing warranty support to end \nusers, that isn't so much an issue. But for small 'hobby' builders like me who \nbuild only a few per year, there is 'insurance' in buying the retail \nversion!\"\n\n\nBrett, I think you may have misunderstood what the representative told you (or \nthe rep simply got it wrong). To begin with, I can find no mention of this \nlimitation in the OEM license agreement.\n\nMoreover, Microsoft has addressed this issue in the\n\nChannel Discussion Guide (the full title being \"Discussion Guide: \nClarifying Proper Windows Desktop OS Licensing\"). Page 2 clearly states \nthat \"If the motherboard is being replaced because of a defect, a \nnew OS license is not required.\" [Emphasis added.] \nThe only time a new OS license is required is when \nhardware refurbishing is done for reasons other than a defect (for example, \nadding memory or getting a faster motherboard).\n\n\n\nZoneAlarm is still not Vista ready\n\n\n\nRegarding the security products we listed in the \n\nMay 24 issue, a number of \nreaders echoed the concern expressed by reader Alan Horton:\n\n\n\n\"I am surprised that you still have the ZoneAlarm Security Suite in your \nSecurity Baseline, as it does not yet support Vista.\"\n\n\nIt is an unfortunate fact that many ZoneAlarm products, including the ZoneAlarm \nInternet Security Suite, are not yet available in a Vista-compatible version. \nHowever, the company promises free Vista updates as soon they do become \navailable. The ZoneAlarm\n Web site states, \"ZoneAlarm products are eligible for a free Vista \nupgrade when it is released as part of a 1-year update program.\" But \nthat's a small consolation for those who've been waiting for an update \nfor several months.\n\nFor those who want a Vista-capable security solution now, the runner-up we\nmentioned in the article, Norton Internet Security 2007, supports Windows Vista \nas of February 2007, according to the product\n FAQ.\n\nIn the paid version of today's newsletter, you'll find more solutions to \nsubscription subterfuge, the topic of our\nMay 17 story \non companies that automatically sign you up for credit-card renewals. \nYou'll also find a new way to save big on Microsoft \nsoftware via the Microsoft Partner Program.\n\n\nContents\n Index\n\n\n\n   \n\n\n\n\n   \n\n\n\nTELL A FRIEND\n\nHow you can share this information\nWe love it when you send your friends links to our articles. But please don't \nforward your copy of our e-mail newsletter to people, which subjects us to spam \ncomplaints. Instead, simply suggest that your friends visit this issue's permanent \nWeb address, shown below. A complete index at the bottom of the \nWeb page provides you with hyperlinks to any article you'd like to recommend.\n\nThe address of this issue is http://WindowsSecrets.com/comp/070607\n\n   \n\n\n\n\n   \n\n\n\n\nWACKY WEB WEEK\n\n\nSee the end of the world in 90 seconds\n\n\n\n\n\n \n\n\n\nSome say the world will end in fire. Some say in ice.\nOr at least that's what Robert Frost wrote. The truth is nobody knows how \nthe world will end. Still, that doesn't stop people from speculating.\n\nOne of the more amusing versions comes from the Flash artist known as \nFluid. You can check out his Doomsday scenario at\nAlbinoBlackSheep.com. Please be aware that the animation contains adult \nlanguage and national stereotypes that will be offensive to some \nreaders, hilarious to others. \n\nWatch the animation\n\n\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n   \n\n\n\n\nEDITOR'S BOOKSHELF\n\n\n\n\n\n\n\n\nGet the tips you need about Windows Vista\n\n\n\nThe all-new Windows Vista Secrets helps novices \nand experts alike understand Microsoft's latest operating system. \n\"To really appreciate what is in Vista, you almost \nneed to read through the leading book on the product, Windows Vista \nSecrets, by Brian Livingston and Paul Thurrott,\" writes Rob Enderle, \nprincipal analyst of the Enderle Group, in TechNewsWorld. \"It's 595 \npages of things you can do with this product — most of which \nyou probably wouldn't have discovered for some time, let alone right \nat first.\" Check the book out now for tips you can use.\nMore information:\nUnited States / \nCanada / \nElsewhere\n\n \n\n\n\nSpam-Proof Your E-Mail Address, 2nd Ed.\n\n\n\nThis 32-page e-book by Brian Livingston gives you step-by-step instructions that \ncan prevent 97% of the spam that would otherwise clog an e-mail\naccount. You could call it \"Livingston's Spam Secrets.\" The PDF e-book\nis the result of months of experiments and tests we conducted. We now\nreceive little or no spam to the addresses we used as guinea pigs. These tests\nshow that you can make your e-mail addresses invisible to spammers,\nnot just battle an ever-growing flood. The methods we describe\nwork with Windows, Apple, and Linux and don't require any filters or block\nlists — but you can use those in addition to the book's techniques,\nif you wish. \n\nMore info\n\n   \n\n\n\n\n\n   \n\n\n\nContents  \nIndex\n\n   \n\n\n\n\n\n   \n\n\n\nINDEX\n\nThe following topics appear in the free version\n\n\n\n\nINTRODUCTION  \nReaders win a Housecall from Fred Langa\n\n \nMany applied, four were chosen\n\n \n \n\n\nTOP STORY  \nA crusade against bad EULAs\n\n \nBad EULAs are anticompetitive\n\n \nEULAs also censor consumer reviews\n\n \nBad EULAs are anticonsumer\n\n \nEULAs attempt to legitimize spyware\n\n \nAre EULAs even necessary?\n\n \nWhat can be done?\n\n \n \n\n\nKNOWN ISSUES  \nGet OEM discounts when you upgrade your PC\n\n \nOEM Preinstallation Kit (OPK) not always required\n\n \nRefurbishers are also 'system builders'\n\n \nRepairing broken PC doesn't invalidate OEM license\n\n \nZoneAlarm is still not Vista ready\n\n \n \n\n\nWACKY WEB WEEK  \nSee the end of the world in 90 seconds\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou get all of the following in the paid version\n\n\nWOODY'S WINDOWS  \nVista time-saver #7 — resize pictures quickly\n\n \nWhere are the PowerToys for Vista?\n\n \nVista's biggest missing feature\n\n \nAlternatives to the Image Resizer PowerToy\n\n \nVSO Image Resizer fills the bill\n\n \n \n\n\nPERIMETER SCAN  \nFirefox is becoming a more important target\n\n \nA bug fix for Firefox 2.0.0.4\n\n \nNew Firefox exploits uncovered\n\n \nIs there any reason to dump Firefox?\n\n \n \n\n\nKNOWN ISSUES 2  \nMore ways to get Microsoft products discounted\n\n \nTips on getting discount software subscriptions\n\n \nProblems with McAfee auto-renew cancellation\n\n \nMore tips on virtual credit-card numbers\n\n \nUse virtual credit-card numbers in the U.K., too\n\n \nAVG paid version lacks forced auto-renewal\n\n \n \n\n \n \n\n\n\nPaid subscribers can access all old and new paid newsletter content\nMake a contribution to support our research into Windows and you'll immediately\nbe able to read and search through scores of valuable articles. In addition,\npaid subscribers are entitled to download valuable content that we license for\nyou at least once every calendar quarter.\nTo upgrade, simply make a contribution of any amount you choose.\nIf you do this by June 13, 2007, \nyou'll instantly be sent the full, paid version of today's newsletter.\n\nTo upgrade to the paid version of the Windows Secrets Newsletter, please visit our \n upgrade page.\n\nThanks in advance.\n\n\n   \n\n\n\n\n\n   \n\n\n\nContents\n Index\n\n\n   \n\n\n\n\n\n   \n\n\n\nYOUR SUBSCRIPTION\n\nThe Windows Secrets Newsletter is published weekly on \nthe 1st through 4th Thursdays of each month, plus occasional news updates. \nVacation breaks occur in late August, Thanksgiving Week, and Christmas/New Year's.\nPublisher: WindowsSecrets.com, Attn.: #120 Editor, 1700 7th Ave., Suite 116, \nSeattle, WA 98101-1323 USA. Vendors, please send no unsolicited packages to this address \n(readers' letters are fine).\nEditorial Director: Brian Livingston. Editor-at-Large: Fred Langa. Associate \nEditor: Scott Dunn. Contributing Editors: Susan Bradley, Mark Edwards, Woody \nLeonhard, Chris Mosby, Ryan Russell. Research Director: Vickie Stevens. \nProgram Director: Brent Scheffler. Managing Editor: Jody Braverman.\nTrademarks: Microsoft and Windows are registered trademarks of Microsoft \nCorporation. The Windows Secrets series of books is published by\nWiley Publishing Inc. The Windows Secrets Newsletter,  \nWindowsSecrets.com, LangaList, LangaList Plus, WinFind, Security Baseline, Patch Watch, \nPerimeter Scan, Wacky Web Week, the Logo Design (W, S or road, and Star), and the \nslogan Everything Microsoft Forgot to Mention all are trademarks and service \nmarks of WindowsSecrets.com LLC. All other marks are the trademarks or service \nmarks of their respective owners.\n\n\nYOUR SUBSCRIPTION PREFERENCES\n(change \nyour preferences):\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nCountry: United States\nZIP or postal code: 90210\nReader number: 83107-13329\nBounce count: 0\n\nYour bounce count is the number of times your server has bounced a newsletter back to us\nsince the last time you visited your preferences page. We cannot send newsletters to you\nafter your bounce count reaches 3, due to ISP policies. If your bounce count is higher\nthan 0 or blank, please visit your\npreferences page.\nThis automatically resets your bounce count to 0.\nTo change your preferences: Please visit your \npreferences  page.\nTo access all past issues: Please visit our\npast issues page.\nTo upgrade your free subscription to paid: Please visit our \nupgrade  page.\nTo resend a missed newsletter to yourself: If your mail server filtered \nout a\nnewsletter, you can resend the current issue to yourself. To do so, visit your\npreferences page\nand use the Resend link.\nTo get subscription help by e-mail (fastest method): Visit our \ncontact page.\nSubscription help by facsimile:\n206-282-6312 (fax). Emergency subscription help by phone: 206-282-2536 (24\nhours).\n\nHOW TO SUBSCRIBE: Anyone may subscribe to this newsletter by visiting our \nfree signup page.\nWE GUARANTEE YOUR PRIVACY:\n\n1. We will never sell, rent, or give away your address to any outside party, ever.\n2. We will never send you any unrequested e-mail, besides newsletter updates.\n3. All unsubscribe requests are honored immediately, period.  \nPrivacy policy\nHOW TO UNSUBSCRIBE: To unsubscribe\nlanga3@speedy.uwaterloo.ca\nfrom the Windows Secrets Newsletter,\nUse\nthis 2-click\nUnsubscribe\nlink; or\nSend\na blank e-mail to\nunsub@WindowsSecrets.net\nwith leave langa3@speedy.uwaterloo.ca\nas the Subject line; or\nVisit our \nUnsubscribe page.\n\n\nCopyright © 2007 by WindowsSecrets.com LLC. All rights reserved.\n\n\nContents\n Index\n\n\n\n\n\n\n   \n\n\n\n\n\n"}