{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTUESDAY 12 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER SIMON ENRIGHT\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nMEDIA\n\n\nThe media is a \"feral beast\" and its relationship with politicians is \"damaged\". The words of Tony Blair today who decided to devote one of his last speeches as Prime Minister to the idea that the media is creating cynicism. He says we need to separate \"news\" and \"comment\". Do let us know what you think here.  And see if we cast \"heat\" or \"light\", as the PM describes it, as Michael Crick reports on the speech and Jeremy Paxman hosts a debate on the issue.\n\n\nFORD\n\n\nPaul Mason will be reporting news and collecting comment on Ford's admission that it is looking to sell Jaguar and Land Rover. But we hope he'll also answer the question - would the two British car brands be better off owned by private equity than the stumbling American car giant.\n\n\nWOOLMER\n\n\nThe latest from Jamaica is an admission from the police that Bob Woolmer was not murdered but died of natural causes. After acres of media coverage - both broadcast and print - that claimed the Pakistani cricket team were prime suspects we'll be talking to their representative.\n\n\nEGYPT\n\n\nFinally, is Egypt turning into a police state? The BBC World Service Arab affairs analyst, Magdi Abdelhadi, has a disturbing film about how advances in democracy are being reversed.\n\n\nTonight, 10.30, BBC2.\n\n\nSimon Enright\n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nWIFE TOLD TO BE 'MUSLIM MARTYR'\n\n\t\t\t\t\t\t\tThe ex-wife of a British Muslim extremist says her husband suggested she carry out a suicide bombing\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}