{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\nPerformance \n\t\t\tBenchmarking For Energy Utilities\nSeattle, WA\n            May 23-24, 2007\n\nPandemic \n\t\t\tPreparedness For Utilities\nSeattle, WA\n            May 23-24, 2007\n\n\nCapacity \n\t\t\tMarkets\n\n\t\t\tWashington, DC\n\nJune \n4-6, 2007\n\nCoal-to-Liquids \n\t\t\tFinance and Development Summit\n\n\t\t\tNew York, NY\n\nJune \n4-6, 2007\n\n\nStrategies for \n\t\t\tBidding Ancillary Services in LMP Markets\n\nIndianapolis, IN\n\nJune 6-7, 2007\n\n\nIntro to Electric \n\t\t\tUtility Systems for Non Engineers\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nDistributed \n\t\t\tEnergy Resources-Emerging Business Models for Utilities\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nMergers & Acquisitions in the Customer Service Space: What Does it Mean For Utilities? (UtiliPoint.com - May 21, 2007) \n\n\n\nUtiliPoint.com - May 21, 2007 - As CIS Week prepares to launch in sunny Orlando, Florida this week, many have been asking UtiliPoint about the recent mergers & acquisitions that have occurred over the past year.\n\n\nMay 21, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 21, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 21, 2007\n\n\nMay 21, 2007 PowerMarketers Industry Publications\n\n\n\nInfluencing Climate Change Policies (EnergyBiz Insider - May 21, 2007)\n\n\n\nEnergyBiz Insider - May 21, 2007 - Corporate America considers climate change legislation to be inevitable and has begun to factor that into the cost of production.\n\n\nMay 21, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for May 21, 2007  \n\n\n\nFirst Enercast Featured Articles for May 21, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 21, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nUtility employees give time off the clock: Community volunteers help animal shelter and other agencies\n\n\n\nMay 20--The nine people who volunteered Tuesday at the Animal Control Bureau have, between them, 172 years' experience at Duke Energy.  They have helped a lot of people and solved a lot of problems over the years, they say. But they said helping the dogs, cats, rabbits and other critters at the west Charlotte animal shelter was a real labor of love. \"Husbands often tell the wives who volunteer ...\n\n\nMay 20, 2007 Knight Ridder Tribune Business News\n\n\n\nSantee Cooper will hold forum on proposed power plant\n\n\n\nMay 20--Santee Cooper will hold an information forum Monday for those who have questions about a proposed $984 million power generation plant to be built along the Great Pee Dee River near Kingsburg in Florence County.  \"As part of the process, we are having a very informal information gathering in order to be very open and transparent about the process from the very beginning,\" Santee Cooper ...\n\n\nMay 20, 2007 Knight Ridder Tribune Business News\n\n\n\nSmart meters to cut fuelbills\n\n\n\nMay 20--Plans to force power firms to put \"smart meters\" into every home will be unveiled this week by Trade and Industry Secretary Alistair Darling.  The new meters will give householders an accurate account of how much power they are using and how much it is costing, which is expected to help encourage reduced energy use and environmental awareness. Instead of being hidden below stairs, smart ...\n\n\nMay 20, 2007 Knight Ridder Tribune Business News\n\n\n\nAllegheny Energy, landowners in power play over transmission line\n\n\n\nMay 20--The rolling hills, mature trees and alfalfa fields on Bill Pollock's century-old farm camouflage a growing battle pitting landowners against Allegheny Energy Inc. over a proposed $1.3 billion high-voltage power line that would run through three states.  Pollock's farm in Somerset, Washington County, lies at the nexus of existing 138,000-volt and smaller transmission lines, and by 2011 ...\n\n\nMay 20, 2007 Knight Ridder Tribune Business News\n\n\n\nOrdinance would darken businesses' overnight lights\n\n\n\nMay 21--Did you ever see Dallas from a DC-9 at night?  Well Dallas is a jewel, oh yeah, Dallas is a beautiful sight. And Dallas is a jungle, but Dallas gives a beautiful light. Songwriter Jimmie Dale Gilmore's love letter to Big D's skyline evokes visions of Reunion Tower's blinking bulbs, the Bank of America building's green neon glow and the blazing red hues of Pegasus, perched atop downtown's ...\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nWilliams sells energy-trading assets\n\n\n\nTulsa-based Williams Cos. agreed Monday to sell energy-trading assets to Bear Stearns Cos. for $512 million. The sale will wipe out as much as $2.4 billion in trading liabilities that weigh on the sellers credit quality, Williams said Monday in a statement. Bear Stearns, a New York securities firm that is expanding into energy trading, will get more than 7,500 megawatts of power contracts.\n\n\nMay 21, 2007 Tulsa World\n\n\n\nWilliams to sell substantially all of power assets\n\n\n\n-- Williams announced it has entered into an agreement to sell substantially all of its power assets to Bear Energy LP. The agreement includes Williams' 7,500 MW portfolio of power contracts and certain other assets. Closing of the transaction is expected within the next six months. The base purchase price in the transaction is $512 million. This amount will be reduced by expected net portfolio ...\n\n\nMay 21, 2007 Power Engineering\n\n\n\nNew scrubber at New Haven power plant online without a hitch\n\n\n\nMountaineer's scrubber went into service in February and is operating without a hitch, Powell said. Installation of the scrubber has resulted in several visible changes at the 1,300-megawatt power plant. Most noticeable is a new 1,000-foot-tall stack, built next to the plant's original 1,103-foot stack, plus a new 15-story building stuffed with super-sized equipment.\n\n\nMay 21, 2007 Charleston Daily Mail\n\n\n\n\n\nDigital Realty Trust, Inc. Joins The Green Grid\n\n\n\nDigital Realty Trust Becomes Member of Consortium Leading the Effort to Increase Energy Efficiency in Datacenters SAN FRANCISCO, May 21 /PRNewswire-FirstCall/ -- Digital Realty Trust, Inc. (NYSE: DLR), a leading owner and manager of corporate datacenters and Internet gateways, has joined The Green Grid (http://www.thegreengrid.org), a global consortium of companies dedicated to advancing energy ...\n\n\nMay 21, 2007 PR Newswire\n\n\n\nWilliams Reaches Agreement to Sell Substantially All of Power Assets\n\n\n\nCompany Expects Significant Improvement in Credit Profile, Reduced Capital Costs   Transaction Would Eliminate Up to $2.4 Billion in Imputed Debt, Related  Interest     TULSA, Okla., May 21 /PRNewswire-FirstCall/ -- Williams (NYSE: WMB) today announced it has entered into a definitive agreement to sell substantially all of its power assets to Bear Energy LP, a ...\n\n\nMay 21, 2007 PR Newswire\n\n\n\nWallStreetAnalystReport.com: Open Energy/Suntech Alliance Accelerates Momentum Toward Green Future\n\n\n\nOpen Energy Corporation (OTCBB: OEGY)  Open Energy Corporation (OTCBB: OEGY) looks to harness the power of the sun through development and commercialization of renewable energy systems. Its vision is to generate outstanding value for its shareholders, while contributing to the energy security, the conservation of natural resources, and the reduction of green house gas emission.\n\n\nMay 21, 2007 Internet Wire\n\n\n\nCon Edison Tells Shareholders That Continued Significant Infrastructure Investments Needed to Support Region's Growth\n\n\n\nConsolidated Edison, Inc. (Con Edison) (NYSE: ED) Chairman, President and CEO Kevin Burke told shareholders today at the  Consolidated Edison, Inc. (Con Edison) (NYSE: ED) Chairman, President and CEO Kevin Burke told shareholders today at the annual meeting that 2006 was a year of solid financial results, continued improvement in environmental performance, and an ongoing commitment to a diverse ...\n\n\nMay 21, 2007 Internet Wire\n\n\n\nDuquesne Light Holdings Declares Special Pro Rata Dividend in Preparation for Completion of Merger with Macquarie Consortium\n\n\n\nPITTSBURGH, May 21 /PRNewswire-FirstCall/ -- The Board of Directors of Duquesne Light Holdings (NYSE: DQE) today declared a special pro rata dividend to ensure that shareholders continue to receive dividends at the current rate until the closing of the company's merger with a consortium led by Macquarie Infrastructure Partners and The DUET Group. In accordance with the merger agreement, the board ...\n\n\nMay 21, 2007 PR Newswire\n\n\n\nHelioPower Expanding in California\n\n\n\nSolar power leader opens sales offices in Los Angeles, Orange County, Palm Springs and regional office in Sacramento     FALLBROOK, Calif., May 21 /PRNewswire/ -- HelioPower, a leading provider of solar power solutions, has opened sales offices in Los Angeles, Orange County and Palm Springs to meet the rising commercial and residential demand for it's integrated solar power ...\n\n\nMay 21, 2007 PR Newswire\n\n\n\n\n\n2006 Shutdown Spurs Call For Investigation Of Nuclear Cybersecurity\n\n\n\nTwo leading Democrats say the August 2006 shutdown of a nuclear facility in Alabama could have been caused by a denial-of-service attack and needs to be investigated. Two leading Democrats sent a letter to the chairman of the U.S. Nuclear Regulatory Commission, calling for an investigation into the nation's nuclear cybersecurity. Committee on Homeland Security chairman Bennie G.\n\n\nMay 21, 2007 Information Week\n\n\n\nAnswers sought on Alabama plant shutdown\n\n\n\nBy BEN EVANSASSOCIATED PRESS WRITER WASHINGTON -- An overloaded computer network shut down a nuclear reactor in Alabama last year, and even nine months later, regulators cannot pinpoint the source of the failure. The incident occurred last August at the Tennessee Valley Authority's Browns Ferry plant. Since the Sept. 11 strikes, Congress has been concerned that utilities and other high-risk ...\n\n\nMay 20, 2007 Seattle Post Intelligencer\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nNew Report Gives Insight Into the Energy Market in Germany\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c57293) has announced the addition of Germany Energy Market Organisation and Regulation Report to their offering. The Germany overview report can help you to quickly understand the country's energy market structure and organisation. For each of the 4 main energy sources, coal, oil, gas and ...\n\n\nMay 21, 2007 Business Wire\n\n\n\nIdentify the Key Players Active in the Brazilian Coal, Oil, Gas and Electricity Industry\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c57437) has announced the addition of Brazil Energy Market Organisation and Regulation Report to their offering. The Brazil overview report can help you to quickly understand the country's energy market structure and organisation. For each of the 4 main energy sources, coal, oil, gas and electricity, ...\n\n\nMay 21, 2007 Business Wire\n\n\n\nBrown plans nuclear future\n\n\n\nZombie Brown is to face down sceptics in his party and give the go-ahead for a new generation of nuclear power stations, which will be built across the country.In a move immediately condemned by environmental organisations, the Prime Minister-elect will give the green light to the plans that will show that he is backing Tony Blair's support of the nuclear industry.Boosted by a new poll, which ...\n\n\nMay 20, 2007 Observer\n\n\n\nMinisters will block Gazprom move on UK\n\n\n\nThe government has given its strongest indication yet that it would block an attempt by the Russian energy group Gazprom to take a significant stake in a UK energy company. Whitehall officials have indicated that ministers have reserve powers that could block a takeover. Gazprom has made clear its wish to increase its presence in the UK energy market, with a significant stake in British Gas owner ...\n\n\nMay 20, 2007 Observer\n\n\n\nEurope should auction 100 per cent of emissions allowances, says Fortum\n\n\n\n- The European Union should ultimately auction 100 per cent of emission allowances, to help create a more equitable system, Timo Karttinen, Fortum senior vice president for corporate development, has said. In an interview with Platts, Karttinen acknowledged that auctioning could hurt the competitiveness of companies that sell their products globally until there is a global emissions trading ...\n\n\nMay 21, 2007 Power Engineering\n\n\n\nResearch and Markets: Power Generation Systems - Portfolio Analysis\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c57515) has announced the addition of Power Generation Systems - Portfolio Analysis to their offering. The Portfolio Analysis - Power Generation Systems is a comprehensive evaluation of the UK market. The revised and updated 2007 edition analyses the financial performance of the companies important ...\n\n\nMay 21, 2007 Business Wire\n\n\n\nBosch Expands Production for Solar Technology\n\n\n\n-- The Bosch Group announced that it is significantly expanding its production of solar thermal systems. Bosch's Thermotechnology Division expects sales of more than 150,000 solar collectors in 2007, 60 percent more than it sold in 2006, and is looking to more than double sales by 2009. Solar power is second only to wind power in making the greatest contribution to meeting worldwide energy needs ...\n\n\nMay 21, 2007 Industry Week\n\n\n\nEnergy suppliers withholding up to 1bn from customers\n\n\n\nUtility companies are holding up to 1billion belonging to customers in a growing overpayment scandal. As many as ten million households are in credit with energy suppliers, entitling them to a refund for overpaid bills. But with direct debits reviewed only every few months, firms are stockpiling 'cash mountains' that earn them millions of pounds in interest.\n\n\nMay 21, 2007 Evening Standard\n\n\n\nMarsh Establishes Renewable Energy Team, Reinforcing Energy Leadership Position\n\n\n\nSusan K. Stokes, co-leader of Marsh's Renewable Energy Team. Photo: Business Wire Tom Sexton, co-leader of Marsh's Renewable Energy Team. Photo: Business Wire NEW YORK--(BUSINESS WIRE)--Marsh Inc., the worlds leading risk and insurance service firm, today announced it has established a dedicated Renewable Energy Team and named Susan K. Stokes and Tom Sexton as its co-leaders.\n\n\nMay 21, 2007 Business Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}