{"category": "ham", "to_address": "Jason Kivlighn <jkivlighn@gmail.com>", "from_address": "Jon Phillips <jon@rejon.org>", "subject": "Re: [cc-devel] [Tracker] Extracting Embedded Licenses", "body": "On Mon, 2007-06-18 at 13:20 -0700, Jason Kivlighn wrote:\n> Whoops, I forgot the intro on this.\n> \n> This is my progress thus far with extracting licenses from various\n> formats.    Jamie, I'm curious on your thoughts on adding new extractors\n> (besides the ones mentioned below, GIF is another I have in mind.  I'm\n> not sure whether or not it's worthwhile, however).  I don't want to be\n> adding bloat...\n> \n> Cheers,\n> Jason\n\nJamie, plese drop us a line to discuss this project. Did you get the\nchat time invite?\n\njon\n\n> Jason Kivlighn wrote:\n> > Hi,\n> >\n> > imagemagick: Uses 'convert filename xmp:-' to output an image's embedded\n> > XMP.  This works for at least JPEG and TIFF files.  For JPEGs, however,\n> > Imagemagick outputs the namespace and XMP, seperated by \\0.  I'm not\n> > sure how I can handle this, without simply assuming that 'convert'\n> > returned two null-terminated strings.  Nevertheless, this extracts the\n> > XMP from TIFF files.\n> >\n> > msoffice: Extends the msoffice extractor to also parse the\n> > DocumentSummeryInformation infile, which contains user-defined metadata,\n> > along with license metadata embedded by the MSOffice Creative Commons Add-in\n> >\n> > pdf: Extends the pdf extractor to read a PDF's metadata stream and parse\n> > it as XMP.  I'm still awaiting poppler extending the glib bindings to\n> > allow reading the metadata stream.  Until then, it will simply never\n> > find the metadata stream and go on without error.\n> >\n> > png: Adds a check for the XML:com:adobe:xmp iTXt field, and parses it as\n> > XMP.\n> >\n> > html: Adds a new html parser using libxml2.  Parses the document,\n> > checking for RDFa licenses.  It also checks for other basic HTML\n> > properties like title and author.\n> >\n> > There's also several XML formats I'd like to parse for license data,\n> > particularly SVG and SMIL.  Would this be do-able, and if so, how should\n> > I go about it?  Write new extractors for each format or is this too much\n> > overhead?  These could use GMarkupParse, rather than bringing in libxml2\n> > like the HTML parser.\n> >\n> > Cheers,\n> > Jason\n> >\n> >   \n> \n> _______________________________________________\n> tracker-list mailing list\n> tracker-list@gnome.org\n> http://mail.gnome.org/mailman/listinfo/tracker-list\n> \n-- \nJon Phillips\n\nSan Francisco, CA\nUSA PH 510.499.0894\njon@rejon.org\nhttp://www.rejon.org\n\nMSN, AIM, Yahoo Chat: kidproto\nJabber Chat: rejon@gristle.org\nIRC: rejon@irc.freenode.net\n\n_______________________________________________\ncc-devel mailing list\ncc-devel@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-devel\n\n"}