{"category": "ham", "to_address": "\"Shannon Scott\" <sscott@locationinc.com>", "from_address": "\"Tom Phoenix\" <tom@stonehenge.com>", "subject": "Re: SWF::Builder ActionScript classpath", "body": "On 7/5/07, Shannon Scott  wrote:\n\n> I have been using SWF::Builder to create swf files from actionscript (\n> .as files ).  It works great until I try to use some actionscript with\n> an import statement, then I get this error:\n> Syntax error. ';' is expected. in 1\n\nThat's not one of perl's error messages, so I'm guessing it's coming\nfrom either SWF::Builder or some other software you've got that I\ndon't.\n\n> I don't think there are any issues with the code because it is part of a\n> sample provided.\n\nIf you say so. But have you ever been able to get the \"sample\nprovided\" to work properly? I've seen plenty of sample software that\ndidn't work as advertised. It used to work that way, you see, with an\nearlier version of the frobnicator, but we don't keep the sample code\nup to date any longer....\n\nIn any case, have you considered that maybe, somewhere around line 1\nof something, you need to add a semicolon or otherwise adjust some\npiece of non-Perl syntax?\n\n> How do I add to the Flash Authoring Environment Classpath when I am\n> using SWF::Builder to generate the swf files?\n\nSWF::Builder looks complex enough that it probably needs a FAQ and a\nmailing list, if it doesn't have those already. But this is a Perl\nBeginners' forum; although it's possible that somebody here knows how\nto help you, it's much more likely that you'll get the best help most\nquickly by tracking down the experts on SWF::Builder, wherever they\nhang out. You may even need to ask the module's author for\nclarification.\n\nBut maybe you access the Flash Authoring Environment Classpath the\nsame way whether you use SWF::Builder or not. In that case, your help\nwould come from the analogous set of experts, FAQ, and mailing lists\nfor that programming environment. But as they are likely to be more\nnumerous than the crew for SWF::Builder, they are similarly likely to\nhave a well-established presence on the net, so finding them will be\nall the easier.\n\nGood luck with it!\n\n--Tom Phoenix\nStonehenge Perl Training\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}