{"category": "ham", "to_address": "\"Andy Spieherty\" <spiehera@lafayette.edu>", "from_address": "\"jerry gay\" <jerry.gay@gmail.com>", "subject": "Re: [PATCH] Re: [perl #42616] Parrot won't build with perl-5.6.", "body": "On 4/27/07, Andy Spieherty  wrote:\n> On Fri, 27 Apr 2007, Allison Randal via RT wrote:\n>\n> > Will Coleda wrote:\n> > >\n> > > My take: our long term goal is to eliminate the dependency we have on\n> > > perl. Let's not spend more time making it work with 5.6, but instead,\n> > > devote that time to furthering the the long term goal. I vote we just up\n> > > the (temporary!) requirement.\n> >\n> > Agreed. I hate yielding compatibility, but it makes sense in this case\n> > (since we're likely to eventually require that any Perl 5 code in the\n> > repository be able to run on the Parrot implementation of Perl 5).\n>\n> Fair enough.  I suggest the following patch.  (The 5.8.4 version is\n> arbitrary.  It's the oldest 5.8.x I happen to have installed for easy\n> testing.  It should perhaps be replaced with whatever version regular\n> Parrot contributors are going to be using.)\n>\n> --- parrot-current/README       2007-04-17 19:15:19.000000000 -0400\n> +++ parrot-andy/README  2007-04-27 09:24:12.000000000 -0400\n> @@ -29,7 +29,7 @@\n>\n>  Get it from http://www-306.ibm.com/software/globalization/icu/downloads.jsp\n>\n> -You'll also need Perl 5.6.1 or above to run various configure and build\n> +You'll also need Perl 5.8.4 or above to run various configure and build\n>  scripts.\n>\n>  For most of the platforms that we are supporting initially,\n> --- parrot-current/Configure.pl 2007-04-12 03:15:13.000000000 -0400\n> +++ parrot-andy/Configure.pl    2007-04-27 09:25:59.000000000 -0400\n> @@ -254,7 +254,7 @@\n>\n>  =cut\n>\n> -use 5.006_001;\n> +use 5.008_004;   # 5.8.[0-3] might also work, but are untested.\n>  use strict;\n>  use warnings;\n>  use lib 'lib';\n>\n5.8.4 seems reasonable, given that nobody seems to care much about\ndropping 5.6 support. however, before applying this patch, we should\nconsider a deprecation cycle, to warn folks that the next release\nversion will require a newer version of perl. thoughts?\n\nif we reach agreement that this should follow the standard deprecation\ncycle, we'll need also to patch DEPRECATED.pod and refer to this\nticket number.\n~jerry\n\n"}