{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Greg Paul\" <jowcocoabeachchambernos@cocoabeachchamber.com>", "subject": "Make yourself more attractive to others", "body": "\nControl your weight and appetite\n\n\n\n\n\n\nAnatrim – The latest and most attracting product for weighty people is now readily available – As were seen on Oprah.\n\n\nDo you retain all the situations when you told yourself you would do any thing for being delivered from this quickly growing pounds of fat? Happily, now no big offering is demanded. With Anatrim, the earth-shaking pound-melting mixture, you can achieve naturally health lifestyle and become really slimmer. Just look at what people write!\n\n\n\n\"It’s difficult to admit it but I was an awful food addict. \n\n\nI greedily ate all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis ruinous passion passed away when I started taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my appetite vanished, \n\n\nmood improved and I became the happiest person 21 pounds in 2.6 months. \n\n\n\n\nI can tell you now I’m the happiest person in the world!\"\n\n\n\n\n\nSilvia D., Washington\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nIt’s pretty hard to imagine how I detested being mocked at school. \n\n\n\n\nI hated the weight and I hated myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nIt literally took me out of this fearful nightmare! Many thanks and a great respect to you, fellows.\"\n\n\n\n\n\nSteve Doubt, Washington\n\n\n\n\n\n\"Know what? Anatrim kept my marriage intact! I went into this circle, depression – more eating – even more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nOne of my friends pointed at your site and I asked for my pack of Anatrim at once. \n\n\nThe results were great, my appetite came to admissible level, I was often in good spirits, and, certainly, I became able to tighten my belt on some holes. And you see, the sex became fantastic also!\"\n\n\n\n\n\nKarl\n\n\n\n\n There many and many gratitudes left by delighted people trying Anatrim. Don’t you gonna join the tens of thousands of slim buyers and try this original appetite-suppressing power lifting product now!\n\n\nDon’t lose your opportunity!\n\n\n\n\n"}