{"category": "ham", "to_address": "a2k@lists.essential.org, ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] New Yorker: Exporting I.P.", "body": "http://www.newyorker.com/talk/financial/2007/05/14/\n070514ta_talk_surowiecki\n\nThe Financial Page\nExporting I.P.\nby James Surowiecki May 14, 2007\n\nFree trade is supposed to be a win-win situation. You sell me your\ntelevisions, I sell you my software, and we both prosper. In practice,\nfree-trade agreements are messier than that. Since all industries crave\nforeign markets to expand into but fear foreign competitors encroaching\non their home turf, they lobby their governments to tilt the rules in\ntheir favor. Usually, this involves manipulating tariffs and quotas.\nBut, of late, a troubling twist in the game has become more common, as\ncountries use free-trade agreements to rewrite the laws of their trading\npartners. And the country that is doing this most aggressively is the\nUnited States.\n\nOur recent free-trade agreement with South Korea is a good example. Most\nof the deal is concerned with lowering tariffs, opening markets to\ncompetition, and the like, but an important chunk has nothing to do with\nfree trade at all. Instead, it requires South Korea to rewrite its rules\non intellectual property, or I.P.-the rules that deal with patents,\ncopyright, and so on. South Korea will now have to adopt the U.S. and\nE.U. definition of copyright-extending it to seventy years after the\ndeath of the author. South Korea will also have to change its rules on\npatents, and may have to change its national-health-care policy of\nreimbursing patients only for certain drugs. All these changes will give\ncurrent patent and copyright holders stronger protection for longer.\nRecent free-trade agreements with Peru and Colombia insisted on much the\nsame terms. And CAFTA-a free-trade agreement with countries in Central\nAmerica and the Caribbean-included not just longer copyright and\ntrademark protection but also a dramatic revision in those countries'\npatent policies.\n\nWhy does the U.S. insist on these rules? Quite simply, American drug,\nsoftware, and media companies are furious about the pirating of their\nproducts, and are eager to extend the monopolies that their patents and\ncopyrights confer. These companies are the main advocates for such\nrules, and the big winners. The losers are often the citizens in\ndeveloping countries, who find themselves subject to a Draconian I.P.\nregime that reduces access to new technologies.\n\nIntellectual-property rules are clearly necessary to spur innovation: if\nevery invention could be stolen, or every new drug immediately copied,\nfew people would invest in innovation. But too much protection can\nstrangle competition and can limit what economists call \"incremental\ninnovation\"- innovations that build, in some way, on others. It also\nencourages companies to use patents as tools to keep competitors from\nentering new markets. Finally, it limits consumers' access to valuable\nnew products: without patents, we wouldn't have many new drugs, but\npatents also drive prices of new drugs too high for many people in\ndeveloping countries. The trick is to find the right balance, insuring\nthat entrepreneurs and inventors get sufficient rewards while also\nmaximizing the well-being of consumers.\n\nHistory suggests that after a certain point tougher I.P. rules yield\ndiminishing returns. Josh Lerner, a professor at Harvard Business\nSchool, looked at a hundred and fifty years of patenting, and found that\nstrengthening patent laws had little effect on the number of innovations\nwithin a country. And, in the U.S., stronger patent protections for\nthings like software have had little or no effect on the amount of\ninnovation in the field. The benefits of stronger I.P. protection are\neven less convincing when it comes to copyright: there's little evidence\nthat writers and artists are made more productive or creative by the\nprospect of earning profits for seventy years after they die, and the\nhistorical record suggests only a tenuous connection between stronger\nI.P. laws and creative output.\n\nThe U.S., in its negotiations, insists on a one-size-fits-all approach:\nstronger rules are better. But accepting a diverse range of I.P. rules\nmakes more sense, especially in light of the different economic\nchallenges that developing and developed countries face. Lerner's study\nfound that the benefits of stronger patent laws were reduced in less\ndeveloped countries. And developing countries, being poorer, obviously\nhave more to gain from shorter patent terms for foreign innovations,\nsince that facilitates the spread of new technology and the diffusion of\nideas. Tellingly, this is the approach the U.S. takes when it comes to\nlabor standards, arguing that we shouldn't impose developed-country\nstandards on developing countries. But in the case of intellectual\nproperty the government's position is exactly the opposite. The only\ndifference, it seems, is whose interests are at stake.\n\nThe great irony is that the U.S. economy in its early years was built in\nlarge part on a lax attitude toward intellectual-property rights and\nenforcement. As the historian Doron Ben-Atar shows in his book \"Trade\nSecrets,\" the Founders believed that a strict attitude toward patents\nand copyright would limit domestic innovation and make it harder for the\nU.S. to expand its industrial base. American law did not protect the\nrights of foreign inventors or writers, and Secretary of the Treasury\nAlexander Hamilton, in his famous \"Report on Manufactures,\" of 1791,\nactively advocated the theft of technology and the luring of skilled\nworkers from foreign countries. Among the beneficiaries of this was the\nAmerican textile industry, which flourished thanks to pirated\ntechnology. Free-trade agreements that export our own restrictive I.P.\nlaws may make the world safe for Pfizer, Microsoft, and Disney, but they\ndon't deserve the name free trade.\n\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}