{"category": "spam", "to_address": "<mack@speedy.uwaterloo.ca>", "from_address": "\"Dorsey S. Moll\" <jtz@pcilightingcontrols.com>", "subject": "stilt nifty", "body": "\n\n\n\n\n\n\n\nBeth was on her period so he had to beat \noff.\n8:45am Danny Devito On The View \nDiscussions.\nHe said that he read that Richards once yelled \nabout the Jews while he was on stage.\nRichards said he wasn't sure if that was the right \nplace to be doing this apology.\nHoward said he was driving around listening to the \nreplay and then turned over to Scott Ferrall. 9:05am A Christmas Mystery \nRecord.\n7:55am  Debella The 50 Year Old Porn Star \nVisits.\nHe said the photographers were trying to catch him \nand they just happened to catch him at that point. Gary said that Howard opened up \nto him first.\nBeth told him that was in case he wanted to \ncry.\nHoward said he's not into the game that much but he \ndoes like hearing him talk about it. Howard said the reason that Jerry Seinfeld went \non Letterman and tried to get Richards to apologize is because they have this huge \nfollowing that could turn on them because of something like that. Howard said that \nhe doesn't find any women funny in comedy but Sarah is great. He said he wasn't sure \nif that's where he was or not but he did lock his doors.\nThe guys who were yelled at were saying that he \nnever approached them though. 6:25am Artie's Brush With Death. 6:00am Show opening \nbits and songs included: A Baba Booey song parody to the tune of Macarena, a prank \ncall from the Crank Yankers TV show, ''Fuck You'' song to the tune of ''Hey \nJude.\nHoward told Artie that he should use the N-word in \nhis act.\nArtie said it's been a year of torture for both of \nthem and now they are officially over. He's not sure what they are but they're \npretty funny to him.\n9:20am Greg Fitzsimmons Calls In.\nHoward said he showed up and there was some \nsecurity there at the mid point of the church.\nHoward asked him if he shot a load on \nher.\nHoward told her he had to go to break and hung up \non her.\nHoward said that he has a bunch of stuff to play \ntoday and they also have Paul Mooney stopping by to talk about how he's going to \nstop using the N-word in his act. Artie said he's had her on his mind a lot \nlately.\nHoward said the worst part  is that Richards is \napologizing to Jesse Jackson and Al Sharpton.\nHe moved on after that.\nHe was very ''busted up'' over the whole thing. \nHoward told the guys about how he was trying to find his car when he had that look \non his face.\nHe said he wasn't sure if that's where he was or \nnot but he did lock his doors.\nShe was going on and on about this Nazi and how he \nhad robbed her after living in her house or something like that.\n6:05am Artie Loses Weight!\nHe said he knows the guy seeing him doing what he \nwas doing just made him snap.\nHe told him to go over and get weighed to get it \nover with.\nRuth told him that he would be in the VIP section \nso he shouldn't worry about it. He said she went through a couple of phases in her \nlife and that's the kind of stuff she was doing. He's probably trying to stay \nrelevant by doing shows like that. He thought he was hysterical because his attitude \nis so funny. Howard asked Artie how he met this chick.\n"}