{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Brett Fink\" <cebcalebdaniloffhog@calebdaniloff.com>", "subject": "Stop gaining weight and get the figure you want", "body": "\nGet your ideal weight with this natural method\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most exciting flesh loss product is now readily available – As seen on Oprah.\n\n\nDo you hold in your memory all the times when you told yourself you would do anything for being saved from this fastly growing pounds of fat? Fortunately, now no major price is to be paid. With Anatrim, the ground-breaking pound-melting combination of elements, you can achieve naturally health mode of life and a really slender figure. Just look at what our customers say!\n\n\n\n\"It’s difficult to confess but I was extremely addicted to food. \n\n\nI ate all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis fatal passion finished after I started taking Anatrim! \n\n\nGod,\n\n\n\n\n my appetite decreased, \n\n\nspirits improved and I turned to the happiest person on the planet 18 pounds in 2.1 months. \n\n\n\n\nI can tell you now I became the happiest person!\"\n\n\n\n\n\nMaria H., San Diego\n\n\n\n\n\n\"Since the very childhood I was a weighty boy. \n\n\nYou can't imagine how I abhorred being mocked at school. \n\n\n\n\nI abhorred the weight and I abhorred myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nIt literally pulled me out of this fearful nightmare! Many and many thanks to you, my friends.\"\n\n\n\n\n\nDave Klark, San Diego\n\n\n\n\n\n\"You know what? Anatrim kept my marriage intact! I went into this circle, depression – eating more – more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce my friend pointed at your web page and I asked for Anatrim immediately. \n\n\nThe results were great, my appetite came to admissible level, I was often in good spirits, and, of course, I became able to tighten my belt on some holes. And the bedroom became cool also!\"\n\n\n\n\n\nFrank\n\n\n\n\n There is a great number of gratitudes happy people leave after taking Anatrim. Don’t you gonna join the tens of thousands of slim buyers and take this all-natural appetite-reducing power boosting product now!\n\n\nDo not miss your chance!\n\n\n\n\n"}