{"category": "ham", "to_address": "Farrel Buchinsky <fjbuch@gmail.com>", "from_address": "Roger Bivand <Roger.Bivand@nhh.no>", "subject": "Re: [R] Zipcodes latitude and longitude", "body": "On Tue, 22 May 2007, Farrel Buchinsky wrote:\n\n> I see several mapping libraries but cannot find how to do a simple task.\n\n(for some definition of simple)\n\nPerhaps this thread:\n\nhttp://article.gmane.org/gmane.comp.lang.r.geo/1534\n\non geocoding might help, especially Gabor Grothendieck's contribution.\n\n> Starting with a vector of zip codes (in the United States and in Canada) I\n> would like to automatically lookup the corresponding coordinates. Can you\n> suggest a package and function that I should turn to?\n> I would also like to automatically pull in the altitude, and some climate\n> data.\n\nElevation data are available from USGS at varying resolutions, but how you \nwant them smoothed for the zip code polygons is not given, it will be your \nchoice. The polygons (but not for strictly postal zip codes) are on the US \nCensus site for the US, I'm not aware of the correct address for Canada, \nbut data are being released for administrative boundaries. Climate data \nmay be available for download, but note that the point support for your \nzip code units doesn't suit climate either, really. Unless the met. \nstations are at your points, the values will be interpolated rather than \nobserved.\n\nFollow-ups to R-sig-geo, please.\n\nRoger\n\n> \n> \n\n-- \nRoger Bivand\nEconomic Geography Section, Department of Economics, Norwegian School of\nEconomics and Business Administration, Helleveien 30, N-5045 Bergen,\nNorway. voice: +47 55 95 93 55; fax +47 55 95 95 43\ne-mail: Roger.Bivand@nhh.no\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}