{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nWith wildfires ravishing the Southeast, a blaze that’s\n  torched a Los Angeles park, a tropical storm lingering off the East Coast and\n  massive flooding in the Midwest, the story of the day is nature’s fury\n  being unleashed on the United States. \n \nCynthia Bowers will report from Missouri, where riverside towns are under water\n  after at least 20 levees were washed over, resulting in the worst flooding in\n  more than a decade. \n \nThe deluge that caused the flooding is a remnant of\n  the storm system that leveled the town of Greensburg,\n  Kansas. President\n  Bush toured the destruction in Greensburg\n  today. Hari Sreenivasan will have that story as well as more on the debate over\n  whether the National Guard is being stretched too thin in wartime to\n  adequately respond to disasters at home.\n \nOn the West Coast, a wildfire is threatening Los Angeles landmarks,\n  including a famed park's conservatory and zoo. Sandra Hughes will have that\n  report. And Bianca Solorzano is on the other side of the country reporting on\n  the massive fires that are working their way through southern Georgia and northern Florida.\n \nMeanwhile, Vice President Dick Cheney is in Baghdad, on a surprise stop to urge Iraq's warring factions to find\n  more common ground. Mark Strassmann is there and will have our report.\n \nWhat's the newest popular export from China?\n  Its language. American students are learning Mandarin in droves, and it's\n  becoming a popular subject in schools from Maryland\n  to Washington\n  state. Barry Petersen will report on the language’s wide appeal in America.\n \nFinally, we’re going to introduce you to a\n  poet whose services reach an unusual market – the supermarket. Zach Houston hawks his\n  wares, commissioned poems, outside of grocery stores in Berkeley, California.\n  He may not be a Wordsworth, but what comes out of this wordsmith’s\n  typewriter just might surprise you. John Blackstone will have the story.\n \nI hope you’ll join us,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}