{"category": "ham", "to_address": "perl6-language@perl.org", "from_address": "larry@cvs.develooper.com", "subject": "[svn:perl6-synopsis] r14375 - doc/trunk/design/syn", "body": "Author: larry\nDate: Mon Apr 16 09:59:02 2007\nNew Revision: 14375\n\nModified:\n   doc/trunk/design/syn/S11.pod\n\nLog:\nModule names must respect case sensitivity even on case-insensitive systems.\n\n\nModified: doc/trunk/design/syn/S11.pod\n==============================================================================\n--- doc/trunk/design/syn/S11.pod\t(original)\n+++ doc/trunk/design/syn/S11.pod\tMon Apr 16 09:59:02 2007\n@@ -12,9 +12,9 @@\n \n   Maintainer: Larry Wall \n   Date: 27 Oct 2004\n-  Last Modified: 9 Mar 2006\n+  Last Modified: 16 Apr 2007\n   Number: 11\n-  Version: 17\n+  Version: 18\n \n =head1 Overview\n \n@@ -202,6 +202,20 @@\n where to keep them, such that multiple versions by different authors\n can coexist, all of them available to any installed version of Perl.\n \n+The internal API for package names is always case-sensitive, even if\n+the library system is hosted on a system that is not case-sensitive.\n+This implies either some sort of name mangling capability or storage\n+of intermediate products into a database of some sort.  In any event,\n+the actual storage location must be encapsulated in the library system\n+such that it is hidden from all language level naming constructs.\n+(Provision must be made for interrogating the library system for\n+the actual location of a module, of course, but this falls into\n+the category of introspection.)  Note also that distributions\n+need to be distributed in a way that they can be installed on\n+case-insensitive systems without loss of information.  That's fine,\n+but the language-level abstraction must not leak details of this\n+mechanism without the user asking for the details to be leaked.\n+\n The syntax of a versioned module or class declaration has multiple\n parts in which the non-identifier parts are specified in adverbial pair\n notation without intervening spaces.  Internally these are stored in\n\n"}