{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Hey, Breck Girl", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nJohn \n      Edwards And The Case Of The \"Breck Girl\" CommentA haircut \n      should not be a major election issue. At the same time, we're talking \n      about a $400 haircut, paid for by the campaign, for a candidate who \n      champions himself as an advocate for America's poor. Is that really \n      something the media should simply ignore? [+ Read More]\n\nFrom \n      The Vault: Yeltsin Talks To \"60 Minutes.\" Sort Of.In this \n      special edition of \"From The Vault,\" we bring you Lesley Stahl and Rome \n      Hartman's June 14, 1992 \"60 Minutes\" profile of Boris Yeltsin and his \n      family. At one point, Yeltsin accuses CBS News of working with Mikhail \n      Gorbachev to doctor a videotape to make him look drunk. Later, he angrily \n      storms away and refuses to answer any more of Stahl's \n      questions. ALSO: Stahl reflects on the interview. \n      [+ Read More]\n\nBranding \n      TragedyThere's no denying that the graphics used by the \n      networks covering the Virginia Tech \n      tragedy sometimes seemed obscene – did we really need dramatic \n      fonts and graphics of gun sights to convey the enormity of this tragedy? \n      It's rather depressing to think that news outlets felt they needed these \n      kinds of bells and whistles to draw viewers in; one would like to think \n      the horrible reality of the situation, minus the graphical theatrics, \n      would have been enough. [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nCBS \n      News Withholds Details At FBI's Request\n \nEconomy \n      101\n \nDavid \n      Martin Dispatch: Some Of What Isn’t Making The “Evening News” \n      Tonight\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}