{"category": "spam", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"Reginald\" <thedecimal@playcan.com>", "subject": "Wish you could be better?", "body": "\n\n\nMillions of men are already applying male \nenhancement patches daily and watching their size and drive go through the roof! \n\nPatches deliver the product into your system in \na quicker and more efficient manner than a pill ever could.\n\nOur Enlarge Patches are the most \nrespected in the industry, the highest quality at the best price. \n\nAs of yet no other patch has matched ours for \npure potency and effectiveness, the results you see from using Enlarge Patch are \nunreal!\n \nHave questions about Patches and how they work?How do they \nwork?Are they safe?Is there a guarantee?Are results \npermanent?\n \nVisit our website for all the \nanswers! \n \nHere are just a few of the thousands of happy \ntestimonials we receive every year:\"Hi, I have been \nusing Enlarge Patch Rxfor one month. I could not believe my eyes after about a \nweek of using the product because my flaccid length only grew a tremendous \namount. I started slow since I did not know much about the exercises but once I \nretained some experience I began to introduce myself to the more advanced ones \nand that is when my penis started growing.  I can not thank Enlarge Patch \nRx enough. So overall I started at about 6 inches in length and about 4 inches \nin girth, which is quite normal and now im 7 1/4 inches in length and 4 3/4 \ninches in girth. An entire inch in both length and girth in a matter of a month! \nIf you want to have gains and keep them forever you have to try Enlarge Patch \nRx, believe me you will not regret it!\"Robbie V. \nTexas\"I suppose my story won't be somewhat unusual to you. \nI'm a young man of 25 and I was completely frustrated about my small penis. I \nwas so shy to show it to any of the girl I had “relationship” with that I \nbasically had no sexual life at all. Enlarge Patch Rx patches did incredible \nthing to me. I was using them for 4 months and my penis is much more thicker and \nabout 2.5 inches longer now. All my doubts are gone. I really appreciate what \nyou're guys doing. Thanx for saving my life! \"Geoff R. Rhode \nIsland\n \nVisit our website for all the \nanswers! \n \nEnlarge Patch Rx is simply the best patch you will find, \nanywhere!\n"}