{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Ben Finney <bignose+hates-spam@benfinney.id.au>", "subject": "Re: Request for suggestions of DFSG-free documentation licences", "body": "Shriramana Sharma  writes:\n\n> Thanks for all your feedback, but the GPL also has some clauses that\n> are not applicable to documentation as pointed out at:\n>\n> http://www.gnu.org/licenses/gpl-faq.html#WhyNotGPLForManuals\n\nIf you re-read that section, it mostly addresses the FSF's desire for\nyou to use their problematic FDL for documentation. Other messages in\nthis thread have already pointed you to the problems for using the\nFDL.\n\nThe only part in that section that actually addresses the GPL is:\n\n=====\nThe GPL was designed for programs; it contains lots of complex clauses\nthat are crucial for programs, but that would be cumbersome and\nunnecessary for a book or manual. For instance, anyone publishing the\nbook on paper would have to either include machine-readable \"source\ncode\" of the book along with each printed copy, or provide a written\noffer to send the \"source code\" later.\n=====\n\nThe \"lot of complex clauses ... that would be cumbersome and\nunnecessary\" is greatly outweighed by the huge simplification that\ncomes from having *all* software in a package -- programs,\ndocumentation, data -- licensed the same way, as already addressed in\nthis thread.\n\nThe only specific example given of a problem for the GPL applied to\ndocumentation is the requirement for the recipient to have access to\nthe source. When distributing the package electronically, this is\nobviously no more a problem than for any other part of the\nsoftware. When printing the book, a written offer to provide the\nsource on request is sufficient.\n\n\nIn summary: Please consider that section to be contrary to\ndebian-legal's opinion of licensing. It's the view of most people on\nthis list -- even most of those who *don't* see a problem with the FDL\n-- that it is still better to license all software in a package under\nthe same license terms. If you want to choose the GPL for this,\nthere's no problem with, and great convenience from, licensing all the\nsoftware under those terms.\n\n-- \n \\       \"Kill myself? Killing myself is the last thing I'd ever do.\"  |\n  `\\                                          -- Homer, _The Simpsons_ |\n_o__)                                                                  |\nBen Finney\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}