{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Kayla Peck\" <tyccedviromasal@cedviroma.com>", "subject": "Get your ideal weight with this natural method", "body": "\nGet your ideal weight with this natural method\n\n\n\n\n\n\nAnatrim – The latest and most delighting product for corpulent people is made available now – As were seen on CNN.\n\n\nCan you recall all the cases when you said to yourself you would do anything to get rid of this quickly growing number of kilos? Happily, now no big sacrifice is necessary. Thanks to Anatrim, the earth-shaking kilos-melting medley, you can get naturally health lifestyle and a really slender figure. Just look at what people state!\n\n\n\n\"I hate to confess but I was awfully addicted to food. \n\n\nI ate all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis fatal passion finished when I started course of taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my appetite vanished, \n\n\nmood improved and I’m the happiest person 27 pounds in 2.5 months. \n\n\n\n\nI can tell you now I turned to the happiest person!\"\n\n\n\n\n\nLinda F., San Diego\n\n\n\n\n\n\"Since the very childhood I was a weighty boy. \n\n\nYou can't even fancy how I detested being ridiculed at school. \n\n\n\n\nI hated my stoutness and I detested myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nThis stuff literally dragged me out of this dreadful nightmare! A lot of thanks to you, guys.\"\n\n\n\n\n\nMikkey Fox, San Francisco\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was saved! I got into the circle, depression – eating more – even more depression. My wife was about to leave me as I was turning in overweight psycho. \n\n\nMy friend showed me web page and I ordered up pack of Anatrim right off. \n\n\nThe results were excellent, my appetite became normal, I was in a good mood oftener, and, certainly, I went some belt holes back. And you see, the sex became fantastic, too!\"\n\n\n\n\n\nRikky\n\n\n\n\n There are lots of gratitudes delighted people leave after trying Anatrim. Don’t you wanna join the tens of thousands of slender people and try this natural appetite-suppressing power raising product now!\n\n\nDo not miss your chance!\n\n\n\n\n"}