{"category": "ham", "to_address": "R-help <r-help@stat.math.ethz.ch>", "from_address": "jiho <jo.irisson@gmail.com>", "subject": "[R] Comparing multiple distributions", "body": "Hello eveybody,\n\nI am studying the vertical distribution of plankton and want to study  \nits variations relatively to several factors (time of day, species,  \nwater column structure etc.). So my data is special in that, at each  \nsampling site (each observation), I don't have *one* number, I have  \n*several* numbers (abundance of organisms in each depth bin, I sample  \n5 depth bins) which describe a vertical distribution.\n\nThen let say I want to compare speciesA with speciesB, I would end up  \ntrying to compare a group of several distributions with another group  \nof several distributions (where a \"distribution\" is a vector of 5  \nnumbers: an abundance for each depth bin). Does anyone know how I  \ncould do this (with R obviously ;) )?\n\nCurrently I kind of get around the problem and:\n- compute mean abundance per depth bin within each group and compare  \nthe two mean distributions with a ks.test but this obviously  \ndiminishes the power of the test (I only compare 5*2 \"observations\")\n- restrict the information at each sampling site to the mean depth  \nweighted by the abundance of the species of interest. This way I have  \none observation per station but I reduce the information to the mean  \ndepths while the actual repartition is important also.\n\nI know this is probably not directly R related but I have already  \nsearched around for solutions and solicited my local statistics  \nexpert... to no avail. So I hope that the stats' experts on this list  \nwill help me.\n\nThank you very much in advance.\n\nJiHO\n---\nhttp://jo.irisson.free.fr/\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}