{"category": "ham", "to_address": "Rhelp <r-help@stat.math.ethz.ch>", "from_address": "jiho <jo.irisson@gmail.com>", "subject": "Re: [R] quartz() on MAC OSX", "body": "On 2007-May-21  , at 08:14 , Rolf Turner wrote:\n\n> I am (desperately) trying to get used to using a Mac here at my new\n> location. (Why *anyone* would ever use anything other than Linux,  \n> except\n> under duress as I am, totally escapes me, but that's another story.)\n>\n\nOh that's harsh, Mac OS X is quite a good citizen and probably one of  \nthe best Unices out there. It is true that it has \"its own way of  \ndoing things\" and that's actually why Mac users love their Mac (there  \nis kind of a Mac way of life ;) ). If you try to fight against it,  \nyou'll loose, but if you try to do things the Mac way, it ends up  \nbeing a very efficient desktop (there are several things I know I  \nwould really miss if I had to switch back to Linux: smart folders,  \nnice antialiased graphics, very good font management etc.)\n\n\n> Fortunately much of the Mac OSX is actually Unix, so a civilized  \n> person can\n> manage to carry on ... But there are some things.  (Like this  \n>  deleted> mailer ... But that's another story.)\n>\n\nIf you want OS X to be really unix like, use DarwinPorts (or Fink).  \nBut you need to install additional software and be able to sudo.\n\nOK back to R:\n\n\n> When I ``open'' R using the icon on the ``dock'' several things are\n> unsatisfactory; like I can't clear the screen using system \n> (\"clear\"), nor can\n> I use vi syntax in command line editing.  When I start R from the  \n> command\n> line (as a civilized person would do) these unsatisfactory  \n> circumstances go\n> away, but then a new one rears its ugly head:  I can't plot!!!  If  \n> I try a\n> plot without explicitly opening a plotting device, a postscript  \n> device with\n> file name ``Rplots.ps'' is silently opened.  If I try opening a  \n> device with\n> quartz() to get an on-screen plot, I get a warning message\n>\n> quartz() device interactivity reduced without an event loop manager  \n> in:\n> quartz()\n>\n> And a little coloured wheel spins round and round and the quartz()  \n> window\n> that opens hides underneath the terminal window and appears to be  \n> frozen to\n> the spot.\n>\n> Apparently ``it'' wants .Platform$GUI to be equal to \"AQUA\", but it is\n> (under the circumstances) \"X11\".\n>\n\nYes, this is a known limitation: quartz() has to be started from RGUI  \n(or JGR also I think) and can't be started from the terminal without  \nsome tinkering:\nhttps://stat.ethz.ch/pipermail/r-sig-mac/2004-September/001269.html\n[NB: this question is probably more for the R-SIG-Mac mailing list by  \nthe way]\n\n\n> Trying to open a device using x11() simply results in an error.\n> Is there any way to get a working on-screen graphics window under  \n> these\n> circumstances?\n>\n\nIs X11 installed on you system? Which OS X version do you have?  \nBasically you need 2 things to get x11 going from Terminal.app (i.e.  \nthe mac terminal, not an xterm):\n- to install X11 and launch it\n- to set the DISPLAY variable (to :0.0 for example)\nI have\nexport DISPLAY=:0.0\nin my .bashrc and I can open any x11 application directly from a  \nTerminal.\n\n> I am very much hand-cuffed by the officious ITS policies here as to  \n> what\n> I can install on my Mac.  (Effectively, nothing.)\n\nYou *need* to install additional software on a Mac to do anything  \nelse that email/web/amusement... as with any other platform I guess.  \nSo you'll need to convince your ITs to give you a little more freedom  \nand you'll probably enjoy the Mac afterwards.\n\nIf you want a nice terminal replacement try iTerm (and tweak a bit  \nthe appearance settings to make it easier on the eye). If you want a  \nvery nice text editor (which can actually interact with RGUI or send  \ntext to a Terminal with a running R session) try TextMate. It costs  \n$40 but it's the only shareware I ever bought and I don't regret a  \ncent of it.\n\nCheers,\n\nJiHO\n---\nhttp://jo.irisson.free.fr/\nNB: when I find a little time, I'll add some content to this blog  \nwhich details how to get Mac OS X behave a little bit more like  \nLinux. Everything is written I just need to proofread it and actually  \npost it. Let me know if you are interested.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}