{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "1p 6/15 Update: Astronauts gear up for spacewalk", "body": "\n\n\n\n\n1p 6/15 Update: Astronauts gear up for spacewalk\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 61\nPosted: 11 AM, 6/15/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-55 (06/14/07): Russian engineers troubleshoot computer problem; telemetry restored; false fire alarm sounds\n   SR-56 (06/14/07): Computer system partially revived; troubleshooting continues\n   SR-57 (06/14/07): Shuttle astronauts gear up for more solar array retraction work\n   SR-58 (06/14/07): NASA spaceflight chief, former station astronaut optimistic Russians will resolve computer snafu\n   SR-59 (06/15/07): Mixed results in initial attempts to restart Russian computers\n   SR-60 (06/15/07): Russians shut down computers again for additional troubleshooting; no obvious 'smoking gun' in U.S. power\n   SR-61 (06/15/07: Astronauts gear up for spacewalk\n\n=================================\n\n11 AM, 6/15/07, Update: Astronauts gear up for spacewalk\n\nEditor's Note:\nThis status report will be updated after a news conference with space station program manager Mike Suffredini, who is expected to discuss the current status of the international lab complex and work to repair its crippled computer system. The news conference, originally planned for 12:30 p.m., has been delayed but should begin shortly. See the 7:17 a.m. status report for complete details.\n\n\nThe Atlantis astronauts were awakened around 8:30 a.m. to begin a busy day in orbit highlighted by an afternoon spacewalk to complete the retraction of the P6-2B solar array and the impromptu repair of a pulled up insulation blanket on the shuttle's left-side maneuvering rocket pod.\n\nRussian flight controllers, meanwhile, have told space station commander Fyodor Yurchikhin they don't plan any additional attempts today to restart the Russian segment's computer system. After isolating the system from U.S. solar array power, an attempt was made early today to activate the three-channel navigation system and command-and-control computers. But the navigation system did not boot up and while one of the three channels, or \"lanes,\" making up the central computer came to life, communications were not normal and power to all the computers was shut off one orbit later.\n\nSome engineers had speculated that some subtle quirk in the electrical system feeding power from newly installed solar arrays to the Russian segment might have led to this week's problems. The German-built computers are known to be susceptible to \"noisy\" circuits. But their behavior today in the absence of U.S. power was similar to what was observed earlier in the week. Engineers are continuing to assess the situation.\n\nToday's spacewalk, the third of four excursions planned by the Atlantis astronauts, is highlighted by work to repair the insulation blanket and finish the retraction of the P6-2B solar array. The P6 array was attached to the station in 2000 to provide power during the early stages of assembly. Now, NASA needs to move it to the left end of the station's main power truss to prepare the complex for the delivery of European and Japanese resarch modules later this year and early next.\n\nDuring retraction of the P6-4B array last December, the astronauts ran into major problems and ultimately had to stage an unplanned spacewalk to fold the blankets back in their storage boxes. This time around, the Atlantis astronauts have taken a more deliberate, step-by-step approach, retracting the array about 28 feet before a spacewalk Wednesday in which Pat Forrester and Steve Swanson manually cleared hangups and ultimately got the 115-foot-long array in about half way.\n\nToday, Reilly and Olivas plan to finish the job, although time is available in a fourth spacewalk Sunday if they run into any major problems.\n\nAs for the pulled-up insulation blanket, Olivas, working on the end of the shuttle's 50-foot-long robot arm, plans to push the bent-up corner down flush and use a surgical stapler to secure its edges to adjacent blankets. He also will use steel thread to anchor the blanket in an adjacent row of heat-shield tiles. The work is fairly straight forward as such things go and mission managers are optimistic the repair will stand up to the rigors of re-entry when temperatures on the upper part of the shuttle can reach 1,000 degrees.\n\nHere is a timeline of today's activities (in EDT and mission elapsed time; includes rev. I of the NASA TV schedule):\n\nDATE/EDT...DD...HH...MM...EVENT\n\n06/15/07\n08:38 AM...06...13...00...STS/ISS crew wakeup\n09:18 AM...06...13...40...EVA-3: Airlock repress\n09:33 AM...06...13...55...EVA-3: Hygiene break\n10:00 AM...06...14...22...NASA Video File on NTV\n10:08 AM...06...14...30...EVA-3: Airlock depress to 10.2 psi\n10:28 AM...06...14...50...EVA-3: Campout EVA prep\n11:58 AM...06...16...20...EVA-3: Spacesuit purge\n12:13 PM...06...16...35...EVA-3: Spacesuit prebreathe\n01:03 PM...06...17...25...EVA-3: Crew lock depressurization\n01:08 PM...06...17...30...Station robot arm EVA-3 maneuver\n01:38 PM...06...18...00...EVA-3: Airlock egress\n01:58 PM...06...18...20...EVA-3: Reilly: OMS pod setup\n01:58 PM...06...18...20...EVA-3: Olivas: OMS pod repair\n02:23 PM...06...18...45...EVA-3: Reilly: H2O/H2 vent valve R&R\n03:53 PM...06...20...15...EVA-3: Reilly: OMS pod cleanup\n04:23 PM...06...20...45...EVA-3: P6-2B retraction\n07:23 PM...06...23...45...EVA-3: Cleanup and airlock ingress\n07:38 PM...07...00...00...Work site 3 configuration\n08:03 PM...07...00...25...EVA-3: Airlock repressurization\n08:18 PM...07...00...40...Spacesuit servicing\n08:48 PM...07...01...10...Shuttle robot arm powerdown\n10:00 PM...07...02...22...Mission status briefing on NTV\n11:38 PM...07...04...00...ISS crew sleep begins\n\n06/16/07\n12:03 AM...07...04...25...Robot arm transporter moves from work site 3 to WS-5\n12:08 AM...07...04...30...STS crew sleep begins\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}