{"category": "ham", "to_address": "langa3@flax9.uwaterloo.ca", "from_address": "\"Windows Secrets\" <Editor@WindowsSecrets.com>", "subject": "Svchost.exe gets worse before it's fixed [Newsletter Comp Version]", "body": "\n\nSvchost.exe gets worse before it's fixed\n\n\n\n\n\n\nIf your software garbles this newsletter, read \nthis issue \nat WindowsSecrets.com.\n\n\n\n   \n\n\n\n\n\n\n \n\n\n\n\nYOUR NEWSLETTER PREFERENCES\n Change\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nLocale: United States 90210\nReader number: 83107-13329\n\n\n   \n\n\n\n\n\n   \n\n\n\n\n Home \n Newsletter \n WinFind \n Reviews \n Polls \n Contact \n \n\n\n\n\n This issue \n Past issues \n Upgrade \n Prefs \n Unsubscribe \n \n\n\n\n\n   \n\n\n\n\n\n   \n\n\nWindows Secrets Newsletter • \nIssue 112 • \n2007-06-21 • \nCirculation: over 270,000\n\n\n\n \n\n\n\n\n\nGet a gift for sending a tip\n\n\n\nIt's amazing to me what a quarter-million pairs of eyes can dig up \nin Microsoft Windows. For years, I've sent a treat to readers who've \nlet me know about Windows undocumented features. \nYou'll receive a gift certificate \nthat's good in any country in the world if you're the first to send \nin a tip that's printed. This week, the newsletter has begun a new column \ncalled Insider Tricks in the paid section to make even more room for your \nfindings. Thanks for your help! \n—Brian Livingston, Editorial Director\n\nTo send a tip:\n Use our contact page\nTo get the paid version:\n How to upgrade\n\n\n\n   \n\n\n\n\n\n\n   \n\n\n\n \nContents\n\n\nTOP STORY: Svchost.exe gets worse before it's fixed\nKNOWN ISSUES: ZoneAlarm now supports Vista, offers free extensions\nWACKY WEB WEEK: Don McMillan explains how not to use PowerPoint\nINSIDER TRICKS: Laptop protection while surfing made easier\nWOODY'S WINDOWS: Vista time-saver #8 — tweaking the interface\nPERIMETER SCAN: Browsers: the difference between \"safe\" and \"secure\"\nYOUR SUBSCRIPTION: How to change your address or unsubscribe\n\n   \n\n\n\n\n\n\n\n   \n\n\nFor links to every topic in this issue, scroll down to the \nIndex\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nRemotely monitor your PC from anywhere\nSnoopStick is a USB device that allows you to securely monitor activity on your PC from any Windows-based computer, anywhere. Monitor IM, browser activity, e-mail, and control access to Internet services. Great for parents and employers.\nwww.snoopstick.com\n\n\n\n\n\n\n\n\n\n \n\nForget Vista, make your XP system faster\nPC Pitstop's Optimize Scan 1.5 is easy-to-use software  that will automatically diagnose problems with your PC and give you a custom report detailing issues that are hurting your PC's performance. Run this free scan now!\nwww.pcpitstop.com\n\n\n\n\n\n\n\n\n\n \n\nDeep Six anti-spam appliance for SMBs\nPatented technology stops spam at the network edge. Designed for SMBs: the DS200 is the lowest cost, most accurate solution available. Easy to install and maintain. Recent firmware release features new Management GUI and enhanced tools. Try it risk-free.\nwww.tyrnstone.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\n\nTOP STORY\n\n\nSvchost.exe gets worse before it's fixed\n\n\n\n\n\n\n\n\n\nBy\nScott Dunn\n\nProblems with an important Windows component, svchost.exe, can \nconsume up to 100% of CPU time.\n\nNow, a beta release of Windows Live Messenger threatens to spread the problem to \neven more users, unless their systems are patched soon.\n\n\n\n\n\n\n\n\nThe svchost.exe saga has persisted for months\n\n\n\nReaders of the paid version \nof Windows Secrets are familiar with this story by now. Editorial director \nBrian Livingston first reported the issue nearly a year ago, on \nJuly 27, 2006.\nContributing editor Susan Bradley \nhas documented Microsoft's attempts to solve it in the\n Jan. 18, \n Apr. 19, \n May 10, and \n May 24 issues this year.\nThe problem has risen to a such a degree that we feel all Windows users \nshould be aware of it.\n\nMicrosoft has long known of issues with svchost.exe — the process \nthat runs services of DLLs (dynamic link libraries). There are many symptoms associated with the problem. Among the most common is a drastic slowdown of computer performance as svchost.exe consumes memory and CPU \ncycles.\n\nThe cause of the issue turned out to be the service that provides \nAutomatic Updates. In response, many users began disabling \nMicrosoft Update, an enhanced version of the more-limited Windows \nUpdate.\n\nRecently, users who installed the beta 8.5 version of Microsoft's \nWindows Live Messenger found that Microsoft Update is automatically turned \non, with no choice for opting out. If you don't read the initial installer \ndialog carefully, you might not even notice what has happened. The practice \npotentially exposes an even wider number of users to the svchost.exe \nbug. (For more information, see a posting by a blogger named \n Pharod.)\n\nFigure 1. The Windows Live Beta installer turns on auto-updates \nand switches to Microsoft Update from Windows Update.\n\n\n\n\nDiagnosing the problem on your own system\n\n\n\nHow do you know if you have this problem? If your system is experiencing a \ndramatic slowdown, try launching Windows Task Manager to see. To do this, \nright-click the Task Bar, the area to the right of the Start button, (or \npress Ctrl+Shift+Esc) and choose Task Manager. Make sure the Processes tab is \nactive, and click Image Name to sort the list. You'll see one or more instances \nof svchost.exe. If the CPU column shows 100%, or the memory\nusage seems extraordinarily high, you may be experiencing this bug.\n\nMicrosoft has detailed other symptoms in Knowledge Base article \n\n927891. These include an access violation\nerror in svchost.exe and unresponsive systems during update scans by \nWindows Update or Microsoft Update.\n\nSome users respond by selecting the memory-hogging svchost.exe in Task Manager's Processes tab and clicking End Process.\nUnfortunately, doing so can kill other services your system needs, such as audio. And, it won't prevent the problem from returning later.\n\nThe bug affects users of XP (all versions, including XP Media Center), \nWindows Server 2003, and Windows 2000.\n\n\n\n\nWhat to do if you're affected\n\n\n\nTo solve this problem, Microsoft is offering a \ntwo-part fix. The first part has been offered to those who use Automatic \nUpdates since May 22, according to a source at Microsoft who asked not to \nbe named. Microsoft has been rolling out the second patch to users gradually, \nbeginning in early May, and expects to complete delivery by the end of June, \naccording to my source. Those who don't use Automatic Updates — or \nwho haven't received both fixes and want them sooner — can follow the \nsteps below:\nStep 1. Patch msi.dll. Users need to replace the msi.dll file \n(the Microsoft Installer DLL) that svchost.exe controls. To do this, \ndownload and install the patch from Knowledge Base article\n\n927891.\nStep 2. Update Windows Update. Users also need to get the latest Windows \nUpdate client, which is version 3.0. Links to the 32- and 64-bit versions can be \nfound at the Windows Server Update Services (WSUS) Product Team\n blog.\n\nAlthough previous Microsoft fixes to svchost.exe — nearly a \nhalf-dozen in the last 10 months — addressed specific issues for \nsome users (such as patching memory leaks or eliminating svchost.exe \ncrashes, according to my source), none have solved all the problems once \nand for all. Even the patches \nMicrosoft currently offers will not stop svchost.exe from \nregistering 100% CPU usage in Task Manager's Processes tab at times. \nBut, the company claims, your system should still be responsive and \nsvchost.exe will share CPU cycles with other processes after \nboth patches have been installed.\n\nUnfortunately, Microsoft did not wait for these patches to be \ndelivered to everyone before issuing a Windows Live Messenger beta \nthat switches users from Windows Update to Microsoft Update. This introduced \nthe problem to some users who had not experienced it before.\n\nMicrosoft is confident that it has developed an effective solution to \nthis problem. Hopefully, this time the company's right.\n\n\n\t\t\t\tReader, please rate the above article:\n1: Poor \n\t\t\t\t2: Fair \n\t\t\t\t3: Good \n\t\t\t\t4: Great  5: Superb\n\n\n\nScott Dunn is associate editor of the Windows Secrets Newsletter. He is \nalso a contributing editor of PC World Magazine, where he has written a \nmonthly column since 1992, and co-author of \n 101 Windows Tips & Tricks (Peachpit) with Jesse Berst and Charles Bermant.\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nLearn to use Vista like a pro\nMaster Vista with 19+ hours of video training that covers everything. Step-by-step instruction guides you through what's new in Vista, Installation, Group Policy, Security, Networking, Administration, IE7, and lots more. View our free demo now!\nwww.TrainSignal.com\n\n\n\n\n\n\n\n\n\n \n\nBackup your data with ZipBackup\nFinally, a backup program that is easy to use.  ZipBackup's Wizard makes backups a snap for beginners. Filtering,  scheduling, and disk spanning make it a powerful tool for experts. For a limited time, Windows Secrets readers receive 25% off.\nwww.zipbackup.com\n\n\n\n\n\n\n\n\n\n \n\nNew add-on for parental control software\nNew software is a great addition to any parental control suite. BuyBlock prevents kids from shopping, filling out registration forms, and signing onto social networks. No setup or monitoring required. Get your risk-free trial here!\nwww.buyblock.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\n\nKNOWN ISSUES\n\n\nZoneAlarm now supports Vista, offers free extensions\n\n\n\nBy \nScott Dunn\n\nFor months, ZoneAlarm Internet Security Suite has claimed on its box to be \"Vista ready,\" but users found otherwise.\n\nFortunately, the company has now released a Vista version of the suite and promises to make it up to customers.\n\n\nFree sub extension for ZoneAlarm customers\n\n\nIn the \n June 7 issue, I responded to reader complaints that the ZoneAlarm \nInternet Security Suite (which I'd discussed in the \n May 24 issue) did not support Windows Vista, despite its product labeling \nsaying so. Soon thereafter, I received a phone call from Allison Wagda, \ndirector of public relations at Check Point, the maker of ZoneAlarm products. \nShe announced that Vista versions of the suite and its products would be \navailable immediately, and apologized to customers who were affected by the delay in getting the products out.\n\n\"We are offering anyone who purchased the suite a six-month extension \non their subscription to make up for the loss,\" \nWagda told me.  Check Point is also offering a refund to customers\nwho would rather return the product. To take advantage of these offers, \ncustomers in the U.S. should call 1-877-966-5221. Those outside the U.S. \nshould call +49 1805 104777 in Germany.\n\n\n\nMore on EULAs and transparency\n\n\n\nReferring to my conversation with Ed Foster on the subject of End User \nLicense Agreements (EULAs) in the \n\nJune 7 issue, reader Rich Painter has this comment:\n\n\n\n\"It was my understanding that the EULA was part of a contract between the buyer \nand the seller, and as such, if the buyer does not want to or cannot comply with \nthe EULA during the installation then the buyer has the right to a full refund. \nSeveral years ago, I disagreed with a EULA during the installation.  I packed it \nback up and took it back to the place I bought it from. I told them I did not \nagree to the EULA and demanded my refund.  They \ncomplied.\"\n\n\nI'm glad that worked for you, Rich. But think how annoying it is to have to \nbuy a product, open the package, and run\nthe installer before you know the terms of the contract.  Software developers \nneed to make this information simpler to understand, \nand make it available to customers before they make their purchase.\n\n\n\nRecalling EasyFlow's clear EULA language\n\n\n\nReader Walter Black enjoyed our mention of the 1980s product EasyFlow and \nits plainly worded license agreement in our \n\nJune 14 issue. He offers these words of praise for the product:\n\n\n\"I have been an enthusiastic EasyFlow user since the early 1980s, because the program does exactly what it claims to do, is unpretentious to a fault, and the entire user manual is written with the style and substance of the license agreement. The manual could (or maybe should) be used in the curriculum of any technical writing course.\"\n\nWalter also provides a quote from the manual:\n\n\n\"Fools Rush In: This section is for those of you who want to jump into the business of using EasyFlow to produce charts with a minimum of reading the manual. If you are in too big a hurry to read even these few pages, then we recommend our product 'HardFlow' (a charting template and a pencil); HardFlow has a lot of faults, but having to spend time reading the manual isn't one of them.\"\n\n\nWalter adds:\n\n\n\"The section continues with a two-page whirlwind overview and then over 100 pages of concise and detailed description of program features.\n\n\"Many thanks for the article, and for the fond memories that it recalled of my participation in software development of that time.\"\n\n\nThank you, Walter, for the chance to discuss a piece of software \nhistory.\n\nReaders Painter and Black will receive gift certificates for \na book, CD, or DVD of their choice for sending us comments that we \nprinted.\n\n\nContents\n Index\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nGet your product seen by 270,000 readers\nDoes your company offer a product or service? Now you can place an ad in the Windows Secrets Newsletter and be seen by more than 270,000 active buyers of PC hardware and software. Bid as much or as little as you like to get the ideal ad placement.\nwww.WindowsSecrets.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\nTELL A FRIEND\n\nHow you can share this information\nWe love it when you send your friends links to our articles. But please don't \nforward your copy of our e-mail newsletter to people, which subjects us to spam \ncomplaints. Instead, simply suggest that your friends visit this issue's permanent \nWeb address, shown below. A complete index at the bottom of the \nWeb page provides you with hyperlinks to any article you'd like to recommend.\n\nThe address of this issue is http://WindowsSecrets.com/comp/070621\n\n   \n\n\n\n\n   \n\n\n\n\n\nEDITOR'S BOOKSHELF\n\n\n\n \n\n\n\nGet the tips you need about Windows Vista\n\n\n\nThe all-new Windows Vista Secrets helps novices \nand experts alike understand Microsoft's latest operating system. \n\"To really appreciate what is in Vista, you almost \nneed to read through the leading book on the product, Windows Vista \nSecrets, by Brian Livingston and Paul Thurrott,\" writes Rob Enderle, \nprincipal analyst of the Enderle Group, in TechNewsWorld. \"It's 595 \npages of things you can do with this product — most of which \nyou probably wouldn't have discovered for some time, let alone right \nat first.\" Check the book out now for tips you can use.\nMore information:\n United States / \n Canada / \n Elsewhere\n\n \n\n\n\nSpam-Proof Your E-Mail Address, 2nd Ed.\n\n\n\nThis 32-page e-book by Brian Livingston gives you step-by-step instructions that \ncan prevent 97% of the spam that would otherwise clog an e-mail\naccount. You could call it \"Livingston's Spam Secrets.\" The PDF e-book\nis the result of months of experiments and tests we conducted. We now\nreceive little or no spam to the addresses we used as guinea pigs. These tests\nshow that you can make your e-mail addresses invisible to spammers,\nnot just battle an ever-growing flood. The methods we describe\nwork with Windows, Apple, and Linux and don't require any filters or block\nlists — but you can use those in addition to the book's techniques,\nif you wish. \n\nMore info\n\n   \n\n\n\n\n\n   \n\n\n\nContents  \nIndex\n\n   \n\n\n\n\n   \n\n\n\n\nWACKY WEB WEEK\n\n\n\nDon McMillan explains how not to use PowerPoint\n\n\n\n\n\n\n\n\n\n\n\nWe've all seen PowerPoint presentations run amok. The melange of fonts, the garish colors, the bullet lists that go on forever.\n\nThese mishaps are not lost on comedian Don McMillan. In this short clip, he provides some quick pointers for keeping your PowerPoint presentation from becoming a multimedia nightmare.\n\nWatch the video\n\n\n\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n\n   \n\n\n\n\nINDEX\n\n\n\nThe following topics appear in the free version\n\n\n\n\n\nTOP STORY  \nSvchost.exe gets worse before it's fixed\n\n \nThe svchost.exe saga has persisted for months\n\n \nDiagnosing the problem on your own system\n\n \nWhat to do if you're affected\n\n \n \n\n\nKNOWN ISSUES  \nZoneAlarm now supports Vista, offers free extensions\n\n \nFree sub extension for ZoneAlarm customers\n\n \nMore on EULAs and transparency\n\n \nRecalling EasyFlow's clear EULA language\n\n \n \n\n\nWACKY WEB WEEK  \nDon McMillan explains how not to use PowerPoint\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou get all of the following in the paid version\n\n\nINSIDER TRICKS  \nLaptop protection while surfing made easier\n\n \nDisable wireless file sharing globally\n\n \nUpdate the wireless client in Windows XP SP2\n\n \n \n\n\nWOODY'S WINDOWS  \nVista time-saver #8 — tweaking the interface\n\n \nWhat's a TweakUI?\n\n \nHere's my standard Registry disclaimer\n\n \nHow to change Vista's registered owner\n\n \nRemoving arrows from your shortcuts\n\n \nA grab bag of miscellaneous tweaks\n\n \nOld tweaks that don't work\n\n \nGot any good tweaks?\n\n \n \n\n\nPERIMETER SCAN  \nBrowsers: the difference between \"safe\" and \"secure\"\n\n \nMaking a browser safe versus secure\n\n \nOpera could be safer, too\n\n \nWe know Safari is broken\n\n \n \n\n\n\nPaid subscribers can access all old and new paid newsletter content\nMake a contribution to support our research into Windows and you'll immediately\nbe able to read and search through scores of valuable articles. In addition,\npaid subscribers are entitled to download valuable content that we license for\nyou at least once every calendar quarter.\nTo upgrade, simply make a contribution of any amount you choose.\nIf you do this by June 27, 2007, \nyou'll instantly be sent the full, paid version of today's newsletter.\n\nTo upgrade to the paid version of the Windows Secrets Newsletter, please visit our \n upgrade page.\n\nThanks in advance.\n\n\n   \n\n\n\n\n\n   \n\n\n\nContents\n Index\n\n\n   \n\n\n\n\n\n   \n\n\n\nYOUR SUBSCRIPTION\n\nThe Windows Secrets Newsletter is published weekly on \nthe 1st through 4th Thursdays of each month, plus occasional news updates. \nWe skip an issue on any 5th Thursday that occurs, plus Thanksgiving \nWeek and the last two weeks of August and December.\nPublisher: WindowsSecrets.com LLC, Attn.: #120 Editor, 1700 7th Ave., \nSuite 116, Seattle, WA 98101-1323 USA. Vendors, please send no unsolicited \npackages to this address (readers' letters are fine).\nEditorial Director: Brian Livingston. Editor-at-Large: Fred Langa. \nAssociate Editor: Scott Dunn. Contributing Editors: Susan Bradley, Mark Edwards, \nWoody Leonhard, Chris Mosby, Ryan Russell. Research Director: Vickie Stevens. \nProgram Director: Brent Scheffler. Managing Editor: Jody Braverman.\nTrademarks: Microsoft and Windows are registered trademarks of Microsoft \nCorporation. The Windows Secrets series of books is published by\n Wiley Publishing Inc. The Windows Secrets Newsletter,  \nWindowsSecrets.com, LangaList, LangaList Plus, WinFind, Security Baseline, \nPatch Watch, Perimeter Scan, Wacky Web Week, the Logo Design (W, S or road, \nand Star), and the slogan Everything Microsoft Forgot to Mention all are \ntrademarks and service marks of WindowsSecrets.com LLC. All other marks \nare the trademarks or service marks of their respective owners.\n\n\nYOUR SUBSCRIPTION PREFERENCES\n(change \nyour preferences):\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nCountry: United States\nZIP or postal code: 90210\nReader number: 83107-13329\nBounce count: 0\n\nYour bounce count is the number of times your server has bounced a \nnewsletter back to us since the last time you visited your preferences page. \nWe cannot send newsletters to you after your bounce count reaches 3, due to ISP \npolicies. If your bounce count is higher than 0 or blank, please visit your\n preferences page. This automatically resets your bounce count to 0.\nTo change your preferences: Please visit your \n preferences page.\nTo access all past issues: Please visit our\n past issues page.\nTo upgrade your free subscription to paid: Please visit our \n upgrade page.\nTo resend a missed newsletter to yourself: \nIf your mail server filtered out a newsletter, you can \nresend the current issue to yourself. To do so, visit your\n preferences page and use the Resend link.\nTo get subscription help by e-mail (fastest method): Visit our \n contact page. Subscription help by facsimile:\n206-282-6312 (fax). Emergency subscription help by phone: \n206-282-2536 (24 hours).\n\nHOW TO SUBSCRIBE: Anyone may subscribe to this newsletter by visiting our \n free signup page.\nWE GUARANTEE YOUR PRIVACY:\n\n1. We will never sell, rent, or give away your address to any outside \nparty, ever.\n2. We will never send you any unrequested e-mail, besides \nnewsletter updates.\n3. All unsubscribe requests are honored immediately, period.  \n Privacy policy\nHOW TO UNSUBSCRIBE: To unsubscribe\nlanga3@speedy.uwaterloo.ca\nfrom the Windows Secrets Newsletter,\n\nUse\nthis 2-click\n Unsubscribe link; or\nSend\na blank e-mail to\nunsub@WindowsSecrets.net with leave langa3@speedy.uwaterloo.ca\nas the Subject line; or\nVisit our \nUnsubscribe page.\n\n\nCopyright © 2007 by WindowsSecrets.com LLC. All rights reserved.\n\n\nContents\n Index\n\n\n\n\n\n\n   \n\n\n\n\n\n"}