{"category": "spam", "to_address": null, "from_address": "ray carter <ray_carter_104@hotmail.com>", "subject": "CONGRATULATION MICROSOFT LOTTERY WINNING NOTIFICATION ", "body": "\n\n\n\n\n\n  \nFROM:LINDA ROSE \nMICROSOFT AWARD TEAM\n20 CRAVEN PARK,HARLESDEN,\nLONDON,NW10,ENGLAND,\nUNITED KINGDOM.\nCONGRATULATIONS!  CONGRATULATIONS!!  CONGRATULATIONS!!!\nATTENTION:DEAR WINNER,\nWE HAPPILY ANNOUNCE TO YOU THE DRAW OF THE MICRSOFT AND AMERICA ONLINE [AOL] SWEEPSTAKE LOTTERY INTERNATIONAL PROGRAM HELD  THIS MONTH MARKING THE YEAR 2007 ANNIVERSARY .WE ROLLED OUT OVER US$ 4,419,864 FOR OUR END OF YEAR ANNIVERSARY DRAWS. PARTICIPANTS FOR THE DRAWS WERE RANDOMLY SELECTED  AND DRAWN FROM A WIDE RANGE OF WEB HOSTS WHICH WE ENJOY THEIR PATRONAGE.\nTHE SELECTION WAS MADE THROUGH A COMPUTER DRAW SYSTEM ATTACHING PERSONALISED EMAIL ADDRESSES TO TICKET NUMBERS. IF YOU IGNORE THIS, YOU WILL REGRET IT LATER. MICROSOFT AND AOL ARE NOW THE LARGEST INTERNET COMPANIES AND IN AN EFFORT TO MAKE SURE THAT INTERNET EXPLORER REMAINS THE MOST WIDELY USED PROGRAM, MICROSOFT AND AOL ARE RUNNING AN E-MAIL BETA TEST.\nYOUR EMAIL ADDRESS AS INDICATED WAS DRAWN AND ATTACHED TO REFERENCE AND TICKET NUMBER 008795727498 WITH SERIAL NUMBERS BTD/9080648302/07,REF: BTD/968/05,BATCH: 409978E AND DREW THE LUCKY NUMBERS 14/21/25/39/40/47 BONUS BALL:20 WHICH SUBSEQUENTLY WON YOU 1,350,000.00 (ONE MILLION THREE HUNDRED AND FIFTY THOUSAND GREAT BRITAIN POUNDS)  AS ONE OF THE 5 JACKPOT WINNERS IN THIS DRAW. YOU HAVE THEREFORE WON THE ENTIRE WINNING SUM OF 1,350,000.00 (ONE MILLION THREE HUNDRED AND FIFTY THOUSAND GREAT BRITAIN POUNDS) IN THE SECOND CATEGORY,AND THEREFORE FALLS WITHIN OUR AFRICAN BOOKLET REPRESENTATIVE OFFICE IN AFRICA [SOUTH AFRICA]THE DRAWS REGISTERED AS DRAW NUMBER ONE WAS CONDUCTED IN BROCKLEY,LONDON,ENGLAND,UNITED KINGDOM THREE DAYS AGO.THESE DRAWS ARE COMMEMORATIVE AND AS SUCH SPECIAL.                 \nPLEASE BE INFORMED BY THIS WINNING NOTIFICATION,TO FILE YOUR CLAIMS,YOU ARE TO MAKE CONTACT WITH YOUR DESIGNATED AGENT WHO SHALL BY DUTY GUIDE YOU THROUGH THE PROCESS TO FACILITATE THE RELEASE OF YOUR PRIZE.TO FILE FOR YOUR CLAIM PLEASE CONTACT YOUR AFRICAN FUDICIARY AGENT IN SOUTH AFRICA WITH THE CONTACT INFORMATION BELOW:\n \nRAY CARTER,\nCARTER & ASSOCIATES.  SOLICITORS, CONVEYANCERS & NOTARY PUBLICEMAIL: ray_carter_1@yahoo.co.uk\nTEL:  +27-83-877-66-35 \n \n4TH FLOOR, ELEPHANT HOUSE\n107 MARKET STREET CNR VON WILLIEGH JOHANNESBURG2001,POST ADDRESS P.O.BOX 61618MARSHALLTOWN,2107\nJOHANNESBURG,\nREPUBLIC OF SOUTH AFRICA\n \nOUR SPECIAL THANKS AND GRATITUDE TO BILL GATES AND HIS ASSOCIATES.WE WISH YOU THE BEST OF LUCK AS YOU SPEND YOUR GOOD FORTUNE IN THIS SEASON.\n \nNOTE: PLEASE BE INFORMED THAT ALL WINNING MUST BE CLAIMED ON OR BEFORE 30 DAYS FROM THE DATE OF RECEIPT OF THIS NOTIFICATION OR YOU MAY FOREFEIT YOUR WINNING. TO AVOID UNNECESSARY DELAYS AND COMPLICATIONS, PLEASE QUOTE YOUR REFERENCE/BATCH NUMBERS IN ANY CORRESPONDENCES WITH OUR DESIGNATED AGENTS OR US.IN COMPLIANCE WITH THE SPONSORING BODIES,YOU ARE TO MAKE A REMITTANCE OF A PART OF YOUR WON FUND,NOT LOWER THAN 10-PERCENT, AFTER RECEIVING YOUR ALLOCATION TO A CHARITY ORGANISATION.THANK YOU FOR BEING PART OF OUR COMMEMORATIVE END OF YEAR ANNIVERSARY DRAWS.\nSINCERELY YOURS,\nMRS. LINDA ROSE. MICROSOFT PROMOTION TEAMVICE PRESIDENT\nExplore the seven wonders of the world Learn more!\n"}