{"category": "ham", "to_address": "\"\" <ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"The Internet Patrol\" <info@theinternetpatrol.com>", "subject": "\n The Internet Patrol -  ISPs Inserting Ads In Your Browsing Experience to Cash in on the Internet Ad Boom", "body": "\n\n\n\nMailer 04\n\n\n\n \n The Internet Patrol\n \n\n\n\nThe Latest News at the Internet Patrol\n Here is today's news from the Internet Patrol!  \nNote: We are testing new formats for the Internet Patrol mailings!  Please let us know what you think at info@theinternetpatrol.com!\n\n\n\n ISPs Inserting Ads In Your Browsing Experience to Cash in on the Internet Ad Boom \n\n\n  2007-06-24 22:02:06-04  \n  Not to be left out of the Internet Ad boom (such as those ubiquitous \"Ads by Google\" Adsense ads), it has been discovered that ISPs are cashing in on the ad money craze by inserting ads into your browsing experience - that is, as you are browsing from website to website, your ISP may be adding their own contextually matched ads for you to see, overlayed on top of what you are browsing, based on what you are browsing! \nRead more...\n\n\n\n Here are some amazing deals we've found on the Internet for ourselves recently: \nYou Can Backup Your Computer Now for Free!  Use the Same Online Backup Service that We Do! \n Get gadget insurance for your cell phone, PDA and all your electronic gadgets, to protect against los or theft!  http://www.theinternetpatrol.com/get-your-stuff-back-with-stuffbak-pdas-laptops-cell-phones-protect-them-all \n Send Unlimited Newsletters to Your Customers, Friends, Family, and Others:  http://www.theinternetpatrol.com/the-perfect-way-to-send-email-newsletters\n  Unlimited Calls to Any Phone in the U.S.:  http://www.theinternetpatrol.com/make-unlimited-phone-calls\n Check out our online audio show, \"Three Things You Should Know\"!  http://www.ThreeThingsYouShouldKnow.com\n And check out the best collection of how to videos at http://www.LearnHowTo.TV ! \n Know somebody who would like to receive these alerts?  Forward this one to them and let them know that they can sign up for free by sending email to internetpatrol@aweber.com with the  word 'Subscribe' in the subject! \n  \n   About the Internet Patrol\n  The Internet Patrol is maintained by the Institute for Spam and Internet Public Policy, and written by ISIPP President Anne P. Mitchell, Esq. ISIPP provides analysis, information, and consulting on industry issues, policies and processes regarding email and the Internet. \n    \n\n\n  The Internet Patrol, \n302 W. El Camino Real, #411, \nSunnyvale, CA 94087, USA  \n\n\n\n\n\n\nTo unsubscribe or change subscriber options visit:\nhttp://clients.suretymailings.com/z/r/?TBwMLMwctMzsTCxMTJzs\n\n\n\n"}