{"category": "ham", "to_address": "\"Gerald (Jerry) Carter\" <jerry@samba.org>", "from_address": "simo <idra@samba.org>", "subject": "Re: svn commit: samba r22713 - in\n\tbranches:\tSAMBA_3_0/source/nsswitch SAMBA_3_0_26/source/nsswitch", "body": "On Sun, 2007-05-06 at 20:29 -0500, Gerald (Jerry) Carter wrote:\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA1\n> \n> Simo,\n> \n> > You basically reverted some code you already committed \n> > and I changed in 3_0_25. Right now each single backend\n> > init function can cope with the offline mode. Each one\n> > has a delayed initialization mode, so point (c)\n> > should not be needed.\n> \n> but it is and it now works completely.  Give me another\n> day to finish testing the merge.\n> \n> > The query code should also be able to cope with \n> > offline requests, that's the whole point of returning\n> > ID_EXPIRED, so that in case we can't really\n> > resolve we keep it, otherwise we get the correct return.\n> \n> No.  The backend should never be hit at all when\n> in offline mode.  That it the point of having the cache.\n\nYes, the cache should help, but there are still some backends that can\nsafely be queried when offline.\n\n> This way the local and remote backends work the\n> same way.  You don't want to allocate ids in offline mode\n> as you are not always able to validate the SID.\n\nIn fact you shouldn't allocate if you are not able to validate the SID.\nWhen offline allocation functions should probably not be called\n(previously the validation code was in idmap so it was easy to avoid\nproblems ...)\n\n> \n> > Basically the problem of avoiding the query completely \n> > is that you also avoid querying\n> > idmap_tdb/idmap_rid/idmap_passdb/idmap_nss.\n> > they all the mappings and can be consulted when offline\n> > without problems.\n> \n> true.  I'll continue to revisit this.  But things were\n> not working an now they are.  I don't want to have different\n> backends working in different ways and require each backend\n> to be debugged for offline mode individually.\n> \n> Just give me another day pleas and we can then discuss\n> it more.  Thanks\n\nSure, np.\n\nSimo.\n\n-- \nSimo Sorce\nSamba Team GPL Compliance Officer\nemail: idra@samba.org\nhttp://samba.org\n\n"}