{"category": "spam", "to_address": "<ktwarwic@flax24.uwaterloo.ca>", "from_address": "\"The Bull Report\" <news@thebullreport.com>", "subject": "News update: SUN Second Fight Broadcast on HDNet", "body": "    To view this email as a web page, go    here.     \n\n\nThe Bull ReportMay 31th, 2007\nSUN Second Fight Broadcast on HDNet DALLAS, TX--(MARKET WIRE)--May 31, 2007 -- SUN Sports & Entertainment Inc. (Other OTC:SSPE.PK - News) announced the \"Art of War 2,\" shot and produced May 11th, 2007 in Austin, TX, was seen LIVE for the first time exclusively on HDNet, Friday, May 25th, 2007 @ 9:30pm EDT.\nPart One of the two part feature segment for \"Art of War 2\" featured MMA Fighters; Pineda vs. Stewart, Flourney vs. Lewis, Stelly vs. Akensson, Thompson vs. Wren, and the Main Event of the three round Heavyweight unanimous decision Fight of (3X UFC Veteran) Sims vs. Guillen.\nSUN CEO CJ Comu stated, \"The quality of the fights on HDNet are absolutely incredible. The viewers can witness firsthand some terrific action in the cage. The new robotic technology used in filming the event also was a first for SUN and could potentially lead to clear unobtrusive viewing for fans at live events. This was a loud and passionate crowd and every fight on the card showcased a variety of techniques used in their win.\"\nRead the full release on SSPE\nRead the full disclaimer Click here\n\n\n\n\n\n                                    This email was sent to:  ktwarwic@flax24.uwaterloo.ca\n\n\n\n\n                                                            This email was sent by: The Bull Report                                                                                                              \n                                                            1846 rosemeade 104 dallas, TX 75007 USA \n                                                            \n\n\n          \n                                    We respect your right to privacy - view our policy\n\n\n\n\n\n\n\n\n\nManage Subscriptions | \n                                    Update Profile | \n                                    One-Click Unsubscribe\n\n\n\n\n\n"}