{"category": "ham", "to_address": "<anders@chem.au.dk>, <r-help@stat.math.ethz.ch>", "from_address": "\"S Ellison\" <S.Ellison@lgc.co.uk>", "subject": "Re: [R] hierarhical cluster analysis of groups of vectors", "body": "Anders;\n\nIf you want to _test_ for differences, ANOVA applied to on the (typically) first principal component scores for each object would  give a fairly quick indication of whether there was a case to answer (though scaling is an issue to be aware of; a low-variance variable might differ strongly between groups yet be masked by a larger variance variable wiht no group association unless you get the scaling right for the circumstances).\n\nIf you just want to cluster the 10 groups, I suspect it might be simplest to \"average\" (where \"average\" implies some consistent summary statistic for each variable) your starting vectors, _before_ playing about with your distance matrix; after all, it is the inter-\"mean\" distances you are after, so why not get the \"means\" in the first place?. Of course, scaling is again an issue if the variables differ in variance...\n\n\nSteve E\n\n\n>>> Anders Malmendal  29/05/2007 10:15:23 >>>\nI want to do hierarchical cluster analysis to compare 10 groups of \nvectors with five vectors in each group (i.e. I want to make a dendogram \nshowing the clustering of the different groups). I've looked into using \ndist and hclust, but cannot see how to compare the different groups \ninstead of the individual vectors. I am thankful for any help.\nAnders\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help \nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html \nand provide commented, minimal, self-contained, reproducible code.\n\n*******************************************************************\nThis email and any attachments are confidential. Any use, co...{{dropped}}\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}