{"category": "ham", "to_address": "beginners@perl.org", "from_address": "p46921x@hotmail.com", "subject": "Help creating a random string in Perl", "body": "\nHello, this is perl.beginners and I am really a beginner. This is also\nmy first Google group post so if I am in the wrong group, I am sorry.\n\nI need to create a random combination of n-1 characters in a source\nstring. For example if the string is ABcDeFG (7 characters)\n* I want to execute my perl script and get ABDeFG (6 characters)\n* I execute my perl script a second time and get GABcDe (6 characters)\n* I do it a third time and get AcBeDG (6 characters)\n* etc\n\nAlso\n\n1. Only characters in the source string are in the random string\nmeaning if Z is not in my source string, it will not be in my random\nstring. If A and B are in the source string, then at least one of them\nwill be in the random string.\n2. Each source string will only contain one of the same characters, ie\nABcDeFG is a valid source string but  there will be no source strings\nlike ABBDeFG  (as it contains two \"B\"s).\n3. Each random string has one less character than the source string,\nie the source string ABcDeFG has 7 characters but the random strings\nABDeFG and GABcDe and AcBeDG have 6 characters.\n\nI can see how to generate a random number between 0 and 6 (meaning I\ncan pick one of the 7 characters in my source string) by using \"print\nint(rand(6))\",  but I don't know where to being on the second and\nthird and fourth characters to and check that the random number hasn't\nalready been chosen.\n\n\nAny help would be welcome. The more cryptic the better as it will\nforce me to understand what the Perl does ;)\n\nThank you\nRichard\n\nps: I hope you don't mind but because I don't want spam, I have\ncreated this email address specifically to post to Google groups. If\nyou are going to reply and I hope you do, please post to the Google\ngroup as my email address will not be monitored.\n\nps: This isn't for school, it's sort of for fun for a program I am\nwriting to do crosswords.\n\nps: When I type perl - version, I see this as my version number\n\"v5.8.8 built for i486-linux-gnu-thread-multi\".\n\nps: I have \"Learning Perl 4th edition from Randal Schwartz\". It is a\ngood book but doesn't describe the type of things I need to do. I have\naccess to Google but haven't been able to search a good link for the\ntype of random string code to work from for my problem.\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}