{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "Terry Hancock <hancock@anansispaceworks.com>", "subject": "Re: [cc-community] Multinational Profit Day", "body": "David Berry wrote:\n> Myspace? Facebook? Youtube? Web 2.0?  Wrap free user-produced content  \n> in advertising, subscription and micropayments? Make millions through  \n> an IPO? Cash out on all the sucker investors and pensions companies  \n> who can't tell new technology from their elbow? Another stock boom,  \n> lots of rich young things in the valley?\n\nThis is a bizarre criticism. Youtube and other sites that wrap \"free\n[meaning zero-cost] user-produced content\" into their own proprietary\nwrap and then profiteer off the result are perhaps worthy of such\ncriticism (or perhaps not -- people evidently were satisfied with the\noffering or they wouldn't have contributed).  Personally, I *was*\nbothered  by that co-option of free content.\n\nBut clearly the *right* thing to do is to deliver that content with\nfree-licenses, which of course, removes the proprietary wrap and makes\nthe content truly free to use. These then become true community sharing\nsites. The fact that a \"multinational corporation\" is doing it doesn't\nchange that (that's the beauty of free licenses). It may, of course, be\nargued that they have \"ulterior\" motives for their behavior -- but\nbasically that's always true: corporations are machines for making\nprofit after all.\n\nSo what's your beef? You're just jealous of rich people? I mean I can\nsort of understand that, but the \"community\" did not beat these people\nto the punch with a sharing site, so they did it, and now they reap a\nreward for that. I'm just not seeing the glaring injustice here. Now the\ncommunity has a place to go to share this kind of content, and the\ndidn't even have to spend resources on developing it. The cost? Some\nadvertising. SO WHAT?\n\nSo give the Devil his due, and get over it. If you really think it's a\nproblem, start a better, more \"community-based\" site. Oh and make sure\nyou don't offset your costs with advertising -- you wouldn't want to be\na hypocrite! ;-)\n\nCheers,\nTerry\n\n-- \nTerry Hancock (hancock@AnansiSpaceworks.com)\nAnansi Spaceworks http://www.AnansiSpaceworks.com\n\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}