{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Science & Technology Newsletter May 28, 2007", "body": "\nhowstuffworks® | science & technology May 28, 2007\nRSS\n  \n How Luminol Works  Luminol\nis an incredible compound that crime scene investigators use to reveal traces\nof blood at crime scenes. Learn how luminol works, how investigators use it and\nabout the process known as chemiluminescence. \nAlso at HowStuffWorks\n \nHow\nPlasma Cutters Work - It may\nsound like something out of a sci-fi novel, but the plasma cutter is actually a\ncommon tool that has been around since World War II. Using the power of plasma,\nthese machines cut through extremely hard metals. Find out how plasma cutters\nwork.\n \n\nHow\nFacial Recognition Systems Work - You've\nprobably seen it in a dozen movies and television shows: sophisticated computer\nprograms identifying criminals by analyzing their facial structures. These\ndepictions aren't always accurate, but it's still remarkable technology. Find\nout how facial recognition systems work and learn what a faceprint is.\n \n\nHow\nSunburns and Sun Tans Work - Treading\nthe fine line between a sunburn and a sun tan is a challenge for many\nbeachgoers. In this article, learn how the sun affects your skin and how much\nsun exposure is too much.\n   \nThis Week's Video\n How\nSilly String Works - Silly String is a fun and, yes, silly toy that has some interesting science behind it.\nIt's even been adapted by soldiers in Iraq to check for trip wires. In\nthis video from HowStuffWorks, watch and learn how Silly String works.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved "}