{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Activations Department\" <qqgb3xqld@valuelion.com>", "subject": "producttestpanel@speedy.uwaterloo.ca, Your credit card is here - all applications accepted=?UTF8?Q?=21?=", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis email was sent by a third party on behalf of Imagine Card. Imagine Card does not have your email address. To stop receiving emails for the Imagine Card offer only please visit this link. If you have any questions in regards to this offer or wish to not receive offers from JBR Media Ventures, inc., please contact them at this address: JBR Media Ventures, inc. 2 Wisconsin Circle, Suite 700 Chevy Chase, MD 20815 Attn: Customer Care..\n\n\n\n\n\n\nPossibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard Possibilities with an unsecured Gold MasterCard \ntrmedia120071906\n\n\n\n\n\n\n\n______________________________________________________\n\nTo Discontinue Future Announcements from boycamper.com:\nhttp://boycamper.com/u/698/producttestpanel%40speedy.uwaterloo.ca/2\n\nor write to:\nboycamper.com\n1 Research Court\nSuite450\nRockville, MD 20850\n"}