{"category": "spam", "to_address": "Mail <mail@flax9.uwaterloo.ca>", "from_address": "Christopher Patton <asap@globusconnect.com>", "subject": "Sexual power", "body": "\n\nDo you want to save your money and get high-quality pills?\nVisit us\nWe have only high-quality national medications at low prices. There is no need for someone to know about your sexual problems. \nAll this you can find here\nInstant shipping directly from our warehouses!\nWith best regards,\nChristopher Patton\n \n \nNe obnaruzhiv ni kupola, ni menia, ona mozhet reshit, chto vse koncheno. Tretim povezlo bolshe oni rassypalis po Chernym dospeham vraga, po grudi i plecham, skolznuli v tonkie shcheli zharkimi Sinimi iazychkami i vosplamenili chernyj plashch. Ravnina byla devstvenno Chista. Odnovremenno s etim porazitelnym prevrashcheniem i u menia na dushe Pochemu-to stalo legko i spokojno, trevogi otoshli na zadnij plan, den Pokazalsia iarche, a holod v golove, kotorym ia vynuzhdenno gasil bol, bessledno Rasseialsia. \nOtvet prozvuchal sderzhanno I dazhe uchtivo: Posviashchennye ne umiraiut tak legko, kak ih voiny. Eto sostoianie prodolzhalos neskolko chasov i ostavilo posle sebia Iskliuchitelno tiagostnoe vpechatlenie. I tut Zhe, primerno v chetyreh metrah, vspyhnul rezhushchij, oslepitelno goluboj svet, I mgnovenno poiavilsia ogromnyj, splosh iskriashchijsia melkimi belo-golubymi Molniiami shar vyshe moego rosta. Eto bylo strannoe oshchushchenie. Ty zhe u nas krasavica. Proshchaj! I ia ostalsia odin. Volshebnyj Zver? Ogo! I s chem zhe ego est? Nekorrektno. Ia sdalsia i poslal myslennyj prikaz svoemu bankosu, ne v silah dazhe Vyrugatsia. \nHotelos sobratsia s mysliami, ili, Obrazno govoria, nastroit struny svoej dushi na to, chto predstoialo sdelat. Reakciia uznavaniia. U nas poiavilis novye Presledovateli, tolko chto voznikshie na granice dejstviia skan-seti. No dalshe, kogda my Dostignem Spihathi, nas mozhet zhdat teplyj priem. ejisuminyon XFNaWHVCQlZRUUgcRkNURVdBWFpeHFBV\n \n\n\n"}