{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 121", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Frink sculptures given heritage protection in Worthing\n      (Museum Security Network Mailing list)\n   2. Smiley. Map thief ordered to pay $2.3 million in restitution\n      (Museum Security Network Mailing list)\n   3. Elgin Marbles Parliamentary Motion Hailed by New Zealand's\n      Parliament (Museum Security Network Mailing list)\n   4. Christie's To Sell $20 Million Raphael Portrait on July 5.\n      The auction of Important Old Master and British Pictures on 5\n      July 2007 will also offer Part Two of the Goudstikker Collection.\n      (Museum Security Network Mailing list)\n   5. France. IMA ?uvres vol?es puis retrouv?es\n      (Museum Security Network Mailing list)\n   6. U.S. federal agents report that the looting of the world's\n      archaeological sites is epidemic. One archaeologist working\tin\n      Guatemala has launched a battle to save an ancient city\tfrom the\n      ravages of looters. (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Thu, 24 May 2007 11:41:49 +0100\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Frink sculptures given heritage protection in Worthing\nTo: \nMessage-ID:\n\t\n\t\nContent-Type: text/plain; charset=\"us-ascii\"\n\nDear MSN\n\n \n\nI enclose a press release made by the Public Monuments and Sculpture\nAssociation [PMSA] which may be of interest to your audience since it\ncreates a precedent for protecting post-war public art in the UK which\nis attached to a structure and under 30 years old. \n\n \n\nThanks, \n\n \n\nIan Leith\n\nDeputy Chairman\n\nPMSA\n\nwww.pmsa.org.uk\n\n \n\n \n\n \n\n\n_________________________________________________________________________________\nThis e-mail (and any attachments) is confidential and may contain personal views which are not the \nviews of English Heritage unless specifically stated. If you have received it in error, please delete it\nfrom your system and notify the sender immediately. Do not use, copy or disclose the information in \nany way nor act in reliance on it. Any information sent to English Heritage may become publicly available.\n\n\n\n------------------------------\n\nMessage: 2\nDate: Sat, 26 May 2007 06:46:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Smiley. Map thief ordered to pay $2.3 million in\n\trestitution\nTo: \nMessage-ID: <006501c79f50$d6e9b8f0$84bd2ad0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nMap thief ordered to pay $2.3 million in restitution\n \n\nAssociated Press - May 22, 2007 6:14 PM ET \n\nNEW HAVEN, Conn. (AP) - A renowned dealer who admitted stealing about 100\nrare antique maps has been ordered to pay $$2.3 million in restitution to\nhis victims.\n\nThe money will go to map dealers and libraries in Boston, Connecticut, New\nYork, Maine and Britain.\n\nE Forbes Smiley the Third was sentenced in September to 3.5 years in prison\nafter one librarian described him as a thief who assaulted history.\n\nHe was tentatively ordered to pay restitution of $$1.9 million, but that\nfigure was changed after the parties worked to recover the maps and assess\ntheir value.\n\nWhether Smiley's victims will receive the money depends on his ability to\npay after he gets out of prison and the government's ability to sell his\nassets.\n\nProsecutors said in court papers that 96 maps have been recovered and four\nremain missing.\n\nhttp://www.eyewitnessnewstv.com/Global/story.asp?S=6554090&nav=menu20_3\n\n\n\n------------------------------\n\nMessage: 3\nDate: Mon, 28 May 2007 08:24:44 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Elgin Marbles Parliamentary Motion Hailed by New\n\tZealand's\tParliament\nTo: \nMessage-ID: <004501c7a0f0$e6e85710$b4b90530$@org>\nContent-Type: text/plain;\tcharset=\"US-ASCII\"\n\nElgin Marbles Parliamentary Motion Hailed\nMonday, 28 May 2007, 12:02 pm\nPress Release: NZ Parthenon Marbles Committee  \n27 May 2007\nParthenon (Elgin) Marbles Parliamentary Motion Hailed\n\n\"The motion passed last Thursday by members of New Zealand's Parliament,\nwhich urges the British Government to return the Parthenon (Elgin) Marbles\nback to Greece, joins the growing number of countries and international\norganisations also calling for their return\" said Bruce Blades, Chairman of\nthe New Zealand Parthenon Marbles Committee.\n\n\"The Marble sculptures were sawn off and stripped from the Parthenon\nbuilding on the Acropolis in Athens by the then British Ambassador Lord\nElgin 200 years ago, at the time when Greece was under Turkish rule. This\naction has been a matter of deep controversy ever since. Lord Elgin sold the\nMarbles to the British Government which holds them in the British Museum.\nHalf are in Athens and half are in London. Countries throughout the world\nare joining the call for the Marbles to be reunited so that the magnificence\nof these sculptures can be truly appreciated in the place of their origin.\"\n\nThe text of the motion put forward reads:-\n\n\"That this House joins its voice to that of other countries throughout the\nworld and urges the British Government to support the return of the\nParthenon (Elgin) marbles to Greece, stressing the need for the collections\nof marbles in different locations to be reunited so the world can see them\nin their original context in relation to the Temple of Parthenon as an act\nof respect to one of the most significant monuments of western heritage.\"\n\nThe motion was agreed to.\n\n\"As long as the Marbles remain in the British Museum, our New Zealand\nCommittee will continue to inform the public of the plunder carried out by\nLord Elgin when he desecrated the classical Parthenon building\" said Mr\nBlades.\n\n  http://www.scoop.co.nz/stories/CU0705/S00295.htm\n\nENDS\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Mon, 28 May 2007 08:24:44 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Christie's To Sell $20 Million Raphael Portrait on July\n\t5.\tThe auction of Important Old Master and British Pictures on 5\tJuly\n\t2007 will also offer Part Two of the Goudstikker Collection.\nTo: \nMessage-ID: <004301c7a0f0$e2152420$a63f6c60$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nChristie's To Sell $20 Million Raphael Portrait on July 5 \n \n \n\n\nRaffaello Sanzio, called Raphael (Urbino 1483-1520 Rome), Portrait of\nLorenzo de? Medici (1492-1519), Duke of Urbino, oil on canvas, 38 x 31 in.\n(97 x 79 cm). Estimate: ?10,000,000 ? 15,000,000. ? Christie's Images\nLimited:\nhttp://www.artdaily.com/section/news/index.asp?int_sec=2∫_new=20380 \n\n \nLONDON.- Christie's will offer a masterpiece by Raffaello Sanzio, called\nRaphael (1483-1520) at the auction of Important Old Master and British\nPictures on 5 July 2007 in London. One of only a handful of paintings by the\nartist to remain in private hands, the work portrays Lorenzo de? Medici,\nDuke of Urbino and ruler of Florence from 1513 to 1519, and has not been\nseen in public for over 40 years. The most important Renaissance portrait to\nbe offered at auction for a generation, and the most important work by the\nartist to be offered at auction in recent decades, it is expected to realize\nbetween ?10,000,000-15,000,000. \n\nRichard Knight, International Director of Christie?s Old Master Department\nand Paul Raison, Director and Head of Old Master Pictures at Christie's,\nLondon: ?Building on Christie?s continuing leadership of the market for old\nmaster paintings, we are excited to offer in London this remarkable work by\nRaphael, one of the most renowned and accomplished of European artists. The\nimportance of the artist and the sitter, together with the provenance and\nthe historical context behind this painting?s creation, make it one of the\nmost significant old master pictures to be offered at auction for a\ngeneration. We look forward to exhibiting this remarkable painting to the\npublic from 30 June to 5 July at our King Street salerooms in London.? \n\nThe portrait shows a swagger Lorenzo de? Medici standing proud and\nresplendent against a rich green background. In the Duke?s right hand he\nholds what is probably a portrait miniature showing his future wife, and his\nstriking tunic and shawl of gold and red are of the most impressive order\nwith the fur on the neck and lining of his cape painted in a delicate manner\nwhich highlights Raphael?s exceptional ability and technique. The vivacity\nand boldness of the colors, together with the handling of the abundance of\nfabrics worn by the Duke, are typical of the style of the Renaissance master\nand substantiate his being known as ?the Prince of Painters. \n\nThe portrait is recorded in the possession of Cosmo de Medici, Grand Duke of\nTuscany, in an inventory of 1553. During the 1800s, it was in the possession\nof two of the most prominent collectors of the 19th century; Lord Northwick\n(1769-1859) whose collection was offered at auction in 1859, and then the\nmerchant Hollingworth Magniac (1786-1867) whose collection was sold over an\neleven day sale at Christie?s in 1892 where the present picture, lot 84,\nsold for 567 guineas. The painting was the subject of attributional debate\nwith regards both the artist and the sitter from 1862, although Sir Charles\nRobinson (1824-1913), the esteemed scholar of Italian Renaissance art,\nsupported the attribution as it is accepted today. It was sold again at\nChristie?s in November 1962 and in 1968 it was sold at an auction in New\nYork to Ira Spanierman, in whose possession it remains to the present day.\nIn 1971, Professor Konrad Oberhuber conclusively reinstated the attribution\nof the painting in an article for The Burlington Magazine, a view now\naccepted by all major scholars of the artist. \n\nTHE MEDICI FAMILY \n\nThe Medici family ruled Florence from the 14th to the 17th centuries and\nprovided many of the greatest patrons of the High Renaissance; Donatello,\nFilippo Lippi, Botticelli, Raphael, Leonardo da Vinci and Michelangelo\nBuonarroti all received the patronage of the Medici family, one of the\nwealthiest families in Europe. The Medici also held great power through a\nseries of appointments, conquests and strategic marriages. One such\nappointment was that of Giovanni di Lorenzo de' Medici (1475-1521), second\nson of Lorenzo the Magnificent, who was elected Pope Leo X in 1513. Seeking\nto consolidate the position of the Medici family on an international stage,\nthe Pope arranged for his nephew, Lorenzo, to be married to Madeleine de la\nTour d?Auvergne, a cousin of Francois I, King of France, an important ally\nof the Vatican against the Holy Roman Empire. As neither the Duke nor the\nbride-to-be had met, an exchange of portraits was arranged in order that\nthey could see what to expect. \n\nOn 2 May 1518 the Duke was married in the ch?teau of Amboise in France.\nReturning to Florence with his bride, their entry to the city was celebrated\nwith a banquet at which Raphael?s portrait of the Pope, now in the Uffizi,\nFlorence, was exhibited. The couple had a child, Catherine de Medici, who\nwent on to marry King Henry II of France, but less than a year after the\nmarriage, the Duchess died. Lorenzo died soon afterwards in 1519. \n\nRAPHAEL \n\nRaffaello Sanzio, called Raphael (1483-1520) was one of the most important\nartists of the High Renaissance and one of the most influential and\naccomplished painters in European history. Born in Urbino in 1483, he was\norphaned by the age of 11 and sent to the care of his uncle. He lived in\nFlorence from 1504 to 1508 where he absorbed the influence of his great\ncontemporaries Leonardo da Vinci and Michelangelo. In 1508, he was summoned\nto Rome by Pope Julius II and commissioned to paint frescos in one of the\nPapal rooms in the Vatican. He spent most of his life in Rome under the\npatronage of Julius II and his successor, Leo X, the uncle of Lorenzo Medici\nwhose portrait is to be offered at Christie?s in July. According to the\ngreat biographer Giorgio Vasari, Pope Leo X ?wept bitterly when he died? in\n1520, and had planned to make him a cardinal. \n\nThe auction of Important Old Master and British Pictures on 5 July 2007 will\nalso offer Part Two of the Goudstikker Collection, arguably the most\nimportant collection of Old Master pictures ever restituted. Following on\nfrom Part One which took place on 19 April in New York and totaled\n$9,741,200, the collection is an overview of Dutch Old Master pictures from\nthe 15th to 19th centuries, together with excellent examples from 16th\ncentury Germany, early Italian and 18th century French works. On 5 July, the\nGoudstikker Collection Part Two will offer 35 lots, highlighted by an\naltarpiece by The Master of the Pauw and Zas alterpiece, circa 1520, which\nis expected to realize ?1,000,000 to 1,500,000, and The Plaats, the Hague,\nwith an elegant hawking party by Gerrit Berckheyde (1638-1698) (estimate:\n?200,000-400,000). \n\nThe auction will also offer a masterpiece by the Baroque master Domenico\nZampieri, Il Domenichino (1581-1641). The Piet?, which was exhibited at the\nrecent exhibition Domenichino 1581-1641 at the Palazzo Venezia, Rome from\nOctober 1996 to January 1997, is expected to realize ?2,500,000 to\n3,500,000. Leading the selection of important British pictures is a\nmasterpiece by Sir Peter Lely (1618-1680) traditionally considered to depict\na favored mistress of King Charles II, and thought to have been a work owned\nby the King and kept in the Royal bedchamber at the Palace of Whitehall.\nPortrait of a young lady and child as Venus and Cupid by Sir Peter Lely, the\nfinest painter of the Restoration and official artist to Charles II, is\nbeing offered at the auction by the Trustees of the Denys Eyre Bower Bequest\nand is expected to realize ?1,500,000-2,000,000. Another highlight of the\nsale is the swagger Portrait of Philip Gell (1723-1795) by Sir Joshua\nReynolds, P.R.A. (1723-1792) which carries an estimate of\n?1,500,000-2,500,000.  \n\nhttp://www.artdaily.com/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Mon, 28 May 2007 08:24:44 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] France. IMA ?uvres vol?es puis retrouv?es\nTo: \nMessage-ID: <004401c7a0f0$e4b104b0$ae130e10$@org>\nContent-Type: text/plain;\tcharset=\"windows-1256\"\n\nIMA ?uvres vol?es puis retrouv?es \n\n\nLa plupart des ?uvres d'art qui avaient disparu des r?serves de l'Institut\ndu monde arabe (IMA) ? Paris ont ?t? retrouv?es par la police ? l'int?rieur\nm?me de l'?tablissement, a-t-on appris jeudi aupr?s de la pr?sidence de\nl'IMA. \n?Des investigations conduites par la police ont permis de retrouver\nl'essentiel des ?uvres. Nous ne sommes plus du tout sur les m?mes chiffres?,\na indiqu? ? l'AFP le pr?sident de l'IMA, Dominique Baudis. \n?Sur 38 ?uvres d'art islamique, notamment des tableaux et lithographies,\ndont la disparition avait ?t? signal?e d?but mai ? la suite d'un inventaire,\ndeux seulement restaient manquantes jeudi, ainsi que 12 ?uvres d'art\ncontemporain sur 39 signal?es manquantes?, a pr?cis? le pr?sident de l'IMA.\n\n?Il y a encore quelques manques mais nous avons espoir que les ?uvres seront\nretrouv?es?, a soulign? M. Baudis, ?voquant ?un probl?me d'application des\nproc?dures?. \nPar alleurs, directeur du mus?e  depuis plus de 20 ans,M. Brahim Alaoui a\n?t? sujet d?une  mise ? pied ? titre conservatoire et avec interdiction\nd'acc?der ? l'IMA. Il est convoqu? le 29 mai par la Direction pour un\nentretien au cours duquel il devra s'expliquer sur la disparition des ?uvres\net la pr?sence ? l'IMA d'autres pi?ces non r?pertori?es. \nL'inventaire avait en effet r?v?l? la pr?sence d'environ 250 ?uvres ne\nfigurant pas sur les registres du mus?e et  o? elles  ?taient pourtant\nentrepos?es dans un local technique probablement depuis des ann?es. \nUne plainte pour vol avait ?t? d?pos?e d?but mai aupr?s du parquet de Paris\n?afin d'?valuer les faits et de d?fendre les int?r?ts de l'IMA?.  ?La\nsituation est moins grave que ce qui nous avait ?t? dit. Il n'en demeure pas\nmoins qu'il y a des pratiques et des m?thodes qui doivent ?tre examin?es de\npr?s et modifi?es en profondeur?, a estim? Dominique Baudis, ?voquant un\nprochain renforcement des mesures de s?curit?. \nDans une interview au Figaro de jeudi, M. Alaoui reconna?t ?une certaine\nn?gligence administrative? et pr?cise que les ?uvres non r?pertori?es ?sont\navant tout des d?p?ts d'artistes? auxquels il a voulu ?rendre service?. \nIl souligne que des toiles de ma?tres ont ?t? pr?t?es ces 15 derni?res\nann?es ? l'IMA par de prestigieux mus?es internationaux ?sans jamais avoir\neu le moindre probl?me?. \nVitrine du Monde arabe ? Paris, l'IMA abrite notamment un mus?e d'art\nislamiq    ue dont les collections regroupent quelque 850 ?uvres.\n\nhttp://www.lanouvellerepublique.com/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Mon, 28 May 2007 08:24:44 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] U.S. federal agents report that the looting of the\n\tworld's\tarchaeological sites is epidemic. One archaeologist working\tin\n\tGuatemala has launched a battle to save an ancient city\tfrom the\n\travages of looters.\nTo: \nCc: list@leidennetwork.net\nMessage-ID: <004601c7a0f0$e732cd90$b59868b0$@org>\nContent-Type: text/plain;\tcharset=\"US-ASCII\"\n\nCooling U.S. Market Sends Tomb Raiders Elsewhere\nby John Burnett\n\nAudio for this story will be available at approx. 9:00 a.m. ET on May 29,\n2007:\nhttp://www.npr.org/templates/story/story.php?storyId=10457558 \n \n\n \nPhotos:\nhttp://www.npr.org/templates/story/story.php?storyId=10457558\n\nPeter Breslow\nRamon Peralta gave up years of lucrative tomb raiding in Guatemala to become\na guide for the Wildlife Conservation Society. NPR \n\n Photos:\nhttp://www.npr.org/templates/story/story.php?storyId=10457558 \n \n Cris Bouroncle\nThe broken head of an Assyrian-era lion, damaged during the looting of\nIraq's national museum in Baghdad. AFP/Getty Images \n\n \n \n \nPart One\n  \nU.S. federal agents report that the looting of the world's archaeological\nsites is epidemic. One archaeologist working in Guatemala has launched a\nbattle to save an ancient city from the ravages of looters.\n  \nHear that Story:\nhttp://www.npr.org/templates/story/story.php?storyId=10457558 \n  \nPart Two\n  \nThe rules have changed for museums, dealers, collectors and auction houses.\nLooted relics have become as contentious as they are beautiful. In Part Two\nof this report, we examine the tomb robbers' global marketplace.\n\n\n \n Morning Edition, May 29, 2007 . They say the world's second oldest\nprofession is tomb raiding.\n\nIn the jungles of northern Guatemala - where the lowland Maya created\nstunning jewelry, ceramics and reliefs - there was no one better than Ramon\nPeralta. He was a huechero - a tomb looter.\n\n\"If an archaeologist leaves a site, the looters are going to come because he\nknows it's an interesting site. 'Oh, that's where the gringos went! Man, it\nhas to be an important site. There has to be something there,'\" Peralta\nsays.\n\nLike a computer hacker who goes to work for Microsoft, Peralta quit looting\nfive years ago and now serves as a guide for the Wildlife Conservation\nSociety in the vast Peten Province.\n\nHe slouches in a chair with a wry smile creasing his copper-colored face.\n\n\"This is never gonna end, never gonna end. Forget it. Peten is huge and\nanywhere you go in Peten, you'll find monticulos and ruins and other sites,\nand it's just always going to continue,\" Peralta says.\n\nThe reason it will continue - not just in Guatemala, but in China,\nAfghanistan, Cambodia, Nigeria and Mali, to name just a few countries - is\nbecause of the demand, says Richard Leventhal, an archaeologist at the\nUniversity of Pennsylvania and a leading voice in the movement to curtail\nthe trade in looted antiquities.\n\n\"I think the connection must be made that the people are looting to look for\nspectacular objects because there is an art market that will gobble them up\nand sell them around the world to private dealers and to museums,\" Leventhal\nsays.\n\nThe modern world has made the sacking of archaeological sites even easier -\nwith containerized shipping, overnight mail, Internet auctions and email.\n\nWar and civil conflict leave ancient sites and museums unprotected. In the\nmost vivid example, 14,000 pieces were ransacked from the Iraq Museum.\nMatthew Bogdanos, a reserve Marine colonel who helped investigate and\nrecover some of the relics, says he was astounded by the global black market\nhe discovered.\n\n\"That includes the smugglers on the first leg of the journey outside the\ncountry, be it Jordan, Egypt or Iraq. That also includes the individuals who\nprovide the false documentation - the provenance - that gets it on its way\nto a dealer in Beirut, Geneva or Dubai. That includes the dealers. And that\nultimately includes the end-user, the collector - individuals whose names\nyou would recognize from society pages,\" Bogdanos says.\n\nThe looting of the Iraq Museum helped draw attention to the scope of the\nillegal trade in antiquities. The FBI responded by creating a rapid\ndeployment Art Crime Team. U.S. Customs and Border Protection has begun\ntraining its inspectors, though a senior agent guesses they only catch 5\npercent of what's smuggled into the country. What's more, the federal\ngovernment has signed bilateral agreements with 11 countries that allow it\nto seize and repatriate stolen antiquities at the border.\n\nBut the most effective measure has been targeting the marketplace, says\nRoger Atwood, a journalist who wrote a book on the subject titled Stealing\nHistory.\n\n\"If we are talking about this as a law enforcement issue, the most sensible\nway to deal with it is to deal with it at the buyer end where it's much more\nconcentrated. At the supply end, it's much more diffused and difficult to\ncontrol,\" Atwood said.\n\nThe buyers - auction houses, dealers, collectors and museums - have been\nfeeling the pressure particularly from Italy.\n\nIn recent years, the Metropolitan Museum of Art in New York and the J. Paul\nGetty Museum of Art in Los Angeles agreed to return artworks believed stolen\nfrom Italian soil. And in the most watched case, prominent art dealer Robert\nHecht Jr. and former Getty museum curator Marian True are on trial in Italy\nfor conspiracy to traffic in illegal antiquities.\n\n\"I think if the Italians are successful against Marion True, it'll have\nphenomenal impact on how the larger institutions conduct their business to\nmove this out of the dark ages,\" said Jim McAndrew, the top art-crime cop\nwith U.S. Customs & Border Protection.\n\nTraditionally, museums have acquired cultural material because it is\nbeautiful or important, with little regard for how it was obtained. Think of\nthe Earl of Elgin hauling the Parthenon Marbles out of Athens in 1806.\n\n\"There were empires, there was war, there was booty taken. To the victor\nwent the spoils, and the museums of the world still represent the\ndispositions of some of those historical events. We are now living in this\ndifferent world, and we are requiring more provenance history, and if we\nthink it was recently excavated, we're just not going to buy it,\" said\nTimothy Potts, director of the Kimbell Art Museum in Fort Worth.\n\nThe key word he uses is provenance - the history of an object's ownership.\n\nSotheby's, the largest auction house in the world, used to be notorious for\nbuying unprovenanced antiquities, some of which were illegitimate.\nPunctuating the new chill in the art world, last year, Sotheby's hired as\nits worldwide director of compliance the former federal art-crime prosecutor\nin New York.\n\nIn this new climate, every relic has to have a paper trail or it's\nconsidered pillage - an assumption that some see as overreacting.\n\nTorkom Demirjian, the Turkish-born owner of Ariadne Galleries, sits in the\nparlor of his elegant townhouse/gallery on the Upper East Side of New York.\nHis left elbow rests casually on a fifth-century Byzantine pillar. He's\ntired of dealers and their customers getting blamed for somehow encouraging\nthe destruction of archaeological sites.\n\n\"Americans who buy them, they don't buy these things to destroy or to cause\nharm. You love something, you protect it. So the issue is, is it good or bad\nfor a work of art to come to America, as opposed to going elsewhere or going\nnowhere?\"\n\nThe sad reality, Demirjian and other experts said, is that the crackdown on\nillegal antiquities in this country has had an unintended consequence. It\nhas diverted the spoils of tomb raiding from the United States to markets in\nEurope and Japan, where enforcement is more lax.\n\n\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 121\n****************************************\n\n"}