{"category": "ham", "to_address": "<cc-community@lists.ibiblio.org>", "from_address": "<p.hatzopoulos-alumni@lse.ac.uk>", "subject": "[cc-community] Wiki politics - special issue", "body": "New online journal Re-public < www.republic.gr/en  >  has just published the first part of its special issue \"Wiki politics\". The issue explores how the use of new collaborative tools (wikis, blogs, forums, mailing lists, podcasting, and videos) can transform the ways politics are practiced . Articles include:  \n \nMcKenzie Wark: Gamer theory for collaborative knowledge production   < http://www.re-public.gr/en/?p=132  > \nAn interview with the author of A Hacker's Manifesto on how wikipedia is an example of a new kind of social relation \n  _____  \nGeert Lovink - Theses on wiki politics  < http://www.re-public.gr/en/?p=135  >Wikis reflect a culture of pragmatic non-commitment, argues Geert Lovink. One edits, adds, deletes, changes and quits. Then it is time to stand up, get a coffee, smoke a cigarette, talk on the phone or chats, and return to the screen again\\u2026   _____  \nTrebor Scholz - What the MySpace generation should know about working for free  < http://www.re-public.gr/en/?p=138  > \nMySpace addicts formulate comments, tag, rank, forward, read, subscribe, re-post media, link, moderate, remix, share, collaborate, favorite, and write. what kind of labor is this, asks Trebor Scholz?\n  _____  \nMichel Bauwens - P2P politics, the state, and the renewal of the emancipatory traditions  < http://www.re-public.gr/en/?p=128  >Michel Bauwens explores the possibilities opened up by P2P projects for progressive politics, arguing that they could present an alternative to neoliberal privatization, and to the Blairite introduction of private logics in the public sphere. \n  _____  \nAll articles of Re-public are published with a Creative Commons license and can be re-printed freely, by acknowledging their source. \n\n***** Email confidentiality notice *****This message is private and confidential. If you have received this message in error, please notify us and remove it from your system. The London School of Economics and Political Science (the School) is a company limited by guarantee, registered in England and Wales, under registered number 00070527, and having its registered office at 10th Floor, Tower One, Houghton Street, London WC2A 2AE. The inclusion of this information does not of itself make this email a business document of the School and, to the maximum extent permitted by law, the School accepts no liability for the content and opinions in any non-business emails._______________________________________________cc-community mailing listcc-community@lists.ibiblio.orghttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}