{"category": "spam", "to_address": "Gnitpick <gnitpick@flax9.uwaterloo.ca>", "from_address": "Zoe Bradley <istjean@greenhalfselfdrive.co.uk>", "subject": "What's your opinion?", "body": "\n\nThere is no need to exert yourself with silly doubts while you are in bed.\nOrder now!\nYou will have sex all night long. You won't think about erectile dysfunction anymore.\nClick here to be the best lover in the world!\nLicensed medications you can by right now!\nWith best regards,\nZoe Bradley\n \n \nSpasibo, ia ne goloden. Ona zakryla mne obzor, i mne prishlos vskochit, Chtoby vzglianut poverh ee golovy. Charsy zlobno rychali, skalia klyki v ego storonu, no zverinye Lica samih Vestnikov tmy byli spokojny i holodny. Ty v sostoianii ubrat Telepatemu sheptuna priamo sejchas? Ia nashel by sposob otblagodarit tebia. \nNekotoroe vremia ia nichego ne soobrazhal, prosto lezhal i Smotrel pered soboj skvoz kakuiu-to tepluiu voniuchuiu mut, poka golos ne Potrevozhil menia snova: Niks? Ty kak, v poriadke? Ia uznal etot golos. Luchshe by uzh ohtan i vpravdu ne uspel, Inache diadiushka nemedlenno zajmetsia im samim. Tak chto zhe takoe na samom dele etot Krug Prichastiia? I etot Volshebnyj Zver? Taj vdrug posereznela, i ia oshchutil ee neozhidannuiu grust. Riadom s nim pustovalo mesto, nesomnenno, Ostavlennoe dlia menia. Zagorelsia plastik na Stenah, iazyki ognia liznuli knizhnye shkafy, zatem neuderzhimo popolzli po Kovru, pozhiraia vors. Davaj, paren, rasskazyvaj. Mozhet, i s nim chto-nibud sejchas sotvoritsia? Zlydniu ne nravitsia nesti dvoih, vot ia i prigotovil dlia tebia drugogo Zveria, poiasnil Niksard, othodia k poverzhennomu charsu. I ne vzdumaj dazhe v shtany nalozhit, vdrug nepravilno pojmem. \nNu nervnyj ia takoj segodnia, chto tut podelaesh. Ia zhe skazal celitel. Taj lish znachitelnym usiliem voli sderzhala gotovuiu prorvatsia v golose Drozh: Ne obiazatelno. Sami znaete, kakoj on boltun, a tut slovno iazyk otnialsia. ejisuminyon VVFcRlhQUVh0RkFXVlBMH0dEVUFUQF9bWh9RUg==\n \n\n\n"}