{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nRisk Management 101: Managing Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nEPRI's Value \n\t\t\tand Risk in Energy Markets - Introduction & Principles\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (Jun. 20, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 20, 2007\n\n\nJun 20, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for June 20, 2007  \n\n\n\nFirst Enercast Featured Articles for June 20, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nJun 20, 2007 PowerMarketers Industry Publications\n\n\n\nRevenue Protection and AMI Come Together (UtiliPoint.com - Jun. 20, 2007)\n\n\n\nUtiliPoint.com - Jun. 20, 2007 - Revenue protection and revenue assurance have been concerns at utilities for a long time. Automated Meter Reading (AMR) and Advanced Metering Infrastructure (AMI) deployments are relatively new.\n\n\nJun 20, 2007 PowerMarketers Industry Publications\n\n\n\nSmart Ideas (EnergyBiz Insider - Jun. 20, 2007) \n\n\n\nEnergyBiz Insider - Jun. 20, 2007 - California is determined to meet its summer energy demand. The idea of rolling blackouts and spiking prices is giving way to another phenomenon there -- the desire to steer energy usage away from peak periods through new technologies.\n\n\nJun 20, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nDetectives taped, followed man accused in $1.4 million theft from Duke Energy\n\n\n\nJun. 20--Private detectives secretly followed Bill Monahan of Greeley last year, and even video-recorded him as he allegedly re-set gas well pumps in Weld County to bring in more income.  Monahan, who turned himself in to authorities Monday, is accused of tampering with gas wells so they would inaccurately show more gas output, which equaled more payments from Duke Energy.\n\n\nJun 20, 2007 Knight Ridder Tribune Business News\n\n\n\nEast Toledo, Oregon coking plant project told to share generated steam power: Pair seek local benefits from project's electricity\n\n\n\nJun. 20--Mayor Carty Finkbeiner and Lucas County Commissioner Pete Gerken yesterday said they want local residents and businesses to directly benefit from any power that's generated as part of the proposed $800 million FDS Coke Plant project in East Toledo and Oregon.  They may be too late. Lance Traves, FDS Coke Plant LLC project manager and environmental consultant, told The Blade the local ...\n\n\nJun 20, 2007 Knight Ridder Tribune Business News\n\n\n\nPublic FutureGen input\n\n\n\nJun. 20--Say this much about the Permian Basin: Its residents love energy production in all forms and fashion.  The local respect for power creation was abundantly obvious Tuesday night during the public commentary portion of a FutureGen public hearing following the release of draft environmental impact statements. Nary a concern was voiced against the near-zero emission coal-burning power plant ...\n\n\nJun 20, 2007 Knight Ridder Tribune Business News\n\n\n\nPower restored to 5,000 in Hickory\n\n\n\nJun. 19--Nearly 5,000 Hickory homes and businesses lost power Monday night after a breaker failed, causing two smaller stations to also go down, a Duke Energy spokesman said.  The outage happened shortly before 10 p.m., and crews were able to restore power to most of the homes and businesses by 11:45 p.m., said Andy Thompson, a Duke spokesman. The majority of customers without power were in the ...\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nAnsonia aiming to be first in state to set up local power grid\n\n\n\nJun. 20--ANSONIA, Conn. -- The city hopes to become the first to use a new state law that allows for developing small, private power plants for local use.  Mayor James T. Della Volpe announced the city's plans Tuesday during an afternoon news conference at City Hall. The event included comments from Rep. Linda M. Gentile, D-Ansonia, and Sen. Joseph J. Crisco Jr., D-Woodbridge, as well as from the ...\n\n\nJun 20, 2007 Knight Ridder Tribune Business News\n\n\n\nKentucky may land huge plant: Company: Incentives are needed\n\n\n\nJun. 20--A letter released Tuesday by Gov. Ernie Fletcher's office indicates that Peabody Energy Corp. is looking for Kentucky to provide tax incentives to locate a multibillion-dollar coal-to-natural gas conversion plant in the state. The letter, sent to Fletcher on May 31, indicates that an incentive package being considered by legislators is vital to Peabody considering a Kentucky site for ...\n\n\nJun 20, 2007 Knight Ridder Tribune Business News\n\n\n\nSettlement would cut Yankee Gas rate hike\n\n\n\nJun. 19--A settlement agreement between state officials and Yankee Gas Services Co. that slashes a proposed rate increase by about 40 percent received preliminary approval Monday.  In its draft decision, the state Department of Public Utility Control said the agreement reached by Yankee Gas with DPUC prosecutorial staff and representatives of the Office of the Consumer Counsel reduces the ...\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nSun powers SunRidge warehouse: Biodiesel fleet, solar panels just beginning of conversions\n\n\n\nJun. 19--Two years ago, when SunRidge Farms moved its operation into a former Smucker's plant in Pajaro, the organic and natural foods company modified existing buildings to increase energy efficiency, retrofitting and installing passive solar lighting, air-quality and low-flow water systems.  Last year, the 30-year-old, privately held company converted its 17-truck delivery fleet to run off ...\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nHoldings in Dallas energy firm are sold\n\n\n\nJun. 20--HM Capital Partners, a private-equity firm formerly known as Hicks, Muse, Tate & Furst, said Tuesday that it sold a majority of its holdings in a Dallas-based natural gas pipeline company to GE Energy Financial Services for $603 million.  In 2004, HM Capital Partners paid $405 million for Regency Energy Partners, which owns about 4,000 miles of natural gas gathering lines and 13 ...\n\n\nJun 20, 2007 Knight Ridder Tribune Business News\n\n\n\nLark to leave MPSC for utility in Lansing\n\n\n\nJun. 19--Michigan Public Service Commission Chairman J. Peter Lark is stepping down from his post to become the general manager of the Lansing Board of Water and Light.  The utility voted unanimously last week to offer Lark the job. Lark, who was one of four finalists for the position from among 124 candidates, replaces interim GM Dick Peffley and is to begin his new job in mid-July.\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nOrissa thermal projects in coal crunch\n\n\n\nJun. 19--BHUBANESWAR: Private investment to the tune of Rs 68,000 crore in Orissa's thermal power sector has run into a central roadblock. The Prime Minister's Office is taking keen interest in the Rs 51,000-crore Posco steel project, but it has so far paid little heed to the state government's plea to allot coal blocks to the proposed power projects.  Energy department mandarins here said even ...\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\n1st Ohio energy summit ends today\n\n\n\nJun. 20--KETTERING -- Alternative energy supporters outlined steps needed to make Ohio the top manufacturer of wind energy products during the state's first energy summit on Tuesday.  The 1st Ohio Summit on Supply Chain Opportunities in Alternative Energy, a two-day event that wraps up today, is taking place at the National Composite Center in Kettering. Summit topics include wind and solar ...\n\n\nJun 20, 2007 Knight Ridder Tribune Business News\n\n\n\nCalpine starting path out of bankruptcy\n\n\n\nJun. 19--Power generator Calpine is set to outline its plans for emerging from bankruptcy today, and energy industry experts say the timing couldn't be better. Calpine, which operates a fleet of newer, less polluting, natural gas plants as well as the nation's largest geothermal field, is positioned to take advantage of an evolving clean energy market in which being low carbon is more important ...\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nState utilities off the table\n\n\n\nJun. 20--Public health agencies and electricity and water utilities are among the state enterprises that will be banned from privatisation under a new law approved by the cabinet yesterday.  The Thailand Tobacco Monopoly and the Government Lottery Office would also be explicitly excluded from privatisation under the new law, said Areepong Bhoocha-oom, director-general of the State Enterprise ...\n\n\nJun 20, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nCoal gasification plant could boost rates 16 percent\n\n\n\n-- A coal gasification plant Duke Energy Corp. and  Vectren Corp. want to build near Edwardsport in southwestern Indiana would push electric rates up 13 percent to 16 percent, a Duke official told the Indiana Utility Regulatory Commission yesterday. The $2 billion project, which would make synthetic gas from Indiana coal, would replace a Duke plant at the site.\n\n\nJun 20, 2007 Power Engineering\n\n\n\nPJM electric grid's watchdog muzzled\n\n\n\nJay Hancock Managers of the Mid-Atlantic electricity grid repeatedly silenced a supposedly independent watchdog who was concerned that power generation companies could reap outsized profits in newly deregulated electricity markets, internal memos, e-mail and other documents show. Executives at PJM Interconnection, which runs wholesale electricity markets in Maryland and a dozen other states, ...\n\n\nJun 20, 2007 Baltimore Sun\n\n\n\nPower prices up as winter demand rises\n\n\n\nWholesale power prices rose last week as cold weather pushed up demand. Prices at the North Island reference point of Haywards rose 13.3 per cent to an average $69.06 per megawatt hour (MWh), while at the South Island reference point of Benmore prices were 12.3 per cent higher at an average $68.77 per MWh. Hydro lake levels fell because of lower inflows, analysts said, but the jump in demand was ...\n\n\nJun 20, 2007 Dominion Post\n\n\n\nPeabody: Illinois power plant construction to begin in fall\n\n\n\nMore Local Business    Environmentalists called St. Louis-based Peabody's announcement premature, saying the Chicago-based 7th U.S. Circuit Court of Appeals has yet to rule on their appeal of the project's air permit issued by the state Environmental Protection Agency and affirmed by the federal EPA. 'I think they're jumping the gun,' said Kathy Andria of the American Bottom Conservancy and the ...\n\n\nJun 20, 2007 Evansville Courier\n\n\n\nSenators bargain today over fuel economy mandates\n\n\n\nWASHINGTON -- A leading lawmaker seemed willing today to pare back a dramatic hike in automotive fuel economy standards, but car makers still say the proposed rules are too aggressive. The current Senate Energy Bill requires automakers to average 35 miles per gallon by 2020 and then face yearly 4 percent increases through 2030, ending up with a combined 52 mile-per-gallon requirement by 2030. ...\n\n\nJun 20, 2007 Detroit News\n\n\n\nCleaner plant emissions could up demand for high sulfur coal\n\n\n\nMOUNDSVILLE, W.Va. (AP) -- A Marshall County power plant is producing cleaner emissions, and that could mean good things for the Ohio Valley coal industry. American Electric Power announced Tuesday the complete installation of two so-called scrubbers at its Kammer-Mitchell plant. With the scrubbers installed, the plant is reducing its sulfur dioxide emissions by 98 percent.\n\n\nJun 20, 2007 Charleston Daily Mail\n\n\n\n\n\nConstellation Energy Begins Construction of Emissions Scrubber at Brandon Shores Power Plant\n\n\n\nCompany to invest nearly $1 billion on clean air equipment for Maryland plants BALTIMORE, June 20 /PRNewswire-FirstCall/ -- Constellation Energy (NYSE: CEG) today announced that it has concluded a nearly three-year planning, engineering and permitting process and has begun construction of a state-of-the-art environmental control system at the company's Brandon Shores Power Plant in Anne Arundel ...\n\n\nJun 20, 2007 PR Newswire\n\n\n\nOregon LNG Commences FERC's NEPA Pre-Filing Process\n\n\n\nOregon LNG announced today that the Federal Energy Regulatory Commission (FERC) has approved its request to use the National Environmental Policy Act (NEPA) Pre-Filing Process for the proposed liquefied natural gas ('LNG') receiving terminal, formerly known as Skipanon Natural Gas Facility, and associated pipeline. Located in Warrenton, Oregon, the project will increase natural gas supplies to ...\n\n\nJun 20, 2007 PR Newswire\n\n\n\nComEd, Comverge Introduce Load Guard(TM) Automated Price Response Service\n\n\n\nComEd and Comverge announce today the launch of Load Guard Automated Price Response Service(TM), another innovation in demand response programs available to ComEd residential customers. The Load Guard(TM) service is designed for 'set-and-forget' price responsive load control for individual ComEd Residential Real-Time Pricing participants, who have central air conditioning units, Internet access ...\n\n\nJun 20, 2007 PR Newswire\n\n\n\nFluor Awarded Canadian Power Plant Project\n\n\n\nIRVING, Texas--(BUSINESS WIRE)--Fluor Corporation (NYSE:FLR) announced today that its subsidiary, Fluor Canada, Ltd., was awarded a procurement and construction project by St. Clair Power, L.P. to build a 570-megawatt combined cycle power plant in Ontario, Canada. Fluor received a full notice to proceed in the first quarter 2007. Completion of the power plant is projected to be in the fourth ...\n\n\nJun 20, 2007 Business Wire\n\n\n\nTelecom, IT Will Enable ''The Next-Generation Utility''\n\n\n\nWASHINGTON--(BUSINESS WIRE)--Good news for consumers  energy and water companies are embarking on a massive period of technology investment that will help make them more efficient, more responsive to consumers and greener. Utilities are already beginning to invest heavily in the advanced communications networks that will make the automated Next-Generation Utility possible.\n\n\nJun 20, 2007 Business Wire\n\n\n\nSenate Showdown Over National Renewable Electricity Standards\n\n\n\nCongress is set for a showdown this week over a controversial provision in the Senate energy bill. The federal Renewable Portfolio Standard (RPS) would require utilities to generate 15 percent of their electricity using renewable resources by 2020. The Senate has passed an RPS three times since 2002, only to have it quashed in the House. This week, Senate Democrats may be within a single vote of ...\n\n\nJun 20, 2007 PR Newswire\n\n\n\nCity of Victorville Expands Award-Winning Peak Power Shifting Program With Additional Orders From Ice Energy\n\n\n\nIce Energy(R), the premier provider of efficient energy storage products for shifting air conditioning demand, today announced that the City of Victorville, California has ordered ten Ice Bear(R) units to provide clean, efficient cooling for the new clubhouse at the city's Green Tree Golf Course. The Ice Bear units will provide 69 tons of cooling and slash the air conditioning  peak demand by ...\n\n\nJun 20, 2007 PR Newswire\n\n\n\nSunPower Secures Morgan Stanley Financing Agreement for Wal-Mart Solar Systems\n\n\n\nSAN JOSE, Calif., June 20 /PRNewswire-FirstCall/ -- SunPower Corporation (Nasdaq: SPWR), a Silicon Valley-based manufacturer of high-efficiency solar cells, solar panels and solar systems, today announced that Morgan Stanley has agreed to own and finance solar electric power systems totaling more than four megawatts that SunPower will deploy on seven Wal-Mart facilities in California.\n\n\nJun 20, 2007 PR Newswire\n\n\n\nClean Energy Announces Exercise of Over-Allotment Option by Underwriters\n\n\n\nSEAL BEACH, Calif.--(BUSINESS WIRE)--Clean Energy Fuels Corp. (NASDAQ:CLNE) announced today that the underwriters of the Company's initial public offering have informed the Company that they will exercise in full their option to purchase an additional 1,500,000 shares of the Company's common stock to cover over-allotments. All over-allotment shares will be sold by stockholders of the Company.\n\n\nJun 19, 2007 Business Wire\n\n\n\n\n\nPG&amp;amp;E, city to fund study of tidal power\n\n\n\nPacific Gas and Electric Co., Golden Gate Energy Co. and San Francisco agreed Tuesday to study harnessing San Francisco Bay tides to create a new source of zero-emissions, renewable electric power. The study, the initial phases of which will begin this summer, will take about 12 months to complete. The study will look at existing and emerging technologies, environmental impacts of capturing ...\n\n\nJun 20, 2007 San Francisco Business Times\n\n\n\nBull Moose Energy Secures $60M To Develop Biomass Power Production Plants\n\n\n\nSan Diego - Bull Moose Energy recently announced that Morgan Stanley has agreed to invest up to $60 million in the San Diego-based firm to finance the development of a new generation of biomass power production plants near urban centers to generate power from renewable energy sources. Amanda Martinez, CEO of Bull Moose, said the first project to be financed under the Morgan Stanley investment ...\n\n\nJun 20, 2007 Power Online\n\n\n\nWashington Gas to cut 300 positions\n\n\n\nWashington Gas Light Co. has signed a 10-year outsourcing agreement with Accenture Ltd. that will result in the utility eliminating about 300 positions, including 50 positions that are currently vacant. D.C.-based Washington Gas, a subsidiary of WGL Holdings Inc. (NYSE: WGL), said it will pay Accenture $350 million over 10 years for a combination of capital expenditures and services, which will ...\n\n\nJun 20, 2007 Washington Business Journal\n\n\n\nSunPower in Financing Agreement With Morgan Stanley for Solar Electric Power Systems\n\n\n\nSAN JOSE, Calif. (AP) - SunPower Corp., which makes and markets solar power products, said Wednesday it reached a financing deal with Morgan Stanley for solar electric power systems for seven Wal-Mart operations in California. Morgan Stanley will own and finance the systems, which will generate more than four megawatts of electricity. The agreement, part of the SunPower Access program, gives ...\n\n\nJun 20, 2007 Canadian Business Magazine\n\n\n\nWFW in merger talks with Chadbourne\n\n\n\nWatson Farley & Williams (WFW) and Chadbourne & Parke are in merger talks to create a transatlantic projects powerhouse with the aim of dominating the burgeoning energy market.The Lawyer can reveal that the firms have been in talks to discuss the potential combination since the beginning of this year.WFW managing partner Michael Greville said: 'There are great synergies between the two firms and ...\n\n\nJun 19, 2007 The Lawyer\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nBritish Energy to assess reactor designs for new UK nuclear build\n\n\n\n- UK nuclear power station operator British Energy has welcomed the decision by UK regulators to establish and begin a generic design acceptance program to allow regulators to assess the safety, security and environmental impact of power station design. British Energy said that it believes any new nuclear generation in the UK should build upon global experience and make use of modern designs that ...\n\n\nJun 20, 2007 Power Engineering\n\n\n\nLaunch of AREVA's EPR Pre-Licensing Process in UK with the Support of Major European Energy Utilities\n\n\n\nPARIS--(BUSINESS WIRE)--Regulatory News: AREVA (Paris:CEI) has applied to the UK Regulators for its EPR nuclear reactor design to be considered for the forthcoming Generic Design Assessment (GDA) process. The application is accompanied by letters of support from British Energy, EDF, E.ON UK, Iberdrola, RWE npower and SUEZ, all who consider EPR to be a potential design for new build nuclear in UK. ...\n\n\nJun 20, 2007 Business Wire\n\n\n\nSTANFORD NEWS: BP Foundation Awards $7.5 Million to Stanford for Research on Energy Markets\n\n\n\nSTANFORD, Calif.--(BUSINESS WIRE)--The BP Foundation has awarded a five-year, $7.5 million grant to Stanford Universitys Program on Energy and Sustainable Development to support research on modern energy markets. The foundation is funded by BP, one of the worlds largest energy companies. The gift follows the BP Foundations initial grant of $1.8 million over three years, which was pledged in 2004 ...\n\n\nJun 20, 2007 Business Wire\n\n\n\nPACE MITCHELL DRILLING CORP Receives US $ 890,000 Second Payment >From SHENHUA Group Coal Mine Degasification Project\n\n\n\nPacific Asia China Energy Inc. (\"PACE\") (TSX VENTURE: PCE) is pleased to announce its 50% owned subsidiary PACE Mitchell Drilling Corp (\"the Company\") has received US$890,000 as the second payment from a degasification drilling contract awarded to the Company by the Shenhua Group, the world's third largest coal miner (see news releases, February 19 and April 24).\n\n\nJun 20, 2007 Internet Wire\n\n\n\nOMX: The Nordic Exchange Welcomes Pearl Exploration and Production to First North\n\n\n\nSTOCKHOLM, Sweden--(BUSINESS WIRE)--Trading in Pearl Exploration and Production Ltd. Swedish Depositary Receipts (SDR) will commence today on First North in Sweden. Including Pearl Exploration and Production, First North now comprises 108 companies. Pearl is a Canadian-based oil and gas company. Pearl is engaged in exploration, acquisition, development and production of oil and natural gas ...\n\n\nJun 20, 2007 Business Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}