{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Francis Chan\" <nexcannonstoragewod@cannonstorage.com>", "subject": "Summer is coming, time to tone up", "body": "\nAnatrim will change your life\n\n\n\n\n\n\nAnatrim – The very up-to-date and most fascinating product for corpulent people is now available – As were seen on CNN.\n\n\nCan you retain all the times when you plead to yourself to do any thing for being delivered from this fastly growing number of kilos? Luckily, now no great price is to be paid. With Anatrim, the earth-shaking kilos-melting medley, you can achieve healthier life style and become really thinner. Just look at what people write!\n\n\n\n\"It’s unbearably difficult to confess but I was awfully addicted to food. \n\n\nI greedily swallowed up all this trash \n\n\nand could not stop. \n\n\n\n\nThis suffering passed away when I started taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite vanished, \n\n\nspirits improved and I turned to the happiest person on the planet 28 pounds in 2.2 months. \n\n\n\n\nI can tell you now I’m the happiest person on the planet!\"\n\n\n\n\n\nMaria H., San Diego\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nIt’s difficult to imagine how I abhorred being derided at school. \n\n\n\n\nI abhorred my weight and I detested even myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nIt literally took me out of this terrible nightmare! A plenty of thanks to you, my friends.\"\n\n\n\n\n\nSteve Burbon, Las Vegas\n\n\n\n\n\n\"Do you know what? Thanks to Anatrim my marriage was happily saved! I went into the circle, depression – eating more – even more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nMy best friend pointed at your web site and I called for Anatrim at the time. \n\n\nThe results were excellent, my appetite came to acceptable level, I was in good spirits oftener, and, be sure, I became able to tighten my belt on some holes. And the bed became cool, too!\"\n\n\n\n\n\nJoe\n\n\n\n\n There is a lot of testimonials left by happy people trying Anatrim. Why don't you add yourself to the thousands and thousands of slim clients and try this natural appetite-decreasing energy raising product now!\n\n\nDon’t miss the opportunity!\n\n\n\n\n"}