{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBS News Early Show <cbsnews___early_show_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Hannah Storm: How to Stay Healthy", "body": "\nCBSNews.com\n\n\n\n \n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n       April 26, \n      2007\n\n\nHi, everyone,\n \nI hope you've been having a great \n      week. It sure has flown by for me \n      as I'm still getting used to being back from vacation. I don't know \n      how Julie does it all the time, \n      flying back and forth from New York to Los Angeles. \n \nI was in L.A. last week \n      and I am still in a completely different time \n      zone!  Last night I was \n      up until midnight which goes against the advice of Steve Slon, editor of AARP magazine, \n      who \n      told us this morning that in order to keep healthy and ward off \n      illness we need get our sleep. Another tip was to get a pet, which is \n      something that Harry and I can attest to.\n \nSpeaking of pets, Harry \n      had a great segment this morning on how to pick a puppy and bring him up. Harry \n      was on set with the cutest puppy this morning but what you didn't see \n      was that the puppy shed all \n      over Harry's grey suit. As Harry put it, he \"took one for the team.\"\n \nAlso this morning, we \n      welcomed our new National Correspondent Jeff Glor, who joins us from Boston. Jeff gave \n      us a behind-the-scenes look at Rosie O'Donnell's surprise \n      announcement Wednesday that she is leaving \"The View\" after just one year. We all sit around \n      after our own show and watch other television shows and there certainly \n      were many screeches in our newsroom when Rosie made her announcement. \n      While many wonder what Rosie will do now, Jeff pointed out that Rosie \n      not only has Broadway aspirations but will also likely have her own \n      show again in the near \n      future. As for the future of the show, it will be interesting to \n      see how ABC will fill those two open seats. \n \nAnd, with warm weather \n      just around the corner we chatted with Consumer Correspondent Susan \n      Koeppen about \n      summer safety tips for the kids and new safety devices for home spas. Susan also gave us a \n      easy tip to keep your child safe: \n      open your windows from the top down to prevent them from climbing or falling out. This is something we started doing in my \n      house a long time ago and it is a simple \n      way to keep everyone safe. \n \nWell folks, the week is \n      almost over so hang in there. We'll \n      see you tomorrow when we'll have the \n      latest Survivor castoff and we'll wrap up our Wedding in a Week series with a lovely ceremony \n      for Lisa and Stephen right on our plaza!\n\n\n\nTake \n      care,\nHannah \n      Storm EarlyShow@cbs.com \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}