{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "Jock Frye <ujzzw@remaxdurango.com>", "subject": "But if she's responsible in any way for your return to blogging, that's good enough for me .", "body": "Brokers Move On ERMX!\n\nEntreMetrix Inc. (ERMX)\n$0.18\n\nHeavy trading today as ERMX announced its launch of digital support\ntools for its portfolio companies. Brokers are getting ahead of this\nsteady climb as they grab up large blocks of shares for there clients.\nLook at the numbers and get on ERMX Friday morning!\n\nSoon you will be tired of them.\n\nThe Elegant Variation: MAN BOOKER INTERNATIONAL The Elegant Variation A\nLiterary Weblog. The interviews are formal and thoughtful but never dry\nand can replace any dozen \"how-to\" books on writing.\nHome Land by Sam Lipsyte In his recent TEV guest review of Home Land,\nJim Ruland called Sam Lipsyte the \"funniest writer of his generation,\"\nand we're quite inclined to agree.\nJust keeping your nose clean.\nNobody helps Africa by adopting its children. She takes her time, making\nsure that the reader is comfortable in the surroundings before moving\nthe plot along. This first-time novelist is ninety years old. Sheila\nHeti has pulled this obscure leaf from the literary archives and\nfashioned a mordantly funny anti-history; a pungent and hilarious study\nof bitterness and promise unfulfilled.\n\nMillard may well be the best extant epic-comedic writer of his\ngeneration, and he stands at equal height with the best of several\ngenerations since.\nThat is why she also won the overall Costa Book of the Year. Millard may\nwell be the best extant epic-comedic writer of his generation, and he\nstands at equal height with the best of several generations since.\n\nBut if she's responsible in any way for your return to blogging, that's\ngood enough for me .\n\nDoesn't mean you have to agree with her but she's definitely\nknowledgeable. Who can possibly turn away from the likes of Saul Bellow,\nT.\n\nNo writer has better captured both the agony and the determination to\nride through the agony. In this one, Alyson Rudd takes you inside the\ndeliberations behind the Costa First Novel Award.\n\nBut if she's responsible in any way for your return to blogging, that's\ngood enough for me .\n\n"}