{"category": "ham", "to_address": "debian-mirrors@lists.debian.org", "from_address": "Arnt Karlsen <arnt@c2i.net>", "subject": "Re: ..weeding out bad debs off mirrors, was: Can I get some help,\n please?", "body": "On Fri, 25 May 2007 14:13:45 -0300, Carlos wrote in message \n<18007.6473.431879.8283@fisica.ufpr.br>:\n\n> Arnt Karlsen (arnt@c2i.net) wrote on 22 May 2007 14:54:\n>  >On Tue, 22 May 2007 07:01:39 +0200, Klaus wrote in message \n>  ><46527933.6020207@gmx.de>:\n>  >\n>  >> Arnt Karlsen wrote:\n>  >> > ..one thing I haven't found, is an easy way to weed out bad files off\n>  >> > my (big bad disk, replacement ordered) mirror after fsck's, my plan is\n>  >> > use md5sum down the debian/tree and weed out all the bad files, instead\n>  >> > of wasting another week re-downloading all the good stuff (right now\n>  >> > I have 71GB of i386 and source) to build a full mirror.  Pointers?\n>  >> \n>  >> Isn't that what debmirror does anyhow to verify the integrity of the mirror?\n>  >> \n>  >> At least I seem to remember that bad or missing files were fixed with the next remirror of my mirror.\n>  >> \n>  >> Cheers,\n>  >> Klaus\n>  >> \n>  >On Tue, 22 May 2007 08:25:38 +0100, Jonathan wrote in message \n>  >:\n>  >\n>  >> doesn't rsyncing take care fo this by itself updating the mirror?\n>  >> \n>  >> mirror.ac3bf1.org\n>  >> John\n>  >\n>  >..IME no (but I use the anonftpsync script), as long as the file names \n>  >matches, all files are accepted as good, I see no md5sum kinda check\n>  >done. I appreciate the \"do not dump that load upstream\", so I'm looking\n>  >for some kinda find *.md5sum* ->xarg md5sum-c -> rm -vf baaad.debs\n>  >oneliner or somesuch to verify my mirror update, pointers?\n> \n> rsync will check the integrity of existing files if used with option -c.\n> However this puts a high load on the server so many of them disable\n\n..aye.  ;o)\n\n> its use. A debian mirror does not need to allow it.\n> \n> The default is to not use -c; in this case only the date and length\n> are used to decide if a file should be updated.\n> \n> One can use the checksums in indices/md5sums.gz to verify the files\n> locally. Very useful indeed... I do it periodically, because a mirror\n> is a significant responsibility.\n\n..aye, but _precisely_how_ do you do it?  Playing with Rafal's\n'zcat indices/md5sums.gz |md5sum -c |grep -v \": OK\" |grep -v ' etc\nfrom the mirror root, I keep finding new innovative variations of\n\": Failure\".\n\n-- \n..med vennlig hilsen = with Kind Regards from Arnt... ;o)\n...with a number of polar bear hunters in his ancestry...\n  Scenarios always come in sets of three: \n  best case, worst case, and just in case.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-mirrors-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}