{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "The pet food contamination--Was it intentional?  That story tonight on the CBS Evening News...", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\nQUOTE OF THE DAY\"A little learning is a \n      dangerous thing but a lot of ignorance is just as bad.\" - Bob \n      Edwards \n\nDID YOU KNOW?Britain's first escalator was installed in \n      Harrods in 1878. \n\nSATURDAY\nON 48 HOURSHere's a note from Bill Lagattuta on Saturday's 48 \n      Hours Mystery, NIGHTMARE IN NAPA: \"Our \n      story this week sounds a lot like the plot of one of those Hollywood \n      slasher flicks. But this story really happened. Two young women viciously \n      murdered in their home by an unknown attacker with a knife who disappeared \n      into the night. And it happened on Halloween. The scene of the crime was \n      the beautiful Napa Valley, America's premiere wine country in California. \n      That made the crime seem even more brutal because killings like that are \n      unheard of in Napa. As we covered the story of the crime three years ago, \n      the killer was still at large and the chance of finding him began to \n      dwindle with each passing month. The families grew frustrated as police \n      seemed unable to turn up new evidence or find suspects. And then it \n      happened... an ending to this story almost a year to the month of the \n      murders. I won't spoil it... the accused killer is someone no one \n      suspected. I hope you'll join us on Saturday night.\" - Bill \n      Lagattuta 48 Hours Mystery airs Saturdays at \n      10pmET/PT FOR MORE ON THIS STORY, WHY NOT READ THE \n      BOOK? 48 Hours Mystery, Nightmare in \n      Napa is now available in bookstores and online at \n      Amazon.com Click Here. This is the first in a brand \n      new series of true crime books published by Simon and Schuster, Pocket \n      Books. Here's more from 48 Hours \n      producer and author Paul LaRosa. \"Nightmare in Napa \n      is the first in a series of true crime books based on the broadcasts of \n      CBS News' 48 Hours Mystery. It is the \n      chilling story of what happened to two women in a house in Napa, \n      California on Halloween night, 2004. 48 Hours \n      Mystery already had produced an hour on the story when Executive \n      Producer Susan Zirinsky and Executive Editor Al Briganti \n      hatched the idea to do a series of true crime books. They asked me to get \n      involved and write the first book because I had then recently published a \n      true crime book of my own called Tacoma Confidential. I \n      began reviewing all the tapes from the Napa broadcast and, as always, \n      there were a lot. That's something most viewers do not realize. In \n      producing any hour for 48 Hours Mystery, producers typically \n      will supervise the videotaping of more than one hundred hours of \n      interviews and other material. All of those hours are edited down to make \n      a compelling, fast-moving, one-hour broadcast for prime-time television. \n      This should give you an idea of the wealth and breadth of material we \n      compile for each broadcast. Because of time restrictions, a lot of \n      material never makes it onto the air. So much is left out that, well, you \n      could write a book, and that's just what we're going to do in this series. \n      Just under three-hundred, thirty-minute tapes existed for the \n      first hour. I went through a good portion of them but decided I had to go \n      to Napa and meet the principals and get a feel for the town and the Napa \n      Valley. So that's what I did. I got to meet, have lunch with or email many \n      of those involved with the story. In some cases, I did original reporting. \n      The original hour ended with the arrest of the murderer but now the case \n      had to wind its way through the courts. I followed it every step of the \n      way, culminating with the dramatic sentencing of the defendant in January, \n      2007. Along the way, I got a real sense for the lives of the two \n      murder victims: Adriane Insogna and Leslie Mazzara, and I hope that I've \n      been true to their memories in the book. They were both special young \n      women whose families are heartbroken by their loss. In many ways, the most \n      surprising aspect of the story is not the murder itself but the identity \n      of the murderer and his reasons for doing what he did. To buy the \n      book: Click Here I can't wait until you \n      read it and please send along your comments. My email is PLR@CBSNEWS.COM \n      or look at my website: PaulLaRosa.com Click Here.\" Thanks, Paul \n      LaRosa If you would like more information on any of these stories \n      or the broadcast, please click on the following address and e-mail us at: \n      48hours@cbsnews.com \n\nTONIGHT ON THE CBS EVENING NEWSHere's an \n      early look at what we are working on for tonight's broadcast of the CBS \n      EVENING NEWS from Anchor and Managing Editor, Katie Couric...\nHi everyone, On the anniversary of the Columbine school \n      massacre, it is a day of complex mourning. Vigils and moments of silence \n      across the country remembered the lives of the 32 victims of Monday’s \n      tragedy at Virginia Tech. Sharyn Alfonsi will have the story of \n      this day of mourning. But the observances were haunted by ghosts of what \n      the similar tragedy eight years ago at Columbine high School in Littleton, \n      Colorado. Bill Whitaker will bring you this story. Our \n      chief investigative correspondent Armen Keteyian will continue \n      coverage of how Seung-Hui Cho obtained his weapons. One day after \n      embattled Attorney General Alberto Gonzales attempted to explain the \n      firings of eight federal prosecutors to a Senate panel, the White House \n      stepped up to back him. Has he done a “fantastic job” as a spokesperson \n      said today, or is he about to lose his job? Jim Axelrod will have \n      the latest. And Nancy Cordes will report on the \n      investigation into the pet food contamination scare. The FDA suggests that \n      much of the recalled pet food may have been intentionally spiked with an \n      industrial chemical that would boost their protein content. We’ll take a \n      closer look. Meanwhile, the stock market is racing toward a new \n      milestone – thanks to strong earnings reports from Internet superstar \n      Google Inc. Anthony Mason will have more. Finally, Steve \n      Hartman will have a story about a warmhearted man who’s helping get \n      homeless people off the street. He’s drastically improved the lives of \n      many people. How? With massive quantities of hot dogs – really. Join us \n      for his story. I hope you have a wonderful weekend. \n      Katie For more on two of the stories noted \n      above, please click on the following links: Nation Grieves \n      With Virginia Tech Click Here FDA Mulls Motive In \n      Pet Food Case Click Here And here's a look at \n      one of the stories we are working on for Monday's broadcast of the CBS \n      EVENING NEWS: After Imus, We'll tell you what African \n      Americans think about hate speech used in rap and hip hop. You'll be \n      surprised at who its most ardent fans are. So that story and MUCH more, \n      Monday night on the CBS EVENING NEWS. If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: evening@cbsnews.com \n      \n\nTONIGHT ON DAVID \n      LETTERMANDave chats with actress Jessica \n      Biel AND This American Life host/producer Ira Glass... Plus, \n      musical guest Regina Spektor! \n\nTOMORROW ON THE SATURDAY EARLY SHOWTracy \n      Smith and Debbye Turner anchor The Saturday Early \n      Show from New York. Kelly Wallace will \n      anchor from Blacksburg, VA. Ira Joe Fisher will bring us the \n      weather. Along with the top news of the \n      day, we will also have the following stories: HEALTHWATCH – \n      CHOCOLATE: Several recent studies have found that chocolate and/or \n      cocoa actually have health benefits. German researchers found that dark \n      chocolate and other cocoa-rich foods lower blood pressure more effectively \n      than green or black tea. It has also been found to help muscles recover \n      from exercise, improve the skin, and boost memory. We’ll turn to Health \n      Magazine Senior Food and Nutrition Editor Frances Largeman-Roth for \n      more on the benefits of chocolate. SATURDAY SPOTLIGHT: Ride \n      for Mobility is a cross-country bike ride that raises money for the Free \n      Wheelchair Mission, a mission that aims to buy 15,000 wheelchairs for \n      physically disabled people in developing countries. We will hear details \n      about this program from the co-founders of Ride for Mobility, Dr. Mike \n      Bayer and Don Schoendorfer. Plus, they will begin their 3,000-mile journey \n      along with a team of cyclists from our plaza! MONEY MATTERS - \n      FOR SALE BY OWNER: More and more homeowners are skipping hiring a real \n      estate broker and selling their properties themselves. Is cutting this \n      cost worth it in the end? Financial adviser Ray Martin will explain \n      the advantages and potential pitfalls of selling your home without a real \n      estate broker as well as provide some advice for those determined to do it \n      themselves. SUMMERIZING YOUR PET: Summer is near, and it is \n      a good idea to think about how to protect your pets from warm-weather \n      health hazards. Veterinarian Ann Hohenhaus, Chairman of Medicine for the \n      Animal Medical Center in NY, will join us on our plaza with tips on how to \n      protect your pets from common summer problems like ticks and fleas, \n      household dangers, and too much sun or heat. CHEF ON A \n      SHOESTRING: Food Network personality Guy Fieri is launching a new \n      series, Diners, Drive-Ins & Dives. In his new show, Fieri shows \n      how anyone can cook up a classic American meal with a unique twist. He'll \n      join us in our Chef on a Shoestring to make an updated dinner \n      classic on our budget of $40. SECOND CUP CAFÉ: Augustana is \n      a folk/rock band out of San Diego, CA. This band, reminiscent of Matchbox \n      20 and Counting Crows, has gained recent success with catchy tunes like \n      “Boston” and “Stars and Boulevards.” Augustana will perform their \n      heartfelt songs from their latest album, All the Stars and \n      Boulevards, in our Second Cup Café. To look for our \n      fabulous recipes... Click Here If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: sat@cbsnews.com \n      \n\nHERE'S WHAT WE HAVE PLANNED FOR SUNDAY \n      MORNINGCHARLES OSGOOD ANCHORS \n      FROM NEW YORK VIRGINIA TECH: After a week of watching and \n      analyzing every nuance of the horrific events at Virginia Tech, what have \n      we learned? As a nation, we've been in this situation before and it seems \n      to be playing out in a very similar manner. So are we all-talk or are we \n      accomplishing something? If so, what? After all, at the bottom of every \n      report and every debate is the desire for everyone to be safe all the \n      time. Is that possible? And what are we willing to give up in order to \n      make that possible? What factors are contributing to these shootings? And \n      is there something inherently American about them? Correspondent Martha \n      Teichner looks for answers on Sunday Morning. JOEL GREY: Joel Grey is one of just a handful of \n      actors to win an Oscar and a Tony for the same role. He was \n      the Emcee in Cabaret, and went on to star on stage, film and television. \n      But it turns out Grey is as comfortable behind a camera as in front of \n      one. At the age of 75, he's developed a second career as a photographer. \n      In this Sunday Morning Profile, \n      Correspondent Rita Braver talks with Grey about his new career, and \n      his lifetime in show business. http://www.joelgreyphotographer.com \n      Click \n      Here http://www.steidlville.com Click Here ART HISTORY: Correspondent Mark Phillips \n      reports on a rare exhibit at the British Museum that provides a snapshot \n      of history. Painted in 1518 by one of the first English settlers, these \n      are the first images of Native Americans. RACHEL CARSON: \n      Mild-mannered scientist and writer Rachel Carson was an unlikely activist, \n      but her book, Silent Spring, is credited with starting the \n      environmental movement. Her legacy can be seen in the formation of the \n      Environmental Protection Agency, which in 1972 banned the DDT pesticide in \n      this country, and can be found in today's debates over global warming, \n      clean energy, and organic food. Correspondent Thalia Assuras \n      reports. LEE IACOCCA: Correspondent Anthony Mason \n      talks to Lee Iacocca about his new book, Where Have All the Leaders \n      Gone? PLASTIC BAGS: When you head to the grocery story, \n      chances are you come out with a whole car load of plastic bags. They've \n      become so commonplace in America that discarded bags are taking up a lot \n      of room in our nation's landfills... and increasingly they've become an \n      environmental concern. One U.S. city recently decided to take on this \n      growing problem with an all-out ban on plastic grocery bags. John \n      Blackstone reports. If you would like more information on any \n      of these stories or the broadcast, please click on the following address \n      and e-mail us: sundays@cbsnews.com \n\nSUNDAY ON FACE THE \n      NATION Bob Schieffer moderates...CBS News’ Face the \n      Nation this week is going to focus on the two \n      big stories of the week: the Virginia Tech shootings and the testimony of \n      U.S. Attorney General Alberto Gonzales. Could the rampage at Virginia Tech \n      have been avoided? Would more or fewer gun laws make a difference? And \n      what is the role of colleges in situations like this? All questions for \n      gun control advocates Jim and Sarah Brady and former FBI profiler Gregg \n      McCrary. We'll also talk with the Chairman of the Senate Judiciary \n      Committee, Patrick Leahy, Democrat of Vermont, about whether he thought \n      Attorney General Gonzales helped or hurt himself with his testimony in \n      Congress about the firing of U.S. attorneys. All of this on this week’s \n      Face the Nation with Bob \n      Schieffer. And there will be, as always, a final word. \n\nSUNDAY ON 60 MINUTESMIND OF AN \n      ASSASSIN: Few people know more about the minds of assassins than \n      those protecting the president of the U.S. Secret Service intelligence \n      officers compare their research to the characteristics of the Virginia \n      Tech shooter. Scott Pelley reports. LIFE IN BAGHDAD: \n      Bombs, shootings and long gas lines are some of the obstacles that \n      residents of Iraq's capital city must deal with daily to survive. Lara \n      Logan reports. STOP SNITCHIN': Anderson Cooper reports \n      on how the hip-hop culture's message not to cooperate with the police in \n      any way has undermined efforts to solve murders across the country. \n\nMONDAY MORNING ON THE \n      EARLY SHOWHarry Smith, Hannah \n      Storm, Julie Chen and Russ Mitchell anchor THE \n      EARLY SHOW from New York. Dave Price \n      will bring us the weather. Along with the top news of the day, \n      we will also have the following stories: ARE YOU AT RISK?: \n      TRIGGER MORTGAGES: A warning to anyone who is applying for or has a \n      mortgage: Whether you know it or not, your personal and financial \n      information could be getting distributed to hundreds of strangers. It can \n      happen the very night you apply for that loan. CBS News Correspondent \n      Mark Strassmann will join us with the story of a growing trend that \n      is taking home buyers by surprise. PERFECT PARENTING: CHOOSING \n      A SUMMER CAMP: As temperatures heat up, swimming pools and summer camp \n      are not far away. But how can you select a camp for your child that is \n      instructive, yet still retains that essence of summertime fun? Monday \n      morning, we'll speak with the folks from KIWI magazine to get their \n      advice before you pack your kids lunches and wave goodbye to those dog \n      days of summer. SIGOURNEY WEAVER ON THE TV SET: \n      People say that Hollywood doesn't care about veteran actresses, but don't \n      say that to Sigourney Weaver. Three decades after her movie career began, \n      Weaver is busier than ever. This month alone, she has two very different \n      films opening. One of those films is The TV Set, in which Weaver \n      plays Lenny, the brash, headstrong president of PDN, who must approve all \n      creative decisions of the network. The film is a smart, engaging comedy \n      about the trials and tribulations of getting a television pilot off the \n      ground. Co-starring David Duchovny, the film is a satirical look at the \n      entertainment industry from the eyes of those who work within it. Monday \n      morning, we will speak with Sigourney Weaver about her latest big screen \n      attraction. FITNESS: GETTING IN SHAPE FOR SUMMER: If you \n      have been a couch potato all winter long, then there has never been a \n      better time to kick it into high gear. Revving up your exercise routine is \n      a sure-fire way to get in shape and get those trouble spots tight and \n      toned in no time. Now, it's easy. With fitness expert Minna Lessig's new \n      workout DVD, Tank Top Arms, Bikini Belly, Boy Shorts Bottom. Monday \n      morning, Minna will join us to demonstrate all the latest workout moves \n      that are sure to get your heart pumping! If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: earlyshow@cbs.com \n      \n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}