{"category": "spam", "to_address": "Wisdom <wisdom@flax24.uwaterloo.ca>", "from_address": "Brian Pratt <pwurtz@getcreativeshow.com>", "subject": "Want to be a hero in bed?", "body": "\n\nLooking for an effective and cheap solution? Tired with your sexual problems? \nBuy medications at RX online drug store!\nMake your dreams come true with licensed medications from Online Pharmacy! Any pills of your choice. \nEverything for your health\nGet licensed mediations that you need!\nWith best regards,\nBrian Pratt\n \n \nShalnoj Vialo povernul golovu v odnu storonu, v druguiu. Ty smog prichinit hot kakoj-to vred samomu shefiru Vo vremia etoj bojni? Bitvy, Niks, v golose Nkota melknuli notki nedovolstva. Vyhodit, uvazhaiut nas sheltiane, esli Specialno dlia nas smenili vse svoi smerchi na eti kuda bolee opasnye Veshchicy. A sejchas mne vse eto kazalos sentimentalnoj chepuhoj. \nChastenko polagaia pri etom, chto dlia kogo-to eta glupost Obernetsia blagom. I moiu sudbu tozhe. Za Pravo razdelat etogo malogo na otbivnye ia budu dratsia s kem ugodno. Drognula zemlia, i goriashchie, Voiushchie klubki ognia, mgnovenie nazad byvshie lysunami, pokatilis vo vse storony. Svetom Zaklinaiu. Skan-set razvernulas sama, slovno istomivshijsia po ranee Privychnoj zhiznedeiatelnosti mozg staralsia naverstat upushchennoe. Zvuk dvigatelej pribyvshego katera ugrozhaiushche snizilsia, i on pronessia Nado mnoj, pikiruia k rasprostertym telam tak stremitelno, slovno sobralsia Ih protaranit. No ty eshche huzhe. \nOn vdyhal vozduh, pronizannyj zolotisto-zheltym siianiem, i s Kakim-to sladkim uzhasom pytalsia predstavit kakovo eto, stupit na etot Zolotoj krug? Chto pri etom chuvstvuesh? On ne znal, kak vygliadit smert v Krugu Prichastiia, vse nastavniki v Presvetlom Dome uporno umalchivali ob etom, no on Pomnil, chto otvetil Gilsveri na vopros Niksarda o tom, chto s nim proizojdet, Esli on okazhetsia ne Svetochem. Kakoj holod, kakoj smertelnyj holod, szhimaiushchij ledianoj lapoj samo Serdce. I grust. Bigman shchelknul Predohranitelem smercha. ejisuminyon Q1FUW1pVckRcUFBGHUFCUEZWRlleXR1XVA==\n \n\n\n"}