{"category": "spam", "to_address": "Manager <manager@flax9.uwaterloo.ca>", "from_address": "Michael Bryant <moskalsk@go4scripts.com>", "subject": "Copies", "body": "\n\nLooking for an effective and cheap solution to have sex like you had 10 years ago?\nAll this you can find here\nWe have pills for any disease: ED, Weight loss, Antibiotics etc. Instant shipping, perfect support!\nOur site\nSecure, confidential purchase!\nWith best regards,\nMichael Bryant\n \n \nKruto, skazal ia, ispytyvaia odnovremenno nedoverie i uvazhenie k Skazannomu o frajdenah. V storonu! otchaianno hripit shordok, podnimaias na rukah. Ia, mozhet, i Pritomilsia, a vot moj zver eshche v sile. Zhodikil byl neveroiatno star istinnogo svoego vozrasta on uzhe ne pomnil i sam, No po starym rukopisiam mozhno bylo prosledit ego uchastie v sobytiiah bolee chem Trehsotletnej davnosti. \nTem ne menee ty eshche smozhesh izvlech iz nih Polzu. Ostin Valigas? Eto imia mne kazhetsia znakomym. Vskore pokazalos dozornoe gnezdo gveltov, vyrublennoe v tolshche skaly na Golovokruzhitelnoj vysote. Prikasaias k ego spine, razminaia Tverdye, napriazhennye uzly myshc silnymi, privychnymi k takoj rabote palcami, Taj Vdrug obnaruzhila, chto ispytyvaet iavnoe seksualnoe udovolstvie, chto ne moglo ne Izumit ee. Moshchnye ruki velikana szhimali Kazhdaia po ogromnomu blasteratoru, vyrvannomu priamo iz stanin: na ih zadnikah Eshche boltalis iskorezhennye chasti krepezhnyh metallicheskih detalej, izognutyh I porvannyh, kak bumaga. Poka ne vyleteli na zasadu. Liubimaia devushka, smotriashchaia na menia s bespokojstvom. Osmelev, Mihkaj otkryl dver poshire, ne vypuskaia dvernoj ruchki i Gotovyj v liuboj moment zahlopnut ee snova. \nNe znaiu, Kakim uzh obrazom, no ia byl v etom uveren. Vprochem, ia sejchas ne doma pered vizorom. Celitelia Pochemu-to s nami v sviazke ne okazalos, no eto bylo ne vazhno. Plachevnye Posledstviia pandemii Gibeli, kak ee zdes imenovali, sostoiali v tom, chto Iz desiati poiavliaiushchihsia na svet mladencev deviat okazyvalis obyknovennymi Debilami, i lish odin obladal talantom kakoj-libo psi-sposobnosti. ejisuminyon XFNdVVJUQHNHRVRXV00bREVSQFBDXlxbG1JT\n \n\n\n"}