{"category": "ham", "to_address": "tridge@samba.org", "from_address": "\"Gerald (Jerry) Carter\" <jerry@samba.org>", "subject": "Re: svn commit: samba r23322 - in branches/SAMBA_3_0_26/source: .\n groupdb", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\ntridge@samba.org wrote:\n> Jerry,\n> \n>  > If you feel comfortable enough with it, I'd rather just drop\n>  > the selectable backend option.  We might leave it in for testing\n>  > but I would like to avoid it in the final 3.0.26 release.\n>  > It can take so long to remove parameters from smb.conf once\n>  > they are in released version.\n>  > \n>  > What do you think?\n> \n> I don't see the harm in having these sorts of options in \n> the code, but deliberately not documenting them.\n\nBut they never stay undocumented.  They become part of Samba\nurban legends.\n\n> They give us options in case a subsystem has a security \n> hole, and we can then say in an advisory \"here is\n> the simple workaround, add this to smb.conf\". It would mean\n> some work for admins (moving their groups back to the tdb, \n> which is not automated) but its doable.\n> \n> I don't actually expect this will be needed as I am \n> very confident of this code, I just don't see the harm\n> in keeping options open.\n\nPlease remove the option.  If we don't absolutely need\nthe parameter, then adding it is bloat IMO.\n\n> It can also have unexpected benefits. For example, \n> Volker just pointed out that ldb doesn't obey the \"use\n> mmap\" option for it's underlying tdb files. I will fix\n> that tonight, but if we had discovered this after\n> the release then we might have had to do a new release\n> just to work around the broken mmap in HPUX, whereas\n> otherwise we can get a few days grace by announcing\n> to the mailing lists that HPUX users should set the\n> option to use tdb based group mapping.\n\nI don't think using tdb as a workaround for a bug\nin ldb in this case is valid even as a temporary workaround.\nEither we ship ldb or we don't.  Sorry for being so hard\nnosed about it, but I fell very strongly about removing\nthe \"groupdb:backend\" option.\n\nI will defer to the majority of course, but no one else\nseems to be voicing their opinion.\n\n\n\n\ncheers, jerry\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\nComment: Using GnuPG with Mozilla - http://enigmail.mozdev.org\n\niD8DBQFGZqasIR7qMdg1EfYRAh1vAKDV1eP6XMQ1NaPgnxSDCiQSM6wmPQCfd+AD\n/e7ZctXVk9Z4CeQwm9voMz0=\n=v3IX\n-----END PGP SIGNATURE-----\n\n"}