{"category": "spam", "to_address": "Myrtless <myrtless@flax24.uwaterloo.ca>", "from_address": "Andrew Cole <central@glenres.com>", "subject": "Say \"I can have sex all night long\"!", "body": "\n\nDon't want to expose your private life? \nClick here to have a nice dick\nU can restore your health right now. Doesn't matter what the problem is - we pills to cure everything. Erection Dysfunction, Weight loss, Anti-Depressant, Antibiotics and even more! Fantastic low prices! \nOur site\nYou can buy absolutely legal, perfect quality must have medications at lowest prices just in few minutes!\nWith best regards,\nAndrew Cole\n \n \nV kakoj-to stepeni menia mozhno Poniat ia hotel lichnoj mesti, zhazhda kotoroj davno uzhe perepolnila chashu Terpeniia. On i ego blizhajshie pomoshchniki. Bol narastala i narastala, spicy Pogruzhalis v cherep, vyzhigaia mozgovuiu tkan. Vyderzhav nebolshuiu pauzu, veroiatno, dlia togo, chtoby smysl ego rechi Doshel do kazhdogo, on obratilsia k prygunu, ugriumo sgorbivshemusia za stolom Sleva ot menia i vremia ot vremeni brosavshemu v moiu storonu ochen nelaskovye Vzgliady. \nPrezhde vsego, ia hochu Koe-chto proiasnit o sebe. Horoshij diadka byl. Ia imeiu v vidu normalnyj dlia moej rodnoj planety, Novy-2. Volshebnyj Zver, spiashchij tysiacheletnim snom, vechnyj geroj, Idushchij na svoiu pogibel k Krugu Prichastiia. A ot samogo mesta, gde ih zastala Zhutkaia smert, tianulo ledianym holodom. Tak vot, vozle Kruga Prichastiia cirkulirovanie Magicheskoj energii osushchestvliaetsia stol prichudlivym obrazom, chto popytka Provesti zaklinanie oborachivaetsia tam sovershenno nepredskazuemym vypleskom sily chashe vsego razrushitelnym dlia togo, kto eto zaklinanie primenil. Ne doezzhaia do holma piatidesiati metrov, otriad Altaresa ostanovilsia i Speshilsia. Vse bylo pravilno. \nNo esli ia ne znaiu togo, o chem ty sprosish? Ty znaesh, uverenno zaiavil on. Emlot mne uzhe soobshchil, chto takimi sposobami peremeshcheniia magi Zdes operiruiut, no redko, trebuiutsia ochen bolshie zatraty energii, poroj Nevospolnimye. Predusmotritelnyj Paren, etot Valigas, hotia i shliaetsia neizvestno gde. Kontrakt. ejisuminyon XF5FVVtTW1Z0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}