{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Wall Street Journal: Abbott's Thai Pact May Augur Pricing Shift", "body": "http://online.wsj.com/article_print/SB117727884277678266.html\n\nAbbott's Thai Pact May Augur Pricing Shift\n\nBy NICHOLAS ZAMISKA in Hong Kong and JAMES HOOKWAY in Bangkok\nApril 23, 2007; Page A3\n\nAbbott Laboratories has backed away from a confrontation with the Thai\ngovernment over patent protection for a popular AIDS treatment, a\nconcession that could embolden other developing countries pushing big\ndrug makers to lower the price of their products.\n\nAbbott is offering to sell the latest version of its AIDS drug Kaletra\nin Thailand at a discounted rate, according to Miles D. White, Abbott's\nchief executive. The move reverses Abbott's decision in February to\nwithhold the new form of Kaletra, called Aluvia in some countries, from\nThailand following a Thai government announcement it would allow sales\nof generic versions of the drug and other branded medicines to cut\npatients' costs.\n\n\"In this particular case, in the name of access for patients, we\noffered to resubmit Aluvia at our new price, which is lower than any\ngeneric, provided they wouldn't issue a compulsory license,\" Mr. White\nsaid. He said the initial decision was driven by \"concern that\ncompulsory licensing would be abused ever-more widely, using HIV as an\nexcuse.\"\n\nJennifer Smoter, a spokeswoman for Abbott, said Thailand's health\nministry has expressed interest in the offer, but a resolution hasn't\nbeen reached. Abbott's move doesn't affect its decision to withhold six\nother drugs from Thailand.\n\nAbbott's turnabout could crimp growth of global drug makers, which rely\non emerging markets to compensate for slowing growth in home markets.\n\nGustav Ando, an analyst for Global Insight, an economic-forecasting\nfirm in Waltham, Mass., said, \"If one country does it...any country can\ndo it.... It's not going to stop there.\"\n\nAbbott, of Abbott Park, Ill., in February, refused to sell the country\nseven of its newest drugs. The move appeared to backfire, prompting\nconsumer boycotts in Thailand, bringing human-rights advocates out in\nsupport of Thailand's policy and provoking protests from some Abbott\nshareholders, who argued Abbott should sell its latest drugs in\nThailand.\n\nThailand generated about $30 million a year in sales for Abbott, said a\nperson familiar with the company's sales.\n\nIn backing down, Abbott is joining Merck & Co. and Sanofi-Aventis SA,\nwhich already have cut the prices of their AIDS and heart-disease drugs\nin the hope of dissuading Thailand from switching to less-expensive\nalternatives.\n\nThailand still could choose to import generic drugs to replace\nAbbott's, however, just as it is now using generic versions of Merck's\nAIDS drug Efavirenz, despite Merck's own move to lower prices.\n\nBig drug companies have been pushing sales in emerging markets like\nThailand, in part, because of a backlash against expensive brand-name\ndrugs in the U.S. and other Western markets.\n\nMerck expects revenue in emerging markets to double by 2010 to more\nthan $2 billion a year. Abbott's international pharmaceutical sales\ntotaled $1.68 billion in the first quarter of this year -- nearly as\nmuch as its $1.69 billion in U.S. sales. In 2006, Abbott's total sales\nin the U.S. dropped 7.5% to $11.5 billion, while the company's\ninternational revenue rose nearly 11% to $10.9 billion.\n\n\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}