{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "robert weissman <rob@essential.org>", "subject": "[Ip-health] Thai GPO May Sue USA for Innovation", "body": "*The article below does not report this, but Ashley Wills, former\nassistant USTR who is quoted in this story, is *senior business advisor\nat the global law firm WilmerHale. Among WilmerHale's clients:\nmultinational drug companies Pfizer, Schering Plough and Wyeth, and\nmedical technology firms Becton Dickinson and Perkin Elmer.\n\n----\n*\nhttp://www.bangkokpost.com/News/12May2007_news01.php\nBangkok Post\nMay 12, 2007\n\nGPO may sue US lobby firm*\n\n/*Says advert about local Aids drug misleading*/\n\n*APIRADEE TREERUTKUARKUL ACHARA ASHAYAGACHAT*\n\nThe Government Pharmaceutical Organisation (GPO), the manufacturer of\nthe local anti-Aids drug GPO-VIR, is considering suing USA for\nInnovation for publishing advertisements containing misleading details\nabout the drug's efficacy and the country's move to override Aids drug\npatents through compulsory licensing. Vichai Chokewiwat, chairman of the\nGPO board, yesterday said he was in consultation with legal experts to\nprepare lawsuits against the group which lobbies for US pharmaceutical\ncompanies, in addition to the media that published the advertisement.\n\n''We have to do something in response to such a provocative public\nrelations campaign.\n\n''What USA for Innovation claimed in its advertisement is not true and\nthat damages the country,'' he said, adding that GPO-VIR's fact file,\nincluding the latest study on drug resistance, would be sent to the\nForeign Affairs Ministry.\n\nThe full-page advertisement in English-language newspapers claimed that\nGPO-VIR was an HIV treatment copy. Citing a study by Mahidol University,\nit added that a high resistance rate of 39.6-58% was found among users.\n\nWasun Chantratita, chief of Mahidol University's virology and molecular\nmicrobiology unit, said the advert that cited his study was only half-true.\n\nHe said the study on drug resistance was conducted in 2000 _ two years\nbefore GPO-VIR even existed. It focused on three individual original\ndrugs _ Nevirapine, Lamivudine (3Tc) and Stavudine (d4T) _ not GPO-VIR.\n\nGPO started to produce GPO-VIR, which combines Nevirapine, Lamivudine\nand Stavudine, in 2002.\n\nSombat Tanprasertsuk, director of the Aids, Tuberculosis and\nSexually-Transmitted Diseases Bureau, said a study by Siriraj Hospital\nin 2005 showed that the resistance rate to the anti-Aids drug after two\nyears of usage was 14.6%. But some HIV-positive people may have\nexperienced resistance to Nevirapine and so they have had to use the\nsecond-line drug instead.\n\nStatistics released by the Public Health Ministry show that some 500,000\npeople are living with HIV/Aids. Of the total, about 100,000 depend on\nanti-Aids drugs.\n\nIt is expected that some 12,000 people will need the second-line drug\nbecause of GPO-VIR resistance.\n\nAshley Wills, a former assistant US Trade Representative (USTR)\ncurrently advising a law firm, said Thailand should cancel\n''unnecessary'' compulsory licensing for the sake of good relations with\nthe US and American investors in the long run.\n\nOverriding drug patents with compulsory licensing has affected\nThailand's reputation and the mechanism was used in the context of\nreduced respect for intellectual property rights, which he said is key\nto attracting foreign investment.\n\nThailand has been downgraded to the Priority Watch List not only because\nof compulsory licensing but because of its overall disrespect for\nintellectual property rights, Mr Wills added.\n\n''I'm not concerned whether it is legal or not legal to override the\nmedical patents but the question is whether it is smart for Thailand or\nnot,'' he said, adding that reduced drug prices were a short-term gain\nwith long-term costs.\n\nHe cited the potential flight of foreign investors amid intense\ncompetition worldwide and in the region.\n\nThe decision to apply compulsory licensing has increased tensions\nbetween Thailand and the US that existed since the coup in September\nlast year, he said.\n\nMr Wills blamed the drug companies for not taking seriously discussions\nand requests by the Public Health Ministry to ''review the prices\nacutely and at an earlier point''.\n\nBut he criticised the Thai government for taking the step prematurely\nbefore all negotiated means had been exhausted.\n\n''The health ministry might feel the drug firms are too aggressive and\ntheir prices are too expensive, but the perception by the American\nprivate sector is shock. We think the measure should be the last resort\nafter an adequate and serious consultation,'' he said.\n\nIf Thailand was diluting standards as American investors feared, it\nwould destroy the incentives they need, he said.\n\nBut if Thailand stopped applying compulsory licensing, it would be\nwidely welcomed by the US and international community, he added.\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}