{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] Letter from 12 House Members to USTR Asking for Release of KORUS\n FTA Text", "body": "May 23, 2007\n\nThe Honorable Susan C. Schwab\nU. S. Trade Representative\n600 17th Street, N.W.\nWashington, DC 20508\n\nDear Madam Ambassador:\n\nWe are writing to request that you release the full text of the\nU.S.-Korea Free Trade Agreement (the \"Agreement\") to Members of Congress\nimmediately. We are now past the midpoint in the 90-day period provided\nby statute for Congress and U.S. private parties to evaluate a trade\nagreement prior to the President signing it. Unfortunately, the text of\nthe Agreement remains secret and has been made available only to a\nrelative handful of individuals in the private sector and in Congress.\n\nSince announcing the Agreement, Administration officials have made a\nnumber of statements to the press characterizing the Agreement, and\nasserting that it is the largest and most important free trade agreement\nsince NAFTA. Until the text of such a significant agreement is released\nto Congress, we are unable to conduct our requisite oversight function.\nWe believe Members of Congress play a vital role in discussing issues\nthat may arise under the Agreement, and now is the most appropriate time\nto address such issues. Further, it does not make sense to us for the\nAdministration to be soliciting support from Members of Congress if the\nAdministration has not released the text to the American people.\n\nIn addition, we remain deeply concerned with the auto provisions based\non industry reports because of the apparent failure to include in the\nAgreement the Bipartisan Congressional Auto Proposal, conveyed to the\nPresident by our letter of March 1, 2007. Release of the text is overdue\n- and concerns among our and other offices extend well beyond the\ncritical auto provisions.  All members of Congress are entitled to a\nmeaningful chance to review and comment on the Agreement.  Consequently,\nwe strongly urge you to release the text of the Agreement to all Members\nof Congress without further delay.\n\nThe Honorable Charles B. Rangel\nThe Honorable Sander M. Levin\nThe Honorable John Dingell\nThe Honorable Dale E. Kildee\nThe Honorable Ellen O. Tauscher\nThe Honorable Bobby Rush\nThe Honorable Carl Levin\nThe Honorable George V. Voinovich\nThe Honorable Evan Bayh\nThe Honorable Debbie Stabenow\nThe Honorable Candice S. Miller\nThe Honorable Thaddeus McCotter\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}