{"category": "ham", "to_address": "\"\" <ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"The Internet Patrol\" <info@theinternetpatrol.com>", "subject": "\n The Internet Patrol -  Code to Crack DVD Encryption and  Allow You to Copy DVDs Posted to Net and Creates Uproar", "body": "\n\n\nThe Internet Patrol\n\n\n The Internet Patrol\nhttp://www.theinternetpatrol.com\n\nCode to Crack DVD Encryption and  Allow You to Copy DVDs Posted to Net and Creates Uproar\n\nThis week someone leaked a serious DVD cracking code to allow you to bypass the HD DVD encryption which keeps you from copying DVDs.  Digg is now in the middle of a battle with AACS (Advanced Access Content Systems) because Digg's users posted the code on Digg.  Repeatedly.  First Digg took it down in compliance with AACS' cease and desist demands, but after an uproar from their users, Digg did an about face, let them post the code, and said to the AACS, essentially, \"bring it on.\" \n\nRead more here: Digg Digs in its Heels Over DVD Cracking Posts, Refuses to Cease and Desist \n\nPlease visit http://www.TheSiteForTheCure.com !  Pretty please??\n\nHere are some amazing deals we've found on the Internet for ourselves recently:\n\n\nSend Unlimited Newsletters to Your Customers, Friends, Family, and Others:  http://www.theinternetpatrol.com/the-perfect-way-to-send-email-newsletters\n\nUnlimited Calls to Any Phone in the U.S.:  http://www.theinternetpatrol.com/make-unlimited-phone-calls\n\nCheck out our online audio show, \"Three Things You Should Know\"!  http://www.ThreeThingsYouShouldKnow.com\n\n\nAnd check out the best collection of how to videos at http://www.LearnHowTo.TV !\n\n\nKnow somebody who would like to receive these alerts?  Forward this one to them and let them know\nthat they can sign up for free by sending email to \"internetpatrol@aweber.com\" with the \nword 'Subscribe' in the subject!\n\n\n\n\n\nThe Internet Patrol, \n302 W. El Camino Real, #411, \nSunnyvale, CA 94087, USA \n\n\n\nTo unsubscribe or change subscriber options visit:\nhttp://clients.suretymailings.com/z/r/?TBwMLMwctMzsTCxMTJzs\n\n\n"}