{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Michael Weaver\" <weavermicha@googlemail.com>", "subject": "Re: modified fedora and software speech", "body": "Hi!\nThanks for your message as regards Speakup and Fedora.\nIf I am going to be getting the non-modified Fedora when it is\nreleased what is the URL for it and is it simple to add Speakup to it\nparticularly as I might be having to try to guide one Fedora user in\nher early to late twenties as to how to go about compiling Speakup or\nwhatever for me, I am 29 myself and she runs rings around me despite\nthe something like 9 or a fewer less years junior age gap.\nI may need to wait until next Monday when I attend the Huddersfield\ngroup as I may see Libbie one of those who can help me with it this\nWednesday at the Birstall group if there is one on this Wednesday and\nshe doesn't always attend the Huddersfield one although there maybe\nother Fedora users in the group who often attend both groups.\nThe other thing is Libbie or some of the others may not have as much\nknowledge about speech access as me as they don't have to use Linux\nscreenreaders although Ben is taking an interest in the accessibility\nside  but any help would be welcome.\n\nOn 27/05/07, Janina Sajka  wrote:\n> You can use software speech with Speakup on Fedora. However, I would\n> advise you to wait for the forthcoming release of Fedora 7. It's due out\n> later this week. Since you're not installing it yourself, there's no\n> particular reason to favor the Speakup Modified at this particular time.\n>\n> Janina\n>\n> Michael Weaver writes:\n> > I am thinking of switching from Ubuntu to Fedora as I am concerned\n> > Graphical Web browsing is still in its early stages and maty need\n> > Speakup if I want any kind of access to web pages as I am still a fair\n> > newby to Linux.\n> > I have downloaded the Speakup modified Fedora but what I would like to\n> > know is can I use software speech if I install it without a hardware\n> > synthesiser?\n> > I know to do an eyes free installation and get all the bennifits of\n> > bootup and shut down messages it requires a hardware synth but if I\n> > don't have one or in my case I have lost what goes into the COM 2 port\n> > or whatever it is called in Linux, can I still run Speakup if I get\n> > the modified Fedora installed by a Sighted person ie if someone at one\n> > of the LUGs I attend installs it for me?\n> > I ask because this week I might be attending a meeting in Birstall\n> > which is where one of the LUGs I attend is. I text someone who uses\n> > Fedora with my questions but she might be busy as she still hasn't got\n> > back to me on my latest messages and not being Visually Impaired she\n> > might not know the answer anyway as she mo9stly uses the KDE\n> > environment.\n> > Hope someone can answer my question about the modified Fedora as I\n> > tried to run Lynx with Orca from the Gnome terminal but I had problems\n> > tracking the text on pages as it seems to repeat lines so far down\n> > pages so it tries to read other stuff it has already read and I didn't\n> > have much luck with w3m as the hotkeys don't seem to be verry clear or\n> > they are assigned for a Japaneese rather than UK keyboard and I seemed\n> > unable to enter forms using it because when I typed in the text field\n> > it tried to activate commands.\n> >\n> > _______________________________________________\n> > Speakup mailing list\n> > Speakup@braille.uwo.ca\n> > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n> --\n>\n> Janina Sajka,\tPhone:\t+1.202.595.7777;\tsip:janina@a11y.org\n> Partner, Capital Accessibility LLC\thttp://CapitalAccessibility.Com\n>\n> Marketing the Owasys 22C talking screenless cell phone in the U.S. and\n> Canada\n> Learn more at http://ScreenlessPhone.Com\n>\n> Chair, Open Accessibility\tjanina@a11y.org\t\n> Linux Foundation\t\thttp://a11y.org\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}