{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "215p 6/21 Update: Landing delayed to Friday; updating landing times", "body": "\n\n\n\n\n215p 6/21 Update: Landing delayed to Friday; updating landing times\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 87\nPosted: 2:00 PM, 6/21/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-84 (06/21/07): Astronauts prepare for entry; Russian computer test on tap\n   SR-85 (06/21/07): Atlantis entry delayed at least one orbit due to weather\n   SR-86 (6/21/07): Two Russian computers fail to restart when jumpers removed for test; other four computers continue working normally; troubleshooting continues\n   SR-87 (06/21/07): Re-entry delayed one day due to weather; updating Friday landing opportunities\n\n=================================\n\n2:00 PM, 6/21/07, Update: Bad weather forces one-day landing delay; updating Friday landing opportunities\n\nAlready running one orbit late, entry flight director Norm Knight, faced with low clouds, area thunderstorms and a pessimistic forecast, told the Atlantis astronauts to back out of re-entry preparations and to stay in space another 24 hours.\n\n\"Yeah, we looked at it as hard and as long as we think is reasonable,\" astronaut Dominic \"Tony\" Antonelli radioed commander Rick Sturckow around 1:30 p.m. \"The rain showers and the ceilings are going to keep us from making it into Florida today. Per the timeline, we're ready for you to flip over to deorbit prep back-out.\"\n\nAtlantis has enough on-board supplies to remain in orbit until Sunday, but Knight has decided to bring the shuttle home Friday, at either Kennedy or Edwards Air Force Base, Calif., if the weather permits.\n\n\"The weather forecast for KSC and also what we had given you for Edwards hasn't changed too much for tomorrow so we're going to be fighting the same challenges at KSC,\" Antonelli radioed. \"At Edwards, the winds are going to pick up. So what we've come up with is in about three hours, we're going to do an 11-foot-per second (rocket firing) and what that's going to do for us is pull in an earlier Edwards opportunity and have the potential to get in there before the winds pick up.\"\n\n\"OK, understand if we don't get into KSC tomorrow then you're shooting for Edwards after you get two looks at KSC?\" Sturckow asked.\n\n\"We are, of course, calling up Edwards tomorrow,\" Antonelli said. \"We'll have the first look at KSC and now the second look at KSC will overlap with the first look at Edwards. And of course, after the end of the day we'll have a better look at the Saturday forecast, so we're going to put all that into the equation. But we'll be calling up both KSC and Edwards tomorrow.\"\n\n\"OK, we understand, so tomorrow if you don't get into KSC and the weather is good at Edwards, you intend to go to Edwards. But if the weather is bad at both places, then we'll look at Saturday and see what happens.\"\n\n\"Yeah, if the weather is good at Edwards tomorrow, just like you said, and not at KSC, then we're going to land there,\" Antonelli agreed. \"We are going to try to land tomorrow.\"\n\n\"OK, yep, we understand that,\" Sturckow said. \"Thank you very much, Houston. Sounds like a great game plan.\"\n\nThe astronauts have two landing opportunities in Florida on Friday - at 2:18 p.m. and 3:54 p.m. - and, with the rocket firing later today, three at Edwards Air Force Base, Calif.\n\nHere is an updated list of all available landing opportunities Friday, Saturday and Sunday at Kennedy (KSC), Edwards (EDW) and White Sands Space Harbor, N.M. (NOR). This list includes the additional Edwards opportunity Friday that was discussed by Antonelli (all times in EDT and subject to change):\n\nDAY...EDT.......DD...HH...MM...EVENT\n\n06/22/07\nFri  01:16 PM...13...17...38...KSC: Deorbit on rev 218\nFri  02:18 PM...13...18...40...KSC: Landing\nFri  02:46 PM...13...19...08...EDW: Deorbit on rev 219\nFri  03:49 PM...13...20...11...EDW: Landing\nFri  02:52 PM...13...19...14...KSC: Deorbit on rev 219\nFri  03:54 PM...13...20...16...KSC: Landing\nFri  04:21 PM...13...20...43...EDW: Deorbit on rev 220\nFri  05:24 PM...13...21...46...EDW: Landing\nFri  05:58 PM...13...22...20...EDW: Deorbit on rev 221\nFri  06:59 PM...13...23...21...EDW: Landing\n                               \n06/23/07\nSat  11:59 AM...14...16...21...KSC: Deorbit on rev 233\nSat  01:02 PM...14...17...24...KSC: Landing\nSat  01:31 PM...14...17...53...NOR: Deorbit on rev 234\nSat  02:33 PM...14...18...55...NOR: Landing\nSat  01:35 PM...14...17...57...KSC: Deorbit on rev 234\nSat  02:37 PM...14...18...59...KSC: Landing\nSat  03:05 PM...14...19...27...EDW: Deorbit on rev 235\nSat  04:07 PM...14...20...29...EDW: Landing\nSat  03:06 PM...14...19...28...NOR: Deorbit on rev 235\nSat  04:08 PM...14...20...30...NOR: Landing\nSat  04:40 PM...14...21...02...EDW: Deorbit on rev 236\nSat  05:42 PM...14...22...04...EDW: Landing\nSat  04:43 PM...14...21...05...NOR: Deorbit on rev 236\nSat  05:44 PM...14...22...06...NOR: Landing\n\n06/24/07\nSun  12:20 PM...15...16...42...KSC: Deorbit on rev 249\nSun  01:22 PM...15...17...44...KSC: Landing\nSun  01:52 PM...15...18...14...NOR: Deorbit on rev 250\nSun  02:54 PM...15...19...16...NOR: Landing\nSun  01:56 PM...15...18...18...KSC: Deorbit on rev 250\nSun  02:58 PM...15...19...20...KSC: Landing\nSun  03:26 PM...15...19...48...EDW: Deorbit on rev 251\nSun  04:27 PM...15...20...49...EDW: Landing\nSun  03:28 PM...15...19...50...NOR: Deorbit on rev 251\nSun  04:27 PM...15...20...49...NOR: Landing\nSun  05:02 PM...15...21...24...EDW: Deorbit on rev 252\nSun  06:03 PM...15...22...25...EDW: Landing\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}