{"category": "ham", "to_address": "John Goerzen <jgoerzen@complete.org>", "from_address": "Michael Poole <mdpoole@troilus.org>", "subject": "Re: Bacula: GPL and OpenSSL", "body": "John Goerzen  writes:\n\n> On Thu, Jun 07, 2007 at 12:17:28PM -0700, Walter Landry wrote:\n>> GnuTLS + libgcrypt + libtasn1 implements everything unless you need\n>> ECC.\n>> \n>> > And why does FSFE disagree with our interpretation?\n>> \n>> Michael Poole gave a good answer.\n>\n> He didn't address the FSFE -- where are they taking a different analysis\n> than us on this?\n\nI have not seen a specific statement from FSFE on the question, so I\ndo not know and I had preferred not to guess.\n\nI suspect that their analysis was more liberal on -- or overlooked --\nthe angle of Debian as distributor of OpenSSL in accompaniment with\nGPLed works that are linked against it.  Perhaps the FSF's intent for\nthe GPL is to allow a more LGPL-like option with regards to system\nlibraries; that would make sense and I think not sacrifice software\nfreedoms.  However, I have not seen a defensible way to construe the\nactual wording other than the one that classifies Debian's method of\ndistribution as each work accompanied by the other(s).\n\n[As a side note, I think that resolving this in favor of allowing\nworks under the plain GPL to dynamically link against OpenSSL would\nallow the aggregation of binary firmware blobs into a package of the\nLinux kernel.  The lack of source for those blobs would still bar them\nfrom \"main\", but it would not be a license issue.  This is meant\nsimply as an observation, not a judgment of whether that would be a\ngood or bad result.]\n\nI am not a lawyer, but I belive that most lawyers urge clients to err\non the side of caution when straying from a strict interpretation of\nlicense -- or even when interpreting ambiguous clauses.  I try to\nfollow that guide when making suggestions on what a license permits.\nIn this case, the wording is consistent and clear, although in an\nunfortunate direction, and I would not want to rely on extrinsic\nevidence[1] about the GPL's meaning if I were in court.\n\n[1]- http://en.wikipedia.org/wiki/Parol_evidence_rule\n\nMichael Poole\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}