{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tMONDAY 21 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER SIMON ENRIGHT\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tJeremy Paxman presents tonight's programme.\n\n\nMedical Morale\n\n\nWhy is it that doctors are paid more than ever and work fewer hours but according to James Johnson, who's just been forced to resign as boss of the BMA, morale has never been lower? \n\n\nWe'll try and answer that question - and work out whether it matters if doctors are unhappy as long as the NHS is in rude health. Please do join the debate which has already begun here.\n\n\nOne patient gives his views and experiences here\n\n\nLebanon Clashes\n\n\nThere's been a second day of bloody  fighting in Lebanon as the army shell a Palestinian refugee camp in the North of the country. \n\n\nOur diplomatic editor Mark Urban will explain just why the clash is so important to the future of the Lebanese government and to the wider conflict across the Middle East.\n\n\nRacism in Psychiatry?\n\n\nBlack British men are up to eighteen times more likely to be diagnosed with mental health problems than white men. Is this institutional racism? \n\n\nNot according to the latest evidence from the Institute of Psychiatry. They argue that calling it racism is getting in the way of treating black patients, we explain.\n\n\nCutty Sark and the Stars\n\n\n\"We will put her back together\" - the words of Dr Eric Kentley, curatorial consultant to the Cutty Sark Trust, after he'd seen the damage from this morning's fire. \n\n\nTonight we'll ask why we hold the Cutty Sark in such high regard. And Our Science Editor Susan Watts has an exclusive preview of the latest exhibit at the maritime museum - can the new planetarium rebuild Britain's interest in the stars?\n\n\nDo join us at 10.30pm.\n\n\nSimon\n\n\nMissed Newsnight Review?\n\nClick here to watch online\n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}