{"category": "ham", "to_address": "speakup@braille.uwo.ca", "from_address": "Steve Holmes <steve@holmesgrown.com>", "subject": "Re: Software speech opinions", "body": "Like others have said on the list here, it's one thing to make a\nprofit but another to gouge with huge margins.  I keep hearing \"small\nmarkets\" and all that.  I like Spie Southerland's mention of\ndiversifying the market; expanding it to those without disabilities.\nI remember when screen readers for DOS went down real low - something\nlike $200 or so and now the windows versions are around $1,000.  I\nreally don't think inflation has gone up all that much.  \n\nOne good example of reasonable pricing is the Cepstral voices.  You\ncan buy a single voice for $29 and even Software DECtalk from Fonix\nsold for $50; I assume it still does?  That's not too out of line.\n>From a philosophical standpoint, I prefer the open source / free\nsoftware model - look at gnu/linux, but these other guys who don't\nhave anything else to sell, they might need the closed software model.\n\nOne point of greed from my point of view would be Access Solutions\nrefusing to publicize the specs for their USB synths.  Just think,\nthey could publish the specs and as a result the units could be more\neasily used on more platforms.  That means more sales in my book.  You\nwould think that would be a no-brainer for any company but so many\ncompanies are stupid about this.  I mean look at Apple and the Ipod;\nthey don't want anyone to be compatible with it!\n\nOn Mon, Jun 25, 2007 at 11:31:42PM -0500, Glenn Ervin wrote:\n> The argument about competition bringing down the price does not wash with \n> screen-readers for Windows.\n> JFW &  W E have both gone up in the past years, and continue to do so.\n> I am waiting for a screen-reader like NVDA or Thunder to get nearly as \n> functional as the above mentioned major screen-readers, and maybe then they \n> will come down in price.\n> But until they have to, they will keep milking us for all it's worth.\n> Glenn\n> \n> ----- Original Message ----- \n> From: \"Spie Sutherland\" \n> To: \"Speakup is a screen review system for Linux.\" \n> Sent: Monday, June 25, 2007 11:42 PM\n> Subject: Re: Software speech opinions\n> \n> \n> I used to have resources for some R&D and did many things. One was\n> to get a \"special\" keyboard designed for people with limited motor skills,\n> to find out what was so special about it, and why it was so damn\n> expesive. Granted it was more expensive than a normal keyboard, had\n> proximity sensors and audible feedback, and somebody had to write\n> some custom firmware, but at $450 for a keyboard that was an\n> astounding sum. If you look beyond stuff like just software, to the whole\n> assistive tech market in general, you see inflated prices that as I said, I\n> consider to be obscene.\n> \n> Software can be free, yes, but that doesn't solve many other needs. Much\n> work needs to be done and it can't all be free, or the advancement is\n> limited. As long as assistive tech is considered to be something that is so\n> radically different that the only answer is \"there are grants for that\" then\n> choices are limited and some of the much needed R&D doesn't get done.\n> I personally believe most people are missing something important, that\n> some of these assistive tech ideas are ones that many people need. Take\n> speech tech for example, people can't look at a computer screen while\n> they are driving, and not really efficiently while walking. They do not\n> need to be disabled in any way to benefit from speech and many other\n> assistive technologies.\n> \n> Work on all of these things are more globally desireable than one would\n> think if you break them down into parts. Take a keyboard for example,\n> there should be multiple modalities available as the input to anything and\n> the output from everything in the long term. I'm all for open source but\n> then to expect everything to be free means, at least to some degree, you\n> get what you pay for. People will pay for good tech, if it's fair priced.\n> At least part of what is happening, the part I don't like, is that for some\n> things, they are intentionally so expensive that nobody can afford them\n> without some subsidy, grant, insurance, or some other bueroctratic\n> process. More comptetition would actually drive prices down. More\n> people making products would be a good thing. If all assistive tech\n> was done for free then it would only ever be hobby activity, it will\n> never put food on the table of people who produce it.\n> \n>   -- Spie\n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n-- \nHolmesGrown Solutions\nThe best solutions for the best price!\nhttp://holmesgrown.ld.net/\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}