{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Gino Price\" <nasearlgreygolfclubpiv@earlgreygolfclub.com>", "subject": "Watch your body change with Anatrim", "body": "\nHealthy living with less fat\n\n\n\n\n\nAnatrim – The very up-to-date and most delighting product for over-weight people is now available – As could be seen on ABC\n\n\n\nDid you understand that excessive body kilograms kill more and more people every year? We know you hate the unsightly look of those people and the social bias against them. \n\nMoreover, you have not the will to withstand pressure of baneful eating habits of yours. If this all sounds familiar, then we have something for you!\n\n\n\n\n\nHere there is Anatrim, the recent product for the reduction of your body’s extra weight. The greatest thing about Anatrim is it raises the quality of your life, making you feel no hungry and giving you joyful spirit. Here you may read what people write to us about this product:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of stuffing myself with food and watching TV constantly \n\n\nI became keen on taking exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I have a great figure now and there are lots of men around me!\"\n\n\n\n\n\n\nAmelia B., Chicago\n\n\n\n\n\n\n\"I tried some passive weight losing, you know, but almost with no result. I could not restrain my ravenous appetite. \n\n\nOnce I heard about Anatrim in the media and it brought a great influence on me.\n\n\n I had tried to take it, and my wife told me I look very good now, 3 months later. \n\n\n33 pounds have gone away and I keep losing them! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nMikkey Fox, Chicago\n\n\n\n\n\nAnatrim gives you an opportunity to realize that you doesn’t have such a great need for that much food. It raises your spirit, provides you with additional energy, and attacks useless kilos. All thanks to its mighty comprehensive formula!!\n\n\n\nPry out more useful information!\n\n\n\n"}