{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"John Heim\" <jheim@math.wisc.edu>", "subject": "Re: comparison of different distros", "body": "Well, I am not really recommending debian but I would think it would be the \neasiest thing for you to use since you're currently using ubuntu. If you \nswitch to suse or fedora core you'd  have to relearn some things. Installing \npackages, starting & stopping services, and configuring networking area all \nthe same in debian and ubuntu. But all those things are different in suse \nand fedora.\n\nIt's become a cliche but as it turns out, the best distro is the one that is \nbest for you.\n\n\n---- Original Message ----- \nFrom: \"Michael Whapples\" \nTo: \nSent: Monday, June 04, 2007 4:23 AM\nSubject: comparison of different distros\n\n\n> Hello,\n> With the news of ubuntu dropping speakup in gutsy, I am thinking of\n> changing to another distro where I will have speakup for the text\n> console. I am just wondering what is the advantages of the different\n> distros (what is the good points and bad points to each one). I have\n> previously used slackware, but found sometimes compiling software could\n> be a problem due to the continuation of using a 2.4 kernel and some of\n> the libs. I have also used gentoo which seemed to work well except for\n> all configuration was left to be done by hand and if not careful while\n> doing an update you may find the system fails because of a change in the\n> configuration options. How does debian compare? Also could anyone point\n> me in the direction of a comparison of the different distros.\n>\n> From\n> Michael Whapples\n>\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}