{"category": "ham", "to_address": "simo <idra@samba.org>", "from_address": "James Peach <jpeach@samba.org>", "subject": "Re: getting rid of mkproto.sh from Samba3", "body": "On Jun 3, 2007, at 8:39 PM, simo wrote:\n\n> On Sun, 2007-06-03 at 20:29 -0500, Gerald (Jerry) Carter wrote:\n>> -----BEGIN PGP SIGNED MESSAGE-----\n>> Hash: SHA1\n>>\n>> Simo,\n>>\n>>> On Sun, 2007-06-03 at 14:31 -0700, James Peach wrote:\n>>>> Hi all,\n>>>>\n>>>> Is there any interest in moving Samba3 from generated prototypes to\n>>>> static headers. ie. getting rid of mkproto.sh and \"make headers\"?  \n>>>> I'd\n>>>> like to start doing a bit of work in this area, but I don't want to\n>>>> upset anyone if there's a lot of love out there for generated\n>>>> prototypes ...\n>>>\n>>> If that means you can come out with another method to\n>>> avoid changing .h files by hand, then you are welcome.\n>>> Otherwise I think it would just be a step back I really\n>>> don't see the need for.\n>>\n>> mkproto.sh promotes lazing programming, leads to bad interfaces\n>> and to monolithic code.\n>>\n>> We should all suffer the pain of change *.h and *.c when\n>> change an interface.\n>\n> You say it right here, \"when change an interface\".\n> What would be nice, is to have something like in samba4, where you can\n> mark an interface as public or private, and have a much better\n> dependency driven set of auto-generated proto headers.\n>\n> Changing a private interface pose no problem, the real problem is with\n> public interfaces, well I'd agree to keep manually changing public\n> interfaces eventually, as that would make you immediately  \n> (hopefully :)\n> understand you are changing a public facing interface non just an\n> internal function.\n>\n>\n> But for most of the internal code, having to change headers by hand is\n> just an annoying slowdown imo.\n\nNo, the real problem is the internal interfaces.\n\nFor example, in kerberos_verify,c, there is a call to  \n\"name_to_fqdn(my_fqdn, global_myname())\".\n\nIf the host has a DNS configuration that includes a conventional  \nsearch path, this works. If it works, it does exactly the same thing  \nas get_mydnsfullname(). In fact, there are no uses of name_to_fqdn()  \nthat cannot be replaced by get_mydnsfullname(). AFAICT, name_to_fqdn()  \nexists only because someone was not able to find get_mydnsfullname().\n\nIf I have a decent header file, I can see the full interface in a  \nsingle screen, along with comments, macros and typedefs. I don't think  \nthe argument about the extra typing involved in changing headers by  \nhand is very strong, since the code needs to be read and understood  \nthousands more times than it needs to be written.\n\n--\nJames Peach | jpeach@samba.org\n\n"}