{"category": "spam", "to_address": "<mack@speedy.uwaterloo.ca>", "from_address": "\"Edgar\" <yoa@alum.mit.edu>", "subject": "jerkily pagan", "body": "\n\n\n\n\n\n\n\nHe got it right when he said ''cow. He told Mitch \nto come in with the guy who made the Gay Untouchables thing. She said she wasn't \nsure about that. The guy asked if he could pass off the win to his friend. She \nwanted to draw it but didn't know the name. Howard had Beth stand up and say hello \nto him. High Pitch Erik was shirtless out in the crowd so Howard talked to him for a \nminute.\nHe has a good eye and he waited for the right pitch \nand cracked one out and got a base hit.\nHe worked his way up to the front of the room and \nhe was a winner. Everyone had a BANGO card so they were all eligible. staff, the \nHard Rock staff, Beetlejuice for his bowel movement on the stage, Ila the pitcher \nwho Artie ended up getting a hit off of.\nHe then moved on to the final Blackjack for a new \nRack game. Ted was having a lot of trouble with the lines. Howard went through some \nof the other people in the crowd.\nHe doesn't think that does anything though and \nprobably just wakes up any virus that might be on the seat.\nHe worked his way up to the front of the room and \nhe was a winner. Robin suggested that they read Ted's lines to him and he'll repeat \nthem.\nIla threw her next pitch and it was ball \n4.\nHe explained that episode to Robin but she had \nalready seen it since it was a rerun.\nHe decided to let Siobahn the transsexual come to \nthe pay-per-view event. Howard thanked the people who wrote to the FCC to help him \nout and told everyone to register to vote and get Bush out of office.\nThey were tied again. She called it the ''Nazi \ncross.\nHe explained that episode to Robin but she had \nalready seen it since it was a rerun. Ricky Martin was also on the list but they \nblew it and the GHF team got a try. He was going to find another player as well but \nit had to be a woman.\nHoward told him it probably wasn't ammonia, it was \nsomething else.\nHoward had Ila head out to the field to throw a \ncouple of practice pitches. He said that usually Jackie is the only comedian they \nhave in there but he's busy playing Mr. Gary thanked a bunch of people from the show \nwho helped out with everything there.\n"}