{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Zachary Logan <gardenhawk@grog.mlnet.com>", "subject": "FYEO", "body": "\n\nOnline pharmacy presents top products that will make you healthy! You do not need to go to your local drug store, you can buy here any pill that you need.\nGo to the shop\nErectile Dysfunction is one of the most serious problems that a man can get in his life. The best cure nowadays are Viagra and Cialis.\nGo to the shop\nConfidential and secure purchase. Instant shipping!\nWith best regards,\nZachary Logan\n \n \nVstupaia v riady zvezdnoj strazhi, kandidat otrekalsia ot vseh grazhdanskih prav I privilegij svoej rodnoj planety, perehodia v osobyj status ispolnitelej Zakonov Galakticheskoj Federacii, gigantskoj imperii, vkliuchavshej v sebia bolee Semisot naselennyh razlichnymi razumnymi sushchestvami planet v desiatkah Zvezdnyh skoplenij. I ty vse eshche zhiv? On neozhidanno rassmeialsia negromko i iazvitelno. Tak ty ego uzhe Videl? Ia kivnul i korotko rasskazal to, chto zapomnil iz razgovora s golubym. Nkot takzhe nemnogo raskrepostil moj mozg, podvignuv k empatii v Toj mere, v kakoj ej obladali sheltiane, tak chto emocii dolzhny byli stat dlia Menia pochti chto otkrytoj knigoj. \nKogti pravoj ruki carapnuli po pozornoj vmiatine na stalnom Nagrudnike, vmiatine, v tochnosti povtoriaiushchej ochertaniia ladoni demona. Strannoe oshchushchenie vozniklo gde-to v Nogah bystro poteklo vverh po telu holodnymi koliuchimi iglami. Nadeius, ia ne oskorbil tebia v tvoih luchshih chuvstvah. Ladno, ponial ia, ponial, barmen zamahal rukami, slovno otbivaias ot Sobstvennyh slov. Strashnovato bylo prikosnutsia k nemu snova, no i ostavliat ego zdes ia ne Sobiralsia, eto kazalos koshchunstvom. S samogo pervogo raza, kogda ia ego Uvidel, u menia melknula mysl, chto ego telo vygliadit slishkom moshchnym dlia Estestvennogo razvitiia, kakimi by sposobami on ni pytalsia ego nakachat. Razvorachivaias, kak skatert, travianoj Pokrov stremitelno unessia k prorisovavshemusia vdrug vdali gorizontu. Ia podnial glaza. \nNevidimaia pregrada razrushilas, i v mozg skolzkim holodnym potokom Hlynulo nechto nastolko chuzhdoe, vrazhdebnoe i omerzitelnoe chelovecheskomu Soznaniiu, chto tolko ogromnym usiliem voli ia uderzhalsia ot krika. Podobnaia zavisimost mozhet prevratit v raba kogo ugodno. Ia umolk, sbivshis s mysli, i Postaralsia byt kratkim. Vot podonok! Takomu i briuho vsporot ne zhalko! Altares, mozhet byt, sejchas tam gibnut tvoi liudi, arezritelno Napomnila sotnica. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}