{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Danielle Wynn\" <naseaglenewspaperspiv@eaglenewspapers.com>", "subject": "Melt away pounds with Anatrim", "body": "\nMake your fat friends envy you\n\n\n\n\n\nAnatrim – The very up-to-date and most enchanting product for over-weight people available – As told on ABC\n\n\n\nDid you realize redundant body kilos kill very much people around the world? We know that you hate the unattractive appearance of people like those and the social bias against them. \n\nOr, maybe, you have not the will to resist an assault of your baneful eating habits. If this all sounds familiar, then we have something for you!\n\n\n\n\n\nHere Anatrim comes, the recent product for the reduction of your body’s extra weight. The greatest thing is that Anatrim raises the quality of your life, making you feel no hungry and giving you joyful spirit. Here you may see some e-mails from our customers:\n\n\n\n\n\n\"It is amazing! \n\n\nInstead of gorging everything close at hand and watching TV constantly \n\n\nI became more interested in doing sport.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I feel fit as a fiddle now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nLusia R., Washington\n\n\n\n\n\n\n\"I tried some passive weight reducing, but with no result. I was very hard for me to restrain my ravenous appetite. \n\n\nOnce I was told about Anatrim my very best friend by and it brought a great influence on me.\n\n\n I had tried using it, and my wife told me I look very good now, 5 months later. \n\n\n28 pounds have gone away and it’s not a limit! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nDave Klark, Las Vegas\n\n\n\n\n\nAnatrim gives you an opportunity to understand that you got no such great need for that much food. It improves your spirit, gives you extra energy, and attacks needless kilos. All thanks to its powerful original formula!!\n\n\n\nElicit latest news!\n\n\n\n"}