{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Maryann Hutchison\" <maccarteretcodingdoc@carteretcoding.com>", "subject": "Stop gaining weight and get the figure you want", "body": "\nBe leaner and slimmer by next week\n\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting flesh loss product is now available – As were told on ABC.\n\n\nDo you retain all the times when you asked yourself to do anything to get rid of this quickly growing number of kilos? Luckily, now no major price is to be paid. Thanks to Anatrim, the ground-shaking weight-reducing mixture, you can achieve healthier life style and a really slender figure. Just look at what our customers say!\n\n\n\n\"It’s difficult to confess but I was extremely addicted to food. \n\n\nI swallowed up all this trash \n\n\nand just could not stop. \n\n\n\n\nThis suffering finished when I started course of taking Anatrim! \n\n\nGod,\n\n\n\n\n my inclination to eat constantly disappeared, \n\n\nspirits increased and I turned to the happiest person 18 pounds in 2.9 months. \n\n\n\n\nI can tell you now I turned to the happiest person in the world!\"\n\n\n\n\n\nLusia R., Bellevue WA\n\n\n\n\n\n\"I had weight problems since a boy. \n\n\nIt’s pretty hard to imagine how I detested being mocked at school. \n\n\n\n\nI abhorred my stoutness and I hated myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nIt literally pulled me out of this horror! The very sincere thanks to you, guys.\"\n\n\n\n\n\nRikky Martin, Washington\n\n\n\n\n\n\"You know what? Anatrim saved my marriage! I went into the circle, depression – eating more – even more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nMy best friend showed me web site and I called for pack of Anatrim at once. \n\n\nThe final result was magnficent, my appetite came to normal level, I was often in good spirits, and, certainly, I became able to tighten my belt on some holes. And you see, the bedroom became cool also!\"\n\n\n\n\n\nFrancis\n\n\n\n\n There many and many testimonials left by happy people taking Anatrim. Don’t you wanna add yourself to the tens of thousands of slender buyers and try this natural appetite reducing energy boosting product now!\n\n\nDo not decline the opportunity!\n\n\n\n\n"}