{"category": "spam", "to_address": null, "from_address": "david ess <sgtess01@breathe.com>", "subject": "Hello Brother", "body": "\n-- \n\n\nHello Friend\n\nHOW ARE YOU AND YOUR FAMILY? HOPE ALL IS WELL.\n\nMY NAME IS (SGT 1ST CLASS) DAVID V. ESS; I AM AN AMERICAN SOLDIER, SERVING  IN THE MILITARY WITH THE ARMY\\u2019S 3RD INFANTRYDIVISION. WITH A VERY DESPERATE  NEED FOR ASSISTANCE, I HAVE SUMMED UP COURAGE TO CONTACT YOU.\n\nI FOUND YOUR CONTACT PARTICULARS IN AN ADDRESS JOURNAL. I AM SEEKING YOUR  KIND ASSISTANCE TO MOVE THE SUM OF ($8 MILLION U.S. DOLLARS) EIGHT MILLION  UNITED STATES DOLLARS TO YOU, AS FAR AS I CAN BE ASSURED THAT MY SHARE WILL  BE SAFE IN YOUR CARE UNTIL I COMPLETE MY SERVICE HERE.\n\nSOURCE OF MONEY:\n\nSOME MONEY IN VARIOUS CURRENCIES WERE DISCOVERED IN BARRELS AT A FARMHOUSE  NEAR ONE OF SADDAM\\u2019S OLD PALACES IN TIKRIT-IRAQ DURING A RESCUE OPERATION,  AND IT WAS AGREED BY STAFF SGT KENNETH BUFF AND I THAT SOME PART OF THIS  MONEY BE SHARED AMONG BOTH OF US BEFORE INFORMING ANYBODY ABOUT IT SINCE  BOTH OF US SAW THE MONEY FIRST. THIS WAS QUITE AN ILLEGAL THING TO DO, BUT I TELL YOU WHAT? NO COMPENSATION CAN MAKE UP FOR THE RISK WE HAVE TAKEN WITH OUR LIVES IN THIS HELL HOLE. OF WHICH MY BROTHER IN-LAW WAS KILLED BY A ROAD SIDE BOMB LAST TIME.YOU WILL FIND THE STORY OF THIS MONEY ON THE WEB ADDRESS BELOW;\n\nhttp://www.right- thoughts.us/index.php/weblog/comments/the_first_thing_you_know_ol_saddams_a _millionaire/\n\nhttp://www.jonathanforeman.com/military/nyp_iraq/04192003_chest.html\n\n\nTHE ABOVE FIGURE WAS GIVEN TO ME AS MY SHARE, AND TO CONCEAL THIS KIND OF  MONEY BECAME A PROBLEM FOR ME, SO WITH THE HELP OF A BRITHISH CONTACT  WORKING HERE, AND HIS OFFICE ENJOY SOME IMMUNITY, I WAS ABLE TO GET THE  PACKAGE OUT TO A SAFE LOCATION ENTIRELY OUT OF TROUBLE SPOT. HE DOES NOT  KNOW THE REAL CONTENTS OF THE PACKAGE, AND BELIEVES THAT IT BELONGS TO A  BRITHISH/AMERICAN MEDICAL DOCTOR WHO DIED IN A RAID HERE IN IRAQ, AND  BEFORE GIVING UP, TRUSTED ME TO HAND OVER THE PACKAGE TO HIS FAMILY IN  UNITED STATES. I HAVE NOW FOUND A VERY SECURED WAY OF GETTING THE PACKAGE  OUT OF IRAQ TO YOUR COUNTRY FOR YOU TO PICK UP, AND I WILL DISCUSS THIS  WITH YOU WHEN I AM SURE THAT YOU ARE WILLING TO ASSIST ME, AND I BELIEVE  THAT MY MONEY WILL BE WELL SECURED IN YOUR HAND BECAUSE YOU HAVE FEAR OF  GOD.\n\nI WANT YOU TO TELL ME HOW MUCH YOU WILL TAKE FROM THIS MONEY FOR THE  ASSISTANCE YOU WILL GIVE TO ME. ONE PASSIONATE APPEAL I WILL MAKE TO YOU IS  NOT TO DISCUSS THIS MATTER WITH ANYBODY, SHOULD YOU HAVE REASONS TO REJECT  THIS OFFER, PLEASE AND PLEASE DESTROY THIS MESSAGE AS ANY LEAKAGE OF THIS  INFORMATION WILL BE TOO BAD FOR US SOLDIER\\u2019S HERE IN IRAQ. I DO NOT KNOW  HOW LONG WE WILL REMAIN HERE, AND I HAVE BEEN SHOT, WOUNDED AND SURVIVED  TWO SUICIDE BOMB ATTACKS BY THE SPECIAL GRACE OF GOD, THIS AND OTHER  REASONS I WILL MENTION LATER HAS PROMPTED ME TO REACH OUT FOR HELP, I  HONESTLY WANT THIS MATTER TO BE RESOLVED IMMEDIATELY, PLEASE CONTACT ME AS  SOON AS POSSIBLE WITH MY PRIVATE E-MAIL ADDRESS WHICH IS MY ONLY WAY OF  COMMUNICATION \n\nGOD BLESS YOU AND YOUR FAMILY.\n\nSGT.V. ESS.\n\n"}