{"category": "spam", "to_address": "Wisdom <wisdom@flax24.uwaterloo.ca>", "from_address": "Holly Dale <istmir@grizzel.com>", "subject": "The best medications for the best price", "body": "\n\nThe differences between men and women is that women are always ready for sex, but men need an erection. Let us remove this difference by offering you Viagra!\nOur site\nBuy Licensed and Quality Viagra or Cialis at US Drug store now and you'll be at the top all night long!\nClick here to become a sex giant\nJust buy must have medication called Viagra or Cialis and you'll have unbelievable sex 24/7!!!\nWith best regards,\nHolly Dale\n \n \nI vsego-to za odin den, A? Uzh ne hochesh li ty skazat, chto dlia etogo ej prishlos perespat s Etim ubliudkom?! mgnovenno vziarilsia ia. Shelta ostavila v moej dushe glubokij, neizgladimyj sled. Sejchas. Bud chto budet, v krajnem sluchae, Nori menia ne ostavit. \nChudovishchnoe svetilo vseh moih prezhnih koshmarov medlenno Vshodilo iz-za gorizonta i gorizont kipel! Shkvalnyj veter obrushilsia na Les, prigibaia i sminaia moguchie derevia, lomaia ih kak solomu. Konechno, vsego odnoj smertiu, no Kakoe podtverzhdenie! Dal-rokty, estestvenno, posle stol iavnoj demonstracii sily poteriali Pokoj. A zatem zemlia vspyhnula prichudlivo izognutoj razlohmachennoj nitiu alogo Ognia. Nesmotria na slabost, ia byl eshche dostatochno zol, chtoby dostavit Kuchu nepriiatnostej slishkom nazojlivym. Ognennyj potok s oglushitelnym revom vorvalsia v Komnatu, zahlestnul osevogo s pomoshchnikom, podhvatil ih, kak podhvatyvaet Opavshie listia uragan, i ogromnym pylaiushchim sharom, streliaiushchim vo vse storony Tugimi zhgutami ognia, rinulsia na menia. Ne pora li Pristupit k obucheniiu Leshu, Nkot? Mne nuzhno obratno na sheltu. Ia ukradkoj perevel duh. Vernee to, chem teper on stal. \nI ia prodolzhal nestis slomia golovu. Letom on liubil pleskatsia v teploj pribrezhnoj vode Velikogo ozera, no zimoj ego v ledianuiu temnuiu vodu i palkoj ne zagonish, ot Odnogo vida v ziabkuiu drozh brosalo. Nikakih treshchin i vylomannyh plastov, lish holodnaia, zastyvshaia Rasplavom vspuchennyh voln, chernaia mnogometrovaia zona vokrug chistogo kruga, Ostavshegosia posle magicheskogo cilindra. Po merkam Leshu, polet ego mog prodolzhatsia dovolno dolgo, poetomu ia vernulsia v potok Skorosti obychnogo soznaniia. ejisuminyon Q1FUW1pVckRcUFBGHUFCUEZWRlleXR1XVA==\n \n\n\n"}