{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Scott Berry\" <sberry@northlc.com>", "subject": "Re: linuxpackages.net and droplinegnome.org", "body": "Boy I am not sure. As for Fedora it doesn't look like they do.  They are \ntalking captia on Fedora but it hasn't went too far yet.  Also there is a \nDebian packager Mario if he is on the list I would like to hear his \nexperiences.\n\nScott\n\n----- \nFrom: \"Jude DaShiell\" \nTo: \nSent: Saturday, June 30, 2007 1:51 PM\nSubject: linuxpackages.net and droplinegnome.org\n\n\n> Yesterday I managed to get myself an account on droplinegnome.org I left a\n> bug message since droplinegnome hasn't yet got festival where one can\n> install it and use it to get orca talking. Today I managed to build the\n> astrolog 5.40 package for slackware and did it correctly enough that the\n> package shows up in my packages list when I install it and so far as I can\n> tell the whole package works too. I just learned how to make a slackware\n> package that would do that.  Unfortunately linuxpackages.net uses capsha's\n> so even though I built a package I can't register and submit it. Not good\n> news for anyone else in the speakup community wanting to submit a package.\n> What I'm curious to know though is what the situation is with debian\n> fedoraproject, gentoo, and ubuntu.  Do these sites also block totally\n> blind package submitters from registering?  It was a surprise to me\n> droplinegnome didn't place such an impediment in my way but I'm not going\n> to hold that against them.\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n>\n> -- \n> No virus found in this incoming message.\n> Checked by AVG Free Edition.\n> Version: 7.5.476 / Virus Database: 269.9.14/880 - Release Date: 6/29/2007 \n> 2:15 PM\n>\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}