{"category": "ham", "to_address": "Anders Malmendal <anders@chem.au.dk>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] hierarhical cluster analysis of groups of vectors", "body": "On Tue, 29 May 2007, Anders Malmendal wrote:\n\n> Thanks.\n> The vectors are produced by PLS-discriminant analysis between groups and\n> the vectors within a group are simply different measurements of the same\n> thing. What I need is a measure of how the different groups cluster\n> (relative to each other). (I assume that I can do some averaging after\n> applying dist, but I can not  find the information on how to do it.)\n\nI don't think anyone can tell you that: it is a matter of judgement. \nWhat you need is a dissimilarity on your groups.\n\nAssuming your vectors are numeric (you didn't say) you could use \nMahalanobis distance between the centroids, with within-group covariance \nas the variance matrix.  Often that works well, but not always, and you \nmight prefer Euclidean distance between centroids, or minimum Euclidean or \nMahalanobis distance ....\n\n\n> Best regards\n> Anders\n>\n>\n> Rafael Duarte wrote:\n>> It seems that you have already groups defined.\n>> Discriminant analysis would probably be more appropriate for what you\n>> want.\n>> Best regards,\n>> Rafael Duarte\n>>\n>>\n>>\n>> Anders Malmendal wrote:\n>>\n>>> I want to do hierarchical cluster analysis to compare 10 groups of\n>>> vectors with five vectors in each group (i.e. I want to make a\n>>> dendogram showing the clustering of the different groups). I've\n>>> looked into using dist and hclust, but cannot see how to compare the\n>>> different groups instead of the individual vectors. I am thankful for\n>>> any help.\n>>> Anders\n>>>\n>>> ______________________________________________\n>>> R-help@stat.math.ethz.ch mailing list\n>>> https://stat.ethz.ch/mailman/listinfo/r-help\n>>> PLEASE do read the posting guide\n>>> http://www.R-project.org/posting-guide.html\n>>> and provide commented, minimal, self-contained, reproducible code.\n>>>\n>>>\n>>\n>>\n>\n>\n>\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}