{"category": "ham", "to_address": "ip-health@lists.essential.org, e-drug@healthnet.org", "from_address": "Alexandra HEUMBER <Alexandra.HEUMBER@brussels.msf.org>", "subject": "[Ip-health] Novartis case_Statement of the Indian Ambassador at the European Parliament", "body": "This is a multipart message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nBelow the statement of the Indian Ambassador in Belgium at the Exchange of\nviews on Novartis case (Sect 3d) organised by the European Parliament\nyesterday in Brussels.\n\n\nStatement in the European Parliament on the legal action of Novartis\nagainst the Government of India\n\nHon\\u2019ble Members of the European Parliament, Ladies and Gentlemen,\n\nAt the outset let me thank you for inviting me to be present here during\nthis hearing concerning the litigation launched by the pharmaceutical\ncompany Novartis.  This hearing and its consequences will have significant\nbearing on millions of patients in the developing world.\n\nAs you know, Imatinib Mesylate (and Gleevec/Glivec, Novartis\\u2019 brand name\nversion of it) is a cancer drug crucial in prolonging the life of patients\nsuffering from Chronic Myeloid Leukemia (Blood Cancer). Since Imatinib\nMesylate controls the cellular action that would cause the cancer to grow\nbut does not cure the disease, patients must take it for the rest of their\nlives, unless another type of treatment or cure is available. The medicine\nis produced and marketed internationally by the Swiss pharmaceutical\ncompany Novartis and its generic forms are produced by several Indian\ngeneric-drug manufacturers. Novartis sells Gleevec in India for US$ 26000\nper patient per year. Generic versions of the drug in the Indian market\nare priced at about US$ 2100 per patient per year or less than one-tenth\nthe price charged by Novartis. Novartis is charging high prices for\nGleevec worldwide: from about 25000 USD to more than 50000 USD per patient\nper year. This price is well above the financial capacity of most of the\npatients. Novartis points out that only a few number of patients in India\nare paying the higher price since they have established a Gleevec donation\nprogramme. In 2006, about 5000 persons in India benefited from this\nprogramme. But India witnesses about 25000 new cases of Chronic Myelloid\nLeucemia every year.  Additionally, thousands of people worldwide are\naffected by this disease.\n\nLet me give a brief chronological sequence of events which resulted in the\npresent stalemate.  In conformity with TRIPS Agreement, India amended the\nPatents Act by the Patents (Amendment) Act 1999 effective from 1995\nproviding for receipt of product patent applications and for granting\nExclusive Marketing Rights (EMRs) on such applications in the fields of\npharmaceuticals and agricultural chemicals, till patent is granted or\npatent application is rejected.  In 1998 Novartis had filed an application\nin the Chennai Patent Office for a patent on Glivec. Based on this patent\napplication, Novartis was granted EMR in November 2003 till patent was\ngranted. In case the patent was rejected the EMR would be cancelled.  In\nfact, the EMR operated like a patent monopoly preventing Indian\npharmaceutical companies from producing affordable generic versions of the\ndrug Imatinib Mesylate.  Indian generic companies had to withdraw the\nproduction and sale of the generic versions of the drug for the domestic\nmarket and export to other developing countries. With an over 10 fold\nincrease in the price of the drug, Cancer Patients Aid Association and\nsome of the NGOs who provided the more affordable generic versions to\npatients for their treatment had to withdraw their medical support to\ncancer patients. Patients of other developing countries who were importing\ngeneric versions of the drug were also seriously affected by the\nunavailability of the affordable versions. This situation of\nunavailability of affordable generic versions of the drug continued till\n2006.\n\nIn 2005 India further amended its patent law to become TRIPS compliant in\nall fields of technology including pharmaceuticals for which applications\nhad earlier been filed. Novartis\\u2019 patent application on Gleevec came up\nfor examination. The patent law allows for any person or group to oppose a\npatent application and accordingly several pre-grant oppositions had been\nfiled against the patent application of Novartis.  As a result of\npre-grant opposition filed by civil society groups and Indian drug\ncompanies who contested the novelty and inventiveness of Gleevec, the\npatent application was rejected under Section 3(d) of the Indian Patent\nLaw in January 2006 on the ground that the drug was only a new form of an\nold drug.  Section 3(d) states that \\u201cthe mere discovery of a new form of a\nknown substance which does not result in the enhancement of the known\nefficacy of that substance or the mere discovery of any new property or\nnew use for a known substance or of the mere use of a known process,\nmachine or apparatus unless such known process results in a new product or\nemploys at least one new reactant\\u201d is not an invention within the meaning\nof the Patents Act.  Consequently the EMR stood automatically terminated.\nRejection of the patent brought relief to thousands of cancer patients as\nit prevented a patent monopoly till 2018. The Gleevec patent order\nrejecting a 'new form of an old drug' also set an important precedent for\nthe examination of patent applications related to essential drugs\nincluding AIDS medicines.\n\nNovartis filed cases in the Chennai High Court. challenging the order of\nrejecting the Gleevec patent as well as challenging the constitutional\nvalidity of the Indian Patent Law. Novartis' litigation has raised\nconcerns among other patient groups as the Gleevec patent order set a\nprecedent for the examination of crucial drugs patent applications\nincluding those for AIDS treatment.\n\nMoreover, Novartis challenged the constitutionality of section 3(d) of the\nIndian Patents Act, which was specifically introduced by the Indian\nparliament as a safeguard against the misuse of the product patent regime.\nNovartis, in its petition, claimed that the section is not in compliance\nwith the TRIPS agreement and hence should be declared unconstitutional.\n\nSection 3(d) is aimed at preventing pharmaceutical companies from\nobtaining patents on old medicines which would prevent trivial patenting\nand new use patents. India, while complying with the TRIPS agreement and\nintroducing a product patent regime for 'new drugs that were invented',\nalso coupled its law with a safeguard of refusing patents on discovery of\nnew forms or new uses of older drugs to prevent \\u201cevergreening\\u201d. This\nprovision is in conformity with TRIPS agreement. This is also in keeping\nwith the 2001 Doha Declaration on the TRIPS Agreement and public health.\nThe Doha Declaration on Trade-Related Aspects of Intellectual Property\nRights (TRIPS) and Public Health states that \"the Agreement can and should\nbe interpreted and implemented in a manner supportive of WTO members'\nright to protect public health and, in particular, to promote access to\nmedicines for all\".\nFurther, the TRIPS compliance of any law can be and should be challenged\nby a government in the Disputes Settlement Body of the WTO and not by a\ncompany in an Indian court.  The right course for Novartis would be to\nfile an appeal before the Intellectual Property Appellate Board which is\nheaded by a judge and has already been constituted.\nThe EU has endorsed WTO rules allowing compulsory licensing of patented\nproducts and processes to ensure access to affordable medicines for poor\ncountries. We are glad that the European Parliament has taken a very\nproactive role in urging Novartis to drop its litigation.  It has\nrecognised the importance of India with regard to access to medicine for\ndeveloping countries and called on the EU to support India in further\nimplementing its intellectual property laws in a manner that will create\nan environment that will continue to encourage and facilitate investment\nby the Indian generic manufacturing industry in providing affordable\nessential medicines for developing countries.\n\n\n\n###################################\nSIGN MSF'S 'DROP THE CASE' PETITION\n\nMillions of people around the world today rely on affordable medicines\nproduced in India.  Pharmaceutical company Novartis is taking the Indian\ngovernment to court to force a change in the country's patent law.  If\nNovartis wins, a major source of affordable medicines for millions of\npeople across the globe could dry up.\n\nMSF is urging Novartis to DROP THE CASE.\n\nFind out more and sign up to our petition:\nhttp://www.msf.org/petition_india/international.html\n####################################\n\n\nAlexandra Heumber\nEU Advocacy Liaison Officer\nMédecins Sans Frontières\nAccess to Essential Medicines Campaign\nRue Dupré, 94. 1090 Brussels\n++32 (0) 2 474 75 09 (Dir off)\n++ 32 (0) 479 514 900 (Mob)\n++ 32 (0) 2 474 75 75 (Fax)\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}