{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Polly Pike\" <laxcrhsitevew@crhsite.com>", "subject": "Achieve picture perfect weight and enjoy life", "body": "\nControl your weight and appetite\n\n\n\n\n\nAnatrim – The newest and most exciting product for corpulent people is now available – As told on Oprah\n\n\n\nDid you realize that excessive body kilograms kill more and more people every year? We believe you hate the unsightly look of people like those and the low status they obviously have in modern society. \n\nMoreover, you can not withstand pressure of fatal eating habits of yours. If you think it sounds familiar, then we got something to propose to you!\n\n\n\n\n\nWe are proudly introduce you Anatrim, the recent product for the reduction of your body’s extra weight. The most amazing thing is that Anatrim raises the quality of your life by making you crave food less and giving you better cheer. Pay you attention to some notes from our customers:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of eating anything close at hand and watching TV constantly \n\n\nI became rather more interested in exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I have a great shape now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nSilvia D., Washington\n\n\n\n\n\n\n\"Passive weight losing was of no help to me. I was very hard for me to restrain my ravenous appetite. \n\n\nOnce I was told about Anatrim my very best friend by and I was really effected by the information.\n\n\n I had tried to take it, and my wife said to me I look very good now, 3 months later. \n\n\n29 pounds off and this is still far to an end! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nSteve Burbon, New York\n\n\n\n\n\nAnatrim helps your mind to realize you doesn’t have such a great need for that much food. It raises your spirit, supplies you with energy, and attacks useless kilos. Great thanks to its mighty original formula!!\n\n\n\nPry out more information!\n\n\n\n"}