{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "drew Roberts <zotz@100jamz.com>", "subject": "Re: [cc-community] Strayform - where artists and fans connect to\n\tfund and distribute new creative works (Maiki)", "body": "On Friday 08 June 2007 04:48 pm, Terry Hancock wrote:\n> dream dream wrote:\n> > If licensed under Creative Commons these files can be\n> > downloaded, e-mailed, shared, and reproduced.  Consumers\n> > will do these actions themselves providing a network of\n> > distribution that is costless to them, but has greater\n> > range, speed, convenience, and intelligence than\n> > distribution through cds on store shelves.\n>\n> The process is inexpensive and distributed, but it is not \"costless\".\n>\n> Consumers pay for their distribution costs when they pay their ISPs\n> (usually a flat subscription rate). Hosting sites must also make money\n> in some way, in order to pay for equipment costs. This can be quite\n> reasonable, but is not \"costless\".\n\nTerry, I think the idea is that people will make copies for their friends, \nwhile not technically costless, it is close enough to it not to matter to \nmuch in my book.\n\nMy isp subscription is paid for no matter what I use it for. I could try and \nallocate the cost to the various things I do online, but it is hardly worth \nit for my personal account.\n\nAnd I will gladly make and send copies of Free art that I like that I think my \nfriends might also like.\n\nThe \"costs\" of my time to listen are more than the costs of the link.\n>\n> There are two classes of ways to do this commercially \n\nI think that the point is that it doesn't need to be done commercially.\n\nAlso, isn't this predicated on the music being paid for up front (production) \nand then being Free and free to distribute?\n\n> -- various \n> subscription/fee based schemes (costs charged directly to downloader)\n> and various advertising-based schemes (costs covered by related\n> activities which benefit from the same communications channels).\n>\n> One of the reasons why it is better not to use \"non-commercial\" licenses\n> is because they rule out both methods for hosting nodes to make any\n> revenue from the distribution process, which means that these\n> distributed costs can't be covered.\n\nWell, you know I don't like NC, but I think that was not in this picture. \nSomeone let me know if I was mistaken or mixed up threads...\n>\n> Cheers,\n> Terry\n\nall the best,\n\ndrew\n-- \n(da idea man)\nWorking on a Movie Script or two in June 2007\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}