{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 125", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Elisabeth Frink's Desert Quartet is listed at Grade II*\n      (Museum Security Network Mailing list)\n   2. new magazine of conservation of cultural heritage\n      (Museum Security Network Mailing list)\n   3. Protection of Elizabeth Frink sculpture\n      (Museum Security Network Mailing list)\n   4. Piden al gobierno peruano reforzar la defensa de bienes\n      arqueol?gicos (Museum Security Network Mailing list)\n   5. MUSEUMS AND UNIVERSAL HERITAGE: RIGHT OF RETURN AND RIGHT OF\n      ACCESS (Museum Security Network Mailing list)\n   6. Stradivarius stolen from flat in Vienna\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Tue, 29 May 2007 17:02:36 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Elisabeth Frink's Desert Quartet is listed at Grade II*\nTo: Museum Security Network Mailinglist \nMessage-ID: <465C408C.7030204@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nPress release from:\n\nThe Public Monuments and Sculpture Association\n&\nThe Twentieth Century Society\n\nDate: 11th May 2007\nHeads bust all listing records\nfor public sculpture\n\nElisabeth Frink's Desert Quartet is listed at Grade II*\n\nThe Department of Culture Media and Sport (DCMS) has today taken the historic step of listing a public sculpture less than thirty years old. The precedent ? set by the listing at Grade II* at Worthing of Elisabeth Frinks masterly Desert Quartet ? will protect one of England?s finest public sculptures.  The series of four bronze heads occupies a loggia at Worthing's post-modern Montague shopping centre.\n\nThe campaign was backed by leading figures from the art world including Nicholas Serota, Sir Christopher Frayling, Loyd Grossman, and Lord Palumbo who unveiled the sculpture on that site.\n\nDesert Quartet was specially commissioned from the internationally acclaimed sculptor Dame Elisabeth Frink in 1985 and was installed in 1989.  The work consists of four giant heads which overlook Liverpool Gardens, not far from the seafront in Worthing.  It was initially derided locally ? known by local teenagers as 'the goggle heads' ? then the Worthing Society campaigned for their retention, bringing in the national organisations.  Supported by the local media, local people enthusiastically backed the campaign. A petition launched at the weekend attracted 400 local signatures including the Trafalgar Square Fourth Plinth model, the paraplegic Alison Lapper (herself a sculptor), and members of Worthing Borough Council. \n\nThe developer of the shopping centre was to plan removal of the sculptures, only 18 years after providing them as a condition of attaining planning permission for its construction.  They have an estimated current value of approx ?2 million.\n\nThe listing decision was made on the advice of  English Heritage. It sets a vital benchmark for the future and sends a clear message to developers and planning departments about the importance of public art. \n\nC20 Director, Catherine Croft says:\n'It is great that this important sculpture is now protected and the heads will continue to gaze out over Worthing.  The original intention was that they should be a perm-anent fixture for the benefit of the public, and listing should ensure that the local public and visitors can continue to be able to enjoy them'.\n\n Loyd Grossman, Chairman of the Public Monuments and Sculpture Association, says:\n' In listing Grade II* Worthing?s Desert Quartet ? one of the most important post- war works of public art in Britain ? English Heritage has ensured the preservation of Elizabeth Frink?s series of bronze heads, especially commissioned for the town's Montague Centre in 1985.  These powerful portraits represent the best sculpture put up for public view.  The listing reaffirms the belief, shared by the Twentieth Century Society and the PMSA, that Art beyond the gallery is for everyone.   \n\nJo Darke (Director, the Public Monuments and Sculpture Association) says:\n?This approval is of crucial importance to public sculpture, firstly in acknowledging that rare and deserving cases like this can circumvent the 30-Year Rule, and also in the unprecedented decision to List an unremarkable building for the sake of its remarkable sculptures?. \n\nThe C20 Society and the PMSA hope that this decision will underwrite and extend the PMSA's online survey of public sculpture in Britain (65% complete), allowing inclusion of all the UK?s public art, murals and sculpture.  A discreet section for cataloguing public sculpture theft is currently planned. Many excellent pieces are already under threat, from Dorothy Annan?s purpose-made murals for BT in the City of London (1960), to the relief sculpture Healing Hands by Albert Pountney (1954) on Leicester Royal Infirmary, threatened with demolition. This decision is a major advance in the battle to preserve these and others of the same calibre.\n\nContacts ?\nJo Darke ? PMSA ? 0207 485 0566 / 07968 256 120\nCatherine Croft ? C20 Society ? 0207 250 3857 ? director@c20society.org.uk\nJon Wright ? C20 Society  - 0207 250 3857 ? jon.wright@c20society.org.uk\nNatalie Cropper ? Secretary, The Worthing Society ? 01903 241 949\nTed Kennard ? The Worthing Society ? Broadwater30@yahoo.co.uk\n\nFor further images please contact jon.wright@c20society.org.uk\n\nNotes to Editors ?\n\n1. Biographical notes on Dame Elisabeth Frink\nDame Elisabeth Frink (1930 ? 1993), is rated one of England?s finest sculptors of the period. Often linked to the Post-war school of British sculpture, which included Reg Butler and Eduardo Paolozzi, her work is distinguished by a commitment to natural forms and themes.  She was made a Dame of the British Empire in 1982.\n\n2. Notes on C20\nThe Twentieth Century Society, founded in 1979 as the Thirties Society, is the national amenity body that fights to safeguard the best of architecture and design in Britain from 1914 onwards. \n\n3. Notes on the Public Monuments and Sculpture Association (PMSA)\nThe PMSA was established in 1991 (founding patron, Sir Eduardo Paolozzi) for the protection and promotion of public sculpture.  Its main campaigns are the National Recording Project, a survey of public sculpture in Britain (65% completed), and the Save our Sculpture project which actively supports protection of neighbourhood sculpture by local residents.   See website for more information: www.pmsa.org.uk\n\n\n\n------------------------------\n\nMessage: 2\nDate: 29 May 2007 18:51:41 -0000\nFrom: Museum Security Network Mailing list \nSubject: [MSN] new magazine of conservation of cultural heritage\nTo: \nMessage-ID: <20070529185141.39507.qmail@mail.hsphereweb.com>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\n\nDear Friends/members of the Museum Security Network,\n\nWe had the pleasure to discover your community some time ago while searching for incidents occurred in the property of the cultural heritage. We were impressed by the high activity level of the mailing list.\nWe are an international group of conservator-restorers brought together by the idea of promoting free access to information in the field of cultural heritage. We invested our efforts to create an online open access magazine dedicated to all the professionals involved in this field. We are pleased to invite you to visit the website at http://www.e-conservationline.com/. The first issue of the magazine will be available on the website from September / October 2007 in digital format and will be free to download. Meanwhile we do our best to develop the community spirit between the members and to encourage exchange of ideas, experiences and knowledge in an active way. The website is providing news and events, is offering the possibility of browsing for courses, jobs, internships and volunteer opportunities and soon will give to the members the chance to communicate directly through a message board. \nAt this moment our main goal is to extent the awareness of interdisciplinary between conservation and its related fields, such as the preventive and safety initiatives against any affective factors, care and management of collections and art works of the cultural property, insurance methods in case of transporting, against art theft and forgeries among others. \nWe wish to provide our members not only news on this subjects but also educational articles and communications, to give them the opportunity of being always informed and aware of the many aspects that may be involved in conservation of the works of art. \nWe are on the same way pleased to invite you to actively participate in our project. We are open to those that wish to send us their articles, ideas or opinions. We would like to devote a special section in the magazine to these issues but as this is a volunteer work at the moment for all of us we would be pleased to get as much help and support we can get. \n\nWe announced a Call for Papers on the page which is open to everyone interested.  \n\n\nRui Bordalo, \nThe e_conservationline team\ngeneral@e-conservationline.com \nwww.e-conservationline.com\n\n\n------------------------------\n\nMessage: 3\nDate: Tue, 29 May 2007 15:04:33 +0100\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Protection of Elizabeth Frink sculpture\nTo: \nMessage-ID:\n\t\n\t\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\n \n\n \n\n \n\n \n\n \n\nPress release from:\n\n \n\n \n\nThe Public Monuments and Sculpture Association \n\n&\n\n The Twentieth Century Society\n\n \n\nDate: 11th May 2007\n\n \n\nHeads bust all listing records \n\nfor public sculpture\n\n \n\nElisabeth Frink's \n\nDesert Quartet is listed at Grade II*\n\n \n\n \n\nThe Department of Culture Media and Sport (DCMS) has today taken the historic step of listing a public sculpture less than thirty years old. The precedent - set by the listing at Grade II* at Worthing of Elisabeth Frinks masterly Desert Quartet - will protect one of England's finest public sculptures.  The series of four bronze heads occupies a loggia at Worthing's post-modern Montague shopping centre.\n\n \n\nThe campaign was backed by leading figures from the art world including Nicholas Serota, Sir Christopher Frayling, Loyd Grossman, and Lord Palumbo who unveiled the sculpture on that site.\n\n \n\nDesert Quartet was specially commissioned from the internationally acclaimed sculptor Dame Elisabeth Frink in 1985 and was installed in 1989.  The work consists of four giant heads which overlook Liverpool Gardens, not far from the seafront in Worthing.  It was initially derided locally - known by local teenagers as 'the goggle heads' - then the Worthing Society campaigned for their retention, bringing in the national organisations.  Supported by the local media, local people enthusiastically backed the campaign. A petition launched at the weekend attracted 400 local signatures including the Trafalgar Square Fourth Plinth model, the paraplegic Alison Lapper (herself a sculptor), and members of Worthing Borough Council.  \n\n\n\n\n \n\nThe developer of the shopping centre was to plan removal of the sculptures, \n\nonly 18 years after providing them as a condition of attaining planning permission \n\nfor its construction.  They have an estimated current value of approx ?2 million.\n\n \n\nThe listing decision was made on the advice of  English Heritage. It sets a vital benchmark for the future and sends a clear message to developers and planning departments about the importance of public art.  \n\n \n\nC20 Director, Catherine Croft says:\n\n'It is great that this important sculpture is now protected and the heads will continue to gaze out over Worthing.  The original intention was that they should be a perm-anent fixture for the benefit of the public, and listing should ensure that the local public and visitors can continue to be able to enjoy them'. \n\n \n\nLoyd Grossman, Chairman of the Public Monuments and Sculpture Association, says: \n\n' In listing Grade II* Worthing's Desert Quartet - one of the most important post-\n\nwar works of public art in Britain - English Heritage has ensured the preservation \n\nof Elizabeth Frink's series of bronze heads, especially commissioned for the town's Montague Centre in 1985.  These powerful portraits represent the best sculpture put up for public view.  The listing reaffirms the belief, shared by the Twentieth Century Society and the PMSA, that Art beyond the gallery is for everyone.  \n\n \n\nJo Darke (Director, the Public Monuments and Sculpture Association) says:\n\n'This approval is of crucial importance to public sculpture, firstly in acknowledging \n\nthat rare and deserving cases like this can circumvent the 30-Year Rule, and also in the unprecedented decision to List an unremarkable building for the sake of its remarkable sculptures'.  \n\n \n\nThe C20 Society and the PMSA hope that this decision will underwrite and extend the PMSA's online survey of public sculpture in Britain (65% complete), allowing inclusion of all the UK's public art, murals and sculpture.  A discreet section for cataloguing public sculpture theft is currently planned. Many excellent pieces are already under threat, from Dorothy Annan's purpose-made murals for BT in the City of London (1960), to the relief sculpture Healing Hands by Albert Pountney (1954) \n\non Leicester Royal Infirmary, threatened with demolition. This decision is a major advance in the battle to preserve these and others of the same calibre.            [ENDS \n\n \n\n \n\nContacts - \n\n \n\nJo Darke - PMSA - 0207 485 0566 / 07968 256 120\n\nCatherine Croft - C20 Society - 0207 250 3857 - director@c20society.org.uk\n\nJon Wright - C20 Society  - 0207 250 3857 - jon.wright@c20society.org.uk\n\nNatalie Cropper - Secretary, The Worthing Society - 01903 241 949\n\nTed Kennard - The Worthing Society - Broadwater30@yahoo.co.uk \n\nFor further images please contact jon.wright@c20society.org.uk\n\n \n\n \n\n \n\nNotes to Editors - \n\n \n\n \n\n1. Biographical notes on Dame Elisabeth Frink\n\n \n\nDame Elisabeth Frink (1930 - 1993), is rated one of England's finest sculptors of \n\nthe period. Often linked to the Post-war school of British sculpture, which included Reg Butler and Eduardo Paolozzi, her work is distinguished by a commitment to natural forms and themes.  She was made a Dame of the British Empire in 1982.\n\n \n\n \n\n2. Notes on C20\n\nThe Twentieth Century Society, founded in 1979 as the Thirties Society, is the national amenity body that fights to safeguard the best of architecture and design \n\nin Britain from 1914 onwards.\n\n \n\n \n\n3. Notes on the Public Monuments and Sculpture Association (PMSA)\n\nThe PMSA was established in 1991 (founding patron, Sir Eduardo Paolozzi) for the protection and promotion of public sculpture.  Its main campaigns are the National Recording Project, a survey of public sculpture in Britain (65% completed), and the Save our Sculpture project which actively supports protection of neighbourhood sculpture by local residents.   See website for more information: www.pmsa.org.uk   \n\n \n\n \n\n \n\n \n\n \n\n \n\n\n_________________________________________________________________________________\nThis e-mail (and any attachments) is confidential and may contain personal views which are not the \nviews of English Heritage unless specifically stated. If you have received it in error, please delete it\nfrom your system and notify the sender immediately. Do not use, copy or disclose the information in \nany way nor act in reliance on it. Any information sent to English Heritage may become publicly available.\n\n\n\n------------------------------\n\nMessage: 4\nDate: Wed, 30 May 2007 06:57:33 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Piden al gobierno peruano reforzar la defensa de bienes\n\tarqueol?gicos\nTo: msn-list@te.verweg.com\nMessage-ID:\n\t\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\n\nPiden al gobierno peruano reforzar la defensa de bienes arqueol?gicos\n\n26 mai 2007\nAgence France Presse\n\nCopyright Agence France-Presse, 2007 All reproduction and presentation\nrights reserved.\n\nLIMA, 26 Mayo 2007 (AFP) -\n\nEl gobierno peruano debe poner m?s voluntad pol?tica y reforzar la\ndefensa del patrimonio arqueol?gico, que esta semana sufri? un duro\nrev?s, despu?s de que la casa Christie's de Nueva York subastara 24\npiezas prehisp?nicas peruanas, exigieron expertos.\n\nSostienen que el gobierno debe contar con un grupo de especialistas\nque detecte y siga las huellas de los objetos en el exterior a fin de\nintervenir para recuperarlas, porque el Instituto Nacional de Cultura\n(INC) le faltan reflejos para actuar en defensa de los bienes\npatrimoniales.\n\nJorge S?nchez, especialista en piezas arqueol?gicas y director de la\nrevista Per? Explorer, quien dio la voz de alarma de la venta de las\npiezas en la casa Christie's, dijo a la AFP que existe \"una lentitud\ngrave\" en el INC para responder ante una denuncia.\n\n\"El INC ya sab?a de la venta de nuestros bienes y fue muy poco lo que\nhizo. Cuando reaccion? enviando documentaci?n al consulado peruano en\nNueva York para evitar la subasta, ya era muy tarde\", denunci?.\n\nRevel? que el instituto no cuenta con un ?rea para la investigaci?n de\npiezas robadas y salida del pa?s de contrabando.\n\nEl diario El Comercio, principal medio del Per?, editorializ? el\nviernes sobre la venta de los objetos indicando que \"no se puede\ntolerar la falta de voluntad pol?tica de nuestras autoridades para\nactuar con oportunidad frente a estos atentados\".\n\nEl arque?logo Manuel Moreno dijo a la prensa que no basta decir que\nlos restos son del Per?, \"debe tener una partida de nacimiento y pasa\npor hacer investigaciones en sitios donde se sabe que hay objetos de\nincalculable valor cultural del pa?s\".\n\nEn tanto, el presidente Alan Garc?a propuso este s?bado comprar los\nbienes arqueol?gicos peruanos vendidos en el exterior, a fin de\nrecuperarlos, tras las repercusiones de la subasta de Christie's que\nregistr? un valor total de 180.000 d?lares.\n\nGarc?a sostuvo que el gobierno se tiene que \"dar ma?a (habilidad) para\nidentificar, antes que se anuncien las ventas de piezas arqueol?gicas,\ny luego seleccionar las objetos que han salido en los ?ltimos a?os e\nimpedir su venta\".\n\nEl abogado penalista Luis Lamas Puccio, recomend? reordenar la\nlegislaci?n penal y administrativa en materia de protecci?n del\npatrimonio arqueol?gico, porque \"las normas vigentes en el Per? son\nmuy endebles y tienen muchos vac?os\".\n\nEl C?digo Penal peruano castiga el tr?fico de bienes arqueol?gicos\nsiempre que sean prehisp?nicos, y que hayan sido previamente\ndeclarados como patrimonio, \"es decir, que est?n inscritos en el\nregistro del INC\".\n\nEl gobierno peruano ha iniciado 184 procesos legales de repatriaci?n\nde bienes patrimoniales en doce pa?ses, pero 169 de ellos est?n\nparalizados por falta de fondos, seg?n una nota del diario Per? 21.\n\nSe trata de Estados Unidos, Espa?a, Alemania, Italia, Dinamarca,\nAustria, Eslovaquia, Argentina, Chile, Brasil, Bolivia y Uruguay.\n\nHace unas semanas autoridades culturales peruanas denunciaron la\npresencia de mafias organizadas que han formado una red para robar\nbienes patrimoniales peruanos, muchas veces obedeciendo pedidos hechos\na trav?s de internet, y que los sacan del pa?s por fronteras con\ninsuficiente control.\n\nPer? es el pa?s en Latinoam?rica m?s afectado por la salida de bienes\npatrimoniales robados seguido por Bolivia y M?xico, seg?n\nINTERPOL-Per?.\n\nS?lo en 2006 fue denunciado el robo de 141 bienes patrimoniales,\nmuchos de los cuales salieron del pa?s y de los que apenas se\nrecuperaron 33.\n\nPara el INC las sustracciones son m?s, pues existe una cantidad\ndesconocida de objetos arqueol?gicos conseguidos por medio de los\n\"huaqueros\" (excavadores ilegales), que los venden a centros de venta\nlegales que luego los sacan de contrabando.\n\n ________________________________\n\n\n*******************************************************************\n\n\n\nThis message, and any attachment contained, are confidential\n\nand subject of legal privilege. It may be used solely for the\n\ndesignated police/justice purpose and by the individual or\n\nentity to whom it is addressed. The information is not to be\n\ndisseminated to another agency or third party without the\n\nauthor's consent, and must not be retained longer than is\n\nnecessary for the fulfilment of the purpose for which the\n\ninformation is to be used. All practicable steps shall be taken\n\nby the recipients to ensure that information is protected\n\nagainst unauthorised access or processing. Interpol reserves the\n\nright to enquire about the use of the information provided.\n\n\n\nIf you are not the intended recipient, be advised that you have\n\nreceived this message in error. In such a case, you should not\n\nprint it, copy it, make any use of it or disclose it, but please\n\nnotify us immediately and delete the message from any computer\n\n\n\n********************************************************************\n\n-- \nTon Cremers\nhttp://www.museum-security.org/\n\n\n------------------------------\n\nMessage: 5\nDate: Wed, 30 May 2007 14:38:00 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] MUSEUMS AND UNIVERSAL HERITAGE: RIGHT OF RETURN AND\n\tRIGHT OF\tACCESS\nTo: \nCc: list@leidennetwork.net\nMessage-ID: <01d501c7a2b7$5e864080$1b92c180$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\n\n\n-----Oorspronkelijk bericht-----\nVan: africom-l-bounces@list.africom.museum\n[mailto:africom-l-bounces@list.africom.museum] Namens AFRICOM Secretariat\nVerzonden: woensdag 30 mei 2007 9:13\nAan: africom-l@list.africom.museum\nOnderwerp: {Spam?} [AFRICOM-L] MUSEUMS AND UNIVERSAL HERITAGE: RIGHT OF\nRETURN AND RIGHT OF ACCESS\n\nBy\n\nFOLARIN SHYLLON\n\nINTRODUCTION\n\nI am indeed delighted to give this lecture to mark the year 2007\nInternational Museum Day. I thank the National Commission for Museums and\nMonuments (NCMM) for its kind invitation. It was in the spring of 1977 that\nthe 12th General Assembly of the International Council of Museums (ICOM)\nfounded the day of appreciation of museums the world over, and the first\nInternational Museum Day was held one year later on 18 May 1978. A museum\naccording to ICOM Statutes is a \"permanent institution in the service of\nsociety and of its development, open to the public, which acquires,\nconserves, researches, communicates and exhibits, for purposes of study,\neducation, enjoyment, the tangible and intangible evidence of people and\ntheir environment.\" In establishing the day, ICOM recognised the perpetually\nincreasing role of museums as purveyors of shared cultural education and\nawareness.  \n\n     There are very many types of museums, from very large collections in\nmajor cities (such as the British Museum in London and the Louvre in Paris)\ncovering many of the categories mentioned below, to very small museums\ncovering either a particular location in a general way, or a particular\nsubject. Museum categories include: fine arts, applied arts, craft,\narchaeology, anthropology and ethnology, history, cultural history, military\nhistory, science, technology, children's museums, natural history,\nnumismatics, botanical and zoological gardens and philately. Early museums\nbegan as the private collections of monarchs, wealthy individuals, families\nor institutions of art. The first public museums in the world opened in\nEurope during the 18th century Age of Enlightenment. The first truly public\nmuseum was the Louvre Museum in Paris, opened in 1793 during the French\nRevolution, which enabled free access to the former French royal collections\nfor people\nof all stations and status for the first time in history. As a former palace\ntransformed into a public institution and opened to all French citizens, the\nLouvre became a symbolic monument to the new republican state.  \n\n* Being text of a Lecture delivered to mark the International Museum Day at\nthe Women Development Centre, Abuja on 18 May 2007.\n** Professor of Law, Olabisi Onabanjo University, Ago-Iwoye, Ogun State. \n \n\nMUSEUMS IN PRE-COLONIAL AFRICA \n\n  Although in pre-colonial Africa there were no formal museums in the modern\nsense, the palaces of Kings and the shrines of priests functioned as\nmuseums. Indeed, the geographer, Professor Afolabi Ojo in his book Yoruba\nPalaces (1966) pointed out that \"the [Yoruba] palace is for all practical\npurposes the embodiment of the arts and crafts of the people. It was the\nrepository of the treasures of both the town and its outlying district. It\nwas a museum of the kingdom.\"  In 1874 before the sacking of Kumasi and\nblowing up of the palace of the Ashanteehene, Sir Garnet Wolseley allowed\nEuropean and American journalists to wander through it. The British Daily\nTelegraph described it as \"the museum, for museum it should be called, where\nthe art treasures of the monarchy were stored.\" The London Times said that\neach of the rooms \"was a perfect Old Curiosity Shop.\" \"Books in many\nlanguages,\" the account continued, \"Bohemian glass, clocks, silver plate,\nold furniture, Persian rugs, Kidderminster carpets, pictures and engravings,\nnumberless chests and coffers .With these were many specimens of Moorish and\nAshantee handicraft.\" The New York Herald augmented the list: \"yataghans and\nscimitars of Arabic make, Damask bed-curtains and counterpanes, English\nengravings, an oil painting of a gentleman, an old uniform of a West Indian\nsoldier, brass blunderbusses, prints from illustrated newspapers, and, among\nmuch else, copies of the London Times . for 17 October 1843.\" [ Ivor Wilks,\nAsante in the Nineteenth Century: the Structure and Evolution of a Political\nOrder: Cambridge University Press, 1975, 200-201]. For his exploits in\nAshantee, Wolseley received the thanks of both Houses of Parliament and a\ngrant of 25,000 pounds sterling. He was promoted to be major general for\ndistinguished service in the field and was made GCMG and KCB. The freedom of\nthe city of London was conferred upon him with a sword of honour, and he was\nmade honourary DCL of Oxford and LLD of Cambridge universities.  \n \n\nMUSEUMS IN COLONIAL AFRICA \n\nIn colonial Africa the establishment of museums could have prevented or\nreduced the wholesale removal of cultural objects from the colonies to the\nmetropolis. The attitude of colonial officials however could at best be\ndescribed as indifferent. Consequently museums sprang up either as a result\nof the sustained effort and enthusiasm of a few colonial officials or they\ncame into being in order to cater for the past-times of settlers and\ncolonial officials. The museum as an institution had however been formalised\nin Europe well before the scramble for Africa: Ashmolean Museum (Oxford,\nEngland)1683, Dresden Museum (Germany) 1744, British Museum 1753, Vatican\nMuseum 1756, the Uffizi Gallery in Florence 1765, the Louvre 1793 and the\nPrado (Spain)1819. In Kenya what is now the National Museums of Kenya\nstarted in 1910 by colonial settlers and naturalists who needed a place to\nkeep and preserve their collections. In Nigeria the National Museum started\nin Jos in 1952 but it was not until 1957 that the National Museum in Lagos\nwas opened. Both Kenneth Murray and E. H. Duckworth who worked tirelessly\nfor the establishment of a museum in Nigeria drew attention to the fact that\ndue to the absence of  a museum in the country many priceless objects like\nthe Ife bronze heads unearthed in 1938 had left the country. What was true\nof the Nigerian experience was probably true of many other African\ncountries. A typical example is the Royal Museum for Central Africa (RMCA)\nin Tervuren, Belgium. \n\n     The RMCA was founded in 1897 by King Leopold II of Belgium as a \"window\non Central Africa\" for the Belgian people.  It boasts on its homepage that\nthe \"Museum is home to some truly remarkable collections. Its collection of\nethnographic objects from Central Africa is in fact the only one of its kind\nin the world\" It owns over 500,000 African objects. [250,000 rock samples,\n180,000 ethnographic objects, 56,000 wood samples, 8000 musical instruments\nand 350 archives]. The largest African museums have an average of 5,000\nobjects.\n\n\n     The appropriation of a nation's art treasures has always been regarded\nas a trophy of war which adds to the glory of the victor and the humiliation\nof the vanquished. The story is well known how Mussolini's army in 1935-36\ninvaded Ethiopia and carried off truck loads of booty to display in Rome\nincluding the statue of the Lion of Judah as a sign of submission. The\nItalians also took the 2000 year-old Aksum Obelisk, from the centre of\nEthiopian Christianity and placed it as a trophy on the Circus Maximus.\nAlthough the Treaty of Peace with Italy of 1947 at the end of the Second\nWorld War specified that Italy should return \"within eighteen months\" all\ncultural property looted from Ethiopia, it was only in April 2005 and after\nmuch pressure from Ethiopia that the Obelisk of Axum was returned to\nEthiopia. \n\n     The appropriation of a nation's art treasures has often been condemned\nin history. In 1812, Sir Alexander Croke had a collection of prints and\npaintings returned to the Philadelphia Academy of Arts on the grounds that\nthe arts and sciences are recognised by all civilised countries as forming\nan exception to the strict laws of war. To return them would therefore be in\nconformity with the law of nations, as practised by all civilised countries.\nDuring the wars at the time of the French Revolution, as Napoleon I\nconquered the great cities of Europe; he confiscated art objects as he went.\nAfter Napoleon was defeated in 1815, many of the treasures he had amassed\nwere gradually returned to their owners (many were not). The Duke of\nWellington justified the restitutions on the ground that the annexations had\nbeen contrary to the practice of war between civilised nations.   \n\nUNESCO INTERGOVERNMENTAL COMMITTEE     \n\n     In 1999, while a visiting fellow at UNIDROIT (International Institute\nfor the Unification of Private Law) in Rome, I wrote a paper titled \"The\nRecovery of Cultural Objects by African States through the UNESCO and\nUNIDROIT Conventions and the Role of Arbitration.\" (Uniform Law Review,\n2000-2, 219-241). The topic you have given me is therefore of utmost\nimportance to me and to all those who are interested in the return of\nAfrican cultural objects expropriated or looted in colonial times. I have\nalso argued for the return of the Benin Bronzes both on the pages of the\nLondon Times [7 December 2001], and on the domestic and world service radio\nprogrammes of the BBC [8 December 2001 and 9 December 2001]. \n\n     In the flush of independence African states agitated for the return of\ntheir expropriated cultural objects. This explains why the twelve states\nthat sponsored the first United Nations General Assembly resolution on the\nsubject of cultural property   - \"Restitution of works of art to countries\nvictims of expropriation\"  (Resolution 3187 of 1973) - were all African. The\nresolution in its preamble deplored \"the wholesale removal, virtually\nwithout payment, of objects d'art from one country to another, frequently as\na result of colonial or foreign occupation\"; it went on to maintain in the\nfirst substantive paragraph that \"the prompt restitution to a country of its\nworks of art, monuments, museum pieces and manuscripts and documents by\nanother country without charge\" will constitute \"just reparation for damage\ndone.\" In 1978, there followed \"A Plea for the Return of an Irreplaceable\nCultural Heritage to those who Created It\", issued by the then\nDirector-General of UNESCO, Amadou Mahtar M'Bow, himself an African. He\nlamented that \"the vicissitudes of history\" had robbed many peoples'\n\"priceless portion\" and \"irreplaceable masterpieces\" of their inheritance.\nReaction within UNESCO (United Nations Educational, Scientific and Cultural\nOrganisation) to UNGA Resolution 3187 of 1973 led to the establishment of\nthe Intergovernmental Committee for Promoting the Return of Cultural\nProperty to its Countries of Origin or Its Restitution in Case of Illicit\nAppropriation (the Intergovernmental Committee) in 1978. The Committee held\nits first session at the UNESCO headquarters in Paris in 1980 and since then\nhas met thirteen times. The fourteenth session is scheduled to hold in the\nspring of 2007. \n\n     The body, composed of 22 UNESCO Member States, is primarily a\nnegotiating forum aimed at facilitating bilateral negotiations and\nagreements for the return or restitution of cultural property; particularly\nthat resulting from colonization and military occupation to its country of\norigin either when all the legal means have failed or where bilateral\nnegotiations have proved unsuccessful. Surprisingly, African countries whose\nagitation at the United Nations General Assembly led to the establishment of\nthe Intergovernmental Committee have made little use of the Committee's good\noffices in the recovery of their expropriated cultural property. At the\nfifth session of the Committee in April 1987, \"a member of the Committee\nremarked that few complaints were received from Africa.\" One explanation for\nthe African inertia might be the difficulty of completing its Standard Form\nconcerning Requests for Return or Restitution. But UNESCO assistance is\nalways available to member States in this regard. It has been suggested by\nLyndel Prott and Patrick O\"Keefe, in their multi-volume work Law and the\nCultural Heritage, that the lack of initiative is not due to lack of\ninterest. \"It is far more likely to be lack of resources, or a certain\nscepticism as to the likely effect of such initiatives in relation to the\namount of work required.\" African countries can point to the fact that\nGreece's request for the return of the Parthenon (Elgin) marbles, which goes\nback to 1984, remains unfulfilled. But Greece offers African countries an\nobject lesson in determination and persistence, for it has never failed to\nraise the return of the marbles at all subsequent meetings of the Committee\nin spite of the regular negative British response. Indeed, the fourth\nCommittee session convened in Athens and Delphi and the seventh in Athens,\nin 1985 and 1991 respectively, at the invitation of the Greek government.\nThis leads us to say that the African inaction is due to lack of stamina for\nthe necessary follow-up. \n \n\nOBSTACLES TO RETURN \n\n     From the beginning of the agitation for the return of cultural property\nexpropriated during colonial period one major obstacle is the lack of\nadequate infrastructure in the former colonies to enable them to properly\nlook after a returned cultural object. As early as the Committee's second\nsession in 1981 it stressed the necessity of strengthening museum\ninfrastructure in Member States who might make requests for the return of\ncultural property.  It said that the authorities concerned must give\npriority and assign increased resources to: the creation or strengthening of\nconservation facilities and museum development in general. At the fourth\nsession of the Committee in 1985 \"one member spoke of the need of requesting\ncountries to set their own houses in order.\" In his view they were plagued\nwith \"grave inadequacies\" in terms of well trained museum specialists and\nconservation experts. An observer spoke of the specific problem of the\ntraining of guards for museums and archaeological sites in order to prevent\nillicit trafficking.  \n\n     It is true that many countries in Africa are lacking in the minimum\nrequirements for the conservation and preservation of cultural property\nwhose return has been requested, or of existing collections. This argument\nhas been, and is still used as a reason for refusing to return important\nobjects to their countries of origin. The Benin ivory mask chosen as the\nemblem of the Second World Festival for Black and African Arts and\nCivilisation in 1977 (FESTAC 77) and taken in 1897 is an apparent case in\npoint. While inadequate infrastructure of museums is one of the deplorable\nconsequences of the underdevelopment of Africa by the very countries that\nnow reproach them for it, the argument in nonetheless true. However, even\nwhere the argument of inadequate infrastructure cannot be seriously\nmaintained as in the case of Greece, the return of the cultural property is\nstill rejected. Even when Greece had built the Acropolis Museum where the\nParthenon marbles could best be situated the United Kingdom still declined\nto return them. The complaint about inadequate infrastructure would\ntherefore appear to be a red herring. I therefore agree with the declaration\nof African members and observers at the second session of the\nIntergovernmental Committee in 1981 that while the establishment and\ndevelopment of adequate facilities (museums, libraries, archives, etc.) is\nessential in each African country, it should not be \"a prerequisite for the\nreturn of cultural property.\" [Emphasis supplied]  As Abranches commented in\nhis report for the Committee on the Situation in Africa in 1983 it seems\nunreasonable that conditions for conservation should ever be used as an\nargument for the non-return of expatriated cultural heritage to its country\nof origin. On the contrary, the creation of such conditions should be one\naspect of the return process.   \n\n     Another argument often used is the corruption of museum officials in\nAfrica. Professor Frank Willet, a specialist in Benin art, was reported in\nthe London Times of 7 December 2001 as saying \"the bronzes could not go back\nto Nigeria while there were allegations of corruption and museum staff\nselling items.\" Professor Ade Obayemi, Director-General of the NCMM from\nMarch 1987 to August 1991, in his Handing Over Notes to his successor made\nthe following troubling remarks concerning the matter: \"The Chief Executive\nof the Commission will be shocked to find that the records show that\nofficials of the Commission at very senior levels, were, or had been\nindicted as security risks and or agents of traffickers in antiquities . I\nwill only quote the standing warning of Prof. Ekpo Eyo in his own Handing\nOver Notes that '. it has to be remembered that the greater risk could come\nfrom inside and this is what needs to be carefully watched' \"      \n\n     One can site the case of State and another v. Takuh (Charge No.\nPLD/316C/91) tried in the Jos High Court in the 1990s to highlight the\nproblem the Director-General was hinting at. Two officers (archaeologists)\nof the NCCM were charged for the offence of criminal conspiracy and criminal\nbreach of trust under sections 96 and 313 of the Penal Code of Northern\nNigeria. In this case a Nok Janus head was handed over to the first accused\nperson to keep in the stores. Later when he was asked by the head of station\nof the Jos museum to fetch it, he could not produce it. He was convicted and\ngiven six months imprisonment with the option of 10,000 naira fine. The\nsecond accused was discharged and acquitted. The assertion of corruption is\ntherefore not unwarranted. It is incumbent on the NCMM to ensure that game\nkeepers do not become poachers.  \n\n \nUNIVERSAL HERITAGE AND UNIVERSAL MUSEUMS \n\n    Many major works of art have ended up in museums far from their place of\norigin, and disputes over ownership or return surface periodically. There\nare other unresolved restitution cases besides the Benin Bronzes and the\nParthenon marbles, including Pergamon Altar, claimed by Turkey, and now at\nthe Pergamon museum of the State Museums, Berlin. They are usually housed or\nsheltered in universal museums like the British Museum and the Louvre who\nalways claim that they are holding and keeping them as custodians and\ntrustees of our universal heritage. \n\n    The idea of universal heritage was first amplified in international law\nin the preamble to the UNESCO Convention for the Protection of Cultural\nProperty in the Event of Armed Conflict of 14 May 1954. The third paragraph\nof the preamble states that: \"the preservation of the cultural heritage is\nof great importance for all peoples of the world and that it is important\nthat this heritage should receive international protection .\" The Convention\ncoming as it did after the despoliation of cultural property during the\nSecond World War, was quite assertive on the issue of protection of cultural\nproperty and hoisted the banner of the internationalism of cultural\nheritage. It is asserted in another paragraph of the preamble that \"damage\nto cultural property belonging to any people whatsoever means damage to the\ncultural heritage of all mankind .\" In subsequent standard setting\ninstruments adopted by UNESCO the theme of the universality of cultural\nheritage was again and again reaffirmed. Thus the 1970 UNESCO Convention on\nthe Means of Prohibiting and Preventing the Illicit Import, Export and\nTransfer of Ownership of Cultural Property, maintains that \"the interchange\nof cultural property among nations . enriches the cultural life of all\npeoples.\" Two years later in the Convention Concerning the Protection of the\nWorld Cultural and Natural Heritage 1972, the second paragraph of the\npreamble maintains that \"deterioration or disappearance of any item of the\ncultural or natural heritage constitutes a harmful impoverishment of the\nheritage of all the nations of the world.\" In the Convention on the\nProtection of the Underwater Cultural Heritage 2001, the first paragraph of\nthe preamble acknowledges \"the importance of underwater cultural heritage as\nan integral part of the cultural heritage of humanity.\" Likewise the\npreamble to the Convention for the Safeguarding of the Intangible Cultural\nHeritage 2003 states that it was being adopted because Member States of\nUNESCO were \"aware of the universal will and the common concern to safeguard\nthe intangible cultural heritage of humanity.\"    \n\n     From this persistent and consistent UNESCO declarations that cultural\nproperty belongs to all humanity it was a small step to arguing that as a\nmatter of human right cultural objects expropriated in the colonial period\nshould be returned. Indeed, in 1981 a member of the committee from Panama\nwho was unable to attend the second session of the Intergovernmental\nCommittee in a telex message read to the session concluded it by asserting :\n\"The right [of dispossessed countries] to the cultural heritage is one of\nhuman rights, let us defend it.\" M'Bow in his 1978 Plea had argued that:\n\"The men and women of these countries have the right to recover these\ncultural assets which are part of their being.\" On 7 December 1999, Theo-Ben\nGurirab, Foreign Minister of Namibia and also at the time President of the\nUnited Nations General Assembly in a discussion in the General Assembly on\nthe issue of return of cultural objects maintained that \"the lapse of time\ndid not diminish ownership or the need for restitution.\" Increased calls for\nthe return of cultural artefacts that were removed decades or centuries ago,\nsuch as the Benin Bronzes and the Parthenon (Elgin) Marbles, both of  which\nare in the British Museum, finally forced in 2003 eighteen of the world's\nleading museums in the United States and Europe [including Art Institute of\nChicago, State Museums, Berlin, J. Paul Getty Museum, Los Angeles, Louvre\nMuseum, Paris, Metropolitan Museum of Art, New York, Museum of Fine Arts,\nBoston, Prado Museum, Madrid and State Hermitage Museum, St. Pertersburg] to\ndeclare that they will not hand back ancient artefacts to their countries of\norigin. In Declaration on the Importance and Value of Universal Museums,\ndirectors of eighteen institutions, from St. Petersburg to New York signed a\ndeclaration that their collections act as \"universal museums\" for the good\nof the world. They reminded us that \"The universal admiration for ancient\ncivilisations would not be so deeply established today were it not for the\ninfluence exercised by the artefacts of these cultures, widely available to\nan international public in major museums.\" In an internationalist stand\nsomewhat reminiscent of the UNESCO Conventions preambles they assert that\n\"museums serve not just the citizens of one nation but the people of every\nnation.\" They however flatly contradicted themselves when in another breath\n- obviously in an attempt to thwart for good the claim for return of\nartefacts - they maintain almost with religious fervour that objects and\nmonumental works that were installed decades and even centuries ago in\nmuseums throughout Europe and America should remain there. \"Over time,\nobjects so acquired . have become part of the museums that have cared for\nthem, and by extension part of the heritage of the nations which house\nthem.\" \n\n     The Declaration grew out of the very strong campaign mounted by Greece\nin the run up to the Athens Summer Olympic Games of 2004 to have the\nParthenon marbles back for the Games. According to one account, one of the\nsignatories on condition of anonymity said that the Declaration began as a\n\"call for help\" from Neil MacGregor, the Director of the British Museum.\nHowever it is quite fascinating that neither the British Museum nor any\nother museum in Britain was listed among the signatories. It was nonetheless\nposted on the homepage of the British Museum with enthusiasm and MacGregor\nwas quoted as supporting the statement. He said: \"This declaration is an\nunprecedented statement of common value and purpose issued by the directors\nof some of the world's leading museums and galleries. The diminishing of\ncollections such as these would be a great loss to the world's cultural\nheritage.\" With regard to Greece's request the BBC quoted MacGregor saying:\n\"They must remain here if the museum is to continue to achieve its aim,\nwhich is to show the world to the world.\" As we shall see shortly Robert\nAnderson, MacGregor's predecessor as director of the British Museum made a\nsimilar statement with regard to the Benin Bronzes.\n \n\nTHE BENIN BRONZES \n\n     It is often said that the Nigerian government over the years made\nseveral requests to Britain for the return of the Benin Bronzes. For\nexample, in a letter dated 10 December 1996 sent by the late Member of\nParliament, Bernie Grant to the Director of Art Gallery and Museum, Glasgow,\nScotland,  he said: \"Formal requests for their return have been made in the\npast by the Nigerian Government, and by the Obas of Benin themselves.\" In\nactual fact the documentation of these requests is hard to come by. There is\nof course the well known request of Nigeria for the loan of the beautifully\ncrafted ivory pendant mask chosen by Nigeria as the emblem for FESTAC 77.\nThe British Museum initially requested an insurance bond of 2 million pounds\nsterling, for the mask's safety, but then argued that it was too delicate to\nbe moved from its carefully controlled environment. In the event the mask\nwas not lent. Twenty four years later in 2001 Robert Anderson, then Director\nof the British Museum in an interview in the London Times of 7 December\n2001, came clean and justified the refusal on two grounds. He said there was\nnever a chance of a loan, as visitors \"expect to see these things on display\nin the British Museum.\" History could not be unravelled, he added. \n\n     In the run up to the centenary of the plunder of the Benin art works,\nthe weekly magazine West Africa of 11-17 November 1991, in a story titled\n\"Treasure Hunt\" reported that the Oba of Benin had launched a strong\ncampaign for the recovery of thousands of art treasures taken to Britain in\n1897. The Oba was collecting as many as one million signatures worldwide.\nThe account noted that previous efforts to recover the treasures had failed.\nPosters were printed and widely circulated both within and outside Nigeria\ndepicting some of the plundered bronzes with the inscription \"We Want Our\nTreasures Back.\"  \n\n     From 18-23 February 1997, activities were held in Benin to mark the\ncentenary of the events of 1897. The Oba of Benin in his opening address\nalluded to the threat of some Bini to take the British government to the\nInternational Court of Justice over the events of 1897 in order to get a\njudgement to require the British government to repatriate the looted works\nof art. While appreciating the good intention of such patriotic Bini he\ncautioned that this is not a matter to be taken to the International Court\nof Justice or any other court of law, even if those contemplating it would\nbe able to finance such actions. Pointing out that success has been achieved\nin many international issues through what is known as quiet diplomacy, the\nOba added: \"At this very moment, I am happy to say, I am in contact with\nsome eminent people in London who are supportive to our cause and seriously\nhelping.\"   \n\n     The late Bernie Grant, one of Britain's first black Member of\nParliament was certainly supportive of the effort to regain the bronzes. In\nDecember 1996, as Chair of the Africa Reparations Movement (UK), (ARM UK)\nBernie Grant wrote to the Director of Art Gallery and Museum in Glasgow on\nbehalf of the Oba of Benin asking for the return of the Benin Bronzes\nholding of the gallery. In his reply turning down the request, Julian\nSpalding the director of the gallery stated that \"virtually all our 22 Benin\nitems are on permanent view to the public . and their withdrawal from these\ndisplays would limit, in our opinion, our visitors' understanding of the\nworld.\" He noted that even if the request were granted it would not be \"a\ntransfer from one public museum to another, but a request on behalf of the\nOba of Benin, himself.\" The fact that the request if granted would end up in\n\"private\" collection was fatal his concluding sentence appears to be saying.\n\"We believe . that these artefacts have an important role to play in the\npublic sector by informing over 3 million visitors here about the culture of\nBenin and, it has to be said, the history of British Imperialism.\" We can\ncontrast Spalding response with the disclaimer beside the Benin bronzes at\nthe Pitt-Rivers museum in the University of Oxford that the museum has not\nreceived a request for the return of the bronzes. \n\n     Although from the beginning of its work the Intergovernmental Committee\nmade it clear that it was not interested in emptying universal museums of\ntheir acquired masterpieces the tension has always been there between\nuniversal museums and countries victims of colonial expropriation. The\nCommittee during deliberation at its first session had said that \"it had a\nduty first and foremost to deal with requests for restitution or return from\ncountries which had been deprived of their cultural property and which need\nit for assembling a representative collection of their cultural heritage.\"\n[Emphasis supplied] Consequently, in the return and restitution controversy,\nit is important to bear in mind that a very considerable number of objects\nwill not be returned to their countries of origin because they are not among\nthose to be chosen in accordance with the criteria established by the\nIntergovernmental Committee. \n\n     It is a matter of surprise indeed that to date Nigeria which at various\ntimes served on the Intergovernmental Committee for Promoting the Return of\nCultural Property to its Countries of Origin or its Restitution in Case of\nIllicit Appropriation (she was in fact a foundation member of the Committee)\nhas never sought the good offices of the Committee on the matter. Requests\nfor return or restitution must be submitted not less than six months prior\nto the session of the Committee at which they are to be examined. The\nCommittee meets every two years, although it may meet in extraordinary\nsession. As indicated earlier, the Committee has drawn up a standard form\nwith guidelines to facilitate the requests for return and restitution.\nDuring the third session of the Intergovernmental Committee held in\nIstanbul, Turkey, 9-12 May 1983, it was reported that \"the representative of\nNigeria also mentioned the results of various bilateral negotiations\nlaunched by her country (as well as outright purchase of objects so as to\nobtain their return to Nigeria) and indicated the hopes it placed in the\nwork of the Committee.\" Evidently, nothing has come of the bilateral\nnegotiations. I would have thought that Nigeria should then have proceeded\nto file a formal request, at least, in respect of the Benin Bronzes. \n\n     If not then, at least something ought to have been done since 2002 when\nthe Nigerian Parliament through the House of Representatives demanded the\nreturn of the Benin Bronzes. On 23 January 2002, the lower house of\nparliament in a motion sponsored by 57 legislators and passed unanimously\ncalled on the President to request the repatriation of the Benin Bronzes.\nThe motion also asked the NCMM to provide a list of all Nigerian artefacts\nat the British Museum - and list their value. \n\n     In discussions on the return of Benin Bronzes sight is often lost of\nthe fact that Germany has a larger share of the artefacts than Britain. Yet\nas far as I know no pressure has been exerted on Germany. The focus on the\nBritish is probably due to the fact they were the perpetrators of the\nplunder. In my article in Art Antiquity and Law (Vol. 3 No. 3, 1998)\ncaptioned \"One Hundred Years of Looting of Nigerian Art Treasures 1897-1996\"\nI highlighted the fact that the Germans have more of the bronzes than the\nBritish. The British had auctioned the artefacts to defray the expenses of\nthe expedition. I quoted the statement of Kenneth Murray, the father of the\nmuseum movement in Nigeria from the Nigeria Magazine issue of 1938 that \"it\nwas really owing to the initiative of the Germans, who secured the majority\nof the work for their own museums, that Benin became famous.\"  In an earlier\narticle \"Cultural Heritage Legislation and Management in Nigeria\" in the\n1996 issue of the International Journal of Cultural Property, I quoted a\nstatement of Professor Saburi Biobaku: \"Whereas the Dahlem in West Berlin\ncan boast of 4,000 Benin pieces, and the British Museum, 2500 and Pitt\nRivers [Museum, University of Oxford] 393 objects, the Nigerian museums\npossess only about 100 pieces.\" Following the acquisition of the Perls\ncollection by the Metropolitan Museum of Art, New York, it now has about 200\nobjects. The round figures given by Biobaku for Berlin and the British\nMuseum have not been verified. Various accounts I have seen of the British\nMuseum's total is from 700 to 900. I do not doubt however that the State\nMuseums in Berlin do have more than the British Museum. I suppose a fine\ndistinction can be drawn between the British who plundered and the Germans\nwho bought the objects!\n \n\nRIGHT OF RETURN AND RIGHT OF ACCESS \n\n     The NCMM in its invitation asked me to talk on Museums and Universal\nHeritage: Right of Ownership. I have however modified the title to Museums\nand Universal Heritage: Right of Return and Right of Access. I have done so\nadvisedly. An examination of the reports of the Intergovernmental Committee\nspanning twenty seven years shows that only three cases have been formally\nbrought to the Committee. The first in 1984 was the request by Greece for\nthe return of the Parthenon (Elgin) marbles. The other requests in 1987 were\nby Turkey for the return of 7400 cuneiform tablets and the Boguzkoy Sphinx\nthen located in the German Democratic Republic (GDR).  Of the three requests\nonly the 7400 cuneiform tablets were returned by the then GDR. The major two\nrequests, that is, the Parthenon (Elgin) marbles and the Boguzkoy Sphnix\nremain un-honoured. The related International Fund for the Return of\nCultural Property to its Countries of Origin or its Restitution in Case of\nIllicit Appropriation created in 1999 and which relies on voluntary\ncontributions by member States, remains unfunded apart from 29,342 euros\n(converted from 10,000,000 drachmas) donated by Greece in 2002. This is not\nsurprising. The idea of an international fund to assist in effecting the\nreturn of cultural property was first mooted by the secretariat to the\nCommittee at the inaugural session in 1980 following an earlier suggestion\nby ICOM. A number of delegates and observers however expressed reservations\nas to the appropriateness of creating a fund of this kind. Reasons of a\npsychological nature, among others, were put forward, such as the reactions\nof certain countries, which would be called upon, at one and the same times,\nto return cultural property and to finance the costs incurred, directly or\nindirectly, by such restitution. Earlier I mentioned the remark of the\ndirector of the British Museum that there was never a chance that the FESTAC\nemblem would be lent to Nigeria. I have also discussed the Declaration on\nthe Importance and Value of Universal Museums which firmly rejected the idea\nof a return. Indeed BBC Online captioned its report of the statement\n\"Museums Thwart Artefact Claim\". In view of the overwhelming reluctance to\nreturn cultural objects by museums that have them, I consider it also\nnecessary to consider an alternative to return.\n \n\nUniversal Museums in Africa \n\n     Although in the context of bilateral negotiations some outstanding\nexamples of restitution have taken place since decolonisation including the\nreturn of objects by Belgium to the Democratic Republic of Congo, by the\nNetherlands to Indonesia, there is extreme reluctance to undertake the\nreturn of what M'Bow referred to as \"irreplaceable masterpieces\" and\n\"irreplaceable cultural heritage\". Given this fact I have suggested on two\nprevious occasions a midway solution. And this is the establishment of\nbranches of Universal Museums in Africa. I think it may be possible to split\npossession and ownership of cultural objects expropriated in the colonial\nperiod. We are accustomed to the idea of a \"British Institute\" in Rome, a\nGerman \"Archaeological Institute\" in Rome or \"American School\" in Athens,\nand so on. Why not a branch of the British Museum in Abuja, a branch of\nTervuren in Kinshasa, and a branch of the State Museums, Berlin in Benin\nCity, and so on? In this way the former colonised countries would have\npossession and former colonisers would retain ownership and control. The\nadoption of this suggestion will introduce a new vocabulary into the\ndiscourse, namely \"relocation\". Return, repatriation and restitution have\nnow acquired emotive connotation that we can usefully focus on relocation so\nthat as Professor Thurstan Shaw observed, original works of art could be\nstudied and understood in the milieu that gave them birth. We can venture to\nsay that the majority of African countries are better represented in the\nmuseums of Europe and America than in their own countries. \n\n     The suggestion for branches of universal museums like the British\nMuseum and the Louvre in Africa was first made at a conference organized by\nthe Institute of Art and Law, Leicester, England and sponsored by UNESCO at\nUniversity College London on the theme of Caring and Sharing: Moral and\nLegal Imperatives for the Return of Cultural Property in December 2001. It\nwas amplified five years later at the conference on Cultural Heritage\nIssues: The Legacy of Conquest, Colonization and Commerce hosted by\nWillamette University College of Law, Oregon, United States in October 2006.\nSomething not too dissimilar to what I proposed is now going on at the High\nMuseum of Art, Atlanta, Georgia, United States where the Louvre Atlanta\nexhibition opened in December 2006. The series of exhibitions lasting three\nyears make available for viewing on American soil revered and priceless\ntreasures from the Louvre. Of course it is far much easier to conclude the\nLouvre Atlanta project than what is being proposed. But daunting as the idea\nis, it is not impossible to achieve. I may mention in parenthesis the case\nof the three Nok objects looted from Nigeria and acquired from the illicit\nmarket for display in the Louvre and ultimately in the Musee du Quai Branly.\nIn the end the French government recognised Nigeria's ownership of the three\nartefacts and in exchange Nigeria agreed to deposit them in the Musee du\nQuai Branly, to be exhibited with the museum's permanent collection for the\nexceptionally long period of 25 years (renewable).     \n\n     At the third session of the Intergovernmental Committee which was held\nin Istanbul, Turkey in 1983, a member of the French delegation cited several\nexamples of bilateral cooperation launched by the French authorities\nconcerning the protection of the cultural heritage in various African\ncountries: the construction of a National Museum at Bamako and the\norganisation of a campaign to collect cultural property in Mali; the\ncreation of the Historical Museum at Quida and the Ethnographical Museum at\nPorto Novo and the restoration of the Royal Palace of Omnes at Porto Novo,\nBenin Republic. Also at the Istanbul session the observer from the United\nKingdom made a very interesting intervention. In his statement he stated\nthat \"the fact that the United Kingdom does not accept the principle of the\nreturn of cultural property except in cases of illegal acquisition does not\nmean that we are opposed in principle to the return of objects. Each\ninstitution is free to act as it wished within the confines of its\nstatutes.\" He added that the return of objects \"is only one of a possible\nrange of options which can be explored bilaterally.\" I wish to suggest that\nthe opening of a branch of the British Museum in Nigeria is a good option\nworth pursuing in Nigeria's bilateral engagement with the United Kingdom. \n\n     In addition to making available on African soil renowned African\nmasterpieces in foreign museums, it would open the way for the most\nconstructive exchanges of foreign cultural objects in African museums. As\nfar back as 1983 Henrique Abranches in his report on the situation in Africa\n(CLT-83/CONF.216/3) to the Intergovernmental Committee observed that one of\nthe biggest problems besetting the cultural life of the African continent is\nits conspicuous backwardness in exchanges of cultural heritage. In the whole\nof Black Africa, for instance, it is impossible to find a single museum of\nOriental art, or a good gallery of modern impressionist or other art. Greek\nsculpture, Aztec pottery and Slav silverware, to name a few, are completely\nunknown to the African peoples. In addition, whereas, for example, the\nSmithsonian Institution in the United States has the National Museum of\nAfrican Art, most African countries do not possess good representations of\nthe art and history of other African countries. Thus this is not a one\ndimensional project. Two other alternatives to return may be mentioned\nquickly. The first is travelling exhibitions in African countries of African\nart objects in universal museums. The second is long-term or permanent loans\nof important and significant African cultural property to their countries of\norigin since most universal museums would plead that permanent de-accession\nof the cultural objects they own is not allowed. There is no doubt that the\nadoption and implementation of any or all of these creative alternatives to\nreturn will vastly improve cultural heritage well-being of African\ncountries.  \n\n     Another recent development worth mentioning and also designed to\nencourage Africa's cultural heritage well-being is the endeavour spearheaded\nby a Finnish author Juha Vakkuri to set up in Grand-Popo in Benin Republic,\nthe Museum of Returned African Art to house returned African art exported in\ncolonial times. The first goal of African Art Returns is to acquire 500\nworks of African art by 2008, which would be stored in Finland until\nreturned and displayed in Africa. According to an AFP report of 9 February\n2006, Vakkuri speaking at an interview in Paris revealed that private\nsponsors and the Finnish government would finance the 100,000 euros\noperating cost for 2006. In future years, the annual budget rises to\n300,000-400,000 euros, half coming from Nordic governments and half from\nprivate sources. The scheme also counts on an acquisition budget of about\n100,000 euros. \n\n\n     One other option to return which I would merely mention is making a\ncopy or replica of the cultural object for the requesting country. Being\ngiven a copy of an \"irreplaceable cultural heritage\" is a very poor\nsubstitute. The connection that people feel to cultural objects that define\ntheir being is so powerful and a duplicate cannot satisfy what Anthony\nAppiah  (\"Whose Culture Is it, Anyway?\") referred to as \"the connection to\nart through identity\". Besides among nations the option has always been\nuniversally spurned. Thus in the report of the twelfth Intergovernmental\nCommittee session (25-28 March 2003) it was reported that on 19 November\n2002 a bilateral meeting was held between Turkish and German authorities in\nBerlin with little result over Turkey's request for the return of the\nBoguzkoy Sphinx. \"Germany proposed keeping the original Sphinx and having a\nreplica made to give to Turkey. Turkey proposed the return of the Sphinx to\nTurkey and giving a replica to Germany. Neither proposal was accepted.\"  The\ntruth is that even in this technologically advanced age when you could not\ntell the copy from the original, only the original has the aura or magic\nthat attaches to an original work of art.\n\n\n\nRECOMMENDATIONS \n\n1.  Nigeria should commence bilateral negotiations with the governments of\nthe United Kingdom and the Federal Republic of Germany for the return of the\nBenin bronzes and if negotiations fail Nigeria must seek the good offices of\nthe Intergovernmental Committee by submitting requests for the return of the\nbronzes to the governments of the United Kingdom and the Federal Republic of\nGermany. In addition a request for the return of the Benin bronzes at the\nPitt Rivers museum should also be made.  \n\n2. There should be a national audit of cultural property and heritage\ncollections of Nigeria. This should be done in collaboration with ICOM and\nAFRICOM (International Council of African Museums - ICOM's programme for\nAfrica) and possible financial and technical assistance of the developed\ncountries.  \n\n3. There should be an inventory of all Nigerian cultural objects outside the\ncountry on the basis of information published in museum and auction\ncatalogues and art books. [At the seventh session of the Intergovernmental\nCommittee held in Athens, Greece in April 1991, Madagascar announced that it\nhad recently drawn up the inventory of objects of her cultural heritage held\noverseas in cooperation with Norway. Madagascar was seeking copies of these\nobjects or their repatriation.] \n\n4. Nigeria through the Ministry of Culture and National Commission for\nMuseums and Monuments should commence discussion for the establishment of a\nbranch of the British Museum in Nigeria so that the Benin\nBronzes can be viewed on Nigerian soil. There should be a similar effort for\na branch in Nigeria of the State Museums, Berlin.    \n\n5. A museum and an art gallery should be built in the Federal Capital\nTerritory.  \n\n6. The government of the Federal Republic of Nigeria should offer to host a\nsession of the Intergovernmental Committee which has never been hosted by an\nAfrican country.   \n\n_______________________________________________\nChange AFRICOM-L subscription options and unsubscribe at:\nhttp://list.africom.museum/mailman/listinfo/africom-l\n\n\n\n------------------------------\n\nMessage: 6\nDate: Wed, 30 May 2007 15:39:06 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Stradivarius stolen from flat in Vienna\nTo: msn-list@te.verweg.com\nMessage-ID:\n\t\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\n\n Stradivarius stolen from flat in Vienna\n\n29 mai 2007\nAgence France Presse\n\nCopyright Agence France-Presse, 2007 All reproduction and presentation\nrights reserved.\n\nVIENNA, May 29, 2007 (AFP) -\n\nA rare Stradivarius violin worth an estimated 2.5 million euros (3.4\nmillion dollars) has been stolen in an audacious raid on a safe in\nVienna, police said Tuesday.\n\nA Vuillaume violin, worth 120,000 euros, and three bows estimated at\n12,000 euros in total, were also stolen from the safe in the apartment\nin the centre of Vienna.\n\nThe owner, a 49-year-old violinist, discovered that a thief or thieves\nhad taken a blow-torch to his safe and made off with his instruments\nwhen he returned from a concert in Germany on Sunday evening.\n\nINTERPOL has issued an arrest warrant for whoever carried out the\nspectacular theft, but police said there were no witnesses.\n\nViolins made by Italian Antonio Stradivari (1644-1737), considered by\nmany the world's most significant luthier or crafter of stringed\ninstruments, are extremely rare and valuable with probably no more\nthan 600 still in existence.\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 125\n****************************************\n\n"}