{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Associated Press: Brazil Says May Break AIDS Drug Patent", "body": "http://www.forbes.com/feeds/ap/2007/04/25/ap3653230.html\n\nAssociated Press\nBrazil Says May Break AIDS Drug Patent\nBy VIVIAN SEQUERA 04.25.07, 6:42 PM ET\n\nBrazil said Wednesday it would buy an Indian-made generic version of a\nMerck and Co. anti-AIDS drug if the U.S. company does not offer Latin\nAmerica's largest country a deeper discount on the medicine.\n\nHealth Minister Jose Gomes Temporao signed a decree declaring Merck\n(nyse: MRK - news - people )'s efavirenz anti-retroviral drug a \"public\ninterest\" medicine - the first step in a process that could lead Brazil\nto break Merck's patent.\n\n\"Brazil is not doing this as a threat, nor to lower the price of other\nmedicines, but to guarantee its program of attending (AIDS) patients,\"\nTemporao said at news conference.\n\nWhitehouse Station, New Jersey-based Merck now has seven days to\nnegotiate lower prices with the government, Temporao said. If the two\nsides do not reach a deal, Brazil could issue a compulsory license that\nwould allow the country to produce or buy a generic version of the\ndrug, paying Merck only a small royalty.\n\nMerck said it was committed to reaching a negotiated agreement with the\nHealth Ministry.\n\n\"The company does not believe compulsory licensing is in the best\ninterest of patients,\" spokeswoman Amy Rose said.\n\nBrazilian law and rules established under the World Trade Organization\nallow for the issuance of compulsory licenses in cases of a health\nemergency or if the pharmaceutical industry is deemed to be engaged in\nabusive pricing.\n\nEfavirenz is the most widely used medication by Brazil's anti-AIDS\nprogram, which provides free medicines for anyone who needs them.\n\nCurrently 75,000 of the 180,000 Brazilians with HIV who receive the\nfree cocktail of anti-AIDS drug, use efavirenz. When Brazil began\nbuying efavirenz in 1999, only 2,500 patients used the drug.\n\nIn 2005, Brazil threatened to break the patent on Kaletra, an anti-AIDS\ndrug produced by Abbott Laboratories (nyse: ABT - news - people ) Inc.,\nbut the two sides reached an agreement and the company's patent was not\nbroken.\n\nIn November, Brazil began price-reduction negotiations with Merck,\ndemanding the same 65 cents per 600 milligram pill of efavirenz the\ncompany charges the Thai government. Brazil at the time was paying\n$1.59 per pill, the statement said.\n\nMerck proposed a 2 percent reduction, which the government turned down.\n\nBrazil has repeatedly managed to win price reductions in recent years\nfrom big pharmaceutical companies by threatening to break patents but\nhas never actually done so.\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}