{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "celerity: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\nWelcome To Our Wedding Registry\nBy registering online, the bride and groom have access to an extensive name brand selection.\n Wedding Registry\nADVERTISEMENT\nWord of the Day for Wednesday, May  9, 2007\ncelerity \\suh-LAIR-uh-tee\\, noun:\nRapidity of motion or action; quickness; swiftness.\nThough not in the best of physical form, he was capable of moving with celerity. -- Malachy McCourt, A Monk Swimming: A Memoir\nFurthermore, as is well known, computer technology grows obsolete with amazing celerity. -- Alan S. Blinder and Richard E. Quandt, \"The Computer and the Economy\", The Atlantic, December 1997\nThe lightning celerity of his thought processes took you on a kind of helter-skelter ride of surreal non-sequiturs, sudden accesses of emotion and ribald asides, made all the more bizarre for being uttered in those honeyed tones by the impeccably elegant gent before you. -- \"A life full of frolics\", The Guardian, May 19, 2001\nCelerity is from Latin celeritas, from celer, \"swift.\" It is related to accelerate.\nDictionary.com Entry and Pronunciation for celerity\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9540594-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}