{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Cody Hurst <churst35@verizon.net>", "subject": "Re: dectalk or double talk advice", "body": "I like your approach, the only probablem with this is that I have to\ntake a novell test and we used suse and netware, so I don't think it\nwould fly. However I would be interested in your preparation for the\ncourse. What did the course intail? Email me off list. My course deals\nwith stuff like cisco routers, setting up networks and maintaining them\nsetting up servers, etc.\n\nCody\nOn Fri, 2007-06-22 at 16:22 -0400, Alex Snow wrote:\n> I survived both a Networking course and an Intro to Unix course using \n> slackware while everyone else used SuSe.\n> On Fri, Jun 22, 2007 at \n> 04:14:51PM -0400, Cody Hurst wrote:\n> > Hi Greg,\n> > \n> >   Thanks for filling me in on Slackware. I will first look into the\n> > double talk lt. I kind of figured serial would have to be my obvious\n> > choice, however I jsut wanted to make sure. These systems are older (not\n> > ancient) but bottom linie they more than likely have a few serials on\n> > them.\n> > \n> >   As far as the software part goes, are there any other alternatives to\n> > speakup, so at least I can have a taste of a few if I should ever need\n> > another one. It is just kind of up to me to I guess you could say \"fend\n> > for myself\" on this course since the school really doesn't know what is\n> > best for me and never has had a visually impaired person in their\n> > networking course. I wish things woud work out of the box but we know\n> > about that.\n> > \n> > Thanks,\n> > Cody\n> > \n> > On Fri, 2007-06-22 at 12:47 -0700, Gregory Nowak wrote:\n> > > -----BEGIN PGP SIGNED MESSAGE-----\n> > > Hash: SHA1\n> > > \n> > > First, the operating systems mentioned were suse linux, and\n> > > netware. There was no mention of windows, thus I don't see how the\n> > > reference to jaws fits in, unless it was to explain how jaws gets its\n> > > data, which is besides the point.\n> > > \n> > > Also, the reference to usb being the better choice was\n> > > inappropriate, since speakup currently doesn't support usb synths, as has\n> > > been mentioned here frequently, especially in recent threads. Having\n> > > said that, if you're going to rely on speakup, you will want to be\n> > > sure that all the work stations you're going to use have at least 1\n> > > rs232 serial port. If they don't, then you're in trouble if you\n> > > expect to use speakup.\n> > > \n> > > Also, be aware that suse doesn't include speakup in their\n> > > distribution, and I'm not aware of any existing suse kernels with\n> > > speakup patched into them. You mentioned also not being sure about the\n> > > accessibility of slackware. Actually, slackware was the first\n> > > distribution to include a speakup-patched kernel in the official\n> > > slackware media.\n> > > \n> > > As for which synth to choose, I think the 2 biggest factors in that\n> > > decision are the speech, and the price of each. The doubletalk lt is\n> > > cheaper than the dectalk usb, which does also have a serial port as\n> > > far as I know. As for the speech, I personally prefer that of the\n> > > doubletalk, but that's probably because I've used a doubletalk far\n> > > more than I have used a dectalk, and others may disagree here as\n> > > well. Speech is a very qualitative subject, and there is no synth that\n> > > fits every person's taste perfectly. As an aside, you wouldn't have\n> > > been able to use a doubletalk pc anyway, because they aren't being produced\n> > > anymore, and because it is very hard these days to find a pc with an\n> > > isa slot. Hth.\n> > > \n> > > Greg\n> > > \n> > > \n> > > \n> > > On Fri, Jun 22, 2007 at 12:23:06AM -0700, Littlefield, tyler wrote:\n> > > > First, you're not going to get speech support without a program.\n> > > > The screen reader puts hooks in the kernel, or catches the video in the case \n> > > > of jaws, and translates.\n> > > > Next, I'd recommend USB, because, if you start using newer systems, most \n> > > > don't have a serial port.\n> > > > Third, the accessibility of slackware is fine, unless you insist on running \n> > > > under gnome, x, or something else, then you're really not getting the \n> > > > benafit of linux.\n> > > > HTH,\n> > > \n> > > \n> > > - -- \n> > > web site: http://www.romuald.net.eu.org\n> > > gpg public key: http://www.romuald.net.eu.org/pubkey.asc\n> > > skype: gregn1\n> > > (authorization required, add me to your contacts list first)\n> > > \n> > > - --\n> > > Free domains: http://www.eu.org/ or mail dns-manager@EU.org\n> > > -----BEGIN PGP SIGNATURE-----\n> > > Version: GnuPG v1.4.6 (GNU/Linux)\n> > > \n> > > iD8DBQFGfCdV7s9z/XlyUyARAhQoAKC2pAxtaBHQFbcRxJ7X3YAKxDtHqwCg1nOM\n> > > uSZ2tei1eRwXa/lpYrCpqgg=\n> > > =UAdR\n> > > -----END PGP SIGNATURE-----\n> > > \n> > > _______________________________________________\n> > > Speakup mailing list\n> > > Speakup@braille.uwo.ca\n> > > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> > \n> > \n> > _______________________________________________\n> > Speakup mailing list\n> > Speakup@braille.uwo.ca\n> > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}