{"category": "ham", "to_address": "perl6-language@perl.org", "from_address": "chromatic <chromatic@wgz.org>", "subject": "Re: Is Perl 6 too late?", "body": "On Monday 14 May 2007 04:28:15 Thomas Wittek wrote:\n\n> > I'm not a friend of potential conflicts between built-in operators and my\n> > identifier names (and especially the conflicts between scalar, aggregate,\n> > type, and function names).\n\n> As I partially wrote Moritz, I\n> a) don't think that it's the case very often. you have to write the\n> sigil a thousand times where it wouldn't be useful for only 1 case where\n> you'd have a name conflict.\n> b) even if there would be a conflict, it might be considered bad style\n> to use identical identifiers (besides the sigil) for different things\n> (vars/objects/subs/operators/...).\n\ntheproblemlinguisticallyspeakingisthatsometimespunctuationishighlyimportant\\ \nfromareadabilitystandpointyoumaynotliketheuseofspacescommasdashesupper\\\ncasinghyphensandperiodsbutitmakesatremendousdifferencetoreadabilitywhether\\\nyoulikeitornotasitmaybebadstyleifyoudontputspacesbetweentwowordsandtheresult\\\nlookslikeawordthatsomeonemaydefineinthefuture\n\nThere *are* a few linguists involved in Perl.\n\n> So semicolons don't seem to be the best invention since sliced bread.\n> There should be extra-syntax for the rare cases (multiline) and not for\n> the common ones.\n\nSomehow English seems to get by with periods at the ends of statements, though \nalmost no one pronounces them.\n\n> But I don't like doing implicit type casting with operators.\n> It's even discouraged in Perl5 as we have a warning for that.\n> So maybe it'd be a good idea to completely drop it.\n\nI can't really see that changing DWIM to DWTWM is anything but a step \nbackwards in Perlishness.\n\n> >> People not only want code that _is_ sexy, but they also want it to\n> >> _look_ sexy.\n\n> At least almost everyone to whom I said, that I do most work in Perl,\n> responded with some sentence containing the word \"ugly\" or \"unreadable\".\n> To get away from that image, it's neccessary to do some radical changes\n> I think.\n\nI agree.  You need less ignorant colleagues.  I'm not sure Perl 6 can fix \nthat.\n\nBy the way, I'm still waiting to meet your cadre of Dylan hackers.\n\n-- c\n\n"}