{"category": "ham", "to_address": "IP-Health <ip-health@lists.essential.org>", "from_address": "Benjamin Krohmal <ben.krohmal@keionline.org>", "subject": "[Ip-health] Congress Daily on FTAs & Thailand", "body": "Congress Daily\nBy Martin Vaughan\n\nTRADE\nNew Language Would Give Developing Countries Leeway On Pharmaceuticals\n\n      New language to be added to trade agreements is designed to\ngive poor countries more leeway to get around patent and other\nrestrictions on pharmaceuticals, by going further than the\nflexibility already included in side letters to agreements with Peru\nand Panama, according to House and private sector sources.\n      The new text, in the final stages of discussion between\nDemocrats and U.S. trade officials, will bring exceptions to\nintellectual property rules closer in line with the 2001 Doha\nDeclaration on those rules and public health, these sources said.\n      That declaration aimed to make sure that developing countries\ncould take steps to protect public health, including issuing\ncompulsory licenses to override patents.\n      A bipartisan, conceptual agreement struck between lawmakers and\nthe administration in May provided that the side letter, which has\nbeen a part of free-trade deals since the U.S.-Morocco trade\nagreement, will be incorporated into the text of agreements with\nPeru, Panama, Colombia and South Korea.\n      Democrats have long pushed for that step because they argue\nthat side letters do not carry the same legal weight and\nenforceability as agreement text.\n      The conceptual deal also envisioned making direct reference to\nthe Doha Declaration in the text of trade agreements. But sources\nsaid it is likely the text will also alter the wording of the side\nletter to make it more closely match that of the declaration -- a\nstep that pharmaceutical firms have pressed U.S. officials to oppose.\n      \"Simply taking the side letter and plugging it into the text of\nthe agreement was fine with us,\" said one industry source. \"If there\nare changes, we will have to see what the changes are.\"\n      The side letter to the U.S.-Peru deal on exceptions for public\nhealth states that the agreement's provisions \"do not affect a\nParty's ability to take necessary measures to protect public health\nby promoting access to medicines for all, in particular concerning\ncases such as HIV/AIDS, tuberculosis, malaria, and other epidemics as\nwell as circumstances of extreme urgency or national emergency.\"\n      House Ways and Means Trade Subcommittee Chairman Sander Levin,\nD-Mich., persuaded U.S. trade officials to drop the word \"necessary\"\nfrom that formula, which does not occur in the related section of the\nDoha Declaration, sources said.\n      Public health advocates have also urged striking the language\nregarding \"circumstances of extreme urgency or national emergency,\"\nwhich could be seen as limiting situations in which Doha\nflexibilities can be applied. However, that language will remain in\nthe FTA text.\n      Intellectual property and health provisions were among the\nfinal sticking points in negotiations between Levin, Ways and Means\nChairman Rangel, and the administration on the final text, which also\nincluded labor, environmental, and investment provisions.\n      That text has still not been completed, but U.S. trade\nofficials are hoping to finalize it in time for agreements with\nPanama and South Korea to be signed next week.\n      Health activists said the new language stressing the primacy of\nthe Doha Declaration is important, because the side letter left\nambiguity as to whether obligations to protect pharmaceutical test\ndata in the deals would keep needed medicines from coming to market,\neven after a country had broken patents on the drugs.\n      \"Where the rubber hits the road is on data exclusivity and\ncompulsory licensing,\" said Robert Weissman, director of Essential\nAction. \"The question is: Is data exclusivity going to be an\neffective prohibition on compulsory licensing?\"\n      Activists and their Democratic allies have long pushed the\nadministration to back off the more stringent protections for brand-\nname drugs in trade deals -- including the requirement that countries\nprevent test data from being used to bring generics to market for a\nfive-year period after the brand-name version has been registered.\n      \"If the U.S. is able to get more and more countries to adopt\nthese standards, it becomes increasingly difficult for the remaining\nones to resist doing more than [multilateral agreements] require,\"\nsaid Weissman.\n      The issue has taken on increased importance with recent moves\nby Thailand and Brazil to issue compulsory licenses to manufacture\ngeneric versions of treatments for HIV/AIDS and other afflictions.\n      Thirty-five House Democrats led by Reps. Henry Waxman of\nCalifornia and Tom Allen of Maine Wednesday criticized Trade\nRepresentative Schwab in a letter for naming Thailand a \"priority\nforeign country\" in the trade office's annual list of intellectual\nproperty rights violators. They called on Schwab to reverse that\ndesignation.\n      \"It is difficult to interpret this decision as anything other\nthan retaliation for Thailand's recent actions. It sends a troubling\nmessage, not only to Thailand but to the whole world, that the\nexercise of recognized public health flexibilities in trade\nobligations is frowned upon by the United States,\" the lawmakers wrote.\n      The House Democrats wrote that they were concerned that the\n\"Special 301\" citation would lead to a suspension of duty-free\nbenefits for Thailand under the Generalized System of Preferences.\n\n\n\nBenjamin Krohmal\nCoordinator - Project on Medical Innovation\nKnowledge Ecology International\nTel: +1-202-332-2670 ex. 17\nFax: +1-202-332-2673\nben.krohmal@keionline.org\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}