{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: Request for suggestions of DFSG-free documentation licences", "body": "\"Jordi Gutierrez Hermoso\"  wrote:\n> On 05/06/07, MJ Ray  wrote:\n> > > Small excerpts (e.g. an Emacs reference card from the Emacs info docs)\n> > > are probably covered under Fair Use. [...]\n> >\n> > This is England calling.\n>\n> Would the FSF have to sue under US law or UK law an offender in the\n> UK? I'm genuinely ignorant about this issue.\n\nOthers know better on the \"have to\" but if I can't show permission\nfrom the copyright holder that's valid under English law, I believe\nit's possible to be charged with a criminal offence (s.107 CDPA 1998\nc.48).  I still need to beware English law, never mind where FSF sues.\n\n> > poison pill invariant sections\n>\n> Huh? Poison pill?\n\n    As long as you can connect it with one of the six subjects allowed\nto make something invariant, you can make any topic off-limits for\nyour text.\n\n    For GNU statistical software for example, this seems very easy to\ndo. Imagine starting the appendix \"I first started to use this\nsoftware after someone used it to illustrate the spurious climate\nchange relationship, which is wrong because...\" You could probably do\nsomething similar for almost any topic. (Given the waste of paper\ncaused by these adverts, it could be a climate-change double-whammy.) \n\n> > and inability to fix some sections.\n>\n> What do you want to fix? The reasons for why free software needs free\n> documentation or would you like to fix the suggestions on how to give\n> funds to the FSF? You think you know better than the FSF what funds\n> the FSF needs?\n\nNo, but it may be necessary to update donation details (it may be more\ntax- and fee-efficient to pass donations through a body local to the\nrecipient), or change the wordings for things where soliciting\ndonations has to be done in a certain way to be legal.\n\nFor one more general example, many charity laws have limits on \"Acting\nwith other bodies\" and political activities, which may limit what\ninvariant sections they can publish.  Why should charities be hindered\nin publishing and reusing free documentation?\n\n> [...] But it's Debian who\n> insists on calling Wikipedia a software distributor (and I'm not\n> referring to Wikimedia, I'm referring to Wikipedia's content). Since\n> Debian wants to call every bitstream \"software\", then it feels like it\n> can apply the DFSG to every bitstream.\n\nWe are not alone.  One example:\n\n\"We can't depend for the long run on distinguishing one bitstream from\nanother in order to figure out which rules apply.\" -- Eben Moglen, in\nFree Software and the Death of Copyright.\n\nNot that it matters:\n\n    If you agree with me that documentation can be software, you\nshould oppose FSF promoting this non-free software licence.\n\n    If you agree with FSF that only programs are software, you should\noppose FSF promoting this non-software licence.\n\n    I also think it's tactically inept that FSF rewards legacy\npublisher corporations (some of whom were among the creators and early\nsupporters of Open Source, and sought to marginalise RMS) with a\nlicence that preserves their business model. \n\nHope that explains,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}