{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "Direct2Drive <owner-d2d_cp_announce_list@news.ign.com>", "subject": "Celebrate Memorial Day with Direct2Drive!", "body": "\n\n\nDirect2Drive\n\n\n\n\n\n\n\n\nMay 25th, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArmA: Armed Assault - Combat Operations - $39.95\nArmA is a first person tactical military shooter with large elements of realism and simulation. This game features a blend of large-scale military conflict spread over large areas alongside the more closed quarters battle...\n \nCompany of Heroes - $39.95\nExperience the cinematic intensity and the courage and bravery of the heroes that defined a generation, set against the backdrop of the most dynamic battlefield ever seen in a game... \n \nSilent Hunter: Wovles of the Pacific - $49.95\nHunt, hide and kill as you take command of U.S. submarines and crews and navigate the treacherous waters of the Pacific during WWII.\n\n\n \n \n \n \n \n\n\nCall of Duty 2 - $29.95\nCall of Duty 2 redefines the cinematic intensity and chaos of battle as seen through the eyes of ordinary soldiers fighting together in epic WWII conflicts.\n \nBattlestations: Midway - $39.95\nPrepare for a totally new combat experience as you fight massive air, sea and undersea battles in WWII's Pacific theatre in direct command of multiple warships, planes and submarines in this epic solo and online tactical action game. \n \n24 Season 6  - $39.95\nGet the entire latest season and watch it all now!\n\n\n \n \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\nArmA: Armed Assault\n$39.95\n6\n\n\n24 Season 6 Episode 24\n$1.99\n\n\n2\n\n\nNeverwinter Nights 2\n$29.95\n7\n\n\nThe Matrix Online\n$19.99\n\n\n3\n\n\nVampire: The Masquerade - Bloodlines\n$19.95\n8\n\n\nCompany of Heroes\n$39.95\n\n\n4\n\n\nSupreme Commander\n$39.95\n9\n\n\nSTALKER: Shadow of Chernobyl\n$39.95\n\n\n5\n\n\n24 Season 6 Season Finale\n$1.99\n10\n\n\nES4 Oblivion: Shivering Isles\n$29.95\n\n\n\n\n\n\n\n\n\nTo Unsubscribe: Click Here.\n\t\t\t\nYou have received this e-mail because you are a registered user of GameSpy and have opted-in to receive GameSpy email updates concerning new products and services. If you believe you're receiving this e-mail in error or prefer not to receive promotions from GameSpy.com, reply to this message to opt out of future promotional mailings. Our privacy policy is viewable at http://corp.igngamespy.com/privacy.html. You may still receive other e-mails from GameSpy. To update your e-mail address or manage your account, visit GameSpyID.com. It may take up to 10 days for adjustments to your email preferences. If you have questions about this offer or your services, you can reach Customer Service here.\n\t\t\n\t\tYou may mail inquiries to: IGN Entertainment, Inc., 8000 Marina Boulevard, 2nd Floor, Brisbane, CA 94005\nCopyright © IGN Entertainment, Inc. All rights reserved.  \n\n\n\n\n\n\n\n\n\n\n\n\n"}