{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Terry Therneau <therneau@mayo.edu>", "subject": "Re: [R] \"R is not a validated software package..", "body": " I've been on vacation and so come late to this interesting discussion.  Let\nme add two minor points.\n\n  1. I have run into a lot of statements that \"x is required\" when dealing\nwith pharma, and in particular wrt NDAs (new drug application).  Almost all\nwere false.  But I also understand a bit of where they are coming from.  An\nNDA costs millions, with the required trials, and is a huge submission in\nterms of the sheer amount of paper.  If a company's last NDA was successful,\nthere is a lot of draw to make the next one as much like it as possible, down\nto the font size and the margins.  \n  So  I agree with Frank that \"SAS is validated\" is a false requirement, yet\nremain somewhat sympathetic to the person who said it.\n\n  2. We have been audited once on a portion of an analysis.  The official said,\nmore or less, \"show us how you got that answer\" while pointing at a part of\nthe report.  That particular analysis happened to be done in SAS, but what\nwas important was our ability to quickly find the relevant code, not the\npackage.  \n\n  3. If the other party is stubborn about SAS vs S, I have one example I like\nto argue with.  The S survival code has an extensive test suite, including\na set of small examples where I have worked out the correct results by hand.\nMany of these latter are documented in the appendix of the Therneau and\nGrambsch book.  The SAS phreg procedure does not pass all the tests.  (Cox\nmodel + Efron approx for ties + deviance residuals for one.  The size of\nthe error is numerically insignificant, a 1/n vs 1/(n-1) type of thing: but\nit leads to slightly different robust standard errors).\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}