{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Morning HTML\" <cbsnews_weekday_morning_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 27, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESTahoe Wildfire Outlook Is Grim\nWinds of up to 30 miles an hour were forecast for today, after a flareup of the California blaze yesterday. It's already destroyed\n                        nearly 200 homes and more than 3,000 acres, and it's only 44 percent contained. More...Watch: Tahoe Wildfire Threatens Again\n• Steroids Found In Dead Wrestler's Home\n                     \t\t\t\t\t| Watch• Blair Era Ends In Britain\n                     \t\t\t\t\t| Watch• Girl Stable After Feet Severed On RideU.S.Girl Stable After Feet Severed On Ride\nA 13-year-old girl whose feet were chopped off in an accident on an amusement park ride at Six Flags last week is in stable\n                        condition in a Nashville, Tenn., hospital, her family said in a written statement. More...\n• Steroids Found In Dead Wrestler's Home\n                     \t\t\t\t\t| Watch• Tahoe Wildfire Outlook Is Grim\n                     \t\t\t\t\t| Watch• Cops: Pro Wrestler Killed Family, Self\n                     \t\t\t\t\t| Watch• More StoriesWorldBlair Era Ends In Britain\nTony Blair has faced fellow lawmakers for the last time as Britain's prime minister, answering some tough questions, but receiving\n                        a fair share of praise, even from his political opponents. Chancellor Zombie Brown is set to take over the top job. More...Watch: No. 10 Downing St. Vacated \n• Gas Rationing Raises Iranian Ire• Bush: Blair Was No Poodle\n                     \t\t\t\t\t| Watch• Murder Suspect Dies On Stand In Italy• More StoriesPoliticsPoll: Young Voters Favor Obama, Clinton\nEven at this early stage, young voters are tuning in to the 2008 presidential race, according to a poll by CBS News,\n                        The New York Times and MTV. Barack Obama and Hillary Clinton have generated the most excitement among 17- to 29-year-olds. More...\n• Elizabeth Edwards To Coulter: Stop Attacks• 2 GOP Senators Assail Bush's War Strategy\n                     \t\t\t\t\t| Watch• Immigration Bill Passes Key Senate Test\n                     \t\t\t\t\t| Watch• More StoriesHealthAlzheimer's Patients Sue U.K. For Drugs\nAlzheimer's advocacy groups and patients are suing Britain's socialized health care system for access to early-stage treatment\n                        that the government ruled was largely ineffective. One patient says the drugs allowed him to \"rebuild his life\". More...\n• Diabetes Linked To Alzheimer's Disease• Disabled NFL Players Tell Woes To Congress\n                     \t\t\t\t\t| Watch• Chatty Doctors Waste Office-Visit Time• More StoriesSciTechiPhone Not The Only New Kid On The Block\nAdd another surfer to the frenzy over new phones that can do heretofore unheard of tricks: T-Mobile is out with a service\n                        using phones that can switch from WiFi to cellular service, and back again.  Larry Magid reports. More...\n• iPhone Sneak Peek• Google Wants Eyes On Microsoft• Calif. Seeks Solution To Radioactive Waste• More StoriesBusinessiPhone Monthly Service Charges Unveiled\nAT&T's service plans for the Apple iPhone will cost $59.99 to $99.99 a month, the companies said. The phone is slated to go\n                        on sale at 6 p.m. local time Friday at Apple and AT&T stores as well as Apple's Web site. More...\n• Dow Jones, News Corp. Inch Closer To Deal• Venezuela Expands State Control Of Oil• New Home Sales Drop Again In May\n                     \t\t\t\t\t| Watch• More StoriesEntertainmentRosie Explains Controversial Photo\nRosie O'Donnell's photo of her daughter playing a child's game of make-believe dressed as a soldier has caused an uproar on\n                        her blog. More...\n• Paris Spends Newfound Freedom With Family\n                     \t\t\t\t\t| Watch• Big Day In MLB For Older Pitchers• Nancy Grace Is Married, Pregnant• More StoriesOpinionYou Don't Look A Day Over 900\nSpecial Contributor Lloyd Garver looks at claims that the sky is the limit for life expectancy. More...\n• Poll: Young Voters Favor Obama, Clinton• What Would Lincoln Do?\n                     \t\t\t\t\t| Watch• Calling Cheney's Bluff\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: iPhone Sneak Peek\nUSA Today personal technology columnist Ed Baig has had hands-on experience with the much-hyped device, and says it's \"pretty\n                        cool.\" Its hype, he adds, has been \"remarkable.\" He offered a review, on The Early Show. More...\n• 48 Hours: Memory Of Murder\n                     \t\t\t\t\t| Watch• CBS Evening News: \"Brown\" Celebrates 100th Birthday\n                     \t\t\t\t\t| Watch• EARLY SHOW: Quick Tips To Avoid Money Problems\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\niPhone Sneak PeakHannah Storm gets a sneak peak of Apple's much-anticipated iPhone from USA Today's technology columnist, Ed Baig.\nTOP VIDEOS\nNo. 10 Downing St. Vacated \nCapitol Bob On Sen. Lugar\nTahoe Wildfire Threatens Again\nDestructive Southwest Storms\nMoneyWatch\nHealthWatch\nCIA Reveals Cold War Secrets\nTahoe Residents Glimpse Damage\nDebunking Al Jazeera\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesA Rwandan genocide survivor recalls her tale of survival. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMemory Of Murder:Cops say a mother implicated her son in a brutal murder; she says they are dead wrong. Tuesday,\n                           10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}