{"category": "ham", "to_address": "\"General Copyright Discussions (questions, organizing,\n\tetc)\" <discuss@list.digital-copyright.ca>", "from_address": "Darryl Moore <darryl@mfe.ca>", "subject": "Re: [d@DCC] Mixed feelings about \"DVD DRM row sparks user rebellion\"", "body": "Russell, you are right, but your wrong.\n\nIn particular, you think that what happened at Digg will only be of \nvalue if it translates into some political action, without realizing \nthat what happened at Digg WAS A POLITICAL ACTION. It was the most basic \ngrass roots political action on earth. People were taking direct action \nto influence policy that they felt strongly about.\n\nIt is direct democracy. And while in this case it is directed at the \npolicies of an organization of which they are members, it is also \napplied to our country as well. Why do you think so many people flout \nthe law and download movies and music so openly?\n\nI think events like this one if seen by the country's politicians will \nmake them stand up and take note of just how much we will allow our \nfreedoms to be limited.\n\nDo not under estimate the power of civil disobedience. We need more of \nthese events. They are no less powerful then the Parliamentary petitions.\n\ncheers,\ndarryl\n\n\n\nRussell McOrmond wrote:\n> \n>    As most of you will have heard, the 32-character code string containing\n> the so-called \"HD Processing Key\" is being widely published, and even\n> brought Digg to a standstill yesterday as they had to re-evaluate a\n> policy.\n> \n> http://www.digital-copyright.ca/node/3916\n> \n>    Why the mixed feelings?  The fact that it impacted Digg's policies and\n> has generated so much publicity demonstrates how important this issue is\n> to people.  This is a key that can be used to unlock the harmful\n> anti-interoperability used by some copyright holders to impose\n> hardware/software choices on their audiences.  Opposing this imposition\n> seems to resonate with many people.\n> \n>    As interesting as the media attention is, I don't know if any long-term\n> positive impact can come out of it if it doesn't translate into political\n> action.  We have a petition that deals specifically with this issue that\n> has thus far only a little over 200 signatures to it.  If a fraction of\n> the Canadians who were likely involved in that Digg storm were signing and\n> getting all their friends to sign our petition, we could have a major\n> impact.\n> \n>    So far we haven't had the impact we could if we could leverage the\n> number of people who seem concerned.\n> \n> \n>    Politicians are only hearing one side of the story.  They hear from\n> incumbent content industry associations who see all new media (the\n> technology, as well as the new incentive models such as peer production or\n> user generated content) as a threat.  They hear from the US government\n> agencies (USTR, USPTO, US embassy) acting as if they were part of the\n> content industry lobby.  The bogus Special 301 report seems to be\n> receiving traction, and Canada seems to be wanting to appease these folks.\n> \n>    Our politicians barely hear from us, and thus are unaware of the massive\n> harm to Canadian creativity and innovation that results from the types of\n> policies these incumbents are pushing.\n> \n>    They need to hear from us.  Petitions are one way, as is escalating\n> through meeting with MPs.  Send them a letter, and ask to meet with them.\n> If you don't have time to meet with them, then ask your MP if they would\n> be willing to meet with me.\n> \n> \n> \n>    Any other thoughts on how to move things forward?  Things seem quiet at\n> the moment, but we are likely to see a new Copyright bill very soon which\n> is rumoured to make C-60 look great in comparison.\n> \n> Thanks.\n> \n> \n> -- \n>   Russell McOrmond, Internet Consultant: \n>   Please help us tell the Canadian Parliament to protect our property\n>   rights as owners of Information Technology. Sign the petition!\n>   http://www.digital-copyright.ca/petition/ict/\n> \n>   \"The government, lobbied by legacy copyright holders and hardware\n>    manufacturers, can pry my camcorder, computer, home theatre, or\n>    portable media player from my cold dead hands!\"\n> _______________________________________________\n> Discuss mailing list\n> Discuss@list.digital-copyright.ca\n> http://list.digital-copyright.ca/mailman/listinfo/discuss\n> \n\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}