{"category": "ham", "to_address": "debian-desktop@lists.debian.org", "from_address": "Michael Banck <mbanck@debian.org>", "subject": "Re: A common Debian style for Debian Installer and the desktop", "body": "Hi,\n\nOn Tue, Jun 12, 2007 at 11:49:10PM +0200, Frans Pop wrote:\n> The current desktop theme is fine for the desktops. For the desktop a \n> theme basically has a background function and should not be too \n> intrusive. It also has to fit with the style of the desktop itself (i.e. \n> GNOME or KDE).\n> \n> The installer is totally different: it is a completely separate piece of \n> software and is also probably the only thing in Debian that is totally \n> and uniquely \"Debian\". As such it needs a much stronger identity.\n> \n> * The light blue of the desktop theme really is too weak for the \n> installer, especially in combination with the grey general background. \n> The contrast between the blue and grey is just not strong enough and this \n> makes the whole user interface look weak.\n> * As the installer is so uniquely Debian, it needs a much stronger tie \n> with the official Debian logo. That means that it needs to include the \n> *red* swirl and the *red* \"dot\" on the i in \"Debian\" (and in the correct \n> font).\n> * A theme for the installer needs to fit the constraints for the \n> installer. These include low memory usage (avoid too complex graphics, \n> keep file sizes low and no unnecessary icons), the resolution and color \n> depth it is run in, and the fact that info text can be displayed in the \n> banner area (for example in rescue mode).\n\nI agree totally.\n\nMoreover, I think the current d-i appearance is really nice (except\nmaybe for the non-aligned language/country selection dialog) and\ncombining the current desktop theme with it would not work.  The most\nimportant concern from my side is that d-i uses the default Gnome GTK\nengine which has been vetted by the Gnome usability guys.\n\nIf we should decide to have a new desktop artwork for lenny, we could\nconsider mentioning artists /could/ think about integrating their\nartwork with the installer under the constraints you mention, but I\ndon't think the installer should be held hostage here - if the lenny\ndesktop theme does not work for the installer, so be it.\n\n\nMichael\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}