{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tMONDAY 11 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER KAVITA PURI\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nA Newsnight exclusive tonight:\n\n\nWe have an incredible interview with the former wife of a British Muslim extremist. She tells us how her husband tried to persuade her to carry out a suicide attack in the UK. She explains in detail how her husband showed her how to wear an explosive belt. We'll be discussing how such extremism can be tackled.\n\n\nIraq Inquiry\n\n\nThe Conservatives are calling for a full inquiry into the war in Iraq. Gordon Brown, visiting Baghdad today, said it would be wrong to hold an inquiry now while British troops are still serving in Iraq. We'll be debating the issue. \n\n\nIranian Influence in Afghanistan\n\n\nA high tech \"shaped\" bomb has been found in Kabul today. These are similar to the ones used in Iraq against Allied vehicles, and the military say could come from Iran. Alastair Leithead reports from Afghanistan on the extent of Iran's influence in the country.\n\n\nDog Eat Dog World \n\n\nHow many dogs should you be allowed to walk on the pavement at one time? Kensington and Chelsea have issued a by-law saying no more than two. That's just barking mad say some residents. We visit some of the richest streets in the country and meet Tory activists who are furious at the dogmatic approach taken by their Conservative council.\n\n\nDo join Jeremy at 10:30 tonight.\n\n\nKavita\n\n\nMissed Newsnight Review?\n\nClick here to watch online\n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}