{"category": "spam", "to_address": "<info_web543@bellsouth.net>", "from_address": "Mr Clapp Paki <info_web543@bellsouth.net>", "subject": "INTERNATIONAL TRUSTEE NEEDED IN YOUR REGION!!!", "body": "China Abrasives Import & Export Corporation(CAIEC) \nChina Abrasives Import and Export Corporation (CAIEC) is the specialized foreign trade company, which chiefly engages in exporting and importing abrasives raw materials, abrasives finished products and relevant machinery and equipment. The corporation has its head office in Zhingzhou , Henan province, its branch in Shenzhen, Hainan, branch office in Shanghai, Qingdao, liaison offices in Beijing, Tianjin, Xiamen.\n \nHello ,\nWe are not going to request any money from you in this notable transaction.\nIt is my pleasure to write you in respect of our organization.\n\nWe are searching for reliable representatives who can help us establish a medium of getting to our customers in Asia, Europe and America as well as legally receiving cash and all forms of payment on our behalf from them as our Representative.\n\nPlease if interested in transacting business in view of helping us, so our clients could be making payment to you as our representative, we will be very glad.Compensations will be given and other benefits. You will be entittled to 10% of every payment made through you. payment will be made via your Bank account.\n\nContact us for more information, if this proposal is acceptable to you. Please get back to us, so that remuneration can be worked out for your services as\nour representative in North America as your location shall determine. For further information and enquiries,write (clapppaki11@yahoo.com.cn)\nSend us your full name , mailing address and your telephone number.\nWe anticipate your earliest response in this regard.\nThanks, \n\nNos:+44-702-403-5414 \n\n1)Your Names In Full,\n2)Current Residential Address,\n3)Private Phone/Fax Numbers,\n4)Occupation,\n\nYour earliest response to this letter will be appreciated. \n \nMr Clapp Paki\nSecretary. China Abrasives Import & Export Henan Company \n(www.allproducts.com/prc/abrasives/showroom1.html ).\n\n\n"}