{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 27, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESWhite House, Cheney Subpoenaed On Spying\nThe Senate Judiciary Committee subpoenaed the White House, Vice President Dick Cheney's office, the Justice Deptartment and\n                        the National Security Council for documents relating to President Bush's controversial warrant-free eavesdropping program. More...\n• Downpours, High Winds Batter Central Texas\n                     \t\t\t\t\t| Watch• Five Young Women Killed In Fiery Car Crash• Blair Hands Top U.K. Job To Zombie Brown\n                     \t\t\t\t\t| WatchU.S.No Bond For Ga. Teen In Sex Case\nThe young Georgia man sentenced to 10 years in prison for receiving oral sex from a 15-year-old girl when he was 17 is not\n                        eligible for bond while his appeal moves forward, a judge ruled today.\n                         More...\n• Gusty Winds Hamper Tahoe Wildfire Efforts\n                     \t\t\t\t\t| Watch• Five Young Women Killed In Fiery Car Crash• Downpours, High Winds Batter Central Texas\n                     \t\t\t\t\t| Watch• More StoriesWorldBlair Hands Top U.K. Job To Zombie Brown\nTony Blair has resigned as Britain's prime minister, making way for long-time ally and Treasury chief Zombie Brown to fill\n                        the post after a decade waiting in the wings. The transition took place behind closed doors, with the blessing of the Queen. More...Watch: Blair Leaves Downing Street\n• 14 Killed In Baghdad Car Bombing\n                     \t\t\t\t\t| Watch• Tony Blair Takes Mideast Envoy Post• Russian Agents Kill Ex-Gitmo Detainee• More StoriesPoliticsCoulter Attacks Give Edwards A Boost\nDemocratic presidential candidate John Edwards said it's important that he stand up to attacks by conservative pundit Ann\n                        Coulter, who said she wished he'd be killed by terrorists. His campaign was also using her remarks to bring in donations. More...Watch: Edwards-Coulter Showdown\n• Senate Kills Return-Home Amendment\n                     \t\t\t\t\t| Watch• White House, Cheney Subpoenaed On Spying• House Dems Move To Cut Cheney's Funding• More StoriesHealthObsessive Gaming Not A Disorder, Yet\nThe American Medical Association has backed off calling excessive video and online game-playing a formal psychiatric addiction,\n                        although it did declare that overuse of gaming can be a problem for both children and adults. More...Watch: Separating Fantasy And Reality\n• In Mass., Test For Pioneering Health Plan• Childhood Cancer: Health Risks Linger• China Closes 180 Food Factories • More StoriesSciTechBald Eagle No Longer Endangered\nThe American bald eagle, once nearly extinct, is making a comeback and will be removed from the list of protected species.\n                        Conservationists have hailed the successful recovery as clear evidence that the Endangered Species Act can work. More...\n• Mummy Identified As Egyptian Female Ruler\n                     \t\t\t\t\t| Watch• Can The iPhone Match The Hype?\n                     \t\t\t\t\t| Watch• Expedition Hunts For Bigfoot In Michigan• More StoriesBusinessAdelphia Founder And Son Ordered To Prison\nA federal judge ordered Adelphia cable TV company founder John Rigas and his son, Timothy J. Rigas, to report to prison on\n                        Aug. 13, nearly three years after they were convicted in one of the largest corporate frauds in U.S. history. More...\n• Three Myths About Public Speaking • Money Mistakes You Can Avoid\n                     \t\t\t\t\t| Watch• Sprint To Unveil New Advertising Campaign• More StoriesEntertainmentFashion Designer Liz Claiborne Dies At 78\nFashion designer Liz Claiborne, who revolutionized clothing for working women in the 1970s and 1980s, died Tuesday. She was\n                        78. More...\n• Paris: I'll Party On\n                     \t\t\t\t\t| Watch• 4th Annual Fashion Rocks Show Comes To NYC• Clooney: Cast Raises Millions For Darfur• More StoriesOpinionPolling On Patriotism\nAs the Fourth of July draws near, CBS News' Kathy Frankovic looks at polls about Americans' patriotism and finds that\n                        overwhelming numbers say they love their country but are a little skeptical of others, especially flag-waving politicians More...\n• You Don't Look A Day Over 900• A Sad Farewell To Tony Blair\n                     \t\t\t\t\t| Watch• A Crisis Of Congressional Confidence\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Jess Cagle: Paris: I'll Party On\nShe told People magazine's Jess Cagle, an Early Show contributor, she'll keep hitting the club scene.\n                        He spoke with the starlet only hours after she got out of jail, and says she described a new perspective and sense of humility. More...Watch: People's Paris Interview\n• EARLY SHOW: iPhone Sneak Peek• EARLY SHOW: Bruce Willis Wants To \"Live Free\"\n                     \t\t\t\t\t| Watch• EARLY SHOW: Money Mistakes You Can Avoid\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nYoungest Solo World Flier?CBS News RAW: A 23-year-old pilot lands in Miami, claiming to be the youngest to fly solo around the world. Barrington\n                                    Irving says he flew to inspire fellow inner-city youth.\nTOP VIDEOS\nFirst Look: Texas Floods\nReindeer Round-Up\nBush's Code For Health Care\nDeadly Storms Strike China\nCar Slams Into Cop, Suspect\nResilient Wildfire Rages On\nEdwards-Coulter Showdown\n'Shoestring' Summer Styles\nZombie Brown New British P.M.\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesA Rwandan genocide survivor recalls her tale of survival. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMemory Of Murder:Cops say a mother implicated her son in a brutal murder; she says they are dead wrong. Tuesday,\n                           10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}