{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWEDNESDAY 2 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER ROBERT MORGAN\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nLOCAL ELECTIONS\n\n\nIt's the last day of election campaigning across the country. Last night we looked at Labour and the SNP's prospects. Paul Mason will be in the Midlands tonight looking at what would constitute a good night for the Tories and LibDems. And we're hoping to speak to a member of the shadow cabinet and LibDem front bench team live.   \n\n\nWe'll also be speaking to the Leader of Plaid, Ieaun Wyn Jones about his hopes in the elections tomorrow.\n\n\nCREVICE\n\n\nTony Blair has again ruled out holding an independent inquiry into the suicide bombings in London on the 7th of July 2005. The Conservative leader, David Cameron said at Prime Minister's questions that one was needed to get to the truth of the matter. We're still chasing new lines in this story. Watch this space. \n\n\nISRAEL \n\n\nIsrael's foreign minister, Tzipi Livni, says she'll challenge the country's prime minister, Ehud Olmert, for the leadership of their party.  She says she's urged him to resign in the wake of a scathing report into Israel's conflict with Hezbollah last year. We'll have the latest. \n\n\nIRAQ \n\n\nGeneral Sir Michael Rose says, in a new book, that the US is in danger of making the same mistakes with insurgents in Iraq as the British made 200 yrs ago in the War of Independence. He will be in debate live with a former senior advisor to President Bush. \n\n\nFRANCE\n\n\nWe have a French election piece with a twist. On the night of the Sarkozy and Royal TV debate we have a film from Madeleine Holt. As France prepares for the second round of its crucial Presidential election, the debate has centred on how French society needs to change. But few would have predicted one new and critical voice entering the fray - the French cultural attaché to Britain. Yet Sophie Claudel says its time for the French to be more self-critical. She thinks they take themselves too seriously, French women hate each other and hardly anyone can cook anymore. To prove her points, she took our Culture Correspondent Madeleine Holt on a road trip round France.   \n\n\nNewsnight is on BBC2 at 10.30pm.\n\n\nRobert\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nCHINESE MATHS PUZZLE\n\n\t\t\t\t\t\t\tNewsnight's Steve Smith investigates a maths challenge from China - and meets the engineer who solved it in his lunchtime. \n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}