{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "drew Roberts <zotz@100jamz.com>", "subject": "Re: [cc-community] Does BY-SA extend to a newspaper?", "body": "On Friday 13 April 2007 01:37 pm, Lawrence Lessig wrote:\n> I am not sure I see how the GFDL solves any perceived problem that BY-\n> SA creates. The GFDL, like every copyleft license I know of, applies\n> its obligation to license beyond the original work only if there is a\n> \"modification.\" It, more over, explicitly permits items to be mixed\n> without the copyleft component being applied to the other works. A\n> photographer concerned that the copyleft rules of the BY-SA don't\n> obligate enough won't get additional obligations from the GFDL.\n>\n> This is indeed why, e.g., Erik, is thinking about a clever\n> modification to the BY-SA scope to apply the obligation beyond\n> derivatives. But until such modifications are added, either to the CC\n> licenses or the GFDL, copyleft licenses will raise this important\n> issue for photographers, and other authors too.\n\nWould you care to comment on my thoughts on a way to deal with this as posted \nhere:\n\nhttp://lists.ibiblio.org/pipermail/cc-community/2007-April/001702.html\n\nAlso, if something like this could work, could the sync rights move over to \nsuch a scheme or could we at least have a more narrowly defined set of \ncircumstances where sync rights are needed?\n\nall the best,\n\ndrew\n\n>\n> On Apr 12, 2007, at 1:23 PM, Benj. Mako Hill wrote:\n> > \n> >\n> >> Nope. Under the license, it only applies to the photo itself in\n> >> the context\n> >> of a newspaper. So they used it correctly.\n> >\n> > CC seems to have a taken a position that the license basically\n> > stops at\n> > the edge of a photograph. Basically, this means that if you don't\n> > modify\n> > the content of a photograph, you can basically do what you want\n> > with it\n> > under an an SA license (of course, Evan's comments, and a few\n> > things he\n> > didn't say, still need to be kept in mind).\n> >\n> > This is one reason a number of photographs who upload to Wikimedia\n> > Commons prefer the GFDL and its related to the reason why Larry Lessig\n> > has analogizing NC clauses and copyleft for software -- although I\n> > personally disagree with Lessig's argument in this respect.\n> >\n> > Regards,\n> > Mako\n> >\n> >\n> > --\n> > Benjamin Mako Hill\n> > mako@atdot.cc\n> > http://mako.cc/\n> >\n> > Creativity can be a social contribution, but only in so\n> > far as society is free to use the results. --RMS\n> > _______________________________________________\n> > cc-community mailing list\n> > cc-community@lists.ibiblio.org\n> > http://lists.ibiblio.org/mailman/listinfo/cc-community\n>\n> ______________\n>\n> Lawrence Lessig\n> American Academy in Berlin\n> Am Sandwerder 17/19\n> Berlin D-14109\n>\n> office: +4930/804 83 301\n> home: +4930/804 83 203\n> cell: +49/1515 907 6197\n> fax: +4930/804 83 222\n> lessig@pobox.com\n>\n> Assistant: a2lessig@pobox.com\n>\n>\n> _______________________________________________\n> cc-community mailing list\n> cc-community@lists.ibiblio.org\n> http://lists.ibiblio.org/mailman/listinfo/cc-community\n\n-- \n(da idea man)\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}