{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "840p 6/9 Update: Shannon pleased with tank; blanket assessed", "body": "\n\n\n\n\n840p 6/9 Update: Shannon pleased with tank; blanket assessed\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 31\nPosted: 8:33 PM, 6/9/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-27 (06/08/07): Atlantis rockets into orbit\n   SR-28 (06/08/07): NASA managers pleased with performance of repaired external tank\n   SR-29 (06/09/07): Pulled up insulation blanket on rocket pod assessed\n   SR-30 (06/09/07): Crew awake; updated FD-2 timeline; rendezvous timeline; TPS inspection on tap\n   SR-31 (06/09/07): MMT reviews initial inspection results\n\n=================================\n\n8:34 PM, 6/9/07, Update: Shannon pleased with tank performance; engineers continue blanket assessment\n\nThe Atlantis astronauts late today used the shuttle's robot arm and a powerful camera on the end of a heat-shield inspection boom to take a close-up look at a pulled up insulation blanket on one of the ship's aft rocket pods.\n\nThe astronauts noticed the protruding blanket on the left-side Orbital Maneuvering System rocket pod during a routine post-launch inspection late Friday. John Shannon, chairman of NASA's Mission Management Team, said late today \"there's not a great deal of concern over it right now, but there's a lot of work to be done and we'll do that in the coming days.\"\n\nA preliminary assessment of ground video and imagery from Atlantis indicates the ship's repaired external fuel tank performed well during the climb to space, with only minor instances of foam shedding and nothing apparent above NASA's critical threshold for causing damage to the shuttle's heat shield.\n\n\"As you remember, there was a lot of concern pre-flight when we had the hail storm in February and it put well over 2,000 divots in the upper part of the tank,\" Shannon told reporters. \"The crew was able to image that very well after the orbiter separated from the tank. The external tank team is looking at that very closely, but from what we can tell so far, we did not lose any of the repairs, everything looked exactly like it should look, it looks like everything stayed in place.\"\n\nThe only obvious bit of foam loss occurred near a 17-inch-wide liquid oxygen feed line near the top of the tank's hydrogen section.\n\n\"We saw a little 6-inch by 3-inch divot by that big feed line that takes oxygen to the main engines,\" Shannon said. \"That is very similar to foam losses we've seen in previous flights. We expect that it will give us some data on the mechanics of why the foam comes off in that area and we can work on improvements in future tanks. This is not any kind of a threat to the vehicle at all, it's just good engineering data.\"\n\nAnalysis of data from C-band and KU-band radars near the launch pad is on-going as is an assessment of data from impact sensors mounted behind the reinforced carbon carbon panels making up the leading edges of Atlantis' wings. Camera mounted in the shuttle's twin booster rockets will be recovered and assessed after the spent casings are towed back to Port Canaveral on Sunday.\n\nShannon said those camera may have captured the moment the foam separated from near the feedline and they may show whether a paper rocket nozzle cover or any other sort of debris hit the protruding insulation blanket on the left OMS pod. The blanket was installed in January and engineers think it more likely that a corner simply pulled away in the airflow.\n\nVideo from the space shuttle's robot arm early today showed a 4-inch-by 6-inch triangular section of the blanket separated from where it butted up against a section of white heat-shield tiles. Close-up pictures later today provided a clearer image, showing the 2-inch-thick blanket intact but folded back in one corner.\n\n\"There's an area on the OMS pod that (is protected by) tile, it has more aerodynamic forces on it, a little bit more heating, then that transitions in a lower-heating area to the blankets and at that transition point, it looks like one corner of one of those thick blankets pulled up a little bit,\" Shannon said. \"It looks like some of the stitching ripped and a corner of that peeled up.\"\n\nEngineers are assessing the blanket to determine what, if anything, might need to be done. On the first shuttle flight in 1981, several tiles on each of Columbia's OMS pods were cracked or missing, but no problems were seen after landing. LIkewise, a blanket lost during another early shuttle flight caused no problems.\n\nBut in the post-Columbia world, NASA takes no chances and Shannon said the protruding blanket seen on Atlantis' port OMS pod will get a thorough engineering analysis to make sure it doesn't pose a threat to the ship or its crew.\n\n\"We have flight history of damage to these OMS pods,\" Shannon said. \"Early in the program, STS-1, we lost some tile material, STS-6, we lost at least one blanket in that area. And for all of those, we do not believe we had any damage at all to the OMS pods.\n\nEven so, he said. \"we're going to go and characterize it and go through our analysis. Every flight, I feel like I'm a broken record. I come in and say 'there's this thing, it doesn't look like a big deal, we're going go do our assessment and see how it turns out.' We'll do the exact same thing on this flight.\"\n\nThe Atlantis astronauts already plan to carry out three spacewalks, Monday, Wednesday and Friday, to connect and activate a new space station solar array, retract another solar panel so it can be moved later and perform a variety of other assembly tasks.\n\nShannon said if necessary, the astronauts could work on the protruding blanket, possibly tucking the material back in and pinning it down or even using a viscous, heat-resistant tile-repair material to fill in the exposed underlying area.\"\n\nBut nothing like that will be planned until engineers complete their assessment of the damage and the likely effects of re-entry aerodynamics and heating on surrounding blankets and the underlying structure of the rocket pod.\n\nThe Atlantis astronauts, meanwhile, are continuing to close in on the international space station, on track for docking Sunday afternoon. During final approach, the station astronauts will photograph the shuttle's belly to look for any signs of impact damage, a routine part of post-Columbia rendezvous procedures.\n\nFor readers interested in looking ahead, a detailed rendezvous timeline is posted on the STS-117 Quick-Look page. A docking preview will be posted early Sunday.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}