{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Jennifer Brewer <extrme_cool@golkin.com>", "subject": "Can't find a good drug store?", "body": "\n\nAre you afraid that she will meet someone who is better than you in bed? \nAll this you can find here\nBuy Licensed and Quality Viagra or Cialis at US Drug store now and you'll be at the top all night long!\nAll this you can find here\nJust buy must have medication called Viagra or Cialis and you'll have unbelievable sex 24/7!!!\nWith best regards,\nJennifer Brewer\n \n \nNo ostalis stoiat, Ozhidaia rasporiazhenij hoziaina, hotia brositsia na menia im oh kak hotelos. Tak vot chto za mutnaia plenka zakryvaet nebo i gasit solnechnyj svet, Ponial nakonec ia. Lesta, Baia, v levyj ugol! Navra, von tot svetochtimyj v sinem s pozolotoj plashche sprava, Kak raz ego snimaet sejchas. Ty ne ochen vezhlivo oboshelsia vchera s moim bratom, inop, oskalilsia Neznakomec, demonstriruia riady ostryh, uzkih zverinyh klykov, useivaiushchih obe Cheliusti. \nMne nuzhen etot chelovek, proshipel-propel chuzhoj. Vozduh stremitelno potemnel. Eti igry zashli uzhe slishkom daleko i Chut ne priveli menia na kraj mogily. Ia nauchilsia hodit Besshumno, kak ten, dvigatsia bystree molnii, raspoznavat opasnost Podsoznatelno eshche do togo, kak ona uspevala sebia proiavliat, i vyryvat u Nee zhalo. On ubil ee, ponial ia, gliadia na bujstvo koldovskogo plameni, polnostiu Zakryvshego prohod. I vse zhe my ranshe ej nogi povydergivaem, uverenno otozvalsia Otshelnik po myslerechi, nakonec-to obretia sposobnost vyskazatsia o tom, chto Ego volnovalo. Mesta u stolba dlia semi zdorovennyh zhivotin Edva hvatilo, dlia etogo ih prishlos raspredelit po okruzhnosti. Priamo sejchas. \nCherez desiatok shagov kamennyj koridor svernul, i glazam otkrylsia svetlyj Priamougolnik vyhoda. Ia vizhu, my poladim. Ty pozvolil sebia ubit. Ia rada, chto Ty spravilsia s zamenoj. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}