{"category": "ham", "to_address": "debian-legal@lists.debian.org, debian-devel@lists.debian.org", "from_address": "Steve Langasek <vorlon@debian.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "On Mon, Jun 04, 2007 at 01:40:17AM +0200, Wouter Verhelst wrote:\n> > You're *not* giving up the right not to distribute any source, because\n> > you can always refrain from distributing the corresponding binaries and\n> > have no obligation to provide source.\n\n> > You're *not* giving up the right to distribute binaries without\n> > distributing the corresponding source, because, without a license, you\n> > would not have the right to distribute binaries in the first place (with\n> > or without source).\n\n> > By accepting the GPL, you instead gain the right to distribute binaries\n> > with source, and you simply do *not* gain the right to distribute\n> > binaries without source.\n\n> Similarly, by accepting the CDDL, you are not giving up the right to\n> choose a venue in case you get sued over the software\n\nIt is a freedom that I have by default; if I accept the CDDL I no longer\nhave that freedom[1].  Therefore it is a freedom that I'm giving up.\n\n> instead, you are simply gaining the right to use, modify, and redistribute\n> the software under a given set of rules (which simply does not include\n> \"the right to choose a court in which to settle disagreements\"). That is\n> what matters, and that is what makes the software free.\n\nNo.  The GPL grants certain additional, limited rights without taking away\nany rights that I already have.  The CDDL grants certain additional, limited\nrights *in exchange for* me giving up a right that I have.\n\n> Even if my argument would be flawed (which I don't think it is, but just\n> in case), that wouldn't even matter. What matters is that DFSG#1 talks\n> about \"a royalty or other fee\"--i.e. money--not \"giving up rights\"; and\n> any interpretation of the text that says it does talk about giving up\n> rights is incorrect to begin with.\n\nGreat, I'll start working on the Indentured Servitude Public License; I\ntrust I can count on your support when it comes time for NEW processing.\n\n-- \nSteve Langasek                   Give me a lever long enough and a Free OS\nDebian Developer                   to set it on, and I can move the world.\nvorlon@debian.org                                   http://www.debian.org/\n\n[1] Technically, not the right to \"choose a venue\", but the right to not be\nsued in a venue where I have no legal presence.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}