{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 29, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESWas London Bomb Plot Heralded On Web?\nCBS News has learned that hours before police dismantled a car bomb in the heart of London's theater district, a message\n                        appeared on one of the most widely used jihadist Web forums: \"Today I say: Rejoice, by Allah, London shall be bombed.\" More...Watch: Expert On British Bomb Scare\n• High Court Will Review Gitmo Cases• Cops Defuse Central London Car Bomb\n                     \t\t\t\t\t| Watch• Cheerleader Crash Driver Had Jr. LicenseU.S.Cheerleader Crash Driver Had Jr. License\nA teenager who was at the wheel during a car crash that killed her and four other recent high school graduates from suburban\n                        Rochester, N.Y., only had a junior driver's license, according to state records. More...\n• No Relief For Rain-Weary Texas\n                     \t\t\t\t\t| Watch• Calif. Wildfires Wane, Some Head Home\n                     \t\t\t\t\t| Watch• High Court Will Review Gitmo Cases• More StoriesWorldCops Defuse Central London Car Bomb\nLondon police have defused a \"potentially viable explosive device\" in a car in the central theater district. Officials say\n                        propane canisters and nuts and bolts were found in car, and the device would have caused significant damage if it had exploded. More...Watch: Expert On British Bomb Scare\n• 5 U.S. Soldiers Killed In Iraq Attack\n                     \t\t\t\t\t| Watch• Was London Bomb Plot Heralded On Web?\n                     \t\t\t\t\t| Watch• Castro: God Protected Me From Bush• More StoriesPoliticsHigh Court Will Review Gitmo Cases\nThe Supreme Court, reversing course, agreed to review whether Guantanamo Bay detainees may go to federal court to challenge\n                        their confinement. In April, the court turned down an identical request. The move is a setback for the Bush administration. More...\n• Debate Showcases Clinton-Obama Rivalry\n                     \t\t\t\t\t| Watch• Dems Decry Desegregation Ruling In Debate\n                     \t\t\t\t\t| Watch• The Truman Test\n                     \t\t\t\t\t| Watch• More StoriesHealthHow To Cut Midlife Heart Disease\nMiddle age isn't too late to cut heart disease if you adopt a healthy lifestyle, say experts. More...\n• U.S. To Stop Some Chinese Seafood Imports\n                     \t\t\t\t\t| Watch• Lupus Drug May Cause Male Infertility• Bush Believes Americans Need More Exercise\n                     \t\t\t\t\t| Watch• More StoriesSciTechMars Rover Ready For Make Or Break Trip\nNASA's aging but durable Mars rover Opportunity will make what could be a trip of no return into a deep impact crater in an\n                        attempt to peer further back than ever before into the geologic history of the Red Planet. More...\n• Amazing Gene Swap Creates Microbe Makeover• House Nixes Auto Industry Mileage Plan• China Is Tops In Greenhouse Gas Emissions\n                     \t\t\t\t\t| Watch• More StoriesBusinessFed Leaves Key Interest Rate Unchanged \nThe Federal Reserve left a key interest rate unchanged, expressing new optimism on economic growth and lower inflation. Analysts\n                        believe that Fed officials could keep rates as is through the rest of this year and well into 2008. More...\n• Honda Tops In Customer Satisfaction Survey• Newspapers Not Quite Dead Yet• How To Avoid Summer Travel Snafus• More StoriesEntertainmentBritney And Mom At Odds Over Kids?\nPaparazzi cameras caught Britney Spears on the set of her sister's TV show handing her mom what is reportedly a letter telling\n                        her to stay away from her grandchildren. More...Watch: Britney's Back On Stage\n• Best Books For Summer 2007\n                     \t\t\t\t\t| Watch• Coroner's Report: Jeni Was Mentally Ill• Streisand Awarded Legion Of Honor Medal• More StoriesOpinionRightward Ho!\nLegal analyst Andrew Cohen says that two things are responsible for the Supreme Court's marked turn to the right: math\n                        and art. More...Watch: Reading, Writing & Race\n• Life Potatoes• Iraq's Key: Strength From Within\n                     \t\t\t\t\t| Watch• Stick With The Surge\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Recipes: Summer Drinks In Big Batches\nBon Appetit magazine's Andrew Knowlton shared easy recipes for making them a pitcher at a time, without sacrificing taste,\n                        on The Early Show. More...Watch: Make A Splash: Fun Cocktails\n• EARLY SHOW: Best Books For Summer 2007\n                     \t\t\t\t\t| Watch• EARLY SHOW: Open Your Doors To Summer\n                     \t\t\t\t\t| Watch• CBS Evening News: Do Bush Defeats Signal End Of Influence?\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nLone Star Storms & FloodingAs more rain fell over Texas, cresting rivers began to overflow. There are renewed fears about more floods, evacuations and\n                                    rescue operations. Hari Sreenivasan reports.\nTOP VIDEOS\nBritish Bomb Scare\nExpert On British Bomb Scare\niPhone Hits Store Shelves\nHold 'Em: Got A Poker Face?\nFDA's Seafood Safety Alert\nTeaching Twins Together?\nWildfire Nearly Contained \nReading, Writing & Race\nHot Summer Reads\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesA Rwandan genocide survivor recalls her tale of survival. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMemory Of Murder:Cops say a mother implicated her son in a brutal murder; she says they are dead wrong. Tuesday,\n                           10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}