{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Morning HTML\" <cbsnews_weekday_morning_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 10, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESFemale Bomber Kills 16 Iraqi Recruits\nA female suicide bomber walked into a large crowd of hopeful Iraqi police recruits and blew herself up, killing at least 16\n                        people. A separate blast killed at least six people in Baghdad. Also, four more American troop deaths have been announced. More...Watch: Iraqis Protest U.S. Presence\n• CBS, MSNBC Suspend Don Imus For 2 Weeks\n                     \t\t\t\t\t| Watch• Another Suspension In Student Loan Probe• N. Korea Reactor Deadline Ticks CloserU.S.Dallas DA Admits Mistaken Rape Arrest\nJames Curtis Giles spent 10 years in prison for a gang rape he has long said he did not commit. On Monday, more than a decade\n                        after his release, a prosecutor acknowledged Giles' arrest had been a case of mistaken identity. More...\n• Another Suspension In Student Loan Probe• CBS, MSNBC Suspend Don Imus For 2 Weeks\n                     \t\t\t\t\t| Watch• Olympic Sprinter Guilty In Fraud Scheme• More StoriesWorldN. Korea Reactor Deadline Ticks Closer\nA U.S. official has warned North Korea that time is running out to shut down their nuclear reactor ahead of a Saturday deadline,\n                        but with a bank set to free up $25 million in frozen funds demanded by Pyongyang, it may not be too late yet. More...\n• Female Bomber Kills 16 Iraqi Recruits\n                     \t\t\t\t\t| Watch• U.S. Files New Piracy Cases Against China\n                     \t\t\t\t\t| Watch• Border Patrol Agents Under Attack\n                     \t\t\t\t\t| Watch• More StoriesPoliticsBush Renews Push For Immigration Reform\nPresident Bush, on a visit to the U.S.-Mexico border, touted progress in deterring illegal crossings and pressed Congress\n                        to pass legislation with a guest worker provision.  More...Watch: The Cost Of Immigration\n• Pure Horserace: An Age-Old Question\n                     \t\t\t\t\t| Watch• New York Moves Primary Date To Feb. 5\n                     \t\t\t\t\t| Watch• McCain Discusses Iraq Market Visit\n                     \t\t\t\t\t| Watch• More StoriesHealthHerb May Cure Bladder Infections\nLab tests on mice show that Forskolin, an herbal medicine made from the Asiatic coleus plant, may help treat urinary tract\n                        infection, researchers say. More...\n• New Device May Heal Damaged Hearts\n                     \t\t\t\t\t| Watch• Is Breast Cancer Worse For Hispanic Women?• Doctors' Spiritual Beliefs May Impact Care• More StoriesSciTechCompetition For TiVo\nAll personal video recorder systems are not created equal, says CBS News Technology Analyst Larry Magid, who reports\n                        on the pros and cons of the Dish Network PVR ViP622. More...\n• Love In The Age Of Google• Space Capsule Carrying U.S. Mogul Docks\n                     \t\t\t\t\t| Watch• Researcher Records His Life On Computer\n                     \t\t\t\t\t| Watch• More StoriesBusinessU.S. Files New Piracy Cases Against China\nThe Bush administration is filing two new trade cases against China over copyright piracy and restrictions on the sale of\n                        American movies, music and books. It is America's latest response to the growing pressure to fix soaring trade deficits. More...Watch: Battling Movie Piracy In China\n• Dumping Internet Service May Cost You• What To Do If You Can't Pay Your Taxes• Companies Heeding Gripes About Long Lines\n                     \t\t\t\t\t| Watch• More StoriesEntertainmentCBS, MSNBC Suspend Don Imus For 2 Weeks\nCBS Radio and MSNBC both said Monday they were suspending Don Imus' morning talk show for two weeks as a protest grew\n                        about his reference last week to members of the Rutgers women's basketball team as \"nappy-headed hos.\" More...Watch: Imus On The Hot Seat\n• Maguire: \"I Have An Addictive Nature\"\n                     \t\t\t\t\t| Watch• \"B.C.\" Cartoonist Johnny Hart Dies At 76• Kidman And Urban Go Back Down Under• More StoriesOpinionThe Gutting Of The Justice Department\nCBSNews.com legal analyst Andrew Cohen says the firing of eight U.S. attorneys might have been a shock to the country,\n                        but its reverberations are just beginning. Already flaws beyond the surface of the Justice Department are showing.\n                         More...\n• Statecraft Requires Reality Check\n                     \t\t\t\t\t| Watch• The Emotional Roller Coaster Of Combat\n                     \t\t\t\t\t| Watch• Andy: Let's Have A Queen\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSShowBuzz: People Late & Great: Anna Nicole's Half-Sister Speaks\nDonna Hogan will sit down with The Early Show's Hannah Storm on Tuesday and Wednesday in what will be her first\n                        interview since Smith died of an accidental overdose on Feb. 8.\n                         More...Watch: Birkhead Awaits DNA Results\n• EARLY SHOW: Modern Day \"Knights\" Help Needy Worldwide\n                     \t\t\t\t\t| Watch• CBS Evening News: New Device May Heal Damaged Hearts\n                     \t\t\t\t\t| Watch• CBS Evening News: Border Patrol Agents Under Attack\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nObama Doesn't 'Run For Second'CBS News RAW: Sen. Barack Obama, D-Ill, joked around with \"Late Show\" host David Letterman about perhaps being Hillary\n                                    Clinton's vice president.\nTOP VIDEOS\nImus On The Hot Seat\nBorder Violence On The Rise\nIraqis Protest U.S. Presence\nHealing The Human Heart\nEvery Step You Take, On Record\nEye To Eye: Imus Controversy\nA Stitch In Time, Recorded\nImus Apologizes For Remarks\nSome Iraqis Want U.S. To Go\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesJohn McCain talks to Scott Pelley about his presidential campaign, Iraq, and that controversial Baghdad market visit.\n                           Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryThe Ghost Of David Coffin:A businessman is murdered, his body and the evidence burned in an inferno. Ten years\n                           after the crime, will justice be served? \n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}