{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBS News Early Show <cbsnews___early_show_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Kelly Wallace: Another Tough Day At Virginia Tech", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nApril \n      19, 2007\n \nHello, everyone, \n \nIt was another tough day here on the campus of Virginia Tech. \n      Students, trying to comprehend what happened in Monday's massacre, now \n      have to face the angry words and disturbing photos of \n      the gunman, Seung-Hui Cho. \n \nOn a \n      special edition of The Early Show from \n      Blacksburg, \n      Va., \n      this morning, we had complete coverage of Cho's tirade-filled manifesto, \n      which he sent to NBC News apparently after his first shooting on campus. \n      Sharyn Alfonsi dissected what's \n      inside the manifesto and Harry Smith talked with criminal profiler Pat \n      Brown about what \n      we can learn from Cho's words and whether there were warning signs \n      that were missed. Harry also talked with Cho's former suitemate and a \n      former classmate to get their \n      reaction to Cho's final comments, and whether they had any indication \n      he could end his life by taking so many \n      others.\n \nBut our focus also remains on the victims — the 32 innocent lives \n      lost on that tragic day and the wounded who are recovering in area \n      hospitals. Harry talked with the friends of Jeremy Herbstritt, one of the \n      students who was killed, and has an incredible interview with one of the \n      survivors, Garrett Evans of Chicago, who \n      remarkably says he \n      feels sorry for the gunman, \n      and forgives him for what he's done. \n \nI had the story-behind-the-story of one photograph which was splashed across front pages around the country and may become the searing image of the tragic \n      events at Virginia Tech. It shows senior Kevin Sterne, who was shot in the \n      leg, being carried to safety. Sterne, an Eagle Scout, managed to save his \n      life by wrapping a cord around his leg to slow the bleeding. I talked to \n      people who know Kevin, including his former Eagle Scout leader, who \n      believes the training he received helped save his \n      life.\n \nAnd it's hard to believe, but tomorrow marks eight years since the Columbine massacre. \n      Russ Mitchell talked to Brook Brown, who was a student there, and Tom \n      Mauser, who lost a son in that tragedy, to find out what they were \n      thinking when the news came from Virginia \n      Tech.\n \nThere was other news on The Early Show today: Debbye \n      Turner's update on the latest pet food recall; new information \n      about the connection between hormone replacement therapy and breast cancer; and what may be a growing trend, companies taking steps to \n      allow people of faith to practice at work. \n      Debbye Turner had that story, too.\n \nThanks for watching,\n\n\n\nKelly Wallace\nCBS News \n      CorrespondentEarlyShow@cbs.com \n\n\n\n\nAdvertisement\n\n\n\nTo \nunsubscribe or change your subscription options, click here.Contact: \nEmail Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All \nRights Reserved. \n"}