{"category": "ham", "to_address": "Alberto Vieira Ferreira Monteiro <albmont@centroin.com.br>", "from_address": "Roger Bivand <Roger.Bivand@nhh.no>", "subject": "Re: [R] Off topic? Geographic data", "body": "On Thu, 3 May 2007, Alberto Vieira Ferreira Monteiro wrote:\n\n> Sorry if this is off-topic, but since there are so many data sets in R,\n> I wonder if there is any data set with Geographic data, like \n> (latitude,longitude) lists of the contour of the continents and\n> countries.\n\nPlease see the Spatial Task View on CRAN. In general, position data is \nheavily protected outside the US, so that existing and available data is \nlimited for other countries. The maps and mapdata packages have some \ndatabases, some of which are also up to date, but others still feature the \nSoviet Union and Yugoslavia, which is only of historical interest. \n\nThere is an interface to more recent shorelines in the maptools package,\nwhich will handle all the levels of detail in GSHHS. The CDC has a set of\nshapefiles covering many countries with borders from about 1997, but sadly\nthese are restricted. Some enlightened countries are releasing data;\nCanada has recently decided to do so: http://www.geogratis.gc.ca/, an\ninitiative other countries could with benefit follow. The US has by far\nthe most developed geographical data service sector, because the data are\nfree like beer but hard to use, creating opportunties for service\nproviders. Most of these data formats can be read by functions in maptools\nor rgdal.\n\nRoger\n\n> \n> Alberto Monteiro\n> \n\n-- \nRoger Bivand\nEconomic Geography Section, Department of Economics, Norwegian School of\nEconomics and Business Administration, Helleveien 30, N-5045 Bergen,\nNorway. voice: +47 55 95 93 55; fax +47 55 95 95 43\ne-mail: Roger.Bivand@nhh.no\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}