{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's Newsnight and Newsnight Review", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tFRIDAY 13 APRIL 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM EMILY MAITLIS\n\t\t\t\t\t\n\t\t\t\t\tHello, \n\n\n\nWOLFOWITZ\n\n\nIf the World Bank evangelizes one thing it's good governance, free of corruption. Ironic then that its chief, Paul Wolfowitz, finds himself at the centre of a nepotism scandal. He has apologised and accepted the blame for his involvement in negotiations over his girlfriend's pay whilst she was working alongside him. \n\n\nBut will that be enough to save his job? He's already made enemies along the way for controversial decisions he's taken at the Bank. So will this scandal just precipitate a resignation many have wanted to see for some time? \n\n\nRUSSIAN REVOLUTION\n\n\nThe man who claims he made Putin now wants to break him, in no uncertain terms. Boriz Berezovsky has called for an uprising against Putin and his removal from government. He has insisted he doesn't mean through force, but through a people's revolution. We will talk to the Kremlin tonight and see if they're trembling in their boots.\n\n\nNUCLEAR EXPLOSION\n\n\nWell, not exactly. But an explosion of power stations which will probably leave the world with another 70 over the next two decades. \n\n\nOur film tonight charts the remarkable transformation of a rogue nuclear state which defied weapons inspectors to do its own thing - much to the chagrin of the west. That country? India. It is now the largest democracy in the world, and one that is well on the road to being self sufficient in providing cheap, clean energy. Is there a lesson to be learnt from this? Or do the ghosts of Chernobyl still loom too large?\n\n\nJoin me tonight at 10:30pm\n\n\nEmily    \n\n\n\n\n\nEthical Man's Website\n\nCLICK HERE\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nBLAIR LEGACY\n\n\t\t\t\t\t\t\tUS pollster Frank Luntz investigates the lasting impact of Tony Blair\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\nnewsnight review\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tPRESENTED BY MARTHA KEARNEY\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tOn Newsnight Review at eleven my guests will be Matthew Sweet, Nikki Gemmell, Johann Hari and Sarah Churchwell. \n\n\nTHE LIVES OF OTHERS\n\n\nOur film this week - The Lives of Others - set in Cold War East Berlin, is one of the most atmospheric I have ever seen even though it was shot on a tiny budget.  In his debut film Florian Henckel von Donnersmarck had access to the former Stasi headquarters and even uses original material for props like a machine for steaming open 600 letters an hour. \n\n\nThe Lives of Others picked up various awards including best foreign film Oscar. It is set - appropriately enough in 1984 - and describes life in a society where the Stasi relied on 500,000 to 2,000,000 collaborators as well as 100,000 regular employees and maintained files on approximately 6,000,000 East German citizens - more than one-third of the population.  \n\n\nLANDSCAPE WITH WEAPON\n\n\nLandscape with Weapon is the latest play from Joe Penhall at the National Theatre in London.  He has explored the ethics of psychiatry in his hit play Blue/Orange, and most recently the media in The Dumb Show. This new play, which reunites him with director Roger Michell, explores the moral responsibly of those who work in the arms industry - specifically a designer of weapons.  \n\n\nTom Hollander plays engineer Ned who has designed an unmanned air vehicle which could revolutionise warfare, and also make him a lot of money. However what happens if it falls into the wrong hands?   Ned initially defends the need to develop such a weapon with his dentist brother Dan - Julian Rhind-Tutt. You may know him from Green Wing. One of our producers certainly does - he's been dubbed Dreamboat in my research notes. \n\n\nTHE DIARY OF A NOBODY\n\n\nOn a much lighter note, we'll also be discussing the TV dramatisation of the book Evelyn Waugh called the funniest ever written - The Diary of a Nobody narrated by the inimitable Mr Pooter.  Pooterish entered the language after the original Punch sketch in 1888 - the brothers George and Weedon Grossmith's satire on the snobberies of suburbia. Can Andrew Davies's version for BBC Four starring Hugh Bonneville sustain interest for half an hour of monologue in four parts? \n\n\nTHEN WE CAME TO THE END by JOSHUA FERRIS\n\n\nIt's surprising how few dramas or books are set in the office given how much time a lot of us spend in one. Ricky Gervais of course led the way recently with The Office. I once attempted to watch the whole boxed set in one go but found the squirm factor too intense.  Office life is the theme of debut novel from American writer Joshua Ferris which pays homage to great American literary chronicler of Don DeLillo in its title Then We Came to the End which is the first line of DeLillo's own first novel Americana. \n\n\nThe book is set in a Chicago ad agency and is written in the first person plural: \"Our coffee tasted poisonous.  The sight of our familiar chairs oppressed us.  The invariable light was deadening\". \n\n\nI hope you can join us at 11.\n\n\nMartha\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}