{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Wallace Holden\" <jowcoffeeandmoreindianos@coffeeandmoreindia.com>", "subject": "A simple and safe way to weigh less", "body": "\nStop gaining weight and get the figure you want\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most enchanting product for over-weight people is now easily available – As were seen on Oprah.\n\n\nDo you remember all the times when you asked yourself to do any thing for being rescued from this fastly growing number of kilos? Fortunately, now no great offering is required. Thanks to Anatrim, the ground-shaking pound-melting blend, you can get healthier mode of life and become really thinner. Take a look at what our customers write!\n\n\n\n\"I hate to confess but I was an awful food addict. \n\n\nI greedily ate all this trash \n\n\nand could not stop. \n\n\n\n\nThis torment passed away when I started course with Anatrim! \n\n\nGod,\n\n\n\n\n my craving for food abated, \n\n\nspirits improved and I became the happiest person 22 pounds in 2.4 months. \n\n\n\n\nI can tell you now I became the happiest person!\"\n\n\n\n\n\nLusia R., New York\n\n\n\n\n\n\"Since the very childhood I was a weighty boy. \n\n\nYou can't even fancy how I detested being ridiculed at school. \n\n\n\n\nI detested my weight and I detested even myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nIt literally took me out of this nightmare! The very sincere thanks to you, fellows.\"\n\n\n\n\n\nMikkey Fox, Boston\n\n\n\n\n\n\"Do you know what? Thanks to Anatrim my marriage was saved! I got into this circle, depression – more eating – more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOne of my friends pointed to your web site and I ordered up Anatrim immediately. \n\n\nThe results were great, my appetite came to admissible level, I was often in a good mood, and, of course, I tightened my belt with no regrets. And you see, the sex became fantastic also!\"\n\n\n\n\n\nBob\n\n\n\n\n There is a lot of sincere gratitudes happy people leave after trying Anatrim. Why don't you join the tens of thousands of slender women and men and take this original appetite-reducing energy increasing product now!\n\n\nDo not miss your chance!\n\n\n\n\n"}