{"category": "ham", "to_address": "\"'Essential Drugs in English'\" <e-drug@healthnet.org>,\n   <ip-health@lists.essential.org>", "from_address": "\"Donald W. Light\" <dlight@princeton.edu>", "subject": "[Ip-health] RE: [e-drug] EU Urged To Back Poor Countries", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\n\n\nOf equal and pressing importance is the following. I would appreciate\nfeedback.\n\n\n\nTHE G8: PROFITS BEFORE ERADICATING POVERTY\n\n\n\n\n\nDespite Angela Merkel's pledge that global poverty is a priority for G8\npolicy, a little known commitment has been made to spend the $1.5 billion in\ndonations to eradicate diseases of the poor so that three-quarters of it\nwill go to extra profits for a global pharmaceutical company and one quarter\nto meeting the costs of vaccines for pneumococcal diseases.\n\n\n\nThe contract being drawn up is called an Advanced Market Commitment, or AMC.\nOriginally, it was designed to match the revenues and profits that big\ncompanies make on drugs for affluent markets so that investing in research\nto discover vaccines for neglected diseases would be as attractive as\ndeveloping another drug for wealthy nations. In reality, a company would be\nunlikely to receive the matching jackpot. It would depend on the long shot\nof developing a successful new vaccine, on whether a competitor also\ndeveloped one, and on recipient poor countries agreeing to participate.\n\n\n\nIn the case of pneumococcal vaccines, however, the AMC rationale is\nirrelevant because the vaccines have already been discovered and their\nclinical trials are already funded out of the large expected profits from\nsales in affluent markets. Thus this G8 \"AMC pilot\" is neither an AMC nor a\npilot of one. Yet advisers to Merkel, Zombie Brown and G8 leaders have\npersuaded them it is both.\n\n\n\nBy using an AMC contract, the G8 is projected to pay $5.00 a dose for\npneumoccocal vaccines that cost about $1.25 on a sustainable, nonprofit\nbasis that includes plant and other set-up investments. Paying $5.00 means\nthe donations will buy 300 million doses, while 1.2 million children in the\nworld's poorest nations could be immunized at the breakeven price. Vaccines\nlift the human and economic burdens of disease in one shot; so G8 leaders\nshould maximize the number of children immunized.\n\n\n\nThere is a larger concern as well. The AMC design, developed at the World\nBank in 2000 and promoted by the Gates Foundation, commercializes the global\ncampaign to reduce poverty by setting the precedent of pricing vaccines at\nseveral times their breakeven level. The G8 contract is also turning the\norganizations administering the program, like the GAVI Alliance, into agents\nfor helping global pharmaceutical companies make large profits on medicines\nfor poor nations. Already the rationale and rhetoric of the GAVI Alliance\nhas shifted to justify paying four times the sustainable price for these\nvaccines that already are fully paid up in profitable sales. The same\napplies to the new vaccines for rotavirus. Will donors stand for most of\ntheir money going to profits rather than to helping the world's poorest\nchildren?\n\n\n\nPharmaceutical companies are committed to their social mission and programs\nfor the poor. They need to be approached on this basis to sell these\nvaccines at a sustainable, break-even price. Even better would be to\nnegotiate licenses and permissions so that the donated money pays\nthird-world companies to make the vaccines for the poor. That way the\ndonated money would boost the economies of low-income countries. Their lower\ncost structure might get the price down to $1.00 a dose so that 300 million\nmore children could be saved. This way, the donors would see their money\nproviding a double benefit, and companies would gain much-needed respect for\nbeing good global citizens.\n\n\n\n\n\n* * * * * * * * *\n\nDonald W. Light is a Fellow at the Netherlands Institute for Advanced Study\nand professor at the University of Medicine and Dentistry of New Jersey. He\nis an expert in global pharmaceutical policy and helped develop AMCs.\n\n\n\nContacts: Light@nias.knaw.nl.  Tel: 31-70-512-2742.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald W. Light\n\nFellow 2006-2007\n\nNetherlands Institute for Advanced Study\n\n31-(0)70-512-2742\n\n\n\n\n\n-----Original Message-----\nFrom: e-drug-bounces@healthnet.org [mailto:e-drug-bounces@healthnet.org] On\nBehalf Of Alexandra HEUMBER\nSent: Wednesday, June 06, 2007 4:33 PM\nTo: ip-health@lists.essential.org; e-drug@healthnet.org\nSubject: [e-drug] EU Urged To Back Poor Countries\n\n\n\nE-DRUG: EU Urged To Back Poor Countries\n\n---------------------------------------\n\n\n\nhttp://www.ip-watch.org/weblog/index.php?p=642&res=1024\n\n\n\n6 June 2007\n\nEU Urged To Back Poor Countries' Use Of TRIPS Flexibilities\n\nBy David Cronin for Intellectual Property Watch\n\n\n\nBRUSSELS - The European Union should stop demanding that poor countries\n\napply its intellectual property rules to medicines through trade\n\nnegotiations with the African, Caribbean and Pacific (ACP) bloc, legal\n\nexperts argued at an 4 June event here.\n\n\n\nThe EU's executive arm, the European Commission, is hoping to conclude\n\nfree trade deals known as Economic Partnership Agreements with 76 ACP\n\ncountries by the end of this year. Under proposals put forward by the\n\nCommission, these would require ACP countries to place EU intellectual\n\nproperty rules on their national statute books.\n\n\n\nFrederick Abbott, a professor of international law at Florida State\n\nUniversity (US), said that if the Commission is successful, it would\n\nimpose a 'substantial burden' on the countries concerned and that there\n\ncould be adverse consequences for public health. Instead, he recommended\n\nthat the EU encourage poor countries to make use of flexibilities in rules\n\non intellectual property rights at the World Trade Organization (WTO).\n\nDoing so could drive down the cost of drugs that would prove prohibitive\n\nshould the patents on them be enforced.\n\n\n\nAbbott has been hired by the European Parliament's committee on\n\ninternational trade to prepare an analysis of what policy options the EU\n\nhas to boost the supply of medicines in poor countries.\n\nPresenting his initial findings on 4 June, Abbott considered whether the\n\nParliament should endorse a December 2005 protocol amending the WTO's\n\nAgreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS)\n\n(IPW, WTO/TRIPS, 6 December 2005).\n\n\n\nThe protocol is designed to give permanent effect to a 2003 waiver from\n\nTRIPS agreed by to by WTO members. The waiver allows countries lacking\n\ndrug manufacturing capacity the increased possibility to import generic\n\nversions of patented medicines produced under compulsory license. It\n\nfollowed the declaration of the 2001 WTO ministerial conference in Doha,\n\nQatar, that intellectual property rights should be interpreted in a way\n\nthat protects public health and promotes 'access to medicines for all.'\n\nAbbott said that if members of Parliament decide to push for a\n\nrenegotiation of the amendment, there is a risk that the pharmaceutical\n\nindustry will succeed in restricting the protocol's scope so that it could\n\nonly be used to cover certain diseases.\n\n\n\nYet while the WTO has asked its 150 member governments to ratify the\n\nprotocol by the end of 2007, Abbott argued that the Parliament may be\n\nright to stall on approving it. Delay could be used as a tactic to\n\npressure the Commission and the 27 EU governments to refrain from\n\ninsisting that ACP countries agree to apply EU standards on intellectual\n\nproperty.\n\nJerome Reichman, professor of law at Duke University (US), said that poor\n\ncountries in general have seen 'an enormous flood of patent applications\"\n\nin recent years. Colombia's patent office, for example, has some 3,500\n\napplications pending. Reichman, who is co-author of the report with Abbott,\nsaid that the European Commission's proposals to the ACP countries would\nrequire them to enforce intellectual property in a way that presumed in\nfavour of patent holders and compensate them for losses incurred when\npatents are infringed upon.\n\n\n\nEuropean Union Silence\n\nA Commission official said, however, that the ACP should use European\n\nrules on intellectual property as a 'source of inspiration,' in particular\n\nto prevent fraud. 'We have to face the reality that poor people are often\n\nconfronted with fake medicines,' the official added. 'This is certainly\n\nthe case in Africa.'\n\nThe humanitarian organisation Medecins Sans Frontieres (MSF) has called on\n\nthe EU to support countries that have decided to issue compulsory licenses\n\nto overrule drug patents.\n\nPaul Cawthorne, MSF's head of mission in Thailand, said 'it is of\n\nconsiderable concern that the European Union has been silent' in the\n\ninternational dispute that followed the Thai government's decision to\n\nissue a compulsory license for the AIDS treatment efavirenz in November\n\n2006. At $468 per patient per year, the price charged by Merck, the drug's\n\npatent-holder, was more than twice that of a generic version of the same\n\nmedicine, made in India. Yet while the Thai decision was taken on public\n\nhealth grounds, it was opposed by drug firms and by the US government.\n\n'In Thailand, I saw men, women and children dying because they could not\n\nhave access to medicines at prices MSF or the Thai government could\n\nafford,' said Cawthorne, adding that the issuing of compulsory licenses\n\nhad led to an 'impressive scaling up of treatment'.\n\nBut Jon Pender, director of government affairs with GlaxoSmithKline,\n\nclaimed it is 'misleading and counter-productive to focus on intellectual\n\nproperty protection as a significant barrier to access to medicines in\n\ndeveloping countries,' arguing that rampant poverty and inadequate\n\nhealthcare systems are bigger problems. More than 95 percent of all drugs\n\non the 'essential medicines list' compiled by the World Health\n\nOrganization (WHO) are not covered by patents, he noted. 'And yet the WHO\n\nsays that one-third of the world's population do not have regular access\n\nto these drugs ,in parts of Africa and Asia, this rises to two-thirds.'\n\nItalian Liberal MEP Gianluca Susta complained that 'not a single member of\n\nthe WTO has yet decided to use the system agreed in 2003 to import cheap\n\nlife-saving medicines.' This, he said, 'could mean that the decision does\n\nnot address in a satisfactory way the problems faced by developing\n\ncountries in accessing medicines at affordable prices.'\n\nGreg Perry, director-general of the European Generic Medicines\n\nAssociation, complained that the 2003 decision is 'only likely to have a\n\nmarginal impact.' Companies making generic versions of drugs would not\n\nfind it financially rewarding to supply drugs to small countries, even if\n\nthey issue compulsory licenses, he said, while recognising that it may be\n\npossible to overcome that difficulty if several governments could issues\n\nlicenses jointly.\n\n\n\nDavid Cronin may be reached at info@ip-watch.ch.\n\n\n\nAlexandra Heumber\n\nEU Advocacy Liaison Officer\n\nMSF\n\nAccess to Essential Medicines Campaign\n\nRue Dupre, 94. 1090 Brussels\n\n++32 (0) 2 474 75 09 (Dir off)\n\n++ 32 (0) 479 514 900 (Mob)\n\n++ 32 (0) 2 474 75 75 (Fax)\n\nAlexandra.HEUMBER@brussels.msf.org\n\n\n\n_______________________________________________\n\nPost message: e-drug@healthnet.org\n\nSubscribe: e-drug-join@healthnet.org\n\nUnsubscribe: e-drug-leave@healthnet.org\n\nHelp: e-drug-owner@healthnet.org\n\nInfo & archives: http://list.healthnet.org/mailman/listinfo/e-drug\n\n--\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}