{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 143", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. India. Police have recovered 19 of the 110 pages of a rare\n      manuscript - authored by 17th century Mughal emperor\tAurangzeb\n      and said to be worth Rs.10 million today - that was\tstolen from a\n      Bihar school library last year. (Museum Security Network Mailing list)\n   2. Van Mieris theft. Comment. The value of an unappreciated\n      artwork increases immeasurably once it is stolen,\twrites Simon\n      Caterson. (Museum Security Network Mailing list)\n   3. U.K. An \"idiotic\" thief who stole a 17th century porcelain\n      figurine of national importance was caught out when he wrote\tto a\n      ceramics expert asking for a valuation.\n      (Museum Security Network Mailing list)\n   4. Bruce Museum Exhibit Looks At Rip-Offs Of The Masters\n      (Museum Security Network Mailing list)\n   5. Norway. An inventory of the Vestlandske Museum of Industrial\n      Art in Bergen resulted in a shocking discrepancy in the size\tof\n      their collection. (Museum Security Network Mailing list)\n   6. USA (Virgina). Approximately 14 P. Buckley Moss prints have\n      been stolen from a Waynesboro house whose owner has been in a\n      nursing home for over a year. (Museum Security Network Mailing list)\n   7. Spain. Una familia de Olot hace un inventario por Internet de\n      obras de arte robadas en su casa\n      (Museum Security Network Mailing list)\n   8. Sudanese authorities have arrested 12 people accused of\n      smuggling ancient antiquities including two entire mummies.\n      (Museum Security Network Mailing list)\n   9. Restitution du tableau L'?talon Rapide de Svertchkov au Mus?e\n      du cheval de Moscou (Museum Security Network Mailing list)\n  10. A man caught with famous stolen art - for a second time - was\n      sentenced Thursday in federal court at St. Louis to 10 more\n      months in federal prison. (Museum Security Network Mailing list)\n  11. Thieves are stripping churches of valuable metals at the rate\n      of more than one church a day to cash in on scrap prices kept\n      high by heavy demand from China.\n      (Museum Security Network Mailing list)\n  12. Maui. WAILUKU - A one-year jail term was ordered for a\n      Lahaina man as he was sentenced Thursday for the theft of\tartwork\n      from galleries on Front Street last year.\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Fri, 15 Jun 2007 17:39:50 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] India. Police have recovered 19 of the 110 pages of a\n\trare\tmanuscript - authored by 17th century Mughal emperor\tAurangzeb\n\tand said to be worth Rs.10 million today - that was\tstolen from a\n\tBihar school library last year.\nTo: \nMessage-ID: <010601c7af63$695f8800$3c1e9800$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nPages of stolen Aurangzeb manuscript found\n\nPatna, June 15: Police have recovered 19 of the 110 pages of a rare\nmanuscript - authored by 17th century Mughal emperor Aurangzeb and said to\nbe worth Rs.10 million today - that was stolen from a Bihar school library\nlast year. \n\nGaya district superintendent of police Amit Jain said Friday they recovered\nsome pages, including the cover page, of the manuscript \"Gulistan\" from a\nhouse in Gaya town, about 100 km from here. \n\nThree people were arrested while negotiating its sale with a Kolkata-based\nantique dealer who had offered them Rs.2 million for the pages.\n\n\"Now our concern is to recover the remaining pages of the rarest of rare\nmanuscript,\" Jain told IANS over telephone. He hinted that the arrested\ncriminals had given some clues but refused to elaborate.\n\n\"Gulistan\", written in Persian, was stolen from the Tekari Raj High School\nlibrary in Gaya about six months ago. Police suspected the hand of\ninternational smugglers, dealing in antiques, in the theft.\n\nThe crime highlighted the fact that such a rare manuscript had been kept\ncasually in a school library. Incidentally, Magadh Divisional Commissioner\nS.K. Negi had cautioned the school authorities about its safety. \n\nAn expert valued the manuscript to be worth over Rs.10 million in the\ninternational market. \n\n\"Gulistan\", which incorporates colourful paintings and embroidery, also has\na picture (sketch) of Aurangzeb - who lived from 1618 to 1707 - printed on\nthe cover page.\n\n\"The rare manuscript was lying in the school for over 100 years,\" a district\nofficial said. \n\nThere are two theories on how Aurangzeb's \"Gulistan\" arrived in this school\nin Tekari, an erstwhile royal estate. \n\nThe first one says in 18th century the then king of Alwar in Rajasthan had\nsold it to his Tekari counterpart for Rs.10,000. It was later donated to the\nschool that was established by the then queen of Tekari, Rani Rajroop\nKunwar, in 1876 for the education of her son Gopal Sharan, who later became\nthe king of Tekari.\n\nThe second theory says the manuscript could have been presented as a gift to\nthe Tekari estate during Auurangzeb's visit. It was later donated to the\nschool by Rani Rajroop Kunwar.\n\nhttp://www.newkerala.com/news5.php?action=fullnews&id=39265\n\n\n\n------------------------------\n\nMessage: 2\nDate: Fri, 15 Jun 2007 17:41:29 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Van Mieris theft. Comment. The value of an\n\tunappreciated\tartwork increases immeasurably once it is stolen,\twrites\n\tSimon Caterson.\nTo: \nMessage-ID: <010701c7af63$a43b6ed0$ecb24c70$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nReally love your work, darling\nThe value of an unappreciated artwork increases immeasurably once it is\nstolen, writes Simon Caterson\n----------------------------------------------------------------------------\n----\n \nJune 16, 2007 \n\nTHE most famous exhibit at the Art Gallery of NSW reminds me of Joni\nMitchell, who sang of how you don't know what you've got 'til it's gone. The\ntheft of A Cavalier (Self-Portrait) has catapulted a hitherto obscure,\nalbeit saleable, painting to a prominence it never had when it was on\ndisplay.\nThat such an unheralded picture, painted by 17th-century Dutch artist Frans\nvan Mieris I, could arouse widespread public interest by suddenly\ndisappearing is nothing new, since this is one of the recurring ironies in\nthe long and colourful history of art theft. \n\nThe international police agency Interpol ranks art theft as the third most\nlucrative form of illicit international trade after drugs and arms. Works of\nart, like drugs and arms, are valuable and portable, and their appeal knows\nno borders. Art is also relatively accessible. \n\nTheft can do wonders for a painting's reputation. We are used to the Mona\nLisa being referred to as the most famous painting in the world, but that\nstatus was attained only after it was stolen in August 1911. The theft of\nthe Mona Lisa was not noticed for 24 hours, but the news quickly travelled\nacross the world. While more than 60 detectives scoured Paris, the absent\npainting in the popular imagination was transformed into the cultural symbol\nwe know today. \n\nAs Darian Leader writes in Stealing the Mona Lisa: \"Crowds gathered at the\nLouvre to gaze at the empty space where the picture had once hung. Many of\nthese excited spectators, it turned out, had never been to the Louvre or,\nindeed, seen the picture before.\" \n\nWhen he was caught two years later, the culprit, an Italian carpenter named\nVincenzo Peruggia, claimed to be a liberator rather than a thief. He\ndeclared that the painting rightfully belonged in Italy, conveniently\nignoring that Leonardo da Vinci had happily sold it to the king of France\n400 years earlier. \n\nAlso claiming a higher motive than monetary gain was the mysterious thief or\nthieves who perpetrated the most famous art theft in Australian history, at\nleast until now. \n\nIn August 1986, Picasso's Weeping Woman disappeared from the National\nGallery of Victoria in Melbourne. In its place on the wall was a card with\nthe letters ACT written on it. Staff assumed the painting had been lent to\nthe national capital. In fact the acronym stood for Australian Cultural\nTerrorists, which announced it had kidnapped the painting in return for\nincreased state government support for local artists. \n\nIn his memoir The Bright Shapes and the True Names, Patrick McCaughey,\ndirector of the NGV at the time, says he was mistaken in his assumption that\nthe level of after-hours security was adequate: \"I learned later, however,\nthat the guards did not turn on the lights in the galleries but moved\nthrough the huge building with a flashlight. In Roy Ground's echoing spaces\nyou could have hidden an elephant and evaded such a level of detection.\" \n\nStolen art is sometimes not recovered for generations, if at all, and two\ndecades after the theft, McCaughey still has no idea who perpetrated the\ntheft, though he suspects it was an inside job, the likeliest scenario in\nsuch cases, according to the experts. \n\nAt least the Weeping Woman was returned unharmed by someone who evidently\nknew how to take care of it. One of the biggest art thefts in history also\nproved to be among the most destructive. During a six-year period from 1995,\nFrench waiter Stephane Breitweiser, with the assistance of his girlfriend,\nstole 239 works from 172 European galleries, including 60 old masters. When\nhis mother discovered the priceless haul, she cut up most of the artworks or\ndumped them in a canal. \n\nArt theft often overlaps, unwittingly or not, with other crimes such as\nforgery and fraud. In 2004, artist John Opit claimed that a burglar had\nstolen art valued at $67 million from his home in Limpinwood, near the\nNSW-Queensland border. Most valuable of all, Opit said, was a Cezanne\nportrait worth $50 million. The police and art experts disagreed, and the\npainting, which was scientifically tested after it was recovered from a\ngarage on the Gold Coast, was generally dismissed as a fake. \n\nThe Opit theft may have been the real theft of fake French impressionist\nart, but the reverse occurred in 1992, when Boston ophthalmologist Steven\nCooperman reported that two of his paintings, a Monet and a Pissarro, had\nbeen stolen even though the alarm at his home had not gone off and there\nwere no signs of forced entry. Despite this, Cooperman successfully sued his\ndisbelieving insurers for $US17.5 million. Five years later, the FBI\nsecretly recorded incriminating phone calls in which Cooperman urged his\nlawyer to chop up the paintings to remove traces of the scam. \n\nTheft on a mass scale is called looting and that goes back to the tomb\nraiders who went to work not long after the ancient mausoleums were built.\nAntiquities and art have been regularly stolen ever since. \n\nThe biggest looters in modern history were Napoleon Bonaparte, Adolf Hitler\nand Joseph Stalin. The Nazi plundering of Europe's art treasures continues\nto have repercussions, as the Queensland Art Gallery discovered when a claim\nwas made in 2000 that a 15th-century German portrait of the Virgin and Child\nit purchased in 1980 had rightfully belonged to Oscar Bondy, a Jewish art\nconnoisseur from Vienna whose collection had been confiscated by the Nazis\nin 1939. After an extensive inquiry, that claim was proved true. \n\nThe theft last weekend of A Cavalier puts the picture in impressive company.\nThe catalogue of lost art rivals all others, according to Simon Houpt in his\nhistory of art theft, The Museum of the Missing. The immense gallery of\nstolen art \"would hold perhaps 150 Rembrandts and 500 Picassos. You could\nstroll through the Renaissance galleries to admire Raphaels and Titians, da\nVincis and Durers, Rubenses and Caravaggios.\" One thing is certain. If A\nCavalier is recovered, we'll never look at it in the same way. \n\nWriter Simon Caterson is based in Melbourne.\n\nhttp://www.theaustralian.news.com.au/\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Sun, 17 Jun 2007 11:58:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] U.K. An \"idiotic\" thief who stole a 17th century\n\tporcelain\tfigurine of national importance was caught out when he wrote\n\tto a ceramics expert asking for a valuation.\nTo: \nMessage-ID: <0a6601c7b0c6$12122260$36366720$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nI stole this statue, will you value it for me?\nLast updated at 23:54pm on 15th June 2007\n \n\nAn \"idiotic\" thief who stole a 17th century porcelain figurine of national\nimportance was caught out when he wrote to a ceramics expert asking for a\nvaluation. \n\nJason Cochlin, 32, was part of a gang who took the figure of Ignis - the\npersonification of fire - and 11 others from the Allen Gallery in Alton,\nHampshire, in 2002. \n\n\nThe 1679 tin-glazed figure, described in court as a piece of Britain's\nheritage, was worth up to ?160,000. \n\nPhoto:\nhttp://www.dailymail.co.uk/pages/live/articles/news/news.html?in_article_id=\n462318&in_page_id=1770\n\nThe figurine: Worth ?160,000\n\n\nCochlin, who has not named his fellow thieves, was found guilty of\nconspiracy to steal the pieces at Winchester Crown Court and jailed for 12\nmonths. \n\n\nHis barrister Robert Pawson said Cochlin, from Southampton, had been forced\nto take part in the conspiracy because he owed a debt to someone. \n\n\nHe said Cochlin had used a loan of ?20,000 to buy Ignis back from the\ncriminal who had it, and told the court the married father of three could\nnot name him otherwise he would be shot. \n\n\n\"Mr Cochlin was idiotic enough to write to a world expert on English\nearthenware, Jonathan Horne, giving the insignia of the figure and asking\nfor a valuation,\" said Mr Pawson. \n\n\nMr Horne knew the treasure - made in London as a commission for a client\ninterested in alchemy and science - was stolen. He contacted the museum and\nthey called the police. \n\n\nAfter he was caught, Cochlin handed the undamaged figure, which he had kept\nwrapped in towels inside a shoebox, back to police. \n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Sun, 17 Jun 2007 11:58:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Bruce Museum Exhibit Looks At Rip-Offs Of The Masters\nTo: \nMessage-ID: <0a6501c7b0c6$11f04280$35d0c780$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nArt Imitating Art\n\n Bruce Museum Exhibit Looks At Rip-Offs Of The Masters \nJune 17, 2007 \n\nBy MATT EAGAN, The Hartford Courant \n John Myatt says they called him Picasso in prison. Myatt was the brush\nbehind one of the most famous art frauds of modern times. During the 1980s\nand '90s, he painted works in the style of Picasso, Joan Miro, Alberto\nGiacometti and others.\n\nAlong with his partner, John Drewe, Myatt was able to create paintings that\nfooled major auction houses into paying out as much as 30,000 pounds for\nwhat they believed was a genuine work by a major artist.The scheme was\nuncovered only after Drewe, who produced the fake documentation for the\nworks, left his wife for another woman but failed to take the fake papers\nwith him. His wife turned them in to police, and the two were arrested.\n\nSuch frauds remain the fear of everyone in the art world, especially at\nmuseums, where the most basic guarantee made to customers is that the art on\ndisplay is genuine.\n\nArtists such as Myatt, and the illusory works they create, are the subject\nof \"Fakes and Forgeries: The Art of Deception,\" an exhibit running through\nSept. 9 at the Bruce Museum in Greenwich.\n\nMyatt, who testified against Drewe at a 1999 trial and went to prison for\nfour months, will appear at a dinner lecture Wednesday night to discuss his\nexperiences and his now-legitimate work as a producer of replicas. If\nnothing else, the exhibit makes clear that as soon as someone decided to\ncreate art, someone else decided to fake it. There are attempted forgeries\nfrom all eras, from a Cycladic head supposedly from 2,500 B.C. to works that\nrip off Norman Rockwell, Andy Warhol or Jean-Michel Basquiat.Nancy\nHall-Duncan, the exhibit's curator, says determining what is authentic is a\ngreat challenge when one takes into account the many fake, forged, copied,\nmisattributed and replicated works in existence.\n\nIn the simplest terms, a fake attempts to replicate an existing work. A\nforgery mimics the style of another artist in a deliberate attempt to\ndeceive others.\n\nSimply attempting to replicate another artist's work is not a crime until\none claims it to be an original.\n\nIn fact, copying the works of the masters has long been a method of teaching\nstudents advanced techniques.\n\nAs science has advanced, so have methods for detecting cheats.\n\nAccording to research scientist James Martin, art detectives now use a\nvariety of sophisticated methods such as ultraviolet illumination and\nelectron micrographs to unmask frauds. Through these methods, it's sometimes\npossible to uncover something that doesn't belong, such as a pigment that\nwas not available at the time the actual artist was working.\n\nBut usually these tools are only used once the sharp eye of a connoisseur\nhas raised questions about a painting's authenticity.\n\n\"Connoisseurship is the time-honored analytic process by which informed\nviewers offer their opinion on who created a work of art, when and where,\"\nsays Peter Sutton, the Bruce Museum's executive director.\n\nBut connoisseurship is not always perfect.\n\nConsider Han van Meegeren, who, beginning in 1933, painted one of the\nworld's most famous forgeries, \"Christ and His Disciples at Emmaus,\" in the\nstyle of Johannes Vermeer.\n\nVan Meegeren clearly had artistic ability, but his scheming was notable more\nfor its attention to detail and his ability to imagine a work tantalizing\nenough to entice scholars to set aside their nagging doubts and give in to\nhope.\n\nFirst, the technical details. Van Meegeren began with an authentic\n17th-century painting by an unknown artist and erased the work with pumice.\nHe used badger hair brushes and pigments that existed at the time Vermeer\nwas painting. He tried several methods to dry the painting, which can take\nseveral decades naturally before settling on a synthetic resin dissolved in\nalcohol and synthetic lilac oil. This was close enough to Vermeer's linseed\noil.\n\nBut van Meegeren's success was as much about wish fulfillment as anything\nelse. He preyed on the dreams of scholars by mimicking an artist whose work\nwas rare (only 34 paintings by Vermeer were known to exist in the mid-1930s)\nand by giving them a piece from early in the artist's career.\n\nThe forgery did not fool everyone, and today, for art scholars, it's\ndifficult to imagine it fooled anyone - but it did.\n\n\"It is a wonderful moment in the life of a lover of art when he finds\nhimself suddenly confronted with a hitherto unknown painting by a great\nmaster,\" wrote scholar Abraham Bredius after the painting was revealed.\n\nThe work sold in 1937 for 520,000 Dutch guilders ($4.7 million today) and\nwas donated to the Boijmans van Beuningen Museum in Rotterdam.\n\nThe scam nearly cost van Meegeren his life.\n\nAfter World War II, art scholars began tracing the lineage of looted works.\nThey traced this so-called Vermeer to van Meegeren and charged him with\ncollaboration. Rather than accept a death sentence, van Meegeren admitted to\nforging dozens of paintings and demonstrated his techniques from his jail\ncell in order to prove he had not collaborated with the Nazis.\n\nHe died of a heart attack six weeks after his sentencing.\n\nThe fate of his painting was finally settled in 1966, when the Mellon\nInstitute in Pittsburgh studied the residual radioactivity and determined it\nwas a modern work forgery and not a Vermeer.\n\nWhich is why it's at the Bruce Museum.\n\nFAKES AND FORGERIES: THE ART OF DECEPTION is open through Sept. 9. The Bruce\nMuseum is at 1 Museum Drive in Greenwich. Museum hours are Tuesday through\nSaturday, 10 a.m. to 5 p.m., and Sunday, 1 to 5 p.m. The museum is closed\nMondays and major holidays. Admission is $7, $6 for seniors and students,\nfree for children under 5.\n\nFor information, call 203-869-0376, or visit www.brucemuseum.org.\n\nContact Matt Eagan at eagan@courant.com.\n\nhttp://www.ctnow.com/\n\n\n\n------------------------------\n\nMessage: 5\nDate: Sun, 17 Jun 2007 11:58:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Norway. An inventory of the Vestlandske Museum of\n\tIndustrial\tArt in Bergen resulted in a shocking discrepancy in the\n\tsize\tof their collection.\nTo: \nMessage-ID: <0a6d01c7b0c6$15e91b00$41bb5100$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nSurprise after collection check\n\nAn inventory of the Vestlandske Museum of Industrial Art in Bergen resulted\nin a shocking discrepancy in the size of their collection.\n\"There is no doubt that we were surprised,\" museum director Jorunn Haakestad\ntold newspaper Bergens Tidende, after the process last year registered all\ncollection items in a computer database.\n\nThe museum believed they had between 20,000-25,000 objects at the facility,\nbut there are between 33,000-35,000.\n\n\"I think that the registration of collections at most other museums in\nNorway would provide the same kind of surprise we got,\" Haakestad said.\n\nAt the same time Haakestad confirmed that any possibly dishonest employees\nat the museum could have had easy and unchecked access to valuable items,\nand that some kinds of theft could have gone undetected for many years.\n\nEarlier this week the newspaper revealed that a large number of important\nletter from the University Library collection of former Prime Minister Johan\nLudwig Mowinckel's documents had been stolen. \n\nhttp://www.aftenposten.no/english/local/article1838156.ece\n\n\n\n------------------------------\n\nMessage: 6\nDate: Sun, 17 Jun 2007 11:58:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] USA (Virgina). Approximately 14 P. Buckley Moss prints\n\thave\tbeen stolen from a Waynesboro house whose owner has been in a\n\tnursing home for over a year.\nTo: \nMessage-ID: <0a6b01c7b0c6$157b16f0$407144d0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nPolice seek clues in P. Buckley Moss heist \n Approximately 14 P. Buckley Moss prints have been stolen from a Waynesboro\nhouse whose owner has been in a nursing home for over a year. The break-in\nwas reported in late May when a neighbor noticed a broken window in the back\nof the house, according to NBC29. The burglar ransacked the house and took\ncoins as well as real and costume jewelry.\n\nSome larger prints that couldn't easily be carried out of the house were\nleft, the News Virginian reports.\n\nPolice warn that the thief may have a hard time fencing the popular artist's\nwork, and pawn shops will be on the lookout for images of feetless geese and\nMennonite moppets.\n\n\nPhoto:\n\nhttp://www.thehook.net/2007/06/15/police-seek-clues-in-p-buckley-moss-heist/\n\n\n\n------------------------------\n\nMessage: 7\nDate: Sun, 17 Jun 2007 11:58:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Spain. Una familia de Olot hace un inventario por\n\tInternet de\tobras de arte robadas en su casa\nTo: \nMessage-ID: <0a6e01c7b0c6$15faa730$41eff590$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nBUSCAN AYUDA PARA RECUPERARLAS\n\nUna familia de Olot hace un inventario por Internet de obras de arte robadas\nen su casa\n \nUno de los objetos robados, un espejo cornucopia con marco de madera tallada\ny dorado con pan de oro. M?S INFORMACI?N\nP?gina inventario de los objetos de arte robados\nEUROPA PRESS\nGIRONA\nLos Mossos d'Esquadra han permitido a la familia del pintor Maurici\nVallsquer difundir a trav?s de Internet una p?gina en la que detallan las\nobras de arte que les robaron de su colecci?n particular en su casa de Olot\n(Girona) la segunda semana de junio. En la web. los familiares piden \"ayuda\"\na los internautas para poder recuperar todas las obras robadas. \n\nSe da las circunstancia de que el d?a del robo ?nicamente se llevaron\naquellos objetos relacionados con el arte, lo que hace pensar a la familia\nque los ladrones conoc?an la vivienda. \n\nEntre las 27 pinturas y cuadros substra?dos se encuentran obras de Maurici\nVallsquer, Joaquim Planagum?, Barnadas, Jaume Vilanova o Bosch Pla, entre\notros. Tambi?n se llevaron un diorama de Vallsquer, varios espejos, unas\nespadas y hasta unos pendientes que no estaban a la vista. \n\nCon permiso de los Mossos\n\nEn la web http://robatori-olot.blogspot.com detallan a trav?s de fotograf?as\ny con el \"permiso de los mossos\" todos los objetos que les robaron. Marc\nPlanagum?, nieto del pintor, ha explicado a Europa Press que ya ten?an la\nweb preparada pero que no la han colgado hasta que la Polic?a auton?mica les\nha dado su \"autorizaci?n\".\n\nPlanagum? tambi?n ha dicho que m?s all? del valor econ?mico su objetivo es\n\"recuperar\" las piezas porque formaban parte de la colecci?n familiar y\ntienen un alto valor \"sentimental\" para todos ellos. \n\nMaurici Vallsquer naci? en Barcelona el 3 de marzo de 1904 y muri? en Olot\nen 1992 a la edad de 88 a?os. A lo largo de su vida vivi? en Barcelona,\nMallorca y Olot y fue un destacado paisajista. Durante su vida expuso sus\nobras en Nueva York, Alemania, Suiza, Francia, Espa?a y B?lgica.\n\n\n\nhttp://www.elperiodico.com/default.asp?idpublicacio_PK=46&idioma=CAS&idnotic\nia_PK=415887&idseccio_PK=1021&h=\n\n\n\n------------------------------\n\nMessage: 8\nDate: Sun, 17 Jun 2007 11:58:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Sudanese authorities have arrested 12 people accused of\n\tsmuggling ancient antiquities including two entire mummies.\nTo: \nMessage-ID: <0a7001c7b0c6$16506850$42f138f0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nSudan arrests 12 trying to smuggle ancient mummies\nSat 16 Jun 2007, 12:52 GMT\n \n[-] Text [+] KHARTOUM (Reuters) - Sudanese authorities have arrested 12\npeople accused of smuggling ancient antiquities including two entire\nmummies, a state news agency said on Saturday.\n\n\"The police authorities in Nile state have thwarted an attempt to smuggle\nancient artefacts,\" the state Sudanese Media Centre said.\n\nIt gave no details of the age of the mummies.\n\n Sudan, home of the ancient Nubian civilisation, has more pyramids than\nneighbouring Egypt, but little excavation is done on its archaeological\nsites.\n\nSometimes known as the \"Black Pharaohs,\" Nubian kings ruled Egypt from\nroughly 760 B.C. to 660 B.C. Sudan's most viewed pyramids in Merowe in\nnorthern Sudan date from about 300 B.C.\n\nEgypt has demanded museums around the world return its antiquities, which\nhave been smuggled out over the centuries.\n\nFew people visit Sudan's pyramids and ancient cities, situated mostly north\nof Khartoum along the river Nile.\n\n\nhttp://africa.reuters.com/wire/news/usnL16305863.html\n\n\n\n\n------------------------------\n\nMessage: 9\nDate: Sun, 17 Jun 2007 11:58:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Restitution du tableau L'?talon Rapide de Svertchkov au\n\tMus?e du cheval de Moscou\nTo: \nMessage-ID: <0a6f01c7b0c6$1624eb80$426ec280$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nRestitution du tableau L'?talon Rapide de Svertchkov au Mus?e du cheval de\nMoscou \n 20:17 | 15/ 06/ 2007 \n   \nMOSCOU, 15 juin - RIA Novosti. Un tableau unique de Nikola? Svertchkov,\nL'?talon Rapide, vol? en 1993 au Mus?e du cheval de l'Acad?mie d'agriculture\nTimiriazev, sera restitu? au mus?e, a annonc? le directeur adjoint du\nService f?d?ral russe pour le patrimoine culturel, Anatoli Vilkov.\n\nLe tableau, une huile des ann?es 1880, a ?t? d?couvert dans une collection\npriv?e gr?ce au Catalogue des objets d'art et antiquit?s recherch?s, publi?\npar le Service f?d?ral russe pour le patrimoine culturel.\n\nSelon Anatoli Vilkov, apr?s discussions, le propri?taire de la toile a\nd?cid? de la rendre au mus?e. Son prix sur le march? des antiquit?s est d'au\nmoins 10,5 millions de roubles (300.000 euros).\n\nDe 1977 ? 1998, 7 vols ont ?t? commis au Mus?e du cheval de Moscou. 13\ntableaux et sculptures repr?sentant des chevaux ont ?t? d?rob?s. 2\nsculptures ont ?t? retrouv?es et restitu?es au mus?e en 1999.\n\nLes autres oeuvres figurent dans la base de donn?es russe ERPAS et sur la\nliste de recherches d'Interpol, et ont fait l'objet de publications ?\nmaintes reprises en tant qu'oeuvres recherch?es dans des revues sp?cialis?es\nsur les antiquit?s. \n\nNicolas Svertchkov (1817-1898) est un peintre russe de genre. A partir de\n1844, ses oeuvres ont ?t? pr?sent?es ? l'exposition annuelle de l'acad?mie.\nEn 1852, il a re?u le titre d'acad?micien, en 1855 celui de professeur. Au\nmilieu du XIXe si?cle, il est devenu c?l?bre gr?ce ? des toiles et des\ndessins de chevaux et de chiens de race, des sc?nes de chasse, des tro?kas,\net des sujets de genre avec chevaux et voitures. A maintes reprises,\njusqu'en 1882, il a ex?cut? des commandes personnelles de l'empereur.\n\nSes toiles sont expos?es dans de grands mus?es de Russie et du monde et se\nvendent r?guli?rement dans les plus grandes maisons d'ench?res.\n\nL'?talon Rapide a remport? de nombreuses courses et est ? l'origine d'une\nv?ritable dynastie de chevaux de course.\n\nhttp://fr.rian.ru/culture/20070615/67299908.html\n\n\n\n------------------------------\n\nMessage: 10\nDate: Sun, 17 Jun 2007 11:58:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] A man caught with famous stolen art - for a second time\n\t- was\tsentenced Thursday in federal court at St. Louis to 10 more\n\tmonths in federal prison.\nTo: \nMessage-ID: <0a6c01c7b0c6$15ce8e20$416baa60$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nMan who stole famous art gets additional prison time\nBy Robert Patrick\nST. LOUIS POST-DISPATCH\n06/15/2007\n\nA man caught with famous stolen art - for a second time - was sentenced\nThursday in federal court at St. Louis to 10 more months in federal prison.\n\nDonald R. Rasch, 46, got in trouble again while he was in prison serving a\ntwo-year sentence for stealing more than 130 pieces of fine art, worth up to\n$4 million, that belonged to David and Dianne Harter of Florida. \n\nRasch and Biron A. Valier worked for a now-defunct Bridgeton storage\nfacility, and both pleaded guilty in 2005 to taking the art. Some was\nrecovered, but almost four dozen pieces were still missing. Both men said\nthey didn't know where the rest was.\n\nBut after Rasch had gone to prison, his girlfriend contacted authorities and\nsaid she knew where some of the stolen art could be found.\n\nInvestigators recovered 28 pieces, worth about $98,000, from her house and\nfrom the home of a Rasch relative, court documents show.\n\nOfficials confronted Rasch, who confessed to hiding the art and lying when\nhe said he made only one trip to the storage facility to steal art. He also\nhelped investigators find one more piece.\n\nRasch pleaded guilty in May to one count of lying to the FBI, and agreed to\npay $38,000 in restitution. A New York art gallery that bought two stolen\nArthur Dove paintings from an Illinois man, who got them from Rasch, gets\n$12,000 to reimburse its loss when the FBI seized the pieces. The Illinois\nman gets $26,000.\n\nSeventeen pieces of art are still missing.\n\nhttp://www.stltoday.com/\n\n\n\n\n------------------------------\n\nMessage: 11\nDate: Sun, 17 Jun 2007 11:58:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Thieves are stripping churches of valuable metals at\n\tthe rate\tof more than one church a day to cash in on scrap prices kept\n\thigh by heavy demand from China.\nTo: \nMessage-ID: <0a7101c7b0c6$1663f050$432bd0f0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nScrap metal thieves target churches \nBy Sadie Gray \nPublished: 17 June 2007 \nThieves are stripping churches of valuable metals at the rate of more than\none church a day to cash in on scrap prices kept high by heavy demand from\nChina. \n\nEcclesiastical Insurance has received 500 claims in the past 14 months,\ntotalling ?750,000. Many are for repeated thefts from the same churches.\n\nSince 2005, thefts of lead have trebled and copper thefts have multiplied by\n10, Ecclesiastical said.\n\nCriminals have stripped entire church roofs, stolen bells, and ripped\nlightning conductors from spires by tying them to trucks and driving away,\nwrecking historic masonry.\n\nRecycling firms pay about ?900 a tonne for lead and ?2,700 a tonne for\ncopper.\n\nSmall-time criminals have been stealing lead from church roofs for years,\nbut recent highs in scrap metal prices has caused an explosion in thefts,\nsaid Chris Pitt, of Ecclesiastical.\n\n\"We've seen a marked worsening in the situation in the past year. These\naren't opportunists doing this - we had a three-tonne bell taken from\noutside a church.\n\n\"If they've stolen ?2,000-worth of lead, that can have caused ?50,000-worth\nof damage to the church,\" Mr Pitt said.\n\nCurrent hotspots include London, Bristol, the West Midlands and Sheffield.\n\nInspector Stuart Edwards, of South Yorkshire Police, said: \"Between April\n2006 and April 2007 we've had in the order of 20 attacks on churches. The\ncrux of the matter is that thieves pay no heed to what type of premises it\nis.\n\n\"The problem with churches is that they're often isolated so we don't get\npeople regularly reporting suspicious events to us. If we get a couple of\nprosecutions under our belts, it'll act as a deterrent.\n\n\"There's a message to get out to the scrap metal dealers themselves, to be\nmindful of people coming on to their premises wanting to sell what's quite\nclearly lead flashing, who clearly aren't tradespeople or regular\ncustomers.\"\n\nEcclesiastical's largest metal theft claim was for ?40,000, Mr Pitt said,\nalthough most were between ?2,000 and ?4,000. But many churches were hit\nrepeatedly, leading to mounting costs.\n\nThieves struck at All Saints Church in Heath Town, Wolverhampton, three\ntimes in May, stealing lead flashing, the lightning conductor and ladders.\nBecause it was under renovation at the time, the church's insurance was\naffected and it must cover the cost - expected to be a five-figure sum -\nitself.\n\nIn October last year, thieves attached the lightning conductor of All Saints\nChurch, Little Staughton, Bedfordshire, to their vehicle and drove away.\nThey also brought down the top eight feet of the spire, which destroyed a\ngargoyle on its way down. Repairs will cost ?36,000.\n\nIn another remarkable theft, a bell was taken from a church in Eastfield,\nNorthamptonshire.\n\nMr Pitt said: \"Lead is on parts of the church that are inaccessible and hard\nto see, so what people notice first is often indentations in the grass after\nthey've rolled up the lead and thrown it off the roof. Sometimes no one\nrealises until the roof starts leaking.\"\n\nThe highest-profile recent theft believed to be linked to scrap metal was\nthat of a two-tonne Henry Moore sculpture stolen in December 2005. It has\nnever been found.\n\nhttp://news.independent.co.uk/\n\n\n\n------------------------------\n\nMessage: 12\nDate: Sun, 17 Jun 2007 11:58:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Maui. WAILUKU - A one-year jail term was ordered for a\n\tLahaina man as he was sentenced Thursday for the theft of\tartwork from\n\tgalleries on Front Street last year.\nTo: \nMessage-ID: <0a6701c7b0c6$146b0680$3d411380$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nMan gets jail term for theft of artwork\n\nWAILUKU - A one-year jail term was ordered for a Lahaina man as he was\nsentenced Thursday for the theft of artwork from galleries on Front Street\nlast year.\n\nWilliam Vannatta III, 45, said he was \"deeply grateful\" for the plea\nagreement recommending that he be placed on probation for the crimes.\n\n\"I have a lot of regrets,\" he said. \"I'm sorry for the things I did.\"\n\nVannatta had pleaded no contest to five counts of second-degree theft of\npaintings, sculptures and an autographed guitar from the galleries from last\nJune to October.\n\nDeputy Public Defender Jon Apo said Vannatta had \"cooperated fully\" with\npolice Lt. Don Simpson to recover much of the artwork.\n\nAccording to court records, the stolen artwork included paintings depicting\nJohn Lennon and Elvis Presley and glass sculptures.\n\nFollowing terms of the plea agreement, 2nd Circuit Judge Joseph Cardoza\nimposed the one-year jail term as part of five years' probation for\nVannatta. He was ordered to pay $940 in restitution for sculptures stolen\nfrom one gallery.\n\n\nhttp://www.mauinews.com/story.aspx?id=31440\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 143\n****************************************\n\n"}