{"category": "spam", "to_address": null, "from_address": "\"Dr. Kay Molly\" <kmolly_1@yahoo.com>", "subject": "JOB PROPOSAL!", "body": "\n\n\nDear Sir/Madam,\n\nHow are you doing? I would be very interested in offering you a part-time\npays venture in which you could earn a lot. I am Dr. Kay Molly and I am 57\nyears of age.\n\nI just resigned my job as a scientific researcher at Asia Agricultural\nresearch Institute in Malaysia and I now work as a freelance consultant\nfor the institute which positively grants me a lot precious time to do my\npersonal work which is mainly being a freelance researcher who could be\nemployed by research institutes to do research projects anywhere in the\nglobe.\n\nCurrently, I have just been granted a funding to head a research project\nin the tropical regions of Asia regarding rare and vulnerable plant\nspecies and this would be starting very soon.\n\nThis research program will be funded by some of my United State of America\nand Canada counterparts and Associates. But the only set back is that my\nassociate wants to make payments for the research in form of a Cashier\nChecks and Money Orders only to any of the USA and Canada.\n\nOpening an account would have been my best decision but I have a deadline\nto meet and taking any of those decisions would cost me time and a whole\nlot of other essential requirements which I am not ready to deal with.\n\nThis is where I need to employ your valuable support and service.\n\nWHAT I NEED YOU FOR?\n\nAt this point, I will be glad if you could work with me as my\nrepresentative in above named countries. You will be working as my payment\nassistant in charge of accumulating the payments from my Associates.\n\nSince they will be making the donation in checks made payable only to you\nin United State and Canada, you will be obtaining this payment and cashing\nthem on my behalf. On agreement to been my representative, you will\nreceive a commission of 10% of whatever amount of payment you receive from\nmy associates.\n\nOFFER DESCRIPTION?\n\n1. \tReceive payments from my clients/associates through bank transfers\ninto your bank account. or in form of money orders/checks from my\nassociates via mail(UPS/FEDEX/DHL).\n2. \tCash the payments at your Bank.\n3. \tDeduct 10% which will be your commission/percentage on payment processed.\n4. \tYou are to remit the balance via Money Gram or Western Union Money\nTransfer according to my in depth mandate.\n\nHOW MUCH WILL YOU EARN?\n\n10% from each transaction! For instance: On receiving USD $100,000 on my\nbehalf, you will cash the payment and keep 10% to yourself before\nremitting the balance! At the beginning your commission will equal 10%,\nthough later it will increase up to 15%!\n\nADVANTAGES\n\nYou don't have to go out of your present daily activity in order to engage\nin this Job(i.e. You can do this Work easily without leaving or affecting\nyour present Job).You will work as an independent contractor right from\nyour home /office. Your permanent occupation is absolutely legal. You do\nnot need any capital to start (non of your personal funds is needed).\n\nREQUIREMENTS\n\ni) \t18 years or older.\nii) \tLegally capable.\niii) \tResponsible, Reliable and Trustworthy.\niv) \tReady to work 3-4 hours per week.\nv) \tAble to check and acknowledge to emails often.\nvi) \tEasy telephone access.\n\nI hope all is well understood. I would be glad if you accept my proposal\nand I propose to commence as soon as you are ready. Please, to facilitate\nthe conclusion of this transaction if accepted, do send promptly by e-mail\nthe following details below.\n\nTo show your interest in this pending project, i will like you to furnish\nall this information before we can commence on this pending projects.\n\nNAME:\nFULL CONTACT ADDRESS:\nPHONE NUMBER:\nAGE:\nSEX:\nCURRENT OCCUPATION:\n\nOnce this information has been derived from you, it would be forwarded to\nmy associates so they could commence the bank transfer to you.\n\nRegards,\nDr. Kay Molly\n+44-704-572-7961\n\n"}