{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Joe Smith\" <unknown_kev_cat@hotmail.com>", "subject": "Re: Final text of GPL v3", "body": "\n\"Steve Langasek\"  wrote in message \nnews:20070630220645.GF4404@dario.dodds.net...\n>\n> Here I'm confused again.  What does making the source code available have \n> to\n> do with patents?  Isn't it the case that the license already requires \n> source\n> code availability?  How does making the source code available help the\n> patent problem?\n\nFirst of all the requirement is for *public* availability (even in the case \nof private distribution), which is not a requirement of the rest of the \nlicence.\n\nI think it is the ffmpeg situation. They distribute code (which allegedy \ncannot violate a patent),\nand the end users can download and compile it. I guess the FSF feels that \nend users are unlikly to be\nsued for this, although AIUI, under US law they can be sued for that. This \nonly seems to benefit\nthose people who the patent does not apply, such as people in contries that \ndo not allow software patents.\n\n\n> Is the meaning here that the Corresponding Source is only \"available\" if\n> there are no patents applying to it?  That's the only sensible meaning I \n> can\n> extract, but the license seems to go about saying this in a rather obtuse\n> way.\n>\n> What does (2) really mean?  How can one \"arrange to deprive [oneself] of \n> the\n> benefit of the patent license\" -- by goading the licensor into suing you? \n> :)\n> Otherwise, even if the patent license agreement is terminated on paper, \n> how\n> do you force the patent holder to still treat everyone \"fairly\"?\n\nWell, in many cases patent licences require continuing royalty payments. I'm \npretty\nsure that if you start refusing to pay, but continue to use the patent, you \nwill be sued.\n\nI agree that in the case of a licence involving a flat payment for perpetual \nuse, this clause\ndoes not do much to level the playing feild, as the patent holder is \nunlikely to sue somebody\nwho has made all applicable payments, even if they have nominally terminated \nthe contract.\n\n>\n> But, ok; in spite of the above doubts, they've done a pretty good job of\n> closing the patent loophole, and done so in a way that I think is DFSG-ok.\n>\n\n\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}