{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Jari Oksanen <jari.oksanen@oulu.fi>", "subject": "Re: [R] R2 always increases as variables are added?", "body": "\\u674e\\u4fca\\u6770  gmail.com> writes:\n> > Hi, Lynch,> > Thank you for attention first.> > I am also not a statistician and have just taken several statistics classes.> So it is natral for us to ask some question seeming naive to statisticans.> > I am sorry that I cannot agree with your point that we must always include> intercept in our model. becaus if true intercept is zero, the strategy of> you or your textbook will be have 2 losses. First, there will be> explaination problem. If true intercept is zero and your estimate of it is> not zero, the result of regression is misleading. However, it might be not> so serious as we judge those coefficients which are actually zeros to be> none-zeros, but the misjudge here is still a loss in some> extent. Secondly, if true intercept is zero, your strategy's predictive> ability is often lower than other strategies which do not always include> intercept.> I'm not a statistician, but I've seen much damage done with regression forcedthrough zero in my field (ecology). This technique is tought in many statisticaltextbooks  popular among ecologists. The key problem here is: how do you *know*that the intercept is zero? Even in logically compelling cases it is very easyto reach false certainty of zero intercept. A typical case in ecology is wherepeople study  the number of species against biomass, and argue that there *must*be zero species when biomass = 0 (if there is nothing, then there is nothing).The conclusion is that you must fit a model with no intercept. Let's see atypical example (and I'm so confident that I won't put any random number seedfor this):\nmass <- runif(100, 10, 500) # typical range for plant biomass/m^2spno <- rpois(100, 12) # Moderate number of species independent of masssummary(lm(spno ~ mass - 1)) # WRONG!summary(lm(spno ~ mass)) # More or less correct\nIt is not sufficient to know that the value must be zero in a certain point, youalso should know how that point is scaled: it may make sense to say that spno =0 at log(mass) = -Inf, but then it does not make sense to force regressionthrough that point. In particular, when the zero-point is extrapolated from thedata, it is dangerous to force regression through the origin. Further, if your xdoes not have a really natural scale, but you can replace x with x - constant(like x - mean(x)), then it hardly makes sense to play with zero intercepts.  \nThere may be cases where forcing regression through zero makes sense, but theyseem to be very rare. I've seen them very rarely.\nThere is an exegetic text on the issue athttp://www.stats.ox.ac.uk/pub/MASS3/Exegeses.pdf which also touches this issue(page 3) and makes a nice reading anyhow.\nCheers, Jari Oksanen\n______________________________________________R-help@stat.math.ethz.ch mailing listhttps://stat.ethz.ch/mailman/listinfo/r-helpPLEASE do read the posting guide http://www.R-project.org/posting-guide.htmland provide commented, minimal, self-contained, reproducible code.\n\n"}