{"category": "ham", "to_address": "Ip-health <ip-health@lists.essential.org>", "from_address": "James Packard Love <james.love@keionline.org>", "subject": "[Ip-health] A B-school graduate turns his disease into a business plan -- one that he hopes could literally save his life", "body": "* Kremer, diagnosed with [ALS] just months after enrolling in Harvard\nBusiness School . . . started a scientific competition called\nPrize4Life , modeled on the X PRIZE , which rewards adventurers if\nthey complete a certain challenge.\n\n*  In less than a year, Kremer has generated $4.5 million in\ncontributions.\n\n* Big pharmaceutical companies and even smaller biotechnology firms\ngenerally avoid ALS research, because they perceive it as high-risk,\nsaid Dr. Nicole Szlezak , a Harvard researcher who is science officer\nfor Prize4Life. \"Certain tools that are needed for drug development\nin any disease are not in place in ALS and that's because ALS is\nlittle understood,\" Szlezak said.\n\n* Prize4Life aims to jump-start the field by enlisting scientists the\nworld over. Last November, it released the first of its scientific\nquestions. Researchers are being asked to come up with some way of\ncharting the progression of ALS deep inside the body to more quickly\n-- and less expensively -- determine whether a drug is making a\ndifference. With AIDS, for instance, drug development sped up once\nscientists could test patients' blood for pivotal markers of the\ndisease -- instead of waiting for symptoms to progress or fade.\n\n*  Mass. General's Brown, who sits on the scientific advisory board\nof Prize4Life, said the unorthodox approach is designed to entice\nresearchers beyond the well-known coterie of neurology specialists.\n\"The people already doing ALS research aren't going to be able to\nwork any harder. Big pharma is not going to be influenced by a $1\nmillion prize. The unknown is who's on the fringe,\" Brown said. \"Who\nis out there who would be motivated to apply relevant research to\nALS? That's the group this prize will go after.\"\n\n\nhttp://www.boston.com/news/globe/health_science/articles/2007/05/28/\nthe_business_of_survival?mode=PF\n\nThe Boston Globe\nThe business of survival\nA B-school graduate turns his disease into a business plan -- one\nthat he hopes could literally save his life\n\nBy Stephen Smith, Globe Staff  |  May 28, 2007\n\nAvi Kremer's thoughts and words are locked in a constant hare and\ntortoise race, words unable to keep pace with thoughts.\n\nIt is the singular burden of ALS: The mind remains fiercely active,\neven as the connections from brain to mouth fray. Kremer, diagnosed\nwith the disease just months after enrolling in Harvard Business\nSchool, begins a sentence and stops. Then starts again. And stops.\nSometimes, when a word proves especially recalcitrant, he shakes his\nhead and smiles.\n\n\"I have developed a lot of patience,\" he said.\n\nKremer, whose wheelchair sports a Borat the comedian bumpersticker,\nhas not let the disease steal his humor, his determination, his deep\ndesire to be innovative.\n\nSo he decided to take what he had learned at Harvard and apply it to\na condition that is invariably lethal. His disease became his\nbusiness plan.\n\n\"Avi moved very quickly from the anger stage after diagnosis to a\nvery applied, entrepreneurial stage when he said, 'Let's get on with\nit. Let's find the solution. Let's put the resources on the table to\nempower research,' \" said Kremer's neurologist, Dr. Robert Brown of\nMassachusetts General Hospital .\n\nWith the help of his business school buddies and luminaries in\nneurology research, Kremer, now 32, started a scientific competition\ncalled Prize4Life , modeled on the X PRIZE , which rewards\nadventurers if they complete a certain challenge. Neurologists said\nthey have never heard of anything quite like it.\n\nUsually, researchers get grants as seed money on the front end of\ntheir scientific pursuits. Prize4Life takes that dogma and turns it\ninside out. Scientists get the prize money only after solving crucial\nquestions about ALS -- solutions that could hasten discovery of drugs\nto slow the disease.\n\nBut once Kremer and his classmates had the idea for a prize, the next\nquestion was how would they raise the money? They came up with the\nidea of offering potential donors a money-back guarantee: If our\nscientific contest yields results, that's your dividend. If there's\nno solution to the riddle, we'll return your donation.\n\nThe pitch is working. In less than a year, Kremer has generated $4.5\nmillion in contributions.\n\nA few months back, former Israeli Prime Minister Ehud Barak arranged\nfor Kremer, once a wiry platoon leader in the Israeli Defense\nForces , to meet with New England Patriots owner Robert Kraft, who\nwas so moved that he donated $250,000.\n\n\"I don't think that they're giving us their money out of pity,\nbecause otherwise Robert Kraft could have given us $2,500, not\n$250,000,\" Kremer said. \"But I do think that the fact that I'm\nafflicted by ALS, I think they're really convinced of the message\nthat we are going to use the money wisely because my life depends on\nit.\"\n\nRena Clark , vice president of community affairs and corporate\nphilanthropy for the Patriots, has sat through dozens of\npresentations from worthy causes.\n\n\"This was by far the most emotional,\" she said. \"Avi is fighting a\npretty valiant fight here.\"\n\nThat fight begins and ends every day in a dormitory suite on the\nHarvard Business School campus, where Kremer's work as a research\nassociate has allowed him to continue to live since his 2006 graduation.\n\nIn his two-room suite, there's a photo of Kremer and his military\npals, and another picture frame emblazoned with the message, \"The\nSky's the Limit -- Class of 2006.\" There's a phone with big buttons\nto make it easier to dial and a bathroom with a wide door to\naccommodate Kremer's motorized wheelchair. A banner in the living\nroom proclaims, \"Cure ALS.\"\n\nEven as his condition deteriorates, Kremer manages to navigate the\nterrain of the business school campus, using his foot to jab at the\nbuttons that automatically open doors.\n\nUntil recently, he traveled across the nation, meeting with anyone\nwho would listen to his story. Now, his campaign is waged largely via\ncomputer -- modified so that he can move the mouse by moving his head.\n\nPatients with narratives to tell have changed the course of research\nin other diseases, from cancer to Parkinson's to spinal cord\ninjuries. Having Kremer as the face of Prize4Life \"brings a sense of\nurgency,\" said Lorenzo Refolo , who heads ALS programs at the\nNational Institute of Neurological Disorders and Stroke . \"It brings\na sense of need.\"\n\nThe first sign that something might be wrong with Avi Kremer arrived\na few months before he landed in Boston. An odd tremor shook his\nright forearm. It's probably nothing, Kremer figured. But the twitch\npersisted as he prepared to leave his hometown of Haifa, the heart of\nnorthern Israel.\n\nBy the time he started his studies at Harvard, Kremer had begun to\nsuspect something might be seriously wrong. Brown made the diagnosis:\namyotrophic lateral sclerosis , a condition afflicting as many as\n50,000 Americans.\n\nNot much has changed since baseball legend Lou Gehrig died of ALS in\n1941. Most patients still live only three to five years after\ndiagnosis, and only 10 percent, including famed scientist Stephen\nHawking , last a decade or more.\n\nKremer's dresser is testament to that hopelessness. It is freighted\nwith vitamins and supplements, which he trusts will give him strength\nand sustenance. There's only one medication for ALS, which Kremer\ntakes, but the pill only extends survival by a few months.\n\nIt was the frustratingly slow pace of research into ALS that goaded\nKremer and his friends into action.\n\n\"Traditional fund-raising and donations to traditional nonprofit\norganizations weren't providing the catalyst for research,\" said Nate\nBoaz , a classmate of Kremer's and co-founder of Prize4Life.\n\nBig pharmaceutical companies and even smaller biotechnology firms\ngenerally avoid ALS research, because they perceive it as high-risk,\nsaid Dr. Nicole Szlezak , a Harvard researcher who is science officer\nfor Prize4Life. \"Certain tools that are needed for drug development\nin any disease are not in place in ALS and that's because ALS is\nlittle understood,\" Szlezak said.\n\nScientists can't even say for sure why the nerve cells that steer\nmuscles, known as motor neurons, start to die, leading to a\nrelentless weakening of muscles from the limbs to the diaphragm, with\npatients ultimately dying because they can no longer breathe.\n\nPrize4Life aims to jump-start the field by enlisting scientists the\nworld over. Last November, it released the first of its scientific\nquestions. Researchers are being asked to come up with some way of\ncharting the progression of ALS deep inside the body to more quickly\n-- and less expensively -- determine whether a drug is making a\ndifference. With AIDS, for instance, drug development sped up once\nscientists could test patients' blood for pivotal markers of the\ndisease -- instead of waiting for symptoms to progress or fade.\n\nMass. General's Brown, who sits on the scientific advisory board of\nPrize4Life, said the unorthodox approach is designed to entice\nresearchers beyond the well-known coterie of neurology specialists.\n\n\"The people already doing ALS research aren't going to be able to\nwork any harder. Big pharma is not going to be influenced by a $1\nmillion prize. The unknown is who's on the fringe,\" Brown said. \"Who\nis out there who would be motivated to apply relevant research to\nALS? That's the group this prize will go after.\"\n\nBut Brown said he's \"not at all sure this model will work.\"\n\n\"I have definitely heard other esteemed people in the field of ALS\nresearch ask about whether this is a diversion of resources and\nenergy that will actually slow progress,\" he said.\n\nStill, there are encouraging signs. Prize4Life scientists this month\nselected five winners in the first round of the challenge, giving\neach $15,000. The deadline for a prize of $1 million is November 2008.\n\n\"Some of those entries came from people who had nothing to do with\nthe ALS research community and their interest was entirely sparked by\nthis prize approach,\" said Adrian J. Ivinson , director of the\nHarvard Center for Neurodegeneration & Repair and a member of the\nPrize4Life scientific advisory board. \"We didn't know how the\nscientific community would react. We didn't know if people would turn\ntheir nose up at it out of principle.\"\n\nNext month, Kremer plans to return to Israel. His little sister is\ngiving birth to her first child, Kremer's first nephew. The family\nwill celebrate the arrival of a new generation and all the hope that\ncomes with it.\n\nYes, he said, he anticipates that while home in Haifa, his father and\nmother, a dermatologist and a nurse, will plead with him to stay\nthere. They are parents consumed with concern about their oldest\nchild. They have asked him to come back home before.\n\n\"But this,\" he said, his eyes scanning his dormitory room, \"is my life.\"\n\nStephen Smith can be reached at stsmith@globe.com.\n\n\n----------------------------------------------\nJames Packard Love\nKnowledge Ecology International\nmailto:james.love@keionline.org\ntel. +1.202.332.2670 / U.S. mobile+1.202.361.3040, Geneva mobile\n+41.76.413.6584\n\n\"If everyone thinks the same: No one thinks.\" Bill Walton\"\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}