{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Brain Stephenson\" <hoqdarttournamentsmac@darttournaments.com>", "subject": "Burn pounds off with Anatrim", "body": "\nObesity is dangerous, stop it\n\n\n\n\n\nAnatrim – The very up-to-date and most enchanting product for over-weight people is now easily available – As you could see on Oprah\n\n\n\nDo you see excessive body kilograms kill very much people around the world? We know that you hate the unattractive appearance of those people and the low status they have in modern society. \n\nOr, maybe, you can’t withstand pressure of terrible eating habits of yours. Does it all sound familiar? Then we have something for you!\n\n\n\n\n\nWe are proudly introduce you Anatrim, the later product for the reduction of your body’s extra weight. The astounding thing about Anatrim is it improves the quality of your life by making you eat less and giving you better mood. Read some e-mails from our customers:\n\n\n\n\n\n\"This is great! \n\n\nI stopped stuffing myself with food and watching TV continually \n\n\nI became more interested in exercise.\n\n\n\n\n\n\n Anatrim got me back on the right track.\n\n\n I feel fit now and there are lots of men around me!\"\n\n\n\n\n\n\nAmelia B., Boston\n\n\n\n\n\n\n\"I tried some passive weight burning, you know, but with no result. This terrible hunger would just rush in and spoil everything. \n\n\nOnce I heard on Anatrim from my very best friend and I was really impressed at the information.\n\n\n I had attempted using it, and my wife said to me that I look very good now, 5 months later. \n\n\n32 pounds off and I keep still losing them! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nMikkey Fox, Bellevue WA\n\n\n\n\n\nAnatrim helps you to realize you doesn’t have such a great need for that much food. It raises your mood up, provides you with additional energy, and attacks useless kilos. All thanks to its powerful original formula!!\n\n\n\nPry out more!\n\n\n\n"}