{"category": "ham", "to_address": "\"Sugar List\" <sugar@laptop.org>", "from_address": "\"Eben Eliason\" <eben.eliason@gmail.com>", "subject": "[sugar] Activity Mockups and Information Resources on Wiki", "body": "I wanted to take the time to alert everyone to the fact that a new\nsection of the wiki exists for the purposes of providing both visual\nand functional specifications for activities, as well as a place for\naggregating useful information and discussions surrounding each one.\nThe main entry point is wiki.laptop.org/go/Activities.  I'd like to\nhighlight a few aspects of the activity specific pages:\n\n1) Myself and the team at Pentagram are busy creating visual mockups\nwhich conform to the Sugar style as specified in the HIG for all base\nactivities.  Though not final, these can act as a working target\nspecification for developers.  So far we have basic mockups for Read,\nWrite, Chat, Video Chat, Draw, and Browse.  Others will follow in\ncoming weeks.\n\n2) The visual elements are backed by descriptions of general\ninteraction goals for the activities, as well as specific goals\nregarding their collaborative aspects.  While the visual designs and\ndescriptions provide a good overview, the design team is happy to\ndiscuss details, as it's hard to capture them all in these forms.\n\n3) Each page contains a section for development.  This section should\ninclude up to date links to the source, RPMs, and other resources that\nrelate to the development effort.  In addition, a link in this section\nleads to a version history page for the activity.  We kindly request\nthat developers keep a detailed version history in this location so\nthat we can track the design and implementation together over time.\n\n4) The discussion pages for each activity contain a skeleton,\nproviding spaces to request features (and comment on those already\nlisted in the goals) and to discuss implementation.  Hopefully this\nwill serve as a useful space for aligning the ideas of the design and\ndevelopment teams.\n\nSide note: I haven't altered the wiki pages for activities which\nalready existed.  However, it may prove helpful to transform them a\nbit, at least adding most of the sections listed above if not\nreorganizing, in order to have a convenient and consistent way to\ndesign, discuss, and track progress of activities going forward.\nThanks!\n\n- Eben\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}