{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nFriday, 13 April, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nHiddink dismisses link to Chelsea\nGuus Hiddink tells Football Focus he will not become Chelsea manager in the summer.\n\n\n\n \nRonaldo signs new deal at Man Utd\nPortuguese winger Cristiano Ronaldo puts pen to paper on a new five-year contract at Man Utd.\n\n\n\n \nHargreaves set to discuss future\nOwen Hargreaves expects to hold talks in the next few weeks with Bayern Munich about his future.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nJacquelin forges clear in China\nFrance's Raphael Jacquelin holds a two-shot lead from Australian Blyth at the Volvo China Open.\n\n\n\n \nKelly sets the pace in Carolina\nJerry Kelly takes a two-shot lead at the end of the first round of the Verizon Heritage tournament in South Carolina.\n\n\n\n \nChina Open leaderboard\nThe latest scores from the European Tour event in Shanghai.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nHamilton takes second in practice\nKimi Raikkonen goes fastest in practice for the Bahrain Grand Prix ahead of Briton Lewis Hamilton.\n\n\n\n \nBayliss defies finger amputation\nWorld Superbike champion Troy Bayliss makes light of the loss of a finger to take provisional pole in Valencia.\n\n\n\n \nRaikkonen up to speed for Bahrain\nFerrari's Kimi Raikkonen hopes to have put his engine problems behind him in time for this weekend's race in Bahrain.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nHamilton seeks to make F1 history\nLewis Hamilton could make Formula One history by claiming a third consecutive podium finish in Sunday's Bahrain Grand Prix.\n\n\n\n \nRaikkonen up to speed for Bahrain\nFerrari's Kimi Raikkonen hopes to have put his engine problems behind him in time for this weekend's race in Bahrain.\n\n\n\n \nTodt would welcome Brawn return\nFerrari chief Jean Todt says the team has first refusal if former technical boss Ross Brawn decides to return to Formula One.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nO'Sullivan winds down in Dublin \nSonia O'Sullivan will make her final Irish road race appearance in Sunday's Great Bupa Ireland Run.\n\n\n\n \nLiu signs up to run in British GP\nChina's Olympic 110m hurdles champion and world record holder Liu Xiang will compete in the British Grand Prix in Sheffield in July.\n\n\n\n \nJones takes Irish Athletics role\nFormer UK Athletics performance director Max Jones is appointed as Ireland's director of athletics.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nCooke boosted ahead of Cup race\nNicole Cooke sets a new world rankings record ahead of the third World Cup race of the season.\n\n\n\n \nHammond takes second in Belgium\nBritain's Roger Hammond finished in second place in the Gent-Wevelgem one-day classic in Belgium.\n\n\n\n \nCooke powers to Belgium victory\nWelsh cyclist Nicole Cooke wins the Tour of Flanders to extend her World Cup lead.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nReview of the week\nBack to the future with Life on Mars and Manchester United\n\n\n\n \nHolloway column\n\"I won't be having a bet on the Grand National - I've never met a skint bookie\"\n\n\n\n \nKP's rough guide to Britain\nListen to Pietersen spoof on new Radio 4 show Look Away Now\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}