{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone. \n \nThis is Harry Smith filling in for Katie.\n \nIt has been nine days since Don Imus made the inflammatory\n  on-air comments about the Rutgers women’s\n  basketball team and now he has been fired by CBS. His career might be in dire\n  straits, but he did get a hint of redemption from the young basketball players,\n  who have accepted his apology. Could all this fury perhaps lead to a more\n  civil tone in American media? Nancy Cordes will have the story.\n \nWe’ll also give you an update on New Jersey\n  Gov. Jon Corzine, who was badly injured in a car crash on the Garden State Parkway\n  while en route to mediating the meeting between Imus and the women’s\n  basketball team. \n \nPakistan’s\n  president Pervez Musharraf is facing his harshest criticism since 9/11 for\n  not doing more to fight terrorism. Despite that the Taliban threat seems to\n  be growing on both sides of his country’s border with Afghanistan, Musharraf defends\n  his efforts. Our chief foreign correspondent Lara Logan sat down with\n  Musharraf and tonight we’ll share her interview with you. (And later\n  you’ll be able to see the whole interview online at CBSNews.com.)\n \nBack in America, Jim Axelrod will report\n  on one of the frontrunners for the GOP presidential nomination: Mitt Romney. The\n  former Massachusetts governor has worked\n  hard to portray himself as a Washington\n  outsider and has had great success fundraising. But will voters warm up to\n  his religion?\n \nSixty years ago this Sunday, Jackie Robinson broke\n  baseball’s color barrier. Tonight, Cynthia Bowers will introduce you to\n  a man who, nearly 50 years ago, wrote letters of admiration to Jackie. What’s\n  amazing: Jackie wrote back. We will share some of his correspondence with\n  you. \n \nFinally, Steve Hartman will have for Assignment\n  America the story of Arnold Blume, a man who may be the country’s\n  oldest substitute teacher. \n \nI hope you’ll join us and have a great weekend.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}