{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Littlefield, Tyler\" <compgeek13@gmail.com>", "subject": "Re: help with hd problem.", "body": "You can also edit by hitting e, at grub prompt, and then editing grub.\nBut, It's already root hd(0, 0)\nThanks,\n~~TheCreator~~\n[My programs don't have bugs; just randomly added features]\nmsn:\ncompgeek13@gmail.com\naim: st8amnd2005\nskype: st8amnd127\nvertigo head coder\nweb: tysdomain.com\n----- Original Message ----- \nFrom: \"Spie Sutherland\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Thursday, June 21, 2007 9:15 PM\nSubject: Re: help with hd problem.\n\n\n> Cody Hurst wrote:\n> you cannot mix hd installs with other machines because when you install\n> linux, it is compiled and molded to that particular system and no other\n> systems I have the same issue when I do it. Do a clean install on the\n> machine you want to run it on.\n> \n> Say what? This is not true, I have done it dozens of times. I have in \n> fact set up machines as build machines for others. The only thing that\n> is \"molded\" is the kernel. As said in recent thread, what you need is \n> a generic kernel, not pentium or amd specific. To be more clear, in \n> the kernel config, you want 386 processor:\n> \n> Subarchitecture Type\n> PC-compatible  (CONFIG_X86_PC)\n> \n> Processor family \n> 386  (CONFIG_M386) \n> \n> A 386 kernel will boot on anything. You also want generic chipset\n> stuff, not anything specific to the original hardware. The easiest way\n> to achieve this is to get one of the already made generic kernels, \n> the ones that boot when you run an install. On slackware that is \n> called bare.i, it will boot on anything! Equivalents are available on \n> other distros. And repeating what I said before: if a kernel will \n> not boot on any system, boot with floppy or cd, load the kernel\n> from that media but use the root= parameter to boot into the \n> root on the hard drive. This has never failed for me unless the\n> drive is toast. You need to catch the boot: prompt and do \n> something like \n> \n> boot: bare.i root=/dev/hda1 noinitrd ro \n> \n> where bare.i is the name of your generic kernel. You should\n> be able to find a generic kernel for debian. Once you have \n> booted from the CD or floppy, with the root= to your hard\n> drive, you have a running system, build a kernel on the target\n> and then update bootloader. It is definitely possible to move \n> drives from one machine to another. \n> \n>  -- Spie\n> \n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}