{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "Briscoat Global Ltd <admin@briscoatglobal.co.uk>", "subject": "Part Time Job Offer ( Work From Home And Get Paid )", "body": "\nDear Sir/Ma,\n\nThis is to introduce our company Briscoat Global Manufacturing Company\nUnited kingdom Limited to United states and Canada. The company was establised\nin 1946 with its first branch in Southampton and also started as a sole\nbusiness until 1949 when the company opened an opportunity for\npartnership. Today, the company is proud to inform the general public that we have more\nthan 3000 employees all over Africa, Asia, The Antartica and\nEastern Europe.\n\nOUR AREA OF SPECIALISATION:\n\nBriscoat Global Mfg. Co., Ltd., a specialist in the production of\nvariety of Rubber belts such as power transmission belts, conveyor belts and\nindustrial rubber products etc,\n\nOUR AIM/VISION:\n\nWe aim to be the best and the best in employing the under-priviledged\npeople and also the unemployed individuals all over the world and also to\nensure the provision of Responsibility, Creativity and Quality Policy.\nWe offer superior products & services to meet customer's satisfactory at\nreasonable prices and keep running forward.\n\nWe have reached big sales volume of industrial rubber products in the\nUnted Kingdom and asia and now trying to penetrate the United States and Canada market. Quite soon we\nshall open representative offices or authorized sales outlets in the Unted states\nand therefore we are currently looking for people who will assist\nus in establishing a new distribution network there.The fact is that\ndespite the United states market is new for us we already have regular clients also\nspeaks for itself.\n\n\nWHAT WE REQUIRE OF YOU:\n\nThe international money transfer tax for legal entities (companies) in\nunited Kingdom is very high, This is of unfavourable condition to the company.\n\nThe tax for international money\ntransfer made by a private individual is 7% .That's why we need you! We\nneed agents to receive payment for our industrial rubber products from our customers\n\nand to resend the money to us via our bank account in\nUnited kingdom or Western union while the tax shall be 7% intead of 25% which will absolutely\nfavour our company.\n\n\nJOB DESCRIPTION\n\n1. Reciept of payments made by Clients either by cheques, Balance\nTransfer or bank to Bank Electronic transfer\n\n2. Cash Payments at your Bank\n\n3. Deduction of 10% made payable to employee as commission on each\npayment processed.\n\n4. Forwarding the balance after the deduction of 10% commission to\noffices which shall be provided by us as soon as the fund becomes\navailable.\n\nYOUR TOTAL EARNINGS:\n10% from each operation! For instance: you receive 5000 pounds via any\nmeans of payment listed above on our behalf, your commission will $500\npounds (10% of 5000 Dollars ) for yourself on each transaction. At the beginning your\ncommission will equal 10%, though later it will increase up to 12%!\n\nThe more transaction you make, the more your earnings and also the tendency of increasing your commission rate.\n\nADVANTAGES:\n\nYou do not have to go out as you will work as an independent contractor\nright from your home office. Your job is absolutely legal.\nYou can earn up to 3000-4000 Dollars monthly depending on time spent on\nthis job. You do not need any capital to start. You can do this\nconviniently without leaving or affecting your present Job. The employee who\nmake more effort and work harder has strong possibility of becoming a\nbranch manager at any of our branches nearer to your neighbourhood.\nAnyway, We are proud to say our employees never been reduced due to our\nexcellent work condition.\n\nELIGIBILITY:\nInterested person must be at least 18 years or older legally capable\nresponsible ready to work 3-4 hours per week.with PC knowledge e-mail and\ninternet experience (minimal).\n\nKindly contact us on briscoatadmin@sify.com to enable you know more about our company.\n\nBest Regards,\nAdmin/Human Resources Manager,\n\nRaymond George\n\n\n\n"}