{"category": "ham", "to_address": "IP-Health <ip-health@lists.essential.org>", "from_address": "Benjamin Krohmal <ben.krohmal@keionline.org>", "subject": "[Ip-health] Thai Minister of Health named chair of UNAIDS board", "body": "--\n[ Picked text/plain from multipart/alternative ]\n\nhttp://www.zeenews.com/znnew/articles.asp?aid=372467&sid=WOR\n\nThai Health Minister Mongkol to chair UNAIDS board\nBangkok, May 21: Thailand's Public Health Minister Mongkol Na\nSongkhla has been appointed chairman of the UNAIDS board, effective\nlate next month.\n\nDr. Peter Piot, head of the joint United Nations Program on HIV/AIDS,\ninvited Dr. Mongkol to take up the post as the chairman of the\nprogramme coordinating board for the joint United Nations Programme\non HIV/AIDS (UNAIDS) on June 25 for a one-year period. He succeeds\nSweden's Minister for International Development Cooperation Carin\nJamtin.\n\nDr. Mongkol said he would chair his first meeting of the UNAIDS board\non June 25.\n\nHe said he had accepted the invitation by Dr. Piot because of his\nsupport for Thailand since December last year on the issue of\ncompulsory licensing for drugs treating heart disease and HIV/AIDS.\n\nIn accepting the post, Dr. Mongkol said it was an honour for Thailand\nas the country had managed to control the deadly AIDS problem to a\nrelatively satisfactory level, for which the kingdom has been\nrecognized by the international community.\n\nThe UNAIDS board comprises 37 members, 22 of which are from member\ncountries, 10 from UN agencies and the remaining five from social\norganisations. Board members hold two meetings annually.\n\nHe said his immediate task in the job was to reform the agency,\nbecause over 40 million people worldwide were HIV/AIDS infected and\n95 per cent of them live in developing countries. Most people with\nHIV/AIDS acquired the disease through having sex without using condoms.\n\nBureau Report\n\n\nBenjamin Krohmal\nCoordinator - Project on Medical Innovation\nKnowledge Ecology International\nTel: +1-202-332-2670 ex. 17\nFax: +1-202-332-2673\nben.krohmal@keionline.org\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}