{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Arnoud Engelfriet <arnoud@engelfriet.net>", "subject": "Re: Logo trademark license vs. copyright license", "body": "Francesco Poli wrote:\n> On Wed, 18 Apr 2007 20:19:19 +0200 Arnoud Engelfriet wrote:\n> > The mere fact that I use the name and logo of the project can't\n> > be reason enough to assume affiliation or association.\n> \n> Mmmh, the Debian Official Use Logo implies endorsement by the Debian\n> Project.\n\nYes, that's the goodwill you have built up with that logo. You\ncreated that because of the way you used the logo. And that is\nalso the weakness of trademarks: if you allow people to do too\nmuch with them, you lose your goodwill, and then it's all over.\n\n> Hence, if someone places the Official Use Logo on his/her products and\n> sells them, he/she is asserting that those products are endorsed by the\n> Debian Project: if they are not actually endorsed, he/she is misusing\n> the logo.\n> \n> Or not?\n\nI can't tell from the logo that it implies endorsement by the\nDebian Project. So how do I assert endorsement when I put that\nlogo on, say, my car repair shop?\n\n> To use them as long as there's no confusion going on.\n> If a logo means endorsement, you cannot use it on non endorsed products.\n\nIf the license works like this, I cannot take the official logo\nand use it to promote my car repair business. \n\nI thought the whole idea was that I *could* put the Official Use\nlogo on anything, as long as I didn't falsely pretend my product\nwas endorsed. My car repair business has nothing to do with\nthe Debian Project, no one will be confused about the origin of\nmy service and I do not pretend I am an affiliate of Debian.\n\nIf you do want to permit this, there won't be much difference\nbetween the Official and the Open logo anymore. \n\nIf you don't want to permit this, then maybe this open trademark\nlicense is not the right choice. You need some pretty tough\nusage restrictions if you want to control the official use logo\nto that extent.\n\nArnoud\n\n-- \nArnoud Engelfriet, Dutch & European patent attorney - Speaking only for myself\nPatents, copyright and IPR explained for techies: http://www.iusmentis.com/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}