{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Crystal Mejia <ioc-hq@gooiland.com>", "subject": "Hymen penetrator", "body": "\n\nTired with your sexual problems? Can't have sex like you had 10 years ago? \nAll this you can find here\nViagra and Cialis will help you in any situation. \nEverything for your sexual health\nSwitch on your penis!\nWith best regards,\nCrystal Mejia\n \n \nKak raz hvatilo, chtoby utolit zhazhdu. I realnoj budet Tvoia smert. A mir, Konechno zhe, zhivet po etim samym magicheskim zakonam, bud oni neladny. Slovno v predchuvstvii Podzatylnika, koimi menia v detstve shchedro nagrazhdala matushka, kogda ia norovil Pobezdelnichat, i posle kotoryh prihodilos izobrazhat usilennuiu deiatelnost. \nBolee togo, v ego Otvete prozvuchala neprikrytaia ironiia: Tebe kak otvetit na vse srazu ili na kazhdyj vopros v otdelnosti? Kak pozhelaesh. On, oshchutiv vnimanie, glianul v otvet, voprositelno pripodniav levuiu brov, No obsuzhdavshaia ego troica tut zhe otvernulas. Zatem glianul na menia: chto znachil tvoj krik, inop? Ty ne hotel, chtoby ia prikonchil etogo Strazhnika, kotoryj byl zaodno s shefirom? Ia uzhe paru raz videl etogo tipa s Shefirom ranshe i nichego horoshego iz podobnoj kompanii ne moglo poluchitsia. Ty ne budesh protiv, Niks, esli ia tebia sproshu, chto u tebia proizoshlo s Dosom? Esli, konechno, ty kakim-to obrazom ne izbezhal s nim vstrechi posle Nashego. Sejchas, vozmozhno, v ego rukah Byla sudba vsego Habusa. Navernoe, eti koshmary poseshchaiut kazhdogo malchishku ili Devchonku, kotoryh sudba zapisala v ucheniki Presvetlogo Doma. Prokliatie, ne sleduet tak dazhe Dumat pro sebia v prisutstvii Ubijcy. Kogda zhe on nauchitsia obuzdyvat svoi chuvstva i sna!\nchala dumat, a potom Delat? Poka u nego vsegda vyhodilo naoborot, i lish masterstvo mechnika Pozvolialo emu nasazhdat sobstvennuiu pravotu v spornyh situaciiah v ugodu svoemu Impulsivnomu harakteru. \nSprava ot okna raspolagalsia pismennyj stol s ploskim Gorizontalnym terminalom nastolnogo gipertransliatora v centre. Velikie altruisty? No kak s etim sviazat bojniu na ploshchadi? Nkot ne ostavil Ni edinogo shansa ni odnomu iz liudej shefira, okazavshihsia v zabroshennom Gorode. Gordost sderzhala ee Slezy i skomkala otchaianie. Strast-to kakaia! Chto zhe delat? Delat-to chto? Mysli Mihkaia lihoradochno Zametalis v poiskah vyhoda. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}