{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Wall Street Journal: Brazil to Break Patent On Merck AIDS Drug", "body": "http://online.wsj.com/article/SB117829976582992421.html\n\nBrazil to Break Patent\nOn Merck AIDS Drug\nBy ALASTAIR STEWART\nMay 5, 2007\n\nSAO PAULO -- Brazilian President Luiz Inacio Lula da Silva Friday\nsigned a compulsory license, breaking the patent on an anti-retroviral\nAIDS drug made by the U.S. pharmaceutical giant Merck & Co.\n\nBrazil's government issued the groundbreaking decree after rejecting a\nMerck offer to sell the drug at $1.10 per pill, the equivalent of a 30%\ndiscount.\n\nBrazil claims the price is unjust considering it can acquire the drug\nfor $0.45 from generic manufacturers, the president said in a\nstatement. \"Between our trade and our health [interests], we chose to\nprotect our health,\" said President Lula in Brasilia at a ceremony\nmarking the signing of the decree.\n\nJose Gomes Temporao, Brazil's health minister, said: \"We had eight\nmeetings with Merck and at none of them did they present a satisfactory\nproposal. At best, they proposed a 30% discount. We told them we needed\na 60% discount.\"\n\nMerck said in a statement that it is \"profoundly disappointed\" by\nBrazil's decision to break the patent.\n\nA compulsory license allows a country to manufacture or buy generic\nversions of patented drugs while paying the patent holder only a small\nroyalty. Brazilian law and rules established under the World Trade\nOrganization allow for compulsory licenses in a health emergency or if\nthe pharmaceutical industry uses abusive pricing.\n\nThis is the first time Brazil has overridden a drug patent after\nthreatening to do so on various occasions in the past.\n\nAfter Thailand moved to override patents on three anti-AIDS drugs,\nincluding those made by Abbott Laboratories and Merck, the U.S. placed\nThailand on a list of copyright violators.\n\nDuring the signing ceremony, Mr. Lula warned that Brazil could break\nother patents, if prices weren't affordable. \"People shouldn't be able\nto get rich through the misfortune of others,\" he said.\n\nThe U.S.-Brazil Business Council expressed alarm at Brazil's decision.\n\n\"Just days after Brazil was recognized for improving its enforcement of\nintellectual property rights, this is a major step backward for the\ncountry's development. Brazil is working to attract investment in\ninnovative industries that rely on IP, and this move will likely cause\ninvestments to go elsewhere,\" the council said in a statement.\n\nBrazil provides free AIDS drugs to anyone who needs them and\nmanufactures generic versions of several drugs that were in production\nbefore Brazil enacted an intellectual property law in 1997 to join the\nWTO.\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}