{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 127", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. (no subject) (Museum Security Network Mailing list)\n   2. An Impasse in Italian Talks Over Return of Artifacts\n      (Museum Security Network Mailing list)\n   3. Gold Bathtub Worth $1M Stolen From Japanese Hotel\n      (Museum Security Network Mailing list)\n   4. Prosecutor narrows charges in art heist\n      (Museum Security Network Mailing list)\n   5. US. Suspect arrested, charged in theft of 1823 atlas worth\n      $60,\t000 (Museum Security Network Mailing list)\n   6. UK. Art thief in Axminster (Museum Security Network Mailing list)\n   7. CASA DE SUBASTAS INICI? VENTA DE PATRIMONIO ROBADO AL PER?\n      (Museum Security Network Mailing list)\n   8. Mexico. Detienen a ladr?n de arte sacro, en Atizap?n\n      (Museum Security Network Mailing list)\n   9. China. Removal of cultural relics older than 1911 banned\n      (Museum Security Network Mailing list)\n  10. Canada. Bedard's boyfriend tells jury that he misjudged\n      Olympian girlfriend's family (Museum Security Network Mailing list)\n  11. UK. Floors Castle paintings stolen\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Fri, 1 Jun 2007 17:05:34 EDT\nFrom: Museum Security Network Mailing list \nSubject: [MSN] (no subject)\nTo: msn-list@te.verweg.com\nMessage-ID: \nContent-Type: text/plain; charset=\"ISO-8859-1\"\n\n \nJudge Restricts Movement\nOf  Nazi-Looted Painting\nAssociated  Press\n\n\nPROVIDENCE, R.I. -- A federal judge on Friday granted a request  by the \nestate of a late Jewish art dealer to stop an elderly German baroness  from further \nmoving a painting that it claims was looted by the Nazis. \nU.S. District Judge Mary Lisi also ordered Maria-Luise  Bissonnette, who \ninherited the painting and now lives in Providence, to permit  representatives \nfrom Max Stern's estate to inspect the artwork and ensure it is  being stored \nproperly and in appropriate condition. \nThe Canadian foundation that inherited Mr. Stern's estate filed a  lawsuit in \nfederal court in Providence last year to reclaim the 19th century  painting, \n\"Girl from the Sabiner Mountains,\" by Franz Xaver Winterhalter. The  painting \nwas auctioned under duress after the Nazis forced Mr. Stern to close a  family \ngallery in 1937 under the German government's anti-Jewish laws, according  to \nthe suit. \nThe painting was acquired by Ms. Bissonnette's stepfather, Karl  Wilharm, and \nwas later inherited by the woman. Lawyers for the plaintiffs say  Ms. \nBissonnette secretly rushed the painting to Germany after learning the  estate was \nconsidering a lawsuit. Ms. Bissonnette said last week that she and  her family \nhad done nothing wrong. \nJudge Lisi on Friday said Ms. Bissonnette could not move the  painting again \nwithout court permission. The two sides had been negotiating but  have reached \nan impasse, Samuel Zurier, a lawyer for the estate, told the judge.  Also \nFriday, Ms. Bissonnette's local lawyer withdrew from the case because of  \ndifferences of opinion with his client. \nCopyright ? 2007 Associated  Press\n\n\n\n************************************** See what's free at http://www.aol.com.\n\n\n------------------------------\n\nMessage: 2\nDate: Fri, 01 Jun 2007 21:37:22 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] An Impasse in Italian Talks Over Return of Artifacts\nTo: Museum Security Network Mailinglist \nMessage-ID: <46607572.6080205@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nAn Impasse in Italian Talks Over Return of Artifacts\nBy ELISABETTA POVOLEDO\nMay 26, 2007\n\nROME, May 25 ? After months of intense discussions, negotiations between a New York antiquities collector and the Italian government have bogged down over a demand that she never be pursued by Italy again, several people close to the talks say.\n\nItaly is seeking the return of nine artifacts from the collector, Shelby White, contending that they were looted from its soil.\n\nLawyers for both sides had been optimistic earlier this year that a deal could be struck. But an impasse developed over Ms. White?s insistence that in exchange for the objects, the Italian Culture Ministry grant her immunity from legal action of any kind and promise not to go after anything else she owns or acquires in the future, people familiar with the talks said.\n\nItalian officials do not suggest that Ms. White or her husband, the financier Leon Levy, who died in 2003, knowingly bought artifacts whose provenance was suspect. But they say that forgoing potential investigations of any suspected wrongdoing in the future would essentially allow tomb robbers and dishonest dealers to traffic with impunity.\n\nRestricting an inquiry would be tantamount to ?collaborating with the pillaging,? an Italian official who is following the negotiations asserted in an interview. He said he did not want his name used because both sides had agreed not to discuss the negotiations until a formal agreement had been struck.\n\nMs. White?s spokesman, Fraser Seitel, declined to discuss the specifics of the situation, but said that Ms. White ?remains hopeful that an accord will be reached.?\n\nOver three decades Ms. White and Mr. Levy amassed one of the world?s finest private collections of classical antiquities. Some two dozen pieces in their collection are on view in the new Greek and Roman galleries at the Metropolitan Museum of Art in New York, which were inaugurated last month. Mr. Levy and Ms. White, who is a trustee of the museum, are said to have donated about $20 million to create the galleries, whose centerpiece, a vast Roman-style court, bears their names.\n\nSome Italian negotiators had hoped that a pact could be announced in advance of the Met opening ? one of the biggest events of the spring art season ? to heighten awareness of the looting of archaeological sites. (Some critics of Italy?s aggressive pursuit of foreign collections say that it has relied more on negative news media exposure than on moral suasion.)\n\nLast November the Italian Culture Ministry presented Ms. White with a list of more than 20 pieces in her collection that its investigators had tracked to dealers who Italy says have been linked to looted antiquities. (The list was narrowed to nine during the negotiations.) Those dealers include Giacomo Medici, an Italian antiquities dealer who is appealing a 2004 conviction in a Rome court for dealing in illicit archaeological artifacts, and Robin Symes, a London dealer under investigation here who has not been indicted.\n\nItalian officials say that Ms. White is under no legal obligation to return anything but that they hope to appeal to her sense of fairness. They cite recent agreements with the Met and the Museum of Fine Arts, Boston, which both transferred title of rare objects to Italy after being presented with evidence that they had been looted from there in recent decades.\n\nItaly is also negotiating for the return of antiquities from the Princeton University Art Museum and the Cleveland Museum of Art. But talks have broken down with the J. Paul Getty Museum in Los Angeles. Several of the pieces Italy is demanding from the Getty originally belonged to Barbara and Lawrence Fleischman, another important collecting couple.\n\nAdding to the pressures on the Getty, a former antiquities curator at the museum and an American dealer have been on trial in Rome since 2005 on charges of conspiring to acquire looted artifacts. The outcome of that trial and Ms. White?s negotiations with Italy have been avidly awaited by the tiny network of antiquities dealers in the United States and abroad.\n\nItalian officials and archaeologists say that other collectors who have purchased artifacts in recent years from the galleries and dealers that are under Italian scrutiny may have cause for worry about their investments.\n\n?If you try and resell the objects, the cultural ministry could start an injunction, and if you try to give them to a museum, it risks being asked to give it back,? said David Gill, a professor of archaeology and ancient history at the University of Wales in Swansea. ?You can?t be remembered as a great benefactor.?\n\nIn a 1999 study Mr. Gill and Christopher Chippindale, another British archaeologist, wrote that 93 percent of the objects in an exhibition of Levy-White artifacts at the Met had no established provenance. \n\nhttp://www.nytimes.com\n\n\n\n------------------------------\n\nMessage: 3\nDate: Fri, 01 Jun 2007 21:38:00 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Gold Bathtub Worth $1M Stolen From Japanese Hotel\nTo: Museum Security Network Mailinglist \nMessage-ID: <46607598.5090401@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nGold Bathtub Worth $1M Stolen From Japanese Hotel\n\nMay 30, 2007 1:43 p.m. EST\n\nShaveta Bansal - AHN Staff Writer\n\nTokyo, Japan (AHN) - Police in a Japanese city are trying to uncover the mystery behind the disappearance of a 176-pound bathtub lined with 18-carat gold. The bathtub, which is worth nearly $1 million, went missing on Wednesday from a men's bathroom in a resort hotel.\n\nAccording to the police, officers went to the Kominato Hotel Mikazuki Wednesday after the hotel's staff reported the golden tub was missing. An examination of the bathroom revealed that the chain that fixed the bathtub to a door in the bathroom had been cut off.\n\nHowever, police found no sign of dragging on the floor, an indication that more than one person might have been involved in the theft.\n\nAccording to local media reports, the tub, which was flanked by two crane statues facing each other, was located in a shared bathroom on the 10th floor of the hotel. A similar tub in the women's shared bathroom is still in place, a police spokesman told BBC news.\n\nGuests were allowed to use the tub for free, but the luxury was available only for a few hours in the afternoon.\n\nhttp://www.allheadlinenews.com\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Fri, 01 Jun 2007 21:38:55 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Prosecutor narrows charges in art heist\nTo: Museum Security Network Mailinglist \nMessage-ID: <466075CF.5080405@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nProsecutor narrows charges in art heist\n05/31/2007\nBy TRACY KENNEDY\n\nLITCHFIELD - A state prosecutor on Wednesday narrowed the charges against a New Milford man accused of stealing and destroying about 30 paintings worth thousands of dollars and setting a fire to a Warren home to cover the burglary.\nNew information was filed against Matthew Stenton, 30, 126 Willow Springs Road, substituting second-degree arson for the first-degree arson count and dates of the alleged crimes were set out in detail by Assistant State's Attorney Dawn Gallo.\n\"Specifically the second-degree arson is a charge used when a suspect sets fire purely to cover up a crime,\" Gallo said.\nCharges that were not changed include first-degree larceny, two counts of third-degree burglary, two counts of tampering with evidence and first-degree criminal mischief.\nStenton pleaded not guilty to the charges.\nStenton was arrested by state police at Bantam Superior Court on May 17. He remains in state custody at New Haven Correctional Center, unable to post a $150,000 bond.\nAttorney Christopher Cosgrove represented Stenton at Wednesday's hearing in Litchfield Superior Court. Stenton is expected to hire attorney Reka Ludanyi to represent him at his next court appearance June 20.\nGallo filed a motion to obtain swabs of Stenton's saliva to compare his DNA to chewing gum, blood and hair samples taken at the crime scene. Stenton admitted to stealing the paintings because he was desperate for cash, according to an arrest affidavit. The paintings included works from American artists Jack Frankurter, Charles LeClair and the late Max Gunther of Switzerland, police said.\nIt took two trips to take all of the artwork, Stenton allegedly told police. He also took bottles of liquor and set a fire igniting a roll of paper towels on the stove, but chickened out when he saw the flames and threw a large fur blanket on top of the fire, according to police. He burned numerous paintings in an outdoor burn barrel, according to the warrant.\nStenton sold five paintings for $800, according to the warrant. The dealers reported their purchase to police after seeing a flier advertising the theft in a shop.\nTracy Kennedy can be reached by e-mail at courts@registercitizen.com.\n\nhttp://www.registercitizen.com\n\n\n\n------------------------------\n\nMessage: 5\nDate: Fri, 01 Jun 2007 21:40:00 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. Suspect arrested, charged in theft of 1823 atlas\n\tworth $60,\t000\nTo: Museum Security Network Mailinglist \nMessage-ID: <46607610.2070904@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nSuspect arrested, charged in theft of 1823 atlas worth $60,000\nMay 31, 2007, 3:02 PM EDT\n\nNEW CITY, N.Y. -- A former curator at the Rockland County Historical Society was arrested Thursday and charged with stealing the society's $60,000 antique U.S. atlas.\n\nRebecca Chen, 50, of Highland Park, N.J., complied with a prearranged surrender at Clarkstown police headquarters and was arraigned in Town Court on a charge of second-degree larceny, said Detective Robert Schine.\n\nPolice reported last week that the book had been recovered and a suspect identified, but her name was not made public until Thursday.\n\nSchine said that on April 22, Chen took the 1823 book, \"A New American Atlas,\" from a storage area at the Historical Society in New City, where she had worked for several years until last fall.\n\n\"She basically just walked out with it,\" the detective said.\n\nThe atlas, published by Henry Tanner, is one of the earliest American atlases with large maps of the separate states.\n\nOnce the theft was noticed, dealers in antiquarian books were notified. Christopher Lane of the Philadelphia Print Shop called police when he received an e-mail from Chen about the atlas.\n\n\"He was a great help,\" Schine said.\n\nPolice asked Lane to arrange a viewing of the book, and when Chen came to the shop with it, the Clarkstown detective was there to confront her.\n\n\"She seemed a little surprised,\" Schine said Thursday. Asked whether she expressed any regret for the theft, he said, \"Whenever you get caught, you regret it.\"\n\nHe said he did not know of any particular motive for the theft.\n\nChen was currently employed at the William Trent House Museum in Trenton, N.J., the detective said. She was allowed to surrender because she did not seem to be a flight risk and arresting her in Philadelphia would have meant extradition proceedings, he added.\n\n\"She cooperated with us and we decided we would let her turn herself in,\" he said.\n\nChen did not have a lawyer in court Thursday and no plea was entered, Schine said. She was ordered held on $5,000 bail for another court appearance Monday, by which time a public defender was to be assigned to the case.\n\nhttp://www.newsday.com\n\n\n\n------------------------------\n\nMessage: 6\nDate: Fri, 01 Jun 2007 21:40:32 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] UK. Art thief in Axminster\nTo: Museum Security Network Mailinglist \nMessage-ID: <46607630.6090900@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nArt thief in Axminster\nBy Jean Tilley\n\nPOLICE in Axminster are asking the public to be on the look out for distinctive artwork stolen during a burglary in the town.\n\nThe studio of Ricki Romain was broken into between Friday May 11 and Sunday May 13 and a quantity of paintings stolen.\n\nMr Romain has told officers that some of the paintings have been returned to him but others are still missing.\nadvertisement\n\nAnyone with information about the burglary, the missing paintings or efforts to sell them is asked to contact PC Joanne Arundale at Honiton police station on 08452 777 444 or Crimestoppers on 0800 555 111 quoting police reference KA/07/223.\n\n8:27am Thursday 31st May 2007\nhttp://www.middevonstar.co.uk\n\n\n\n------------------------------\n\nMessage: 7\nDate: Fri, 01 Jun 2007 21:41:28 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] CASA DE SUBASTAS INICI? VENTA DE PATRIMONIO ROBADO AL\n\tPER?\nTo: Museum Security Network Mailinglist \nMessage-ID: <46607668.10307@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nCASA DE SUBASTAS INICI? VENTA DE PATRIMONIO ROBADO AL PER?\njueves, 31 de mayo del 2007\n\n    Haciendo caso omiso al pedido del Estado peruano, la casa de subastas Christie?s, empez? la subasta de cuadros y piezas arqueol?gicas, las cuales seg?n las autoridades peruanas no cuentan con ning?n tipo de documentaci?n que acredite su legalidad en territorio estadounidense.\n    PEDIDO PERUANO\n\n    El Per? ya hab?a condenado el tr?fico internacional de piezas de arte de sus culturas precolombinas y pidi? a las firmas Christie?s y Sothebys detener dos anunciadas subastas en Estados Unidos.\n\n    La directora del Instituto Nacional de Cultura (INC), Cecilia B?kula, explic? el mi?rcoles que desde 1822 la ley peruana establece la propiedad de todas las piezas de arte prehisp?nicas de territorio peruano. Es por ello que toda pieza sacada del pa?s, sin documentaci?n, es considerada ilegal.\n\n    B?kula indic? que esperaba que la casa de subastas entienda que el pedido peruano se ci?e a un derecho de posesi?n, ya que las piezas en territorio extranjero no cuentan con ning?n tipo de documentaci?n que acredite la conformidad que le hubiera brindado el Per?, adem?s la directora del INC implor? a la buena voluntad de la empresa.\n\n    LA SUBASTA\n\n    Pero a pesar del pedido del Per?, mediante el consulado en Nueva York y la Embajada en Washington, la casa Chritie?s inici? hoy la subasta de diversas piezas arqueol?gicas patrimonio exclusivo peruano.\n\n    ?Es una gran perdida el inici? de esta subasta. Ya estamos coordinando con el INC para iniciar una acci?n judicial en vistas a poder recuperar las piezas subastadas las cuales ahora est?n en poder de los compradores?, manifest? la c?nsul peruana en Nueva York, El? Pel?ez.\n\n    Pel?ez a?adi? que voceros de Christie?s indicaron que poseen documentaci?n que acredita la legalidad de la posesi?n de las piezas art?sticas peruanas; documentos que solo mostrar?an mediante v?a judicial.\n\n    En total son 35 piezas de arte precolombino peruano de culturas preincas como Chav?n, Chim?, Paracas, Mochica, Huari y Nazca, en materiales como oro, plata, cobre y cer?mica, cuyos precios base van desde los 600 hasta los 35.000 d?lares. Unas de las piezas m?s importantes son un manto de la cultura Paracas y una m?scara de la cultura Wari, valuadas seg?n los estadounidenses entre US$ 5 mil y US$ 35 mil d?lares. El Vaso Cupisnique tambi?n fue subastado, a pesar que se habl? de un compromiso con la Canciller?a del Per? para que sea devuelto en un acto de buena fe.\n\n    Entre las piezas subastadas tambi?n se encuentran cuadros de la escuela cuzque?a de los siglos XVII y XVIII, los cuales est?n valuados entre los US$ 12 mil y US$ 30 mil d?lares.\n\n\n\n------------------------------\n\nMessage: 8\nDate: Fri, 01 Jun 2007 21:42:37 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Mexico. Detienen a ladr?n de arte sacro, en Atizap?n\nTo: Museum Security Network Mailinglist \nMessage-ID: <466076AD.1000500@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nDetienen a ladr?n de arte sacro, en Atizap?n\nmartes 29 de mayo de 2007\n\nAtizap?n, M?x.- Un presunto ladr?n dedicado al robo de art?culos sacros fue detenido por polic?as municipales de Atizap?n cuando sal?a con varios art?culos y una bolsa de dinero que hab?a extra?do de las limosnas y las alcanc?as de la iglesia Sagrado Coraz?n de Jes?s, en la colonia La Ca?ada.\n\nDe acuerdo con los informes, efectivos locales a bordo de la unidad AG-731 realizaban su patrullaje por la calle Gorri?n, de la mencionada colonia, cuando se percataron de que dos sujetos forcejeaban a las afueras de la iglesia por un costal y una bolsa de dinero.\n\nAl percatarse de la presencia policiaca, Ra?l Hern?ndez, alias ?El Calacas?, de 32 a?os de edad, intent? darse a la fuga lanzando al suelo el costal que llevaba, dejando al descubierto los art?culos sacros, un video proyector y una bolsa con dinero que hab?a robado minutos antes.\n\nAl ser alcanzado por los uniformados, el hamp?n intent? defenderse con un desarmador, pero, de una certera patada en el estomago, fue sometido por uno de los polic?as.\n\nUna vez asegurado, Ra?l Hern?ndez reconoci? que se introduc?a a las parroquias, donde permanec?a hasta su cierre, para despu?s robar con toda tranquilidad los art?culos sacros y venderlos a iglesias de otros municipios.\n\nAsimismo, una de sus v?ctimas lo identific? plenamente y asegur? que era el mismo sujeto que un d?a antes le hab?a robado 16 mil pesos y dos relojes, por lo que fue trasladado ante el Ministerio P?blico, donde tiene ya dos averiguaciones previas en su contra por el delito de robo con violencia.\n\t\nhttp://www.diariodemexico.com.mx\n\n\n\n------------------------------\n\nMessage: 9\nDate: Fri, 01 Jun 2007 21:44:58 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] China. Removal of cultural relics older than 1911\n\tbanned\nTo: Museum Security Network Mailinglist \nMessage-ID: <4660773A.3080904@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nRemoval of cultural relics older than 1911 banned\n2007-05-29 20:17:44\n\nBEIJING, May 29 (Xinhua) -- The Chinese government is to ban individuals taking cultural relics predating 1911 out of the country, amid efforts to strengthen the protection of cultural heritage, a senior cultural heritage official said on Tuesday.\n\n    \"Previous regulations stipulated that cultural relics predating1795 could not be taken across the border by individuals. However, the base line is going to be adjusted to 1911,\" said Shan Jixiang, director of the State Administration of Cultural Heritage (SACH).\n\n    \"The end of Qing Dynasty (1644-1911), China's last feudal society, is a convenient social mark for Chinese archaeologists,\" Li Peisong, vice director of the SACH's Museum Department, told Xinhua.\n\n    The year 1911 was almost 100 years ago, which accorded with international practice that defines cultural relics protection based on centennial marks, Li said, noting the smuggling of China's cultural relics abroad had long been serious.\n\n    Shan said the new regulation, which banned more cultural relics from being taken out of the country, would be promulgated before the end of this year.\n\n    It also stipulates that important cultural relics produced before 1949 and major ethnic minority relics before 1966 could not be removed, except those taking part in overseas exhibitions, Shan said.\n\n    Ethnic minority relics, especially those with distinct ethnic features, enjoyed great international popularity, said Tala, director of the Institute of Cultural and Historical Relics and Archeology of north China's Inner Mongolia Autonomous Region.\n\n    \"Traditional Mongolian women's headgear decorated with red coral, turquoise, pearl and precious metals, are treasures of the Mongolian ethnic group and have long been favored by overseas collectors. Some have been lost overseas due to the lack of legal protection,\" said Tala, himself of Mongolian ethnic origin.\n\n    Tala said headgear, saddles and other costumes could be sold to affluent private collectors for millions of yuan on the global market because the materials from which they were made were hard to find, especially after 1966.\n\n    He said Mongolian cultural relics could not be easily identified as herders still used traditional silver bowls at home, some of which were very old and are easily bought and smuggled by private collectors.\n\n    Laws and regulations say the removal of all cultural relics should first be approved by the State Council, or China's cabinet, and they must go through the port designated by the government and declared to Customs.\n\n    Chinese experts estimated that more than 10 million Chinese cultural relics have been lost overseas.\n\n    According to the Chinese Culture Relics Society, most of the cultural relics were stolen and smuggled out of China before the founding of the People's Republic of China in 1949.\n\n    The lost treasures include paintings, calligraphy, bronzeware, porcelain, oracle bone inscriptions and ancient books and records.\n\nhttp://news.xinhuanet.com\n\n\n\n------------------------------\n\nMessage: 10\nDate: Fri, 01 Jun 2007 21:45:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Canada. Bedard's boyfriend tells jury that he misjudged\n\tOlympian girlfriend's family\nTo: Museum Security Network Mailinglist \nMessage-ID: <46607740.1050907@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nBedard's boyfriend tells jury that he misjudged Olympian girlfriend's family\nMay 29, 2007 - 19:54\n\nBy: SIDHARTHA BANERJEE\n\nMONTREAL (CP) - The boyfriend of Olympic champion Myriam Bedard told his theft trial Tuesday that he was a good friend to the artist he is accused of robbing but never should have trusted his girlfiend's family.\n\nNima Mazhari says his biggest mistake was assuming Bedard's family was as reliable as her when they agreed to go into business together in Quebec City.\n\n\"They were not reliable people,\" Mazhari told the jury. \"They'd rather spend their time riding on the bike paths rather than working.\"\n\nMazhari is accused of stealing 20 paintings by Ghitta Caiserman-Roth between 2001 and 2003 and is charged with theft and possession of stolen goods worth a total of $100,000.\n\nThe trial has been tinged with elements of a family feud as Bedard family members and friends of the Olympian have all testified of their dislike of Mazhari and his questionable influence on Myriam Bedard.\n\nBedard's father testified last week that he would never have sent an anonymous letter to Caiserman-Roth's daughter in January 2004 if he had been able to rekindle a relationship with Myriam, who had ignored him for a year.\n\nThe letter led to the criminal charges against Mazhari.\n\nMarzhari fired back on Tuesday.\n\nHe described how he and Myriam Bedard had moved to Quebec City in 2002 with plans of starting up a small business and purchasing real estate.\n\nMazhari said the family had agreed to help run their 50-seat coffee shop in Quebec City but Myriam Bedard's father and other family members pulled out quickly, leaving the couple stuck with a three-year lease and all other costs.\n\nThe cafe was only open 34 weeks, Mazhari said.\n\n\"I only knew Myriam, I didn't know her family,\" Mazhari testified, calling his assumptions about the Bedard family a huge error of judgment. \"For me, Myriam is an angel. I could always count on her.\"\n\nMazhari also said he had an excellent relationship with Caiserman-Roth before she suddenly became very ill in November 2001.\n\nMazhari had lived in her Montreal home and shared a studio with her until December 2001, when they parted ways. Even after the separation, he continued to help her by taking her to hospital appointments. He saw her last in April 2002 and Caiserman-Roth died in 2005.\n\nMazhari couldn't say whether he'd personally seen any of her paintings, photos of which were deposited as evidence.\n\n\"I saw a lot of her paintings,\" Mazhari told the 10-woman and two-man jury. \"I can't say if I had specifically seen one.\"\n\nBut when Superior Court Justice Wilbrod Decarie asked whether a signature at the bottom of one of her paintings meant an artist considered it her work, Mazhari answered yes.\n\n\"But I don't know why she signed it,\" he said about one painting of sunflowers. \"For an artist the calibre of Ghitta, it was the work of a beginner.\"\n\nHe told the jury Caiserman-Roth liked his \"dominant and masculine\" character and that he inspired an intellectual exchange that changed her paintings.\n\nThe trial continues Wednesday.\n\nhttp://www.570news.com/\n\n\n\n------------------------------\n\nMessage: 11\nDate: Fri, 01 Jun 2007 22:36:12 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] UK. Floors Castle paintings stolen\nTo: Museum Security Network Mailinglist \nMessage-ID: <4660833C.1020101@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nFloors Castle paintings stolen\n\nPOLICE are appealing for information following the theft of two valuable paintings from Floors Castle.\nBetween 7pm on Sunday and 11.20am on Monday, an area of the castle was entered and the two paintings removed from the wall and stolen.\nThese paintings are fragile and depict a Highland ox and a sheep.\nPolice are appealing to anyone who was visiting the castle between these times and saw anything suspicious to contact their local police station.\n\nLast Updated: 30 May 2007\nhttp://www.berwickshiretoday.co.uk/\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 127\n****************************************\n\n"}