{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nOfficials arrested and charged six men in New Jersey today,\n  claiming the suspects are “Islamic militants” who were plotting\n  to attack one of the country’s largest Army bases. According to\n  authorities, the six men planned to “kill as many soldiers as\n  possible” at Fort Dix Army Base in Northern New\n   Jersey. Correspondent Bob Orr will have the main story and our\n  investigative correspondent Armen Keteyian will look at previous alleged\n  terror plots that have been uncovered by authorities here at home.\n \nAlso at the top of the broadcast, rivers are rising\n  in the Midwest. They are swelling to the\n  brink in Missouri, Kansas\n  and Oklahoma\n  today, raising fears that local flooding there will grow more widespread.\n  Cynthia Bowers will survey the situation while Nancy Cordes will explain\n  exactly how the Midwest’s geography\n  makes it so susceptible to flooding. \n \nMuch of the water accumulation now threatening the\n  center of the country is due to the storm system that spawned the tornadoes\n  that leveled Greensburg, Kansas. Hari Sreenivasan is in Greensburg tracking the\n  recovery effort.\n \nIn North\n    Carolina, doctors are refusing to participate in\n  death-row executions saying that by doing so they violate the\n  physician’s oath. Doctors say it is their right and duty not to\n  participate in executions. But some prosecutors say that’s just not the\n  case and that doctors shouldn’t be able to overrule the justice system.\n  Randall Pinkston will cover the debate.\n \nSome of the smallest victims of the war in Iraq\n  go largely unnoticed, though there are thousands of them. The orphans of Iraq\n  often live on the city’s violent streets if they cannot find a place in\n  one of the eight cramped orphanages. Our Mark Strassmann will introduce you\n  to some Iraqi kids who navigate daily danger alone.\n \nFinally, headgear with pizzazz has become a\n  signature of Great Britain’s\n  royal family. Mark Phillips will take a look at the hats that are fit for a\n  queen – Queen Elizabeth II. \n \nI hope you’ll join us,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}