{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGood afternoon. This is Russ Mitchell filling in for\n  Katie.\n \nA roaring blaze swept through a South Carolina furniture warehouse,\n  sucking in the building’s roof and trapping nine firefighters who died\n  in the blaze. The Charleston\n  mayor called the disaster “difficult to fathom.” Truly, the scope\n  of the roaring fire was immense – one bystander said it looked like a\n  30-foot tornado of flames. Kelly Cobiella will have the dramatic story and\n  our John Blackstone will show you how firefighters train to fight these fires.\n \nLara Logan will report on the massive truck bomb\n  exploded near a Baghdad\n  mosque, killing at least 75 people and injuring 130 others. The blast\n  occurred just a week after the attack on the Shiite shrine in Samarra that destroyed\n  two landmark minarets. This week, roughly 10,000 U.S.\n  and Iraqi forces launched an offensive north of Baghdad in Baquba, aimed at clearing\n  insurgents out of safe havens in the Diyala province. Lara will also have an\n  update on her riveting report from last night on the Baghdad\n  orphans saved by U.S.\n  troops.\n \nMark Phillips will report that global warming might\n  affect our future, but could also affect some of the most important markers\n  of our past – landmarks that have survived for centuries. The message:\n  see them now because they might not be around for much longer.\n \nBut getting to those landmarks is proving to be a\n  struggle for some Americans. Nancy Cordes will report on the widespread rage\n  over U.S.\n  passport delays.\n \nAnd finally, Byron Pitts will have the story of an\n  inner-city program that’s giving underprivileged kids wings –\n  literally.\n \nThanks and please join us tonight.\n \n\n\n\n\nRuss Mitchell\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}