{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Gregory Nowak <greg@romuald.net.eu.org>", "subject": "Re: heretical thoughts was Re: Speakup dropped from Ubuntu", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nOn Tue, May 15, 2007 at 01:24:45PM -0500, C.M. Brannon wrote:\n> The vendors of USB synths won't release their\n> product information, so these are unsupported.  Thus, I'm not buying\n> one.  Who wants to do business with people like that anyhow? \n\nI'm in full agreement with you there. I will personally not buy a usb\nsynth, until I know that the manufacturer has released the specs for\nit without requiring an NDA to be signed.\n\n> So it\n> looks like software speech is the way of the future, at least for me.\n> Next, software speech is more convenient, especially when using a\n> laptop.  You have to carry one less peripheral with you.\n> \n> The question to ask is this.  Given the decline of hardware synthesis,\n> is it really necessary to have speech support within the kernel\n> itself?  Software synthesizers run in user mode, so the benefits of a\n> speech-enabled kernel -- notably a talking boot process -- are lost.\n> \n\nI agree there with you also. Granted, once you have an installed\ndistro, hardware speech isn't that vital. However, installation is\nstill a big issue in that department. Yes, gentoo, fedora, can be\ninstalled over ssh. Grml, ubuntu can be installed with software\nspeech. However, what if someone wants to install and use a distro\nlike debian or slackware, that support neither option as far as I\nknow? Yes, I suppose that one could use the grml livecd to install\ndebian via debootstrap, however that procedure isn't for everyone,\nespecially for a newby. So, the fact remains that until it is possible\nto install most distros either over the network or via software\nspeech, hardware speech is still necessary.\n\nAs for kernel-based screen readers not being usable during boot with\nsoftware speech, the same is true for user space-based screen readers,\nsuch as jupiter for example, that would be using either hardware or\nsoftware speech. So, arguably, kernel-based screen readers still very\nmuch have their own advantages, assuming one has access to a hardware\nsynth of course, though I admit that advantage will become less, and\nless important as everyone moves to software speech eventually.\n\nGreg\n\n- -- \nweb site: http://www.romuald.net.eu.org\ngpg public key: http://www.romuald.net.eu.org/pubkey.asc\nskype: gregn1\n(authorization required, add me to your contacts list first)\n\n- --\nFree domains: http://www.eu.org/ or mail dns-manager@EU.org\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGSgS27s9z/XlyUyARAigUAJsFghMQVZBSn/ZH04/mNo6s0kObcwCgrsh3\nkiOXHOo0GjAUmAP5vuQN6vU=\n=yNvy\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}