{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "This Weekend on BBC Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCLARE BALDING ON THE EPSOM DERBY\nFrankie Dettori's much-documented failure to win the Derby at Epsom is one of those real sporting conundrums.\n\n\nIt's like Tim Henman not winning a Grand Slam event and Colin Montgomerie not winning a Major, they are too good not to, yet it shows just how incredibly tough it is to do.\n\n\nAs far as winning the Derby's concerned, you have to have the right horse and, in Authorized this year, Dettori has really struck it lucky.\n\n\nI would love to see the highly-fancied horse win as racing in general needs good publicity and lots of it. \n\n\nFrankie winning the Derby would be as good as it gets.\n\n\nThe 36-year-old is very, very nervous, more nervous than he has ever been.\n\n\nHe is really geed up, but I think when he gets on the horse he will just go into neutral and will do it all without thinking.\n\n\nProvided he doesn't get stuck behind a wall of horses I think Authorized has everything to recommend him. \n\n\nWe know the horse is a stayer, we know he likes soft ground so Dettori will just want to get a good position coming down the hill, sit and wait and then press the button two furlongs out.\n\n\nThe Peter Chapple-Hyam trained horse is so good he could be as an impressive a winner as Motivator was in 2005 - and Motivator was clearly the best we have seen since Shergar way back in 1981.\n\n\nAside from Authorized I like the look of Regime, who won the Classic Trial at Sandown.\n\n\nThere is also the big question over how many runners trainer Aidan O'Brien will have.\n\n\nI think his best chance will come from Admiralofthefleet who is a fine horse and I liked the way he won at Chester.\n\n\nBut it is Authorized's to lose and the bookies face losing an absolute fortune - doesn't your heart just bleed for them.\n\n\nClare Balding will present BBC One's coverage of Epsom from 1255 BST on Saturday. Big race 1620.\n\n\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nTHE DERBY\n bbc.co.uk/horseracing\nSaturday\nLive coverage of the Epsom Derby (1255-1705, BBC ONE and BBC Sport website, Radio Five Live/online); Derby Day highlights (2305, BBC ONE).\n\n\n\n\n\n\nFOOTBALL ON THE BBC\n bbc.co.uk/football\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\tFriday: England v Brazil (1930, BBC ONE; 2000, Radio Five Live/online). Saturday: Wales v Czech Republic commentary (1450, Radio Five Live/online).\n\t\t\t\t\t\n\n\n\n\n\nMORE SPORT ON THE BBC\n bbc.co.uk/tvandradio\nSaturday\nRugby Sevens (0900-1830, BBCi and BBC Sport website; 1725-1825, BBC TWO); Tennis: French Open (1000-1900, BBCi); Rugby union: Australia v Wales commentary (1130, BBC Sport website); MotoGP qualifying (1245-1400, BBCi); Rugby union: South Africa v England commentary (1400, Radio Five Live/online); Rugby league: Harlequins RL v Wigan commentary (1500, BBC Sport website).\nSunday\nWorld Cup Rowing (1000-1100 & 1225-1500, BBCi and BBC Sport website; 1400-1500, BBC TWO); Tennis: French Open (1000-1900, BBCi); Rugby Sevens (1100-1945, BBCi and BBC Sport website; 1730-1930, BBC TWO); Inside Sport (1130-1230, BBC TWO); MotoGP (1230-1400, BBC TWO; 1350-1430, BBCi); Rugby league: Super League Show (1300-1355, BBC North and website); Athletics: Glasgow GP (1400, Radio Five Live; 1500-1730, BBC TWO and BBC Sport website).\n\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tDerby runners and riders\n Pinstickers' guide to the big race at Epsom\n\t\t\t\t\t\n\t\t\t\t\t\tAre you a Derby Mastermind? \n Can you beat Clare Balding's Epsom quiz score?\n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}