{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CNN Student News <CNNStudentNews@cnn.com>", "subject": "May 4, 2007", "body": "CNN.com Student News Newsletter\n\n\n\n\n\n\n \nFriday, May 4, 2007 \n\n\n\n Watch and Learn\nBritain's royal family takes center stage in today's edition of CNN Student News, which includes reports on the Queen's visit to the U.S. and Prince Charles' environmental activities. And we mark the passing of one of NASA's original astronauts.\nTeachers, we want to hear your opinions about CNN Student News. Fill out our end-of-the-year survey, and let us know what you think. Click here to access the survey!\n\n House passes $7.4 billion Head Start bill\nThe House approved more money for the popular Head Start program Wednesday after rejecting a GOP-led attempt to allow religious groups participating in the program to hire and fire staffers based on religious grounds.  The bill, passed 365-48, approves $7.4 billion in spending in fiscal 2008 for the 42-year-old program that helps low-income children prepare for school, up from $6.9 billion in the current year.\n\n May 7, 2007 - Identity Theft: How to Rob a Bank\nDrawing on documents from criminal cases, surveillance tapes and immigration records, as well as interviews with law enforcement agents, victims and criminals, CNN Classroom Edition goes inside the murky world of identity theft to expose what the bandits do after stealing identities. Record the commercial-free CNN Classroom Edition every Monday between 4:00 am and 5:00 am ET. Educational materials for the episodes are available at CNN.com/EDUCATION. Please note that CNN Classroom Edition may be pre-empted at any time for coverage of breaking news.\n\n Week of April 30\n1. Turkey 2. 2/3 majority 3. Iraq 4. immigration 5. Franklin D. Roosevelt 6. MI5 7. Condoleezza Rice 8. Queen Elizabeth II 9. Wally Schirra 10. personality (or emotions)Access this week's Newsquiz here!\n\n\n\n\n \nCNN Student News is a 10-minute, commercial-free news program that airs on CNN Headline News at 3:12 a.m. EST as well as on CNN.com/EDUCATION. Created by a team of journalists and educators, the program provides the top stories of the day, segments that encourage student participation, and in-depth special reports. In addition, CNN Student News provides free curriculum at CNN.com/EDUCATION to accompany each program's content. CNN Student News, along with CNN Classroom Edition, is Turner Broadcasting's contribution to Cable in the Classroom.\n Forward this to a friend\nYou have received this email because you have signed up to receive the CNNStudent News newsletter. Click here to unsubscribeEdit your profile here  \n"}