{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 29, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESBush Orders Tougher Sanctions On Sudan\nPresident Bush ordered new U.S. economic sanctions to pressure Sudan's government to halt the bloodshed in Darfur that the\n                        administration has condemned as genocide. \"The world has a responsibility to put an end to it,\" Mr. Bush said. More...Watch: Bush Orders Sanctions On Sudan\n• 8 U.S. Troops Die In Iraq On Memorial Day \n                     \t\t\t\t\t| Watch• Iran Charges 3 Americans With Spying• Cindy Sheehan Calls It QuitsU.S.South Prays For Rain, End To Drought\nThere are water restrictions, crop failures, wildfires, and little rain in the forecast for the Southeast, suffering one of\n                        its worst droughts in decades. It may take a very wet tropical storm to put a dent in it. More...\n• Duke Lacrosse Ends Turbulent Season On Low• Texas May Test For Steroids In High School• NFL Player Found Dead In New Orleans Lake• More StoriesWorldParty Runoff Vote Key To Israel's Future\nA former prime minister and a political newcomer will face each other in a June 12 runoff for leader of Israel's Labor Party.\n                        Either way, it's likely the nation's once-dominant party will cut its alliance with current Prime Minister Ehud Olmert. More...\n• Iran Charges 3 Americans With Spying• 8 U.S. Troops Die In Iraq On Memorial Day \n                     \t\t\t\t\t| Watch• Woman Rescued After Being Left On Everest• More StoriesPoliticsCindy Sheehan Calls It Quits\nAnti-war activist Cindy Sheehan announced she is giving up her role as the \"face\" of the American anti-war movement. \"I am\n                        getting out before it totally consumes me or anymore people that I love and the rest of my resources,\" Sheehan said. More...\n• Bush Orders Tougher Sanctions On Sudan\n                     \t\t\t\t\t| Watch• Risks Rise, Pay Doesn't For Private Guards• Bush: Iraqi, Afghan Wars \"Our Destiny\"• More StoriesHealthContact Lens Solution Recalled\nFederal officials say using it could lead to a rare but serious eye infection that could blind you. The recall by Advanced\n                        Medical Optics of its Complete MoisturePlus is voluntary. More...Watch: Contact Lens Solution Recall\n• Texas May Test For Steroids In High School• China To Execute Chief Food Inspector• Giving Sight In Ghana\n                     \t\t\t\t\t| Watch• More StoriesSciTechEurope, Asia Agree Climate Pact Deadline\nGovernment ministers from dozens of Asian and European countries have agreed that a climate change pact to replace the Kyoto\n                        protocols must be negotiated by 2009. The challenge will be getting the U.S., China and India to agree to the final product. More...\n• Sony On Board With HD Radio• Real Band, No Record Company• Whales On The Move Again\n                     \t\t\t\t\t| Watch• More StoriesBusinessReal Band, No Record Company\nThe indie band Clap Your Hands Say Yeah sold 200,000 copies of its debut album, a success that drew the attention of major\n                        record labels. But the group turned down label offers, Anthony Mason reports. Why? They'd ask, \"Why not?\"  More...\n• A New Flame For Backyard Chefs• Hunting For Travel Deals\n                     \t\t\t\t\t| Watch• Sony On Board With HD Radio• More StoriesEntertainmentMiss Universe: Miss USA Slips, Japan Wins\nThe Miss Universe pageant crowned Japan's Riyo Mori its 2007 beauty queen on Monday, but fourth runner-up Miss USA offered\n                        the evening's most memorable moment. More...\n• Lohan Going Back To Rehab, Magazine Says\n                     \t\t\t\t\t| Watch• Barbra Streisand Cancels Rome Concert• Rosie Says Crafting Helps Her Cope• More StoriesOpinionWho's Pushing For Muslim Women's Rights?\nFeminists are just about the only Americans who do the heavy lifting on Muslim women's human rights, The Nation argues. More...\n• Soldiers Put Politics Aside In Service• Pay More Than Lip Service To Diplomacy\n                     \t\t\t\t\t| Watch• Complainers-In-Chief\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Lohan Going Back To Rehab, Magazine Says\nLindsay Lohan is heading back to rehab, just days after her DUI arrest. She recently completed a 30-day rehab stint. More...Watch: More Trouble For Lohan \n• EARLY SHOW: Patricia Wells Celebrates Veggies• EARLY SHOW: Woman Rescued After Being Left On Everest• EARLY SHOW: Stand Out When You Cover Up Swimwear\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\n'Brood 13,' Yum!\"Brood 13\" sounds more like a sci-fi thriller than this summer's monster generation of cicadas in the Midwest. Some are anticipating\n                                    a tasty insect treat. Michelle Miller reports.\nTOP VIDEOS\nBush Orders Sanctions On Sudan\nWayward Whales Make Progress\nMeet Miss Universe 2007\nSeth Rogan On 'Knocked Up'\nContact Lens Solution Recall\nEverest Climber Honored\nLimitless Veggie Delights\nTriumph After Tragedy\nDozier Reflects On Tragedy\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesScott Pelley follows a National Guard unit and their families for nearly two years. This Sunday, 7 p.m. ET/PT.48 Hou!\n rs Myste\nryDouble Feature:Beginning at 9 p.m., \"A Shot In The Dark,\" reported by Susan Spencer. Then at 10 p.m., Troy Roberts\n                           report is titled \"Secrets & Lies On Grapevine Lake.\"\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}