{"category": "ham", "to_address": "\"Neil Shephard\" <nshephard@gmail.com>, <r-help@stat.math.ethz.ch>", "from_address": "\"Rosenfeld, Jeffrey\" <rosenfel@cshl.edu>", "subject": "Re: [R] Re :  Half of a heatmap", "body": "Thank you for your reply.  I have looked at LDheatmap, but it does not seem to do what I want and seems to only work well for LD data.  I was looking for something that would produce a figure identical to what heatmap.2 gives me, including the proper X and Y-axis labels and a dendogram, except that it would only have half of the map.  Preferably, it would have the Color Key in the place where the other triangle of the heatmap would be, to save space.\n\n\nJeff\n\n\n-----Original Message-----\nFrom: Neil Shephard [mailto:nshephard@gmail.com]\nSent: Mon 6/25/2007 6:14 AM\nTo: r-help@stat.math.ethz.ch\nCc: Rosenfeld, Jeffrey\nSubject: Re : [R] Half of a heatmap\n \n> I am trying to produce a heatmap of pairwise correlations, but since the matrix is\n> symmetric, I only need either the upper or the lower triangle.  I have scoured the\n> web and R documentation, but I have not been able to find a way to produce such a\n> figure.  Is there a simple way to produce a heat map with only the part above or\n> below the diagonal?\n\nYou might want to check out the LDheatmap() package which can generate\nthe plots you describe.  The help indicates that it accepts a matrix\nof pair-wise linkage disequilibrium measures, one of which is R^2 (the\ncorrelation coefficient between loci), but I suspect you could simply\npass it a matrix of correlation coefficents.\n\nHope that helps,\n\nNeil\n-- \n\"In mathematics you don't understand things. You just get used to\nthem.\"  - Johann von Neumann\n\nEmail - nshephard@gmail.com / n.shephard@sheffield.ac.uk\nWebsite - http://slack.ser.man.ac.uk/\nPhotos - http://www.flickr.com/photos/slackline/\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}