{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Countrywide\" <kvi3xqld@valuelion.com>", "subject": "Need Cash? You could tap into your equity w/ Countrywide", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe are pleased to present you with this advertisement. If you would like to unsubscribe from future emails from Countrywide, if you no longer wish to receive email offers from Countrywide, click here to be removed.\n\n\n\n\n\n\nYou could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. You could get the financing you need to move your family into a new house or condominium. \n\n\n\n\n______________________________________________________\n\n\nTo stop receiving emails, click here\n"}