{"category": "ham", "to_address": "beginners@perl.org, perl-beginners@moderators.isc.org", "from_address": "Paul Lalli <mritty@gmail.com>", "subject": "Re: Array of Array refs", "body": "On May 29, 4:58 am, googleA...@screenlight.com (Brian) wrote:\n> On May 28, 6:14 pm, mri...@gmail.com (Paul Lalli) wrote:\n>\n>\n>\n> > >  oh yes, more important than all that minutiae... the push did not\n> > > work for me in the working code.\n>\n> > The push worked absolutely fine.  It just didn't do what you wanted it\n> > to.  Learning how to parse your problem should be your first step\n> > toward becoming a better programmer.\n>\n>  hmmm, misunderstanding there. The push worked fine in the sample I\n> posted, but not in the more complex working program I had simplified\n> as an example.\n\nnope, sorry, you're wrong.  push() works perfectly well.  It adds\nelements to an array.  If your program produced incorrect results, it\nis because you did something wrong, not because \"push didn't work.\" Of\ncourse, as you haven't shown any code that produces these undesired\nresults, we can only guess as to what your actual problem was.\n\n> > > The array was being rewritten.\n> > Then you didn't delcare your variables in the correct scope.\n> understandable misperception on your part, as above\n\nNope.  If your array is being used in a loop, the contents of that\narray are changing when you don't want them to be changing, and\ninstead want to be creating new arrays, you declared your array in the\nwrong scope.\n\n> > > I had to use an array copy\n>\n> > >   push @tRespsA, [ @r1 ];   ## copy contents to an anonymous array,\n> > > push array ref\n>\n> > Do you understand *why* that was necessary?  Do you understand the\n> > difference between these two pieces of code?\n>\n>   actually, I do indeed. In C++, the concept of a deep copy, vs\n> shallow copy vs ref\n> comes up all the time. I am just learning the syntax here, not\n> programming itself\n\nperhaps you should be. . .\n\n>   aha, a force to be reckoned with. Your point above about the docs is\n> quite true.\n> I dont have time to rewrite docs right now.. They do need work though\n\nYou don't even have time to point out what you find to be \"wrong\" with\nthem?  But instead you do have time to create examples that you claim\nto be in the service of newbies, all the while saying that the docs\nare bad?  I'd suggest you could do with attending a few more time-\nmanagement seminars.\n\n> This is sometimes appearing to be contentious\n\nNo sometimes about it.  Every post you've made thus far is\ncontentious, and so I have answered in kind.\n\nPaul Lalli\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}