{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory - The Education Issue", "body": "Cabot Wealth Advisory - The Education Issue\n\nMay 12, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n==\n\nMother's Day\n\nLook At Your Charts!\n\nMy Favorite Education Stock\n\n==\n\nEveryone's got a mother.  It's a fact of life.  And tomorrow is Mother's\nDay.  But much as I would like to, I won't be bringing gifts, cards or\neven wishes to my mother -- and for a good reason.\n\nShe's on vacation in England at a traditional jazz festival with my\nfather.  I believe it's their eighth pilgrimage to this event, where they\nrenew acquaintances with fellow jazz lovers -- mostly from Europe.  And\nI'm sure they're having a great time.\n\nSo, on the occasion of Mother's Day, I'd like to share a few thoughts\nabout my mother and one of her greatest qualities -- her love of\nlearning.\n\nMy mother had no opportunity to attend college when she was young.   \nIt simply wasn't part of her family's culture.  She was married at 19, and\nspent the next few decades raising five children.  Every one of them\ncompleted college, but what is more impressive is that once the youngest\nwas out of the way, my mother herself began attending college and\neventually earned her own bachelor's degree.\n\nFor years, she had a quotation about learning taped near the phone at\nhome.  It comes from the quartet of novels, \"The Once and Future King,\" by\nTerence Hanbury White, and consists of advice from the wizard Merlyn as he\nis instructing young Arthur (the future king).\n\n\"The best thing for being sad,\" replied Merlyn, beginning to puff and\nblow, \"is to learn something. That is the only thing that never fails. You\nmay grow old and trembling in your anatomies, you may lie awake at night\nlistening to the disorder of your veins, you may miss your only love, you\nmay see the world about you devastated by evil lunatics, or know your\nhonour trampled in the sewers of baser minds. There is only one thing for\nit then -- to learn. Learn why the world wags and what wags it. That is\nthe only thing which the mind can never exhaust, never alienate, never be\ntortured by, never fear or distrust, and never dream of regretting.\"\n\nWhen you're a kid and see the same message taped by the phone year after\nyear, it tends to sink in.  At least it did with me.\n\nAnd my mother lived those words.  For example, she had learned to play the\npiano as a child, and my father was -- and is -- an accomplished\nclarinetist.  Together they make beautiful music together, literally.  But\na piano is far from portable.  So at an age when many people have long\nstopped learning, she learned to play the accordion, so she could\naccompany my father on the clarinet anywhere.  No doubt they're playing in\nEngland this weekend!\n\nAnd the learning goes on.  I've written about my daughter's semester of\nstudy in China, and that's a great learning experience for a college\nstudent.  But leave it to my mother to pin a giant map of China on the\nkitchen wall so she can follow her granddaughter's travels around the\nMiddle Kingdom!\n\nSo, here's to learning, which is almost as important as mothers!\n\n==\n\nInterestingly, the first national Mother's Day in the United States,\ndeclared by Woodrow Wilson, was celebrated in 1914.  Originally conceived\nas a call for peace and disarmament, it was watered down to honor mothers\nwhose sons had died in war.  But just nine years later (!), it had become\nso commercialized that the movement's main advocate protested what it had\nbecome.  And we tend to think that commercialization is a modern\ncharacteristic of our society!  Today, the NRA (the National Restaurant\nAssociation) says Mother's Day is the most popular day of the year for\ndining at a restaurant.\n\n==\n\nAdvertisement\n\nGrow 50% or Pay Nothing!\n\nWhen Intuitive Surgical represented the best growth story on Wall Street\nin August 2004, we quickly named it Stock of the Month. Since then it's\nhanded investors 600% gains.\n\nWhen we could see that Apple Computer's earnings momentum was shooting\nthrough the roof in October 2004, we named it Stock of the Month. It was\nselling for a shockingly low $35 per share. Today, (adjusted for a 2-for-1\nsplit) it has turned a $10,000 investment into $43,000.\n\nWhen the rest of Wall Street felt that Google's best days were behind in\nJuly 2005, our research said the tear would continue. Six months after we\nnamed it Stock of the Month, my readers saw the stock gain an incredible\n$160 a share.\n\nThere are 16 more Stocks of the Month I could name that have handed us an\n88% average profit per stock over the past two years...\n\nIntroducing Cabot Stock of the Month - Try It Risk Free for the Next 12\nMonths...\n\nTo learn more, please visit this link:\n\nhttp://cabotmail.net/t/178917/13148861/86/0/\n\n==\n\nOne of the trademarks of our Cabot style is that we attempt to educate you\nas we inform and advise.  Ideally, you don't just get good advice from us;\nyou become, over time, a wiser and better investor yourself.  The old\nproverb about the fish and all.\n\nSo today, some advice about selling.  Selling is the hardest part of\ninvesting, especially for amateur investors.  They tend to hang on to\nstocks too long.  And why?  One, because they have trouble changing their\noriginal conclusion, that the stock and company are a good investment. \nAnd two, because they're not watching their stocks on a regular basis.\n\nIf you find yourself in the latter camp, do yourself a favor by setting up\nyour computer so that you're almost forced to look at those charts every\nday.\n\nYahoo! offers an excellent page that you can customize to show all the\nstocks you're interested in, and the web page of your online broker almost\ncertainly offers similar capability.  What you want is a page that can\nshow you at a glance the charts of all the stocks you own.\n\nAnd then make that page your start-up page.  Or, if your browser supports\na tabbed presentation (personally, I think tabbed browsing is the coolest\ninnovation in years), make that chart page one of the tabs on your default\ntab group.\n\nThe goal?  To force yourself to look at the charts of the stocks you own\nevery day.  If you do, you'll learn to love the stocks that go up and\nyou'll (hopefully) become less enamored of those that go down.   \nIdeally, you'll learn to sell those that go down, and move on the greener\npastures.  (If you're still holding Ballard Power (BLDP), JDS Uniphase\n(JDSU), Mesa Air (MESA) or Whole Foods Market (WFMI), all of whom graced\nthis week's list of stocks hitting new lows, you should sell.)\n\nNote: Keeping an eye on your stocks' progress is especially important if\nyou buy a stock that I recommend here but you don't subscribe to the\npublication that will tell you when to sell.\n\n==\n\nFinally, sticking to the theme of education, I have a great growth stock\nfor you.  But first, a little background.\n\nYears ago, Apollo Group (APOL) was a great growth stock.  Apollo runs\ncolleges and other education programs (both online and in physical\nclassrooms) that serve the needs of working adults.  The Cabot Market\nLetter's model portfolio owned the stock for 14 months in 2002 and 2003\nand did well, earning a 52% profit.  The stock went even higher in 2004,\nbut it then fell 65% from its peak, a perfect example of what happens to a\nwell-loved stock when the tide changes.  The trouble?  Earnings growth\nslowed . . . and quality fell, too, as the school stretched to meet Wall\nStreet's expectations.  APOL may have bottomed last November, but the\ncompany's -- and the stock's -- best growth days are over. \n(Interestingly, founder and Executive Chairman John Sperling, who was a\ngreat stem-winder in the company's early years, is now 86 years old.)\n\nSo I have a new fast-growing education company for you.  Call it the\nfollow-on to Apollo.  It's based in China.  It operates schools that teach\nEnglish and other useful subjects.  And it's growing like the wind, thanks\nto the efforts of its own dynamic stem-winder, founder and CEO, Michael\nMinhong Yu.\n\nHere's what Paul Goodwin wrote about the company recently in Cabot China &\nEmerging Markets Report.\n\n\"New Oriental Education & Technology Group (EDU) was founded in 1993 with\none location in Beijing.  It now has 25 schools in 24 Chinese cities and\nhas recorded over three million student enrollments since its founding. \nIn addition to the company's 25 schools, its more than 4,000 teachers and\nstaff offer classes in 110 learning centers, 13 company-owned bookstores\nand over 5,000 third-party bookstores.  And its online learning network\nhas about two million registered users, to boot.\n\nThe company offers a wide range of courses in many fields, but the\ndominant interest in China is learning English: of the 872,000 student\nenrollments in fiscal 2006, nearly 500,000 were for language training, and\n95% of the language classes were for English.  New Oriental's English\nlanguage programs are keyed to kids as young as 5 and to adults of all\nages.  The teaching of English is widespread in China and proficiency is\npart of the testing regime for admission to colleges and universities,\nwhich makes the company's immersive, intensive programs a valuable key to\nfuture educational possibilities.  Instruction is also available in\nGerman, Japanese, French, Korean and Spanish.\n\nTest preparation is another important curriculum for New Oriental. Test\nscores can determine access to educational institutions in China, the U.S.\nand the Commonwealth countries, and of the more than 375,000 enrollments\nin the company's test preparation courses in fiscal 2006, 254,000 were for\ntests within the People's Republic and 121,000 were for tests to be taken\noutside of China.\n\nNew Oriental Education is very much the brain-child of Michael Minhong Yu\n. . .  His vision for the company is idealistic (\"Hew a stone of hope out\nof a mountain of despair, and you can make your life a splendid one.\"),\nbut it's also very ambitious.  The company has moved rapidly into online\neducation, selling pre-paid online education cards to distributors who\nre-sell them to students.  Of the two million registered online users\nmentioned above, about 200,000 have paid for additional access to\nspecialized programs.  Back in the bricks-and-mortar world, the company\nestablished a full-time primary and secondary school in Yanhzhou.  This\nprivate boarding school for kids in grades 1 through 12 has a capacity of\n4,000 students, and offers a full curriculum in both Chinese and English.\n\n. . .for the company's fiscal third quarter (ending February 28), total\nnet revenues increased 57% year-over-year, and net income topped $8\nmillion, which exceeded the high end of estimates.  The company also\nissued positive guidance for the rest of the year.\"\n\nNew Oriental Education & Technology Group was trading at 45 when Paul\nwrote that a few weeks ago.  Since then it's climbed to 50 and pulled back\nto 48.  And I like it, because I'm a big proponent of education, because I\nbelieve in the growth of China going forward, and because I know what a\nman like Michael Yu can do.\n\n==\n\nEditor's Note\n\nIf you'd like up-to-date information and advice on New Oriental Education\n& Technology Group every week, and if you'd like expert advice on other\ngreat investments in Brazil, Russia, India and China, consider a no-risk\ntrial subscription today.  Just follow the link below and you'll open the\ndoor to world of high-potential stocks in high-potential countries.  The\nsooner you start the better!\n\nhttp://cabotmail.net/t/178917/13148861/84/0/\n\n==\n\nAnd now it's your turn to educate me.  If you've got one more minute,\nplease go to the link below and tell me how I'm doing.  What do you like\nabout Cabot Wealth Advisory?  What don't you like?  Do you share it?  Do\nyou ever print it?  Do you sometimes skip it?  And tell me what you'd like\nto read about.  All feedback is welcome.\n\nhttp://cabotmail.net/subscribe/survey?f=449\n\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n==\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=178917&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}