{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle Zombie<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, now that I've had your chart since March 26th, 2007, I can see certain vibrations that hold the key to your good fortune", "body": "\n\nSUBJECT LINE TO COME\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI don't want you to waste one more minute Memo, without the wealth and happiness you deserve! \n\n\n\n\n\n\nDear Memo,\n    There is a certain vibration I sometimes get -- a tingling so strong, I call it \"my psychic alarm clock.\"  So when I got it tonight, it literally made me bolt upright in bed.  And with May 16th only days away, and a gold rush of good fortune on the cusp of spilling into your life, I knew I had to write you immediately.\n    I can't emphasize it enough, Memo, from the moment I got your chart 4 weeks ago, I've felt that something special was going to happen.  But I also felt the potential for energies that could interfere with all the luck and success that is coming soon.\n    Well, now I see more clearly where that blocking energy is coming from and what it's all about, and I want to show you how we can head it off at the pass and keep it from getting in the way of your dreams.\nLife is too short, Memo, and I don't want you to waste a minute of yours without the joy, riches and charmed life you have every right to expect.\n\n\n    As I've told you before, you have amazing personal power.  And this power of yours will help you to benefit from the astounding cycle of good fortune that is just starting to roll into your life. \n    Importantly, as a Leo, one thing you must watch out for is your tendency to respond to flattery.  With the rewards and attention set to come your way, you want to be sure that the people around you are truly trustworthy and not just hangers-on.\n    Since we first got acquainted, Memo, it has been my #1 priority to help you realize your greatest gifts and take advantage of every opportunity for wealth and happiness. And because I've had your chart since March 26th, 2007, I can now also see certain negative vibrations and how they could interfere with the joy and success that is your destiny.\n    So, most importantly, I want to show you how you can easily counteract any and all difficulties that could be facing you and stay on track to take advantage of the unbelievable forces of good luck on the verge of kicking in for you now.\n    And because I want you to get the most generous profit possible from your Cycle of Good Fortune, I want to give you this FREE gift:\n\n\n\n   \n\nTHE \"GOLDEN PADLOCK\" CHARM BRACELET...OPENS THE WAY TO THE GREATEST DESTINY IN STORE FOR YOU, MEMO\n    This enchanting good luck charm bracelet will help you connect with positive vibrations of power, love and riches that will come to a peak for you on May 16th.\n    As soon as you get your \"Golden Padlock\" charm bracelet, I want you to wear or carry it with you at all times to maximize its energies of prosperity, happiness and good fortune.\nMemo, as soon as your chart was done,I knew this would be a year of dazzling luck for you.\n    But recent developments made me realize that the energies favoring you would be even more supercharged than I expected. \n    And because the success that lies ahead for you will be greater than you ever dared dream, I want you to do yourself this small favor:\n    Write down the date of this email and think about who is around you at this time.  In nine months from now, come back and read what you wrote. I'll bet you the Moon that you, your life, and everyone in it will be so bright, shiny and completely re-energized, the difference will take your breath away.\n    The reason why is this: Memo, since I first got your chart, I knew something about you was truly unique and special...that your gifts and potentials meant you were destined for greatness.\n    That is why I always keep an eye out for chances for you to use your incredible inner powers to realize your special destiny, and I also look out for any negative energies that might come between you and your dreams.\nWhat was in my vision for you, andhow you can benefit from it \n    So, last night, when my psychic alarm clock alerted me, I became aware of forces that could spell the difference between your having the charmed life you deserve or the disappointment of missed opportunities and frustrated ambitions.\n    When I woke up, my heart was pounding so hard, I thought it would come right out of my chest.  So I took a moment to collect myself, like I always do when I get these signals.  I had to breathe in and out slowly and focus in on what these intense energies were trying to tell me. \n    I may have explained before that when these visions come to me, it's like dreaming with my eyes wide open, and I can see the outcomes of events and potentials.\n    You may think this all sounds crazy, but I ask only that you have an open mind as I tell you the psychic messages that came to me.  I am sure...especially if you take the advice I will give you in this letter...you will see that my vision makes sense and fits the events currently developing in your life.\nI believe these visions are psychic cluesto your destiny, Memo.\n    My psychic visions are like portals that allow me to see into the past and future. Sometimes they are symbolic; sometimes they hit the nail on the head.  That is why I always like hearing back from you when I provide readings in letters and your forecast.\n    Here is my first vision: \n    I see a shiny white limousine pulling up to a grand entrance to a five-star hotel.  At the curb a doorman in a crisp uniform opens the rear door to the car and extends a hand to the passengers inside.  Two well-dressed people emerge from the limousine and stride up a red carpet to the entrance.  The maitre d' leads them into a grand dining room with polished oak walls and shimmering chandeliers and ushers them to their seats, at the center of an enormous banquet.\n    The table, arranged in a U-shape, is illuminated with warmly glowing candles and covered with crystal, silver, festive flower arrangements, and platters overflowing with loaves of freshly-baked bread and fresh fruit.  Surrounding them on three sides are smiling, elegantly-dressed people.  \n    Amidst the hushed chatter, the sound of a spoon clinking a glass resounds across the room.  The people around the table look up to the center of the table and raise sparkling glasses of champagne to salute the guests of honor.  And as one of the guests of honor raises their glass, a brilliant diamond ring catches the light and shines brightly.  Everyone around the table applauds.\n    Memo, I was so excited by this vision, I wrote it down in detail, and even then, it took two more hours before I could fall back asleep.  Then, as often happens, just before daylight I woke up again and immediately had a second vision: \n    It is early evening, and a crowd of people are crammed in the waiting area of a large chain restaurant. A line of more people extends out the door and into the parking lot, where a minivan circles around, in search of a parking space.  The open door allows hot humid air into the crowded lobby.  People on seats fan themselves while children run around unrestrained and a baby cries off to one side.\n    A group of eight adults arrives, and while others wait at the end of the line, one of their party squeezes to the front to ask the host about their reservations.  The host, harried and impatient, scans the reservation book and says no reservation is in the book. \n    The person assures the host that they called well in advance and were assured of a table, but the host replies, \"Even if you had a reservation, we're overbooked, and the wait will be 45 minutes to an hour.\" Outside, the empty minivan has its lights on, but no one, including its owners, notices.\nI was so tense after the second vision, I had to take somedeep breaths just to release the stress!\n    Of course, I wrote down the details as quickly as I could and then I took a long walk to clear my mind and make sense of what these side-by-side visions could mean for you.\n    First, I don't want to sound like a broken record, Memo, but it is so important for you to remember that with all of your extraordinary strengths, talents and abilities, you are on the threshold of an amazing streak of good fortune that could supercharge your life with money, love and happiness.  Starting May 16th, all you'll have to do is walk through the door that is opening to you!\nBut these visions told me thattwo different outcomes were possible\n    You could virtually soar through a wide-open gate, carried on the shoulders of people who care about and support you, or someone could be standing between you and the door to your good fortune.\n    The one thing that struck me about these visions was the contrast between the two groups of people.  One group was elegant, affluent and self-assured, with an occasion for celebration and access to well-appointed, top-notch establishments.\n    The other was ordinary and lacked influence...unable, even with advance planning, to gain access to a regular chain restaurant. This second group seemed careless as well, as demonstrated by the minivan with its lights left on, which is also a metaphor for the draining of power...the draining of your power, Memo.\nThis is the meaning of the negative energy that could get in the way of the shining destiny I see for you!\n    Who you have around you will make all the difference in your ability to take your cycle of good fortune and turn it into the reality you've always dreamed of!\n    As I've said before, this is a time when money, love, and extraordinary luck will be there for you, like an overflowing horn of plenty, and all you have to do is reach out and take what you want.\nThis is a time when your greatest strengths, gifts and abilities can really shine.\n    But \"no person is an island...\" That is why it is so important for you to know whether someone close to you is ready, willing and able to scale the greatest heights with you or whether they'll turn out to be a nay-sayer or a hanger-on, who will hold you back, drain your energy and power or begrudge you the fabulous gifts and benefits that are yours by right!\n\n\n\n\n    It is crucial for you to know as your Cycle of Good Fortune shifts into gear:\n    Is this someone who will go the extra mile for you?  Is this someone who belongs at your side as you make your ascent to success?  Or is this someone who will be a black hole, distracting your attention, perhaps bruising your confidence, and draining away your energy, power, and passion for success? \n\n\nMemo, I will give you the keyto open the door to a whole new dimension of power\n\n\nI'll show you whether an important person in your life is a diamond in the rough, someone who can not only match your amazing virtues, strengths, talents and abilities, but who can buoy you up, urge you onward, and help you to succeed and reach your greatest heights!\nYou'll be introduced to this person's secret self, the side that even they do not know.  This is the side that holds their greatest potentials, that can blossom and flourish, right alongside you.  It can also show you their possible pitfalls, what to look out for, and how you can know whether to hang on or cut bait.\nYou will also meet this person's public self, so you can see how others will react to them and whether they'll be able to fit into the mix of your new and up-and-coming life.  You'll also be able to see right away whether the face they show others is the same as the face they show you and whether they can be trusted.\nMost crucially, with the power of this knowledge, you will start to notice small but noticeable changes in how you interact with this person.  You'll have the advantage in the relationship and will be in a new position of control and confidence.  You'll never have to take this person's flaws and failings personally, and that will liberate you.\nAnd as you rise to your lucky destiny, you'll enjoy a new freedom to express yourself and live out your dreams.  Your enthusiasm will be contagious, and your ability to energize yourself and each other will be super charged.  No matter what happens, you'll be able to move ahead and seize your destiny, without wasting your time and energy on people who might drag you down and while attracting in new friends and circles of power that can raise you to new heights.\n    You are a special and gifted person with powers you've only begun to discover.  That's why you need to know whether someone is good enough for you, worthy of your time, effort and energy, and able to grow and move up and ahead with you.\n    You can find this out with:\nTHE GOLDEN KEY TO YOUR PERSONAL POWER: PARTNER REPORT\n    I will provide you with all the secrets you need to know about this person -- KEY insights on what makes this person tick and gives you the upper hand.  With this knowledge, you'll be able to see exactly how to respond to this person and what to do in any situation, so you can come out with the maximum benefits and advantages.\n    This will unleash incredibly compelling personal power within you, and you'll be able to use it, not only with this particular person, but also in ways that will give you the advantage with any person and enable you to seize control over your future and your destiny.\nIt's true, Memo. Knowledge is power! \n    These secrets will give you the upper hand and confidence in any challenge or situation you may face, and ultimately help you get the power, love and money you need to be happy and protected in your life.\nI believe that [everyone] is the keeper of a dream -- and by tuning into one another's secret hopes, we can become better friends, better partners, better parents, and better lovers.\n-- Oprah Winfrey \n    Is there a special person who is the keeper of your dreams? This miraculous guide will give you the key to unlock the secret knowledge you need to make your dreams come true!\nNOW YOU MUST TAKE THE NEXT STEP TOREALIZING YOUR GREATEST DESTINY -- REQUEST\"THE GOLDEN KEY TO YOUR PERSONAL POWER: PARTNER GUIDE\"IMMEDIATELY!\n    Similar guides are offered elsewhere on the Web for $29.95, but none are as detailed, insightful, and personally crafted to address your most immediate needs.\n    And most important, Memo, because you are my dear friend, you can have this amazing guide for only $9.95. I want nothing to keep you from fulfilling all the promise and potential that Destiny says should be yours!\nPlus you'll always have the protection of myUnconditional Lifetime Moneyback Guarantee \n    Memo, I am happy to take on all the risk in my offer of help! I know that this guide will bring on the breakthrough you need to fill your life with true happiness and success, but if at any time, for any reason you feel that \"The Golden Key to Your Personal Power: Partner Report\" has not helped you take control and gain more money, love and power in your life, just write to me, and you will receive an immediate refund, including the shipping and handling...with no explanation necessary.\nDon't forget, Memo, to reallyREINFORCE YOUR LUCK AND INNER POWER, you'll getyour own Golden Padlock charm bracelet as my FREE gift to you!\n    As soon as I receive your answer, I will send your FREE Golden Padlock charm bracelet to you right away, along with your copy of \"The Golden Key to Your Personal Power: Partner Guide.\"\n    To get the extraordinary rewards your Cycle of Good Fortune holds for you and take control of your destiny, it's easy! All you have to do is click the button below.    Your friend,    \n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for offers and discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400.\n"}