{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Arnoud Engelfriet <arnoud@engelfriet.net>", "subject": "Re: Logo trademark license vs. copyright license", "body": "Francesco Poli wrote:\n> On Wed, 18 Apr 2007 08:05:36 +0200 Arnoud Engelfriet wrote:\n> > Ok, then I would suggest moving that out of the first sentence and\n> > into a new paragraph. \"The above exception only applies for the\n> > situations described in Exhibit Z\". Then you can write an Exhibit Z\n> > for your own trademark(s).\n> \n> Well, won't it be way too detailed, if a separate Exhibit is needed?\n\nPossible. It's kind of tricky with a template, especially when\ndealing with unregistered marks. If you put it in one sentence,\npeople may limit themselves. If you make people write an exhibit,\nthey may overdo themselves and hurt their legal position. Or\n(maybe worse?) forget to actually _include_ the exhibit, and then what?\n\n> > Right. My problem with that is that Z can change over time, but\n> > the definition of Z won't change with that.\n> \n> Does the Debian Project *desire* that the meaning of the Official Use\n> Logo can change over time (without intervention by GR, I mean)?\n> I don't think so[1]: that's why I said that a clarification on its\n> meaning should be kept in its trademark notice.\n\nWell, that may be so, but I thought the idea was to make a template\nlicense and not a Debian-specific license. A template should also be\nsuitable for projects or companies that envisage changing scope of\nactivities.\n\n> > Then can I use the sign Debian to promote my\n> > proprietary hardware company?\n> \n> Can you do so *now* (well, OK, not really now, but with the current\n> proposed trademark license)?\n\nI don't see why not, as long as my products don't create an\nimpression that I am affiliated with the Debian project. Since\nthe Debian project promotes and distributes free software, and\nI sell proprietary hardware, it seems to me I can go ahead.\n\n> The license says you cannot create confusion with the Debian Project and\n> the Debian distributions.\n> Creating confusion with the Debian Project seems to be disallowed...\n\nWhy do you conclude there is confusion?\n\nThe mere fact that I use the name and logo of the project can't\nbe reason enough to assume affiliation or association. The whole\npoint of licensing the mark this way is to allow others to use the\nname and logo.\n\nOne of the factors to determine confusion is how proximate the two\nmarkets are. See for example\nhttp://home.att.net/~jmtyndall/ustm/1114.htm\n\nOk, so maybe hardware and software are close markets, so the chance \nof confusion is high there. I can get more removed from free software:\nI sell clothes with the Debian logo and some witty \"Debian says\" quote.\nIs that creating confusion or affiliation?\n\n> > > [X] = Debian Open Use Logo\n> > > [Z] = Debian Project and Debian distributions\n> > > Nobody is allowed to use [X] (or a confusingly similar sign) to\n> > > refer to IBM, or to Slackware, or to Microsoft, or to MacOS X, ...\n> > \n> > Ehm, you can't do *that* in a trademark license. You can only complain\n> > if people use X to create confusion in relation to *you*.\n> > \n> > Saying \"don't create confusion with anyone\" goes beyond what you\n> > are allowed with your trademark.\n> \n> I'm not following you here.\n\nI wasn't sure what you were saying in the > > >  part, and jumped\nto conclusions. You talked about \"IBM, or to Slackware, or to\nMicrosoft, or to MacOS\" and I read that in the context of the\nDebian sign. My interpretation was that you wanted the Debian\nlicense to forbid the creation of confusion with *anyone's* logo.\nSorry about that.\n\nArnoud\n\n-- \nArnoud Engelfriet, Dutch & European patent attorney - Speaking only for myself\nPatents, copyright and IPR explained for techies: http://www.iusmentis.com/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}