{"category": "spam", "to_address": "<ktwarwic@flax24.uwaterloo.ca>", "from_address": "\"The Bull Report\" <news@thebullreport.com>", "subject": "The news is out on DHNA", "body": "    To view this email as a web page, go    here.     \n\n\nThe Bull ReportJune 6th, 2007\n Dhanoa Minerals Arranging the Acquisition of New Processing and Refining Plant, \"Spanish Plant\"; Acquisition to Dramatically Increase Company's Gold Recovery Rate and Production by 40%\u2028\nTORONTO, ONTARIO--(MARKET WIRE)--Jun 6, 2007 -- Dhanoa Minerals Ltd. (OTC BB:DHNA.OB - \nNews)(Frankfurt:D7Z.F - News\n) announced today that the company has reached an agreement to acquire a new central processing and refining plant. The company believes this acquisition will increase the company's recovery rate at its gold producing properties in southern Ecuador by as much as 40% through the new centralized processing facility known as the \"Spanish Plant.\" This improvement will greatly improve efficiency, eliminate waste and by products, and raise overall production levels, resulting in a direct corresponding increase in the company's revenues.\nThe \"Spanish Plant\" allows for the company to increase its' production significantly due to its capacity to refine greater tonnage of ore, resulting in higher production levels. With the ability to increase production through the \"Spanish Plant\" Dhanoa Minerals is considering the further acquisitions of neighboring producing mines in the expectation of increasing production through the processing of greater tonnage of ore on a monthly basis.\n\nIf there are periods where Dhanoa Minerals is not using the \"Spanish Plant\" to the plant's full running capacity the company has taken the steps to lease out the processing facility to neighboring gold producing properties for a fee. In addition, Dhanoa will additionally charge a percentage of the neighboring mining company's gold production for use of the processing facility as well. These alliances with neighboring gold producing properties provide Dhanoa with addition and consistent revenue streams and allow operation at the \"Spanish Plant\" at full capacity on a continual basis. At the present time Dhanoa has a gold recovery rate of approximately 50% of its\n potential value using its current plant and current methods. However, once the new processing plant is acquired, the company should achieve a 90% recovery rate at a reduced cost. This would substantially increase profit margins, which would be a significant milestone for the emerging natural resource producing company. \"With the Spanish Plant, we will significantly increase our production of gold and silver, while reducing overhead and over associated production costs\", stated Mr. Lee Andrew Balak, President of Dhanoa Minerals. \"This is a significant milestone for the company and an ideal acquisition for us.\"\nThe Company:Dhanoa Minerals Ltd. (OTCBB: DHNA) is a newly incorporated natural  resource exploration company. It is acquiring, exploring and  developing existing and new natural resource properties thought to  contain significant quantities of gold and other minerals. The  Company was incorporated in July 2005 and is headquartered in Nevada,\nThe Company owns a 100% interest in two adjacent mineral projects in  Canada - Close-Allies I and Close Allies II.  In addition, Dhanoa  holds an 80% interest in an Ecuador mining company, Promenasa. The  Company also recently acquired four properties that are part of the  Bonanza Project in the Bellarica gold mining camp in Ecuador. These  are gold producing mines and Dhanoa plans to increase production by  upgrading extraction operations.Dhanoa is targeting production in its first year (ending June 2008)  at approximately 100,000 ounces. At recent gold prices of  \napproximately $680 per ounce, the value of 2008 production may  approach $68 million.  In addition, the Company expects to double  production the following year to approximately 250,000 ounces worth  around $170 million at today's prices. Investments the Company is  making in upgrading its processing faclities are expected to result  in a 40% improvement in the production recovery rate from its  existing faciliies.\nRead the full report\n\n\nRead the full disclaimer\n\n\n\n\n\n                                    This email was sent to:  ktwarwic@flax24.uwaterloo.ca\n\n\n\n\n                                                            This email was sent by: The Bull Report                                                                                                              \n                                                            1846 rosemeade 104 dallas, TX 75007 USA \n                                                            \n\n\n          \n                                    We respect your right to privacy - view our policy\n\n\n\n\n\n\n\n\n\nManage Subscriptions | \n                                    Update Profile | \n                                    One-Click Unsubscribe\n\n\n\n\n\n"}