{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@speedy.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "impugn: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nDictionary.com Premium makes a great gift for students and word lovers of all ages!\nAdvertising-free access, Audio pronunciations, and Color illustrations.\nMore word games: Cryptogram, Hangman, Maze, Phrase Invaders, Slide Solve, and\nWord game archives with the last 30 days of puzzles.\n\nBuy a gift certificate today!\n\nADVERTISEMENT\nWord of the Day for Friday, April 20, 2007\nimpugn \\im-PYOON\\, transitive verb:\nTo attack by words or arguments; to call in question; to make insinuations against; to oppose or challenge as false; to gainsay.\nAs might be expected of fanatical flag idolaters, the GAR did not accept refusals lightly, and in one instance in Illinois impugned the patriotic loyalty of recalcitrant local school administrators by spreading rumors that one of them was a foreign alien yet to be naturalized and the other a draft dodger who evaded Civil War service by fleeing to Canada. -- Albert Boime, The Unveiling of the National Icons\nAfter hearing that her brother had been impugned by his political rivals, she also wrote a verse defense of his honor, entitled \"Lines on reading an attack upon the political career of the late Albert Baker Esqr.\" -- Caroline Fraser, God's Perfect Child\nStill, I was unpleasantly surprised when, in the morning, several of my coworkers took it upon themselves to crassly impugn G.B.'s capacity for leadership. -- Lydia Millet, George Bush, Dark Prince of Love\nEven though it is nowhere alleged that disclosures of sinful activity by priests impugn the integrity of the entire ministry, that nevertheless is the passing legacy of the current scandals. -- William F. Buckley Jr., \"The House of Disillusion\", National Review, May 14, 2002\nImpugn comes from Latin impugnare, \"to assail,\" from in-, \"against\" + pugnare, \"to fight.\"\nDictionary.com Entry and Pronunciation for impugn\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9363527-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}