{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nAugust marks the two-year anniversary of Hurricane\n  Katrina but at least 86,000 families are still living in those white FEMA\n  trailers along the Gulf\nCoast. While FEMA may\n  have helped shelter a lot of families, our investigative team has discovered\n  that the trailers may be toxic to the people who call them home.\n  Investigative Correspondent Armen Keteyian will report.\n \nSharyl Attkisson is also reporting from the Gulf Coast.\n  Tonight she’ll have an update on New\n    Orleans and the surrounding area – how far has\n  it really come since Katrina?\n \nIn South\n    Carolina last night, Republican Presidential\n  candidates took the stage for their second debate. As our senior political\n  correspondent Jeff Greenfield will report, there were more than a few sparks.\n  He’ll have the highlights.\n \nIn health news, we’ll look into the Internet\n  and its growing role as a place to find prescription drugs. But, as Wyatt\n  Andrews will report, much of that buying and selling is done illegally\n  without prescriptions – so much that it is catching the attention of\n  legislators on Capitol Hill.\n \nYounger and younger kids are using cell phones\n  – and parents are paying the price as kids ring up big bills for games,\n  ringtones and other electronic accessories. The catch: kids don’t need\n  a parent’s go-ahead before adding charges their bill. Richard\n  Schlesinger will have the story as well as some solutions.\n \nFinally, we’ve got a story about possible\n  Irish roots popping up in an unlikely spot in American politics. According to\n  members of one little church on the Emerald Isle, records show a potential\n  genealogical connection to the 2008 presidential race. I’ll give you a\n  hint – his surname isn’t O’Malley or O’Connor, but it\n  does start with an “O.” \n \nI hope you’ll join us,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}