{"category": "spam", "to_address": null, "from_address": "kenneth clark <ark_fabric_ltd04@hotmail.com>", "subject": "REPRESENTATIVE REQUIRED!!!!", "body": "\n\n\n\n\nOFFICE: Arokos Fabrics Inc. Sussex House,London Road East Grinstead west Sussex RH18 1HH +44 704 570 1079United Kingdom\n \nDear Sir/Madam,\nArokos International Limited is a Latvian textile company. We produce and distribute clothing materials such as batiks, assorted fabrics and traditional \ncostume worldwide. We have reached big sales volume of textile materials in the Europe and now are trying to penetrate the US market. \n \nQuite soon we will open representative offices or authorized sales centers in the US and therefore we are currently looking for people who will assist us in \nestablishing a new distribution network there. \n \nThe fact is that despite the US market is new for us we already have regular clients also speaks for itself.\nWHAT YOU NEED TO DO FOR US? The international money transfer tax for legal entities (companies) in Latvia is 25%, whereas for the individual it is only 7%.There is no sense for us to \nwork this way, while tax for international money transfer made by a private individual is 7%. That's why we need you!\nWe need agents to receive payment for our textiles ( in American express, cashier and official checks ) and to resend the money to us via Money Gram or \nWestern Union Money Transfer. This way we will save money because of tax decreasing.\nJOB DESCRIPTION? 1. Receive payment from Clients 2. Cash Payments at your Bank 3. Deduct 10%, which will be your percentage/pay on Payment processed. 4. Forward balance after deduction of percentage/pay to any of the offices you will be contacted to send payment to/ or any of our clients overseas (Payment \nis to forwarded by or Western Union Money Transfer).\nNOTE: All charges of the WESTERN UNION MONEY TRANSFER will be deducted from the money, so you are rest assured that you wouldn't spend a dime out of your \npersonal money.\nHOW MUCH WILL YOU EARN? 10% from each operation! For instance: you receive 7000 USD via checks on our behalf. You will cash the money and keep $700 (10% from $7000) for yourself! At \nthe beginning your commission will equal 10%,though later it will increase up to 12%!\nADVANTAGES You do not have to go out as you will work as an independent contractor right from your home office. Your job is absolutely legal.You can earn up to \n$3000-4000 monthly depending on time you will spend for this job. You do not need any capital to start. \nYou can do the Work easily without leaving or affecting your present Job. The employees who make efforts and work hard have a strong possibility to become \nmanagers. Anyway our employees never leave us. But the problem we have is trust, we have made arrangement with the FBI in Washington, that if anybody gets \naway with our money they will definitely get hold of such individual and will face the full wrath of the law.\nMAIN REQUIREMENTS 18 years or older legally capable Responsible ready to work 3-4 hours per week. With PC knowledge e-mail and internet experience (minimal) And please know that everything is absolutely legal.   \nIf you are interested in our offer, please respond with the following details in order for us to reach you: # FULL NAME # CONTACT ADDRESS # PHONE NUMBERS # AGE # SEX # OCCUPATION   \nThanks for your anticipated action. And we hope to hear back from you   \nKENNETH CLARK. (Director)        Add some color. Personalize your inbox with your favorite colors. Try it!\n"}