{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Pet food maker expands recall...that story tonight on the CBS Evening News with Katie Couric", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n \n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening \n            News | 48 Hours | 60 Minutes | The Saturday Early \n            Show | CBS Sunday \n            Morning | Face The \n            Nation\n\n\n(CBS) QUOTE OF THE DAY\n“To be great is to be misunderstood.” - Ralph Waldo Emerson \n      \n\nTODAY’S TRIVIA California's Frank Epperson invented the \n      Popsicle in 1905 when he was 11-years-old. \n\nTONIGHT ON THE CBS \n      EVENING NEWS Here's an early look \n      at what we are working on for tonight's broadcast of the CBS EVENING NEWS \n      from Anchor and Managing Editor, Katie Couric... Hi everyone, \n      Secretary of State Condoleezza Rice is in Sharm el Sheik, Egypt, \n      today at an international conference on Iraq. There’s been one significant \n      development already – debt relief for that war-torn country. But the even \n      bigger news might be the rare contact today between U.S. officials and \n      those from Syria. Sheila MacVicar is there and will have more. \n      Our national security correspondent David Martin will \n      report on the diplomatic talks going on in Sharm el Sheik. And \n      Elizabeth Palmer will report from the Tehran stock exchange, where \n      investors are hoping the meeting will open the way to greener financial \n      pastures. Eighteen months before the 2008 election, ten Republican \n      presidential contenders will take the stage at the Ronald Reagan \n      presidential library outside of Los Angeles for their first debate. \n      Sandra Hughes is there. And Secret Service protection is \n      being given to one of the Democratic presidential candidates: Barack \n      Obama. It is the earliest in any presidential campaign that protection has \n      been authorized for a candidate. Due to what Menu Foods is calling \n      possible cross-contamination, the pet food maker expanded its recall \n      today. This news comes as a study shows it might not be the melamine in \n      food itself that is harmful, but the combination of certain chemicals. \n      Nancy Cordes will have this and more. Thousands of people \n      jammed Capitol Square in Richmond, Virginia, today hoping to get a glimpse \n      of Queen Elizabeth. She and her husband, Prince Philip, began their \n      six-day stay in the United States today – their first in 16 years. Mark \n      Phillips will report. Do you have a favorite to win the Run \n      for the Roses? Sharyn Alfonsi will give you a peek at some of the \n      horses running in this Saturday’s Kentucky Derby. You’ll also meet a young \n      woman who paid $9,000 for a horse that will be pitted in that race against \n      million-dollar thoroughbreds. And today we lost a pioneer, \n      astronaut Wally Schirra. I’ll tell you about his amazing life. \n      Thanks, Katie For more on two of the stories \n      noted above, please click on the following links: Rice \n      Talks Iraq With Top Syrian Official Click Here Space Pioneer Wally \n      Schirra Dies At 84 Click Here Here's a look at one \n      of the stories we are working on for Friday's broadcast of the CBS Evening \n      News A cherished legacy is reclaimed ... through an entire COUNTY'S \n      collective memory, some SWEAT, and REAL divinity. A very special candy \n      store on this week's Assignment America...That story and much more Friday night on the CBS Evening News. \n      If you would like more information on any of these stories or the \n      broadcast, please click on the following address and e-mail us: \n      evening@cbsnews.com \n\nTONIGHT ON DAVID LETTERMAN Join Dave tonight on \n      The Late Show with actress Marcia Cross \n      AND impressionist Joe Piscopo… Plus, musical guest Tori Amos! \n\nFRIDAY MORNING ON THE EARLY SHOW Harry Smith, \n      Hannah Storm, Julie Chen and Russ Mitchell anchor \n      THE EARLY SHOW from New York. Dave \n      Price will bring us the weather from aboard Freedom of the Seas at \n      Cape Liberty Cruise Port in Bayonne, NJ. Along with the top \n      news of the day, we will also have the following stories:\nCSI BEHIND THE SCENES: Centuries ago... did humans mate \n      with reptilian creatures from another planet? That is a central question \n      in Thursday night's episode of CSI. But there was another question \n      we wanted an answer to. How did they transform one of the show's stars... \n      into a lizard? Our own Julie Chen visited the set to find out. \n      Friday morning, we’ll see what she discovered when she went behind the \n      scenes of the hit show. TOBEY MAGUIRE: Well the wait is \n      finally over, as the highly anticipated Spiderman 3 hits theaters \n      Friday. The first two Spiderman films each set opening weekend box \n      office records, and the latest film doesn't look to disappoint. Once \n      again, Tobey Maguire suits up as your friendly neighborhood Spiderman, who \n      this time must fight three villains, including his best friend Harry. And \n      Maguire is riding high: father to five-month-old Ruby, he is basking in \n      the glow of new fatherhood. How has it changed this down-to-earth actor, a \n      self-professed homebody? We’ll find out when we speak to Tobey Friday \n      morning. VEGETABLE HARVEST: PATRICIA WELLS: Bestselling \n      author and culinary teacher Patricia Wells is an American, but is \n      considered one of the foremost experts when it comes to French cuisine. \n      Friday morning, she will join us with recipes from her latest cookbook, \n      Vegetable Harvest. SURVIVOR CASTOFF: Stranded in \n      Fiji, the competition heats up for the remaining survivors battling it out \n      for the million-dollar prize. The Immunity idol becomes a hot topic when \n      Yau-Man is blackmailed into revealing his position by Mookie and Alex. How \n      will that impact what is left of the Four Horsemen? And who will be voted \n      off the island? On Friday morning, we'll have a recap of the new episode \n      and as always, talk to the next castoff about what really went wrong. \n      DECORATING WITH PATTERNS: Nothing livens up a room quite \n      like a bold pattern. If using a pattern in your home sounds risky, not so \n      says design expert Susanna Salk. With thoughtful mixing and matching \n      patterns are a great way to liven up any room in your home. From the \n      Pottery Barn flagship store in New York, Susanna will show us some easy \n      ways you can use pattern in your own decorating. If you would like \n      more information on any of these stories or the broadcast, please click on \n      the following address and e-mail us: earlyshow@cbs.com \n      \n\nSATURDAY ON 48 HOURS \n      MYSTERY, 9PM/8C Here's an early preview of what you can \n      expect to see this Saturday on 48 HOURS MYSTERY, POWER, PASSION AND \n      POISON from Correspondent, Troy \n      Roberts: \"Kathy Augustine was a rising star in Nevada state \n      politics. Smart, ambitious, tough and attractive she quickly ascended to \n      one of the highest offices in the state and many expected she'd eventually \n      end up working in national politics. But last year Kathy Augustine was \n      found unconscious in her bed and later died at the hospital. She was \n      fifty-years-old. At first it was assumed that Augustine died from a heart \n      attack. But her family and friends didn't believe it could be possible. \n      Augustine had her annual physical just a week before her death. She was \n      given a clean bill of health and there was no family history of heart \n      disease. It just didn't add up. Toxicology tests were ordered on \n      fluid samples taken from Augustine and the results shocked everyone. \n      Traces of the powerful paralytic drug Succinylcholine were found in her \n      system. The drug is normally given to patients to ease the insertion of a \n      breathing tube. It acts fast and nearly vanishes from the body within \n      minutes...making it extremely difficult to detect. Suspicions quickly fell \n      on Augustine's husband of three years, Chazz Higgs. The pair seemed an \n      unlikely couple. He was eight-years her junior. He was a bodybuilder who \n      had three failed marriages behind him. His relationship with Kathy was \n      troubled as well. In the months leading up to Augustine's death they had \n      discussed divorce. But there was more. Chaz Higgs was a critical care \n      nurse and he had access to Succincolyine. He knew how to adminster it and, \n      most importantly, he knew the drug could be potentially deadly. And then a \n      witness came forward with a damning claim about his allegedly role in the \n      crime. Chazz Higgs goes on trial for the murder of Kathy Augustine \n      next month. Higgs claims he is innocent. When we sat down for the \n      interview, that you'll see this weekend, he agreed to talk about the \n      charges against him...charges that could send him to prison for life, and \n      you'll hear his theories on who would want his wife dead...and why. I hope \n      you'll join us on Saturday night.\" Troy Roberts\n(48 Hours Mystery airs Saturday at 10pmET/9CT)\nIf you would like more information on any of these stories or the \n      broadcast, please click on the following address and e-mail us at: \n      48hours@cbsnews.com \n\nSUNDAY ON 60 \n      MINUTES, 7:00PM/6:00PM CT INSIDE THE ENEMY CAMP -- \n      Until Osama bin Laden declared all Americans and Jews fair targets for al \n      Qaeda terror, Nazir Abas trained Muslim militants in the jungles of South \n      East Asia. Now he provides valuable intelligence to authorities in the war \n      on terror. Bob Simon reports. LOU DOBBS -- Lesley \n      Stahl profiles the CNN anchor, whose stance against illegal \n      immigration has helped raise his ratings but also fueled criticism. \n      THRIFT SHOP MASTERPEICE? -- Teri Horton knew nothing about \n      art when she bought a big, drippy painting for five dollars years ago in a \n      thrift store. But now she says a fingerprint proves it is a $50 million \n      Jackson Pollock original. Anderson Cooper reports.\n\nTO SUBSCRIBEClick here to subscribe to \n      the Inside Scoop.TO UNSUBSCRIBEUnsubscribe information \n      is included in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, \n      click here.Contact: Email Administrator, \n      CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n      10019Help | Advertise | Terms of \n      Service | Privacy \n      Statement©MMVII, CBS \n      Interactive Inc. All Rights Reserved. \n\n"}