{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nPresident Bush addressed the unpopular war and\n  unrelenting violence in Iraq\n  today at a Rose Garden news conference. He announced his support of the new\n  war funding bill, which does not include a troop-withdrawal timetable, Jim\n  Axelrod will report. We’ll also bring you a CBS News/New York Times\n  poll that shows support for the war is weaker than ever: 76 percent of\n  Americans think the war is going somewhat or very badly.\n \nBritish authorities are searching for three terror\n  suspects who are believed to have been planning international attacks.\n  That’s raising questions about whether current screening measures, in\n  place since 9/11, could stop them or anyone else determined to enter the country\n  by air?  Bob Orr will have the story.\n \nPlus, we’ll tell you New Jersey Governor John\n  Corzine’s plan to keep others from making the same mistake he made\n  – the mistake that nearly cost him his life.\n \nLast night we reported on a new class of Americans\n  who can’t get health care coverage due to the most minor of medical\n  problems. Tonight we continue our investigative series with Chief\n  Investigative Correspondent Armen Keteyian, who will take a closer look at\n  what happens when people who actually have individual insurance try to\n  collect on an expensive claim. The results might surprise you.\n \nTo wrap-up our broadcast, John Blackstone will give\n  you a tour of the next frontier in communications. It’s just like good\n  old-fashioned face-to-face chatting – with an edge.\n \nI hope you’ll join us for this and more.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}