{"category": "ham", "to_address": "debian-devel@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Jean-Christophe Dubacq <jcdubacq1@free.fr>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "> > You're *not* giving up the right not to distribute any source, because\n> > you can always refrain from distributing the corresponding binaries and\n> > have no obligation to provide source.\n> >\n> > You're *not* giving up the right to distribute binaries without\n> > distributing the corresponding source, because, without a license, you\n> > would not have the right to distribute binaries in the first place (with\n> > or without source).\n> > \n> > By accepting the GPL, you instead gain the right to distribute binaries\n> > with source, and you simply do *not* gain the right to distribute\n> > binaries without source.\n> \n> Similarly, by accepting the CDDL, you are not giving up the right to\n> choose a venue in case you get sued over the software; instead, you are\n> simply gaining the right to use, modify, and redistribute the software\n> under a given set of rules (which simply does not include \"the right to\n> choose a court in which to settle disagreements\"). That is what matters,\n> and that is what makes the software free.\n> \n> Even if my argument would be flawed (which I don't think it is, but just\n> in case), that wouldn't even matter. What matters is that DFSG#1 talks\n> about \"a royalty or other fee\"--i.e. money--not \"giving up rights\"; and\n> any interpretation of the text that says it does talk about giving up\n> rights is incorrect to begin with.\n\nI am not a specialist, but in France, private use of a work cannot be\ndenied (as well as private copy, in some measure). Whether this applies\nonly to countries following \"author rights\" doctrine instead of\n\"copyrights\", I let it to someone more knowledgeable in this field.\n\nOf course, private means private (not the \"familial group\").\n-- \nJCD\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}