{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Body pulled from river identified as missing U.S. soldier", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMay 24, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nBody pulled from river identified as missing U.S. soldier\n\n\n\n\n\nThe body of a man dragged from the Euphrates River south of Baghdad has been\nidentified as Pfc. Joseph J. Anzack Jr., one of three U.S. soldiers thought to\nhave been kidnapped earlier this month, the U.S. military said Thursday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnd the 'American Idol' winner is ...\n\n\n\n\n\nThe big voice overwhelmed the beatbox Wednesday night as Jordin Sparks was\ncrowned the newest and youngest \"American Idol.\"\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nStudy: Killer hurricanes thrived in cooler seas\n\n\n\n\n\nHurricanes over the past 5,000 years appear to have been controlled more by El\nNino and an African monsoon than warm sea surface temperatures, such as those\ncaused by global warming, researchers said Wednesday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nTexas town worries about new neighbors -- polygamists\n\n\n\n\n\nSamuel Fischer would appear to be just what this withering Texas Panhandle\ntown needs.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTown fires 4 employees for gossiping about boss\n\n\n\n\n\nCan you be fired for gossiping about your boss? Four employees of a New\nHampshire town say they were, raising questions about fairness, free speech\nand a staple of life in the American workplace.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPolice: Wife loses lip after calling man short\n\n\n\n\n\nA man accused of biting off his wife's bottom lip after she called him short\nhas rejected a plea offer and will stand trial next month, prosecutors said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCrews bang pipes hoping to steer whales to sea\n\n\n\n\n\nTwo wounded, lost whales circled near a Sacramento River bridge as boat crews\nbanged metal pipes to try to herd them toward the open waters of the Pacific\nOcean.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nLebanon warns militants: Surrender or else\n\n\n\n\n\nLebanon's defense minister issued an ultimatum Wednesday to Islamic militants\nbarricaded in a Palestinian refugee camp to surrender or face a military\nonslaught, as the army reinforced its positions, raising fears of what could\nbe a bloody showdown.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCastro talks of illness for first time\n\n\n\n\n\nCuban leader Fidel Castro discussed details of his recent health problems for\nthe first time Wednesday, telling his countrymen in a written message that he\nunderwent several operations, some of which were unsuccessful, but that his\ncondition has now stabilized.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIAEA: Iran atomic work defies U.N.\n\n\n\n\n\nIran has not only ignored a U.N. Security Council deadline to stop uranium\nenrichment activity but expanded it, according to a confidential International\nAtomic Energy Agency report obtained by Reuters on Wednesday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRights groups: U.N. troops traded arms for gold\n\n\n\n\n\nU.N. peacekeepers from Pakistan trafficked arms for gold with a militia in the\nDemocratic Republic of Congo, human rights groups said Wednesday, adding a\nU.N. inquiry into the affair was deliberately slowed.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nBeware of cellphone snoops\n\n\n\n\n\nThe nightmare begins early in the morning with an innocuous-looking e-mail on\nyour mobile phone instructing you to check a specific Web site for information\nabout repairing your credit score.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUh oh. The individual investor is back\n\n\n\n\n\nYep, it's official. Even your grandma is getting bullish about the stock\nmarket. And that's as good a reason as any to be prepared for a pullback.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nChris Ekstrand: Mock Draft -- picks 1-15\n\n\n\n\n\nI'm still trying to get over the shock of watching the three teams with the\nbest chance in the Greg Oden Lottery ending up fourth (Memphis), fifth\n(Boston) and sixth (Milwaukee). I know they say life isn't fair, but the\nshocked looks on the faces of Jerry West, Tom Heinsohn and Larry Harris in\nSecaucus, N.J., on Tuesday night told the whole story.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYanks solve Schilling, take series from Red Sox\n\n\n\n\n\nAndy Pettitte and the New York Yankees kept their focus on the field, capping\na busy day with a crisp victory over Boston.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nOutsmart Your Toddler: 5 tricks for getting yours to do what you want \n\n\n\n\n\nThe battle lines were drawn: It was me against him. And he, my 2-year-old, was\na formidable opponent. I lay in wait by the stairs, a pair of size-2T\nsweatpants clutched to my chest. Catching Kevin and wrestling him into his\nclothes reminded me of the day I tried (and failed) to catch a greased piglet\nat a county fair. At least with Kevin I didn't have to worry I'd end up\nface-down in the mud. Suddenly, my slippery little boy popped up from behind\nthe relative safety of the sofa. Our eyes met. He squealed and bolted for the\nkitchen. Game on! \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFDA OKs pill that ends menstrual periods \n\n\n\n\n\nThe first birth-control pill meant to put a stop to women's monthly periods\nindefinitely won federal approval Tuesday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nCitywide Wi-Fi struggles to reach users\n\n\n\n\n\nAdam DuVander likes to surf the Internet from his laptop wherever he happens\nto be -- at home, a coffee shop or a neighborhood park. He has been able to do\nso in recent years thanks to wireless hotspots set up by networking activists\nin Portland, Oregon.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGoogle invests in startup of co-founder's wife\n\n\n\n\n\nFresh off her marriage to Google Inc. co-founder Sergey Brin, biotechnology\nentrepreneur Anne Wojcicki is now wedded to the company too.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nCelebrating an 'indestructible' American legend\n\n\n\n\n\nOn the 100th anniversary of John Wayne's birth, the Duke still swaggers\nthrough the American psyche as not just an actor, but a patriot -- his\ncentennial spawning fond remembrance, and perhaps a few small protests on the\nside.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDepp: I'd consider another 'Pirates'\n\n\n\n\n\nThree journeys as Captain Jack Sparrow in the \"Pirates of the Caribbean\" may\nnot be enough to quench the thirst of actor Johnny Depp.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}