{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 10, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESFemale Bomber Kills 16 Iraqi Recruits\nA female suicide bomber walked into a large crowd of hopeful Iraqi police recruits and blew herself up, killing at least 16\n                        people. A separate blast killed at least six people in Baghdad. Also, four more American troop deaths have been announced. More...Watch: Iraqis Protest U.S. Presence\n• Critics Still Want Don Imus Fired\n                     \t\t\t\t\t| Watch• Southern Crops Damaged As Temps Drop\n                     \t\t\t\t\t| Watch• Pet Food Study: Cat Kidney Failures Up 30%U.S.Southern Crops Damaged As Temps Drop\nFrigid weekend weather caused frost that damaged crops across the Southeast, raising fears that peach, apple, blueberry, strawberry\n                        and wine grapes were harmed. Cost estimates for the damage were expected later in the week. More...Watch: Winter Blasts In April\n• Padilla Terror Charges Stick, Judge Rules• Pet Food Study: Cat Kidney Failures Up 30%• Modern Day \"Knights\" Help Needy Worldwide\n                     \t\t\t\t\t| Watch• More StoriesWorldN. Korea Reactor Deadline Ticks Closer\nA U.S. official has warned North Korea that time is running out to shut down their nuclear reactor ahead of a Saturday deadline,\n                        but with a bank set to free up $25 million in frozen funds demanded by Pyongyang, it may not be too late yet. More...\n• Female Bomber Kills 16 Iraqi Recruits\n                     \t\t\t\t\t| Watch• U.S. Files New Piracy Cases Against China\n                     \t\t\t\t\t| Watch• Report: Warming Threatens Millions By 2020\n                     \t\t\t\t\t| Watch• More StoriesPoliticsObama Tells Letterman VP Not For Me\nBarack Obama is not interested in sharing a presidential ticket with fellow Democratic Sen. Hillary Clinton and he is not\n                        running for vice president, the Ill. senator said on CBS' \"Late Show with David Letterman\". More...Watch: Obama Doesn't 'Run For Second'\n• Poll Shows Congress Approval Rising• Betty Ford Released From Hospital• Pure Horserace: An Age-Old Question\n                     \t\t\t\t\t| Watch• More StoriesHealthNew Device May Heal Damaged Hearts\nAbout 100,000 people suffer from heart failure, but just 2,000 get transplants. For a while, doctors focused on developing\n                        a heart pump as a bridge to a new heart if it's available. But a new pump shows it can be more, Sanjay Gupta reports. More...Watch: Healing The Human Heart\n• Pet Food Study: Cat Kidney Failures Up 30%• Herb May Cure Bladder Infections• Is Breast Cancer Worse For Hispanic Women?• More StoriesSciTechReport: Warming Threatens Millions By 2020\nAn international panel of United Nations scientists has approved a massive report that predicts hundreds of millions of people\n                        will be threatened by floods, fires and violent storms due to global warming in less than two decades. More...Watch: Global Warming And The Poor\n• Competition For TiVo• Love In The Age Of Google• Space Capsule Carrying U.S. Mogul Docks\n                     \t\t\t\t\t| Watch• More StoriesBusinessU.S. Files New Piracy Cases Against China\nThe Bush administration is filing two new trade cases against China over copyright piracy and restrictions on the sale of\n                        American movies, music and books. It is America's latest response to the growing pressure to fix soaring trade deficits. More...Watch: Battling Movie Piracy In China\n• Dumping Internet Service May Cost You• What To Do If You Can't Pay Your Taxes• Companies Heeding Gripes About Long Lines\n                     \t\t\t\t\t| Watch• More StoriesEntertainmentDaggers From Anna Nicole's Half-Sister\nDonna Hogan had harsh words for Howard K. Stern and Anna Nicole Smith's mother on The Early Show, in her first\n                        interview since Smith's death. Hogan was discussing \"Train Wreck,\" her new, tell-all book on Smith. More...Watch: Anna Nicole's 'Train Wreck'\n• Paternity Results Expected In Smith Case\n                     \t\t\t\t\t| Watch• Naomi Says Her Service \"Was Humbling\"• Critics Still Want Don Imus Fired\n                     \t\t\t\t\t| Watch• More StoriesOpinionThe Gutting Of The Justice Department\nCBSNews.com legal analyst Andrew Cohen says the firing of eight U.S. attorneys might have been a shock to the country,\n                        but its reverberations are just beginning. Already flaws beyond the surface of the Justice Department are showing.\n                         More...\n• Statecraft Requires Reality Check\n                     \t\t\t\t\t| Watch• The Emotional Roller Coaster Of Combat\n                     \t\t\t\t\t| Watch• Andy: Let's Have A Queen\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Books: Daggers From Anna Nicole's Half-Sister\nDonna Hogan had harsh words for Howard K. Stern and Anna Nicole Smith's mother on The Early Show, in her first\n                        interview since Smith's death. Hogan was discussing \"Train Wreck,\" her new, tell-all book on Smith. More...Watch: Anna Nicole's 'Train Wreck'\n• EARLY SHOW: \"Make-Ahead\" Recipes• EARLY SHOW: Modern Day \"Knights\" Help Needy Worldwide\n                     \t\t\t\t\t| Watch• CBS Evening News: New Device May Heal Damaged Hearts\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nOregon Sea Lions Won't BudgeCBS News RAW: Sea lions have made themselves at home in Port of Coos Bay, Ore., but town officials and fisherman say\n                                    the animals are more of a nuisance than tourists might think.\nTOP VIDEOS\n'Take Lou' On Immigration\nThe Best 'Make-Ahead' Recipes\nKitchen Appliances Report Card\nTax Savings Through Furniture\nHome Water Filters Tested\nIran Expanding Nuclear Program\nCold Snap Jeopardizes Crops\nReforming Immigration Policy\nShock Jock Imus Suspended\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesJohn McCain talks to Scott Pelley about his presidential campaign, Iraq, and that controversial Baghdad market visit.\n                           Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryThe Ghost Of David Coffin:A businessman is murdered, his body and the evidence burned in an inferno. Ten years\n                           after the crime, will justice be served? \n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}