{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"editor@QualityStocks.net\" <editor@qsnews.net>", "subject": "The QualityStocks Daily Newsletter", "body": "\n\nTo view this email as a web page, click here.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFriday     June 22nd 2007 \nToday's Top 3 Investment Newsletters\n\n\n\n\n\n\n\n\n\n 1.\nOTC Stock Exchange (DHNA)\n\n\n 2. \nOTC Stock Exchange (GSCR)\n\n\n 3.\nStock Guru (NEXA)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n About \"The QualityStocks Daily\" \n\n\n\n\n\n\n\n\nThe QualityStocks Daily Newsletter brings you the latest company News and Profiles featuring the \"Top Movers and Shakers\" from the Small Cap Market each trading day. QualityStocks is committed to bring our subscribers Public companies in our Newsletter Section \"Free of Charge\" based on Percentage gained, Momentum, Press, and or Company Fundamentals.\nWhy do we spotlight companies for Free? \nWe Want To bring our subscribers the top movers in an unbiased setting.  \n“Homework Eliminates Mistakes\" \nPlease never invest in a company anyone profiles unless you do the proper research and due diligence. \nQualityStocks is compensated by the companies in The QS Company Corner. These companies will include a disclaimer with the amount and term of compensation.  \nPlease consult the QualityStocks Market Basics Section on our site.\n \n\n\n\n\n\n\n\n\n\nThe QualityStocks Daily\n\n\n\n\n\n\n\n\nLet’s take a look at a few of the top percentage gainers from 06/15/07 through 06/22/07 and highlight some that saw huge gains and were able to maintain some of their momentum.\n\n                                                  The QualityStocks.net Daily Newsletter recently highlighted Three Sixty, Inc. (TSXT) shares have made some amazing gains in June. (TSXT) opened today at $0.78 down 2% at $0.76 with 85,411 shares traded. (TSXT) was highlighted today by OTC Picks, GMCR and this month by OTC Stock Exchange, StockEgg.com, HotOTC.com, OTC Picks, and recently by Knobias and OTC Picks\n\n                                                  Three Sixty, Inc. shares doubled yesterday on the announcement that revenues for the first Quarter Revenues were $2,463,126, the company launched its first products (360 OTC) brand in February, and will also be rolling out its 360 OTC Hangover line to all of its retail accounts in July. The company is projecting company wide sales for 2007 to be approximately $32,500,000 to $35,000,000. Three Sixty, Inc. shares were also boosted in May on the announcement that it has completed its acquisition/merger of Rockford-Montgomery Labs, which was announced on 5/22/07. Rockford-Montgomery Labs owns the 360 OTC brand of over-the-counter pharmaceutical products, which is available in 11,846 stores nationally, including CVS/Pharmacy,Walgreens, and all 185 Meijers stores, as well as via the internet. The companies 360 OTC Hangover Relief and 360 OTC Hangover Lite is currently being manufactured and will ship to stores shortly after.\n\n                                                  Three Sixty Inc., is an acquisition company of branded healthcare and food products. The Company targets niche market segments of nationally distributed brands in their respective categories across food, drug, convenience stores and mass merchandisers. \n\n Magellan Energy Ltd. (MGLG) previously at $0.55 down 18% at $0.45 with 929,733 shares traded. (MGLG) was highlighted today by OTC Stock Exchange and OTC Picks.\n\n                                                    Magellan Energy Ltd. announced an update for its current operations on the Pemberton #14 well in Morgan County, Tennessee. The results show that have several zones have been established that are capable of producing oil and gas, and is expected to be put into production for oil and gas in the near future. The positive results will allow Magellan Energy Ltd. to expand its research and drilling operations. OTC Stock Exchange predicted today \"MGLG - Half a million in volume yesterday. That is huge. Like we said in our mid-day update, \" higher highs and higher lows\" signal a strong bull trend. Radar for news. I am expecting a 5 to 7 cent move today.\"\n\n                                                  Magellan Energy Ltd. is a growing and experienced energy company focused on acquiring and partnering with existing producing junior properties in North America \n\n Obee's Franchise Systems (OBFC) previously at $1.34 down 5.97% at $1.26 with 21,450 shares traded. (OBFC) was highlighted this week by OTC Picks.\n\n                                                    Obee's Franchise Systems announced today that that of its Board of Directors has agreed to a forward stock split of thirty (30) shares for each outstanding share of the company's common stock. The board will announce the official date of the stock split in the coming days. \n\n                                                  obee's® Soups Salads & Subs is owned by Obee's Franchise Systems Inc. and has over 50 restaurants open and in development across 21 states, and has won numerous local and regional awards for its product. The company has commitments to open over 1,000 additional locations over the next ten years.\n\n\n Direct Insite Corp. (DIRI) previously at $2.36 up 8% at 2.55 with 70,971 shares traded. (DIRI) was highlighted this week by Knobias Clip Report\n\n                                                      Direct Insite Corp. announced it has signed a multi year contract with Siemens Shared Services LLC. Direct Insite will provide Siemens with its vendor self service portal and inquiry management service, which will allow Siemens' 80,000 vendors to access their invoice and payment status, at all times. The company also announced in May that revenue for the first quarter 2007 was $2,254,000, an 11.9% increase over revenue in 2006 \n                                                      Direct Insite provides best practice financial supply chain automation and workflow efficiencies for Procure-to-Pay and Order-to-Cash processing, and are used by more than 7,000 corporations across 62 countries, 15 languages and multiple currencies. The company was also selected by Deloitte and Touche as one of the '500 Fastest-Growing Technology Companies' in the United States and Canada \n\n\n\n Marx Toys & Entertainment, Corp. (MRXT) previously at $ 0.0037 down 2.70% at $0.0036 with 1,712,810 shares traded. (MRXT) was highlighted today by OTC Stock Exchange\n\n                                                    Marx makes Limited Edition Collector toys as well as Mass Market products in tune with contemporary trends. The company makes the little green army men action figures, you knew as a child, as well as life like fully articulated high end action figures. The company also designs an array of play sets that cater toward the nostalgic, as well as to the mindset of today's children. \n\n                                                  Marx Toys & Entertainment, Corp. is a Nevada company with offices in various locations across the United States \n\n\n \n\nThe QualityStocks Company Corner   \nThe QualityStocks.net Daily Newsletter would like to highlight ALL Fuels & Energy Company (AFSE) previously at \n\n\n 1.01\n\n up 3% at $\n\n \n                                                    1.05   with \n\n\n 7,500\n\n shares traded. \nALL Fuels & Energy Company announced late last month that the Iowa Department of Natural Resources has issued to AFSE's subsidiary, ALL Energy Manchester, LLC, the final Air Quality Construction Permit relating to AFSE's proposed 100 million gallon per year Manchester, IA ethanol production facility. AFSE expects the total construction cost of this facility to be between $200-250 million. The company also recently announced that its subsidiary, ALL Energy Manchester, LLC (the \"Manchester Subsidiary\"), has received in excess of $17 million in infrastructure improvements, tax credits and property tax abatements from the City of Manchester, IA, and the State of Iowa in support of AFSE's proposed 100 million gallon per year ethanol production facility. \n Last month U.S. Equity News provided an industry report on ALL Fuels & Energy Company, in the report they state \"One rising firm, (AFSE), is seen as an emerging Industry leader. ALL Fuels & Energy Company is positioning to quickly become one of the premier ethanol production firms in the U.S., combining industry leadership in plant design and plant management.\nALL Fuels & Energy Company recently acquired ALL Energy Company, a development-stage ethanol company organized to operate as an ethanol producer, focusing primarily on the production and sale of ethanol and its co-products. Disclaimer\nALL Fuels & Energy Company Blog\nALL Fuels & Energy Company News:\n AFSE Receives Air Quality Construction Permit From Iowa Department of National Resources  \n AFSE Receives Over $17 Million in Infrastructure Improvements, Tax Credits and Tax Abatements  \n U.S. Equity News Provides an Industry Report: ALL Fuels & Energy Company \n\n\n\n\n\n\nToday The QualityStocks.net Daily Newsletter would like to highlight CanAm Uranium Corp. (CAUI) previously at \n\n\n 0.615\n\n down 4% at \n\n \n                                                            0.5890   with \n    \n\n     \n\n\n 796,137\n\n\n    \nshares traded. (CAUI) was highlighted by Boon Market, Stock Upticks, StockHouse and Break Out Trading \nCanAm Uranium Corp. noted this month that uranium's spot price hit $135 per pound June 4th 2007 as quoted at UXC.com, which is a dramatic increase from roughly $50 since the corporate focus to acquire and develop its Uranium interests. \n\n CanAm Uranium Corp. today announced the completion of nine drill holes on the Amalgamated Rare Earth #2 project in Bancroft Ontario by Operator El Nino Ventures Inc. between May 1 and May 28th, with a total of 1,989 m (6,525 ft.) drilled, a summary of findings will be delivered to CanAm Uranium Corp. and published online.\nCanAm Uranium Corp.  announced recently that it has acquired an option to own 100% of the Reilly Uranium Property in the Sault St. Mudle District of Ontario. The acquisition expands CanAm Uranium Corp's property holdings to over 159,000 acres of Uranium claims collectively. \nCanAm Uranium Corp. is focused on the strategic acquisition and development of exploration properties in well-known prolific mining areas, especially known for Uranium, of Canada , Southern Africa, Australia and the United States . CanAm Uranium Corp has optioned over 136,000 acres of claims collectively within the Saskatchewan Athabasca Basin, Ontario and British Columbia Disclaimer\nCanAm Uranium Corp. Blog \nCanAm Uranium Corp. News: \nCanAm Uranium Corp. Announces Completion of Nine Drill Holes On the Amalgamated Rare Earth No. 2 Project in Bancroft  \n CanAm Recognizes Importance of Uranium Spot Price At $135 Per Pound  \n CanAm Uranium Corp. Acquires Option to Own 100 Percent of the Reilly Uranium Property \n\n\nToday The QualityStocks.net Daily Newsletter would like to highlight Compress Technologies, Inc. (CTLG) previously at $0.43 with no change with\n\n\n 50,665\n\nshares traded. (CTLG) was recently highlighted by OTC Picks. \n\n Compress Technologies, Inc. announced recently that a major Korean delegation of 3 high-ranking officials from the Teltron Corporation announced interest in CTLG technology for use on set top boxes and antennas. \nCompress Technologies, Inc. announced today that it would begin phase II of its Cable Television Bandwidth Enhancement. Inventor Harold Walker believes the advancements and modifications developed for CTLG's FM-SCA technology can be integrated into the Cable Television bandwidth enhancement technology resulting in significantly \"improved performance.\" \nCompress Technologies, Inc. recently announced that a major financial institution has expressed interested in CTLG's encryption technology. This news potentially confirms that banking and financial industries are expected to be major customers for CTLG's encryption technology. The encryption technology offers Financial Institutions a new level of Internet and data security, as well as reduction of data intrusion by unwanted invaders \nCTLG has garnered a group of Patented and protected core technology solutions utilizing both hardware and software applications designed to the efficiencies of bandwidth and Network Topographies for the Cable TV, FM-SCA Radio, Satellite and Wireless Industries. Compress Technology, Inc.'s technology allows multiple digital channels to be transmitted adjacent to a conventional analogue FM signal. The technology will allow radio to be transmitted on the unused space between two radio channels. The technology will give the ability to transmit up to (50) fifty new fully digital broadcast channels in that unused space, freeing up unused empty space on the dial. Disclaimer\nCompress Technologies, Inc. Daily Blog\nCompress Technologies, Inc. News:\n Major Korean Delegation Coming to Compress Technology USA  \n Cable Television Technology to Improve Performance  \n QualityStocks.net News - Compress Technologies Inc. to Be Featured in Stock Newsletter QualityStocks Daily, The QualityStocks Daily Video and The QualityStocks Daily Blog \n\n\n\n\n\n\n\n\n\n\n\n\n\nThe QualityStocks.net Daily Newsletter would like to highlight Cord Blood America, Inc. (CBAI) previously at $0.05 with no change with \n\n\n 259,400\n\n shares traded. (CBAI) was highlighted recently by OTC Picks, Money TV and Break Out Trading\nCord Blood America announced this month that it has signed a consulting agreement with Midtown Partners & Co., LLC, to evaluate strategic alternatives to unlock value for its subsidiaries. Midtown Partners & Co., LLC is an investment bank focused on private placement investment banking opportunities. The company also announced this week that a letter to shareholders from CEO Matthew Schissler has been posted on the Company's website.\nCord Blood America today saluted researchers at the University of Texas Medical Branch at Galveston who announced, in Science Daily, that they have engineered adult stem cells from human umbilical cord blood to produce insulin. \nCord Blood America recently announced that revenues for 2006 topped $3.89 million, up 71 percent compared to revenues of $2.28 million in 2005. \n\nCord Blood America is the parent company of CorCell, which facilitates umbilical cord blood stem cell preservation for expectant parents and their children. Its mission is to be the most respected stem cell preservation company in the industry. Collected through a safe and non-invasive process, cord blood stem cells offer a powerful and potentially life-saving resource for treating a growing number of ailments, including cancer, leukemia, blood, and immune disorders. Disclaimer\nCord Blood America Daily Blog\nCord Blood America News:\n Cord Blood America Posts Letter to Shareholders  \n Cord Blood America Signs Consulting Agreement With Midtown Partners & Co., LLC to Evaluate Strategic Alternatives to Unlock Value in Its Subsidiaries.  \n Cord Blood America Salutes Researchers Who Report That Umbilical Cord Blood is Successfully Engineered to Make Insulin\n\nThe QualityStocks.net Daily Newsletter would like to highlight Global Resource Corp. (GBRC) previously at \n\n\n 1.90\n\n up 16% at $2.22 with\n  \n\n   \n\n\n 158,921\n\n\n  \n shares traded. (GBRC) broke its 52 week high closing today at $1.63 \nGlobal Resource Corp. announced some really positive news today that they were recognized by the United States Department of Energy as a company that may one day unlock billions of barrels of energy from domestic United States deposits. \n\n\n The Department of Energy issued a report on Wednesday, June 20, 2007, identifying 25 companies that possess unconventional fuel production technologies.\nannounced today it will commence Phase II testing to produce valuable energy byproducts from resid oil, a material that remains after crude oil is distilled. The company believes the tests will prove that its patent pending process can derive upgraded oil and gas from resid oil, drastically increase the price per barrel of the material and avail the possibility of producing oil from capped oil wells, which are now considered non-retrievable, across the country.\nGlobal Resource Corp. announced recently that Gershow Recycling, one of the world's largest recyclers, has agreed to receive the world's first 100 percent emission- and pollutant-free green recycling machine for auto shredder residue. The proprietary technology will help to reduce landfill waste by approximately 65%, recover extra metal for profit, and the process will generate virtually no emissions linked to global warming.\nGlobal Resource Corp. is a Worldwide Petroleum Research, Engineering and Development Company that is responsible for bringing innovation and new technologies to the petrochemical industries where they offer many proprietary solutions in secondary and tertiary crude oil recovery processes. The company has a patent pending process that allows for removal of oil and alternative petroleum products at very low cost from various resources, including shale deposits, tar sands and waste oil streams with significantly greater yields and lower costs than are available utilizing existing known technologies. Disclaimer\nGlobal Resource Corp. Blog\nGlobal Resource Corp. News:\n Department of Energy Includes Global Resource Corporation's Technology as Possible Answer to U.S. Energy Independence  \n Global Resource Corporation Announces Gasification Technique to Unlock Resid Oil  \n Global Resource Corp. Names Environmental Expert David DeClement Executive Vice President \n\n                                                        \n                                                        Today The QualityStocks.net  Daily Newsletter would like to welcome Hemis Corporation (HMSO) closed today at 0.49 down 14% with \n\n\n 81,447\n\n shares traded. (HMSO) was recently highlighted by StockHouse \n                                                        Hemis Corporation recently announced news on one of its three advanced stage exploration properties in Mexico and one in Alaska. The company announced that a preliminary oceanographic survey was begun last week on the Anchor Gold project. This survey was intended to both confirm the results of Aspen Exploration's previous work and to provide baseline information for a drilling program planned for later in the 2007 exploration season. It is believed that due to the size of the project area, it could have great potential.\nHemis also recently expanded its El Tigre land holdings through the acquisition of concessions called La Centela. La Centela consists of six concessions that are adjacent to El Tigre. The El Tigre gold exploration project in eastern Sonora, Mexico, is currently undergoing an initial phase of diamond drilling. The initial phase of drilling is intended to test several gold-bearing breccia zones. Hemis initially considered El Tigre to be strictly a gold target, nut has also shown evidence of the mineral molybdenum porphyry is and more testing is warranted at El Tigre. Hemis is expecting the results from the first hole this week with the results of additional holes to be received on a weekly basis going forward. Hemis also announced last month that it has entered into an agreement to acquire Aspen Exploration Corporation's Anchor Point gold project in the Cook Inlet area of Alaska. \nHemis Corporation is a precious metals exploration company, with two divisions a resource division and a resource investment unit. Disclaimer\nHemis Corporation Blog\nHemis Corporation News:\n Hemis Alaska Gold Exploration Program Initiated  \n Hemis Corporation El Tigre Drill Program and Exploration Update  \n Hemis Announces Gold Exploration Program in Alaska\n\n\n\nToday The QualityStocks.net Daily Newsletter would like to spotlight Hybrid Technologies, Inc. (HYBT) previously at $3.24 down 4% at $3.08 with \n\n\n 125,960\n\n (HYBT) was highlighted this month by AheadoftheBulls, OTC Advisors, All Penny Stocks, Wall Street Grapevine and Independent Investment Edge. \nHybrid Technologies, Inc.  offered an enhanced follow up to the Canadian Ministry of Transportation's press release. \nTo view extended press release click here:\n                                                        http://www.hybridtechnologies.com/media.php?mediaID=070618 \nHybrid Technologies, Inc. announced on Friday that a delegate from the Canadian Ministry of Transportation has received delivery of Hybrid's all-lithium emissions-free vehicles.\nHybrid Technologies, Inc. recently announced that its highly advanced eco-friendly home has been filmed as part of a Discovery Channel expose featuring ultra advanced eco technology. Hybrid's Richard Griffiths and Popular Mechanics' Ben Chertoff took to the streets of New York with Hybrid's acclaimed and legendary Stealth all-lithium motorcycle. YouTube was also in on the action as Griffiths' interview was sent throughout the online-streaming community. Because of this, the story gained significant publicity when it was released; being viewed by hundreds of thousands of people world-wide. It created a huge buzz as not only did the story invite viewers from the technological side to participate, but it also encouraged the online public and consumers in general to look more-in-depth at Hybrid's products.\nHybrid Technologies, Inc. received some positive news recently from Mayor Michael Bloomberg, who announced New York City's Yellow Cab Fleet Will Be Entirely Hybrid Within 5 Years. And that the number will increase by about 20 percent each year until 2012, when every yellow cab -- currently numbering 13,000 -- will be a hybrid. The standard yellow cab vehicle, the Ford Crown Victoria, gets 14 miles per gallon. In contrast, the Ford Escape taxis get 36 miles per gallon.\nHybrid Technologies, Inc. announced recently that the company will team with multi-platinum Atlantic recording artist James Blunt along with Lyor Cohen, Chairman and CEO of U.S. Recorded Music for WMG to help showcase environmentally-friendly, all-electric cars.\n\nHybrid Technologies, Inc. a development stage company, engaging in the development and marketing of electric powered vehicles and products as well as the development of portable battery power pack technology and vehicle conversions from conventional power systems to electric power systems. Disclaimer\nHybrid Technologies Blog \nHybrid Technologies, Inc. News: \n Hybrid Technologies, Inc. (OTCBB: HYBT) All-Lithium Smart Car and PT Cruiser Officially Part of the Canadian Federal Governments ecoTECHNOLOGY for Vehicles Program  \n Hybrid Technologies Inc. (OTCBB: HYBT) Canadian Federal Government Receives Official Delivery of Hybrid's All Lithium (Mercedes Benz) Smart Car and (Daimler Chrysler) PT Cruiser  \nHybrid Technologies, Inc. (OTCBB: HYBT) Stealth Chopper Takes Popular Mechanics and YouTube Viewers for a Zero-Noise Zero-Emission Motorcycle Ride \n\n                                                            \n                                                        The QualityStocks.net Daily Newsletter would like to highlight Intellegentias Inc. (ITLI) as \"One to Watch\" (ITLI) previously at $1.23 down 2% at 1.20 with \n\n\n 43,393\n\n shares traded. (ITLI) was highlighted recently month by StockEgg.com (ITLI) was also recently highlighted by OTC Advisors and Twin Trader. \n                                                            Intellegentias Inc. announced recently that they have appointed Lewis W. Moorehead, CPA as its Chief Financial Officer.\nIntellegentias Inc. announced recently that it has executed a non-binding term sheet to purchase, for cash and Intelligentias common stock, all of the outstanding common stock of DATAKOM, located in Ismaning, (Munich) Germany. DATAKOM specializes in information sent via telecommunications systems and the internet.\nIntellegentias Inc. announced recently that it has executed an agreement to acquire all of the outstanding common stock of Systeam Italy SpA from Systeam US, Inc. The acquisition allows Intelligentias, Inc. to obtain all of Systeam SpA's contracts with service providers, strategic alliance partners, network equipment providers, and systems integrators.\nIntellegentias Inc. is one of the most dynamic and fastest-growing companies in the Homeland Security sector. Intellegentias, Inc. which markets its Homeland Security software to Law Enforcement Agencies, Telco's and ISP's all over the world. The software allows customers to locate and prosecute terrorists and criminals, and to stay in compliance with federal legislation and directives Investigation, Inc., launching in 2007, is their data investigation company. Investigatia intends to focus on fraud, identity theft, identity authentication and verification. Interceptia, Inc., launching in 2007, is the company's Lawful Intercept company. Interceptia intends to focus on Legal Interception of telecommunications by law enforcement authorities (LEA's) and intelligence services. Disclaimer\nIntelligentias, Inc. Daily Blog \nIntelligentias, Inc. News: \n Intelligentias Subsidiary Moves Forward With Rollout  \nIntelligentias Announces Appointment of Chief Financial Officer \nIntelligentias Executes Term Sheet to Acquire German-based DATAKOM \n\n                                                            \n                                                        The QualityStocks.net Daily Newsletter would like to highlight Modavox, Inc. (MDVX) previously at $1.74 up 4% at $1.82 with \n\n\n 34,450\n\n shares traded. (MDVX) has a 52 wee ktrading range of $0.50 to 2.05 \n                                                            Modavox, Inc. announced announced this week that it has completed integration of the Voice123 voice talent acquisition and management utility to its Internet Radio and Interactive Product lines. Voice123 allows Modavox customers using Modavox's suite of Interactive products, including Internet advertising, enterprise and e-learning applications, to create the highest quality professional audio out of text.\nModavox, Inc. a pioneer in Internet broadcasting, producing and syndicating online audio and video, offers innovative, effective and comprehensive online tools for reaching targeted niche communities worldwide. Modavox provides managed access for live and on-demand Internet Radio Broadcasting, E-learning and Rich Media Advertising. Modavox also operates a content library, which consists of approximately 50,000 hours of prerecorded talk radio programming. Disclaimer \nModavox Blog\nModavox News: \n Modavox Delivers Internet Advertising and Internet Radio Production Through Partnership with Voice123  \n Modavox Names Ivan A. Martinez as Director of Interactive Sales  \n Modavox Chairman to Present at RedChip Conference Live via Webcast Today at 12:00 Noon Pacific Time \n\n\n\nThe QualityStocks.net Daily Newsletter would like to highlight Novori Inc. (NOVO) as \"One To Watch\" (NOVO) previously at $1.55 down 4% at $1.48 with \n  \n\n   74,105 shares traded. (NOVO) today set a new 52 week high of 1.90\n\n\n\nNovori announced last month that they have captured the first place position for e-commerce sales growth in the USA, rising from the third fastest growth industry in 2006. The principal component propelling online jewelry sales growth rate is diamond rings, engagement rings and other high-ticket items. \nNovori is a leading online interactive retailer of diamond engagement rings and fine jewelry. Novori launched their website in 2005 and has built a well-respected brand by providing consumers with superior customer service and a better way to buy diamond engagement rings. Novori hit huge sales growth in its second year, with 2006 revenues exceeding 2005 by 2,374%. Due to strong holiday sales, online jewelry rose from the third fastest to become the # 1 fastest growing online industry for 2007 according to Comdex published statistics. Disclaimer \nThe Novori Daily Blog  \nNovori News: \n Shazamstocks.com Announces Profile Launch of Novori Inc. \n\nThe QualityStocks.net Daily Newsletter would like to highlight Nascent Wine Co. (NCTW) previously at $1.25 down 8% at $1.14 with \n\n\n 138,253\n\n shares traded. (NCTW) was recently rated a \"Speculative Buy\" with a target price of $4.00 by Beacon Equity Research Analyst, Lisa Springer, CFA. (NCTW) was also highlighted by Small Cap Voice, Triple Crown Stocks and Beacon Equity Research. \nNascent Wine Company, Inc. announced recently that it signed a letter of intent (LOI) to acquire Grupo Sur Promociones de Mexico S.A. de C.V. GSP's expertise includes launching new products, merchandising, promotions, sampling, sales and marketing of retail products. Its revenues ending December 31, 2006 (unaudited) were approximately $25 million US dollars. This would be the largest acquisition to date for Nascent and it completes its national retail play in Mexico.\nNascent Wine Company, Inc. made some major announcements recently including one that could make Nacent the next Sysco (SYY) of Mexico's food and beverage distribution service providers. The company announced today that it has acquired Pasani, S.A De C.V., making Nascent a national player in the food service and retail trade. Pasani is a Mexican-based importer and distributor of the most popular name brand European and Asian food products in all of Mexico. Pasani currently sells and services 95% of the retail grocery and club stores in its market. \nNascent Wine Co. announced last month it has signed an exclusive distribution agreement with Reed's, Inc. (REED) giving Nascent the exclusive distribution rights for all of Reed's products, including the award-winning Virgil's Root Beer and Reed's Ginger Brews, throughout Mexico. The company also has the exclusive right to distribute Miller Beer -of Miller Brewing Company- (SAB.L) in Baja California, Mexico.\nNascent Wine Co. operates in the beverage and food industry in Mexico . Nascent Wine Co. was founded in 2002 and is based in San Diego , California . For more information please visit Nascent Wine Nascent Wine Co. Inc. is charting a course to become a leader in the beverage and food industry in Mexico . The Company is the exclusive distributor of Miller Beer in Baja California , Mexico . The Company plans to continue acquiring small- to medium-sized beverage and food distributors in Mexico . Nascent Wine Co. also plans to consolidate many of the smaller food service distributors in the Mexico market through acquisitions. Disclaimer\nNascent Wine Company, Inc. Daily Blog\nNascent Wine Company, Inc. News:\n Nascent Signs Letter of Intent to Acquire Its Mexico Sales Alliance Partner Grupo Sur Promociones  \n Nascent Food Service Announces Investor Conference Call to Open Communication to the Investment Community  \nSandro Piancone, CEO of Nascent Wine Company, Inc., Featured in a New Audio Interview at SmallCapVoice.com \n\n\nThe QualityStocks.net Daily Newsletter would like to highlight Novori Inc. (NOVO) as \"One To Watch\" (NOVO) previously at $1.55 down 4% at $1.48 with \n\n\n 74,105\n\n shares traded. (NOVO) today set a new 52 week high of $2.01 \n\n\nNovori announced today that revenues for the quarter ending February 28, 2007 were up 53% as compared to same quarter in the previous year. \nNovori announced last month that they have captured the first place position for e-commerce sales growth in the USA, rising from the third fastest growth industry in 2006. The principal component propelling online jewelry sales growth rate is diamond rings, engagement rings and other high-ticket items. \nNovori is a leading online interactive retailer of diamond engagement rings and fine jewelry. Novori launched their website in 2005 and has built a well-respected brand by providing consumers with superior customer service and a better way to buy diamond engagement rings. Novori hit huge sales growth in its second year, with 2006 revenues exceeding 2005 by 2,374%. Due to strong holiday sales, online jewelry rose from the third fastest to become the # 1 fastest growing online industry for 2007 according to Comdex published statistics. Disclaimer \nThe Novori Daily Blog  \nNovori News: \n Novori (NOVO) Announces 53% Growth in Revenues  \n Shazamstocks.com Announces Profile Launch of Novori Inc. \n\n                                                            \n                                                        The QualityStocks.net Daily Newsletter would like to highlight Quotemedia, Inc. (QMCI) previously at 0.27 down  7% at $0.25 with \n\n\n 84,020\n\n shares traded. \n                                                            Quotemedia, Inc. recently announced financial results for the three months ended March 31, 2007. These results reflect a 38% increase in first quarter revenue, from $838,266 in 2006 to $1,160,700 in 2007. At March 31, 2007 the company's cash balance was $1,127,470, an increase of $241,219 from the balance at December 31, 2006.\nQuotemedia, Inc. announced recently they entered into a two-year agreement to provide comprehensive financial market data including streaming real-time Level 1 and Level 2 London Stock Exchange data to Interactive Investor, one of the UK's leading online financial services providers. \nQuotemedia, Inc. engages in the development and distribution of financial market data and related services to a global marketplace. It specializes in the collection, aggregation, and delivery of both delayed and real-time financial data content through the Internet. Its products include stock market quotes, fundamentals, historical and interactive charts, company news, filings, option chains, insider transactions, corporate financial's, corporate profiles, investor relations provisions, level II, watch lists, and real-time snap quotes. Disclaimer \nQuoteMedia, Inc. Daily Blog  \nQuoteMedia, Inc. News: \n QuoteMedia to Provide Real Time Market Data to IPBS Customers  \n QuoteMedia Reports 38% Increase in Revenue for Q1 2007  \n QuoteMedia Announces Agreement with H.D. Vest Financial Services(R)\n\n\nThe QualityStocks.net Daily Newsletter would like to highlight Rancher Energy Corp. (RNCH) previously at $0.87 up 2% at $0.89 with \n\n\n 37,500\n\n shares traded. (RNCH) has a 52 week trading range of $0.85 to $3.46 \nRancher Energy Corp. announced in January that they have been rated \"Speculative Buy\" with a target price of $7.39 by Beacon Equity Senior Research Analyst, Kris Goldcross, CFA. Rancher Energy has successfully acquired major land positions in five oil & gas fields with proven past production and significant potential for undeveloped remaining reserves. \nRancher Energy Corp. is an oil & gas exploration and development company working to develop five significant assets in the Rocky Mountain region of the United States. Leading edge hydrocarbon recovery techniques like CO2 injection, directional drilling and 3-D seismic data have made it possible to extract the proven in-place oil and natural gas reserves that remain behind in mature fields, and high oil & gas prices plus rising demand have made it profitable. Disclaimer \n\n Rancher Energy Corp. Daily Blog \nRancher Energy Corp. News:\n Rancher Energy Corp. Adds Four New Board Members in Move to Strengthen Corporate Governance and Leadership Team  \n Rancher Energy Corp. Announces Results of Special Meeting of Stockholders  \n Rancher Energy Corp. Retains Pfeiffer High Investor Relations \n\n                                                        \n                                                        Today The QualityStocks.net Daily Newsletter would like to spotlight Solar EnerTech Corp. (SOEN) previously at $1.52 staying unchanged with \n\n\n 144,050\n\n shares traded.                                                         \n                                                        Solar EnerTech Corp. announce today that effective June 1, 2007 Ming Wai Anthea Chung was appointed to serve as the Company's Chief Financial Officer\nSolar EnerTech Corp. announced today announce the signing of a five-year sales agreement with ErgonSolair-WonlexTech Group, an Italian solar products distributor. \nlast month that it has signed an interim sales agreement worth a total of $8 million for the sale of 2Mw of solar cells and modules with Shanghai Very Sun Technologies Co., Ltd. (\"Very Sun\")\nSolar EnerTech is a photovoltaic solar energy cell manufacturing enterprise based in Shanghai, the Company has also established a marketing, purchasing and distribution arm in Northern California's Silicon Valley. The company plans to invest in PV cell research to develop cells to use in its manufacturing processes. They have also taken major steps toward establishing a leadership role in solar technology research and development. Disclaimer\n Solar EnerTech Corp. Daily Blog \nSolar EnerTech Corp. News:\n Solar EnerTech Appoints New Chief Financial Officer  \n Solar EnerTech Signs Sales Agreement With Italian Distributor  \n Solar EnerTech Ships First Container of Solar Modules to Africa \n\nSub Surface Waste Management of Delaware, Inc. (SSWM) closed today at $0.023 up 8% at$0.028 with \n\n\n 688,236\n\n shares traded. (SSWM) has a 52 week trading range of $0.02 to $0.05 \n                                                        Sub Surface Waste Management of Delaware, Inc.  ) announced that officials from its Mexico subsidiary company Environmental Tec International, S.A. de C.V. (ETI) have signed an agreement with Benemerita Universidad Autonoma de Puebla (BUAP) to contract services for the State of Puebla's Secretaria Del Medio Ambiente Y Recursos Naturales (Secretariat). ETI and BUAP will consult and train Secretariat staff relative to establishing State-wide environmental regulatory permit and fee structure program \nSub Surface Waste Management of Delaware, Inc. engages in the design, installation, and operation of proprietary soil and groundwater remediation systems for clean up of toxic waste releases to soil and groundwater, and the bio-recycling of spent activated carbon filtration media. The company's customers include oil companies; toxic and hazardous waste treatment and disposal companies; manufacturers with fixed point source facilities, such as automotive, aerospace, and electronic component manufacturers; specialty environmental remediation companies; agricultural processors, paper and cellulose waste-stream producers, golf courses; poultry, pork, beef, and fish processors; and medical and hospitality waste-streams . Disclaimer\nSub Surface Waste Management Daily Blog \nSub Surface Waste Management News: \n Environmental Tech International to Add New Board Members  \n ETI and Puebla University Sign Agreement for State Pollution Permitting  \n BUGS Management Preparing Company for Significant Growth \n\n\nToday The QualityStocks.net Daily Newsletter would like to spotlight TerraNostra Resources Corporation (TNRO) previously at $1.01 up 32% at $1.34 with \n  \n\n   \n\n\n 156,230\n\n\n  \n shares traded. (TNRO) was highlighted recently in The Knobias Clip Report, and Wall Street Grapevine and last month by Micro Cap Alliance, OTC Reporter, GMCR, Beacon Equity Research, Independent Investment Edge, OTC Reporter, Stock Wire, OTC Reporter and investingprofs.com \n Terra Nostra Resources Corporation recently announced the first successful monthly production and shipment, in the companies recently announced $30 million dollar contract. The shipment was for 304 grade stainless steel billets by Shandong Quanxin Stainless Steel Co., Ltd. \nTerra Nostra Resources Corporation was also highlighted in a report that touted China's General Administrator of Customs reports that imports of refined copper totaling 202,995 Metric Tons (MT) for March 2007. This represented a year on year increase of 148% compared to the same period last year, and illustrates the strong demand for copper in China. \nTerra Nostra Resources Corporation announced recently the details of the two sales contracts for Shandong Quanxin Stainless Steel Co., Ltd. (\"SQSS\"), its stainless steel joint venture operation in China. The first contract is with Qing Dao Baemyung Metal Co. Ltd which has contracted SQSS to produce 600 Metric Tons (\"MT\") of 304 grade stainless steel billets per month, for an annualized value of approximately US$30 million and the second which SQSS has been contracted by Zhejiang Yuyaohongda Stainless Steel Co. Ltd. to produce 201 series billets, with a contract is worth US$11 million annually.\nTerra Nostra is strategically positioned to benefit from the continually increasing demand for both copper and stainless steel from major growth sectors in China including the automotive, high technology, infrastructure development and construction industries. Disclaimer \nTerraNostra Resources Corporation Blog\nTerraNostra Resources Corporation News:\n Stainless Steel and Copper Crucial Components of China's Dynamic Economy  \n Terra Nostra Announces Shipments for US$30 Million Stainless Steel Contract  \n China Refined Copper Imports Jump 148% in March 2007 in Response to Strong Market Demand \n\n\nThe QualityStocks.net Daily would like to highlight VIASPACE  (VSPC) as \"One to Watch\" closing today at 0.28 dropping 1% at $0.28 with \n\n\n 81,478\n\n shares traded. (VSPC) was highlighted recently by Knobias Clip Report ,Small Cap Stock Alert, OTC Picks \n\nVIASPACE announced that its VIASPACE Security subsidiary has been officially notified by the U.S. Patent Office that patent application No. 11/350693 for Explosive Device Detection Based on Differential Emissivity will be granted. Viaspace has been invited to present at GreenTech 2007. Co-hosted by the Caltech Office of Technology Transfer and Entretech and set to take place at the Hilton Hotel in Pasadena on June 14, 2007\nVIASPACE announced recently that its new proprietary fuel cell humidity sensor product is receiving significant market interest. VIASENSOR HS-1000 Humidity Sensor has generated multiple inquiries from potential customers including major auto manufacturers, automotive test systems providers and fuel cell developers and manufacturers. \nVIASPACE  recently reported that the emergence of fuel cell technology for portable electronics and the strategy of its Direct Methanol Fuel Cell Corporation subsidiary to capture a significant share of the large projected market for direct methanol fuel cell cartridges. Methanol fuel cells are expected to gain a substantial market share because they offer operating time two to three times longer than current lithium ion batteries, can support the increased energy demands of additional wireless and television features, are environmentally friendly, and may be instantaneously recharged by simply replacing the disposable fuel cartridge. \nVIASPACE  was formed with the objective of transforming proven space and defense technologies from NASA and the Department of Defense into hardware and software solutions that solve today's complex problems, VIASPACE benefits from important patent and software licenses from Caltech, which manages NASA's Jet Propulsion Laboratory. Disclaimer\nVIASPACE Inc. Daily Blog \nVIASPACE Inc. News: \n U.S. Patent Office Notifies VIASPACE Security of Patent Grant for Explosive Device Detection  \n VIASPACE to Present at GreenTech 2007 Conference Sponsored by Caltech Office of Technology Transfer\n VIASPACE Presents its Fuel Cell Cartridge Manufacturing & Distribution Strategy at Singapore Battery/Fuel Cell Conference\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nCathy & Vanessa hosts of The Daily Stock Report\n\nCheck out the Video\n\n\n\n\n\n\n\n\n\n\n Sponsors of the Day:\n \n\n\n\nWall Street News Alert (WSNA) is the advertising and information dissemination subsidiary of Wall Street Capital Funding LLC (WSCF). We know that there are many quality small cap, micro cap and private companies with explosive new technologies and products just waiting to be discovered by the investment community. However, many of these companies lack the exposure required to raise the resources needed to improve equity appreciation and liquidity. They need visibility, but do not have the time and resources to introduce their companies to a wide range of potential interested parties. These are the companies that WSNA seeks to serve. WSNA offers a comprehensive list of services designed to get your message out to the public.\n\n\n\n \n\nWith a focus on attracting serious investors and maintaining civilized forums, InvestorVillage is quickly becoming the most engaging and informative stock discussion community on the web.\nWe’ve put a new face on stock discussion forums. At InvestorVillage you’ll find a clean, easy-to-navigate interactive site; a civilized, open community, with plenty of vigorous discussion among serious investors; and a dedication to superior customer service. Our site and our services have been designed based on our members needs and feedback.\nIf you’re a serious investor looking for a high-quality forum to discuss and learn about your favorite stocks, you’ve come to the right place. \n\n\n \n\nezBanc is a Merchant Banking Firm which specializes in delivering focused investment banking, consulting and private lending services to both high net worth individuals and companies, private and public. ezBanc’s main scope of transactions includes investments in real estate, hotel and land development, structured financial products for private and public companies (such as structured block purchases and Reg. A), as well as restricted stock lending programs. ezBanc’s recent inclusion of the True Loan Program (TLP) has allowed the company to garner the attention of the Mid Cap and Large Cap Markets, as well as the respect of prominent SEC legal professionals, hedge funds and individual investors.\n\n\n \n\n \n\n\nEmailing thousands of our opt-in subscriber your company's message. \n\n\nCampaign your company profile on a network of financial websites \nConstantly disseminating your company's news press and emailing it to new investors. \nIncrease your company's current shareholder base, investor interest and internet presence through dramatically enhanced exposure \nIncrease market capitalization as a result of increased shareholder base \nIncrease trade volume for your stock\nIncrease liquidity\n\n\n \n\nThePennyStockBlog is the best place for quality stock picks and discussion. You'll find a strong, knowledgeable trading team in our live trading chat room and on our message boards. As well as trading articles and tips on how to trade the volatile penny stock market successfully.\n\n\n \n\n\n\nSmallCapVoice.com is a recognized corporate consulting firm, with clients nationwide, known for its ability to help emerging growth companies build a following among retail and institutional investors. \n\n\n\n\n\n\n\nWelcome to the online file cabinet of the SmallCap Sentinel where news briefs, research, informational reports and more are archived for your perusal. If you're looking for our comprehensive profiles on emerging public companies please visit us at StockUpTicks.com. SmallCap Sentinel and StockUpTicks.com are powered by Market Pathways, a 23-year old full-service investor relations firm and financial courier.\n\n \n\n\n\nHotStockMarket (HSM) is the largest and most popular penny stock message board on the net. With a thousand new members signing up every month, HSM continues to be the message board of choice for small cap investors looking for the next hot stock or simply to discuss strategy and trading techniques.\n\n\n \n\nWith 500 million dollars a day passing through the microcap markets, fortunes are won and lost everyday. The information you have and speed at which you move will effect the difference of profit and loss. Market News First will provide you current microcap news that will keep you posted on the established companies, as well as informing you of the newest opportunities within the microcap market.In short, whether you're seeking microcap news and information or looking for your next microcap investment opportunity, Market News First has you covered! \n\n\n \n\nWe at Stockwire Research Group, Inc. believe that every investor is different and each has their own risk profile. No single portfolio should consist entirely of emerging growth stocks, but a reasonable allocation put towards these stocks can help to increase overall long term investment results. It is our goal to assist our members in finding those up and coming companies whose stocks are poised for superior capital appreciation.\n  Stockwire.com – Bringing you tomorrow's big winners, today! \n\n\n \n\nThe Bull Report is constantly looking for unique investment opportunities that can help serious investors increase returns in a well balanced portfolio. Some of the best performing stocks on the market are quality small cap and micro cap companies with groundbreaking products and a growing business model. Often times all that these emerging growth companies lack is the exposure to the investment community. The Bull Report focuses on bringing these companies the exposure they need.   \n\n\n \n\nCashcow Magazine Online is an innovative online financial magazine dedicated to featuring new and emerging growth stocks to its affluent, web-savvy investor audience. CashcowMag.com has been around since 1997 and has become one of the industry's main go-to sources for up-to-date financial information.\nThe continuing focus of CashcowMag.com is to find companies that they feel have tremendous growth potential and help them to expand and develop their business. Their years of experience, Investor Relations network, and large subscriber base are an assurance that a company will have the finest assistance available in achieving its goals and objectives.\n \n\n\n \n\nStockPromoters is the first and only site of its kind. StockPromoters tracks thousands of promotional websites, newsletters, and fax and email campaigns.\nWith the help of StockPromoters investors will no longer be left holding the bag. Public companies will stop wasting dollars and shares paying useless promoters, and the worthy promoters won't have to wear the black eye they carry from all the rip-off artists out there anymore! \n\n\n \n\nBeacon Equity Research is a leading research provider that is committed to finding undiscovered small cap companies and bringing them to the attention of the investing community. Beacon's research team is comprised of recognized professionals in their industry, all of which are CFA certified – one of the highest designations in the financial industry. Beacon has gained the respect of many brokers, money mangers and individual investors who have learned to look turn to its research first when considering a potential new investment. These unique relationships and its credibility in the small cap market give it an edge over most other research providers in this sector. It is no wonder then that in 2006 Beacon Equity Research was selected by more forms to provide research than any other provider in the micro cap sector. \n \n\n\n \n\nIn today’s ever changing financial environment Businesses recognize there is a new economy and culture taking root and shaping the business landscape. Today companies must seek to promote uniqueness, values, and innovation… not simply out of want, but to survive within this new environment.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nThe QualityStocks One’s to Watch\n\n\n   \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe QualityStocks Public Company Sponsors \n\n \n\n\n\n\n           \n \n\n\n\n    \n        \n       \n                   \n\n \n\n\n\n\n    \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  QualityStocks By The Numbers Report \n\n\n\n\n\n\n \n\n\n\n\n\n\n\nCopyright 2006-2007 QualityStocks.net 3370 N. Hayden Rd. Suite 123-591 Scottsdale, AZ 85251 480-308-0703\n\n\n\n\n\n\n\nHome | Blog | Video | Market Basics |  Tracked Firms | View Quotes | Media | Partners | Clients | About Us | Contact Us | Disclaimer | Unsubsc\n ribe\n\n\n\n\n \n \n\n\n"}