{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory - The Memorial Day Issue", "body": "May 28, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\n>From Decoration Day To Memorial Day\n\nA Great Company - Dedicated To Protecting Our Troops\n\nDown A Lazy River\n\n-----\n\nMemorial Day, as most of us know, commemorates the U.S. men and women who\nhave died in military service to their country.\n\nBut when it first became a national holiday in 1868, it was called\nDecoration Day, and it was only for honoring - and decorating the tombs of\n- fallen Union soldiers.  The Civil War, of course, was the bloodiest of\nall America wars, because every man who fell was an American.  And\nfollowing the war, it was nearly impossible to find a family - or the\nremnants of one - unaffected by the war.  So taking a day to decorate the\ngraves of lost ones was only natural.\n\nThe Confederate states, interestingly, already had various days for\nhonoring their dead, and most saw no point in changing the date to suit\nthose northerners who had so recently been killing their menfolk.\n\nWorld War I, however, proved a major unifier for the north and south; when\ntwo parties join to fight a third power, that's what happens.   \nSo after that war, most southern states began to observe Decoration Day.\n\nThirty years later, after World War II, the name Memorial Day became more\ncommonly used, and finally, in 1967, the name was officially changed to\nMemorial Day.\n\nBut how many of us actually go to graves on this day to formally remember\nour fallen servicemen and women?  Not enough, I'll wager.   And fewer and\nfewer every year.  And that's partly because most of the people who\nactually remember those dead soldiers have passed on themselves.\n\nConsider the numbers, which reveal a real trend of shrinkage over time.\n\nRevolutionary War      25,324\nCivil War - North       363,020\nCivil War - South      199,110\nWorld War I               116,708\nWorld War II               408,306\nVietnam War                58,219\nIraq War                         3,434 and counting\n\nWith luck, the trend will continue, and the number of lives lost in future\nconflicts will dwindle further.  The chief factor in the equation, of\ncourse, is politics, and we all know what a messy battleground that makes.\n Even if we did have a \"perfect\" president in the White House, there's no\nguarantee he'd be able to avoid conflict with the unreasonable leader of\nanother country.\n\nBut if you're going to fight, you want the best equipment, both offensive\nand defensive.  From the dawn of civilization, when men fought with spears\nand atlatls, technology has mattered.  So, in the interest of reducing the\nloss of American lives in the future, I present one stock for today, a\ncompany whose goal is to protect our troops by getting them into the\nworld's best armored vehicles.\n\n\n----- Advertisement -----\n\nGrow 50% or Pay Nothing!\n\nWhen Intuitive Surgical represented the best growth story on Wall Street\nin August 2004, we quickly named it Stock of the Month.  Since then it's\nhanded investors 600% gains.\n\nWhen we could see that Apple Computer's earnings momentum was shooting\nthrough the roof in October 2004, we named it Stock of the Month. It was\nselling for a shockingly low $35 per share. Today, (adjusted for a 2-for-1\nsplit) it has turned a $10,000 investment into $43,000.\n\nWhen the rest of Wall Street felt that Google's best days were behind it\nin July 2005, our research said the tear would continue. Six months after\nwe named it Stock of the Month, my readers saw the stock gain an\nincredible $160 a share.\n\nThere are 16 more Stocks of the Month I could name that have handed us an\n88% average profit per stock over the past two years...\n\nIntroducing Cabot Stock of the Month - Try It Risk Free for the Next 12\nMonths...\n\nTo learn more, please visit this link:\n\nhttp://cabotmail.net/t/188777/13148861/86/0/\n\n-----\n\nThe company's name is Force Protection.  It's based in an old General\nElectric turbine factory near Charleston, South Carolina.  And it sells\nthree models of vehicles.\n\nFirst, there's the Buffalo, which seats only four and is designed for\nmine-clearing.  The Buffalo weighs 45,000 pounds, stands 13 feet tall, is\n27 feet long, and can withstand a 30-pound blast of TNT under any wheel\nand a 15-pound blast under its centerline.  Powered by a 400 hp Mack\ndiesel, it has an articulated telescoping boom that can be manipulated to\ndiscover, detonate, and remove explosive devices.  If I had to be in Iraq,\nI'd want to be in a Buffalo.\n\nSecond, there's the Cougar, which comes in two sizes, the four-wheeled\nmodel and the six-wheeled model.\n\nThe four-wheeled model is 19 feet long, weighs 31,000 pounds and can carry\nup to ten troops, while keeping them protected from mines, gunfire and\nimprovised explosive devices (IEDs).  The six-wheeled model is 23 feet\nlong, weighs 38,000 pounds and can carry 12 troops in the same\nconditions.\n\nBoth are powered by a 330 hp Caterpillar diesel and can be fitted with a\nmachine gun on the roof, which can be either manually or remotely\noperated.\n\nAll of Force Protection's vehicles are designed with a V-shaped bottom\nthat deflects blast forces away from the vehicle's occupants.   \nTo date, they've encountered thousands of blasts from both mines and IEDs\n(improvised explosive devices) in Iraq and occupants have suffered no\ncasualties.\n\nNew this year (and untested in the field) is the Cheetah.  While the\nBuffalo and Cougar can run all day at 55 mph and sprint at 65 mph for\nshort periods, the Cheetah, powered by a 300 hp Cummins diesel, can cruise\nat 75 mph and sprint at 89 mph.  Tipping the scales at \"just\" 14,000\npounds (the equivalent of two Chevy Suburbans), and accommodating just six\ntroops, the Cheetah is the lightweight of the family, designed for urban\noperations.  Yet it can withstand the same explosive blasts as the\nBuffalo!\n\nYou might, however, call it the Humvee-killer.\n\nYou see, the Humvee, or High Mobility Multipurpose Wheeled Vehicle\n(HMMWV), has been in active use by the U.S. military since 1985.  But a\nHumvee is not an armored vehicle!  A basic Humvee costs nearly $65,000 and\nby the time you add armor the cost is about $140,000.   \nBut doing so not only shortens the vehicle's useful life because it wears\nout more quickly, it also makes it more prone to rollovers . . . and\nthat's not good for the troops!\n\nSo the big story today is that the Cheetah, along with its bigger\nsiblings, is very likely to be chosen to replace the bulk of the 17,700\nHumvees in Iraq.  In all likelihood, the U.S. Army will soon be asking for\nsome $8 billion for armored vehicles to protect its troops.  The request\nis likely to be granted.  And the major beneficiary of the orders that\nfollow will likely be Force Protection.\n\nIn 2004, the company's revenues were $10 million, in 2005 they were $50\nmillion and in 2006 they were $196 million.  That's very impressive\ngrowth.  But imagine what will happen if Uncle Sam comes along with a\nmulti-billion-dollar order.\n\nIt boggles the mind.\n\nNow, I'm not predicting the order will be for $8 billion.  Congress could\neasily shrink that number a bit.  And competitors are likely to get a\nlittle of the action, too.  But not much.  Force Protection has 81% of the\nmarket for armored vehicles today.\n\nA look at the competition reveals the Bushmaster from Australia, the Dingo\nfrom Germany, the RG31 made by GD in South Africa, the RG33L by BAE of\nBritain, and the ASV by Textron.  For obvious reasons, the U.S. military\nwould like to buy domestically.  Even more important, the Buffalo and\nCougar have the best safety records, and they cost less than the others,\nso the Cheetah is likely to have the inside track.\n\nAs for production capability, Force Protection has partnered with General\nDynamics (which will perform structure fabrication of some vehicles) and\nArmor Holdings (which will contribute armor) as a way of increasing its\nmanufacturing capabilities.  It's buying increased manufacturing adjacent\nto its current space.  And because it's just 10 miles from the Charleston\nAir Force Base in Ladson, South Carolina, it can deliver those vehicles\neasily!\n\nForce Protection is already very busy.  In April the company received a\n$490 million order to produce 1,000 vehicles for the U.S. Marines, and in\nMay a nice little $9 million order came in to build Buffalos and Cougars\nfor the Canadian Expeditionary Force Command.  But it's the promise of\nthis huge Humvee-replacement business that has investors seeing dollar\nsigns here.\n\nOf course, this story is not a secret; with every piece of good news, this\nstock climbs a little higher.  By some measures, it's expensive today; its\nmarket capitalization is $1.9 million, which is 7 times the past twelve\nmonths' revenues.  The price/earnings ration is 163!\n\nBut looking ahead, and assuming that the big U.S. order does come through,\nI think the stock is cheap, and that's why I'm recommending it today. \nIdeally, you want to buy when the stock corrects to its 25-day moving\naverage down around 25.  That's also the level where the stock met\nresistance back in January, so it should act as a floor.\n\nAnd if the stock fails from there, you cut your loss short; nothing is\nguaranteed in this business.  But if you manage your risk properly (buying\nat the right point is very important in this regard), stories like Force\nProtection can pay off very well.\n\n-----\n\nEditor's note:\n\nFor the record, Force Protection (FRPT) was first recommended in Cabot Top\nTen Report two weeks ago, when it was trading at 27.  In that write-up,\neditor Mike Cintolo suggested buying between 23 and 26, and the stock in\nfact did fall smack into that range two days later.  If you'd like\ncontinued updates on the status of Force Protection, as well as first\nnotice of other hot stocks that come along, consider a no-risk trial\nsubscription to Cabot Top Ten Report, which every Monday brings a 12-page\ne-mail analyzing the week's hottest stocks.  To get started, simply click\nthe link below.\n\nhttp://cabotmail.net/t/188777/13148861/81/0/\n\n-----\n\nFor most Americans, Memorial Day marks the end of the school year and the\nbeginning of summer.  So millions of families will cook out on the grill,\ndrink beer and watch the Indianapolis 500.  In the south, they'll swim,\nand in the north, they'll wish they could.\n\nAnd me, I'll be canoeing the Ipswich River with a few dozen family and\nfriends . . . because that's our tradition.  This trip has been going on\nsince the 1940's, originally in wood and canvas canoes and now in aluminum\ncanoes that don't mind when you scrape your way over fallen tree limbs. \nYou see, the Ipswich is not a mighty torrent; it's quiet, little more than\na big stream in places.  But it floats our boats, we get to watch birds,\nducks and turtles and enjoy an electronic-free day.  And as long as it\ndoesn't rain, it's great fun.\n\nHere's hoping you, too, get to spend the day in the company of family and\nfriends, and that in the midst of the festivities, you find a minute to\nremember those who gave their lives for our great country.\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n-----\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=188777&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}