{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "60 Minutes Newsletter <newsletter_sixty_minutes-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "60 Minutes E-mail Alert", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nIf there is hope for \n      an end to the terrorist violence carried out by radical Muslims, it begins \n      with people like Nasir Abas. Abas, you will learn in our lead story, is \n      trying to convert Muslims to the true, peaceful path of Islam. Abas once \n      lived for the jihad, helping to run a terrorist training school in the \n      jungles of Southeast Asia, until the new dictum from Osama bin \n      Laden to kill civilians shocked his sensibilities. It was too late to take \n      back what he had already done. He realized that he had trained the \n      terrorists who had detonated two bombs that killed 202 people on \n      Bali in 2002. But he vowed to make up for \n      his mistakes and at no small risk to himself, has testified against agents \n      of his former al Qaeda-affiliated group, Jemaah Islamiya, and speaks \n      regularly to Islamic students to urge them to reject radicalism and \n      violence. \"We need to educate \n      people. We need to give more explanation, about what is right, what \n      is wrong…this is my new jihad,\" Nasir tells correspondent Bob \n      Simon.\n \nWatch an excerpt of Simon's \n      report.\n \n \nTalk radio has no shortage of \n      hosts who have declared jihad against illegal immigrants, but now \n      television has one too, and an unlikely one at that. In our second \n      story, you'll meet the transformed Lou Dobbs, CNN anchor who once reported \n      business news with all its elite corporations and profits, now reborn as a \n      populist pundit standing up for the common man and, oftentimes, railing \n      against a common enemy: illegal immigrants. Correspondent Lesley Stahl is \n      surprised to learn that Dobbs, though he never called for their \n      deportation, believes the U.S. could deport all the \n      estimated 12 million illegal immigrants if it wanted to. \"Because this is \n      the United \n      States. I think this country can do \n      anything it sets its mind to,\" says Dobbs.\n \nWatch an excerpt of Stahl's \n      report.\n \n \nSeventy-four year-old Teri \n      Horton, an ex-truck driver, has set her mind to something and she won't \n      let go. She has turned down $2 million for a painting she paid $5 \n      for. She’s not crazy, just convinced – and there’s a fingerprint on the \n      back that matches one from the artist’s studio – that the big, drippy \n      painting is a Jackson Pollock. Our third story pits this feisty, \n      plainspoken woman against the connoisseurs of the art world who won’t \n      accept that this thrift store purchase is really an abstract impressionist \n      masterpiece maybe worth $50 million. CNN’s Anderson Cooper \n      reports.\n \nWatch Cooper's reporter's \n      notebook.\n \n \nThese stories and Andy \n      Rooney's headaches over headlines in the newspaper, this Sunday, May 6, on \n      60 Minutes at 7 p.m. ET/PT. \n      \n \nFor an early look at this \n      week’s stories, please click \n      here.\n\n \n       \n       \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n \n"}