{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Anthony W. Youngman\" <debian@thewolery.demon.co.uk>", "subject": "Re: Bacula: GPL and OpenSSL", "body": "In message <20070607181511.GA1025@excelhustler.com>, John Goerzen \n writes\n>On Thu, Jun 07, 2007 at 10:50:39AM -0700, Walter Landry wrote:\n>> John Goerzen  wrote:\n>> > Kern believes that he must remove the explicit OpenSSL exemption from\n>> > the license in order to be fully GPL-compliant, and it appears that FSFE\n>> > agrees.\n>>\n>> I just read the contents of\n>>\n>>   /usr/share/doc/bacula-director-sqlite/copyright\n>>\n>> I have reproduced it below for debian-legal.  The Linking section,\n>> which is needed for linking with OpenSSL, is not a problem for\n>> GPL-compatibility.  The other parts may or may not be a problem, and\n>> indeed seem superfluous, but all that is needed is the Linking\n>> section.\n>\n>But the problem is that parts of Bacula's code are copyrighted by third\n>parties, and licensed under plain GPL (or Kern's license before he added\n>this exception), and may be unreachable for obtaining permission to\n>relicense with this exception.  (Kern, have you tried contacting them?)\n\nThe \"Kern's licence\" thingy isn't a problem.\n\nIf I, for example, release a load of code under the GPL, and then later \nsay \"I'm releasing all my code - *including stuff already out there* - \nunder the GPL\", the fact that there may be loads of stuff of mine out \nthere saying \"GPL\" is irrelevant.\n\nAnybody can now either add a copy of my statement about the LGPL to the \nlicencing file, or add a pointer to my statement, and then they can take \nany of my code that claims to be GPL'd and use it under the LGPL.\n\nSo if Kern has said that the addition of this extra freedom \"applies to \nall his code in Bacula\", then anybody can add a copy of this statement \nto COPYING.TXT and be covered.\n\nCheers,\nWol\n-- \nAnthony W. Youngman - anthony@thewolery.demon.co.uk\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}