{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Zachary Kline\" <Z_kline@hotmail.com>", "subject": "Re: VmWare", "body": "Hello,\n    Unfortunately, I don't have the good fortune to have a physical serial \nport.  I used SSH for the install and the initial configuration of the \nsystem because of that.\n    After the install, I made sure ssh started on boot, and logged into it \nagain and set Alsa up.  It worked like a charm, and now I can just use \nsoftware speech, with normal speakup review keys, as you said.\n    I've yet to try running Gnome.  But if the performance from the system \nas it stands now is any indicator, I shouldn't be surprised if it worked \nvery well indeed.\n    I also plan to try fiddling with USB serial hardware on the VM, to see \nif I can get it to be recognized as real serial hardware.\nI'll report on this as I try it.\nAll the best,\nZack.\n\n----- Original Message ----- \nFrom: \"Gregory Nowak\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Sunday, April 15, 2007 8:40 PM\nSubject: Re: VmWare\n\n\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA1\n>\n> Thanks, both what you and Alex said is very clear. I assume that once\n> you hit ctrl+g to interact with the vm, you can use normal speakup\n> review keys, and get speech from a serial hardware synth, assuming you\n> correctly redirected the virtual serial port to the machine's physical\n> serial port? Did you use ssh to do the install, because interacting\n> with the vm isn't as simple as I assumed in my previous question, or\n> was it simply because you just wanted to use ssh to do the install, or\n> because you didn't have a physical serial port/hardware synth?\n> Has anyone tried running gnome in a vmware machine running on a\n> windows host? If this is all as straight forward as it sounds, and as\n> good as it sounds, I may not have to worry about gnu/linux compatible\n> hardware, (I.E. modem, wireless card, on-board serial ports, ETC.), and \n> about the\n> warranty if you resize partitions or remove windows, when looking for\n> a new laptop in the future.\n>\n> Greg\n>\n>\n> On Sun, Apr 15, 2007 at 07:41:41PM -0700, Zachary Kline wrote:\n>> Hiya,\n>>     I at least have found it to be a viable alternative so far, and would \n>> be\n>> glad to describe my methodology as best I can.\n>>     I downloaded VMWare server and installed it on Windows.  I then ran \n>> the\n>> VMware Virtual Machine Console, as it's called, and created a new VM. \n>> The\n>> console GUI is quite easy to navigate, at least with Window-Eyes.\n>>     I had previously downloaded a Gentoo ISO, which I used as my cdrom\n>> image.  The process of adding a cdrom to the vm is fairly \n>> straightforward:\n>> if someone wants more details I'll add them.\n>>     I also switched the Ethernet adapter--which is an emulated PCnet32 to\n>> 'bridged' mode, because I happen to be on a private network that can \n>> handle\n>> that sort of thing.\n>>     Finally, I booted up the ISO and waited a few seconds, then hit \n>> ctrl+g\n>> to switch the input to the VM.  I gave an ifconfig command to switch eth0 \n>> to\n>> an IP address I knew, changed the password on the root account, and \n>> started\n>> sshd.\n>>     From that point, I just ssh'd into the VM--after hitting ctrl+alt to\n>> switch input back to Windows.  The Gentoo install, including partitioning\n>> and kernel compilation, went off without a hitch.  I just made sure to \n>> start\n>> sshd at boot, configure the network appropriately, etc.\n>> I'm glad to answer any questions you may have.  I apologize if this has \n>> been\n>> vague.\n>> I hope I can help.\n>> Thanks,\n>> Zack.\n>>\n>>\n>> _______________________________________________\n>> Speakup mailing list\n>> Speakup@braille.uwo.ca\n>> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n> - -- \n> web site: http://www.romuald.net.eu.org\n> gpg public key: http://www.romuald.net.eu.org/pubkey.asc\n> skype: gregn1\n> (authorization required, add me to your contacts list first)\n>\n> - --\n> Free domains: http://www.eu.org/ or mail dns-manager@EU.org\n> -----BEGIN PGP SIGNATURE-----\n> Version: GnuPG v1.4.6 (GNU/Linux)\n>\n> iD8DBQFGIvBB7s9z/XlyUyARAjacAKCthPURHqNSeholcVVRvXc0VlE+WQCgzfmX\n> 2bEGLxaiB5D1x4BkU1Hx1Ls=\n> =vKvr\n> -----END PGP SIGNATURE-----\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}