{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Nicole Pope <istinjf@greatwesternsupply.com>", "subject": "Want to be on the top all night long?", "body": "\n\nYour lady can't have orgasms? Heh, body, it's your fault. Do you want to fix that?\nAll this you can find here\nViagra, Cialis, Levitra, Valium, Phentermine - they are all licensed and are the best quality!\nVisit us\nNo one will know that you are using medications.\nWith best regards,\nNicole Pope\n \n \nOn dazhe ne vspotel, golos ego protiv ozhidaniia ne drozhal ot napriazheniia, kogda on Zagovoril s nej, a vzgliad sero-zelenyh glaz byl predelno serezen: chto-to poshlo ne tak, svetochtimaia, verno? Ohrannyj amulet ne srabotal. Muchitelnoe usilie. V obshchem, horoshim zverem byl ee shalun. I natknulsia na pronizyvaiushchij Holod. \nKopyta snova zacokali po kamenitu. On vse eshche drozhal Posle proisshestviia, no, chuvstvuia, kak silnye ruki Onni Belt laskovo obnimaiut Ego za plechi i ponimaia, chto Gront emu bolshe nichego plohogo sdelat ne smozhet, Ponemnogu uspokaivalsia. Ty ved vsegda gordilas tem, Chto umela ukroshchat svoi zhelaniia, a sejchas raskisla, priamo kak rodnaia sestrichka, Ne sposobnaia propustit mimo sebia ni odnogo skolko-nibud smazlivogo muzhika. Ia s trudom otorval vzgliad. Nu, horosho. Odna ego chast ostalas Na zemle, v tesnoj splochennoj gruppke, drugaia okazalas vysoko v nebe, Perenesennaia vverh siloj pryguna i Nkota. Nikogda ne videla podobnogo bessmyslennogo zverstva, zhestko Prishchurivshis v storonu zasfernika s kakim-to upriamym nedoveriem, kivnula Onni, Kogda Gileveri zakonchil. Prekrasno, Niks. \nNeozhidanno on rvanulsia s takoj siloj, chto protashchil za Soboj konvoirov na neskolko shagov, prezhde chem odin iz nih utihomiril Starika, udariv rukoiatkoj izluchatelia po shee. Vot tolko do ranga mastera nikto iz nih podniatsia tak i ne smog Na moj vzgliad, k luchshemu, tak kak Frajda oshibsia v vybore: prirodnye Vozmozhnosti llerov okazalis nizki. Ona podniala golovu, otorvavshis ot razgliadyvaniia svoih sapozhek, i Pristalno posmotrela mne v glaza. Nkot nemnogo naputal s Chislennostiu, chetyre dushi iz kopilki Hranitelia ostalis beshoznymi. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}