{"category": "ham", "to_address": "perl6-language@perl.org", "from_address": "cdumont <cdumont@comquest.co.jp>", "subject": "Re: Perl6 new features", "body": "You should discuss that on p5p, not here. Only Perl 6 is on topic here.\n\nSure, but I've started from perl doc 5.8 in order to say that it could be nice \nto have the features I'm talking about in perl6 so it's not out of the scope I guess.\n\n\n\nit seems to me that you already have this : in line of command you can\n\nuse \"perldoc -f split\" to get the split() doc, where there are\n\nexamples and return value and parameters are discussed at length, if\n\nyou prefer a \"modern\" format,\n\nhttp://perldoc.perl.org/functions/split.html should content you, and\n\nyou can use Pod::POM::Web to get a small HTTP server where all Perl\n\ndoc (core and modules) can be browsed and searched, so what exactly\n\nare you speaking about ?\n\n\nAs for the documentation, I've already watched this link \nand depending on the functions, informations are more or left complete.\nIn the case of split there are quite few examples but it's not the case for a lot of \ndocumentations.\n\nhttp://perldoc.perl.org/functions/chop.html\nhttp://perldoc.perl.org/functions/lc.html\n\nYou might say that it doesn't need more but \nAdding user comments within the doc could allow to get much more usefull examples\nand 'tips' from other programmers. not a full blown oop cpan module but just a \nuseful adding, transforming, real word use of the function.\n\nhttp://perldoc.perl.org/functions/pack.html\n\nThis is an other function well documented.\nBut if in split, the result of the example is included below the code\nwith a sentence such as 'produces...' here, it is a comment below the line,\nor 'gives...'\n\nThere's no real common pattern to get in a glimpse the function use.\nA kind of standardisation could help.\n(what are the arguments names, i've just found : EXPR, VALUE, Y,X,VARIABLE,NUMBER,PLAINTEXT...)\nthere is a standard but it's not very as evident as it could be.\n\nfunction parameters,flags\nfunction return : .success:... .failure:...\nExample :\n...\nOutput :\n...\n\nWell i'm talking about the 5.8 but remember it's in order to know \nif there can be ways of improvement for perl6 doc.\n\n\n\n\nMoritz Lenz wrote:\n\n>A: because it disrupts the natural way of thinking.\n>Q: Why is top posting frowned upon?\n>\n>cdumont wrote:\n>  \n>\n>>Perl 6 is not yet finished, so the the list of core modules is not yet\n>>specified.\n>>\n>>\n>>I know that it is somehow not the subject,\n>>but I think the actual 5.8 doc should be changed to some extents.\n>>    \n>>\n>\n>You should discuss that on p5p, not here. Only Perl 6 is on topic here.\n>\n>  \n>\n>>Is there a place where we can add suggestions ? apart from the first one in...\n>>2003 ? 4 years ago ?\n>>    \n>>\n>\n>You can write them here on p6l.\n>\n>\n>  \n>\n\n\n-- \n\\u30b7\\u30ea\\u30eb\\u30fb\\u30c7\\u30e5\\u30e2\\u30f3\\uff08Cyrille Dumont\\uff09\ncdumont@comquest.co.jp\nour work is the portrait of ourselves\ntel: 03-5690-0230 fax: 03-5690-7366\nhttp://www.comquest.co.j\n\n\n"}