{"category": "ham", "to_address": "John Kane <jrkrideau@yahoo.ca>", "from_address": "Marc Schwartz <marc_schwartz@comcast.net>", "subject": "Re: [R] sas.get problem", "body": "On Wed, 2007-04-11 at 14:38 -0400, John Kane wrote:\n> --- Cody_Hamilton@Edwards.com wrote:\n> \n> > \n> > John,\n> > \n> > Do you not have sas on your machine? (That would\n> > definitely keep sas.get\n> > from executing.)\n> > \n> > Regards,\n> >    -Cody\n> \n> No I don't have SAS on my machine. Nobody in my group\n> uses it and we seldom use SPSS. I think one person has\n> STATA. Most of the work is more policy than data work\n> and the occasional spreadsheet (shudder) does for\n> basic work. \n> \n> I am too cheap to have us spend a huge amount (well,\n> large amount anyway) for something that  I am likely\n> to use for 5-10 minutes a year. The last time I wanted\n> a SPSS file exported to \"delimited\" I just asked\n> someone in another department whom I knew has it on\n> his labtop to do it. \n> \n> I just hike across campus to the nearest lab with SAS,\n> SPSS etc installed. Done occasionally and in decent\n> weather it is not a problem. Today it is turning into\n> a marathon but I need to lose some weight.\n\n\n\nJohn, I believe that this has been mentioned on the list previously, but\nif you don't have convenient access to SAS, they do offer a free\ndownload called the SAS System Viewer. It can read the proprietary SAS\ndatasets and then enable you to save them as ASCII delimited files.\n\nIt is available at the SAS web site here:\n\nhttp://www.sas.com/apps/demosdownloads/sassystemviewer_PROD_9.1.3_sysdep.jsp?packageID=000313\n\nThere is also DBMS/Copy, which is by DataFlux (now a SAS subsidiary).\nMore information is here:\n\nhttp://www.dataflux.com/Technology/Products/DBMS/\n\nHTH,\n\nMarc Schwartz\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}