{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Gregory Nowak <greg@romuald.net.eu.org>", "subject": "Re: Cursor parking?", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nHi, and welcome to the list.\n\nWhat cursor park does is ... well ... parks the speakup review cursor. Here's how it\nworks. Say for example you're reading a document in tty1, and making\nnotes on it in an editor in tty2. You might have noticed that whenever\nyou're reviewing the screen using the speakup review keys in a\nconsole, you lose your position whenever you switch to another\nconsole, and then switch back to the first console. So, going back to\nour example of reading something in tty1, and making notes in tty2,\nsay you came to something in your document that you want to make notes\non. Before switching to tty2, press the park cursor key, which is the\ndash key on the numpad, remembering to have your numlock off of\ncourse. Speakup will say \"parked.\" Then, switch to tty2, write down\nyour notes, and switch back to tty1. You'll find that the speakup\nreview cursor is exactly where you left it before you switched to\ntty2. Do note however that if you silence speakup with numpad enter,\nthe review cursor will move to the bottom of the screen, even if the\ncursor is parked. Also, remember to unpark the cursor once you've\nfinished reading your document, or you'll find that tty1 will behave\nvery strangely. Also, cursor parking works per console. What I mean is\nthat if you park your cursor in tty1, it will be unparked in\ntty2. Hth.\n\nGreg\n\n\n\nOn Thu, May 24, 2007 at 05:36:03PM +0200, Hermann wrote:\n> Hi all,\n> I'm new to this list. My name is Hermann, and I live in Germany. I use \n> Linux for four years, almost all the time text Linux, with a 6 months \n> interlude with Gnome and Orca.\n> Today I set up Speakup on my Ubuntu Feisty and explored it by reading teh \n> users guide. I'm impressed of the program, but there's one thing I couldn't \n> figure out, cursor parking.\n> Maybe I missed it in the guide, but what does \"parking\" do and in which \n> cases is it useful?\n> Thanks for your patience with a beginner.\n> Regards\n> Hermann\n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n- -- \nweb site: http://www.romuald.net.eu.org\ngpg public key: http://www.romuald.net.eu.org/pubkey.asc\nskype: gregn1\n(authorization required, add me to your contacts list first)\n\n- --\nFree domains: http://www.eu.org/ or mail dns-manager@EU.org\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGVdf67s9z/XlyUyARAm9uAJ9WNTUOSlLm8dZTKZG4w1sSFPuGOQCgnv/8\n+nqyke6oOQJl9uGbewxAF88=\n=RVzj\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}