{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Is our planet heating up for good? Wait till you hear NASA's report tonight on the CBS EVENING NEWS WITH KATIE COURIC", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n \n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening \n            News | 48 Hours | 60 Minutes | The Saturday Early \n            Show | CBS Sunday \n            Morning | Face The \n            Nation\n\n\n\n\n\n\n\n(CBS) QUOTE OF THE \n      DAY “You don't stop laughing because you grow old. You \n      grow old because you stop laughing.” - Michael Pritchard \n\n\n\n\nTODAY’S TRIVIA A Sphygmomanometer measures blood \n      pressure. \n\n\n\nTONIGHT ON THE CBS \n      EVENING NEWS Here's an early look \n      at what we are working on for tonight's broadcast of the CBS EVENING NEWS \n      from Anchor and Managing Editor, Katie Couric Hi everyone, \n      If there isn’t significant improvement on the ground in Iraq, the \n      president won’t be able to hold onto some of his key Republican support in \n      Congress. That’s the message moderate Republicans had for President Bush \n      after they pulled him into a private meeting for what has been called a \n      “very frank” discussion earlier this week. Our chief White House \n      correspondent, Jim Axelrod, will provide details about that \n      meeting. Sharyl Attkisson will report from Capitol Hill on how \n      Congress and President Bush may now be working toward a compromise on the \n      crucial issue of setting benchmarks for progress in Iraq. The \n      maker of OxyContin and three of its current and former executives pleaded \n      guilty today to misleading the public about how addictive the powerful \n      drug can be. A U.S. Attorney said the company unleashed an easily abused \n      drug on an “unsuspecting and unknowing public.” The company has agreed to \n      pay hundreds of millions of dollars. Correspondent Bob Orr will \n      have the story. Two forces of nature are clashing in the southeast \n      as massive wildfires continue to torch the Florida-Georgia border. Not far \n      away, the first named storm of the year has brought a sprinkling of rain \n      to help firefighters there, but tinderbox conditions elsewhere in the \n      country are contributing to new fires. Kelly Cobiella will report. \n      It might be heating up all along the East Coast – for good – if a \n      new NASA report is right. Randall Pinkston will share the \n      disturbing report about just how hot our planet could get before the turn \n      of the century. Elizabeth Palmer will report from London on \n      the news today that one of America’s best friends, British Prime Minister \n      Tony Blair, is stepping down. We’ll look back at his decade in office. \n      To cap our broadcast, Kelly Wallace will have an Eye \n      on the American Family report. She’ll take a \n      look at the phenomenon called “opting out.” It’s the idea that \n      high-powered career moms are deciding to stay at home with their kids \n      rather than work full-time. But now some experts are saying when women \n      stop working, it may not be voluntary. Thanks! Katie\nFor more on two of the stories noted above, please click on the \n      following links: Bush Seeks Deal With Democrats On Iraq\nClick Here OxyContin's Deception \n      Costs Firm $634M Click Here Here's an early look \n      at one of the stories we are working on for Friday's broadcast of the CBS \n      EVENING NEWS On this week's Assignment America. The senior senior. \n      She's the oldest graduating senior in her CLASS .. maybe even in HISTORY. \n      An inspirational reminder that .. It's NEVER too late...plus a lot more, \n      that's Friday night on the CBS Evening News. If you would like \n      more information on any of these stories or the broadcast, please click on \n      the following address and e-mail us: evening@cbsnews.com \n      \n\n\n\nTONIGHT ON DAVID LETTERMAN Join Dave tonight on \n      The Late Show with self-help guru Dr. \n      Phil AND animal expert Jack Hanna! \n\n\n\nFRIDAY MORNING ON THE EARLY SHOW Harry Smith, \n      Hannah Storm, Julie Chen and Chris Wragge, of our New \n      York affiliate, WCBS, anchor THE EARLY SHOW from New York. Dave Price will bring us the weather. \n      Russ Mitchell will join us live from Jamestown, VA. \n      Along with the top news of the day, we will also have the \n      following stories: 48 HOURS MYSTERY: Catherine Woods \n      was found stabbed to death in November 2005. A talented and ambitious \n      young woman, Catherine moved to New York hoping to sing and dance on \n      Broadway. But her dreams were cut short by a brutal attack that left those \n      in her hometown of Columbus, Ohio shocked. GARDENING: MOTHER’S \n      DAY PLANTS: Looking for a last-minute Mother's Day gift? Steve Orr, \n      contributing Garden editor to Domino magazine, says that plants are \n      the way to go. They last much longer than cut flowers, and look beautiful \n      with very little effort. And, here are plants that can be ordered online \n      and still arrive to Mom on time! Friday morning, Steve Orr will join us \n      with ideas for dressing up inexpensive plants so they look like a million \n      bucks. CSI WEEK: CSI: You can usually expect CSI’s \n      storylines to give you goosebumps or its realistic-looking crime scenes to \n      make your skin crawl. But Thursday night's episode may leave you with \n      something new... a lump in your throat. As our own Julie Chen found \n      out when she visited the set, it was all because of star and executive \n      producer, William Petersen. JANE FONDA ON GEORGIA RULE: \n      After a fifteen year absence from the silver screen, two time Academy \n      Award winner Jane Fonda was welcomed back with open arm in 2005 with the \n      hit comedy Monster-In-Law. Now her many fans are in luck, as they \n      just had to wait two years for her followup, Georgia Rule, which \n      hits theaters Friday. We’ll speak with Fonda about her new film. \n      WITHOUT A TRACE: Analyce Guerra was last seen at \n      approximately on April 23, 2006, at her home in Smyrna, Tennessee. What \n      happened to little Analyce? Friday morning, we’ll take a look at the story \n      behind her bizarre disappearance. JAMESTOWN COMMEMORATION: \n      America is marking its 400th anniversary this weekend. It was in 1607 that \n      104 men and boys landed in Jamestown, Virginia to found America's first \n      permanent English settlement. Our own Russ Mitchell will join us live from \n      Jamestown where he will be speaking with author and historian James Horn. \n      SURVIVOR CASTOFF: SURVIVOR CASTOFF: Stranded in Fiji, the \n      competition heats up for the remaining survivors battling it out for the \n      million-dollar prize. Alex makes a last minute attempt at a power play to \n      split the alliance of six. Is he successful? Who will be voted off the \n      island? Friday morning, we'll have a recap of the new episode and as \n      always, talk to the next castoff about what really went wrong. \n      HENRY WINKLER: The man who epitomized cool as “The Fonz” on \n      Happy Days, has certainly come a long way from his leather jacket \n      and jukebox days. Now an author of a children’s book series, Winkler \n      writes in the voice of his fourth-grade alter ego, Hank Zipzer, who is \n      smart but battling dyslexia. Winkler himself found out about his own \n      learning disabilities as an adult. The newest book is The Curtain Went \n      Up, My Pants Fell Down, in which protagonist Hank tries out for a \n      school play despite the challenge of memorizing lines. It is an \n      inspirational tale – one with lessons of hope and triumph. Friday morning, \n      Henry Winkler will join us with more on his turn as an inspiration to \n      children everywhere. If you would like more information on any of \n      these stories or the broadcast, please click on the following address and \n      e-mail us: earlyshow@cbs.com \n\n\n\nSATURDAY ON 48 HOURS \n      MYSTERY, 9PM/8C Here's a preview of Saturday's 48 \n      Hours Mystery, DEATH OF A DREAM from \n      Correspondent, Erin Moriarty: \"I have never quite believed \n      the theory that \"anyone\" is capable of committing murder. With most \n      killers, you usually detect a problem in their childhood or a personality \n      defect that causes that person to choose to take the ultimate action \n      against another human being. But what would lead a young man with no \n      history of violence to do something so out of character? It is just one of \n      the mysteries that surrounds the murder of 21-year-old Catherine Woods. \n      First, some background: Catherine Woods was a stunning and \n      talented young woman, from my hometown of Columbus, Ohio, who moved to New \n      York with hopes of becoming a dancer and singer on Broadway. As the \n      daughter of the well-known director of the Ohio State University Marching \n      Band, Catherine was used to the spotlight and dreamed of her own name in \n      lights along the Great White Way. But, three years later, on November \n      27th, 2005, she was found stabbed to death in her apartment. Initially, \n      police focused on two suspects, neither of which fits the profile of a \n      killer. They are both young, aspiring musicians with no criminal records. \n      Catherine's murder was exceptionally brutal which makes it all the more \n      difficult to believe that either man could have done it and yet, one was \n      arrested, charged and tried for her murder. In this week's program \n      Death of a Dream, we investigate the evidence and follow the trial \n      that ends with a dramatic and surprising verdict. It is a case that will \n      remind you, as so many of our cases do, how a single, senseless act in a \n      moment of passion, can have drastic consequences for so many.\" - \n      Erin Moriarty (48 Hours Mystery airs Saturday at \n      10pmET/9CT) If you would like more information on any of these \n      stories or the broadcast, please click on the following address and e-mail \n      us at: 48hours@cbsnews.com \n\n\n\nSUNDAY ON 60 \n      MINUTES, 7:00PM/6:00PM CT \nMITT ROMNEY – The Republican presidential candidate talks to \n      Mike Wallace about campaign issues including the war in Iraq, his \n      Mormon religion and his changing positions on abortion. 6% \n      - Realtors’ sacrosanct commission rate of 6 percent may be in jeopardy \n      due to emerging online competition from Internet real estate sellers and \n      buyers. Lesley Stahl reports. ALI-- Bob Simon \n      catches up with Iraqi war orphan Ali Abbas, who lost most of his family \n      and his arms to a stray American bomb during the war in Iraq. \n\n\n\n\n\n\n\nTO SUBSCRIBEClick here to subscribe to \n      the Inside Scoop.TO UNSUBSCRIBEUnsubscribe information \n      is included in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, \n      click here.Contact: Email Administrator, \n      CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n      10019Help | Advertise | Terms of \n      Service | Privacy \n      Statement©MMVII, CBS \n      Interactive Inc. All Rights Reserved. \n\n"}