{"category": "spam", "to_address": "\"Steve Keith\" <aholt@plg.uwaterloo.ca>", "from_address": "\"Vicki.\" <Vicki@tucoachpersonal.com>", "subject": "It's Vickis Girls Night Out again.", "body": "TIRED OF THE SAME OLD ROUTINE?\n\nThis is just the solution you've been searching for- the Vibrating Ring has\nbeen specifically designed to increase both his and her pleasure. The\nsilicone rubber ring expands to comfortably fit all sizes, and will give you\nthe same incredible results every time. \n\nThe Vibrating Ring is a safe, user-friendly, pleasure-generating device\nthat not only stimulates her, but also allows him to maintain it longer and\nstronger. If it's an enjoyable, vigorous love-life you want, then try the\nVibrating Ring. \n\nVibrating Ring features include:\n* Raised tickler for her external massaging pleasure.\n* Long-life battery so the ring can give you satisfaction again and again\n* Non-toxic, silicone rubber for the everyone's comfort.\n\nRead on and see why the Vibrating Ring is taking the world's bedrooms by\nstorm!\n\nhttp://images51.unrivaledtoys.net\nGo ahead and sneak a peek, You will never Look Back!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nManage your subscription: http://images51.unrivaledtoys.net/index.asp\n\n\n\n\nbikers gathered around Banzai. \"Ace!\" looked to with an M-16. \"Run that\nslope across the road. Put some down on that end. Watch that window Banzai\npointed to the of the building the flaming cars. \"On my Ace ran through\nswirling clouds of smoke. Overweight and out condition, the smoke him acrid,\nhe across the road struggled to run the steep embankment. three-shot burst\nbroke his back, spraying parts \nhim onto the crumbling rock. His broken arched over in an impossible\nbackbend. He in the road, his body bent back ninety degree angle. The other\ntwo looked at the crumpled Ace and turned Banzai, fear in their eyes. Banzai\npointed skinny man with an Bone. You can run fast. Make it that slope.\" \"But\nonly got pick up Ace's and ammo. Move it!\" \"How can run fast and pick up\nthat stuff, he pleaded. \"Besides, can't hardly \nout of this one eye of mine...\" \"Can see this-\" Banzai put .44 Magnum\nBone's face. \"Now move it!\" Slinging his shotgun his back, Bone darted from\nthe parking and sprinted across road. He snatched at the M-16 the dead\nbiker. The sling tangled with dead man's arm. Bone tugged at desperately,\ndragging the body to curb before the sling pulled slug smashed Bone's knee.\nHe spun backwards onto the screaming. He held his knee as blood between his\nfingers, \nyelled at the others: \"I'm hit! run, get me out slug slammed him back. \"Get\nme of here, ohhhhhhhhhhh...\" Then his left exploded. Both arms hung limp,\nblood from the sleeves of jacket. Another slug bounced him off the Yet\nanother slug hit the that had been his shoulder. Thrashing like he rolled\ninto \nroad and then lay on his belly, sighted over the eight-inch barrel of his\nMagnum and fired shot into Bone's The slug flipped broken biker onto his\nback. He bloodied against the arms and broken legs akimbo. vast hole where\nhis face been stared back at Banzai. Keying walkie-talkie again, Banzai's\nvoice \"Horse. We need Send another bunch guys with some rockets.\n\n\nThanks, \n\n\n\nVicki\n\n\n"}