{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nTuesday, 05 June, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nAston Villa bid £7m for Reo-Coker\nAston Villa launch a £7m bid for West Ham captain Nigel Reo-Coker.\n\n\n\n \nBarton has medical at Newcastle\nJoey Barton undergoes a medical at Newcastle as they - and West Ham - agree £5.5m deals for the Man City star.\n\n\n\n \nViduka set for Newcastle transfer\nNewcastle agree in principle to sign Middlesbrough striker Mark Viduka.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nTiger prepares to take baby break\nTiger Woods says his schedule for the rest of 2007 is up in the air as he awaits the arrival of his first child.\n\n\n\n \nWelsh amateur wins US Open spot\nRhys Davies  books his place in next week's US Open with a brilliant win in a qualifying tournament.\n\n\n\n \nRyder pair fail in US qualifying\nRyder Cup stars Darren Clarke and Paul McGinley will miss the US Open next week after failing to qualify at Walton Heath.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nMassa predicts Ferrari fightback\nFerrari will bounce back from a poor Monaco Grand Prix to contest victory in Canada, says driver Felipe Massa.\n\n\n\n \nAnstey celebrates Superstock win\nNew Zealander Bruce Anstey sets a lap record on his way to winning the Superstock race at the Isle of Man TT.\n\n\n\n \nMcGuinness triumphs in TT opener\nHonda rider John McGuinness claims his fourth straight Superbike victory at the Isle of Man TT on Monday.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nMassa predicts Ferrari fightback\nFerrari will bounce back from a poor Monaco Grand Prix to contest victory in Canada, says driver Felipe Massa.\n\n\n\n \nValencia secures F1 street race\nValencia signs its contract to  host a Grand Prix around the Spanish city's streets from 2008.\n\n\n\n \nMcLaren cleared over Hamilton row\nMcLaren are cleared of any wrongdoing after an investigation into whether they illegally used team orders in the Monaco Grand Prix.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nPickering wins battle of Britain\nCraig Pickering wins the battle of the Brits as he storms home in the all-British 100m at the Glasgow Grand Prix.\n\n\n\n \nWeir leads strong British display\nDave Weir wins four races at the Swiss Open event in Ibach.\n\n\n\n \nGay misses out on sprint record\nTyson Gay wins the 100m in New York but is denied a world record as his run was wind-assisted.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nEx-team boss denies drug claims\nFormer Telekom team manager Walter Godefroot denies being involved in the doping of riders during the 1990s.\n\n\n\n \nZabel to stay away from Olympics\nGerman cyclist Erik Zabel will not compete in next year's Beijing Olympics after his confession that he used performance-enhancing drugs in 1996.\n\n\n\n \nDi Luca seals home Giro victory\nDanilo di Luca ensures a home victory in the Giro d'Italia for the 11th year running as he cruises home in Milan.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nQuotes of the Week\nGraham Poll on his yellow peril, plus Frankie Dettori and the legendary Sid Waddell\n\n\n\n \nComment: Time to rest Lampard\nRobbo believes Frank Lampard should be dropped by England\n\n\n\n \nReview of the week\nKieran Richardson's cousin on Big Brother as Ronaldo's mum spits feathers\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}