{"category": "spam", "to_address": "myrtless@flax24.uwaterloo.ca", "from_address": "Groupe Desjardins / AccesD <services.de.cartes@scd.desjardins.com>", "subject": "Avis Important et Personnel", "body": "\n\n\n\nDesjardins - Sécurité\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n Cher(e) membre \n                Desjardins/ AccèsD,\n\nChez\n\t\tDesjardins  , notre mission \n\t\test de vous offrir jour après jours, un service de qualité \n\t\texceptionnelle et d'assurer votre sécurité. Nous équipe du Département \n\t\tde confiance et de sécurité veille à chaque heure du jour a maintenir la \n\t\tfiabilité de notre réseau de sorte que chacun de nos membres autant les \n\t\tparticuliers que notre clientèle Affaires puissent effectuer leurs \n\t\ttransactions bancaires en toute sécurité.\nLors d'une récente mise-à-niveau de sécurité,  \n\t\tselon les informations recueillies, nos dossiers indiquent que vous avez \n\t\tatteint la limite règlementaire permise concernant l'authentification de \n\t\tvotre compte AccèsD , des \n\t\tSolutions en ligne de Desjardins. Conformément aux normes de \n\t\tsécurité de l'entreprise, le but de cet avis est pour vous indiquer \n\t\tqu'afin de pourvoir maintenir votre compte \n\t\tAccèsD actif et de pouvoir continuer à effectuer vos \n\t\topérations, il est impératif de vous authentifier a celui-ci avant la \n\t\tdate limite vous étant indiquée pus bas, le cas échéant nous devrons \n\t\tdésactiver votre compte pour une période indéterminée pour votre \n\t\tsécurité.\nLa date limite pour vous authentifier est: \n\t\tVendredi, le 27 Avril 2007.\nSans plus tarder veuillez cliquer sur le lien \n\t\thypertexte ci bas afin de vous rendre en toute sécurité sur notre page \n\t\tsécurisée afin de vous authentifier en prévenant ainsi toute situation \n\t\tinconfortable.\nhttps://accesd.desjardins.com/ \n\nNous vous remercions d'avoir pris ces quelques \n\t\tminutes de participer à cette importante mesure de sécurité. Vous \n\t\tcontribuez à ce que le service AccèsD \n\t\tdes Solutions en ligne de Desjardins demeure un endroit sûr ou \n\t\tvous pouvez gérer vos économies ou les finances de votre entreprise dans \n\t\tle confort de votre foyer. De toute l'équipe de \nDesjardins: Merci de nous faire confiance car \n\t\tvotre sécurité est notre priorité.\nDépartement de Confiance et de sécurité \n\t\tMouvement des caisses Desjardins.\n\nDesjardins / AccèsD\n\n \n\nSvp ne répondez pas à ce courriel car c'est seulement un avis. Le \n\t\tcourrier envoyé à cette adresse ne peut pas être répondu. \n              \n\n\n\n\nCopyright © 2007 Mouvement des caisses Desjardins. Tous droits \n                      réservés.\n\n \n\n\n\n \n\n\n\n\n\n"}