{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Gregory Nowak <greg@romuald.net.eu.org>", "subject": "Re: GRML swspeak?", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nI'm guessing this could be a combination of the emulated sound\nhardware in vmware, and of festival itself. If you boot the cd on your\nphysical box, do you still have this issue? Can you understand what is\nbeing said?\n\nGreg\n\n\nOn Sun, May 27, 2007 at 07:41:04PM -0600, Jeremy wrote:\n> Hope this still goes with this subject. I tried running the newest \n> grml earlier today, 1.0 in vmware and had a very odd thing happen. I \n> did get speach, but, it was studdering really bad and had lowd pops \n> at the start of every word so I could bearly understand anything it \n> was saying. This happend two times, when I typed grml swspeak at the \n> boot prompt, it took about 10 seconds, and I got some speach, but, I \n> could not understand anything it said, and, then, after it finished \n> booting, I typed swspeak as it says to do in the cheat codes for grml \n> and I once again had speach. I could not understand this either. As I \n> said, it has some very lowd hissing pops that almost completely cover \n> the speach, so, very hard to understand anything. I also noticed that \n> in the cheat code notes, it said something about a vmware code that I \n> could use at the prompt, but, I did not understand how to use it. I \n> have not had any problems getting any other distro to boot with \n> speach, such as ubuntu using orca, orilux, debian using speakup and \n> my doubletalk lt, etc. So, maybe I am just doing something wrong, or, \n> it's something with grml itself? If someone can give me some idea of \n> what to do to fix it, or, point me to something to read, I would be greatful.\n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n- -- \nweb site: http://www.romuald.net.eu.org\ngpg public key: http://www.romuald.net.eu.org/pubkey.asc\nskype: gregn1\n(authorization required, add me to your contacts list first)\n\n- --\nFree domains: http://www.eu.org/ or mail dns-manager@EU.org\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGWjhw7s9z/XlyUyARApiNAJ0X83UpVAFEYv3ylhJm+ytXncY3+ACfRmf0\nVrt6YjCxTAmHnRCGR4qaVoE=\n=3mlS\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}