{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@speedy.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "SatCon Provides ''Green'' Power to the Greater Boston Area", "body": "\n\n\n\n\n\n\n\n\nSatCon Provides ''Green'' Power to the Greater Boston Area\nLargest Solar Energy System Installation in New England \nBOSTON, Apr 24, 2007 (BUSINESS WIRE) --  SatCon Technology Corporation(R) (Nasdaq CM: SATC), a developer of power management and system architecture solutions for the alternative energy and distributed power markets, reports that its power conditioning units for a 425 kW photovoltaic solar energy system located on an environmentally remediated brownfield (brightfield) have been providing highly efficient \"green\" power at a Brockton, Massachusetts site since its dedication on October 26, 2006. This site is also the largest brightfield in the nation. This solar energy system generates an estimated 535 megawatt hours (MWh) of electricity annually, enough energy to power approximately 71 homes. The city of Brockton intends to build upon its solar leadership by expanding the solar energy power plant to an associated brownfield. Eventually the city plans to increase the Brockton Brightfield's capacity to 1 megawatt (MW). Congressman Stephen F. Lynch (D-MA), who helped to secure nearly $800,000 for the Brockton Brightfield and attended its dedication, said, \"With the opening of the Brightfield, the City of Brockton has now positioned itself as a nationwide leader in developing and promoting alternative energy sources. That success was largely due to the hard work and ingenuity of the people at SatCon, who developed technology that was critical to this project. At a time of instability in the worldwide oil markets and rising gas and oil prices, that's a mission all American cities and companies should be focused on.\" Landerholm Electric, the Brockton-based electrical contractor that installed the system as a sub-contractor to Global Solar stated, \"We are very pleased with the performance of the SatCon 225 kW inverters installed at this site. The units were easy to install and have performed reliably and to our expectations. It is also always good to work with local Massachusetts-based firms and we appreciate the support SatCon has provided to the project,\" said Daniel Smith of Landerholm Electric. About SatCon Technology Corporation SatCon Technology Corporation is a developer and manufacturer of electronics and motors for the Renewable Energy, Hybrid-Electric Vehicle, Grid Support, High Reliability Electronics and Advanced Power Technology markets. For further information, please visit the SatCon website at www.satcon.com. SATC-G Statements made in this document that are not historical facts or which apply prospectively are forward-looking statements that involve risks and uncertainties. These forward-looking statements are identified by the use of terms and phrases such as \"will,\" \"intends,\" \"believes,\" \"expects,\" \"plans,\" \"anticipates\" and similar expressions. Investors should not rely on forward looking statements because they are subject to a variety of risks and uncertainties and other factors that could cause actual results to differ materially from the Company's expectation. Additional information concerning risk factors is contained from time to time in the Company's SEC filings. The Company expressly disclaims any obligation to update the information contained in this release. SOURCE: SatCon Technology Corporation SatCon Technology Corporation(R)\nDan Gladkowski, 617-897-2411\nVP, Administration\n\n\n\n\n\n\n\n\n\n\n You are subscribed to SatCon Technology Corporation Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n SatCon Technology Corporation \n 27 Drydock Ave. 6th Floor, South Boston, MA 02127\n Service provided by Shareholder.com \n\n\n\n\n\n"}