{"category": "ham", "to_address": "Paul Johnson <pauljohn32@gmail.com>", "from_address": "Frank E Harrell Jr <f.harrell@vanderbilt.edu>", "subject": "Re: [R] Follow-up about ordinal logit with mixtures: how\n about\t'continuation ratio' strategy?", "body": "Paul Johnson wrote:\n> On 5/10/07, Frank E Harrell Jr  wrote:\n>> Paul Johnson wrote:\n>>> This is a follow up to the message I posted 3 days ago about how to\n>>> estimate mixed ordinal logit models.  I hope you don't mind that I am\n>>> just pasting in the code and comments from an R file for your\n>>> feedback.  Actual estimates are at the end of the post.\n>> . . .\n>>\n>> Paul,\n>>\n>> lrm does not give an incorrect sign on the intercepts.  Just look at how\n>> it states the model in terms of Prob(Y>=j) so that its coefficients are\n>> consistent with the way people state binary models.\n>>\n>> I'm not clear on your generation of simulated data.  I specify the\n>> population logit, anti-logit that, and generate binary responses with\n>> those probabilities.  I don't use rlogis.\n> \n> Thank you.\n> \n> I don't think I'm telling you anything you don't already know, but for\n> the record, here goes.  I think the difference in signs is just\n> convention within fields.  In choice models (the econometric\n> tradition), we usually write that the response is in a higher category\n> if\n> \n> eta + random > cutpoint\n> \n> and that's how I created the data--rlogis supplies the random noise.  Then\n\nJust want to make sure that samples it generates are from the correct \nprobability model.  I'm just used to doing this with ifelse(runif(n) <- \nplogis(population.logit)) for the binary case.\n\n> \n> eta - cutpoint > random\n> \n> or\n> \n> cutpoint - eta < random\n> \n> and so\n> \n> Prob ( higher outcome ) = Prob ( random > cutpoint - eta)\n> \n> In the docs on polr from MASS, V&R say they have the logit equal to\n> \n> cutpoint - eta\n> \n> so their parameterization is consistent with mine.  On the other hand,\n> your approach is to say the response is in a higher category if\n> \n>  intercept + eta > random,\n> \n> where I think your intercept is -cutpoint. So the signs in your\n> results are reversed.\n> \n> -cutpoint + eta > random\n> \n> \n> But this is aside from the major question I am asking.  Do we think\n> that the augmented data frame approach described in Cole, Allison, and\n> Ananth is a good alternative to maximum likelihood estimation of\n> ordinal logit models, whether they are interpreted as proportional\n> odds, continuation, or stopping models?   In the cases I've tested,\n> the parameter estimates from the augmented data frame are consistent\n> with polr or lrm, but the standard errors and other diagnostic\n> informations are quite different.\n\nThen I wouldn't use the augmented data approach.\n\n> \n> I do not think I can follow your suggestion to use penalties in lrm\n> because I have to allow for the possibilities that there are random\n> effects across clusters of observations, possibly including random\n> slope effects, but certainly including random intercepts for 2 levels\n> of groupings (in the HLM sense of these things).\n\nMy suggestion doesn't handle random slopes but does handle random \nintercepts in a sense.\n\nGood luck\nFrank\n\n> \n> Meanwhile, I'm studying how to use optim and numeric integration to\n> see if the results are comparable.\n> \n> pj\n> \n>> See if using the PO model with lrm with penalization on the factor does\n>> what you need.\n>>\n>> lrm is not set up to omit an intercept with the -1 notation.\n>>\n>> My book goes into details about the continuation ratio model.\n>>\n>> Frank Harrell\n>>\n> \n> \n> \n> \n> \n\n\n-- \nFrank E Harrell Jr   Professor and Chair           School of Medicine\n                      Department of Biostatistics   Vanderbilt University\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}