{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "North Korea to shut plutonium reactor in 3 weeks", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJun 23, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nNorth Korea to shut plutonium reactor in 3 weeks\n\n\n\n\n\nPyongyang and Washington have agreed on a three-week timeframe for shutting\ndown the North's plutonium-producing reactor, a top U.S. nuclear envoy said\nSaturday after returning from a rare visit to the reclusive state.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDisbarred Duke D.A. faces contempt hearing \n\n\n\n\n\nThree former Duke University lacrosse players are seeking criminal contempt of\ncourt charges against Mike Nifong, the disbarred prosecutor who pursued a\nflawed rape case against them.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nStorms to hit Midwest; Southwest scorching\n\n\n\n\n\nForecasters predicted severe thunderstorms in the Midwest and rain in New\nEngland on Friday, and temperatures would likely soar in the Southeast and\nSouthwest.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nLeaders, comrades pay tribute to killed firefighters\n\n\n\n\n\nNine caskets lined the front of a coliseum Friday as thousands of firefighters\nfrom across the nation, their hats in their hands, honored nine colleagues\nkilled in a furniture store blaze.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFormer first lady Lady Bird Johnson hospitalized\n\n\n\n\n\nFormer first lady Lady Bird Johnson has been hospitalized and is undergoing\nmedical tests, but is awake and receiving visits from family members and\nfriends, a family spokesman said Friday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOhio sheriff: Found baby is not missing woman's\n\n\n\n\n\nA baby girl found on an Ohio doorstep does not belong to a missing pregnant\nwoman, the Wayne County Sheriff's Department said Friday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReport: Parks shut down drop-tower rides after teen loses feet\n\n\n\n\n\nA teen who lost her feet in an accident at a Kentucky amusement park has\nundergone surgery, a park spokeswoman said Friday, while two park operators\nclosed similar rides around the country.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nHostages seized in 'brothel' raid\n\n\n\n\n\nStudents from a radical mosque on Saturday raided an acupuncture clinic they\nsaid was used as a brothel in Pakistan's capital and kidnapped nine people,\nincluding Chinese women, police said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNATO strike 'kills 25 civilians'\n\n\n\n\n\nTaliban militants stormed police posts in southern Afghanistan, prompting\nheavy fighting and NATO air strikes that reportedly left 25 civilians and 20\nmilitants dead, police said Friday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMugabe faces pressure on currency\n\n\n\n\n\nZimbabwe's currency plunged to new depths on Friday as the U.S. ambassador to\nHarare predicted galloping inflation will force President Robert Mugabe from\noffice before the end of the year.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHamas denies it plans to kill Abbas\n\n\n\n\n\nHamas has denied Palestinian Authority President Mahmoud Abbas' accusation\nthat it is planning to assassinate him.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nSummer vacation for the Fed\n\n\n\n\n\nThe Federal Reserve would seem to be an unlikely beneficiary of this whole\nuser-generated content phenomenon.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNFL's ugly body blows\n\n\n\n\n\nThe National Football League is generally a flawless marketing powerhouse. But\na bunch of broken-down, retired players are in the process of handing the NFL\nits biggest public relations loss in years.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nJohn Donovan: Pedroia silences critics after sluggish start\n\n\n\n\n\nA month into the first full season of his big-league career, Dustin Pedroia\ncouldn't sleep. He would come home, or slog back to the team hotel, upset\nabout everything that was going wrong. He would read how the Red Sox needed to\nyank him from the lineup and put in the hot-hitting Alex Cora. The boos from\nthe fans at Fenway Park rang in his ears.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Bonus: Yi Jianlian follows Yao as the latest Chinese import in the NBA\n\n\n\n\n\nIt is a warm and sunny June afternoon in Los Angeles when Yi Jianlian shows up\nfor a workout. There is little fanfare accompanying the arrival of China's\nlatest U.S. export, just a dutiful manager trailing him through the double\ndoors of L.A.'s Home Depot Center and a trainer patiently waiting for him on\nthe other side. Ever since China first approved Yi's entrance into the NBA\ndraft last November, people have wondered if Yi is the next Yao Ming. \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nThe best new pain cures, with a focus on women\n\n\n\n\n\nYou've got achy shoulders from carrying the kids, the groceries, or your\nincredibly heavy handbag. You look for the right pill to pop, but what should\nyou take? Aspirin? Ibuprofen? Or, you're about to get your period. You know\nyou'll get killer cramps or that nasty headache any minute now, but nothing\nyou take seems to help once the pain hits.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nQuirky discipline rules that work \n\n\n\n\n\nI've made a lot of bad rules in the decade I've been a mom, from irrational\nthreats (\"No graham crackers in the house ever again if you eat them in the\nliving room even one more time\") to forbidding human nature (\"You may not\nfight with your sister\"). But occasionally I've come up with rules that work\nbetter than I'd ever contemplated. These made-up rules have an internal logic\nthat defies easy categorization, but their clarity and enforceability make\nthem work. Several of them are not, technically, rules at all, but\ndeclarations of policy or fact. And they're all easy to remember. A few\npersonal favorites, plus those of other moms:\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nGoogle wants U.S. help fighting censorship\n\n\n\n\n\nOnce relatively indifferent to government affairs, Google Inc. is seeking help\ninside the Beltway to fight the rise of Web censorship worldwide.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRobots to search unexplored Arctic for new life \n\n\n\n\n\nResearchers hope newly developed robots will give them their first look at a\nmysterious ridge located between Greenland and Siberia. \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nReview: 'A Mighty Heart' showcases an understated Jolie\n\n\n\n\n\nDaniel Pearl flew in to Islamabad, Pakistan, on September 12, 2001. As the\nSouth Asia bureau chief for The Wall Street Journal, he would spend the next\nfour months reporting on  Afghanistan and Operation Enduring Freedom. \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHilton: 'I'm so much more grateful' \n\n\n\n\n\nJailed heiress Paris Hilton says she suffers from claustrophobia -- a fear of\nconfinement in small places -- but that her time behind bars has renewed her\nappreciation for life's simple pleasures.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}