{"category": "spam", "to_address": null, "from_address": "awatif alkalmil <awatif_alkalmil@hotmail.com>", "subject": "Allah bless you MRS Awatif Al-kamil", "body": "\n\n\n\n\n \nIs Me Mrs Awatif Al-kamil woman bassed in bagdad in iraq,I felt good and was happy to meet such An Honest one and i so much trust your Country and there Poeple soit is with that i wish to contact you  for a little assistance you can render to me.Due to the situation here in in iraq,those of us in the business circle are finding it very difficult to cope with the situation here,no stable goverment,bomb explotion at strategic places every now and then,sometimes people find it very difficult to go about their normal businesses due to fear of being victim of terrorist attack,above all.  the crisis in iraq now has made business activities totaly parallised for quite sometime now.for intance,no good telephone facilities,noadiquate security,infact,all most all the basic infrastructure were destroyed during the recent war in iraq,ever since then .he enveroment in iraq has never been condusive business wise.Please,why i need your  assistance is that i have about (us$ 10.000.000)TEN million united states Dollars in my custody. i inherited  the money from late my husband who was a major general in iraqi army in charge of purchase and  maintainance in the immediate past regime.My intention is to move the money out of iraq and invest the money in stock market or real estate in your country with the help of an honest person who will work with me asmy foreign associate, i want to invest most of the money abroad to avoid lossing the money, because it is not wise doing business in the atmosphere of fear here in iraq,that's why i am calling on you.If you can honestly collaborate with me ,i am ready to pay you up to 20% of the total amount if you can sincerely assist me to actualise this project soon,because the situation here in iraq is very critical,the everyday bomb explotion seems to have no end.I wait patiently for your urgent response.i am just trusting on you in the name of Almighty ALAH and i know you will not sit on my money and deny me, am a Devouted mosleem woman(sheer( and i respect ALLAH so pls do not dissapoint me because i have made up my mind to esterblish the US$10m dollars in your country of which i would want you to be my business partner.  i told my Diplomat that you  are my business partner and we have fiduciary relationship.     i hope you understood me clearly. inshy allah. waiting patiently for your Anticipated favourable reply.Byee\nAllah bless youMRS Awatif Al-kamilcentral Baghdad city,kara iraq.\n Change is good. See what's different about Windows Live Hotmail. Check it out!\n"}