{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "\"Muthiah Annamalai\" <muthuspost@gmail.com>", "subject": "Re: [cc-community] Creative-Commons Copyright for Thesis (Andrew\n\tRens)", "body": "Message: 4Date: Fri, 8 Jun 2007 02:31:39 -0700 (PDT)From: Andrew Rens <\nandrewrens@yahoo.com>Subject: Re: [cc-community] Creative-Commons Copyright for ThesisTo: \ncc-community@lists.ibiblio.org\nMessage-ID: <521038.25289.qm@web32805.mail.mud.yahoo.com>Content-Type: text/plain; charset=\"us-ascii\"\nHi MuthiahWhat is the the agreement with your institution? Do you cede the copyright to them, or do you simply archive with them, and then they license it out.\nIf you do not explicitly cede copyright to them then it does not matter what license they use because you can self archive elsewhere as Andres suggested IN ADDITION to archiving with them and then choose whatever license you like for this second archiving.\nIn other words it does not matter what license they use as long as you retain the right to the work in which case you can re-license the work in as many different ways as you desire.Thanks for the tip. But there is not\n I wouldn't recommend asking the archive whether you cede to them, but simply reading the agreement to see if it specifically says that you cede all rights to them, or simply what license they use.\nRegardsAndrew----- Original Message ----From: Andres Guadamuz <a.guadamuz@ed.ac.uk\n>To: \ncc-community@lists.ibiblio.orgSent: Friday, June 8, 2007 7:52:00 AMSubject: Re: [cc-community] Creative-Commons Copyright for ThesisIn my experience, archiving offices tend to be rather inflexible when it\ncomes to licensing.I have two questions:1. Do you have to archive with your institution? If this is arequirement for your graduation, then do whatever you need to do andforget about it, but choose the less restrictive option, and then\nself-archive somewhere online (SSRN or with other self-archiving method).I do have to archive with my institute through UMI.However I dont have to cede my copyright!!! Wow,do there exist any schools that want such licenses? Im apalled.\nAnyway, I would do as you guys suggested.Thanks,Muthiah\n"}