{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Peter Oliver <rkesler@grandcentralmall.com>", "subject": "Say \"YES\" to perfect sex!", "body": "\n\nTired with your sexual problems? Looking for an effective and cheap solution?\nOur shop\nWe have only high-quality national medications at low prices. There is no need for someone to know about your sexual problems. \nClick here to be the best lover in the world!\nEverything you need to cure yourself.\nWith best regards,\nPeter Oliver\n \n \nHriplyj vibriruiushchij vydoh Prochertil vozduh plamennoj struej, skolznuvshej po pravomu plechu i nepremenno by Opalivshej, esli by ia ne uklonilsia, mgnovenno smestiv korpus vpravo. Ego prerval gluhoj hlopok, harakternyj dlia teleportiruiushchegosia pryguna, i posredi ulicy, v dvadcati shagah vperedi nas, voznik vysokij chelovek v Temnom plashche do piat. On I ne dumal sdavatsia, on prosto smenil taktiku. Slovno otvechaia ego mysliam, chuzhezemec shevelnulsia, i chare podnial perednee Kopyto, iavno namerevaias povtorit signal pobudki dlia zaspavshihsia karaulshchikov. \nI krome Hishchnika mirozdaniia. Hotelos by znat, kto kogo priruchit bystree, esli dazhe ego prikosnoveniia daiut Tak mnogo. Leks izumlenno zastyl. Prosto posle vseh napastej, svalivshihsia na ego golovu, on byl ne v duhe. Po Vsemu poluchalos, chto Prorochestvo nezhdanno-negadanno samo zaiavilo prava na etogo Chuzhaka. Tolko na Sebia samogo. Vot esli by ia byl Masterom Mobra, pozvolil ia sebe Pomechtat, to nikakie pryguny ne vyzvali by u menia problem. 2. \nV konce koncov, u menia chto, malo sobstvennyh Problem, chtoby eshche lomat mozgi nad chuzhimi?. Nesmotria na gibel bolshinstva, my ne sdalis, na Koloniiah k tomu vremeni imelis samye peredovye tehnologii, zavezennye s Materinskoj planety pri osvoenii, vse samye poslednie dostizheniia nauki i Tehniki. Potomu chto nikakimi Izvestnymi silami, krome magicheskih, tak smiat viritovuiu stal nevozmozhno. Potom zaberu svoiu Devushku i otpravlius domoj. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}