{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Michael Whapples <mikster4@msn.com>", "subject": "Re: TeX", "body": "I would agree with the responses that LaTeX (or TeX which LaTeX is based\non) is good for producing documents, particularly if there are things\nlike mathematical equations. While it is good, the idea is to try and\nremove some of the formatting from the author so that they can\nconcentrate on the content, but this sometimes means that when you want\na specific formatting  you may need to wrestle with TeX to tell it what\nyou really want to have shown, and sometimes it can seem like TeX will\nnot give in. Examples may be things like positioning of images (TeX is\nmeant to try and pick the best place for it, you can specify you want it\nhere, top of page, bottom of page, in any order or combination), but if\nTeX really feels that it should go elsewhere on the page it will keep\ntrying and ignore your command, so you need to try and tweak the text\naround it or the image size until TeX gives in. I can think of other\nexamples where I have had to hunt around for a satisfactory solution for\nhow something should be presented when I have been using LaTeX.\n\nWhile that above seems unfavourable towards TeX, I don't mean it to be,\nI am really glad for TeX in some cases, but sometimes for simple short\ndocuments TeX is more than is really needed and you may end up spending\nlonger fighting TeX than it would have taken you with a WYSIWYG editor.\n\nThere are many different TeX systems and packages, offering all sorts of\nfeatures, different output formats, different TeX commands for certain\nstructures, etc. The other thing is that there is a huge amount of TeX\nopen source software, allowing you if you have the time to add the\nfeatures you want if they don't already exist.\n\nFrom\nMichael Whapples\nOn Wed, 2007-05-23 at 16:10 -0700, Zachary Kline wrote:\n> Hello,\n>     I have heard a great deal about the use of TeX and LateX by the blind to do 'structured documents'.  I'm wondering if this package would be appropriate for things like essays, with fairly specific formatting requirements.  (I could always use a Windows word processor to do the same, but I get less feedback with those than I feel comfortable with.)\n> If this is indeed the case, could anybody recommend a good site for learning the fundamentals?  I've heard of a publication called the TeXbook, but can't find an accessible version.\n> Thanks much in advance,\n> Zack.\n> \n\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}