{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Chris Evans <chrishold@psyctc.org>", "subject": "Re: [R] Tools For Preparing Data For Analysis", "body": "(Ted Harding) sent the following  at 10/06/2007 09:28:\n\n... much snipped ...\n\n> (As is implicit in many comments in Robert's blog, and indeed also\n> from many postings to this list over time and undoubtedly well\n> known to many of us in practice, a lot of the problems with data\n> files arise at the data gathering and entry stages, where people\n> can behave as if stuffing unpaired socks and unattributed underwear\n> randomly into a drawer, and then banging it shut).\n\nAnd they look surprised when pointing a statistician at the chest of\ndrawers doesn't result in a cut price display worthy of Figleaf (or\nVictoria's Secret I think for those of you in N.America) and get them\ntheir degree, doctorate, latest publication ...\n\nAh me, how wonderfully, wonderfully ... sadly, accurate!\n\nThanks Ted, great thread and I'm impressed with EpiData that I've\ndiscovered through this. I'd still like something that is even more\nintegrated with R but maybe some day, if EpiData go fully open source as\nI think they are doing (\"A full conversion plan to secure this and\nconvert the software to open-source has been made (See complete\ndescription of license and principles).\" at http://www.epidata.dk/ but\nthe link to http://www.epidata.dk/about.htm doesn't exactly clarify this\nI don't think.  But I can hope.)\n\nThanks, yet again, to everyone who creates and contributes to the R\nsystem and this list: wonderful!\n\nC\n\n\n-- \nChris Evans  Skype: chris-psyctc\nProfessor of Psychotherapy, Nottingham University;\nConsultant Psychiatrist in Psychotherapy, Notts PDD network;\nResearch Programmes Director, Nottinghamshire NHS Trust;\n*If I am writing from one of those roles, it will be clear. Otherwise*\n*my views are my own and not representative of those institutions    *\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}