{"category": "spam", "to_address": "Gnitpick <gnitpick@flax24.uwaterloo.ca>", "from_address": "Catherine Lawrence <strickland@gitti.com>", "subject": "FYEO", "body": "\n\nIs there any reasons to pay more? Do you want to save your money? I bet you do! \nEverything for your sexual health\nWe have only high-quality national medications at low prices. There is no need for someone to know about your sexual problems. \nOur site\nThere is no need to have a prescription, just visit our store and buy the pills you want.\nWith best regards,\nCatherine Lawrence\n \n \nKak ia uzhe skazal, Ia gotovil ee dlia drugoj roli. Ia vsego lish Ispolzuiu etu veshch. Uvy, krylco Pustovalo. A vot Zachem Namestnika poneslo k vladyke nubesov, mozhno bylo tolko dogadyvatsia, tak Kak podrobnee govorit ob etom on ne stal. \nNe ubivat zhe ih, v samom dele? On postaralsia uspokoit ih golosom, vkladyvaia v nego Silu: Tishe, tishe, tvariushki. Onni ne Uspela nichego poniat, kak okazalas vperedi nego na chernom, a na to mesto, gde Kruzhilsia vzbesivshijsia shalun, uhnul gromadnyj kamennyj shar, oborvav vizg Neschastnogo zveria treskom smiatyh v lepeshku kostej. Tak, Osnova magii Ketrama Plameborodogo sostoiala v glubinnom vladenii silami ognia so Vsemi vytekaiushchimi otsiuda iavleniiami, a Olsen zheltoglazyj otlichalsia neobyknovenno Moshchnym darom upravleniia svetom i byl sposoben sozdavat magicheskie svetilniki Gigantskih razmerov kak, naprimer, Boshar, glavnoe magicheskoe svetilo Siiaiushchego, Podveshennoe s pomoshchiu toj zhe magii nad centrom goroda i sposobnoe rabotat v Dvuh rezhimah dnevnom i nochnom, odariaia haaskinov svetom, kotoryj otniala u nih Sfera. Mne nuzhny eti Veshchi, chtoby spasti im zhizn, im i vsem nam. Ia sglotnul, ia lichno nichego ne imel protiv vypivki. Eshche treh f!\nantomov zaniali Ostalnye Bigman, Otshelnik i Celitel. Kak vizhu, chuzhoj eshche ne poiavlialsia? Otshelnik otodvinul oto rta gorlyshko fliagi rovno nastolko, chtoby eto Ne pomeshalo emu korotko kivnut v znak soglasiia, a zatem prisosalsia snova. Vzglianul snova. \nOnni, zadumavshis, bezotchetno skolznula vzgliadom po pomeshcheniiu. Udar byl ochen silen, no myshcy Uzhe okameneli nastolko, chto ia ego ne oshchutil. Ne mog by ty okazat mne uslugu?. Poka mogut idti vse, Smogu i ia. ejisuminyon VVFcRlhQUVh0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}