{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "(Ted Harding) <Ted.Harding@manchester.ac.uk>", "subject": "Re: [R] Tools For Preparing Data For Analysis", "body": "On 10-Jun-07 19:27:50, Stephen Tucker wrote:\n> \n> Since R is supposed to be a complete programming language,\n> I wonder why these tools couldn't be implemented in R\n> (unless speed is the issue). Of course, it's a naive desire\n> to have a single language that does everything, but it seems\n> that R currently has most of the functions necessary to do\n> the type of data cleaning described.\n\nIn principle that is certainly true. A couple of comments,\nthough.\n\n1. R's rich data structures are likely to be superfluous.\n   Mostly, at the sanitisation stage, one is working with\n   \"flat\" files (row & column). This straightforward format\n   is often easier to handle using simple programs for the\n   kind of basic filtering needed, rather then getting into\n   the heavier programming constructs of R.\n\n2. As follow-on and contrast at the same time, very often\n   what should be a nice flat file with no rough edges is not.\n   If there are variable numbers of fields per line, R will\n   not handle it straightforwardly (you can force it in,\n   but it's more elaborate). There are related issues as well.\n\na) If someone entering data into an Excel table lets their\n   cursor wander outside the row/col range of the table,\n   this can cause invisible entities to be planted in the\n   extraneous cells. When saved as a CSV, this file then\n   has variable numbers of fields per line, and possibly\n   also extra lines with arbitrary blank fields.\n\n   cat datafile.csv | awk 'BEGIN{FS=\",\"}{n=NF;print n}'\n\n   will give you the numbers of fields in each line.\n\n   If you further pipe it into | sort -nu you will get\n   the distinct field-numbers. If you know (by now) how many\n   fields there should be (e.g. 10), then\n\n   cat datafile.csv | awk 'BEGIN{FS=\",\"} (NF != 10){print NR \", \" NF}'\n\n   will tell you which lines have the wrong number of fields,\n   and how many fields they have. You can similarly count how\n   many lines there are (e.g. pipe into wc -l).\n\nb) Poeple sometimes randomly use a blank space or a \".\" in a\n   cell to demote a missing value. Consistent use of either\n   is OK: \",,\" in a CSV will be treated as \"NA\" by R. The use\n   of \".\" can be more problematic. If for instance you try to\n   read the following CSV into R as a dataframe:\n\n   1,2,.,4\n   2,.,4,5\n   3,4,.,6\n\n   the \".\" in cols 2 and 3 is treated as the character \".\",\n   with the result that something complicated happens to\n   the typing of the items.\n\n   typeeof(D[i,j]) is always integer. sum(D[1,1]=1, but\n   sum(D[1,2]) gives a type-error, even though the entry\n   is in fact 2. And so on , in various combinations.\n\n   And (as.nmatrix(D)) is of course a matrix of characters.\n\n   In fact, columns 2 and 3 of D are treated as factors!\n\n   for(i in (1:3)){ for(j in (1:4)){ print( (D[i,j]))}}\n   [1] 1\n   [1] 2\n   Levels: . 2 4\n   [1] .\n   Levels: . 4\n   [1] 4\n   [1] 2\n   [1] .\n   Levels: . 2 4\n   [1] 4\n   Levels: . 4\n   [1] 5\n   [1] 3\n   [1] 4\n   Levels: . 2 4\n   [1] .\n   Levels: . 4\n   [1] 6\n\n   This is getting altogether too complicated for the job\n   one wants to do!\n\n   And it gets worse when people mix \",,\" and \",.,\"!\n\n   On the other hand, a simple brush with awk (or sed in\n   this case) can sort it once and for all, without waking\n   the sleeping dogs in R.\n\nI could go on. R undoubtedly has the power, but it can very\nquickly get over-complicated for simple jobs.\n\nBest wishes to all,\nTed.\n\n--------------------------------------------------------------------\nE-Mail: (Ted Harding) \nFax-to-email: +44 (0)870 094 0861\nDate: 10-Jun-07                                       Time: 22:14:35\n------------------------------ XFMail ------------------------------\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}