{"category": "spam", "to_address": "\"captains@wheat.uwaterloo.ca\" <captains@flax24.uwaterloo.ca>", "from_address": "\"charles conner\" <taterhead76@aol.com>", "subject": "RE:", "body": "Are you too critical about your body? With Penis Enlarge Patch you can be sure at least about one thing. \n\nhttp://www.frionty.net/?lxztbintla\n\nMore powerful orgasms with more powerful and bigger dick from Penis Enlarge Patch.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n------------------------\nrooted creature of the woods. When he was eleven and his father went away to the Civil War, he had watched him out of sight with no sorrow, only a burning envy of the wanderings that lay before the soldier. A little later, when it was decided that he should go to stay with his married sister, since she was left alone by her husbands departure to the war, he turned his back on his home with none of a childs usual reluctance, but with an eager delight in the day-long drive to the other end of the valley. That was the longest journey he had ever taken, the man of almost three-score thought, with an aching resentment against Fate. \n   To Buenos Ayres, then. He did not even attempt to pronounce this name, though its strange, inexplicable look on the page was a joy to him. From there by mule-back and afoot over the Andes to Chile. He knew something about that trip. A woman who had taught in the Methodist missionary school in Santiago de Chile had taken that journey, and he had heard her give a lecture on it. He was the sexton of the church and heard all the lectures free. At Santiago de Chile (he pronounced it with a strange distortion of the schoolteachers bad accent) he would stay for a while and just live and decide what to do next. His head swam with dreams and visions, and his heart thumped heavily against his old ribs. The clock striking ten brought him back to reality. He stood up with a gesture of exultation almost fierce. Thats just the time when the train crosses the state line! he said. \n   By that time, indeed, he had sunk into a harsh and repellent silence on all topics. He went through the exhausting routine of farming with an iron-like endurance, watched with set lips the morning and afternoon trains leave the valley, and noted the growth of the pine tree with a burning heart. His only recreation was collecting time-tables, prospectuses of steamship companies, and what few books of travel he could afford. The only society he did not shun was that of itinerant peddlers or tramps, and occasionally a returned missionary on a lecture tour. \n\n\n"}