{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@speedy.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "More than a million Cellular One customers have access to Napster Mobile hosted by Ericsson", "body": "\n\n\n\n\n\n\n\n\nMore than a million Cellular One customers have access to Napster Mobile hosted by Ericsson\n\nSTOCKHOLM, SWEDEN, Apr 30, 2007 (MARKET WIRE via COMTEX News Network) --  Cellular One customers across the US have access to the world's largest mobile music catalog thanks to a joint partnership between the wireless provider, Ericsson (NASDAQ: ERIC) and Napster (NASDAQ: NAPS) announced today. Napster Mobile is available to customers of Cellular One from Dobson Cellular Systems, one of the largest providers of wireless services in rural America. The service  features Napster's  massive catalog  of over  3  million full-length songs  enabling  Cellular  One's more  than  1.6  million customers to  easily enjoy  music on  their wireless  handset and  on their PC. Tom Roberts, Chief  Marketing Officer for  Cellular One, says:  \"This agreement gives  Cellular One  customers  an outstanding  catalog  of music available directly from their wireless handset. This is another example of  how  consumers  are  increasingly  using  their  wireless handsets in  non-traditional  ways  and we  are  making  cutting-edge technology and services available to our customer base.\" Cellular One  subscribers in  17  US states  have access  to  Napster Mobile, allowing them to search  and browse the content in  Napster's catalog and  buy and  receive full-length  songs via  their  wireless handset. Since  Napster  Mobile  is a  dual-platform,  digital  music service fully integrated with  Napster's PC offering,  a copy of  the purchased content is simultaneously sent to the customer's PC. Brad Duea, President of Napster,  says: \"By partnering with  Ericsson and utilizing  its unique  hosting platforms,  we have  an  effective channel in place that providers  can use to include Napster's  strong brand and music services in their mobile media content offerings.  We are excited  to work  with  Cellular One,  a  leader in  the  dynamic environment of  mobile content,  and now  among a  growing number  of providers offering Napster Mobile to subscribers.\" Napster Mobile is based on  a service delivery platform tailored  for media  delivery.  Ericsson  will  host,  integrate  and  manage   the round-the-clock-operations of  the  service  for  Cellular  One  from Dobson under a managed service agreement. The agreement also includes content aggregation and digital rights  management and is based on  a risk- and revenue-share model. Angel Ruiz, President  of Ericsson North  America, says: \"Our  hosted solutions are strategically designed to enable innovative and leading providers like Cellular One  to quickly and cost-effectively  deliver valuable services to their customers. Ericsson helps providers retain customers longer  and  gain  new  customers  in  greater  numbers  by enhancing the  wireless experience  for subscribers,  without  losing focus on operational efficiency.\" Ericsson is  shaping  the future  of  Mobile and  Broadband  Internet communications  through   its   continuous   technology   leadership. Providing innovative solutions in  more than 140 countries,  Ericsson is helping to create the most powerful communication companies in the world. Read more at http://www.ericsson.com FOR FURTHER INFORMATION, PLEASE CONTACT \nEricsson Media Relations\nPhone: +46 8 719 6992\nE-mail: press.relations@ericsson.com\n\nAbout Cellular One Cellular One is a trade name of Dobson Cellular Systems, a subsidiary of Oklahoma City-based Dobson Communications Corporation (NASDAQ: DCEL). The company owns and operates more than 70 wireless markets in 17 states. For more information on the products and services of Cellular One from Dobson Cellular Systems, visit: www.celloneusa.com About Napster Napster,  the  pioneer   of  digital  music,   offers  the   ultimate interactive music experience. With  an expanding roster of  offerings including free, Web-based music listening and sharing,  subscription and portable  subscription services,  and  an advanced  mobile  music platform, Napster creates better ways to discover, share, acquire and enjoy music --  anytime, anywhere.  Napster is  headquartered in  Los Angeles, with offices in Frankfurt, Luxembourg, New York, San  Diego, San Jose and Tokyo. About Ericsson's Managed Services offering Ericsson  has  the  telecom  industry's  most  comprehensive  managed services offerings, ranging from  designing, building, operating  and managing day-to-day operations  of a customer's  network, to  hosting service applications  and  enablers,  as well  as  providing  network coverage and capacity on demand. As the undisputed leader in  managed services, Ericsson  has officially  announced more  than 100  managed services contracts  with  operators  worldwide  since  2002.  In  all current managed services  contracts, excluding  hosting, Ericsson  is managing networks that  together serve over  120 million  subscribers worldwide. Copyright Copyright Hugin ASA 2007. All rights reserved. SOURCE: Ericsson \n\n\n\n\n\n\n\n\n\n You are subscribed to Napster Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n Napster \n 461 S. Milpitas Blvd. , Milpitas, CA 95035\n Service provided by Shareholder.com \n\n\n\n\n\n"}