{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "J.delasHeras@ed.ac.uk", "subject": "Re: [R] Getting and using a function", "body": "Quoting Thomas L Jones :\n\n> I am trying to do what is perhaps the most basic procedure which can be done\n> with the R software.\n>\n> Under Windows XP Home Edition, I want to get a copy of the function \"gam,\"\n> then put it in and use it. I intentionaly use informal terms, rather than\n> technical terms whose exact meaning I might or might not know.\n>\n> I am finding this extremely frustrating. Every time I try to do anything,\n> all I get is error messages. Hey, this isn't rocket science; there are only\n> three or four or five steps involved. Well, what are they? There is all this\n> opaque terminology. There are libraries, and packages, and one downloads\n> them, loads them, and installs them, but just what all this means is\n> unclear.\n>\n> One example among many: I tell it\n>\n> library (gam)  all I get is an error message.\n>\n> Error in library (gam)  : there is no package called 'gam'\n>\n> Well, does this mean what it says, or does it mean something different? For\n> example, does it mean that such-and-such computer program has not yet been\n> downloaded?\n>\n> I did download and install the 2.4.1 flavor (version?) of the gui. I infer,\n> reading between the lines a bit, that there may be a sort of standard\n> procedure for setting things up, perhaps downloading and installing the\n> utils package, or something.\n>\n> The R software has much gold in it, but, as far as learnability/usability is\n> concerned, I give it poor marks.\n>\n> Tom Jones\n> DrJones at alum.MIT.edu\n\nPoor marks?\nIt's not the most user-friendly tool to use, as it requires a little  \nbit of learning[*]... but I find that there's a lot of very useful  \ninformation if you care to look for it and read it. What you can't do  \nis just type stuff at random and be annoyed that R doesn't understand  \nwhat you mean.\n\n[*] don't you have to learn how to use _any_ tool, anyway?\n\nThe \"Introduction to R\" included by default as a pdf with the RGui  \ninstallation (and accessible via its Help menu) is a very useful  \nintroduction to R (surprise!). I'd recommend starting with that,  \nbefore despairing. There are tons of useful R documentation all over...\n\n\nJose\n\n-- \nDr. Jose I. de las Heras                      Email: J.delasHeras@ed.ac.uk\nThe Wellcome Trust Centre for Cell Biology    Phone: +44 (0)131 6513374\nInstitute for Cell & Molecular Biology        Fax:   +44 (0)131 6507360\nSwann Building, Mayfield Road\nUniversity of Edinburgh\nEdinburgh EH9 3JR\nUK\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}