{"category": "ham", "to_address": "johan Faux <johanfaux@yahoo.com>", "from_address": "Seth Falcon <sfalcon@fhcrc.org>", "subject": "Re: [R] locked environment and inheritance", "body": "johan Faux  writes:\n\n> Thanks for your reply.\n>\n> Experimenting a little further, I was able to learn a bit more and\n> find what is the real problem of mine what the real question is.\n\n>\n> I could create my S4 extended class by adding these two lines in my namespace file\n> importClassesFrom(Matrix,Matrix)\n> importClassesFrom(Matrix,dMatrix)\n\nYou can also do:\n\n  importClassesFrom(Matrix, Matrix, dMatrix)\n\n> and then creating my new class in another R file\n>\n> library(Matrix)\n  ^^^^^^^\n\nI would not call library for such a case.  If you are importing\nlibrary in your package's namespace, then you probably want the\nfollowing in your DESCRIPTION file:\n\n   Depends: Matrix, methods\n   Imports: Matrix\n\n[yes, there is a lot of duplication in how things are specified]\n\n> setClass(\"myMatClass\", representation(\"dMatrix\",myslot=\"numeric\"))\n>\n>\n> which creates the new S4 class when my package is loaded. \n>\n> The problem is that I would like to create the class inside a function of mine:\n>\n> createMyS4Class() {\n>     library(Matrix)\n>\n>     setClass(\"myMatClass\", representation(\"dMatrix\",myslot=\"numeric\"))\n> }\n\nAgain, the call to library should not be needed.\n\n> so that, at some point (after my package is loaded ), I can do something like:\n>\n> if (cond)\n>     createMyS4Class()\n\nHow do you intend to use such a class?  Is the real issue that you\ndon't want to depend on Matrix and only use it if it is available?\n\n> Now, I understand that at this point, my package environment is\n> locked.  So the question become: Is there any way that I can unlock\n> my package environment, create my new S4 class and lock it back or\n> something?\n\nI think that might be possible, but that doesn't make it a good idea :-)\n\n> Please let me know if that makes sense ? \n> I appreciate your comments.\n\nIt might help to understand what your are trying to achieve overall.\nPerhaps there are other approaches...\n\nAlso, at this point, the discussion is more appropriate for R-devel.\nPerhaps you can move the conversation there?\n\nBest,\n\n+ seth\n\n-- \nSeth Falcon | Computational Biology | Fred Hutchinson Cancer Research Center\nhttp://bioconductor.org\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}