{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Geneva Stanton\" <kordjfrostynaw@djfrosty.com>", "subject": "Melt away fat easily", "body": "\nStop being obese and unhappy\n\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting product for corpulent people is now available – As were told on BBC.\n\n\nCan you count up all the situations when you appeal to yourself to do any thing to get rid of this fastly growing number of kilos? Happily, now no major price is to be paid. With Anatrim, the ground-shaking pound-melting blend, you can achieve naturally health mode of life and become really thinner. Just look at what people say!\n\n\n\n\"I hate to admit it but I was an awful food addict. \n\n\nI devoured all this trash \n\n\nand just could not stop. \n\n\n\n\nThis ruinous passion stopped when I started course with Anatrim! \n\n\nHoly God,\n\n\n\n\n my inclination to eat constantly abated, \n\n\nmood improved and I became the happiest person 24 pounds in 2.4 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person on the planet!\"\n\n\n\n\n\nLinda F., San Diego\n\n\n\n\n\n\"Since my early childhood I was a weighty boy. \n\n\nIt’s pretty hard to imagine how I abhorred being derided at school. \n\n\n\n\nI abhorred my stoutness and I detested even myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nIt literally pulled me out of this horror! Thanks and thanks to you, my friends.\"\n\n\n\n\n\nMikkey Fox, Boston\n\n\n\n\n\n\"Do you know what? My marriage was saved thanks to Anatrim! I fell down into this circle, depression – eating more – even more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOnce one of my friends pointed at your web site and I asked for Anatrim as soon as it was possible. \n\n\nThe result was excellent, my appetite came to acceptable level, I was often in good spirits, and, of course, I tightened my belt with no regrets. And you see, the sex became fantastic also!\"\n\n\n\n\n\nFrank\n\n\n\n\n There is a lot of thanks left by delighted people trying Anatrim. Don’t you wanna add yourself to the thousands and thousands of slim people and try this all-natural appetite-suppressing power raising product now!\n\n\nDon’t lose the opportunity!\n\n\n\n\n"}