{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Sidney Mayo\" <laxcreviceappointvew@creviceappoint.org>", "subject": "Look in the mirror and enjoy the new you", "body": "\nSummer is coming, time to tone up\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most enchanting flesh loss product is now readily available – As seen on BBC.\n\n\nDo you recall all the times when you told yourself you would do anything for being rescued from this quickly growing number of kilos? Fortunately, now no great offering is demanded. With Anatrim, the earth-shaking kilos-melting medley, you can get healthier lifestyle and become really thinner. Just look at what our customers write!\n\n\n\n\"It’s quite difficult to acknowledge it but I was an awful food addict. \n\n\nI ate all this trash \n\n\nand could not stop. \n\n\n\n\nThis suffering finished after I started taking Anatrim! \n\n\nGod,\n\n\n\n\n my inclination to eat constantly vanished, \n\n\nmood increased and I became the happiest person 29 pounds in 2.1 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person!\"\n\n\n\n\n\nVictoria K., Las Vegas\n\n\n\n\n\n\"I had problems with over-weight since I was a boy. \n\n\nYou can't even fancy how I detested being mocked at school. \n\n\n\n\nI detested my plumpness and I detested myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nIt literally dragged me out of this horror! A lot of thanks to you, guys.\"\n\n\n\n\n\nSerge Smith, San Francisco\n\n\n\n\n\n\"Do you know what? Anatrim kept my marriage intact! I went into this circle, depression – eating more – just more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce one of my friends pointed at your web site and I asked for pack of Anatrim immediately. \n\n\nThe final result was great, my appetite came to admissible level, I was often in good spirits, and, be sure, I tightened my belt with no regrets. And the sex became fantastic, too!\"\n\n\n\n\n\nDonald\n\n\n\n\n There is a lot of thanks delighted people leave after taking Anatrim. Why don't you join the tens of thousands of slim buyers and try this natural appetite decreasing energy increasing product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}