{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Lynne Jolly\" <jowcocoawildboarsnos@cocoawildboars.de>", "subject": "Getting thinner can be enjoyable", "body": "\nPounds down, mood up\n\n\n\n\n\n\nAnatrim – The newest and most delighting product for corpulent people is made available now – As seen on ABC.\n\n\nDo you remember all the cases when you asked yourself to do any thing to get rid of this fastly growing number of kilos? Fortunately, now no big price is to be paid. Thanks to Anatrim, the earth-shaking weight-reducing blend, you can get naturally health mode of life and a really slender figure. Have a look at what people write!\n\n\n\n\"I hate to admit it but I was a junk food addict. \n\n\nI greedily ate all this garbige \n\n\nand was unable to stop. \n\n\n\n\nThis fatal passion stopped when I started taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my inclination to eat constantly decreased, \n\n\nspirits improved and I turned to the happiest person in the world 20 pounds in 2.5 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nSilvia D., Chicago\n\n\n\n\n\n\"I had problems with over-weight since I was a boy. \n\n\nYou can't even fancy how I hated being derided at school. \n\n\n\n\nI abhorred my stoutness and I abhorred even myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nIt literally pulled me out of this horror! Lots of thanks to you, fellows.\"\n\n\n\n\n\nMikkey Fox, New York\n\n\n\n\n\n\"Do you know what? Thanks to Anatrim my marriage was luckily saved! I went into this circle, depression – eating more – even more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nMy friend showed me web site and I ordered my pack of Anatrim as soon as it was possible. \n\n\nThe results were great, my appetite came to acceptable level, I was often in a good mood, and, certainly, I tightened my belt with no regrets. And you know, the sex became fantastic, too!\"\n\n\n\n\n\nFrank\n\n\n\n\n There is a great number of gratitudes left by happy people taking Anatrim. Don’t you gonna add yourself to the tens of thousands of slim buyers and try this all-natural appetite-decreasing energy boosting product now!\n\n\nDon’t decline your chance!\n\n\n\n\n"}