{"category": "ham", "to_address": "\"Chas Owens\" <chas.owens@gmail.com>", "from_address": "\"Lakshmi Sailaja\" <lakshmi.sailaja@supersolution.com>", "subject": "RE: Prompt in Net::Telnet", "body": "You are right that I am trying to connect to a Windows m/c from a Solaris\nserver.\n\nBut when I used the below code, it gets connected but I am having problem\ndisplaying the output:\n\n\n my $telnet = Net::Telnet->new(HOST => \"$server\",\n                Dump_log => \"telnetdump.txt\",\n                PROMPT => '/[>]/');\n $telnet->login('user', 'pass');\n $telnet->cmd('ls -l >lsop.log');\n\nafter running this program, lsop.log is being created but I don't see\nanything in it.\n\nIf I can display the output, I am all good. Please suggest!!!\n\nThanks in Advance.\n\nRegards,\nLakshmi\n952-833-1220\n\n-----Original Message-----\nFrom: Chas Owens [mailto:chas.owens@gmail.com]\nSent: Tuesday, June 12, 2007 6:41 PM\nTo: lakshmi.sailaja@supersolution.com\nCc: beginners@perl.org\nSubject: Re: Prompt in Net::Telnet\n\n\nOn 6/12/07, Lakshmi Sailaja  wrote:\n> Hello,\n>\n> I am supposed to write a program that will telnet to a remote server and\n> execute some commands. I get the following error:\n> \"timed-out waiting for command prompt at  line \"\n>\n> This is because the prompt is not set correctly. Can you please tell me\nwhat\n> the prompt value should be set to?\n>\n> how can I determine my remote machines prompt?\n>\n> Thanks in advance!!\n>\n> Regards,\n> Sailaja\n>\n>\n> --\n> To unsubscribe, e-mail: beginners-unsubscribe@perl.org\n> For additional commands, e-mail: beginners-help@perl.org\n> http://learn.perl.org/\n>\n>\n>\n\nIf you are trying to connect to the \"telnet\" server that comes with\nMicrosoft OSes then you are SOL.  If you are trying to connect to a\ndifferent telnet server, then please provide the name of the server\nand operating system it is running under so we can duplicate your\nenvironment.\n\nfrom Perldoc Net::Telnet\n       Connecting to a Remote MS-Windows Machine\n\n       By default MS-Windows doesn't come with a TELNET server.  However\nthird\n       party TELNET servers are available.  Unfortunately many of these\n       servers falsely claim to be a TELNET server.  This is especially true\n       of the so-called \"Microsoft Telnet Server\" that comes installed with\n       some newer versions MS-Windows.\n\n       When a TELNET server first accepts a connection, it must use the\nASCII\n       control characters carriage-return and line-feed to start a new line\n       (see RFC854).  A server like the \"Microsoft Telnet Server\" that\ndoesn't\n       do this, isn't a TELNET server.  These servers send ANSI terminal\n       escape sequences to position to a column on a subsequent line and to\n       even position while writing characters that are adjacent to each\nother.\n       Worse, when sending output these servers resend previously sent\ncommand\n       output in a misguided attempt to display an entire terminal screen.\n\n       Connecting Net::Telnet to one of these false TELNET servers makes\nyour\n       job of parsing command output very difficult.  It's better to replace\na\n       false TELNET server with a real TELNET server.  The better TELNET\n       servers for MS-Windows allow you to avoid the ANSI escapes by turning\n       off something some of them call console mode.\n\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}