{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle Zombie<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, June 19th and the Number 8 have a special meaning for you", "body": "\n\nMemo, starting June 19th, your dreams of WEALTH could come true!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMemo, let me tell you how a simple bracelet could attract $50,000, even $500,000 and make your life comfortable and carefree...\nWe have just entered a phase of \"WEALTH ENERGY\"so intense, it could turn your financial picture around by the end of  June - but you must be prepared to act quickly!\n\n\n\n\nDear Memo,    If your spring so far has been memorable only for the temperature, hang on, because you're in for a real SCORCHER of LUCK!\n    Starting on June 19th, you'll be able to tap into an unusually strong phase of \"WEALTH ENERGY.\" For 88 magical days following June 19th, this energy will be at its peak -- and the effect on your life could be mind-blowing! Whether you dream of paying off debts, buying a new car or home, or quitting your job to travel the world, this is your golden opportunity to make it come true.\n    But to really attract the biggest rewards -- the $500,000 jackpot, for instance! -- you need to get the \"Power of 8\" on your side...that's where the \"Bracelet of Divine Mysticism\" comes in, and why I want you to have it ASAP!\n\n\n\n\n    Psychically \"tuned\" to the number 8 -- the number of real Power, serious Money, and lasting Good Luck, it's designed to attract and secure all kinds of WEALTH -- material, emotional and spiritual. With its eight mystical charms and eight magical crystals, it can do this for any man, woman or child. It can bring YOU good fortune and that is why I want you to have it.\nHere is something else you should know:\n    Memo, not only is the \"Bracelet of Divine Mysticism\" a superb magical tool, but NOW is the perfect time for you to wear it!\n    On June 19th, the Sun, planet of vitality and authority will make a spectacular aspect to Jupiter, ruler of abundance, luck and jackpot winnings. This starburst of WEALTH ENERGY will stretch out into 88 days of astonishingly good fortune for you!\n    When these forces come together, believe me, Memo, the sky's the limit. Everything from your biggest investments to your hobby or sideline business to the lottery ticket you bought last week will suddenly seem to GLOW with LUCK!\nThis alone could make your money picture the best it's ever been...\nBut it's only the beginning!\n    Then, in the 88 days that will follow the June 19th, the \"Power of 8\" will be at its peak.  These 88 magical days are going to be a real SCORCHER of LUCK for you -- an amazing time when you could see MONEY WINNINGS, GAINS or WINDFALLS in the thousands, hundred thousands, or even MILLIONS!!\n    I'm telling you, Memo, this is not to be missed!  Although I can't say exactly what this wonderful time will bring you, I know it's one of your best chances ever to reap the life-changing Good Fortune you need and deserve.\n    But we have to start NOW -- there's no time to waste.\nDon't take any chances, Memo!Start wearing your \"Bracelet of Divine Mysticism\"right now! \n    I want you to start wearing your \"Bracelet of Divine Mysticism\" right away, so we can get the \"Power of 8\" working for you.\n    The more you wear it, the more aligned you will be energetically to the \"Power of 8\" and the fantastic Wealth vibration of the coming weeks. \n\n\n\n\n\n    I also want you to carry the special \"Power of 8 Talisman,\" a magical piece designed to connect you spiritually with the powerful wealth energy of  6/19.\n\n\n    (I will send you this talisman FREE with your \"Bracelet of Divine Mysticism.\"  It's my gift to you!)\n    All you have to do is wear your bracelet and carry your talisman every day, during the 88 lucky days starting  June 19th. You'll be an irresistible magnet for Wealth and Success!\n    Now let me take a second to explain to you about the significance of the stones and charms on your \"Bracelet of Divine Mysticism.\"  I think knowing this will help you tune in even more to the bracelet's luck-attracting power...\nEight (8) Golden Charms:These bring Love and Affection, Truth and Honesty, the granting of your wishes, the blessings of Good Fortune, and the magnetism to attract Success in everything you do. They also ensure that Love will always come back to you 8 times stronger, and that the one you love will be drawn to you and stay by your side!\nEight (8) Colorful Crystals:Pink for love and harmony, flame for passion and energy, turquoise for honesty and truth, aquamarine for clarity of mind, citrine for great wealth, amethyst for emotional balance, topaz blue for health and well-being, and deep rose for an open, receptive and joyful spirit. \n\n    Please be assured, Memo, that I stand by the quality and energetic properties of your \"Bracelet of Divine Mysticism.\"\n    And you can send for your bracelet without having to worry about any kind of risk. If it doesn't live up to your expectations  -- whatever they may be! -- just send it back, and I will refund your payment in full, including the shipping and handling, immediately...with no explanation necessary.  But you can always keep your \"Power of 8 Talisman\", as my free gift to you, no matter what.\n    That should give you some idea of how good I think this is going to be, and how much you have to GAIN by wearing your \"Bracelet of Divine Mysticism,\" especially during the 88 succeeding days after  June 19th, when the \"Power of 8\" will be at its height!\n    In case you're worried about what such an extraordinary bracelet might cost, don't be. I made special arrangements to make sure your \"Bracelet of Divine Mysticism\" is easily affordable at only $24.95. Knowing what's coming, I want nothing to get in the way of your having this powerful bracelet! So please, take advantage of this great price -- I worked hard to secure it for you.\n    To connect to the amazing energies of the \"Bracelet of Divine Mysticism\" and get the \"Power of 8\" working for you, all you have to do is click the button below.    But do act now, Memo - the sooner you start wearing your bracelet, and carrying your FREE \"Power of 8 Talisman,\" the greater your potential rewards will be. Don't let another minute go by!\n\n\n    Your friend and advisor,\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for offers and discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400.\n\n"}