{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: The D.C. Madam And Her List", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nThe \n      D.C. Madam List: Is It Our Business?On May 4th – Friday – \n      ABC's \"20/20\" will air a report on Deborah Jeane Palfrey and her clients. \n      Palfrey is better known as the \"D.C. Madam,\" and she has apparently run an \n      escort service in the D.C. area for more than a decade. She has also \n      reportedly handed her client list over to ABC News – a list that includes \n      \"people…at the Pentagon, lobbyists, others at the White House, prominent \n      lawyers — a long, long list,\" according to Brian Ross. But should ABC News reveal the names on \n      the list? [+ Read More]\n\nDinner, \n      You Got Servedthe New York Times has decided to stop participating in the White House \n      Correspondents' Association dinner. There has been much debate about the \n      dinner over the years, with many outside the media establishment citing it \n      as evidence of a too-cozy relationship between the media and the \n      administration. While one can certainly make the argument that the media \n      need a more adversarial relationship with the government, I've come to \n      question the significance of the dinner in making that case.[+ Read More]\n\nNatalee \n      ReturnsA quick reality check for those of us who lament the \n      tendency of news outlets to run stories about white women in trouble: The \n      most viewed story on CBSNews.com at the moment is a \"48 Hours\" piece \n      entitled \"Natalee Holloway: New Clues.\" That's right: The tale of the \n      Alabama teen who went missing in Aruba nine months ago is still \n      attracting enough eyeballs to qualify as the top story on the site. [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nIn \n      The Wake Of The CBS News Tragedy, What To Make Of The \n      Critics?Lara \n      Logan Helps Put Iraq Coverage Into \n      A Broader Perspective\n \nA \n      Day In The Life On Capitol Hill\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}