{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Don Armstrong <don@debian.org>", "subject": "Re: Final text of GPL v3", "body": "On Wed, 04 Jul 2007, Anthony W. Youngman wrote:\n> In message <20070703225218.GH31687@archimedes.ucr.edu>, Don Armstrong \n>  writes\n>> On Tue, 03 Jul 2007, Anthony W. Youngman wrote:\n>>> Sklyarov did what he did AT HOME IN RUSSIA. It was the company he worked\n>>> for that marketed it in America.\n>>\n>> And Sklyarov who traveled to the US and (at the time) allegedly\n>> broke the law in a demonstration while in the US. [The insanity of\n>> the anticircumvention clause of the DMCA notwithstanding.]\n>\n> If he was charged with breaking US law on US soil, fair enough. The\n> problem, as I see it, was that he was ...\n>\n> Charged with breaking US law, as a result of actions he did in\n> Russia, in order to comply with Russian law.\n>\n> THAT is the lunacy (and American megalomania) of the Sklyarov\n> debacle.\n\nExcept that he wasn't. Reading the complaint and indictment would be a\nreasonable first start before complaining about American megalomania.\n[Otherwise you're indulging in the American pastime of rushing to\njudgement.]\n\nIn addition to the demonstration, the server from which the ebook\nprocesser was distributed was located within the US, as was the\npayment processing stuff. You can't distribute goods in a country and\nremain free from being indicted when those goods violate the laws of a\ncountry, the sanity of the country's laws notwithstanding.\n\nRegardless, we're wildly OT for -legal.\n\n\nDon Armstrong\n\n-- \nWhen I was a kid I used to pray every night for a new bicycle. Then I \nrealised that the Lord doesn't work that way so I stole one and asked\nHim to forgive me.\n -- Emo Philips.\n\nhttp://www.donarmstrong.com              http://rzlab.ucr.edu\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}