{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "FilePlanet <owner-cp_announce_list@news.ign.com>", "subject": "World of Warcraft - The Black Temple Patch is Coming! ", "body": "\n\n\nWorld of Warcraft - The Patch is Coming!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t  The huge World of Warcraft 2.1.0 patch is expected any day now, adding the Black Temple, Ethereum Prison, Skettis, Nether Drakes and many more fixes and gameplay tweaks. Want the patch as soon as it's available? Don't wait -- FilePlanet.com will have the patch the moment it's ready for full download! \n\nThe Patch is Coming Soon to FilePlanet:\nhttp://www.fileplanet.com\n\n\n\n\n\n\nGET IT FIRST!\n\n\nFilePlanet Subscribers can reserve the patch in advance for Automatic Download: \n\n\n\n\n\n\n\n\nGET CAUGHT UP WITH PREVIOUS PATCHES\n\nFull Patch (Retail to v1.12)\nUpgrade (1.12 to 2.0.3)\nPatch (2.0.3 to 2.0.5)\nPatch (2.0.5 to 2.0.6)\nPatch (2.0.6 to 2.0.7)\nPatch (2.0.7 - 2.0.8)\nPatch (2.0.8 - 2.0.10)\nPatch (2.0.10 to 2.0.12)\nVisit the Patches Directory for International Versions\n\n\n\n\n\nMORE WOW RESOURCES\n\nAll Available WoW Files:\nFilePlanet's WoW Homepage\n\nMovies, Trailers, and Fun Videos:\nWorld of Warcraft Movie Archive\n\nCommunity News and Talk:\nWorld of Warcraft Vault\n\n\n\n\n\n\n\n\n\n    Having trouble viewing this e-mail? View the online version. TO UNSUBSCRIBE: Click Here!\n\n    You have received this e-mail because you are a registered user of IGN and have opted-in to receive IGN email updates concerning new products and services. If you believe you're receiving this e-mail in error or prefer not to receive promotions from IGN.com, reply to this message to opt out of future promotional mailings. Click here for our privacy policy. You may still receive other e-mails from IGN. To update your e-mail address or manage your account, visit GameSpyID.com. It may take up to 10 days for adjustments to your email preferences. If you have questions about this offer or your services, you can reach Customer Service here. \n    \n    You may mail inquiries to:IGN Entertainment, Inc., 8000 Marina Boulevard, 2nd Floor, Brisbane, CA 94005.\n    \n\n\n\n\n\n\n\n\n\n"}