{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"SMAS Expansion\"<Brittany.Webb@globalmarkithits.com>", "subject": "SMAS Expanding into NYC Fall 2007", "body": "\n\n\nSMAS Expanding into NYC Fall 2007\n\n\n\n\n\nSMAS Expanding into NYC Fall 2007\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nSomatic Systems, Inc. to Open Doors to Expanded NYC Location in 2007\n\n\n\n \n\n\n\n \nNORTHAMPTON, MA--(MARKET WIRE)--Jun 27, 2007 -- Somatic Systems, Inc. (Other OTC:SMAS.PK - News) is  pleased to announce that they will open their doors to their  expanded NYC  location in the fall of 2007. The planning and design phase  of the  construction of the 3500 sq. ft. location is complete and  will soon expand  Somatics Systems' presence in the thriving Manhattan neighborhood  of  Tribeca.\n\n\n\n \n\n\n\n\n \nThe company is excited about the upgraded space because  of its proximity to  the city's arts, theater, restaurant and financial districts.  The space  will house a large open area for public exercise classes,  each partitioned  with glass walls, a newly renovated treatment room and a  locker room  complete with shower. The sessions in NYC will be very profitable  and the  expansion will allow for 4 simultaneous full-time practitioners,  each  scheduling up to 20 sessions weekly. The company plans to  increase staff  at the NY location, begin a steady schedule of exercise  classes and  increase sales of private sessions and products.\nThe 3500 square foot facility provides for a combination  of session rooms  and movement classrooms. In the future, there is capacity  to increase the  space to 5000 square feet while keeping the existing footprint.  The future  expansion of the business in NYC will be realized using  a larger classroom  space and four or five new treatment rooms, enabling 8 or  10 or more  additional full-time practitioners.\nIn addition, Somatics Systems has begun the application  process to become  licensed with the New York State Department of Education,  with plans to  begin the Clinical Somatic Education Professional Training  Program there in  fall 2008.\n\"Running the Professional Training Program in New York City  will be  exciting and will continue our nationwide expansion,\" said  CEO, Steven  Aronstein. \"The renovation of the Tribeca location will  allow us to  promote awareness of the brand in a large metropolitan city,  increase  traffic to the clinic and support Somatic Systems products  and services.  We are planning for this location to add significantly to  our revenue  stream over the next few years.\"\nAbout Somatic Systems, Inc.\nSomatic Systems serves as the worldwide center for Clinical  Somatics™ and  Clinical Somatic Education™, the groundbreaking pain-management  method and  fitness system of Thomas Hanna. We are home to some of the  only fully  trained, certified Clinical Somatics™ practitioners  in the Northeast, and  operate the largest clinical centers worldwide. Somatics  trains and  certifies clinical practitioners on how to reeducate and  recalibrate  overused or injured muscles through a simple series of training  sessions  and prescribed at-home movements that lengthen muscles back  to their  natural, relaxed state. We are very proud to be able to  provide access to  this revolutionary (and all too scarce) form of truly holistic  healthcare.\n\n \n \n\n\n \n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}