{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS News Early Show <cbsnews___early_show_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Tracy Smith: An Important CBS News Legacy", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\n                                                          \n      May 18, 2007 \n\nHey \n      folks,\n\nDid you know that \n      in Sweden \n      news anchors are called Kronkiters?  Just another nod to the \n      incredible legacy of newsman Walter Cronkite, who retired from the CBS \n      Evening News 26 years ago. And tonight \n      there'll be a special on CBS to honor him: \"That's the Way it Is: \n      Celebrating Cronkite at 90.\"  We had a preview on the show this \n      morning. Some of the biggest names in entertainment and news pay tribute \n      to him, but I'm most looking forward to watching clips of Cronkite \n      himself, especially \n      the enthusiasm he brought to space coverage.  I can watch the \n      first moon landing, with Uncle Walter narrating, over and over again and \n      not get tired of it (and actually, my husband is a space junkie, so in my \n      house, it's required, regular viewing).  \n      \n\nThis morning, we \n      also wrapped up our series \"Just Ask a Woman\" with a \n      look at some of the myths of motherhood (no, everyone else is NOT a better \n      mom than you are).  The always funny Mike Myers stopped by to talk about the latest \n      Shrek movie.  And CBS News Sunday Morning's Bill \n      Geist was in the studio, telling Harry all about his new book: \"Way Off the \n      Road,\" which chronicles his travels, trademark wit in tow, \n       to some of the wackier spots in this country. I have so many \n      favorite Geist stories, it's tough to pick one (maybe the cowpie tossing \n      contest?), and I'm excited to revisit them all in this \n      book.\n\nTomorrow on The Saturday Early \n      Show, I'll be joined by our terrific new national correspondent, \n      Jeff Glor.  We'll help you decide when to give your \n      kids an allowance -- and how \n      much -- plus, we'll offer some tips on the best ways to make up after a \n      fight with your significant other (G-rated, of course). We'll have a PJ \n      fashion show (also G-rated); since it's Jeff's first Saturday show, \n      I'm going to have a little fun with him and tell him he's supposed \n      to dress up in PJ's for the segment. Tune in tomorrow to see if \n      he falls for it ...\nAnd next week on \"The Early Show,\" \n      we'll be featuring a new series, \"Happily Ever After.\" We asked you to \n      share your own love stories \n      with us and out of hundreds of responses we've chosen five couples \n      to highlight on the show.  Our couples have all faced their own \n      unique challenges: dealing with illnesses, accidents, a special needs \n      child ... even one couple that almost didn't get married. Their \n      stories are touching and \n      provide guidance on how we can all have our own “Happily Ever \n      After.”\n\nTracy  SmithEarlyShow@cbs.com \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}