{"category": "ham", "to_address": "\"'Silvia Lucato'\" <lucato_sh@yahoo.co.uk>, <r-help@stat.math.ethz.ch>", "from_address": "Bert Gunter <gunter.berton@gene.com>", "subject": "Re: [R] nlm() and optim()", "body": "Numerical optimization is sensitive to (at least) the method chosen,\ncontrol/convergence specifications, and the parameterization of the function\nbeing optimized (all of this is well known). Defining what you mean by\n\"reproduce\" in a precise, operational way is therefore essential. You have\nnot done so. For example, if it is the negative (ln)likelihood of a\nstatistical model that is being minimized, if the model is overparametrized\nso that there are near identifiability issues,the confidence region for the\nparameters will essentially be a (possibly quite irregular)lower dimensional\nsubspace (submanifold) of the full parameter space. Would you say that\nresults \"reproduce \" if they fall within this confidence region, even though\nthey may be quite different than the estimated minima? Issues with possibly\nmultiple local minima also complicate matters.\n\nBottom line: Determining when you have\"reproduced\" results from complex\nmodelling that rely on numerical optimization for model fitting can be\ndifficult. Careful and parsimonious modelling is vital.\n\n\nBert Gunter\nGenentech Nonclinical Statistics\nSouth San Francisco, CA 94404\n650-467-7374\n\n\n-----Original Message-----\nFrom: r-help-bounces@stat.math.ethz.ch\n[mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Silvia Lucato\nSent: Tuesday, April 10, 2007 7:32 AM\nTo: r-help@stat.math.ethz.ch\nSubject: [R] nlm() and optim()\n\nDear R-users,\n\nI have just joint the list and much appreciate any thoughts on 2 issues.\n\nFirstly, I want to reproduce some minimization results conducted in MATLAB.\nI have suceeded with nlm and optim-method CG. I have been told that I should\nget also with other optim methods. Actually, I found the same results when\ntesting a very straightforward equation. However with a more complicated\nmodel it was not true. It is realy possible? Have I got it by chance in the\nsimple case?\n\nSecondly, in order to check which optimization is more suitable for our\nstudy, I would like to have the value of the minimized parameters on each\niteration to later plot a \"likelihood surface\". However, for both nlm and\noptim, I could only keep the last iteration results. Is there a way to\nstore/record the minimized values for each iteration? \n\nSorry if these questions are reocuring. I have been searching for hints but\ndid not get too far and I am fairly new to R.\n\nComments and examples are most  welcome.\nSilvia Hadeler\n \t\t\n---------------------------------\n\n\t[[alternative HTML version deleted]]\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}