{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nIf there isn’t significant improvement\n  on the ground in Iraq,\n  the president won’t be able to hold onto some of his key Republican\n  support in Congress. That’s the message moderate Republicans had for\n  President Bush after they pulled him into a private meeting for what has been\n  called a “very frank” discussion earlier this week. Our chief\n  White House correspondent, Jim Axelrod, will have details about that meeting.\n  Sharyl Attkisson will report from Capitol Hill on how Congress and President\n  Bush may now be working toward a compromise on the crucial issue of setting\n  benchmarks for progress in Iraq.\n  \n \nThe maker of OxyContin and three of its\n  current and former executives pleaded guilty today to misleading the public\n  about how addictive the powerful drug can be. A U.S. Attorney said the\n  company unleashed an easily abused drug on an “unsuspecting and\n  unknowing public.” The company has agreed to pay hundreds of millions\n  of dollars. Correspondent Bob Orr will have the story.\n \nTwo forces of nature are clashing in the\n  Southeast as massive wildfires continue to torch the Florida-Georgia border.\n  Not far away, the first named storm of the year has brought a sprinkling of\n  rain to help firefighters there, but tinderbox conditions elsewhere in the country\n  are contributing to new fires. Kelly Cobiella will report.\n \nIt might be heating up all along the\n  East Coast – for good – if a new NASA report is right. Randall\n  Pinkston will share the disturbing report about just how hot our planet could\n  get before the turn of the century.\n \nElizabeth Palmer will report from London on the news today that one of America’s best friends,\n  British Prime Minister Tony Blair, is stepping down.  We’ll look back\n  at his decade in office.\n \nTo cap our broadcast, Kelly Wallace will\n  have an Eye on the American Family report. She’ll take a look at the\n  phenomenon called “opting out.” It’s the idea that some high-powered\n  career moms over the past decade have been deciding to stay at home with\n  their kids rather than work full-time. Now some experts say when mothers stop\n  working, it may not be voluntary. \n \nI hope you’ll join us,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}