{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 141", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. list feedback: One of the biggest mysteries in the postings\n      arises from trying to identify exactly where the untoward\n      behavior discussed in the postings actually took place.\n      (Museum Security Network Mailing list)\n   2. museum theft. A VALUABLE self-portrait by the Dutch master\n      Frans van Mieris has been stolen from the Art Gallery of NSW.\n      (Museum Security Network Mailing list)\n   3. China. Porcelain trail leads police to sunken ship. The\n      ship's existence came to light when local police got wind of\n      illegal salvage operations being carried out in the sea off\tNanao\n      County in South China's Guangdong Province,\tNangfang Daily\n      reported. (Museum Security Network Mailing list)\n   4. Italian police have recovered artifacts from an ancient Greek\n      temple dug up in southern Italy by a construction crew who\thad\n      dumped or looted the prized pieces and begun to pour\tconcrete\n      over the ruins, authorities said Tuesday.\n      (Museum Security Network Mailing list)\n   5. MONTREAL - The estate of the late Montreal art dealer Max\n      Stern has won a round in its legal case against an elderly\tRhode\n      Island woman in possession of a painting that the\testate's\n      lawyers say Stern was forced to sell under duress\tfrom the Nazis\n      70 years (Museum Security Network Mailing list)\n   6. Senate committee wants museum to change display casting\n      Canadian vets as 'war criminals'\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Wed, 13 Jun 2007 16:22:50 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] list feedback: One of the biggest mysteries in the\n\tpostings\tarises from trying to identify exactly where the untoward\n\tbehavior discussed in the postings actually took place.\nTo: \nMessage-ID: <027f01c7adc6$52741e60$f75c5b20$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nVan: Dr. Thomas Loftfield [mailto:dd@barbmuse.org.bb] \nVerzonden: woensdag 13 juni 2007 16:15\nAan: msn-list@te.verweg.com\nOnderwerp: RE: MSN-list Digest, Vol 7, Issue 140\n\nDear Security Network,\n\n    I find your postings to be extremely helpful in identifying potential\nsecurity lapses in our museum, and for alerting staff to what sorts of items\nhave gone missing in the world.  However, I would suggest that often one of\nthe biggest mysteries in the postings arises from trying to identify exactly\nwhere the untoward behavior discussed in the postings actually took place.\nIt would be very helpful (even though it will reduce the amount of game time\nspent solving the mysteries of where listed actions took place) if people\nposting alerts took the time to identify the location discussed.  Simply\nlisting the place as \"West Robberyville\" doesn't provide the same level of\nunderstanding as would \"West Robberyville, New York, USA\".  This problem\nseems to be at its worst when postings are simple transfers of newspaper\narticles which sometimes have as an identifier only the name of the\nnewspaper from which the posting was derived.\n\nCheers,\n\nThomas Loftfield\nDeputy Director\nBarbados Museum and Historical Society\nBarbados, West Indies\n\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Wed, 13 Jun 2007 20:06:23 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] museum theft. A VALUABLE self-portrait by the Dutch\n\tmaster\tFrans van Mieris has been stolen from the Art Gallery of NSW.\nTo: \nMessage-ID: <00f601c7ade5$8d39cd00$a7ad6700$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nDutch master stolen\nRichard Jinman and Clare Morgan\nJune 14, 2007\n\n\nThe oil on oak panel painting ... A Cavalier (Self-Portrait).\nhttp://www.smh.com.au/news/arts/dutch-master-stolen/2007/06/13/1181414383922\n.html#\n\nA VALUABLE self-portrait by the Dutch master Frans van Mieris has been\nstolen from the Art Gallery of NSW.\n\nIt is unclear when the small painting, 20 centimetres by 16 centimetres, was\nplucked from the gallery's walls or how it was taken from the building\nwithout alerting security officers.\n\nThe gallery's director, Edmund Capon, declined last night to put a value on\nit, but described it as \"a valuable picture, a known picture\", and said it\nwould be \"completely unmarketable\".\n\nMr Capon, who was preparing to fly home from London, said he was \"extremely\nshocked\" by the theft. He believes it is the first time an artwork has been\nstolen from the gallery in about 15 years.\n\n\"It's not something that we're accustomed to,\" he said. \"It's not an easy\nthing to remove the security screws and take it out of the building.\n\n\"It makes you very aware of two things: the extraordinary extent we depend\non the goodwill of our patrons and how diligent you have to be.\"\n\nIt is understood that The Rocks police were notified on Monday. Police\nsources said they suspected it was an inside job. Police have spent three\ndays interviewing gallery staff and examining security footage.\n\nThe stolen painting, an oil on oak panel, was painted between 1657 and 1659.\nIt was donated by the art patron and philanthropist James Fairfax in 1993.\n\nThe space the painting occupied has already been filled by another work from\nthe collection, a gallery source said.\n\nThe robbery comes at an embarrassing time for the gallery, which recently\nrevealed details of the biggest security operation in its history for an\nIslamic arts exhibition opening in eight days. The exhibition is believed to\nbe tighter than at previous shows featuring key works by Renoir, Picasso,\nPissarro and Van Gogh, according to gallery sources.\n\nWhile Aboriginal art is a popular target for thieves, the theft of European\nworks from public art institutions in Australia is rare. The nation's most\nfamous art theft was more protest than profit-driven.\n\nIn 1986, a group calling itself the Australian Cultural Terrorists unscrewed\nPablo Picasso's Weeping Woman from the wall of the National Gallery of\nVictoria.\n\nThe thieves brazenly put an official-looking, typewritten card in the\npainting's place which, in an embarrassing security lapse, nobody noticed\nfor almost two days. The gallery's embarrassment was compounded by the fact\nWeeping Woman was its most expensive painting, with a value of $1.6 million.\n\nApparently fed up with the poor treatment of arts by the state government of\nthe day, the group's ransom was a demand that an art prize for young artists\nbe established.\n\nPolice recovered the work, which shows Picasso's lover Dora Maar mourning\nthe bombing of Guernica during the Spanish Civil War, in a locker at the\nSpencer Street station a few days later. The thieves were never caught.\n\nPicasso also proved a magnet for thieves in the most recent high-profile art\ntheft. In February, burglars slipped into the Paris apartment of the\nartist's granddaughter and stole two paintings - one of his daughter Maya\nand another of his second wife Jacqueline - with a combined value of $85\nmillion.\n\nPerhaps the most high-profile theft was in August 2004 when gun-toting\nthieves staged a daring daylight raid at Oslo's Munch Museum, ripping Edvard\nMunch's The Scream and another of his works, Madonna. Three men were found\nguilty last year of charges relating to the theft, and the paintings were\nrecovered.\n\nhttp://www.smh.com.au/\n\n\n\n------------------------------\n\nMessage: 3\nDate: Wed, 13 Jun 2007 20:18:21 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] China. Porcelain trail leads police to sunken ship. The\n\tship's existence came to light when local police got wind of\tillegal\n\tsalvage operations being carried out in the sea off\tNanao County in\n\tSouth China's Guangdong Province,\tNangfang Daily reported.\nTo: \nMessage-ID: <000801c7ade7$39e0e880$ada2b980$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nPorcelain trail leads police to sunken ship  \n \n \n \nwww.chinaview.cn  2007-06-13 15:20:50  \n\n    BEIJING, June 13 (Xinhua) -- China has found an ancient sunken ship in\nthe South China Sea off the Guangdong coast, according to the Guangdong\nArchaeology Institute (GAI) here Wednesday. \n\n    According to GAI, the ship -- which was carrying a considerable amount\nof Ming Dynasty porcelain -- was probably built during the Ming Dynasty. \n\n    Guangdong archaeologists used GPS to locate the sunken ship early June.\nThe vessel, dubbed South China Sea-II, is about 17 to 18 meters long and\nlying at a depth of 20 meters. \n\n    GAI archaeologist Dr Wei Jun said \"a preliminary study of the sunken\nship shows it may have sunk 400 years ago after striking a reef.\" \n\n    \"The vessel was preserved well,\" Cui Yong, an archaeologist engaged in\nthe salvage work, said, revealing the deck of the ship is about 10\ncentimeters in thickness. \n\n    \"Undersea exploration found a large part of the vessel was buried in\nsands and porcelains piled in the vessel could be seen through part of the\ncabin exposed in the seawater,\" Cui added. \n\n    The ship's existence came to light when local police got wind of illegal\nsalvage operations being carried out in the sea off Nanao County in South\nChina's Guangdong Province, Nangfang Daily reported. \n\n    On May 25, Nanao County police learned that some fishermen had been\nrecovering ancient porcelain objects from the sea. \n\n    The police confiscated 21 pieces of ancient porcelains from a fishing\nboat whose owner claimed that divers he had hired for deep sea fishing had\nrecovered the porcelain by accident. \n\n    On May 26, another 117 pieces of porcelain were confiscated from two\nfishing boats who were carrying out illegal salvage work. \n\n    Police stepped up monitoring of the area and warned local people not to\nloot the cultural relics. On June 1, two local residents handed over 124\nporcelain items to police. \n\n    The sunken ship was found just a few days after China started salvage\noperations on the South China Sea-I, which dates back to the Song Dynasty,\nthe paper reported. \n\n    South China Sea I, discovered in 1987, was the first ancient vessel\ndiscovered on the \"Marine Silk Road\" in the South China Sea. \"The discovery\nof South China Sea II will provide more evidence about the 'Marine Silk\nRoad', and help with the study of Chinese sea-faring, ship-building and\nceramics making,\" Wei said. \n\nhttp://news.xinhuanet.com/english/2007-06/13/content_6237169.htm\n\n\n\n------------------------------\n\nMessage: 4\nDate: Wed, 13 Jun 2007 20:18:21 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Italian police have recovered artifacts from an ancient\n\tGreek\ttemple dug up in southern Italy by a construction crew who\thad\n\tdumped or looted the prized pieces and begun to pour\tconcrete over the\n\truins, authorities said Tuesday.\nTo: \nMessage-ID: <000601c7ade7$39a58d30$acf0a790$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nPosted on Wed, Jun. 13, 2007 \nAncient Greek artifacts recovered\n\n\n\nBy ARIEL DAVID\nThe Associated Press\nROME -- Italian police have recovered artifacts from an ancient Greek temple\ndug up in southern Italy by a construction crew who had dumped or looted the\nprized pieces and begun to pour concrete over the ruins, authorities said\nTuesday.\nAfter receiving information about the discovery during construction work on\na tourist resort on the coast of southern Calabria, police used helicopters\nto locate the site, near the town of Crotone, last week, said art squad\nofficials from the Carabinieri paramilitary police.\n\nMore than 50 artifacts, including columns and mosaics, had been excavated\nfrom the site and used to decorate a hotel complex nearby, while other\npieces had been placed in a dump to be reused as construction material.\n\nWhen police located the site, workers were preparing to lay the foundations\nof the resort hotel on the remaining ruins, said Gen. Giovanni Nistri, the\nhead of the art squad.\n\n\"It would have been the final tombstone for this temple,\" Nistri said at a\nnews conference in Rome.\n\nPolice identified two suspects for possible prosecution on charges of\nfailing to alert authorities about the find, damaging the site and illegal\npossession of archaeological artifacts, Nistri said. The two were not\narrested.\n\nItaly is full of archaeological treasures -- many undiscovered -- and\ndevelopers must report finds. Countless public and private projects have\nbeen scrapped or delayed over the years as state archaeologists descended on\nbuilding sites, and it is not uncommon for developers to fail to report a\ndiscovery and plow through ancient treasures.\n\nThe discovery of the Greek temple is of \"extraordinary historic and artistic\nvalue,\" and experts believe that it may be part of a larger ancient\nsettlement, the Carabinieri said in a statement.\n\nThe ruins are \"one big puzzle\" for scholars, as the area was previously\nthought to be devoid of such important public buildings, said archaeological\nsuperintendent Giovanni Guzzo.\n\nThe temple mixes two styles of Greek architecture -- the austere Doric and\nthe more graceful decorations of Ionic. It was probably built between the\nfourth and third centuries B.C. by the Bruzii, who lived under Hellenistic\ninfluence, which at the time extended across southern Italy, Guzzo said.\n\nhttp://www.star-telegram.com/ \n\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Wed, 13 Jun 2007 20:18:21 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] MONTREAL - The estate of the late Montreal art dealer\n\tMax\tStern has won a round in its legal case against an elderly\tRhode\n\tIsland woman in possession of a painting that the\testate's lawyers say\n\tStern was forced to sell under duress\tfrom the Nazis 70 years\nTo: \nMessage-ID: <000701c7ade7$39bf2fb0$ad3d8f10$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nStern estate wins court order in looted art case \n\n\nBy JANICE ARNOLD \nStaff Reporter \n\nMONTREAL - The estate of the late Montreal art dealer Max Stern has won a\nround in its legal case against an elderly Rhode Island woman in possession\nof a painting that the estate's lawyers say Stern was forced to sell under\nduress from the Nazis 70 years ago. \n\nIn Providence, R.I., U.S. District Judge Mary Lisi granted a request earlier\nthis month by the estate that ordered German-born Maria-Luise Bissonnette to\nstop moving the painting, the 19th-century Girl From the Sabiner Mountains\nby Franz Xaver Winterhalter. \n\nIt came to light last September that Bissonnette had sent the artwork to\nGermany in April 2006, shortly before the Stern estate launched a suit in a\nRhode Island federal court for the painting's restitution. \n\nThe two sides negotiated for months to try to reach a settlement before the\nestate took the case to court. \n\nLisi also ordered Bissonnette to permit representatives of the estate to see\nthe painting at its current location to determine its condition and to\nensure that it is being stored properly. Bissonnette can only move the\npainting again with the court's permission. \n\nThe two sides had tried unsuccessfully to work out a deal that would have\nallowed the estate to inspect the painting without seeking a court order.\nBissonnette had originally agreed only to allow the estate representatives\nto view the painting at her German lawyers' offices. \n\nStern, a Dusseldorf gallery owner, was ordered by the Gestapo to sell the\nWinterhalter, along with about 200 other artworks, at an auction conducted\nby Lempertz in Cologne in 1937. The estate claims he received only a small\nfraction of their value, which was largely taxed away. \n\nHe fled to England after this final liquidation of his inventory. \n\nStern, who owned the Dominion Gallery in Montreal for more than 40 years,\ndied in 1987 and left his estate to Concordia and McGill universities and\nthe Hebrew Univesity of Jerusalem, which have created a foundation in his\nname. \n\nMore than two years ago, Concordia launched a worldwide search, headed by\nClarence Epstein, to find the confiscated Stern collection, which includes\npossibly another 200 works that the dealer was forced to sell after 1935. \n\nThe Stern estate's legal team, headed by Washington, D.C.-based Thomas\nKline, claim that the Winterhalter rightfully belongs to the estate, because\nit was effectively stolen under the Nazi government's laws excluding Jews\nfrom trade in art. \n\nThe estate told the Rhode Island court that a German court recognized in\n1964 that the Lempertz auction was coerced. Girl From the Sabiner Mountains\nis also listed as confiscated by the Art Loss Register in London. \n\nBissonnette, 83, who has lived in Providence for many years, says she\ninherited the work from her stepfather, physician Karl Wilharm. She says he\npaid for it and she has the receipt to prove it. \n\nThe estate's own research found that Lempertz recorded that it sold the\nWinterhalter to Wilharm for the equivalent of $3,600, but Stern probably\nreceive only two to five per cent of that, Epstein said. \n\nThe estate alleges that Wilharm was a \"high-ranking member\" of the storm\ntroopers and a Nazi party member. \n\nThe painting's whereabouts came to Epstein's attention when it was put up\nfor sale on the eBay website in January 2005 by a Rhode Island auction\nhouse, to which Bissonnette had consigned it. \n\nAlthough she holds the hereditary title of baroness, the widowed Bissonnette\nsaid she tried to sell the painting to pay for cancer treatment. \n\nThe estate's lawyers charge that she spirited the painting out of the United\nStates to an unknown location in Germany to pre-empt litigation here. They\nsurmise that she hoped to get a German court to act, and possibly receive a\nmore sympathetic hearing. \n\nThe estates say there had been an understanding that the painting would be\nleft at the Rhode Island auction house until the dispute was resolved. \n\nAmong the evidence filed in court was a postal receipt showing that\nBissonnette put the painting's value at $50 (US), which the estate's lawyers\nsay may have violated U.S. customs laws. \n\nThe Rhode Island auctioneer has said it was worth between $50,000 and\n$75,000 (US). Bissonnette had earlier said through her lawyer that she would\nonly sell the painting to the Stern estate for $150,000. \n\nBissonnette told the Boston Globe that she didn't know the painting's value\nand underestimated it to discourage theft during shipment. \n\nMontreal lawyer Robert Vineberg, executor of the estate, said the foundation\nhad offered Bissonnette \"a relatively small sum\" as a goodwill gesture,\nconsidering her modest means and health, although legally, he maintains, she\nis owed nothing. \n\nIn the Globe interview published before the court upheld the estate's\nrequest, Bissonnette insisted she and her parents had done nothing wrong. \n\nShe said her stepfather was a country doctor during World War II and did not\nsupport the Nazi regime. She said the Nazi police demanded use of a former\nbookbinding factory he owned outside Munich. \n\nAfter the U.S. District Court decision, Bissonnette's lawyer, John Weltman\nof Boston, reportedly withdrew from the case over differences with his\nclient. He claimed he had never counselled her to send the painting to\nGermany and only knew about its movement after the fact.\n\nhttp://www.cjnews.com/\n\n\n\n------------------------------\n\nMessage: 6\nDate: Wed, 13 Jun 2007 20:18:21 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Senate committee wants museum to change display casting\n\tCanadian vets as 'war criminals'\nTo: \nMessage-ID: <000901c7ade7$3adfe1f0$b09fa5d0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nSenate committee wants museum to change display casting Canadian vets as\n'war criminals'\n  \nJames Zombie \nCanWest News Service \n\n\nWednesday, June 13, 2007\n\n\nOTTAWA -A special Senate subcommittee is asking the Canadian War Museum to\nchange part of a controversial display some veterans have claimed makes them\nlook like \"war criminals.\"\n\nAt issue is a Second World War exhibit that contains a single panel\ndescribing an \"Enduring Controversy\" and raises moral issues over the role\nof Canadian bombing squadrons that attacked German cities in an attempt to\nwipe out the Nazi war machine.\n\nLiberal Senator Joseph Day, chair of the subcommittee on veterans affairs,\nsuggested the museum has a responsibility to recognize it has offended some\npeople, and should change the display. There were no suggestions as to how\nthe museum should go about doing that, even as the politicians raised no\nqualms about the accuracy of the facts and information presented.\n\n\"Don't try to change history. We're not into rewriting history,\" Day said.\nTell the story and tell the facts, but tell it in a way that you're not\noffending, unintentionally, a large segment of the Canadian public.\"\n\nThe facility's president, Victor Rabinovitch, wasn't available Tuesday and\nwasn't expected to offer any comment until there was time to further review\nthe senators' recommendation.\n\nThe display panel, accompanied by photos, including one of dead civilians on\nthe street following an allied bombing, notes the mass raids against Germany\nresulted in vast destruction and heavy loss of life.\n\n\"The value and morality of the strategic bomber offensive against Germany\nremains bitterly contested. Bomber Command's aim was to crush civilian\nmorale and force Germany to surrender by destroying its cities and\nindustrial installations,\" it says. \"Although Bomber Command and American\nattacks left 600,000 Germans dead, and more than five million homeless, the\nraids resulted in only small reductions of German war production until late\nin the war.\"\n\nDay said the subcommittee was troubled by the fact much of the exhibit was\ndedicated to the heroic activities of individual airmen and crews, \"and then\nyou get in an academic debate on the last panel, which calls into question\nall of these exploits of the individuals that were highlighted in the rest\nof the display.\"\n\nAsked whether he believed a museum was a place for academic debate, Day\nagreed it was.\n\n\"I think that's all part of the museum's responsibility,\" he said. \"It was\njust that the juxtaposition of various facts and pictures seemed to confuse\nthe two. I don't think it was intended, but that seems to be the case.\"\n\nComplaints from veterans about the tone of the panel first surfaced in 2005,\nsoon after the museum opened. Following threats of boycott from a coalition\nof veterans' groups, the facility undertook what it called the \"exceptional\nstep\" of seeking input from external, expert historians.\n\nFour of them filed reports the museum said agreed with the contention that\nthe display, in its entirety, presented an accurate view of the air war in\nEurope. Two raised concerns about the \"tone\" and \"balance\" of the one panel.\nThe museum said in March that it would not change the panel, adding its\ndecision was final.\n\nVeterans' groups renewed their call for a boycott and asked the Senate to\nintervene, resulting in Tuesday's report.\n\nOttawa Citizen\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 141\n****************************************\n\n"}