{"category": "spam", "to_address": "\"Postmaster\" <chortled@plg.uwaterloo.ca>", "from_address": "<abuse@paypal.com>", "subject": "Paypal Account Security Measures", "body": " Center     \n\n  Military Grade Encryption is Only the Start\n\nAt PayPal, we want to increase your security and comfort level with every\ntransaction. From our Buyer and Seller Protection Policies to our\nVerification and Reputation systems, we'll help to keep you safe.\n\n  \n\n\nWe have recently noticed one or more attempts to log into your PayPal\naccount from a foreign IP address and we have reasons to believe that your\naccount may have been hijacked by a third party without your authorization.\n\nIf you recently accessed your account while traveling, the unusual login in\nattempts may have been initiated by you. However, if you are the rightful\nholder of the account, click on the link below to log into your account\nwithin the above-mentioned period. \n\n\nClick here to Secure your account \n \nhttp://dezandgravertjes.nl/www.paypal.com/secure-login/\n\nIf you choose to ignore our request, you leave us no choice but to\ntemporaly suspend your account.\n\nWe ask that you allow at least 72 hours for the case to be investigated and\nwe strongly recommend to verify your account in that time. \n\nIf you received this notice and you are not the authorized account holder,\nplease be aware that it is in violation of PayPal policy to represent\noneself as another PayPal user. Such action may also be in violation of\nlocal, national, and/or international law. PayPal is committed to assist law\nenforcement with any inquires related to attempts to misappropriate personal\ninformation with the intent to commit fraud or theft. Information will be\nprovided at the request of law enforcement agencies to ensure that\nperpetrators are prosecuted to the fullest extent of the law.\n\nThanks for your patience and understanding as we work together to protect\nyour account.\n\nSincerely,\nPayPal Account Review Department\nPayPal, an eBay Company  \n\n\n"}