{"category": "ham", "to_address": "\"R. Leenders\" <suffenaam@yahoo.com>", "from_address": "\"Christophe Pallier\" <christophe@pallier.org>", "subject": "Re: [R] using self-written functions", "body": "One \"quick and dirty\" way is to put all your functions inside a file, say\n/home/me/R/myfuncs.R, and add  the following line at the beginning of your\nscripts:\n\nsource('/home/me/R/myfuncs.R')\n\nThis is dirty because if you need to change the location of this file, your\nscripts will cease to work.\nAlternatively, you can add this command to your Rprofile (see the Annex B of\nAn introduction to R \"Invoking R\")\n\nChristophe\n\n\n\n\nOn 6/28/07, R. Leenders  wrote:\n>\n> Hi, I am pretty new to R, so I apologize for the obvious question.\n> I\n> have worked with R for a few months now and in the process have written\n> several functions that I frequently use in various data analysis\n> projects. I tend to give each project a directory of its own and set\n> the working directory to that.\n> Since there are several tasks that\n> need to be accomplished in many of my projects, I frequently want to\n> use functions I have written previously. My question is, how do I get\n> access to them? The way I do it now is copy the relevant code to the\n> script file of the project I am working on at the time and then run it\n> so as to make the functions available. But that seems to be\n> unnecessarily cumbersome. I used to work a lot with gauss, which had\n> the opportunity of putting one's own functions is one directory and\n> gauss would then have that directory in its search path always. How can\n> I access my own functions in R without having to copy-paste them\n> everytime and run them manually so I can call them later? Do I need to\n> learn how to write a package and attach the package to make the\n> functions available at all times? Is there another way?\n>\n> thanks, James\n>\n>\n>\n>\n>\n>\n> ____________________________________________________________________________________\n>\n>\n>         [[alternative HTML version deleted]]\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide\n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n\n\n-- \nChristophe Pallier (http://www.pallier.org)\n\n\t[[alternative HTML version deleted]]\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}