{"category": "spam", "to_address": "kahlia@flax9.uwaterloo.ca", "from_address": "Registry Cleaner <RegistryCleaner@huwewillettenetworks.net>", "subject": "Windows Registry Cleaner Will Make Your Computer Run Like New ", "body": "\n\n\n\n\n\nImprove PC Performanct with Registry Cleaner 4!\n\n\n\n\n\n\nSoftwareOnline.com's Registry Cleaner 4\nFix Common, Nagging PC Problems with Ease !\nWith Registry Cleaner 4.0, you can easily identify and address errors in your Windows registry and get that \n\nfresh-booted feeling every time!\n\nDownload Now\n\n\nBenefits Include:\n\nDeep-scanning technology finds and fixes errors and clutter in 10 important parts of your registry.\nInstantly addresses problems which cause clunky, erratic PC performance and even application instability. \n\n\nWorry-Free* recovery of system changes with clear Backup and Undo functionality.\nPopular advanced user features allow you to select which part of the registry you wish to clean and \n\nimprove.\nAward-winning customer support.\nSatisfaction Guaranteed-If you are not 100% satisfied with your Registry \n        Cleaner, simply contact us within 30 days for a full refund.\n\n\nSoftwareOnline.com's Registry Cleaner 4 is fast, compact and powerful, offers one-Click* simplicity, and keeps \n\nyour computer running like new.\n\n Get \n\nClean!\n\nDownload Now\nFree* download 1.46MB\n \n\nI tried a number of registry cleaner type programs out there. Most seemed like scams that told me I had \"hundreds of critical \n\nerrors\", which is BS. This Registry Cleaner gave me a detailed list of what was wrong, with no hyperbole, and what it was \n\ngoing to do to fix it. Then it fixed it, no muss no fuss! I especially like that the Free* trial version will fix up to 20 \n\ndifferent errors without having to buy the software, that's a nice touch. My system starts up like lightning now, just like \n\nwhen I first installed Windows! \n- Steve Winter\n\n \n \n\nto be removed\n23316 NE Redmond Fall-City Road #667\nRedmond, WA 98053\n\n\n\n\n\n\nYou are subscribed to huwewillettenetworks.net with the email address kahlia@speedy.uwaterloo.ca.\nIf you wish to be excluded from future huwewillettenetworks.net mailings,\nplease click here\nor write us at:\n287 S. Robertson Blvd., Suite #407, Beverly Hills, CA 90211\n\n\n\n\n\n\n\n\n"}