{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Dustin Middleton <hugo@greenknights.net>", "subject": "Unbelievable prices!", "body": "\n\nDon't want to expose your private life? \nOur pharmacy\nMake your dreams come true with licensed medications from Online Pharmacy! Any pills of your choice. \nClick here to become a sex giant\nYour dick will yell!\nWith best regards,\nDustin Middleton\n \n \nKorotkie tolstye palcy pohudeli i vytianulis Pochti vtroe, mizinec slilsia s bezymiannym, nogti transformirovalis v ostrye Izognutye kogti, otsvechivaiushchie staliu. Protivnikov bylo dvoe. Ne bylo sil. S kakim naslazhdeniem ia by sejchas smyl s tela Dvuhdnevnuiu griaz, perekusil i vyspalsia po-chelovecheski. \nPodobnyh tipov mne eshche Ne prihodilos videt, da i slyshat o nih tozhe. Ia ved sam perezhil ne tak Davno nechto podobnoe. Prichem, nesmotria na to, Chto ia byl edinstvennym, kak ia togda polagal, kto voobshche pochtil sheltu svoim Prisutstviem. I nechego Razvodit rukami, prohvost, golovu otorvu i ne posmotriu, chto ty liubimchik Onni. Nesmotria na sovershenno beshenuiu skachku, Ushcherbnye gory priblizhalis tak Medlenno, chto kazalos, on ne skachet, a stoit na meste, a temnaia liniia Vertikalnogo razreza Mercaiushchej rasseliny byla ne tolshche niti, uporno ne zhelaia Uvelichivatsia. Potomu chto i dlia tebia, i dlia menia Vozvrashchenie v Gorod budet oznachat tolko odno smert. Da, no Kak togda on priruchil svoego Zlydnia? Ugu, vot togo samogo, chto sejchas kositsia na Nee, kak. Vozle Nego po-prezhnemu stoialo kreslo s telom pochivshego otshelnika, chia smert tak Rasstroila sestrichku Onni von, do sih por glaza na mokrom meste. \nKogda ia vytashchil ee obratno, na ladoni Okazalas gorst golubyh millimetrovyh kubikov. Tolko By zapah dal-roktu ne pomeshal, smerdit-to kak, nu tochno ryba plohaia byla. I Pust ia skeptik, no esli sledovat vsem Priznakam, to Spiashchij dolzhen byl prosnutsia. Inoj raz ia eshche udivliaius, chto oni do sih por ne perevelis i Umudriaiutsia vymahivat do takogo razmera, kak etot. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}