{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Lifestyle Newsletter May 10, 2007", "body": "\nhowstuffworks® | lifestyle May 10, 2007\nRSS\n   How Paparazzi Work \n The\nworldwide obsession with celebrities has spawned one of the most fascinating yet\nreviled by-products of pop culture -- paparazzi.\nAs our culture's voracious hunger for celebrity snapshots grows, so do the\nprices of these photos and the risks paparazzi take to get them. Take a look\ninside the world of paparazzi.\nAlso at HowStuffWorks\n \n\nHow the\nPapacy Works - More than\none billion Catholics worldwide look to the pope for spiritual leadership.\nLearn how a pope gets elected, about the pope's duties and how far his\nauthority extends.\n \n \n\nHow\nSamurai Work - The\nlegend of the samurai continues to permeate our culture, with countless movies\nand TV shows dedicated to the subject. How much of what we know about the\nsamurai is truth, and how much is myth? Find out about the strict warrior code\nof the samurai, the honor system that shaped their lives, the weapons and armor\nthey used and more.\n \n \n \nHow the ACLU Works - The ACLU is the nation's premier defender of civil liberties, operating for more than 80 years. Learn about the ACLU's history, its controversial cases, the organization's structure and its opponents. \n   This Week's Video\n\nIt's\nevery kid's dream -- a trip to see all of the amazing animals in the zoo. Go\nbehind the scenes at the North\n  Carolina Zoological Park in this video from HowStuffWorks.  This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks \n3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please unsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved "}