{"category": "ham", "to_address": "avcooper@speedy.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 4/26/07 - Dow 13,000 - Perception Trumps Everything", "body": "April 26, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\nFeaturing Lutts' Logic:\n\nBuy Solar Stocks\n\nSell Whole Foods\n\nMind The Gap\n\n-----\n\nSo the Dow topped 13,000 yesterday.  What does that mean?  Nothing.   \n\nAnd everything.  The Dow Industrial Average is not real; it's not even the\naverage price of 30 stocks; when was the last time you saw a stock priced\nat $13,000 per share?  No, the Dow is just an artificial construct, and I\nsay the less attention paid to it the better.\n\nBut old habits die hard, and people have been referring to the Dow since\nCharles Dow created the Index back in 1896.  Also it's a nice short word\nwe can all say . . . even if we don't know what it stands for.\n\nSo, because of the fact that people watch it, and because all media\ntrumpeted the Index's breaking up through the 13,000 ceiling yesterday,\nthe Index matters a lot.  Not because it matters, but because investors\nthink it matters.  Got it?\n\nIt's all about perception.\n\nPerception is a word we use often in our office.  And it's a word I used a\nlot last night, when I spoke to the Boston Investors' Business Daily\nGroup.\n\nIt was a great group, but I went with the impression that I'd find a group\nof people who were attuned to the methods of Investors' Business Daily,\nmethods that center on growth of revenues and earnings, and strength of\nprice movements.  But I was wrong.  What I found was a diverse group of\ninvestors.  They were all intelligent and interested and ready to learn,\nand thus a great audience, but many of them were mired - to use a strong\nword - in the world of fundamentals.\n\nSo I spent a lot of time dwelling on the fact that it's changes in\nperceptions that make stocks move.  It's not earnings announcements by\nthemselves, and it's not news about new products or new markets.   \n\nIt's changing perceptions.  And these perceptions are all reflected - to\nthose investors who can interpret them - in the charts!\n\n-----\n\nChanges in perceptions, in fact, are a big reason for the strength in\nsolar power stocks today.\n\nFirst, these stocks are young.  They're not household names yet, and\nthey're certainly not in many institutional (mutual funds, pension funds,\netc.) portfolios yet.  But day after day, more and more investors, both\nindividual and professional, are waking up to the fact that these stocks\nexist, and that these companies are growing fast, and thus their\nperceptions of the group improve . . . from ignorance to interest.\n\nAnd when people get interested enough, they buy.  Now, no one loves these\nstocks yet; no one's known them long enough to fall in love.   \n\nBut some investors are on their way there.  And there is no selling\npressure yet!  Sure, there are little profit-taking episodes from\nshort-term speculators, but basically all the news about these companies\nis good, so there's no reason for perceptions to worsen.   \n\nThe main force driving these stocks is simply increased visibility of\ntheir presence, and the growth of revenues and earnings in the companies\nbehind the stocks.\n\nAnd what growth it is!  These companies are growing so fast - almost all\nare growing revenues and earnings at rates of 100% or better - that\nperception has a hard time keeping up with the reality.\n\nThese stocks are also hot because of the growing perception by the public\nthat global warming is real, and the growing perception that more\nlegislation will \"encourage\" us to burn fewer fossil fuels and to adopt\nmore green alternatives in the years and decades ahead.\n\nI've written about this before, and got some flack about global warming\nnot being real, and I want to point out that what I believe about global\nwarming doesn't matter, and what you believe doesn't matter.\n\nWhat matters is that investors as a whole increasingly believe that global\nwarming is real, and that governments will take action, and those changing\nperceptions create investing opportunities in the alternative energy\nindustry today.\n\n-----\n\nEditor's Note\n\nWe've recently completed a report on the solar power industry, detailing\nthe major investment plays in the industry.  Interestingly, half are\nChinese companies, and half are located in the U.S.  It's a great primer\nfor investors looking to enter the sector, and you can get your copy by\ntaking a no-risk trial subscription to Cabot Market Letter.  To get\nstarted, simply click the link below.\n\nhttp://cabotmail.net/t/167010/13148861/78/0/\n\n-----\n\nBack on the subject of perception, I want to talk about what happens when\nyou fall in love with a stock.  It's the same thing that happens when you\nfall in love with a person; your vision gets a little cloudy.\n\nFor example, after the meeting last night, as I was leaving the room, a\nwoman approached and asked what she should do with her Whole Foods (WFMI)\nstock.  She said she had held it on the way up, making a nice profit, but\nthen had held on the way down, too, and watched most of her profit\ndisappear.  She assured me, however, that she didn't yet have a loss, as\nif that rationalized the whole process.\n\nMy response?  Without hesitating, I told her to sell.  And then I\nexplained why.\n\nWhole Foods was once a great stock.  From its IPO in 1992 to its 2005 top,\nit grew more than 2,500%.  Along the way it became a great, well-loved\ncompany, the world's #1 organic grocer.  It certainly sells things that\nshoppers feel good about.  I know I feel good when my wife brings home\nfresh sushi from Whole Foods for my lunch!  But the problem is that after\nthirteen years of terrific growth, Whole Foods reached the point of peak\nperception, the point when every investor involved felt good about the\ncompany . . . and owned it.  And when there was no one left to discover it\nand buy it - when perception of the company could increase no more - it\nwas at risk of going down\n\nAt that point, which came in December 2005, the stock had a PE ratio of\n65, even though the earnings growth rate had never got higher than 33% in\nrecent years.  So when business got just a little difficult, investors\nbegan selling.  And they've been selling for the past sixteen months,\ndriving the stock down from 80 to a recent low of 42.\n\nWhole Foods is not in trouble; it's still a great place to shop.  But the\ncompany is finding it hard to maintain its previous growth rate; revenue\ngrowth has slowed from 20% back then to 12% in the latest quarter.  And\nearnings?  While they were growing at an average rate of 23% in the\nprevious three quarters, in the latest quarter they fell by 5%!  Most\ntelling of all is the fact that profit margins slipped to 2.9%, for the\nlowest margin in the previous 4 years!\n\nAt the same time those earnings were released, the company announced that\nit would buy the country's #2 natural foods retailer, Wild Oats, for $565\nmillion, and that news helped the stock a bit.  But there's no way this is\ngoing to make it easier for the company to increase margins!\n\nIt's all about changing perceptions.  Whole Foods was once a golden\ncompany that could do no wrong.  Now it's disappointed shareholders.   \nIt's created losers where once it had only winners.  Many of those\ninvestors will now become sellers, as they ever so slowly change their\nopinions and give up on the stock.\n\nBut that takes time, especially when you're a happy customer of the\ncompany!  So the stock may well rally, but its progress will be impeded by\nthe selling of shareholders looking to \"get out even.\"\n\nBottom line.  Don't fall in love with stocks.  Don't confuse the company\nwith the stock.  Respect the force of mass changes in investor perception.\n And sell when a trend turns down.\n\n-----ADVERTISEMENT -----\n\nIntroducing Cabot Stock of the Month\n\nA revolutionary investment advisory that brings you Wall Street's top\nopportunity on a monthly basis, directly from the editors of Cabot\nMarket Letter, Cabot Top Ten Report, Cabot China & Emerging Markets\nReport, and Cabot Benjamin Graham Value Letter.\n\nTry It Risk Free for the Next 12 Months - Grow 50% or Pay Nothing!\n\nTo learn more, please visit this link:\n\nhttp://cabotmail.net/t/167010/13148861/86/0/\n\n-----\n\nAnd now, back to the market for a final comment.  Over in London, you'll\nsee signs where the subway (Tube) platform meets the trains, saying, \"Mind\nthe Gap.\"  The gap is normally narrow, but in stations where the track\ncurves, it could theoretically swallow a small body, and the authorities\nwould prefer to avoid that.  Thus the warnings.\n\nToday, I want you to mind the gaps in Dow stocks . . . in a good way. \nLook at Alcoa (AA), America Express (AXP), Citigroup (C), Caterpillar\n(CAT), Coca Cola (KO), Honeywell (HON), International Business Machines\n(IBM), JP Morgan Chase (JPM), Johnson & Johnson (JNJ) and Merck (MRK). \nEvery one of these stocks (that's one-third of the Dow Industrials!) has\ngapped higher in recent days, usually on earnings.  This is strong stuff,\nindicative of big changes in perception by big institutions, and in my\nopinion, it's the closest you'll get to a guaranteed notice that the\nmarket will be climbing higher in the weeks and months ahead.\n\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n-----\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=167010&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}