{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Jason Spiro\" <jasonspiro4@gmail.com>", "subject": "Please vet this modified CC license for uploading FoF music to non-free (was: Re: Could you please forward this proposed license to Teosto?)", "body": "On 5/15/07, Matthew Johnson  wrote:\n...\n> How about:\n>\n>  http://creativecommons.org/licenses/by-nd-nc/1.0/legalcode with 4. d.\n>  added saying:\n>\n>    You may not publicly display, publicly perform, or publicly digitally\n>    perform the Work except as part of the game and you may not\n>    distribute the Work except with the intention of it being used with\n>    the Game.\n>\n>  and 1. g.:\n>\n>    \"The Game\" means the game Frets on Fire or a derivative work of\n>    Frets on Fire.\n\n\nDear debian-legal,\n\nThe license is below.  Is it good enough for Tommi Inkila's FoF music\nto be uploaded to non-free?\n\n\n== How it was made ==\n\nTommi mailed me privately, and told me he and his teammates\nwould prefer that the license allow use of the music in FoF only, not\nin derivatives.  I tried to convince him why allowing forking is good,\nand he understands, but he still prefers to keep it this way for now.\nSo I think we should try to get the upstream music in Debian as-is for\nnow instead of bothering upstream more.  If someone wants to fork FoF\nand use the upstream music, they should take it up with upstream\nthemselves.\n\nSo, I took http://creativecommons.org/licenses/by-nd-nc/1.0/legalcode\nand made some changes.  For example, I changed \"Creative Commons Legal\nCode\" to \"Restricted Media Legal Code\".  I didn't use the name \"Frets\non Fire\" there since I don't want people to think the license applies\nto the whole game.  It is only for Tommi Inkila's music.  As another\nexample, I removed the trademark-related text.  I hereby release the\nnew license text to the public domain.  A diff of the original and new\nlicenses, and a paste of the new license in its entirety, follow.\n\nAnd so I ask you, dear debian-legal: Is the new license good enough\nfor Tommi Inkila's FoF music to be uploaded to non-free?  If it's OK,\nthen we can kindly ask upstream to look over it themselves then send\nit to Teosto for approval.\n\nRegards,\nJason\n\n\n== Diff of original and new ==\n\ndiff -ruN /home/j/overwrite_usb_with_these/cc-by-nd-nc-license.txt\n/home/j/overwrite_usb_with_these/rm-by-nd-nc-ffo-license.txt\n--- /home/j/overwrite_usb_with_these/cc-by-nd-nc-license.txt\t2007-05-22\n15:03:09.000000000 -0400\n+++ /home/j/overwrite_usb_with_these/rm-by-nd-nc-ffo-license.txt\t2007-05-22\n15:16:27.000000000 -0400\n@@ -1,19 +1,19 @@\n-                      Creative Commons\n\n-                  Creative Commons Legal Code\n+                  Restricted Media Legal Code\n\n-             Attribution-NoDerivs-NonCommercial 1.0\n-CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE\n+       Attribution-NoDerivs-NonCommercial-ForFretsOnly 1.0\n+\n+THE AUTHORS OF THIS LICENSE ARE NOT LAWYERS AND DO NOT PROVIDE\n LEGAL SERVICES. DISTRIBUTION OF THIS DRAFT LICENSE DOES NOT CREATE AN\n-ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\n-INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES\n-REGARDING THE INFORMATION PROVIDED, AND DISCLAIMS LIABILITY FOR\n+ATTORNEY-CLIENT RELATIONSHIP. THE AUTHORS PROVIDE THIS\n+INFORMATION ON AN \"AS-IS\" BASIS. THE AUTHORS MAKE NO WARRANTIES\n+REGARDING THE INFORMATION PROVIDED, AND DISCLAIM LIABILITY FOR\n DAMAGES RESULTING FROM ITS USE.\n\n License\n\n THE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS\n-CREATIVE COMMONS PUBLIC LICENSE (\"CCPL\" OR \"LICENSE\"). THE WORK IS\n+RESTRICTED MEDIA PUBLIC LICENSE (\"RMPL\" OR \"LICENSE\"). THE WORK IS\n PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE\n WORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE IS PROHIBITED.\n\n@@ -49,6 +49,7 @@\n     with respect to the Work, or who has received express permission\n     from the Licensor to exercise rights under this License despite a\n     previous violation.\n+ g. \"The Game\" means the game Frets on Fire.\n\n 2. Fair Use Rights. Nothing in this license is intended to reduce,\n limit, or restrict any rights arising from fair use, first sale or\n@@ -115,6 +116,10 @@\n     will appear where any other comparable authorship credit appears\n     and in a manner at least as prominent as such other comparable\n     authorship credit.\n+ d. You may not publicly display, publicly perform, or publicly\n+    digitally perform the Work except as part of the Game and you may\n+    not distribute the Work except with the intention of it being used\n+    with the Game.\n\n 5. Representations, Warranties and Disclaimer\n  a. By offering the Work for public release under this License,\n@@ -184,21 +189,11 @@\n     You. This License may not be modified without the mutual written\n     agreement of the Licensor and You.\n\n-Creative Commons is not a party to this License, and makes no warranty\n-whatsoever in connection with the Work. Creative Commons will not be\n+The authors of this License are not party to this License, and make no warranty\n+whatsoever in connection with the Work. The authors of this License will not be\n liable to You or any party on any legal theory for any damages\n whatsoever, including without limitation any general, special,\n incidental or consequential damages arising in connection to this\n-license. Notwithstanding the foregoing two (2) sentences, if Creative\n-Commons has expressly identified itself as the Licensor hereunder, it\n-shall have all rights and obligations of Licensor.\n-\n-Except for the limited purpose of indicating to the public that the\n-Work is licensed under the CCPL, neither party will use the trademark\n-\"Creative Commons\" or any related trademark or logo of Creative\n-Commons without the prior written consent of Creative Commons. Any\n-permitted use will be in compliance with Creative Commons'\n-then-current trademark usage guidelines, as may be published on its\n-website or otherwise made available upon request from time to time.\n-\n-Creative Commons may be contacted at http://creativecommons.org/.\n+License. Notwithstanding the foregoing two (2) sentences, if the authors\n+of this License have expressly identified themselves as the Licensor\n+hereunder, they shall have all rights and obligations of Licensor.\n\n\n== The new license ==\n\n                  Restricted Media Legal Code\n\n       Attribution-NoDerivs-NonCommercial-ForFretsOnly 1.0\n\nTHE AUTHORS OF THIS LICENSE ARE NOT LAWYERS AND DO NOT PROVIDE\nLEGAL SERVICES. DISTRIBUTION OF THIS DRAFT LICENSE DOES NOT CREATE AN\nATTORNEY-CLIENT RELATIONSHIP. THE AUTHORS PROVIDE THIS\nINFORMATION ON AN \"AS-IS\" BASIS. THE AUTHORS MAKE NO WARRANTIES\nREGARDING THE INFORMATION PROVIDED, AND DISCLAIM LIABILITY FOR\nDAMAGES RESULTING FROM ITS USE.\n\nLicense\n\nTHE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS\nRESTRICTED MEDIA PUBLIC LICENSE (\"RMPL\" OR \"LICENSE\"). THE WORK IS\nPROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE\nWORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE IS PROHIBITED.\n\nBY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND\nAGREE TO BE BOUND BY THE TERMS OF THIS LICENSE. THE LICENSOR GRANTS\nYOU THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF\nSUCH TERMS AND CONDITIONS.\n\n1. Definitions\n a. \"Collective Work\" means a work, such as a periodical issue,\n    anthology or encyclopedia, in which the Work in its entirety in\n    unmodified form, along with a number of other contributions,\n    constituting separate and independent works in themselves, are\n    assembled into a collective whole. A work that constitutes a\n    Collective Work will not be considered a Derivative Work (as\n    defined below) for the purposes of this License.\n b. \"Derivative Work\" means a work based upon the Work or upon the\n    Work and other pre-existing works, such as a translation, musical\n    arrangement, dramatization, fictionalization, motion picture\n    version, sound recording, art reproduction, abridgment,\n    condensation, or any other form in which the Work may be recast,\n    transformed, or adapted, except that a work that constitutes a\n    Collective Work will not be considered a Derivative Work for the\n    purpose of this License.\n c. \"Licensor\" means the individual or entity that offers the Work\n    under the terms of this License.\n d. \"Original Author\" means the individual or entity who created the\n    Work.\n e. \"Work\" means the copyrightable work of authorship offered under\n    the terms of this License.\n f. \"You\" means an individual or entity exercising rights under this\n    License who has not previously violated the terms of this License\n    with respect to the Work, or who has received express permission\n    from the Licensor to exercise rights under this License despite a\n    previous violation.\n g. \"The Game\" means the game Frets on Fire.\n\n2. Fair Use Rights. Nothing in this license is intended to reduce,\nlimit, or restrict any rights arising from fair use, first sale or\nother limitations on the exclusive rights of the copyright owner under\ncopyright law or other applicable laws.\n\n3. License Grant. Subject to the terms and conditions of this License,\nLicensor hereby grants You a worldwide, royalty-free, non-exclusive,\nperpetual (for the duration of the applicable copyright) license to\nexercise the rights in the Work as stated below:\n a. to reproduce the Work, to incorporate the Work into one or more\n    Collective Works, and to reproduce the Work as incorporated in the\n    Collective Works;\n b. to distribute copies or phonorecords of, display publicly, perform\n    publicly, and perform publicly by means of a digital audio\n    transmission the Work including as incorporated in Collective\n    Works;\n\nThe above rights may be exercised in all media and formats whether now\nknown or hereafter devised. The above rights include the right to make\nsuch modifications as are technically necessary to exercise the rights\nin other media and formats. All rights not expressly granted by\nLicensor are hereby reserved.\n\n4. Restrictions. The license granted in Section 3 above is expressly\nmade subject to and limited by the following restrictions:\n a. You may distribute, publicly display, publicly perform, or\n    publicly digitally perform the Work only under the terms of this\n    License, and You must include a copy of, or the Uniform Resource\n    Identifier for, this License with every copy or phonorecord of the\n    Work You distribute, publicly display, publicly perform, or\n    publicly digitally perform. You may not offer or impose any terms\n    on the Work that alter or restrict the terms of this License or\n    the recipients' exercise of the rights granted hereunder. You may\n    not sublicense the Work. You must keep intact all notices that\n    refer to this License and to the disclaimer of warranties. You may\n    not distribute, publicly display, publicly perform, or publicly\n    digitally perform the Work with any technological measures that\n    control access or use of the Work in a manner inconsistent with\n    the terms of this License Agreement. The above applies to the Work\n    as incorporated in a Collective Work, but this does not require\n    the Collective Work apart from the Work itself to be made subject\n    to the terms of this License. If You create a Collective Work,\n    upon notice from any Licensor You must, to the extent practicable,\n    remove from the Collective Work any reference to such Licensor or\n    the Original Author, as requested.\n b. You may not exercise any of the rights granted to You in Section 3\n    above in any manner that is primarily intended for or directed\n    toward commercial advantage or private monetary compensation. The\n    exchange of the Work for other copyrighted works by means of\n    digital file-sharing or otherwise shall not be considered to be\n    intended for or directed toward commercial advantage or private\n    monetary compensation, provided there is no payment of any\n    monetary compensation in connection with the exchange of\n    copyrighted works.\n c. If you distribute, publicly display, publicly perform, or publicly\n    digitally perform the Work or any Collective Works, You must keep\n    intact all copyright notices for the Work and give the Original\n    Author credit reasonable to the medium or means You are utilizing\n    by conveying the name (or pseudonym if applicable) of the Original\n    Author if supplied; the title of the Work if supplied. Such credit\n    may be implemented in any reasonable manner; provided, however,\n    that in the case of a Collective Work, at a minimum such credit\n    will appear where any other comparable authorship credit appears\n    and in a manner at least as prominent as such other comparable\n    authorship credit.\n d. You may not publicly display, publicly perform, or publicly\n    digitally perform the Work except as part of the Game and you may\n    not distribute the Work except with the intention of it being used\n    with the Game.\n\n5. Representations, Warranties and Disclaimer\n a. By offering the Work for public release under this License,\n    Licensor represents and warrants that, to the best of Licensor's\n    knowledge after reasonable inquiry:\n      i. Licensor has secured all rights in the Work necessary to\n         grant the license rights hereunder and to permit the lawful\n         exercise of the rights granted hereunder without You having\n         any obligation to pay any royalties, compulsory license fees,\n         residuals or any other payments;\n     ii. The Work does not infringe the copyright, trademark,\n         publicity rights, common law rights or any other right of any\n         third party or constitute defamation, invasion of privacy or\n         other tortious injury to any third party.\n b. EXCEPT AS EXPRESSLY STATED IN THIS LICENSE OR OTHERWISE AGREED IN\n    WRITING OR REQUIRED BY APPLICABLE LAW, THE WORK IS LICENSED ON AN\n    \"AS IS\" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR\n    IMPLIED INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES REGARDING\n    THE CONTENTS OR ACCURACY OF THE WORK.\n\n6. Limitation on Liability. EXCEPT TO THE EXTENT REQUIRED BY\nAPPLICABLE LAW, AND EXCEPT FOR DAMAGES ARISING FROM LIABILITY TO A\nTHIRD PARTY RESULTING FROM BREACH OF THE WARRANTIES IN SECTION 5, IN\nNO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY LEGAL THEORY FOR ANY\nSPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR EXEMPLARY DAMAGES\nARISING OUT OF THIS LICENSE OR THE USE OF THE WORK, EVEN IF LICENSOR\nHAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n7. Termination\n a. This License and the rights granted hereunder will terminate\n    automatically upon any breach by You of the terms of this License.\n    Individuals or entities who have received Collective Works from\n    You under this License, however, will not have their licenses\n    terminated provided such individuals or entities remain in full\n    compliance with those licenses. Sections 1, 2, 5, 6, 7, and 8 will\n    survive any termination of this License.\n b. Subject to the above terms and conditions, the license granted\n    here is perpetual (for the duration of the applicable copyright in\n    the Work). Notwithstanding the above, Licensor reserves the right\n    to release the Work under different license terms or to stop\n    distributing the Work at any time; provided, however that any such\n    election will not serve to withdraw this License (or any other\n    license that has been, or is required to be, granted under the\n    terms of this License), and this License will continue in full\n    force and effect unless terminated as stated above.\n\n8. Miscellaneous\n a. Each time You distribute or publicly digitally perform the Work or\n    a Collective Work, the Licensor offers to the recipient a license\n    to the Work on the same terms and conditions as the license\n    granted to You under this License.\n b. If any provision of this License is invalid or unenforceable under\n    applicable law, it shall not affect the validity or enforceability\n    of the remainder of the terms of this License, and without further\n    action by the parties to this agreement, such provision shall be\n    reformed to the minimum extent necessary to make such provision\n    valid and enforceable.\n c. No term or provision of this License shall be deemed waived and no\n    breach consented to unless such waiver or consent shall be in\n    writing and signed by the party to be charged with such waiver or\n    consent.\n d. This License constitutes the entire agreement between the parties\n    with respect to the Work licensed here. There are no\n    understandings, agreements or representations with respect to the\n    Work not specified here. Licensor shall not be bound by any\n    additional provisions that may appear in any communication from\n    You. This License may not be modified without the mutual written\n    agreement of the Licensor and You.\n\nThe authors of this License are not party to this License, and make no warranty\nwhatsoever in connection with the Work. The authors of this License will not be\nliable to You or any party on any legal theory for any damages\nwhatsoever, including without limitation any general, special,\nincidental or consequential damages arising in connection to this\nLicense. Notwithstanding the foregoing two (2) sentences, if the authors\nof this License have expressly identified themselves as the Licensor\nhereunder, they shall have all rights and obligations of Licensor.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}