{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "\"Rochelle and Bethea\" <rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, here's your forecast for July 2nd - July 8th", "body": "\n\n\n\n\n\n\n\n\nMemo, to ensure that your weekly forecasts are delivered correctly to your inbox, please add our email address Rochelle@myhealthwealthandhappiness.com to your address book.\n \n\nLast Quarter Moon, July 7, 12:55 PM EST\n\n\n\n\n\n\n               \n\n\n\n\nDear Memo,\n\n    \"Sit up straight!\" – There, does that call up old memories of slouching in a chair when you were a kid and an adult telling you that?  I know it does for me.  I was thinking about that just the other day, after I had spent what felt like hours on the computer.  I decided to take a break, because my muscles felt tense and my neck was stiff.  That's when I realized that I had been sitting all hunched in, with my head jutting forward.  And I heard that voice from childhood saying, \"sit up straight!\"\n    It's just too bad that, once we are adults, we usually don't have someone reminding us to \"sit up straight,\" because good posture is so important.  Memo, you've probably heard that old saying that correct posture can instantly make you look ten pounds lighter.  Well, it's true!  And when you are sitting or standing straight your body language conveys confidence and a sense of self-esteem to others.\n    But your posture also affects your health, as well.  Poor posture can actually create fatigue, because it causes muscles, ligaments and joints to work harder.  Not to mention the strain on bones, joints and organs because of unnecessary pressure.  For example, I've read that looking down at a 45-degree angle instead of holding your head upright uses five times more energy.  And the strain on your muscles decreases the flow of blood and oxygen to the brain by as much as 30 percent.\n    A good way to check out your posture is to stand with your back to a wall.  If your shoulders, bottom, and back of your head are touching the wall, your posture is correct.  If they're not, move around so that they are, and check how that feels.  Another quick way is to take a big deep breath in, being sure to expand and lift your chest up.  When you do this, your head automatically will straighten up and move back, your shoulders will move down and back, giving you the correct posture.\n    So, Memo, the next time you are feeling muscle fatigue or strain, take a deep breath and \"sit up straight\"!\n\n                        Until next week,                            \nP.S. Don’t forget to add Rochelle@myhealthwealthandhappiness.com to your address book.  We want to make sure that you receive your weekly forecasts on time.\n\n\n\n\n                      \n\n\n\n\n\n\n\n                 \n\n\n    Keep in mind that Mercury is still reversing through Cancer and communications will still be a little confused.  Cancer is an emotional sign, so everyone will be approaching conversations from a very personal perspective – try not to take anything upsetting to heart, Memo, as it isn't meant that way.  Money planet Venus connects with slippery Neptune on the 3rd and also with security-conscious Saturn.  The lottery may be very tempting to you on Monday, but you certainly won't want to gamble any of your precious winnings on Tuesday!\n\n\n\n\n\nMemo             July 2 - July 8             \n\n\n\n\n \n\n\n\n    Memo, I want you to take maximum advantage of the luck coming your way this week. From my calculations, Tuesday is going to be your lucky day for this period.  And your Lucky Numbers are 04, 09, 19, 18, 33, 40.  I hope you'll make the best of them.\n\n\n\n\n\n\n\n\n\n\n\nJuly 2nd for Memo\n\n\n\n\n\n\n\n\n\n    As you move through your day today, you are apt to be inspired by the folks you meet and the things that they share with you.  Even with a lot of chores to attend to, life can be interesting.\n\n\n\n\n\n\n\n    This is a good time for dealing with minor health irritations.  Ask questions and don't be afraid to get second opinions.  When performing your daily duties, ask for help when you are overworked.\n\n\n\n\n\n\n\n\n\n\n\nJuly 3rd for Memo\n \n \n \n \n \n\n \n \n    It can be a good time to make needed changes in a close relationship to make it feel more alive and satisfying to you.  Freely express what's on your mind and clear the air.\n\n\n  \n \n \n    Kindness and consideration, especially in family or close personal relationships, will gain you the most cooperation today.  Public relations will require tact, diplomacy and effort.\n\n \n \n \n  \n\n\n\n\n\n\n\n\nJuly 4th for Memo\n\n \n \n \n\n\n \n \n    You are apt to feel drawn to someone who is charming, graceful, intelligent, witty, and most of all, unique.  Folks who think alike aren't likely to hold any fascination for you right now.\n\n\n \n\n \n \n    You will be motivated to deal with partnership interests through communications, letter writing and negotiation procedures.  You have great insight today and can make a positive difference.\n\n \n \n \n \n\n\n\n\n    Products and services that cater to your domestic needs will be a good place to invest your partnership funds today, my friend.  Daydreaming and romance may be on your mind today.   \n\n\n\n\n\n\n\n\n\nJuly 5th for Memo\n  \n \n\n\n\n \n \n    Share a story of your spirit with someone who seems in need of a bit of nurturing today, my dear.  You can really uplift someone who seems trapped in a bit too much fog right now.\n\n\n \n\n \n \n    Nothing will make you happier today than expressing your benevolence to those in need. Be companionable to someone who is lonely, or just serenely enjoy your everyday duties and tasks.\n\n \n\n \n  \n\n \n \n\n\n    Keep an open mind toward ideas that seem unusual at first.  It could turn out that these concepts have a very practical use in your own life.  Be willing to experiment, my friend.\n  \n\n\n\n\n\n\n\n\nJuly 6th for Memo\n  \n \n \n\n\n \n \n    Opening yourself to learning can change your life.  Your spirit can be totally renewed by the power of an important self-help book.  Go to the library and see what resonates with you today.\n\n\n \n\n\n \n \n    Your mind is apt to be ignited and ready for anything right now.  You are always sharp and usually prepared for information, but today you are likely to receive a wagon-full.  Get out your notebook.\n\n \n\n\n \n\n\n\n\n\n    Trying to get attention from others may be frustrating now.  It may be better if you don't crave it for a while.  Better that you be the one to pay attention to others at this time.    \n\n \n \n\n\n    If you feel that your current state of emotions or perception are preventing you from making a reasonable decision, why not ask for help?  If you are willing to make changes, you will accomplish much.\n  \n\n\n\n\n\n\n\n\nJuly 7th for Memo\n  \n \n \n \n\n \n \n    My dear, today is a great day to spend with a feisty neighbor who might be interested in taking a day trip somewhere not too far from town.  There's so much to see in this world, even close to home.\n\n\n \n \n\n \n \n    Warn your family members, and do it soon: You're about to say what's on your mind, in dramatic, theatrical style.  Speak your mind, but also remember to be diplomatic.\n\n \n\n\n \n \n\n \n \n\n\n    You are capable of creative, intellectual activity today.  Also, you may find yourself compelled to share with others the knowledge you have gained through your study.  Don't be shy.\n \n \n\n\n\n\n\n\n\nJuly 8th for Memo\n \n \n \n \n \n \n \n    Your mind is apt to be in the mood for expansion today, and you can find yourself wanting to read new books or study foreign cultures right now.  Why not take a trip to the local library?\n\n\n  \n\n \n \n    Success can be your middle name today.  People are apt to look up to you because your attitude is so positive, and that's all it takes to make whatever you want in the world yours.\n\n\n  \n\n \n \n    A sudden trip is possible now, my friend, or you could entertain surprise visitors who have traveled from a distance.  Don't be surprised to find yourself in a discussion about life in general.\n\n \n\n\n \n \n\n\n\n\n\n\n    Institutions of higher education can now provide a backdrop for some pleasant interactions with a wide variety of scholarly types.  You may decide to take up cultural studies or look into travel possibilities.\n \n \n\n \n \n\n\n    Your intuition may be exceptionally on the mark now, so trust it to lead you to places and ideas that you learn from.  It should also keep you out of harm's way.   \n\n \n \n\n\n    This is an excellent day for looking into future travel possibilities or sitting down with loved ones and planning a family trip.  Your ideas are practical and public relations is a snap today, my friend.\n \n\n\n\n\n\n\n\n    You'll get the go-ahead for next week, Memo, when Mercury finally goes direct, so start planning now!\n\n                       Best Regards, \n                        \n\n\n\n\n\n    If at any time you no longer wish to receive your weekly forecast, you can simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400, and I will stop emailing them to you. It's as simple as that. My only desire is to help you, Memo.\n\n"}