{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Adam Borowski <kilobyte@angband.pl>", "subject": "Re: Request for suggestions of DFSG-free documentation licences", "body": "On Sun, May 27, 2007 at 10:15:06AM +1000, Ben Finney wrote:\n> The document author, by placing only *some* parts of the work under\n> the GPL, is essentially determining for the recipient what parts they\n> will find useful to combine with other parts of the software. Prose\n> descriptive parts could be combined into the data, for instance; if\n> the license does not allow this, an essential freedom is denied.\n> \n> On the other hand, if the author acknowledges that *any* part of the\n> work could be useful for some recipient to combine with other parts of\n> the work, *even if the author can't conceive of it initially*, then\n> the logical thing to do is to license all parts of the work under the\n> same terms.\n> \n> Further, when parts of a work licensed under GPL are combined into the\n> FDL-licensed work, the result is *not redistributable at all*, because\n> the GPL says the resulting work must be entirely licensed under GPL,\n> which conflicts with the FDL work's license terms.\n\nThere are no real solutions except:\n* boycotting one of the licenses (easy to tell which one) whenever you have\n  the chance to do so (ie, mostly as upstream)\n* bashing the FSF until they merge GPL and GFDL\n\nOf course, as a maintainer you usually can't do anything but complain, or\nlook the other way at contamination incidents.  Which are quite common --\neven \"foo --help\" is likely to be one.  And looking the other way, while\npopular, can't be called the most sound advice...\n\n-- \n1KB\t\t// Microsoft corollary to Hanlon's razor:\n\t\t//\tNever attribute to stupidity what can be\n\t\t//\tadequately explained by malice.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}