{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "\"Lower_Cholesterol\" <Lower_Cholesterol@rickbossetty.com>", "subject": "Drop your Cholesterol count in 30 Days -- or we send you $100 -- win either way!", "body": "\n\n\nYour cholesterol will go down, or we will pay you $100\n\n\n\n\n\n\nYOUR CHOLESTEROL GOES DOWN IN 30 DAYS, OR WE \n         SEND YOU $100.\n\nDear Health Conscience Friend,\n\n If your doctor has ever spoken to you about cholesterol, \n you will probably relate to this disturbing but true story.\n \n A well educated, well intentioned doctor has a \n patient who is in good physical shape, but her cholesterol is \n higher than it should be.  He prescribes a common statin medication such as Lipitor, Zocor or Crestor.\n  \n \n The patient tells the doctor she has heard about certain problems with these drugs.\n He acknowledges that they have common minor side effects and \n uncommon serious side affects.  But he does not even seem to think this should \n be an issue. The patient understandably has no desire to submit her body to unneeded potential problems.  The doctor doesn't really listen to anything \n she says.  His mind was made up before she walked in the door.  \n \n What is most sad about this very real scenario is that there is a completely \n natural substance that cuts the body's absorption of \n cholesterol by up to 42%.  \n \n The American Medical \n Association, American Heart Association \n and the NIH all recommend its usage.  \n But unless you search for it, you would never know.  \n Find out more for yourself.\n \n The Pharmaceutical Industry on the other hand spends endless amounts of money \n influencing doctors, the government and the general public.  It is not disputed that cholesterol medications \n have saved countless lives.  But it is also not disputed that this natural cholesterol discovery cuts cholesterol absorption \n with absolutely no side affects.  \n \n That is why we are willing to\n send you $100 if it doesn't work for you.  We know it works.  There are no catches.  We send out $100 gift\n certificates every month for the rare person that is not benefitied by it. \nFrankly, it is irresponsible for doctors not to try the natural supplement \n that has been proven to cut your body's absorption of cholesterol.  It is \n perfectly safe and would help minimize the use of statins.  \nClick here to learn more today!  This Exclusive opportunity is only available to the first\n 250 people who respond.\n\n\n                           Sincerely,\n\n                           Peter Meyer\n                           Founder\n                           Heartguardian\n\n                           P.S.\nTry this Cholesterol Breakthrough for yourself today.  It is\n  incredibly easy to try at absolutely no risk.  \n                         \n \n\nTry Cholesterblock Today\n\n\n\n\n\n\nTo unsubscribe, click here below\n\n\n\n\n\n"}