{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nThe House of Representatives this afternoon failed\n  to override President Bush’s veto of the funding bill for Iraq\n  that would have started withdrawing troops by October 1. So what’s\n  next? While House Speaker Nancy Pelosi has said Democrats will work with the\n  White House to strike a deal, but she’s also said “there is a\n  great distance between us right now.” Jim Axelrod will have the latest\n  on the stalemate and David Martin will report on the benchmarks that may be\n  discussed for Iraq.\n \nYesterday’s immigration rallies across the United States\n  were smaller than last year’s, but more than just harsh words were\n  exchanged at some of the protests. In Los\n    Angeles, protesters scuffled with police, who fired\n  rubber cartridges and used batons against the crowd. Bill Whitaker will more\n  on the backlash from the clashes.\n \nIn medical news, a soon-to-be released study shows\n  an alarming number of American children go without basic health care. Sharyl\n  Attkisson will have details.\n \nThe role of peacekeepers in Darfur is changing, as\n  our Allen Pizzey will report from the Sudan. He’ll have a story\n  about the flow of funding and the growing threat of militias against both\n  cities and refugee camps there. \n \nMore than 100 journalists have died reporting on the\n  war in Iraq,\n  and now a memorial is being dedicated to these journalists and other members\n  of the press killed in the line of duty since 1944, Richard Roth will report.\n  The memorial site: Normandy, which of course\n  was the first part of France\n  liberated by allied forces in World War II.\n \nAnd Barry Petersen will have a story on what\n  American parents can learn from the Chinese about how to treat Internet\n  addiction in children.\n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}