{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Wall Street Journal: U.S. Leaves Door to China Ajar", "body": "\n\n\nThe U.S. move, which sets off a lengthy process that could take years\nto resolve, was narrowly focused on media and books. Several U.S.\nindustries, including pharmaceuticals and auto parts, have pressed\nsimilar piracy complaints against China, but they aren't covered in the\naction.\n\n\n\nThe U.S. has tried less adversarial approaches to encouraging Chinese\nreform, with some success. Some U.S. pharmaceutical companies have in\nthe past helped Chinese police identify factories engaged in\ncounterfeiting, and the U.S. Chamber of Commerce recently hosted an\ninternational conference on intellectual-property reform in Beijing.\n\n\n\nBut other industries that depend on intellectual-property enforcement\naren't certain litigation helps much. Pharmaceutical companies, for\ninstance, worry that acknowledging there is widespread counterfeiting\nand illegal distribution of their products would damage their\ncredibility and that of their brands. They also are concerned Beijing\nmay strike back by shutting down market access to U.S. firms.\n\n\n----------------\n\n\nU.S. Leaves Door to China Ajar\nWTO Complaint Has\nNarrow Focus on Media;\nRoom for Negotiation\nBy JOHN MCCARY\nApril 10, 2007; Page A7\n\nWASHINGTON -- In the Bush administration's \"good cop-bad cop\" approach\nto trade relations with the Chinese government, yesterday was a \"bad\ncop\" day.\n\nAs expected, the government said it would file a pair of cases in the\nWorld Trade Organization against China aimed at piracy and\ncounterfeiting of U.S. intellectual property. U.S. Trade Representative\nSusan Schwab said piracy and counterfeiting is \"unacceptably high\" and\naction was needed to prevent further losses to U.S. companies and\nworkers.\n\nShe also said, however, the U.S. would \"remain open at any time to a\ncomprehensive settlement\" during the WTO arbitration process.\n\nOne WTO case accuses China of lax enforcement of copyright violations.\nThe other challenges barriers to the sale of U.S.-produced movies,\nmusic and books, a complaint that focuses on China's practice of\nrequiring government middlemen to import such materials, which\nofficials there say is necessary to ensure its censor process.\n\nThe U.S. move, which sets off a lengthy process that could take years\nto resolve, was narrowly focused on media and books. Several U.S.\nindustries, including pharmaceuticals and auto parts, have pressed\nsimilar piracy complaints against China, but they aren't covered in the\naction.\n\nFor the WTO, the complaints break new ground at least in one regard.\nPrevious cases have focused on regulatory reform, but no country has\ntried to use the WTO as a forum to discuss enforcement efforts, which\nare hard to measure.\n\nThe merits of the cases remain to be determined, but their intended\neffect may be to give Washington more leverage in trade negotiations\nwith the Chinese. Treasury Secretary Henry Paulson is set to continue\nPresident Bush's economic dialogue with high-ranking Chinese officials\nnext month.\n\nThe move was hailed on Capitol Hill, where lawmakers have long pressed\nthe administration to get tough on Beijing on a range of issues.\n\n\"Litigation isn't always the answer, but when informal negotiations\ndon't work, we need to stand up for ourselves,\" said Sen. Chuck\nGrassley (R., Iowa), senior Republican on the Senate Finance Committee,\nwhich has oversight on trade issues.\n\nThe move against China comes at a time when the Bush administration is\npushing hard to win approval in Congress of a series of regional\nfree-trade agreements, as well as renewed authority to negotiate a\nglobal trade agreement. Approval of all the trade initiatives are in\ndoubt since Democrats, who are more skeptical of the gains of free\ntrade, won a majority in both houses of Congress last year.\n\n\"This administration has ignored China's trade violations over the past\nsix years, at the expense of U.S. businesses and workers,\" said Sen.\nSherrod Brown (D., Ohio). \"While this is a step in the right direction,\nthe timing of the president's action is certainly suspicious, given\nthat his blanket authority to make trade deals is about to expire.\"\n\nThe U.S. has tried less adversarial approaches to encouraging Chinese\nreform, with some success. Some U.S. pharmaceutical companies have in\nthe past helped Chinese police identify factories engaged in\ncounterfeiting, and the U.S. Chamber of Commerce recently hosted an\ninternational conference on intellectual-property reform in Beijing.\n\nIn the past, cases taking a harder line have lacked an important\ncomponent: witnesses willing to testify their products are being\ncounterfeited. Now, the movie and music industries are stepping\nforward.\n\nMitch Bainwol, chairman of the Recording Industry Association of\nAmerica, said the group welcomed the administration's decision to file\nthe WTO cases. \"The theft of music is pervasive in China and takes\nplace virtually without meaningful consequence,\" he said.\n\nBut other industries that depend on intellectual-property enforcement\naren't certain litigation helps much. Pharmaceutical companies, for\ninstance, worry that acknowledging there is widespread counterfeiting\nand illegal distribution of their products would damage their\ncredibility and that of their brands. They also are concerned Beijing\nmay strike back by shutting down market access to U.S. firms.\n\n\"The widespread fear is that if you bring litigation against China,\nyour companies will lose money, lose contracts and investment will be\nslow to come,\" said Gary Hufbauer, a senior fellow at the Peterson\nInstitute for International Economics, a private nonprofit research\ninstitution.\n\n--Bruce Orwall and Andrew Batson contributed to this article.\n\nWrite to John McCary at john.mcCary@wsj.com1\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}