{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for April 20, 2007  \n\n\n\nFirst Enercast Featured Articles for April 20, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nApr 20, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Apr. 20, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 20, 2007\n\n\nApr 20, 2007 PowerMarketers Industry Publications\n\n\n\nCan New Tools and Architectures Solve ETRM's Integration and Other Issues? (UtiliPoint.com - Apr. 20, 2007)\n\n\n\nUtiliPoint.com - Apr. 20, 2007 - UtiliPoint research around the energy trading business function has consistently demonstrated that there are a number of seemingly intractable issues when it comes to the software applications used to support that business function.\n\n\nApr 20, 2007 PowerMarketers Industry Publications\n\n\n\nThe Drive to Curb Carbon in High Gear (EnergyBiz Insider - Apr. 20, 2007) \n\n\n\nEnergyBiz Insider - Apr. 20, 2007 - The drive to curb carbon dioxide emissions is now in full gear. When the U.S. Supreme Court ruled that the Environmental Protection Agency violated the Clean Air Act by refusing to regulate those releases, it gave Congress a new reason to take up the discussion and to enact legislation. \n\n\nApr 20, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nDTE customers can go green\n\n\n\nApr. 19--Going Green has caught on with Michigan's largest power company, as DTE Energy announced the launch of GreenCurrents renewable energy plan for its residential and business customers.  DTE, parent company of Detroit Edison, said the voluntary program will allow any of its 2.2 million electric customers to purchase blocks of energy credits that will ensure that electricity generated on ...\n\n\nApr 19, 2007 Knight Ridder Tribune Business News\n\n\n\nReport backs Ohio wind power\n\n\n\nApr. 19--Ohio has greater-than-expected potential for wind power, according to a new federal study.  The latest modeling shows that a number of areas in Ohio have sufficient wind at heights of 100 meters to support commercial turbines that would produce clean electricity, said Dennis Elliot of the U.S. Department of Energy's National Renewable Energy Laboratory.\n\n\nApr 19, 2007 Knight Ridder Tribune Business News\n\n\n\nBristol energy board votes to join cooperative\n\n\n\nApr. 19--The city's electric system is joining a new cooperative that may eventually invest in a power-generating plant.  The Bristol Tennessee Essential Services Board voted Wednesday to join the group, which is open to the 158 power distribution customers of the Tennessee Valley Authority. The co-op steering committee is considering three power plants, said BTES Chief Executive Officer Mike ...\n\n\nApr 19, 2007 Knight Ridder Tribune Business News\n\n\n\nB&W gets $79.3 million for cancellation of $1 billion TXU utility contract\n\n\n\nApr. 19--Texas utility giant TXU will pay Barberton's Babcock & Wilcox Co. $79.3 million for canceling five new coal-fired power plants, while B&W will continue to work on three plants in a deal valued at $350 million.  The original contract called for B&W to get as much as $1 billion to design and build coal-fired boilers and pollution control equipment for eight new TXU plants.\n\n\nApr 19, 2007 Knight Ridder Tribune Business News\n\n\n\nSEMCO Energy declares $2.50 dividend on preferred shares\n\n\n\nApr. 19--SEMCO Energy Inc. said its board declared a regular quarterly dividend payable on the company's 5% Series B Convertible Cumulative Preferred stock at the rate of $2.50 a share.  The Port Huron utility that distributes natural gas to 400,000 customers in Michigan and Alaska said the dividend is payable on May 15 to preferred stockholders of record on May 1.\n\n\nApr 19, 2007 Knight Ridder Tribune Business News\n\n\n\nWilliams wins $8.8 million in damages: A jury rules on a contract dispute over the building of a Panhandle gas processing plant.\n\n\n\nApr. 19--A jury rules on a contract dispute over the building of a Panhandle gas processing plant.  A Tulsa County jury awarded more than $8.8 million in damages Tuesday to Williams Field Services, ending a seven-year legal dispute over a natural gas processing plant. After deliberating for about 12 hours, the jury awarded Williams Field Services $631,000 on a claim of breach of contract and ...\n\n\nApr 19, 2007 Knight Ridder Tribune Business News\n\n\n\nPower plant construction bill nears final passage in House\n\n\n\nApr. 19--COLUMBIA -- A proposal that would allow power companies to assess rate increases to build generating plants is on the fast track to the governor's desk, but Republican leaders are at odds over it.  House Majority Leader Jim Merrill, R-Daniel Island, warned his counterparts Wednesday that the bill could result in power bill increases for homeowners and businesses and potentially push the ...\n\n\nApr 19, 2007 Knight Ridder Tribune Business News\n\n\n\nAEP pulls bid to add $2 fee for reliability: Good move, says consumers' counsel\n\n\n\nApr. 19--American Electric Power's Ohio customers won't have to pay $2 more each month for more reliable service.  The fee could have been assessed if state regulators had approved a five-year, $130 million plan the utility offered in the fall to improve service. The money would have paid for trimming trees, replacing equipment and upgrading infrastructure. But in a joint motion involving the ...\n\n\nApr 19, 2007 Knight Ridder Tribune Business News\n\n\n\nWind-farm proposals for R.I. elicit positive responses\n\n\n\nApr. 19--Several key leaders in Rhode Island were cautiously optimistic yesterday about Governor Carcieri's plan to construct one or more large-scale wind farms off the coast of Rhode Island.  The governor released a state-commissioned study that identified 1 onshore site in Little Compton, and 10 offshore sites in Rhode Island and Block Island Sounds where it said operating wind turbines would ...\n\n\nApr 19, 2007 Knight Ridder Tribune Business News\n\n\n\nRedlands to get $2M boost from gas utility\n\n\n\nApr. 19--REDLANDS -- The city's budget problems aren't over, but an extra $2 million or so each year isn't going to hurt.  City Treasurer Michael Reynolds said the money will flow from the city's franchise agreement with the Southern California Gas Co. When Reynolds reviewed the gas company's franchise statement last week, he discovered that the city would receive about $2 million more from the ...\n\n\nApr 19, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nOhio's opportunity for wind power grows, new data show\n\n\n\nshow far greater potential for wind power in Ohio than previously thought, including prime areas north of Dayton and surrounding Springfield. A panel of experts discussed the new data that was compiled by the U.S. Department of Energy's National Renewable Energy Laboratory and released by Environment Ohio and the Ohio Department of Development's Office of Energy Efficiency.\n\n\nApr 20, 2007 Dayton Daily News\n\n\n\nEnergy Producers Capture Speedier Wind\n\n\n\nCOLUMBUS, Ohio -- New technology is allowing energy producers to capture speedier wind that environmental activists say has the potential to provide 20 percent of the state's electricity within 10 years.What's new are taller windmills that can catch gusts that are faster than those closer to the ground. The tallest windmills have been about 250 feet, but now proponents envision windmills whose ...\n\n\nApr 20, 2007 Newsday\n\n\n\nGreen Day in Green Valley (April 19)\n\n\n\nDriven by concerns over the country's polluted skies and waterways, an estimated 20 million Americans joined in the first Earth Day on April 22, 1970. While the environmental movement it helped spawn has remained robust, excitement over Earth Day itself has waxed and waned. The many events and celebrations around the Bay Area this weekend may reflect a new wave of enthusiasm in capturing and ...\n\n\nApr 20, 2007 Press Democrat\n\n\n\n\n\nTXU Energy Significantly Cuts Electric Prices on Market Tracker+ Plan\n\n\n\nDALLAS, April 19 /PRNewswire-FirstCall/ -- TXU Energy, the competitive retail electric subsidiary of TXU Corp. (NYSE: TXU), today announced a significant price cut for its TXU Energy Market Tracker+(SM) pricing plan. TXU Energy Market Tracker+ is an innovative pricing plan that automatically lowers electricity prices if natural gas costs trend lower. Prices are being cut to respond to competitive ...\n\n\nApr 19, 2007 PR Newswire\n\n\n\nEl Paso Natural Gas Company Announces Expiration and Final Results of Cash Tender Offer for Its 7 5/8% Notes Due 2010\n\n\n\nHOUSTON, April 19 /PRNewswire-FirstCall/ -- El Paso Natural Gas Company (EPNG), a wholly owned subsidiary of El Paso Corporation (NYSE: EP), announced the expiration and final results of its previously announced cash tender offer to purchase any and all of its outstanding 7 5/8% Notes due 2010 (CUSIP No. 283695BM5). The tender offer expired at 12:00 midnight, New York City time, on April 18, ...\n\n\nApr 19, 2007 PR Newswire\n\n\n\nPennsylvania DEP Secretary McGinty, Giant Eagle Celebrate Opening of State's First 'Green' Supermarket\n\n\n\nIt's not just the produce that is green in Giant Eagle Inc.'s remodeled store in Pittsburgh's Shadyside neighborhood. The whole building is now certified 'green' for its energy efficiency, high air quality, water conservation, and even a living 'green' roof. Environmental Protection Secretary Kathleen A. McGinty today joined company and local officials in the opening of Pennsylvania's first ...\n\n\nApr 19, 2007 PR Newswire\n\n\n\nWholesale Electricity Costs Down in 2006\n\n\n\n07:19 PM Eastern Daylight Time Wholesale Electricity Costs Down in 2006 ISO Annual Market Performance Report Shows Markets Stable and Competitive for Fifth Year in a Row FOLSOM, Calif.--(BUSINESS WIRE)--The impartial Department of Market Monitoring for the California Independent System Operator Corporation (California ISO) presented its 2006 Annual Report on Market Issues and Performance to the ...\n\n\nApr 19, 2007 Business Wire\n\n\n\nOG&E Centennial Wind Farm to be Dedicated for Service\n\n\n\n80-turbine Harper County facility one of few owned and operated by a utility OKLAHOMA CITY, April 19 /PRNewswire-FirstCall/ -- OG&E Electric Services' Centennial Wind Farm near Fort Supply will be dedicated April 20, formally recognizing the 80-turbine facility's addition to the electric power grid and more than tripling the company's production of clean, renewable wind energy.\n\n\nApr 19, 2007 PR Newswire\n\n\n\nEPA: Bellingham is Washington's First Green Power Community Official Recognition Ceremony Slated for Saturday, April 21, at Downtown Farmer's Market\n\n\n\nSEATTLE--(BUSINESS WIRE)--By purchasing more than 11 percent of all of the electricity used in the entire city from green power resources, Bellingham, Washington, has been recognized by the U.S. Environmental Protection Agency (EPA) as a Green Power Community. Bellinghams power purchasing achievement is even more remarkable considering that its actually double that of the six other Green Power ...\n\n\nApr 20, 2007 Business Wire\n\n\n\nCon Edison to Redeem Debentures\n\n\n\nConsolidated Edison, Inc. (Con Edison)  Consolidated Edison, Inc. (Con Edison) announced today that it will call for redemption on May 19, 2007 all of its outstanding 7.25% Public Income NotES (7.25% Debentures, Series 2002 A) (NYSE: EPB) (Cusip No. 209115 20 3). The redemption price is 100% ($25 denominations) of the principal amount together with interest accrued from April 1, 2007 to, but not ...\n\n\nApr 19, 2007 Internet Wire\n\n\n\nEnerNex Corporation Chosen to Support Consumers Energy's Exploration of AMI Options\n\n\n\nKNOXVILLE, Tenn.--(BUSINESS WIRE)--EnerNex Corporation has been awarded a contract from Consumers Energy to assist in evaluating options for possible deployment of Advanced Metering Infrastructure (AMI). The company is assisting Consumers Energy in the development of requirements and business cases, as well as, review and selection of AMI designs and technology solutions for meters, communication ...\n\n\nApr 19, 2007 Business Wire\n\n\n\nCalifornia ISO Board Approves Five-Year Business Plan\n\n\n\nFOLSOM, Calif.--(BUSINESS WIRE)--The California Independent System Operator Corporation (California ISO) Board of Governors today approved a comprehensive Five-Year Business Plan that follows a thorough process of assessing the needs of the electricity industry and the consumers it serves. The business roadmap charts the course for the California ISO through 2011 and integrates, among other ...\n\n\nApr 19, 2007 Business Wire\n\n\n\nAlgonquin Power Income Fund declares cash distribution for April 2007\n\n\n\nOAKVILLE, ON, April 19 /PRNewswire-FirstCall/ - Algonquin Power Income Fund (the 'Fund') (TSX:APF.UN) of Oakville, Ontario announced today that its Trustees have declared a cash distribution on its trust units. The distribution is $0.0766 per trust unit payable on June 15, 2007 to the unitholders of record on April 30, 2007 for the period from April 01, 2007 to April 30, 2007.\n\n\nApr 19, 2007 PR Newswire\n\n\n\nUnitil Shareholders Re-Elect Directors\n\n\n\nHAMPTON, N.H., April 19 /PRNewswire-FirstCall/ -- Unitil Corporation (Amex: UTL) held its Annual Meeting of Shareholders today at the corporate office in Hampton, New Hampshire. Shareholders re-elected Michael J. Dalton, Edward F. Godfrey and Eben S. Moulton to the Board of Directors for three-year terms. 'In 2006 we achieved two key rate case settlements, initiated a major investment in an ...\n\n\nApr 19, 2007 PR Newswire\n\n\n\n\n\nAquila wants to build $150M plant in Sedalia\n\n\n\nAquila Inc., which serves thousands of customers in Wichita, is seeking approval to build a $150 million gas-fired power plant in Sedalia, the company said Wednesday. Kansas City-based Aquila (NYSE: ILA) said in a release that it would use the proposed 300-megawatt plant to generate additional electricity during times of peak demand, typically the summer season.\n\n\nApr 19, 2007 Wichita Business Journal\n\n\n\nEnergy producers capture speedier wind\n\n\n\n6:26 p.m. PT By JOHN MCCARTHYASSOCIATED PRESS WRITER COLUMBUS, Ohio -- New technology is allowing energy producers to capture speedier wind that environmental activists say has the potential to provide 20 percent of the state's electricity within 10 years. What's new are taller windmills that can catch gusts that are faster than those closer to the ground. The tallest windmills have been about ...\n\n\nApr 20, 2007 Seattle Post Intelligencer\n\n\n\nCost of Kyoto is recession: Baird\n\n\n\nCost of Kyoto is recession: BairdMeagan Fitzpatrick, CanWest News ServicePublished: Friday, April 20, 2007 OTTAWA - The cost of meeting Canada's Kyoto commitments would be an economic downturn to rival the worst recessions of the past 60 years, spiralling energy costs and the worst unemployment in several generations, John Baird, Minister of the Environment, said yesterday.\n\n\nApr 20, 2007 National Post\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nODS-Petrodata Launches First Phase of Energy Current Online News Service\n\n\n\nODS-Petrodata, the leading provider of news, data and consulting services specific to the offshore oil and gas industry, has launched Energy Current(TM), a new online news service offering global coverage of targeted energy industry segments. Now online at http://www.energycurrent.com , Energy Current provides timely, accurate in-depth news and analysis on the global energy industry.\n\n\nApr 19, 2007 PR Newswire\n\n\n\nNorthland Power Income Fund Announces Monthly Distributions to Unitholders for the Second Quarter of 2007\n\n\n\nNorthland Power Income Fund (the \"Fund\") (TSX: NPI.UN)(TSX: NPI.DB) is pleased to announce distributions to unitholders in the amount of $0.09 per unit per month for the 2nd quarter of 2007 as follows:  Northland Power Income Fund (the \"Fund\") (TSX: NPI.UN)(TSX: NPI.DB) is pleased to announce distributions to unitholders in the amount of $0.09 per unit per month for the 2nd quarter of 2007 as ...\n\n\nApr 19, 2007 Internet Wire\n\n\n\nWind farm threatened by climate penalty\n\n\n\nA wind farm development near Wellington has been threatened by Government climate change proposals that could add a $1.5 million penalty for chopping down 'junky' pine trees. Under climate change discussion papers published earlier this year, the Government proposed a series of measures to discourage deforestation, including tradeable permits and flat charges for tree removal.\n\n\nApr 19, 2007 Dominion Post\n\n\n\nBoxer will 'hound' Bush on emissions regulations\n\n\n\n(04-19) 04:00 PDT Washington -- Sen. Barbara Boxer promised to pressure the Bush administration to adopt California-style global warming regulations, saying Wednesday that the Supreme Court 'handed us a gift' with its recent landmark decision authorizing the Environmental Protection Agency to reduce greenhouse gases as a pollutant. The decision 'put the wind at our backs,' the California Democrat ...\n\n\nApr 19, 2007 San Francisco Chronicle\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}