{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 3, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESQueen Elizabeth II Arrives In Virginia\nQueen Elizabeth II and her husband, Prince Philip, stepped off a chartered airplane in Richmond, Va., signaling the beginning\n                        of a six-day American trip. It is her first visit to the United States in 16 years.  More...Watch: U.S. Rolls Out Royal Carpet\n• Space Pioneer Wally Schirra Dies At 84• Iraq Lawmakers Get Heat For Vacation Plans\n                     \t\t\t\t\t| Watch• House Votes To Expand Hate Crimes LawU.S.30 Injured In Pennsylvania Bus Crash\nA bus carrying musicians and their band director to a competition on the Jersey Shore rear-ended a tractor-trailer that was\n                        going much more slowly. Most of the injuries were minor, but the bus driver is in critical condition. More...\n• Padilla Jurors Cite Lack Of Trust On 9/11• Space Pioneer Wally Schirra Dies At 84• Hiker Dies Of Thirst With Water All Around• More StoriesWorldRice Talks Iraq With Top Syrian Official\nSecretary of State Condoleezza Rice met with Syria's foreign minister in the first high-level talks in years between the two\n                        countries. Rice said the meeting was \"professional and businesslike\" and was focused on how to improve security in Iraq. More...Watch: Rice Talks With Iraqi PM\n• Providing Aid For Darfur Isn't Easy\n                     \t\t\t\t\t| Watch• Thousands Of Israelis Want PM To Quit• Scots Hit Polls For Historic Election• More StoriesPoliticsWhat Motivates Fred Thompson?\nWhat's actor/politician Fred Thompson's motivation to play the real-life role of president of the United States? And Barack\n                        Obama delivers some \"tough love\" on the campaign trail. Joel Roberts has the highlights of the day's headlines. More...Watch: Bush: 'We Can Work Together'\n• Wolfowitz Defends Actions At World Bank• Rice Talks Iraq With Top Syrian Official\n                     \t\t\t\t\t| Watch• House Votes To Expand Hate Crimes Law• More StoriesHealthMore Pet Foods Added To Recall List\nMenu Foods expanded its recall of pet food products in the United States and Canada because of possible cross-contamination\n                        between melamine-tainted products and other foods made in the same period. More...Watch: Human Food Supply In Jeopardy?\n• Study: Many Factors In Breast Cancer Drop• Once-A-Year Drug May Thwart Bone Fractures\n                     \t\t\t\t\t| Watch• Study: 1 In 4 Kids Go Without Health Care\n                     \t\t\t\t\t| Watch• More StoriesSciTechArctic Melt-Off Is Ahead Of Schedule\nAs environmental scientists gather in Bangkok, a new study shows that one of the group's earlier predictions on climate change\n                        may already be too conservative. More...\n• Space Pioneer Wally Schirra Dies At 84• Myths Abound About U.S. Bee Disappearance• Digg Reverses Course After Online Uproar• More StoriesBusinessHow Much Is Mom Worth?\nSalary.com says the answer is $138,000 a year for stay-at-homes, $85,000 over and above their wages for working mothers. Much\n                        of that is overtime. More...\n• Save On Admissions To Amusement Parks• Imus Reportedly Plans To Sue CBS• GM 1Q Profit Down 90 Percent From 2006• More StoriesEntertainmentParis Faces 45 Days In The Slammer\nIn documents filed April 30 in Superior Court, prosecutors said they want Paris Hilton to be required to stay away from alcohol\n                        for 90 days and wear a monitoring device that will chart whether she complies. More...\n• Britney Does It Again \n                     \t\t\t\t\t| Watch• Beckham Celebrates B-Day In London• Witness In Spector Case Suggests Tampering\n                     \t\t\t\t\t| Watch• More StoriesOpinionFirings Firestorm Won't Die Down Soon\nAs the U.S. attorney scandal rolls into the summer, CBSNews.com legal analyst Andrew Cohen says the people who should\n                        have been fired did the firing and those who should continue to serve the public got the shaft. More...\n• Rupert Riles Reds! Repubs Rejoice!\n                     \t\t\t\t\t| Watch• Fixing Iraq Through Gridlock\n                     \t\t\t\t\t| Watch• Dangerous Distractions\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Recipes: Easy Spring Delights From Top Chef\nMarcus Samuelsson shared recipes for lamb, tuna, salads and more on The Early Show. He also discussed the anniversary\n                        of a foundation that hands out prestigious awards, including one to \"rising star chefs.\" He won one, back in 1999. More...\n• EARLY SHOW: Summer Hotspots\n                     \t\t\t\t\t| Watch• EARLY SHOW: Drew Barrymore Explores Inner-Beauty\n                     \t\t\t\t\t| Watch• EARLY SHOW: Il Divo: Another Simon Cowell Mega-Hit\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nAn Odd Couple In ChinaCBS News RAW: A pet duckling and a puppy in China have become best friends, sunbathing, napping and just generally\n                                    hanging out together.\nTOP VIDEOS\nHot Summer Escapes\nU.S. Rolls Out Royal Carpet\nDobbs On Illegal Immigrants\nU.S. Talks Iraq With Syria\nTribeca Talks: Ludacris\nFirst Look: The Queen's Visit\nNew Drug For Osteoporosis\nThrift Store Masterpiece?\nLucky Drew Barrymore\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesDoes fiery CNN anchor Lou Dobbs consider himself a journalist? Lesley Stahl finds out, Sunday, 7 p.m. ET/PT.48 Hours!\n  Mystery\nPower, Passion And Poison:An ambitious politician meets a suspicious death. Troy Roberts reports, Saturday at 10\n                           p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}