{"category": "ham", "to_address": "\"Francesco Poli\" <debian-legal@lists.debian.org>", "from_address": "Lasse Reichstein Nielsen <lrnatwork@gmail.com>", "subject": "Re: A possible weakened rephrase of clause 5d [was: Re: GPL v3 Draft 3- text and comments]", "body": "On Thu, 12 Apr 2007 00:46:06 +0200, Francesco Poli   \nwrote:\n\n> OK, this is my attempt to rephrase clause 5d in a form that is weak\n> enough to be less harmful than clause 2c of GPLv2:\n>  ~~~~~~~~~~~~ begin proposed text ~~~~~~~~~~~~\n>       d) If the Program has interactive user interfaces which display\n>      legal notices, this feature must be preserved in each interactive\n>      interface that is also present in the work.  In this subsection, an\n>      interactive interface is said to \"display legal notices\" if it\n>      includes a convenient feature that displays an appropriate\n>      copyright notice, and tells the user that there is no warranty for\n>      the work (unless you provide a warranty), that licensees may convey\n>      the work under this License, and how to view a copy of this\n>      License.\n>  ~~~~~~~~~~~~~ end proposed text ~~~~~~~~~~~~~\n\nWhat does \"each interactive interface\" mean? I.e., what delimiters an  \ninterface?\nDoes a program with more than one window have more than one interface?\nWhat if it is a web application with several clients? That each open  \ndifferent\nwindows? (This is not specified in the GPLv3 draft either, but I don't  \nthink\nit is at all obvious.)\n\n\nAnyway, consider this case:\n\n  Program A has a graphical user interface with an \"about\" feature showing  \nlegal\n  notices. It also has some very clever algorithms in its belly.\n\n  Program B wants to use the algorithms, but cares not for the interface of  \nprogram A.\n\n  Program B has an interactive textual user interface.\n  (Can the *feature* be preserved when going from graphical to textual?)\n\n  Program B extracts the algorithms and uses them, but dumps the interface.\n  Should Program B preserve the legal notices? Obviously yes.\n\n  Now the people at Program B Software first extract the clever algorithms\n  and distributes them, alone, under the original license, as allowed by  \nthe GPL.\n  Then they use *this* distribution in program B. The program they use has  \nno interactive\n  user interface at all, and no feature displaying legal notices, so  \nprogram B isn't\n  required to have it either.\n\nThis problem is inherent to linking a requirement relating to an entire  \nprogram\nto only parts of that program (here: the user interface). Anybody can  \nremove those\nparts and distribute the rest, thereby removing the requirement.\n\nYour version does alleviate this problem. Clause 5d of GPLv3draft3, as you  \nquoted it,\ndoes. It requires that legal notices be inserted if deriving form a program\nwith no user interface (but not from one with a user interface but without\nlegal notices). It's not necessarily the same notices as the original  \nprogram, though,\njust the default GPL notices.\n\n/L\n--\nLasse R. Nielsen - atwork@infimum.dk\n  'Faith without judgement merely degrades the spirit divine'\n  Reproduction of this message, or parts thereof, is allowed if proper  \nattribution is given.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}