{"category": "ham", "to_address": "\"Pietrzykowski, Matthew (GE, Research)\" <pietrzyk@research.ge.com>", "from_address": "Charilaos Skiadas <skiadas@hanover.edu>", "subject": "Re: [R] Boxplot with quartiles generated from different algorithms", "body": "On Apr 11, 2007, at 7:59 AM, Pietrzykowski, Matthew (GE, Research)  \nwrote:\n\n> R users:\n>\n> I am trying to replicate the boxplot output I achieve with Minitab  \n> in R.\n> I realize that R gives the user many more options on the algorithm  \n> used\n> to\n> calculate the IQR than Minitab, so I concentrated on type=6 when using\n> the quantile() function in R.  The problem I am having is setting the\n> upper and\n> lower limit of the whisker based on the nearest actual data that  \n> should\n> be included.\n> If the last sentence is unclear, setting the boxplot$stats rows 1  \n> and 5\n> to the right\n> values based on the IQR from the type=6 setting of the quantile\n> function.  Is there\n> an easy way to do this for a data frame or matrix?\n\nSeeing as noone else answered this (at least not onlist), I'll give  \nit a go I think. If I understand your question correctly, you know  \nhow to find the values you want for boxplot$stats rows 1 and 5, your  \nquestion is how to get boxplot to accept them. If so, you should be  \nable to simply do the following three steps:\n\npl <- boxplot(....)\npl$stats[1] <- ....\nbxp(pl)\n\nI suppose the question that remains then is whether you can do this  \nby a single direct call to boxplot. I had this question a couple of  \nmonths ago, because I wanted to make the output of boxplot be what my  \nstudents were expecting from what they had learned (Moore & McCabe)  \nand wasn't able to find an answer. I'd love to find out if there is one.\n\n> Many thanks,\n>\n> Matt\n\nHaris Skiadas\nDepartment of Mathematics and Computer Science\nHanover College\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}