{"category": "spam", "to_address": null, "from_address": "Abama George <mrabama5205@hotmail.fr>", "subject": "Awaiting for your urgent cooperation.", "body": "\n\n\n\n\nGOOD DAY!,\n \nI AM ABAMA GEORGE, '' DIRECTOR AUDITING AND ACCOUNTING  DEPARTMENT\" BANK OF AFRICA (B.O.A) OUAGASPIEOU,BURKINA FASO.\n \nI DISCOVERED THE SUM OF SEVEN MILLION,TWO HUNDRED THOUSAND DOLLARS (USD7.2)BELONGING TO A DECEASED CUSTOMER OF THIS BANK.THE FUND HAS BEEN LYING IN A SUSPENCE ACCOUNT WITHOUT ANYBODY COMING TO PUT CLAIM OVER THE MONEY SINCE THE ACCOUNT OWNER LATE,MR.SALLA KHAT FROM LEBANESE WHO WAS INVOLVED IN THE DECEMBER 26TH 2003 BENIN PLANE CRASH.HERE IS THE AIR CRASH WEBSITE ON CNN:=http://www.cnn.com/2003/WORLD/africa/12/26/benin.crash/index.html\n \nIT IS THEREFORE,UPON THIS DISCOVERY THAT I DECIDED TO TAKE THIS ULTIMATUM AND MAKE THIS BUSINESS PROPOSAL TO YOU AS THE FUND WILL BE RELEASE TO YOU AS THE NEXT OF KIN OR RELATION TO THE DECEASED FOR SAFETY AND SUBSEQUENT DISBURSEMENT SINCE NOBODY IS COMING FOR IT AND I DON'T WANT THIS MONEY TO GO INTO THE BANK TREASURY AS UNCLAIMED BILL.\n \nTHE BANKING RULES HERE STIPULATES THAT IF SUCH MONEY REMAINED UNCLAIMED AFTER FIVE YEARS,THE MONEY WILL BE TRANSFERRED INTO THE BANK TREASURY AS UNCLAIMED FUND.THE REQUEST OF FOREIGNER AS NEXT OF KIN IN THIS BUSINESS IS OCCASSIONED BY THE FACT THAT THE DECEASED CUSTOMER WAS A FOREIGNER AND A BURKINABE CANNOT STAND AS NEXT OF KIN TO A FOREIGNER.\n \nTHEREFORE,I SOLICITING FOR YOUR ASSISTANCE TO COME FORWARD AS THE NEXT OF KIN.I HAVE AGREED THAT 40% OF THIS MONEY WILL BE FOR YOU AS THE BENEFICIARY RESPECT OF THE PROVISION OF YOUR ACCOUNT AND SERVICE RENDERED,55% WILL BE FOR ME WHILE 5% WILL BE FOR EXPENSES INCURED DURING THE WHOLE PROCESS OF THIS TRASACTION.THEN IF THE MONEY TRANSFERRED TO YOUR ACCOUNT FROM THIS BANK, I WILL PROCCEED IMMEDIATELY TO YOUR COUNTRY FOR THE SHARING OF THE FUNDS.\n \nYOURS FAITHFUL,MR.ABAMA.Play free games, earn tickets, get cool prizes! Join Live Search Club.   Join Live Search Club!\n"}