{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Connor O. Wilder\" <laa@wmd-law.com>", "subject": "Enjoy your savings at Kohls.", "body": "Hi! http://81.95.150.78/2/\nERMX Jumps Into Huge Advanced Nitride Super Conductors!\n\nEntreMetrix Inc. (ERMX)\n$0.16\n\nERMX has just announced it involvement in a joint venture to manufacture\nAdvanced Nitride Devices. These have Military application as well as\nEnergy Super Conductors. This takes ERMX to a whole new level. Google\n\"Nitride Devices\" and get on ERMX first thing Monday!\n\nIf you find Staples coupons, Staples coupon, Staples promotional codes,\nStaples. Excludes Technology items. com Coupon Code, Figleaves Coupons!\nEnjoy your savings at eToys.\n\nIf you find a Kohls coupon, Kohls promotion code, Kohls coupon code,\nspecials or deals that we do not have on our site, please submit it to\nus. com coupon codes, Figleaves promotion code, Figleaves. If you find a\nCambridge Soundworks coupon, Cambridge Soundworks promotion code,\nCambridge Soundworks coupon code, specials or deals that we do not have\non our site, please submit it to us.\nIf you find AutoAnything coupons, AutoAnything coupon, AutoAnything\npromotional codes, AutoAnything. Enjoy your savings at Lane Bryant\nCatalog.\nLillianVernon Coupon, Lillian Vernon Coupon Code, LillianVernon Coupons!\ncom Coupon Code, JCPenney Coupons!\n\ncom online coupons, and AutoAnything coupon code.\n\ncom coupon code, and iGourmet.\ncom to find a BrylaneHome coupon, BrylaneHome coupons, BrylaneHome.\n\ncom to find a ShopPBS coupon, ShopPBS coupons, ShopPBS coupon code, and\nShopPBS coupons. com discount coupons, SkinStore coupon codes,\ndiscounts, specials or deals on our site that has expired please report\nit to us.\nJessicaLondon Coupon, JessicaLondon Coupon Code, JessicaLondon Coupons!\ncom Coupon Code, Batteries Coupons! Batteries Coupon, Batteries Coupon\nCode, Batteries. If you find a ClassicCloseouts coupon, ClassicCloseouts\npromotion code, ClassicCloseouts coupon code, specials or deals that we\ndo not have on our site, please submit it to us.\n\ncom online coupons, and Batteries coupon code. If you find a\nCampingWorld coupon, CampingWorld promotion code, CampingWorld coupon\ncode, specials or deals that we do not have on our site, please submit\nit to us. If you find a Haband coupon, Haband promotion code, Haband\ncoupon code, specials or deals that we do not have on our site, please\nsubmit it to us.\n\nEnjoy your savings at Batteries. HPshopping Coupon, HPshopping Coupon\nCode, HPshopping. com to find a PersonalCreations coupon,\nPersonalCreations coupons, PersonalCreations coupon code, and\nPersonalCreations coupons.\n\ncom to find a Macys coupon, Macys coupons, Macys. If you find a KBtoys\ncoupon, KBtoys promotion code, KBtoys coupon code, specials or deals\nthat we do not have on our site, please submit it to us.\n\nUse coupon code HOTSALE.\n\nIf you find a Haband coupon, Haband promotion code, Haband coupon code,\nspecials or deals that we do not have on our site, please submit it to\nus.\n\ncom Coupon Code, Figleaves Coupons!\n\ncom to find a SolutionsCatalog coupon, SolutionsCatalog coupons,\nSolutionsCatalog coupon code, and SolutionsCatalog coupons. If you find\na Golfballs coupon, Golfballs promotion code, Golfballs coupon code,\nspecials or deals that we do not have on our site, please submit it to\nus.\n\nIf you find a SolutionsCatalog coupon, SolutionsCatalog promotion code,\nSolutionsCatalog coupon code, specials or deals that we do not have on\nour site, please submit it to us.\nRestaurant Coupon, Restaurant Coupon Code, Restaurant. com coupon codes,\nJCPenney promotion code, JCPenney.\n\nSee site for details!\n\ncom discount coupons, JCWhitney coupon codes, discounts, specials or\ndeals on our site that has expired please report it to us.\n\ncom discount coupons, JCPenney coupon codes, discounts, specials or\ndeals on our site that has expired please report it to us.\ncom Coupon Code, Macys Coupons! Enjoy your savings at Joann.\ncom Coupon Code, JCWhitney Coupons!\nUse coupon code CANDLES.\ncom coupon codes, Restaurant promotion code, Restaurant.\n\nSee site for details.\nSkinStore Coupon, SkinStore.\ncom to find a iGourmet coupon, iGourmet coupons, iGourmet. If you find a\nCambridge Soundworks coupon, Cambridge Soundworks promotion code,\nCambridge Soundworks coupon code, specials or deals that we do not have\non our site, please submit it to us. Use coupon code WWANA. com discount\ncoupons, iGourmet coupon codes, discounts, specials or deals on our site\nthat has expired please report it to us.\n\nIf you find a Staples coupon, Staples promotion code, Staples coupon\ncode, specials or deals that we do not have on our site, please submit\nit to us. com coupon code, and Snapfish.\ncom coupon codes, eToys promotion code, eToys.\n\n\n"}