{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] KEI statement on adoption of WHO resolution \"Public health, innovation and intellectual property\"", "body": "Thiru Balasubramaniam, Knowledge Ecology International\n\n\"The 60th World Health Assembly is taking another important step to\nchange the way the WHO and Member States deal with innovation and\naccess.\n\nThe World Health Assembly adopted language that requests the WHO\nDirector-General Margaret Chan to encourage the development of\nproposals for health-needs driven R&D, including those \"addressing the\nlinkage between paying for the cost of R&D and the prices\" of\nmedicines, vaccines, diagnostic tools and other health care products.\n\nA number of NGOs, academic experts and country negotiators (including\nBrazil, Chile, Canada and Norway) say that separating the price of\npharmaceuticals from the systems for paying for R&D can lead to more\nequitable health care outcomes, and less rationing of medicines.\n\nThe African Group, the European Union and Switzerland played a\nconstructive role in these debates. We acknowledge the mediating role\nof the Namibian chair and the aforementioned delegations in\nresurrecting the spirit of Geneva and clearing the path forward for the\nWHO IGWG to develop new systems for paying for R&D that are not linked\nto the prices of medicines.  Examples of such approaches are direct\ngovernment funding of research, and rewards like prizes, that operate\nindependent from drug prices.\"\n\nFor more information please contact:\n\nJames Love\njames.love@keionline.org\n1 202 361 3040\n\nThiru Balasubramaniam\nthiru@keionline.org\n41 76 508 0997\n\nSpring Gombe\nspring.gombe@keionline.org\n41 78 842 5180\n\n\n\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}