{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Patricia Garcia <extrex@googollearning.com>", "subject": "Penis vs. wet pussies", "body": "\n\nAre you afraid that she will meet someone who is better than you in bed? \nGo to the shop\nBuy Licensed and Quality Viagra or Cialis at US Drug store now and you'll be at the top all night long!\nOur shop\nFantastic low prices! Instant shipping directly from our warehouses!\nWith best regards,\nPatricia Garcia\n \n \nProsto Chto-to uzh silno eta tolstaia zadnica vsem bez iskliucheniia dejstvuet na nervy. Davlenie shefira vozroslo vdvoe, chto govorilo o neischerpannom zapase ego Resursov, no menia bylo uzhe ne uderzhat. Ia prodolzhal tianutsia. Vse erserkery samuiu malost empaty, on tozhe chto-to Pochuvstvoval, tolko eshche ne mog poniat chto. \nI Esli vas interesuet moe mnenie, to chuzhaku prosto neobhodimo pomoch v polnom Sootvetstvii s Veroj nashih predkov. Do ledianogo oznoba. So mnoj Ved nikto ne sovetovalsia. Tolko On sumeet obedinit vseh, chtoby spravitsia s griadushchimi bedami. Chelovek, Obladaiushchij ogromnoj vlastiu, pravitel strany, i vdrug korotaet vremia v obychnom Traktire, sredi prochego liuda. Ona obiasnila, chto so mnoj proizoshlo, a ia, poniav, chto ona dlia Menia sdelala, v otvet razotkrovennichalsia sverh mery. Ia eshche nemnogo pobudu s Toboj, podozhdu, poka tvoi druzia ochnutsia, chtoby ty ne prikonchil ih, Vospolzovavshis ih sostoianiem. Medlenno Nahlobuchivaia shlemnik na golovu i popravliaia svoi nedlinnye volosy, sotnica hmuro Pointeresovalas, obrashchaias k magu: A ty ne dumaesh, chto po doroge, poka my budem ego podzhidat posle Perehoda cherez portal, s nim mozhet chto-nibud sluchitsia? Nesmotria na vsiu etu Durnuiu moshch, kotoraia iz nego tak i pret? Te zhe marny, naprimer. \nPredutrennij sumrak bezhal proch, Boiazlivo horonias v teni otdalennyh sluzhebnyh postroek, v poiskah spaseniia Gluboko nyrial v otvodnoj kolodec. Prizhmis k stene, shepnul vdrug Celitel szadi. Ne bylo u menia sil sejchas etim zanimatsia. Kak zhe, ia stol nepochtitelno otozvalsia o sviatom. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}