{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Don Armstrong <don@debian.org>", "subject": "Re: Request for suggestions of DFSG-free documentation licences", "body": "On Mon, 04 Jun 2007, Jordi Gutierrez Hermoso wrote:\n> On 03/06/07, Don Armstrong  wrote:\n> >the maintainer (and the developers) recognized that users may need\n> >or want such documentation, even though it does not meet the DFSG,\n> >so the documentation was made available in non-free.\n> \n> That's a rather unsatisfactory fix. Although it does work for most\n> practical purposes, the inability to ship Debian CDs with the\n> necessary docs is quite a hindrance. There's also the PR image of\n> Debian to consider, I think.\n\nThere's nothing stoping CDs with content that you feel is free enough\nbeing made. And frankly, being concerned with a PR image isn't a valid\nreason to compromise principles. The FSF is no more interested in its\npublic image than Debian is. [If the FSF or Debian were, there's no\ndoubt that RMS, myself, and the rest of us who are non-photogenic\nwould have been hidden away long ago.]\n\n> >If you disagree with the determination of the Developers, you can\n> >easily install the work from non-free, or cease supporting Debian\n> >in its entirety. The choice is yours, really.\n> \n> That's unfair. I have been exclusively a Debian user since 2001.\n> Installing GFDLed stuff from non-free is what I do, but it's\n> inconvenient to track down those packages that aren't installed by\n> default anymore.\n\nI agree, which is why I've personally been involved in pressuring the\nFSF to resolve the remaining issues in the GFDL for quite some time.\nIn my opinion, recognizing the issues and getting them resolved is the\nright way forward; ignoring them because they come from the FSF is\nnot.\n\n> The moralistic tone of the installation is also problematic for me,\n> since I'm very proud to say that all of my work is done exclusively\n> with free software (practically the BIOS is the only non-free\n> software I have to use anymore). This an important distinction for\n> the mathematical and scientific work that I do (proprietary software\n> is unscientific, etc).\n\nDeciding to use free software is quite often a moralistic stance;\nwhere your convictions and morals lie dictate how you feel about this\nissue.\n\n> \"Our way or the highway\" isn't a nice thought either. Do you really\n> think that the DDs that voted against putting the GFDL in non-free\n> should fork off too? Debian is the best distro out there, and I'm\n> very loyal to it, but I'malso very unhappy with its treatement of\n> the GFDL, and I think this horrible mess should be fixed.\n\nIf a developer is unable to accept the decision of the majority as the\ndecision of Debian on a particular issue, that's really all that they\ncan do. In the end, of course, the separation of works into main and\nnon-free is necessarily a judgement based on the licenses which the\nworks have. Anyone who disagrees with the final determination made has\nthe ability to decide that the packages in the archive have\nincorrectly segregated, and filter the Packages.gz files in the\narchive appropriately.\n\nRegardless, in this particular case, the only way to effect the change\nyou are calling for is to have a GR to overturn the existing GR.\nDiscussion of the issue on this mailing list will not cause the GR to\ndisappear.\n\n\nDon Armstrong\n\n-- \nDebian's not really about the users or the software at all. It's a\nlarge flame-generating engine that the cabal uses to heat their coffee\n -- Andrew Suffield (#debian-devel Fri, 14 Feb 2003 14:34 -0500)\n\nhttp://www.donarmstrong.com              http://rzlab.ucr.edu\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}