{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Alex Snow <alex_snow@gmx.net>", "subject": "Re: VmWare", "body": "yYou want to download the vmware server program...install it, create a \nnew virtual machine, specify linux as the OS and choose a specific \ndistribution from the list, or the closest choice it gives you, then \ngo into vm->settings and add a serial port to the hardware, and make \nsure the cd-rom drive is pointing to the drive you want to install \nfrom, or an iso image, and boot the vm.  Use control-g to grab input \nand allow you to use the vm, and control-alt to release input.\nOn Sun, \nApr 15, 2007 at 06:34:27PM -0700, Gregory Nowak wrote:\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA1\n> \n> Mind describing the procedure you took, (I.E. what vmware programs to\n> download, since there is a player and server), and everything that you\n> did? Is running gnu/linux in vmware with windows as the host really a\n> viable alternative to resizing existing partitions, and dealing with\n> installing on machines with no serial ports? Thanks.\n> \n> Greg\n> \n> \n> On Sun, Apr 15, 2007 at 06:23:10PM -0700, Zachary Kline wrote:\n> > Howdy,\n> >     I'm glad to be able to report that I was able to get a fully speakup-enabled installation of Gentoo Linux onto a VmWare image.  This helps solve some rather annoying problems with my particular computer, specifically the cdrom drive being a little flaky.\n> >     I've found that Espeak works very well in the virtual machine, and that in general unless I'm doing something intensive--like compilation--the performance is great.\n> >     I'm actually rather proud of myself in that I was able to do this installation without sighted help, something which I had previously needed.\n> > I'll stop rambling now.\n> > Thanks for listening,\n> > Zack.\n> > _______________________________________________\n> > Speakup mailing list\n> > Speakup@braille.uwo.ca\n> > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n> - -- \n> web site: http://www.romuald.net.eu.org\n> gpg public key: http://www.romuald.net.eu.org/pubkey.asc\n> skype: gregn1\n> (authorization required, add me to your contacts list first)\n> \n> - --\n> Free domains: http://www.eu.org/ or mail dns-manager@EU.org\n> -----BEGIN PGP SIGNATURE-----\n> Version: GnuPG v1.4.6 (GNU/Linux)\n> \n> iD8DBQFGItKi7s9z/XlyUyARAm/ZAJ9arNfJsVggG4MdOg3KsvEreMd8UwCbBapK\n> MhPvIaialyxe2Ahzbfayajo=\n> =Qwnx\n> -----END PGP SIGNATURE-----\n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n-- \nI don't know why, but first C programs tend to look a lot worse than\nfirst programs in any other language (maybe except for fortran, but then\nI suspect all fortran programs look like `firsts')\n\t-- Olaf Kirch\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}