{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Paradigm Strategy Group<Paradigm.Strategy.Group@calcium.netcontentinc.net>", "subject": "Energy Options & Hedging -=?iso-8859-1?B?oA==?=Valuing & Trading Option Risk   June 5-8  San Diego ", "body": "\nParadigm Courses\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\t\tEnergy Options & Hedging -- Valuing & Trading Option Risk  \n\t\tSan Diego, CA  .  \n\t\tJune 5-8\n\n\n\n\n \nParadigm Strategy Group, Inc., \n\ta premier energy trainer, \n\tproudly brings the second course of its acclaimed \"Fundamentals\" programs, \n\talong with the new offering of Valuing, Trading, and Managing Option Risk to \n\tSan Diego from \n\tJune 5-8, 2007.  These courses are specially designed for \n\tthose needing an in-depth introduction to the tools and practices of energy trading and/or \n\toption hedging.\n\nEarly Bird & Special Promotions - Click Here to Learn More\nJune 5-6 - \n\tSan Diego, CA\n\tFundamentals of \n\tEnergy Options & Option Hedging \nThis complimentary course focuses on options and optionality - an obviously \n\teffective hedging instrument essential to functioning in the energy sector.  Together, these two programs provide an \n      understanding of the full scope of ideas that underlie today and \n      tomorrow's energy market.\n\nJune 7-8 - San Diego, CA\nA Manger's Perspective: Valuing, Trading & Managing Option Risk\nThe rapidly \n\temerging area of transactions involving two or more energy commodities is \n\ttoday's leading edge in innovative energy hedging technologies. The energy \n\tbusiness is a multiple fuel business with common dual-fuel concepts \n\tincluding Crack Spreads, Spark Spreads and Dark Spreads.  This seminar \n\texplores these and other multi-fuel transaction structures in the form of \n\tswaps and options as well as dual-commodity physical supply structures (e.g. \n\tselling power indexed to natural gas prices). Particular attention will be \n\tfocused on natural gas-power structures including Spark Spread derivatives, \n\tsuch as those embedded in generation capacity and heat rate options.\n\nClick Here To Download A Complete Course Brochure\n\n\tThese programs are basic level (group-live offering) courses with no \n\tprerequisites or advanced preparation required.  \n\n\tCPE credits for Fundamentals of Energy Options & Option Hedging are: Marketing 1, Management Advisory Services 1, Economics 1, Specialized Knowledge & Applications 11: Total=14.  CPE \n\tcredits for Valuing, Trading & Managing Option Risk are: Marketing 2, \n\tManagement Advisory Services 1, Economics 1, Production 5, Specialized \n\tKnowledge & Applications 5: Total=14.\n\n\n\nWe provide practical \n      non-theoretical training in energy derivatives, and their related risk \n      management technologies.  Programs are structured to the specific needs of \n      today's dynamic energy industry and are designed to excite participants by \n      knocking down the myths and mystiques built around derivative products.  Our instructors offer participants a clear understanding of the \n      business potential arising from combining physical energy and financial \n      products.\n\n\n\n \n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to gvwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}