{"category": "spam", "to_address": "micbaloy2007@aim.com", "from_address": "micbaloy2007@aim.com", "subject": "FROM: MICHEAL BALOY", "body": "\n\n \n\nFROM: MICHEAL BALOY\nTEL: +27 76 489 3048.\nEMAIL:micbaloy@yahoo.co.uk\n \nDear Sir & Madam\n \nI know you will be surprise to receive this letter. I am MR.MICHEAL BALOY the only son of the General \nEDWARD BALOY who was killed during a bloody shoot out claimed the lives of 24 Cols and Generals including the life of the late SAVIMBI of republic of ANGOLA.\nI got your contact through the South African information of Exchange (S.A.I.E) regarding your trust worthy, as such; I\ndecided to ask for your assistance to transfer some money Out of SOUTH AFRICA into your personal or company account.\nBe fore my father's death, he was the General in charge of Arms and Ammunition purchase for the Republic of Angola\nArms Forces. And in his will he specifically drew my attention to the sum of US$35.7 MILLION United State\nDollars) which was deposited in a private Security and finance company in SOUTH AFRICA.\n \nIN FACT MY FATHER SAID IN HIS \"WILL\"AND I QUOTE. MY BELOVED\nSON, I WISH TO DRAW YOUR ATTENTION TO THE SUM OF US$35.7\nMILION, WHICH I DEPOSITED IN PRIVATE SECURITY AND FINANCE\nCOMPANY IN SOUTH AFRICA, LIFE BEING\nUNPREDICTABLE ESPECIALLY IN THE MILLITARY. INCASE OF\nANYTHING TOMMORROW DO TAKE CARE OF YOUR MOTHER AND MAKE SURE SHE DO NOT LACK ANYTHING.\n \n>From the above, you will understand that the lives and our future depend on this money, as such we will\nbe very grateful if you can assist us. We are now living in South Africa as political asylum Seekers and financial\nlaw of republic of South Africa do not allow Asylum seekers certain financial right to such huge amount of money. In\nview of this, I cannot invest this money in South Africa, In this case, I'm asking you to assist me to transfer this money out\nof SOUTH AFRICA to your own personal or Company account overseas for investment purposes.\nFor your effort my family is willing to offer you 30% of the total Money, while 5% will be put aside for local and\ninternational expenses Incurred during the transaction and the balance I intend to invest in a Profitable venture in\nyour country or else where you may advice. Please Note that this transaction is 100% risk free, the major thing I\nrequire from you is absolute ASSURANCE that the money will be safe when transferred to your account, please endeavor to furnish us with your telephone number and fax number including your details.\nFinally, modalities on how to transfer this money will be discussed once a genuine interest from you is shown.\nPlease reply to this email: micbaloy@yahoo.co.uk  or micbaly1977@yahoo.co.uk \n \nPlease get to back to me urgent please.\n \nThanks and God Bless You,\n \nBest Regards.\n \nMR. MICHEAL BALOY(FOR THE FAMILY) \n\n\n\nCheck Out the new free AIM(R) Mail -- 2 GB of storage and industry-leading spam and email virus protection.\n\n\n"}