{"category": "ham", "to_address": "Don Hopkins <dhopkins@DonHopkins.com>", "from_address": "Dan Williams <dcbw@redhat.com>", "subject": "Re: [sugar] Cairo tile engine,\n\tand accessing 565 buffers from\tcairo and C", "body": "On Sat, 2007-04-14 at 17:10 -0700, Don Hopkins wrote:\n> I've been working on a cairo-based tile engine written in C as a Python \n> extension (part of my cellular automata machine module), which I now \n> have working well enough to display animated cellular automata in two \n> modes: as tiles or as pixels.\n> \n> To render tiles, you pass it an array of cairo surfaces you've read in \n> (or rendered), one for each tile, and it draws them by painting the \n> surfaces onto a cairo context you pass in.\n> \n> To render pixels, you pass it one cairo surface which it grabs pixels \n> out of, and it draws by storing the pixels into a destination image \n> surface. The caller can then render that destination surface on the \n> screen itself (scaling if it likes).\n> \n> Theoretically the tile mode could render tiny 1x1 colored tiles to \n> produce the same results as the pixel mode, but it would be much less \n> efficient to draw individual pixels by calling Cairo to copy 1x1 \n> surfaces. So I implemented the pixel mode to support single color tiles \n> directly, drawing into an offscreen cairo surface instead of using the \n> cairo context.\n> \n> I've read on the mailing list that Cairo supports 565 (\"begrudgingly\", \n> whatever that implies).\n\nIt means that cairo supports 565 only as a compatibility option, but\nwill _not_ allow you to create new surfaces as 565.  Basically, if you\nhand it a surface or pixel data that is in 565 format, it can use that\ndata.  But you cannot create 565 surfaces manually.  Cairo's native\nformat is 32 bit RGB with alpha.\n\nThe change to the LX and 256MB of RAM will help here, since the GPU on\nthe LX is more powerful and has more hardware accelerated conversion\noperations.  We'll need to do some tests, but we anticipate switching\nthe depth to 24bpp instead of 16.\n\nUnder the current builds, you just have to use 32-bit surfaces and let\ncairo/X smash them down to 565 on the fly, along with the performance\nloss, since the 8888 -> 565 conversion cannot happen in hardware on the\nGX.  There's not much you can do with 565 surfaces directly.\n\nDan\n\n> But the surfaces it's handing my C code are 32 bit (RGB or ARGB).\n> (Or at least that's what's happening on the emulator with a 16 bit 565 \n> screen -- I haven't tested it on the actual olpc yet).\n> How can I get ahold of the actual 16 bit 565 buffer that X can directly \n> and efficiently draw on the screen?\n> I've read through the Cairo code, and apparently it has no internal \n> support for 16 bit pixels.\n> So is it the xlib/xrender back-end that actually has a 16 bit buffer and \n> does the 888=>565 conversion?\n> Is there any way for my C code to get ahold of that buffer to draw \n> directly into it?\n> Or do I have to puff everything up to 32 bit color, just to let Cairo's \n> back-end stomp it back down to 565?\n> If there's a 565 screen buffer somewhere, there there should be a way \n> for C code to take a cairo context and use it to figure out the 565 \n> buffer to draw into (in the special case of the x backend).\n> (Of course it would be the C code's responsibility to respect Cairo's \n> CTM and know the pixel format and stuff like that, but that's just fine \n> since it goes with the territory, and is worth doing to make it draw \n> efficiently.)\n> \n> A direct access api to Cairo's 16 bit buffer would make it possible to \n> integrate SDL and other rendering libraries (like Mesa) with Cairo, \n> without going through another X window, so games and Python extensions \n> could draw more efficiently without doing lots of unnecessary format \n> conversions.\n> \n> I took a look at the USInvaders demo that uses PyGame and SDL, and it \n> looks like it just makes another X window that SDK draws in directly, \n> instead of going through Cairo. So SDL is drawing directly in 565, but \n> going around Cairo's back, using a GTK \"Socket\" window.\n> \n>     -Don\n> \n> _______________________________________________\n> Sugar mailing list\n> Sugar@laptop.org\n> http://mailman.laptop.org/mailman/listinfo/sugar\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}