{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Ben Finney <bignose+hates-spam@benfinney.id.au>", "subject": "Re: Request for suggestions of DFSG-free documentation licences", "body": "Shriramana Sharma  writes:\n\n> I remember reading that the GFDL is not DFSG-free (due to some clauses\n> regarding invariant sections or something)\n\nThe Debian project is in the strange situation that a license which\nhas many freeness issues[0] has been voted explicitly free without\nsupporting reasoning -- similar to the act of legislating that the\nvalue of pi is exactly 3, regardless of mathematics to the contrary.\n\nIn particular, the specific case of a work under GFDL without exercise\nof any of the clauses specifying non-modifiable document sections has\nbeen voted by general resolution[1] to meet the DFSG, despite all the\narguments to the contrary. The general resolution unfortunately gave\nno guidance on how to interpret this outcome, and many voters were\nlikely tired of the protracted debates on the topic so perhaps saw it\nas a way to avoid the discussion.\n\nNote that most documentation from the GNU project *does* exercise\nthose particular clauses, and so is not covered by this general\nresolution.\n\nThe consensus (not unanimous, but consensus nonetheless) of\ndebian-legal is that the DFSG, regardless of which of its clauses are\nexercised, is non-free for any software, including documentation.\n\n\n> so I would like to know what is a DFSG-free license for\n> documentation, since a project I am working on wants to license its\n> documentation in a DFSG-free way.\n\nChoose a single, free license to cover all the software: programs,\ndata, documentation, all of it. That is the simplest way to ensure\nthat all the software is free.\n\n\n[0] http://people.debian.org/~srivasta/Position_Statement.xhtml\n[1] http://www.debian.org/vote/2006/vote_001\n\n-- \n \\         \"Facts do not cease to exist because they are ignored.\"  -- |\n  `\\                                                     Aldous Huxley |\n_o__)                                                                  |\nBen Finney\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}