{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Terry Hancock <hancock@anansispaceworks.com>", "subject": "Re: License concerns regarding package lft", "body": "MJ Ray wrote:\n> Terry Hancock  wrote:\n>>No, what I *said* is that \"tools\" are not \"materials\", which they are\n>>not -- at least not unless you use them as such. If you build a house\n>>out of hammers, *then* the hammers are \"materials\", otherwise, they are\n>>\"tools\".\n> \n> So, to be clear: you would claim that if one says 'this house is made using\n> these materials' then the tools are not included in 'materials'?\n\nThis is not so much \"clear\" as \"completely different\", but yes, that is\nthe principle meaning of the word \"materials\" and the ony logical reason\nwhy the author would've used the term here.\n\nA court is going to consider what the apparent intent was -- not try to\nstretch the meaning beyond the obvious.\n\n> Would you expect an art *materials* catalogue to...\n\nHereafter, you are trying to stretch the meaning to something that it\nobviously wasn't intended to mean.\n\nYou can do that, because the license is POORLY WRITTEN. Which I have\nalready said. Miraculously, you and I appear to AGREE on that point.\n\nOne consequence of this is that some lawyer might try to play the same\ngames with the language that you are doing here.\n\nI think the court would laugh in his face, but who knows?\n\n> I'm trying to understand how it is possible to claim that compilers\n> don't fit the meaning of materials there\n\nThat would be by using the *normal*, *first* definition of \"materials\"\nand not some alternate meaning that has come about by association.\n\nThere is also the point that it wouldn't make any sense to require the\nmeaning you are attempting to press: is there even a compiler which can\nbe \"released in source format under conditions of this license\"? If not,\nthen it stands to reason that the author, knowing this, cannot have\nintended to limit compilation to such a hypothetical compiler. This is\nyet more evidence for an intent which agrees with the obvious\ninterpretation of the language.\n\nSo, are you saying you honestly believe the author's intent was to block\ncompilation of changes to his package altogether? If so, why distribute\nsource at all? Furthermore, you believe that having this irrational\nintent, he then tried to hide it by using a word which *might* be\ninterpreted to support his intent, but whose most obvious meaning\ncontradicts it?\n\nI find that a pretty implausible theory.\n\nYour interpretation is distorts the license's original intent by using\nalternate meanings of words. As such it may even be semantically correct\n(that is, it may be within the set of possible semantic meanings of the\nutterance), but it is pragmatically incorrect (it is not the subset of\nthat set that was meant by the author -- as we can tell from context).\nIntent is a matter of pragmatics[1] -- the study of situated utterances\nas evidence for meaning, not semantics[2] -- the study of isolated\nutterances for potential meaning.\n\nYou're pounding very hard on the semantics, trying to broaden the set of\npossible meanings, and you're not wrong about that as far as you go, but\nthat's missing the point. The question was not \"what could this sentence\npossibly mean\", but \"what did this sentence mean when the author wrote\nit\" -- which is what actually matters legally.\n\nThe rest of the license, the fact of using the license, the fact of\nreleasing software with source code and the consequences of licensing\nchoices all provide situational information which supports the pragmatic\ninterpretation of the sentence in question.\n\nThe fact that courts (or we) have to go beyond semantics to understand\nthe license is a serious flaw of the license, which I've already pointed\nout, but as evidence of the author's actual intent, I think it is\nsufficient.\n\nCheers,\nTerry\n\nIANAL, TINLA, etc.\n\n[1] http://en.wikipedia.org/wiki/Pragmatics\n[2] http://en.wikipedia.org/wiki/Semantics\n\n-- \nTerry Hancock (hancock@AnansiSpaceworks.com)\nAnansi Spaceworks http://www.AnansiSpaceworks.com\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}