{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 6/25/07 - Two Good Value Stocks", "body": "June 25, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\nBlueberry Pie Is On The Way\n\nHome Depot Gets Moving\n\nA Most Exciting Value Stock\n\n-----\n\nThis weekend I built a sturdy new bird-proof cage around my ten blueberry\nbushes, which by the first of July promise to be producing more berries\nthan we can eat.  These bushes stand over six feet tall, so the picking is\neasy, and I have three varieties, which ripen at slightly different times,\nso the season extends well into August.   \n\nSome of the berries will go on my morning bowl of cereal, others will be\nbaked into muffins and pies, some will go on ice cream, and plenty will be\neaten straight . . . perhaps the best way of all.  What we can't eat,\nwe'll give away or freeze, to be enjoyed in future months.\n\nBut this isn't a food column.  This is about the store where I bought all\nthe stuff to build that cage, Home Depot.  More precisely, it's about the\ncompany, and the stock.\n\nLast week Home Depot jolted investors with a number of announcements that\nsent its stock soaring.\n\nThe company announced it would sell its HD Supply business, which had\nrevenues of $12 billion last year, to a group of private investors for\n$10.3 billion.  The company had built HD Supply, the second-largest\ndistributor of construction, industrial and maintenance supplies in North\nAmerica, by buying numerous smaller companies over the years, but had\ntrouble translating its size into profits.\n\nIt announced it would repurchase $22.5 billion of its stock (more than 25%\nof its shares), its biggest buyback ever.\n\nIt announced it would take on more debt to accomplish this buyback.\n\nAnd it announced the awarding of stock grants to its 10,000 assistant\nstore managers.  The grants will vest four years after the award date and\nwill be distributed based on job performance.\n\nThe goal of all these changes is to increase earnings per share, and\nultimately get the stock back in an uptrend . . . and in the short term,\nat least, Home Depot has succeeded.  Following the announcement, the stock\nsurged from 38 to 40, hitting a level it hadn't seen since February.\n\nBut will this turn into a long-term uptrend?  I think the odds are good,\nand I say this because I named Home Depot Stock of the Month back in May\n2006!\n\nBack then the stock was trading at 40.  It had come to my attention\nthrough Roy Ward, who had added it to one of his portfolios in Cabot\nBenjamin Graham Value Letter.  I liked Roy's reasoning, and as a frequent\ncustomer of the company, I believed in its long-term value, so I wrote it\nup for Stock of the Month.  Here's some of that article.\n\n\"Home Depot was founded in 1979 by Bernie Marcus and Arthur Blank, who\nlocated the first two stores of what was planned, at the start, to be a\nnationwide chain, in Atlanta, Georgia.  By 2000, the chain had grown to\n1,000 stores and the stock had hit 70, a height it has yet to equal. \nThen, as the stock market bubble burst, the company saw its first quarter\nof earnings shrinkage!  So Blank retired in 2001 (he bought the Atlanta\nFalcons soon after), while Marcus retired in 2002.\n\nSince then, Home Depot has more than doubled its store count, and expanded\nin many directions.  Over 1,000 stores offer tool rental services, over\n1,600 offer contractor services.  There are 34 Expo Design stores.  You\ncan buy over 30,000 products online. . . the upward trend of earnings was\nrestored in 2001, and today earnings are up 130% since 2000.  But the\nstock is still 43% below that old high ... and therein lies the value.\n\nActually, it's more complicated than that, and the reason that the\nBenjamin Graham system works is that few people make the effort to go\nthrough the laborious calculations required to ensure that they're buying\na quality company at a reasonable price.  But Roy Ward does, weighing the\nvalue of some 46 different factors, both fundamental and technical, to\ndetermine that the company is still sound, will not go bankrupt, is\nprudently run, and has a margin of safety in its price that ensures that\neven a business hiccup will not do much damage to the stock price.\"\n\nBack then, Roy's maximum buy price was $48.72.  Today it's 44.44.   \nSmart investors have been able to buy this stock as low as 36 in recent\nmonths, and they're smiling today.  Roy's target, by the way, is 60.00,\nwith the expectation that it will take some time to get there.  Patience\nis required.  But that's normal for value investors.\n\nIn the long run, we're optimistic that the company's announcements last\nweek will prove powerful enough to change investors' opinions of the\ncompany, and that as those opinions improve (and earnings per share pick\nup), the stock will resume its old upward trend.\n\nAs it sits now, it's still 44% below its old 2000 high, and still below\nthe 42 level where it peaked in February.  But I'm confident it will\nexceed both those levels in time.\n\nAnd if the president wants one more idea on how to increase profitability,\nhe should consider closing a few stores.  Today Home Depot has 2,184\nstores worldwide and employs about 364,000 people.   \nThree of those stores are within a 15-minute drive of my house, and if any\none of them were shuttered, I'd still be a good customer.\n\n----- Advertisement -----\n\nOur \"High-Yield Security of the Month\" Offers a 19.6% Dividend Yield\n\nIf you're looking for both high yields and enormous capital gains, then\nyou need to learn more about our \"High-Yield Security of the Month\" for June\n2007. This stable, diversified fund not only pays a 19.6% dividend yield,\nbut it also gives investors exposure to one of the world's\nfastest-growing foreign markets. As a result, the fund has delivered average \ntotal returns of +38.6% per year since 2004.\n\nLearn the name of this security right now...\n\nhttp://www.streetauthority.com/p/hy/2007/06-01-som-cabot.asp\n.\n-----\n\nAdmittedly, Home Depot's story is not particularly exciting; I like it\nbecause it's dependable.  But there are value stories that are exciting,\nand Roy Ward featured one in his latest issue, in which he profiled six\ncompanies with low PEG  (price divided by earnings growth) ratios and\nbright futures expectations.\n\nThe exciting company is JA Solar (JASO), a Chinese manufacturer of solar\npower cells.  JA makes just the cells, and markets them to other\nmanufacturers, who assemble them into complete modules.  Demand for solar\npower, of course, is exploding all over the world, driven by government\nsupports, increased awareness of the pollution and global warming that\ncome from fossil fuels, and falling prices.  (One manufacturer has a goal\nof reaching parity - where electricity from its cells costs the same as\nfrom the grid - by 2010.)\n\nBut to see logic that described a solar power company as a good value was\nan eye-opener to me!  The key factor lies in the projected earnings\ngrowth.  Roy projects that JA Solar's earnings will jump 50% over the next\ntwelve months and expand an average of 30% annually over the next five\nyears.\n\nIf you make those assumptions, you get a very low PEG ratio of 0.69.   \nAnd that makes JASO a very attractive growth stock.\n\nFor the record, JA Solar's first quarter report revealed revenues of $43.3\nmillion, up from $0.4 million the year before, and earnings of $0.18 per\nshare, the fourth consecutive quarter of profits.  The profit margin?  A\nfat 18.0%.\n\nAlso making it attractive (at least in my book) is the chart, which\nreveals a stock in a strong uptrend.  When Roy wrote his recommendation,\nJASO was trading at 24.  Today it's 31, hitting new highs.  Next week, who\nknows?\n\nBottom line, solar power is one of the strongest sectors out there, and JA\nSolar is one of the top three stocks, based on performance.   \nIf valuation makes it even more attractive, so much the better!\n\n-----\n\nEditor's note:\n\nIf you'd like more value-based investing ideas - both dependable and\nexciting - consider a no-risk trial subscription to Cabot Benjamin Graham\nValue Letter.  It's the only investment advisory letter to use the classic\nBenjamin Graham system, and its results are superb!  Best of all is the\nfact that it's easy to use.  You buy and hold, and you don't sell until\nyour stocks reach their Minimum Sell Price.\n\nRecent profits:  25% in Ceradyne in five months, 56% in Total System\nServices in 17 months, and 22% in Exxon Mobil in 8 months.  For low-risk\ninvesting, you can't do better!\n\nTo get started, simply click the link below.\n\nhttp://cabotmail.net/t/203929/13148861/97/0/\n\n-----\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n\n-----\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=203929&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}