{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "Tonight on CNN <mailings@mail.cnn.com>", "subject": "Massacre at Virginia Tech", "body": "\n\n\n\nTonight On CNN Email\n\n\n\n\n\n\n\nApril 18, 2007\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n7 p.m. ET\n\n\n \n\nPRIME-TIME COVERAGE:  Massacre at Virginia Tech\n\n\nCNN teams are live from Virginia Tech with the a look at the warning signs, the possible motive, and the gunman's checkered past.  Plus, hear from the last survivor to have seen the shooter alive! Our Primetime Special coverage begins tonight at  7 ET.\n\n\n\n\nRelated:• Cho's professor to classmates: Don't feel guilty• Police: Cho taken to mental health center in 2005• Source: Gunman angry at 'rich kids'• Victim grew up 2 minutes from Cho• Special Report\n\n\n\n\n\n\n\n \n \n\n\n\n\n\n \n\n\n\n\n6:00 a.m. ET\n\n\n \n\nAmerican Morning\n\n\nOur coverage of the Virginia Tech tragedy continues. Wake up with John Roberts & Kiran Chetry as new details continue to pour in.\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n6:00 p.m. ET\n\n\n \n\nLou Dobbs Tonight\n\n\nWith reports from around the world, Lou offers a unique look at the latest news.\n\n\n\n\n\n\n\n7:00 p.m. ET\n\n\n \n\nThe Situation Room\n\n\nWolf Blitzer is LIVE from VA Tech with a look at missed warnings signs the shooter was dangerous.\n\n\n\n\n\n\n\n8:00 p.m. ET\n\n\n \n\nPaula Zahn NOW\n\n\nHear from the survivor who may have been the last to see the Virginia Tech shooter alive.  Paula Zahn is LIVE from the scene.\n\n\n\n\n\n\n\n9:00 p.m. ET\n\n\n \n\nLarry King Live\n\n\nNew disturbing details on the gunman in the Virginia Tech shooting from his roommate.  Plus, stories of horror and heroism with victims families and survivors.\n\n\n\n\n\n\n\n10:00 p.m. ET\n\n\n \n\nAnderson Cooper 360\n\n\nImaginary friends, stalking classmates, violent writings and more.  Why didn't anyone put all the warning signs together in time?  How did a mass murderer fly under the radar?  Anderson is LIVE from campus getting answers.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n\nSend us your feedback >  |  CNN's full program schedule >  |  E–mail sign up >\n\n\n\n\n \n \n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network LP, LLLP.\nA Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us. \n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the Tonight on CNN list, click here. \n\n\n\n\n\n\n\n"}