{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Anti-war mom Cindy Sheehan gives up her protest", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMay 29, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nAnti-war mom Cindy Sheehan gives up her protest\n\n\n\n\n\nCindy Sheehan, the California mother who became an anti-war leader after her\nson was killed in Iraq, declared Monday she was walking away from the peace\nmovement.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPatriots' Marquise Hill's body found\n\n\n\n\n\nNEW ORLEANS (AP) --The body of New England Patriots player Marquise Hill was\nfound Monday, a day after he was reported missing following a jet ski accident\non Lake Pontchartrain.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nRain pelts Texas, Oklahoma as storm lingers\n\n\n\n\n\nRain soaked the Plains states on Monday in a lingering storm blamed for five\ndead, two missing and more than 1,000 people stranded over the Memorial Day\nweekend. The storm's latest lashing caused some minor flooding and road\nclosures.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nBush: Fallen troops' sacrifice helps build better world\n\n\n\n\n\nPresident Bush marked Memorial Day with a call for Americans to stand firm in\ntheir efforts against U.S. enemies around the world and with a tribute to\nfallen troops.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWiccan pentacle will finally mark fallen soldiers' graves\n\n\n\n\n\nSince Korean War veteran Jerome Birnbaum died in 2005, his grave in a pagan\ncemetery had been marked with only a pile of stones and U.S. flags.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhales back to within 45 miles of ocean\n\n\n\n\n\nRescuers were encouraged by the progress two lost whales have made toward\ntheir ocean home but were concerned about encounters the two might have with\nlarge ships as they near San Francisco Bay.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nResidents not sure two bullets enough to stop giant lizard\n\n\n\n\n\nPolice say they're sure they shot a four-foot-long, 80-pound monitor lizard\nthat had been lurking in an Orlando suburb for months.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nTroops fire tear gas, rubber bullets in TV station protest\n\n\n\n\n\nVenezuelan police fired tear gas and plastic bullets into a crowd of thousands\nprotesting a decision by President Hugo Chavez that forced a television\nstation critical of his leftist government off the air.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNigerian president hails successor\n\n\n\n\n\nPresident Olusegun Obasanjo bid farewell to Nigeria, saying Africa's\nmost-populous nation had grown stronger and more united during his eight years\nof civilian leadership after years of ruinous military rule.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMalaysian PM: Muslims 'at crossroads'\n\n\n\n\n\nMalaysia, Indonesia, Kuwait, the United Arab Emirates and Pakistan have\nchallenged Islamic countries to work together to create a new golden age to\nliberate Muslims from poverty, conflict and extremism.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nU.S. tells Iran face to face: Stop supporting militias\n\n\n\n\n\nThe United States told Iran on Monday its support for militias fighting in\nIraq needs to cease, said Ryan Crocker, U.S. ambassador to Iraq.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nWelcome back, Wall Street\n\n\n\n\n\nSuntanned and barbecued investors returning after the long Memorial Day\nweekend have about a day to reorient themselves before the next big onslaught\nof market-moving news. By Wednesday, they better be ready.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOil prices sink by $1 after Nigerian strike ends\n\n\n\n\n\nOil fell a dollar Monday after Nigerian oil unions suspended a two-day strike\nthat had threatened to halt oil shipments from the world's eighth-largest oil\nexporter over the weekend .\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nIan Thomsen: Spurs grind out testy Game 4 win\n\n\n\n\n\nSALT LAKE CITY -- For awhile this felt a lot like a European playoff game in\none of those Greek or Spanish arenas where the fans never shut up and every\nbasket is greeted as a tragedy or a miracle. Manu Ginobili learned to play in\nthis kind of setting, and he looked entirely comfortable while bulling his way\nto the foul line for 15 fourth-quarter points to turn a tight Game 4 into a\n91-79 Spurs rout.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMichael Farber: Penalties could cost Ducks the Cup\n\n\n\n\n\nThe Mensa Committee met in emergency session in Southern California on Monday\nnight and, after some studious deliberation, decided to withdraw its\nmembership application from Anaheim Ducks second-year center Ryan Getzlaf, who\napparently checked his brains at the door at the exact moment he was\ncross-checking Ottawa Senators right winger Mike Comrie to the ice in the\nsecond period.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nTandem cycling: Not just Daisy's bicycle built for two \n\n\n\n\n\nWhen Tracey Trumbull and his wife, Cathy, go for a bike ride, they don't have\nto worry about keeping up. They're always together, on a tandem bicycle.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nResearchers find big batch of breast cancer genes\n\n\n\n\n\nA genetic mutation that raises the risk of breast cancer is found in up to 60\npercent of U.S. women, making it the first truly common breast cancer\nsusceptibility gene, researchers report.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nInfrared burners heat up backyard grills\n\n\n\n\n\nFor a quarter century, chefs at pricey steakhouses have been searing meat on\nburners that cook with infrared energy. Now the high-temperature technology\nmay be coming to a backyard barbecue near you.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGoogle defends data policy\n\n\n\n\n\nGoogle will tell Brussels it needs to hold on to users' search data for up to\ntwo years for security and commercial reasons after being warned it could be\nviolating European privacy laws by doing so.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\n'Pirates' sets Memorial Day record\n\n\n\n\n\n\"Pirates of the Caribbean: At World's End\" hauled in $142.1 million to\ncommandeer the record for best Memorial Day weekend debut, capping a huge\nmonth that puts Hollywood on track for record summer business.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCannes' top prize goes to film about abortion\n\n\n\n\n\nRomanian director Cristian Mungiu won the Cannes Film Festival's top prize\nSunday with \"4 Months, 3 Weeks and 2 Days,\" a harrowing portrait of an illegal\nabortion in communist-era Romania.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}