{"category": "spam", "to_address": "\"Davina Jacobs\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"Todd Sampson\" <rpenrodua@atomj.com>", "subject": "raspolagaiu zasfernika", "body": "\n\n\n\n\n\n\nDon't want to expose your private life? \nClick to visit us\nU can restore your health right now. Doesn't matter what the problem is - we pills to cure everything. Erection Dysfunction, Weight loss, Anti-Depressant, Antibiotics and even more! Fantastic low prices! \nClick to visit us\nFantastic low prices! Instant shipping directly from our warehouses!\nWith best regards,\nTodd Sampson\n \n \nNe vospolzovalsia? A ved Mag vel sebia kak-to stranno. Pochemu by nam srazu ne pristupit K delu? Ia znaiu, chto nuzhno vam, a vy znaete, chto nuzhno mne. Poetomu mysl o tom, chto ih sovmestnoe puteshestvie mozhet Okazatsia stol skorotechnym, vyzvala v dushe otchaiannyj protest. Chto eto, galt ego poderi, takoe? Vmesto zheltoj plastodorozhki i Krasnovatogo peska, vmesto silovoj ogrady i meshaniny iz gigantskih krasnyh Lopuhov s bujnym perepleteniem serostvolnyh pobegov za nej, vmesto Vozdushnyh katerov i promozgloj syrosti shelty komnata. \n4. S etim parnem ne soskuchishsia. Zatem glaz Zahlopnulsia. I tak iasno, chto Otlichno vygliadit. \n  Ponimaesh, U menia teper net bankosa, i. Sverhchuvstvenno nastroennoe vospriiatie, mgnovenno sreagirovav na ulovlennuiu Opasnost, razvernulos skaniruiushchim pautinnym ekranom-setiu vo vsej polnote, Nakryv uchastok mestnosti okolo kilometra v diametre. Pozhelaesh i apparat Zajmetsia podborom melodii samostoiatelno. \n  Onni tozhe ot takogo zveria ne Otkazalas by. Trans ispolzoval otpushchennoe vremia po-svoemu, zaniavshis Proverkoj rabotosposobnosti zanovo otrashchennoj, nichem ne otlichavshejsia ot Prezhnej kisti, szhimal i razzhimal korotkie palcy, vertel kistiu v raznye Storony. A vot zdes ne speshi, Nkot pogrozil mne ukazatelnym palcem, kak Malcu, pojmannomu na kakoj-to neblagovidnoj shalosti. Zatem medlenno Pokachal golovoj: Vot ono chto. \n  Ia chuvstvoval inoe. Ne vremia i ne mesto privlekat k sebe nenuzhnoe vnimanie.  deremorinoli Z3Zjb3JtYWNAc3BlZWR5LnV3YXRlcmxvby5jYQ=\n \n\n\n"}