{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWEDNESDAY 16 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tIn tonight's programme: \n\n\nPrince Harry NOT to serve in Iraq \n\n\nIs this a victory for Al Qaeda and its threats? What kind of message does this send to our troops - spilling their blood is fine but not blue blood. \n\n\nThis week we've been focusing on Iraq. Here are the details if you missed Mark's film - three days and nights with the second battalion 12th US infantry - or last night's film with Tim Whewell showing life in one of the most dangerous parts of Baghdad - Sadr city. \n\n\nIraq in-depth - click here to view previous reports \n\n\nGrammar Schools \n\n\nThis is shaping up to be the first really serious internal policy row for David Cameron with his own party. \n\n\nIt appears to be a conflict between the cherished Tory belief in meritocracy (in favour of bright children going to grammar schools) and the contrary view from Shadow Education Secretary David Willetts that \"academic selection entrenches advantage, it does not spread it.\" \n\n\nThe Coronation \n\n\nAt the time of writing it could be that Zombie Brown will not face any challenger for the Labour leadership. \n\n\nWe'll assess the impact of the coronation - if that's what it is - and have the result of a special Newsnight poll at the hustings for the race to be deputy leader. \n\n\nGavin \n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nINSIDE SADR CITY\n\n\t\t\t\t\t\t\tSadr City has become the focus of the US military's surge to root out sectarian death squads in Baghdad.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}