{"category": "ham", "to_address": "Johann Hanne <jhml@gmx.net>", "from_address": "Alison Winters <alisonw@sgi.com>", "subject": "Re: Setting \"winbind separator\" to '\\' in smb.conf", "body": "Johann Hanne wrote:\n> On Sunday 29 April 2007 18:36, simo wrote:\n>> On Sun, 2007-04-29 at 13:01 +0200, Johann Hanne wrote:\n>>> there is currently no obvious way to explicitly set the winbind separator\n>>> to '\\' in smb.conf. Even worse, the default given in the man page of\n>>> smb.conf is wrong:\n>> Have you tried: winbind separator = \"\\\\\" ?\n> Just tried it with 3.0.25rc3. It results in the actual seperator being a \n> double quote (\"), and '\\\\' results in a single quote ('). As it seems that \n> even a Samba insider falls about the smb.conf parsing, I feel assured that \n> there should be an extra paragraph in the smb.conf man page explaining that a \n> backslash is *NEVER* treated in a special way except for line continuation \n> (that's why \\\\SERVER\\SHARE is a valid notation) and that single/double quotes \n> only have a special meaning with certain keywords (e.g. passdb backend).\n> \nI think this whole problem is symptomatic of the somewhat chaotic\nhandling of the smb.conf options.  For instance, when Ed Plese and i\nwere discussing the shadow copy improvements, we needed to be able to\nhave literal percents (%) in the smb.conf file, but there is no standard\nway to do this.  %% does not work as expected.  %[char] is treated as a\nvariable substitution, but only for certain options (i.e. those grabbed\nwith alloc_sub_basic and friends), and there's no obvious indication in\nthe manpages about which options do and don't get substitutions.\n\nIt would be nice if there was a clearly defined standard for what\ncertain characters meant in the config file - something that worked for\nevery option, not just on an undocumented case-by-case basis.  An\nexample might be:\n\n1. Options must fall into one of the following types:\n   BOOL\n      valid values: true/false/1/0/yes/no\n   INTEGER\n      valid values: [::digit::]+\n   STRING\n      valid values: any utf-8 chars, backslash is not significant\n   LIST\n      valid values: space-delimited STRINGs, backslash is only\n                    significant to indicate non-breaking space or\n                    to escape itself\n\n   The type for each option should be listed in the man page.\n\n2. For STRING and LIST types, there is an additional type modifier of\n   variable substitution or not.  For substitution-enabled types,\n   %% is interpreted as a literal percent.  %[unknown-char] is an\n   error that will cause testparm to choke.\n\n   This also should be listed in the man page.\n\nThe above is just an example - i'm sure there are corner cases missing -\nbut i think the point stands.  smb.conf options should be standardized\nand all the documentation and code updated so it works predictably in\nall cases.\n\nAlison\n\n"}