{"category": "ham", "to_address": "Thomas Lumley <tlumley@u.washington.edu>", "from_address": "Frank E Harrell Jr <f.harrell@vanderbilt.edu>", "subject": "Re: [R] help comparing two median with R", "body": "Thomas Lumley wrote:\n> On Tue, 17 Apr 2007, Robert McFadden wrote:\n> \n>>> -----Original Message-----\n>>> From: r-help-bounces@stat.math.ethz.ch\n>>> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Jim Lemon\n>>> Sent: Tuesday, April 17, 2007 12:37 PM\n>>> To: Pedro A Reche\n>>> Cc: r-help@stat.math.ethz.ch\n>>> Subject: Re: [R] help comparing two median with R\n>>>\n>>> Pedro A Reche wrote:\n>>>> Dear R users,\n>>>> I am new to R and  I would like to ask your help with the following\n>>>> topic. I have three sets of numeral data, 2 sets are paired and a\n>>>> third is independent of the other two. For each of these sets I have\n>>>> obtained their basic statistics (mean, median, stdv, range ...).\n>>>> Now I want to compare if these sets differ. I could compare\n>>> the mean\n>>>> doing a basic T test . However, I was looking for a test to compare\n>>>> the medians using R.   If that is possible I would love to\n>>> hear the\n>>>> specifics.\n>>> Hi Pedro,\n>>> You can use the Mann-Whitney test (\"wilcox\" with two\n>>> samples), but you would have to check that the second and\n>>> third moments of the variable distributions were the same, I think.\n>>>\n>>> Jim\n>> Use Mann-Whitney U test, but remember about 2 assumption:\n>> 1. samples come from continuous distribution (there are no tied\n>> obserwations)\n>> 2. distributions are identical in shape. It's very similar to t-test but\n>> Mann-Whitney U test is not as affected by violation of the homogeneity of\n>> variance assumption as t-test is.\n>>\n> \n> This turns out not to be quite correct.\n> \n> If the two distributions differ only by a location shift then the \n> hypothesis that the shift is zero is equivalent to the medians being the \n> same (or the means, or the 3.14159th percentile), and the Mann-Whitney U \n> test will test this hypothesis. Otherwise the Mann-Whitney U test does not \n> test for equal medians.\n> \n> The assumption that the distributions are continuous is for convenience -- \n> it makes the distribution of the test statistic easier to calculate and \n> otherwise R uses a approximation.  The assumption of a location shift is \n> critical -- otherwise it is easy to construct three data sets x,y,z so \n> that the Mann-Whitney U test thinks x is larger than y, y is larger than z \n> and z is larger than x (Google for Efron Dice). That is, the Mann-Whitney \n> U test cannot be a test for any location statistic.\n> \n> There actually is an exact test for the median that does not assume a \n> location shift:  dichotomize your data at the pooled median to get a 2x2 \n> table of above/below median by group, and do Fisher's exact test on the \n> table.  This is almost never useful (because it doesn't come with an \n> interval estimate), but is interesting because it (and the generalizations \n> to other quantiles) is the only exactly distribution-free location test \n> that does not have the 'non-transitivity' problem of the Mann-Whitney U \n> test.  I believe this median test is attributed to Mood, but I have not \n> seen the primary source.\n> \n>  \t-thomas\n\nThe Mood test is so inefficient that its use is no longer recommended:\n\n@Article{fri00sho,\n   author =               {Freidlin, Boris and Gastwirth, Joseph L.},\n   title =                {Should the median test be retired from \ngeneral use?},\n   journal =      American Statistician,\n   year =                 2000,\n   volume =               54,\n   number =               3,\n   pages =                {161-164},\n   annote =               {inefficiency of Mood median test}\n}\n\nThe points that Thomas and Brian have made are certainly correct, if one \nis truly interested in testing for differences in medians or means.  But \nthe Wilcoxon test provides a valid test of x > y more generally.  The \ntest is consonant with the Hodges-Lehmann estimator: the median of all \npossible differences between an X and a Y.\n\nFrank\n\n\n-- \nFrank E Harrell Jr   Professor and Chair           School of Medicine\n                      Department of Biostatistics   Vanderbilt University\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}