{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 5, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESCops Search For Missing Kansas Teen\nPolice in Overland Park, Kan., are looking at a surveillance video showing a missing 18-year-old girl being forced into her\n                        car at a Target store where she had shopped. They're hoping the video will help locate a person of interest in the case. More...\n• \"Scooter\" Libby Gets 30 Months In Jail\n                     \t\t\t\t\t| Watch• 4th JFK Terror Suspect Surrenders\n                     \t\t\t\t\t| Watch• Transplant Team Crash Survivors UnlikelyU.S.Mom AWOL Over Child Custody To Surrender\nA National Guard member in Iraq received emergency leave when her ex-husband was arrested on abuse charges while caring for\n                        their daughter. As she fights for custody, the Army has declared her AWOL and may throw her in prison.  More...\n• 4th JFK Terror Suspect Surrenders\n                     \t\t\t\t\t| Watch• Transplant Team Crash Survivors Unlikely• Extreme TB Patient's 3rd Test Is Negative\n                     \t\t\t\t\t| Watch• More StoriesWorldPolish Teen's Holocaust Diary Revealed\nThe chronicle by the \"Polish Anne Frank\" was kept by a non-Jewish friend for more than 60 years before it was turned over\n                        to Israel's Holocaust Museum. \"I'm turning into an animal waiting to die,\" wrote Rutka Laskier. She did, in August 1943. More...\n• Group: Olympics Force Mass Evictions• Bush: Putin Has \"Derailed\" Democracy\n                     \t\t\t\t\t| Watch• Castro Interview To Air Tuesday• More StoriesPoliticsHillary: Faith Got Me Past Bill's Affair\nIn a rare, frank comment about her husband's infidelity, Sen. Hillary Clinton said her faith in God got her through his affair.\n                        She was speaking with other Democratic presidential front-runners at a forum on faith and social justice. More...Watch: Hillary 'A Woman In Charge'\n• Wyoming Senator Craig Thomas Dead At 74• \"Scooter\" Libby Gets 30 Months In Jail\n                     \t\t\t\t\t| Watch• Catholic Bishop Raps Rudy On Abortion• More StoriesHealth9 Tips To Keep Young Athletes In The Game\nTo reduce injury or burnout, child and teen athletes should take 1 to 2 days off from sports per week, says the American Academy\n                        of Pediatrics.\n                         More...\n• Extreme TB Patient's 3rd Test Is Negative\n                     \t\t\t\t\t| Watch• \"Genius Pill\" May Relieve Chemobrain• At-Home Kit Tests Man's Fertility• More StoriesSciTechThousands Flee Oman's Coast Before Cyclone\nCyclone Gonu, with winds gusting up to 195 miles an hour, is heading toward the oil-rich Persian Gulf region. Most of Oman's\n                        key oil facilities are on the northeastern coast and not directly in the storm's projected path. More...\n• Did Chickens Beat Columbus To New World?• Can Ask.com Take A Bite Out Of Google?• Komodo Dragon Kills 8-Year-Old Boy • More StoriesBusinessBillionaire Burkle May Bid For Dow Jones\nThe Independent Association of Publishers' Employees union says billionaire investor Ron Burkle is interested in exploring\n                        a bid for Dow Jones & Co., publisher of The Wall Street Journal. More...\n• U.S. Auto Slump Moves Beyond The Big Three• Fed Chief: Economy To See Moderate Growth• The Unvarnished Truth About Savings• More StoriesEntertainmentBrangelina Bonds At Bath Time\nAngelina Jolie says her partner Brad Pitt has a knack for bringing her out of her shell. \"I don't know how he does it, but\n                        ... I talk a lot in the bath,\" she says. \"Get naked with me, and I'll talk!\" More...Watch: Brangelina Arrives At Cannes\n• Clarkson Letters Read At Spector Trial• Fresh Look At Princess Di\n                     \t\t\t\t\t| Watch• Oprah Talks To Reclusive Novelist• More StoriesOpinionHedge Hogs\nHedge fund managers can pull in more than $1 billion a year, yet face a much lower tax rate than people who make far less\n                        than them, all thanks to a distorted tax structure supported by conservatives, says The New Republic. More...Watch: MoneyWatch\n• GOP Must Focus On The Family\n                     \t\t\t\t\t| Watch• A Lot To Love In Immigration Bill\n                     \t\t\t\t\t| Watch• Containing The Chaos In Iraq\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Recipes: Taste Of Home's Winning Vegetable Recipes\nTaste of Home magazine has sponsored a cooking contest for vegetable recipes which they call Garden's Bounty. The winning\n                        recipe, for a fresh tomato sauce served over spaghetti squash, makes an ideal vegetarian entree or a light summer lunch.  More...Watch: Harvesting A Winning Recipe\n• EARLY SHOW: At-Home Kit Tests Man's Fertility• EARLY SHOW: Climbing Plants Help Beauty Grow\n                     \t\t\t\t\t| Watch• CBS Evening News: Operation Rebound Goes The Extra Mile\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nKevorkian: Death A Given RightCBS News RAW: Following his release from prison, assisted suicide advocate Dr. Jack Kevorkian maintained that death\n                                    is a natural right that the U.S. legal system withholds from its citizens.\nTOP VIDEOS\nAustralia Train-Truck Crash\nLibby Sentenced To Prison\nHippo Hygiene Day\nBush Seeks Russian Agreement\nHillary 'A Woman In Charge'\nAnswers To Strange Questions\n'Early Show' Challenge Winners\nPenguins On The Plaza\nDiana's Legacy, 10 Years Later\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesHear from Dr. Jack Kevorkian, in his first post-prison interview with Mike Wallace. This Sunday, 7 p.m. ET/PT.48 Hou!\n rs Myste\nryLove And Lies:Murder exposes the secret lives of a suburban couple. Peter Van Sant reports, Tuesday, June\n                           5, at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}