{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nFriday, 15 June, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nTransfer probe queries 17 deals\nSeventeen transfers and five Premier League clubs are named in Lord Stevens' probe into alleged transfer irregularities.\n\n\n\n \nAshley boosts stake in Newcastle\nMike Ashley is on course to withdraw Newcastle United from the stock exchange after lifting his stake.\n\n\n\n \nSpurs new favourites to land Bent\nSpurs are in pole position to land Darren Bent after he turns down a move to West Ham.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nLive - US Open\nEngland's Paul Casey makes the big move despite difficult scoring conditions in the second round of the US Open.\n\n\n\n \nClassy Casey makes Oakmont move\nEngland's Paul Casey posts a remarkable four-under 66 to set a challenging halfway target at the US Open.\n\n\n\n \nUS Open clubhouse scores\nLatest scores from Oakmont.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nAlonso sets pace in Indianapolis\nMcLaren's Fernando Alonso is fastest in first practice for Sunday's US Grand Prix with team-mate Lewis Hamilton third.\n\n\n\n \nBayliss sets pace in San Marino\nWorld Superbikes champion Troy Bayliss claims provisional pole for the San Marino Grand Prix.\n\n\n\n \nLoeb trailing Higgins in Donegal\nBritish champion Mark Higgins leads world champion Sebastian Loeb after day one of the Donegal International Rally.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nAlonso sets pace in Indianapolis\nMcLaren's Fernando Alonso is fastest in first practice for Sunday's US Grand Prix with team-mate Lewis Hamilton third.\n\n\n\n \nHamilton rejects Alonso complaint\nLewis Hamilton describes Fernando Alonso's claim that McLaren are favouring him as \"strange\".\n\n\n\n \nKubica ruled out of Indianapolis\nBMW Sauber driver Robert Kubica is out of the US Grand Prix after doctors rule he is not fit to race after his crash in Canada.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nYelling withdraws from GB squad\nLiz Yelling pulls out of the GB marathon squad for this summer's World Athletics Championships in Osaka.\n\n\n\n \nPowell eyes Golden League repeat\nAsafa Powell steps his quest for a first global 100m crown at Friday's Golden League opener in Norway.\n\n\n\n \nTomlinson leap boosts Cup hopes\nLong jumper Chris Tomlinson produces his best effort for nearly three years in Prague ahead of the European Cup.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nBasso handed two-year doping ban\nIvan Basso receives the maximum two-year doping ban from the Italian cycling federation.\n\n\n\n \nHammond eyes Tour de France spot\nBriton Roger Hammond heads to the Tour de Suisse on Saturday hoping to secure a spot at next month's Tour de France.\n\n\n\n \nMoreau wins to boost Libere hopes\nChristophe Moreau claims a solo win in stage four of the Dauphine Libere to climb to second overall.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nReview of the week\nMichael Vaughan hits the town as Messi keeps his hand in\n\n\n\n \nQuotes of the Week\nRamon Calderon on David Beckham, plus Lewis Hamilton and Graham Taylor\n\n\n\n \nTen to Tackle\nTest your knowledge of the last seven days in sport\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}