{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"Tech Laboratories\"<Lareine.Roark@awmills.com>", "subject": "TLBT to Acquire Second Biodiesel Product Line", "body": "\n\n\nTLBT to Acquire Second Biodiesel Product Line\n\n\n\n\nTLBT to Acquire Second Biodiesel Product Line\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHello Investor,\n\nTech Laboratories is an alternative energy company experiencing a period of unprecedented growth. We are very pleased to announce that today we signed a milestone agreement to acquire Biodiesel Solutions (BSI). BSI provides a new product line with exciting market potential, significantly expanding our IP portfolio and adding an industry-renowned management team. We believe this acquisition will continue to build shareholder value by accelerating growth and revenues.\n\nBefore I get into the many facets of this exciting acquisition, Id like to get you better acquainted with who we are, what we do and why we believe that Tech Laboratories is positioned to capitalize on one of the greatest economic opportunities of the 21st Century.\n\nWith fossil fuels getting increasingly scarce, expensive and becoming an ever greater liability to geopolitical and environmental stability, Tech Laboratories is emerging as a greentech company that leverages todays infrastructure to provide immediate biofuel solutions for cars, trucks, homes and commercial vehicles.\n\nWe are currently seeking to roll up green technologies focused on generating biofuels from products that do not impact our nations food supply. Specific technologies currently being investigated allow production of biofuels from non-food sources including waste vegetable oil, feedstock that can be grown on set-aside land, inedible oils (such as jatropha and algae), wood waste, municipal solid waste and coal fines.\n\nWe recently announced our first of two acquisitions, Renewal Fuels, the producer of a portable biodiesel processor that empowers consumers with true at-home energy independence. Renewals current product, the FuelMeister, can produce 80 gallons of biodiesel per day from waste vegetable oil collected from restaurant deep fat fryers at an average cost of $0.85 per gallon. Renewal Fuels sells the FuelMeister directly to the consumer or through its network of over 30 nationwide distributors. More than 2,000 consumers have purchased a FuelMeister over the past 2 years. \n\nToday, we announced an agreement to acquire Biodiesel Solutions, creators of the BiodieselMaster, a community-scale, factory-built processing plant designed to produce 350,000 gallons of biodiesel per year. This capacity is ideally suited to empower agricultural communities to produce their own fuel from locally available crops. The BiodieselMaster is an industry-disruptive product that has a broad range of global market opportunities.\n\nWe see tremendous growth of both Renewal Fuels and Biodiesel Solutions. Renewal Fuels will benefit from our ability to create improved marketing programs, as well as geographic diversification  both domestically and internationally. Biodiesel Solutions will cater to an important market segment which has been widely overlooked in the traditional biodiesel supply chain.\n\nWe are already establishing relationships with several additional biofuel entities with projects, products and technologies at various stages of development. Each of these companies is in a business that meets our corporate mission.\n\n\nI hope this letter has helped give you a better understanding of why we are so excited about the booming growth in the alternative energy industry, particularly in the biofuels sector. I invite you to keep a close eye on Tech Laboratories as we continue on our mission to provide sustainable energy solutions to reduce our nations $5 trillion addiction to oil.\n\nFor your convenience, we have set up a state-of-the-art Investor Center to keep you up to date on our current events and all the other pertinent information you need to make a smart investment decision. We also invite you to read our new Investor Fact Sheet.\n\nThank you for your time and interest.\n\n\nBest regards,\n\n\n\nJohn King\nChief Executive Officer\n\nTech Laboratories\n\n\n\nAny statements regarding TLBTs expectations, beliefs, plans, objectives, assumptions or future events or performance are not historical facts and are forward-looking statements for purposes of the Private Securities Litigation Reform Act of 1995 (the Act).  These statements are often, but not always, made through the use of words or phrases such as believe, will, expect, anticipate, estimate, intend, plan, forecast, could, and would.  TLBT bases these forward-looking statements on current expectations about future events. They involve known and unknown risks, uncertainties and assumptions that may cause actual results, levels of activity, performance or achievements to differ materially from those expressed or implied by any forward-looking statement. Some of the risks, uncertainties and assumptions that could cause actual results to differ materially from estimates or projections in the forward-looking statement include, but are not limited to, the risk that we might not achieve our anticipated development milestones, the market for our products will not grow as expected, and the risk that our products will not achieve expectations.  For additional information about risks and uncertainties TLBT faces, see documents TLBT files with the SEC.  TLBT claims the protection of the safe harbor for forward-looking statements under the Act and each assume no obligation and expressly disclaim any duty to update any forward-looking statement to reflect events or circumstances after the date of this news release or to reflect the occurrence of subsequent events.\n\n\nAll communications sent by or on behalf of Tech Laboratories are fully compliant with existing regulations.\n\nIf you no longer wish to receive future mailings from Tech Laboratories, send an email here with the word \"REMOVE\" in the subject line.\n\nMailing Address:\nech-Laboratories, Inc.\n\n1818 N Farwell Avenue \nMilwaukee, WI 53202\nUnited States Of America\n\n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}