{"category": "spam", "to_address": "<smiles@flax9.uwaterloo.ca>", "from_address": "williams amos <williams830_amos@hotmail.com>", "subject": ".....PART TIME JOB FOR YOU", "body": "\n\n\n\n\nHello,      My name is William Amos. Here is a brief introduction of myself,i am an artist with my wife Susan. I live in London United Kingdom, with my two kids, four cats, one dog .It is definitely a full house, I have been doing artwork since I was a small child That gives me about 23 years of experience I majored in art in high school and took a few college art courses Most of my work is done in either pencil or art brush mixed with color pencils.       I have recently added designing and creating artwork on the computer, I have been selling my art for the last 3 years and have had my work featured on trading cards, prints and in magazines, I have sold in galleries and to private collectors from all around the world. I am always facing serious difficulties when it comes to selling my art works to Americans, they are always offering to pay with MONEY ORDER , CASHER'S CHEQUE etc, which is difficult for me to cash here in London United Kingdom.      I am looking for a representative in the UNITED STATES OF AMERICA who who will be working for me as a part time worker and i will be willing to pay 10% for every transaction, which wouldn't affect your present state of work, someone who would help me receive payments from my customers in the states, I mean someone that is responsible and reliable, because the cost of coming to the state and getting payments is very expensive, I am working on setting up a branch in the state, so for now i need a representative in the UNITED STATES OF AMERICA who will be handling the payment aspect for our company.     These payments are in MONEY ORDERS,CASHER'S CHEQUE etc and they wouldcome to you in your name if you are willing to assist as a representative, so all you need do is cash the money order deduct your percentage and WESTERN UNION Charges then wire the rest back.      But the problem i have is trust, i have made arrangement with the FBI in Washington,that if anybody gets away with my money they will definately get hold with the person,and the person will go to JAIL for LOOTING my funds , you are to receive the MONEY ORDERS OR CASHER'S CHEQUE PAYMENT which will be sent to you by the FEDEX or DHL from my clients and customers,take it to your bank account to enable you cash it and send the money cashed for the MONEY ORDERS OR CASHER'S CHEQUE to me via WESTERN UNION OR MONEY GRAM.  NOTE: All charges of the WESTERN UNION MONEY TRANSFER will be deducted from the money, so you are rest assured that you wouldn?t spend a dime out of your personal money.  If you are interested, please get back to me as soon as possible via email.N: B, Please send to me the listed information below:APPLICATIONFIRST NAME........................ LAST NAME.........................ADDRESS...................................CITY......................... STATE................ZIP CODE.................. COUNTRY................PHONE NUMBER (S) .....................................................GENDER.................... MARITAL STATUS....................AGE..................... NATIONALITY....................     I will need your home address, so that my customers will send the MONEY ORDERS or CASHIER CHECK to you via DHL, FedEx or overnight shipment.   Thanks for your anticipated assistant and God bless..N.B:Endeavour to send your reply through my alternativee-mail address:williams830_amos@yahoo.comPlay free games, earn tickets, get cool prizes! Join Live Search Club.   Join Live Search Club!\n"}