{"category": "ham", "to_address": "R-help@R-project.org", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "[R] Windows Vista issues", "body": "It seemed FUD [*] has been prevailing here and elsewhere on Vista security \nfeatures.\n\nI asked our sysadmins to set up a Vista box for me on which I have access \nto all levels of accounts.  Many of the issues I found were covered by \nearlier answers and all in the upcoming rw-FAQ (currently available at \nhttp://www.stats.ox.ac.uk/pub/R/rw-FAQ.html and in the 2.5.0 pre-releases) \nbut a quick reprise may help.\n\nMost of my testing was of 2.5.0 beta, but I did some quick tests of 2.4.1.\n\n\n1) The R installer and uninstaller are from an 'unidentified publisher' \nand you may have to agree that you trust them.  This is a problem of the \nInno Setup installer kit we use.  An ultra-cautious sysadmin could \nconfigure Vista to stop you installing via such a program.\n\n\n2) Permission problems:\n\nIf you install R as an ordinary user (into your own file space) you should \nsee no permissions problems.  (There would have been problems, including \nunder XP, with some recent daily binary builds as the installer kit had \nchanged one of its defaults to disallow non-administrator installs, but \nthese have been fixed.)\n\nI also encountered no problems installing R under the Administrator \naccount (normally hidden) and installing packages under the same account.\n\nThings are more complicated if you use an account which is in the local \nadministrator group (but is not Administrator itself).  Such accounts are \nno longer (by default) equivalent to Administrator, and run programs as \nordinary user accounts. They need to 'Run as Administrator' to do things \nin the system area such as C:\\Program Files.  You will be asked if you \nwant to run as administrator if you try to install software such as R, but \nyou will not be asked if you try to install packages in the main R library \n(since asking is something that applies to a program, not part of a \nparticular session).  One simple solution is to elevate your credentials \nwhen running an R session to install packages in the same way that you \nneeded to when installing R.  (Unix and MacOS X users will recognize a \nsomewhat automated reincarnation of 'sudo'.)\n\nIt looks like the best practice will be to change the (full) ownership of \nthe R installation to the account used to install it, something which \nwould be standard practice in the Unix world.  Also, we are encouraging \npeople as from 2.5.0 to install packages into a site or personal library \nwhere these permission issues should not arise (except when updating \nrecommended packages).\n\n\n3) The most worrying problem is that Vista is reporting quite incorrectly \nfile permissions through the POSIX interfaces used by file.info() and \nfile.access(), and furthermore allowed me as a standard user to create \ndirectories in areas over which it says I do not have write permission. We \nwill look further into possible solutions, but it seems the Win32 API \nfunctions are giving the same answers.\n\nProblems with 'access' (the C call underlying file.access()) mean that the \nMinGW compilers do not currently run on Vista without a lot of \nhoop-jumping.\n\n\n[*] http://en.wikipedia.org/wiki/Fear,_uncertainty_and_doubt\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}