{"category": "ham", "to_address": "\"Anthony W. Youngman\" <debian@thewolery.demon.co.uk>,\n   Debian-legal <debian-legal@lists.debian.org>", "from_address": "Gervase Markham <gerv@mozilla.org>", "subject": "Re: Final text of GPL v3", "body": "Anthony W. Youngman wrote:\n> And as I see it, if I say \"My program is licenced under GPLv3 with the \n> following exceptions ...\", if the user ignores the exception, they have \n> broken the terms I set for them to use the program, and the GPL doesn't \n> apply, so they can't take advantage of the clause allowing them to \n> remove the exception ...\n\nThis seems to suggest that the terms that you wrote explicitly have some \nspecial trumping value over the terms in the text of the GPL itself. I \ndon't think that's true.\n\nHere's a thought experiment:\n\nSuppose I wrote some software, and wrote it to a CD, erasing all other \ncopies. I then wrote out, in longhand, the text of the GPLv3 on paper, \nand attached it to the CD, and gave it to you. This software would \nclearly be under the GPLv3, and you could redistribute it under those terms.\n\nNow suppose the same situation, except that I also wrote an extra \nrestriction at the bottom: \"Also, if you copy and distribute this code, \nyou must send me a postcard.\"\n\nNow, a bit of the text I wrote out in my own handwriting earlier says \nthat if I put any extra restrictions on, you can ignore them. I quite \nclearly wrote that you can - it's there, in my own handwriting. So you \ncan surely choose to do exactly that.\n\nWhy does the same logic not apply when the text of the GPLv3 was not \ntyped out or written by you, but just added to your software distribution?\n\nNow, if I specifically disclaim section 7 in my additional text, then \nthat's perhaps different. But that would just demonstrate that my intent \nwas to confuse :-)\n\n> At the end of the day, the intentions of the licensor are important, and \n> if those intentions are made explicitly clear, it's a bit difficult for \n> the GPL to contradict them.\n\nBut the GPL _is_ the intent of the licensor. You know this, because they \nstart with \"I license this code under the terms of the GPL(v3)...\"\n\nGerv\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}