{"category": "spam", "to_address": "langa@speedy.uwaterloo.ca", "from_address": "\"Windows Secrets\" <Editor@WindowsSecrets.com>", "subject": "How to get Windows software at half-price [Newsletter Comp Version]", "body": "\n\nHow to get Windows software at half-price\n\n\n\n\n\n\nIf your software garbles this newsletter, read \nthis issue \nat WindowsSecrets.com.\n\n\n\n   \n\n\n\n\n\n\n \n\n\n\n\nYOUR NEWSLETTER PREFERENCES\nChange\nDelivery address: langa@speedy.uwaterloo.ca\nAlternate address: langa1@speedy.uwaterloo.ca\nLocale: United States 90210\nReader number: 82003-13329\n\n\n   \n\n\n\n\n\n   \n\n\n\n\n Home \n Newsletter \n WinFind \n Reviews \n Polls \n Contact \n \n\n\n\n\n This issue \n Past issues \n Upgrade \n Prefs \n Unsubscribe \n \n\n\n\n\n   \n\n\n\n\n\n   \n\n\nWindows Secrets Newsletter • \nIssue 103 • \n2007-04-12 • \nCirculation: over 270,000\n\n\n\n\n   \n\n\n\n\n\nWindows Vista Secrets, now 40% off\n\n\n\nMy new book, Windows Vista Secrets, with co-author Paul Thurrott of the \nSuperSite for Windows, is selling well — but our publisher, John Wiley \n& Sons, isn't using the demand to keep the price high. Instead, the \npublishing house has made a deal with Amazon.com to increase the book's \nretail discount to a whopping 40%. (It was previously in the 30s.) Whether \nyou're already using Vista, or you're starting to think about it, our labor \nof love will help you get the most out of the new operating system. Check it \nout for yourself. —Brian Livingston, Editorial Director\nFor more information:\nUnited States / \nCanada / \nElsewhere\n\n\n\n  \n\n \n\n\n\n\n\nHow to get Windows software at half-price\n\n\n\n\n  More ways to prevent phantom devices   \n\n\n  Summertime and the living is tasty  \n\n\n  Vista SP1 is coming, but not anytime soon   \n\n\n  Missing Microsoft patches, part II  \n\n\n  Patch is released to fix .ani patch   \n\n\n\n  How to change your address or unsubscribe  \n\n\n   \n\n\n\n\n\n   \n\n\nFor links to every subtopic in this issue, scroll down to the \nIndex\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nFree PC performance scan\nPC Pitstop's Optimize Scan 1.5 is easy to use software  that will automatically diagnose problems with your PC and and give you a custom report detailing issues that are hurting your PC's performance. Run this free scan now!  \nwww.pcpitstop.com\n\n\n\n\n\n\n\n\n\n \n\nWindows Vista Training — watch the demo\nGet the most out of Windows Vista with over 19 hours of hands-on video training covering all editions. Learn what's new in Vista, Installation, Group Policy, Securing Vista, Networking, Administration, IE7 and much more. View our free demo now!\nwww.TrainSignal.com\n\n\n\n\n\n\n\n\n\n \n\nBackup your data with ZipBackup\nFinally, a backup program that is easy to use.  ZipBackup's Wizard makes backups a snap for beginners. Filtering,  scheduling, and disk spanning make it a powerful tool for experts. For a limited time, Windows Secrets readers receive 25% off.\nwww.zipbackup.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\nTOP STORY\n\n\n\nHow to get Windows software at half-price\n\n\n\n\n\n\n\n\n\n\nBy Scott Dunn\nDespite hacks and cracks you can find on the Web, the only \nlegitimate way to run Windows XP or Vista is to purchase a licensed \ncopy.\n\nBut you can get copies at half-price or less using \"educational \ndiscounts\" — and qualifying is a lot easier than you may \nthink.\n\n\n\n\n\n\nEven kindergartners qualify for discounted software\n\n\n\nThe good news about educational software discounts is that you usually \ndon't have to be a full-time student to qualify (although you must have some \nlink to education).\n\nFor example, \n Academic Superstore offers its discounts to students \nand parents of students currently attending classes from \nkindergarten through college, as well as faculty and even janitorial staff of a \nK-12 or university. For students beyond the \nK-12 level, many retailers require that a student be enrolled in a degree-granting \nprogram, not merely taking a single class or seeking a \ncertificate.\n\nAcademic Superstore is the only seller I found that specifically mentions \nparents. But almost all such sellers provide discounts for students as \nyoung as kindergarten age. (And how many kindergartners have credit cards?) \nThe fact that parents can purchase for students is merely implied, in most \ncases. For example, \nCampus Tech lists among its \nqualifying documents a parent's ID for students K-12.\n\nMost sites selling academic software will accept home-schooled \nstudents as well.\n\nSome retailers offer discounts for other nonprofit organizations that \naren't strictly schools, such as public museums and libraries. These \noffers apply to most, but not all, discounted software. Some \ninstitutions, such as nonaccredited schools, hospitals, and \ntraining centers are specifically ruled out, depending on the software \npublisher. Furthermore, such institutional discounts usually only apply to \nvolume purchases, although \"volume\" means as few as five copies, \nin some cases.\n\nGenerally, stores that give these discounts are following the policies \nof the software publisher. Microsoft has made its \n eligibility requirements available on its Web site, as has \nAdobe.\n\n\n\nSeveral retailers offer education-discounted products\n\n\n\nMany software publishers provide dramatic discounts on their products for \neducational purposes. These include popular products such as \nMicrosoft Office as well as Adobe Acrobat and others.\n\nDiscounts on Windows itself are the hardest to come by. Windows XP \nProfessional (with Service Pack 2) and Vista Business Upgrade are \navailable at steep discounts (U.S. $27 and $62.50, respectively, from \nCCV Software, compared with $299 and \n$200 list.) But these prices \nare only granted to academic institutions, not to individuals, via Microsoft's \n Open License volume sales program.\n\nHowever, individuals with the right credentials can easily get educational \ndiscounts for Windows XP Professional Upgrade (with SP2) and Windows Vista \nHome Premium Upgrade. I've found the following academic discounts:\n\n• XP Pro SP2 Upgrade: $86 to $117 (compared to $192-239 street)• Vista Home Premium Upgrade: $65 to $90 (compared to \n$146-167 street)\n\nAt least one online reseller asks for no documentation at all. A pop-up message \nat VioSoftware.com \nsays, \"We do not require any proof that you will be using \nacademic software for academic use, nor does the manufacturer.\" Examples:\n• Office 2007 Pro Academic Full: \n$200 (compared to $500 list)• Office 2007 Standard Academic Full: \n$180 (compared to $400 list)\n\nAt roughly half off list price, VioSoftware is not the cheapest \nseller of academic software. But it still offers prices well below \nretail versions.\n\nThe software sold at these discounts is the same as any you would buy in a \nretail store. In most cases, you are limited to buying a single copy. \nAnd you must meet the documentation requirements.\nHow to document your claims\n\n\n\nUnlike ordinary retail purchases, buying software using an academic discount \nusually requires that you document your eligibility. Most sites require that you \nmail, e-mail, fax, or upload a .gif or .jpg image of the necessary \ndocuments. These typically include one or more of the following: student or \nfaculty ID (showing current semester or year), copy of current class schedule, \nregistration receipt, letter of enrollment or employment on letterhead, recent \nreport card, recent pay stub, or recent teaching contract. Many stores keep your \ndocumentation on file for a year (or until the dates on the documents expire) for \nfuture purchasing.\n\nQualifying documents for home schools and their students may be harder to come by. \nLetters from state departments of education, local school boards, or school \ndistricts recognizing the home school are likely to be accepted. In addition, it \nmay be useful to have receipts of purchases of a home-school curriculum from a \nnationally recognized provider of these products.\n\n\n\nWhere to shop for academic discounts\n\n\n\nUsing your favorite search engine, you should have no difficulty finding \nsoftware retailers that offer academic discounts. The ones I've found that \nhave the best prices and selection are, in alphabetical order:\n\n\nAcademic Superstore\nCampus Tech\nCreation Engine\nCCV Software\nJourneyEd\nSchool World\nVioSoftware\n\n\n\t\t\t\tReader, please rate the above article:\n1: Poor \n\t\t\t\t2: Fair \n\t\t\t\t3: Good \n\t\t\t\t4: Great  5: Superb\n\n\n\nScott Dunn is associate editor of the Windows Secrets Newsletter. He is \nalso a contributing editor of PC World Magazine, where he has written a \nmonthly column since 1992, and co-author of \n 101 Windows Tips & Tricks (Peachpit) with Jesse Berst and Charles Bermant.\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nGet your product seen by 270,000 readers\nDoes your company offer a product or service? Now you can place an ad in the Windows Secrets Newsletter and be seen by more than 270,000 active buyers of PC hardware and software. Bid as much or as little as you like to get the ideal ad placement.\nwww.WindowsSecrets.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n\n   \n\n\nLANGALIST \n      TIPS\nMore ways to prevent phantom \n\tdevices \n      \n\n\n\n \n\nBy Fred LangaWindows Secrets \n\t\t\treaders are talented ghostbusters!That's been \n\t\t\tproven time and time again in the Windows Secrets reader mail, and \n\t\t\twas shown once more in the discussion on preventing and removing \n\t\t\tphantom devices.\n\n\nReader tips on eliminating phantom devicesYou folks are great! \n\tAfter every issue, suggestions, and questions flow through our Web-based  \tcontact form. (Incidentally, if you send in a tip or trick that we \n\tprint, you'll receive a $25 gift certificate good for a book, CD, or DVD \n\tfrom Amazon!)\n\n\tThis week, I received additional info that amends my discussion on the items \"Keep phantom devices at bay\" and \n\t\"Restoring the HotPlug Manager,\" both of which appeared in the\n\tApr. 5 issue.\n\n\tSeveral readers (Rick Winterton was the first) suggested that another way to \n\tsafely remove a USB drive (and thus prevent it from appearing as a \n\tleft-behind ghost item in the Drives listing) is to right-click a \n\tremovable drive and select Eject from the context menu. Indeed, this can work, albeit not quite as reliably as the methods we \n\tpreviously discussed. Only some USB drives respond to an Eject \n\tcommand (I have a couple of Flash drives that won't disconnect that way), and \n\tmost other USB devices simply ignore the command. But, if the normal, \n\tofficially sanctioned methods aren't available to you, it may be worth \n\ttrying the Eject option. \n\n\tReader Larry Hoium also pointed me to a Knowledge Base article I'd never seen \n\tbefore. It's KB 315539, \n\twhich describes an obscure XP command:\nset devmgr_show_nonpresent_devices=1\n\nThat command allows the View/Hidden Devices menu in Device \nManager to list not only currently connected hidden devices, but also \nhidden devices that have been connected to the system at \nany time. Any ghost devices that are shown can then be \nuninstalled directly through Device Manager itself.\nFigure 1. KB 315539 \n\tshows you how to force Device Manager to display hidden devices that once \n\twere connected to the system, but that are not \n\tcurrently plugged in. In this example, note the three grayed-out drives, \n\twhich Device Manager normally would not show at all.\n\n\tThanks Rick, Larry, and all who wrote in! Keep those e-mails coming!\nHow to get 130+ browser shortcuts freeThose \n\tof you who've read Brian Livingston's excellent Windows Vista Secrets book \n\thave probably noted the references to keyboard shortcuts — those special \n\ttwo- or three-keystroke combinations that let you perform an action or access \n\ta software feature much faster than wading through the menus.\n\n\tFor example, \n\tyou almost surely already know that Alt+Tab lets you switch among open windows faster than \n\tby accessing the same windows via the Taskbar. But there are probably dozens \n\tor even hundreds of other time-saving shortcuts that you may not know about!\n\n\tBrian's Vista book covers everything in Vista, including IE 7, and he lists \n\tIE 7 keyboard shortcuts on pages 487-489. If you're using Vista, that's the \n\tplace to go for the best information.\n\n\tIf you're not running Vista, but are using IE 7, then you should take a \n\tlook at TechRepublic's PDF download\n\t60  \tkeyboard shortcuts to move faster in Microsoft Internet Explorer 7. Note that free \n\tregistration is required.\n\n\tIf you're using Firefox, then\n\t70+  \tkeyboard shortcuts to move faster in Mozilla Firefox will be of interest \n\tto you. \n\tIt's also available for download after free registration.\nPatch cord saves USB headachesIn \n\tthis and other recent issues, I've discussed some of the software-based \n\tproblems that can befall USB devices.\n\tBut it's worth mentioning another, purely physical danger that can totally cripple a \n\tUSB device: wear and tear on the USB plugs and sockets themselves.\n\n\tI've seen this mostly in Flash drives: Unless they're plugged in to and \n\tpulled out of USB sockets with great care, repeated off-angle insertions and \n\tremovals can stress the plugs and sockets, causing them to flex. In time, \n\tthe internal electrical connections can break, leaving you with a dead \n\tsocket. Unless you have the skill and inclination to open the case and do some \n\tvery delicate soldering, the \n\tsocket is gone for good.\n\n\tAn inexpensive \"patch cord\" can help. A patch cord is a kind \n\tof USB extension cord: a length of cable with a USB plug on one end and a \n\tsocket on the other. Because the cord is lightweight and flexible, it's much \n\teasier to align to the permanently mounted plugs and sockets on your PC and \n\tUSB devices. Sometimes, you can even leave the patch cord connected to your \n\tPC, so all the wear and tear happens on the inexpensive patch cord's socket, \n\trather than the harder-to-replace PC's socket.\n\n\tAlmost all electronics retailers sell \n\tUSB patch cords, and they can cost as \n\tlittle as $2 for the shorter lengths. If you frequently plug in and unplug \n\tyour USB devices, a patch cord can be cheap insurance!\nAnother way to tune your Internet \n\tconnectionAn item on semi-automated \n\tInternet connection tuning in the\n\tMar. 15 \n\tissue generated a great reader suggestion on a nearly fully automated \n\tmethod. That tip appeared in the  \tApr.  \t5 issue.\n\n\tYet another good suggestion comes from reader Vuong Phung. He \n\trecommends an incredibly detailed manual method described in the\n\tNavas  \tCable Modem/DSL Tuning Guide. The benefit of the manual method is that \n\tyou have complete control over every variable and can fine-tune your \n\tconnection parameters to whatever degree you wish. It's a more laborious \n\tway to tune, but one that gives you the ultimate in flexibility and adaptability.\n\n\tSo now, with a full spectrum of free connection-tuning options available —\n\tmanual,\n\tsemi-automated, \n\tand fully automated \n\t— we all should be able to find a solution that delivers the best-possible \n\tperformance from our Internet connections.\n\n\tThanks, Vuong!\n\n\n\t\t\t\tReader, please rate the above article:\n1: Poor \n\t\t\t\t2: Fair \n\t\t\t\t3: Good \n\t\t\t\t4: Great  5: Superb\n\n\nFred Langa is editor of the \n      Windows Secrets Newsletter. He was editor of Byte Magazine (1987 to 1991) \n      and editorial director of CMP Media (1991 to 1996), overseeing Windows \n      Magazine and others. He edited the LangaList e-mail newsletter from 1997 \n      to 2006, when it merged with Windows Secrets.\nContents  Index\n\n   \n\n\n   \n\n\n\nTELL A FRIEND\n\nHow you can share this information\nWe love it when you send your friends links to our articles. But please don't \nforward your copy of our e-mail newsletter to people, which subjects us to spam \ncomplaints. Instead, simply suggest that your friends visit this issue's permanent \nWeb address, shown below. A complete index at the bottom of the \nWeb page provides you with hyperlinks to any article you'd like to recommend.\n\nThe address of this issue is http://WindowsSecrets.com/comp/070412\n\n   \n\n\n\n\n   \n\n\n\nWACKY WEB WEEK\n\n\nSummertime and the living is tasty\n\n\n\n\n\n\n \n\n\n\nSummer is coming, and for many folks that means time for a barbecue! Leave it to \nthe folks at Neatorama to round up the \"Ten Coolest BBQ Grills.\"\n\nThe offerings range from gigantic and industrial to artistic stone or ceramic. \nFor tailgate parties, there's the Swing-A-Way grill that attaches to the back of \nyour truck. For real power, check out the Hemi engine-powered grill whose V8 \nengine can roast 240 hot dogs in three minutes.\n\nMore info\n\n\n\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n\n   \n\n\n\nINDEX\n\nThe following topics appear in the free version\n\n\n\n\nTOP STORY  \nHow to get Windows software at half-price\n\n \nEven kindergartners qualify for discounted software\n\n \nSeveral retailers offer education-discounted products\n\n \nHow to document your claims\n\n \nWhere to shop for academic discounts\n\n \n \n\n\nLANGALIST TIPS  \nMore ways to prevent phantom devices \n\n \nReader tips on eliminating phantom devices\n\n \nHow to get 130+ browser shortcuts free\n\n \nPatch cord saves USB headaches\n\n \nAnother way to tune your Internet connection\n\n \n \n\n\nWACKY WEB WEEK  \nSummertime and the living is tasty \n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou get all of the following in the paid version\n\n\nLANGALIST PLUS  \nVista SP1 is coming, but not anytime soon \n\n \nVista SP1 will fix dozens of problems \n\n \nHow to test-drive Windows Vista \n\n \n Get free malware removal help from Microsoft \n\n \nEasy Web Cam displays ads but isn't malware \n\n \n How good is WildBlue satellite Internet? \n\n \nAudacity offers free podcast recording \n\n \nWhere to start your own blog \n\n \n \n\n\nOVER THE HORIZON  \nMissing Microsoft patches, part II \n\n \n Flaw in Internet Connection Sharing causes DoS \n\n \nWindows Workstation service vulnerable to DoS \n\n \nIE memory corruption weakness can crash browser \n\n \n \n\n\nPATCH WATCH  \nPatch is released to fix .ani patch \n\n \n.Ani bug patch needs a patch \n\n \nVista gets another security patch \n\n \nPlug and Play patched again \n\n \nWindows helper could hurt your system \n\n \nWindows Kernel gets a patch \n\n \nMicrosoft Content Management Server needs patching \n\n \nWorkstations need browser patches before servers do \n\n \nAdditional Vista patches, some funny \n\n \n \n\n\n\nPaid subscribers can access all old and new paid newsletter content\nMake a contribution to support our research into Windows and you'll immediately\nbe able to read and search through scores of valuable articles. In addition,\npaid subscribers are entitled to download valuable content that we license for\nyou at least once every calendar quarter.\nTo upgrade, simply make a contribution of any amount you choose.\nIf you do this by Apr. 18, 2007, \nyou'll instantly be sent the full, paid version of today's newsletter.\n\nTo upgrade to the paid version of the Windows Secrets Newsletter, please visit our \n upgrade page.\n\nThanks in advance.\n\n\n   \n\n\n\n\n\n   \n\n\n\nContents\n Index\n\n\n   \n\n\n\n\n\n   \n\n\n\nYOUR SUBSCRIPTION\n\nThe Windows Secrets Newsletter is published weekly on \nthe 1st through 4th Thursdays of each month, plus occasional news updates. \nVacation breaks occur in late August, Thanksgiving Week, and Christmas/New Year's.\nPublisher: WindowsSecrets.com LLC, 300 Queen Anne Ave. N. #456, Seattle, WA 98109\nUSA. Vendors, please send no unsolicited packages to this address (readers' letters\nare fine).\nEditorial Director: Brian Livingston. Editor: Fred Langa. Associate \nEditor: Scott Dunn. Contributing Editors: Susan Bradley, Mark Edwards, Woody \nLeonhard, Chris Mosby, Ryan Russell. Research Director: Vickie Stevens. \nProgram Director: Brent Scheffler. Managing Editor: Jody Braverman.\nTrademarks: Microsoft and Windows are registered trademarks of Microsoft \nCorporation. The Windows Secrets series of books is published by\nWiley Publishing Inc. The Windows Secrets Newsletter,  \nWindowsSecrets.com, LangaList, LangaList Plus, WinFind, Security Baseline, Patch Watch, \nPerimeter Scan, Wacky Web Week, the Logo Design (W, S or road, and Star), and the \nslogan Everything Microsoft Forgot to Mention all are trademarks and service \nmarks of WindowsSecrets.com LLC. All other marks are the trademarks or service \nmarks of their respective owners.\n\n\nYOUR SUBSCRIPTION PREFERENCES\n(change \nyour preferences):\nDelivery address: langa@speedy.uwaterloo.ca\nAlternate address: langa1@speedy.uwaterloo.ca\nCountry: United States\nZIP or postal code: 90210\nReader number: 82003-13329\nBounce count: 0\n\nYour bounce count is the number of times your server has bounced a newsletter back to us\nsince the last time you visited your preferences page. We cannot send newsletters to you\nafter your bounce count reaches 3, due to ISP policies. If your bounce count is higher\nthan 0 or blank, please visit your\npreferences page.\nThis automatically resets your bounce count to 0.\nTo change your preferences: Please visit your \npreferences  page.\nTo access all past issues: Please visit our\npast issues page.\nTo upgrade your free subscription to paid: Please visit our \nupgrade  page.\nTo resend a missed newsletter to yourself: If your mail server filtered \nout a\nnewsletter, you can resend the current issue to yourself. To do so, visit your\npreferences page\nand use the Resend link.\nTo get subscription help by e-mail (fastest method): Visit our \ncontact page.\nSubscription help by facsimile:\n206-282-6312 (fax). Emergency subscription help by phone: 206-282-2536 (24\nhours).\n\nHOW TO SUBSCRIBE: Anyone may subscribe to this newsletter by visiting our \nfree signup page.\nWE GUARANTEE YOUR PRIVACY:\n\n1. We will never sell, rent, or give away your address to any outside party, ever.\n2. We will never send you any unrequested e-mail, besides newsletter updates.\n3. All unsubscribe requests are honored immediately, period.  \nPrivacy policy\nHOW TO UNSUBSCRIBE: To unsubscribe\nlanga@speedy.uwaterloo.ca\nfrom the Windows Secrets Newsletter,\nUse\nthis 2-click\nUnsubscribe\nlink; or\nSend\na blank e-mail to\nunsub@WindowsSecrets.net\nwith leave langa@speedy.uwaterloo.ca\nas the Subject line; or\nVisit our \nUnsubscribe page.\n\n\nCopyright © 2007 by WindowsSecrets.com LLC. All rights reserved.\n\n\nContents\n Index\n\n\n\n\n\n\n   \n\n\n\n\n\n"}