{"category": "spam", "to_address": "<IPLACEREPORTS@flax9.UWATERLOO.CA>", "from_address": "\"RichardBand@InvestorPlace.com\" <RichardBand@InvestorPlace.com>", "subject": "Last Chance to Attend Live Online Conference", "body": "\n\n\n\nBoom or Bust Ahead for Wall Street?\n\n\n\n\n\nWe love giving our InvestorPlace and InvestorPlace Institute members benefits\n      like free access to the LIVE Online Conference featured below. \n\n In order to ensure you keep receiving special alerts, actionable information and market commentary like this, please take a moment to click on any of the links in this message to reconfirm that this is the email address where you want to receive emails from InvestorPlace and InvestorPlace Institute.    \n      By doing so, you’ll also get FREE access  to tomorrow’s LIVE Online Conference, which is scheduled to begin at 4:00 p.m. ET, as a special thank-you for being a valued member. Click here now. \n\n\n\n\n\n\n\n\n\n\nFellow Investor, \nJust because the Dow recovered 150 points on Friday, June 8th we’re not out of the woods.  \nNo way!  The three-day, 400-point Dow sell-off from the week before underscores some serious problems that could easily split Wall Street into two separate halves: those who lose a bundle and those who make out like bandits. \n\n\n\n\nMeet Richard Band \n\n\n\n\n\nAs the newsletter world's #1 authority on investing for low growth, Richard Band is supremely qualified to help you find your way through these turbulent times. Since 1984, his recommendations have not only handed his readers 900% profits but also won him six \"Financial Advisory\" awards from the Newsletter and Electronic Publishers Foundation. As of this writing, his current portfolio includes 38 low-risk high-income stocks – 36   have substantial gains; only two have losses. \nHis average gain per stock is a remarkable 40%. In addition, his Incredible Dividend Machine rising stocks are on track to hand investors 16% annual dividends.  As a result, Richard is a popular speaker at investment conferences. He is also the author of Contrary Investing, which was named \"Best Investment Book\" of 1985 and hailed by Barron's as one of the most moving and readable presentations on the subject.\"\n\n\n\n\nI’m Richard Band, and in all my years, I’ve never seen more conflicting signals of both boom and bust.  On one hand earnings reports continue to look strong as U.S. corporations continue to increase sales and grow profits. \nOn the other hand, rising interest rates and gas prices could burst this bubble and send millions of unwitting investors directly to the poorhouse. \nWhat should you do? Buy? Sell? Play it safe on the sidelines? \nLog In to Tomorrow's FREE Online Conference and Avoid the Mistakes Others Will Make. HURRY—Time is Running Out.  \nMake no mistake about it—this market is changing fast.  Unless you have a plan to react to it, you could easily find yourself owning the wrong stocks in the wrong sectors and missing out on this market’s biggest profit opportunities. \nThat’s why it’s important that you attend my special Online Conference tomorrow, Wednesday, June 20th at 4:00 p.m. ET, and email me your questions.  That way I can give you both my economic overview of the critical factors that are affecting the markets now, along with the specific actions to take on your own account. Click here to attend. \nThose who listened in on my June 2006 Online Conference profited handsomely. Investors who followed my lead captured a 14% gain in the S&P 500 in just eight months. Of course, you did even better if you bought the specific stocks I recommended in that call. \nToday’s situation is eerily similar to last June’s—the same forces are in play in the market, which means you could see the same profits (or more) in the next eight months if you know where to look. \n Here’s What I’ll Be Covering on Wednesday:\n The driving force behind June’s big three-day sell-off and the surprising odds that you’ll see other 400 point (or higher!) sell-offs later this year. \n How China’s cooling stock market, rising labor rates and increased speculation will affect your portfolio—even if you don’t own one China stock.\n \n What’s really driving the private equity boom.  How it’s making shrewd investors rich.  How you can get into the game and bank big profits without sticking your neck out. \n PLUS...What you’re not being told about the subprime lending crisis...how to play $65 oil...top takeover targets now...and much more. \nI can’t stress this enough:  The biggest mistake you can make now is not understanding the forces at work in the marketplace.\n\nI don’t want to see that happen to you. That’s why it’s critical that you join me online on Wednesday at 4:00 p.m. ET so that you’ll be in a better position to make the right decisions. Don’t miss out—click here now. \nThe best part is, all you have to do is click here to get in on the discussion.\nAgain—this is a FREE informational LIVE online conference to help you make sense of this now-volatile market. Click here NOW.\nJoin me tomorrow at 4:00 p.m. ET, and you’ll not only be able to ask me questions during the conference but once the online conference is over, you will also receive a complete transcript along with future alerts and updates that will keep you up-to-date in these critical times. \nI look forward to hearing your questions and helping you navigate these turbulent times. \n\n            Sincerely, \n\n            Richard E. Band\n            Founder and Editor, Profitable Investing \n\nP.S. Remember, this special LIVE online discussion is absolutely FREE . So there’s no risk. Reserve your spot right away. Continued 400-point sell-offs are on the horizon, and those investors who fail to protect their money by investing in the right sectors their futures are putting their necks on the line. \nThe pains and the joys we’re feeling in the market right now are the product of the new global economy. Increases in demand for commodities in China are lifting prices for aluminum, copper, corn and you name it right here at home. An emerging workforce in India is changing the way we do business on a day-to-day basis. The examples are endless. \nThis is why it’s so important that you have a global perspective on investing today. Click here now to join me and get my newest report, “How to Cash in on The Global Stock Boom,” designed to help you navigate this turbulent global economy—and help you find the safest and most profitable places to put your cash to work. \nIn it, you’ll discover why you should invest overseas, get two globally-minded U.S. companies to invest in now, plus two blue chips to double your wealth, my favorite globe-trotting mutual fund and more! It’s yours FREE. \nClick here now to attend tomorrow's online conference and get immediate online access to “How to Cash in on The Global Stock Boom.” \n\n\n\n\n\n\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you.\n        Please tell us if your email has changed by visiting here:\nhttp://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice  from InvestorPlace advisors, \n        you can let us know by visiting:\nhttp://www.investorplace.com/u/?p=8HN153-1&e=IPLACEREPORTS@SPEEDY.UWATERLOO.CA\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,\n        2420A Gehman Lane\n        Lancaster, PA 17602\nCopyright (c) 2007 ACP Phillips Investment Resources, LLC.\n        All rights reserved.\n06/19/2007 09:03AM\n--------------------------------------------------------------------\nThank you for subscribing to InvestorPlace.com. Please note  that we cannot be liable for any missed bulletins caused by  overzealous spam filters. To ensure that you continue to receive this  valuable part of your service please take a moment to add (RichardBand@investorplace.com) to your address book. Click here for instructions: \nhttp://www.investorplace.com/whitelist.php?eml=RichardBand@investorplace.com\n--------------------------------------------------------------------\nee==8HN153\n\n\n\n\n \n\n\n\n\n\n\n"}