{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Automotive Newsletter June 5, 2007", "body": "\nhowstuffworks® | automotive June 5, 2007\nRSS\n \n  Deep Drive: 2008 Audi TT\n  \nThe 2008 TT is the brand-new second generation of Audi's entry into the premium sporty/performance segment. Along with completely fresh styling, the small sports coupe and convertible has new body engineering, a turbocharged four-cylinder engine, and an expanded list of luxury and convenience options. Read the full review and check out exterior and interior photos of the \n2008 Audi TT. \nAlso at HowStuffWorks\n \n\nScenic\nDrives - Want to\nget away from it all this summer and hit the open road? Check out our collection\nof more than 100 scenic drives, taking you through every state in the nation.\nHelpful route maps and links to places to stay and eat are included for each\ndrive.\n \nHow Champ\nCars Work - Their\ncarbon fiber bodies, incredible engines, advanced aerodynamics and intelligent\nelectronics make Champ Cars some of the most sophisticated vehicles in use.\nHead behind the scenes of Champ Car racing and learn about the cars, the drivers\nand the racing team.  \n\nHow the\nHydrogen Economy Works - Can\nsociety make the shift away from fossil fuels, or will the technological,\neconomic and political barriers keep us bound to petroleum for the next\ncentury? Learn about the benefits of a hydrogen economy, along with its\npotential problems.\n   \nThis Week's Video\n \n\nHow Car\nDesign Works - Ever wonder\nhow cars are conceptualized and what a car designer's job is like? Lon Zaback,\ndesigner of the Ford Focus, talks about the process of designing a car, from\nthe original sketches to the final product, in this HowStuffWorks video.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved"}