{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Chris Waters <xtifr@debian.org>", "subject": "Re: Final text of GPL v3", "body": "On Sat, 30 Jun 2007, Francesco Poli wrote:\n\n> >   When you convey a covered work, you waive any legal power to forbid\n> > circumvention of technological measures to the extent such\n> > circumvention is effected by exercising rights under this License with\n> > respect to the covered work,\n\n> This clause is troublesome, as it seems to be overreaching.  For\n> instance, it could be interpreted as covering legal powers to forbid\n> \"computer crimes\" such as unauthorized intrusion into computer systems.\n\n> E.g.: suppose that the covered work is a vulnerability scanner, or\n> password cracker, or anyway a tool that could be used (among other\n> things) to break into other people's computers.  Using that tool in this\n> manner is exercising a right \"under this License\"\n\nUsing a tool is not exercising a right under the license.  The license\nconcerns itself only with copying and modification.  (It is not an end\nuser license agreement.)  Beyond that, I agree with MJ's analysis, but\nI think the point I raised is an important additional one.\n\n> Waiving legal rights can be seen as a fee: this clause could fail\n> DFSG#1.\n\nAll free licenses, and especially all copyleft licenses, require the\nwaiver of certain legal rights (such as the right to sue for copyright\ninfringement).  The requirement in copyleft to provide source code can\nalso be seen as a fee--in fact, this has been cited as a reason for\nconsidering the GPLv2 valid, enforcible and non- discriminatory with\nrespect to anti-trust law.  If waving legal rights is a problem, we\nhave no licenses left.  If something that merely *can* \"be seen as a\nfee\" is a problem, then all copylefts are non-free.\n\n> >     d) If the work has interactive user interfaces, each must display\n> >     Appropriate Legal Notices; however, if the Program has interactive\n> >     interfaces that do not display Appropriate Legal Notices, your\n> >     work need not make them do so.\n\n> Clause 5d is definitely worse than the corresponding clause 2c in\n> GPLv2.\n\nAre you talking about the missing \"when started running...in the most\nordinary way\"?  That was highly ambiguous; this has the advantage of\nbeing clear and direct, and I can't think of any circumstances where\nit could actually be considered worse.  I actually think the new\nwording is a great improvement, as it closes a highly ambiguous\nloophole (the worst kind).\n\n> What is more awkward is that it seems that when a non-interactive\n> work is modified so that it becomes an interactive work, the\n> modifier is *compelled* to implement these features in *any* newly\n> created interactive interface.\n\nUm, GPLv2 has basically the same requirement: \"If the modified program\nnormally read commands interactively when run, you must cause it...to\nprint or display an announcement....\"  The *only* exception listed is\n\"if the Program itself is interactive but does not normally print such\nan announcement, your work based on the Program is not required to\nprint an announcement.\"  The only difference I see is the removal of\n\"normally\", which, like \"the most ordinary way\" is rather ambiguous.\n\nI'm sorry, but I really don't see how this is a freeness issue *if* we\nconsider the GPLv2 to be a free license.  The difference between these\nrequirements is *so* small that I don't see how anyone could accept\nthe one and reject the other.\n\n-- \nChris Waters           |  Pneumonoultra-        osis is too long\nxtifr@debian.org       |  microscopicsilico-    to fit into a single\nor xtifr@speakeasy.net |  volcaniconi-          standalone haiku\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}