{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (Apr. 12, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 12, 2007\n\n\nApr 12, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for April 12, 2007    \n\n\n\nFirst Enercast Featured Articles for April 12, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories  \n\n\nApr 12, 2007 PowerMarketers Industry Publications\n\n\n\nTHIS WEEK AT EIA (Volume 9, Issue 15) (April 6 - April 12, 2007)  \n\n\n\nEIA - Apr. 12, 2007 - THIS WEEK AT EIA is a list summarizing and providing URLs for every Energy Information Administration (EIA) product released during this week.\n\n\nApr 12, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nTXU Energy, Customers and Employees Contribute $5 Million to Help Texans in Need of Bill Payment Ass\n\n\n\nTXU Energy is pleased to announce that in an effort to aid those most in need throughout 2007, TXU Energy will contribute $5 million, in addition to donations from customers and employees, to help local residents with bill payment assistance. 'Hardships like a job loss, medical illness, or death in the family can create unexpected financial difficulties for anyone.\n\n\nApr 12, 2007 Interest!ALERT\n\n\n\nEntergy and Consumers Energy Announce Closing of Palisades Nuclear Energy Plant Transaction\n\n\n\nNEW YORK, April 11 /PRNewswire-FirstCall/ -- Entergy Corporation and Consumers Energy, the principal subsidiary of CMS Energy , announced today the completion of the previously announced purchase by Entergy of the 798-megawatt Palisades Nuclear Plant, near South Haven, Michigan for $380 million. As part of the purchase, Entergy will sell 100 percent of the plant's output, up to its current 798 ...\n\n\nApr 12, 2007 Interest!ALERT\n\n\n\nNARUC Lauds DOE Energy Efficiency Report, Cites States' Critical Role\n\n\n\nWashington - The National Association of Regulatory Utility Commissioners lauded the Energy Department's new report on State and Regional energy efficiency policies for recognizing the important role State regulators have in developing energy efficiency programs. NARUC and the National Association of State Energy Officials, through the National Council on Electricity Policy, contributed heavily ...\n\n\nApr 11, 2007 ElectricNet\n\n\n\nONEOK and ONEOK Partners to Present at AGA Financial Forum\n\n\n\nTULSA, Okla., April 11 /PRNewswire-FirstCall/ -- ONEOK, Inc. OKE and ONEOK Partners, L.P. OKS will present at the American Gas Association Financial Forum on Monday, April 30, 2007, in Orlando, Fla., at 9:45 a.m. Eastern Daylight Time (8:45 a.m. Central Daylight Time). John W. Gibson, chief executive officer of ONEOK and president and CEO of ONEOK Partners, will present.\n\n\nApr 11, 2007 PR Newswire via MSN Money\n\n\n\nSouthern Natural Gas Company Announces Expiration and Final Results of Cash Tender Offer for Its 6.70% Notes Due October 1, 2007\n\n\n\nEl Paso Corporation News HOUSTON, April 10 PRNewswire-FirstCall Southern Natural Gas Company (SNG), a wholly owned subsidiary of El Paso Corporation (NYSE: EP), announced the expiration and final results of its previously announced cash tender offer to purchase any and all of its outstanding 6.70% Notes due October 1, 2007 (CUSIP No. 843452AW3). The tender offer expired at 12:00 midnight, New ...\n\n\nApr 11, 2007 DiGiTAL50\n\n\n\nDTE Energy chief to testify about utility regulations\n\n\n\nApr. 11--DTE Energy Chairman and Chief Executive Officer Anthony Earley Jr. will testified before the Michigan House of Representative's Energy & Technology Committee Wednesday morning about changes to the state's utility regulatory environment.  Earley is expected to call for the repeal of the Electric Choice provisions of Michigan Public Act 141, which was adopted in 2000.\n\n\nApr 11, 2007 Knight Ridder Tribune Business News\n\n\n\nPacifiCorp proposes Calif energy crisis refunds\n\n\n\nto pay $28 million for refund claims made by three California utilities and four California state agencies as a result of the 2000-2001 energy crisis in the U.S. West, PacifiCorp said. The utility PacifiCorp is a unit of Mid American Holdings Co., which is owned by Berkshire Hathaway Inc. <BRKa.N> <BRKb.N>. PacifiCorp is based in Portland, Oregon, and most of its electricity customers are in Utah ...\n\n\nApr 12, 2007 Reuters\n\n\n\nMich. nuclear power plant sale completed\n\n\n\nCOVERT TOWNSHIP, Mich. (AP) - The Palisades Nuclear Plant officially has a new owner. Entergy Corp., a New Orleans-based utility holding company, has completed its $380 million purchase of the plant from Consumers Energy Co., a subsidiary of Jackson-based CMS Energy Corp., the two companies announced Wednesday. The Nuclear Regulatory Commission said Friday it had approved the transfer to Entergy ...\n\n\nApr 12, 2007 FinanzNachrichten.de\n\n\n\nReport: Northwest Power System Can Handle More Wind Energy, But More Work Is Needed\n\n\n\nPortland, OR - Wind power projects are being rapidly developed throughout the Northwest, and the region's existing power system can most likely accommodate the 6,000 megawatts of wind energy anticipated by 2024 - or perhaps much sooner given the current pace of development. However, there will be costs to incorporate these new wind sources as well as a need for additional investments in ...\n\n\nApr 11, 2007 ElectricNet\n\n\n\nWashington is 5th among wind-powered states\n\n\n\nApr. 12--Washington has leapfrogged into fifth place among the country's most wind-powered states thanks to two wind farms that came online in 2006, according to an industry organization.  The American Wind Energy Association in Washington, D.C., moved Washington ahead of Oklahoma in its assessment of wind-power capacity after Washington added several hundred new megawatts of energy from the Big ...\n\n\nApr 12, 2007 Knight Ridder Tribune Business News\n\n\n\nNuclear storage fees at Monticello plant revisited by Senate committee\n\n\n\nGrumbling from local lawmakers about proposed Xcel Energy payments for dry cask storage at the Monticello nuclear power plant has one Senate committee revisiting the nuclear power issue. The Senate Committee on Energy, Utilities, Technology and Communications temporarily laid aside legislation that would have Xcel paying $350,000 each year for each dry cask containing spent fuel at Monticello  ...\n\n\nApr 11, 2007 Hometown Source\n\n\n\nXcel remains atop wind-power rankings\n\n\n\nXcel Energy Inc.remains the largest wind power provider in the United States according to a wind-energy group. The American Wind Energy Association released its annual rankings of wind energy development in the United States Wednesday, and rated Minneapolis-based Xcel Energy (NYSE: XEL) as the largest provider of wind power in the U.S for the second consecutive year.\n\n\nApr 12, 2007 East Bay Business Journal\n\n\n\n\n\nIBM hopes new utility coalition can boost grid computing\n\n\n\n-- IBM and CenterPoint Energy Houston Electric LLC today unveiled plans to create a coalition of energy firms that would use Web 2.0 tools to share information about major projects. IBM said that it hopes the Intelligent Utility Network (IUN) coalition effort will help boost the adoption of grid computing within the energy sector. IBM is working with CenterPoint on a $750 million, five-year ...\n\n\nApr 11, 2007 Computerworld\n\n\n\nLong Island Association offers conditional support for gas terminal\n\n\n\n6:16 PM EDT Long Island's largest business group announced yesterday its conditional support for the bitterly-controversial floating liquid natural gas terminal proposed for midway between the Suffolk County and Connecticut coastlines. The Long Island Association, in a statement, listed these conditions for its support of the Broadwater Energy project in Long Island Sound: 'All environmental, ...\n\n\nApr 12, 2007 Newsday\n\n\n\nLIA offers Broadwater iffy support\n\n\n\nLong Island's largest business group announced yesterday its conditional support for the bitterly controversial floating liquid natural gas terminal proposed for midway between the Suffolk County and Connecticut coastlines. The Long Island Association, in a statement, listed these conditions for its support of the Broadwater Energy project in Long Island Sound: 'All environmental, safety and ...\n\n\nApr 12, 2007 Newsday\n\n\n\nNew solar panel design traps more light\n\n\n\nATLANTA - Sunlight has never really caught fire as a power source, mostly because generating electricity with solar cells is more expensive and less efficient than some conventional sources. But a new solar panel unveiled this month by the Georgia Tech Research Institute hopes to brighten the future of the energy source. The difference is in the design. Traditional solar panels are often flat and ...\n\n\nApr 11, 2007 Boston Herald\n\n\n\n\n\nTXU Energy, Customers and Employees Contribute $5 Million to Help Texans in Need of Bill Payment Assistance\n\n\n\nTXU Energy is pleased to announce that in an effort to aid those most in need throughout 2007, TXU Energy will contribute $5 million, in addition to donations from customers and employees, to help local residents with bill payment assistance. 'Hardships like a job loss, medical illness, or death in the family can create unexpected financial difficulties for anyone.\n\n\nApr 11, 2007 PR Newswire\n\n\n\nEntergy and Consumers Energy Announce Closing of Palisades Nuclear Energy Plant Transaction\n\n\n\nNEW YORK, April 11 /PRNewswire-FirstCall/ -- Entergy Corporation (NYSE: ETR) and Consumers Energy, the principal subsidiary of CMS Energy (NYSE: CMS), announced today the completion of the previously announced purchase by Entergy of the 798-megawatt Palisades Nuclear Plant, near South Haven, Michigan for $380 million. As part of the purchase, Entergy will sell 100 percent of the plant's output, ...\n\n\nApr 11, 2007 PR Newswire\n\n\n\nTXU, InfrastruX Suspend Joint Venture\n\n\n\nDALLAS, April 11 /PRNewswire-FirstCall/ -- TXU Corp. (NYSE: TXU), TXU Electric Delivery Company, a subsidiary of TXU Corp., and InfrastruX Group, a national provider of utility-related construction and maintenance services, announced today that they have mutually agreed to suspend their agreements relating to the InfrastruX Energy Services Group LP (IES) joint venture.\n\n\nApr 11, 2007 PR Newswire\n\n\n\nSpescom Software Now Operating as Enterprise Informatics\n\n\n\nSpescom Software Inc. (OTCBB: SPCO) announced  Spescom Software Inc. (OTCBB: SPCO) announced today that it is now doing business as Enterprise Informatics. The official name change to Enterprise Informatics Inc. will occur after the shareholder meeting on April 24, 2007. Along with the name change the company has established a new identity, refined its market position and clarified its market ...\n\n\nApr 12, 2007 Internet Wire\n\n\n\nFitch Rates MP Environmental Funding LLC, Series A\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch Ratings rates MP Environmental Funding LLC, senior secured sinking fund environmental control bonds, series A as follows: --$86,200,000 4.9820% tranche A-1 'AAA'; --$76,000,000 5.2325% tranche A-2 'AAA'; --$153,250,000 5.4625% tranche A-3 'AAA'; --$29,025,000 5.5225% tranche A-4 'AAA'. The collateral securing the bonds consists primarily of environmental control ...\n\n\nApr 11, 2007 Business Wire\n\n\n\nCompetitive Power Ventures to Sell CPV Wind\n\n\n\nCompetitive Power Ventures, Inc. ('CPV') today announced that it has reached agreement for the sale of CPV Wind Ventures, LLC ('CPV Wind') to Iberdrola Renewable Energies USA, Ltd. ('Iberdrola'). The transaction includes the sale of all interests in CPV Wind to Iberdrola and is expected to close by early May. Founded in 2005, CPV Wind is a joint venture of CPV and affiliates of ArcLight Capital ...\n\n\nApr 11, 2007 PR Newswire\n\n\n\n\n\nNARUC Lauds DOE Energy Efficiency Report, Cites States' Critical Role\n\n\n\nWashington - The National Association of Regulatory Utility Commissioners lauded the Energy Department's new report on State and Regional energy efficiency policies for recognizing the important role State regulators have in developing energy efficiency programs. NARUC and the National Association of State Energy Officials, through the National Council on Electricity Policy, contributed heavily ...\n\n\nApr 11, 2007 Power Online\n\n\n\nReport: Northwest Power System Can Handle More Wind Energy, But More Work Is Needed\n\n\n\nPortland, OR - Wind power projects are being rapidly developed throughout the Northwest, and the region's existing power system can most likely accommodate the 6,000 megawatts of wind energy anticipated by 2024 - or perhaps much sooner given the current pace of development. However, there will be costs to incorporate these new wind sources as well as a need for additional investments in ...\n\n\nApr 11, 2007 Power Online\n\n\n\nNew Solar Panel Design Traps More Light\n\n\n\n(AP) -- Sunlight has never really caught fire as a power source, mostly because generating electricity with solar cells is more expensive and less efficient than some conventional sources. But a new solar panel unveiled this month by the Georgia Tech Research Institute hopes to brighten the future of the energy source. The difference is in the design. Traditional solar panels are often flat and ...\n\n\nApr 12, 2007 PhysOrg.com\n\n\n\nTransCanada nears decision on two planned power lines in US West\n\n\n\nTransCanada is close to having agreements in place with enough US Southwest utilities to move ahead with detailed permitting and siting for two 500-kV power lines that would run from Montana and Wyoming to southern Nevada, a TransCanada official told Nevada regulators Wednesday. 'It looks like we're approaching the tipping point' in securing commitments from utilities to back the two lines in ...\n\n\nApr 12, 2007 Platts\n\n\n\nHydro plans to keep up with demand\n\n\n\nIn order to fill a growing electricity supply-demand gap, B.C. Hydro will be looking at a host of new solutions to conserve more power, build more power-generating stations and reach out to smaller communities to help them meet their own power needs. \"We'll continue to see total energy usage rise,\" said Bob Gammer, BC Hydro. \"But if you were to imagine a chart with a trend line indicator of ...\n\n\nApr 11, 2007 Canada.com\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nIberdrola begins construction of two wind farms in France\n\n\n\n- Spanish utility Iberdrola has started the construction of two wind farms in France, and has announced plans to build four more in the region before the end of 2007. The plans are part of Iberdrola's aim to have 7000 MW of renewable energy projects operational in 2009, of which 1450 MW will be located abroad. The two farms currently being constructed are the Courcelles wind farm located in Aude ...\n\n\nApr 12, 2007 Power Engineering\n\n\n\nBritish Energy lines up legal action against Credit Suisse\n\n\n\n- UK utility British Energy has started legal procedures against Swiss financial services group Credit Suisse regarding the latter's stake in British Energy's Eggborough coal fired power station. According to a report by Forbes, in 2002, British Energy gave those banks that had acquired bonds in the Eggborough facility the option to acquire the plant in 2010.\n\n\nApr 12, 2007 Power Engineering\n\n\n\nDakshidin Corporation Successfully Installs Windmill for U.S. Distributor\n\n\n\nDakshidin Corporation (PINKSHEETS: DKSC) has  Dakshidin Corporation (PINKSHEETS: DKSC) has completed the successful installation of a RESTEC windmill in Prescott Valley, Arizona. This windmill was purchased by RESTEC's first U.S. distributor. RESTEC International Inc. is a wholly owned subsidiary of Dakshidin Corporation. RESTEC is selecting distributors for the windmills over the next few ...\n\n\nApr 12, 2007 Internet Wire\n\n\n\nNew Oriental Energy &amp; Chemical Corporation Provides Update on DME Production Facility Expansion\n\n\n\nNew Oriental Energy &amp; Chemical Corp. \"New  New Oriental Energy &amp; Chemical Corp. \"New Oriental\" (OTCBB: NOEC), a specialty chemical and emerging alternative fuel manufacturer in The People's Republic of China (PRC), today announced an update on its planned expansion of its existing Dimethyl Ether (DME) manufacturing facility.  In November 2006, New Oriental began the expansion of its ...\n\n\nApr 11, 2007 Internet Wire\n\n\n\nSkanska To Construct Propane Plant in Brazil For USD 76.3 M, About SEK 535 M\n\n\n\nSTOCKHOLM, Sweden--(BUSINESS WIRE)--Skanska (STO:SKAB) has secured a contract to build a propane production unit at Presidente Getlio Vargas Refinery (REPAR) in Brazil. The total contract value is USD 109 M. Skanskas share is 70 percent, USD 76.3 M, or about SEK 535 M, which will be included in order bookings for the second quarter of 2007. The customer is Petrobras, the state-owned Brazilian oil ...\n\n\nApr 12, 2007 Business Wire\n\n\n\nPakistan intends to import 1000 MW electricity from Iran\n\n\n\n- Iran are expected to agree a deal with Pakistan to supply her with 1000 MW of power to meet its growing power demand. According to official sources, the two sides will discuss feasibility of the project, rate, transmission line way and timeframe at a meeting this week. Besides supply of additional 1000 MW power from Iran to Pakistan, the experts from both sides will discuss to promote ...\n\n\nApr 12, 2007 Power Engineering\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}