{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "support@brainbench.com", "subject": "Your Brainbench Account Information Is Enclosed.", "body": "  \n  \n\n\n=================================================================\nPlease save this message!  At the end of this e-mail, you'll find \nyour account information.  You'll need this information in order \nto access your Brainbench account.\n=================================================================\n\n\nDear Zombie Warwick,\n\nWelcome to Brainbench! We're delighted that you have chosen us as your partner in securing improved skills, a great resume, and a better position at work.  As a new member of the Brainbench community, you can get started right away: \n\n8 Ways to Put Brainbench to Work for You Right Now\n\n1.  Take some FREE tests--A great way to get a feel for how certification tests give you direct feedback on your skill level. \nhttp://www.brainbench.com/links/tofreetests.html  \n\n2. Take a FREE personality assessment-A great way to make sure that your career is taking you in the right direction! 60 questions. 10 minutes. http://www.brainbench.com/links/personality.jsp \n\n3. Visit our Skills Center--Choose from over over 600 skills to measure, improve, and certify. \n http://www.brainbench.com/xml/bb/skillscenter/skillscenter.xml  \n\n4. Visit our Job Role Center--See which job role certifications can help you achieve your career goals. \nhttp://www.brainbench.com/xml/bb/skillscenter/jobrolecenter.xml  \n  \n5. Modify your \"My Brainbench\" personal preferences. \nhttp://www.brainbench.com/links/toprefs.html \n\n6. Check out your Brainbench Online Account--Store all of your test and certification results right here. You can share your information with current and future employers.\nhttp://www.brainbench.com/xml/bb/transcript/build/modifyinfo.xml\n\n7. Explore Subscription Plans--Get access to more resources at a lower subscription rate. Choose the subscription plan that suits you the best.  \nhttp://www.brainbench.com/links/topricing.html    \n\n8. Any questions?--Check out our Frequently Asked Questions (FAQs) at: \nhttp://www.brainbench.com/links/tofaqs.html\n\nOr contact our Customer Support team at: \nhttp://www.brainbench.com/xml/bb/common/customersupport.xml \n\n\nFinally -- be assured that you're in good hands.\n\n- Brainbench is the #1 Certification Provider in the world, with over 6 million members. \n- Brainbench works with Booz Allen Hamilton, CACI, EDS, Ford Motor Company,\nH&R Block, IBM, Interwoven, JPMorgan, Kaiser Permanente, Manpower,\nPrometric, SAIC, Siemens, TAC Worldwide, U.S. Government Agencies, Verizon,\nand Wells Fargo, as well as many other leading employers.\n\n\n\nOnce again, welcome to Brainbench!\n\nSincerely,\n\n\nMike Littman\nVice President, Product Marketing\nBrainbench\n\n=================================================================\n\nYour Brainbench Account Information\n\nThe logon information for your account is as follows:\n\nLogon ID:   ktwarwic@speedy.uwaterloo.ca\nPassword:   12345678\n\nYour password is case sensitive.\n\nYou can log on to your account at http://www.brainbench.com.\n\n=================================================================\n\n\n\n\n  \n\n"}