{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Matthew Neilson <matt@gneilson.plus.com>", "subject": "[R] Unwanted white borders on semi-transparent polygons?", "body": "Hey all,\n\nI'm trying to create a plot of two semi-transparent regions. The reason they need to be partially transparent is so that I can see if there's any overlap. Here's some example code:\n\n# BEGIN\n\npdf(file=\"test.pdf\",version=\"1.4\")\nplot(0,0,type=\"l\",ylim=range(-3,3),xlim=range(-1,5))\npolygon(c(0,1,2,3,4,3,2,1,0), c(0,1,2,1,0,-1,-2,-1,0), col=rgb(1,0,0,0.5),\nborder=NA)\npolygon(c(1,2,3,4,5,4,3,2,1), c(0,1,2,1,0,-1,-2,-1,0), col=rgb(0,0,1,0.5),\nborder=NA)\ndev.off()\n\n# END\n\nThe problem with this is that, despite setting \"border = NA\", I get a big white border surrounding each polygon!! Funnily enough, setting the alpha channel equal to 1 (as opposed to \n0.5) *doesn't* give the border, but an alpha channel of 1 produces an opaque polygon! :S\n\nI have read the FAQ, and (unfortunately) turning off line-art smoothing does not give the desired effect. Furthermore, my pdfs print with a white border surrounding each transparent \npolygon.\n\nNow, here comes the really bizarre part. Whilst Adobe Acrobat displays the unwanted white border, Apple Preview respects the \"border=NA\" argument and shows the two diamonds as \nthey are intended. However, opening up the pdf in Illustrator CS reveals that there is in fact a transparent (according to Illustrator) border *on top* of each diamond. Deleting these \ntwo borders (one for each polygon) and re-saving the pdf appears to correct the issue. So the obvious question is: how did the surrounding borders get there in the first place? A bug \nin the polygon function, perhaps?\n\nDoes anyone have any ideas for preventing these unwanted borders around semi-transparent polygons (without having to resort to Illustrator)? Has anyone else even come across this \nproblem?\n\nMany thanks,\n\n\n-Matt\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}