{"category": "ham", "to_address": "R Help Mailing List <r-help@stat.math.ethz.ch>", "from_address": "\"Kevin E. Thorpe\" <kevin.thorpe@utoronto.ca>", "subject": "[R] Competing Risks Analysis", "body": "I am working on a competing risks problem, specifically an analysis of\ncause-specific mortality.  I am familiar with the cmprsk package and\nhave used it before to create cumulative incidence plots.  I also came\nacross an old (1998) s-news post from Dr. Terry Therneau describing\na way to use coxph to model competing risks.  I am re-producing the\npost at the bottom of this message.\n\nI would like to know if this approach is still reasonable or are there\nother ways to go now.  I did an RSiteSearch with the term\n\"competing risks\" and found some interesting articles but nothing as\nspecific as the post below.\n\n\n----- S-news Article Begins -----\nCompeting risks\n\nIt's actually quite easy.\n\nAssume a data set with n subjects and 4 types of competing events. Then\ncreate a data set with 4n observations\nFirst n obs: the data set you would create for an analysis of\n\"time to event type 1\", where all other event types are censored. An\nextra variable \"etype\" is =1.\nSecond n obs: the data set you would create for \"time to event type 2\",\nwith etype=2\n.\n.\n.\n\nThen\nfit <- coxph(Surv(time,status) ~ .... + strata(etype), ....\n\n1. Wei, Lin, and Weissfeld apply this to data sets where the competing\nrisks are not necessarily exclusive, i.e., time to progression and time\nto death for cancer patients. JASA 1989, 1065-1073. If a given subject\ncan have more than one \"event\", then you need to use the sandwich estimate\nof variance, obtained by adding \".. + cluster(id)..\" to the model\nstatement above, where \"id\" is variable unique to each subject.\n(The method of fitting found in WLW, namely to do individual fits and\nthen glue the results together, is not necessary).\n\n2. If a given subject can have at most one event, then it is not clear\nthat the sandwich estimate of variance is necessary. See Lunn and McNeil,\nBiometrics (year?) for an example.\n\n3. The covariates can be coded any way you like. WLW put in all of the\nstrata * covariate interactions for instance (the \"x\" coef is different for\neach event type), but I never seem to have a big enough sample to justify\ndoing this. Lunn and McNeil use a certain coding of the treatment effect,\nso that the betas are a contrast of interest to them; I've used similar\nthings\nbut never that particular one.\n\n4. \"etype\" doesn't have to be 1,2,3,... of course; etype= 'paper',\n'scissors', 'stone', 'pc' would work as well.\n\nTerry M. Therneau, Ph.D.\n----- S-news Article Ends -----\n\n-- \nKevin E. Thorpe\nBiostatistician/Trialist, Knowledge Translation Program\nAssistant Professor, Department of Public Health Sciences\nFaculty of Medicine, University of Toronto\nemail: kevin.thorpe@utoronto.ca  Tel: 416.864.5776  Fax: 416.864.6057\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}