{"category": "ham", "to_address": "Ip-health@lists.essential.org", "from_address": "Judit Rius Sanjuan <judit.rius@keionline.org>", "subject": "[Ip-health] Huffington Post: The Politics of Intellectual Property Rights and\n Access to Medicines", "body": "Below find James Love/Huffington Post entry about the last WHA and the\nguidelines for a new US trade policy.\n\nRemember that tomorrow, Wednesday May 30th 2007, KEI is hosting a brown\nbag lunch and panel discussion on the intellectual property provisions\nof the new US trade policy.\n\nTime:  12:30-2:00pm\nVenue:  1621 Connecticut Avenue Suite 500, Washington, DC 20009\nPlease RSVP to ben.krohmal@keionline.org or call 202 332 2670.\n\nThe Politics of Intellectual Property Rights and Access to Medicines\nhttp://www.huffingtonpost.com/james-love/the-politics-of-intellect_b_49782.html\nBy James Love\nPosted May 29, 2007 | 09:19 AM (EST)\n\nOn Wednesday, May 23, the main UN body for health passed a new\nresolution on Public health, innovation and intellectual property. The\nresolution was applauded by the public health community, and was\nsupported by all WHO member states, except one -- the United States.\n\nEarlier, on May 10, 2007, Speaker Nancy Pelosi and Ways and Means Chair\nCharles Rangel announced a \"new bipartisan\" trade package that addressed\nsome of these same issues. The new agreement between the House\nLeadership and the Bush Administration on trade policy included a\nsection on intellectual property rights (IPR) and access to medicine in\ndeveloping countries.\n\nThe Rangel/Pelosi trade deal addressed a wide number of issues, and drew\nlots of fire from groups who opposed various elements, including Huffpo\nblogger David Sirota. Some health activists were highly critical of the\nprovisions on IPR and access to medicines in developing countries. On\nthis aspect of the deal, our impression was more favorable.\n\nRangel and Pelosi were able to deliver some substantial changes in trade\npolicy on three highly technical but very important issue. As set out in\nthis analysis, in every case, the new trade agreement reduces barriers\nto the use of generic medicines in poor countries. I agree with the\ngroups that wanted more from the Democrats. But I was perhaps more\nimpressed with how much was achieved in this first step toward a new\ntrade agenda. I hope it is not the last.\n\nThe fact that the new trade deal was an agreement with the Bush\nAdministration means it involved compromises. On the issue of IPR and\naccess to medicines, any concessions that would help poor people living\nin poor countries were bitterly opposed by the pharmaceutical industry,\na tough lobby in this town. The drug companies not only have huge sway\nwith the Republicans, they have a lot of influence with democrats,\nincluding those who are making speech after speech on the need to\nprotect our intellectual property. The new trade deal addressed the most\nimportant three issues in the current trade deals with poor countries\n(linking patents to drug registration, patent extensions beyond 20\nyears, and the new IPR right in pharmaceutical test data). The Bush\nadministration made real concessions, and patients will benefit from this.\n\nThe World Health Assembly (WHA) is the main governing body for the UN's\nWorld Health Organization. The passage of resolution WHA60.30 last week\nwas both (a) another indication the current trade system is broken, and\n(b) hope for a new and better paradigm that will serve everyone's\ninterest better.\n\nThe WHO debate on IPR and medicines is quite important, but virtually\nunknown in the one country where it is most important -- the United\nStates. Few members of Congress are following the debate, and there has\nbeen zero press coverage. In Europe and in developing countries, more is\nknown. In the past several months there have been high level meetings on\nthese issues held or scheduled in Geneva, Paris, the Netherlands, Munich\nand Brussels. The European Parliament has engaged. The U.S. Congress has\nnot.\n\nLast week the WHA resisted the pressure from the Bush Administration and\ngave the WHO a fresh mandate to provide technical assistance to poor\ncountries who want to issue compulsory licenses on patents on medicines\nor take other measures to promote access to generic medicines. But they\ndid not stop there. The WHO is debating the need for a new approach for\nfinancing new drugs, one that does not \"link\" R&D incentives to drug\nprices. Here, the Bush administration has not been horrible, at least in\nthe past year. But, nothing will really change unless there is more\nleadership from the United States.\n\nThis is the basic deal. A number of public health experts, groups and\ngovernment officials are now saying it is a mistake to have a global\ntrade framework that is devoted to higher drug prices, as the primary or\nonly instrument to promote global medical R&D.\n\n* First, they argue the trade framework should be refashioned as\nagreements to pay for R&D, and that countries should be free to choose\nall sorts of ways to do that, including public sector funding of open\nsource R&D projects, uses of innovation prizes, or other innovative ways\nto finance R&D. This new trade framework should deal both with the\nsustainable sources of finance, and make real efforts to address\npriority setting, including efforts to ensure adequate investment in\ntreatments that concern illnesses that disproportionately impact poor\npeople living in poor countries.\n\n* Second, they argue that private R&D incentives should not be linked to\ndrug prices at all, and that rewards for innovation in new products\nshould be more closely tied to evidence that the products actually\nimprove health care outcomes. A number of countries are now calling for\nbroader uses of prizes to stimulate innovation, an idea that is gaining\ntraction in a number of different areas these days, including not only\nto stimulate R&D for new medicines, but also for a number of other\npublic goods.\n\nThis new debate over the global framework to support medical innovation\nis important, and one that should be on the radar screen here -- in the\ncountry that is:\n\n1. The biggest global bully for big pharma, and increasingly isolated in\nworld public opinion, as illustrated by last week's WHA decision.\n2. The biggest funder of medical R&D in the world, including both\nprivate sector and public sector investments.\n3. The biggest purchaser of generic AIDS drugs in the world.\n4. The most in need of domestic reform to control drug prices, among\nhigh income countries.\n\n--\nJudit Rius Sanjuan\nAttorney\njudit.rius@keionline.org\n\nKnowledge Ecology International (KEI)\nwww.keionline.org / www.cptech.org\n1621 Connecticut Ave, NW, Suite 500 Washington, DC 20009 USA\nTel.: +1.202.332.2670, Ext 18  Fax: +1.202.332.2673\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}