{"category": "spam", "to_address": "\"Subscriber\" <cruiseca@flax9.uwaterloo.ca>", "from_address": "\"Time Shares Wanted\" <qh9di9zmi@intentbuild.com>", "subject": "We can help sell or rent your time share ", "body": "\n\n\n \n<!--WASHINGTON - The Senate resurrected the immigration bill that could legalize millions of unlawful immigrants Tuesday, but the delicate compromise faces the same threats that derailed it earlier this month. \n\nADVERTISEMENT\n \nThe White House and Republican and Democratic architects of the bill hailed the crucial test vote that revived the legislation, and they predicted approval of the measure by week's end.\n\nTheir victory was fleeting, though, giving way just hours later to stalling tactics by GOP foes. Conservatives succeeded in delaying until Wednesday consideration of a package of amendments designed to pave the way for a final vote on the bill.\n\nThey did so by using Senate rules to insist that the entire 373-page package be read aloud, relenting only when Majority Leader Harry Reid, D-Nev., agreed to postpone action on the amendments.\n\nThat was just the first in a series of formidable obstacles lying in the bill's path. The Senate is slated to consider 26 amendments, mostly from senators seeking to change key elements of the bill, that have the potential to either sap its support or draw new backers.\n\nAfter that, the legislation must overcome another make-or-break vote as early as Thursday. And there is no guarantee that it will ultimately attract enough support to pass.\n\nRepublicans and Democrats alike are deeply conflicted over the bill, which also would create a temporary worker program, strengthen border security and institute a new system for weeding out illegal immigrants from workplaces.\n\nMasking those divides, the Senate voted 64-35 to revive the bill, which stalled earlier this month when it failed to muster the 60 votes it needed to scale procedural hurdles.\n\nTwenty-four Republicans joined 39 Democrats and independent Sen. Joseph I. Lieberman of Connecticut to move ahead with the bill. Opposing the move were 25 Republicans, nine Democrats and independent Sen. Bernard Sanders of Vermont.\n\nSen. Edward M. Kennedy of Massachusetts, the lead Democratic negotiator on the bill, called the vote \"a major step forward for our national security, for our economy and for our humanity.\"\n\n\"We did the right thing today because we know the American people sent us here to act on our most urgent problems. We know they will not stand for small political factions getting in the way,\" Kennedy said.\n\nOn the other side, Sen. Jeff Sessions, R-Ala., said opponents of amnesty for illegal immigrants are being told they must vote for the bill anyway \"because that's the only way we're going to create a legal system of immigration in America.\"\n\nUnder the bill, he said, \"we're not going to get any substantial reduction in illegality, we're going to double illegality.\"\n\nPresident Bush and his team were working intensely to rally support for the measure.\n\n\"It's a careful compromise,\" the president told business leaders and representatives of religious, Hispanic and agricultural communities. He said, \"In a good piece of legislation like this, and a difficult piece of legislation like this, one side doesn't get everything they want.\"\n\nBush was working the phones to drum up backers, said Commerce Secretary Carlos Gutierrez, who with Homeland Security Secretary Michael Chertoff was also lobbying senators.\n\nTuesday's vote suggested that key senators and White House officials had succeeded — at least for now — in bargaining with skeptical lawmakers for a second chance to pass the bill. Several senators who have been promised votes on their amendments, including Sens. Kit Bond, R-Mo., Barbara Boxer, D-Calif., Norm Coleman, R-Minn., Pete Domenici, R-N.M., John Ensign, R-Nev., and Jim Webb, D-Va., supported moving ahead with the measure, after siding with opponents earlier this month on the test vote that stalled it.\n\nLess clear was whether that support would hold. At least one Democrat who backed reviving the bill, Sen. Robert Menendez of New Jersey, publicly said he could not guarantee he would vote later to end debate and move to final passage. \n\nMenendez is pushing for passage of his amendment to award more points in a new merit-based green card allocation system for family ties to U.S. citizens or legal permanent residents. \n\nSeveral of the Republican amendments slated for Senate votes would make the bill tougher on unlawful immigrants, while those by Democrats would make it easier on those seeking to immigrate legally based solely on family ties. \n\nLikely to be among the first voted on is a proposal by Sen. Kay Baily Hutchison, R-Texas, to require all adult illegal immigrants to return home before gaining permanent lawful status. The bill would require only heads of households seeking green cards to do so. \n\n--!>Sell us your condo or timeshare      \n\n\n\n\n\n"}