{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nLate breaking news on Capitol Hill tonight as Congress\n  prepares to send President Bush legislation that would call for the\n  withdrawal of troops to start this October. After days of harsh words between\n  the administration and the Democratic leadership about the vote, the White\n  House remains steadfast about President Bush’s plans to veto this\n  legislation, Sharyl Attkisson will report.\n \nDavid Martin will give a Reality Check on the state\n  of the troop surge in Iraq,\n  how it’s working and where funds are needed most on the ground there.\n \nNext, Bob Orr will have an update on a story he\n  broke for CBS News about the case of a man who calls himself The Bishop. This\n  morning, federal authorities arrested a man suspected of sending threatening\n  letters and two dud pipe bombs. We’ll have more details on the case and\n  the arrest.\n \nWhen John McCain started campaigning months ago for\n  the Republican nomination, he was the presumed front-runner. Now that he has\n  trailed Rudy Giuliani and Mitt Romney in polls, he’s attempting to\n  breathe life into his campaign. Today, McCain formally declared his\n  candidacy, and Jim Axelrod will have the full story.\n \nResidents of Eagle\n    Pass, Texas, say\n  they can’t remember the last time a tornado struck their area. But the\n  one that came to town yesterday was a monster – destroying two schools,\n  killing at least 11 people and damaging scores of homes. Elsewhere, flooding\n  and high winds took their toll. Hari Sreenivasan will survey the damage.\n \nAsk a kid their favorite food, and you’re\n  likely to hear chips, cookies or other sugar- or fat-loaded snacks. What\n  happens when a school reforms the way kids eat? Nancy Cordes will show you.\n \nFinally, we’ll tell you about what could be a\n  planet a lot like Earth. It seems to be roughly the same temperature and size,\n  and may even have water. The hitch: it is 120 trillion miles away. Sandra\n  Hughes will have more.\n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}