{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "\"Fred Benenson\" <fred.benenson@gmail.com>", "subject": "Re: [cc-community] Strayform - where artists and fans connecttofund\n\tand distribute new creative works", "body": "Here's an interesting one:http://thedailyswarm.com/swarm/interesting-idea-ebay-record-label/Basically, a musician is offering ONE copy of a particular track for sale on eBay. That track is licensed under BY-NC (I know I know) so the highest bidder has the right to redistribute the track non-commercially. In this case non-commercial seems to forbid resale, one of the most common interpretations of the license provision, but also \"commercial exploitations\" which may or may not prohibit the highest bidder from posting it on an adwords blog.\nAnyway, I think its a particularly neat way to co-opt eBay and digital distribution to handle part of the job of a record company. Now we just have to wait and see how much the auction goes for (it starts on June 1st.)\nFredOn 5/20/07, Kevin Phillips (home) <tacet@qmpublishing.com> wrote:\n----- Original Message -----From: \"drew Roberts\" <zotz@100jamz.com>To: <cc-community@lists.ibiblio.org\n>Sent: Sunday, May 20, 2007 1:28 AMSubject: Re: [cc-community] Strayform - where artists and fans connecttofundand distribute new creative works[snip]> >> > I've looked into several possibilities here in the UK.  There's a number\nof> > projects which gain government funding for \"charitable work\", or\"community> > work\" which benefits others at reduced or no cost.  We have a community> > studio locally for instance, I could record stuff there cheaply, or\n> > continue to do as I do now and record stuff in my own home setup.  I'mnot> > sure if a band could run as a registered charity, though it's an> > interesting concept ;)>\n> That is an idea. Pay expenses of band, including band members, roadies,etc.> salaries. Release the music under a Free (and in my book, copyleft)license.> This is certainly a benefit to the public.\nYes.  The only drawback I can see is that it's no longer \"charitable\" whenthey are fed back into the commercial ticketing system, you'd have to createsome kind of not-for-profit deriv.  Renders the whole thing a bit of a\nnon-starter.  Though having said that they could do \"free\" concerts andbring along the t-shirts and the merch......who knows.> >> > > > Historically, bundled into the> > > > cost of each CD or book is the cost of production and\n> > > > distribution.  But now with the internet distribution is> > > > nearly costless.  Let> > > > 's move the payment forward to the point of creation.> > >\n> > > That is one option. Worth an experiment in my book.> >> > There's a band called The Crimea who are doing something like thisalready,> > they offer the CD for those folks who want something tangible (or high\n> > quality), but also offer their latest album for download completely freeof> > charge.>> I am more concerned with a Free license myself, rather than free ofcharge.Yeah, that's a shame.  To be honest I'm not entirely convinced they're aware\nof the options, otherwise they may have opted for something more open.Reading their occasional interviews and posts they seem keen to duck out ofthe traditional systems.  I was also encouraged recently by something Thom\nYork said about wanting to do something similar in Time Magazine.Should CC have some kind of lobbying group to stalk these artists? lol :)> >> > http://www.thecrimea.net/\n> >> > They're smart enough to realise it'll benefit them in the longrun, asfar> > as gigs and promotion goes.  Much like the Chinese situation.>> Even with a Free license, you could charge for gigs and merchandise, etc.\n> >> > > > Recording companies pay artists upfront to create> > > > something new and then charge the consumers per copy; let> > > > 's have fans pay the artists directly and give them the\n> > > > freedom to use and share.  They will use this freedom to> > > > distribute and promote, providing a valuable service to> > > > artists.  The end result would be lower total costs, more\n> > > > freedom and control for artists and consumers, and new> > > > communities with strong ties between artists and fans.> >> > Fans do pay the artists directly, every time they turn up to a gig or\nbuy a> > t-shirt, or a high-def DVD surround sound limited edition recording.> > There's no reason for the fans to pay for recordings anymore, as TheCrimea> > point out.>\n> The thing is, if the music came with a Free license and I liked, I would> happily pay the band for a CD. (Actually, I have been thinking recentlythat> it might be a nice twist to go back to the \"album format\" for delivery of\n> CDs. Basically, album size, materials, posters, lyrics, etc. with a CDinside> instead of vinyl. Is it clear what I mean here?)Yes.  That's exactly the kind of thing I'd love to see, and I agree, I'd\nhappily pay good money for something like that.  I think one of the issueswith CDs is that the price remained fixed whilst the \"costs\" bottomed out.Most music lovers and consumers are well aware of the costs now, especially\nas daily newspapers include \"free\" CDs and DVDs whilst still paying dues tothe artists and creators.  It's difficult to convince people to pay for dataI guess.So it's the additional and exclusive things people expect to pay more for,\nthe physical things they can touch, wear or play with.  I kept my old vinylbecause some of the artwork is simply iconic, awesome stuff from the 70s and80s.  I was thinking of framing some of those old album covers.\nIt'd be great to bring back that sense of ownership, the internet is a greatplace for things like fanclubs and fan-feedback, though we're not seeing somuch of that just yet - beyond myspace..\n> > The costs associated with writing and recording are a fraction> > of what they used to be, and the opportunities for the band to claw back> > the investment with merchandising and in the commercial space are\nmassive.> >> > > > &#8211; The Site &#8211;> > > >> > > > With actualizing this vision in mind, I created> > > > \nwww.strayform.com.  It works like a social network for> > > > artist and fans with specialized features to promote,> > > > fund, and distribute new media.  A library of CC licensed> > > > media leads to you to discover new artists.  Becoming fans\n> > > > of these artists and selecting media as one of your> > > > favorites allows us to rank and provide recommendations,> > > > while giving you specialized privileges and notifications.\n> > > >  People with similar interests surfing your pages use> > > > these connections and find new favorites and artists as> > > > well.  These massive connectivity provides a network that\n> > > > funnels interest into Proposals.  Proposals are artists> > > > ' offers to create new CC licensed media funded by fans.> > >> > > Unless htis is for BY and BY-SA works, I am not too interested. To me\nthe> > > works are still mostly gonna be useless and pollution.> >> > There was another website in the news recently which looked a lot like> > yours in concept, I forget the name.  This other website was making a\nsong> > and dance (almost literally) about their first artist making a CD from> > monies pledged by myspace fans.  I say great, whatever works.  Thoughwhen> > they finally make their recording it wasn't clear if they'd then give\nthe> > recording away for free or start to charge for it.>> Again, for me, the crux of the matter is not whether they give it away or> charge for it, it is whether it comes with a Free License.\nAgreed.> >> > I've also heard of other schemes where funders are effectivelyinvestors.> > So the whole thing becomes like the stock market with share values for> > artists etc.\n>> This is effectively no more than a twist on the corporate or partnership> model. Unless there is a Free license involved, what is to stop a sell outin> a few years to the majors? (Leaving the majority of fans no better off\nthan> they are now.)Again, very much agreed.  I don't like the idea for that reason, it's moreof the same thing but with the convenience of lower risk by burdoning thefans with the setup/recording costs.  A lot of the news repotage talks of\n$50,000+ for recording fees, sounds to me like a studio somewhere is makinga good living out of it!> >> > I would suggest building into your plan somehow the \"beyond music\"strategy\n> > of the Chinese, so artists using your site don't expect to make moneyfrom> > the fans for the music directly.  There should be something else,> > merchandising or signed pictures or whatever.\n>> That is one option, but I think setting a price at which you will releasea> track with a Free license (say CC BY-SA for the sake of argument) is worthan> experiment. If I can get some people together willing to record this way,\nI> will run some experiments along these lines.Yeah, what's kinda happening is the music industry in China is acceptingtheir fate of every release being BY-ND :)  I agree, removing the ND and\nreplacing it with an SA would be an interesting experiment.If you ever start this, count me in ;)Kev_______________________________________________cc-community mailing list\ncc-community@lists.ibiblio.orghttp://lists.ibiblio.org/mailman/listinfo/cc-community\n"}