{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nTuesday, 08 May, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nBall admits FA misconduct charge\nMan City defender Michael Ball is set to serve a three-match ban after admitting he stamped on Man Utd's Cristiano Ronaldo.\n\n\n\n \nFA charges Brown after headbutt\nFulham midfielder Michael Brown is charged with violent conduct after headbutting Liverpool's Xabi Alonso.\n\n\n\n \nGroup eyes £50m Charlton takeover\nA foreign consortium is putting together a bid for newly relegated Charlton Athletic, BBC Sport understands.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nRush expected for Walker tickets\nA rush for Walker Cup tickets is anticipated after a crowd limit of 10,000 was placed on the event at Royal County Down.\n\n\n\n \nWoods battles to Wachovia victory\nTiger Woods shoots a final-round 69 to clinch the Wachovia Championship in Charlotte by two strokes.\n\n\n\n \nFernandez-Castano wins play-off\nSpain's Gonzalo Fernandez-Castano beats Austrian Markus Brier in a play-off to win the Italian Open.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nRenault expect tough Spanish test\nFormula One champions Renault still expect to be trailing Ferrari and McLaren at this week's Spanish Grand Prix.\n\n\n\n \nStoner powers to Shanghai victory\nDucati's Casey Stoner saw off the challenge of Valentino Rossi to win the China Grand Prix and extend his MotoGP series lead to 15 points.\n\n\n\n \nLoeb wraps up Argentina victory\nWorld champion Sebastien Loeb wins the Rally of Argentina.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nRenault expect tough Spanish test\nFormula One champions Renault still expect to be trailing Ferrari and McLaren at this week's Spanish Grand Prix.\n\n\n\n \nAlonso backs Spanish GP changes\nWorld champion Fernando Alonso says changes to Spain's Grand Prix track will make overtaking easier.\n\n\n\n \nSecond crash at Spanish GP track\nWilliams' Nico Rosberg is unhurt in the second high-speed crash at the Circuit de Catalunya this week.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nGlasgow begins Commonwealth bid\nGlasgow's official 2014 bid document  is on its way to London to be handed over to the Games Federation.\n\n\n\n \nMutai takes Belfast marathon win\nKenyan John Mutai comes close to a record time in claiming victory in the 26th Deep RiverRock Belfast City Marathon on Monday.\n\n\n\n \nKenyan triumphs in Edinburgh run\nHosea Macharinyang wins the men's Great Edinburgh Run, with Jelena Prokopcuka securing the women's title.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nGiro champion Basso denies doping\nItaly's Ivan Basso denies doping, the day after admitting he was involved in the Operation Puerto blood doping scandal.\n\n\n\n \nGB is top cycling nation - King\nBritish Cycling boss Peter King says this country's riders are the best in the world and will be GB's best hopes of Olympic gold.\n\n\n\n \nUnder-fire Basso parts with team\nIvan Basso quits the Discovery Channel team after an investigation into his role in a Spanish doping scandal is reopened.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nComment: Alex the Great\nRobbo hails United's title triumph and hopes Mourinho stays put\n\n\n\n \nReview of the week\nChelsea and Man Utd are the butt of the email jokes doing the rounds\n\n\n\n \nFA Cup competition\nWatch our best video entries and vote for your favourite\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}