{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Steven Wells <extrakids@goldenstarnetwork.com>", "subject": "Sexual energy", "body": "\n\nCan you satisfy your girlfriend? Or you are afraid that she meets with someone who is better than you in bed?\nEverything for your health\nBuy Licensed and Quality Viagra or Cialis at US Drug store now and you'll be at the top all night long!\nAll this you can find here\nWe offer only legal and licensed medications. Cheapest prices you ever seen.\nWith best regards,\nSteven Wells\n \n \nKak ia ni podzhidal, vse zhe edva ne propustil etot smertelnyj udar i tolko Blagodaria Mobra, uskorivshemu refleksy, sumel parirovat. Podtianutaia shirokoplechaia figura istochala agressivnuiu uverennost, Pravaia ruka krepko szhimala tiazhelyj izluchatel. Neporiadochno? A pri chem zdes voobshche poriadochnost? S kakoj storony ee prikleit? Nas prosto ugorazdilo okazatsia ne v tom meste ne V to vremia. Zheltyj Master vhodil v chislo teh nemnogih, kogo Altares eshche Ne zamenil svoimi stavlennikami v krasnom. \nNa pervyj vzgliad kartina zapusteniia byla zdes eshche plachevnee, chem v Predydushchem pomeshchenii, no, nesmotria na vse tot zhe sloj pyli tolshchinoj v palec, Pokryvavshej vystroivshiesia vdol sten dlinnye riady kamer hraneniia, na ih Dvercah goreli zelenye ogonki. 16. Hlopnula vhodnaia dver. Nad golovoj navislo ogromnoe zhutkoe pokryvalo, Razdeliaiushchee miry. Nakonec chto-to kachalo proiavliatsia. Razve ty mozhesh zadavat glupye voprosy. Tut odno iz dvuh ili otsutstvie mozgov, ili Izbytok nagloj samouverennosti. Kogda Glaza ego sfokusirovalis na nashih fizionomiiah, prygun chut bylo ne Zahlebnulsia ot neozhidannosti, no reakciia u nego okazalas otmennoj. \nEmu do sih por s trudom verilos, chto Diadiushka, etot vlastoliubivyj, nadmennyj meshok derma, vdrug tak legko otdal sebia Vo vlast drugogo maga Namestnika Haaskana. Dom Uhnul i zapylal, slovno smolianoj fakel, hotia izvestno, chto kamenitovaia drevesina Pochti ne podverzhena dejstviiu ognia. chto znachit uhodim? Nkot slabo usmehnulsia: Posluzhivshij prichinoj razdora, Klinok ne dostalsia nikomu iz oldzhej, Potomu chto ih bolshe ne sushchestvuet. A potom sovershenno neozhidanno Rasselina oborvalas, to, chto ia uvidel, zastavilo menia ostanovitsia, nevziraia na Teh, kto zastrial za moej spinoj. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}