{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Arnoud Engelfriet <arnoud@engelfriet.net>", "subject": "Re: Logo trademark license vs. copyright license", "body": "Francesco Poli wrote:\n> What I am proposing is just licensing under both laws, but with two\n> separate grants of permissions: a copyright license (Expat) and a\n> trademark license (the one we are trying to write).\n\nI understand that. It's certainly possible. But what happens if\nsomeone stays within the bounds of the copyright license, and\nstrays outside the bounds of the trademark license? Which one wins?\n\nYour argument is that the trademark holder will win, because the\nlicensee exceeded the trademark license. I am afraid someone will\nargue that the copyright license (from the same entity) should count\nfor more than the trademark license, and that therefore he should win.\n\n> I still fail to see how a copyright license could trump a trademark\n> restriction.\n\nThe big question is, will a jury also fail to see that? \n\nMy view is, if a restriction prevents someone from arguing an\nunlikely case, and does not hamper legitimate situations, go for it.\n\n> For instance, suppose you download an image representing a fish, which\n> happens to be a derivative work of the Debian swirl (after many, many\n> heavy modifications!).\n> That image is not confusingly similar to the Debian logo.\n> Hence, the only needed license is the copyright one.\n\nTrue. But how is anyone's freedom affected by the useless baggage\nof a \"no confusion with Debian\" clause?\n\n> You would receive the fish image with a copyright license and no\n> trademark license.\n> Suppose the copyright license stated that you cannot use the fish image\n> in commerce in such a way to cause confusion as to the affiliation, and\n> so forth, with the Debian Project and SPI.\n> Wouldn't it be awkward?\n\nWell, in a way I suppose. \"What's that doing here?\" \n\nOn the other hand, someone further down the road may remove the fish\nand recover the swirl-and-bottle, then put that on his own CD-ROMs\nwith operating systems, which he then sells. Now what?\n\n> I mean: it's true, but the same holds for any other entity.\n> You cannot use the fish image in commerce to cause confusion as to the\n> affiliation, and so forth, with Microsoft Corporation, either.\n\nThat is true. But Microsoft had nothing to do with the image, so\nthe license or origin of the image is irrelevant when it alleges\ntrademark infringement. In this case, it would be more like\nMicrosoft giving you an image, saying you could do anything you\nwanted with it, and then sued saying \"oh wait we didn't mean you\ncould do *that*\". Would that look reasonable to a jury?\n\n> As I said above, I think that none of them \"wins\".\n\nAs I said above, you're now relying on a jury agreeing with you.\nI'm European, so my opinion is based on hearsay, but in my opinion\nthe last thing you want in a lawsuit is hoping the jury agrees with you.\n\nArnoud\n\n-- \nArnoud Engelfriet, Dutch & European patent attorney - Speaking only for myself\nPatents, copyright and IPR explained for techies: http://www.iusmentis.com/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}