{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"Health Week\" <mailings@mail.cnn.com>", "subject": "This Week in Health", "body": "\n\n\n\n\nCNN.com - Health Week\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFriday, May 18, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLawmakers push for change in food safety oversight\nSpurred by deadly outbreaks of E. coli and other food-borne pathogens, a group of U.S. lawmakers is pushing to put all food safety oversight under a single federal agency. The Food Safety Act of 2007 would create a Food Safety Administration responsible for ensuring the security of the food supply from all forms of contamination. \nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudy: Treadmill-desk could  take weight off\nThink work feels like a treadmill now? Try a new desk designed at the Mayo Clinic.  Researchers got15 obese people to work at the \"vertical workstation\" -- a desk fitted over a standard treadmill -- and measured the calories they burned.\nFULL STORY\n\n\n\n\n\n\nExposure to cats in infancy may boost allergy risk\nChildren exposed to higher levels of cat allergen in their first 2 years of life may be at greater risk of becoming allergic to the animals, a new study from Germany shows. However, the risk of sensitization at 6 years old seems to disappear.\nFULL STORY\n\n\n\n\n\n\nExperts: Cancer fears create self-fulfilling prophecy\nMany Americans fear they can do nothing to protect themselves from cancer, and they may be creating a self-fulfilling prophecy, U.S. researchers say. In a survey of more than 6,000 people, 47 percent agreed that \"nearly everything causes cancer.\"\nFULL STORY\n\n\n\n\n\n\nCDC: South sees heavy health burdens from stroke\nStrokes are most common in Mississippi and other Southern states and least common in Connecticut, according to a report providing the first U.S. state-by-state accounting of the third-leading cause of American deaths.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Health Week email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}