{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Nathanael Nerode <neroden@fastmail.fm>", "subject": "Logo trademark license vs. copyright license", "body": "Yeargh.  I'm sorry I wasn't paying attention in February and didn't see that Wiki \npage.\n\nLook, we know what we want to do.\n\n(1) License the *copyright* freely as usual.\n(2) Restrict the *trademark* with traditional trademark restrictions only: \nit may not be used for deliberate \"palming off\", but may be used in any other \nway.  (So, crap like trademark \"dilution\" and \"defamation\" we do want to give \npermission to do.)\n\n(3) Provide a model trademark license for upstreams to use.  :-)\n\nConsensus is that traditional trademark restrictions are entirely compatible with \nfree software, as they are entirely a matter of honesty.  Name change and \nattribution clauses, which we allow routinely, are *more restrictive* than the \nbasic trademark restrictions.\n\nIf we explicitly permit the Open Use logo to be used to identify, oh, say, Red \nHat Linux or Microsoft Windows, we are being idiots.  And frankly some of the \nproposed licensing might do exactly that: waive trademark rights entirely.  \n(The MIT/Expat license unfortunately does not specify that it is a copyright \nlicense.)\n\nWe should set a good example, and that means retaining the trademark rights which\nmake sense for free software and disposing of the rest.\n\nI think we actually have a strong case for a new license.  I've made some \nproposals on the Wiki page ProposedTrademarkPolicy.  Thinking further, I would \npropose this, though I don't like it perfectly (it's unclear thanks to being \ngeneric, unlike the ones on the Wiki page).  I really think we need a lawyer, \nbut the trouble is we're charting uncharted waters here, so they probably don't \nknow any more than we do.\n\nNathanael's Model Free Trademark License\n----------------------------------------\nThe work [X] is a trademark, held by [Y], representing [Z].\n\nThe trademark holder hereby grants permission to any person to use the trademark\n(and derivative marks) in any way except one: you may not use it to falsely \nrepresent something else as being the thing represented by the trademark.  This \npermission should be interpreted broadly: any use which is not clearly deceptive \nis permitted.\n\nThe work is also subject to copyright, and is licensed under the copyright \nlicense below, but that is not a trademark license and should not be construed \nas one.\n-------\n\nPotential usage examples follow.  These are \"paragraph one\" descriptions, with \nthe other two paragraphs identical to the above.\n\n(1) Debian Open Use\nThe work called the \"Debian Open Use Logo\" is a trademark, held by SPI on \nbehalf of the Debian Project, representing the Debian Project and the Debian \ndistributions.  (It represents Debian in any and all contexts, including works \nbased on Debian, compatibility with Debian, criticism of Debian, comparison of \nother distributions with Debian, etc.)\n\n(2) Debian Official Use\nThe work called the \"Debian Official Use Logo\" is a trademark, held by SPI on \nbehalf of the Debian Project, representing endorsement by the Debian Project.  \n(For informational purposes, the endorsement of the Debian Project\napplies to all unmodified copies of the official Debian distributions, the \nwww.debian.org webpages, and possibly other things.)\n\n(3) Debian, the word\nThe word \"Debian\" is a trademark, held by SPI on behalf of \nthe Debian Project, representing the Debian Project and the Debian distributions.  \n(It represents Debian in any and all contexts, including works based on Debian, \nslightly modified versions of Debian, criticism of Debian, comparison of other \ndistributions with Debian, etc.)\n\n-- In this case, paragraph 3 would be omitted, since the word *isn't* covered by \ncopyright.\n\n(4) Firefox logo (the way they seem to be using it lately)\nThe work known as the Firefox logo is a trademark, held by the Mozilla \nFoundation, representing a build of the Firefox browser made by persons approved \nby the Mozilla Foundation from source code pre-approved by the Mozilla \nFoundation.\n\n(5) Firefox logo (the way it should have been)\nThe work known as the Firefox logo is a trademark, held by the Mozilla \nFoundation, representing the codebase for the Firefox web browser, and \nany work closely based on it.\n\n-----------\nThoughts welcome.  Also, please feel free to forward this to anyone who's doing \nsomething about the 'logo issues'.\n\n-- \nNathanael Nerode  \n\n[Insert famous quote here]\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}