{"category": "spam", "to_address": "<theorize@plg.uwaterloo.ca>", "from_address": "\"Liz Peters\" <uty@frontiernet.net>", "subject": "One of the most commonly used features in Calc,  is creating formulas to perform calculations.", "body": "\n\n\n\n\n\n\n\nNow, I'm sure the company didn't intend to send me \nthe information twice, but they did because I am entered into their mailing list \ntwice. To find out how easy it is to create custom styles for use  in your \nspreadsheets, read the short article on how to Create a Formatting Style in Excel \n2007.\nThis article also has links to other basic \noperations, such as addition or subtraction, and multiplication.\nI don't know what program their mailing list is \nstore in, but if they used Excel 2007, it would be easy to remove such duplicate \ndata. I don't know what program their mailing list is store in, but if they used \nExcel 2007, it would be easy to remove such duplicate data.\nThe formula tells Excel, what data to use, the \nmathematical operation to carry out, such as division, and where to place the answer \nin your spreadsheets. What they should do is remove the duplicate record from the \nlist. To find out how to create and use formulas in Calc spreadsheets read the step \nby step tutorial on Open Office Calc Formula Tutorial. I don't know what program \ntheir mailing list is store in, but if they used Excel 2007, it would be easy to \nremove such duplicate data. To find out how easy it is to copy custom styles for use \nin all your spreadsheets, read the short article on how to Copy a Formatting Style \nin Excel 2007. Now, I'm sure the company didn't intend to send me the information \ntwice, but they did because I am entered into their mailing list twice. The only \ndifference was that one address used my full name and the other just my first \ninitial and last name. org,  has all the features needed to create fully functional \nspreadsheets. Initially, when a style is created, it is only available in one \nspreadsheet. For details on how to use the HLOOKUP function in your spreadsheets, \nincluding an example, read the article on the Excel HLOOKUP \nfunction.\n"}