{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "\"Esteban Booth\" <EstebanNolanrcfrock@dynamicteamsports.com>", "subject": "Fwd: ", "body": "\n\n\n\n\n\n\n\nShe has the luck of the devil himself, Paul \nthought drearily, and watched as she put the mower in neutral and then pushed \nit off the trooper with one hard shove.\"Id want to know what was going to \nhappen in Chapter 18 even if I7 ended with Misery and Ian and Geoffrey sitting \nin armchairs on the porch, reading newspapers.Annie was right; the story \nwas turning out to be a good deal more gruesome than the other Misery books - \nthe first chapter had not been a fluke but a harbinger.Geoffrey realized \nwith cold certainty that what they had seen when Hezekiah pulled the protective \nscreen of bushes aside had come very close to driving Ian \nmad.She has the luck of the devil \nhimself, Paul thought drearily, and watched as she put the mower in neutral and \nthen pushed it off the trooper with one hard shove.\"Id want to know what \nwas going to happen in Chapter 18 even if I7 ended with Misery and Ian and \nGeoffrey sitting in armchairs on the porch, reading newspapers.Annie was \nright; the story was turning out to be a good deal more gruesome than the other \nMisery books - the first chapter had not been a fluke but a \nharbinger.Geoffrey realized with cold certainty that what they had seen \nwhen Hezekiah pulled the protective screen of bushes aside had come very close \nto driving Ian mad.Annie was right; \nthe story was turning out to be a good deal more gruesome than the other Misery \nbooks - the first chapter had not been a fluke but a harbinger. She has the \nluck of the devil himself, Paul thought drearily, and watched as she put the \nmower in neutral and then pushed it off the trooper with one hard \nshove.Annie was right; the story was \nturning out to be a good deal more gruesome than the other Misery books - the \nfirst chapter had not been a fluke but a harbinger. She has the luck of the \ndevil himself, Paul thought drearily, and watched as she put the mower in \nneutral and then pushed it off the trooper with one hard \nshove.\n"}