{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Marcia Glover\" <veqdekkaidoxod@dekkaido.com>", "subject": "Watch your body change with Anatrim", "body": "\nEnd the annoying obesity now\n\n\n\n\n\nAnatrim – The very up-to-date and most enchanting product for corpulent people is now readily available – As told on ABC\n\n\n\nDid you understand that superfluous body kilos kill a plenty of people around the planet? We know that you hate the unattractive appearance of people like those and the social prejudice against them. \n\nMoreover, you can’t resist an assault of your ruinous eating habits. If it all sounds familiar, then we got something for your consideration!\n\n\n\n\n\nIntroducing Anatrim, the ultimate product for the reduction of your body’s extra weight. The most astonishing thing is that Anatrim improves the quality of your life, making you eat less and always cheering you up. Pay you attention to some notes from our customers:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of watching TV continually and eating any food close at hand \n\n\nI became keen on doing sport.\n\n\n\n\n\n\n Anatrim put me on the right path.\n\n\n I have a great shape now and lots of men fix their eyes on me!\"\n\n\n\n\n\n\nLinda F., New York\n\n\n\n\n\n\n\"Passive weight burning was of little result to me. This terrible appetite would just rush in and spoil everything. \n\n\nOne day I heard about Anatrim in the media and I was really effected at the information.\n\n\n I had tried taking it, and my wife told me that I'm a different person now, 5 months later. \n\n\n28 pounds off and I keep still losing them! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nMikkey Fox, San Diego\n\n\n\n\n\nAnatrim helps you to realize that you got no such great need for the constant eating. It raises your spirit, provides you with extra energy, and attacks needless kilos. All thanks to its mighty original formula!!\n\n\n\nFind out more information about this great product now!\n\n\n\n"}