{"category": "spam", "to_address": "langa2@flax9.uwaterloo.ca", "from_address": "\"Windows Secrets\" <Editor@WindowsSecrets.com>", "subject": "Is your security system up to date? [Newsletter Comp Version]", "body": "\n\nIs your security system up to date?\n\n\n\n\n\n\nIf your software garbles this newsletter, read \nthis issue \nat WindowsSecrets.com.\n\n\n\n   \n\n\n\n\n\n\n \n\n\n\n\nYOUR NEWSLETTER PREFERENCES\nChange\nDelivery address: langa2@speedy.uwaterloo.ca\nAlternate address: langa2a@speedy.uwaterloo.ca\nLocale: United States 90210\nReader number: 82660-13329\n\n\n   \n\n\n\n\n\n   \n\n\n\n\n Home \n Newsletter \n WinFind \n Reviews \n Polls \n Contact \n \n\n\n\n\n This issue \n Past issues \n Upgrade \n Prefs \n Unsubscribe \n \n\n\n\n\n   \n\n\n\n\n\n   \n\n\nWindows Secrets Newsletter • \nIssue 109 • \n2007-05-24 • \nCirculation: over 270,000\n\n\n\n\n\n\n\n\n\n\nTake a break — our next issue is June 7\n\n\n\nWe publish the Windows Secrets Newsletter weekly, on the 1st through 4th \nThursdays of each month. We work hard to bring you the best new \ninformation, but in months that have a 5th Thursday, we take a break that week \nto recharge our batteries and do long-term research. That means you won't see a newsletter on \nMay 31. Our next regular issue will appear on June 7. Go outside \nand smell the roses! —Brian Livingston, Editorial Director\n\n\n\n   \n\n\n\n\n\n\n   \n\n\n\n \nContents\n\n\nTOP STORY: Is your security system up to date?\nKNOWN ISSUES: Microsoft licenses OEM software for single users\nWACKY WEB WEEK: Make your own church marquee\nKNOWN ISSUES 2: More ways to avoid automatic credit-card charges\nPC TUNE-UP: Make Vista load files 10 times faster!\nOVER THE HORIZON: What to do when Windows turns against you\nPATCH WATCH: Internet Explorer patch is now a must-install\n\nYOUR SUBSCRIPTION: How to change your address or unsubscribe  \n\n   \n\n\n\n\n\n\n   \n\n\nFor links to every subtopic in this issue, scroll down to the \nIndex\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nForget Vista, make your XP system faster\nPC Pitstop's Optimize Scan 1.5 is easy-to-use software that will automatically diagnose problems with your PC and give you a custom report detailing issues that are hurting your PC's performance. Run this free scan now!\nwww.pcpitstop.com\n\n\n\n\n\n\n\n\n\n \n\nDeep Six anti-spam appliance for SMBs\nPatented technology stops spam at the network edge. Designed for SMBs: the DS200 is the lowest cost, most accurate solution available. Easy to install and maintain. Recent firmware release features new Management GUI and enhanced tools. Try it free.\nwww.tyrnstone.com\n\n\n\n\n\n\n\n\n\n \n\nLaunch your IT career with CompTIA A+\nOur CompTIA A+ training videos have everything you need to earn the industry's most popular and respected entry-level certification (including coverage of all four A+ exams). Tell employers you know computers — get A+ certified! View the demo now.\nwww.TrainSignal.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\nTOP STORY\n\n\n\nIs your security system up to date?\n\n\n\n\n\n\n\n\n\n\nBy Scott Dunn\nWindowsSecrets.com maintains a \nWSN Security Baseline page to keep you current \non the bare minimum you need to protect your home or small-business systems against \nmalware.\n\nThis list is based on our analysis of the reviews and editor's choices from leading PC \npublications and Web sites, including PC Magazine, \nPC World,\nCNET, \nand others.\n\n\n\n\n\n\n\n\nThe basic tools you need\n\n\n\nYou need at least three categories of tools to secure your system:\n\nA hardware firewall, usually in the form of a router;\n\nA software security suite (a separate antispyware app is no longer needed, as I explain below); and\n\nA patch-management system for staying current \nwith the latest updates.\n\n\n\nRouters: the story doesn't 'n' here\n\n\n\nThe most economical way to get a hardware firewall is to get an Internet router \nwith built-in firewall features — preferably one that includes wireless \ncapability.\n\nMost wireless routers in use today follow the 802.11b or 802.11g standard, which \nspecifies the speed and range of data transfers. The newest draft specification is \n802.11n, whose multiple data streams promise faster transfers and longer range \nthan before. It's also intended to eliminate the problems of interference and \nspotty coverage that sometimes occur with the current standard. A number of \n\"n\"-based routers are already available.\n\nUnfortunately for consumers, the \"n\" standard is still in draft stage and is not \nexpected to be ratified by the Institute of Electrical and Electronics Engineers \n(IEEE) until 2009. An unratified status means the specification could change, \nleaving consumers stranded with an incompatible product that may or may not be \neasy to upgrade. For this reason, a number of reviewers shied away in 2006 from \nrecommending \"n\"-based products.\n\nNow the climate seems to be changing. Manufacturers have worked together over \nthe last year to create \"n\"-based routers that work well and work together. A \nnumber of commentators and reviewers, including \n PC Magazine and the \n computing column of the Houston Chronicle, have begun to recommend these \nproducts.\n\nHere's my advice: If you aren't suffering from the problems that the \"n\" standard \nis meant to solve — slow speeds and inadequate range — there's little reason to \nrisk isolating yourself with a product that may be outdated soon by a changing \nstandard. I suspect that most home and small-business users are not likely to \nneed the new technology in the near term.\n\n\n\n\nNetgear is the hardware firewall of choice\n\n\n\nThere's no clear winner in the latest batch of router reviews, but Netgear's \n\nRangeMax 240 WPNT834 has garnered an Editor's Choice from \nPC Magazine \nand got high marks from other publications as well. This pre-\"n\" router includes \nthe WPA2 encryption standard (which is the current leader and one I recommend) \nand includes four LAN ports, in addition to wireless capabilities. \nIts price online ranges from US$50 to US$120. The separate NetGear \n WPNT511 notebook adapter card is not required, but is likely to improve speed and \ncompatibility. It sells for US$85 (street).\n\n\n\n\nZoneAlarm remains the top-rated suite\n\n\n\nLong a favorite among testers, \n\nZoneAlarm Internet Security Suite ($50 street) is still the preferred security suite among respected \nreviewers. Like other products in this category, this suite includes software \nfirewall, antivirus, and antispyware as well as other OS and privacy-protection \nfeatures. It recently received an Editor's Choice from \n CNET, which cited its \"perfect balance between best-of-breed security protection and ease \nof use.\"\n\nIn previous editions of the WSN Security Baseline, we've recommended a separate \nantispyware utility because the tools in the security suites weren't yet up to snuff. \nThat no longer appears to be the case. CNET\n notes that the antispyware tools in ZoneAlarm Internet Security Suite continue \nto improve, and the Apr. 10, 2007, \nPC Magazine goes so far as to say \nthat the ZoneAlarm suite \"blocked and removed spyware better than the best \nstandalone antispyware products (and better than NIS 2007).\"\n\nNIS 2007, known formally as \n Norton Internet Security 2007, is a major alternative to ZoneAlarm and \nreceived an Editor's Choice designation in the Apr. 10 PC Magazine.\n\n\n\n\nMS Update and PatchLink for patch management\n\n\n\nFor novices, we continue to recommend the free \nMicrosoft Update \n(which requires Internet Explorer) to update Microsoft Office and a few other \nMicrosoft products as well as Windows itself. As before, we advise users to \nconfigure Microsoft Update to Notify me but don't automatically download and \ninstall. Then, keep reading Windows Secrets to learn which updates might be risky or \nundesirable to install.\n\nFor businesses with solid IT experience, it's useful to have an independent tool \nfor downloading and installing Windows patches and upgrades. \n Windows IT Pro Magazine recently gave its Editor's Choice to \nPatchLink Update, \nwhich costs $1,495 for a network server plus $18 annually per Windows machine. \nThe same product received a Best Patch Management award from \nSC Magazine \nduring its 2006 SC Awards Europe. The product gets especially high marks for \nnetworks that support a mixture of operating systems.\n\nFor larger networks, the \n Window Security site \ngives its recently updated gold rating to  GFI LANguard Network Security Scanner ($575 for 32 machines).\n\n\n\n\nThe WSN Security Baseline as it stands\n\n\n\nTo see a summary of the end-user security products that are currently top-rated by test \nlabs, visit the \n\nWSN Security Baseline page. As changes occur in the ratings, \nwe'll give you updates here in the newsletter.\n\n\n\t\t\t\tReader, please rate the above article:\n1: Poor \n\t\t\t\t2: Fair \n\t\t\t\t3: Good \n\t\t\t\t4: Great  5: Superb\n\n\n\nScott Dunn is associate editor of the Windows Secrets Newsletter. He is \nalso a contributing editor of PC World Magazine, where he has written a \nmonthly column since 1992, and co-author of \n 101 Windows Tips & Tricks (Peachpit) with Jesse Berst and Charles Bermant.\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nBackup your data with ZipBackup\nFinally, a backup program that is easy to use.  ZipBackup's Wizard makes backups a snap for beginners. Filtering,  scheduling, and disk spanning make it a powerful tool for experts. For a limited time, Windows Secrets readers receive 25% off.\nwww.zipbackup.com\n\n\n\n\n\n\n\n\n\n \n\nGet your product seen by 270,000 readers\nDoes your company offer a product or service? Now you can place an ad in the Windows Secrets Newsletter and be seen by more than 270,000 active buyers of PC hardware and software. Bid as much or as little as you like to get the ideal ad placement.\nwww.WindowsSecrets.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\nKNOWN ISSUES\n\n\nMicrosoft licenses OEM software for single users\n\n\n\n\n\n\n\nBy Scott Dunn\nMy story in the \n\nApr. 26 newsletter reported on the sale of \"OEM versions\" of Windows, \nwhich can be purchased much more cheaply than even heavily discounted \"educational\" \nversions.\n\nReaders debated in the \nMay 3 and \n May 10 issues the ethics of buying OEM versions of Windows, \nbut there's clear evidence that Microsoft officially supports the sale of OEM licenses \nunder certain conditions to any individual who's building a PC.\n\n\n\n\n\n\n\nMS site encourages OEM sales to individuals\n\n\n\nReader Richard Edwards sent us some Web pages from Microsoft's \n\nPartner Program site, which is accessible only to registered users. These Microsoft \npages support the view that any \"system builder\" \ncan legally purchase and install OEM software — even a home hobbyist who just \nworks with a single machine. Microsoft's \n OEM license agreement defines a system builder as \"an original equipment \nmanufacturer, an assembler, refurbisher, or pre-installer of \nsoftware on computer systems.\" [Emphasis added.]\n\nNaturally, the other limitations of the OEM version, which I mentioned in the \nApr. 26 issue, still apply, \nincluding the lack of technical support from Microsoft and the fact that the license \ncan't be transferred to another machine under the license terms.\n\nA February blog posting on the Partner Program site asks, \"Can a \nsystem builder sell an OEM copy of Windows Vista without attaching it to a piece \nof hardware?\" The answer that follows is:\n\n\n\n\"YES! YES! YES you can!!!!!!! As long as you do not open the package AND the end \nuser is assembling their own PC (at that point the user is considered a system \nbuilder). [Emphasis added.] As of August 2005, the licensing changed on all \nof the OEM licensing packs — 1, 3, and 30.\"\n\n\nAnother page on this private site states:\n\n\n\n\"OEM system builder software packs are intended for PC and server manufacturers \nor assemblers ONLY. They are not intended for distribution to end users. Unless \nthe end user is actually assembling his/her own PC, in which case, that end user \nis considered a system builder as well.\" [Emphasis added.]\n\n\nFigure 1. This image from Microsoft's Partner Program site, which is \navailable only to registered users, clearly states that vendors can \nsell the OEM version of Windows as a 1-pack to individuals who are \nbuilding a system, as long as the packaging is not opened by the \nvendor.\n\nUnfortunately, Microsoft has chosen to hide some of its clearest statements \nabout the sale of OEM software to end users on a Web site that is only available to those who \njoin the Microsoft Partner Program (see Figure 1).\n\nA further annoyance is that the license agreement states that OEM software \nmust be installed using Microsoft's OEM Preinstallation Kit (OPK). According to a Microsoft \n Web page, although the OPK tool is included with the \"3-pack\" \nOEM version of Windows and Office 2003, it is not included with \nthe 1-user OEM version of Windows and Office 2003. To obtain the tool, \nan individual system builder must download it from the members-only \nMicrosoft Partner Program Web site.\n\nThe good news, however, is that any business (however small) can \njoin the Partner Program at no charge.\n\n\n\nQuick fixes for subscription subterfuge\n\n\n\nReader responses poured in after my \nMay 17 \nstory on security firms that make it difficult for you to opt out of \nautomatic credit-card charges.\n\nWe received a lot of good tips, tricks, and suggestions for avoiding surprises \non your credit-card statements. Many people sent in solutions, like this one \nfrom Steve Himel:\n\n\n\n\"I avoid the whole automatic subscription renewal of security products by simply \npurchasing the retail, boxed version of the software. So far, I have been able to \nregister the software to obtain updates for a year without giving away a credit-card \nnumber. When the year is up, I simply purchase a new retail version of \nsecurity software — either the same product, or I can switch to a different product. \nAlso, with sales and rebates, the cost of a new retail package is often less \nthan the subscription-renewal price.\"\n\n\nGood points, Steve. As other readers noted, this strategy also gives you a \nphysical disk that acts as a backup if you need to reinstall the product. \nMoreover, in most cases, subscriptions only update your virus and spyware \ndefinitions, but don't upgrade the product to the newest version. Buying a new \nbox each year ensures you have the latest version.\n\n\n\nUse virtual credit-card numbers\n\n\n\nAn enormous number of readers suggested \nsingle-use credit-card numbers, a feature offered by some credit-card companies. \nFor example, Matthew Persico explains his strategy:\n\n\n\n\"When I use a vendor site, I give them a VAN — a Virtual Account Number. \nCitibank provides this service for all Citibank credit card holders. Each time \nyou want to put a credit card number in a form, you can generate a temporary number, \ngood for only one use. When they try to charge the card the following year, they \ndiscover 'Oops, it expired!' \"\n\n\nBut one reader, Raymond Clouser, wasn't so sure this would work. \nAs he explains:\n\n\n\n\"A few years ago, I thought I found the answer through the single-use credit-card \nnumbers offered by American Express and Discover cards. However, that was not the \nanswer, according to what I was told by credit-card company representatives. I \nwas told that the single-transaction numbers were not really single-transaction. \nInstead, the single numbers were between the user and the company you used it \nwith, and they could later bill you for additional charges, unless you challenged \nit with the credit card company.\"\n\n\nI called Citibank to check its policy with virtual account numbers. A \nrepresentative told me that the numbers were, indeed, solely event-based and \nthat a subscription company could not use the same number a year later to charge \nyour card. This service is free to Citibank customers; all it requires is an \nInternet connection. See the company's \n\nWeb site for more information.\n\nNaturally, readers will want to check out the policies of their individual \ncredit-card companies to see if this service is available, and whether it would \nsolve this particular problem.\n\nIn the paid version of today's newsletter, you'll find more ways to defeat \nsubscription subterfuge, as well as a tip on Data Execution Prevention relating to my \nMay 3 \narticle on the subject.\n\n\n\nContents\n Index\n\n\n\n   \n\n\n\n\n   \n\n\n\nTELL A FRIEND\n\nHow you can share this information\nWe love it when you send your friends links to our articles. But please don't \nforward your copy of our e-mail newsletter to people, which subjects us to spam \ncomplaints. Instead, simply suggest that your friends visit this issue's permanent \nWeb address, shown below. A complete index at the bottom of the \nWeb page provides you with hyperlinks to any article you'd like to recommend.\n\nThe address of this issue is http://WindowsSecrets.com/comp/070524\n\n   \n\n\n\n\n   \n\n\n\nEDITOR'S BOOKSHELF\n\n\n \n\n\n\nGet the tips you need about Windows Vista\n\n\n\nThe all-new Windows Vista Secrets helps novices \nand experts alike understand Microsoft's latest operating system. \n\"To really appreciate what is in Vista, you almost \nneed to read through the leading book on the product, Windows Vista \nSecrets, by Brian Livingston and Paul Thurrott,\" writes Rob Enderle, \nprincipal analyst of the Enderle Group, in TechNewsWorld. \"It's 595 \npages of things you can do with this product — most of which \nyou probably wouldn't have discovered for some time, let alone right \nat first.\" Check the book out now for tips you can use.\nMore information:\nUnited States / \nCanada / \nElsewhere\n\n \n\n\n\nSpam-Proof Your E-Mail Address, 2nd Ed.\n\n\n\nThis 32-page e-book by Brian Livingston gives you step-by-step instructions that \ncan prevent 97% of the spam that would otherwise clog an e-mail\naccount. You could call it \"Livingston's Spam Secrets.\" The PDF e-book\nis the result of months of experiments and tests we conducted. We now\nreceive little or no spam to the addresses we used as guinea pigs. These tests\nshow that you can make your e-mail addresses invisible to spammers,\nnot just battle an ever-growing flood. The methods we describe\nwork with Windows, Apple, and Linux and don't require any filters or block\nlists — but you can use those in addition to the book's techniques,\nif you wish. \n\nMore info\n\n   \n\n\n\n\n\n   \n\n\n\nContents  \nIndex\n\n   \n\n\n\n\n   \n\n\n\nWACKY WEB WEEK\n\n\nMake your own church marquee\n\n\n\n\n\n\n\n\n\n\n\nPerhaps you've seen them while driving down the road — those backlit, \nblock-letter signs in front of a church announcing the upcoming sermon or maybe \njust providing a thought for the day.\n\nBut why should religion get all the roadside fun? Now you can, too, with the \nonline Church Sign Generator. Choose from five different designs, enter your \ntext, and presto! — a photo of your custom sign appears. You can save \nthe photo to your computer, or, for a few bucks, order magnets, stickers, \nand coffee mugs printed with your message. \n\n\nMore info\n\n\n\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n\n   \n\n\n\nINDEX\n\nThe following topics appear in the free version\n\n\n\n\nTOP STORY  \nIs your security system up to date?\n\n \nThe basic tools you need\n\n \nRouters: the story doesn't \"n\" here\n\n \nNetgear is the hardware firewall of choice\n\n \nZoneAlarm remains the top-rated suite\n\n \nMS Update and PatchLink for patch management\n\n \nThe WSN Security Baseline as it stands\n\n \n \n\n\nKNOWN ISSUES  \nMicrosoft licenses OEM software for single users\n\n \nMS site encourages OEM sales to individuals\n\n \nQuick fixes for subscription subterfuge\n\n \nUse virtual credit-card numbers\n\n \n \n\n\nWACKY WEB WEEK  \nMake your own church marquee\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou get all of the following in the paid version\n\n\nKNOWN ISSUES 2  \nMore ways to avoid automatic credit-card charges\n\n \nStop unwanted charges, pay by check\n\n \nOption 2: Don't pay at all \n\n \nEnabling Data Execution Prevention may be required\n\n \n \n\n\nPC TUNE-UP  \nMake Vista load files 10 times faster!\n\n \nUse Vista ReadyBoost for a big performance increase\n\n \nSafer Web surfing using virtual machines\n\n \nHelp your friends and family understand security\n\n \n \n\n\nOVER THE HORIZON  \nWhat to do when Windows turns against you\n\n \nWindows weakness allows Internet traffic hijack\n\n \nVista's Windows Mail allows code execution\n\n \n \n\n\nPATCH WATCH  \nInternet Explorer patch is now a must-install\n\n \nIE patch has problems but is important\n\n \nOffice patches for Vista being offered again\n\n \nSvchost.exe issue revisited with new info\n\n \nWSUS gets an update to version 3.0\n\n \nSQL 2005 SP2 gets a needed VSS fix\n\n \nHow to debug patch issues\n\n \nJust say \"nyet\" to .NET nonsense\n\n \n \n\n\n\nPaid subscribers can access all old and new paid newsletter content\nMake a contribution to support our research into Windows and you'll immediately\nbe able to read and search through scores of valuable articles. In addition,\npaid subscribers are entitled to download valuable content that we license for\nyou at least once every calendar quarter.\nTo upgrade, simply make a contribution of any amount you choose.\nIf you do this by June 6, 2007, \nyou'll instantly be sent the full, paid version of today's newsletter.\n\nTo upgrade to the paid version of the Windows Secrets Newsletter, please visit our \n upgrade page.\n\nThanks in advance.\n\n\n   \n\n\n\n\n\n   \n\n\n\nContents\n Index\n\n\n   \n\n\n\n\n\n   \n\n\n\nYOUR SUBSCRIPTION\n\nThe Windows Secrets Newsletter is published weekly on \nthe 1st through 4th Thursdays of each month, plus occasional news updates. \nVacation breaks occur in late August, Thanksgiving Week, and Christmas/New Year's.\nPublisher: WindowsSecrets.com LLC, Attn.: #120 Editor, 1700 7th Ave., Suite 116, \nSeattle, WA 98101-1323 USA. Vendors, please send no unsolicited packages to this address \n(readers' letters are fine).\nEditorial Director: Brian Livingston. Editor-at-Large: Fred Langa. Associate \nEditor: Scott Dunn. Contributing Editors: Susan Bradley, Mark Edwards, Woody \nLeonhard, Chris Mosby, Ryan Russell. Research Director: Vickie Stevens. \nProgram Director: Brent Scheffler. Managing Editor: Jody Braverman.\nTrademarks: Microsoft and Windows are registered trademarks of Microsoft \nCorporation. The Windows Secrets series of books is published by\nWiley Publishing Inc. The Windows Secrets Newsletter,  \nWindowsSecrets.com, LangaList, LangaList Plus, WinFind, Security Baseline, Patch Watch, \nPerimeter Scan, Wacky Web Week, the Logo Design (W, S or road, and Star), and the \nslogan Everything Microsoft Forgot to Mention all are trademarks and service \nmarks of WindowsSecrets.com LLC. All other marks are the trademarks or service \nmarks of their respective owners.\n\n\nYOUR SUBSCRIPTION PREFERENCES\n(change \nyour preferences):\nDelivery address: langa2@speedy.uwaterloo.ca\nAlternate address: langa2a@speedy.uwaterloo.ca\nCountry: United States\nZIP or postal code: 90210\nReader number: 82660-13329\nBounce count: 0\n\nYour bounce count is the number of times your server has bounced a newsletter back to us\nsince the last time you visited your preferences page. We cannot send newsletters to you\nafter your bounce count reaches 3, due to ISP policies. If your bounce count is higher\nthan 0 or blank, please visit your\npreferences page.\nThis automatically resets your bounce count to 0.\nTo change your preferences: Please visit your \npreferences  page.\nTo access all past issues: Please visit our\npast issues page.\nTo upgrade your free subscription to paid: Please visit our \nupgrade  page.\nTo resend a missed newsletter to yourself: If your mail server filtered \nout a\nnewsletter, you can resend the current issue to yourself. To do so, visit your\npreferences page\nand use the Resend link.\nTo get subscription help by e-mail (fastest method): Visit our \ncontact page.\nSubscription help by facsimile:\n206-282-6312 (fax). Emergency subscription help by phone: 206-282-2536 (24\nhours).\n\nHOW TO SUBSCRIBE: Anyone may subscribe to this newsletter by visiting our \nfree signup page.\nWE GUARANTEE YOUR PRIVACY:\n\n1. We will never sell, rent, or give away your address to any outside party, ever.\n2. We will never send you any unrequested e-mail, besides newsletter updates.\n3. All unsubscribe requests are honored immediately, period.  \nPrivacy policy\nHOW TO UNSUBSCRIBE: To unsubscribe\nlanga2@speedy.uwaterloo.ca\nfrom the Windows Secrets Newsletter,\nUse\nthis 2-click\nUnsubscribe\nlink; or\nSend\na blank e-mail to\nunsub@WindowsSecrets.net\nwith leave langa2@speedy.uwaterloo.ca\nas the Subject line; or\nVisit our \nUnsubscribe page.\n\n\nCopyright © 2007 by WindowsSecrets.com LLC. All rights reserved.\n\n\nContents\n Index\n\n\n\n\n\n\n   \n\n\n\n\n\n"}