{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWEDNESDAY 6 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tThanks to all of you who have sent in jokes about musicians - we'll get to those at the end of the email. But one puzzle: why are viola players the butt of so many of the gags? What have they done to deserve this? \n\n\nIn tonight's programme:\n\n\nMilitary Morale \n\n\nOur diplomatic editor Mark Urban has been hearing from serving British soldiers about low morale in Iraq and loss of support from some in the army for the mission there. \n\n\nOne serving British Army officer has told us that the \"overwhelming feeling\" of many of his peers is that the invasion was \"illegal, immoral and unwinnable\". \n\n\nHe describes troops who feel that they are \"reluctantly providing target practice for insurgents, senselessly haemorrhaging casualties and squandering soldiers' lives.\" \n\n\nIt's a difficult story to get at - for obvious reasons. But the concerns are real.\n\n\nG8 and Climate Change \n\n\nStephanie is in Germany for the G8 Summit. She'll be looking at what, if anything can be achieved from summits like these. \n\n\nOr is the G8 just a \"meaningless photo opportunity\", \"unrepresentative\", \"big on rhetoric low on substance\" as some of you have suggested on our website? \n\n\nCLICK HERE TO POST YOUR COMMENTS\n\n\nAnd our Environment analyst Roger Harrabin reports on how far Carbon Trading really will help solve the problems caused by climate change. \n\n\nOrange Prize \n\n\nThe winner will be announced tonight - and Newsnight will be there. (Though some of us continue to wonder - when Kiran Desai's magnificent novel wins the Booker Prize why in 2007 it continues to be necessary to have a women only literary prize.) Isn't it rather like netball compared to basketball? \n\n\nAnd finally...\n\n\nSo many musician jokes, I don't know where to start. The ones about viola players were particularly vicious. Including: \n\n\nHow can you tell when a violist is playing out of tune? \n\n\nThe bow is moving.\n\n\nBut my favourite so far was this offering from an anonymous viewer: \n\n\n\"What do you call a guy who likes to hang out with musicians? A drummer.\" \n\n\nNewsnight will be keeping perfect time at 10.30pm tonight. \n\n\nGavin \n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nBATTLE OVER 'VULTURE FUNDS'\n\n\t\t\t\t\t\t\tGreg Palast looks at the battle to end 'vulture funds', where companies buy up debts of poor nations cheaply and then sue for the full amount.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}