{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@flax9.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "Ericsson and Napster Supply Mobile Music Service to Swisscom", "body": "\n\n\n\n\n\n\n\n\nEricsson and Napster Supply Mobile Music Service to Swisscom\n\nLOS ANGELES, June 5, 2007 /PRNewswire-FirstCall via COMTEX News Network/ --  Ericsson (Nasdaq: ERIC) and Napster (Nasdaq: NAPS) today announced an agreement with Swisscom Mobile, the largest Swiss mobile operator, to become the company's exclusive mobile music service provider with Napster Mobile. The service will give Swisscom Mobile subscribers access to the easy-to-use Napster-branded mobile music service and its unparalleled music selection. The Napster Mobile service, co-developed by Napster and Ericsson, contains more than 3 million tracks -- more than any other mobile music service on the market today. It leverages Napster's vast catalogue of full-length songs and artist images, and Ericsson's mobile platform and personalization content. Ericsson develops, integrates, hosts and manages round-the-clock operations for the service, while Napster contributes expert content programming, including \"featured artists\" and \"top tracks of the day.\" Swisscom will launch the service with a major ad campaign starting this week. Daniel Staub, Head of Product Marketing of Swisscom Mobile says: \"We are amazed by the endless variety of music offered by the Napster Mobile service. Its 3-million-track-strong music offering contains everything from international smash hits to hard-to-find local tracks. Our customers now have easy access to them, all through their mobile phones. With Napster Mobile we expand our existing Multimedia-offer on music.\" Napster Mobile enables Swisscom Mobile subscribers to search, browse, preview, purchase and subscribe to music content from virtually all record labels via their WAP or Java-enabled handsets. The service also includes such features as dual delivery, which ensures that once content is purchased on the mobile phone, a copy is sent to the customer's PC as well. Napster Mobile also comes with a recommendation engine that introduces consumers to new music that matches their taste, thus making it easy to navigate through the huge content selection. Stefan Koetz, Country Manager at Ericsson Switzerland says, \"We are very pleased that Swisscom has selected Napster Mobile as their mobile music service and look forward to providing the more than 4.6 million Swisscom Mobile subscribers with a music experience that really delivers.\" Brad Duea, Napster president, says: \"We're proud to be partnering with Swisscom Mobile, continuing our track record of launching Napster Mobile with the largest mobile operators in markets across the globe. We believe that Swisscom Mobile subscribers will be very excited to be able to enjoy the Napster music experience of anytime, anywhere access to a vast catalog of content and powerful discovery tools; all at their fingertips with Napster Mobile.\" Napster Mobile is a hosted service part of Ericsson's industry leading Managed Services offering, which contains attractive new services that operators can launch quickly, easily and cost-efficiently. Ericsson is shaping the future of Mobile and Broadband Internet communications through its continuous technology leadership. Providing innovative solutions in more than 140 countries, Ericsson is helping to create the most powerful communication companies in the world. Read more at http://www.ericsson.com About Napster Napster, the pioneer of digital music, offers the ultimate in interactive music experiences, creating better ways to discover, share, acquire and enjoy music -- anytime, anywhere.  The company's offerings include \"Napster\" (http://www.Napster.com) -- the most popular on demand music subscription service in the world; \"Freenapster\" (http://www.freenapster.com) -- a unique Web experience offering free on demand music legally; and \"Napster Mobile\" -- one of the industry's fastest growing mobile music platforms.  Headquartered in Los Angeles, Napster's services are available in markets across North America, Europe and Japan. About Swisscom Mobile AG With a market share of 64%, Swisscom Mobile is the market leader in the Swiss mobile communications sector. In fiscal year 2006, Swisscom Mobile generated net revenue of CHF 4'022 billion and now has more than 4.6 million NATEL subscribers. Swisscom Mobile is a public limited company with Swisscom Ltd holding a 100% stake. The company operates a nationwide GSM network (900/1800 MHz), which was enhanced with EDGE in spring of 2005. With HSDPA, Swisscom Mobile is the first network carrier in Switzerland to roll out a turbo network. Launched in February of 2006, it is already about five times faster than a UMTS network. Already today, Swisscom Mobile provides coverage of around 90% of the populated area of Switzerland through its UMTS network as well as wireless LAN-Internet access through more than 1000 hotspots. This unique technology mix is the basis for a comprehensive mobile broadband network that enables high-quality mobile communication services. Swisscom Mobile launched UMTS-based services including live TV and video telephony. Its Mobile Unlimited PC Card supports automatic, seamless and high-speed mobile connections to the Internet. By the way, Natel(R) subscribers are not only reachable anywhere within Switzerland but, with over 470 roaming partner networks, all over the world. http://www.swisscom-mobile.ch . About Ericsson's Managed Services offering Ericsson has the telecom industry's most comprehensive managed services offerings, ranging from designing, building, operating and managing day-to-day operations of a customer's network, to hosting service applications and enablers, as well as providing network coverage and capacity on demand. As the undisputed leader in managed services, Ericsson has officially announced more than 100 managed services contracts with operators worldwide since 2002. In all current managed services contracts, excluding hosting, Ericsson is managing networks that together serve 120 million subscribers worldwide. \n    Media Contact:\n    Becky Farina\n    Napster\n    310-281-5005, becky.farina@napster.com\n\n    Investor Contacts:\n    Alex Wellins or Jennifer Jarman\n    The Blueshirt Group, for Napster\n    (415) 217-7722\n    alex@blueshirtgroup.com; jennifer@blueshirtgroup.com\n\nSOURCE  Napster media, Becky Farina of Napster, +1-310-281-5005, becky.farina@napster.com; or\ninvestors, Alex Wellins, alex@blueshirtgroup.com, or Jennifer Jarman,\njennifer@blueshirtgroup.com, both of The Blueshirt Group, both for Napster,\n+1-415-217-7722\nhttp://www.napster.com\n\n\n\n\n\n\n\n\n\n\n You are subscribed to Napster Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n Napster \n 461 S. Milpitas Blvd. , Milpitas, CA 95035\n Service provided by Shareholder.com \n\n\n\n\n\n"}