{"category": "ham", "to_address": "Andrew Bartlett <abartlet@samba.org>", "from_address": "Jelmer Vernooij <jelmer@samba.org>", "subject": "Re: [SAMBA4] we should create just one test environment", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nAndrew Bartlett wrote:\n> On Mon, 2007-04-30 at 12:59 +0200, Jelmer Vernooij wrote:\n>> Andrew Bartlett wrote:\n>>> On Mon, 2007-04-30 at 11:39 +0200, Stefan (metze) Metzmacher wrote:\n>>>> -----BEGIN PGP SIGNED MESSAGE-----\n>>>> Hash: SHA1\n>>>> we have already make testenv SELFTEST_TESTENV=member\n>>>>\n>>>> we can make that the default for make testenv...\n>>> But then it doesn't match how we run the tests otherwise.  \n>>>\n>>> My point is that I don't want to have to constantly wonder:  what test\n>>> environment did we declare for this test, what test environment did it\n>>> get, and what is 'make testenv' giving me\n>> We only have three different ones at the moment (none, dc, member) so it\n>> should be easy to guess against which environment a test is being run.\n>> Once we get more, it may be harder to keep track, but then provisioning\n>> will be too expensive to set up all environments always anyway.h\n> You keep saying that, and this seems to be the reason why we are doing\n> this the current way.  But I really don't buy it - we are going to be\n> doing a *lot* more tests against the member server, so we will almost\n> always have to pay that setup price.\nMaybe that is true for the member server, but what happens when we start\nadding tests for trusted domains, nt4-style dcs or involving one or more\nsamba3 servers?\n\nThe setup price also doesn't have to be paid when you're just running dc\ntests - of which we still have plenty.\n\n> I also think that we can reduce that price.\nHow?\n\n>>> I really just want one setup, and I don't mind the extra smbd or member\n>>> server configuration if it ensures that all the tests run against a\n>>> consistent set of servers.\n>>> If we are only going to give the tests the environment they declare, are\n>>> we going to start up/shut down environments between tests?\n>> We do support doing that, though it is not the default. It can be very\n>> useful in tracking down, for example, whether a test is corrupting one\n>> of smbd's databases and thus is causing strange failures in subsequent\n>> tests.\n>>\n>> At the moment, though, we set up environments on a when-needed basis and\n>> close them all when selftest exits. \n> That's why I just want to set up a generally useful test environment\n> once, and run with that.  It can list 'provides: dc, member', if that\n> helps you keep track of what scripts require which parts, but I just\n> want one test network...\nI think we're just repeating ourselves here - I'm not a big fan of a\nkitchensink test environment.\n\nCheers,\n\nJelmer\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\nComment: Using GnuPG with Mozilla - http://enigmail.mozdev.org\n\niQCVAwUBRjXQVAy0JeEGD2blAQJ6owP+MZKJLsyDs0cv8HLZFFj2r/oLTGTKF+zq\nyHyMl3Kup0ou9elk0dcvirTLAY4W/mYnw5oUJh1E8Nc60bRonPuNpMkliY6qP/Nq\n1j9PUKA8xs3WoJwqNTLq6Q7uh2qR786l464S8inxv5wSg3IIJqNjgf+MNwIvD8pL\nreopkD67E28=\n=D/B/\n-----END PGP SIGNATURE-----\n\n"}