{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTUESDAY 26 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER LIZ GIBBONS\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tTonight on Newsnight - Blair, Brown and Cameron all facing challenges from unlikely quarters...\n\n\n\nTORY DEFECTOR\n\n\n\"Under your leadership the Conservative Party appears to me to have ceased collectively to believe in anything, or to stand for anything\". The words of the now ex-Tory backbencher Quentin Davies in a letter to David Cameron today, announcing his defection to Zombie Brown's Labour party. \n\n\nHe goes on to lambast the Tory leader for everything from his opposition to nuclear power to his decision to withdraw from the European People's Party. Perhaps the wonder is that he endured so long in a party with whose policies he so profoundly disagrees. We'll be assessing how serious this is for Cameron.\n\n\n\nBLAIR'S NEW JOB\n\n\nThere's still no official confirmation that Tony Blair is to be the Quartet's new Middle East envoy, but at a press conference this morning he said he was up for the challenge. We'll be debating whether he's the right man for the job.\n\n\n\nBAE INQUIRY\n\n\nThe US department of Justice's decision to pick up where the Serious Fraud Office left off and launch an inquiry into BAE's relationship with the Saudis could prove to be the first big challenge to Zombie Brown's special relationship with George Bush. He'll have to decide whether to pass on crucial documents which could aid the inquiry, but damage the British government.\n\n\n\nBROWN ON THE CAMPAIGN TRAIL \n\n\nAnd - he's been compared to Stalin by one man that worked closely with him. So has Zombie Brown been trying to a cultivate a warmer style of politics? The independent film-maker Jamie Campbell has been following the new Prime Minister for the past month on the campaign trail, in a bid to engage him in a conversation. Watch to see if he succeeds...\n\n\n\nIt's Jeremy tonight - join him at 10.30pm.\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}