{"category": "spam", "to_address": null, "from_address": "\"Barr. Varden R. Edward.\"<m.slog2@gawab.com>", "subject": "Good Day .", "body": "Barr. Richard Edward Varden(Esq.)\nFor T. Malcolm Chambers & Advocates\nTel : + 44-702-4054044\nPrivate Email : varden_richard_edward@yahoo.co.uk\n\nGood day,\n\nI am Barrister Richard Edward Varden personal Attorney to Ronald Lake \nand Joyce Lake who used to work with Frank Howard Allen Realtors. On \nthe 31st of January 2000, my client and his wife were involved in a Plane \nCrash (Alaska Airlines Flight 261) all passengers unfortunately lost \ntheir lives, since then I have made several enquiries to locate any of \nmy client?s extended relatives but this proved unsuccessful.\n\nYou can read more about there death on this website below:\nhttp://archives.cnn.com/2000/US/02/01/alaska.airlines.list/\n\nAfter all these several unsuccessful attempts, since it's not \ncompulsory that the next-of-kin must be a blood relation to the \ndeceased, hence I contacted you because you are from the same \ncountry with my late client, Be informed that a next-of-kin can \nbe anybody, friends or organization.\n\nPresently,the Bank where the deceased (my client) had a Deposit valued \nat US$74,980,000.00 Million issued me a notice to provide the \nnext-of-kin to my client to receive its benefit or have the account \nconfiscated, so I have contacted you to assist me in repatriating this\nbenefit left behind by my client before they get confiscated or declared \nunserviceable by the Bank.\n\nTo this effect, I now seek your consent to present you to the Bank as \nthe next of kin of the deceased (my Client) so that the proceeds of \nthis Deposit valued at US$74,980,000.00 Million can be paid to you and then \nyou and I can share the money; 70% to me and 25% to you, while 5% will \nbe used in settling any incurred expenses on both sides.\n\nI guarantee that this will be executed under a legitimate arrangement \nthat will protect you from any breach of the law. Please get in touch \nwith me via my private Email: varden_richard_edward@yahoo.co.uk with \nthe below details immediately you acknowledge the good receipt of this \nmessage.\n\nFull Name:\nFull Address:\nTelephone Number:\nFax Number:\nMobile Number:\nPrivate Email:\nAge:\nOccupation:\nCountry of Origin:\nSex:\nMarital Status:\n\nYour prompt response is highly imperative.\n\nYours sincerely,\n\nBarr. Richard E. Varden (Esq.)\n\n        \n\n"}