{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Janna Sykes\" <pytconquestmediahousebaq@conquestmediahouse.com>", "subject": "Stop being obese and unhappy", "body": "\nStop the painful craving for more food\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting product for corpulent people is now readily available – As seen on CNN\n\n\n\nDo you understand that redundant body kilos kill a plenty of people around the planet? We believe you hate the ugly appearance of people like those and the social bias against them. \n\nOr, maybe, you can’t withstand an assault of your terrible eating habits. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nHere there is Anatrim, the new product for the elimination of your body’s extra weight. The astonishing thing about Anatrim is it improves the quality of your life by repressing your feeling of hunger and giving you better mood. Look at what people write on this product:\n\n\n\n\n\n\"It is great! \n\n\nI stopped stuffing myself with food and watching TV \n\n\nI became more interested in exercise.\n\n\n\n\n\n\n Anatrim got me back on the right track.\n\n\n I have a great figure now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nSilvia D., Bellevue WA\n\n\n\n\n\n\n\"I tried some passive weight losing, you know, but with no result. I was difficult for me to restrain my ravenous appetite. \n\n\nOnce I was told on Anatrim my very best friend by and I was really effected by the information.\n\n\n I had tried taking it, and my wife said to me that I'm a different person now, 5 months later. \n\n\n30 pounds have gone away and I keep still losing them! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nSteve Burbon, Texas\n\n\n\n\n\nAnatrim gives you an opportunity to understand that you don't need that much food. It lifts your mood up, gives you extra energy, and attacks needless kilos. All thanks to its mighty newly-elaborated formula!!\n\n\n\nFind out latest news about this excellent product now!\n\n\n\n"}