{"category": "ham", "to_address": "simo <idra@samba.org>", "from_address": "\"Christopher R. Hertel\" <crh@ubiqx.mn.org>", "subject": "Re: Preserving NTFS permissions.", "body": "You guys should know by now that I like to grok something in a deep and\nmeaningful way before I approach it with a pointed stick.  :)\n\nOkay.  I'll see if we can put together something that just stores and\nretrieves the ACEs as a first step.\n\nThe thing that still confuses me is that the default VFS behavior seems to\ntake the settings from Windows systems and map them to the Posix bits, which\nin turn impacts the VFAT bitmap interpretation.  There's something weird\ngoing on there.\n\nChris -)-----\n\nsimo wrote:\n> On Mon, 2007-07-02 at 14:56 -0500, Christopher R. Hertel wrote:\n>> Simo, Jeremy,\n>>\n>> There is some interest in going forward with work on a VFS module that would\n>> store and retrieve NTFS DACLs using EAs.  The overall goal is to enforce\n>> those DACLs... but one step at a time.\n>> :)\n>>\n>> For my own part, I am interested in a clearer understanding of the\n>> interactions between the VFAT bits, the POSIX bits, the current behavior of\n>> the default VFS module, and what needs to be done to make NTFS ACLs work\n>> properly.  I know Jeremy has put a lot of effort into understanding how the\n>> DACLs work in particular (I remember a presentation... what... six years ago?).\n>>\n>> Your input on next steps would be appreciated.\n> \n> Chris I think this could be a wonderful subject for a book, would you\n> like to dig in the code and extract distilled knowledge for us to\n> enjoy? :-)\n> \n> Jokes aside I think all we can say is really in the code itself, I guess\n> it is much easier to get specific questions and see if we can give\n> precise answers or not based on what there is in the code and memories\n> we have around.\n> \n> Simo.\n> \n\n-- \n\"Implementing CIFS - the Common Internet FileSystem\" ISBN: 013047116X\nSamba Team -- http://www.samba.org/     -)-----   Christopher R. Hertel\njCIFS Team -- http://jcifs.samba.org/   -)-----   ubiqx development, uninq.\nubiqx Team -- http://www.ubiqx.org/     -)-----   crh@ubiqx.mn.org\nOnLineBook -- http://ubiqx.org/cifs/    -)-----   crh@ubiqx.org\n\n"}