{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 88", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Museum to install talking CCTV\n      (Museum Security Network Mailing list)\n   2. MOA Security Protects, Preserves. But theft is not security's\n      biggest worry; it's damage from patrons.\n      (Museum Security Network Mailing list)\n   3. Iraq Museum plunder commemorated\n      (Museum Security Network Mailing list)\n   4. A fine mess: Bandit burgles plaque of Ness\n      (Museum Security Network Mailing list)\n   5. Police Search for Stolen Faberge Eggs\n      (Museum Security Network Mailing list)\n   6. MOA Security Protects, Preserves\n      (Museum Security Network Mailing list)\n   7. New rule may help Native American tribes reclaim artifacts\n      (Museum Security Network Mailing list)\n   8. Egipto reclama 17 piezas arqueol?gicas al Museo Egipcio de\n      Barcelona (Museum Security Network Mailing list)\n   9. Les ?uvres vol?es aux juifs ravivent de mauvais souvenirs au\n      Pays-Bas (Museum Security Network Mailing list)\n  10. Satellite TV host guilty in bogus artwork scam\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Thu, 12 Apr 2007 18:31:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Museum to install talking CCTV\nTo: \nMessage-ID: <000001c77d1f$fd93ab80$f8bb0280$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nMuseum to install talking CCTV\n\nTalking CCTV cameras could be introduced at one of the Black Country's top\ntourist attractions, it was revealed today.\n\nThe Black Country Living Museum would be the first place in Dudley borough\nto install the new crimebusting Big Brother devices in a modern attempt to\nsolve an age-old problem.\n\nMoves to beef up security at the museum in Tipton Road comes after an arson\nattack on a builders' shed and the theft of a dog after a visitor's car was\nbroken into within less than a week.\n\nA security guard at the site would be able to shout warnings through a\nspeaker attached to the camera if anyone was spotted misbehaving.\n\nRead the full story in the Express & Star.\n\nhttp://www.expressandstar.co.uk/\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Thu, 12 Apr 2007 18:31:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] MOA Security Protects, Preserves. But theft is not\n\tsecurity's\tbiggest worry; it's damage from patrons.\nTo: \nMessage-ID: <000201c77d1f$fef78140$fce683c0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nMOA Security Protects, Preserves\n\n\nPhoto by Geoffrey McAllister: http://newsnet.byu.edu/print/story.cfm/64011\nSgt. Randy O'Hara and Andrew Cobabe, student security supervisor at the\nMuseum of Art, show their \"challenge coins,\" used to add fun and enhance\nmorale on the job.By Lindsay Cusworth\n11 Apr 2007\n\n\nTo protect artwork from being stolen, security guards are strategically\nplaced on all floors of the Museum of Art and alarmed detectors are\npositioned near valuable paintings. Multiple cameras, moved around based on\nneed, also keep watch over the museum's treasures. \n\nBut theft is not security's biggest worry; it's damage from patrons.\n\n\"We have had problems with groups and unintentional damage,\" said Randy\nO'Hara, security coordinator at the museum. \"We had a group with crayons and\nthey got too close to the artwork before the security could get to them.\"\n\nO'Hara said no serious harm was caused to the painting at that time, but\nwhen there is a situation of intentional damage, the student guards will\ncontact the university police. \n\n\"The biggest problem we have is people touching the artwork,\" said Emily\nPoulsen, registrar at the museum. \"They are usually innocent people who\ndon't realize the damage in touching a painting. We have finger prints on\nalmost everything that we take down.\"\n\nPoulsen really understands the lengthy process of setting up a new exhibit\nand sending one off when its run is over. After all, it's her job to oversee\nboth activities.\n\nThe artwork arrives in crates that need to acclimatize for a time period\nranging from a couple of days to two weeks. After the artwork is taken out\nof the crates, a detailed condition report is recorded. The report shows any\ndamages made prior to arrival. \n\nEach painting is insured for its fair market value. The museum gets each\npainting insured while it is in transit and during its stay at the museum. \n\n\"We are responsible for the work while it is here,\" Poulsen said. \"If a work\nis damaged while it is here, then the museum is liable.\"\n\nPoulsen said the museum has tried many tactics to encourage people to not\ntouch. A small sign is located next to a handful of paintings reminding\nvisitors \"Please do not touch the artwork.\" At one point, metal bars were\nplaced in front of valuable paintings, but they were taken down for safety\nreasons. \n\nRecently, for the Paths to Impressionism exhibit, museum staff started\nputting sandpaper tape on the floor 18 inches in front of paintings to\nsignify how far away a visitor should stand. \n\n\"We researched it and found that the tape is effective,\" Poulsen said. \"It\nmentally keeps people at a distance away from the works of art. It also\nhelps the guards so they can show people where they can stand.\"\n\nThe guards at the museum are an entire staff of students who are trained to\nbe \"eyes and ears.\" Their job is to circulate through the exhibits and to\nenforce the rules. \n\n\"Enforcing the rules is sometimes an awkward thing because the security\nguards have to tell visitors in a public space that they are doing something\nwrong,\" said Chris Wilson, marketing and communications manager at the\nmuseum. \"We hope our visitors realize that when a security guard asks a\nperson to step back from a painting that it's nothing personal. They are\njust trying to protect valuable works that many people have made great\nefforts to preserve in their current condition.\"\n\nSecurity is an important part of the overall operation of the museum. Wilson\nsaid between the cameras installed throughout the museum and the security\nguards patrolling the galleries, the museum staff is confident the works are\nsafe and well protected.\n\n\"Every time we host a traveling exhibition and every time we borrow a work\nfrom another institution we are evaluated on how well we care for the\nartworks that have been entrusted to us,\" Wilson said. \"It is important to\nus to care for these artworks because these other places trust us to care\nfor and safeguard them. If we don't do everything in our power to keep their\nworks safe, we would find that nobody would want to lend works to us.\"\n\nMuseum security is an issue everywhere, and other art museums in Utah Valley\nand the Salt Lake area are implementing their own security measures.\n\nVern Swanson, director of the Springville Museum of Art, said there are two\nmajor problems when it comes to protecting the artwork at his museum: adult\nwomen and children. \n\n\"The women bang on the paintings with their handbags,\" Swanson said. \"They\nback up into the painting and damage it. And none of them know it is\nhappening.\"\n\nIn response to this problem, Swanson puts up rope in front of a handful of\npaintings and requires all people with backpacks and purses to carry them on\ntheir stomachs.\n\n\"We also don't allow children into the museum without an adult supervisor,\"\nSwanson said.\n\nBut even with adult supervisors present, Swanson said not a day goes by\nwithout seeing a group of young children playing hide-and-go-seek in the\nmuseum.\n\n\"We are the art Nazis,\" Swanson said. \"The art is a living document to our\ncultural heritage, and it cannot take care of itself.\"\n\nBonnie Souliere, operations manager at the Utah Museum of Fine Arts at the\nUniversity of Utah, agreed that patrons touching the paintings is a problem\nat that museum as well.\n\n\"People don't realize that they get too close to the painting,\" Souliere\nsaid. \"Our staff is reminded to monitor their surroundings and to act if\nthey see something.\"\n\nhttp://newsnet.byu.edu/\n\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Thu, 12 Apr 2007 18:31:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Iraq Museum plunder commemorated\nTo: \nMessage-ID: <000101c77d1f$feaac0d0$fc004270$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nIraq Museum plunder commemorated\nBy Haydar Baderqghan\n\nAzzaman, April 12, 2007\n\n\nThe Ministry of Archaeology and Terrorism has described the looting of Iraq\nMuseum four years ago and shortly after U.S. troops landed in Baghdad as \"a\ntragedy.\"\nIn a statement issued to mark the fourth anniversary of the Museum's looting\nas U.S. invasion troops looked on, the ministry said that 7,000 pieces were\nstill missing.\nLooters and plunderers entered the museum, broke its glass cases and\ncontents and took thousands of magnificent Mesopotamian relics away.\nThe looting started on April 11, 2003, only two days after the U.S.\noccupation of Baghdad, and continued for three days in which most of the\nitems on display, numbering at least 15,000 pieces were either destroyed or\nstolen.\n\"The Museum passed through really difficult times at the hands of thieves,\ngangs and smugglers . The looting of the museum will remain a testimony for\nthe barbarism of wars and their destructive outcome,\" said the statement.\nOf the 15,000 missing items, 4,000 have been retrieved by the museum and\n4,000 more were confiscated by customs officials in neighboring countries.\nThe statement said the ministry was trying to have the items still held by\nother countries returned to the museum.\n\nhttp://www.azzaman.com/\n\n \n\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Fri, 13 Apr 2007 08:03:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] A fine mess: Bandit burgles plaque of Ness\nTo: Museum Security Network Mailinglist \nMessage-ID: <461F1D21.6010803@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nA fine mess: Bandit burgles plaque of Ness\nThursday, April 12, 2007\nGabriel Baird\nPlain Dealer Reporter\n\nA thief has burglarized the most unlikely place, the headquarters of the \nCleveland police.\n\nThe bandit selected the ultimate prize for insulting the very notion of \njustice: a bronze plaque picturing the man who may be the city's best \ncrime- fighter of all time and certainly the city's most widely known \nlawman: Eliot Ness.\n\nNess made his name in Prohibition-era Chicago by successfully \nprosecuting notorious gangster Al \"Scarface\" Capone in 1931.\n\nKevin Costner played him in \"The Untouchables\" movie in 1987. Ness came \nto Cleveland in the 1930s to be the city's public safety director after \nhis stint in Chicago.\n\nAlthough the plaque was housed in the police station, it didn't take any \n\"Mission: Impossible\" acrobatics to grab it and run.\n\nWorth about $225 in cash but much more in sentimental value, the plaque \nwas in the police museum on the first floor of the Justice Center. \nVisitors don't have to go through a security check to get into the \nmuseum, which is operated not by the Police Department, but by the \nCleveland Police Historical Society.\n\nVolunteers staff the museum and guide visitors through antique police \nuniforms, photographs and relics of policing technology past. But they \nare not trained to detect crime.\n\nWhen it was first noticed that the bronze on walnut plaque was missing \nfrom the Wall of Fame, museum volunteers didn't report it stolen. They \nthought perhaps someone had borrowed the local treasure. After all, at \ntimes the museum does lend out its materials.\n\nThefts are infrequent at the police museum. But some years back, an \nantique badge was stolen. It was recovered.\n\nA blurb asking for help finding the plaque recently ran in the \nVindicator, the newsletter of the Fraternal Order of Police. Then, the \nmissing plaque came to the attention of the police chief.\n\nSgt. Daniel Fay, a Cleveland police spokesman, said a theft report was \nexpected to be filed with police Wednesday. Once it is reported as a \ncrime, a suspect could be charged with breaking and entering, a felony. \nIf a police report is filed, it is likely to be assigned to Third \nDistrict detectives.\n\nFirst place the police will look: eBay.\n\nTo reach this Plain Dealer reporter:\n\ngbaird@plaind.com, 216-999-4141\n\nhttp://www.cleveland.com/\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Fri, 13 Apr 2007 08:03:18 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Police Search for Stolen Faberge Eggs\nTo: Museum Security Network Mailinglist \nMessage-ID: <461F1D26.2000707@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nPolice Search for Stolen Faberge Eggs\n\nVIENNA, Austria ? Authorities said Thursday they hope DNA tests and \nfingerprint analysis will help track down the thieves who stole up to $1 \nmillion worth of Faberge eggs and other artworks from a Vienna palace.\n\nPolice Maj. Manfred Briegl of Vienna's criminal investigations division \ntold reporters that police still had no leads in the theft, which was \ndiscovered Wednesday afternoon at the Palais Harrach, a Baroque-era \nmansion that now houses offices and shops.\n\nBriegl said detectives dusted for fingerprints and collected possible \ntraces of the thieves for DNA analysis in their effort to recover the 30 \nFaberge eggs, 20 porcelain vases and a painting, and that results were \nexpected within a week.\n\nHe said the owner of the artworks, whose name was not released, \nestimated their total value at between $805,000 and $1 million.\n\nGerald Hesztera, spokesman for the Federal Criminal Investigations \nBureau said Vienna police gave Interpol a detailed list of the stolen \nitems in case they surface in auctions or black markets outside Austria.\n\nPolice said the works were stolen sometime between Tuesday evening and \nWednesday morning by thieves who broke through a rear entrance and \napparently loaded the items into a waiting vehicle.\n\nWerner Mayer, an official with the UNIQA insurance company, told \nAustrian television the building was not fitted with an alarm system and \nsuggested the insurer was, therefor, not legally obligated to cover the \ntheft.\n\nhttp://www.chron.com\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Fri, 13 Apr 2007 08:03:27 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] MOA Security Protects, Preserves\nTo: Museum Security Network Mailinglist \nMessage-ID: <461F1D2F.3060703@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n      MOA Security Protects, Preserves\n\nTo protect artwork from being stolen, security guards are strategically \nplaced on all floors of the Museum of Art and alarmed detectors are \npositioned near valuable paintings. Multiple cameras, moved around based \non need, also keep watch over the museum's treasures.\n\nBut theft is not security's biggest worry; it's damage from patrons.\n\n\"We have had problems with groups and unintentional damage,\" said Randy \nO'Hara, security coordinator at the museum. \"We had a group with crayons \nand they got too close to the artwork before the security could get to \nthem.\"\n\nO'Hara said no serious harm was caused to the painting at that time, but \nwhen there is a situation of intentional damage, the student guards will \ncontact the university police.\n\n\"The biggest problem we have is people touching the artwork,\" said Emily \nPoulsen, registrar at the museum. \"They are usually innocent people who \ndon't realize the damage in touching a painting. We have finger prints \non almost everything that we take down.\"\n\nPoulsen really understands the lengthy process of setting up a new \nexhibit and sending one off when its run is over. After all, it's her \njob to oversee both activities.\n\nThe artwork arrives in crates that need to acclimatize for a time period \nranging from a couple of days to two weeks. After the artwork is taken \nout of the crates, a detailed condition report is recorded. The report \nshows any damages made prior to arrival.\n\nEach painting is insured for its fair market value. The museum gets each \npainting insured while it is in transit and during its stay at the museum.\n\n\"We are responsible for the work while it is here,\" Poulsen said. \"If a \nwork is damaged while it is here, then the museum is liable.\"\n\nPoulsen said the museum has tried many tactics to encourage people to \nnot touch. A small sign is located next to a handful of paintings \nreminding visitors \"Please do not touch the artwork.\" At one point, \nmetal bars were placed in front of valuable paintings, but they were \ntaken down for safety reasons.\n\nRecently, for the Paths to Impressionism exhibit, museum staff started \nputting sandpaper tape on the floor 18 inches in front of paintings to \nsignify how far away a visitor should stand.\n\n\"We researched it and found that the tape is effective,\" Poulsen said. \n\"It mentally keeps people at a distance away from the works of art. It \nalso helps the guards so they can show people where they can stand.\"\n\nThe guards at the museum are an entire staff of students who are trained \nto be \"eyes and ears.\" Their job is to circulate through the exhibits \nand to enforce the rules.\n\n\"Enforcing the rules is sometimes an awkward thing because the security \nguards have to tell visitors in a public space that they are doing \nsomething wrong,\" said Chris Wilson, marketing and communications \nmanager at the museum. \"We hope our visitors realize that when a \nsecurity guard asks a person to step back from a painting that it's \nnothing personal. They are just trying to protect valuable works that \nmany people have made great efforts to preserve in their current condition.\"\n\nSecurity is an important part of the overall operation of the museum. \nWilson said between the cameras installed throughout the museum and the \nsecurity guards patrolling the galleries, the museum staff is confident \nthe works are safe and well protected.\n\n\"Every time we host a traveling exhibition and every time we borrow a \nwork from another institution we are evaluated on how well we care for \nthe artworks that have been entrusted to us,\" Wilson said. \"It is \nimportant to us to care for these artworks because these other places \ntrust us to care for and safeguard them. If we don't do everything in \nour power to keep their works safe, we would find that nobody would want \nto lend works to us.\"\n\nMuseum security is an issue everywhere, and other art museums in Utah \nValley and the Salt Lake area are implementing their own security measures.\n\nVern Swanson, director of the Springville Museum of Art, said there are \ntwo major problems when it comes to protecting the artwork at his \nmuseum: adult women and children.\n\n\"The women bang on the paintings with their handbags,\" Swanson said. \n\"They back up into the painting and damage it. And none of them know it \nis happening.\"\n\nIn response to this problem, Swanson puts up rope in front of a handful \nof paintings and requires all people with backpacks and purses to carry \nthem on their stomachs.\n\n\"We also don't allow children into the museum without an adult \nsupervisor,\" Swanson said.\n\nBut even with adult supervisors present, Swanson said not a day goes by \nwithout seeing a group of young children playing hide-and-go-seek in the \nmuseum.\n\n\"We are the art Nazis,\" Swanson said. \"The art is a living document to \nour cultural heritage, and it cannot take care of itself.\"\n\nBonnie Souliere, operations manager at the Utah Museum of Fine Arts at \nthe University of Utah, agreed that patrons touching the paintings is a \nproblem at that museum as well.\n\n\"People don't realize that they get too close to the painting,\" Souliere \nsaid. \"Our staff is reminded to monitor their surroundings and to act if \nthey see something.\"\n\nhttp://newsnet.byu.edu\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Fri, 13 Apr 2007 08:03:42 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] New rule may help Native American tribes reclaim\n\tartifacts\nTo: Museum Security Network Mailinglist \nMessage-ID: <461F1D3E.8050104@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nNew rule may help Native American tribes reclaim artifacts\n\nKevin Livelli\nColumbia News Service\nApr. 12, 2007 08:58 AM\nIt's been nearly a dozen years since museums and federal agencies had to \nnotify American Indian tribes about artifacts in their collections that \nmight have been stolen from or lost by the tribes. But a new federal \nregulation may make it easier for the tribes to identify such objects.\n\nIt was a hot and arid day in Pecos, N.M., when the elders and leaders of \nthe Jemez Pueblo tribe welcomed an outsider into the fold: archaeologist \nWilliam Whatley.\n\nWearing colorful headbands, the old men sat down on the ground with \nWhatley. Then they began drawing images in the dust--images of bones, \nmasks and pottery that had gone missing or been looted from the tribe. \nThe elders implored Whatley to use his scientific knowledge to find the \nobjects and help return them to the tribe. Not an easy task.\n\nThat was nearly 20 years ago. Now, for other tribes searching for lost \nor stolen items, the process may get a lot easier.\n\nIn mid-March, the Department of the Interior's National NAGPRA program, \nwhich helps carry out the Native American Graves Protection and \nRepatriation Act, announced a regulation requiring museums, universities \nand federal agencies in possession of Native American art and artifacts \nto provide new lists of their inventories and to share them with all \nfederally recognized tribes within six months.\n\nThe rule, which takes effect April 20, marks the first time in a dozen \nyears that museums and federal agencies have had to share with tribes \nwhat's in their collections. This process may uncover many items missing \nfor years, and it may make encourage tribes to start making repatriation \nclaims to get their artifacts back.\n\nRepatriation is a process frequently fraught with tension between \nmuseums and tribes. Curators and scholars have an interest in preserving \nitems for their educational and research value. For the tribes, \nreclaiming their objects can have a spiritual and cultural significance. \nBut for some, it can lead to big business. A reclaimed object can \nestablish a tribe's right to land, which it might want to \ndevelop--sometimes into a casino.\n\n\"This promises to have a big impact for many tribes, especially those \nrecently recognized by the federal government,\" said Dr. Rayna Green, a \nCherokee and the curator and director of the American Indian program at \nthe Smithsonian Institution. \"And it's not just about cultural heritage. \nIt's about money and land and property. This is America, after all.\"\n\nYet even if the new rule helps tribes find many sacred objects, it won't \nnecessarily help them overcome the many obstacles inherent in the \nrepatriation process.\n\n\"Tribes and museums approach decisions about sacred objects carefully,\" \nsaid Dr. Timothy McKeown, the senior program coordinator at the NAGPRA \noffice and the man responsible for overseeing the entire repatriation \nprocess. \"Repatriation is not just something you can do overnight.\"\n\nTo begin with, tribes can struggle with issues of confidentiality when \nfiling a claim. Many tribes, especially the Pueblo groups in the \nSouthwest, have strict customs and rules about sharing tribal \ninformation with outsiders. Yet the law requires a tribe to reasonably \nestablish its historical connection to a particular object.\n\nThe Pueblo Indians of San Eldefanso made a claim in the mid-1990s but \nbacked away when a dispute over the claim led to litigation in federal \ncourt. They didn't want to have to testify and reveal tribal secrets.\n\nEven putting together the claim can be a challenge. In many instances, a \ntribe's spoken language--like that of the Jemez Pueblo--isn't written \ndown and can't be easily transferred into the legalese necessary to file \na claim. And hiring lawyers costs money, something many smaller tribes lack.\n\nWhen claims are readied for filing, McKeown says tribes sometimes argue \namong themselves and with neighboring tribes over who has the right to \nproceed with that claim, who should act as spokesman and who will be \nresponsible for the objects once they return.\n\nOne such case currently under review by McKeown's office involves \nfunerary objects and human remains that were recently found in Chaco \nCanyon National Park in New Mexico. Representatives from Pueblo, Navajo \nand Hopi tribes have all made competing claims for the same objects.\n\nThe tribes' competing claims can stir feuds that go back hundreds of \nyears. \"It has to do with very old notions of clan and kinship and \nphilosophical and religious ideas about death and the afterlife,\" Green \nsaid.\n\n\"The issue is important because what you and I call artifacts are in \ntheir worlds living tribal members with the same rights as people,\" \nWhatley said.\n\nOnce objects are successfully returned to tribes, one serious issue \nfrequently remains. Many of the items belonging to tribes in the \nIroquois Six Nations and the Hopi Nation are perishable--cornhusk masks \nor headdresses with feathers. When these items come into a museum's \ncollection, they are often sprayed with arsenic or another pesticide for \npreservation.\n\nBut upon return, the masks and headdresses are often worn in ceremonies, \nendangering the lives of tribal members and leaving the museum \npotentially liable for any resulting injury or illness.\n\n\"That's something we in the museum world are trying to remedy,\" Green \nsaid. \"We're looking now into alternative means of preservation, like \nflash freezing objects.\"\n\nThough the path to repatriation may take many years, Whatley says the \nend result will be worth the trouble for tribes. Over nine years, he has \nhelped return thousands of objects to the Pueblo Jemez from museums \naround the country.\n\nBack in dusty Pecos, thousands of Indians gathered in 1999 to welcome \nhome their \"tribal members.\" Museum curators and staff were on hand too, \nwatching from a respectful distance.\n\nWhatley, however, was by then a special guest of the tribe and had \nspecial access. He said he felt something that day that transcended \nscience, money, land and all his pre-existing notions about Native \nAmerican culture.\n\nThe experience, he said, has stayed with him and opened his eyes to a \nnew way of looking at life.\n\n\"There's a lot more to this on the spiritual side than many non-Indians \nrealize,\" he said.\n\nhttp://www.azcentral.com\n\n\n\n\n------------------------------\n\nMessage: 8\nDate: Fri, 13 Apr 2007 08:03:49 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Egipto reclama 17 piezas arqueol?gicas al Museo Egipcio\n\tde Barcelona\nTo: Museum Security Network Mailinglist \nMessage-ID: <461F1D45.5020706@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nEgipto reclama 17 piezas arqueol?gicas al Museo Egipcio de Barcelona\negipto-espa?a 12-04-2007\n\nEgipto ha reclamado al Museo Egipcio de Barcelona un total de 17 piezas \nexpuestas en sus salas, y asegura que ha llevado el caso incluso a \ninstancias judiciales catalanas, dijo a Efe un alto funcionario de la \narqueolog?a egipcia.\n\nIbrahim Abdul Maguid, director del sector de antig?edades recuperadas \ndel Consejo Supremo de Antig?edades, asegur? que una arque?loga espa?ola \nque hab?a trabajado en el Museo Egipcio en Barcelona inform? a la \nFiscal?a catalana de que las 17 piezas, adem?s de una estatua antigua, \nhab?an sido robadas a Egipto.\n\nA su vez, la Fiscal?a avis? a la Embajada egipcia en Espa?a, agreg? Maguid.\n\nEl a?o pasado, el Consejo Supremo de Antig?edades, en colaboraci?n con \nla Embajada egipcia, nombr? a un abogado para que presentara una \nreclamaci?n ante la justicia espa?ola para lograr la 'repatriaci?n' de \nlas 17 piezas.\n\nSeg?n Maguid, una enviada del Museo Egipcio de Barcelona visit? El Cairo \npara expresar el deseo de su instituci?n de entregar la estatua a las \nautoridades egipcias, 'pero sin decir nada sobre las otras piezas... \ncomo si fuera para distraer la atenci?n sobre ellas', coment? el arque?logo.\n\nDespu?s de iniciarse el proceso judicial, el Museo Egipcio de Barcelona \nvolvi? a expresar su deseo de negociar la entrega de las piezas, siempre \nseg?n Maguid.\n\n'Yo no s? si aquella arque?loga espa?ola que inform? del robo de las \npiezas lo hizo por sus diferencias con el Museo Egipcio de Barcelona o \npor su afici?n a las antig?edades. Lo importante es que vamos a \nrecuperar nuestros restos', insisti? el experto.\n\nPese a que Maguid entiende que el Museo de Barcelona prefiere negociar \neste asunto, ?l insiste en que no se desplazar? a Espa?a hasta que esa \nentidad env?e fotograf?as e informaciones sobre las 17 piezas en litigio.\n\nParad?jicamente, el Consejo Supremo de Antig?edades egipcio reconoce que \nno sabe nada acerca de las piezas que reclama.\n\nPero s? sabe algo sobre la estatua, cuyo regreso a Egipto fue negociado \nel a?o pasado por el propio Museo Egipcio de Barcelona, pero que todav?a \nse encuentra en Espa?a.\n\nSe trata de una pieza de piedra caliza coloreada, que data de la V \ndinast?a fara?nica, de entre 2.465 y 2.323 antes de Cristo.\n\nLa estatua, de 43,5 cent?metros de altura y en buen estado, seg?n \nMaguid, fue sustra?da durante las excavaciones realizadas en los a?os \nnoventa del siglo XX por el arque?logo egipcio Abdel Munem Abu Bakr en \nla zona de Giza, al suroeste de El Cairo.\n\nAl parecer, es la gemela de una estatua de mujer identificada como \nNefrat ('guapa' en el lenguaje jerogl?fico) que se encuentra en El Cairo.\n\nSin embargo, el Museo Egipcio de Barcelona, a trav?s de su abogado, \nIldefonso Falcones, asegur? hoy que 'el Consejo de Antig?edades de \nEgipto no se ha puesto en contacto con nosotros en relaci?n a ninguna \npieza'.\n\nAdem?s, dijo que una ex empleada del museo, descontenta con una \nindemnizaci?n que hab?a solicitado tras dejar su trabajo, comenz? a \ndenunciar p?blicamente que 17 piezas de sus fondos eran de procedencia \nilegal.\n\nSeg?n el abogado, la Fiscal?a investig? esta denuncia y el Juzgado de \nInstrucci?n n?mero 29 de Barcelona dict? dos autos firmes en los que 'se \nestablece que las obras son propiedad del museo y que fueron importadas \nlegalmente en Espa?a'.\n\nPese a todo, el Museo Egipcio de Barcelona se mostr? dispuesta a \ndevolver cualquier pieza 'si nos acreditan que sali? ilegalmente de \nEgipto, aunque eso sucediera hace sesenta o setenta a?os'.\n\nLa recuperaci?n de las antig?edades que han salido de Egipto de manera \nilegal forma parte de una agresiva campa?a que ha lanzado el Ministerio \nde Cultura egipcio para recuperar miles de piezas robadas.\n\nhttp://actualidad.terra.es/\n\n\n\n\n------------------------------\n\nMessage: 9\nDate: Fri, 13 Apr 2007 08:03:53 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Les ?uvres vol?es aux juifs ravivent de mauvais\n\tsouvenirs au Pays-Bas\nTo: Museum Security Network Mailinglist \nMessage-ID: <461F1D49.2020306@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nLes ?uvres vol?es aux juifs ravivent de mauvais souvenirs au Pays-Bas\nLE MONDE | 12.04.07 | 15h11  ?  Mis ? jour le 12.04.07 | 16h35\nBruxelles Correspondant\n\n'affaire des ?uvres d'art confisqu?es aux juifs pendant la seconde \nguerre mondiale ne passe d?cid?ment pas aux Pays-Bas. Parce qu'elle met \n? mal l'image du royaume o? l'on aima longtemps faire croire que la \npopulation s'?tait, plus qu'ailleurs, mobilis?e en faveur des juifs, \nmais probablement aussi parce qu'elle offre une sombre image du march? \nde l'art n?erlandais ? l'?poque de l'Occupation.\n\nMardi 3 avril, on a appris que l'Association n?erlandaise des mus?es \nallait coordonner une nouvelle enqu?te afin de d?terminer si, dans les \ncollections nationales, ne figuraient pas d'?uvres dont des juifs \nauraient ?t? oblig?s de se d?faire entre 1933 et 1940. Une autre \ninvestigation, dont les r?sultats furent publi?s en 2000, avait d?j? \ntent? de d?terminer si les mus?es n'avaient pas acquis, entre 1940 et \n1948, des ?uvres confisqu?es par les nazis.\n\nLes r?sultats des nouvelles recherches d?pendront, cette fois encore, de \nla bonne volont? des mus?es, qui d?cident seuls de ce qu'ils r?v?lent ou \nnon. Danielle Lokin, pr?sidente de l'Association des mus?es, dit compter \nsur \"leur ?thique professionnelle\" et affirme que rien ne l'autorise ? \npenser qu'on lui cachera des choses.\n\nL'annonce de cette enqu?te officielle est survenue alors qu'un autre \n?pisode suscite la col?re des organisations juives et de certains \nsp?cialistes mondiaux du march? de l'art. C'est mercredi 4 avril, en \neffet, que s'est termin? le d?lai pendant lequel les h?ritiers pr?sum?s \nde juifs spoli?s pouvaient introduire des demandes afin de r?cup?rer \nleurs biens. Une Commission de restitution a examin? jusqu'ici une \nquarantaine de requ?tes et r?pondu favorablement dans les trois quarts \ndes cas. Les h?ritiers du banquier juif Max Rothstein ont, par exemple, \nr?cup?r? le Paysage au troupeau pr?s d'une mare, de Jacob Ruysdael, qui \navait servi ? payer le voyage de la famille vers les Etats-Unis, en \n1941. Une trentaine d'autres demandes doivent encore ?tre trait?es.\n\nDEMANDE DE PROLONGATION\n\nQuelque 4 500 objets confisqu?s aux Pays-Bas ont ?t? retrouv?s apr?s \n1945, en Allemagne, et ont ?t? transf?r?s vers les administrations ou \nles mus?es n?erlandais. Confront? aux demandes de prolongation du d?lai \nimparti pour les demandes de restitution, le minist?re de la culture \nassure que d'autres dossiers pourront ?tre introduits et seront trait?s \npar une nouvelle commission ad hoc. L'ind?pendance de cette nouvelle \ninstance est toutefois mise en doute. Comme, d'ailleurs, l'inventaire \noriginel ?tabli par les mus?es, sans doute peu d?sireux de se d?faire de \ncertaines ?uvres qu'ils avaient parfois restaur?es ? grands frais.\n\nLes doutes ? l'endroit de certaines institutions sont renforc?s par les \nsouvenirs du comportement de certains de leurs dirigeants pendant la \nguerre. Dirk Hanema, directeur du Mus?e Boijmans van Beuningen ? \nRotterdam, et Willi Martin, responsable du Mauritshuis de La Haye, \ncollabor?rent avec l'occupant. Tout comme Piet De Boer, pr?sident de \nl'Association des marchands d'art n?erlandais. Cette p?riode a ?t? \nmarqu?e par d'autres sombres ?pisodes comme le d?mant?lement des \ncollections Schloss, Stodel et celle du banquier Franz Koenigs. Une \npartie de la fabuleuse collection de Jacques Goudstikker ? 1 300 ?uvres \n? fut revendue aux nazis ? l'initiative de proches collaborateurs de ce \nflamboyant marchand et m?c?ne, mort accidentellement en 1941, sur le \nbateau qui le conduisait en Grande-Bretagne.\n\nCette injustice-l? a ?t? r?par?e en 2006 seulement, quand l'Etat rendit \n? l'h?riti?re de M. Goudstikker quelque deux cents tableaux dont une \npartie sera prochainement mise en vente ? Londres, Amsterdam et New \nYork. Le Mauritshuis, le Mus?e Boijmans et le Bonnefanten (Maastricht) \ndurent rendre, au total, une trentaine de tableaux de ma?tres.\n\nJean-Pierre Stroobants\nArticle paru dans l'?dition du 13.04.07\n\nhttp://www.lemonde.fr/\n\n\n\n\n------------------------------\n\nMessage: 10\nDate: Fri, 13 Apr 2007 08:04:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Satellite TV host guilty in bogus artwork scam\nTo: Museum Security Network Mailinglist \nMessage-ID: <461F1D54.8050800@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nSatellite TV host guilty in bogus artwork scam\nKristine Eubanks admits to conspiracy and tax evasion in scheme that \ndefrauded customers of more than $20 million.\n >From the Associated Press\nApril 11, 2007\n\nA satellite TV show host has pleaded guilty to federal charges stemming \nfrom an investigation into bogus artwork sold through televised auctions \nthat defrauded customers of more than $20 million.\n\nKristine Eubanks, 49, of La Ca?ada Flintridge pleaded guilty Monday in a \nLos Angeles courtroom to one count each of conspiracy and tax evasion. \nShe faces up to 10 years in prison when she is sentenced Sept. 24, \nprosecutors said.\n\nEubanks' husband, Gerald Sullivan, 51, pleaded guilty April 2 to one \ncount each of conspiracy and failing to file tax returns. He faces up to \nsix years in prison at sentencing in September.\n\nAuthorities said the couple acknowledged duping more than 10,000 \ncustomers through their \"Fine Art Treasures Gallery\" show, which aired \non DirecTV and Dish Network.\n\nThe couple also said they rigged auctions by creating false and inflated \nbids for art and jewelry sold during the live auctions, prosecutors said.\n\nNearly $4 million and various pieces of artwork were seized when the \ncouple were arrested.\n\nhttp://www.calendarlive.com/galleriesandmuseums/cl-me-artfraud11apr11,0,1912386.story?coll=cl-art-features\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 88\n***************************************\n\n"}