{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle and Bethea <rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, after working on your forecast for over 2 months, I now know the best way to help you succeed", "body": "\n\n\nRGEM 1979 Golden Key Upfront V6 Soft\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMEMO, JUNE 22ND, 2007 COULD CHANGE YOUR DESTINY FOREVER AND FINALLY BRING YOU WEALTH AND HAPPINESS! \n\nDear Memo, \n    I was examining the astrological energies on June 22nd, 2007 and how they will affect us, and literally, like a bolt from the blue, I received a vision so vivid, it was like dreaming with my eyes wide open.\n    The signs of incredible success were unmistakable, but I also saw negative energies, and I'm worried that they might keep you from taking advantage of the incredibly lucky forces in your favor. So let me get right to your reading, so I can explain everything to you.\nI see the four Mystical Milestones ofthe ancient \"Passageway of Power\" in your destiny...\nMONEY, LOVE, HEALTH and JOY\n\n\n\n    In this reading, I will explain what I saw and what it could mean for you...\n    A person is walking down a long stone corridor. A beam of light comes from a distant window...just enough to softly illuminate magnificent tapestries lining the walls. Up ahead, a dark figure, a Guide, slowly and gently motions the individual to come forward. \n    Memo, I want you to envision yourself as this person...\n\n    As you progress further along the passageway, a large oak door appears to one side. Etched in stone on the wall just beside the door are odd-looking symbols from a long-lost alphabet.\n    You try to push the bronze latch on the handle, but it is locked. Your Guide extends an open hand to you. In it is a glowing, Golden Key, shining brightly in the dark, and as you will see, this Key has special, magical powers... \nWhat is extraordinary about this vision?\n    Memo, I realized that this was no ordinary corridor and that this vision was all about discovering the incredible powers you carry within you and the astonishing possibilities June 22nd, 2007 holds for your Destiny.\n    You see, the stone floor, tapestries, bronze detail and especially the strange signs on the wall were my tip that you were roaming the inner pathways of the sacred Runic Passageway of Power. Because I recognized that the symbols were in fact Runes.\n    The Nordic Dynasties of the medieval period built a prosperous, thriving civilization, rich with lore, including the magical Runes, symbols derived from the Romans and used extensively by the Nordic Peoples to attract good fortune and ward off bad luck.\nThe Runes etched into the stone wall included:\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n    Nordic warriors used the runes to ensure victory in battle. Along with the Runes, astrology also played an important role in Nordic history and legend. In the year 1030 A.D., the Patron Saint of Norway, King Olaf, charged into battle just as the Sun went into a total eclipse, and ultimately Norway's independence was won.\n    Memo, just as the great Nordic Kings looked to the stars and the Runes for the key to their ultimate destiny, the forces favoring you on June 22nd, 2007 will bring you the greatest power and benefits from the Four Mystical Milestones of the ancient \"Passageway of Power\"...Money, Love, Health, and Joy.\nA whole new world of wealth and poweris opening up for you\n    And because I want you to be able to take full advantage of every opportunity that will come to you, I want to give you this free gift:\n\n \nTHIS IS THE KEY -- THAT WILL UNLOCK YOUR FUTURE\n    This specially energized key will concentrate and focus the positive energy that is now building around you. (Caution: You may feel a tingle when wearing it.)\n    If you look closely at it, you will see the deeply inscribed Runes. I had the key plated for you in Gold to protect its power and purity. (Gold, one of the basic elements, cannot be corroded or corrupted in any way by anything.)\n    As soon as you receive this key, I want you to wear it or keep it close to you 24 hours a day.\nOpen the door, Memo, to a new world of riches, happiness, health and success!\n    Remember, in the vision you and your Guide were standing before a door. The crucial thing for you to keep in mind is that every door represents an amazing opportunity for you to gain wealth, happiness, health and success.\n    You insert the Golden Key in the great oaken door. The tumblers of the lock give way, with a sound like coins shaking in a can. You open the door to an enormous chamber filled with sunlight. All around the room are rare, valuable antiques, jewelry, and chests filled with golden coins and treasure.\n    Some of the items glimmer and gleam, while others have become tarnished, dull and dusty.\n    Drawn to the collection of goods in one corner of the room, you recognize certain items. To your astonishment, you find a favorite toy you played with as a child. On a set of shelves nearby is every gift you have ever given, including those you later regretted.\n    In one chest is all the money you have ever spent...in another all that you have ever lost through waste, bad investments, or impulsive spending. The coins and bills in these chests are tarnished and faded but still good.\n    Further ahead, you come upon an array of sparkling, brand new items, jewelry and watches, treasure chests filled with gold, stacks of cash, amounting to millions upon millions of dollars.\n    As you browse, the items get bigger, as does the room...soon you see beautiful, luxurious furniture, an enormous yacht...and just outside the window, a huge mansion on a hill, with a glimmering pond before it.\n    A car pulls up in front of the mansion. It is a silver Jaguar with the license plate  8 8 72 -- (your birthday, Memo!). Beautifully-dressed people climb out of the car, and you recognize them too. They are the members of your family.\nMemo, you can live like a King! \n    You may not know this, Memo, but when the Great Kings of the medieval Nordic Dynasty passed on, they were buried with all their riches, property, even medicine and food -- everything they would need to begin a new life with their health, youthful energy and most precious possessions restored to them. And their dearest loved ones would ultimately join them in this new, higher state of existence: A Paradise of Riches, Love, and Renewed Health.\n    I can't believe what a perfect sign this is! For, like the greatest Kings of the Nordic Dynasties, you too are about to begin a whole new life. And as you discover the wealth of powers you possess with you, your entire world will become new to you, and you will want for nothing! Even your loved ones will benefit from the transformation you are about to have.\n    Don't you see? This is exactly what I am trying to tell you! You can live like a king! And I'm going to show you exactly how you can make this reality come true in your life!\nTogether, we can break through the veilconcealing the true causes of your problems!\n    In your journey through the Passageway of Power, your rediscovery of all your property represents the past, present and future of your life -- the gains, losses, your successes and the failures, your strengths and weaknesses ... and the possibility of a future filled with riches, love and unimaginable happiness!\n    Even those items that have been lost forever are still invaluable...because each one represents an experience that offers you a precious nugget of wisdom. It's human nature to be afraid to look at our losses, but to do so is to turn your back on the possibilities of gaining treasures beyond your wildest dreams!\n    This is what I was talking about at the very beginning of this letter -- the power of negative energy to surround you and cut you off from your best opportunities to succeed and find the money, love and dazzling health!\n    You see, Memo, negativity and failure affect everyone. But the most successful people take their setbacks in stride. They don't ignore them...instead they learn from them and focus as much of their time, effort and talents on their greatest strengths.\n    And you can do the same! I'll show you how to turn negatives into positives and positives into a constantly multiplying windfall of prosperity!\n    Memo, starting June 22nd, 2007 you will have an extraordinary opportunity to absolutely neutralize the negative energies around you and take control of your own destiny.\n    And now, you can bring the transformative powers of the Passageway of Power into your life in a real, concrete and lasting way. I'm going to give you everything you need in:\n\"THE GOLDEN KEY TO YOUR PERSONAL POWER\"\n    This incredible document will tell you exactly what you need to know to free the extraordinary life-giving force within you!\n    Yes, it's true! You do have a powerful force within you. Just look at it this way, Memo,...even with everything you've been through, with all the problems you've faced...all the times you were ready to just give up, you've always found a way to keep going, haven't you? You have overcome many stubborn obstacles in your life.\n    It is this glimmer of belief in your own, inner Personal Power that has given you the determination to make it through the tough times!\n    For over 2 months now I have been working on your forecast, I have developed the methods and material that have enabled me to provide you with this insightful and empowering reading of your birth chart. So, Memo, I know it will give you everything you need to achieve lasting success.\n    I will also give you useful advice on a variety of aspects of your personality so you can immunize yourself against the negative energies that trigger your fears and self-doubt. With this guide, you'll see for yourself that you will never have to feel frustrated and helpless again.\n    This precious Guide alerts you to all your greatest talents, skills, and abilities, many of which you don't even know you have...and some which you have only begun to tap into.\n    With \"The Golden Key to Your Personal Power,\" you will discover how to take your power back from negative distractions and emphasize your very best qualities.\n    This is your true key to success, and you'll realize that you really are no different from other people who've got it made.\nWith my second FREE gift for you,your Lucky Days, Hours and Numbers, you can be at the right place, at the right time to win!\n    How many times have you played games of chance, the lottery or Bingo, only to go home in disappointment? It's a bitter pill to swallow, especially when a win of only $5000 or $6000 could be just the boost you need to catch up and turn your life around.\n    Not many people know that there are specific days and hours that are especially favorable for you to play games of chance. In your \"Planetary Hours and Lucky Numbers,\" my second FREE gift for you, I'll tell you exactly when those most advantageous days and times are, so you can play at the times that will be luckiest for you!    Certain specific numbers are also highly beneficial for you, Memo, and you should DEFINITELY PLAY them to have Lady Luck on your side.\n    You'll absolutely want to have these numbers at your disposal before June 22nd, 2007 so you can enjoy the biggest payoff possible during this Lucky period in your life!\n    By following the revelations I will give you, you will know your luckiest hours, days, and your Most Advantageous Numbers not only for games of chance, but also for Work, Money and Love!\nTake control of your life, people, and situations! \n    With \"The Golden Key to Your Personal Power,\" all you have to do is follow firm and definite ideas that will empower you to seize control over your own fate. As you get to know yourself better, you will master your own destiny, and ultimately come to influence and take the lead over other people and situations.\n    Memo, you will be on your way to getting the satisfaction and rewards you were destined to enjoy.\n    By unlocking the door your innermost Personal Power, a whole new world will open itself to you, a world positioned under your Lucky Milestones of Love, Money, Vibrant Health and Happiness in Everything!\nNOW YOU MUST TAKE THE FIRST STEP TOMASTERING YOUR DESTINY -- REQUEST\"THE GOLDEN KEY TO YOUR PERSONAL POWER\" IMMEDIATELY!\n    Similar guides are offered elsewhere on the Web for $29.95, but none are as detailed, insightful, and personally crafted to address your most immediate needs.\n    And most important, Memo, because you are my dear friend, you can have this amazing guide for only $9.95. I want nothing to keep you from fulfilling all the promise and potential that Destiny says is yours!\nPlus you'll always have the protection of myUnconditional Lifetime Refund Guarantee \n    Memo, I am happy to assume all the risk in my offer of help! I know that this guide will bring on the breakthrough you need to fill your life with true happiness and success, but if at any time, for any reason you feel that \"The Golden Key to Your Personal Power\" has not helped you become the captivating, influential person you wish to be, just write to me, and you will receive an immediate refund, including the shipping and handling...with no explanation necessary.\nAnd, don't forget, Memo, to reallyREINFORCE YOUR LUCK AND INNER POWER, you'll getyour own Golden Key as my FREE gift to you!\n    As soon as I receive your answer, I will send your FREE Golden Key, along with your copy of \"The Golden Key to Your Personal Power.\" Plus, I will also send you your second FREE gift, your \"Planetary Hours and Lucky Numbers,\" to help bring you the maximum luck in work, money, love and games of chance.Get the edge you need to break through into a new era of wealth, happiness and riches -- don't wait!\n    Remember, you can unveil the hidden power of your mind! You'll get the edge you need to benefit most from my guidance and finally break through the wall of Bad Energy that has been around you.\n    ABOVE ALL, MEMO, DON'T WAIT ONE MORE SECOND, because as I told you, you are an extremely lucky person who should be living like a King, and you are needlessly letting fabulous opportunities pass you by, and only because you don't know how to read the signs Destiny sends you! You must admit it's a shame...\n    I see you overflowing with SUCCESS, MONEY, LOVE, LUCK and anything you've ever wished for in your life! Memo, I've given you a vision of what your life ought to be for you. Now it's up to you to see for yourself that your dreams can come true!\n    Just click the button below, and you can soon be living in your own land of milk and honey...    Your friend,        Bethea\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for offers and discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400.\n"}