{"category": "ham", "to_address": "\"avcavc\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"AccuWeather.com Alert\" <inbox@messaging.accuweather.com>", "subject": "AccuWeather.com Alert(tm) Advisory  (avcavc)", "body": "\n\nAccuWeather.com Alert[TM]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSevere Watches and Warnings for BEVERLY HILLS \n\n\n\n\n\n\n\n\n\n\n\n\n\nLOXCFWLOX\r\nWHUS46 KLOX 270921\r\nCFWLOX\r\n\nCOASTAL HAZARD MESSAGE\r\nNATIONAL WEATHER SERVICE LOS ANGELES/OXNARD CA\r\n221 AM PDT FRI APR 27 2007\r\n\n..HIGH SURF CONTINUING ON EXPOSED WEST FACING SHORES...\r\n\nHIGH SURF WILL CONTINUE AND STRONG RIP CURRENTS WILL PERSIST\r\nALONG EXPOSED WEST FACING SHORES THROUGH THIS MORNING. A LARGE\r\nNORTHWEST SWELL WILL BRING THE HIGHEST SURF CONDITIONS TO THE\r\nCOASTAL AREAS OF SAN LUIS OBISPO AND WESTERN SANTA BARBARA\r\nCOUNTIES. DUE TO THE LONGER PERIOD OF THE SWELL...SOME OF THIS\r\nENERGY WILL SPREAD INTO THE INNER COASTAL WATERS...RESULTING IN\r\nHIGHER THAN NORMAL SURF CONDITIONS ACROSS WEST FACING BEACHES OF\r\nLOS ANGELES AND VENTURA COUNTIES.\r\n\nCAZ034-035-271700-\r\n/O.EXT.KLOX.SU.Y.0007.000000T0000Z-070427T1700Z/\r\nSAN LUIS OBISPO COUNTY CENTRAL COAST-\r\nSANTA BARBARA COUNTY CENTRAL COAST-\r\n221 AM PDT FRI APR 27 2007\r\n\n..HIGH SURF ADVISORY NOW IN EFFECT UNTIL 10 AM PDT THIS MORNING...\r\n\nTHE NATIONAL WEATHER SERVICE IN LOS ANGELES/OXNARD HAS CONTINUED THE\r\nHIGH SURF ADVISORY FOR THE CENTRAL COAST. THIS ADVISORY IS NOW IN\r\nEFFECT UNTIL 10 AM PDT THIS MORNING...AND INCLUDES THE WEST FACING\r\nSHORES OF SAN LUIS OBISPO AND SANTA BARBARA COUNTY.\r\n\n10 TO 12 FOOT SURF WILL CONTINUE THROUGH LATE MORNING ALONG THE\r\nCENTRAL COAST...WITH THE HIGHEST SURF OCCURRING ON THE WEST AND\r\nNORTHWEST FACING BEACHES. THE SURF IS EXPECTED TO BEGIN SUBSIDING\r\nLATER TODAY.\r\n\nA HIGH SURF ADVISORY MEANS THAT HIGH SURF WILL AFFECT BEACHES IN THE\r\nADVISORY AREA...PRODUCING STRONG RIP CURRENTS AND LOCALIZED BEACH\r\nEROSION. ALL PERSONS SHOULD BE AWARE OF THE RISKS ASSOCIATED WITH\r\nWATER RELATED ACTIVITIES AND USE EXTREME CAUTION WHEN ENTERING THE\r\nOCEAN. WHEN IN DOUBT...JUST STAY OUT.\r\n\n$$\r\n\nCAZ040-041-271700-\r\n/O.EXT.KLOX.CF.S.0006.000000T0000Z-070427T1700Z/\r\nVENTURA COUNTY COAST-\r\nLOS ANGELES COUNTY COAST INCLUDING DOWNTOWN LOS ANGELES-\r\n221 AM PDT FRI APR 27 2007\r\n\n..HIGHER THAN NORMAL SURF CONTINUES AT WEST FACING BEACHES...\r\n\nABOVE NORMAL SURF CONTINUES AT THE LOS ANGELES AND VENTURA COUNTY\r\nBEACHES THIS MORNING. 4 TO 6 FOOT SURF WITH LOCAL SETS TO 7 FEET\r\nCAN BE EXPECTED AT WEST FACING BEACHES THROUGH LATE THIS MORNING.\r\nSURF WILL CONTINUE TO DIMINISH THROUGHOUT TODAY.\r\n\nTHE HIGHER THAN NORMAL SURF CONDITIONS WILL LIKELY PRODUCE STRONG\r\nRIP CURRENTS. ALL PERSONS SHOULD BE AWARE OF THE RISKS ASSOCIATED\r\nWITH WATER RELATED ACTIVITIES AND USE EXTREME CAUTION WHEN ENTERING\r\nTHE OCEAN. WHEN IN DOUBT...JUST STAY OUT.\r\n\n$$\r\n\nHALL\n\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChoose another forecast:\n\t\t\t\t\t\t\t\t\t\tEnter a zipcode, or a city, state\n  \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n©2007\n\t\t\t\t\t\t\tAccuWeather, Inc. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}