{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGood afternoon,\n \nThis is Russ Mitchell filling in for Katie while she\n  is on assignment. \n \nThe Georgia\n  man who might have exposed trans-Atlantic flight passengers and crewmembers\n  to a drug-resistant form of tuberculosis is in isolation and is headed to Denver for treatment.\n  His travels have triggered an international search for people who might have\n  been exposed to the potentially fatal disease. Kelly Cobiella will piece\n  together details of this man’s travels and Nancy Cordes will explain\n  more about drug-resistant tuberculosis – and tell you where else in the\n  world it can be found.\n \nLara Logan will have more of her exclusive interview\n  with Prime Minister Nouri al-Maliki in which he admits there is a real threat\n  of a coup in Iraq.\n  \n \nControversy is raging over a reality TV show in the Netherlands.\n  It will have just three contestants and the winner will walk away with a\n  … kidney. A 37-year-old woman dying of cancer is giving away a healthy\n  kidney to one of three people in need of a transplant. Richard Roth reports\n  that the TV station says there’s a good reason for showing a program\n  even they admit is “tasteless.”\n \nHere in the United States, the five-year-old\n  No Child Left Behind law is up for debate this year and it’s time for a\n  report card. Under the legislation, schools are judged based on the way their\n  state decides to test students – and for stricter states, that leaves\n  pressure to ease up just to fit in. Tonight, Kelly Wallace will have a look\n  at how some states’ test scores look on paper – and why they\n  don’t always measure up.\n \nAnd Kimberly Dozier will bring you to the\n  “other front line” of the battle for Iraq. She’ll talk to the\n  medics and caregivers that fight to save wounded soldiers – and who\n  often serve as a lifeline for the victim. Kimberly will also tell more of her\n  own story of recovery.\n \nPlease join us for this and more,\n \n\n\n\n\nRuss Mitchell\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}