{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Nathanael Nerode <neroden@fastmail.fm>", "subject": "Re: Request for suggestions of DFSG-free documentation licenses", "body": "Shriramana Sharma  wrote:\n>Thanks for all your feedback, but the GPL also has some clauses that are \n>not applicable to documentation as pointed out at:\n>\n>http://www.gnu.org/licenses/gpl-faq.html#WhyNotGPLForManuals\n\nDebian does not agree with the FSF opinion on this.  The FSF's opinion \nis basically an excuse to allow their \"invariant sections\", which Debian\nconsiders unacceptable.  The FSF severely exaggerates in order to \npromote the GFDL.\n\nThe GPL is a very suitable license for manuals in electronic form -- in \nelectronic form, we *do* want source code for our manuals (troff, TeX, \nwhatever).  In addition, it is *extremely* valuable for the manual to be \nlicensed under the same license as the program.  *Extremely* valuable.  \nThis makes it far, far easier for people to move online help into the \nmanual and back, and the same with comments in the code.\n\nThe GPL contains some clauses which are somewhat irritating for \n*printed* manuals *only*.  Debian does not think that this is a problem,\nas Debian does not distribute printed manuals (the user can always \nprint them himself).\n\nIf the manual has a single copyright holder (your company, \nperhaps), the copyright holder can always print and sell the manual, \nperiod, without restrictions, end of story; the copyright holder \ndoesn't need a license to do so.\n\nIf you plan to use work copyrighted by other people in the manual, and \nyou want to make printed copies; or if you want to make it easy for \n*other people* to make printed copies and sell them; then you can \ndual-license the manual under the GPL and a printing-friendly license.\n\nIf this is the same company which is licensing its software under a dual \nGPL-and-proprietary model, I think it probably makes the most sense for \nyour company to simply license the manual under the GPL.  This means \nthat your company is the only one which can distribute *printed* copies \nof the manual without attaching a CD, diskette, or offer to provide source\ncode.  Some people will probably be willing to pay for the \nprofessionally printed copies.  :-)\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}