{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Ira Glazer <ira@yanua.com>", "subject": "[Ip-health] Guardian: Clinton backs violation of Aids drug patents", "body": "(This is interesting wording coming from the Guardian: on the one hand\nCLs are not violations of patents at all; on the other hand the mere\njuxtaposition of the words 'violation' and 'patents' in the context of\nAids (and of Pres.Clinton) might serve to have people question the\n'sanctity' of patents.  Note again the misinformation that 'According to\nWorld Trade Organisation agreements, governments can issue compulsory\ndrug licenses ...in case of a national public health emergency.')\n\n\nhttp://www.guardian.co.uk/print/0,,329818608-106925,00.html\n\nClinton backs violation of Aids drug patents\n\nDavid Batty and agencies\nWednesday May 9, 2007\n\nGuardian Unlimited\n\nBill Clinton has backed moves by several developing countries to break\nAids drugs patents held by US pharmaceutical companies to reduce the\nhuge cost of tackling the disease.\n\nThe former US president also announced that his charitable foundation\nhad negotiated cut prices for generic versions of Aids medicines,\nincluding 16 second-line drugs - needed if the original treatments fail\n- and a new one-a-day pill that most developing countries cannot afford.\n\nThe deal struck with the generic drug manufacturers, Cipla and Matrix,\nwill halve the cost of the drugs for better-off developing countries and\ncut prices by 25% in poorer countries, which are already paying lower\nprices.\n\nIt will lower prices in 66 countries in Africa, Asia, Latin America and\nthe Caribbean, with the new one-a-day pill costing less than $1 (50p) a day.\n\nMr Clinton said: \"Seven million people in the developing world are in\nneed of treatment for HIV/Aids. We are trying to meet that need with the\nbest medicines available today, and at prices that low and middle-income\ncountries can afford.\"\n\nThailand and Brazil are the latest countries to break patents held by US\npharmaceutical companies that are charging prices Mr Clinton has\ndescribed as excessive.\n\nThe Thai health minister, Mongkol Na Songkhla, today said Mr Clinton\nsupported his country's move to break patents on three Aids medications.\n\n\"Clinton explicitly gave Thailand ... full support for its decision that\nwill help poor people in the country gain access to medication,\" he said\non a visit to the US to defend the policy.\n\nMr Mongkol said the Thai government could only afford to provide the\ndrugs to a fifth of the 500,000 Thais living with HIV due to the high\ncost of the treatments.\n\nHe said the move would cut the cost of the Aids drugs, Kaletra and\nAluvia, to $695 per patient per year. This is significantly cheaper than\nthe latest offer by Abbott Laboratories, which makes Kaletra, to provide\nthe drug at a cost of $1,000 per patient per year.\n\nThe US recently added Thailand to its annual priority watch list of\nnations where American companies face particular problems protecting\nintellectual property rights.\n\nCountries on the list are under extra scrutiny and could face trade\nsanctions if violations worsen.\n\n\"We want to explain that it was an unfair punishment,\" said Mr Mongkol.\n\nHe said Thailand's decision had not broken any international or domestic\nlaw. According to World Trade Organisation agreements, governments can\nissue compulsory drug licenses for non-commercial use in their\ncountries, allowing the manufacture, import and sale of cheaper generic\nversions of patented drugs in case of a national public health emergency.\n\nAround 39.5 million people worldwide are living with HIV/Aids, according\nto the World Health Organisation. Since the 1970s, around 25 million\npeople have died of Aids.\n\nAround 750,000 people worldwide are currently receiving drug treatments\nfor Aids through the Clinton Foundation.\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}