{"category": "ham", "to_address": "Sami Liedes <sliedes@cc.hut.fi>, 420686@bugs.debian.org", "from_address": "Don Armstrong <don@debian.org>", "subject": "Bug#420686: It's not obvious esniper is legal (violation of eBay ToS)", "body": "severity 420686 normal\nthanks\n\nOn Tue, 24 Apr 2007, Sami Liedes wrote:\n> 2.2.3 says \"Packages must be placed in _non-free_ if they are not\n> compliant with the DFSG or are encumbered by patents or other legal\n> issues that make their distribution problematic.\" (I expected to find\n> something saying something about software that cannot be distributed\n> at all, but apparently it's not there, and all the language in other\n> sections seems very copyright and patent centric.)\n> \n> eBay TOS (or \"User Agreement\" in eBay terms) says[1]:\n> \n> ------------------------------------------------------------\n> \"_Access and Interference_\n> \n> The Sites contains robot exclusion headers. Much of the information on\n> the Sites is updated on a real-time basis and is proprietary or is\n> licensed to eBay by our users or third parties. You agree that you\n> will not use any robot, spider, scraper or other automated means to\n> access the Sites for any purpose without our express written\n> permission.\n> \n> Additionally, you agree that you will not:\n> \n> [...]\n> \n> - bypass our robot exclusion headers or other measures we may use to\n> prevent or restrict access to the Sites.\"\n\nThis is a case of whether or not it is legal to (or strictly speaking,\na violation of an agreement to which the user may be a party when\nusing) a piece of software in a particular fashion, not whether it is\nlegal to distribute it.\n\nIn general, we deal with cases of the letter on -legal (and in general\nin the archive) rather than the former.\n\nI've not closed the bug report myself, but I have made the severity\nnon-RC. Dima: that's your call; you can wait for more -legal\ncontributors to weigh in, or you can close the report.\n\n\nDon Armstrong\n\n-- \nOne day I put instant coffee in my microwave oven and almost went back\nin time.\n -- Steven Wright\n\nhttp://www.donarmstrong.com              http://rzlab.ucr.edu\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}