{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "robert weissman <rob@essential.org>", "subject": "[Ip-health] Clinton endorses Thai, Brazil compulsory licenses", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\n[snip]\n\nStanding next to Thailand\n's\nhealth minister, Mr. Clinton also forcefully endorsed recent decisions\nby Thailand and Brazil\n\nto break patents held by American pharmaceutical companies that are\ncharging prices Mr. Clinton described as exorbitant, but that drug\ncompany officials said were reasonable.\n\n\"No company will live or die because of high price premiums for AIDS\ndrugs in middle-income countries, but patients may,\" he said.\n\n[snip]\n\n\nhttp://www.nytimes.com/2007/05/09/world/09aidsdrugs.html?_r=1&oref=slogin\n\nNew York Times\nMay 9, 2007\n\n\n  Clinton Foundation Announces a Bargain on Generic AIDS Drugs\n\nBy CELIA W. DUGGER\n\n\nFormer President Bill Clinton\n\nannounced yesterday that his foundation had negotiated deep price\nreductions for generic versions of costly, second-line AIDS\n\ndrugs needed when the original medicines fail, as well as for less\ntoxic, easier-to-use first-line medicines combined in a pill that can be\ntaken once a day.\n\nStanding next to Thailand\n's\nhealth minister, Mr. Clinton also forcefully endorsed recent decisions\nby Thailand and Brazil\n\nto break patents held by American pharmaceutical companies that are\ncharging prices Mr. Clinton described as exorbitant, but that drug\ncompany officials said were reasonable.\n\n\"No company will live or die because of high price premiums for AIDS\ndrugs in middle-income countries, but patients may,\" he said.\n\nThe new prices would halve the cost of the drugs for better-off\ndeveloping countries in Latin America and Asia and cut prices by 25\npercent in poor countries, which were already paying lower prices, the\nfoundation said. The second-line medicines will be bought with more than\n$100 million raised by a group of countries led by France. The improved\nfirst-line therapies will largely be financed by the Global Fund to\nFight AIDS, Tuberculosis and Malaria and other donors.\n\nSecond-line drugs have typically cost about 10 times as much as\nfirst-line therapies. Costs have ballooned in Brazil and Thailand, which\nbegan programs to provide universal access to AIDS treatment years\nbefore African countries did, as patients have developed resistance to\ngeneric first-line treatments and have moved to brand-name second-line\ndrugs.\n\nThe Clinton Foundation's willingness to buy the generic drugs from the\nIndian manufacturers Cipla and Matrix will give developing countries\nleverage in bargaining with American companies for lower prices on\nbranded antiretroviral drugs and may embolden some to follow Brazil and\nThailand in overriding patents, AIDS activists said.\n\nBut developing countries still have reason to worry about retaliation\nfrom drug companies and trade sanctions by the United States. This year,\nAbbott Laboratories\n,\nbased in Illinois, withdrew new drugs, including those for high blood\npressure\n\nand AIDS, that it had planned to introduce in Thailand until the\noverride on Abbott's patent on the second-line drug, Kaletra.\n\nUnited States trade officials last week put Thailand on a watch list for\ncountries inadequately safeguarding the intellectual property rights of\nAmerican companies, noting the overriding of drug patents.\n\nTido von Shoen-Angerer, who leads the campaign by Doctors Without\nBorders\n\nfor access to medicines, said he was unsure whether the recent\ndevelopments would encourage developing countries to exercise their\nrights under international trade rules more freely to make or import\ngeneric drugs.\n\n\"There's a strong chilling effect from the U.S. action,\" he said.\n\nDrug company officials yesterday strongly defended their policies of\ncharging better-off developing countries more for AIDS drugs than they\ndid for poor countries, as well as the role of patents, which give\ninventor companies a monopoly on the sale of a drug, in stimulating the\ndevelopment of new drugs.\n\nJennifer Smoter, a spokeswoman for Abbott, said patents were needed \"to\nensure innovation in the future\" but declined to respond to Mr.\nClinton's comment that \"Abbott has been almost alone in its hard-line\nposition here over what I consider to be a life and death matter.\"\n\nAbbott had been charging $2,200 annually per patient for Kaletra in\nmiddle-income developing countries, which include India, China, Brazil\nand Ukraine. Last month, it dropped the price to $1,000. The\nfoundation's new price for the generic is $695.\n\nJeffrey L. Sturchio, a vice president at Merck\n\nin New Jersey, says his company strives to balance providing the\nbroadest possible access to AIDS drugs while maintaining financial\nincentives to attract companies to conduct research and development on\nnew drugs.\n\nBrazil and Thailand have overridden Merck's patent on the AIDS drug\nefavirenz, an ingredient of the new, improved first-line AIDS therapies.\nMerck had been charging Brazil $577 annually per patient, a price it\nagreed to drop to $400 a year after Brazil said it was considering\noverriding the patent. The Clinton Foundation's new price for the\ngeneric drug is $164.\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}