{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "James Duffy <humphrey@gnamerican.com>", "subject": "Straining yourself when you are with a woman?", "body": "\n\nIs there any reasons to pay more? Do you want to save your money? I bet you do! \nOur pharmacy\nU can restore your health right now. Doesn't matter what the problem is - we have pills to cure everything. Erection Dysfunction, Weight loss, Anti-Depressants, Antibiotics and even more! \nClick here to become a sex giant\nInstant shipping directly from our warehouses!\nWith best regards,\nJames Duffy\n \n \nDo granicy nubesov nemaloe rasstoianie, no oni nepremenno uspeiut pover moemu Chutiu, ia redko oshibaius, i ty eto znaesh. Vse bylo privychno. Po mne, tak etot paskudnyj narodec davno uzhe bylo pora pustit pod koren, Chtob ne tolko pod nogami ne putalsia, a dazhe mysliu svoej zlovrednoj Prorochestva Ne kasalsia. Oshchushchenie bylo pohozhe na to, kogda on vynimal spiashchego poputchika iz mochki uha, No teper pokazalos, chto on zabralsia priamo v mozg!. \nchto sluchilos, Nori? napriazhenno sprosil ia, perehvatyvaia blaster v Rukah poudobnee. Slishkom liubil puskat krov V ulichnyh drakah. Ee verhniaia odezhda byla serebristogo cveta, Golovnoj ubor byl sshit iz serebristogo meha parskuna, za ee spinoj pleskalis na Holodnom vetru miagkie zheltovatye volosy, a stremena popirali uzkie serebristye Sapogi. A kogda Shefir najdet nas, to Nkot, esli on tak silen, kak ty govorish, sumeet nas Zashchitit i ostavit tem samym shefira s nosom. I nanes mne vizit. Interesno, chto Onni imela v vidu, govoria, chto videla nechto osobennoe, Puteshestvuia s etim chuzhakom. Ia neploho Podgotovilsia k etomu pohodu. Ia bolshe ne mog teriat vremia na razgovory, tak kak uzhe ponial, kuda Nori Mogla podatsia na gravikate, i neobhodimo bylo speshit, poka s nej ne Prikliuchilos chto-nibud skvernoe. \nMag uslyshal chut li ne ranshe Mihkaia. No prishlo vremia platit dolgi po schetam. Utknuvshis licom v Toshnotvornuiu von, ia vnimatelno slushal. Vozduh budto by zagustel, a raznokalibernye teni zdanij Neestestvenno bystro pocherneli, vmig uplotnivshis nastolko, chto chast Ploshchadi, na kotoruiu oni padali, stala kazatsia edinym provalom v inoe Izmerenie, v bezdonnuiu propast, ogromnoj razverzshejsia pastiu chem ugodno, Tolko ne teniu. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}