{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Google Alerts <googlealerts-noreply@google.com>", "subject": "Google Alert - bush", "body": "\nGoogle News Alert for: bush\n\n\nBush Losing 'Fast Track' Trade Powers\nABC News - USA\nPresident George W. Bush, waves as he boards Marine One at Pease Air\nNational Guard Base, in Newington, NH, on Thursday, June 28, 2007.\n...\n\nSee all stories on this topic\n\n\nA Reversal of Fortune for Bush's Political Capital\nNew York Times - United States\nMuch has changed politically for President Bush since this news\nconference, which was held shortly after he was re-elected in November\n2004. ...\n\nSee all stories on this topic\n\n\nLaura Bush Visits Mali As Part Of Tour\nGuardian Unlimited - UK\n>From AP AP Photo ZA114 By ALMAHADY CISSE AP Writer BAMAKO, Mali (AP) -\nLaura Bush wrapped up a tour of Africa on Friday by visiting a\nschool and sitting in ...\n\nSee all stories on this topic\n\n\nEagle and the bear at odds as Bush, Putin meet\nNational Post - Canada\nWhen George W. Bush hosts Vladimir Putin at the Bush\nfamily's sport-fishing compound in Kennebunkport, Maine, on Sunday, the\nAmerican and Russian leaders ...\n\nSee all stories on this topic\n\n\nBush proclaims some Syrians non grata\nJewish Telegraphic Agency - New York,NY,USA\nPresident Bush banned travel to the United States for Syrian and\nLebanese individuals deemed to support terrorism or the undermining of\nLebanon's government ...\n\nSee all stories on this topic\n\n\nThe Good Lord protected me from Bush\nGranma International - La Habana,Cuba\nThen, as bold as you like, the spokesman of the White House National\nSecurity Council, Zombie Johndroe, when asked whether Bush was\nhoping for Castro's ...\n\nSee all stories on this topic\n\n\nBush invokes privilege in row over fired prosecutors\nTaipei Times - Taiwan\nThe White House and Congress were on a constitutional collision course on\nThursday, after US President George W. Bush refused to hand over\ndocuments related ...\n\nSee all stories on this topic\n\n\nSupreme Court Tilts Right In Key Cases Due To Bush Picks\nCNNMoney.com - USA\nEven as the Senate demolished President Bush's effort to reform\nimmigration on Thursday, the Supreme Court was cementing his legacy in\nreshaping the ...\n\nSee all stories on this topic\n\n\nBush: 'Good results' follow Iraq buildup\nChicago Tribune - United States\nNEWPORT, RI -- Faced with eroding support even among longtime Republican\nallies in Congress, President Bush argued Thursday that the US troop\nbuildup in ...\n\nSee all stories on this topic\n\n\nHouse Democrats rebuff Bush on trade deals\nReuters - USA\nIn a joint statement, House Speaker Nancy Pelosi and other senior Democrats\nalso said that renewing President George W. Bush's expiring\nauthority to ...\n\nSee all stories on this topic\nGoogle Blogs Alert for: bush\n\n\nWith 18 Months To Go, Will Bush Hit Iran?\n\nWill President Bush, perhaps on the advice of Dick Cheney, order a military strike on Iran before he leaves office in 18 months? Interviews with two former administration officials this week give some insights. ...\n\n\nTIME: Middle East Blog - http://time-blog.com/middle_east/\n\n\n\nBush Turns Iraq into Israel/Palestine; Gaffe enda...\n\nBy Juan Cole(Juan Cole)\n\nI do not think it is an exaggeration to say that DVD's of Bush's comments will be spread around as a recruiting tool for jihadis, and that US troops will certainly be killed as a result of this speech. You could say that the US military ...\n\n\nInformed Comment - http://www.juancole.com/\n\n\n\nBush: Iraq Surge Showing Results\n\nThe US troops surge is beginning to show results, according to Pres. Bush.\n\n\nGlobalSecurity.org - http://www.globalsecurity.org\n\n\n\nBush identifies the wrong 'main enemy'\n\nBy Steve Benen\n\nOddly enough, the president used to be fairly responsible when describing al Qaeda's role in Iraqi violence. Not too terribly long ago, Bush described \"the terrorists affiliated with or inspired by al Qaeda\" -- not even the...\n\n\nPolitical Animal - http://www.washingtonmonthly.com/\n\n\n\nFroomkin: Bush and his crowd makes a lot of boastful predictions ...\n\nBy Joe Sudbay (DC)(John Aravosis (DC))\n\nBush. There is one particularly salient section about the Bush team's swagger and confidence -- and how that is usually off-base and just plain wrong. In fact, when team Bush does make a prediction, they're almost always puffery backed ...\n\n\nAMERICAblog: A great nation deserves... - http://www.americablog.com/\n\n\n This as-it-happens Google Alert is brought to you by Google.\n \nRemove this alert.\n  Create another alert.\nManage your alerts.\n\n"}