{"category": "ham", "to_address": "sugar@lists.laptop.org", "from_address": "Simon McVittie <simon.mcvittie@collabora.co.uk>", "subject": "Re: [sugar] key IDs", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nOn Thu, 31 May 2007 at 10:45:02 +0200, Morgan Collett wrote:\n> Simon McVittie wrote:\n> > I'm assuming here that the key-ID is \"sufficiently unique\" across all\n> > trusted servers. It's a SHA-1 of the public key, so basically the\n> > same strength as GnuPG key fingerprints and git object hashes.\n> > (Actually, for hysterical raisins, it's a SHA-1 of Base64(public_key) -\n> > we should probably change this before we ship.)\n> \n> A lot of crypto out there relies on hashes of keys. If the key is random\n> (enough), then the hash should be good enough not to collide. At least,\n> not in predictable ways...\n\nSure. If there's a collision, you may be able to do a minor DoS\nby setting up two XOs with keys with the same key-ID - this will confuse\nthe PS on other XOs, but shouldn't be serious (the worst case is that\nyou can see that one or other of the colliding XOs is in an activity,\nbut you can't see which is there, or indeed whether it's both).\n\n(Hmm, actually... in the current implementation, if one of the colliding XOs\nis in an activity, and it leaves, then the PS (and hence UI) will\nindicate that the \"collided\" Buddy has left, which may enable the other\ncolliding XO to eavesdrop undetected. I can fix this quite easily, though,\nand will do so.)\n\nImpersonating another child would require a preimage attack, as I understand it\n(i.e. the ability to construct a key with a desired hash). It seems\nreasonable that we don't defend against preimage attacks.\n\n> Why though is it a hash of the base64? In theory the base64s have the\n> same entropy as the keys, but the crypto stuff should be happening in\n> binary land unless we get into XML.\n\nLike I said, hysterical raisins (aka \"it was like that when I got\nhere\").\n\nThe public key is represented in Telepathy by a byte-array (i.e. binary\nblob) and our assumption was always that the OLPC people would put raw\nkey material into it. However, the presence service always appears to\npass keys around as Base64 strings, which are the contents of owner.key.pub\n(which is an OpenSSH DSA public key in the same form you'd put in your\n~/.ssh/authorized_keys) minus the \"ssh-dss \" prefix.\n\nI think the PS should pass keys around as a binary blob of raw key material,\nand the SHA-1 should be over this raw key material.\n\n> If changing it will break the mesh for everybody at some point \"before\n> we ship\", sooner's better than later.\n\nAgreed.\n\n> In http://www.nist.gov/sha, NIST states:\n> \"Federal agencies should stop using SHA-1 for digital signatures,\n> digital time stamping and other applications that require collision\n> resistance as soon as practical, and must use the SHA-2 family of hash\n> functions for these applications after 2010.\"\n> \n> We probably won't have a NIST-blessed replacement for SHA before 2012.\n> Nevertheless, we need to allow for changes along the way.\n\nHmm. I hadn't thought about having a changeable key algorithm...\n\n> > The actual function used for the key-ID can be changed (if it\n> > is, old and new versions of Sugar will be incompatible, but that's not\n> > really a problem yet) so if any crypto gurus want to specify something\n> > different, now would be a really good time. As currently implemented, its\n> > output must be short enough to put in the JID (for which a hex SHA-1 is\n> > somewhat long already).\n> \n> IMO we need to allow for some algorithm agility here. Breaking the mesh\n> at any stage is going to be very unpleasant - for the users^Wkids\n> especially.\n> \n> For the unique identifier stuff, could we at some future point do a\n> 'keyid2/' (or some other prefix) meaning that this is an identifier in a\n> different space?\n\nOK, here's a proposal:\n\n* The generated JIDs have a prefix ending with a dot, which is the algorithm\n  by which they were generated.\n\n* No prefix means hex(SHA-1(Base64(key material))) as we currently do.\n  This is deprecated and support will be removed before we ship.\n\n* We define a prefix to switch to now, perhaps \"sha1.\" meaning\n  hex(SHA1(key material)). We could consider switching from hex to Base32\n  (which would give us JIDs half as long for the same hash length), or to a\n  stronger hash algorithm, straight away. The Base32 pad character would have\n  to be changed from \"=\" to \"_\" to be valid in both JIDs and object-paths, but\n  that's easy. Base64 is unsuitable since the user part of a JID is\n  case-insensitive.\n\n* Everything else containing a dot is reserved for future expansion.\n\n* The object ID inside PS is one of xmpp/some.jid@example.com (as\n  currently, used for \"foreign\" and unidentifiable buddies),\n  keyid/hexhexhexhex (for an unprefixed key, deprecated), or\n  keyid/prefix/whateverwhatever (for a key with that prefix, e.g.\n  keyid/sha1/hexhexhexhex).\n\n* When coalescing contacts into buddy objects we assume the buddy will\n  rarely be visible on more than one server at the same time with different\n  key-hash algorithms, so continue to treat the key-hash as a unique ID.\n  The failure mode if this assumption fails is that there might be two\n  Buddy objects in the mesh representing the same person, but the PS as it\n  exists at the moment will never cause this (it only ever connects to\n  one server at a time), so I don't think we need to care.\n\n* When we discover a buddy's full key, we hash it repeatedly, and add\n  their Buddy object to the dict PresenceService._buddies once per known\n  hash/encoding algorithm. Note that on Salut (link-local) we expect to either\n  have someone's full key, or discover that they don't have a key, before we\n  can interact with them at all.\n\n* The server component that does the key-based authentication (which\n  we haven't written yet) always has to be upgraded earlier than the XOs are,\n  so it will let new XOs register with new hash/encoding algorithms.\n\n* After the XO registers on the server, instead of storing a boolean\n  \"registered\", it stores the JID it used. In future, it'll always log\n  in with that JID.\n\n* Should there be a process by which XOs whose JIDs use a weak hash try to\n  upgrade to a better hash, by creating a new account? If so, we can avoid\n  the \"two Buddies\" issue by making sure we log out of the old account\n  before attempting to create the new one; if creation fails we can log\n  back in as the old account.\n\n* When looking up a buddy by complete public key, we try all\n  non-obsolete hash/encoding algorithms (so there's value in keeping the\n  number supported as small as possible).\n\nRegards,\n\tSimon\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\nComment: OpenPGP key: http://www.pseudorandom.co.uk/2003/contact/ or pgp.net\n\niD8DBQFGXt5fWSc8zVUw7HYRAsP0AKCRsVtq8agbG0Pqj4DKtAWCkZdv4ACg6rOM\nsbC1C9sdGt4Nkz02HlF1om4=\n=a1SH\n-----END PGP SIGNATURE-----\n_______________________________________________\nSugar mailing list\nSugar@lists.laptop.org\nhttp://lists.laptop.org/listinfo/sugar\n\n"}