{"category": "ham", "to_address": "<r-help@stat.math.ethz.ch>", "from_address": "\"Izmirlian, Grant \\(NIH/NCI\\) [E]\" <izmirlig@mail.nih.gov>", "subject": "[R]  LME: internal workings of QR factorization --repost", "body": "\nHi:\n\nI've been reading \"Computational Methods for Multilevel Modeling\" by Pinheiro and Bates, \nthe idea of embedding the technique in my own c-level code. The basic idea is to rewrite \nthe joint density in a form to mimic a single least squares problem conditional upon the \nvariance parameters.  The paper is fairly clear except that some important level of detail \nis missing. For instance, when we first meet Q_(i):\n\n/                    \\                  /                                 \\\n| Z_i     X_i   y_i  |                  | R_11(i)     R_10(i)     c_1(i)  |\n|                    | =         Q_(i)  |                                 |\n| Delta   0     0    |                  |   0         R_00(i)     c_0(i)  |\n\\                    /                  \\                                 /\n\nthe text indicates that the Q-R factorization is limited to the first q columns of the \naugmented matrix on the left.  If one plunks the first q columns of the augmented matrix \non the left into a qr factorization, one obtains an orthogonal matrix Q that is (n_i + q) x q \nand a nonsingular upper triangular matrix R that is q x q.  While the text describes R as a \nnonsingular upper triangular q x q, the matrix Q_(i) is described as a square (n_i + q) x (n_i + q) \northogonal matrix.  The remaining columns in the matrix to the right are defined by applying \ntranspose(Q_(i)) to both sides.  The question is how to augment my Q which is orthogonal (n_i + q) x q  \nwith the missing (n_i + q) x n_i portion producing the orthogonal square matrix mentioned in the text?  \nI tried appending the n_i x n_i identity matrix to the block diagonal, but this doesn't work as the \nresulting likelihood is insensitive to the variance parameters.\n\nGrant Izmirlian\nNCI\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}