{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 11, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESArmy Extends Tours For Active-Duty Troops\nBeginning immediately, all active-duty Army soldiers in Iraq and Afghanistan will serve 15-month tours. three months longer\n                        than usual. \"This policy is a difficult but necessary interim step,\" Defense Secretary Robert Gates said. More...Watch: Bush: Clock Ticking In Iraq\n• All Duke Lacrosse Charges Dropped\n                     \t\t\t\t\t| Watch• Fred Thompson Has Cancer\n                     \t\t\t\t\t| Watch• Walter Reed Woes Blamed On Money, NeglectU.S.11-Year-Old Rescues Toddler From Coyote\nA Middletown 11-year-old is a hero for helping save his toddler nephew from being mauled by a coyote in his family's backyard.\n                        State wildlife officials say it could be the first coyote attack on a human in New Jersey.  More...\n• All Duke Lacrosse Charges Dropped\n                     \t\t\t\t\t| Watch• Two Major Sponsors Drop Imus\n                     \t\t\t\t\t| Watch• Spy Chief Seeks More Surveillance Power• More StoriesWorldChinese Ban \"Chinglish\" For Olympics\nLooking forward to a big, money-spending international crowd for the 2008 Beijing Olympics, city officials have banned the\n                        use of lousy English. \"Chinglish,\" as it's known, will be against the rules on signs and in taxis. More...\n• Marines Probed In Afghan Civilian Deaths• Al Qaeda Claims Deadly Algeria Blasts\n                     \t\t\t\t\t| Watch• U.S.: Iran Training Iraqi Bombers\n                     \t\t\t\t\t| Watch• More StoriesPoliticsFred Thompson Has Cancer\nFred Thompson, the potential presidential candidate better known as television's gruff \"Law & Order\" district attorney, said\n                        Wednesday he was diagnosed with lymphoma more than two years ago but the cancer shouldn't affect his life expectancy. More...Watch: GOP Not Optimistic About '08\n• Pure Horserace: Talking To His Base• Walter Reed Woes Blamed On Money, Neglect• McCain: Iraq War  \"Necessary And Just\"\n                     \t\t\t\t\t| Watch• More StoriesHealthDiabetes Complications Cost Billions\nThe cost of treating the complications of diabetes averages $10,000 per patient per year, a new study shows. More...Watch: Stem Cells May Help Diabetics\n• Walter Reed Woes Blamed On Money, Neglect• Alleviate Your Pet's Allergies\n                     \t\t\t\t\t| Watch• New Bug-Virus Flu Vaccine Works• More StoriesSciTechTasmanian Devils In Danger\nTasmanian devils - the marsupials made famous as a snarling cartoon character named Taz - are being relocated to an island\n                        off Australia to avert their extinction by a contagious cancer. More...\n• Microsoft Patches Security Holes• Study: NYC A Top Greenhouse Gas Producer• A Lesson In Copyright Law\n                     \t\t\t\t\t| Watch• More StoriesBusinessFed Chairman: No New Regs For Hedge Funds\nThe Federal Reserve Chairman disputed critics who say recent failures among hedge funds mean that increased government regulation\n                        is required.  The current system has worked well, Ben Bernanke told a conference on global economics. More...\n• Another Settlement In Student Loan Probe• Citigroup To Ax 17,000 Jobs• Why It Doesn't Pay To Buy Travel Insurance• More StoriesEntertainmentSinger Willa Ford To Play Anna Nicole\nPop singer Willa Ford will play Anna Nicole Smith in an upcoming independent film about the late actress' life. Like Smith,\n                        Ford was a playboy model and reality TV star. More...Watch: Anna Nicole Secrets Revealed\n• Birkhead Says It's Like He Won The Oscar\n                     \t\t\t\t\t| Watch• Madonna, Timberlake Team Up On Her Album\n                     \t\t\t\t\t| Watch• Leeza Gibbons Booted From \"Dancing\"• More StoriesOpinion\"Old Line State\" Blazes New Trails\nMaryland's General Assembly is advancing a flurry of progressive legislation that Congress won't touch but other states are\n                        copying. The Nation writes that it is important to remember change does not have to originate inside the Beltway. More...\n• Media Takes Aim At McCain\n                     \t\t\t\t\t| Watch• No Longer Just Child's Play• Poll: Doubts About McCain's View Of Iraq\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Books: Smith's Sister: Anna Wanted My Daughter\nAnna Nicole Smith's half-sister, Donna Hogan, wrote a book called \"Train Wreck: The Life and Death of the Anna Nicole Smith\"\n                        in which she reveals disturbing details of the former model's life. More...Watch: Anna Nicole Secrets Revealed\n• EARLY SHOW: Wedding Gowns For Pregnant Brides• U.S.: Hiker Well 4 Surgeries After Lion Attack\n                     \t\t\t\t\t| Watch• EARLY SHOW: Tell Us About A Time Mom Stood Up For You\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nDuke Lacrosse Charges DroppedNorth Carolina's attorney general announced that all charges against three Duke lacrosse players accused of kidnapping and\n                                    sexually assaulting an exotic dancer have been dropped. Karen Brown reports.\nTOP VIDEOS\nWar Funding Bill Stalemate\nDuke Lacrosse Players Cleared\nFirst Look: Duke Rape Case\n23 Die In Algeria Bombings\nElephant Water Fight\nMcCain Defends Iraq Strategy\nDuke Charges Set To Be Dropped\nWar Vets Soothed By Yoga\nCouple Battles Mountain Lion\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesJohn McCain talks to Scott Pelley about his presidential campaign, Iraq, and that controversial Baghdad market visit.\n                           Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryThe Ghost Of David Coffin:A businessman is murdered, his body and the evidence burned in an inferno. Ten years\n                           after the crime, will justice be served? \n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}