{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Gene Collins\" <collins@gene3.ait.iastate.edu>", "subject": "Re: heretical thoughts was Re: Speakup dropped from Ubuntu ", "body": "\n>I'm not qualified to comment on the technical merits of a kernel vs. a \n>user-space solution, but I know that from a maintenance point of view we \n>would prefer it.\n>\nWell, you haven't told us how Speakup adds to your mainttenance\nproblems.  I mean  the only thing extra you are doing is running a\ncheckout script, in order to patch speakup into the kernel.  After that,\nyou are just doing a make oldconfig with the .config file from your most\nrecent kernel.  What you have to understand about accessibility is that\nit often requires a set of tools to do a job, not necessarily just one.\n\nThe problem with having only software synthesis on the system is that\nwhen there is a problem, the software synthesis is often the first\nthing to stop functioning.  It's like having the monitor become suddenly\nunavailable for a sighted person, just when they need it the most.  If\nwe gave sighted folks a video driver which was the first thing to stop\nfunctioning when the system had a problem, you'd hear howls of outrage. \nBut when blind folks ask for a solution like speakup and a hardware\nsynthesizer which will function even during a kernel panic sometimes,\nsighted folks seem to have real trouble understanding the need for\nreliable access.\n\nI don't recall seeing any requests here from Ubuntu folks for help with\nmaintenance issues for Speakup.  It appears to me that what we have here\nis a group of sighted folks who don't use the technology making\ndecissions about what blind folks need or don't need, want or don't\nwant.  In my view, that's inappropriate.\n\nIf Speakup is dropped from Ubuntu, then I may just have to go back to\nusing Debian.  I can deal with the lack of a gui interface, because most\nthings I need to do, I can do from a text console.  I can't deal with a\ngui only interface which only has parts of itself accessible, and that\nsometimes at the whim of a developer.  No, you can't get in to my tool\nbox and try to tell me I don't need the 1 quarter inch socket set.  When\nit's necessary, it's necessary.\n\nI make my living as a computer consultant.  It will be to bad if I'm\nforced to recomend that folks stay clear of Ubuntu because of it's lack\nof support for text console accessibility, but if that's the choice I'm\nforce to, then that's what I'll do.  I hope the folks managing Ubuntu\nwill reconsider their decission, but if not, all I can do is steer clear\nof distros that insist on causing me grieff.\n\nGene Collins\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}