{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "codejodler@gmx.ch", "subject": "Re: Best notebook", "body": "\n> IBM/Lenovo, any!\n\nIt would be nice to jointly focus on a couple of brands (say, three) and make the corp aware of a -then maybe siginificant- linux customer base.\n \nLenovo would be a good candiadate, but that's still the IBM heritage (including the IBM involvement into kernel devel and linux cluster tech)-  nobody knows the longterm chinese policies. Or do you ? \nAnother one would probably be HP. How about a third one ? Smaller oners (in market share) like Asus or Samsung ? \n\nAnyone bying a notebook for linux could drop a mail notification to the main support center...but you know, maybe even if they would be able to collect the info somehow, most probably they would not even try. \nWhat would be necessary, is a precompiled list of (anonymized) byers. Somehow trusted (maybe by your spam catching mail address? Or your full name ?) Some bit of marketing information (like country and business area or private usage) should be included, as a hook, to have them store the list, or look at it at all. Could be done by website with linux counter table with brand, model.\n\nIn fact, that should be rather done by the marketing section of the brand itself, and indeed they may very well have something similar already.  Of course they got the general selling figures. But most probably they miss the feature 'what OS do you intend (or succeed ;) to run'. So, straight way is to get them setup such a site and then publsih the link on linux lists likie this one. \n\nAnd yes this is also the kernel.org folks task, and probably they got some experience in this. But you can't leave anything to them. They have no dedicated position for such a marketing thing. You know this clubs point of view, originally rooted in Linus attitude. (Did he change his mind meeanwhile?) They make the kernel, nothing else. I think it prooved a good one.\n\n\nLaptop end users are a good additional starting point. To strike them from different sides ;) The linux community exists, and it works that way. \n\n\n-- \n\"Feel free\" - 10 GB Mailbox, 100 FreeSMS/Monat ...\nJetzt GMX TopMail testen: http://www.gmx.net/de/go/topmail\n\n\n-- \nTo UNSUBSCRIBE, email to debian-laptop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}