{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Mcintosh N. Agnes\" <zqk@allidaho.com>", "subject": "If the C standard committe adopts these functions, then I'll consider using them, but until then, I just don't see significant gain.", "body": "\n\n\n\n\n\n\nJeremy Andrews:  Are binary blobs a new problem, or is this a problem\nthat has existed for a long time?\nJonathan Gray: Lack of hardware documentation and drivers without source\ncode have been problems for quite some time. Indeed, all network drivers\nin OpenBSD have a very similar structure making it easy to borrow code\nfrom one driver to another. They  won't be sponsoring any hackathons,\nbut I can probably get them to  either buy CDs or donate the equivalent\ncash. Community reaction: Jeremy Andrews:  What has the reaction from\nother free and open source operating system projects been?\nAnd if the company goes out of business or decides they can no longer be\nbothered what then?\nsorry to be so blunt, the argument is stupid. I started to play with\nwireless devices about two years ago. Some people thought that the tie\nbetween OpenBSD and OpenSSH is the problem, and thus they would not\ndonate.\nstrncpy may not properly null-terminate in all cases, but at least it\ngets the information leakage issue right. Just the standard OpenBSD\nproactive auditing process.\nSince you are admitting this publicly, I guess it only stands to reason\nthat you have come to believe and accept that you are stupid.\nJonathan Gray: I'm a student at La Trobe university in Melbourne\nAustralia, working part time writing software for solar regulators at\nPlasmatronics. Jonathan Gray: I am not familiar with the exact arguments\ntheir lawyers use off hand. That's exactly why I don't waste time being\nnice to you, Theo.\nWhy the hell can't you debug Matrox Parhelia display drivers? strncpy\nmay not properly null-terminate in all cases, but at least it gets the\ninformation leakage issue right. Damien Bergamini:  Drivers are\nimportant for an operating system.\n\n\n"}