{"category": "ham", "to_address": "\"avcavc\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"AccuWeather.com Alert\" <inbox@messaging.accuweather.com>", "subject": "AccuWeather.com Alert(tm) Advisory  (avcavc)", "body": "\n\nAccuWeather.com Alert[TM]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSevere Watches and Warnings for BEVERLY HILLS \n\n\n\n\n\n\n\n\n\n\n\n\n\nLOXCFWLOX\r\nWHUS46 KLOX 262126\r\nCFWLOX\r\n\nCOASTAL HAZARD MESSAGE\r\nNATIONAL WEATHER SERVICE LOS ANGELES/OXNARD CA\r\n226 PM PDT THU APR 26 2007\r\n\n..HIGH SURF EXPECTED ON EXPOSED WEST FACING SHORES...\r\n\nHIGH SURF WILL CONTINUE AND STRONG RIP CURRENTS WILL PERSIST\r\nTHROUGH THIS EVENING ALONG EXPOSED WEST FACING\r\nSHORES. THIS LARGE NORTHWEST SWELL WILL BRING THE HIGHEST SURF\r\nCONDITIONS TO THE COASTAL AREAS OF SAN LUIS OBISPO AND WESTERN SANTA\r\nBARBARA COUNTIES. DUE TO THE LONGER PERIOD OF THE SWELL...SOME OF\r\nTHIS ENERGY WILL SPREAD INTO THE INNER COASTAL WATERS...RESULTING\r\nIN HIGHER THAN NORMAL SURF CONDITIONS ACROSS WEST FACING BEACHES\r\nOF LOS ANGELES AND VENTURA COUNTIES THROUGH THIS EVENING.\r\n\nCAZ034-035-270330-\r\n/O.CON.KLOX.SU.Y.0007.000000T0000Z-070427T0400Z/\r\nSAN LUIS OBISPO COUNTY CENTRAL COAST-\r\nSANTA BARBARA COUNTY CENTRAL COAST-\r\n226 PM PDT THU APR 26 2007\r\n\n..HIGH SURF ADVISORY REMAINS IN EFFECT UNTIL 9 PM PDT THIS\r\nEVENING...\r\n\nA HIGH SURF ADVISORY REMAINS IN EFFECT UNTIL 9 PM PDT THIS EVENING.\r\n\nBREAKERS BETWEEN 10 AND 13 FEET WILL CONTINUE THROUGH THIS\r\nEVENING...WITH HIGHEST SURF CONDITIONS ON WEST AND NORTHWEST\r\nFACING BEACHES.\r\n\nA HIGH SURF ADVISORY MEANS THAT HIGH SURF WILL AFFECT BEACHES IN THE\r\nADVISORY AREA...PRODUCING STRONG RIP CURRENTS AND LOCALIZED BEACH\r\nEROSION. ALL PERSONS SHOULD BE AWARE OF THE RISKS ASSOCIATED WITH\r\nWATER RELATED ACTIVITIES AND USE EXTREME CAUTION WHEN ENTERING THE\r\nOCEAN. WHEN IN DOUBT...JUST STAY OUT.\r\n\n$$\r\n\nCAZ040-041-270330-\r\n/O.EXT.KLOX.CF.S.0006.000000T0000Z-070427T0400Z/\r\nVENTURA COUNTY COAST-\r\nLOS ANGELES COUNTY COAST INCLUDING DOWNTOWN LOS ANGELES-\r\n226 PM PDT THU APR 26 2007\r\n\n..HIGHER THAN NORMAL SURF EXPECTED TO CONTINUE...\r\n\nHIGHER THAN NORMAL SURF EXPECTED TO PERSIST AT THE LOS ANGELES AND\r\nVENTURA COUNTY BEACHES THROUGH THIS EVENING. BREAKERS BETWEEN\r\n4 AND 6 FEET WILL BE COMMON ACROSS WEST FACING BEACHES OF LOS\r\nANGELES AND VENTURA COUNTIES THROUGH THURSDAY AFTERNOON...WITH\r\nLOCALLY HIGHER SETS LIKELY ACROSS WELL EXPOSED AREAS.\r\n\nTHE HIGHER THAN NORMAL SURF CONDITIONS WILL LIKELY PRODUCE STRONG\r\nRIP CURRENTS. ALL PERSONS SHOULD BE AWARE OF THE RISKS ASSOCIATED\r\nWITH WATER RELATED ACTIVITIES AND USE EXTREME CAUTION WHEN ENTERING\r\nTHE OCEAN. WHEN IN DOUBT...JUST STAY OUT.\r\n\n$$\r\n\nSWEET\n\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChoose another forecast:\n\t\t\t\t\t\t\t\t\t\tEnter a zipcode, or a city, state\n  \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n©2007\n\t\t\t\t\t\t\tAccuWeather, Inc. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}