{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Ben Finney <bignose+hates-spam@benfinney.id.au>", "subject": "Re: CC Sampling Plus 1.0", "body": "\"Miriam Ruiz\"  writes:\n\n> Would you think the license CC Sampling Plus 1.0 from Creative\n> Commons would be DFSG-Free?\n>\n> http://creativecommons.org/licenses/sampling+/1.0/\n> http://creativecommons.org/licenses/sampling+/1.0/legalcode\n\nWhen discussing a license text it's useful to quote the entire text in\nthe thread, so that it's easily accessible from the archives in the\ncontext of the discussion.\n\n=====\nCreative Commons Legal Code\n\nSampling Plus 1.0\n\nCREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE\nLEGAL SERVICES. DISTRIBUTION OF THIS LICENSE DOES NOT CREATE AN\nATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\nINFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES\nREGARDING THE INFORMATION PROVIDED, AND DISCLAIMS LIABILITY FOR\nDAMAGES RESULTING FROM ITS USE.\n\nLicense\n\nTHE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS\nCREATIVE COMMONS PUBLIC LICENSE (\"CCPL\" OR \"LICENSE\"). THE WORK IS\nPROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE\nWORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE OR COPYRIGHT LAW IS\nPROHIBITED.\n\nBY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND\nAGREE TO BE BOUND BY THE TERMS OF THIS LICENSE. THE LICENSOR GRANTS\nYOU THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF\nSUCH TERMS AND CONDITIONS.\n\n1. Definitions\n\n   a. \"Collective Work\" means a work, such as a periodical issue,\n   anthology or encyclopedia, in which the Work in its entirety in\n   unmodified form, along with a number of other contributions,\n   constituting separate and independent works in themselves, are\n   assembled into a collective whole. A work that constitutes a\n   Collective Work will not be considered a Derivative Work (as\n   defined below) for the purposes of this License.\n\n   b. \"Derivative Work\" means a work based upon the Work or upon the\n   Work and other pre-existing works, such as a translation, musical\n   arrangement, dramatization, fictionalization, motion picture\n   version, sound recording, art reproduction, abridgment,\n   condensation, or any other form in which the Work may be recast,\n   transformed, or adapted, except that a work that constitutes a\n   Collective Work will not be considered a Derivative Work for the\n   purpose of this License.\n\n   c. \"Licensor\" means the individual or entity that offers the Work\n   under the terms of this License.\n\n   d. \"Original Author\" means the individual or entity who created the\n   Work.\n\n   e. \"Work\" means the copyrightable work of authorship offered under\n   the terms of this License.\n\n   f. \"You\" means an individual or entity exercising rights under this\n   License who has not previously violated the terms of this License\n   with respect to the Work, or who has received express permission\n   from the Licensor to exercise rights under this License despite a\n   previous violation.\n\n2. Fair Use Rights. Nothing in this license is intended to reduce,\n   limit, or restrict any rights arising from fair use, first sale or\n   other limitations on the exclusive rights of the copyright owner\n   under copyright law or other applicable laws.\n\n3. License Grant & Restrictions. Subject to the terms and conditions\n   of this License, Licensor hereby grants You a worldwide,\n   royalty-free, non-exclusive, perpetual (for the duration of the\n   applicable copyright) license to exercise the rights in the Work as\n   stated below on the conditions as stated below:\n\n   a. Re-creativity permitted. You may create and reproduce Derivative\n   Works, provided that:\n\n         i. the Derivative Work(s) constitute a good-faith partial or\n         recombined usage employing \"sampling,\" \"collage,\" \"mash-up,\"\n         or other comparable artistic technique, whether now known or\n         hereafter devised, that is highly transformative of the\n         original, as appropriate to the medium, genre, and market\n         niche; and\n\n         ii. Your Derivative Work(s) must only make a partial use of\n         the original Work, or if You choose to use the original Work\n         as a whole, You must either use the Work as an insubstantial\n         portion of Your Derivative Work(s) or transform it into\n         something substantially different from the original Work. In\n         the case of a musical Work and/or audio recording, the mere\n         synchronization (\"synching\") of the Work with a moving image\n         shall not be considered a transformation of the Work into\n         something substantially different.\n\n   b. You may distribute copies or phonorecords of, display publicly,\n   perform publicly, and perform publicly by means of a digital audio\n   transmission, any Derivative Work(s) authorized under this License.\n\n   c. Prohibition on advertising. All advertising and promotional uses\n   are excluded from the above rights, except for advertisement and\n   promotion of the Derivative Work(s) that You are creating from the\n   Work and Yourself as the author thereof.\n\n   d. Noncommercial sharing of verbatim copies permitted.\n\n         i. You may reproduce the Work, incorporate the Work into one\n         or more Collective Works, and reproduce the Work as\n         incorporated in the Collective Works. You may distribute\n         copies or phonorecords of, display publicly, perform\n         publicly, and perform publicly by means of a digital audio\n         transmission the Work including or incorporated in Collective\n         Works.\n\n         ii. You may not exercise any of the rights granted to You in\n         the paragraph immediately above in any manner that is\n         primarily intended for or directed toward commercial\n         advantage or private monetary compensation. The exchange of\n         the Work for other copyrighted works by means of digital\n         file-sharing or otherwise shall not be considered to be\n         intended for or directed toward commercial advantage or\n         private monetary compensation, provided there is no payment\n         of any monetary compensation in connection with the exchange\n         of copyrighted works.\n\n   5. Attribution and Notice.\n\n         i. If You distribute, publicly display, publicly perform, or\n         publicly digitally perform the Work or any Derivative Works\n         or Collective Works, You must keep intact all copyright\n         notices for the Work and give the Original Author credit\n         reasonable to the medium or means You are utilizing by\n         conveying the name (or pseudonym if applicable) of the\n         Original Author if supplied; the title of the Work if\n         supplied; to the extent reasonably practicable, provide the\n         Uniform Resource Identifier, if any, that Licensor specifies\n         to be associated with the Work or a Derivative Work, unless\n         such Uniform Resource Identifier does not refer to the\n         copyright notice or licensing information for the Work; and\n         in the case of a Derivative Work, provide a credit\n         identifying the use of the Work in the Derivative Work (e.g.,\n         \"Remix of the Work by Original Author,\" or \"Inclusion of a\n         portion of the Work by Original Author in collage\"). Such\n         credit may be implemented in any reasonable manner; provided,\n         however, that in the case of a Derivative Work or Collective\n         Work, at a minimum such credit will appear where any other\n         comparable authorship credit appears and in a manner at least\n         as prominent as such other comparable authorship credit.\n\n         ii. You may distribute, publicly display, publicly perform or\n         publicly digitally perform the Work only under the terms of\n         this License, and You must include a copy of, or the Uniform\n         Resource Identifier for, this License with every copy or\n         phonorecord of the Work or Derivative Work You distribute,\n         publicly display, publicly perform, or publicly digitally\n         perform. You may not offer or impose any terms on the Work\n         that alter or restrict the terms of this License or the\n         recipients' exercise of the rights granted hereunder. You may\n         not sublicense the Work. You must keep intact all notices\n         that refer to this License and to the disclaimer of\n         warranties. You may not distribute, publicly display,\n         publicly perform, or publicly digitally perform the Work with\n         any technological measures that control access of use of the\n         Work in a manner inconsistent with the terms of this\n         License. The above applies to the Work as incorporated in a\n         Collective Work, but this does not require the Collective\n         Work apart from the Work itself to be made subject to the\n         terms of this License. Upon notice from any Licensor You\n         must, to the extent practicable, remove from the Derivative\n         Work or Collective Work any reference to such Licensor or the\n         Original Author, as requested.\n\nThe above rights may be exercised in all media and formats whether now\nknown or hereafter devised. The above rights include the right to make\nsuch modifications as are technically necessary to exercise the rights\nin other media and formats. All rights not expressly granted by\nLicensor are hereby reserved.\n\n4. Disclaimer\n\nUNLESS SPECIFIED OTHERWISE BY THE PARTIES IN A SEPARATE WRITING,\nLICENSOR OFFERS THE WORK AS-IS AND MAKES NO REPRESENTATIONS OR\nWARRANTIES, EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION,\nWARRANTIES OF TITLE, MERCHANTIBILITY, FITNESS FOR A PARTICULAR\nPURPOSE, NONINFRINGEMENT, OR THE ABSENCE OF LATENT OR OTHER DEFECTS,\nACCURACY, OR THE PRESENCE OR ABSENCE OF ERRORS, WHETHER OR NOT\nDISCOVERABLE.\n\n5. Limitation on Liability.\n\nIN NO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY LEGAL THEORY FOR ANY\nSPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR EXEMPLARY DAMAGES\nARISING OUT OF THIS LICENSE OR THE USE OF THE WORK, EVEN IF LICENSOR\nHAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n6. Termination\n\n   a. This License and the rights granted hereunder will terminate\n   automatically upon any breach by You of the terms of this\n   License. Individuals or entities who have received Derivative Works\n   or Collective Works from You under this License, however, will not\n   have their licenses terminated provided such individuals or\n   entities remain in full compliance with those licenses. Sections 1,\n   2, 4, 5, 6, and 7 will survive any termination of this License.\n\n   b. Subject to the above terms and conditions, the license granted\n   here is perpetual (for the duration of the applicable copyright in\n   the Work). Notwithstanding the above, Licensor reserves the right\n   to release the Work under different license terms or to stop\n   distributing the Work at any time; provided, however that any such\n   election will not serve to withdraw this License (or any other\n   license that has been granted under the terms of this License), and\n   this License will continue in full force and effect unless\n   terminated as stated above.\n\n7. Miscellaneous\n\n   a. Each time You distribute or publicly digitally perform the Work\n   or a Collective Work, the Licensor offers to the recipient a\n   license to the Work on the same terms and conditions as the license\n   granted to You under this License.\n\n   b. Each time You distribute or publicly digitally perform a\n   Derivative Work, Licensor offers to the recipient a license to the\n   original Work on the same terms and conditions as the license\n   granted to You under this License.\n\n   c. If any provision of this License is invalid or unenforceable\n   under applicable law, it shall not affect the validity or\n   enforceability of the remainder of the terms of this License, and\n   without further action by the parties to this agreement, such\n   provision shall be reformed to the minimum extent necessary to make\n   such provision valid and enforceable.\n\n   d. No term or provision of this License shall be deemed waived and\n   no breach consented to unless such waiver or consent shall be in\n   writing and signed by the party to be charged with such waiver or\n   consent.\n\n   e. This License constitutes the entire agreement between the\n   parties with respect to the Work licensed here. There are no\n   understandings, agreements, or representations with respect to the\n   Work, and with respect to the subject matter hereof, not specified\n   above. Licensor shall not be bound by any additional provisions\n   that may appear in any communication from You. This License may not\n   be modified without the mutual written agreement of the Licensor\n   and You.\n=====\n\n-- \n \\      \"If sharing a thing in no way diminishes it, it is not rightly |\n  `\\                   owned if it is not shared.\"  -- Saint Augustine |\n_o__)                                                                  |\nBen Finney\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}