{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Nation wide Service \" <q41cw9y7j@opalsplash.com>", "subject": "Use federal law to remove negative marks from your report ", "body": "    \n<!--WASHINGTON - Attorney General Alberto Gonzales confidently deflected House Democrats' demands Thursday for details in the firings of U.S. attorneys, appearing ever more likely to survive accusations that the dismissals were politically motivated. \n\nADVERTISEMENT\n \nRepublican lawmakers rushed to Gonzales' defense as the attorney general denied anew that the firings last year were improper.\n\nThe mostly muted five-hour hearing in front of the        House Judiciary Committee was a sharp contrast to Gonzales' sometimes testy appearance three weeks ago when Senate Republicans questioned his competence to run the Justice Department. One senator at that session joined a small GOP chorus saying he should step down.\n\n\"I will work as hard as I can, working with this committee and working with DOJ employees, to reassure the American people that this department is focused on doing its job,\" Gonzales said Thursday.\n\nThat did not satisfy exasperated Democrats, who accused Gonzales of being evasive.\n\n\"Your reputation is on the line, Mr. Attorney General. What do you have to say for yourself?\" asked Rep. Maxine Waters (news, bio, voting record), D-Calif., adding that the \"buck stops at the top.\"\n\n\"I accept responsibility,\" Gonzales answered.\n\n       President Bush steadfastly has stood by Gonzales, his longtime counselor and friend. Even career Justice Department staffers angered by the attorney general's response to the firings acknowledge Gonzales appears to have beaten back calls to leave.\n\nThe latest lawmaker to urge Gonzales to quit was Rep. Adam Schiff (news, bio, voting record), D-Calif. \"I hope you will resign because the department is broken and I don't think you're the one to fix it,\" Schiff told him.\n\nRepublicans sought to portray the controversy as losing steam. They pushed Democrats to wrap up the congressional probe that has dogged the department since the beginning of the year.\n\n\"The list of accusations has mushroomed, but the evidence of wrongdoing has not,\" said Rep. Lamar Smith (news, bio, voting record) of Texas, top Republican on the committee. \"If there are no fish in this lake, we should reel in our lines of questions, dock our empty boat and turn to more pressing issues.\"\n\nGonzales acknowledged low morale at the department. Career prosecutors have said it is stunting hiring. Private defense lawyers say it has led to government hesitation and indecisiveness in some courtrooms. Gonzales contended the department's independence is intact.\n\n\"Contrary to being gun shy, this process is somewhat liberating in terms of going forward,\" he said.\n\n--!>\n           \n\n\n\n"}