{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Troy Matthews\" <veccygnuxnos@cygnux.com>", "subject": "Watch the pounds disappear", "body": "\nMelt away fat easily\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most enchanting product for corpulent people is made available now – As were told on Oprah.\n\n\nCan you hold in your memory all the times when you said to yourself you would do anything for being saved from this quickly growing number of kilos? Luckily, now no major price is to be paid. With Anatrim, the ground-shaking pound-melting medley, you can get naturally health life style and a really slender figure. Just look at what our customers state!\n\n\n\n\"It’s rather difficult to acknowledge it but I was a junk food addict. \n\n\nI swallowed up all this garbige \n\n\nand was unable to stop. \n\n\n\n\nThis ruinous passion stopped after I started course of taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my inclination to eat constantly abated, \n\n\nspirits improved and I became the happiest person 28 pounds in 2.2 months. \n\n\n\n\nI can tell you now I turned to the happiest person on the planet!\"\n\n\n\n\n\nLinda F., New York\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nYou can't fancy how I hated being ridiculed at school. \n\n\n\n\nI detested my weight and I abhorred even myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nThis stuff literally pulled me out of this horrible nightmare! A plenty of thanks to you, guys.\"\n\n\n\n\n\nSteve Burbon, Chicago\n\n\n\n\n\n\"Do you know what? Thanks to Anatrim my marriage was happily saved! I got into this circle, depression – more eating – just more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOnce one of my friends pointed to your site and I called for pack of Anatrim at the same time. \n\n\nThe results were splendid, my appetite came to admissible level, I was often in a good mood, and, certainly, I tightened my belt with no regrets. And you see me, the bedroom became cool, too!\"\n\n\n\n\n\nFrancis\n\n\n\n\n There many and many sincere gratitudes delighted people leave after trying Anatrim. Don’t you wanna join the tens of thousands of slim clients and try this natural appetite-abating power boosting product now!\n\n\nDon’t lose your opportunity!\n\n\n\n\n"}