{"category": "spam", "to_address": "captains@flax24.uwaterloo.ca", "from_address": "\"Jonah Mock\" <kadfirstratemer@firstrate.com>", "subject": "Control your weight and appetite", "body": "\nObesity is dangerous, stop it\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most enchanting product for weighty people is now easily available – As shown on CNN.\n\n\nCan you recall all the times when you told yourself you would do anything to get rid of this desperately growing pounds of fat? Fortunately, now no major price is to be paid. With Anatrim, the ground-shaking weight-reducing blend, you can achieve healthier lifestyle and become really slimmer. Take a look at what our customers state!\n\n\n\n\"I hate to confess but I was an awful food addict. \n\n\nI greedily swallowed up all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis ruinous passion finished after I started course of taking Anatrim! \n\n\nGod,\n\n\n\n\n my appetite abated, \n\n\nmood improved and I’m the happiest person on the planet 21 pounds in 2.4 months. \n\n\n\n\nI can tell you now I’m the happiest person in the world!\"\n\n\n\n\n\nAmelia B., San Diego\n\n\n\n\n\n\"I had weight problems since I was a boy. \n\n\nIt’s pretty hard to imagine how I abhorred being derided at school. \n\n\n\n\nI hated my plumpness and I detested myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nIt literally took me out of this terrible nightmare! Lots of thanks to you, my friends.\"\n\n\n\n\n\nMike Brown, New York\n\n\n\n\n\n\"Know what? My marriage was saved thanks to Anatrim! I got into this circle, depression – eating more – more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nMy friend showed me web site and I ordered up my pack of Anatrim as soon as it was possible. \n\n\nThe results I achieved were magnficent, my appetite became normal, I was in good spirits oftener, and, certainly, I went some belt holes back. And you see me, the bed became cool also!\"\n\n\n\n\n\nKarl\n\n\n\n\n There many and many gratitudes delighted people leave after taking Anatrim. Don’t you wanna join the thousands and thousands of slender buyers and try this original appetite-reducing power boosting product now!\n\n\nDo not decline your opportunity!\n\n\n\n\nhttp://www.comav.hk/?g36875716A456D66337C7977743366776672777C6A797A666A717468w7umcfye\n"}