{"category": "ham", "to_address": "e-drug@healthnet.org, ip-health <ip-health@lists.essential.org>,\n   aidsdrugs@lists.riseup.net, thaifta lists <thaifta@lists.riseup.net>", "from_address": "Kannikar KIJTIWATCHAKUL <kakablue@yahoo.com>", "subject": "[Ip-health] Abbott wrong to target Thailand", "body": "EDITORIAL, Bangkok Post, 25 April 2007\n\nAbbott wrong to target Thailand\n\nThe latest offer by Abbott Laboratories to register\nsecond-line Aids drug Aluvia in Thailand if the\ngovernment drops its compulsory licence is a step in\nthe right direction. But the government should reject\nany offer that calls for dropping the compulsory\nlicence, which is a right guaranteed in the World\nTrade Organisation's agreement on Trade-Related\nAspects of Intellectual Property (TRIPS).\n\nIndeed, the government's decision to issue a\ncompulsory licence for Kaletra has already reaped\nbenefits, and not just for Thailand. Although Abbott\npulled registrations for Aluvia - a heat-stable form\nof Kaletra that does not require refrigeration - and\nsix other new drugs in Thailand, the company did\nreduce the price of both Kaletra and Aluvia for 45\nlow- and middle-income countries to $1,000 per-patient\nper year from $2,200 previously.\n\nThailand was included in this list of countries, but\nAbbott singled Thailand out by refusing to register\nAluvia here. In essence, the pharmaceutical giant was\nhoping to placate growing calls for an international\nboycott while still slapping Thailand for daring to\ntake advantage of a WTO agreement on intellectual\nproperty rights. The message to the rest of the world\nwas clear: Issue a compulsory licence, and be\npunished.\n\nBut Thai negotiators should accept no punishment from\nAbbott for issuing a compulsory licence. And that's\nwhat makes Abbott's latest offer unacceptable.\n\nFirst of all, Abbott will still refuse to register six\nnew drugs in Thailand to protest its use of the\ncompulsory licence. This is punishment enough. If Thai\npolicy-makers accept Abbott's latest price reduction\non Aluvia - which has been extended to Brazil, China,\nIndia and about 40 other countries with no such\npenalty - then it will have accepted the drug\ncompany's right to sanction the country for following\nan international agreement accepted by 150 WTO\nmembers.\n\nSecondly, if Thailand agrees to drop the compulsory\nlicence, it would be giving up a right guaranteed in\nthe TRIPS agreement, which could set a dangerous\nprecedent for future talks with drug companies.\n\nThailand should not have to apologise or give up\nrights guaranteed in international treaties for Abbott\nto register Aluvia and the six other drugs it\nwithdrew. To the contrary, the Thai government's\ndecision to issue compulsory licences has led to\ncheaper Aids drug prices around the world.\n\nThe issue is all about finding the cheapest drugs\navailable for poor patients. As the Public Health\nMinistry has repeated again and again, the Thai\ngovernment is not interested in seeking price\nreductions for rich patients who can afford to pay\n$2,200 per year for Kaletra or Aluvia. Policy-makers\nare simply trying to secure cheap prices only for Aids\npatients who can't afford the drugs and wouldn't buy\nthem anyway.\n\nIf Abbott wants to blame anyone for compulsory\nlicences, it can start pointing the finger at the\nWTO's 150 member governments, including the United\nStates, which agreed that developing countries should\nhave the right to use them. Indeed, TRIPS is the\nworld's foremost agreement on intellectual property\nrights. It's unacceptable for Abbott to scold Thailand\nabout intellectual property rights when the government\nhas complied with TRIPS throughout the process. Even\nWorld Health Organisation head Margaret Chan said\nThailand's compulsory licences were \"fully in line\nwith the TRIPS agreement.\"\n\nIf Abbott thinks otherwise, it should ask the US\ngovernment to file a complaint at the WTO's dispute\nsettlement body. If Abbott doesn't do that, it should\nnot expect Thailand or the rest of the world to follow\nthe company's own guidelines on intellectual property.\n\n\nAlthough Thai policy-makers courageously started this\ndiscussion on intellectual property rights, now the\ndebate must move beyond the country's borders. The WHO\nand other international bodies should make it clear\nwhere they stand.\n\nIf TRIPS is nothing more than empty promises, then it\nmust be reworked. If the majority of trading nations\noppose compulsory licensing, then it should be done\naway with altogether. Or if more conditions must be\nplaced on using compulsory licences, then by all means\nthey should be put in place.\n\nBut it's the height of hypocrisy for governments to\npass a ground-breaking agreement to expand drug access\nto poor patients, and then heap vitriol on a country\nthat actually tries to implement the deal.\n\n\nKannikar KIJTIWATCHAKUL (Kar)\nMobile 66-85-0708954\nkakablue@yahoo.com\n\n__________________________________________________\nDo You Yahoo!?\nTired of spam?  Yahoo! Mail has the best spam protection around\nhttp://mail.yahoo.com\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}