{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Morning HTML\" <cbsnews_weekday_morning_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 19, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIES9 Firefighters Killed In Charleston Blaze\nNine firefighters died in a blaze that swept through a furniture warehouse, the mayor of Charleston, S.C., said. Witnesses\n                        said the store's roof collapsed, throwing debris over about two-dozen rescue workers. Onlookers were hit with flying ash. More...Watch: 9 Firefighters Killed In Blaze\n• Iraqi Orphanage Nightmare\n                     \t\t\t\t\t| Watch• Iraq Blast Kills 61; U.S. Hunts Al Qaeda\n                     \t\t\t\t\t| Watch• Missing Mom's Son: \"Mommy's In The Rug\"\n                     \t\t\t\t\t| WatchU.S.At Least 5 Dead, 5 Missing In Texas Floods\nTorrential rains, as much as an inch every 15 minutes at one point, swept away mobile homes, cars, and people. A 5-year-old\n                        girl and her grandmother were killed, and the girl's 2-year-old sister is missing. Another 4-year-old also died. More...Watch: Flash Floods Kill 5\n• 9 Firefighters Killed In Charleston Blaze\n                     \t\t\t\t\t| Watch• Boy Killed By Black Bear In Utah• Missing Mom's Son: \"Mommy's In The Rug\"\n                     \t\t\t\t\t| Watch• More StoriesWorldIraqi Orphanage Nightmare\nIt was a shocking scene for U.S. soldiers to come across: barely alive young bodies strewn around a Baghdad orphanage. CBS\n                        News has obtained exclusive photographs of the scene, and Lara Logan spoke with some troops who were there. More...Watch: Orphans Left To Starve In Iraq\n• Iraq Blast Kills 61; U.S. Hunts Al Qaeda\n                     \t\t\t\t\t| Watch• Cuba's \"First Lady\" Dead At 77• Taliban Fighting Hard In South Afghanistan\n                     \t\t\t\t\t| Watch• More StoriesPoliticsPanel: Missing RNC E-Mails May Violate Law\nThe Bush administration may have committed \"extensive\" violations of a law requiring that certain records be preserved, said\n                        the House Oversight Committee's chairman, adding the panel will deepen its probe into the use of political e-mail accounts. More...\n• White House Conference Center Evacuated• Judge Orders Duke DA To Leave Duties• Antitrust Ruling Goes Against Investors• More StoriesHealthSplitting Pills May Help Medication Costs\nSplitting high-dose prescription tablets in half can provide relief from high drug costs without affecting health adversely,\n                        a University of Michigan study suggests. More...\n• Soy Compound May Bolster Women's Bones• Steep Drop In Death Among Diabetic Men• 111-Year-Old Cited As World's Oldest Man• More StoriesSciTechOil Industry Scales Back Expansion Plans \nA push from Congress and the White House for huge increases in biofuels, such as ethanol, is prompting the oil industry to\n                        scale back its plans for refinery expansions. That could keep gasoline prices high, possibly for years to come. More...\n• Space Station's Computers Seem A-OK• Wireless Technology Takes A Leap Forward• Global Pedophile Ring Busted\n                     \t\t\t\t\t| Watch• More StoriesBusinessBoeing Gets A Wing Up On The Competition\nWith better fuel efficiency and a roomier interior, the 787 \"Dreamliner\" is giving Boeing a wing up on the competition. Nancy\n                        Cordes reports on how the 787 could catapult Boeing past archrival Airbus for the foreseeable future. More...Watch: Boeing's 'Dreamliner'\n• Yahoo's Terry Semel Steps Down As CEO• Former Enron Broadband Exec Sentenced• Dubai Company Buys QE2 Ocean Liner • More StoriesEntertainmentMichael Jackson Settles $48M Lawsuit\nLawyers for Michael Jackson have settled a lawsuit brought by a New Jersey financial company that was seeking $48 million. More...Watch: Jackson Cleared Of Abuse\n• Julia Roberts Welcomes A Son• Gandolfini Goes From \"Soprano\" To Iraq• Columnist Claudia Cohen Dead At 56• More StoriesOpinionFatah's Fall\nThe New Republic says that with the rise of Hamas in Gaza, the Bush administration must alter its tactics and make\n                        a more concerted effort for peace in the Middle East.  More...Watch: Escaping Hamas-Ruled Gaza\n• Lieberman Takes Heat For Iran Warnings\n                     \t\t\t\t\t| Watch• Andy's Personality Quiz\n                     \t\t\t\t\t| Watch• Maybe There Should Be A Third Party\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Health: New Web Site Rates Hundreds Of Sunscreens\nThe Environmental Working Group tells how well they ward off various harmful rays. The EWG's research head explained, on The\n                        Early Show. More...\n• CBS Evening News: Iraqi Orphanage Nightmare\n                     \t\t\t\t\t| Watch• CBS Evening News: The Perfect Alibi\n                     \t\t\t\t\t| Watch• CBS Evening News: Boeing Gets A Wing Up On The Competition\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nIraq's Hidden ShameU.S. troops were shocked to discover more than 20 starving children at a government-run orphanage in Baghdad. Lara Logan reports.\nTOP VIDEOS\nFire Lieutenant On S.C. Fire\n9 Firefighters Killed In Blaze\nFlash Floods Kill 5\nMoneyWatch\nHealthWatch\nTexas Deluge Finally Receding\nOrphans Left To Starve In Iraq\nStuck In No-Man's Land\nWeb Site Shows Man's Life 24/7\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMorley Safer talks to long-driving, hard-drinking golfer John Daly. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMurder On Lockhart Road:A mother and two kids are murdered. There are bizarre clues, eyewitnesses, blood drops,\n                           and a killer with a foot fetish. Saturday, 9 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}