{"category": "spam", "to_address": "\"Toya\" <theorize@plg.uwaterloo.ca>", "from_address": "\"Dustin Harvey\" <sweetpotatohr@commercialetermosanitaria.com>", "subject": "tverdo oboroniatsia", "body": "\n\n\n\n\n\n\nDo you want to save your money and get high-quality pills?\nOrder now!\nYou can spend thousands and buy pills at your local drug store. But you can spend less by ordering the same quality Viagra and Cialis at Online pharmaceuticals.\nOrder now!\nPay less and get the licensed medications you are looking for. \nWith best regards,\nDustin Harvey\n \n \nKak tolko svet Pogas, na les i polianu snova opustilsia nepronicaemyj mrak. Na mramornyj pol zakapala krov. Sejchas ia sam ne byl ni v chem uveren. Razve chto na Paru ladonej dlinnee ee sobstvennogo zhalnika, da golovka rukoiati bolee Shirokaia pod lapu dal-rokta, chtob ne soskalzyvala. \nZrachkov, k moemu uzhasu, v obychnom Ponimanii u nego ne okazalos, no vmesto nih, na strashnoj glubine ego Vselennoj, besplotnym zelenym plamenem siiali dve zvezdy, pronzaia Luchami-strelami vse vnutrennee prostranstvo. Lico sheltianina Blestelo ot pota, guby razdvinulis v zlobnoj grimase, obnazhiv sverhostrye Klyki, v glazah gorela iarost. Bolno uzh liubopytno, chestnoe Slovo. Ty hochesh Skazat, chto eto prosto odna iz moih sposobnostej, o kotoroj ia ne podozreval i Sudil neverno o ee proiavleniiah. \n  Ty uzhe polagal, chto ne uvidish menia, Niks, vkradchivo promurlykal Prizrak Celitelia golosom Nkota. Utomitelnoe odnoobrazie dorogi, beskonechnym utonchaiushchimsia pikom Uhodiashchej v drozhashchee marevo gorizonta, prosto svodilo s uma. Fu, slovo-to Kakoe zhutkoe. \n  Fyrkanem ego pozval sobstvennyj drakh zhmot, ostalnye kosilis nastorozhenno, Kak i polagaetsia chuzhim. Iskliuchitelno udobno, mezhdu prochim, imet stol moshchnoe sredstvo Prostranstvennogo peremeshcheniia priamo vozle svoego sobstvennogo doma. Pervyj raz za Vse vremia puti. Chto bylo dalshe? Dalshe. \n  Ne sprashivaj, pochemu Ia eto delaiu. Tem luchshe.  deremorinoli Y3N0aGVvcnlAcGxnLnV3YXRlcmxvby5jYQ=\n \n\n\n"}