{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CNN Student News <CNNStudentNews@cnn.com>", "subject": "April 20, 2007", "body": "CNN.com Student News Newsletter\n\n\n\n\n\n\n \nFriday, April 20, 2007 \n\n\n\n Watch and Learn\nOur last broadcast of the week reports on the controversy surrounding the firings of eight U.S. attorneys, and we bring you the attorney general's testimony about the matter to a Senate committee. We also review the week's top stories.\nSunday is Earth Day, and we want to know what you're doing to mark the occasion. Teachers, you can send us an I-Report on your conservation efforts at CNN.com/EDUCATION.\n\n Student loan probe pushing Congress to act\nA developing scandal over ties between the student loan industry and college financial aid officers is adding momentum to a congressional push to overhaul the system for college loans. Members of Congress say new rules, being pushed by New York Attorney General Andrew Cuomo, on how loan companies deal with campuses should be applied nationwide. \n\n April 23, 2007 - Happiness and Your Health\nIn Happiness and Your Health, CNN senior medical correspondent Dr. Sanjay Gupta joins the eternal search for happiness. Talking with doctors, philosophers, teachers, business leaders and comedians, Dr. Gupta asks where happiness comes from, how to get it and whether people need it. Teachers: You may want to preview this program, as it contains a discussion about non-depressed people using antidepressants that may be inappropriate for some viewers. Record the commercial-free CNN Classroom Edition every Monday between 4:00 am and 5:00 am ET. Educational materials for the episodes are available at CNN.com/EDUCATION. Please note that CNN Classroom Edition may be pre-empted at any time for coverage of breaking news.\n\n Week of April 16\n1. Jackie Robinson 2. Atlanta, Georgia3. Jon Corzine4. Virginia Tech University5. Second Amendment6. Baghdad7. Alberto Gonzales 8. The Dow Jones9. Micro-turbines10. Earth DayAccess this week's Newsquiz here!\n\n\n\n\n \nCNN Student News is a 10-minute, commercial-free news program that airs on CNN Headline News at 3:12 a.m. EST as well as on CNN.com/EDUCATION. Created by a team of journalists and educators, the program provides the top stories of the day, segments that encourage student participation, and in-depth special reports. In addition, CNN Student News provides free curriculum at CNN.com/EDUCATION to accompany each program's content. CNN Student News, along with CNN Classroom Edition, is Turner Broadcasting's contribution to Cable in the Classroom.\n Forward this to a friend\nYou have received this email because you have signed up to receive the CNNStudent News newsletter. Click here to unsubscribeEdit your profile here  \n"}