{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Agustin Quintero\" <nifcomicplussaw@comicplus.com>", "subject": "Burn pounds off with Anatrim", "body": "\nShed weight now and enjoy the process\n\n\n\n\n\nAnatrim – The latest and most delighting lose flesh product is now available – As were told on BBC\n\n\n\nDid you see superfluous body kilograms kill a plenty of people every year? We know that you hate the unattractive appearance of people like those and the low status they have in modern society. \n\nOr, maybe, you can’t withstand an assault of fatal eating habits of yours. If you see it sounds familiar, then we got something to propose to you!\n\n\n\n\n\nHere there is Anatrim, the new product for the elimination of your body’s extra weight. The astounding thing about Anatrim is it improves the quality of your life, repressing your feeling of hunger and giving you better cheer. Note what people say to us on this product:\n\n\n\n\n\n\"It’s great! \n\n\nI stopped stuffing myself with food and watching TV continually \n\n\nI became more interested in taking exercise.\n\n\n\n\n\n\n Anatrim put me back on the right track.\n\n\n I am in a great shape now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nRita R., Bellevue WA\n\n\n\n\n\n\n\"I tried some passive weight burning, but all came in vain. This terrible hunger would just kick in and spoil everything. \n\n\nOne day I was told about Anatrim my very best friend by and I was really impressed at the information.\n\n\n I had tried taking it, and my wife said I look very good now, 5 months later. \n\n\n32 pounds have gone away and I keep losing them! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nSteve Burbon, New York\n\n\n\n\n\nAnatrim helps your mind to understand that you doesn’t have such a great need for that much food. It improves your spirit, provides you with extra energy, and attacks unnecessary kilos. All thanks to its mighty newly-elaborated formula!!\n\n\n\nWorm out more information!\n\n\n\n"}