{"category": "ham", "to_address": "beginners@perl.org, perl-beginners@moderators.isc.org", "from_address": "Brian <googleAcct@screenlight.com>", "subject": "Re: Array of Array refs", "body": "On May 27, 9:00 pm, googleA...@screenlight.com (Brian) wrote:\n> Hi All-\n>   I am trudging through some DBI, XML, etc.. I had a problem and was\n> baffled by how to get at array elements out of a series of pushed\n> array refs. But, by simplifying the problem, I found that the syntax I\n> used was in error. here is the small sample, already debugged. Hope\n> this helps someone...\n>\n> #!/usr/bin/perl\n>\n>         my @tRespsA;\n>\n>         my @fieldList = ( \"one\", \"two\", \"three\", \"four\" );\n>         my @r1 = ( 1, 2, 3, 4 );\n>         my @r2 = ( 13, 14, 15, 16 );\n>         my @r3 = ( 23, 24, 25, 26 );\n>\n>         push @tRespsA, \\@r1;\n>         push @tRespsA, \\@r2;\n>         push @tRespsA, \\@r3;\n>\n>         foreach my $tRowRef ( @tRespsA ) {\n>                 my $tCnt=0;\n>                 foreach my $tFld (@fieldList) {\n>                         #if ( $tRowRef->[ $tCnt] eq \"\") { next; }\n>                         print $tFld . \"='\" . $tRowRef->[ $tCnt++ ] . \"' \\r\";\n>                 }\n>         }\n\n\nok... a few things..\nuse strict and warnings is fine.. this was a small sample, perhaps\nallthe more important to include, actually, so you are right there...\n\nmy variable names end with A for array and H for hash, start with a\nlower case t if they are used locally as temp variables, as in being\nwritten over each time through a loop. But this isn't a real program,\nso there isn't that much detail. In fact, I'd say that starting\nvariable name s with array again and again is very hard to read.\n\nResp is short for responses. These aren't actually static arrays, they\ncome from iterating over the arrays returned by a DBI execute(). this\nis simplified for purposes of explanation. The reason for the\nconstruct is that those are names of fields used in formulating the\nQuery string.\n\nvar names rows and cols is fine...\n\nyes, I come from C\n\nyes, I have read all of those perl doc pages. You perl folks like to\nrefer to whose pages a lot Paul, but in many cases they are not very\nwell written as manuals [this is provably true] However, to give\ncredit where credit is due, they are often full of interesting\ntidbits, and they do exist, so a lot of people have obviously tried to\ndo a lot of explaining.  ..and yes, I can make mistakes in the syntax,\neven though I have read through those. Practice makes perfect.\n\nI do appreciate the responses, as I don't really have anyone else to\nask in my environment.\nthank you for that\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}