{"category": "spam", "to_address": "producttestpanel@flax9.uwaterloo.ca", "from_address": "Golf Retreats <Montague@yvepoggked.greatbigsports.com>", "subject": "Participate now to receive a Golf Retreat on us - details inside", "body": "You registered to receive this and similar offers from  on .\n\nFREE Golf Retreat\n\nIncludes two rounds of golf, hotel accommodations and airfare (a $1500\nvalue) \n\nhttp://yvepoggked.greatbigsports.com/t/l?g4-w11-1-ogc-8jdp\n\nParticipation Required - See site for details\n\n\nNotice: To claim your reward you must participate in our program and\nmeet all of the offer eligibility requirements as outlined in the Terms\n& Conditions (you may view our Terms & Conditions on the\nRewardsGateway.com site) before you can receive your FREE reward.\nEligibility requirements include signing up for at least two Silver,\nGold and Platinum offers. Copyright (c) 2004-2005 RewardsGateway -\nRewardsGateway is an independent rewards program and is not\naffiliated with any of the listed products or retailers. Trademarks,\nservice marks, logos, and/or domain names (including, without\nlimitation, the individual names of products and retailers) are the\nproperty of their respective owners, who have no association with or\nmake any endorsement of the products or services provided by\nRewardsGateway. This is a Rewards Gateway e-mail message. If you\nprefer not to receive e-mails from Rewards Gateway in the future, please\nsend an e-mail to: Unsub@RewardsGateway.com or write to us at: 22647\nVentura Blvd Suite 258 Woodland Hills, CA 91364 8jdp  or click here:\n\nhttp://yvepoggked.greatbigsports.com/t/l?g4-w11-2-gqc-8jdp\n\n\nIf you no longer wish to receive these commercial emails, you may remove yourself from our mailing list by clicking here http://yvepoggked.greatbigsports.com/remove?r.Montague.25-920ff3f-5f0e.speedy.uwaterloo.ca.-producttestpanel?r click here or by calling our unsubscribe hotline at 864-752-1051. Please note this phone number is used solely for unsubscribe requests. Please allow up to five business days for your request to be processed.\n\nYou may also contact us by writing to us at our postal address: Montague| 9600 Great Hills Trail, Suite 150 W| Austin, TX 28759\n\n\n\n\n"}