{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "robert weissman <rob@essential.org>", "subject": "[Ip-health] Thailand: Will Not Back Down in Face of US Threats", "body": "*http://www.bangkokpost.com/News/02May2007_news01.php\n\nThailand on priority watch list*\n\n/*US move ridiculed by cheap drug advocates*/\n\n*WORANUJ MANEERUNGSEE & APIRADEE TREERUTKUARKUL*\n\nThe US administration has downgraded Thailand to a country with poor\nintellectual property protection in a move ridiculed by Thai advocates\nof cheap drugs. The US Trade Representative Office (USTR) on Monday\nplaced Thailand and 11 other countries, including China, India and\nRussia, on the ''Priority Watch List'' of countries to be closely\nmonitored for their protection of intellectual property rights.\n\nIt is a downgrading from the ''Watch List'' which Thailand was\npreviously on.\n\nThe downgrading, outlined in the USTR annual report on intellectual\nproperty protection, came as no surprise after the Public Health\nMinistry enforced compulsory licensing on imported drugs, drawing\nprotests from US drug firms.\n\nAbbot Laboratories was among firms which asked Washington to put\npressure on Thailand for allegedly stealing their intellectual property.\n\nBut US ambassador to Thailand Ralph Boyce yesterday said the USTR\ndecision did not only stem from compulsory licensing.\n\n''True, compulsory licensing in Thailand is one of the concerns, but it\nis not the main reason for Thailand being placed on the Priority Watch\nList,'' he told a press conference.\n\nThailand's protection of copyrights and intellectual property has been\nseen to have weakened over the past year, but there were also other\nreasons for the downgrading, he said.\n\n''The fact that Thailand is being placed on the Priority Watch List\nreflects US and international concerns toward Thailand's recent economic\npolicies such as the Foreign Business Act amendment, the capital control\nmeasures and the Retail Act,'' Mr Boyce said.\n\nThe US last placed Thailand on its Priority Watch List from 1989 to\n1992. It upgraded Thailand to the Watch List in 1993 because of improved\nmeasures to tackle intellectual property offenders.\n\nAccording to the US International Intellectual Property Alliance,\nAmerican businesses selling copyrighted products and services lost\nUS$368 million in Thailand last year, up from $355 million in 2005 and\n$184 million in 2004.\n\nUnder the Special 301 Act, Washington can take trade action or seek\ndispute settlements against countries on either the Priority Watch List\nor the Watch List.\n\nPublic Health Minister Mongkol na Songkhla vowed to go on lowering drug\nprices to expand the poor's access to essential medicine.\n\n''We have not done anything wrong. We followed the process closely by\nannouncing the plan to use compulsory licensing before implementing\nit,'' he said. The move was ''absolutely legitimate'' and in line with\nWorld Trade Organisation (WTO) rules, the minister said.\n\nThe decision to put Thailand on the Priority Watch List reflected the\ninfluence drug firms had over the USTR, he said.\n\nThe ministry implemented compulsory licensing for the Aids drug\nEfavirenz in November. The patent owner, Merck, later announced a\nworldwide cut in the price of the medicine to 725 baht. In Thailand,\npatients previously paid 1,500 baht a month to use Efavirenz.\n\nThe ministry announced a similar policy for heart drugs Kaletra and\nPlavix in January. But it has not yet been implemented because there is\nenough stock of these drugs to last until August.\n\nHealth activist Jon Ungpakorn urged the Commerce and Foreign ministries\nto work with the Public Health Ministry to defend compulsory licensing\nrather than leave the task to this ministry alone.\n\nIntellectual property law expert Jade Donavanik said compulsory\nlicensing was for government use and did not violate the WTO agreement.\n''It is unfair to interfere with another country's sovereignty by taking\nunilateral trade action like this,'' he said, referring to the USTR move.\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}