{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"All Politics\" <mailings@mail.cnn.com>", "subject": "Politics E-Wire", "body": "\n\n\n\n\nCNN.com - Politics\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonday, June 11, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImmigration bill crashes\nA \"grand compromise\" immigration bill aimed at legalizing and penalizing millions of people who are unlawfully in the United States has suffered a stunning setback in the Senate, costing President Bush perhaps his best opportunity to win a top domestic priority.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Situation Room, weekdays 4 p.m. & 7 p.m. ET\nWatch \"The Situation Room,\" anchored by Wolf Blitzer, for complete, up-to-the minute coverage of the day's events. Tune in to \"The Situation Room\" weekdays from 4 to 6 p.m. and from 7 to 8 p.m. ET.\n\nFor a daily sneak preview of the show and an early read on the day's political news sign up for \"The Situation Room\" daily email newsletter at http://www.CNN.com/situationroom.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLibby gets 30 months in leak case\n\"Scooter\" Libby, former chief of staff to Vice President Dick Cheney, was sentenced Tuesday to 30 months in prison for lying to investigators probing the leak of a CIA operative's identity.\nFULL STORY\n\n\n\n\n\n\nStem cells vote sets up veto fight \nCongress cleared legislation Thursday easing restrictions on federal funding for embryonic stem cell research, but not by enough votes to override a promised veto.\nFULL STORY\n\n\n\n\n\n\nEx-official: Cheney opposed promotion\nVice President Cheney opposed a promotion for a deputy involved in a dispute over the controversial domestic surveillance program, a former deputy attorney general told senators.\nFULL STORY\n\n\n\n\n\n\nPace replaced in top military job\nAnticipation of a \"contentious\" confirmation process prompted the decision to replace Gen. Peter Pace as chairman of the Joint Chiefs of Staff, Defense Secretary Robert Gates said.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the CNN AllPolitics E-Wire email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}