{"category": "ham", "to_address": "Arnoud Engelfriet <arnoud@engelfriet.net>", "from_address": "Nathanael Nerode <neroden@fastmail.fm>", "subject": "Re: Logo trademark license vs. copyright license", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nArnoud Engelfriet wrote:\n> Nathanael Nerode wrote:\n>> The trademark holder hereby grants permission to any person to use the trademark\n>> (and derivative marks) in any way except one: you may not use it to falsely \n>> represent something else as being the thing represented by the trademark.  This \n>> permission should be interpreted broadly: any use which is not clearly deceptive \n>> is permitted.\n> \n> The usual phrase in trademark law is \"false association with\n> the trademark holder\". A related concept is diminishing (diluting)\n> the value of the mark. You could use something like this:\n> \n> \"Your use of the trademark may not create a sense of endorsement,\n> sponsorship, or false association with the trademark holder.\n> \n> Your use of the trademark may not diminish the distinctiveness \n> of the trademark or harm the reputation of the trademark holder.\"\n> \n> Arnoud\n> (IAA European trademark attorney but TINLA)\n\nActually, I believe we specifically want to authorize \"diminishing the\ndistinctiveness\" or \"harming the reputation\".  Trademark dilution and\ntrademark libel suits are not appropriate for free software, if they are\never appropriate.\n\nUse of a trademark to harm the reputation of the trademark holder is an\nessential right for those who wish to attack the trademark holder for\nwhat they see as bad behavior.\n\n\"Dilution\" is far far too vague and abusable for it to be appropriate to\nprohibit it.   Most cases of trademark abuse by big corporations seem\nto, as far as I can tell, rely on \"dilution\" and \"tarnishment\" theories,\nnot on infringment.\n\nWe just want to disallow actual infringement, not these other things.\n\nSo I would only go with\n\n\"Your use of the trademark may not create a sense of endorsement,\nsponsorship, or false association with the trademark holder.\"\n\nPeriod.  Actually, for clarity, we want to point out that you can create\na sense of endorsement or sponsorship if you are in fact endorsed or\nsponsored, so I'd prefer something like:\n\n\"Your use of the trademark may not create a false sense of endorsement,\nsponsorship, or association with the trademark holder.\"\n\nThoughts?\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGIVT5RGZ0aC4lkIIRAlR5AJ48ndZNK7xZAvIIfEQzd5OCsvLQUwCdGCq8\n9zcm/oZWI1kEnr9JYoRqsTo=\n=90SX\n-----END PGP SIGNATURE-----\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}