{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Stella Metz\" <laxcresolvew@cresol.de>", "subject": "Control your weight and appetite", "body": "\nPounds down, mood up\n\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting flesh loss product is now easily available – As seen on BBC.\n\n\nCan you remember all the times when you told yourself you would do any thing for being rescued from this quickly growing number of kilos? Luckily, now no great price is to be paid. Thanks to Anatrim, the ground-breaking kilos-melting medley, you can get healthier lifestyle and become really slimmer. Have a look at what our customers write!\n\n\n\n\"It’s quite difficult to admit it but I was an awful food addict. \n\n\nI greedily devoured all this trash \n\n\nand could not stop. \n\n\n\n\nThis fatal passion ceased after I started course with Anatrim! \n\n\nHoly God,\n\n\n\n\n my craving for food abated, \n\n\nmood increased and I turned to the happiest person 29 pounds in 2.4 months. \n\n\n\n\nI can tell you now I’m the happiest person on the planet!\"\n\n\n\n\n\nSilvia D., Colorado\n\n\n\n\n\n\"I had weight problems since a boy. \n\n\nYou can't imagine how I hated being mocked at school. \n\n\n\n\nI hated my stoutness and I detested even myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nThis stuff literally dragged me out of this dreadful nightmare! The very sincere thanks to you, guys.\"\n\n\n\n\n\nSteve Doubt, Chicago\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was saved! I got into the circle, depression – more eating – more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOne of my friends pointed at your web page and I ordered up my pack of Anatrim at the same time. \n\n\nThe results I achieved were great, my appetite came to acceptable level, I was often in a good mood, and, be sure, I went some belt holes back. And you see, the bedroom became cool, too!\"\n\n\n\n\n\nRikky\n\n\n\n\n There many and many gratitudes left by delighted people trying Anatrim. Why don't you join the thousands and thousands of slim clients and try this natural appetite abating power boosting product now!\n\n\nDon’t miss the opportunity!\n\n\n\n\n"}