{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 150", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Spain. Claim that ?1m El Cid sword is a forgery provokes a\n      duel of words (Museum Security Network Mailing list)\n   2. Discretion required to protect fossil sites\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Mon, 25 Jun 2007 18:48:01 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Spain. Claim that ?1m El Cid sword is a forgery\n\tprovokes a duel of words\nTo: \nMessage-ID: <00a001c7b748$97906720$c6b13560$@org>\nContent-Type: text/plain;\tcharset=\"utf-8\"\n\nClaim that ?1m El Cid sword is a forgery provokes a duel of words \nBy Elizabeth Nash in Madrid \nPublished: 13 June 2007 \nThe modern-day clash over a sword that once belonged to Spain's medieval hero El Cid may become as legendary as the warrior's fighting skills. \n\nAuthorities in the knight's home region recently snapped up La Tizona - not just a weapon, but a potent national symbol - from a Spanish aristocrat for a steely ?1.6m (?1m), planning to put it on show next to El Cid's tomb in Burgos cathedral.\n\nBut the government has slashed their plans to ribbons, branding the sabre a stylish fake. The Culture Ministry had already been offered the so-called historic relic, it said, but after commissioning multiple scientific studies it was found to be a fraud, worth no more than ?300,000.\n\nThe new owners are standing firm, however. \"The ministry is just jealous because we bought it and they didn't. Historical tradition has always attributed this sword to El Cid,\" authorities in the Castilla Leon region of northern Spain said. The title El Cid (Andalus Arabic for chief, or leader) was given to Rodrigo Diaz de Vivar (1043-1099). His battles against Moorish occupiers prompted Spanish Catholics to adopt him as a national figurehead.\n\nEvery Spanish child learns of El Cid's bizarre final confrontation, when Catholic soldiers dragged the swordsman from his deathbed, propped him on his horse, strapped La Tizona to his side, and displayed him to the enemy. The mere sight of the never-defeated warrior prompted the Moors to flee in terror.\n\nSpain's National Heritage, Madrid's Archaeological Museum and the Royal Academy of History have all given the sword the thumbs down, with one specialist dating it from the 15th or 16th century.\n\nThe aristocrat who sold the sword, Jose Ramon Suarez de Otero, Marquis of Falces, is livid. \"La Tizona has been in my family since the 1400s, and it pains me that political interests are denigrating this sword, symbol of our history,\" he fumed.\n\nhttp://news.independent.co.uk/\n\n\n\n------------------------------\n\nMessage: 2\nDate: Mon, 25 Jun 2007 18:48:01 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Discretion required to protect fossil sites\nTo: \nMessage-ID: <00a101c7b748$9a3918f0$ceab4ad0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nDiscretion required to protect fossil sites\nSunday, June 24, 2007\n\nBy Don Hopey, Pittsburgh Post-Gazette\n\nDirections to the Allen L. Cook Spring Creek Preserve and prospecting\nlocations within it are somewhat vague. \n\nThis is done on purpose because of the real risk of fossil theft.\n\nEdward McCord, University of Pittsburgh Honors College Program director and\npreserve coordinator, asked that specific information about routes, geologic\nlocations and paleontological sites not be used. \n\n\"Some articles about the preserve have termed it the 'best since Como\nBluff,' and that may have overblown it, but there have been historic\ninstances of people raiding dinosaur digs and we are concerned,\" said\nMandela Lyon, a paleobiologist and co-instructor for this summer's\nUniversity of Pittsburgh field course.\n\nComo Bluff is the nearby fossil-rich site north of Medicine Bow, Wyo. that\nbetween the 1860s and 1890s yielded such finds as the Diplodocus carnegii,\nbones better known today as the Carnegie Museum of Natural History's\n\"Dippy.\" \n\nFossil smuggling from Russia, China and Australia is widespread. Because of\nthe likelihood of theft, important finds in Australia are protected and\noften kept secret. One such middle of the night theft involved the use of\njackhammers to take a stegosaurus footprint. \n\nBetween 1995 and 1998, the National Park Service identified 721 documented\nincidents of paleontological resource theft or vandalism, many involving\nmultiple specimens. The number of thefts has risen as prices have gone up.\n\nIn 1991, an Allosaurus skeleton was stolen from federal Bureau of Land\nManagement land southeast of Fremont Junction, Utah and sold to a Japanese\nbuyer for $400,000. A BLM official said of the theft, \"Because it was\ncrudely collected, we have lost any chance to study the way the skeleton lay\nin the ground, how it was buried, what happened to it after death, and other\nplants or animals that may have been buried with it. We have lost a\npriceless piece of America's natural heritage.\" \n\n\"We're not trying to keep this a secret or be too guarded, but we are trying\nto preserve material for future educational and research purposes,\" Ms. Lyon\nsaid. \"We're just being cautious.\" \n\nhttp://www.post-gazette.com/\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 150\n****************************************\n\n"}