{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Michael Pobega\" <pobega@gmail.com>", "subject": "Re: Can a font with an unfree character be free?", "body": "On Mon, May 14, 2007 at 02:51:31AM -0400, Nathan Edges II wrote:\n> [...]\n> http://www.dinf.ne.jp/doc/japanese/resource/other/z00014/z0001406_e.html\n> [...]\n> \n> If a font includes [the symbol of access wheelchair] as a character,\n> can it be free?\n\nThe character itself isn't non-free, but rather the character being used\nwith the designated colors/directions:\n\n> The Symbol shall always be used in the design and proportions approved\n> by the Assembly, a reproduction of which shall be disseminated with this\n> resolution. The color used for the Symbol shall be white on a dark blue\n> background, to conform with the international road sign conventions,\n> unless there are compelling reasons to use other colors. The figure\n> should face to the right, unless there are directional reasons for it to\n> face left.\n\nTo be restricted, the symbol has to have the same proportions that\nwere approved by the Assembly, it must be white on a dark blue\nbackground, and facing right.\n\nBut this, I don't quite understand:\n\n> No change in or addition to the Symbol design shall be permitted. The\n> basic symbol may be used in conjunction with additional signs or text\n> for directional or identification purposes, as long as they do not\n> distort the integrity of the Symbol.\n\nBy the symbol do they mean the basic wheelchair, or the whole thing\nwith all of the colors? I'd try to contact someone and see what they\nmean by that, because otherwise I may be interpereting this wrong.\n\nIf the restrictions are only places on the right-facing, white on\nblue wheelchair then it should be fine to redistribute. If by \"symbol\"\nthey mean the basic wheelchair, then redistribution wouldn't fall\nunder DFSG-free terms from what I can tell.\n-- \nhttp://digital-haze.net/~pobega/ - My Website\nIf programmers deserve to be rewarded for creating innovative\nprograms, by the same token they deserve to be punished if they\nrestrict the use of these programs. \n - Richard Salmon\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}