{"category": "spam", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Online MILFs <OnlineMILFs@ourdick.com>", "subject": "SEXUALLY-EXPLICIT:This MILF Got Webcam Installed Today ktwarwic", "body": "\n\nktwarwic Online MILF\n\n\n\n\n\n \n \n \n \n \n \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLive MILFs Online Now 06/21/2007 08:48:18\nOlder Women Get Nailed Over ... and Over...\n\n\nBest thing of being old\n\nThe doctor tells his patient: \"Well I have good news and bad news...\"\nThe patient says, \"Lay it on me Doc. What's the bad news?\"\n\"You have Alzheimer's disease.\"\n\"Good heavens! What's the good news?\"\n\"You can go home and forget about it!\"\nAn accident really uncanny,\nBefell an unfortunate granny.\nShe sat down in a chair\nWhile her false teeth were there,\nAnd bit herself right in the fanny!\nThe Senate is investigating deceptive sweepstakes practices. These companies target the elderly and make them think they will receive a bunch of money, but in reality they never see any of it.\nThe most popular of these scams is called Social Security.\nI've sure gotten old. I've had 2 By-pass surgeries. A hip replacement, new knees. Fought prostate cancer, and diabetes. I'm half blind, can't hear anything quieter than a jet engine, take 40 different medications that make me dizzy, winded, and subject to blackouts. Have bouts with dementia. Have poor circulation, hardly feel my hands and feet anymore. Can't remember if I'm 85 or 92. Have lost all my friends.\nBut... Thank God, I still have my Florida driver's license!A reporter was interviewing a 104 year-old woman: \"And what do you think is the best thing about being 104?\" the reporter asked.\nShe simply replied, \"No peer pressure.\"\nWhat is the best birth control method for really-old seniors? \nNudity.\nWhat's the most useless thing in Grandma's house?\nGrandpa's thing.\nThe nice thing about being senile is you can hide your own Easter eggs.\nJust before the funeral services, the undertaker came up to the very elderly widow and asked, \"How old was your husband?\" \n\"98,\" she replied. \"Two years older than me.\" \n\"So you're 96,\" the undertaker commented. \"Hardly worth going home, isn't it?\"\nWhen you are young, you want to be the master of your fate and the captain of your soul. When you are older, you will settle for being the master of your weight and the captain of your bowling team.\nA 97 year old man goes into his doctor's office.\n\"Doc, I want my sex drive lowered.\"\n\"Sir\", replied the doctor, \"You're 97. Don't you think you're 'sex drive' is all in your head?\"\n\"You're damned right it is!\" replied the old man. \"That's why I want it lowered!\"God, grant me the Senility\nTo forget the people\nI never liked anyway,\nThe good fortune\nTo run into the ones I do,\nAnd the eyesight\nTo tell the difference.Three ladies were discussing the travails of getting older. One said, \"Sometimes I catch myself with a jar of mayonnaise in my hand, while standing in front of the refrigerator, and I can't remember whether I need to put it away, or start making a sandwich.\"\nThe second lady chimed in with, \"Yes, sometimes I find myself on the landing of the stairs and can't remember whether I was on my way up or on my way down.\"\nThe third one responded, \" Well, ladies, I'm glad I don't have that problem. Knock on wood,\" as she rapped her knuckles on the table, and then said, \"That must be the door, I'll get it!\"\n\n\n\n\n\n\n\n\n\n"}