{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 84", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. April 10-12: Global Candlelight Vigil for the Iraq Museum\n      (Museum Security Network Mailing list)\n   2. New Zealand. Massey releases rare books details. Details of\n      the rare books stolen from Massey University have been\treleased\n      by librarian John Redmayne. (Museum Security Network Mailing list)\n   3. Iran versus the Barakat Gallery: Iran to Appeal London Court\n      for Rehearing on its Artifacts. (Museum Security Network Mailing list)\n   4. Police Search For Stolen Satue\n      (Museum Security Network Mailing list)\n   5. Innov-X Handheld XRF analyzers can help to authenticate art\n      work, trace provenance, and help detect fraudulent works.\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Mon, 9 Apr 2007 11:46:05 -0400\nFrom: Museum Security Network Mailing list \nSubject: [MSN] April 10-12: Global Candlelight Vigil for the Iraq\n\tMuseum\nTo: undisclosed-recipients:;\nMessage-ID:\n\t\nContent-Type: text/plain;\tcharset=US-ASCII;\tdelsp=yes;\tformat=flowed\n\nJoin Donny George and SAFE in remembrance of the looting of the Iraq  \nMuseum four years ago. In a matter of days, thousands of ancient  \nartifacts from the cradle of civilization were stolen or destroyed.  \nEven more devastating, the looting of ancient sites continues to this  \nvery day, not only in Iraq, but all around the world.\n\nOn Tuesday, April 10-12, 2007, pause for a moment of silence and  \nlight a candle, wherever you are. You can also join SAFE in the  \nvigils being organized around the world, please go to http:// \nwww.savingantiquities.org/i-safe-alert.php for a list of locations  \nand times. Images and videos of the vigils will be compiled in a  \nVideo Memorial which will be presented to the current Director of the  \nIraq Museum as well as international decision makers. These images  \nwill also be broadcast via AssyriaSat, the global satellite  \ntelevision network. Show your support, participate in the Global  \nVigil and send us the images.\n\nCall for the return of more than 7,000 antiquities that are still  \nmissing. Demand an end to the international black market trade of  \nantiquities which feeds the looting of archaeologicaI sites, in Iraq  \nand around the world. Protect ancient civilizations not just for the  \npeople of Iraq but for all of us, for future generations to come. We  \nmust not forget.\n\n\nThank you,\n\nCindy Ho\nPresident\nSAFE/Saving Antiquities for Everyone, Inc. http:// \nwww.savingantiquities.org\n\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Mon, 9 Apr 2007 21:28:50 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] New Zealand. Massey releases rare books details.\n\tDetails of\tthe rare books stolen from Massey University have been\n\treleased by librarian John Redmayne.\nTo: \nMessage-ID: <011b01c77add$4d8d3790$e8a7a6b0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nTuesday, 10 Apr 2007  \n\nMassey releases rare books details \n\nDetails of the rare books stolen from Massey University have been released\nby librarian John Redmayne. Seven books feature on the list with a realised\nvalue of $25,110, but Mr Redmayne said Massey had since removed one because\nit could not prove that the copy belonged to the university. \n\nIn all, Massey lost 19 books, valued at about $40,000, but only six, worth\n$23,310, were involved in charges brought against its former New Zealand and\nPacific librarian Karen Dale Churton, 48, who was sentenced to 11 months'\nimprisonment on April 2. An appeal has since been lodged against the\nsentence. An application for bail was disallowed. \n\n\"Karen told police that Maori Art (a book by \"Hamilton\" that sold for $1800)\nwas a personal copy and not stolen from Massey,\" said Mr Redmayne. \"There is\na copy on the shelves in the Bagnall Collection and we cannot prove we had a\nsecond copy.\" \n\nThe six other books on the police \"Massey List\" were : \n\nA book on missionary voyages in the South Pacific compiled from journals of\nofficers and missionaries aboard the ships involved, valued at $1000. The\nauthor or editor was unknown, but the volume was titled A Missionary Voyage\nto the Southern Pacific Ocean, performed in the years 1796, 1797, 1798, in\nthe ship Duff commanded by Captain James Wilson. \n\nThe Art Album of New Zealand Flora, by Mr and Mrs Edward H. Featon, was sold\nfor $800. \n\nAn Elementary Manual of New Zealand Entomology: Being an introduction to the\nStudy of our Native Insects, by G. V. Hudson, sold for $110. \n\nA set of three books by Joseph Dalton Hooker. The Botany of the Antarctic\nVoyage of HM Discovery Ships Erebus and Terror in the years 1839-1843 under\nthe command of Captain Sir James Clark Ross, Kt, RN, FRS. Parts 1 and 2.\nThis volume sold at auction for $9000. \n\nPart 3, dealing with the flora of Tasmania, sold for $7000. The final book,\non \"Flora Novae-Zelandiae\", realised $5400. \n\nhttp://www.stuff.co.nz/\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Mon, 9 Apr 2007 21:28:50 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Iran versus the Barakat Gallery: Iran to Appeal London\n\tCourt\tfor Rehearing on its Artifacts.\nTo: \nCc: list@leidennetwork.net\nMessage-ID: <011c01c77add$4da8aed0$e8fa0c70$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nPublished:4/8/2007 1:17:00 PM   \n\nIran to Appeal London Court for Rehearing on its Artifacts   \n\nLondon Court?s verdict for putting 17 items of Jiroft?s historical artifacts\nin auction has aroused the concern of Iran?s cultural heritage experts.\nTehran, 8 April 2007 (CHN Foreign Desk) -- London Courts recent ruling for\nputting 17 items of Persian historical relics looted from Jiroft historical\nsite up for sale has evoked the response of authorities of Iran?s Cultural\nHeritage and Tourism Organization (ICHTO), cultural heritage experts, and\nNGOs. In this regard, ICHTO is determined to take action against the court?s\nruling through making a complaint to the rehearing court. These ancient\nartifacts had been plundered from Halil Rud historical site near the city of\nJiroft in the Iranian province of Kerman. The smugglers then illegally\ncrossed the borders of the country with these valuable objects, considered\npart of the Persian heritage, and sold them abroad.  In an interview with\nCHN, Omid Ghanami, director of the Legal Department of ICHTO said: ?London?s\nCourt ruling for putting 17 items of Jiroft?s historical relics has aroused\nthe concern of cultural heritage experts. Therefore, we are determined to\nstudy the case from all aspects in an attempt to recover Persian artifacts\nthrough appealing to the court for rehearing.?  The litigant of Iran in this\ncase is the Barakat Gallery, which has collected a large number of Jiroft?s\nhistorical relics and intends to fight any appeal, said it had acquired good\ntitle to the artifacts under the laws of France, Germany, and Switzerland,\nwhere it brought them. According to The Independent, Lane and Partners, the\ngallery?s London lawyers, said the antiquities were mainly bought at auction\nand were valued at about ? 250,000.   According to Ghanami, Iran has still\nthe right to follow up the case through the rehearing court. ?Currently we\nare trying to estimate Iran?s chance of winning at the rehearing court. The\nLegal Department of ICHTO is also determined to make an accurate assessment\non the expenses of the appeal,? added Ghanami.  The whole story started when\ncultural heritage authorities found out that Jifort?s stolen relics were\nbeing auctioned by Barakat Gallery in London, they immediately took action\nand asked the London Court to stop the selling of these invaluable relics.\nThe court ordered the gallery to stop selling them and asked it to come to\nan agreement with Iran about them. However, although the gallery took these\nartifacts out of its auction, it refused to give them back to Iran despite\nIran?s proposal to give 150,000 British pounds as compensation. Following\nthat Iran took the case to London Court for the second time last summer.\nThe case was first taken to the court by Iran with the help of the\nInternational Law Department of Paris. Iran and France worked closely to\nprepare a file and submit it to London?s court to prove Iran?s claim for the\nownership of these relics.    Anyway the recent ruling of London Court\nindicating that 17 pieces of Jiroft?s historical relics can be sold in an\nauction, has not only evoked the emotions of cultural heritage enthusiasts,\nbut has also violated UNESCO?s 1970 convention indicating prevention of the\nillicit import, export and transfer of ownership of cultural properties,\nwhich UK has also ratified it.  According to The Independent, Jeremy Scott,\na lawyer acting on behalf of the Iranian government, said the ruling was a\nsetback of those trying to stop looters. ?It will be of great concern to\nmany countries throughout the world as it places their archeological\nheritage at further risk,? said Scott.    In a statement, the gallery said:\n?We do understand the Islamic Republic of Iran?s desire to preserve its rich\nand diverse heritage. However, there mush also be protection for those of us\nwho, quite legitimately are dealing in antiquities.?  Halil Rud historical\nsite was one of the first places where civilization and urbanization were\nestablished. A large number of stone, clay, and architectural remains from\nthe third millennium BC were discovered during archeological excavations in\nthe site. However, after such a rich civilization was discovered in Halil\nRud region, lack of appropriate protection and management in this historical\nsite and lack of public knowledge about how to preserve their cultural\nheritage, and the smugglers who took advantage of this situation and sold a\nlarge amount of these historical relics illegally all led to such a dilemma\nwe are facing today.        At present ICHTO is trying to prepare a file and\ngathering valid document which prove Iran?s claim for ownership of these\ninvaluable artifacts which are currently in possession of Barakat Gallery.\n\n\nSoudabeh Sadighforeigndesk@chn.ir\n\nhttp://www.chnpress.com/\n\n\n\n------------------------------\n\nMessage: 4\nDate: Tue, 10 Apr 2007 06:09:53 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Police Search For Stolen Satue\nTo: \nMessage-ID: <002801c77b26$17432ac0$45c98040$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nPolice Search For Stolen Artwork\nKOTV - 4/9/2007 1:22 PM - Updated 4/9/2007 6:36 PM\n\nThere is a lead in the investigation into stolen artwork in Tulsa. A thief\nmade away with a statue created by a renowned Native American artist. It was\ntaken from a Tulsa gallery. When a thief took the $11,000 statue from Joseph\nGierek Fine Art in January, it was the first time in 25 years that Gierek\nhad anything stolen. News On 6 anchor Craig Day reports investigators now\nhave a lead in the case.\n\n\"Certainly hopeful that something comes of it and we get it back,\" said\nGierek.\n\nAfter our first report on the theft, a tipster contacted Gierek saying she\nhad seen the stolen bronze on Craig's List, an online classifieds site.\n\n\"She says she couldn't remember anything at all about who the artist was or\nwhat they were asking for it, but she says there is no question that when\nshe saw the image on the report, that was definitely the bronze she had\nseen,\" said Gierek.\n\nThe bronze was sculpted by world-renowned Native American artist Allan\nHowser. Howser was originally from Oklahoma and is recognized as one of the\nmost notable artists of the 20th century. Tulsa detectives and the insurance\ncompany investigator are following up on the lead.\n\n\"The information has been forwarded and just keeping our fingers crossed\nthat we can get the bronze back,\" said Gierek.\n\nIn the meantime, Gierek has added high-tech security cameras to keep\nanything like the theft from happening again. The stolen bronze has also\nbeen reported to an international registry for stolen artwork. A reward is\nbeing offered for the return of the stolen statue.\n\n\nFor more information about Allan Houser: http://www.allanhouser.com/home.php\n\nhttp://www.kotv.com/\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Tue, 10 Apr 2007 06:09:53 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Innov-X Handheld XRF analyzers can help to authenticate\n\tart\twork, trace provenance, and help detect fraudulent works.\nTo: \nMessage-ID: <002901c77b26$1852c600$48f85200$@org>\nContent-Type: text/plain;\tcharset=\"windows-1251\"\n\nInnov-X Introduces new Handheld XRF units\n\n\nInnov-X Systems AIC 35th Annual Meeting Exhibit to Demonstrate Handheld XRF\nin Art and Heritage Conservation\n\n\n \nInnov-X Handheld XRF analyzers can help to authenticate art work, trace\nprovenance, and help detect fraudulent works. \n2007-04-09 08:27:32 - Portable X-Ray Fluorescence (XRF) in historic and\nartistic applications can perform rapid elemental analysis and gain valuable\ninformation right on the scene. In just seconds, materials can be identified\nand quantified.\n\n\nWoburn, MA, --- Innov-X introduces four new products at AIC this year,\nguaranteed to make a visit to Booth 104 worthwhile: \n\n? New Ultra-rugged handheld alloy analyzer - a totally sealed, weatherproof\nunit without a PDA.\n? Addition of Al, Si and Mg analysis with a patent-pending internal vacuum -\nstill the most portable XRF in the world - available in the classic PDA or\nthe sealed Ultra Rugged. \n? Handheld Laser Camera System - small-spot analysis featuring snapshot\nimages - all in the world's most portable handheld XRF Analyzer\n? X-50 high-powered, mobile XRF: the ultimate benchtop XRF featuring 10X or\nmore the power of handhelds now in a mobile package. \n\nLearn how Portable X-Ray (http://snipurl.com/1fwu5)Fluorescence (XRF) in\nhistoric and artistic applications can perform rapid elemental analysis and\ngain valuable information right on the scene. In just seconds, materials can\nbe identified and quantified. Conservators/investigators can now analyze\nartwork without altering, damaging, or transporting works to a remote\nlaboratory. You can even take a picture of a small analysis area for\nadditional documentation. Stop by Booth 104 and find out why your next\nPortable XRF needs to be from Innov-X.\n\nUse Innov-X Handheld XRF analyzers to authenticate art work; trace\nprovenance; confirm restoration materials; analyze a variety of objects\nin-situ and non-destructively to retain value.\n? Classic Removable PDA based model, Totally Sealed Internal Electronics\nmodel, Standard, Low-Z Vacuum or Laser Camera models\n? Innov-X offers excellent sensitivity to low concentrations of Cr, Ni, Mo,\nV \n? Study, restore and preserve museum objects and historical monuments by\nalloy analysis\n? Differentiate pigments for authenticity\n? Identify base materials of ceramics and statues\n? Sort metallic materials by identifying trace impurities\n? Use for non-metals as well: precious metals testing \n? NEW: Low Z - Al, Si & Mg - analysis now available\nInnov-X's breakthrough design uses an x-ray tube in a compact unit. The\nUltimate in Customer Choice: The Classic Removable PDA model or the Totally\nSealed Internal Electronics model. Both models offer the signature Innov-X\nSuperior Ergonomic design for performance, ruggedness, portability and\nversatility required for tough field applications. \n\n? The lightest weight, smallest, and best-balanced handheld XRF. \n? Bright, color display that is easy to read in any lighting conditions -\neven direct sunlight. \n? Touch trigger. No uncomfortable triggers to squeeze and hold. Comfortable\n'deadman- trigger also. \n? Dual display: Angled front display plus rear display for easy viewing of\ntest results. \n? Reduce regulatory baggage - no wipe tests, minimal travel restrictions,\neasy to transport. \n? Eliminates the liability of isotope control, improper use, theft and\ndisposal.\nSee a demo at:\nhttp://www.innovxsys.com/interior//themes/IX/graphics/demo/demo/productoverv\niew.html \n\nMore information can be accessed at: http://www.innov-x-sys.com \n\n? AIC --American Institute for Conservation of Historic and Artistic\nWorks35th Annual Meeting, April 18-19, 2007, Richmond Convention Center,\nRichmond, Virginia\n\nhttp://www.pr-inside.com/\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 84\n***************************************\n\n"}