{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Glenn Ervin\" <GlennErvin@cableone.net>", "subject": "Re: hardware options", "body": "Hello All,\nIf anyone is looking for a laptop, I would suggest an Averatec.  I got one \nfor xMas, and I have been very pleased.\n800 dollars\n100 GB drive\n1 GB RAM\nDVD burner\nPC Express, 3 USB, 1 firewire, Modem & LAN ports, WIFI, Video out, headphone \n& Microphone jacks in front, SD card slot in front, switchable WIFI in \nfront, and a Dual-core AMD processor.\nIt only has a 12 inch screen, which is a plus, because I rarely need it, and \nI can turn it off to conserve battery.\nIts model is 2300.\nIt is about the size of my Braille note QWERTY, only the keyboard is \nslightly larger, therefore, it is easier to type on.\nI got mine from Sam's Club, and I got a 3 year warranty for only 80 dollars.\nHTH.\nGlenn\n\n----- Original Message ----- \nFrom: \"Cody Hurst\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Thursday, July 05, 2007 6:40 PM\nSubject: Re: hardware options\n\n\nGo get an HP the newer ones are enclosed in a slim line case made by\nShuttle. The tower is so small I can almost hold it in my hand. It's got\na tv tuner, all your standard ports, even a zip drive. Truely I\nbeautiful machine and only for $539 that was at best buys. As for a\nlaptop I'm looking for one now, but I'd say either a compaq, or an Acer\nhowever I'd go with a compaq, since they've been around longer. Be\ncareful of where you go buy your notebooks/desktops I'v seen a compaq as\nlow as $450, but my dad got a new one for $539, and that was an open box\nspecial. With the hp you get speakers monitor kb/mouse the only thing I\ndidn't quite get is that the CD rom drive is on its side....hmmmm\nwouldn't it fall out when trying to put one in?\n\nCody\nOn Thu, 2007-07-05 at 16:40 -0400, Christopher Moore wrote:\n> Hello,\n> I've been running x86 pcs for years.  My current machine is housed in a\n> tower case under the desk.  I'm looking for other options with a smaller\n> footprint.  Cost is an obvious consideration; otherwise, I'd be tempted\n> to plunk down some serious cash on a laptop.\n>\n> Any thoughts?\n>\n> TIA\n> Chris\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}