{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Beth Hatch <bhatch200@comcast.net>", "subject": "Re: Thinkpad Saga Continues", "body": "i Janina,\n\nYes, I will be taking into consideration your guidelines posted in the \nhow-to when I reinstall Linux, especially with the partitions as you \nsuggested.  I hope the speakup issue gets fixed as well, glad I'm not \nthe only one experiencing weird issues with the Dectalk Express.\n\nTake care and thanks again,\n\nBeth\n\nJanina Sajka wrote:\n> You can expect any laptop you buy with some OS already installed will\n> have consumed most, if not all the available hd. Either you resize with\n> some tool, or delete partitions and reconfigure. No surprise there.\n>\n> I would strongly suggest you not blithely install Linux on a single\n> partition. At the very least, I strongly suggest a separate partition\n> for /home.  Please consider the guidance re such decisioning provided in\n> our installation HOWTO:\n>\n> http://SpeakupModified.Org/HOWTO_INSTALL.html#diskdruid\n>\n>\n> Beth Hatch writes:\n>   \n>> Re: Thinkpad Saga Continues\n>> Hi Sean and all,\n>>\n>> That's a really good question!  Yes, Fedora did notice my \n>> Windows  partition.  The problem was that the way that Lenovo made the  \n>> partitions, according\n>> to my Linux instructor, meant that we had to break  the existing \n>> partitions before installing Linux and then fix grub to  recognize what \n>> we had done.\n>> The computer was broken into one 30  gigabyte partition and another 90 \n>> GB partition.  Since there wasn't  enough room on the smaller partition, \n>> we had\n>> to use the bigger one in  order to put Linux on one 45 GB partition and \n>> Windows on the other 45 GB  partion we then made. this meant that we had \n>> to temporarily\n>> remove  Windows to build the new partitions. \n>>     \n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>   \n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}