{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Arnoud Engelfriet <arnoud@engelfriet.net>", "subject": "Re: Logo trademark license vs. copyright license", "body": "Francesco Poli wrote:\n> How would the revised wording look like?\n\nBasically, you need to forbid people from doing things with the mark\nthat create confusion or that make it look like these things are \nendorsed by the Debian Project (or SPI?).\n\nI could imagine something like this would be a good start for the\nSPI trademark lawyers:\n\nThe Mark Holder hereby licenses you to use the Marks in any way\nand for any purpose, with the exception of the following:\n\nYou are not authorized to use the Marks in commerce in any way that\nis likely to cause confusion, or to cause mistake, or to deceive \n(1) as to the affiliation, connection, or association of you or your\nproduct, service or other commercial activity with the Mark Holder, or\n(2) as to the origin, sponsorship, or approval of your product, service\nor other commercial activity by the Mark Holder\n\nIf the Mark qualifies as an original work of authorship under copyright law,\nthen the above license includes the right to use, copy, modify, merge,\npublish, distribute and sell the Mark or any derivative work thereof,\nagain subject to the above exception. \n\n\nThe \"in commerce\" should take care of people criticizing Debian and\nusing its name or logos to illustrate their articles.\n\nI would suggest making the copyright license conditional upon the \ntrademark qualifying for copyright. Otherwise people may think you \nare claiming that you have a copyright on the word \"Debian\".\n\nIn the original message Nathaniel Nerode limited the exception to\nonly \"no false representation\" with a qualification that it would\nhave to be \"clearly deceptive\". If I were giving legal advice,\nI would advise against that limitation. But I'm not so I'm not.\n\nArnoud\nPS Sorry about the cc, I thought my mutt was trained not to do that.\n-- \nArnoud Engelfriet, Dutch & European patent attorney - Speaking only for myself\nPatents, copyright and IPR explained for techies: http://www.iusmentis.com/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}