{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "550p 6/12 Update: False fire alarm prompts quick action", "body": "\n\n\n\n\n550p 6/12 Update: False fire alarm prompts quick action\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 45\nPosted: 5:49 PM, 6/12/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-43 (06/12/07): Crew awake; solar array deploy on tap\n   SR-44 (06/12/07): S4 solar array wings deployed\n   SR-45 (06/12/07): False alarms on station\n\n=================================\n\n5:50 PM, 6/12/07, Update: False fire alarm prompts quick action\n\nFire alarms tripped inside the Russian section of the international space station today, triggering emergency procedures and concern on the ground until the astronauts reported it was an apparent false alarm.\n\nAt 5:20 p.m., alarm tones could be heard on air-to-ground radio, prompting U.S. flight controllers to ask for a status report.\n\n\"We see the warning message, just looking for a status from you all,\" astronaut Megan McArthur radioed from Houston.\n\n\"Yeah, stand by, we have on the PCS (station computer system) right now says 'fire FGB,'\" said Expedition 15 flight engineer Sunita Williams. \"But stand by.\"\n\nThe FGB is also known as the Russian Zarya module, which sits between the U.S. Unity module and the Russian Zvezda command module. Expedition 15 commander Fyodor Yurchikhin, flight engineer Oleg Kotov and Williams immediately began working through emergency procedures.\n\nMoments later, astronaut Clay Anderson, Williams' replacement, called Houston to say the crew had \"looked around, we smelled around\" and there was no sign of any smoke or fire.\n\n\"ISS, we copy,\" McArthur said. \"No evidence of visible smoke or fire and you think all is normal but you're still checking. We're standing by.\"\n\n\"We're working some recovery steps,\" Anderson said. \"But it appears to be a software glitch. There is no fire.\"\n\nA few moments later, Russian flight controllers agreed it was a false alarm.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}