{"category": "spam", "to_address": "<faisalabad@speedy.uwaterloo.ca>", "from_address": "\"Jock K. Albert\" <jzz@anthro.net>", "subject": "cattle", "body": "\n\n\n\n\n\n\n\nOh, then that's probably not what's meant by the \nHebrew word toevah.\nthe bond between the husband and wife is now \nsevered. Jesus on the cross told the thief that very night he would be with him in \nparadice,was that a lie? This is true of religion, politics, economy and so on. So I \nwould agree with you on that point.\nThe study of the meaning of \"arsenokoites,\" and the \nclearly sexual context of the list of prohibitions invalidate these last two \nmarginal interpretations. If those 45 million children had lived, today they would \nbe defending our country, they would be filling our jobs, they would be paying into \nSocial Security,\" the former Georgia governor said. Natural Law and Homosexuality \nThe last angle to look at homosexual acts lies in the natural law.\nYes, it's a small sacrifice, but it is a sacrifice \ngiven from Love and it is always positive to give up something good for something \ngreat. He was put in a tomb near the old city that did not belong to any of them. \nJohn Yelom said:  As much as every skeptic wants to disprove Christianity, the only \nproblem with this film is that it .\nWas the Tomb of Jesus found by James \nCameron?\n4 says as it is written, call all men a liar and \nonly GOD be truth. How does that help us or help God?\nThey were evaluated and tested by the best and the \nbrightest and found to have no relevance. Last year we had The Da Vinci Code and \nthis year we have The Tomb of Christ. Natural Law and Homosexuality The last angle \nto look at homosexual acts lies in the natural law.\nI am speaking as a non-christian.\nYour friend marrying your divorced wife is wrong \nbecause it is adultry. To prepare our souls for Easter Sunday.\nConfession and Lent All Catholics are required to \nattend confession at least once during Lent. 5 on Amazon's rankings.\nLent is Big Business for Seafood Chains. If you \nread Acts, chpt.\nWorth thinking about!\n"}