{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nI’ll be anchoring our broadcast tonight from Washington, D.C., where\n  I’ve been working on a story about the U.S. capital’s long battle\n  for a single vote in Congress. We’ll show you my report tonight along\n  with the day’s news.\n \nFirst, Dr. Jack Kevorkian called his release from\n  jail today “one of the high points in life.” Kevorkian, who has\n  participated in at least 130 assisted suicides, spent eight years in jail\n  – and says he still believes people should have the right to die. Cynthia\n  Bowers will have the story which includes an exclusive 60 Minutes interview\n  with Kevorkian. Byron Pitts will also report on how Kevorkian drew the\n  country’s attention toward how we live the end of our lives.  \n \nMore of the story of Andrew Speaker, the Atlanta attorney\n  infected with a dangerous form of tuberculosis, unfolded today: He apologized\n  to those he may have exposed. Tonight we’ll hear their reaction as some\n  of them get results of their tests. Kelly Cobiella will have the very latest.\n  \n \nAnd new violence erupted in a Palestinian refugee\n  camp in Lebanon,\n  where militants allegedly linked to al Qaeda are holed up. The Lebanese army\n  has the camp surrounded – and the United States is helping the\n  effort by sending in ammunition for this deadly standoff, Mark Phillips will\n  report.\n \nFinally, Steve Hartman will have a special\n  Assignment America tonight. He’ll give you a behind-the-scenes look at\n  the sacred ground just outside of the nation’s capitol where the\n  country’s fallen soldiers rest. And now, a commemorative book of some\n  of the most telling images ever published of Arlington Cemetery\n  is being published.  Steve will tell what that means to families of soldiers.\n \nHave a great weekend!\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}