{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "\"Rochelle and Bethea\" <rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, here's your forecast for June 18th - June 24th", "body": "\n\n\n\n\n\n\n\n\nMemo, to ensure that your weekly forecasts are delivered correctly to your inbox, please add our email address Rochelle@myhealthwealthandhappiness.com to your address book.\n \n\nFirst Quarter Moon, June 22, 9:16 AM EST\n\n\n\n\n\n\n               \n\n\n\n\nDear Memo,\n\n    Care to hum along?  It's good for you!  I'm talking about \"toning,\" which is simply vocalizing a vowel sound, like someone chanting \"om.\"  Actually, you've been \"toning\" all your life, probably without realizing it.  Every time you may happen to groan, or sigh, or laugh, or say \"ahhh\" or \"ow\" produces the sound called toning.  These are all unconscious reactions.  And these sounds we produce through the body help remove tension and pain, and release pent-up energy, and re-establish a natural flow, leaving the body feeling more calm and cleansed.\n    When you vocalize a sound, Memo, it creates a vibration in the body that acts almost like a massage on the bones, tissues, cells, and fluids of the body.  The vibration has a big effect on the neurological and endocrine systems.  This is because the hypothalamus and pituitary gland are close to the roof of the mouth, and the vibration from toning acts on them to release chemical hormones throughout the body.  This in turn helps with improved immune function, increased brain hemisphere balance, and stimulates the \"rest-and-repair\" function of the nervous system.  That's a lot of good from just a little sound!\n    Here's what you do.  And toning is something that is easy to work into your day.  You can do it when driving, or in the shower, or resting at home.  Here's what you can do.  You'll be using the vowel sounds – A, E, I, O, U.  Take a deep breath, and as you exhale, start with the \"A\" sound.  As you exhale, chant the \"A\" sound.  Then inhale another deep breath, and exhale again chanting the \"A.\"  Do this about 5 times for each vowel.  You can always increase the number of times you repeat them.  After all, you may be feeling so good that you don't want to stop!\n    Happy humming!\n\n                        Until next week,                            \nP.S. Don’t forget to add Rochelle@myhealthwealthandhappiness.com to your address book.  We want to make sure that you receive your weekly forecasts on time.\n\n\n\n\n                      \n\n\n\n\n\n\n\n                 \n\n\n    Enjoy the Summer Solstice on the 21st when the Sun enters family-oriented Cancer.  The early part of the week is really good for getting things done – Mars and Pluto link up helpfully and the First Quarter Moon on the 22nd enables you to approach other people if you need advice, help, or just a different perspective.  On the 23rd, Uranus joins Mercury, Jupiter, Neptune and Pluto in retrograde motion.  There is a sense of slowing down for summer, which increases when Mars enters Taurus on Sunday.  Relaxation will do you a power of good, Memo!\n\n\n\n\n\nMemo             June 18 - June 24             \n\n\n\n\n \n\n\n\n    Memo, I want you to take maximum advantage of the luck coming your way this week. From my calculations, Friday is going to be your lucky day for this period.  And your Lucky Numbers are 07, 12, 26, 18, 34, 45.  I hope you'll make the best of them.\n\n\n\n\n\n\n\n\n\n\n\nJune 18th for Memo\n\n\n\n\n\n\n\n\n\n\n    It might be wise to listen carefully to what your body is telling you it needs today.  It may be something major, like meditation, or simple, like a different hairstyle or outfit.\n\n\n\n\n\n\n\n    You generally have a calm, positive outlook and now approach most of your affairs the same way.  You enjoy life when things go well and people around you get along.  You can take time to relax now.\n\n\n\n\n\n\n\n\n\n\n    When it comes to romance, it will be so easy that you'll either be passing out numbers - like at the deli - or collecting them on cocktail napkins.  Either way, you can afford to be picky.\n\n\n\n\n\n\n\n\n\n\n\n\n\nJune 19th for Memo\n \n \n \n \n \n\n \n \n    Today brings a feeling of real excitement in the air, my dear.  I encourage you to act on any spontaneous impulses.  Do something different, just for the fun of it.\n\n\n  \n \n \n    Organizing bills or other domestic paperwork can be time well spent today.  Your stars tell me that you tackle practical chores as well as you do all things in your life.\n\n \n \n\n \n \n\n\n\n\n    Idle chit-chat about earning potential may turn into action and initiative today, my friend.  Grab hold of information that can lead to more prosperous and stable times for you and your family.\n \n \n\n \n \n\n\n    Telling yourself you're worth a billion dollars at the beginning of each day can dramatically increase your self-confidence.  Today is a perfect day to start saying and believing it.\n \n \n \n \n\n\n    Today, my friend, you will probably have the courage to take certain chances when it comes to money and your family's future. Avoid impulse buying, but feel free to purchase mechanical items.\n  \n\n\n\n\n\n\n\n\nJune 20th for Memo\n\n \n \n \n \n \n \n    Putting all the puzzle pieces in front of you can help you see what is missing and where it goes.  This applies to many things, depending on what you may be trying to figure out.\n\n\n \n\n\n \n \n    You can afford a small luxury item or two today.  Your careful budgeting practices in the past should allow a more prosperous outlook.  Continue to think about what the future holds.\n\n\n \n\n \n \n    I have an image of you today,  fiercely rearranging the furniture or other objects in your home to make the overall effect more pleasing. No matter if you change your mind tomorrow.\n\n \n \n\n\n\n\n\n\n\n\n\nJune 21st for Memo\n  \n \n\n\n\n \n \n    Problems with communications can be solved if you pay extra attention to all the small details.  You may want to recheck phone numbers and addresses to be sure they are correct.\n\n\n \n\n \n \n    A neighbor could drop by unexpectedly.  Unfortunately, you may not be in a position to entertain them.  Ask if you can get together at a later date; you need to attend to chores right now.\n\n \n \n \n\n\n\n\n\n\n\n\nJune 22nd for Memo\n  \n \n \n \n \n \n    I sense the probability of you having a very active mind today, my friend.  This can help you with paperwork and communications that you need to complete with others.\n\n\n \n\n \n \n    Communications from important people in your life, may require an immediate response now.  This is a day for getting down to business, catching up on your calls, letters and miscellaneous correspondence.\n\n\n \n\n\n \n \n    Your sensitivities are probably going to affect how you react to others today.  You will also tend to be more assertive in your speech, communications and actions.  Decisions need careful thought.\n\n \n\n \n \n\n\n\n\n\n\n\n\nJune 23rd for Memo\n  \n \n \n \n \n \n    The word \"multitasking\" comes to mind when looking at what the stars are saying about you today, my dear.  This means that you may be able to handle many things at once, with ease.\n\n\n \n \n\n \n \n    Neighbors, relatives or associates may become unwelcome visitors in your home today.  My friend, communications will be most effective if you cut unnecessary rhetoric.  Scrutinize contracts and agreements.\n\n\n \n \n\n \n \n    It's tough to say where certain expressions come from, but when it comes to 'gift of gab', a moment like this inspired it.  Use it wisely, though, or you won't be able to shake your new fans.\n\n \n\n\n \n \n\n\n\n\n    At this time your mind is probably in high gear and you will tend to get involved with family, neighborhood or community activities. Increased travel is also likely.   \n \n\n\n\n\n\n\n\nJune 24th for Memo\n \n \n \n \n \n \n \n    Some information that affects you personally is important for you to process and understand today, especially if it requires doing some follow-up on the phone or with a letter.\n\n\n  \n\n \n \n    It may be hard to leave the past in the past, if feelings were hurt and need to heal.  If this is so, follow the advice you would give to others on the matter, dear.\n\n\n  \n\n \n \n    Communications with relatives and neighbors pick up now and your involvements outside of the home are also likely to increase, my friend.  This is a favorable time for business and public relations.\n\n \n\n\n \n \n\n\n\n\n\n\n    Others may seek you out today for advice regarding relationships or other personal issues.  They do so with good reason for they sense that your intuitive gifts are at a peak right now.\n \n \n\n \n \n\n\n    Any requests you want to make should be submitted now.  You're likely to get your foot in the door of any place that requires steep competition.  Luck is on your side.   \n\n \n \n\n\n    My friend, family matters are likely to cause some frustrations or disagreements now, however, you can weather any storm.  Hasty decisions could bring wasted action.  Limit your travel to necessity.\n \n\n\n\n\n\n\n\n    Next week, a sense of stubbornness could be in the air, Memo, requiring some diplomacy.\n\n                       Best Regards, \n                        \n\n\n\n\n\n    If at any time you no longer wish to receive your weekly forecast, you can simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400, and I will stop emailing them to you. It's as simple as that. My only desire is to help you, Memo.\n\n"}