{"category": "spam", "to_address": "adamsidio@yahoo.co.in", "from_address": "adamsidio@yahoo.co.in", "subject": "Good  day", "body": "Hello my friend,\nI am the chairman of the contract award committee of the N.N.P.C.\nAfter due deliberation with my partner, I decided to forward to you this\nbusiness proposal, we want you to assist us receive the sum of US28.6minto your account.\nThis fund resulted from an over-invoiced contract awarded by us under the\nbudget allocation to my ministry and the bill was approved for payment by\nthe concerned ministries. The contract was executed, commissioned and the\ncontractor was paid his actual cost of the contract. Now, we are left with\nthe balance of US28.6m as the over invoiced amount, which we have\ndeliberately over estimated for our own use. Please note that the law\nforbids civil servants to operate or own foreign accounts hence this\ncontact, we have agreed to share the money in the following percentages: 30\nfor you, 60 for us 10 for tax as may be required by your government.\n\nNote that this transaction is very much free from all sorts of risk hence\nthe business was carefully planned before it was successfully executed and\nwe the officials involved in the deal have put many years in service to our\nministry. We have been exercising patience for this privilege for so long\nnot until the presidential announcement last week, that all foreign\ncontractors owed be paid forthwith, this will enable the presidency\nreconcile our debt ratio with the outside world and to most of us, this is a\nlifetime opportunity we cannot afford to miss. Upon indication of your interest\nto fully co-operate with us, you shall furnish us with your full banking details \nwhere this money will be lodged into and the payment format will be sent to you for completion.\n\nBe informed also that this payment application will enable us seek approvals of this funds from the relevant government quarters within 2-3 banking days\n\nAs soon as we confirm receipt of this money in your nominated bank account,\nmy partner and I shall come over to your country to arrange for our own share\nand possibly invest part of this money in your country.\n\nLet honesty and trust be our watchword throughout this transaction. I shall\nfurnish you with some details about myself. Your prompt reply will be highly\nappreciated.\n\nBest regards.\n\nMichaels I S A.\nPhone+\n\n"}