{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Jack Rosa\" <pomfenixdirectomex@fenixdirecto.es>", "subject": "Say goodbye to extra pounds", "body": "\nMake your fat friends envy you\n\n\n\n\n\nAnatrim – The newest and most exciting product for weighty people is now easily available – As seen on BBC\n\n\n\nDid you know that redundant body kilos kill a lot of people every year? We believe you hate the ugly look of people like those and the social bias against them. \n\nOr, maybe, you got no will to resist a siege of your terrible eating habits. Does it all sound familiar? Then we have something for you!\n\n\n\n\n\nWe’re proudly introduce you Anatrim, the recent product for the reduction of your body’s extra weight. The most astounding thing is that Anatrim improves the quality of your life, making you crave less food and giving you better spirit. Here are some notes received from our customers:\n\n\n\n\n\n\"It is amazing! \n\n\nInstead of watching TV continually and stuffing myself with food \n\n\nI became rather more interested in taking exercise.\n\n\n\n\n\n\n Anatrim placed me on the right path.\n\n\n I have a great form now and lots of men fix their eyes on me!\"\n\n\n\n\n\n\nAmelia B., Boston\n\n\n\n\n\n\n\"I tried some passive weight losing, but with little result. This terrible hunger would just rush in and spoil everything. \n\n\nOne day I heard about Anatrim in the commercial and I was really impressed at the information.\n\n\n I had tried using it, and my wife said to me that I had changed for the better since then, 5 months later. \n\n\n35 pounds off and it is still far to an end! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nRikky Martin, Boston\n\n\n\n\n\nAnatrim helps your brain to realize that you got no such great need for that much food. It raises your spirit, provides you with energy, and attacks useless kilos. Great thanks to its mighty newly-elaborated formula!!\n\n\n\nPry out more!\n\n\n\nhttp://www.componso.com/?g36974726845756A7E7A666A71746868776670786A69337C7977743366w7vytklt\n"}