{"category": "spam", "to_address": "Theorize <theorize@plg.uwaterloo.ca>", "from_address": "Vanessa Carpenter <suzstan@graffoto.com>", "subject": "How to make your girlfriend happy", "body": "\n\nTired with your sexual problems? Looking for an effective and cheap solution?\nBuy medications at RX online drug store!\nMake your life better. Even your sexual partner won't know you are using Viagra if you buy it here.\nClick here\nLicensed medications you can by right now!\nWith best regards,\nVanessa Carpenter\n \n \nI besprichinnyj na Pervyj vzgliad vyzov Dosu Plamia na tolkuchke srazu obretaet smysl. Nesmotria na preobladaiushchuiu chast raboty po raschistke puti, vypolniaemoj Nkotom, na nashu doliu prepiatstvij vse zhe hvatalo s izbytkom. Nikto ne zastrahovan ot sluchajnostej, sposobnyh izmenit Sobytiia korennym obrazom. Na vsiakij sluchaj ia otsledil ih prodvizhenie do granic Skaniruiushchej seti i. \nNe meshalo by kak-nibud otvlech ego Ot mrachnyh myslej. Zatem pristroil fliagu obratno, Leg na spinu i zakryl glaza. Poslednij shtrih Kogda ia vnov vybralsia iz rasseliny naruzhu, obe sestry sideli na skameechke Pered osirotevshim bez hoziaina domikom Ostina Valigasa tam zhe, gde i ostavil Ih pered uhodom, ubedivshis, chto im nichego ne ugrozhaet. Niuh u nee otmennyj, i ty dlia nee pahnesh kuda Appetitnej, chem ia. Netrudno bylo Dogadatsia, chto posluzhilo tomu prichinoj, no po etomu povodu mag ne ispytal ni Malejshih emocij. M-da-a. Tolko. Ia znaiu tvoj vopros. \nPovertev sigaretu v palcah, Kengsh slabo usmehnulsia: Prokliatie galtov, sovsem zabyl: teper Dos ne smozhet ee zazhech. Plotoiadnyj les vskore ostalsia daleko pozadi, a mestnost Snova nachala meniatsia. Otkuda-to iz-pod ego plashcha vyskolznul chernyj chemodanchik i zamer vozle Moih botinok. Kraia ee nakrenilis, rezko oseli v storonu razloma Dvadcatimetrovym sklonom, po poverhnosti pokatilas moshchnaia nepreryvnaia Pulsaciia, slovno v glubine zemnoj tolshchi zabilos neveroiatno ogromnoe Serdce. ejisuminyon UkFHXFBeQEp0RV1VHUFCUEZWRlleXR1XVA==\n \n\n\n"}