{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Jerrold Myles\" <wuferosgelpab@erosgel.com>", "subject": "Losing weight has never been so easy", "body": "\nMake yourself more attractive to others\n\n\n\n\n\n\nAnatrim – The newest and most exciting flesh loss product is now available – As were told on BBC.\n\n\nDo you hold in your memory all the situations when you plead to yourself to do anything for being delivered from this fastly growing pounds of fat? Fortunately, now no great offering is necessary. Thanks to Anatrim, the earth-shaking weight-reducing blend, you can achieve naturally health lifestyle and become really slimmer. Have a look at what people say!\n\n\n\n\"I hate to admit it but I was an awful food addict. \n\n\nI greedily devoured all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis torment finished after I started course of taking Anatrim! \n\n\nGod,\n\n\n\n\n my craving for food abated, \n\n\nmood improved and I turned to the happiest person in the world 20 pounds in 2.4 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nVictoria K., Bellevue WA\n\n\n\n\n\n\"I had problems with over-weight since I was a boy. \n\n\nIt’s difficult to imagine how I abhorred being mocked at school. \n\n\n\n\nI detested my weight and I abhorred even myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nIt literally pulled me out of this horror! Many and many thanks to you, guys.\"\n\n\n\n\n\nCharley Mock, Las Vegas\n\n\n\n\n\n\"Do you know what? Thanks to Anatrim my marriage was saved! I fell down into this circle, depression – eating more – more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce one of my friends pointed at your web site and I asked for my pack of Anatrim right off. \n\n\nThe result was splendid, my appetite came to acceptable level, I was in a good mood oftener, and, be sure, I became able to tighten my belt on some holes. And you see, the bedroom became cool also!\"\n\n\n\n\n\nJoe\n\n\n\n\n There is a great number of gratitudes happy people leave after trying Anatrim. Why don't you add yourself to the thousands and thousands of slender clients and take this all-natural appetite decreasing power lifting product now!\n\n\nDon’t lose the chance!\n\n\n\n\n"}