{"category": "ham", "to_address": "<ip-health@lists.essential.org>", "from_address": "=?iso-8859-1?Q?Marc-Andr=E9_Gagnon?= <ma.gagnon@umontreal.ca>", "subject": "[Ip-health] Canada's Lost leadership on AIDS", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nA short editorial in the Toronto Star (Canada) blasts the utter failure of the federal government's scheme to provide patented medicine to developing countries\nhttp://www.thestar.com/article/228529\n\nTORONTO STAR\nLost leadership on AIDS\nJune 24, 2007 (Editorial)\nAnother year has gone by and another session of Parliament has adjourned without a single generic drug flowing from Canada to the AIDS-ravaged countries of Africa.\n\nCanada was hailed as a world leader in May 2004 when the former Liberal government passed legislation setting up a system to allow makers of low-cost generic drugs the right to make copies of well-established medications still under patent protection to fight diseases such as HIV/AIDS, tuberculosis and malaria.\n\nBut the law became the target of disputes between major drug manufacturers and those that produce generic drugs. As a result, not a single pill has been sent to poor countries. At the International AIDS Conference last August in Toronto, Health Minister Tony Clement promised to review legislation immediately. That review was to be done by May, but the report was never filed. Now, debate on improving the legislation cannot even begin until Parliament resumes in mid-September.\n\nMeanwhile, 8,000 people every day die of AIDS.\n\nUnfortunately, Prime Minister Stephen Harper has shown little leadership on this issue. Indeed, Stephen Lewis, former United Nations Special Envoy for HIV/AIDS in Africa, calls the delay on the legislation \"entirely deliberate and premeditated.\"\n\nRegrettably, Canada could have led the world on this initiative. But as Harper indicated when he refused to attend the AIDS conference, helping Africa's poor and sick appears not to be on his priority list.\n--\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}