{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Aldo Lowery\" <cebcalligraphhog@calligraph.net>", "subject": "Control your weight and appetite", "body": "\nBecome fit and happy again\n\n\n\n\n\nAnatrim – The very up-to-date and most exciting product for weighty people is made available now – As you could see on BBC\n\n\n\nDid you realize superfluous body kilos kill a lot of people around the planet? We believe that you hate the ugly look of those people and the low status they have in society. \n\nOr, maybe, you got no will to resist a pressure of pernicious eating habits of yours. If this all sounds familiar, then we got something to propose to you!\n\n\n\n\n\nHere there is Anatrim, the recent product for the reduction of your body’s extra weight. The astounding thing about Anatrim is it improves the quality of your life by making you crave food less and giving you gay spirit. Pay you attention to some notes received from our customers:\n\n\n\n\n\n\"It’s great! \n\n\nI stopped gorging any food close at hand and watching TV \n\n\nI became rather more interested in taking exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I have a great form now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nLusia R., Texas\n\n\n\n\n\n\n\"I tried some passive weight losing, you know, but all came in vain. I was rather difficult for me to hold in my ravenous appetite. \n\n\nOnce I heard about Anatrim from my very best friend and I was really impressed at the information.\n\n\n I had tried to take it, and my wife told me that I had changed for the better since then, 3 months later. \n\n\n28 pounds off and I continue to become slimmer! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nRikky Martin, San Diego\n\n\n\n\n\nAnatrim helps you to realize you don't need that much food. It lifts your mood up, gives you extra energy, and attacks needless kilos. Especial thanks to its powerful original formula!!\n\n\n\nElicit latest news!\n\n\n\n"}