{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Letter to the Editor (Wall Street Journal): Thailand's Compulsory Drug Licensing", "body": "This letter to the Wall Street Journal is from:\n\nSongphol Sukchan\nDirector of Press Division\nDepartment of Information\nBangkok, Thailand\n\n\n-----------------------------------------------------\n\n\nThailand's Compulsory Drug Licensing\nMay 16, 2007; Page A19\n\nYour May 7 editorial \"Thai Flu Moves South1\" requires that facts be set\nstraight about Thailand's decision to use compulsory licensing on three\nlife-saving drugs.\n\nFirst, the use of compulsory licensing is permissible under the World\nTrade Organization's Trade-Related Aspects of Intellectual Property\nRights (TRIPs) Agreement. The consistency of Thailand's decision with\nWTO rules has not been disputed, including by the U.S. Trade\nRepresentative. And while this was the first time Thailand used such a\nmeasure, we were not the first to do so.\n\nSecond, the decision was not made lightly. We recognize the importance\nof intellectual property protection to maintain incentives for\ninnovation, as well as the need to balance this with access to\nmedicines to safeguard public health. With the lives of more than\n500,000 people living with HIV/AIDS and 300,000 patients with coronary\nproblems at stake, the government could not afford to stand by and\nwatch. Preserving and improving human life and ensuring people have\naccess to health-care products are causes we trust are shared by\nleading pharmaceutical companies as part of their corporate social\nresponsibility.\n\nThird, public health is a top priority of the government. The\ngovernment strives to provide universal access to health care for all\nThais. For many years, the budget for health and health care ranked\nnumber two, just after education. It has increased nominally and\nproportionally from 4% of the total national budget in the 1980s to\nmore than 11% in 2007. Unfortunately, this increase cannot keep pace\nwith the prices of certain life-saving drugs. The budget for\nanti-retroviral drugs alone increased to more than $100 million in\n2007, from around $17 million in 2004. While continuing vigorously to\npromote good health practices and HIV prevention, the government must\nalso improve access to treatment without jeopardizing the overall\nbalance in the allocation of budget resources for other development\npurposes.\n\nFourth, the Public Health Ministry's announcements on compulsory\nlicensing are for public, noncommercial use only. This means the\ngeneric version of the medicines manufactured or imported under\ncompulsory licensing will cover patients under the government's\nhealth-care programs. Some 20% of Thais can afford to pay out of their\nown pockets, and more than two million foreign patients will continue\nto pay market prices for the original patented products.\n\nFifth, Thailand is a developing country facing the challenge of a wide\ngap in income and wealth distribution. The costs of drugs like Kaletra,\na second-line anti-retroviral drug, which had cost around $2,200\nannually per patient before dropping to $1,000 in April, are immense\nfor a country whose average GDP per capita was $3,179 in 2006 and where\nthe poorest 20% of the population owns less than 5% of national income,\nwhile the richest 20% own more than 50% of the national wealth. Many\npatients remain barely able to afford treatment without government\nsupport. Out of the more than 10,000 patients who require second-line\ntreatment like Kaletra, less than 15% have access to the drugs. Out of\nthe 300,000 patients with coronary problems, less than 10% have access\nto Clopidogrel, also known as Plavix.\n\nSixth, it had taken the Thai Ministry of Public Health more than two\nyears, including discussions with pharmaceutical companies, before it\nmade its final decision. After the compulsory licenses were announced,\nthe Public Health Ministry still maintained dialogue with all\nstakeholders to find mutually acceptable solutions.\n\nSeventh, of the three compulsory licenses announced, only one has been\nimplemented. In January 2007, a deal was signed between the Government\nPharmaceutical Organization and an Indian drug firm to import 66,000\nbottles of generic Efavirenz. The first batch has already arrived and\nreduced prices by more than half, allowing an additional 20,000 AIDS\npatients under the government's health-care programs to acquire the\nmedicine.\n\nEighth, compulsory licensing is neither linked to the current political\nsituation in Thailand nor connected to the country's other economic or\nfinancial measures announced or implemented recently. Compulsory\nlicensing is used to protect public health and save lives. Such matters\nshould not be politicized.\n\nSongphol Sukchan\nDirector of Press Division\nDepartment of Information\nBangkok, Thailand\n   \tURL for this article:\nhttp://online.wsj.com/article/SB117926703442404014.html\n\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}