{"category": "ham", "to_address": "Walter Landry <wlandry@ucsd.edu>", "from_address": "Kern Sibbald <kern@sibbald.com>", "subject": "Re: Bacula: GPL and OpenSSL", "body": "On Friday 08 June 2007 10:30, Walter Landry wrote:\n> Kern Sibbald  wrote:\n> > On Friday 08 June 2007 01:46, Steve Langasek wrote:\n> > > I have seen various FSF FAQs over the years that have claimed that\n> > > distributing binaries linked against OpenSSL is ok, but these FAQs\n> > > have been mute on the matter of distribution as part of an OS.  >\n> > \n> > I haven't seen them, but that doesn't surprise me as I don't believe\n> > that FSF ever really wanted to prohibit linking against OpenSSL, and\n> > if they did, they have clearly changed their minds since the GPL v3\n> > permits it.\n> \n> I do not think that GPLv3 permits it.  \n\nGPL v3 *is* compatible with the OpenSSL (actually the Apache) license \naccording to FSF.\n\n> The OpenSSL license has the \n> obnoxious advertising clause\n> \n>  * 3. All advertising materials mentioning features or use of this software\n>  *    must display the following acknowledgement:\n>  *    \"This product includes cryptographic software written by\n>  *     Eric Young (eay@cryptsoft.com)\"\n>  *    The word 'cryptographic' can be left out if the rouines from the \nlibrary\n>  *    being used are not cryptographic related :-).\n\nI don't particularly like the above, but I don't find it obnoxious, \nparticularly because Bacula doesn't do advertising (I don't consider our \nmanual as advertising materials), and if we did, I don't see any reason not \nto mention OpenSSL.\n\nI can understand that other people have different feelings about it, but what \nbothers me is that because FSF does not like this kind of clause, they \ndeclare that the OpenSSL license is not compatible with GPL v2 and thus they \nrestrict my rights ...  so much for Free Software !\n\n> \n> The current draft of GPLv3 allows some additional provisions such as\n> \n>   d. limiting the use for publicity purposes of names of licensors or\n>   authors of the material; or\n> \n> but nothing like the advertising clause.\n> \n> Cheers,\n> Walter Landry\n> wlandry@ucsd.edu\n> \n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}