{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "405a 6/10 Update: Shuttle-station docking on tap", "body": "\n\n\n\n\n405a 6/10 Update: Shuttle-station docking on tap\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 32\nPosted: 4:01 AM, 6/10/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-29 (06/09/07): Pulled up insulation blanket on rocket pod assessed\n   SR-30 (06/09/07): Crew awake; updated FD-2 timeline; rendezvous timeline; TPS inspection on tap\n   SR-31 (06/09/07): MMT reviews initial inspection results\n   SR-32 (06/10/07): Shuttle Atlantis closes in on space station\n\n=================================\n\n4:00 AM, 6/10/07, Update: Shuttle Atlantis closes in on space station\n\nThe shuttle Atlantis is closing in on the international space station today for a long-awaited linkup to deliver a new crew member and a $367 million set of solar arrays. The new arrays are needed to boost the lab's power and help pave the way for arrival of European and Japanese research modules late this year and early next.\n\nShuttle commander Rick Sturckow will fly a standard rendezvous profile, approaching the lab complex from behind and below. The terminal phase of the rendezvous procedure begins with a critical rocket firing at 1 p.m. At that point, the shuttle will be trailing the space station by about 9.2 miles.\n\nOn final approach, at a distance of about 600 feet directly below the station on an imaginary line known as the R-bar, Sturckow will guide Atlantis through a slow end-over-end flip known as a rotational (or rendezvous) pitch maneuver. The RPM maneuver will take about nine minutes to complete - three quarters of a degree per second - allowing the station crew to photograph the shuttle's belly with video and digital cameras equipped with 400-mm and 800-mm telephoto lenses.\n\nThe idea is to document the condition of the shuttle's fragile heat shield tiles so engineers at the Johnson Space Center can determine if any impact damage might have occurred during launch Friday. The RPM is one of the most effective post-Columbia techniques for spotting critical damage that might pose a threat during re-entry.\n\nAn ongoing analysis of launch-day video and a detailed inspection of the shuttle nose cap and wing leading edge panels Saturday is not yet complete. But so far, there are no indications of any debris impacts from the shuttle's external tank that might cause problems during re-entry.\n\nThe most significant anomaly to this point is a 4-inch by 6-inch triangular section of insulation blanket that somehow got pulled up during launch. The blanket is located on the upper surface of Atlantis' left side Orbital Maneuvering System rocket pod.\n\n\"There's not a great deal of concern over it right now, but there's a lot of work to be done and we'll do that in the coming days,\" John Shannon, chairman of NASA's Mission Management Team, said Saturday.\n\nTemperatures on the upper surfaces of the OMS pods reach 1,000 degrees  in places. On the nose cap and wing leading edge panels, it exceeds 3,000 degrees.\n\nThe astronauts inspected the nose cap and reinforced carbon carbon leading edge panels Saturday. During final approach to the space station today, Expedition 15 commander Fyodor Yurchikhin and flight engineer Oleg Kotov will photograph the shuttle's belly as Sturckow guides the ship through the RPM.\n\n\"We'll basically fly up the R-bar and then we will look to stop our approach around 600 feet, and we'll do a full 360-degree pivot while the station crew takes photographs of the underside of the space shuttle Atlantis,\" Sturckow said in a NASA interview.\n\nKotov will snap 800-mm photos while Yurchikhin will handle the 400-mm lens. The pictures and video will be downlinked later in the day.\n\nWith the R-bar pitch maneuver complete, Sturckow will fly Atlantis through a slow quarter-loop to a point about 400 feet directly in front of the station with the shuttle's tail pointed toward Earth and its open payload bay pointed toward pressurized mating adapter No. 2 on the front of the Destiny laboratory module. From there, flying the shuttle from the aft flight deck, Sturckow will manually guide Atlantis to a precision docking.\n\nHere is a timeline of today's activities, including highlights from NASA's television schedule (revision C); in EDT and mission elapsed time. NOTE: NASA rounds down when producing its television schedule. Docking, for example, is predicted to occur at a mission elapsed time of one day 20 hours zero minutes and 40 seconds, or 3:38:40 p.m. In the chart below, that is rounded up to 3:39 p.m. while NASA's TV schedule rounds it down to 3:38 p.m.\n\nEDT........DD...HH...MM...EVENT\n\n06/10/07\n09:08 AM...01...13...30...STS/ISS crew wakeup\n10:23 AM...01...14...45...Group B computer powerup\n10:38 AM...01...15...00...Rendezvous timeline begins\n11:28 AM...01...15...50...NC-4 rendezvous rocket firing\n12:38 PM...01...16...60...Middeck prepped for docking\n12:48 PM...01...17...10...Spacesuit removal\n01:01 PM...01...17...23...TI BURN\n01:05 PM...01...17...27...ISS in attitude\n01:25 PM...01...17...47...ISS in proximity operations mode\n01:37 PM...01...17...59...Sunset\n01:59 PM...01...18...21...Range: 10,000 feet\n02:03 PM...01...18...25...Sunrise\n02:08 PM...01...18...30...Range: 5,000 feet\n02:09 PM...01...18...31...U.S. 2A, 4A arrays feathered\n02:13 PM...01...18...35...Range: 3,000 feet\n02:17 PM...01...18...39...MC-4 rendezvous burn\n02:21 PM...01...18...43...Range: 1,500 feet\n02:22 PM...01...18...44...RPM start window open\n02:26 PM...01...18...48...Range: 1,000 feet\n02:29 PM...01...18...51...KU antenna to low power\n02:30 PM...01...18...52...+R bar arrival directly below ISS\n02:35 PM...01...18...57...Noon\n02:36 PM...01...18...58...Range: 600 feet\n02:38 PM...01...19...00...Start pitch maneuver\n02:39 PM...01...19...01...P6-Sb array feathered\n02:41 PM...01...19...03...RPM full photo window close\n02:46 PM...01...19...08...End pitch maneuver\n02:48 PM...01...19...10...Initiate pitch up maneuver\n02:49 PM...01...19...11...RPM start window close\n03:00 PM...01...19...22...+V bar arrival; range: 310 feet\n03:00 PM...01...19...22...Russian arrays feathered\n03:00 PM...01...19...22...Range: 300 feet\n03:05 PM...01...19...27...Range: 250 feet\n03:08 PM...01...19...30...Sunset\n03:09 PM...01...19...31...Range: 200 feet\n03:11 PM...01...19...33...Range: 170 feet\n03:13 PM...01...19...35...Range: 150 feet\n03:17 PM...01...19...39...Range: 100 feet\n03:20 PM...01...19...42...Range: 75 feet\n03:24 PM...01...19...46...Range: 50 feet\n03:28 PM...01...19...50...Range: 30 feet; start station keeping\n03:33 PM...01...19...55...End station keeping; push to dock\n03:34 PM...01...19...56...Sunrise\n03:37 PM...01...19...59...Range: 10 feet\n03:39 PM...01...20...01...DOCKING\n04:03 PM...01...20...25...Hard mate\n04:03 PM...01...20...25...Leak checks; PGSC reconfig\n04:33 PM...01...20...55...Docking system prepped for entry\n04:43 PM...01...21...05...Group B computer powerdown\n04:58 PM...01...21...20...Post-docking PGSC reconfig\n05:03 PM...01...21...25...Hatches open\n05:08 PM...02...21...30...Videotape replay of docking on NTV\n05:18 PM...01...21...40...SRMS grapples S3/S4\n05:33 PM...01...21...55...Welcome ceremony\n05:38 PM...01...22...00...Safety briefing\n06:03 PM...01...22...25...S3/S4 unberthing\n06:03 PM...01...22...25...Anderson seat liner transfer\n06:30 PM...01...22...52...Mission status briefing on NTV\n07:13 PM...01...23...35...REBA checkout\n07:23 PM...01...23...50...S3/S4 handoff\n07:28 PM...01...23...50...Equipment lock preps\n08:43 PM...02...01...05...SRMS ungrapples S3/S4\n09:03 PM...02...01...25...SRMS moves positioned for S3/S4 attach viewing\n09:18 PM...02...01...40...EVA-1: Procedures review\n11:23 PM...02...03...45...EVA-1: EV1/EV2 mask prebreathe\n\n06/11/07\n12:18 AM...02...04...40...EVA-1: Crew lock depress to 10.2 psi\n12:38 AM...02...05...00...ISS crew sleep begins\n01:08 AM...02...05...30...STS crew sleep begins\n\nAfter leak checks and hatch opening, Yurchikhin, Kotov and NASA astronaut Sunita Williams will welcome the shuttle astronauts aboard and provide a quick safety briefing. Later in the day, Clay Anderson's custom Soyuz seat liner will be transferred to the station and he will officially become a member of the Expedition 15 crew, sleeping aboard the station while Williams joins the shuttle crew.\n\nOn past flights, rendezvous and docking would have capped a busy day in space. But for Atlantis' crew, docking will kick off an equally busy afternoon of work to pull the 36,000-pound S3/S4 solar array truss segment from the shuttle's cargo bay so it can be handed off to the station's robot arm and safely \"parked\" overnight.\n\nThe S3 (starboard 3) segment features a powerful rotary joint that will slowly rotate the station's right-side solar arrays to keep them face-on to the sun. The S4 segment includes two telescoping solar blankets that will stretch 240 feet from tip to tip when fully extended Tuesday.\n\n\"The robotic arm operations will actually start immediately after docking, but even prior to us opening the hatches between the space shuttle and the space station,\" shuttle pilot Lee Archambault said in a NASA interview. \"Right after docking Pat Forrester and myself will go ahead and grapple the payload with the space shuttle robotic arm. This is about a 30-minute procedure. Pat will be flying the arm and I'll be assisting him, but it's kind of a tricky procedure in that Pat's going to have to reach across the belly of the shuttle payload bay and over the top of the payload and grab it from the starboard grapple fixture on the payload.\n\nForrester will have just an inch or so of clearance between S3/S4 and the OBSS heat shield inspection boom mounted along the right wall of Atlantis' payload bay. As he is lifting the payload straight up from its perch in the payload bay, he will have to jog it slightly to the left to avoid the OBSS. It is a delicate procedure because of the payload's inertia and the need to avoid any overshoots that could cause it to hit anything.\n\nA similar maneuver was required last September when the P3/P4 truss segments were installed.\n\n\"I am what we call R1 for the space shuttle arm,\" Forrester said in a NASA interview. \"I will reach into the payload bay of the space shuttle and will grapple the S3/S4 truss. The grapple fixture is on the S3 portion, and right after that the hatches will be opened, we’ll say our hellos to everyone on board station and then we’ll get right back to work. And, with Lee Archambault as my R2, we will pull the S3/S4 Truss out of the bay, put it through a series of maneuvers and bring it to a point where we can turn it over to the computers, what we call automated maneuvers, and then the computers will fly that arm and the truss section attached out to a position where we can hand it off to the space station robotic arm.\n\n\"The S3/S4 weighs about 35,000 pounds, very similar to P3/P4. It’s just a little bit heavier, and I think to date this will be the heaviest payload that we’ve delivered to station. The folks, the trainers in the robotic area have simplified things for us and have designed a series of what we would call one-axis maneuvers as we bring it out of the bay and then shift it a little bit to the port side of the orbiter to move it away from the new boom that we carry for inspections. Then we’ll bring it out a little bit higher, push it back a little, do a couple other small maneuvers, and then it’ll be in a position for the computers to fly. So actually it’s a very simple task.\"\n\nAt that point, Archambault said, \"I will hurry over to the space station and then assist Suni Williams, who's one of our space station crew members, and she will have the space station robotic arm ready to go. She will move in and double grapple, if you will, the payload with the space station robotic arm. And then once we get the payload grappled with the space station robotic arm, it will now be double grappled, and then I'll hurry back over to the space shuttle and then assist Pat in ungrappling the space shuttle robotic arm from the payload, and that's where we'll complete our arm operations for that day. We'll leave the payload grappled to the space station robotic arm in that handoff position overnight.\"\n\nAstronauts Jim Reilly and Danny Olivas will spend the night sealed up in the space station's Quest airlock module as part of a new \"camp out\" procedure before a planned spacewalk Monday to electrically connect and outfit the new truss segment. The airlock's pressure will be lowered from 14.2 pounds per square inch to 10.2 psi to help the spacewalkers purge nitrogen from their blood and prevent the bends when working in their 5-psi spacesuits.\n\nA detailed overview of Monday's spacewalk will be posted later in the day.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}