{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Power Marketing Association<Power.Marketing.Association@calcium.netcontentinc.net>", "subject": "Optimizing Genco Assets in New ERCOT Nodal Market  May 9-10 San Antonio", "body": "Campaign Manager\n\n\n\n\n\n\n\n\n\nOATT Reform\n\n\n\n\n\n\n \nOptimizing Genco Assets in the New ERCOT Nodal Market\n  \nMay 9 - 10, 2007  Sacramento, CA\nClick Here \n            To Download A Complete Conference Brochure\n Click Here For A Complete Listing\n              Of Upcoming Conferences\n\n\n\n\n\n\n\n\n\n\n\nOverview:\n       \n\nThe goal of this two-day seminar is to prepare market participants for the new ERCOT Nodal Market. The seminar will use concrete case studies to illustrate the impact of the new nodal market on the bottom-line profit for your genco assets.\nThe seminar will cover the following “hot” issues:\n\n\nWhat are the main objectives of the ERCOT Nodal Market?\n\nWhat are the key differences between the existing zonal market and the new nodal market?\n\nHow should you best prepare your genco team (portfolio managers, traders, risk managers, back-office personnel, and plant managers) for the ERCOT Nodal Market?\n\nHow can you formulate unit offers to fully account for price and volumetric risks, operational constraints, production costs, and market mitigation rules?\n\nHow should you formulate energy and ancillary service offers to maximize total profits while meeting operational constraints and risk guidelines?\n\nWhat rules does ERCOT use to mitigate unit offers?\n\nHow well can you forecast costs, revenues, profits & losses, fuel consumption, and emissions for units that are scheduled by ERCOT?\n\nHow can you verify that the ERCOT real-time dispatch is “optimal” for your units?\n\nWhat rules does ERCOT use to penalize units for uninstructed deviation?\n\nHow much money are you leaving on the table if you decide to self-schedule selected units? Or can you profit by self-scheduling?\n\nHow does a lower availability affect revenues and profits for your portfolio?\n\nWhy does ERCOT penalize market participants for deviating from day-ahead schedules?\n\nWhat rules does ERCOT use to compute bid-recovery payments and charges?\n\nWhat are the key risk drivers in ERCOT? What is the best way to formulate hedging strategies for your genco assets?\n\nHow should you structure CRR contracts to hedge against congestion costs?\n\nIn the long run, will your plants collect enough revenues from the energy, capacity, and ancillary service markets to cover for their operating and capital costs?\n\nWhat are the key settlement charge types in the new ERCOT Nodal Market?\n\nWho Should Attend\n\n\nPortfolio managers and traders responsible for formulating and submitting energy and ancillary service offers to ERCOT.\n\nBack-office employees who need to gain a good understanding of the new settlement rules that are currently proposed for the ERCOT Nodal Market.\n\nPower-plant managers who would like to understand the impact of LMPs on their plant profitability.\n\nGenco executives who need a good understanding of the potential impacts of the new ERCOT Nodal Market on their genco profits and losses.\n\nEmployees of ISO/RTOs, attorneys, and regulators who need to understand market rules, congestion management philosophy, and mitigation guidelines that are proposed for the new ERCOT Nodal Market.\n\n \n\n\n\n\n\nRegister today!\n\n\n\n\nClick\n        Here To Download A Complete Conference Brochure\n\n\n\nUpcoming \nConferences\n    Best Practices for Energy Risk Management\nNew York, NY\n  April 8-11, 2007\n  Coal \n  Gasification 2007: The Path Forward\nDenver, CO\n  April 11-13, 2007\n    The 7th Annual National Multicultural Business Conference\nLas Vegas, NV\n  April 11-13, 2007\n   Wall \n  Street Green Trading Summit VI\nNew York, NY\n  April 16-17, 2007\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n\n\n\n\n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}