{"category": "ham", "to_address": "Andrew Coopers <amcooper@flax9.uwaterloo.ca>", "from_address": "\"UNICEF News\" <unicefnews@unicef.org>", "subject": "UNICEF e-news: Demobilizing child soldiers", "body": "\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUNICEF and Chad agree on demobilizing child soldiers\n17 May 2007\n\n\n \n\n\n\n\n\n\n\n\n\n\nDear Andrew:\nUNICEF and the Government of Chad have signed an accord to demobilize child soldiers throughout the country.\nThe agreement was signed last week by UNICEF Representative Stephen Adkisson and Chad’s Secretary of State for Foreign Affairs, Djidda Moussa Outman. It follows up commitments made by Chad in February at the ‘Free Children from War’ conference, which was held in Paris and organized by UNICEF and the French Government. \nThat conference resulted in the Paris Principles, an agreement to end the use of children in armed forces or groups around the world. The new accord in Chad is seen as an important step toward putting the principles into practice. \n“It was a strong demonstration of will on the part of the Chadian Government to ensure that all children under the age of 18 will be removed from any kind of military service,” Mr. Adkisson said. Learn more about this landmark agreement.\nHere are other stories that you may be interested in:\nDays of Peace’ in the Philippines!\nFor decades, a conflict between the government and the Moro Islamic Liberation Front has raged in the southern Philippines, leaving many children without access to essential immunization and nutrition services. But under an agreement between UNICEF and the rebel group, fighting was suspended recently so that health workers could carry out a two-week campaign known as ‘Days of Peace’. More...\n‘Bling’ with a conscience\nWearing a lot of diamonds is known nowadays as ‘blinging’ – but there is also a growing awareness that many armed conflicts in Africa have been funded by the sale of diamonds. A new documentary, ‘Bling: A Planet Rock’, follows three hip-hop artists to war-torn Sierra Leone, where they gain a new understanding of what ‘blood diamonds’ are and how the diamond trade affects children. More...\nUNICEF\nFor every child\n                                    Health, Education, Equality, Protection\n                                    ADVANCE HUMANITY \n\n\n\n\n\n\n\n\n© AP Photo/Prinsloo\nSudanese refugees in Chad protest the use of child soldiers in the region.\nAUDIO: UNICEF Representative Stephen Adkisson talks about the demobilization of child soldiers in Chad.\n listen (Real Player)\n\n \nRelated links\nNews note: UNICEF and Chad agree to demobilize child soldiers\n\n\nAccord with Chad raises hopes for children in armed conflict\nParis conference makes historic commitment to liberate children from war\nSubscribe to the UNICEF Newsletter\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nUNICEF now offers two RSS feeds: UNICEF News, with the latest stories from our homepage; and UNICEF Photo Essays, featuring images from around the world.  Find out more. \n\n \n\n\n\n\n \n\n\n\n\nIf this email was forwarded to you, you may subscribe to our mailing list by going to http://www.unicef.org/e-newsletter.\nRefer a friend to this email. \nChange your options: Delivery, format, or update your e-mail address. \nStop receiving these messages\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}