{"category": "ham", "to_address": "\"Gerald (Jerry) Carter\" <jerry@samba.org>", "from_address": "simo <idra@samba.org>", "subject": "Re: [PATCH] Implement simple means of supporting pam_winbind UPN\n\tlogins.", "body": "On Sat, 2007-06-30 at 17:50 -0500, Gerald (Jerry) Carter wrote:\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA1\n> \n> Simo,\n> \n> > Ok, but in this case, why don't you simply pass the \n> > unresolved name to winbind_auth_request() and let winbindd\n> > resolve internally the name? I am not a fan of doing\n> > stuff on the \"client\" side of the fence.\n> \n> Much bigger change.  See Gunther's original patch.\n\nFair enough.\n\n> What is your technical objection to the upn->sid->name\n> conversion?  Not \"being a fan\" is too vague.\n\nI am not fond of the fact that we can retrieve the SID from the client\nside at all, but I need to elaborate more to explain that so let just\nput this discussion aside for now.\n\n> IMO the client side is the perfect place to do much of\n> this stuff and if \"winbind use default domain\" had been in\n> the client code to begin with, winbindd itself would have\n> had many fewer bugs wrt to name translation.\n\nWell that may be true, or perhaps just translating immediately at the\nentry/exit point would have been ok as well. I think the real problem\nwas that we let the untranslated name leak everywhere.\n\n> Also doing combination operations like this prevent the\n> winbindd API from inheriting esoteric calls.  Why add a\n> new call to the API when you can write a wrapper around\n> to existing calls.  Given that pam_winbind is not\n> performance critical, as long as we don't introduce\n> inappropriate delays, this should be fine.\n\nIt depends on the context in which you use pam authentication.\nIf you use it only for system/ssh login it is probably ok, while on a\nbusy POP/SMTP email server (or apache with pam_auth) with a few\nthousands of users the pam_winbind performances may be much more\ncritical.\n\nThat said, the reduction in the number of lines of code, may still be a\ngood enough reason to prefer your patch over other approaches.\n\nSimo.\n\n-- \nSimo Sorce\nSamba Team GPL Compliance Officer\nemail: idra@samba.org\nhttp://samba.org\n\n"}