{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "950p 6/13 Update: Spacewalk ends", "body": "\n\n\n\n\n950p 6/13 Update: Spacewalk ends\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 53\nPosted: 9:47 PM, 6/13/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-48 (06/13/07): Solar array retraction work begins\n   SR-49 (06/13/07): Solar array retracted 7.5 bays; EVA on tap; Russian computers down again\n   SR-50 (06/13/07): Spacewalk begins\n   SR-51 (06/13/07): Solar array pulled in nearly 50 feet; more work Thursday but flight controllers pleased with progress\n   SR-52 (06/13/07): Russian computer troubleshooting continues\n   SR-53 (06/13/07): Spacewalk ends\n\n=================================\n\n9:47 PM, 6/13/07, Update: Spacewalk ends\n\nAstronauts Pat Forrester and Steve Swanson wrapped up a grueling seven-hour and 16-minute spacewalk today after partially retracting a solar array blanket and setting up a powerful rotary joint needed to turn another set of arrays to follow the sun. When the spacewalk ended, Forrester was getting alarms for high carbon dioxide levels in his suit but NASA officials said he was never in any danger.\n\nThe astronauts did not fully activate the starboard solar alpha rotary joint, or SARJ, as originally planned after flight controllers discovered two drive motors apparently were wired backward. Commands sent to drive lock assembly No. 1 actually went to DLA-2 and vice versa.\n\nPlaying it safe, flight controllers told Swanson and Forrester to leave one launch lock engaged to make sure the newly installed S4 solar array blankets, which stretch 240 feet from tip to tip, can't inadvertently move while engineers make sure they understand the operation of the starboard SARJ.\n\nOtherwise, Forrester and Swanson accomplished all of their primary objectives, helping ground controllers retract the 115-foot-long P6-2B solar array blanket some 45 feet, installing internal braces to stiffen the S3 segment and removing a variety of launch locks and restraints from the SARJ to get it ready for operation.\n\n\"Very nice job today, guys,\" astronaut Jim Reilly radioed from inside the station. \"Excellent work.\"\n\n\"Thanks for the help, you and the ground,\" one of the spacewalkers replied.\n\n\"Houston concurs, you guys did a great job today,\" astronaut Megan McArthur chimed in from mission control.\n\nThis was the 85th spacewalk devoted to station assembly and maintenance since construction began in 1998 and the second for Atlantis' crew. Astronauts Jim Reilly and Danny Olivas spent six hours and 15 minutes attaching the S3/S4 solar array truss Monday while Swanson and Forrester logged seven hours and 16 minutes today, for a cumulative mission total of 13 hours and 31 minutes. Total station spacewalk time through 85 EVAs now stands at 522 hours and 36 minutes.\n\nReilly and Olivas plan to stage a third spacewalk Friday. Among other tasks, the astronauts plan to repair a pulled-up insulation blanket on the shuttle's left-side Orbital Maneuvering System rocket pod. Anchored to the shuttle's robot arm, one of the spacewalkers will push the 4-inch by 6-inch blanket back in place and use a surgical stapler to secure it for re-entry.\n\nA fourth spacewalk, by Swanson and Forrester, is scheduled Sunday to accomplish any unfinished tasks, to perform \"get aheads\" for future assembly work and to finish the P6-2B solar array retraction, if necessary.\n\nAdditional details will be posted here after this evening's mission status briefing.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}