{"category": "ham", "to_address": "Andy Lester <andy@petdance.com>", "from_address": "chromatic <chromatic@wgz.org>", "subject": "Re: t/codingstd/perlcritic.t needs to be optional", "body": "On Wednesday 27 June 2007 22:38:17 Andy Lester wrote:\n\n> It'd have to be against the last update from svn of the file itself.\n\nYes.\n\n> I'm not sure I like the idea of relying on a given VCS.  I know\n> Parrot's hosted in Subversion, but what about the Git folks?\n\nAs soon as they start reporting failures in the metadata tests, I'll start to \nbelieve we should consider that they run the full test suite.\n\nI haven't seen them report any failures from the metadata tests.  Thus I \nconclude that, if any such folks exist, they don't have a lot of motivation \nto report failures.\n\n> It smells funny to me.\n\nAll I know is that I've made more than my share of commits in the past six \nmonths to fix broken tests of non-functional requirements.  I'm all for code \nquality and standards and removing even all warnings, but *people don't run \nthe full test suite reliably before they commit anyway*.  Heck, you didn't \neven *compile* before one of your checkins yesterday.\n\nI can't believe that adding more tests--tests that analyze some subset of the \n3800 files in the repository and perform a lot of IO to do so--will encourage \npeople to run the tests more often.\n\nIt's my experience (and advice I give people in exchange for money in \nprofessional contexts) that making tests faster and less painful to run \nencourages people to run them more often.  Faster, more frequent feedback \nenables many very good things.\n\nRunning all of the coding standards tests on all of the files in the \nrepository--even the ones we didn't change--on every full test run goes \nagainst my strongly-held personal advice.  We certainly don't do that for the \ntests of the configuration and code-generation systems, and those are \nFUNCTIONAL tests.\n\nAgain, I'm all for code quality.  I think these tests are important--but \nthey're only important *if* people run them.  Adding minutes to the full test \nrun is one sign of a not-right approach.\n\n-- c\n\n"}