{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Scotty Goss\" <lexexpertcomfortvub@expertcomfort.com>", "subject": "Make your fat friends envy you", "body": "\nMake yourself more attractive to others\n\n\n\n\n\n\nAnatrim – The latest and most delighting product for over-weight people is now available – As were seen on BBC.\n\n\nDo you count up all the situations when you plead to yourself to do any thing to get rid of this quickly growing pounds of fat? Luckily, now no great sacrifice is required. Thanks to Anatrim, the earth-shaking weight-reducing medley, you can get healthier life style and become really slimmer. Have a look at what our customers say!\n\n\n\n\"It’s difficult to confess but I was a junk food addict. \n\n\nI swallowed up all this trash \n\n\nand just could not stop. \n\n\n\n\nThis fatal passion finished after I started taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my inclination to eat constantly abated, \n\n\nmood improved and I’m the happiest person in the world 21 pounds in 2.2 months. \n\n\n\n\nI can tell you now I became the happiest person!\"\n\n\n\n\n\nLusia R., San Diego\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nIt’s difficult to imagine how I abhorred being derided at school. \n\n\n\n\nI abhorred my stoutness and I abhorred myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nThis stuff literally dragged me out of this dreadful nightmare! The very sincere thanks to you, my friends.\"\n\n\n\n\n\nRikky Martin, Boston\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was saved! I got into this circle, depression – more eating – just more depression. My wife had thought to leave the overweight psycho I was turning in. \n\n\nMy best friend showed me web page and I called for Anatrim at the time. \n\n\nThe final result was great, my appetite became normal, I was in a good mood oftener, and, certainly, I became able to tighten my belt on some holes. And the bed became cool, too!\"\n\n\n\n\n\nDave\n\n\n\n\n There many and many testimonials left by delighted people taking Anatrim. Don’t you wanna add yourself to the tens of thousands of slender buyers and try this original appetite-suppressing energy raising product now!\n\n\nDon’t miss the chance!\n\n\n\n\nhttp://www.uronire.com/?g3667235756C7A666A71746868354571337C7977743366w7jygscb\n"}