{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "AssurX NERC Team<AssurX.NERC.Team@calcium.netcontentinc.net>", "subject": "NERC Reliability Compliance Strategies Webinar  April 17", "body": "\n\n\n\nCountdown to NERC: Mandatory Electric Reliability Compliance Strategies Webinar -- by AssurX and Vines Group -- April 17, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOn April 17, 2007 AssurX, Inc. and the Vines Group will be hosting a Webinar covering strategies for dealing with the mandatory NERC electric reliability compliance standards. Experts from AssurX and the Vines Group will discuss the current state of affairs and provide attendees with an overview of the urgent need for compliance management as a result of the newly mandated federal reliability standards initiative and offer some strategies for establishing a robust compliance program.\n\n\n\n\n\nAgenda\n\nCurrent status of NERC compliance process\nRegistration process\nSelf-certifications by entity\n\n\nElements of a strong compliance management program\nWhat it means to be “Auditably Compliant”\nWhy compliance documentation has to be “Readily Retrievable”\nWhy is self-reporting and gap analysis tracking important?\nHow an effective Corrective Action Program supports compliance management\n\n\nEstablishing ownership within the organization\nAt what level is ownership assigned\nWhat ownership means\n\n\nStaffing a new utility compliance organization\nInitial compliance validation, documentation, and certification needs\nProgram management needs (centralized and decentralized viewpoints)\n\n\nAn auditor’s viewpoint of compliance\n\n\nCommon pitfalls during compliance management implementation\nLack of flexibility\nInadequate initial documentation\nInsufficient reporting and tracking capability\n\n\nAssurX, provider of CATSWeb ER (Electric Reliability) compliance system will demonstrate its business solution offering.\n\n\nQ&A session\n\n\nWho Should Attend\nThe presentations will benefit a wide range of power generation and distribution industry members, including regulatory, quality, operations, compliance and power/transmission executives and managers.\n\nSchedule\nPlease join us for this 1-hour session that will include a 45-minute presentation by the featured speakers, followed by an interactive Q&A session.\n\nJoin Us\nApril 17, 2007 - 10:00 AM Pacific/1:00 PM Eastern\n\nTo register for this Webinar: http://www.assurx.com/NERCSignup.html\n\n\nSpeaker Bio\nDale Vines is Managing Director of The Vines Group, a consulting firm specializing in Regulatory Compliance and Risk Management for electric utilities and power providers. Mr. Vines has worked in a variety of operational and corporate roles for major U.S. electric utilities as well as the nuclear power industry, and has led teams assessing organizational effectiveness against regulatory standards, industry-developed criteria, and operational best practices. He has played key roles in developing the regulatory compliance processes for the emerging transition to mandatory reliability standards, and deploying Enterprise Risk Management programs. Mr. Vines holds a Bachelors Degree in Electrical Engineering (Power Option) from Mississippi State University and a MBA in Finance and Management from Tulane University.\n\n\nLearn more: http://www.assurx.com/nerc/\n\n\n\n\n\n\n\n\n\n© 2007 AssurX, Inc.\n\t\t\t\t\t\t\t\t\t\t\t18525 Sutter Boulevard, Suite 150, Morgan Hill, CA 95037\n\n\n\n\n\n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}