{"category": "ham", "to_address": "<icommons@lists.ibiblio.org>, <cc-community@lists.ibiblio.org>", "from_address": "\"Jessica Coates\" <j2.coates@qut.edu.au>", "subject": "[cc-community] Behold the CC Video Slam!", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi all\n \nJust wanted to drop you a quick line to point out a great collaborative\nfilm project CCau took part in over the weekend – the Open Channel Video\nSlam (http://www.openchannel.org.au/artslaw/index.html).\nApologies for cross posts.\n \nBasically the idea was to produce one 10 minute film, made\nentirely out of CC and original content, by locking 22 filmmakers in a bar for 33\nhours a whole lot of equipment, wireless internet access, and coffee, alcohol\nand pizza. The event was organised by Andrew Garton\nof the Open Channel Screen Resource Centre (http://www.openchannel.org.au) a\ngovernment funded film production and training centre, and was hosted by Horse\nBazaar (http://www.horsebazaar.com.au/)\na great digital-arts bar in the heart of Melbourne\nthat hosts the Digital Fringe Festival each year. Elliott Bledsoe and I from\nCCau were both there to help with training and addressing tricky issues (eg licence\ncompatibility, searching etc). \n \nWhat we ended up with was a 10 minute film that incorporates\n110 CC-licensed works – photos, video, sound, music. This final product\nwas screened in Horse Bazaar and on the big screen in Melbourne’s cultural hub, Federation Square,\nat 7pm Monday 14 May. It’s also available for download under a BY-NC-SA\nlicence at http://openchannel.org.au/blogs/videoslam/.\n\n \nIt was a truly amazing experience, and a great learning\ncurve for both us and the participants. Elliott and Andrew both documented the\nexperience on their blogs (http://openchannel.org.au/blogs/videoslam/\nand http://elliottsawitfirst.blogspot.com/).\n We’re also hoping to write up some of the lessons learned in an\narticle, and maybe even an academic paper.\n \nJessica Coates\nCCau\n \n\n\n\n"}