{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Candace Boswell\" <Murdock6Shelleynameplate@africana.com>", "subject": "countersink mimicking bust;", "body": "\n\n\n\ncountersink mimicking bust;\n\nAnd Miswess, she is goan sleep, too. She had everything Somerset Maugham had ever written (once Paul found himself wondering dourly if she had John Fowless first novel on her shelves and decided it might be better not to ask), and Paul began to work his way through the twenty-odd volumes that comprised Maughams oeuvre, fascinated by the mans canny grasp of story values.\n\n\nShe began to laugh with him, instead. well she wouldnt interrupt him while he was working, but shewould take each days output as soon as he was done, ostensibly to fill in the missing letters, but actually - he knew this by now, just as sexually acute men know which dates will put out at the end of the evening and which ones will not - to get her fix. Paul went on, wanting to take a cab, but he was supposed to walk at least a mile every day and this was his mile and it hurt like hell and to take his mind off the mile he started wondering where that kid had come from, where the shopping cart had come from, and most of all where the skunk had come from.\nDimly he seemed to hear some madly enthusiastic sportscaster - Howard Cosell or Warner Wolf or perhaps that all-time crazy Johnny Most - describing the scene, as if his effort to get at her drug supply before the pain killed him was some strange sporting event - a trial substitution for Monday Night Football, perhaps. She was taking extravagant care of him, changing the bandages on his weeping stump every eight hours (and at first, she had informed him with the air of one who knows she will never get a medal for what she has done - although she deserves one - she had done it every four hours), giving him sponge baths and alcohol rubs - as if to deny what she had done. Annie turned to him and smiled again.   well she wouldnt interrupt him while he was working, but shewould take each days output as soon as he was done, ostensibly to fill in the missing letters, but actually - he knew this by now, just as sexually acute men know which dates will put out at the end of the evening and which ones will not - to get her fix. This time it was Hezekiah who grabbed Ian, but the bushes rustled again and Geoffrey looked into the clearing, his breath momentarily catching in his throat, as a bit of fabric may catch on a thorn - he felt like a man who must walk up a rocky hill with a load of decayed and dangerously volatile explosives in his arms. \n\n\n"}