{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 6/18/07 - Is it too Late to Invest in China?", "body": "Cabot Wealth Advisory\n\nJune 18, 2007\n\nSalem, Massachusetts\n\n-----\n\nLessons from a Previous Life\n\nBankers and BRICs\n\nInformed Medical Decisions - Here's One!\n\n-----\n\nEditor's Note\n\nI received an email from a reader today asking, in short, if it was too\nlate to invest in China.\n\nTo me, that's a bit like asking if it's too late to teach your\nfour-year-old to swim.\n\nOr if it's too late to buy real estate in Brazil.\n\nIn short, \"No.\"\n\nThe Chinese economy remains strong, and Chinese stocks continue to act\nextremely well, shaking off all the bad news that's been thrown their way\nin recent months.\n\nFirst there was the contaminated pet food.  Then there was the\ncontaminated toothpaste.  And now there's the child/slave labor at rural\nbrick factories.\n\nBy American standards, every one of these stories exposes a violation of\nhuman (or animal) rights.  Yet through every one, Chinese stocks keep\nrolling onward and upward.\n\nAnd why?  Because money goes where it's treated best, and today it's\ntreated better at fast-growing companies in China than in slow-growing\ncompanies in the U.S.\n\nNow, many people, repulsed by stories like those above, refuse to invest\nin China.  And I understand their thinking.\n\nBut I know from experience that if you delay investing in a company or a\nstock until all the problems are gone, you usually find yourself investing\nnear the top!\n\nThe fact is, bull markets climb a wall of worry, so the fact that China\nstill has plenty of worries is a good thing.  Of course, the knowledge\nthat the Chinese government is working hard to fix all the country's\nproblems it can before next summer's Olympics is comforting, too.\n\nBut most important is the knowledge that the Middle Kingdom is fast making\nup for lost time, and that Chinese stocks are still strong.   \nAnd that's really all we need to see.\n\nUsing our \"simple\" but proven system, editor Paul Goodwin steered Cabot\nChina & Emerging Markets Report to a gain of 76% last year, topping all\nother investment newsletters, and last I knew, he was still in first place\nfor 2007.  That's the power of the Chinese market!\n\nSo I'm going to let Paul take it from here, and I'll be back to you on\nThursday.\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n-----\n\n>From the desk of Paul Goodwin\n\nIn one of my earlier careers, I worked for a consulting design firm\nthat did everything from product design and packaging to branding,\nre-branding and marketing.  As a writer/information designer, my job\nwas to figure out how to cut all kinds of text up into chunks that\npeople could chew and make it tasty enough that they would want to.\n\nPart of the genius of this company was that people like me were part of\nthe mission team from the beginning, sitting in on early interviews\nwith clients, taking part in research and focus group exercises.  And\nfrom my present perspective as a Cabot editor, one particular moment\nstands out in my memory.\n\nThe client was a large bank (since gobbled up by an even larger one)\nthat wanted to offer a new set of services to \"high net-worth clients,\"\nor as we called them, rich people.  The trouble was that rich people\nare hard to lure into focus groups; they had better things to do, and\ntheir natural instinct was to talk about themselves as little as\npossible.  Needless to say, the $50 and a free lunch that would make a\nfocus group attractive to most people didn't pack a lot of punch with\nthem.\n\nEventually, we figured out a way to get the rich folks into the room;\nwe offered to donate $1,000 to the charity of their choice in their\nname.\n\nThe results of the group discussion weren't really surprising.  It\nturned out that what rich people wanted most was one person at the bank\nthat they could call to get things done.  Junior bounces a check at\nYale?  Call the personal banker.  Need to transfer money from one\naccount to another?  Personal banker.\n\nBut during the discussion of how these people handled their money, one\nof the rich guys said that he handled money for just about everyone in\nhis family.  In essence, he was the family's investor.  And he said\nthat he had been averaging returns of about 35 percent a year for the\nprevious five years!\n\nThat was impressive enough, but the moment that sticks in my mind came\nlater, as we were discussing the results of the day's interviews.  One\nof the bankers was shaking her head and said, \"35 percent, do you know\nhow much risk he had to take to get that kind of return!?!\"\n\nThere I was, sitting there admiring the guy's skill at getting great\nreturns, and the bankers were freaking out about his risk level.  Well,\nbelieve me, I now know what they were talking about.\n\nBrazil, Russia, India and China - the BRIC countries that my Cabot\nChina & Emerging Markets Report concentrates on - all have fast-growing\neconomies and plenty of young companies that are riding the emerging\nmarkets growth wave.  But they also have lots of money chasing the\nstocks of those companies, including lots of it run by institutional\ninvestors like the bankers who were so horrified by the rich focus\ngroup man (and mutual fund managers and hedge fund honchos and private\nequity folks).\n\nThese investors, the whales who make the waves that individual\ninvestors have to swim through, are a prime source of the volatility\nthat makes emerging markets such a risky business.  And the reason they\ngenerate so much volatility is that they are constantly trying to\nfigure out the future.\n\nThey have to try, of course, because they are in charge of investment\npositions so large that any big surprise can trap them holding millions\nof dollars of a stock ... without any way of getting out.  Their\npositions are so large that it can take weeks to sell out the\nportfolio's holdings without swamping the market.\n\nAs editor of the Cabot China & Emerging Markets Report, I sometimes do\nbattle (very indirectly) with these institutional whales.  A sudden\nrise or drop in the price of an emerging markets stock often reflects a\nchange in opinion by some big money manager about what might happen in\nthe next year or so.\n\nUnfortunately (or fortunately for us aggressive growth investors) these\nmanagers are often no better at predicting the future than any other\nset of prognosticators, including people who read tea leaves and those\nwho watch the furriness of caterpillars to get a read on the coming\nwinter.\n\nI'll stick to what I know: that stocks that are going up tend to keep\ngoing up; that good stock stories supported by good numbers are better\nthan either one alone; that avoiding a 10% loss is better than booking\na 10% gain; and finally, that everything that the market knows about a\nstock will show up in its chart.\n\nI try not to let the bankers get me down.  You should, too.\n\n----- Advertisement -----\n\nHow Does Cabot Pick Emerging Markets Stocks?\n\nPaul Goodwin, editor of Cabot China & Emerging Markets Report, looks\nfor promising companies benefiting from the rapid growth in the\neconomies of the BRIC countries (Brazil, Russia, India and China).\nThese companies must also meet strict criteria regarding fundamentals\nand technicals. These recommendations will have healthy balance sheets\nand will show solid growth.\n\nVisit the link below to see the explosive profits from the\nfast-growing opportunities Paul recommends. See how your $5,000 can\nsoar to $10,000, $15,000, $25,000 - or more - over the next two to\nthree years.\n\nRated #1 Top Performing Newsletter for 2006 by The Hulbert Financial\nDigest:\nhttp://cabotmail.net/t/199332/13148861/93/0/\n\n-----\n\nUsing the simple criteria laid out above, I've been able to find a\nboatload of top-notch BRIC stocks in recent years.  I could just give\nyou one of my previous recommendations, but you get ideas like that all\nthe time from Tim.  Today, I want to chat about a stock that has\ninterested me for more than two years ... and actually just took a huge\nleap today on great earnings.  It's a perfect example of an\nunderappreciated stock with a great story and great numbers that is\nfinally getting support from investors.\n\nThe company is China Medical Technologies (CMED), a Beijing-based\ndeveloper and marketer of medical equipment.  The company's lead\nproduct is a machine that used high-intensity focused ultrasound (HIFU)\nto destroy solid cancers and benign tumors.  The HIFU system doesn't\nrequire an incision; it just destroys the tumor from outside the body,\nwhich then cleans up the dead tissue.  This non-invasive system has\nbeen used on over 40,000 patients in China, on liver, breast and kidney\ntumors, as well as tumors in the pelvic cavity and on bones.  Reports\nsay that patients typically feel no discomfort and can usually walk\naway from the treatment.\n\nSince I first heard about the HIFU machine (and about GE's investment\nin China Med), I have been waiting for word that the company was going\nto seek a clinical trial in a Western country.  I thought that this\nwould be the signal for the stock to go through the roof.  But that\nhasn't happened.\n\nInstead, China Med has continued to grow its revenues and earnings\ninside China.  The company's immunoassay system, in-vitro diagnostics\nand other diagnostic products have (along with HIFU, of course) kept\nrevenues growing fast.  And it's hard to argue with the company's\nafter-tax margins, which have topped 50% for the last six quarters!\n\nStill, the stock has just 11 institutional sponsors, in part because\nthe float is just 18 million shares.\n\nAnd looming over every other fact about the company and the stock is\nthe possibility of what might happen if the HIFU machine ever threatens\nto break out of China.\n\nA positive earnings report this morning led to a very nice breakout\nfrom the stock's old base at 24, kicking CMED above 32 today on big\nvolume.  That's not bad for a stock that I once called a\n\"trick-or-treat\" stock - one that would either flop or fly, but not\nmuch in between.\n\n-----\n\nEditor's Note:  If you'd like to get the jump on stocks like China Med and\nbuy before they break out, consider a trial subscription to Cabot China &\nEmerging Markets Report.  Every issue includes my candid assessment of the\nChinese market, as well as a detailed analysis of the one best stock to\nbuy now.    If you sign up this week, you'll get your first issue next\nweek!  To get started, simply click here.\n\nhttp://cabotmail.net/t/199332/13148861/93/0/\n\n-----\n\nThose of you who enjoy doing your own research will have a good time\nwith China Medical's website (www.chinameditech.com).  You'll find a\ngood story with good numbers in a good market.  And who knows, the\nstock might not even need the long-awaited HIFU machine to power its\nadvance.\n\nChina's most-recent budget includes an enormous increase in\nexpenditures on national health care.  And it will take all that money\nand a whole lot more to even begin to deliver the high level of medical\ncare enjoyed by China's city dwellers to the folks out in the\nprovinces.\n\nMy guess is that China Medical will thrive in this richer environment.\nThe company has worked very hard to make its diagnostic products simple\nand reliable enough to be used by small country clinics.  Even leaving\nthe HIFU machine out of the equation, I think this company will be a\nwinner.  And if HIFU ever takes off ... well, that will be a big cherry\non top of the sundae.  Aggressive investors who take a small position\nin CMED won't be bored.\n\nPaul Goodwin\nFor Cabot Wealth Advisory\n\n-----\n\n\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=199332&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}