{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Kristen Hayes <six_foot_nine@globe-electric.com>", "subject": "Virgin penetrator", "body": "\n\nCan't satisfy your girlfriend? Do you want to?\nGo to the site\nAbsolutely legal, licensed and CHEAP pills at your choice. Confidential purchase. Instant shipping\nBuy medications at RX online drug store!\nYou don't need to look for a drug store in your area. We deliver high-quality pills worldwide.\nWith best regards,\nKristen Hayes\n \n \nLico ego blestelo ot pota, stekavshego Tonkimi strujkami ot kornej volos k uzkomu podborodku, i bez togo temnye Glaza potemneli eshche bolshe. Prikasaias k ego spine, razminaia Tverdye, napriazhennye uzly myshc silnymi, privychnymi k takoj rabote palcami, Taj Vdrug obnaruzhila, chto ispytyvaet iavnoe seksualnoe udovolstvie, chto ne moglo ne Izumit ee. Ia Ne mog ne verit v ego sposobnosti posle vsego togo, chto s nami uzhe Sluchilos. Onni prihodilas malcu rodnoj tetkoj, sam zhe traktirshchik, nedolgo Dumaia, stal schitat ego svoim plemiashom. \nTak chto eti parni svoego dobilis. Ostalas tolko Malenkaia zagvozdka: gde by mne spokojno posidet i perekusit, poka ne Konchitsia vynuzhdennoe ozhidanie, a? Zheludok, kstati, uzhe nachinal posylat pozyvnye na korable u menia Golova slishkom byla zaniata Nori, chtoby normalno pitatsia, i ia, chestno Govoria, ne pomnil, kogda el poslednij raz. Po merkam Leshu, polet ego mog prodolzhatsia dovolno dolgo, poetomu ia vernulsia v potok Skorosti obychnogo soznaniia. Chto moglo Byt takogo v makore seryh adalaev, chto okazalos by sposobnym ostanovit ego? Troe vsadnikov prodolzhali nestis po zasnezhennoj, stisnutoj s dvuh storon Ogromnymi stvolami kamneliubov doroge. Dumaiu, ty uzhe dogadalsia, chto eto byla za Cel. Esli on vdrug vzdumaet sovershit Pokushenie na moiu zhizn, ia, bez somneniia, budu zashchishchatsia vsemi dostupnymi Sredstvami. On pytalsia menia ubit, skvoz zuby progovoril ia, tolko sejchas Soobraziv, chto nikto etogo ne videl. No i eto otlichie Proderzhalos nedolgo !\nzasfernik shagnul i. \nOni vse edva uspeli otskochit v Storony, kogda on, slovno beshenyj uragan, pronessia sredi nih, vrubivshis grudiu V te zhe zarosli, i poshel, poshel lomat porosl, kazalos dazhe ne zamechaia Beznadezhnogo soprotivleniia lesa. Ona slishkom toropilas v svoih vyvodah, vosprinimaia slozhivshuiusia Situacii stol odnoznachno. U Menia dazhe melknula mysl, chto, mozhet byt, ne zria na korable ia v nee tak Vtreskalsia? Chto za holodnoj maskoj aristokratki na samom dele skryvaetsia Sovsem neplohaia devchonka? I vsia romantika tak neprosto skladyvaiushchihsia v Takoj slozhnoj situacii otnoshenij eshche vperedi? Nu, chto-to menia snova zaneslo. Oni Povernulis, i ih obshchaia mysl okatila nashe soznanie, kak shtormovaia volna, v Fontanah vody i peny rushashchaiasia na skalistyj bereg, obdav vse vnutri drozhiu Ledianogo oznoba: Vot nash plan, liudi. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}