{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Taylor Mueller\" <kadfinkemer@finke.org>", "subject": "Join the Anatrim revolution", "body": "\nAchieve picture perfect weight and enjoy life\n\n\n\n\n\n\nAnatrim – The latest and most fascinating lose flesh product is now easily available – As shown on ABC.\n\n\nDo you remember all the situations when you told yourself you would do any thing for being delivered from this desperately growing number of kilos? Fortunately, now no major price is to be paid. With Anatrim, the ground-shaking weight-reducing combination of elements, you can get healthier lifestyle and a really slender figure. Just look at what people write!\n\n\n\n\"It’s rather difficult to confess but I was exceedingly addicted to food. \n\n\nI ate all this garbige \n\n\nand just could not stop. \n\n\n\n\nThis ruinous passion stopped when I started course of taking Anatrim! \n\n\nGod,\n\n\n\n\n my craving for food disappeared, \n\n\nmood improved and I became the happiest person 27 pounds in 2.2 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person!\"\n\n\n\n\n\nLinda F., New York\n\n\n\n\n\n\"Since the very childhood I was a weighty boy. \n\n\nYou can't even fancy how I detested being mocked at school. \n\n\n\n\nI hated my stoutness and I detested myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nIt literally pulled me out of this awful nightmare! Thanks and thanks to you, my friends.\"\n\n\n\n\n\nSteve Doubt, Boston\n\n\n\n\n\n\"You know what? Anatrim preserved my marriage! I got into the circle, depression – eating more – more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nMy best friend showed me web site and I ordered my pack of Anatrim at the time. \n\n\nThe results were excellent, my appetite came to admissible level, I was often in good spirits, and, of course, I became able to tighten my belt on some holes. And you see me, the sex became fantastic also!\"\n\n\n\n\n\nFrank\n\n\n\n\n There is a lot of testimonials happy people leave after taking Anatrim. Don’t you gonna add yourself to the tens of thousands of slender customers and take this natural appetite decreasing power increasing product now!\n\n\nDo not decline the preposition!\n\n\n\n\nhttp://www.comav.hk/?g3667235756C7A666A71746868354571337C7977743366w7zfllrt\n"}