{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "\"CNN Political Ticker\" <politicalticker@cnn.com>", "subject": "CNN Political Ticker AM, Friday, April 20, 2007", "body": "For the latest, breaking political news, check for updates throughout the day on the CNN Political Ticker\nhttp://www.cnn.com/ticker. All politics, all the time.\n\nCompiled by Stephen Bach (stephen.bach@cnn.com)\nCNN Washington Bureau\n\nMaking news today...\n\n* Attorney General Alberto Gonzales \"failed to convince skeptical Republicans that he gave a full and accurate account\nof the firing of eight U.S. attorneys.\"  He \"encountered almost as much criticism from members of his own party as from\nDemocrats.\" (Bloomberg)\n\nGonzales \"appeared frustrated, weary and at times combative\" and he \"struggled to recall key details of his involvement\nin the firings.\" (Washington Post)\n\n\"His performance clearly exasperated the committee members, who were angered as he invoked a faulty memory more than 50\ntimes.\" (New York Times)\n\nWhite House insiders \"involved in administration discussions about Gonzales, told [CNN] White House correspondent\nSuzanne Malveaux that two senior level White House aides who heard the testimony described Gonzales as 'going down in\nflames,' 'not doing himself any favors,' and 'predictable.'\" (CNN.com)\n\n\"Bedtime for Gonzo?\" (New York Daily News headline)\n\n* Rep. John Doolittle (R-CA), \"facing escalating legal uncertainties because of his connection to disgraced lobbyist\nJack Abramoff, announced Thursday he is stepping down temporarily from his position on the powerful House\nAppropriations Committee.\" (Sacramento Bee)\n\n* \"In a second blow to House Republicans this week, the FBI raided a business tied to the family of Rep. Rick Renzi\n(R-AZ) Thursday afternoon as part of an ongoing investigation into the three-term lawmaker.\" (Roll Call)\n\nRenzi released a statement saying, \"I intend to fully cooperate with this investigation,\" and \"stepped down temporarily\nfrom the House Intelligence Committee.\" (Arizona Republic)\n\n* NM Gov. Bill Richardson on Monday \"will be the first 2008 Democratic presidential candidate to air television ads\" in\nNH. (NH Union Leader)\n\nHe'll also hit the IA airwaves with two ads starting Monday. \"Richardson said more advertising money was spent in\nIowa.\" (Des Moines Register)\n\n* Well, he is \"known for having a quirky sense of humor\" (AP): http://youtube.com/watch?v=o-zoPgv_nYg\n\n* And yes, Sanjaya is making his D.C. debut... Find out where (the 'why' remains a mystery...) in Hot Topics below!\n\nPresident's Schedule:\n\n* President Bush signs H.R. 1132, The National Breast and Cervical Cancer Early Detection Program Reauthorization Act,\nat 10:30 am ET in the Roosevelt Room. This afternoon, the president travels to East Grand Rapids, MI, for 1:05 pm ET\nremarks on the global war on terror at East Grand Rapids High School.\n\nAlso on the Political Radar:\n\n* Sen. Hillary Clinton (D-NY) appears at a Rutgers Eagleton Institute of Politics event, \"Because Politics Matters:\nWomen and Public Leadership,\" at 11 am ET in New Brunswick, NJ.\n\nAt 2:30 pm ET, Clinton speaks at the National Action Network convention in New York City.\n\n* Sen. Barack Obama (D-IL) holds an early presser at the UNH's DOT Biodiesel Fueling Facility in Durham, NH. He later\nholds a town hall at a senior center in Nashua, and a \"New England Kickoff\" at Boston University's Agganis Arena.\nDoors 6 pm ET.\n\n* Sen. Chris Dodd (D-CT) participates in a foreign policy discussion at the World Affairs Council of New Hampshire, 12\npm ET in Manchester.\n\nHe later holds a media avail at the Hartford Convention Center at 6:10 pm ET before attending the CT Dem Party's\nJefferson Jackson Bailey dinner at 7 pm ET.\n\n* Rudy Giuliani takes part in the Wiley Lecture Series at Texas A&M, 1 pm ET in College Station, TX.\n\n* Mitt Romney spends the morning with residents in Maquoketa, Anamosa, and Coralville, IA.  He later keynotes the\nIndiana Republican Party's Spring Dinner at 6:30 pm ET in Carmel, IN.\n\n* John Edwards discusses his Rural Recovery Act at a restaurant in Adel, IA, at 12 pm ET.  He later attends a community\nmeeting in Boone, IA at 2:15 pm ET, and addresses the Polk County Democrats' Spring Dinner at 7:45 pm ET in Des Moines.\n\n\n* NM Gov. Bill Richardson gives foreign policy speeches at Central College in Pella, IA (11 am ET), and U. of Northern\nIowa in Cedar Falls (4 pm ET).\n\n* Richardson and Sen. Joe Biden (D-DE) are also scheduled to attend the Polk Cty. Dems' dinner in Des Moines.\n\n* Sen. Sam Brownback (R-KS) attends the NJ College Republicans convention today in East Brunswick, NJ.\n\n* Sen. John McCain (R-AZ) attends a 3 pm ET fundraiser in Tucson, AZ.\n\n* Bill Clinton keynotes the AL Democratic Party's Jefferson-Jackson dinner in Birmingham at 7:30 pm ET.\n\n* The Senate Radio-Television Correspondents' Gallery Daybook: http://www.senate.gov/galleries/radiotv/list.htm\n\n* The House Radio-Television Correspondents' Gallery Daybook: http://radiotv.house.gov/news-events.aspx\n\n\n=================================================================\nPolitical Hot Topics\n(Today's top political stories from news organizations across the country)\n\nAG STRUGGLES \"TO OFFER A COHERENT EXPLANATION FOR DISMISSALS\": Attorney General Alberto R. Gonzales, trying to salvage\nhis job, endured withering questioning on Thursday from Senate Judiciary Committee members who expressed grave doubts\nabout his truthfulness and judgment in the firing of federal prosecutors. In more than five hours of often-combative\ntestimony, Mr. Gonzales, grim-faced, clasping his hands and hunched over, struggled to offer a coherent explanation for\nthe dismissals. He apologized for his mistakes in what he said was a flawed process, but defended the removal of eight\nUnited States attorneys as proper. \"Although the process was nowhere near as rigorous or structured as it should have\nbeen,\" Mr. Gonzales said, \"and while reasonable people might decide things differently, my decision to ask for the\nresignations of these U.S. attorneys is justified.\" New York Times: Gonzales Endures Harsh Session With Senate Panel\nhttp://www.nytimes.com/2007/04/20/washington/20gonzales.html\n\n\"FASCINATION\" WITH ROVE \"DISTURBING AND A LITTLE WEIRD\": Attorney General Alberto Gonzales sat alone at the witness\ntable Thursday, but another prominent official hovered over his Senate committee hearing: Karl Rove... Sen. Patrick\nLeahy, D-Vt., chairman of the Senate Judiciary Committee, devoted his first question to Rove, citing testimony that\nRove passed along complaints about prosecutors who \"were not being aggressive enough against so-called voter fraud.\"\nGonzales, who said he made the final decisions on dismissals, recalled a single conversation with Rove in the fall of\n2006. The White House deputy chief of staff \"mentioned to me concerns that he had heard about pursuing voter fraud,\nelection fraud\" in New Mexico, Milwaukee and Philadelphia, Gonzales testified... White House spokesman Tony Fratto\ncalled the Democrats' \"fascination\" with Rove \"disturbing and a little bit weird.\" USA Today: Rove's name keeps popping\nup in Dems' questions http://www.usatoday.com/printedition/news/20070420/a_rove20.art.htm\n\n\"THIS WAR IS LOST,\" SAYS REID: As Congressional Democrats sought to reconcile their differences and send an Iraq\nspending bill to the White House, Senator Harry Reid, the majority leader, said Thursday that \"this war is lost,\" a\nstark assessment that Republicans argued would demoralize American troops fighting in Iraq. One day after legislative\nleaders met with President Bush, failing to find common ground, House Democrats signaled their intention to step away\nfrom a mandatory deadline to remove troops from Iraq, and to work instead toward a compromise of setting a goal for\ntroops to be withdrawn next year. But the president said that any timetable for a troop redeployment, even a goal,\nwould face a veto. \"I think it's a mistake, and I've made it clear, that the Congress should not have artificial\ntimetables for withdrawal in a funding statement,\" Mr. Bush said Thursday during a speech in Ohio. New York Times:\nLeading Democrat in Senate Tells Reporters, 'This War Is Lost' http://www.nytimes.com/2007/04/20/washington/20cong.html\n\n\nBUSH TALKS IRAQ IN SMALL-TOWN OH: As the White House and Congress begin new efforts to narrow their dispute over a war\nspending bill, President Bush went to small-town Ohio today to urge a friendly audience to support the fight in Iraq\nand oppose congressional deadlines for withdrawing U.S. troops. In a question-and-answer session that lasted more than\nan hour, Bush focused almost exclusively on the war, differentiating it from the losing and costly campaign in Vietnam.\nBush also warned, as he has frequently done, that a failure to stabilize Iraq before the United States withdraws its\ncombat forces would risk allowing the war to spread throughout the Middle East and allow extremists to \"follow us\nhere.\" He also said that chaos in the region \"could cause the Middle East to enter into a nuclear arms race.\" The\naudience in the Tippecanoe High School gymnasium was made up of about 500 southern Ohioans invited by local chambers of\ncommerce and the local congressman, Rep. John Boehner, the House Republican leader. Los Angeles Times: Bush seeks war\nsupport in small Ohio town http://www.latimes.com/news/politics/la-ex-bush19apr20,1,7954079.story\n\nU.S. BUILDING THREE-MILE WALL IN BAGHDAD: A U.S. military brigade is constructing a 3-mile-long concrete wall to cut\noff one of the capital's most restive Sunni Arab districts from the Shiite Muslim neighborhoods that surround it,\nraising concern about the further Balkanization of Iraq's most populous and violent city. U.S. commanders in northern\nBaghdad said the 12-foot-high barrier would make it more difficult for suicide bombers to strike and for death squads\nand militia fighters from sectarian factions to attack one another and then slip back to their home turf. Construction\nbegan April 10 and is expected to be completed by the end of the month. Although Baghdad is replete with blast walls,\ncheckpoints and other temporary barriers, including a massive wall around the Green Zone, the barrier being constructed\nin Adhamiya would be the first to be based in essence on sectarian considerations. Los Angeles Times: In Baghdad, U.S.\ntroops build wall to curb violence http://www.latimes.com/news/nationworld/world/la-fg-wall20apr20,0,5085656.story\n\nDOOLITTLE QUITS APPROPS: Rep. John Doolittle, facing escalating legal uncertainties because of his connection to\ndisgraced lobbyist Jack Abramoff, announced Thursday he is stepping down temporarily from his position on the powerful\nHouse Appropriations Committee. His departure, which leaves him with no committee duties, comes after FBI agents raided\nhis suburban Virginia home on April 13 looking for business documents belonging to his wife, Julie. Doolittle is one of\nseven California House members on the Appropriations Committee. But he is the only member from the northern part of the\nstate and the only Californian on the Energy and Water Appropriations Subcommittee. Sacramento Bee: Doolittle off\npowerful panel http://www.sacbee.com/111/story/158268.html\n\nRENZI FAMILY BUSINESS RAIDED BY FBI: In a second blow to House Republicans this week, the FBI raided a business tied to\nthe family of Rep. Rick Renzi (R-Ariz.) Thursday afternoon as part of an ongoing investigation into the three-term\nlawmaker. Details of the raid on Patriot Insurance Agency in Sonoita, Ariz., were not immediately available. Renzi's\nmost recent financial disclosure form lists the business as an asset belonging to his wife, Roberta, and valued at $1\nmillion to $5 million. Little is known about the inquiries into Renzi's activities, but according to media reports the\nJustice Department has been running a two-track investigation into Renzi regarding a land deal, as well as a piece of\nlegislation he helped steer that may have improperly benefited a major campaign contributor. It was not immediately\nclear which investigation the raid pertained to, and neither his attorney nor his spokesman could be immediately\nreached for comment. Roll Call: FBI Raids Renzi Family Business; Congressman Leaves Intelligence Panel\nhttp://www.rollcall.com/issues/1_1/breakingnews/18070-1.html\n\nRENZI TAKES LEAVE FROM INTEL COMMITTEE: Rep. Rick Renzi stepped down temporarily from the House Intelligence Committee\non Thursday, after the FBI raided his family's business in connection with an ongoing federal investigation. Agents\ntook documents, the Arizona Republican said in a statement issued late Thursday night. \"I view these actions as the\nfirst step in bringing out the truth,\" he said. \"Until this matter is resolved, I will take a leave of absence from the\nHouse Intelligence Committee. I intend to fully cooperate with this investigation.\" Arizona Republic: Renzi steps down\nfrom House panel after raid on firm http://www.azcentral.com/arizonarepublic/news/articles/0420renzi0420.html\n\nLEGAL STRATEGY OR JUST AN \"ODD TIME TO WED?\": Two Bush administration officials who have been linked in scandal are now\nlinked in wedlock. The union of former Deputy Interior Secretary J. Steven Griles and Sue Ellen Wooldridge could have\nimplications for the investigation into Griles's ties to ex-lobbyist Jack Abramoff. They were married March 26, three\ndays after Griles pleaded guilty to lying to Congress about his relationship with Abramoff and a previous romantic\npartner. Wooldridge was the top environmental prosecutor at the Department of Justice (DoJ) before she resigned in\nJanuary. Legal experts note that people can refuse to testify against their spouses, and that in some cases, people can\nprevent their spouse from testifying against them. \"There have been plenty of cases where marriage was a good strategy\nfor a criminal defendant,\" said Jonathan Turley, a George Washington University law professor. But he added, \"It's\nplausible they simply picked an odd time to wed.\" The Hill: Three days after guilty plea, Griles ties the knot\nhttp://thehill.com/leading-the-news/three-days-after-guilty-plea-griles-ties-the-knot-2007-04-19.html\n\nBIG VICTORY IN QUEST FOR DC VOTE: A bill giving the District its first full seat in Congress cleared the House\nyesterday, marking the city's biggest legislative victory in its quest for voting rights in nearly three decades.\nDemocrats on the House floor burst into applause, and Speaker Nancy Pelosi (D-Calif.) grabbed the arms of the\nDistrict's nonvoting delegate, Eleanor Holmes Norton, as the 241 to 177 vote was announced. \"There was nothing but joy\nin the chamber this afternoon, because we knew we had given this bill the kind of send-off that can get it through the\nSenate,\" Norton (D) said later. But the bill faces considerable obstacles. Democrats don't appear to have enough votes\nin the Senate to avoid a filibuster, and the White House has threatened a veto. Washington Post: House Approves A Full\nD.C. Seat http://www.washingtonpost.com/wp-dyn/content/article/2007/04/19/AR2007041902849.html\n\nRICHARDSON HITS THE AIRWAVES IN IA: New Mexico Gov. Bill Richardson is scheduled to begin airing television campaign\nads in Iowa next week, the Democratic presidential candidate said at a party fundraising dinner in Denison Thursday.\nRichardson will air two ads beginning Monday. One is a 60-second biographical look at the candidate; the second is a\n30-second spot on his political career, including his foreign policy experience, aides said. The ads are intended to\nincrease name recognition among Iowa Democrats in the leadoff caucus state. Ads also will begin running in New\nHampshire on Monday, although Richardson said more advertising money was spent in Iowa. Des Moines Register: Richardson\nwill start airing ads in Iowa\nhttp://desmoinesregister.com/apps/pbcs.dll/article?AID=/20070420/NEWS09/704200395/-1/SPORTS12\n\n..AND BUYS TIME IN NH: New Mexico Gov. Bill Richardson will be the first 2008 Democratic presidential candidate to air\ntelevision ads in New Hampshire. Richardson's campaign has purchased time for 60-second and 30-second spots on WMUR, a\ncampaign consultant has told UnionLeader.com. The ads, which start Monday, will talk about Richardson's record, his\nviews on Iraq and \"why he's running,\" said the campaign consultant, who asked to remain anonymous. The ads will also\nair in first-caucus state Iowa, the consultant said. He said the goal is to introduce Richardson to Granite State and\nIowa voters. New Hampshire Union-Leader: Bill Richardson takes to the air in NH http://www.unionleader.com/\n\nSOME OF OBAMA'S DONORS HAVE LOBBYING HISTORIES: Sen. Barack Obama (D-Ill.) has pledged to create a new brand of\npolitics in the Democratic presidential primary by rejecting contributions from lobbyists and political action\ncommittees (PAC), but his fundraising records show that he relies on donors with special interests. Three of Obama's\ntop fundraisers, who each have raised more than $50,000 for his campaign since January, were registered as lobbyists\nlast year, according to reports filed with the Senate Office of Public Records. In 2006, Alan Solomont of Solomont\nBailis Ventures earned $90,000 in lobbying income; Tom Reed, of Kirkland & Ellis, lobbied for the Seismological Society\nof America, the Nanobusiness Alliance, and the Airport Minority Advisory Council; and Scott Harris, of Harris,\nWiltshire & Grannis, represented Cisco Systems, Microsoft, Dell and Sprint-Nextel. All three Obama fundraisers have\nsaid they are no longer lobbyists, although the public records office has not posted contract termination reports for\nany of them. The Hill: Sen. Obama finesses his lobbyist ties\nhttp://thehill.com/leading-the-news/sen.-obama-finesses-his-lobbyist-ties-2007-04-19.html\n\n\"QUIRKY\" McCAIN JOKES ABOUT BOMBING IRAN: Republican presidential contender John McCain, known for having a quirky\nsense of humor, joked about bombing Iran at a campaign appearance this week. In response to an audience question about\nmilitary action against Iran, the Arizona senator briefly sang the chorus of the surf-rocker classic \"Barbara Ann.\"\n\"That old, eh, that old Beach Boys song, Bomb Iran,\" he said in jest Wednesday, chuckling with the crowd. Then, he\nsoftly sang to the melody: \"Bomb, bomb, bomb, bomb, anyway, ah ...\" The audience responded with more laughter. His quip\nwas prompted by a man in the audience who asked: \"How many times do we have to prove that these people are blowing up\npeople now, nevermind if they get a nuclear weapon, when do we send 'em an airmail message to Tehran?\" AP via Yahoo!\nNews: McCain jokes about bombing Iran http://news.yahoo.com/s/ap/20070419/ap_on_el_pr/on_the2008_trail\n\nEDWARDS REIMBURSES CAMPAIGN FOR HAIRCUT$: Presidential candidate John Edwards said yesterday he is reimbursing his\ncampaign $800 for his \"hair\"-brained Beverly Hills coifs. The Democratic Edwards, who has taken fire for playing to the\npoor on the campaign trail while living a first-class lifestyle, charged two $400 haircuts from Tinseltown mane maestro\nJoe Torrenueva to his campaign, federal records show. The payouts touched off a furor among middle-class voters in the\nheartland - people Edwards is counting on to propel his campaign - and prompted one Iowa newspaper to survey local\nbarbers, one of whom called the $400 price tag \"preposterous.\" New York Post: HAIR'S YOUR $$ BACK\nhttp://www.nypost.com/\n\nSANJAYA AT WH CORRESPONDENTS' DINNER: Move over Petra. Step aside Jane Fonda. Make room, Morgan Fairchild. Although all\nof the major news organizations have spent weeks bragging about their big name celebrity guests, People magazine has\npulled a great coup by grabbing someone who's sure to turn more heads than anyone else this weekend: Sanjaya Malakar,\nthe \"American Idol\" contestant whose hilarious run on the reality show finally came to an end this week. People\nmagazine has secured the hair-challenged 17-year-old to be their guest during the White House Correspondents'\nAssociation dinner (but he won't be at the magazine's party tonight at IndeBleu). Sanjaya earned his 15 minutes of fame\nby managing to go far on the tough \"Idol\" show despite an obvious lack of talent (he was bolstered by campaigns led by\nradio shock jock Howard Stern and such Web sites as www.votefortheworst.com. DC Examiner: Sanjaya to attend\nCorrespondents' dinner http://www.examiner.com/a-683959~Sanjaya_to_attend_Correspondents__dinner.html\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings go to\nhttp://audience.cnn.com/services/cnn/memberservices/member_auth.jsp?url=http%3A%2F%2Faudience.cnn.com%2Fservices%2Fcnn%2Fmemberservices%2Fregwall%2Fmember_profile.jsp%3Fsource%3Dcnn\n\nTo unsubscribe from the CNN Political Ticker list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=morninggrind\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n(c)2007 Cable News Network.\nA Time Warner Company.\nAll Rights Reserved.\n\n"}