{"category": "ham", "to_address": "Francesco Poli <frx@firenze.linux.it>", "from_address": "Gervase Markham <gerv@mozilla.org>", "subject": "Re: EPSG data reviewing in progress", "body": "I don't know if this conversation is supposed to happen elsewhere, or \nperhaps with a smaller CC list, but:\n\nFrancesco Poli wrote:\n> EPSG dataset\n> \n> Terms of use, revised 22/03/2007 (proposed - not adopted!)\n> \n> The EPSG geodetic parameter dataset is owned jointly and severally by\n> the members of the Surveying and Positioning Committee of the\n> International Association of Oil and Gas Producers (OGP), formerly\n> the European Petroleum Survey Group (EPSG). It is compiled by the\n> Geodetic Subcommittee of the OGP from publicly available and\n> member-supplied information and distributed at no charge through the\n> internet.\n> \n> The user assumes the entire risk as to the accuracy and the use of\n> this data. The data may be used, copied and distributed subject to\n> the following conditions:\n> \n>  1. INFORMATION PROVIDED IN THIS DOCUMENT IS PROVIDED \"AS IS\" WITHOUT\n>     WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING BUT\n>     NOT LIMITED TO THE IMPLIED WARRANTIES OF MERCHANTABILITY AND/OR\n>     FITNESS FOR A PARTICULAR PURPOSE.\n>  2. The data may be included in any commercial package provided that\n>     any commerciality is based on value added by the provider and not\n>     on a value ascribed to the EPSG dataset which is made available\n>     at no charge. The ownership of the EPSG dataset [OGP] must be\n>     acknowledged.\n\nThis is non-free :-( But they shouldn't be concerned about people \nselling it standalone; the customers will soon realise they've been \nduped, and bang goes that business relationship.\n\n>  3. Subsets of information may be extracted from the dataset. Users\n>     are advised that coordinate reference system and coordinate\n>     transformation descriptions are incomplete unless all elements\n>     detailed as essential in OGP Surveying and Positioning Guidance\n>     Note 7-1 annex F are included.\n\nThis second sentence, while not non-free, should not be part of the \nlicense terms, as it is not related to the license.\n\n>  4. Essental elements should preferably be reproduced as described in\n>     the dataset. Modification of parameter values is permitted as\n>     described in OGP Surveying and Positioning Guidance Note 7-1\n>     annex G to allow change to the content of the information\n>     provided that numeric equivalence is achieved. Numeric\n>     equivalence refers to the results of geodetic calculations in\n>     which the parameters are used, for example (i) conversion of\n>     ellipsoid defining parameters, or (ii) conversion of parameters\n>     between one and two standard parallel projection methods, or\n>     (iii) conversion of parameters between 7-parameter geocentric\n>     transformation methods\n>  5. No data that has been modified other than as permitted in these\n>     terms and conditions shall be attributed to the EPSG dataset.\n\nThis leaves open the question \"If I don't attribute the data to EPSG, \ncan I modify it in ways other than stated in this licence?\". This is \nambiguous. What does \"preferably\" mean, legally? Do I have to or don't I?\n\nI suggest reframing 4 and 5 something like this:\n\n4. You may copy, modify and/or distribute this data for any purpose. \nModified data sets may not be attributed to EPSG unless parameter values \nare only modified as described in OGP Surveying and Positioning Guidance \nNote 7-1 annex G, and numeric equivalence is achieved. Numeric \nequivalence refers to the results of geodetic calculations in which the \nparameters are used, for example (i) conversion of ellipsoid defining \nparameters, or (ii) conversion of parameters between one and two \nstandard parallel projection methods, or (iii) conversion of parameters \nbetween 7-parameter geocentric transformation methods.\n\nGerv\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}