{"category": "spam", "to_address": "memolink@speedy.uwaterloo.ca", "from_address": "Rochelle Zombie<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, if you never thought of yourself as lucky before...", "body": "\n\n\nMemo, if you never thought of yourself as lucky before...\n\n\n\n\n\n\n\n\n\n\n\n    Memo, in the first email, I showed you how my free forecast helped one of my friends win an award in excess of $500,000.00...\n    Well, now it is your turn, Memo, to reap riches and rewards beyond your wildest imagination. \n    In fact, it looks like you'll be entering a full-fledged \"CYCLE OF GOOD FORTUNE\" -- a time of such amazing luck, it can turn virtually your whole life completely around! \n   However, you have to act quickly, Memo. Incredible opportunities can be there for you and you must be ready to grab hold of them. That's why I'm writing you now. You need to be able to identify these lucky events and take advantage of them so you can lead the life you deserve -– today!\n\nApril 27th \n    My dear Memo,\n    Several years ago, I came across an incredible kit that uses the same secret rituals and magical tools that kings, queens and others \"in the know\" have used to activate positive influences in their lives so they could attain wealth, health, power and most importantly...happiness.\n\n    I call this marvelous collection of magical tools the \"Road to Riches Kit,\" and I truly believe it would be in your best interest during this time to have and use it. \n\n\t\t\t\t\t\t\t   The upcoming weeks can have a huge impact on success and having one of these wonderful kits could just be the key you need. \nHere's what concerns me... \n   It's very unusual, but every now and then I'll be doing a reading for someone when suddenly I get the strangest feeling...almost like a shock of electricity...and I know right away, that even though the person's life is about to take a major turn for the better, there's a chance that they won't know how to get the most out of all the astounding good fortune headed their way.    So when I got this exact feeling tonight, as I was working on the Forecast For Health, Wealth and Happiness, I said to myself, \"you better drop everything and share your concerns with Memo.\" \n    Now before I get into the details of what this \"feeling\" means, please understand I can't say precisely how it might play out in your life. Different cosmic forces present different challenges to each individual.  \n   However, judging from past experience, my best guess is, since your good fortune is so strong, if we take some prudent precautions right now absolutely nothing will go wrong. \n   This is why I decided to write today to tell you all about the Cycle of Good Fortune and how you can best take advantage of it. That's the least I could do, considering this period could change your life.\n\n\n\n\nWhat I found out...\nThe good news is that the stars show me there is a current of positive energy coming. These energies can be so strong that they can eliminate any negative influences. I'm sure you know that there is always a certain amount of negative vibrations in the environment. You don't want it blocking some of the benefits of the upcoming positive trends.You can put an end to all those nagging problems that have been following you for so long.  I think these worries  affected a decision you made long ago, which is tied to an event that you cannot forget or let go of. (I believe this may be at the bottom of recent emotional or health crises that could have affected your relationships or work.)\n\n\n\n\nBut don't worry, I know how we can deal with this easily. \n   I know you have put your trust in me so I can help you take advantage of the opportunity you've been given, and that's exactly why I'm writing to you today. Nothing would make me feel better than to see you take full advantage of the positive energy generated by your \"Cycle of Good Fortune\"!It is good to take care of this now!\n   It is essential that you grab hold NOW of the positive influences in your environment at this moment so that you can take full advantage of your \"Cycle of Good Fortune\".\n\n\n\n\n\n\nHere is what we know already... \nThis is a time when all the energies of the Universe seem to \"line up\" with your own dreams and desires, especially the ones having to do with Health, Money and Happiness. \nDuring a \"Cycle of Good Fortune,\" answers to even your worst financial problems become clear. Debts and bills get paid off almost by magic. Relationships that were strained by disagreements become happy and harmonious. Luxuries that once were far out of your reach seem to just drop into your lap. Things you gave up on long ago -- the dream house, the fabulous car, the brand-new kitchen, the collectibles or favorite \"toys\" -- suddenly become attainable. \n\t\t\t\t\t\t\t\tIn fact, so many amazing things can happen, you may find yourself wondering whose life you walked into, or pinching yourself to make sure you're not dreaming! \n\n\n   \nWe have to make sure absolutely nothing interferes\n\t\t\t\t\t\t\t\t\twith your good luck.   A cycle like this will make it possible for you to start concentrating on getting some of those nice things you've always wanted, things that you may have even given up dreaming about attaining. This is why it is so important we take full advantage of the positive energy surrounding you now.How to activate the positive energy around you and strengthen your will-to-win:\n   First, I want you to have a very special gift, absolutely free of charge. It is a very powerful and magical Mandala.\n\n  \n\n\n\n\nAs you know, the Mandala has been used for centuries by mystics from the Middle East, India, Tibet and China to reach the highest states of awareness and to focus their minds on specific cosmic forces and powers. Gazing at the intricate beauty of the Mandala, you can feel your thoughts gather, your will strengthen and positive energy build all around you!\n\n\n       The Mandala you will receive is exactly like the one I've used myself for years, and which I'm convinced has helped make my own life so fortunate.\n\n\n\n\nAs powerful as the Mandala is, it is only the first step in turning on and building up your will-to-win, so you can truly take advantage of the benevolent energies starting to surround you now. To ensure that you receive ALL the benefits of this incredible \"Cycle of Good Fortune,\" I would like you to have a very special collection of extremely powerful magical tools, appropriately called...\n\n\nTHE \"ROAD TO RICHES\" KIT \n   As I mentioned earlier, those \"in the know\" have used secret rituals and magical tools to help them change their lives and situations for the better, attract wealth and live longer, happier and richer lives. \n   Your \"Road to Riches\" Kit was designed to do the same for you, so you can fully tap into all the fantastic success that your \"Cycle of Good Fortune\" is bringing you!       Each tool and ritual in your \"Road to Riches\" Kit was specially selected to activate and intensify all the benevolent power during this important time. I put together this selection of powerful items, so you won't have to hassle with finding them yourself or worry about whether you got the right or best tools for marshalling this wealth-expanding energy. \n   What's more, your kit includes clear, easy-to-read directions with each magical tool, so you'll know what to do with each item in your Kit. It's easy, and I guarantee you'll be pleased with the results! \nHERE'S WHAT YOU'LL RECEIVE IN YOUR \"ROAD TO RICHES\" KIT:\n1: Five Invitation to Prosperity Cards\n   These 5 special cards of parchment-like paper have been \"energized\" for you, and my instructions will show you exactly how to use them to make your most heartfelt desires come TRUE -- no matter how impossible they may seem to be! \n   Delicate, beautiful parchment paper has been used to write important documents for thousands of years. The great alchemists and sorcerers of England and Ireland hand-lettered their secret enchantments on parchment. Even the most momentous document in American history, the Declaration of Independence, was written on parchment. \n2: An Elegant Prosperity-Affirming Pen \n   One thing that always makes me feel prosperous is to have a beautiful pen in my pocket. People always \"ooh\" and \"aah\" over it, and the admiration makes me feel even richer! \n   The elegant pen that is included in your \"Road to Riches\" Kit serves an even more important purpose: It will link you to the energy that is starting to flow your way. It's been engraved for you with one of my favorite Health, Wealth and Happiness affirmations, to give an extra positive \"charge\" to anything you sign or write using this special pen. \n3: A Wealth-Attracting Green Aventurine Stone\n   Gamblers, speculators and \"adventurers\" of all sorts have long sought out this beautiful stone to increase their wealth. Its velvety green color and smooth surface promotes coolheadedness, grace under pressure and, best of all, luck in attracting money. You will receive a perfect Aventurine in a lovely little pouch you can carry with you anywhere you go -- then just stand back and let the magic happen! \n4: Five Sticks of Heavenly Incense\n   The number 5 signifies Luck in everything having to do with health, money, relationships, love and games of chance. That's why you're getting 5 sticks of this marvelous incense.   We all know that fragrance has the power to transform our feelings from low to happy, from dull to highly sensitive. And the exotic perfume of incense is especially significant. Many religions use it to set a sacred mood in places of worship. Incense is also a very old symbol of both health and wealth. The herbs that make this incense were actually used as money in parts of the ancient world.\n5: The \"Road to Riches\" Kit Instruction Guide\n   Last but not least, I want to make sure you understand how all these amazing tools work together to bring you strength and security in everything you do.   So I have updated the easy-to-use instruction guide to show you how to use every item in the \"Road to Riches\" Kit. You'll never have to wonder if you \"did it right,\" because I will be guiding you every step of the way!\n\n   These magical tools are not available in any store and that is one of the reasons I'm offering them to you. The other reason is...They work! \n   But as I said before: time is of the essence. To make sure that you are fully prepared to receive ALL the Good Fortune of your Prosperity Cycle, we must act quickly. \nA 25% Savings & Totally Risk FREE \n   To make it as easy as possible for you to have this kit in your hands immediately, I've arranged to make it available to you for only $14.95, instead of the regular price of $19.95. That's a savings of $5.00!    And, I have taken all the risk on myself, so you can examine your \"Road to Riches\" kit with complete protection and peace of mind. Sending for your kit doesn't commit you to anything -- EVER. \nPlus...You have the protection ofMy Unconditional Lifetime Money-Back Guarantee\n    \"Ever\" means EVER, Memo. You can take as long as you want to try out your \"Road to Riches\" Kit. If you are not 110% satisfied with it, if you feel you didn't get the results I said you would, or even if you just change your mind, you can return your kit to me, and I will refund every penny you paid, including the shipping and handling...immediately, with no explanation necessary. \n    Memo, I don't want anything to stand in your way during this wonderful cycle...so please just click the box below so I can put your kit together and send it right out to you.    I'm putting all my psychic energies to work for you during this very important time, and I know this kit will make sure nothing gets in the way of your success. \n    Your friend,         \n\n\n\n\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for offers and discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford CT 06460-3400.\n"}