{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 106", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. What the education of the two apples of my eye has to do with\n      looted art (Museum Security Network Mailing list)\n   2. Nearly 100,000 Historical Sites Dot Saudi Landscape\n      (Museum Security Network Mailing list)\n   3. ?Bold? thefts investigated (Museum Security Network Mailing list)\n   4. Pictures stolen from antiques shop\n      (Museum Security Network Mailing list)\n   5. Heist or hoax? Museum's prized sculpture swiped\n      (Museum Security Network Mailing list)\n   6. Shelby White in Center Court at the Met\n      (Museum Security Network Mailing list)\n   7. Kunstraub bei Makler (Museum Security Network Mailing list)\n   8. Egypt will request loan of artifacts\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Tue, 1 May 2007 23:42:37 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] What the education of the two apples of my eye has to\n\tdo with\tlooted art\nTo: \nMessage-ID: <012401c78c39$a3175bb0$e9461310$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nhttp://www.michelvanrijn.nl/artnews/artnws.htm\n\nWhat the education of the two apples of my eye has to do with looted art \n\nStruggling for a money bleeding year in the UK High Court not to ?accept?\ngeese-feed that the earth is flat and the Abou Bros are not criminals and\nhave no tarnished reputation, it seems not to matter that Hicham Aboutaam\nwas convicted in the US for smuggling and falsifying provenance documents,\nit does not matter that Ali Aboutaam is a fugitive of the Egyptian law and\nhas fifteen years of prison waiting for him for conspiracy, money laundering\nand smuggling, it does not matter that I have recordings with the Abou\nlawyer Roberty in which with crystal-clarity is stated that he stopped his\nclients from having me killed, it does not matter that I was falsely accused\nby the Aboutaams of blackmail and incarcerated under Napoleonic law in\nSwitzerland until I saw a Judge some days later, was set free on the spot\nbut almost lost custody over my two boys, it does not matter that the\nCleveland Museum is ordered to hand over the Aboucadabra looted Praxiteles,\ntheir prized possession, by the Italian authorities, it does not matter that\nthe Boston -, Getty -, Kimbell -, Princeton -, Metropolitan museum all had\nand have to hand over looted Aboucadabra artworks, it does not matter that\ntrusting private collectors are targeted by the Greek and Italian\nauthorities for looted Aboucadabra works.\n\nAs a matter of fact, it does not matter at all that the Abou Bros are\npresently the epicentre and being held responsible by the Italian-,\nEgyptian- and Greek authorities as being the major criminal players in the\nshadowy world of looted antiquities. \n\n \n\nWhat really matters is to destroy the fact that as a loving father and\nsurrogate mother at the same time I am trying to raise my two boys, my two\nreasons to live, in the best way that I can, abstain from whatever smells of\nluxury myself to be able to pay for their education and that such amorality\nneeds to be singled out by the high paid shysters of the criminal Aboutaams\nin a pathetic attempt to take this ?crime? away from them and me. \n\nJust have high paid ambulance chasers doing your dirty work by papering the\nother party to death, delay the inexorable truth to come out, desperately\ntry to drain the opposition of funds and you are well on your way to\nperverting the course of Justice. \n\nNothing new in this for you, h? boys?\n\nWell done Abous, you are living up to your highly esteemed reputation\n\nhttp://www.michelvanrijn.nl/artnews/artnws.htm\n\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Wed, 02 May 2007 06:19:47 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Nearly 100,000 Historical Sites Dot Saudi Landscape\nTo: Museum Security Network Mailinglist \nMessage-ID: <46381163.5080302@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n    Nearly 100,000 Historical Sites Dot Saudi Landscape\nP.K. Abdul Ghafour, Arab News\n \n\nJEDDAH, 2 May 2007 ? Saudi Arabia is replete with archaeological sites \ndating back to thousands of years, according to Dr. Mohammed \nAl-Ruwaished, deputy minister of education for antiquities and museums.\n\n?There are nearly 100,000 historical sites in the Kingdom and we have \nalready identified and registered 3,700 main sites. Some of these have \n80 to 100 related sites in different localities,? Asharq Al-Awsat \nnewspaper quoted Ruwaished as saying.\n\nThe deputy minister disclosed that the Kingdom retrieved 1,600 rare \nIslamic coins that were in the process of being smuggled out from the \nShuaiba port recently. He commended the customs department for its role \nin preventing the smuggling of many valuable artifacts from the country.\n\nRuwaished said the Agency for Antiquities and Museums, which is under \nthe Ministry of Education, would be merged with the Supreme Commission \nfor Tourism (SCT) in two months. The SCT wants to make use of the \nKingdom?s museums and historical sites to promote tourism.\n\nPrince Sultan ibn Salman, secretary-general of the SCT, has highlighted \nSaudi Arabia?s tourism prospects in the heritage sector.\n\n?We have a large tourism market, especially in the areas of heritage and \nculture. Saudi Arabia is a first-class heritage state as there are \nthousands of antiquities and we have unearthed only a limited number of \nthem. The Kingdom?s geographical position has made it a crossroads of \ncivilizations,? Sultan said.\n\nRuwaished said his ministry has licensed 19 museums across the country, \nadding that 11 of them had received approval from the Higher Council for \nAntiquities.\n\nTwo new museums have been opened in Baha and Hail as part of a national \nplan to set up a museum in each of the Kingdom?s 13 regions. In addition \nto the National Museum in Riyadh, several historical buildings have been \nrenovated and converted into museums in Jeddah, Taif, Hofuf and other areas.\n\nThe Kingdom?s historical sites and museums will attract a large number \nof foreign tourists. The SCT chief has said that Saudi Arabia wants to \nattract 1.5 million tourists a year by 2020, excluding the millions who \ncome on Haj and Umrah pilgrimages. He spoke of the ambitious goal of \nmaking tourism to account for 18 percent of the country?s gross domestic \nproduct by 2020.\n\nRuwaished said the Kingdom had returned some stolen artifacts to their \noriginal foreign sources. ?The coordination with the Interior Ministry, \nthe customs and other related agencies were instrumental in preventing \nsmuggling of valuable artifacts and antiquities in and out of the \ncountry,? he pointed out.\n\nSaudi Arabia is a signatory of an international agreement on protecting \ncultural properties,? Ruwaished said. ?We will not allow circulation of \nany antiques without permission from the country of its origin,? he said.\n\nhttp://www.arabnews.com/\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Wed, 02 May 2007 06:20:33 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] ?Bold? thefts investigated\nTo: Museum Security Network Mailinglist \nMessage-ID: <46381191.1010003@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n* ?Bold? thefts investigated*\n \n\n\n\n/May 01 2007/\n\nSURREY\n\nSurrey RCMP are looking into a series of art thefts ? a number of them \nfrom restaurants ? following at least five reports of nicked artwork \nsince March 29.\n\nThe Peace Arch News reported on three thefts earlier this month, of \nprints on display at abc Country Restaurant (March 30), the Turkey House \n(April 10) and Aston Pacific Inn (sometime between March 30 and April \n2). The prints were part of a closed-bid Ducks Unlimited Canada fundraiser.\n\nFriday, police confirmed artwork has also been reported stolen from abc \nRestaurants in Cloverdale (March 29 and April 11) and Fleetwood (April 19).\n\nLori McPhee?s Art-Concept Gallery, at 1 15531 24 Ave. was hit April 11.\n\n?It was quite bold,? McPhee said.\n\nMcPhee said the suspect went so far as to help her hang a painting \nbefore making off with a $950 framed piece by South Surrey artist Pat \nPeacock.\n\nThe man made a dash with the painting when McPhee went to answer the phone.\n\n?He just ran, grabbed the piece and ran out the door,? she said.\n\n?I ran after him. He just threw the painting in the back (of a waiting \nvehicle).?\n\nMcPhee said it was the second time the studio was targeted. Thieves took \nthree paintings worth a combined $2,000 about one month prior, she said.\n\nAnyone with information on any of the thefts is asked to call police at \n604-599-0502.\n\nhttp://www.peacearchnews.com/\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Wed, 02 May 2007 06:21:32 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Pictures stolen from antiques shop\nTo: Museum Security Network Mailinglist \nMessage-ID: <463811CC.7080206@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nPictures stolen from antiques shop\n\nPaintings valued at nearly ?8,000 were stolen from an antiques shop in \nLong Melford.\nThe two framed oil paintings were taken from Long Melford Antiques \nCentre, in Little St Mary's, at around 2.45am on Saturday, April 28.\n\nThe store was broken into via the roof and even though the burglars \ntriggered the alarm, they still made off with the pictures.\n\nThe paintings are a pair, measuring 94x77cm (landscape) and are of \nbattle scenes. They are very dark, possibly by a Russian artist and are \nin two-inch black wooden slightly patterned frames.\n\nAnyone with information should contact Pc Niall Johnson at Sudbury \nPolice Station on 01473 613500 or Crime Stoppers on 0800 555 111.\n\nhttp://www.sudburytoday.co.uk\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Wed, 02 May 2007 06:22:11 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Heist or hoax? Museum's prized sculpture swiped\nTo: Museum Security Network Mailinglist \nMessage-ID: <463811F3.70803@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nHeist or hoax?\n\nMuseum's prized sculpture swiped\n\nBy HEATHER SCOFIELD\nCorrespondent DELAND -- The sculpture recently placed in front of the \nMuseum of Florida Art to commemorate its \"Equus III\" exhibit was a \nlife-size likeness of a horse, of course.\n\nNow it's gone -- stolen, or perhaps, horse-napped sometime after doors \nto the museum, located across U.S. 17-92 from Stetson University, were \nlocked Friday night.\n\nMuseum manager Jennifer Coolidge hopes the theft was a prank and says \nthere will be no questions asked if the horse soon reappears intact.\n\nWhen Coolidge last saw the sculpture, it was bolted to its platform \noutside the museum.\n\nBut when facilities manager Mike Keiser came to work Saturday, the \napproximately 300-pound horse no longer guarded the museum building.\n\n\"I don't understand how this happened; it was bolted down,\" Coolidge \nsaid Monday as she pointed to the platform with a small portion of the \nhorse's back hoof still attached. \"They literally ripped it right off.\"\n\nKeiser figured museum employees had brought the sparkling stallion \ninside for the weekend. He said he worked most of the day, then called \nCoolidge after growing suspicious that something wasn't right. Coolidge \nfiled a theft report with DeLand police Saturday evening.\n\nThe horse was one of 53 commissioned in 2002 by the Marion (County) \nCultural Alliance and was made using hundreds of pieces of broken CDs by \nartist Julie Valladares. It was at the Museum of Florida Art on a \ntemporary loan from the alliance.\n\n\"We've never had a horse stolen before,\" said Denise McNeff, spokeswoman \nfor the alliance. \"We're really hoping it was some kind of prank and \nwill show back up.\"\n\nMcNeff said the horse was part of a set of sculptures, by various \nartists, the alliance calls \"The In-Motion Herd\" and likely would have \nbeen auctioned to a collector this fall.\n\nSculptures in a similar set have been sold for $25,000 to $100,000 each \n-- money the non-profit organization has used to stay fiscally afloat.\n\nCoolidge said the museum would not press charges if the piece turns up \nunharmed in the next day or two.\n\nMarion Cultural Alliance Board Chairman Gerald Ergle said he leans \ntoward offering a similar amnesty but needs to consult with the \nalliance's board members before making any commitments.\n\n\"We just want the piece back,\" Coolidge said.\n\nMuseum officials have notified DeLand police and agencies that \nspecialize in locating stolen art, as well as online art brokers and \nauction sites like eBay. Stetson authorities are talking with students \nand sending out notices around the campus seeking any information about \nthe heist.\n\nLocal police are also looking for the art. Valladares, the artist, has \nnot yet been told of the theft, McNeff said, because everyone involved \nis hoping the piece will be returned before that becomes necessary.\n\n/heather.scofield/@news-jrnl.com \n\nhttp://www.news-journalonline.com/\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Wed, 02 May 2007 06:25:03 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Shelby White in Center Court at the Met\nTo: Museum Security Network Mailinglist \nMessage-ID: <4638129F.4010606@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n    Shelby White in Center Court at the Met\n    Collecting\n\nBY KATE TAYLOR - Staff Reporter of the Sun\nMay 1, 2007\nURL: http://www.nysun.com/article/53523\n\nShelby White, wearing a pale green suit and a slightly tense smile, \nwelcomed a reporter to the Park Avenue offices of the Leon Levy \nFoundation for an interview about the antiquities collection that has \nmade her famous. Choice pieces are now on view, amid 7,500 other works \nfrom institutional and private lenders and the museum's own collection, \nin the Metropolitan Museum of Art's new Greek and Roman Galleries. The \ncentral atrium of the galleries, which opened this month, is named for \nMs. White and her late husband, Leon Levy, in recognition of a $20 \nmillion gift they made to the museum.\n\nMs. White has rarely granted interviews about her collection. In \nNovember, Italy asked Ms. White to return more than 20 objects that it \nclaims were looted from Italian soil, according to the New York Times. \nTwo objects from the Levy-White collection that the Italians have sought \nin the past ? a Euphronios krater depicting Hercules slaying Cycnos and \na krater attributed to the Eucharides Painter, which depicts Zeus and \nhis cupbearer Ganymede ? are currently on view at the Met.\n\nThe Met has not been the only recipient of the couple's philanthropy: \nThrough the years, they sponsored excavations in Ashkelon, Israel, \nestablished a fund at Harvard to support archaeological publications, \nand donated $200 million to start an ancient studies institute at New \nYork University, which recently named its first director. In the \ninterview with The New York Sun ? granted on the condition that her \nquotes had to be approved afterward by her and her spokesman, Fraser \nSeitel ? Ms. White shared her thoughts about the Met opening and \nquestioned the arguments of the archaeologists who have criticized her.\n\nAsked when she became aware that standards of due diligence in the \nantiquities world were changing, Ms. White responded that it was hard to \nsay. \"In the '90s, there was talk about provenance, but that meant \ndifferent things\" to different people, she said. \"Even today, what is \nconsidered an acceptable provenance is unclear and changing.\"\n\nIn a study published in 2000 in the American Journal of Archaeology, the \njournal of the Archaeological Institute of America, the British \narchaeologists David Gill and Christopher Chippindale found that of the \nworks displayed at the Met in the 1990 exhibition \"Glories of the Past: \nAncient Art From the Shelby White and Leon Levy Collection,\" 84% first \nsurfaced after 1973. That was the year that the AIA adopted the 1970 \nUnesco convention on preventing illicit trade in cultural property, and, \nat that point, Mr. Gill said in an e-mail, museums and collectors were \non notice about the problem of looting in source countries.\n\nMs. White questioned the basis for using the Unesco convention as a \nbenchmark of legality. Asked what date she would suggest as a cut-off \nfor collectors or museums, she said she didn't really have an opinion. \n\"You could choose a date today, but would that be appropriate in 30 \nyears? I don't know, I'm not a legal scholar.\"\n\nThe director of the Met, Philippe de Montebello, last year made a deal \nwith Italy to return several disputed objects, including the Met's own \nEuphronios krater, in exchange for long-term loans of similar objects. \nBut he seems to have done so reluctantly, and in his public comments, he \nhas vigorously defended the right of museums to continue collecting \nantiquities. He emphasizes that museums make their collections available \nto many more people than governments do and that art is best seen as it \nis at the Met, in the context of many cultures. \"We are a world museum \nwith an international audience,\" he said last week, standing in the Leon \nLevy and Shelby White Court. \"This is the patrimony of all of our visitors.\"\n\nSome collectors and museum officials argue that if uncertain provenance \nhad in recent decades kept them from purchasing works that were offered \nto them these objects would simply have been snatched up by other \ncollectors, who had fewer moral qualms, and perhaps less interest in \nsharing their collections with the public.\n\nThe Princeton philosopher and author of \"Cosmopolitanism: Ethics in a \nWorld of Strangers,\" Kwame Anthony Appiah, said this is a valid concern \nas, he said, is the argument of archaeologists that buying unprovenanced \nobjects encourages further looting. \"These are both genuine \nconsiderations: disincentivizing further looting and protecting objects \nthat have already been looted,\" he said. \"It's hard to do both; it's a \ncomplicated trade-off.\"\n\nNow that the market for looted or unprovenanced cultural property in \nAmerica has largely disappeared, Mr. Appiah said, \"we have to accept \nthat a lot of this stuff ? say, in Iraq ? is just going to go into \nMiddle Eastern collections, or Japanese collections, or collections in \nother places where they don't have these scruples.\"\n\nAnother collector of antiquities, Michael Steinhardt, who is a friend of \nMs. White's and a proprietor of this newspaper, said he believes Ms. \nWhite has been singled out by the Italians for two reasons: So much of \nher collection is published, allowing the Italians to check it against \nevidence they have gathered in criminal investigations into antiquities \ndealers, and she and her husband have been such major philanthropists.\n\n\"She and her husband, Leon, have been generous to a fault to all sorts \nof institutions\" involved in study of the ancient world, he said. \n\"Therefore she is a ripe target. Those people who are pursuing her don't \nseek justice; they seek victory.\" He added: \"Further, I would say, \nShelby has stood alone, and was not as strongly defended as she should \nhave been by those very institutions to whom she had been a too-generous \ndonor.\"\n\nMr. Steinhardt himself lost a legal battle over a gold phiale from the \nfourth century B.C.E. ? a vessel used for pouring libations ? which he \nbought for $1.2 million from the dealer Robert Hecht, who is now on \ntrial in Rome for antiquities trafficking, along with the former curator \nat the J. Paul Getty Museum, Marion True. Italy claimed that the phiale \nwas illegally exported, and eventually won its return, after American \nCustoms seized it from Mr. Steinhardt's home.\n\nIn Mr. Steinhardt's view, the disproportionate targeting by source \ncountries of American collectors and museums \"reflects the weak and \ninept policy of the American government.\" American museums, for the most \npart, are not government-owned, as, say, French, Italian, and British \nmuseums are. Mr. Steinhardt said: \"It seems to me that [the source \ncountries] go after that place whose government is weakest and doesn't \nhave the courage to stand up for its citizens. The U.S. State Department \nand the U.S. cultural policy professionals have really, I think, done a \ngreat disservice to the cultural institutions in this country.\"\n\nA spokeswoman for the State Department said in an e-mail message that \nthe department had no role in the litigation of Mr. Steinhardt's case. \n\"As a State Party to the 1970 UNESCO Convention ? it is the policy of \nthe [U.S. Government] to assist countries that have a problem with \nlooting and illicit trafficking of their cultural property,\" she \ncontinued. \"The USG does not believe that the US should be a haven for \nlooted or stolen artifacts from other countries.\" She also noted that \ncurrent U.S. import restrictions \"do permit the importation of the \nrestricted antiquities if they carry valid documentation that \ndemonstrates legitimate provenance\" and that \"[t]here are many \ndocumented collections in the world that can circulate without \ncontributing to the contemporary looting of sites and from which U.S. \ninstitutions can continue to form collections.\"\n\nMs. White argued that the scrutiny of antiquities collectors has had \nunintended effects: \"We thought it was very important to lend our \nobjects, to publish and exhibit our collection,\" she said. \"The \nunfortunate thing we're seeing now is that other collectors are not \ngoing to show their collections because they don't want problems. So \nyou're seeing a lot more secrecy than 15 years ago.\"\n\n***\n\nBecause the Levys have published their collection, the Italians have \nrecently been able to learn quite a bit about it. According to the \nTimes, the Italians have traced nine objects, including the Euphronios \nand the Eucharides kraters, to Giacomo Medici, a dealer who was \nconvicted of antiquities trafficking by an Italian court in 2004. The \nLevys never bought directly from Medici, but, like other collectors and \nlike museums including the Met and the J. Paul Getty Museum, they bought \nfrom dealers who did. In the Levys' case this particularly included the \nBritish dealer Robin Symes. (Asked about the Met's business with Symes, \nMr. de Montebello said, \"Every other museum around the world was buying \nfrom the same dealers.\")\n\nAccording to Peter Watson's \"The Medici Conspiracy: The Illicit Journey \nof Looted Antiquities: From Italy's Tomb Raiders to the World's Greatest \nMuseums,\" when the Italians raided Medici's warehouse in Switzerland, \nthey found extensive records of his transactions, as well as thousands \nof photographs. The photographs often document a given object in several \ndifferent states: first broken and covered with dirt, suggesting it was \nrecently taken from the ground; then in various stages of restoration; \nthen, in some cases, on display in a museum, with Medici standing by \nproudly. Some of the objects photographed in the initial, dirt-encrusted \nstate are now in the Levy-White collection.\n\nAsked if she was aware of Medici's role in the market and that Symes \nbought from him, Ms. White said, \"I never met Giacomo Medici.\"\n\nThe Levys' generosity and the Met's displaying the objects in question \narouse vigorous debates in the scholarly world. \"Some people would say \nit's a problem because it's whitewashing the Levy-White name,\" a \nprofessor at DePaul University who specializes in law governing cultural \nproperty and a former president of the Archaeological Institute of \nAmerica, Patricia Gerstenblith, said of the Met's putting the couple's \nnames on a gallery. \"It is certainly lending a major institutional \nbacking to people who are widely known to have questions about their \ncollection.\" The AIA has taken a strong stance against the acquisition \nof objects without known provenance prior to 1973. Its journal, the \nAmerican Journal of Archaeology, refuses to publish the initial \nscholarly presentation of any object acquired by its owner after 1973, \nunless its existence is documented before that date or it was legally \nexported from its country of origin.\n\n\"It sends the clear message that the Metropolitan feels comfortable with \nthe relationship of the Levy-Whites to illegal antiquities and to the \ncontinued destruction of archaeological sites in the Mediterranean \nworld,\" a professor of anthropology at the University of Pennsylvania \nand the former director of the University of Pennsylvania Museum of \nArchaeology and Anthropology, Richard Leventhal, said.\n\nMr. Gill was more emphatic. \"The Met is honoring two of the greatest \ncollectors of looted antiquities from the late 20th century,\" he wrote \nin an e-mail message. \"It would be like naming the Kenyan safari park \nafter the poacher who had bagged the largest number of elephant tusks.\"\n\nRead these comments, the Met spokesman, Harold Holzer, responded with \nindignation. \"This image that her critics have created of Shelby White \nin a pith helmet destroying archeological sites is the most fantastic, \nridiculous, really obscene misrepresentation that can be imagined,\" he \nsaid. \"Shelby White and Leon Levy bought things in good faith from \ndealers and auction houses,\" he continued. \"Unlike many collectors, \nthey've consistently exhibited their work, published their collection, \nsupported archeological research, and lent their work to museums to \nround out exhibitions or fill out gaps in collections ? putting their \nprivate works on public view for examination and scrutiny and study. \nThey have been model collectors and museum benefactors.\"\n\nThe Levy-White publication fund at Harvard poses a quandary for \nscholars, because such funding is in short supply. Some classics and \narchaeology departments, including those at Bryn Mawr College and the \nUniversity of Cincinnati, have adopted policies of not applying for or \naccepting money from the fund.\n\n\"We felt that, as admirable as it was for them to want to support \narchaeological publication, we didn't want to give our name and our \nreputation to them by accepting funds,\" the chairman of the classical \nand Near Eastern archaeology department at Bryn Mawr, James Wright, said.\n\nThe department does not have similar policies on working with the Met, \nor with the Cycladic Art Foundation, of which Ms. White is the \nchairwoman. Students regularly do summer internships with the \nfoundation's Cycladic Art Museum in Greece, and Mr. Wright said he \nfrequently writes recommendations for his students to intern at the Met. \nSeveral alumni of the department work at the Met, including the chief \ncurator of Greek and Roman art, Carlos Pic?n.\n\n\"We're not such Puritans,\" Mr. Wright said. The Met's collection, he \nsaid, is \"a tremendous resource,\" and the department would never \ndiscourage students from working with it or with the Getty's collection. \n\"What we do require is that our students abide by ethics code of the \nAIA,\" he said. But, he added, \"especially in this day and age, when so \nmany students are interested in museum careers, we do what we can to \npromote them, and we simply make them aware of the ethical issues, and \nthen they can decide for themselves.\"\n\nThe Getty recently adopted a new policy: The museum will not acquire an \nobject unless there is documentation of its having been in America \nbefore 1970; its having been out of its original country before 1970, \nand legally imported into America, or its having been legally exported \nfrom its original country and legally imported into America after 1970. \nMr. de Montebello has implied that the Met will not follow the Getty's \nlead. In a lecture last fall on the history of antiquities collecting, \nhe showed a slide of a beautiful classical torso and said: \"Frankly, the \nrefusal to acquire and thus bring into the public domain such a \nmasterpiece simply as a matter of principle or ideology ? is \nunacceptable.\" If a museum declined such a sculpture, he warned, \"it \nwould be driven underground ? and I do not mean, by some miracle, to the \nplace from which it came.\"\n\nWhile Ms. White is being honored in New York, the Italians and Greeks \nappear to be deciding whether to charge Symes, a dealer from whom she \nbought frequently through the years, with antiquities trafficking. In \n\"The Medici Conspiracy,\" Mr. Watson reports that the Italian \ninvestigators who searched Medici's warehouse found documentation of a \nclose business relationship between Medici and Symes; for some period, \nthe two even shared an administrative address in Geneva. And Mr. Watson \nsaid in an interview that the Italian prosecutor, Paolo Ferri, has said \nrepeatedly that he intends to charge Symes.\n\nA lawyer who is pursuing Symes in an unrelated case and is also the \nLondon counsel for the Getty, Ludovic de Walden said: \"Symes is next on \nthe [Italians'] list. That's what I've been told.\"\n\nAsked in an e-mail message whether he plans to charge Symes, Mr. Ferri \nreplied that it would be premature to comment on his intentions.\n\nLast April, the Greek police raided a villa on the island of Schinoussa, \nin the Cyclades, that used to belong to Symes and his partner, Christo \nMichaelides, and now belongs to Christo's sister, Despina Papadimitriou, \nand her children. In an e-mail, the head of the section of the police \nthat handles antiquities smuggling, George Gligoris, confirmed that he \nhas been conducting an investigation of Symes, focused particularly on a \nmarble torso of a young woman that, according to the Los Angeles Times, \nSymes sold to the Getty for $3.3 million.\n\nFor many years, Symes and Michaelides shared a globe-trotting lifestyle. \nIn addition to the villa on Schinoussa, they owned a Philip \nJohnson-designed townhouse in New York filled with art nouveau furniture \nand a house in London with an indoor pool surrounded by ancient busts. \nThey drove a Rolls-Royce and a Bentley. In 1999, however, Michaelides \ndied in a freak accident. Part-way through a dinner given by the Levys \nat a home they had rented in Tuscany, he got up from the table and \ndisappeared. Later, he was discovered, having fallen down some steps and \nhit his head against a portable radiator. He died in a hospital the next \nday.\n\nMichaelides was from a wealthy Greek family, and his sister Despina had \nmarried into an even wealthier one. At several points, she had provided \nloan guarantees or cash for Symes and Michaelides's antiquities \nbusiness. In the wake of Michaelides's death, she and the rest of his \nfamily believed that they had inherited his half of the dealership. \nSymes disagreed. At first, he claimed that Michaelides was not his \nbusiness partner, but merely an employee. Later, he changed his \nargument, asserting that because they were life partners, like a husband \nand wife, he had inherited all of Michaelides's assets, including his \nhalf of the business and the villa on Schinoussa. (Symes simultaneously \nmaintains that although he and Michaelides lived together for three \ndecades and were accepted by all of their friends as a couple, their \nrelationship was platonic.)\n\nThe dispute landed in court, and the ensuing legal battle revealed a \ngood deal about Symes's business practices. Because the Papadimitrious \nbelieved that Symes was not disclosing all his inventory, they hired \ndetectives to trail him all over the world. With the help of their \nlegwork, Mr. Watson says, the Papadimitrious' lawyer, Mr. de Walden, \ndiscovered that Symes was storing his inventory at 33 different sites.\n\nAt this point, Symes was supposed to be conducting business only with \npermission of the court, but Mr. de Walden discovered he had lied about \ntwo major sales, saying he had sold an Egyptian statue for only $1.6 \nmillion, when he sold it for $4.5 million, and that he sold some Eileen \nGray furniture for $4 million, when in fact it was $14 million. The \nBritish judge, Justice Peter Smith, charged him with contempt of court \nand handed him a two-year prison sentence, of which he served eight \nmonths. About the same time, Symes went bankrupt, and Levy ? who, \naccording to Mr. Watson, was supporting him financially ? died.\n\nThe Greek raid on Schinoussa led to a new twist in the \nSymes-Papadimitriou case. The police found more than 100 undeclared \nantiquities in the villa, in addition to photographs that Mr. Gligoris \nis now using in his investigation.\n\nAt the time of the raid, Despina Papadimitriou said she inherited the \nobjects from her brother and that she would cooperate in the \ninvestigation. But, in November, a Greek prosecutor charged her and her \nthree children with illegal possession of antiquities. Mr. Watson \nsuggested to the Sun that this may be a tactical move to pressure the \nfamily to collaborate further in gathering evidence against Symes.\n\n***\n\nMs. White described what has befallen Symes as \"a great tragedy.\" She \nsaid, \"He lost his lifetime partner. He has suffered tremendous \nfinancial and health problems.\"\n\nSeveral messages left on Symes's cell phone, as well as ones passed \nthrough his agents in bankruptcy and a dealer he stayed with \ntemporarily, went unreturned. At one point, someone answered Symes's \ncell phone but, when a reporter identified herself, said that Symes was \nout of the country. Asked who he was, he gave his name only as Peter.\n\nMs. White declined to comment on her negotiations with the Italians, \nexcept to say they are \"amicable.\" Until this point Ms. White has \ndefended her and her husband's buying practices with the fierceness and \nthe pertinacity of a Roman general, but the negotiations may end with \nher conceding at least some of the requested objects.\n\n\"Have standards of collecting changed?\" she said. \"Of course. Nobody \nwants to buy something ripped off the wall.\"\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Wed, 02 May 2007 06:26:35 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Kunstraub bei Makler\nTo: Museum Security Network Mailinglist \nMessage-ID: <463812FB.7040903@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n    Kunstraub bei Makler\n\n*Angeklagter bestreitet Beteiligung an Gewalttat.\n\n*Die Kidnapper hatten offenbar einen Tipp bekommen. ?Sie schienen zu \nwissen, dass die Wohnung gesichert ist?, erinnerte sich ihr Opfer im \nProzess. F?nf Monate ist es her, dass der Immobilienmakler und Jurist \nOttmar N. vor seinem Haus in einen wei?en Transporter gezerrt, \nmisshandelt und beraubt wurde. Einer der mutma?lichen T?ter, ein \n38-j?hriger Litauer, muss sich vor dem Landgericht verantworten.\n\nBei der Kurzentf?hrung ging es den Gangstern um schnelle Beute. Sie \nwollten Zugang zur Wohnung, um Bargeld oder Wertgegenst?nde zu rauben. \nSie verschwanden mit drei Kunstwerken aus der Sammlung ihres 48-j?hrigen \nOpfers sowie vier hochwertigen Uhren. Der Schaden wurde auf 200 000 Euro \ngesch?tzt. Das Gem?lde ?Rot-Gelb-Blau? von Gerhard Richter, ein Gem?lde \nvon Hans Hartung und die Collage ?Wrapped Reichstag? von Christo sind \nbis heute verschwunden. Ob der Angeklagte Karolis N. einer der T?ter \nwar, kann der Makler nicht sagen. Als er an jenem Abend im November \nletzten Jahres in der N?he seiner Dahlemer Wohnung gerade eingeparkt \nhatte, seien zwei Vermummte aus einem wei?en Kastenwagen gesprungen. \n?Sie zerrten mich in ihr Fahrzeug, fesselten mich.? Nach einem \nFaustschlag habe er den Zutrittscode zu seinem Haus preisgegeben. Einer \nder T?ter sei daraufhin f?r etwa eineinhalb Stunden verschwunden. Dann \nhabe man ihn zu einem Kellereingang gebracht und dort mit Klebeband an \nein Gel?nder gefesselt, schilderte das Opfer.\n\nDer Kunstsammler vermutete zun?chst, dass ein Gesch?ftspartner hinter \ndem ?berfall stecken k?nnte. Doch dann brachte sein ebenfalls aus \nLitauen stammender Lebensgef?hrte den Namen von Karolis N. als m?glichem \nT?ter ins Spiel. Neben Zeugenaussagen soll auch eine in der Wohnung des \nOpfers sichergestellte Spur gegen den gelernten Schuhmacher sprechen. \nVor Gericht hat der Litauer ?ber seine Verteidigerin nur so viel \nmitgeteilt: Er bestreite die Vorw?rfe. Der Prozess wird Montag \nfortgesetzt. K.G.\n\nhttp://www.tagesspiegel.de\n\n\n\n\n------------------------------\n\nMessage: 8\nDate: Wed, 02 May 2007 06:27:10 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Egypt will request loan of artifacts\nTo: Museum Security Network Mailinglist \nMessage-ID: <4638131E.8010309@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n  Egypt will request loan of artifacts\n\n From the Associated Press\n\nMay 1, 2007\n\nEgypt plans to seek the temporary return of some of its most precious \nartifacts from museums abroad, including the Rosetta Stone and a bust of \nNefertiti.\n\nThe country's chief archeologist, Zahi Hawass, said the Foreign Ministry \nwould send letters this week requesting that the ancient artifacts be \nloaned to Egypt.\n\nHawass has previously demanded the permanent return of many of the \nartifacts, claiming some of them were taken illegally.\n\nThis time, the country is requesting museums loan the artifacts so they \ncan be exhibited either at the 2011 opening of the Egyptian Museum, near \nthe site of the Great Pyramids at Giza, or the Atum museum, which is set \nto open in the Nile Delta city of Meniya in 2010, the Supreme Council of \nAntiquities said in a statement.\n\nEgypt said it would request the loans from the British Museum, Paris' \nLouvre, Boston's Museum of Fine Arts and two German museums.\n\nThe Rosetta Stone, a 1,680-pound slab of black basalt with a triple \ninscription, was the key to deciphering ancient Egyptian hieroglyphics. \nIt is one of the centerpieces of the British Museum.\n\n\"We have never received a written request to loan the Rosetta Stone,\" \nBritish Museum spokeswoman Hannah Boulton said. \"If one was put in, we \nwould consider it.\"\n\nhttp://www.calendarlive.com/\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 106\n****************************************\n\n"}