{"category": "spam", "to_address": "producttestpanel@flax9.uwaterloo.ca", "from_address": "Recipe 4 Living <Montague@tcgedwbtuy.goodhealthconsultants.net>", "subject": "Wolfgang Puck Cookware on us", "body": "You registered to receive this and similar offers from  on .\n\nWe're giving away NO COST samples of Wolfgang Puck's Exclusive 35-piece\nSignature Cookware Set!\n\n(upon completion of offer requirements)\n\nGet yours Here!\n\nhttp://tcgedwbtuy.goodhealthconsultants.net/t/l?g4-lt0-1-hmr-8jdp\n\nGet ready for compliments because you could soon be serving up dinner\nfrom your own set of celebrity chef Wolfgang Puck's coveted signature\ncookware.\n\nThis incredible 35-piece set includes everything you'll need for family\nmeals and entertaining. Each piece from cookware to utensils includes\nWolfgang's signature.\n\n\nThis is an independent offer from Recipe4Living and is NOT AFFILIATED OR\nASSOCIATED WITH AND HAS NOT RECEIVED ANY \nCONSIDERATION FROM ANY OF THE ABOVE ENTITIES. This offer requires\nMilesource registration, completion of a survey and \n150,000 AwardMiles.  All merchandise and offers are based on first come\nfirst serve.  Offer not valid outside the United \nStates. This offer may contain typographical errors or inaccuracies and\ntherefore we reserve all rights.  This is an \nadvertisement. We would be glad to answer any questions or concerns. \nPlease send mail to: Recipe4Living, 244 \nMadison Avenue, #238 New York, NY 10016-2817 Please print a copy of this\nadvertisement and include it with your question \nor request.  You can also manage and control future correspondence from\nRecipe4Living, by clicking on this link. \n\nhttp://tcgedwbtuy.goodhealthconsultants.net/t/l?g4-lt0-2-hms-8jdp\n\nThis will not stop you from receiving communications from the list owner\nwho sent you this email.  If you wish to end \nyour participation there, you will need to follow their instructions on\nhow to unsubscribe. During the removal period, \nyou may receive some offers that were already in progress when your\nrequest was received.  8jdp\n\nIf you no longer wish to receive these commercial emails, you may remove yourself from our mailing list by clicking here http://tcgedwbtuy.goodhealthconsultants.net/remove?r.Montague.2a-906bb0e-6e4b.speedy.uwaterloo.ca.-producttestpanel?r click here or by calling our unsubscribe hotline at 864-752-1051. Please note this phone number is used solely for unsubscribe requests. Please allow up to five business days for your request to be processed.\n\nYou may also contact us by writing to us at our postal address: Montague| 9600 Great Hills Trail, Suite 150 W| Austin, TX 28759\n\n\n\n\n"}