{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "James ARKINSTALL <James.ARKINSTALL@paris.msf.org>", "subject": "[Ip-health] Le Monde on WHA: Indonesia and H5N1 samples", "body": "\n- translated excerpt (non official) -\n\n\"Earlier this year, Jakarta denounced the fact that poor countries supply\nfor free viruses to Western laboratories without being able to then buy the\nexpensive vaccines they develop.  The Indonesian Minister for Health Siti\nFadillah Supari repeated last week that \"Indonesia believes that if the\nbenefits of the samples are not pooled, today's system for sharing flu\nviruses is not fair for developing countries\".\"\n\nhttp://www.lemonde.fr/web/article/0,1-0@2-3244,36-910048@51-910049,0.html\n\n\n\nLe partage des échantillons du virus H5N1 au c\\u0153ur de l'assemblée générale\nde l'OMS\n\n\nLEMONDE.FR avec AFP | 14.05.07 | 19h46  \\u2022  Mis à jour le 14.05.07 | 19h58\n\nC'est l'un des enjeux de l'assemblée générale de l'Organisation mondiale de\nla santé (OMS), qui se tient du lundi 14 au mercredi 23 mai à Genève, en\nSuisse : trouver un terrain d'entente avec l'Indonésie sur la question du\npartage des échantillons de virus H5N1.\n\nLes souches de l'Indonésie, où la grippe aviaire a fait 75 morts, sont\nindispensables pour suivre l'évolution du virus, surveiller ses mutations\net mettre au point un vaccin \"pré-pandémique\" efficace. Mais en début\nd'année, Djakarta a dénoncé le fait que les pays pauvres fournissent\ngracieusement des virus à des laboratoires occidentaux sans pouvoir par la\nsuite acheter leurs coûteux vaccins. Le ministre de la santé indonésien,\nSiti Fadillah Supari, a rappelé la semaine dernière que \"l'Indonésie\nconsidère que, si les bénéfices tirés des échantillons [de virus] ne sont\npas mis en commun, le dispositif actuel de partage des virus de la grippe\nn'est pas juste vis-à-vis des pays en voie de développement\".\n\n\nPAS DE \"CONDITION PRÉALABLE\"\n\nDjakarta exige donc un renforcement des infrastructures de recherche des\npays touchés et demande que les découvertes bénéficiant à l'ensemble des\nêtres humains ne puissent être brevetées. Après avoir suspendu la\ntransmission d'échantillons en décembre, l'Indonésie avait accepté en mars\ndernier de reprendre les échanges, suite à un accord avec l'OMS, avant de\nrevenir sur sa décision en réclamant des garanties écrites sur une réforme\ndu système.\n\nL'OMS a dénoncé une décision allant \"à l'encontre d'un demi-siècle de\npartage gratuit d'échantillons de virus, pour le bien commun\" tout en\ndéclarant comprendre les inquiétudes de l'Indonésie et en se disant prête à\ntrouver un arrangement. Mais les pays occidentaux ne semblent pas tous\naussi bien disposés. A l'ouverture de l'assemblée générale de l'OMS lundi,\nles Etats-Unis sont intervenus par la voix de leur secrétaire à la santé,\nMike Leavitt, pour demander le partage des échantillons de la grippe\naviaire \"de manière transparente et rapide [et] sans condition préalable\".\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}