{"category": "ham", "to_address": "\"Gerald (Jerry) Carter\" <jerry@samba.org>", "from_address": "simo <idra@samba.org>", "subject": "Re: Broken idmap interface design", "body": "On Thu, 2007-04-19 at 12:11 -0500, Gerald (Jerry) Carter wrote:\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA1\n> \n> Jeremy Allison wrote:\n> \n> >> Requiring the idmap_tdb code (or idmap_rid) to issues a\n> >> winbindd client call is wrong and a layering violation.  The\n> >> caller should specify the SID type which is exactly what\n> >> the WINBINDD_SID_TO_UID, et. al. calls used to do.\n> > \n> > Indeed. Looking at this interface cold after ignoring\n> > it for a while I think the SID_TYPE enum needs to be\n> > present as input on all calls into a \"map SID to XXX\".\n> \n> Agreed.  I'm still looking at what would be the minimal\n> appropriate fix.  Simo and I have a call later this afternoon\n> to chat about the current state and how to move forward.\n\nOk, we cleared out the problem in the call.\n\nJerry is right, we have a layering violation.\n\nLet me explain why we had the lookup_sid() call in idmap_new_mapping().\n\nBasically we decided that decision on whether to allocate or not a new\nmapping was to be done into idmap. The problem was that to avoid\nmalicious ID consumption I decided to add a call to verify if the SID\nwas a valid existing SID before going on and asking the alloc backend to\ngive as an uid.\n\nThe lookup_sid() purpose was never really that of retrieving the SID\ntype. The type can be easily passed by the caller, and in fact that is\nwhat we will do for 3.0.25\n\nThe error was in putting the verification inside idmap (causing the\nlayering violation). Now what we will do is to make the verification,\n_before_ calling into idmap.\nWinbindd is the gateway to idmap anyway so we can trust nobody else\nshould be able to inject calls with bogus requests just to deplete our\nuid space. The only side effect I can see is that, this way, winbindd\nwill have to verify the validity of a SID for each idmap request as\nwinbindd has no knowledge of whether the mapping already exist (no\nverification required) or it will be allocated just at that point\n(verification absolutely required).\n\nIf this will turn out to be a performance problem we will find out how\nto cope with that (maybe via a cache or something).\n\nAlso the multiple SIDS to IDS call will not be exposed in 3.0.25, we\nwill delay it to 3.0.26, as Jerry want to enhance the interface before\nreleasing it. This interface was introduced to solve some performances\nissues for users with many many many SIDs attached when caches are empty\n(we've seen PACs with thousands of SIDs for a single user :-/).\n\nFor idmap_rid that was just copying and pasting without thinking (I\nalready feel an electric shock here* :), I should never have put such\ncalls down there, even with the current design, that was my fault.\n\nSimo.\n\n\n\n* If you don't get this joke don't worry, someone here does :)\n\n-- \nSimo Sorce\nSamba Team GPL Compliance Officer\nemail: idra@samba.org\nhttp://samba.org\n\n"}