{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Fern Doss\" <laxcsaeventsvew@csaevents.com>", "subject": "Pounds down, mood up", "body": "\nSay goodbye to extra pounds\n\n\n\n\n\n\nAnatrim – The very up-to-date and most exciting product for corpulent people is now readily available – As you could see on Oprah.\n\n\nDo you count up all the cases when you told yourself you would do anything to get rid of this quickly growing pounds of fat? Happily, now no big sacrifice is demanded. With Anatrim, the ground-shaking weight-reducing medley, you can get naturally health life style and a really slender figure. Just look at what our customers write!\n\n\n\n\"I hate to confess but I was an awful food addict. \n\n\nI ate all this rubbish \n\n\nand was unable to stop. \n\n\n\n\nThis misery stopped when I started course with Anatrim! \n\n\nGod,\n\n\n\n\n my appetite abated, \n\n\nmood improved and I became the happiest person in the world 29 pounds in 2.2 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person in the world!\"\n\n\n\n\n\nSilvia D., New York\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nYou can't even fancy how I hated being derided at school. \n\n\n\n\nI detested my plumpness and I detested myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nThis stuff literally pulled me out of this dreadful nightmare! The very sincere thanks to you, my friends.\"\n\n\n\n\n\nSteve Burbon, Boston\n\n\n\n\n\n\"You know what? My marriage was saved thanks to Anatrim! I went into this circle, depression – eating more – more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nOne of my friends pointed to your web page and I called for my pack of Anatrim right away. \n\n\nThe results were great, my appetite became normal, I was in good spirits oftener, and, of course, I went some belt holes back. And you see me, the bedroom became cool, too!\"\n\n\n\n\n\nRikky\n\n\n\n\n There is a lot of sincere gratitudes left by delighted people taking Anatrim. Don’t you wanna add yourself to the thousands and thousands of slim clients and try this natural appetite-decreasing power boosting product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}