{"category": "spam", "to_address": null, "from_address": "\"Brian Capon\" <mrbriancapon@yahoo.com.hk>", "subject": "BUSINESS DEAL(URGENT).", "body": "FROM THE DESK OF:MR.BRIAN CAPON\nNATIONAL WESTMINISTER BANK,\nLONDON,\nUNITED KINGDOM.\n\nDear Friend,\n\nI am Mr.Brian Capon the system and control director at the NATIONAL\nWESTMINISTER BANK.I am writing this letter to solicit for support and\nassistance from you to carry out this business opportunity in my bank.\n\nLying in an inactive account is the sum of 11million pounds sterling\nbelonging to a foreign customer(Michael Gambone) who was a gas consultant\nhere in UK,who happens to be deceased during a business trip. He died with\nhis wife(Deborah Gambone) on board the Swissair Flight 111 , which crashed\ninto the Atlantic off Nova Scotia in september 2nd 1998.\nThe news of this crash was on the news which we have notified his\nrelatives to no avail.See links below for more detail information:\n\nhttp://cnnstudentnews.cnn.com/WORLD/9809/swissair.victims.list/\nhttp://cnnstudentnews.cnn.com/WORLD/americas/9809/08/swissair.02/\n\nEver since he died the bank has been expecting his next of kin to come and\nclaim these fund. To this effect, we can not release the money unless\nsomeone applies for it as next of kin, as indicated in our banking\nguideline.Unfortunately he has no family member in UK or Over-sea who are\naware of the existence of the money(as he was a gas consultant.\nAt this juncture i have decided to do business with you by soliciting your\nassistance in applying as the next of kin to the bank then the money will\nbe released to you,as I do not want this money to go into the bank\ntreasury as an unclaimed bill,because the banking law and guideline\nstipulates that if such money(s) remains unclaimed  for a period of up to\nnine years(9yrs),the money will be transferred into the bank treasury as\nan unclaimed bill.\nMy request for a foreigner as next of kin is occasioned by the fact that\nthe customer was a foreigner and a British cannot stand as next of kin.\n\n50% of the money will be your share as a foreign partner and your\nassistance to actualise this business,thereafter i will visit your country\nwith your help once the money hits your account for disbursement according\nto the percentage indicated.\nTo effect the immediate transfer of the fund to you as agreed,you must\napply first to the bank as the next of kin to the deceased,then we will\nfollow up all formalities for the transaction.\n\nUpon receipt of your reply, i will send to you, the text of the\napplication you are to send to the bank,and further clearify you in other\nissues as to effect this business.\nAwaiting to hear from you urgently.\n\nBest Regards\nMr.Brian Capon.\n\n"}