{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "Terry Hancock  wrote:\n> MJ Ray wrote:\n> > [...] would it make something any less\n> > a fee if someone can trade their work as payment?\n> \n> N.B. the idea that trading agreement to copyleft is a substitute for fee\n> payment (i.e. that the basis for copyleft licensing is a quid-pro-quo\n> wherein the author releases their work in exchange for a promise -- or\n> likelihood -- of contributions to their project) is a basic game theory\n> approach to understanding the economic success of the whole\n> free/copyleft phenomenon.\n\nHowever, that is neither the situation being discussed (someone possibly\nagreeing to travel to or employ a representative in a particular place),\nnor an accurate description of copyleft (contributing changes back to\nthe main project is a good thing to do, but it must not be required).\n\nIsn't it interesting that Anansi Spaceworks \"is to provide the training\nand resources that will be needed for a Free future in Space\" while my\nmain company is a cooperative of webmasters, sysadmins and developers?\nMaybe I'm not quite totally clueless on the economic aspects of sharing\nand the free/copyleft phenomenon, although I'm told that I'm sometimes\na bit slow to stop correcting misconceptions on project mailing lists\nand that lowers my earnings.  Oh, wait...\n\n> An overly broad interpretation of \"fee\" to include such agreements would\n> not only be highly \"constructivist\", but it would also be\n> counterproductive to the success of the whole free software movement as\n> well as Debian within that movement.\n\nNow \"constructivist\" merits \"scare\" quotes...  One faction argues that\nall the tests must be grounded in the DFSG, while another argues that\ngrounding things in the DFSG is somehow \"scary\".  Nice dilemma.  I think\nI'll keep linking back to the DFSG when obviously helpful.\n\nSo how would one define fee to exclude this, but include all other cases\nlike pickle-passing and pet-a-cat?  I think it's impossible because it's\nabsurd, but it only takes one counter-example to demonstrate possibility.\n\n> Also, by holding up copyleft licenses like the GPL as \"best practice\"\n> examples, I believe the DFSG rules out such overly broad interpretations.\n\nThe GPL does not itself require me to travel or send someone to a venue.\nThe GPL does not force contributions back to the upstream project.\nThese are features, not bugs.\n\n> So I think the whole class of \"can be considered as a fee\" arguments\n> must be taken with a very big chunk of salt.\n\nI think the whole class of arguments vaguely appealing to authority -\nlike citing the GPL's mention in the DFSG must mean all copyleft licences\nmust be accepted - need to be taken with a veritable hill of salt.\n\nRegards,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}