{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 6/14/07 - Three Consumer Stocks You Should Examine", "body": "June 14, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\nApple iPhone and Safari\n\nWebMD - Health-Care Information for Everyone\n\nThe Crocs Stock Split\n\n-----\n\nAfter long and careful reflection, I've decided not to buy the Apple\niPhone on the day it first goes on sale (June 29).  For a brief time I did\nimagine myself standing in line outside the Apple Store or the AT&T store\nat 4 am.  Last November I stood outside a Target store on a very cold\nmorning with my son to get a Nintendo Wii, and standing outside in June\nwould be a piece of cake compared to that.  But I'm going to wait on the\niPhone.  Here's why.\n\nOne.  I'll be on vacation in Europe for half of July, and the days\nfollowing the iPhone launch will be better used in planning for that trip,\nthan in learning the ins and outs of a new electronic device.\n\nTwo.  By waiting a while I'll (hopefully) benefit from the fixing of bugs\nfound in the initial units.\n\nAnd that's reason enough.  But thinking about it, I'm also reminded of\nrepeated studies that show that people typically overestimate the pleasure\nthey'll derive from new purchases.  Whether it's a cheeseburger, a new\npair of shoes or a new car, studies show that the purchase, once it is no\nlonger yearned for, typically fails to improve people's happiness as much\nas they originally expected.\n\nOh, I'll still buy the iPhone later this summer.  I sincerely want a\ndevice that will allow me to Google for answers anytime/anywhere.  I want\nmy contacts and calendars always synchronized.  And I want my 5000 digital\nsongs always available.  For me, the phone is the least important part!\n\nBut for the reasons stated above, waiting a few more weeks makes perfect\nsense . . . for me.\n\n-----\n\nOn another note, I was excited this week to read of a new wrinkle in the\nApple story that has major implications.  It's the announcement of Safari\n(a web browser) for Windows.\n\nNow, most Windows computers have Microsoft Internet Explorer (MIE) as a\nweb browser.  In fact, MIE has a whopping 79% of the entire web browser\nmarket.\n\nSo why would you want to switch to Safari?  Because Safari is the web\nbrowser that will run on the iPhone!\n\nI already use Safari on my Mac, in part because Apple makes it, so it's\nperfectly integrated.  Integration, remember, is a major reason why\nApple's products are so effective.\n\nAnd I'm betting that the promise of smooth integration with their iPhones\nwill drive millions of users to switch from MIE to Safari.\n\nToday the second-most popular web browser is Firefox, with a market share\nof 15%.  Safari is third, with a market share of 5% (basically, all Apple\ncomputers) and Netscape (once the king) is fourth, with a market share of\nless than 1%.\n\nI'm thinking that Safari will be second by the end of the year, and that's\na coup for Apple that no one saw coming.\n\nAs for the stock (AAPL), if you own it, hold on tight; it's zoomed 26% in\nthe past seven weeks.  But if you don't own it, I think there are better\nrisk/reward situations out there for your hard-earned money.  The biggest\nrisk with Apple (and I have said this before) is that it is highly loved,\nand stocks tend to peak at their moment of peak love.\n\nWith luck and good management, Apple's peak is still years away, but all\nthings considered, I think it's smarter to buy a stock that isn't so well\nloved.\n\n\n------ Advertisement -----\n\nTo find hot stocks that aren't so well-loved, take a look at Cabot Top Ten\nReport.\n\nTop Ten's OptiMo stock picking system achieved average profits of 352% in\njust 12 months.\n\nJust look:\n\n- Hansen Natural (HANS) up 471%\n- NutriSystem (NTRI) up 485%\n- Titanium Metals (TIE) up 655%\n- Administaff (ASF) up 195%\n- RTI Metals (RTI) up 145%\n- Trident Microsystems (TRID) up 163%\n\nIf you start today, you too can capture the market's next rise.  Do this\nand I guarantee that two years from today you'll be patting yourself on\nthe back for taking the actions I spell out today and putting your trust\nin the time-proven OptiMo stock-picking system.\n\nTo learn more, click the link below.\n\nhttp://cabotmail.net/t/198055/13148861/81/0/\n\n-----\n\nSo here's an unloved stock to consider.  Ten days ago I wrote about our\ncountry's twin health care problems, obesity and the rising cost of health\ncare, and confessed that at the time I had no investment idea that would\naddress the problem.\n\nToday I have one.  It's WebMD (WBMD), the online provider of health care\ninformation to both individuals and professionals.  Information and\neducation, remember, was the key to my solution to the obesity problem.\n\nAnd information is what WebMD is selling (and giving away).\n\nThe company's main web site (WebMD) is aimed at consumers and provides\nplain facts and sensible advice on nearly every heath topic that's on\nAmericans' minds.\n\nThe first page, for instance, has a list of the top 12 health topics for\nmen, as well as the top 122 for women and the top 12 for children.  For\nmen, the list reads like this: Diabetes, Athlete's Foot, Lung Cancer,\nCrohn's Disease, Testicular Cancer, Cholesterol, Prostate Cancer,\nHemorrhoids, Back Pain, Adult ADHD, Sleep Problems, Melanoma.\n\nFor women: Hypothyroidism, HPV (Human Papillomavirus), Weight Loss,\nPregnancy, Bipolar Disorder, Cholesterol, Melanoma, Plantar Warts, PCOS\n(Polycystic Ovarian Syndrome), Lung Cancer, Stretch Marks, Chronic\nFatigue.\n\nThere are lists of popular stories, including \"22 Ways to Stop Feeling\nTired\" and \"Crocs: Health Shoes or Just Comfy?\"\n\nThere's information on drugs, both prescription and over-the-counter. \nThere are guides to healthy living.  And there are 140 moderated\ndiscussion boards.\n\nThe company also runs a web site for health care professionals, dubbed\nMedscape, which fills their information needs.  There they find 30\nphysician discussion boards, as well as continuing medical education (CME)\nactivities.\n\nAnd the company runs five other web sites: MedicineNet, eMedicine,\neMedicine Health, RxList and theheart.org.\n\nSo how does WebMD make money?  Two-thirds of revenues come from\nadvertising, a fifth comes from licensing its content (basically providing\nrepurposed information on third-party web sites run by insurers and\nemployers), and the rest comes from publishing and other services.\n\nRevenue trends are great; they grew at a 22% rate in 2004, a 26% rate in\n2005 and a 50% rate in 2006.  In the most recent quarter, revenues grew\n46% to $73.0 million!  The company lost money every year until 2004, but\nannual earnings have grown every year since.  This year, analysts expect\nearnings of $0.51 per share, up 42% from last year.\n\nLong-term, it's likely these trends will continue, particularly because\nbaby-boomers, the bulge in the demographic python, are now entering the\nyears when health concerns grow.\n\nAs for the stock, WBMD came public in September 2005 at 18, hit a high of\n58 in mid-April of this year, and since then has pulled back to a low of\n48.  My suggestion, if you like the story and want to make a long-term\ncommitment in the field of health-care information, is to buy some now and\nhold on patiently.\n\n-----\n\nMy final story today concerns Crocs, the maker of funny-looking shoes that\nis the biggest winner in the portfolio of Cabot Market Letter.   \nIt's up 167% since October, in part because of improvements in the\nbusiness but also because of improvements in investor perceptions.\n\nEight months ago, the idea that this maker of funny-looking shoes could\nbecome a major player in the industry was a minority view.   \nMost people saw the shoes as a fad that would soon die.  But opinions have\nimproved dramatically since then, and the result is a much higher stock\nprice.\n\nIn fact, CROX has topped $90 per share in recent days.  But after today's\nclose, the stock will split 2-for-1, and that's an event what I want to\ntalk about.\n\nSo first a review of the basics.\n\nAfter the split, the stock will trade at about $45 per share, but there\nwill be twice as many shares (80 million).  The company will be the same,\nand the company's value as determined by the market will be the same\n(about $3.6 billion).\n\nSo what's the point of the split?  Crocs management does it to make the\nshares more attractive to the individual investor.  And that's a common\npractice.\n\nBut it's not universal.  There are two notable companies that have never\nsplit their stocks.  One is Warren Buffett's Berkshire Hathaway (BRKA),\nwhich now trades around $109,000 per share.  The other is Google (GOOG),\nnow trading just above $500.\n\nSo why haven't the managements of these two companies split their stocks? \nBecause they're focused on building valuable enterprises, not on catering\nto shareholders.\n\nThe downside of that is that small-time investors tend not to buy those\nstocks.  The upside is that small-time investors tend not to buy those\nstocks.\n\nDouble-speak?  Not really.\n\nIf you want small-time investors to buy your stock and push it up, you\nsplit the stock to lower the price, and they happily climb on board.  But\nsmall-time investors are notorious for their poor timing.\n\nIn a bull market, they will be among the last to buy, and thus be most\ninstrumental in pushing a stock to its ultimate peak.\n\nAnd in a bear market, they will be among the last to sell, and thus be the\ngreatest factor in pushing a stock down to its ultimate lows.\n\nBy effectively excluding amateur investors from their stocks, the\nmanagements of Berkshire Hathaway and Google are choosing a less volatile\nfuture for their stocks, and that's a good thing for managements and\nshareholders who are focused on the long term.\n\nIn fact, I respect the guys at Google for emulating the wise Mr. Buffett\nin this regard.\n\nBut the custom of our times is to split a stock before it gets to 100, and\nCrocs management is following the custom.\n\nWhat investors want to know today, of course, is if the split means the\nstock is a good buy . . . and there's no simple answer to that.\n\nThe split, like almost all splits, comes after the stock has had a\nsubstantial rise; CROX is up 326% since its February 2006 IPO and up 107%\nin the past three months.  We know that momentum does tend to persist, but\nalso that substantial corrections can interrupt these trends, especially\nwhen the gains have been fueled, in part, by short-covering and that fuel\nsource runs low.\n\nHistory does tell us that sometimes, splits mark the top for stocks.   \nIn essence, the increased supply of shares fills (or exceeds) the market's\ndemand, and when supply exceeds demand, prices fall.\n\nUsually however, those tops come not on the first split (this is the first\nfor CROX), but on the second or third, so that's not a big concern.\n\nFor the final word, we look to the chart.  It's strong, and thus due for a\npullback at some point, but the buying volume has been increasing in\nrecent days and that's a good thing.\n\nBut the stock is 11% above its 25-day moving average and 31% above its\n50-day moving average, and thus anyone buying here risks a drop down to\nthose averages . . . which could be painful.\n\nBottom line.  If you own CROX, hold it, and if you don't own it yet, try\nto become a shareholder at a low-risk entry point.  We still think the\nlong-term prospects for the company are terrific, but are leery of the\nstock's potential for downside action in the days and weeks following the\nsplit.\n\n-----\n\nEditor's note:\n\nThis week subscribers to Cabot Market Letter received a special message\nfrom us advising them how to handle their large profits in CROX.  If you'd\nlike similar timely messages on investing in CROX and other stocks with\ngreat fundamentals and strong charts, you should consider a trial\nsubscription to Cabot Market Letter, our flagship publication.  Published\nfor 36 years, it brings you independent advice on both stock selection and\nmarket timing.  Past big winners include Amazon, JDS Uniphase, Apple, eBay\nand Charles Schwab, to name a few.\n\nTo take a no-risk trial subscription, simply click the link below.\n\nhttp://cabotmail.net/t/198055/13148861/99/0/\n\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n-----\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=198055&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}