{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Hattie Herbert\" <powclackamasdeq@clackamas.net>", "subject": "Be leaner and slimmer by next week", "body": "\nLook in the mirror and enjoy the new you\n\n\n\n\n\nAnatrim – The newest and most delighting flesh loss product is now available – As were told on Oprah\n\n\n\nDo you understand that redundant body kilos kill more and more people around the planet? We know that you hate the ugly appearance of people like those and the social bias against them. \n\nMoreover, you got no will to resist a siege of ruinous eating habits of yours. If it sounds familiar, then we got something to propose to you!\n\n\n\n\n\nHere comes Anatrim, the recent product for the reduction of your body’s extra weight. The astounding thing about Anatrim is it improves the quality of your life by making you eat less and giving you better mood. Here you may see what people write to us about this product:\n\n\n\n\n\n\"This is great! \n\n\nI stopped watching TV continually and eating everything close at hand \n\n\nI became keen on doing sport.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I’m in a great shape now and lots of men devour me with their eyes!\"\n\n\n\n\n\n\nLusia R., San Diego\n\n\n\n\n\n\n\"I tried some passive weight burning, but almost with no result. I could not restrain my ravenous appetite. \n\n\nOne day I heard on Anatrim from my very best friend and I rather liked the information.\n\n\n I had tried to take it, and my wife told me that I’m not more a weighty man now, 5 months later. \n\n\n32 pounds have gone away and I continue to become slimmer! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nMike Brown, Chicago\n\n\n\n\n\nAnatrim gives you an opportunity to realize that you got no such great need for that much food. It lifts your mood up, provides you with extra energy, and attacks needless kilos. Great thanks to its powerful distinguished formula!!\n\n\n\nPry out more!\n\n\n\n"}