{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "6p 4/26 Update: Williams to come home on Atlantis; critical repair work on tap", "body": "\n\n\n\n\n6p 4/26 Update: Williams to come home on Atlantis; critical repair work on tap\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 11\nPosted: 05:30 p.m. EDT, 04/26/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-09 (04/17/07): NASA updates shuttle manifest\n   SR-10 (04/17/07): NASA managers reassess Williams' status, mission duration\n   SR-11 (04/26/07): Williams to return on Atlantis; Anderson moved up one flight\n\n=================================\n\n05:30 p.m., 04/26/07, Update: Shuttle repairs move into critical phase; NASA opts to bring Williams down from station aboard Atlantis in June\n\nRepairs to the shuttle Atlantis' hail-damaged external fuel tank are going relatively smoothly, with the first of two large-area foam sprays scheduled to begin as early as Sunday. While rollout to launch pad 39A has slipped several days to around May 15, NASA managers say a launch June 8 is still possible, although the schedule is very tight.\n\nShuttle managers today also approved a plan to bring space station astronaut Sunita Williams back to Earth aboard Atlantis in June. Williams was launched to the station aboard the shuttle Discovery in December and before Atlantis was damaged by hail during a freak storm in February, she was scheduled to come home aboard the Endeavour in June.\n\nBut because of the work to repair Atlantis, Endeavour's flight has slipped to August. NASA managers monitor the cumulative radiation long-duration crews are exposed to and while Williams faced no specific health threat remaining in space through August, sources said there was some concern that her total exposure might preclude any future station flights. By coming home in June as originally planned, she likely will remain eligible for a future flight assignment.\n\nBut moving her return up to June also meant moving her replacement, astronaut Clay Anderson, from Endeavour to Atlantis. NASA managers are debating whether to add an astronaut to Endeavour's crew to help out with moving equipment and supplies back and forth between the shuttle and the station.\n\nThe crew rotation was approved by NASA managers today \"after a more detailed review determined there would be no impact on space station operations or future shuttle mission objectives,\" NASA said in a statement. \"Since an earlier crew rotation was possible, NASA managers decided it would be prudent to return Williams and deliver Anderson sooner rather than later.\"\n\nAs a result, the duration of Williams' flight will be roughly the same as originally planned and on her return, she will set a new space endurance record for female astronauts. She already holds the record for spacewalks by a female flier with 29 hours and 17 minutes of EVA time during four excursions.\n\nTold of the decision earlier today, Williams said she was looking forward to seeing the crew of Atlantis.\n\n\"It's going to be a fun flight, hopefully putting on that next solar array and retracting the other one,\" she said, referring to an array that must be retracted so it can be moved later. \"It should be a lot of fun, looking forward to it. Thanks for the news.\"\n\nNASA managers had hoped to launch Atlantis on mission STS-117, the first of five planned 2007 shuttle missions, March 15. But during a freak storm that thundered over pad 39A on Feb. 26, the shuttle's external tank was blasted by hail, suffering thousands of pits and gouges in its foam insulation. Wind gusts reached 62 knots and hail up to 1.5 inches in diameter was found at the pad.\n\nMost of the damage was restricted to the upper liquid oxygen section of Atlantis' tank. Only a handful of dings were found lower down on the hydrogen section and while two dozen heat shield tiles on the orbiter were scraped by hail that worked its way behind weather protection panels, detailed inspections show the ship's critical carbon composite wing leading edge panels and nose cap were undamaged.\n\nJohn Honeycutt, deputy manager of the external tank project, said April 10 that some 2,664 areas of damage requiring repair had been identified. Two areas, one near the tip of the tank that had between 1,000 and 1,600 hits and the other lower down on the side of the oxygen tank with 200 or so tightly packed impact sites, were so heavily pitted that engineers opted against individual repairs.\n\nInstead, the damaged foam was sanded down so fresh insulation could be sprayed on by tank engineers. About 700 dings and pits were subject to repairs by boring them out and pouring in fresh foam.\n\nFoam sprays normally are carried out robotically at Lockheed Martin's Michoud Assembly Facility in New Orleans. The repair sprays will use a different type of foam and it will be applied manually. These are \"non-standard\" repairs and extensive testing was ordered to make sure the foam will provide the proper pre-launch insulation and also stand up to the rigors of launch without shedding any debris that could damage the shuttle's heat shield.\n\nThe first of those sprays could begin as early as Sunday. Other repair work is continuing, including work to fix relatively minor collateral damage caused in the process of making the other fixes.\n\nEngineers also plan to begin removing Atlantis' three main engines Sunday for main propulsion system inspections to look for signs of contamination from a silicon rubber material used between flights to look for signs of cracks. A small amount of debris was found inside plumbing aboard the shuttle Discovery, prompting concern about similar contamination in Atlantis and Endeavour.\n\nThe silicon rubber is used before and after a shuttle flight to make exact three-dimensional impressions of the fuel line flow liners to look for signs of potentially catastrophic cracks. Engineers apparently missed a small bit of the material after impressions were made in Discovery's flow liners between two of its most recent flights. NASA managers wanted to make sure no similar contamination is present in the main propulsion systems of the other orbiters. So far, no other contamination has been found.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}