{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "5p 5/2 Update: Booster segments in train derailment", "body": "\n\n\n\n\n5p 5/2 Update: Booster segments in train derailment\n\n\n\n=================================\n\nCBS NEWS Coverage of Breaking Space News\nLast Updated: 04:30 p.m., 05/02/07 (all times Eastern)\n\nBy William Harwood\nCBS News Space Consultant\n\nChanges and additions:\n\n   04/26/07 (02:15 p.m.): Hawking set for zero G flight\n   04/26/07 (05:05 p.m.): Hawking enjoys eight parabolas; all smiles after zero G flight\n   05/02/07 (04:30 p.m.): Shuttle booster segments in train derailment\n\n=================================\n\n04:30 p.m., 05/02/07, Update: Suttle booster segment cars derailed; NASA assesses impact on downstream missions\n\nA train pulling eight space shuttle booster segments, each loaded with solid propellant and each in its own enclosed car, derailed in Alabama today, knocking the locomotives and at least one segment car on its side. Five to six people on the train reportedly were injured, two seriously. Engineers with booster-builder ATK Thiokol were on the way to the scene to assess the condition of the motor segments, the first step in ultimately determining whether they are safe to fly.\n\nThe same train suffered a minor, unrelated derailment last Friday in Kansas, officials said, but today's incident was much more serious. Even so, a NASA spokesman said the rubbery propellant in the booster segments does not easily ignite and there was little risk of fire or explosion.\n\nThe space shuttle uses two solid-fuel boosters and three hydrogen-fueled main engines to push the orbiter into space. Each booster is made up of four fuel segments that are shipped loaded, one segment per enclosed rail car, to the Kennedy Space Center from Thiokol's Utah manufacturing facility. Once in Florida, the segments are inspected and bolted together. After two boosters are \"stacked\" on a mobile launch platform, an external tank is attached and then a shuttle.\n\nThe boosters are the largest solid-fuel rockets ever flown and the first ever used for manned space flight. Each four-segment \"SRB\" generates 2.6 million pounds of thrust and weighs 1.3 million pounds. The SRBs provide the initial thrust to get the shuttle off the launch pad and only operate for two minutes before exhausting their propellant, detaching from the shuttle and parachuting into the ocean for recovery and eventual reuse.\n\nThe eight segments involved in today's derailment are slated for use by the shuttle Discovery in October for mission STS-120 and by the Atlantis in December for mission STS-122. The goal of STS-120 is to deliver a new connecting module to the international space station that will permit the attachment of Europe's Columbus research module during STS-122.\n\nNASA officials say it's too soon to tell what impact, if any, today's derailment might have on either mission. But several NASA officials said they were optimistic the shuttle flights in question can stay on schedule even if one or more booster segments must be replaced.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}