{"category": "ham", "to_address": "Ip-health@lists.essential.org", "from_address": "Judit Rius Sanjuan <judit.rius@keionline.org>", "subject": "[Ip-health] Datamonitor Report: AIDS Market To Grow", "body": " From Pharmalot / Ed Silverman:\n\nhttp://pharmalot.com/2007/04/aids_market_to_mushroom_report.php\n\nApril 12, 2007\nAIDS Market To Mushroom: Report\n\nThe launch of new drugs and an increase in the number of people\ndiagnosed with HIV is set to make AIDS medicine a $10.6 billion market\nby 2015, according to a Datamonitor report. That would be a significant\nincrease from about $7.1 billion in 2005.\n\nFor drugmakers, this brings good and bad news. Big pharma may be under\npressure to cut prices in the developing world, but selling HIV drugs in\nthe West remains a lucrative and fast-growing business. The research\nfirm says sales growth will come from new drugs with novel mechanisms\nand next-generation versions of existing meds.\n\nMost cases of HIV/AIDS occur in sub-Saharan Africa, where lack of\nfunding means treatment is restricted and prices are under pressure,\nresulting in little if any profit for multinational drug firms. Abbott,\nfor instance, just slashed the price in 45 countries, including\nThailand, where the government threatened to issue a compulsory license\nfor its Kaletra AIDS drug.\n\nAt the same time, however, AIDS is is also increasing in the developed\nworld, with an estimated 2.1 million people in North America and Western\nEurope living with HIV in 2006, up from 1.9 million in 2004.\n\nhttp://biz.yahoo.com/rb/070412/aids_drugs.html?.v=1\n\nAIDS drugs sales seen topping $10 billion by 2015\nThursday April 12, 3:42 am ET\nBy Ben Hirschler/ Reuters\n\nLONDON (Reuters) - The launch of new drugs and an increase in the number\nof people diagnosed with HIV is set to make AIDS medicine a $10.6\nbillion market by 2015, according to a report on Thursday.\n\nDrugmakers may be under pressure to cut prices in the developing world\nbut selling HIV drugs in the West remains a lucrative and fast-growing\nbusiness.\n\nIndependent market research firm Datamonitor said the HIV/AIDS market\nwas set to undergo significant changes over the next 10 years as drugs\nthat work through novel mechanisms and next-generation versions of\nexisting drugs are launched.\n\nSales, as a result, should rise significantly from about $7.1 billion in\n2005, benefiting a clutch of companies with promising new products,\nincluding Merck & Co Inc. (NYSE:MRK), Pfizer Inc. (NYSE:PFE, Gilead\nSciences Inc. (NasdaqGS:GILD) and Johnson & Johnson (NYSE:JNJ).\n\nMost cases of HIV/AIDS occur in sub-Saharan Africa, where lack of\nfunding means treatment is restricted and prices are under pressure,\nresulting in little if any profit for multinational drug firms.\n\nJust this week Abbott Laboratories Inc. (NYSE:ABT), widely criticized\nfor aggressive pricing of its AIDS medicines, agreed to slash the price\nof its Kaletra AIDS drug by more than half in more than 40 poor countries.\n\nBut at the same time the disease is also increasing in the developed\nworld, with an estimated 2.1 million people in North America and Western\nEurope living with HIV in 2006, up from 1.9 million in 2004.\n\n\"Advances in antiretroviral therapy have turned HIV from a universally\nfeared death sentence into a chronic disease with an average life\nexpectancy similar to that of Type 2 diabetes,\" Datamonitor analyst\nMansi Shah said.\n\n\"Because of this, attitudes towards HIV have become relatively blase\namongst some groups.\"\n\nNotable new types of drugs include Pfizer's maraviroc, a CCR5 inhibitor,\nand Merck's raltegravir, an integrase inhibitor, which are expected to\nbe launched in 2007 and 2008 respectively.\n\nThey will complement new generation forms of existing drug classes, such\nas Johnson & Johnson's recently approved Prezista, a protease inhibitor.\n\nSuch products offer new treatment options for the growing number of\npatients whose disease no longer responds to existing drugs.\n\nAt the same time, other companies are developing improved fixed-dose\ndrug combinations, including Atripla from Gilead, which combines the\ncomponents of current drug cocktails into a single pill that can be\ntaken once a day.\n\nAtripla was launched in the United States last year and is expected to\ntake market share from its two components Truvada and Sustiva, as well\nas competitor drugs such as GlaxoSmithKline Plc's (LSE:GSK.L) Combivir,\nDatamonitor said.\n\nThe global market for all pharmaceuticals grew 7 percent last year to\n$643 billion, according to estimates from another market research\ncompany, IMS Health, released last month.\n\n--\nJudit Rius Sanjuan\nAttorney\njudit.rius@keionline.org\n\nKnowledge Ecology International (KEI)\nwww.keionline.org / www.cptech.org\n1621 Connecticut Ave, NW, Suite 500 Washington, DC 20009 USA\nTel.: +1.202.332.2670, Ext 18  Fax: +1.202.332.2673\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}