{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"SUN Sports News\"<crystal.Owens@leadgenngroup.com>", "subject": "SUN Announces New Sponsors for Art of War 3", "body": "\n\n\nSUN Announces New Sponsors for Art of War 3\n\n\n\n\n\nSUN Announces New Sponsors for Art of War 3\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nSUN Announces New Sponsors for Art of War 3\n \n\n\n \n\n\n\n \nDALLAS, TX--(MARKET WIRE)--Jun 20, 2007 -- SUN Sports & Entertainment Inc. (Other OTC:SSPE.PK - News) announced  today the addition of several new Sponsors as part of its  growing database of companies looking to brand themselves  in the hottest  growing sport in America MMA (Mixed Martial Arts).\n\n \n\n\n\n\n \nOren Hodak, Director of Corporate Sponsorships stated, \"The  list of  national and regional sponsors grows everyday. We are getting  a lot of  inquiries from Companies that are seeking this demographic  and feel the  sport has finally hit mainstream status as a result of significant  growth  and fan loyalty. The larger players are jockeying for position  and it will  be an incredible list on Fight Night, September 1st in Dallas.\"\nThe new Sponsors that have joined SUN are; Take-A-Nap Fight  Gear  (www.takeanapfightgear.com)  that provides all Fighter Gloves, House of Pain  (www.houseofpain.com)  that provides Event Security, Cryogel Inc.  (www.cryogel.tv), the  number one selling product for superior pain relief  and Gold's Gym (www.goldsgym.com),  the official destination training  facility. Other sponsors include Dallas Blue Network  (http://leadgenngroup.com/cgi-bin/clickthru/6495/2447/92258)  and DFW Exposed, the  premier Dallas events groups (www.dfwexposed.com)  providing promotion and  publicity for the Art of War.\n\n\n                      Corey Bennin, VP of Marketing for Take-A-Nap Fight Gear  stated, \"We are  delighted to be the official Glove Sponsor for the Art of  War series. This  is our third event working with SUN and their team and everything  they have  promised they have delivered. We have gotten great response  from the event  and all the additional publicity and press coverage. The  chance to provide  Team Gloves for Team USA and Team Brazil is a real honor  and we look  forward to continuing to be of service to these great fighters.\"\nGold's Gym, Texas Marketing Manager Lisa Canady, said, \"We  have a lot of  confidence in the growth of MMA and are excited to be a  part of the  phenomena of Art of War. We find many of our members have  a great interest  in this sport and we certainly enjoy having the professional  fighters  training at our facility. Gold's is committed to providing  world class  fitness and conditioning and supporting MMA.\"\n\"The Art of War has reinvigorated the Dallas sports scene.  It brings  world-class entertainment to a world-class business market.  We are pleased  to be a part of this top quality event and represent the  local business and  technology companies,\" stated Marc Freedman, Executive Director,  The Dallas  Blue Business Network.\nAccording to Mike Crawford, VP of Cryogel, \"Being one of  the major sponsors  for current UFC Champion Rampage Jackson has helped shoot  our product to  the top of the industry. We believe that teaming with a  great up and  coming organization such as Art of War will help us both  to enjoy continued  success.\"\nThe consumers drawn to MMA are 21 to 49-year-olds and represent  one of the  most affluent demographical groups in the world. They pursue  a high  standard of living, they have large disposable incomes,  and they are not  afraid to spend. Over 77% of patrons are between the ages  of 21 and 49. The  median household income is $50,000 and 55% are male. Professionals  account  for 59% of the group, 68% own their home and an astounding  86% have had  some form of higher education.\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}