{"category": "ham", "to_address": "Dan Shearer <dan@shearer.org>", "from_address": "David Holder <david.holder@erion.co.uk>", "subject": "Re: Samba and Vista with IPv6 Presentation", "body": "Dan,\n\n> The key sentences I took away from the talk were:\n>\n>     Vista will only contact Active Directory DC over IPv6\n>\n> and \n>\n>     Altho Samba3 works over IPv6, it won't work as a DC\n>   \nAlmost correct! Samba3 doesn't work over IPv6. It can be made to listen \non port 445 over IPv6 which is not the same thing. Regarding the first \npoint, Vista will only join a AD domain over IPv6. It cannot join an NT \ndomain over IPv6. Since Samba3 cannot be an AD DC Vista and Longhorn \nclients will not be able to join a Samba3 domain over IPv6 even if \nSamba3 is given IPv6 support.\n\nI think that the most important  point is that I believe that the \nimplementation of Windows Vista and Windows Longhorn will have a \nsignificant impact on the take up of IPv6. At one extreme there will be \ncompanies that are not interested in IPv6 that start using it simply by \nimplementing Vista and Longhorn. At the other extreme you will find \ncompanies that need to move to IPv6 but that have been held back by the \nlack of full support in Windows. The release of Vista and Longhorn will \nallow them to go ahead and migrate to IPv6.\n\nKeep in mind that IPv6 is the default stack for Vista and Longhorn, that \nit is used in preference to IPv4 and that it is difficult to disable \ncompletely.\n\nAmongst these companies there will be many who are using Samba as an \nintegration tool. They will need Samba to support IPv6. I was giving an \nIPv6 Security talk to a large EU organisation on Monday. I had not \nrealised until Monday that they used Samba. The lack of IPv6 support in \nSamba will be a hinderence to them migrating to IPv6.\n\n> Can I suggest you submit your patch(s) to the relevant bug(s), unless I\n> was misreading you haven't done that yet.\nI will submit patches for the ones I am able to do. Some of the bugs are \nvery general and willl require a lot of changes in many different parts \nof the code. (Also, remember that I don't do much C programming, so any \ncode I produce will be slow to write and bug rich!)\n\nAs I understand it there will need to be changes made to:\n1) Build system\n2) Testing\n3) Server code\n4) Client code\n5) Confguration files\n6) Management tools\n7) Documentation\n\nWhat I want to attempt to do is write up some IPv6 guidance. From \ntalking to folks at SambaXP I believe that there are some key things \nthat need to be understood in order to IPv6 enable Samba3 effectively. \nI'm also happy to help out constructing test labs, doing some testing \nand answering IPv6 questions.\n\nDavid\n------------------------------------------------------------------------\nDr David Holder CEng MIET MIEEE\n\nErion Ltd, Oakleigh, Upper Sutherland Road, Halifax, HX3 8NT\n\nReception: +44 (0)1422 207000\n\nDirect Dial: +44 (0)131 2026317\n\nCell: +44 (0) 7768 456831\n\nRegistered in England and Wales. Registered Number 3521142\nVAT Number: GB 698 3633 78\n\n\n\n\nDan Shearer wrote:\n> On Thu, May 24, 2007 at 05:51:19PM +0100, David Holder wrote:\n>   \n>> I have put a PDF of my talk up on one of our web-sites at\n>> http://www.ipv6consultancy.com/ipv6blog/wp-content/uploads/2007/05/samba-and-vista-with-ipv6v2.pdf. \n>> I had thought it would appear on www.sambaxp.org but it hasn't yet.\n>>     \n>\n> The key sentences I took away from the talk were:\n>\n>     Vista will only contact Active Directory DC over IPv6\n>\n> and \n>\n>     Altho Samba3 works over IPv6, it won't work as a DC\n>\n>   \n>> I have logged a number of bugs regarding IPv6 and I still have quite a\n>> number to log. I'm very happy to answer questions regarding IPv6 and to try\n>> and help in this area if I can. I am very interested to hear from anyone is\n>> also working with IPv6 and Samba.\n>>     \n>\n> Can I suggest you submit your patch(s) to the relevant bug(s), unless I\n> was misreading you haven't done that yet.\n>\n>   \n\n"}