{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 11, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESSoldier On Training Mission Missing 3 Days\nTeams of soldiers and civilians, in ATVs, helicopters and on horseback,  scoured the rugged terrain of Fort Hood, Tex., for\n                        a soldier missing since he set out on a solo exercise on Friday. The 24-year-old was attempting a 6-hour navigational mission. More...\n• The Couple Who Shattered The Race Barrier• Bush Undaunted On Immigration, Gonzales\n                     \t\t\t\t\t| Watch• 3 GIs Killed In Baghdad Bridge Blast\n                     \t\t\t\t\t| WatchU.S.Death Penalty Deters Murders, Studies Say\nAcademic studies over the last half-dozen years say that the death penalty does deter murders. They count between three and\n                        18 lives that would be saved by the execution of each convicted killer. The reports have horrified death penalty opponents. More...\n• Soldier On Training Mission Missing 3 Days• Roller Coaster Riders Left Hanging• U.S. Remains Biggest Military Spender• More StoriesWorldU.S. Chummy With Sudan Despite Darfur?\nSudan is secretly working with the CIA to spy on Iraqi insurgents, says the Los Angeles Times. And did you expect Tony Soprano\n                        to get whacked? Fuhgeddaboudit. Joel Roberts has the highlights of the day's headlines.  More...Watch: Sopranos Says Arrivederci \n• 3 GIs Killed In Baghdad Bridge Blast\n                     \t\t\t\t\t| Watch• Gunfire Breaks Up Palestinian Meeting • Scores Killed In Bangladesh Mudslides• More StoriesPoliticsThompson Shakes Up GOP Race\nFred Thompson's expected entry into the tight Republican presidential race is drawing crucial strength from conservatives\n                        and older men, vaulting him into the thick of the GOP nomination fight, a poll shows. Also, Al Gore is third among Democrats. More...Watch: Politico On Fred Thompson\n• Bush Undaunted On Immigration, Gonzales\n                     \t\t\t\t\t| Watch• Congress' Goal: A Clean, Green Capitol• Lieberman: Bomb Iran If It Doesn't Stop\n                     \t\t\t\t\t| Watch• More StoriesHealthTo Avoid Arthritis, Start When Young\nAn expert says the time to start is when you're in your 40s, 30s, or even earlier! He also shares pointers, on The Early\n                        Show. And don't think you're immune: He says it happens to all of us, if we live long enough.  More...Watch: Preventing Osteoarthritis\n• E. Coli Fears Spur Expanded Beef Recalls\n                     \t\t\t\t\t| Watch• Autism Vaccine Case Hits Federal Court• Track Star's Death Blamed On Pain Cream\n                     \t\t\t\t\t| Watch• More StoriesSciTechCongress' Goal: A Clean, Green Capitol\nCongress says it's going to join the war against global warming by cleaning up its own backyard, now cluttered with a coal-burning\n                        power plant, a fleet of fuel-inefficient vehicles and old-fashioned lights. More...\n• Have QWERTY, Will Travel• Shuttle Docks With Space Station\n                     \t\t\t\t\t| Watch• DIY Small Towns Hook Up To The WWW• More StoriesBusinessGas Prices Drop Seven Cents\nA market survey of gas prices show that the national average price for self-serve, regular grade gasoline fell seven cents\n                        since the last survey in May. Foreign imports are being credited for this first price drop since January.  More...\n• Treasury Notes, The Economy\n                     \t\t\t\t\t| Watch• Barry Diller's Third Act• Will America Accept The Micro Car Option?\n                     \t\t\t\t\t| Watch• More StoriesEntertainmentMontana Officials Hunt Letterman Plotter \nA prison inmate accused of plotting to kidnap David Letterman's young son is on the loose after he and another man escaped\n                        the Montana State Prison ranch in a truck. More...\n• Was This Really It For \"Sopranos?\"\n                     \t\t\t\t\t| Watch• Paris Says God Has Given Her \"New Chance\"\n                     \t\t\t\t\t| Watch• Tonys Love \"Utopia\" & \"Awakening\" \n                     \t\t\t\t\t| Watch• More StoriesOpinionGraham's Crusade Saved America\nA recent tribute to Billy Graham by former President George H.W. Bush underscored the evangelical preacher's role in restoring\n                        religion's place as a key element of America's social fabric, says The Weekly Standard. More...Watch: The Legacy Of Billy Graham\n• Wolfowitz Redux?\n                     \t\t\t\t\t| Watch• Americans Want The Immigration Bill• Overwhelming Outrage On Immigration\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSShowBuzz: People In Hot Water: Paris Says God Has Given Her \"New Chance\"\nIn her first interview from behind bars, Paris Hilton says that God has given her a \"new chance\" and that her ordeal has inspired\n                        her to make a difference. More...Watch: Paris Busy Behind Bars\n• EARLY SHOW: Was This Really It For \"Sopranos?\"\n                     \t\t\t\t\t| Watch• EARLY SHOW: Cat Cora Cooks \"From The Hip\"• EARLY SHOW: Color Your Hair Bold For Summer\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nTaming Baghdad's 'Hotspots'U.S. troops in Baghdad are hoping that by isolating certain troubled Baghdad neighborhoods and making significant improvements,\n                                    they can show residents the benefits of cooperation. Lara Logan reports.\nTOP VIDEOS\nJessica Alba Back In 'Four'\nSeth Green On 'Robot Chicken'\nSopranos Says Arrivederci \nLife Not Simple Behind Bars\nThe Truth About Parenthood\nSizzling Summer Hair\nCindy McCain Helps Kids Smile\n'Cooking From The Hip'\nBush Gets Domestic In Bulgaria\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesLesley Stahl profiles Internet tycoon Barry Diller. This Sunday, 7 p.m. ET/PT.48 Hours MysteryDark Voyage:An aspiring actress dies under mysterious circumstances. Bill Lagattuta reports Saturday at\n                           8 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}