{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nSaturday, 16 June, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nMan Utd move interests Gudjohnsen\nBarcelona star Eidur Gudjohnsen admits he would be tempted by a transfer to Man Utd.\n\n\n\n \nSheringham wants to keep playing\nVeteran striker Teddy Sheringham says he is honoured to receive an MBE and wants to play on for as long as possible.\n\n\n\n \nBotham honoured with knighthood\nIan Botham, Ryan Giggs and Teddy Sheringham are among the sports stars on the Queen's Birthday Honours List.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nLive - US Open\nThe early starters get their rounds under way on day three at Oakmont.\n\n\n\n \nUSGA stands firm on Oakmont test\nOfficials at the US Open restate their happiness with the Oakmont set-up despite calls to make it easier.\n\n\n\n \nCabrera powers into Oakmont lead\nArgentine Angel Cabrera birdies the last to take a one-shot lead at the halfway stage of the US Open.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nLive - US GP qualifying\nThe battle for grid positions from the US Grand Prix at Indianapolis.\n\n\n\n \nAlonso remains man to beat in US\nWorld champion Fernando Alonso is quickest yet again before Saturday's qualifying for the US Grand Prix.\n\n\n\n \nToseland fourth on grid at Misano\nWorld Superbikes championship leader Jame Toseland will start Sunday's San Marino races from fourth place on the grid.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nLive - US GP qualifying\nThe battle for grid positions from the US Grand Prix at Indianapolis.\n\n\n\n \nAlonso remains man to beat in US\nWorld champion Fernando Alonso is quickest yet again before Saturday's qualifying for the US Grand Prix.\n\n\n\n \nHamilton rejects Alonso complaint\nLewis Hamilton describes Fernando Alonso's claim that McLaren are favouring him as \"strange\".\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nDevonish best dashed by mistake\nMarlon Devonish could see his 100m personal best removed from the records because of an administrative mistake in Oslo.\n\n\n\n \nIdowu shines in Golden League win\nPhillips Idowu beats the world's best triple jumpers to claim the opening Golden League meeting in Oslo.\n\n\n\n \nYelling withdraws from GB squad\nLiz Yelling pulls out of the GB marathon squad for this summer's World Athletics Championships in Osaka.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nMoreau into lead as Iglinsky wins\nFrenchman Christophe Moreau leads the Dauphine Libere after the sixth stage is won by Kazakhstan's Maxim Iglinsky.\n\n\n\n \nBasso handed two-year doping ban\nIvan Basso receives the maximum two-year doping ban from the Italian cycling federation.\n\n\n\n \nHammond eyes Tour de France spot\nBriton Roger Hammond heads to the Tour de Suisse on Saturday hoping to secure a spot at next month's Tour de France.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nReview of the week\nMichael Vaughan hits the town as Messi keeps his hand in\n\n\n\n \nQuotes of the Week\nRamon Calderon on David Beckham, plus Lewis Hamilton and Graham Taylor\n\n\n\n \nTen to Tackle\nTest your knowledge of the last seven days in sport\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}