{"category": "ham", "to_address": null, "from_address": "Erich Neuwirth <erich.neuwirth@univie.ac.at>", "subject": "Re: [R] importing excel-file", "body": "I am coming in late in this discussion because I am away from home and\ndo not read my email regularly. Here are my few cents.\n\nIf you are working on Windows and have Excel installed,\nan easy way of transferring data between R and Excel is my RExcel\npackage which ships with Thomas Baier's R(D)COM package, and also can be\nused with Thomas' rcom package.\n\nrcom is available as a package from CRAN and can be installed from the\npackage menu in RGui.\n\nR(D)COM is available from CRAN in section Other. You have to download it\nand run the installer program (and you need admin rights to be able to\ndo this).\n\nIf you use rcom, you should have R and Excel open simultaneously.\nThen, just select a range in Excel, right-click any cell in the range,\nand click on \"Put Dataframe\" in the context menu that pops up.\nYour data are immediately transferred to R as a dataframe (you choose\nthat name, or RExcel uses the Excel file name or the worksheet name).\n\nThe main difference between the R(D)COM server and the rcom package is\nthat with rcom RGui is visible, so you can switch between R and Excel.\nWith R(D)COM, you have R in the background.\n\nThere is a mailing list, for all rcom and R(D)COM related questions,\nyou can subscribe by way of the rcom web server,\nhttp://rcom.univie.ac.at (the link to the mailing list is there).\n\n\n\nSchmitt, Corinna wrote:\n> Dear R-experts,\n> \n> It is a quite stupid question but please help me. I am very confuced. I\n> am able to import normal txt ant mat-files to R but unable to import\n> .xls-file\n> \n> I do not understand the online help. Can please anyone send me the\n> corresponding command lines? The .xls-file is attached. In my file we\n> use commas for the decimal format (example: 0,712), changes might be\n> needed.\n> \n> Thanks, Corinna\n> \n> \n> \n> ------------------------------------------------------------------------\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n\n-- \nErich Neuwirth, Didactic Center for Computer Science\nUniversity of Vienna\nVisit our SunSITE at http://sunsite.univie.ac.at\nPhone: +43-1-4277-39464 Fax: +43-1-4277-9394\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}