{"category": "ham", "to_address": "\"MJ Ray\" <mjr@phonecoop.coop>", "from_address": "\"Jordi Gutierrez Hermoso\" <jordigh@gmail.com>", "subject": "Re: Request for suggestions of DFSG-free documentation licences", "body": "On 05/06/07, MJ Ray  wrote:\n> > Small excerpts (e.g. an Emacs reference card from the Emacs info docs)\n> > are probably covered under Fair Use. [...]\n>\n> This is England calling.\n\nWould the FSF have to sue under US law or UK law an offender in the\nUK? I'm genuinely ignorant about this issue.\n\n> poison pill invariant sections\n\nHuh? Poison pill?\n\n> and inability to fix some sections.\n\nWhat do you want to fix? The reasons for why free software needs free\ndocumentation or would you like to fix the suggestions on how to give\nfunds to the FSF? You think you know better than the FSF what funds\nthe FSF needs?\n\nSince invariant sections can't be about technical matters, I really\nfail to see what non-technical aspects could possibly need to be\n\"fixed\".\n\n> > [...] Debian\n> > really is the odd distro out here by considering GFDL docs non-free.\n>\n> Not even RMS or the FSF calls the FDL a Free Software licence.\n\nOf course the FSF doesn't consider the GFDL a free software licence.\nThat's why it recommends releasing any substantial amount of code from\na GFDLed doc under the GPL. I wouldn't call the GFDL a free software\nlicence; it isn't a software licence at all. But it's Debian who\ninsists on calling Wikipedia a software distributor (and I'm not\nreferring to Wikimedia, I'm referring to Wikipedia's content). Since\nDebian wants to call every bitstream \"software\", then it feels like it\ncan apply the DFSG to every bitstream.\n\nSoftware simply doesn't need the same freedoms as documentation, but\nDebian disagrees. Perhaps it wants to modify the results of the\nMOTIVATION article in the Emacs distribution in hopes of altering\nreality by altering the findings of the article (yes, I'm trolling,\nsorry, but the whole GFDL thing and Debian really gets my knickers in\na twist).\n\n> non-free-software aspects of FDL and was just yanking our chain.\n\nDebian calling the GFDL \"non-free\" reminds me so much of the BSD\nzealots calling the GPL \"non-free\". This really is the stuff of\nflamewars (such as this one).\n\n- Jordi G. H.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}