{"category": "ham", "to_address": "<r-help@stat.math.ethz.ch>", "from_address": "\"Tim Howard\" <tghoward@gw.dec.state.ny.us>", "subject": "[R] opinions please: text editors and reporting/Sweave?", "body": "dear all - \n\nI currently use Tinn-R as my text editor to work with code that I submit to R, with some output dumped to text files, some images dumped to pdf. (system: Windows 2K and XP, R 2.4.1 and R 2.5). We are using R for overnight runs to create large output data files for GIS, but then I need simple output reports for analysis results for each separate data set. Thus, I create many reports of the same style, but just based on different input data.\n\nI am recognizing that I need a better reporting system, so that I can create clean reports for each separate R run. This obviously means using Sweave and some implementation of LaTex, both of which are new to me. I've installed MikTex and successfully completed a demo or two for creating pdfs from raw LaTeX.\n\nIt appears that if I want to ease my entry into the world of LaTeX, I might need to switch editors to something like Emacs (I read somewhere that Emacs helps with the TeX markup?). After quite a while wallowing at the Emacs site, I am finding that ESS is well integrated with R and might be the way to go. Aaaagh... I'm in way over my head!\n\nMy questions:\n\nWhat, in your opinion, is the simplest way to integrate text and graphics reports into a single report such as a pdf file. \n\nIf the answer to this is LaTeX and Sweave, is it difficult to use a text editor such as Tinn-R or would you strongly recommend I leave behind Tinn and move over to an editor that has more LaTeX help?  \n\nIn reading over Friedrich Leisch's \"Sweave User Manual\" (v 1.6.0) I am beginning to think I can do everything I need with my simple editor. Before spending many hours going down that path, I thought it prudent to ask the R community.\n\nIt is likely I am misunderstanding some of the process here and any clarifications are welcome. \n\nThank you in advance for any thoughts. \nTim Howard\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}