{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Ricky Enger <renger@carolina.rr.com>", "subject": "Re: VmWare", "body": "Hi Brent,\nActually, what you're experiencing is a bug in VmWare whereby the \nemulated sound card can't handle mono sound sources well, and \nFestival is apparently mono.\n\nNow, in Ubuntu 7.04, Espeak is the default software synth and it \nworks great.  You can download the iso for the live cd and boot from \nthat.  This, of course, assumes you've installed VmWare server rather \nthan just the player.\n\nNote that if you actually want to install from the live cd, you'll \nneed to do a couple things to get the installation to speak.\n\nFirst, launch gnome-terminal.  You can switch to superuser here by \ntyping sudo su.  You'll then need to create an .orbitrc file in the \n/root directory.  I use nano but you can use the editor of your \nchoice.  The .orbitrc file should contain the following lines:\nORBIIOPIPv4=1\nORBIIOPUNIX=0\n\nSave the file and then you should be able to launch ubiquity from the \ndesktop icon.\n\nHth,\nRicky\n\nAt 09:56 AM 4/18/2007, you wrote:\n>I tried this with VMWare Player. I was going to load up the Ubuntu 6.10 iso\n>and install it on a virtual machine this way. I used easyvmx.com to generate\n>the proper files and chose the ES whatever sound card it would use by\n>default. Everything seemed to go OK until Orca loaded, and I got odd\n>static-like noises instead of speech. I think sound is definitely broken\n>some how in VMWare Player. I might uninstall that and try server instead.\n>\n>----- Original Message -----\n>From: \"Jeremy\" \n>To: \n>Sent: Wednesday, April 18, 2007 2:27 AM\n>Subject: Re: VmWare\n>\n>\n> > Late reply to one of the earlier posts on this subject. I had asked a\n> > question about how to get a installation of linux running in a vm,\n> > and, I have to say that I did get it working. It Turned out to be\n> > very easy, but, I was wondering about sound support in the vm as I\n> > was just using speakup through my serial port. It was kind of cool\n> > when I got it working as I was on skype on the windows host and it\n> > never gave me any trouble, but, I am guessing that getting some sort\n> > of software synth working would not work unless I had another\n> > soundcard to rout it through? I am not even sure if I can find\n> > drivers for my soundcard that is built into this laptop, but, that is\n> > a question for another time I suppose. If someone can tell me more\n> > about how this kind of thing works, that would be wonderful. I\n> > noticed that someone did get software speech going with a vm, so,\n> > figured I would ask.\n> > Thanks bunches.\n> >\n> >\n> > _______________________________________________\n> > Speakup mailing list\n> > Speakup@braille.uwo.ca\n> > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> >\n>\n>\n>_______________________________________________\n>Speakup mailing list\n>Speakup@braille.uwo.ca\n>http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}