{"category": "ham", "to_address": "perl6-language@perl.org", "from_address": "Andrew Shitov <andy@shitov.ru>", "subject": "Is Perl 6 too late?", "body": "=HI!\nTo avoid any uncertainty: the subject is a parody for similar\ndiscussion on perl6-internals@ about Parrot.\n\n\n=FOREWORD\nWhat I want to say is that after N years of developing Perl 6 we do\nnot have a practical (P in Perl stands for Practical) tool which can\nwork in real life.\n\nEven worse: today there is no way to speed up the interpreter - it is\ngood for parsing the language but is very slow for real applications.\n(mod_pugs is not the case while there is no command-line tool).\n\n\n=EXPLANATION\nWe have Pugs to play with. We have no tool to run with.\n\nCurrent Pugs have options to compile the programme into several\nintermediate languages, for example PIR:\n\nYou can\n    pugs -CPIR helloworld.pl > helloworld.pir\n\nBut you cannot later do this:\n    pugs -BPIR helloworld.pir\n\nStandalone parrot does not help.\n\n\n=WHAT IS TO BE DONE\nWhat is nedded is a very simple step: complete the Pugs compiler so\nthat it could provide good PASM (PIR). Going this way we will achieve\nthe main goal: it will be possible to use hi-speed applications\nwritten in Perl 6 today. No care the language itself is not fully\nstandardized.\n\nIt will change the status of 'conception' and 'project'\nto 'utilizing' and 'using'.\n\n\n=CUT\nA bit of fun is that three years ago the situation was better: language\nwas more poor, the tools for more pure. In April of 2004 I made\na toy server with demos of how real Perl 6 works on a web-server. There\nwas a bit of examples with comments in Russian that were written on\nreal Perl 6 of that day, compiled into Parrot bytecode (.pbc) and run\non Apache under Parrot virtual machine. I cannot do the same with\ntoday's instrumentary (or maybe I do not know how to?).\n\n\nThank you for understanding :-)\n\n\n--\nAndrew Shitov\n______________________________________________________________________\nandy@shitov.ru | http://www.shitov.ru\n\n"}