{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 135", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. GANGLAND Godfather Terry Adams - linked to 25 murders -\n      fancied himself as an ANTIQUES expert\n      (Museum Security Network Mailing list)\n   2. 'Monument Man': World War II veteran honored for saving art\n      (Museum Security Network Mailing list)\n   3. Revealed: the stolen art found at home of crime boss Adams\n      (Museum Security Network Mailing list)\n   4. A passionate quest for the Rome Synagogue library stolen by\n      German troops during World War,\ta story which could easily become\n      the script for an Indiana Jones\tblockbuster, might at last be on\n      the right path. (Museum Security Network Mailing list)\n   5. The Rockwell Files. Steven Spielberg's stolen painting,\ta St.\n      Louis art thief,\tand a plot to kill Martin Luther King. It could\n      make a helluva movie. (Museum Security Network Mailing list)\n   6. A jury has found the boyfriend of Olympic champion Myriam\n      Bedard guilty of art theft. (Museum Security Network Mailing list)\n   7. Global warming, war, development threaten historic sites\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Thu, 7 Jun 2007 22:22:15 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] GANGLAND Godfather Terry Adams - linked to 25 murders -\n\tfancied himself as an ANTIQUES expert\nTo: \nMessage-ID: <005201c7a941$8a1b1eb0$9e515c10$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nBoss's Antiques Rogue Show\n\nGANGLAND Godfather Terry Adams fancied himself as an ANTIQUES expert ? like\nTV rogue Lovejoy, it has emerged. \n\nPhoto:\nhttp://www.thesun.co.uk/article/0,,2-2007260316,00.html\n\n\nAdams ? linked to 25 murders ? had a ?700,000 collection of mainly stolen\nvaluables, including his prized ?120,000 porcelain figures.  \n \n Other pinched items included ?60,000 Bluejohn vases, ?8,000 Ormolu\ncandlesticks and work by Picasso and Brit artist Henry Moore worth ?35,000. \n\nAdams, 52, is serving seven years? jail for money laundering and a source\nclose to his trial said: ?There?s no doubt he thought of himself as a\ncollector.?\n\nThe items were stolen in thefts dating back to 1991. Insurance firms, which\nhave long since paid out, will now take possession of the valuables. \n\nA Serious Organised Crime Agency spokesman said: ?This is not to suggest\nAdams was involved in their theft, or that he was aware they were stolen.?\n\nThe collection was uncovered during a raid on Adams? mansion in Barnet,\nNorth London.   \n\ns.hughes@the-sun.co.uk\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Thu, 7 Jun 2007 22:22:15 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] 'Monument Man': World War II veteran honored for saving\n\tart\nTo: \nMessage-ID: <005401c7a941$8d38d970$a7aa8c50$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\n'Monument Man': World War II veteran honored for saving art\nBy ROB HOTAKAINEN\nThe Star's Washington Correspondent\n\nWASHINGTON | Stationed in Germany during World War II, James Reeds was the\nchief clerk for a little office with a big mission: rescuing art that had\nbeen looted by Nazis.\n\nOn Wednesday, the 85-year-old man from Kansas City squinted into the bright\ntelevision lights on Capitol Hill, clutching an American flag with both\nhands. His hair and beard were white. He walked with a cane and spoke\nslowly.\n\n\"I think we did a good thing in that war,\" Reeds said. \"We conquered the\nNazis and their friends and we did very good things to protect people from\nthe sins of the Nazis. . I'm glad to be an American.\"\n\nOn the 63rd anniversary of D-Day, Congress paused to honor Reeds and three\nother members of the so-called Monuments Men. They were a small band of arts\nexperts that tracked down tens of thousands of pieces of stolen art and\ncultural artifacts by masters such as Michelangelo, Rembrandt, Picasso and\nDaVinci.\n\n\"This is long overdue,\" said Sen. Kay Bailey Hutchison, a Texas Republican\nwho presented flags to the four men: Reeds, Horace Apgar of Oklahoma, Harry\nEttinger of New Jersey, and Bernard Taper of California.\n\nhttp://www.kansascity.com/\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Thu, 7 Jun 2007 22:22:15 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Revealed: the stolen art found at home of crime boss\n\tAdams\nTo: \nMessage-ID: <005301c7a941$8c256da0$a47048e0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nRevealed: the stolen art found at home of crime boss Adams\n\n\n? Police found 'Aladdin's cave' of treasures\n? Many owners traced after raid on mansion \n\nSandra Laville, crime correspondent\nThursday June 7, 2007\nThe Guardian \n\n\nA treasure trove of stolen art and antiques, which was discovered in the ?2m\nmansion belonging to the London crime boss Terry Adams, can be revealed\ntoday.\nWhen detectives arrested the north London godfather in September 2003 they\nfound what they later described as an Aladdin's cave of treasures gracing\nhis home. Most of the property was found to have been stolen from country\nhouses, art galleries and museums over the last 10-15 years. Many of the\nantiques had been packed into cases and were apparently about to be moved\nwhen police arrived.\n\nWhile Adams was arrested on suspicion of laundering part of his multimillion\ncrime fortune, officers catalogued the store of art and antiques, removed it\nto a warehouse, and called in experts to identify it.\nWorking with the Art Loss Register and officers from the arts and antiques\nsquad at Scotland Yard, detectives from the National Crime Squad, which\nlater became the Serious and Organised Crime Agency, attempted to find where\nthe property had originally come from. They managed to trace the owners of\n?274,000 worth of the stolen art and antiques and yesterday released\npictures of some of the returned items to the Guardian.\n\nVictims of the burglaries included an 85-year-old woman from Sherborne,\nDorset, whose ?2,000 Chinese lacquered Davenport writing bureau was stolen\nin 1992; a leading London gallery, the Marlborough, which had three Henry\nMoore prints and three Picasso etchings worth ?35,000 stolen in 1997; the\nLibrary Museum of the Freemasons, which lost five pieces of Meissen\nporcelain worth ?120,000 in two thefts in 1991 and 1996; and Asprey's\nauction house, which lost a pair of Bluejohn Cassolette vases worth ?60,000\nin 1996.\n\nHowever, the Sherborne victim, who did not want to be named, has still not\ngained possession of her bureau.\n\nShe said yesterday: \"By the time the police found it, the insurance company\nhad paid out on it. It is now in their possession and I don't think I can\nafford to buy it back, which is a shame.\"\n\nHugo Gorst-Williams, of the recovery section of the Art Loss Register, which\nholds details of 170,000 items of stolen art and antiques on its database,\nsaid he was called in by police shortly after Adams' arrest in 2003.\n\n\"At the time, we did not know the property was found at his house. There was\na major investigation going on and the police kept the information very\nclose,\" he said. \"They rang us to say they had discovered an Aladdin's cave\nand asked for our help. It was only much later we were told the items had\nbeen found in Terry Adams' home.\"\n\nDetectives sent a list of the items, which were worth more than ?500,000 in\nall, to experts at the Art Loss Register. \"We were able to match up some of\nthe items very quickly with our database,\" said Mr Gorst-Williams.\n\nAdams was jailed for seven years in March after pleading guilty to\nlaundering ?1m of his multimillion pound criminal fortune. Adams and his\nbrothers Tommy and Patsy, who were known as the A-team, ran an empire based\non loan sharking, protection rackets and money laundering through the Hatton\nGarden gem district of central London.\n\nThe family's financial adviser, Solly Nahome, who arranged for ?25m of the\nfamily's criminal income to be hidden in property deals and offshore\naccounts, was shot dead outside his home, throwing the family's financial\naffairs into chaos.\n\nAfter decades of cheating justice, Adams was caught after the Inland Revenue\ninvestigated his lavish lifestyle in the mid-1990s. He offered to settle\nwith them for ?95,000 in 1996, but the (now defunct) National Crime Squad\nlaunched a ?50m joint investigation with MI5.\n\nA specialist police team spent 21 months bugging Adams' home to provide\nevidence that he was living off proceeds of crime while claiming he had a\nlegitimate income.\n\nThe stolen art works were found when officers raided Adams's home in Mill\nHill, north London, in September 2003. In addition, they found ?50,000 in\ncash in a shoe box in the loft.\n\nAdams was ordered last month to pay ?4.7m for legal costs over four years.\n\nRelated articles:\n\nhttp://arts.guardian.co.uk/art/news/story/0,,2097291,00.html\n\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Thu, 7 Jun 2007 22:22:15 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] A passionate quest for the Rome Synagogue library\n\tstolen by\tGerman troops during World War,\ta story which could easily\n\tbecome the script for an Indiana Jones\tblockbuster, might at last be\n\ton the right path.\nTo: \nMessage-ID: <005501c7a941$8d564c80$a802e580$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nHunt resumes for vanished Jewish library \n \nRome, 6 giu (Velino) - A passionate quest for the Rome Synagogue library\nstolen by German troops during World War, a story which could easily become\nthe script for an Indiana Jones blockbuster, might at last be on the right\npath. And the 7,000 books, manuscripts and rare, centuries-old documents,\nwhich formed the second most important Jewish library in the world after the\none in Jerusalem, could be lying somewhere in the immense territory of\nRussia. Italian nvestigators acting on a mandate issued by a special Italian\nGovernment committee that was created five years ago, have managed to follow\nthe steps of the stolen library up to a certain point. \nThe library was loaded on trucks and then on trains on their way to Germany\non the night of October 14, 1943, by the Einsatzstab Reichsleiter Rosenberg,\na special commando created in Third Reich with a precise task: to neutralise\nJewish culture and then destroy it. In order to do that, the Jewish culture\nhad to be studied in its details, so the library from Rome, like documents\nfrom many other occupied countries in Europe, were to be transported to\nGermany to be \"analysed.\" It is known that thousands of books were shipped\nto Frankfurt and other localities. Many of those were found and given back\nto Jewish communities all over Europe. Together with those books, many were\nfound coming from another library, belonging to the Jewish Rabbinical\nCollege in Rome, stolen the same night. But no trace was found of the\nprecious volumes from the Synagogue library. Many cases are known of rare\nvolumes of the same kind surfacing in this or that museum or private\ncollector around the world: but this did not happen for any of the books\nstolen in Rome. \nNow Dario Tedeschi, a lawyer and director of the Italian Special committee,\nhas come to the conclusion that the 7,000 volumes were found by the Soviet\nArmy and taken back to Russia as a sort of war trophy, maybe without\nrealising what those books meant for the Jewish community. \nNow, with a donation of the Unicredit banking group, Mr Tedeschi and his\nstaff hope to be able to extend their search, hoping that the books have not\nbeen dispersed, and they are still together in some underground depot in\nsome \n(Carlo Bassi) \n\nhttp://www.ilvelino.it/\n\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Thu, 7 Jun 2007 22:22:15 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The Rockwell Files. Steven Spielberg's stolen painting,\n\ta St. Louis art thief,\tand a plot to kill Martin Luther King. It could\n\tmake a helluva movie.\nTo: \nMessage-ID: <005601c7a941$8d834ff0$a889efd0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nThe Rockwell Files\nSteven Spielberg's stolen painting, a St. Louis art thief, and a plot to\nkill Martin Luther King. It could make a helluva movie.\nBy Chad Garrison  \nPublished: June 6, 2007\n \nThe fallout was bound to get ugly. But who knew it would get so strange? \n\nPhotos and links:\nhttp://www.riverfronttimes.com/2007-06-06/news/the-rockwell-files\n\nRobin Eley \nNorman Rockwell's Russian Schoolroom.\n \nThe police report of the painting's 1973 theft\nRobin Eley \nRobin Eley \nSubject(s): James Earl Ray, American Independent Party, Jack Solomon, House\nSelect Committee on Assassinations, Martin Luther King Jr., Creative Art\nStudio, Norman Rockwell, Art Loss Register, FBI, Steven Spielberg In March\nfilmmaker Steven Spielberg was found in possession of a stolen Norman\nRockwell painting. As the Wall Street Journal, the Associated Press, CNN and\ncountless other media outlets reported then, Spielberg purchased the\npilfered art for $200,000 in 1989 - some sixteen years after it disappeared\nfrom a suburban St. Louis gallery during an early-morning burglary. \n\nThe artwork in question, an oil-on-canvas piece titled Russian Schoolroom,\nwas commissioned by Look magazine in 1967. Today it has a value of nearly\n$700,000. According to federal authorities, Spielberg first learned of the\npainting's dubious provenance in late February, when one of his employees\nnoticed the painting listed on the FBI's Art Crime Team Web site. In a press\nrelease issued March 2, the FBI stated: \"Mr. Spielberg is cooperating fully\nwith the FBI and will retain possession of the Russian Schoolroom until its\ndisposition can be determined.\" \n\nNow a civil legal battle has erupted over the ownership of the filched\npainting. Last month Jack Solomon - owner of the now-defunct Clayton art\ngallery, Arts International, from which the painting was stolen in 1973 -\nsued both Spielberg and the FBI for ownership of the painting. \n\nThe lawsuit filed in federal court in Solomon's home state of Nevada alleges\nthat the FBI \"has allowed defendant Spielberg to retain possession of the\nRockwell painting and failed to return the subject artwork to plaintiff\nSolomon despite the FBI's actual knowledge of the theft, recovery and\nownership.\" \n\nMeanwhile, Judy Goffman Cutler, the Rhode Island-based art dealer who sold\nthe painting to Spielberg in 1989, has filed suit against Solomon and the\nArt Loss Register Inc., an agency that is assisting Solomon in retrieving\nthe painting. In a lawsuit also filed last month in federal court, Goffman\nCutler claims Solomon's insurer paid him $25,000 for the artwork following\nthe heist and that he no longer has any claim to the painting. \n\nGoffman Cutler further alleges that the Art Loss Register intimidated her by\nthreatening to have criminal charges filed against her and that Jack Solomon\ndefamed her character in an interview with Riverfront Times this spring. In\nKristen Hinman's article published March 7, Solomon claims Goffman Cutler\n\"should have known better\" and \"could have checked that there's been a\nrecord of this ever since the day it was stolen.\" \n\nGoffman Cutler also asserts that Spielberg - an avid art collector and board\nmember for the Norman Rockwell Museum in Massachusetts - severed his\nbusiness relationship with her shortly after Solomon made his accusations to\nthe paper. She is asking the court to award her $5 million for the loss of\nthe Spielberg account and another $10 million for \"general damage to her\nreputation in her profession.\" \n\nOn May 11 the movie mogul transferred title of Russian Schoolroom back to\nGoffman Cutler in exchange for another Rockwell piece. Spielberg spokesman\nMarvin Levy says the filmmaker is cooperating with officials and the FBI has\nbeen kept abreast of every move. \n\n\"Steven was prepared to turn it over to the FBI, but they asked us to hold\nonto it for safekeeping,\" says Levy. \"We're doing whatever they tell us.\" \n\nSolomon and his attorneys contend that Spielberg should never have signed\nthe title to the painting back over to Goffman Cutler. The maneuver, they\nassert, does not clear the famed director of Schindler's List and other\nOscar-winning films of culpability. \n\n\"It's very disappointing that Steven Spielberg - who is so active in\nHolocaust causes and other philanthropies - chose in this case not to assist\na theft victim recover what's his,\" says Christopher Marinello, general\ncounsel for the Art Loss Register in New York. \n\nBut even as new allegations over the ownership of the painting come to\nlight, parties on both sides of the debate are whispering of a far more\nintriguing wrinkle to the story. They note that the government press\nreleases that heralded the painting's discovery last March make no mention\nof the person (or persons) who stole Russian Schoolroom in the first place. \n\nThe omission, say people familiar with the case, could be for good reason\nand may very well be tied to the thief's association with a St. Louis-based\nplot to kill Martin Luther King Jr. It's a wild story, full of FBI\noversights and fumbles - and a tale the feds might prefer remain a mystery. \n\n \n\nMary Ellen Shortland was 28 years old and working as assistant director of\nArts International when someone smashed though the gallery's front door on\nJune 25, 1973. \n\nShortland, now 62 and owner of Creative Art Gallery & Framing in south St.\nLouis, recalls the theft of Russian Schoolroom as one of the great\ndisappointments in her young career. She says Arts International was hosting\nan exhibit of signed Rockwell prints that June. In an effort to build\npublicity for the three-week show, Jack Solomon (who owned Arts\nInternational, as well as dozens of other galleries across the nation) had\nan employee from one of his Kansas City studios drive Russian Schoolroom to\nSt. Louis. \n\nThe painting had been here for just one day when on June 21 Shortland sold\nit for $25,000 to the late Bert Elam, a St. Louis concrete contractor and\nart collector. Elam agreed to let the gallery display the work until the end\nof the show. Four days later, on June 25, a thief made off with the painting\nand Shortland nearly lost her best customer. \n\n\"Mr. Elam was very unhappy that I'd talked him into letting us keep the\npainting,\" recalls Shortland. \"Later he found out that the painting was\nprobably worth more like $40,000. He'd gotten a heck of a deal, only for it\nto be robbed out from under him.\" \n\nIn the end, the gallery reimbursed Elam the money he put down on the\npainting and Arts International retained title to the work. Later the\ngallery was paid $25,000 from its insurer for the loss. \n\nA few weeks after the theft, Elam hired a private detective to investigate.\nShortland recalls that the detective came back with disturbing news. \"He\nsaid he'd found the people who'd stolen it, and they were a bad outfit,\"\nremembers Shortland. \"He warned Mr. Elam that even if he got the painting\nback, they'd just steal it again.\" \n\nShortland would eventually forget about the painting. Then - sixteen years\nafter its disappearance - she was flipping through the July/August 1989\nedition of the trade magazine Art & Auction when she came across an\nadvertisement announcing the sale of Russian Schoolroom. \n\n\"I did a complete double-take,\" she says. \"That painting was stolen, and it\ncost me a lot of money and headaches. I thought to myself: 'You got to be\nkidding me.'\" \n\nShortland says she tried to call Jack Solomon at his Chicago offices but was\nunable to get through. She then called Judy Goffman Fine Art in Manhattan,\nwhich was listed in the magazine as the gallery selling the work. \"I asked,\n'Do you actually have the painting?'\" recalls Shortland. \"They said, 'Sure.'\nThey were asking something like $175,000 for it.\" \n\nShortland's queries into the work were later chronicled by former Riverfront\nTimes reporter Wm. Stage in the October 11, 1989, issue of this paper. Stage\nwrote that he also attempted to get in touch with Solomon to no avail. He\ndid, however, succeed in interviewing Judy Goffman Cutler, who told him\nshe'd recently sold the Rockwell to a person whom she declined to name. \n\nAs to the claims that the painting had been stolen, Stage reported that\nGoffman Cutler told him the artist often did several studies of one\npainting. The stolen Rockwell, surmised Goffman Cutler, must have been a\ndifferent version of the one she'd recently sold. \n\nStage later interviewed an agent with the FBI who spoke on the condition\nthat he not be quoted directly or named in the story. The agent told Stage\nthe FBI investigated the painting a year earlier, in 1988, when a Rockwell\nscholar notified the agency that Russian Schoolroom was listed for sale at\nan auction in New Orleans. (Goffman Cutler won the bidding at $70,400.) The\nagent told Stage the matter was then routed to the FBI's St. Louis office,\nbut the investigation became stymied when no one could find a police report\nfor the stolen work. \n\nThis past March Frank Brostrom, a special agent in charge of the FBI's Art\nCrime Team, told Riverfront Times that he was prompted to reopen the case in\n2004 when \"a friendly source in the community\" tipped him off to Stage's\n1989 article. He, too, acknowledged that the police report was missing. \n\n\"For whatever reason authorities at the time were unable to locate the\noriginal police report or confirm the painting had ever been stolen,\"\nBrostrom told the RFT. \n\nEarlier this year agent Frank Brostrom was transferred from the FBI's St.\nLouis office to North Carolina. He could not be reached for comment for this\nstory. Agents familiar with the Russian Schoolroom case in St. Louis and Los\nAngeles would not comment on specifics other than what's already been\nreported. \n\nIf, however, the police report was missing back in 1989, it's now readily\navailable at the Clayton Police Department. \"I got a call from the FBI about\ntwo years ago on this and we were able to pull the report from our archives\nright away,\" says Clayton police captain Kevin Murphy. \"How or why that\nwasn't the case then, I can't tell you.\" \n\nThe six-page report gives the value of the painting as $20,000 and notes the\nowner as both Arts International and Bert Elam. An appendix to the report\nprovides a witness testimony from a man who claimed to see a black male\nbreak through the front door of the gallery at 6:40 a.m. and leave seconds\nlater with a painting tucked under his arm. Nothing else in the gallery was\ntouched during the smash-and-run. \n\nClayton police can produce several more larceny reports from the same\naddress at 8113 Maryland Avenue. During a stretch in the mid-1970s the\ngallery was a constant target, with a persistent thief (or thieves)\nburglarizing the gallery on at least four separate occasions between 1973\nand 1977. \n\nThe most interesting of those break-ins occurred July 8, 1976, when a crook\npried open the front door to the gallery and left with seven Rockwell\nlithograph prints valued at more than $7,000. \n\nIn late February 1978 those prints would be recovered in the Rock Hill home\nof Russell G. Byers. A notorious St. Louis art thief, Byers would testify\nbefore the House Select Committee on Assassinations in May 1978 that he'd\nonce been offered $50,000 by two Jefferson County businessmen to kill Martin\nLuther King Jr. \n\nByers declined the offer, but the House committee found enough\ncircumstantial evidence to believe James Earl Ray may have been motivated by\nthe very same bounty when he gunned down King in Memphis on April 4, 1968. \n\n \n\nSeveral inches of snow lay on the ground the night of Sunday, January 29,\n1978, when an old Chevrolet Impala pulled up in front of the Saint Louis Art\nMuseum. Three men in ski masks emerged from the vehicle. One of them carried\na sledgehammer. \n\nIn plain sight of people sledding on Art Hill, the men smashed a window and\ndisappeared into the building. Two minutes later at 10:39 p.m., the men\nexited the museum, taking with them four statues valued at nearly $100,000 -\nincluding Frederic Remington's The Bronco Buster, valued at nearly $40,000. \n\nThree weeks later - on Monday, February 20 - thieves once again broke into\nthe museum. This time they smashed through the glass door to the museum's\neast wing at approximately 8:24 p.m. The burglars went up the east stairway\nand made off with three bronze sculptures by famed French sculptor Auguste\nRodin, best known for his iconic piece The Thinker. By the time the museum\nguards arrived minutes later, the thieves and the Rodin sculptures - valued\nat $45,000 - were nowhere to be found. \n\nEight days after the second museum heist, St. Louis detectives picked up\nJohn A. Crenshaw on federal charges of robbing a jewelry store in Illinois.\nThey were interrogating the 25-year-old suspect at police headquarters when\nCrenshaw shocked police by implicating himself in the museum break-ins. \n\nCrenshaw told the detectives that Russell Byers had taken him to the museum\nprior to the January 29 robbery and shown him which statues he wanted him to\nsteal. He said Byers paid him and his accomplices $700 for the first museum\nburglary. Crenshaw burglarized the museum a second time because the first\ntheft had been \"so easy.\" Shortly after both robberies Crenshaw allegedly\nhanded over the stolen art to Byers in a street exchange in the 5500 block\nof Cabanne Avenue in north city. \n\nCrenshaw suggested that at least six of the seven stolen statues could be\nfound with Byers. The seventh statue, a wood carving of St. Sebastian\nappraised at $4,500, was hidden away in Crenshaw's garage in north St.\nLouis. At 11 a.m. some 20 law enforcement officials - including the FBI -\ndescended on Byers' home in Rock Hill. They carried with them a search\nwarrant. When Byers' wife refused them entry, they broke through a door pane\nand entered the home. \n\nThe statues weren't there, but police found plenty of other loot. As Byers'\nwife and two teenage children stood outside on the lawn, police removed an\nestimated $300,000 worth of stolen artwork - including two paintings signed\nby Rembrandt, six oriental rugs, more than 100 silver candelabras, jade\ndishes and the seven Norman Rockwell lithographs stolen from Arts\nInternational in the 1976 burglary. \n\nIt would take another several weeks before the police recovered the six\nmissing statues from the museum. Remington's The Bronco Buster turned up in\na Goodwill drop box on Forest Park Avenue. Two other statues were found at a\nhotel on Oakland Avenue. Other statues were found in the back lot of a metal\ncompany on Manchester Road. \n\nA few hours after police stormed his home, Byers turned himself into city\npolice. The 46-year-old Byers gave his occupation as a vending-machine\ndealer. He was released on a $5,000 bond. At the time the St. Louis\nPost-Dispatch reported Byers had been arrested in St. Louis City and St.\nLouis County on several occasions in the 1960s. \n\nIn 1965 he had been convicted in U.S. District Court in St. Louis of\nconspiracy to commit auto theft and was placed on probation. Records show\nByers faced two criminal charges in St. Louis County in the 1970s. Both\ncases remain sealed. \n\nIn the weeks and months following the first museum burglary in 1978, two of\nByers' and Crenshaw's associates met violent deaths. Twenty-nine-year-old\nCharles Gunn, who assisted Crenshaw in the first break-in, was found shot in\nthe head February 17 in a north St. Louis alley. On June 11 police\ndiscovered the disfigured body of 42-year-old Sam White in a field in\nMadison County, Illinois. Described by police as \"Byers' right-hand man\"\nWhite had been shot three times and his body so badly burned it took several\ndays to identify him. \n\nAfter initially implicating Byers in the museum thefts, Crenshaw refused to\ntestify against him in court. Crenshaw was sentenced to four years in\nprison. Byers got off scot-free. \n\nIn July 1978 St. Louis Circuit Attorney George Peach told the Post-Dispatch\nthat without Crenshaw's testimony, the case against Byers was \"too weak\" to\npursue. In St. Louis County, the prosecutor's office gave the newspaper a\nsimilar account. They would not file charges against Byers for possessing\nthe Rockwell lithographs stolen from Arts International. \n\nIt wasn't just local prosecutors who were dropping charges against Byers. On\nMay 9, 1978, the U.S. House of Representatives granted Byers immunity under\nthe Organized Crime Control Act for any possible prosecution involving his\nassociation with a St. Louis-based plot to assassinate Martin Luther King. \n\nToday, those entangled in the legal battle with Steven Spielberg wonder if\nByers didn't cut a similar deal to avoid prosecution in the disappearance of\nRussian Schoolroom. They say given Byers' taste for illicit art, it's likely\nhe's the person who contracted the painting's heist in 1973. \n\nByers' involvement might also explain why no one has been charged with the\ntheft - and why the FBI failed to close in on the painting in 1988 and 1989\nwhen its agents claim the police report went missing. \n\nSound far-fetched? Perhaps, but Byers himself does not entirely rule it out.\n\n\n \n\nRussell Byers' modest brick home sits at the end of a cul-de-sac in the\nquiet suburb of Rock Hill. It's the same house police raided back in 1978. A\npicture window with a blue awning faces out into the front lawn. Two yapping\nYorkshire terriers announce the arrival of anyone who steps near the\nproperty. \n\nOn a recent weekday afternoon the silhouette of a man appears behind a\nscreened door. Before I can even reach the driveway, the man calls out: \"Who\nare you? What do you want?\" \n\nI explain that I'm looking for Russell Byers. I want to talk to him about\nsome art thefts back in the 1970s. The man responds that Byers is not home,\nand even if he were, why would he want to talk? \"What's in it for him?\" \n\nI'm curious if he knows anything about a famous Norman Rockwell painting\nstolen in 1973. The painting, I explain, is now in the possession of\nfilmmaker Steven Spielberg. \n\n\"It's a hell of a story, isn't it?\" the man responds. \"Maybe there's a lot\nmore to it than you know.\" After a few minutes the man steps outside and\nwalks over to where I'm standing in the driveway. A wrought-iron fence\nseparates us. \n\nAt 76 years old, Byers no longer appears like the underworld thug newspaper\narticles once made him out to be. In fact, he looks downright grandfatherly.\nHis white hair is parted neatly down the side. He wears slip-on loafers with\nblue socks, a pair of stone-colored khakis and a short-sleeve Oxford cloth\nshirt. A silver Rolex dangles from his left arm. \n\nByers' cheeks are a ruddy pink. He blinks his blue eyes constantly - the\nresult, he says, of surgery to relieve a problem with his tear ducts. \"Don't\nthink I'm retarded,\" he says of the blinking. \"I still have all my marbles.\"\n\n\nByers then returns to the matter at hand: his possible connection to stolen\nRockwell painting. \"Why would I want to tell you anything about that? Why\nwould I want the aggravation and the humiliation?\" \n\nI tell him that the statute of limitations for the theft has long since\nexpired. I ask him if anyone else has contacted him about Russian\nSchoolroom. The FBI, he confirms, has asked him about the painting. Any more\ninformation, says Byers, will cost me. He wants money to talk. \n\nI tell him that it's against the policy of the RFT to pay sources, adding\nthat I doubted the New York Times paid him when it interviewed him for a\nfront-page story on July 26, 1978, which revealed for the first time Byers'\nrole in a St. Louis plot to assassinate King. \n\n\"I was in Newsweek and Time magazine, too,\" boasts Byers. \"But none of them\ngot the whole story.\" \n\nThe article published in the New York Times in 1978 described Byers'\ntestimony before the House committee as an \"embarrassment\" to the FBI.\nAccording to the Times article - and backed by congressional reports - an\ninformant first told the FBI in 1973 that Byers knew of a conspiracy hatched\nin St. Louis in the 1960s to kill the civil rights leader. But the FBI\nmisfiled the information and it did not come to light until 1978 - long\nafter several of the key players in the scheme were dead and gone. \n\nWhen contacted by the House committee in 1978, Byers first denied any\nknowledge that he'd been offered money to kill King. Later he agreed to\ntestify in exchange for immunity. Byers, according to congressional reports,\ntold the committee that he was approached in late 1966 or '67 by John\nKauffmann, a former St. Louis stockbroker and owner of a motel and drug\ncompany in Imperial. \n\nThe two men had a business relationship of sorts, with Kauffmann accepting\npayment from Byers in exchange for allowing him to squirrel away stolen\nmerchandise at Kauffmann's Jefferson County motel. Byers told the committee\nthat in '66 or '67 Kauffmann asked him if he would like to make $50,000. \n\nThe following comes directly from the committee report: \"Kauffmann told him\nto meet him at 6:30 that evening, which Byers did, and together they drove\nto the home in Imperial of John Sutherland, a St. Louis patent attorney. The\nthree men met in a study that Byers described as decorated with Confederate\nflags and Civil War memorabilia. There was a rug replica of a Confederate\nflag as well, and Sutherland was wearing what appeared to Byers to be a\nConfederate colonel's hat. \n\n\"After some social conversation, Byers asked Sutherland what he would have\nto do for the $50,000. Sutherland said he would have to kill, or arrange to\nhave killed, Dr. Martin Luther King. Byers, who told the committee he did\nnot know at the time who Dr. King was, asked where that amount of money\nwould come from. \n\n\"Sutherland told him he belonged to a secret southern organization that had\nplenty of money. According to Byers, no names were mentioned. Byers said he\nneither accepted nor rejected the offer, indicating he would think it over.\nOutside the door of Sutherland's home, however, he told Kauffmann he was not\ninterested.\" \n\nBased on Byers' testimony, the House committee launched what it described as\na \"full-scale investigation\" of Byers, Kauffmann and Sutherland. The\ncommittee discovered that Byers had told two St. Louis attorneys the same\nstory in 1968 and again in 1974. Both attorneys corroborated Byers' story\nunder questioning. \n\nFurther, an unpaid informant for the Jefferson County sheriff's office in\nthe 1960s testified to hearing the same \"standing offer to murder Dr. King\"\namong guests who frequented Kauffmann's Buff Acres motel, which at the time\nwas a known haven for prostitutes, drug dealers and petty criminals. \n\nKauffmann died in April 1974. John Sutherland had passed away four years\nearlier. But in 1968 both men were active in the American Independent Party,\nwhich backed segregationist Alabama governor George Wallace for president.\nAlso heavily involved in local efforts to elect Wallace was James Earl Ray's\nbrother, John Larry Ray. \n\nThe House committee described John Ray's now-shuttered Grapevine Tavern\nacross from Benton Park in south St. Louis as a \"distribution point for\nAmerican Party campaign literature.\" John Ray was even known to drive voters\nto the election office to register with the party. \n\nAlso active in the American Independent Party was James Earl Ray, who was\nserving a twenty-year sentence for armed robbery when he broke out of the\nMissouri State Penitentiary in Jefferson City in April 1967. While on the\nlam, Ray worked briefly for the Wallace campaign in California. \n\nThe committee believed Ray's brothers, John and Jerry Ray, assisted him\nduring his flight from justice. And while the congressional investigators\ncould find no \"direct link\" between the principals of the St. Louis\nconspiracy and King's killer, they believed there was a likelihood that word\nof the standing offer on Dr. King's life reached James Earl prior to the\nassassination. \n\n\"James Earl Ray may simply have been aware of the offer and acted with a\ngeneral expectation of payment after the assassination,\" the House committee\nreported. \"Or he may have acted, not only with an awareness of the offer,\nbut also after reaching a specific agreement, either directly or through one\nor both brothers, with Kauffmann or Sutherland.\" \n\nThe committee concluded its investigation into Byers' claims of a St. Louis\nconspiracy by opining: \"It is unfortunate that this information was not\ndeveloped in 1968, when it could have been pursued by law enforcement\nagencies. It is a matter on which reasonable people may legitimately differ,\nbut the committee believes that the conspiracy that eventuated in Dr. King's\ndeath in 1968 could have been brought to justice in 1968.\" \n\nToday Byers shies away from discussing what he told the congressional\ncommittee in 1978. He says journalists and conspiracy theorists still knock\non his door, trying to get him to share his story. None, apparently, have\nforked over enough cash to hear his tale. \n\nByers, meanwhile, says he remains confused by the testimony of at least one\nindividual from the congressional hearings. Murray Randall was one of the\nSt. Louis lawyers who testified to hearing Byers discuss the offer to\nassassinate King in 1968 and again in 1974. Later Randall went on to become\na judge in St. Louis. \n\n\"The judge told the FBI that I was the most notoriously dangerous criminal\nin St. Louis,\" says Byers. \"I don't know where that came from. We were\nfriends.\" \n\nByers says he never cut a deal with the feds to avoid prosecution for the\nSaint Louis Art Museum burglaries in 1978 and takes issue with allegations\nthat he killed or arranged for the murder of accomplices Charlie Gunn and\nSam White. \"I didn't have anything to do with it,\" says Byers. \"Black guys\nwere always killing each other back then. What can I say? \n\n\"Don't make me out to be a bad guy,\" Byers tells me. \"The media always makes\nme out to be a bad guy. I'm no murderer. I've never killed anyone.\" \n\nI'm not saying you killed anyone, I tell him. I simply want to discuss what\n- if anything - he knows about the Russian Schoolroom painting. When he\nagain brings up the subject of money, I suggest I might have the wrong\nperson - that someone else probably stole the painting. \n\nAs I walk down the driveway to my car, Byers coyly responds, \"You know,\nyou're right. I'm sure art thieves all over the world were targeting that\nlittle gallery in Clayton. Come back later,\" he adds, \"when you have your\npocketbook.\" \n\n\nhttp://www.riverfronttimes.com/2007-06-06/news/the-rockwell-files\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Thu, 7 Jun 2007 22:32:07 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] A jury has found the boyfriend of Olympic champion\n\tMyriam\tBedard guilty of art theft.\nTo: \nMessage-ID: <005801c7a942$eba2a8f0$c2e7fad0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nBedard's boyfriend found guilty of art theft \n\nUpdated Wed. Jun. 6 2007 7:40 AM ET\n\nCanadian Press\n\nMONTREAL -- A jury has found the boyfriend of Olympic champion Myriam Bedard\nguilty of art theft. \n\n\nBut the conviction will be appealed. \n\n\nNima Mazhari was convicted of stealing 20 paintings from the late Ghitta\nCaiserman-Roth between 2001 and 2003. \n\n\nHe was also found guilty of possession of stolen goods worth a total of\n100-thousand dollars. \n\n\nThe robbery came to light when Caiserman-Roth's daughter received a letter\nfrom Bedard's estranged father in 2004 accusing Mazhari of the theft. \n\n\nBedard, who has been by Mazhari's side all through the court proceedings,\nwas not with him when the verdict was announced. \n\n\nBedard herself is due in a Quebec City court this month to set a date for a\ntrial on child abduction charges. \n\n\nShe was accused of taking her 11-year-old daughter to Washington D.C, in\nviolation of a custody agreement with the girl's father.\n\nhttp://www.ctv.ca/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Thu, 7 Jun 2007 22:32:07 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Global warming, war, development threaten historic\n\tsites\nTo: \nMessage-ID: <005701c7a942$eb029860$c107c920$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nGlobal warming, war, development threaten historic sites\n06 Jun 2007 17:10:19 GMT\nSource: Reuters\n\nMore  By Tim McLaughlin\n\nNEW YORK, June 6 (Reuters) - Bombs in Iraq, better commutes in Ireland and\nmelting ice caps are threatening the world's architectural and cultural\ngems, a nonprofit group said on Wednesday as it named 100 endangered\nmonuments.\n\nThe World Monuments Fund's list for 2008 for the first time included climate\nchange as a hazard for some of the world's great historic sites.\n\nSurging development and commercialism, along with political conflict, also\npose risk to sites such as the Church of the Holy Nativity in Bethlehem.\n\n\"On this list, man is indeed the real enemy,\" said Bonnie Burnham, president\nof the fund. \"But just as we have caused the damage in the first place, we\nhave the power to repair it.\"\n\nThe group said Peru's Machu Picchu is threatened by unchecked tourism and\nSt. Petersburg's skyline will be changed forever if Gazprom's planned\nskyscraper is built for the state-controlled gas export monopoly.\n\nTara Hill in Ireland, considered a sacred landscape, is now threatened by\nthe development of a highway meant to ease the commute from Dublin. Canada's\nHerschel Island, situated on the edge of the Yukon and home to ancient Inuit\nsites, could be washed away in melting permafrost, the group said.\n\nMeanwhile, the war in Iraq has put that country's entire cultural heritage\nat grave risk, the nonprofit group said.\n\n\"The archeological sites of Iraq are being looted at an alarming rate and\nthe loss is catastrophic,\" said Michelle Berenfeld, program manager at the\nfund. \"Unlike objects in museums -- for which there is at least some record\nof their existence and in most cases where they came from -- objects that\nare stolen out of the ground are completely lost, forever.\n\n\"In Iraq, where much of these archeological sites date to the earliest\ncivilizations on the planet, the physical remains of those cultures are the\nmain sources of information we have about them, so stealing them is like\ntearing out the pages of a history book that can never be rewritten,\"\nBerenfeld said.\n\nSince 1996, the fund has made more than 500 grants totaling more than $47\nmillion to sites in 74 countries.\n\nWhile Burnham said the fund cannot be a policeman, it can raise public\nawareness, which has acted as leverage for funding from other sources. The\ngroup said its funds have drawn more than $124 million from other sources.\n\nThe New York-based group said more than 75 percent of endangered sites on\nprevious lists had been rescued or were well on the way to being preserved.\n\nThe complete 2008 list can be viewed at www.worldmonumentswatch.org.\n\nhttp://www.alertnet.org/thenews/newsdesk/N06398732.htm\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 135\n****************************************\n\n"}