{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTUESDAY 5 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tToday's Quote for the Day:\n\n\n\"Labour has proved to be the most centralising and authoritarian Government in living memory, and the Tories cannot decide where they stand\" - Liberal Democrat leader Sir Menzies Campbell.\n\n\nIn tonight's programme: \n\n\nRobin Hood in Reverse\n\n\nVulture funds rob the poor to fatten the rich. As we revealed on Newsnight, they are a crafty mechanism which allows the buying up of the debts of developing countries rather cheaply - and then the debt owner takes his money back, at a huge profit. The poor lose. \n\n\nAs the G8 leaders assemble tomorrow in Germany, Zombie Brown and President Bush are taking an interest. I'll be asking the British government minister responsible whether, realistically, anything can be done to stop the vultures preying on the poor.\n\n\nThe Cameron Clan\n\n\nThe row within the Conservatives over grammar schools rumbles on, with some Conservatives (quietly) suggesting it has undermined David Cameron's authority. Michael Crick is on the trail - and we hope to hear from both sides. \n\n\nWine\n\n\nThe government wants to clamp down on middle class binge drinking. Our Science Editor Susan Watts will tell you how much wine you can safely drink each day.\n\n\nWeb 2.0\n\n\nThe stuff you read on the internet. Do you believe it? Seriously? Why? We'll be hearing from the author of a new book about why much of what you may be reading has all the editorial authority of graffiti on a lavatory wall, and a Web defender will explain why the democratisation of the web is so important.\n\n\nYou can read extracts from the book, The Cult of the Amateur, and join the debate by clicking here.\n\n\nAnd finally...\n\n\nNewsnight viewer Terry Yates suggests that my Jokes Fit For an Eleven Year old have missed out on Musician Jokes. I did not know there was an important sub-genre like this, but Terry offers the following - perhaps you have more?  \n\n\nWhat is the definition of \"Perfect Pitch\"?\n\n\nAnswer - Throwing a Banjo into a well without touching the sides.\n\n\nNewsnight will be strumming the ukelele at the usual time of 10.30pm on BBC2.\n\n\nGavin\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}