{"category": "ham", "to_address": "ted.harding@manchester.ac.uk", "from_address": "Martin Maechler <maechler@stat.math.ethz.ch>", "subject": "Re: [R] Responding to a posting in the digest", "body": "Thanks a lot, Ted, for your comprehensive answer!\n\n[See one short note way below: ]\n\n>>>>> \"TH\" == Ted Harding \n>>>>>     on Thu, 14 Jun 2007 09:54:04 +0100 (BST) writes:\n\n    TH> On 14-Jun-07 07:26:26, Moshe Olshansky wrote:\n    >> Is there a convenient way to respond to a particular\n    >> posting which is a part of the digest?  I mean something\n    >> that will automatically quote the original message,\n    >> subject, etc.\n    >> \n    >> Thank you!\n    >> \n    >> Moshe Olshansky m_olshansky@yahoo.com\n\n    TH> This will depend on two things.\n\n    TH> 1. Whether the mail software you use has the capability;\n    TH> 2. Whether the digest format would permit it anyway.\n\n    TH> Regarding (2), if you are receiving R-help in\n    TH> \"traditional\" digest format (all the messages, each with\n    TH> its principal headers, as one single long message-body),\n    TH> then the only way to respond to a particular message is\n    TH> to start to compose a new message and copy what you need\n    TH> from the digest.\n\n    TH> While I've never reveived R-help in digest format\n    TH> myself, according to Martin Maechler:\n\n    TH> http://finzi.psych.upenn.edu/R/Rhelp02a/archive/59429.html\n\n    TH>   Please open the URL at the end of every message\n    TH> https://stat.ethz.ch/mailman/listinfo/r-help go to the\n    TH> bottom and \"log in\" -- clicking the [Unsubscribe or Edit\n    TH> Options] field. You need your mailing list password\n    TH> sooner or later. The one you get sent every 1st of the\n    TH> month; or you can have it sent to you again.\n\n    TH>   Then you are in a page entitled \"R-help Membership\n    TH> Configuration for @ \"Your R-help Subscription\" where the 3rd entry is\n    TH> entitled \"Get MIME or Plain Text Digests?\"  and now you\n    TH> want MIME.\n\n    TH> In MIME digest format, each message with its own main\n    TH> headers is a separate MIME attachment, and suitable mail\n    TH> software can bring any message up on its own, You can\n    TH> then reply in the normal way.\n\n    TH> However (and here is where I'm ignorant as a result of\n    TH> never having received R-help as digest), your reply may\n    TH> not continue the thread -- since this depends on\n    TH> message-identifier headers being present which allow\n    TH> threading software to trace which messages are replies\n    TH> to which message. The JISCMAIL MIME digest for the\n    TH> AllStat mailing list only includes a Message-ID for the\n    TH> digest as a whole, i.e. the ID for the entire digest\n    TH> message.  Message-IDs for the individual messages in the\n    TH> digest (as would be seen by people who received them\n    TH> singly) are absent: you only get the likes of\n\n    TH>   Date: DoW, DD Mon YYYY HH:MM:SS TZ From: Sender\n    TH> (person who sent the message to the list) Subject:\n    TH> Subject of individual message MIME-Version: 1.0\n    TH> Content-Type: text/plain; charset=iso-8859-1\n    TH> Content-Transfer-Encoding: quoted-printable\n\n    TH> and no Message ID for the original message from\n    TH> \"Sender\". So any reply to this component message is not\n    TH> identifiable as belonging to its thread.\n\n    TH> I don't know whether R-help's 'mailman' provides such\n    TH> headers (Martin??). \n\nYes, it does (I've checked with a \"pseudo-user\" who receives\nr-help in digests in MIME format). \nSo you can indeed do the following.\n\nIn my limited experience, the main problem is the bad quality of\npeople'e e-mail software which does not properly work with\nthe (typically invisible) 'References:' and 'In-Reply-To:'\nheaders which mailman indeed does preserve in its MIME-digests.\n\n    TH> If it does, then your reply could\n    TH> include an \"In-Reply-To:\" which identifies the\n    TH> thread. Otherwise it can't.\n\n    TH> As to (1), you will probably get several suggestions for\n    TH> suitable mail software. My own (see below) opens an\n    TH> AllStat digest in a window with \"attachment\" tags\n    TH> displayed, one for \"Tablf of Contents\", one for each\n    TH> message. Clicking on one of these opens a new window\n    TH> with the message attached to that tag displayed, and now\n    TH> the usual reply/forward etc mail sunctions can be\n    TH> applied to that message.  But it will reply only to the\n    TH> address given in the \"From:\" header (i.e. the original\n    TH> sender, as above), not to the AllStat list (so you have\n    TH> to enter that address by hand, if you want to reply to\n    TH> the list).\n\n    TH> In principle, mailer software could also identify the\n    TH> address of the list from which the digest has been sent,\n    TH> as well as the sender of the original message, so you\n    TH> could get the option to reply to either or both. But my\n    TH> XFMail does not, and only offers the original\n    TH> sender. Whether other mailer software can do this is for\n    TH> others to comment on!\n\n    TH> Hoping this helps, Ted.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}