{"category": "ham", "to_address": "\"Judit Rius Sanjuan\" <judit.rius@keionline.org>", "from_address": "james.love@keionline.org", "subject": "[Ip-health] \"Accesss to Knowledge\" back in at WIPO", "body": "The negotiations on the development agenda text have progressed, and as of\nlast evening, it appears as though the term \"access to knowledge\" is now\nwithout brackets.  The relevant paragraph now reads as follows:\n\n \"To initiate discussions on how, within WIPO's mandate, to further\nfacilitate access to knowledge and technology for developing countries\nand  LDCs to foster creativity and innovation and to strengthen such\nexisting  activities within WIPO.\"\n\nI think this is a very good outcome, and gives WIPO the mandate that it\nneeds to move forward in this area.\n\nSome of the Group B countries had difficulty explaining why they were\nopposed to WIPO discussing \"access to knowledge.\"  Even more important,\nthe developing country delegations were very strong on this issue.   Now\nit will be necessary to build the case for specific A2K initiatives at\nWIPO, in the environment were WIPO has agreed that the topic is relevant\nand appropriate.\n\nMany particpants in the \"green room\" discussions here say the atmosphere\nhas been quite good this week, from everyone, including the Group B\ncountries and the WIPO Secretariat.\n\nOn a personal note, I was robbed last evening, and my computer was taken,\nso if you don't hear from me for a while, don't take it personally. I lost\nall of my phone numbers and email addresses, not to mention a lot more.\nJamie\n\n> http://www.huffingtonpost.com/james-love/us-government-oppositio_b_51994.html\n>\n> U.S. government opposition to term \"access to knowledge\" in key WIPO\n> negotiation\n> By Jamie Love\n> Posted June 13, 2007 | 01:17 PM (EST)\n>\n> I'm in Geneva at a meeting on the World Intellectual Property\n> Organization (WIPO), in a negotiation on something called the WIPO\n> \"Development Agenda.\" As Thiru Balasubramaniam has written in this blog\n> entry\n> ,\n> the U.S. government, as well as other members of a rich country\n> negotiating block called \"Group B,\" have opposed the use of the term\n> \"access to knowledge,\" in the context of topics that should be discussed\n> by the UN agency responsible for setting global norms on intellectual\n> property policy. Other Group B countries also have taken this position.\n>\n> Technically, we are discussing the draft text on \"issues related to\n> norm-setting, flexibilities, public policy and the public domain,\" where\n> the controversial paragraph 3 now has the following brackets:\n\n>3. To\n> discuss possible new initiatives and strengthen existing mechanisms\n> within WIPO to facilitate [access to knowledge] and technology for\n> developing countries and LDCs and to foster creativity and innovation\n> within WIPO's mandate.\n>\n> Canada said it \"didn't understand\" what \"access to knowledge\" meant. The\n> UK indicated that there was a sentiment by many countries that while\n> WIPO could discuss measures that would make access to knowledge hard,\n> such as tough new digital copyright laws, it shouldn't discuss\n> proposals, like a treaty to provide minimum access to works by\n> libraries, teachers and the blind, which would expand access.\n>\n> Here \"access to knowledge\" is referred to by many simply as A2K, a term\n> that is apparently terrorizing the many lobbyists for publishers. I'm\n> hoping the U.S. will come around, and agree that yes, the U.N. can\n> actually \"discuss possible new initiatives\" to facilitate \"access to\n> knowledge.\" It is rather amazing that this is even controversial.\n>\n> --\n> Judit Rius Sanjuan\n> Attorney\n> judit.rius@keionline.org\n>\n> Knowledge Ecology International (KEI)\n> www.keionline.org / www.cptech.org\n> 1621 Connecticut Ave, NW, Suite 500 Washington, DC 20009 USA\n> Tel.: +1.202.332.2670, Ext 18  Fax: +1.202.332.2673\n>\n> _______________________________________________\n> A2k mailing list\n> A2k@lists.essential.org\n> http://lists.essential.org/mailman/listinfo/a2k\n>\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}