{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Prasenjit Kapat <kapatp@gmail.com>", "subject": "Re: [R] Need Help on Joining 2 text files in R", "body": "On Wednesday 23 May 2007 07:31:47 am CHANDRAMOULI BANERJEE wrote:\n> Hi,\n>\n>   I have  2 text files , the first one looks like this :\n>\n>   CC: \" some statements\"\n>   this is followed by 10-12 lines in the similar pattern and then the next\n> line is a comment and from the 14th line all the columns are aligned and\n> the variable values are filled in ....\n>\n>   The next file is a text file with 3 columns with column names and the 2\n> files have the same number of rows in both.....\n>\n>   I want to concatanate these 2 files side by side to make a complete file,\n> keeping the structure of the first file same......\n>\n>   More explicitly the first file looks like:\n>\n>   CC:\"....some statement.............\"\n>   CC:....same as above.......\n>\n>   .............................this pattern is followed upto say 10-12\n> lines and then some variables , I mean columns used in the file is listed\n> as a string like nuclear_intensity; cell_intensity ;....and so on .......\n>\n>   and then in the next row onwards the column headers start with column\n> names and then the variable values are plugged in .......I wish I could\n> have sent you the file but it is in the intranet system and can't be sent\n> over in email.......\n\nIf the file has read access, then it can always be copied and attached, unless \nyou are prohibited from distributing the file in public domain.\n\n>\n>\n>   The second file looks simple with column headers and field values.....The\n> 2 files are both in the text format.....\n>\n>   What I really need to know is how to join the 2 text files and make it\n> into one keeping the structure of the first one intact.......I need to join\n> the columns with the column names from the second file to the first\n> one.....\n>\n>   I will wait for any help of how to achieve this is R.\n\nThe cheapest way (if possible) is to use an editor that supports block \nselection (like, kate, emacs) then block select the 3 columns from the second \nfile and paste them beside the last column in the first one. Done.\n\nNow, if the merging has to be done in R, one way is to read.table the first \nfile with 'skip=13' that way you will get only the data. Then read.table from \nthe second file and cbind the two data.frames. Finally write.table into a new \nfile. By this the data will merged but to add the comments, I think you will \nhave to do it manually, copy from the first file and paste into the new file, \nusing whatever text editor you use. (I assume the file is a text file)\n\nHTH,\nPK\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}