{"category": "ham", "to_address": "\"'jiho'\" <jo.irisson@gmail.com>, \"'R-help'\" <r-help@stat.math.ethz.ch>", "from_address": "Bert Gunter <gunter.berton@gene.com>", "subject": "Re: [R] Comparing multiple distributions", "body": "While Ravi's suggestion of the \"compositions\" package is certainly\nappropriate, I suspect that the complex and extensive statistical \"homework\"\nyou would need to do to use it might be overwhelming (the geometry of\ncompositions is a simplex, and this makes things hard). As a simple and\nperhaps useful alternative, use pairs() or splom() to plot your 5-D data,\ndistinguishing the different treatments via color and/or symbol.\n\nIn addition, it might be useful to do the same sort of plot on the first two\nprincipal components (?prcomp) of the first 4 dimensions of your 5 component\nvectors (since the 5th is determined by the first 4). Because of the\nsimplicial geometry, this PCA approach is not right, but it may nevertheless\nbe revealing. The same plotting ideas are in the compositions package done\nproperly (in the correct geometry),so if you are motivated to do so, you can\ndo these things there. Even if you don't dig into the details, using the\ncompositions package version of the plots may be realtively easy to\ndo,interpretable, and revealing -- more so than my \"simple but wrong\"\nsuggestions. You can decide.\n\nI would not trust inference using ad hoc approaches in the untransformed\ndata. That's what the package is for. But plotting the data should always be\nat least the first thing you do anyway. I often find it to be sufficient,\ntoo.\n\n\nBert Gunter\nGenentech Nonclinical Statistics\n\n\n-----Original Message-----\nFrom: r-help-bounces@stat.math.ethz.ch\n[mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of jiho\nSent: Thursday, May 31, 2007 8:37 AM\nTo: R-help\nSubject: Re: [R] Comparing multiple distributions\n\nNobody answered my first request. I am sorry if I did not explain my  \nproblem clearly. English is not my native language and statistical  \nenglish is even more difficult. I'll try to summarize my issue in  \nmore appropriate statistical terms:\n\nEach of my observations is not a single number but a vector of 5  \nproportions (which add up to 1 for each observation). I want to  \ncompare the \"shape\" of those vectors between two treatments (i.e. how  \nthe quantities are distributed between the 5 values in treatment A  \nwith respect to treatment B).\n\nI was pointed to Hotelling T-squared. Does it seem appropriate? Are  \nthere other possibilities (I read many discussions about hotelling  \nvs. manova but I could not see how any of those related to my  \nparticular case)?\n\nThank you very much in advance for your insights. See below for my  \nearlier, more detailed, e-mail.\n\nOn 2007-May-21  , at 19:26 , jiho wrote:\n> I am studying the vertical distribution of plankton and want to  \n> study its variations relatively to several factors (time of day,  \n> species, water column structure etc.). So my data is special in  \n> that, at each sampling site (each observation), I don't have *one*  \n> number, I have *several* numbers (abundance of organisms in each  \n> depth bin, I sample 5 depth bins) which describe a vertical  \n> distribution.\n>\n> Then let say I want to compare speciesA with speciesB, I would end  \n> up trying to compare a group of several distributions with another  \n> group of several distributions (where a \"distribution\" is a vector  \n> of 5 numbers: an abundance for each depth bin). Does anyone know  \n> how I could do this (with R obviously ;) )?\n>\n> Currently I kind of get around the problem and:\n> - compute mean abundance per depth bin within each group and  \n> compare the two mean distributions with a ks.test but this  \n> obviously diminishes the power of the test (I only compare 5*2  \n> \"observations\")\n> - restrict the information at each sampling site to the mean depth  \n> weighted by the abundance of the species of interest. This way I  \n> have one observation per station but I reduce the information to  \n> the mean depths while the actual repartition is important also.\n>\n> I know this is probably not directly R related but I have already  \n> searched around for solutions and solicited my local statistics  \n> expert... to no avail. So I hope that the stats' experts on this  \n> list will help me.\n>\n> Thank you very much in advance.\n\nJiHO\n---\nhttp://jo.irisson.free.fr/\n\n\n\n-- \nCe message a iti virifii par MailScanner\npour des virus ou des polluriels et rien de\nsuspect n'a iti trouvi.\nCRI UPVD http://www.univ-perp.fr\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}