{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Jarrett Wiley\" <cebcalljackiefirsthog@calljackiefirst.com>", "subject": "Burn pounds off with Anatrim", "body": "\nLess weight - more pleasure and joy\n\n\n\n\n\nAnatrim – The newest and most fascinating flesh loss product is now available – As could be seen on ABC\n\n\n\nDid you know excessive body kilos kill very much people for every new year? We know you hate the ugly look of those people and the social stigmata attached to them. \n\nOr, maybe, you can not withstand an assault of your terrible eating habits. If this sounds familiar, then we got something for your consideration!\n\n\n\n\n\nIntroducing Anatrim, the recent product for the reduction of your body’s extra weight. The greatest thing about Anatrim is it improves the quality of your life by making you crave less food and always cheering you up. Here are what people say about this product:\n\n\n\n\n\n\"It’s outstanding! \n\n\nInstead of eating anything close at hand and watching TV constantly \n\n\nI became more interested in taking exercise.\n\n\n\n\n\n\n Anatrim brought me back on the right track.\n\n\n I’m in a great fit now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nRita R., Bellevue WA\n\n\n\n\n\n\n\"I tried some passive weight reducing, you know, but all came in vain. I could not restrain my ravenous hunger. \n\n\nOnce I heard about Anatrim in the media advertisement and it brought a great influence on me.\n\n\n I had tried to take it, and my wife said that I had changed for the better since then, 5 months later. \n\n\n32 pounds have gone away and this is still far to an end! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nMikkey Fox, San Diego\n\n\n\n\n\nAnatrim helps your mind to realize you got no such great need for that much food. It lifts your mood up, supplies you with energy, and attacks useless kilos. All thanks to its powerful distinguished formula!!\n\n\n\nFind out more useful information about this excellent product now!\n\n\n\n"}