{"category": "spam", "to_address": "Gnitpick <gnitpick@flax24.uwaterloo.ca>", "from_address": "Federico Hancock <junk@gls-poland.com>", "subject": "The best medications for the best price", "body": "\n\nOnline pharmacy presents top products that will make you healthy! You do not need to go to your local drug store, you can buy here any pill that you need.\nEverything for your health\nViagra, Cialis, Valium, Levitra and more medications\nBuy medications at RX online drug store!\nYou will have unbelievable sex 24/7!\nWith best regards,\nFederico Hancock\n \n \nSkazhi, Nori, ty uverena, chto za toboj Nikto ne sledil, kogda ty pokidala Gorod? Dopros prodolzhaetsia? Nori nedovolno sdvinula brovi. Vo-pervyh, Niks, ia bolshe ne mog pozvolit etim Liudiam putatsia u menia pod nogami. Kvin s Trevogoj podumal o tom, chto mat s zasfernikom, na ego vzgliad, otsutstvovali uzhe Neopravdanno dolgo. Neuzheli tot Sam pustil ego siuda? Ili s magom v samom dele chto-to sluchilos? I ne Gront li Tomu prichinoj? No nikakoj mechnik ne mozhet navredit nastoiashchemu magu. \nSituaciia sozdala sebia sama, kogda, Dobravshis do pristani, on obnaruzhil, chto korabl s demonom uzhe otplyl, no vse Eshche ostavalsia v predelah dosiagaemosti magii Drahub chuial ego obzhigaiushchuiu auru. V kotoryj raz on okinul zal ustalym vzgliadom, ne prekrashchaia protirat Griaznoj triapkoj otpolirovannuiu vremenem i beschislennym kolichestvom ruk Poverhnost ka Menitovoj stojki. Vremia shlo, i ostyvaiushchij mozg mertvogo maga Skoro mog okazatsia bespolezen. No Snachala skazhu vot chto: u vseh u nas byli v proshlom nedorazumeniia po Otnosheniiu drug k drugu, no teper, kogda my v odnoj upriazhke, samym razumnym Budet zabyt o nih. Davno bylo pora pomoch ej zakonchit sushchestvovanie. Opasnosti tam bolshe ne bylo. Rebiata na tebia ochen zly. V ego rasporiazhenii liudskie i Materialnye resursy vsego Goroda. \nEtogo sledovalo ozhidat. A pochemu by i net? Krasavchik Dos so Svoimi skovannymi dvizheniiami, holodnym bezemocionalnym licom i bespolym Bezzhiznennym golosom ochen podhodil pod opisanie sinteta. No poka ia byl slishkom slab, chtoby chto-to predpriniat. Emu bolshe nichego ne ostaetsia, podtverdil Nkot. ejisuminyon VVFcRlhQUVh0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}