{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Holly Aguilar <extremeracing@ghobashi.com>", "subject": "Can you satisfy your girlfriend?", "body": "\n\nGoing to have sex with two ladies at the same time? You need a strong erection, or they will have to satisfy each other. You really need Viagra!\nOur pharmacy\nU can restore your health right now. Doesn't matter what the problem is - we pills to cure everything. Erection Dysfunction, Weight loss, Anti-Depressant, Antibiotics and even more! Fantastic low prices! \nAll this you can find here\nYou don't need to look for a drug store in your area. We deliver high-quality pills worldwide.\nWith best regards,\nHolly Aguilar\n \n \nTem bolee chto podohnem tolko my, a tebia, krasavchika, eto ne Kosnetsia. Kstati, vtoroj raz Podriad sobratsia mne budet potrudnee. K tomu zhe ia videl Tvoego parnia v dejstvii i ne mog ne voshitsia. Vzoshlo i karaiushchim Rokom povislo nad gibnushchim mirom. \nNet, otvetil tolstiak, dazhe ne pytaias vyjti iz trassera, v kotoryj Zabralsia srazu posle srazheniia. Brodiachie sgustki plameni priblizhalis k nam so Vsej ravniny, slovno sterviatniki, pochuiavshie pozhivu, i pervyj desiatok uzhe Vzial nas v medlenno szhimaiushcheesia kolco. Bez durakov. Nastojchivo i terpelivo. Ty chto, ispytyvaesh Udovolstvie ot chuzhoj boli? Iavnoe neodobrenie, prostupivshee v ego glazah, zastavilo menia pospeshno Umolknut. I tut chuzhoj prepodnes mne eshche odin siurpriz. Vo-pervyh, drakh Gronta byl namerenno Razmeshchen sredi stai ostalnyh sorodichej, chtoby mechniku ne vzdumalos igrat v Dogonialki. Strah osel gluboko v podsoznanii, v myshcah, Sokrashchavshihsia neproizvolnoj drozhiu pri odnoj mysli ob etom. \nOn Postupil by tak zhe. Verno, soglasilsia chuzhoj, snova okrashivaia vozduh svoim muzykalnym Golosom, beskonechno variruiushchiesia ottenki kotorogo porazhali sluh i Voobrazhenie, no moia rasa byla nadelena telepatiej polnostiu. Nikogda ne otnosil sebia k Liubiteliam ostryh oshchushchenij. Sledujte poka za mnoj. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}