{"category": "spam", "to_address": "<theorize@plg.uwaterloo.ca>", "from_address": "\"Maud\" <znje@autozone.com>", "subject": "This file is usually updated about every two minutes.", "body": "News Releases Warming Investors Up On GPSI\n\nGlobal Pay Solutions Inc.\nSymbol: GPSI\nClose: $0.031\n\nRecent news releases have excited investors. Heavy trading pushed share\nprices up to highs of $0.08 (UP 266%). Closing at $0.031 (UP 3%) we\nexpect to see more traffic and prices shooting up all week. This one is\ngetting started. Don't miss it. Get on GPSI first thing Tuesday!\n\nMOSTLY SUNNY SKIES THROUGH EARLY EVENING. MOSTLY CLEAR SKIES THROUGH\nEARLY EVENING. MOSTLY CLEAR SKIES THROUGH EARLY EVENING.\nRED FLAG CONDITIONS COULD REDEVELOP TUESDAY AFTERNOON.\nTHIS FIRE WEATHER WATCH IS IN EFFECT FROM TUESDAY AFTERNOON THROUGH\nTUESDAY EVENING.\nRED FLAG CONDITIONS COULD REDEVELOP TUESDAY AFTERNOON.\nAND THROUGH THEM TO THE PUBLIC. MOSTLY CLOUDY ALONG THE OUTER COAST WITH\nMOSTLY SUNNY SKIES INLAND. RED FLAG CONDITIONS COULD REDEVELOP TUESDAY\nAFTERNOON. RELATIVE HUMIDITIES WILL BE HIGHER TUESDAY.\nTHE NATIONAL WEATHER SERVICE IN ANCHORAGE HAS ISSUED A RED FLAG WARNING.\nFIRE WEATHER WATCH IN EFFECT FROM TUESDAY AFTERNOON THROUGH TUESDAY\nEVENING FOR STRONG WIND. THE NATIONAL WEATHER SERVICE IN ANCHORAGE HAS\nISSUED A RED FLAG WARNING. IT IS DIRECTED TOWARD FIRE AGENCIES. IT IS\nDIRECTED TOWARD FIRE AGENCIES.\nA RED FLAG WARNING MEANS THAT CRITICAL FIRE WEATHER CONDITIONS ARE\nIMMINENT OR OCCURRING NOW.\nMOSTLY CLOUDY SKIES THROUGH EARLY EVENING.\nA RED FLAG WARNING MEANS THAT CRITICAL FIRE WEATHER CONDITIONS ARE\nIMMINENT OR OCCURRING NOW.\nThis file is usually updated about every two minutes.\nFIRE WEATHER WATCH NOW IN EFFECT FROM TUESDAY AFTERNOON THROUGH TUESDAY\nEVENING FOR STRONG WIND. This file is usually updated about every two\nminutes. This file is usually updated about every two minutes.\nLOWEST HUMIDITIES WILL BE NEAR BIG LAKE. MOSTLY SUNNY SKIES THROUGH\nEARLY EVENING. THIS FIRE WEATHER WATCH IS IN EFFECT FROM TUESDAY\nAFTERNOON THROUGH TUESDAY EVENING. IT IS DIRECTED TOWARD FIRE AGENCIES.\nRELATIVE HUMIDITIES WILL BE HIGHER TUESDAY.\nAND THROUGH THEM TO THE PUBLIC. A RED FLAG WARNING MEANS THAT CRITICAL\nFIRE WEATHER CONDITIONS ARE IMMINENT OR OCCURRING NOW. MOSTLY CLOUDY\nSKIES THROUGH EARLY EVENING.\nA RED FLAG WARNING MEANS THAT CRITICAL FIRE WEATHER CONDITIONS ARE\nIMMINENT OR OCCURRING NOW. A RED FLAG WARNING MEANS THAT CRITICAL FIRE\nWEATHER CONDITIONS ARE IMMINENT OR OCCURRING NOW. A FIRE WEATHER WATCH\nHAS ALSO BEEN ISSUED. LIGHT SOUTHWEST WIND. IT IS DIRECTED TOWARD FIRE\nAGENCIES. RELATIVE HUMIDITIES WILL BE HIGHER TUESDAY.\nA FIRE WEATHER WATCH HAS ALSO BEEN ISSUED.\nMOSTLY CLOUDY SKIES THROUGH EARLY EVENING. THE NATIONAL WEATHER SERVICE\nIN ANCHORAGE HAS ISSUED A RED FLAG WARNING. FIRE WEATHER WATCH IN EFFECT\nFROM TUESDAY AFTERNOON THROUGH TUESDAY EVENING FOR STRONG WIND.\nA RED FLAG WARNING MEANS THAT CRITICAL FIRE WEATHER CONDITIONS ARE\nIMMINENT OR OCCURRING NOW. MOSTLY CLOUDY ALONG THE OUTER COAST WITH\nMOSTLY SUNNY SKIES INLAND.\n\n"}