{"category": "ham", "to_address": "<ip-health@lists.essential.org>", "from_address": "\"Renata Reis\" <renata@abiaids.org.br>", "subject": "[Ip-health] Petition in support of the Compulsory License - Brazil", "body": "Dear All,\n\n\n\nAs all of you might know, after issuing the compulsory license for efavirenz\nthe transnational pharmaceutical company Merck, the US Trade Chamber and the\nlobby from pharmaceutical industry are trying to thwart it. For this reason,\nwe consider it as being not only the health's movement fight, but also ours\nas well. We are circulating a petition below, which we expect to have a\ngreat number of signatures. Adhere to this initiative!\n\n\n\nPlease, send the signatures of your organization to clarisse@rebrip.org.br .\n\n\n\nWith solidarity,\n\nExecutive Secretariat from the Brazilian Network for the Integration of\nPeoples (Rebrip)\n\nRebrip's Working Group on Intellectual Property (GTPI)\n\nBrazilian Interdisciplinary Aids Association (ABIA)\n\n\n\nPetition in support of the Compulsory License\n\n\n\nThe undersigned organizations wish to express their support for the\nBrazilian government's decision to issue a compulsory license for the\nmedicine Efavirenz, whose patent is currently held by the transnational\npharmaceutical company Merck Sharp & Dohme. It is a historical and pioneer\ndecision in Latin America, owing to a process of strong, social mobilization\nand resistance to abuses committed by the transnational companies supported\nby the current intellectual property system.\n\nThe compulsory license of this medicine allows for the production of\naffordable generic versions, which increases the population's access and\nlowers the impacts of patent monopolies held by these\ncompanies.\n            We emphasize the legality and the legitimacy of the instrument\nused, established both by the national legislation as well as international\ntrade agreements. The current system of recognizing intellectual property\nnot only impinges upon public health, but also upon food security and\nsovereignty, biodiversity, maintaining/protecting the culture of the\npeoples, access to information, and the right to communication. The recent\nissuing of licenses for patented essential medicines in Brazil and in\nThailand strengthens the idea that the current model of knowledge\nprotection, established by WTO, does not work for our countries and our\npeoples.\n\n    We are emphatic when we affirm that a system that deepens the division\nbetween rich and poor countries and between producers and consumers of\ntechnological goods is neither a fair nor a viable system. The inclusion of\nour signatures demonstrates that we are united in our support for the\nmeasure taken by the Brazilian government and in our disapproval of the\nnaturalization of the insertion of knowledge in the roll of the\nmerchandises.\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}