{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Jari Oksanen <jari.oksanen@oulu.fi>", "subject": "Re: [R] biplot package", "body": "joseclaudio.faria  terra.com.br> writes:\n\n> \n> Dears,\n> \n> I've been learning biplot (Gabriel, 1971) and I found the function 'biplot',\ninside of the package 'stats',\n> useful but, a bit limited.\n> \n> So, I'm thinking to start a colaborative package to enhance this methods to\nother multivariate methods. In this\n> way, I would like to start it, making public a new function (biplot.pca, still\nin development, but running)\n> that make biplot more simple and power.\n> \n> All users are free to modify and make it better.\n> Below the function and a small script to learn it.\n> \nDear Jose Claudio Faria,\n\nLooks nice. However, I'd suggets you articulate this into R core and tradition.\nThere the biplot function is now defined as:\n\nbiplot <- function (x, ...)  UseMethod(\"biplot\")\n\nwith methods(\"biplot\")\n[1] biplot.default*  biplot.prcomp*   biplot.princomp*\n\nYou function is now called biplot.pca which sounds like biplot method for the\nclass \"pca\" (which, I think, exists in labdsv and perhaps somewhere else). What\nyou do is to propose a biplot method for class-less function svd. Or perhaps\nthis could be something like biplot.data.frame so that this function is launched\nwhen user supplies as a data.frame as the first argument for biplot.\n\nThe good old R tradition is to separate plotting from calculation so that you\ncan have these separately (which obviously is related to the unix toolbox\nthinking: do one thing well, and pipe the result to the next function). It might\nmake sense to have a biplot method for data.frame (if I remember correctly, some\nof the core members fancied a spanning tree method for data.frame which is along\nsimilar lines). However, I would like to have enhanced biplot methods for other\nmethods as well, such as analyses using prcomp or princomp, or multivariate\nanalyses in packages. There is no sense to replicate all mv analyses within\nbiplot functions, but you should just try cope with the outputs of various\nmethods. Then you perhaps have to change the name so that you can have\nbiplot.prcomp alongside with your new hyperbiplot.prcomp. (Namespace is an\nanswer to no real problem, but a reason of many new problems.) \n\nSomebody already promised to write a biplot method for rda in vegan (howdy Gav),\nbut I haven't heard of this for a long time. It would be nice to be able to have\nthis kind of interface for your enhanced code, too. \n\ncheers, jari oksanen\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}