{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Jean Bright\" <heddonaemiliasses@donaemilias.com>", "subject": "Join the thousands of people who got slim", "body": "\nGetting thinner can be enjoyable\n\n\n\n\n\n\nAnatrim – The very up-to-date and most enchanting product for over-weight people available – As were seen on Oprah.\n\n\nCan you remember all the times when you said to yourself you would do any thing to get rid of this desperately growing number of kilos? Luckily, now no great sacrifice is required. Thanks to Anatrim, the earth-shaking pound-melting blend, you can get naturally health life style and a really slender figure. Just look at what our customers write!\n\n\n\n\"It’s rather difficult to confess but I was a junk food addict. \n\n\nI greedily swallowed up all this trash \n\n\nand just could not stop. \n\n\n\n\nThis fatal passion passed away after I started taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my craving for food disappeared, \n\n\nmood increased and I’m the happiest person 19 pounds in 2.6 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nAmelia B., San Diego\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nIt’s difficult to imagine how I hated being ridiculed at school. \n\n\n\n\nI hated my weight and I abhorred even myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nIt literally pulled me out of this fearful nightmare! The very sincere thanks to you, fellows.\"\n\n\n\n\n\nCharley Mock, Bellevue WA\n\n\n\n\n\n\"Know what? Anatrim preserved my marriage! I got into the circle, depression – eating more – even more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOne my best friend showed me site and I asked for pack of Anatrim at once. \n\n\nThe final result was magnficent, my appetite became normal, I was in a good mood oftener, and, certainly, I tightened my belt with no regrets. And you know, the bed became cool also!\"\n\n\n\n\n\nRikky\n\n\n\n\n There is a lot of sincere gratitudes delighted people leave after trying Anatrim. Why don't you add yourself to the thousands and thousands of slender customers and try this all-natural appetite-suppressing power lifting product now!\n\n\nDo not miss the chance!\n\n\n\n\n"}