{"category": "ham", "to_address": "\"Robert Wilkins\" <irishhacker@gmail.com>", "from_address": "\"Gabor Grothendieck\" <ggrothendieck@gmail.com>", "subject": "Re: [R] How do you do an e-mail post that is within an ongoing\n\tthread?", "body": "In gmail just hit Reply to All at the bottom of the post you wish to\nfollow up on.\n\nOn 6/8/07, Robert Wilkins  wrote:\n> That may sound like a stupid question, but if it confuses me, I'm sure\n> it confuses others as well. I've tried to find that information on the\n> R mail-group info pages, can't seem to find it. Is it something\n> obvious?\n>\n> To begin a brand new discussion, you do your post as an e-mail sent to\n>  r-help@stat.math.ethz.ch .\n> As I am doing right now.\n>\n> How do I do an additional post that gets included in the\n> \"[R] Tools For Preparing Data For Analysis\" thread, a thread which I\n> started myself yesterday ( thanks for all the responses everybody )?\n>\n> There's got to be a real easy answer to that, since everybody else does that.\n> (I'm using gmail, does it make a difference what e-mail host you use?).\n>\n> -----------------------\n>\n>\n> PS\n> If you happen to be reading this, Christophe Pallier & Martin Stevens,\n> I will respond to your request for examples shortly, once I figure\n> this posting how-to out. My examples will come from data preparation\n> problems in clinical trial data ( I worked for 8 years on clinical\n> trial analysis before beginning work on Vilno ). I'll probably use lab\n> data as an example because  lab data can be messy and difficult to\n> work with.\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}