{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "This Weekend on BBC Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSUE BARKER ON THE ARTOIS CHAMPIONSHIPS\nI hear many players saying that the Artois Championships at Queen's Club is their favourite tournament of the year and it is easy to understand why.\n\n\nThere is such a wealth of tradition at this impressive club and it is steeped in a long history.\n\n\nWhen players travel round the world they encounter a lot of arenas with faceless locker rooms and very little atmosphere, but here they have the splendour of the clubhouse in wonderful relaxed surroundings. \n\n\nOne man revelling here in West London is the phenomenon that is Rafael Nadal.\n\n\nLast year he seemed to take a while to get used to the grass, but right from the word go this week he has looked comfortable which is remarkable after such an intensive clay court season.\n\n\nTo arrive here and play so well just 48 hours after dealing with the hype and mental and physical exertion of winning his third French Open title is very impressive.\n\n\nNadal's biggest rival could be Andy Roddick and the top two seeds are scheduled to clash in the final should they both progress.\n\n\nRoddick is now under the tutelage of the legendary Jimmy Connors.\n\n\nHe has changed quite a lot of technical things to Andy's game, but what I have been looking for is the influence he has had on the mental side of his game.\n\n\nEverybody thinks of Jimmy in his playing days as a driving force who psyched himself up and didn't just give 100%, he gave 150% in every match.\n\n\nIn his match against Alex Bogdanovic, Roddick obviously wasn't playing that well, but he psyched himself up and talked himself into playing well, which had all the hallmarks of his coach.\n\n\nOnce the Queen's final is finished, it's Eastbourne next week and then Wimbledon. \n\n\nThere is so much to savour - in case you hadn't realised this really is my favourite time of year!\n\n\nEnjoy the action,\n\n\nSue\n\n\nSue Barker presents the BBC's coverage of the Artois Championships from Queen's Club this weekend.\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nTENNIS\n bbc.co.uk/tennis\nSaturday\nMen's semis: 1200, Radio Five Live: 1255-1640, BBC ONE and BBC Sport website; 1640-1725, BBC TWO and BBC Sport website; \nSunday\nMen's final: 1400-1640, BBC TWO and BBC Sport website; 1400, Radio Five Live. Doubles final: 1630-1900, BBCi and BBC Sport website.\n\n\n\n\n\n\nCRICKET \n bbc.co.uk/cricket \nSaturday\nEngland v West Indies, fourth Test, day two: 1045-1900, Radio 4 198LW, Radio Five Live Sports Extra, BBCi and BBC Sport website.\nSunday\nEngland v West Indies, fourth Test, day three: 1045-1900, Radio 4 198LW, Radio Five Live Sports Extra, BBCi and BBC Sport website.\n\n\n\n\n\n\nGOLF\n bbc.co.uk/golf\nSaturday\nUS Open third round: 2100, Radio Five Live Sports Extra/online\nSunday\nUS Open final round: 2100, Radio Five Live/online\n\n\n\n\n\n\nMORE SPORT ON THE BBC\n bbc.co.uk/tvandradio\nSaturday\nFormula One: USA Grand Prix qualifying (1800, Radio Five Live/online).\nSunday\nRugby League: Super League Show (1230-1300, BBC North and BBC Sport website): Motorbikes: Isle of Man TT (1300-1400, BBC TWO); Formula One: USA Grand Prix (1800, Radio Five Live/online).\n\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tSports Editors' Blog\n Find out what goes on behind the scenes of BBC Sport\n\t\t\t\t\t\n\t\t\t\t\t\t2007/08 football fixtures\n Find your clubs' fixtures for the new season\n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}