{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Study: Suicide risk double among male U.S. veterans", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJun 12, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nStudy: Suicide risk double among male U.S. veterans\n\n\n\n\n\nThe risk of suicide among male U.S. veterans is double that of the general\npopulation, according to a study published Monday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfghanistan: U.S. mistakenly kills police officers\n\n\n\n\n\nU.S. forces mistakenly killed seven Afghan police and wounded four in an\napparent friendly fire incident early Tuesday in eastern Afghanistan, Afghan\nofficials said.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nBangladesh death toll rises to 82\n\n\n\n\n\nTorrential rains hammered southeastern Bangladesh early Tuesday, a day after\nthe unusually powerful monsoon triggered landslides, flash floods and\nlightning killing at least 82 people, rescue officials and witnesses said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nOfficer charged in taped beating apparently kills himself \n\n\n\n\n\nA former New Orleans police officer charged in the videotaped beating of a man\nafter Hurricane Katrina apparently shot himself to death about a month before\nhis trial, authorities said Monday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInfant twins among 6 bodies in Wisconsin home\n\n\n\n\n\nA domestic dispute erupted into a mass killing in southern Wisconsin, leaving\nsix people, including two infant boys, shot to death, and a 2-year-old girl\nwith a gunshot to her chest.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLast minute appeal in teen sex case sparks outrage \n\n\n\n\n\nJubilation turned to anger Monday after Georgia's top prosecutor vowed he\nwould fight a judge's order that would have set free Genarlow Wilson, a\nGeorgia man serving a 10-year prison sentence for a consensual sexual\nencounter he had as a teenager.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFamilies feel 'ostracized' in Virginia Tech probe\n\n\n\n\n\nThe families of some of the 32 people killed on Virginia Tech's campus\ndemanded representation Monday on a gubernatorial panel studying the killings,\nsaying they feel \"ostracized.\"\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nRPG fired at home of Palestinian prime minister\n\n\n\n\n\nThe house of Palestinian Prime Minister Ismail Haniya came under\nrocket-propelled grenade fire Tuesday morning, the Hamas media office\nreported. There were no injuries.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFederal court rules against  enemy combatant policy \n\n\n\n\n\nA divided panel from a conservative federal appeals court delivered a harsh\nrebuke to the Bush administration's anti-terrorism strategy Monday, ruling\nthat U.S. residents cannot be locked up indefinitely as \"enemy combatants\"\nwithout being charged.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nColombia ordered to pay millions in massacre case\n\n\n\n\n\nIn a ruling hailed as a landmark by human rights advocates, the Colombian\ngovernment has been ordered to pay damages over a 1989 massacre of state\ninvestigators by army-backed militias.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDaughter slain in 'honor killing'\n\n\n\n\n\nA Kurdish man was convicted in a London court on Monday of murdering his\n20-year-old daughter in a so-called \"honor killing\" after she left her husband\nand fell in love with another man.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nCEOs: Riding off into the (well-funded) sunset\n\n\n\n\n\nThe world of corporate pensions may be shrinking, but it's still fairly robust\nat S&P 500 companies. And that's true for no one more so than the current crop\nof the companies' already highly paid CEOs, who have accrued retirement\nbenefits worth over $2 billion today, according to a report released Monday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBancrofts set new proposals - report\n\n\n\n\n\nThe Bancroft family, controlling shareholders of Dow Jones & Co. Inc., are set\nto submit a new set of proposals to News Corp. on how to protect the Wall\nStreet Journal's editorial independence, the Journal reported on Monday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nIan Thomsen: Spurs' Big Three putting its stamp on Finals\n\n\n\n\n\nSAN ANTONIO -- The preparation for the Spurs' 2-0 lead in the NBA Finals began\nfour years ago, when Zydrunas Ilgauskas was getting his legs back after\nmultiple foot surgeries, Larry Hughes was missing the playoffs with Washington\nand LeBron James was a senior in high school. While those players seemed ages\naway from ever reaching the Finals, the Spurs were winning what may soon be\nrecast as the first of three championships in a five-year span. Those\nexperiences are making all of the difference now.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJohn Donovan: MLB Power Rankings\n\n\n\n\n\nIf the season ended this week -- and, of course, the season doesn't end for\nanother 600 or 700 weeks, by my calculations -- I would be perfectly happy\nwith the top eight teams in the Power Rankings making the playoffs. They're\nfine franchises, every one of them, many with deep pitching, some with pretty\ngood hitting and each with a chance to go all the way to the World Series.\nWhenever that is.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\n'Juvenile' diabetes at 49: 'You deal with it' \n\n\n\n\n\nA year before turning 50, Michele Thomas learned she had type 1 diabetes, a\ncondition that used to be associated mainly with children.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThousands claiming vaccine-autism link get day in court\n\n\n\n\n\nThe parents of 12-year-old Michelle Cedillo asked a federal court Monday to\nfind that their child's autism was caused by common childhood vaccines, a\nprecedent-setting case that could pave the way for thousands of autistic\nchildren to receive compensation from a government fund set up to help people\ninjured by the shots.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nChurch wants cash for 'sick' game\n\n\n\n\n\nEntertainment giant Sony has been branded irresponsible for using a cathedral\nfrom a city plagued by gun crime in a violent video game.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApple: Safari available to Windows users\n\n\n\n\n\nApple Inc. launched a version of its Safari Web browser for Windows-based PCs\non Monday, pitting it against Microsoft Corp.'s dominant Internet Explorer and\nMozilla's Firefox.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\n'Sopranos' last episode leaves much up in the air\n\n\n\n\n\nTony Soprano carries on.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWriter makes name with sex\n\n\n\n\n\nZane never intended to surround herself in mystery and intrigue.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}