{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "GOP candidates jostle to stand out", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJun  5, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nGOP candidates jostle to stand out\n\n\n\n\n\nTen Republicans who want to be president will take the stage Tuesday night for\ntheir first debate in New Hampshire, hoping to make an impression on the\nvoters who will cast ballots in the nation's first primary early next year.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLegal victory for Gitmo detainees\n\n\n\n\n\nMilitary judges at the U.S. prison camp at Guantanamo Bay, Cuba, threw out war\ncrimes charges against an aide to al Qaeda leader Osama bin Laden and against\na Canadian accused of killing a U.S. soldier.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nDeluge nearly contains Georgia, Florida wildfires\n\n\n\n\n\nTropical Storm Barry and its remnants gave a much-needed soaking to thousands\nof acres of burning swamp and timberland in northern Florida and southeastern\nGeorgia.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nJet crashes en route to organ transplant\n\n\n\n\n\nA medical transport plane carrying an organ transplant team crashed Monday\nafternoon in Lake Michigan shortly after the pilot signaled an emergency,\nauthorities said. Rescue teams were searching for any survivors.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTB patient may be allowed to leave room\n\n\n\n\n\nThe man infected with drug-resistant tuberculosis who set off an international\nhealth scare could be allowed outside of his isolated hospital room if a test\nfor the bacteria is negative, a hospital official said Monday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlane crashes into California homes\n\n\n\n\n\nA small plane lost power and slammed into homes Monday while trying to land,\nslightly injuring the pilot and two passengers, authorities said.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFBI: Informant in JFK plot was drug dealer\n\n\n\n\n\nAn informant who helped break up an alleged plot to bomb a fuel pipeline\nfeeding the city's busiest airport was so convincing to the suspects that they\nactually thanked God he was with them, federal authorities said.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\n10 charged with alleged Laos plot\n\n\n\n\n\nTen people, including a former general in the Laotian army, were arrested and\ncharged in the United States with an alleged plot to overthrow the Laotian\ngovernment.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTaylor boycotts 'charade' trial\n\n\n\n\n\nFormer Liberian President Charles Taylor on Monday boycotted the start of his\nU.N.-backed court war crimes trial in The Hague, calling it a \"charade\" in a\nletter read by his court-appointed lawyer who later walked out.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n10 injured in Beirut bomb blast\n\n\n\n\n\nClashes between Lebanese troops and Islamic militants have spread to Lebanon's\nlargest Palestinian refugee camp in the south, underlining the complexities\nthe country faces in trying to defeat al Qaeda-inspired fighters who are\nbattling a continuing army onslaught in a northern camp.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nID cards of missing soldiers shown on insurgent Web site\n\n\n\n\n\nA Sunni insurgent group on Monday posted video of the military identification\ncards of two missing American soldiers in Iraq.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nPlaying with 401(k) fire\n\n\n\n\n\nQuestion: In December, 2005 I spread the $200,000 in my 401(k) account across\nfunds that had gained 20 percent or more a year over the previous three years.\nThose funds gained about 30 percent in 2006. I'm following the same strategy\nthis year and so far I'm up about 30 percent. I should add, though, that\nfollowing this strategy has put about 65 percent of my money in foreign stock\nfunds, and I've also ended up with several sector funds. I've got another 10\nto 15 years before I retire. Am I being brilliant or blissfully ignorant of\nrisk? - Forrest, Madison, Alabama\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n7 landscaping tips\n\n\n\n\n\nIf prospective buyers looked at your house today, what would they see outside?\nA giant evergreen that looks as if it might swallow the station wagon,\nperhaps, scraggly old foundation plants or maybe a kitchen-table view of the\nneighbors' kids' trampoline?\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nChris Mannix: Donovan may regret skipping out on NBA\n\n\n\n\n\nWhen Billy Donovan left the University of Florida last week to become the head\ncoach of the Orlando Magic, he took on two tasks: improve a team that hasn't\nmade it out of the first round of the playoffs in 11 years, and prove that a\ncollege coach can actually succeed in the NBA. Unfortunately, we won't get the\nopportunity to see if Billy the Kid would have panned out.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJohn Donovan: MLB Power Rankings\n\n\n\n\n\nEjections, bitter arguments, lurid stories, cries of \"Mine!\" And that was just\nwhat was going on in the Rodriguez household last week.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\n'Lonely journey' for male breast cancer patient\n\n\n\n\n\nIt started with a pain behind the nipple. Within a few weeks, a lump started\nto grow. It got bigger and more painful until a doctor finally diagnosed stage\n4 breast cancer. It's a story shared by thousands around the United States,\nonly in this case, the patient's name is Bill Morley. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudy: Doctors biased in prostate cancer treatment\n\n\n\n\n\nThe type of prostate cancer treatment a man gets has a lot to do with the kind\nof specialist he sees first, according to a study released Monday that lends\nscientific evidence to something many men have likely guessed.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nApple iPhone available June 29\n\n\n\n\n\nApple Inc.'s highly anticipated iPhone will be available June 29 in the U.S.,\naccording to TV commercials broadcast Sunday and posted on the company's Web\nsite.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWebcasts of graduation ceremonies bridge distance problems\n\n\n\n\n\nShohei Takagiwa wanted more than anything to see his three friends graduate\nfrom college, but he couldn't travel halfway around the world from his native\nJapan to Northampton Community College in Bethlehem.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nKevin Costner taps into the dark side\n\n\n\n\n\nKevin Costner entered the hotel lobby with an apology, \"I'm sorry I'm late. I\njust got off the 'Tonight Show.' \"\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLiving in a porn-driven, 'look-at-me' culture\n\n\n\n\n\nPorn used to be relegated to a video hidden in the bottom drawer, or a\nmagazine under the mattress. Today, it's part of everyday life.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}