{"category": "ham", "to_address": "<ip-health@lists.essential.org>", "from_address": "\"Sean Flynn\" <sflynn@wcl.american.edu>", "subject": "[Ip-health] PIJIP Event: Medicines Provisions in AUSFTA and KORUSFTA 4/18", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nWashington College of Law's\n\nProgram on Information Justice and Intellectual Property and\n\nInternational Legal Studies Program\n\n\n\ninvite you to a presentation by\n\n\n\nThomas Faunce, Australian National University,\n\nSean Flynn, American University Washington College of Law\n\non\n\nA Comparison of the Medicines Provisions in AUSFTA and KORUSFTA and\ntheir Implications for Public Pharmaceutical Reimbursement Formularies\n\n\n\nWednesday, April 18\n\nNoon-1:30pm, International Student Lounge, 6th Floor\n\nWashington College of Law, 4801 Massachusetts Ave. NW, Washington D.C.\n\n\n\nOn April 1, 2007, the United States Trade Representative announced the\nconclusion of a Free Trade Agreement (FTA) between the U.S. and the\nRepublic of Korea, and soon thereafter released a summary of the\nagreement.  The summary of the agreement describes a pharmaceutical\nchapter that appears modeled on, and in many ways appears to exceed,\nregulations of the operation of public pharmaceutical reimbursement\nformularies included in the 2004 Australia-US FTA.\n\n\n\nProfessor Tom Faunce is Director of the Centre for Governance of\nKnowledge and Development's Globalization and Health Project. He is the\nProject Director of a three year Australian Research Council Project on\nthe Impact of International Trade Agreements on Access to Medicines in\nAustralia.  Sean Flynn is the Associate Director of the Washington\nCollege of Law and counsel to the Forum on Democracy and Trade's state\nworking group on pharmaceuticals and trade.\n\n\n\nFor more information on this and other events, see www.pijip.org\n\n\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}