{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Scientists find most Earth-like planet yet", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApr 25, 200705:17 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nScientists find most Earth-like planet yet\n\n\n\n\n\nEuropean astronomers have found the most Earth-like planet outside our solar\nsystem, and here's what it might be like to live there:\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSoldier: Army ordered me not to tell truth about Tillman\n\n\n\n\n\nThe last soldier to see Army Ranger Pat Tillman alive, Spc. Bryan O'Neal, told\nlawmakers that he was warned by superiors not to divulge -- especially to the\nTillman family -- that a fellow soldier killed Tillman.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nStorm kills 6 in Texas\n\n\n\n\n\nAt least six people were killed and 81 injured when a severe storm damaged\nhomes near the southwest Texas border town Eagle Pass on Tuesday evening,\naccording to a Maverick County official.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nTunnel dream: Undersea project would link Alaska, Russia\n\n\n\n\n\nFor more than a century, entrepreneurs and engineers have dreamed of building\na tunnel connecting the eastern and western hemispheres under the Bering\nStrait -- only to be brought up short by war, revolution and politics.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThreatening notes complain of cheerleader coverage\n\n\n\n\n\nThe FBI offered a $5,000 reward Tuesday for help tracking down whoever mailed\ndozens of threatening letters -- including some containing a potentially\nharmful insecticide -- complaining about TV coverage of college cheerleaders.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPet food scare prompts FDA to check imported human food\n\n\n\n\n\nThe Food and Drug Administration says it will test ingredients imported for\nhuman consumption in connection with the recall of pet food that has killed at\nleast 16 pets and perhaps more than 100.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIraq demands put squeeze on Air Force, chief says \n\n\n\n\n\nThe Pentagon's bolstering of its ground forces in Baghdad by borrowing money\nand people from its sister services is further straining a stretched Air\nForce, Air Force Chief of Staff Gen. Michael Moseley said Tuesday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nMexico City legalizes abortion \n\n\n\n\n\nMexico City lawmakers voted to legalize abortion Tuesday, a decision likely to\ninfluence policies and health practices across Mexico and other parts of\nheavily Roman Catholic Latin America.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDarfur refugees plea for U.N. help\n\n\n\n\n\nRefugee leaders pleaded with the visiting U.N. refugee chief Tuesday for\nbetter security as he toured camps around this increasingly lawless regional\ncapital, where feared janjaweed militiamen roam freely and have infiltrated\nthe police forces.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNigeria's president says elections not fatally flawed\n\n\n\n\n\nPresident Olusegun Obasanjo said in remarks released Tuesday that Nigeria's\ndeeply flawed weekend presidential elections should not be voided and asked\nobservers not to judge his country by developed-world standards.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIraqi politicians say government is failing \n\n\n\n\n\nIraqi politicians -- frustrated by violence throughout the country and the\nglacial pace of parliamentary lawmaking -- say the nearly one-year-old\ngovernment is failing.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nHome sales: Worst drop in 18 years\n\n\n\n\n\nHome sales posted their sharpest drop in 18 years in March, a real estate\ngroup said Tuesday, as problems in the subprime mortgage sector pushed sales\nwell below what economists had forecast.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApple's ex-CFO: I warned Jobs on options\n\n\n\n\n\nApple's former finance chief Fred Anderson blamed Apple CEO Steve Jobs for a\n2001 stock option grant that was backdated, according to a statement from\nAnderson's lawyer released Tuesday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nMarty Burns: Bulls' confidence grows with champs reeling\n\n\n\n\n\nCHICAGO -- Bulls forward Andres Nocioni buried the 3-pointer to beat the\nfirst-quarter horn, turned toward the Heat bench and windmilled his right arm\nwhile letting out a triumphant scream.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTom Verducci: Yankees reluctantly call up Hughes\n\n\n\n\n\nThe most important man in the American League East has made himself known. It\ntook just 18 games, 18 ridiculously messy New York Yankees games in which: \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nRe-work your workouts and spend less time in the gym\n\n\n\n\n\nWhen it comes to multitasking, you've got it down. But if exercise is often\nbumped off your to-do list by everything else vying for your attention, why\nnot make workout time your me time? \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudy: Men, women show alcohol problems differently\n\n\n\n\n\nWomen with drinking problems may show it in different ways from men, which\ncould make their alcohol abuse harder to detect, according to new research.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nCivil charges filed against 2 ex-Apple officers\n\n\n\n\n\nThe Securities and Exchange Commission filed civil charges Tuesday against two\nformer Apple Inc. officers over their alleged roles in backdating stock\noptions. The agency immediately announced a settlement with one of them.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGame makers excited about Windows Vista\n\n\n\n\n\nFrom the movie-like graphics in the action game \"Gears of War\" to the nearly\nphotorealistic racer \"MotorStorm,\" video games have come a long way since the\nbouncing blocks of \"Pong.\"\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\n'Jericho' man of mystery reveals a lighter side\n\n\n\n\n\nWhen British actor Lennie James arrived in Los Angeles early last year, he\ngave himself three months to get a gig. After three weeks, he'd been offered\ntwo.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRecovering Ebert to defy paparazzi\n\n\n\n\n\nRoger Ebert plans to attend his annual festival for overlooked movies this\nweek, returning to public view for the first time since having cancer surgery.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}