{"category": "ham", "to_address": "\"General Copyright Discussions (questions, organizing,\n\tetc)\" <discuss@list.digital-copyright.ca>", "from_address": "Darryl Moore <darryl@mfe.ca>", "subject": "[d@DCC] Death (of Quebec) by Copyright", "body": "This report from the Canada Council for the Arts should also resonate \nwith the Bloc.\n\nhttp://www.canadacouncil.ca/NR/rdonlyres/A3F28CDC-61BA-4D3B-BF2B-917249761D32/0/bkgcreane.pdf\n\n---\nIn the emerging world of e-commerce, small creators may find it more \ndifficult to obtain access to intellectual property, some of which may \nformerly have been in the public domain and because of mergers and \nacquisitions and the privatization of databases now come with a fee \\ \nattached. 1 5 Artists can thus expect to be whipsawed between the \nprohibitive cost of enforcing their own rights and the rising incidence \nof IP charges.\n\nGovernment has participated enthusiastically in the raid of the public \ndomain, mainly through the imposition of user fees (for example, to much \nof Statistics Canada material) and the contracting out of the management \nof databases and information resources of all kinds. 1 6 From the \nindependent artist's point of view the trend is towards ever greater \ncosts for access to the same basic information, this being attributable \nsolely to the private sector manipulation of the material as content.\n---\n\nIn other words small artists in small markets stand to lose the most \nfrom stronger copyright. This is Quebec.\n\n\nDarryl Moore wrote:\n> Ekkk, no. It would also be good to do a translation of the entire disc\n> for the Bloc folks. I'm sure that would make them a lot more receptive\n> to a position which 'should' be more closely aligned with their own.\n> That is to much work for anybody.\n> \n> I think however that a different letter for the Bloc, which emphasizes\n> the effect on small artists. Unfortunately I only have one example on my\n> disc from Quebec, and nothing which is French language.\n> \n> Is there anybody who would like to contribute to this with a single page\n> of French language content? Specific examples to include would be\n> \n> Galerie d'Art du Petit Champlain  - \n> http://dvd.moores.ca/other.html#theberge\n> \n> Some translation of Michael Geist's points -\n> http://www.michaelgeist.ca/content/view/1536/125/\n> \n> Unfortunately I don't know much that will illustrate the barriers to\n> Quebec artists specifically.\n> \n> cheers,\n> darryl\n> \n> Chris Brand wrote:\n>  > Darryl Moore wrote:\n>  >  > Here is the letter that I am enclosing with the DVDs.\n>  >\n>  > Do you have a French translation for the appropriate MPs ? My gut\n>  > feeling is that those Bloc MPs would be much more likely to take notice\n>  > of a letter in French with an accompanying DVD.\n>  >\n>  > I know we have people on the list who are capable of translating it.\n>  >\n>  > Chris\n>  > _______________________________________________\n>  > Discuss mailing list\n>  > Discuss@list.digital-copyright.ca\n>  > http://list.digital-copyright.ca/mailman/listinfo/discuss\n>  >\n> \n> _______________________________________________\n> Discuss mailing list\n> Discuss@list.digital-copyright.ca\n> http://list.digital-copyright.ca/mailman/listinfo/discuss\n> \n\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}