{"category": "ham", "to_address": "debian-vote@lists.debian.org, debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: Request for GR: clarifying the license text licensing / freeness issue", "body": "Nathanael Nerode  wrote:\n> [GPL/LGPL addressed in an earlier thread.]\n> The Academic Free License does not have \n> permission to modify.  The LaTeX Project Public License does not have \n> permission to modify.\n\nI think AFL is not a DFSG-free licence because of its excessive\nMutual Termination for Patent Action clause that contaminates other\nsoftware.  It also seems to use copyright to try to enforce a sort of\n'super-trademark' which I suspect breaks guidelines somehow.\n\nLPPL is a rather more complicated licence with which I'm not\nparticularly familiar, but this wouldn't be its first DFSGish problem,\nwould it?\n\n[...]\n> We've already *got* non-free software in Debian, namely the license \n> texts above.  In fact people are already arguing exactly what you said.  \n> This would simply be more honest about it.\n\nInstead, we should reject the broken reasoning that supports the\nabove claim, such as exaggeratedly claiming 'most' licences do this.\nThere may be a few licences that are buggy about this and to which we\nwant to grant a limited-time exception, but that is not unusual.  Use\na GR for only that, not a permanent foundation document edit.\n\n> Care to craft another solution? [...]\n\nNo, I've no interest in making another solution looking for a problem.\nAttempting to make this black and white by changing our promise seems\nlikely to introduce as many conflicts as it removes.  Even if we could\nchange the licence texts, we couldn't change them, so this is an\nexercise in pointlessness.\n\nRegards,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}