{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Simon Wood <s.wood@bath.ac.uk>", "subject": "Re: [R] How to compare GLM and GAM models", "body": "On Wednesday 20 June 2007 10:34, Prof Brian Ripley wrote:\n> On Tue, 19 Jun 2007, Ben Bolker wrote:\n> > Yuanchang xie  hotmail.com> writes:\n> >> Dear Listers,\n> >>\n> >> I want to compare two negative binomial models fitted using glm.nb and\n> >> gam(mgcv) based on the same data. What would be the most appropriate\n> >> criteria to compare these two models? Can someone point me to some\n> >> references? Thank you very much.\n> >>\n> >> Yuanchang Xie\n> >\n> >  Since they can't possibly be nested I would suggest AIC.\n>\n> Surely they could be: a smooth fit in gam includes the possibility of a\n> linear fit.\n>\n> What is of more concern to me is that gam() is by default itself doing\n> model selection, so AIC is not well-defined.  According to ?gam.selection,\n> the comparisons are best done by comparing scores within mgcv.\n\n- In the negative binomial case  I'd also be a bit cautious about  AIC  --- \nfor the `gam' model the negative binomial `theta' parameter is not an MLE (or \neven penalized MLE): see ?gam.neg.binom for details. That said, comparison of \nGCV scores is definitely not an option: the `theta' estimation method renders \nit meaningless here. \n\n- Of course if `theta' is known then everything is different. In that case the \nnegative binomial gam is the same as any other gam with known scale \nparameter, so the default `mgcv:gam' behaviour will be to do smoothness \nselection using what is actually an approximate AIC. Estimated degrees of \nfreedom replace number of parameters in the AIC `penalty' term, something \nwhich can be justified using a variant of the arguments underpinning the GACV \nmethods proposed by Xiang & Wahba (1996, Stat. Sin.) and Gu and Xiang (2001, \nJCGS).  In other (non negative binomial) cases, when the scale parameter is \nunknown,  a variant of GCV is used for smoothness selection. However, \nasymptotically this is equivalent to using the AIC type approach \n(unsurprisingly, see Stone, 1977, JRSSB).\n\n- The upshot of this is that generally I think that AIC (modified to use EDF \nin place of parameter count, as in R) is a reasonable way to compare GAMs --- \nin the known scale parameter case it's equivalent to comparing the scores \nused for smoothness selection, while in the unknown scale parameter case it's \nequivalent to comparing such scores, in the large sample limit. \n\n- For negative binomial GAMs with unknown theta, I'd still be inclined to use \n`AIC()' as a guide for model selection, but bearing in mind that in that case \nit's an approximation without good supporting theory,  \n\nbest,\nSimon\n\n\n-- \n> Simon Wood, Mathematical Sciences, University of Bath, Bath, BA2 7AY UK\n> +44 1225 386603  www.maths.bath.ac.uk/~sw283\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}