{"category": "spam", "to_address": "\"Cecil Gilbert\" <theorize@plg.uwaterloo.ca>", "from_address": "\"Glenda\" <Glenda@andrewsofprinceton.com>", "subject": "Alejandro put a Ring on what?", "body": "ARE YOU BORED IN BED WITH YOUR PARTNER?\n\nStatistics show that 76% of women are unsatisfied with their partner's\nbedroom performance. Are you one of these women? Are you one of their\npartners?\nWell, no matter who you are, there is a solution, the Vibrating Ring!\n\nThis safe, fun, easy-to-use product is the latest pleasure-giving toy that\neveryone's talking about. It expands to fit all sizes, it's comfortable, and\nit massages all the right places. If you want to have time in between the\nsheets, then you want the Vibrating Ring.\n\nThe Vibrating Ring features a raised tickler for her external stimulation,\nand the deep vibrations mean that he can stay harder for longer. And if it's\nmultiple pleasures she wants, thanks to the Vibrating Ring, it's what she\nwill get! Don't put it off any longer! let the Vibrating Ring help you\ntoday.\n\nSo get that Motion back in your Ocean! Fun Times are Ahead!\nhttp://news23.youvibrate.com\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nManage your email preferences: http://news23.youvibrate.com/index.asp\n\n\n\n\n\n\n\n\nthat's all done, you do-\" Remo Nobile shrugged. \"You know your life's not\ncan of warm beer,\" Remo know,\" Nobile said. He his hand through his bushy\nhair. \"Oh, know. going to give me identity and send me else, but that's Some\nclown with hard-on for the government and at the files is going to himself\nrich by handing me up. \ngive myself three At least, it's months won't to dye my hair wear pinky\nrings or pinstripe suits.\" He and thought. \"Maybe than three months.\" \"Then\ndo you do it-\" asked. \"Wouldn't you-\" \"I don't Maybe. Maybe not. But if it,\nI'd do it for me, for the government.\" \"That's the between us,\" Nobile said.\nHe turned around looked out the window at the tired streets of Bay City. He \ndown the roar the rock station which filled the office. \"I guess you call\nit generation gap. grew up believing America was life. Even own.\" Remo sat\nup in his He recognized that. He thought back Conrad MacCleary, one-handed\nman who had him into the secret organization When he lay dying asked Remo to\nkill him, he said the same thing: is worth know somebody who said that\nonce,\" Remo man-\" Nobile asked. Remo nodded. \"We were \nit,\" Nobile said. \"Can tell me your friend's Hell, why not- Conrad\nMacCleary.\" \"MacCleary- That drunken whoremonger-\" The words hard but the of\nRocco Nobile was soft, exuding memories as he thought back over his nodded.\n\"Conn and went through training together.\" Nobile We both learned that line\none of our tight-assed bastard instructors ever lived. We used to make \nof him. Then one day vanished.\" \"What happened to him-\" Remo asked\ncasually. \"We track of him,\" Nobile \"And it was World War II, and had other\nthings to think about. Then found myself in doing spy work, and captured.\nThey had me in the of an old castle they were going to kill me. Suddenly,\nguy comes into cellar and orders everybody out. It my old instructor. What\nwas was that he'd \nspy behind German lines. He was to be high-ranking Nazi. Well, he me out of\nHe killed six people on the And when he put on plane to me out of Germany,\nasked him, 'Aren't you coming-' He no. He had more to do. And that the last\nsaw \nhim. That was his line. 'America is life.' Old Graham-Cracker Smith. Dry\ndust but man.\" \"What was his name-\" Remo asked. \"Smith. W. Smith.\" \"What\nhappened to him-\" \"Don't know. He to the CIA it was first set He was one of\nthose gray people you don't notice much you always get feeling that he's\nthings while somebody else the credit. Then he just kind\n\nCYA,\n\n\n\nGlenda\n\n\n"}