{"category": "ham", "to_address": "beginners@perl.org, perl-beginners@moderators.isc.org", "from_address": "Brian <googleAcct@screenlight.com>", "subject": "Re: Array of Array refs", "body": "On May 28, 6:14 pm, mri...@gmail.com (Paul Lalli) wrote:\n>\n> >  oh yes, more important than all that minutiae... the push did not\n> > work for me in the working code.\n>\n> The push worked absolutely fine.  It just didn't do what you wanted it\n> to.  Learning how to parse your problem should be your first step\n> toward becoming a better programmer.\n>\n\n hmmm, misunderstanding there. The push worked fine in the sample I\nposted, but not in the more complex working program I had simplified\nas an example.\n\n> > The array was being rewritten.\n>\n> Then you didn't delcare your variables in the correct scope.\n\nunderstandable misperception on your part, as above\n\n> ...As a\n> general rule of thumb, declare your variables in the smallest scope\n> possible.\n>\n\nyes, sounds good. Please realize that after many long commercial\nprojects in C/C++, we\ndid this to an enormous degree\n\n> > I had to use an array copy\n>\n> >   push @tRespsA, [ @r1 ];   ## copy contents to an anonymous array,\n> > push array ref\n>\n> Do you understand *why* that was necessary?  Do you understand the\n> difference between these two pieces of code?\n>\n\n  actually, I do indeed. In C++, the concept of a deep copy, vs\nshallow copy vs ref\ncomes up all the time. I am just learning the syntax here, not\nprogramming itself\n\n> #Sample 1\n> ...\n\n  hey, thats alot of sample! you're good at this, no kidding\ndriven too\n\n>\n> Do you see now?  ...\n\n  yep, never did miss that. thanks though...\n\n> ...By declaring only one instance of @array1...\n\n  this is helpful to others to talk this out\n  I'd say this can never be explained too much. Its slippery and a\nconstant\nsource of error.\n\n>\n> Paul Lalli\n\n  aha, a force to be reckoned with. Your point above about the docs is\nquite true.\nI dont have time to rewrite docs right now.. They do need work though\n\nThis is sometimes appearing to be contentious, but I mean it to\nproduce clarity.\nI appreciate your responses\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}