{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "disquisition: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Monday, June 18, 2007\ndisquisition \\dis-kwuh-ZISH-uhn\\, noun:\nA formal discourse on a subject.\nHence, although the publisher calls Mr. Roth's work \"An Essay on Evil in the Modern World,\" it will be found to differ materially in approach and manner of treatment from the usual disquisition on an ancient topic. -- Percy Hutchison, \"That Old Arch-Enemy of Man the Antichrist\", New York Times, May 12, 1935\nGore was partial to eye-glazing disquisitions on reciprocal trade. -- Bill Turque, Inventing Al Gore\nThe treatises and pamphlets of the late eighteenth century about the reform of commerce were considered, very soon, to be disquisitions of only limited and technical interest. -- Emma Rothschild, Economic Sentiments\n. . .a rambling disquisition, with copious historical discussion and many anecdotes. -- James McCourt, Delancey's Way\nDisquisition comes from Latin disquisitio, from disquirere, \"to inquire into, to investigate,\" from dis- + quaerere \"to seek.\" It is related to inquire (\"to seek into\") and exquisite, which describes something that is \"sought out\" (ex-, \"out\") because of beauty, delicacy, or perfection.\nDictionary.com Entry and Pronunciation for disquisition\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9946910-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}