{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "Showbiz Tonight <showbiz@mail.cnn.com>", "subject": "TONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT", "body": "\n\n\nCNN.com - Showbiz Tonight\n\n\n\n\n\n\n\n\n\n\nTONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT\n\nDON IMUS GETS FIRED -- AND EVERYONE IS FIRED UP!\nExplosive fallout from the news that Don Imus has lost his\ntelevision show and now his radio show too, because of his\nracist and sexist comments. Does the punishment fit the crime?\nShowbiz Tonight gathers an extraordinary panel to weigh in on\nthe controversy that touches on everything from race to gender\nto free speech!\n\nANNA NICOLE SMITH'S SECRET DIARIES\nInside Anna's secret diaries. Howard K. Stern says they're\nstolen property, but the sale will go on. Tonight, the man\nwho's selling Anna's diaries, in the interview you will see\nonly on Showbiz Tonight! \n\nON SHOWBIZ TONIGHT THIS\nWEEKEND:\nShould we be worried about Howard K. Stern? Why\nsome say Stern should be put on suicide watch. That's on\nShowbiz Tonight This Weekend, Saturday and Sunday at 11 p.m.\nET/PT on CNN Headline Prime.\n\nSHOWBIZ TONIGHT QUESTION\nOF THE DAY: \nImus gets canned: Do you feel sorry for him?\nVOTE AT CNN.COM/SHOWBIZ TONIGHT. \n\nSEND US A VIDEO\nEMAIL! \nSend your response to the Question Of The Day on\nvideo. Look into your camera and tell us what you think.\nResponses must be no longer than 30 seconds. To send your video\nemail, go to cnn.com/showbiztonight.Watch your video responses\non \"Showbiz Tonight\" at 11 p.m. ET/PT on CNN Headline Prime.\n\n\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the Showbiz Tonight list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=showbiz\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}