{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "Mike Linksvayer <ml@creativecommons.org>", "subject": "Re: [cc-community] Q. about license metadata in <span> element\n\tand\tXHTML validation", "body": "On Sun, 2007-06-03 at 10:35 +0200, Claude Almansi wrote:> On 6/3/07, Mike Linksvayer  wrote:> > On Sat, 2007-06-02 at 23:57 +0200, Claude Almansi wrote:> > > I.e. the code you get for a \"general\" license (without registering the> > > work) puts the \"dc\" metadata about the type of license in a > > > element,> >> > The type/format of work you mean.  Do not specify work format, you don't> > get that element.> > Interesting suggestion, but isn't specifying the format meant to help> people search for a given kind of content?\nYes, though it isn't being used by Google or Yahoo! now.\n> > > which the W3C code validator http://validator.w3.org/ doesn't> > > accept. Whereas if you register a work under a license, the metadata> > > (which also include author, right holder, title, description ecc) are> > > in a  element, which the W3C code validator accepts.> >> > I don't know what you're referring to.  CC doesn't run a registration> > service.> > Sorry: I  meant  code like this:> >  href=\"http://creativecommons.org/licenses/by-nc-nd/2.5/\"> alt=\"Creative Commons License\" style=\"border-width: 0\"> src=\"http://creativecommons.org/images/public/somerights20.png\"/>i> contenuti di questo podcast sono pubblicati sotto una  href=\"http://creativecommons.org/licenses/by-nc-nd/2.5/\">licenza> Creative Commons.> > which I got from the creativecommons site last Autumn - though I can't> find the page where it got generated  anymore, to my shame. I> shouldn't have used the word \"register: it wasn't like registering a> work's copyright, It was a possibility to put it  in a list of> available content under CC\nYes, CC did hand out code like the above as of last fall.  The twothings to note are the <--! ... --> enclosing the RDF/XML and the factthat none of the extended metadata was used by anyone.\n\n> > > It's not just a matter of being able to put a> > > http://www.w3.org/Icons/valid-xhtml10 button on a site - but valid> > > code makes general access possible.> >> > Father son holy ghost amen.> > :D I was being sanctimonious, sorry\nNo problem, I was being a jerk.  But my point was that in realityvalidity makes about as much difference for access as prayer does, forexample, actual health.\n--   http://wiki.creativecommons.org/User:Mike_Linksvayer\n_______________________________________________cc-community mailing listcc-community@lists.ibiblio.orghttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}