{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] USA for Innovation press release on Thai ad campaign", "body": "http://usaforinnovation.org/news/display_article.cfm?ID=20\n\nUSA for Innovation Ad Campaign Highlights Thailand's Theft of American\nAssets\nOver 35,000 letters sent to President Bush and U.S. Policymakers\n\nUSA for Innovation press release\nApril 25, 2007\n\nWashington, DC - USA for Innovation today announced an advertising\ncampaign to highlight Thailand's new military regime and its recent\nthreats to seize patents owned by American companies. The advertisement,\na full-page ad in the Wall Street Journal, highlights a recent movement\nby the new Thai military regime, which assumed power by coup last\nSeptember, to steal American medical innovations.\n\nAdditionally, supporters of USA for Innovation delivered over 35,00\nletters to President Bush, Administration officials and Congressional\nleadership urging the United States to \"take retaliatory action in the\nform of trade or economic sanctions or the removal of military aid.\"\n\nComplete Text of the Advertisement\n\n      Slouching Towards Burma: Thailand's Radical New Regime When\nmilitary dictators take over by coup, the people lose. Right now,\nGeneral Surayud Chulanont is steering Thailand the way of Burma.\n\n      First, he lined military pockets with pay increases of $9 million\nand new military spending of $1.1 billion.\n\n      Then the opposition started disappearing. Human Rights Watch last\nmonth released a report detailing 22 cases of targeted \"disappearances\"\nby the Thai military in the southern provinces.\n\n      Then the Ministry of Health threatened to kidnap American\ntourists. The military-appointed representative at the World Health\nOrganization, Dr. Suwit Wibulpolprasert, proposed in January holding\nWestern tourists hostage to bargain for flu vaccines.\n\n      Then coup leaders hastily imposed draconian measures on\nforeign-owned companies . like capital controls, restrictions on\nbusiness advertising and surveillance of Americans working in Thailand.\nAnd now they are stealing American assets for military benefit.\n\n      The new military-appointed Minister of Health, Mongkol Na\nSongkhla, has begun to override the patents on American medical\ninnovations to strengthen manufacturing for the military-controlled\nGovernment Pharmaceutical Organization.\n\n      The U.S. Patent and Trademark website claims that such theft costs\nAmerica $250 billion and 750,000 jobs per year.\n\n      In a global economy American innovation is our comparative\nadvantage. A study by USA for Innovation estimates that U.S.\nintellectual property today is worth between $5 trillion and $5.5\ntrillion, equivalent to about 45 percent of the U.S. GDP and greater\nthan the GDP of any other nation in the world.\n\n      We urge President Bush and the Congress to Protect America's\nInterest and the People of Thailand.\n\nAbout USA for Innovation\n\nUSA For Innovation is a non-profit organization dedicated to the\nprotection of intellectual property and continued innovation around the\nglobe. USA For Innovation educates decision makers, the media and\ngeneral public about threats to innovation. For additional information,\nplease contact us at 866-646-8668 or maura@usaforinnovation.org.\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}