{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "WE'LL HAVE EXTENSIVE COVERAGE OF THE MASSACRE AT VIRGINIA TECH--TONIGHT ON THE CBS EVENING NEWS WITH KATIE COURIC. l ", "body": "\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nQUOTE OF THE DAY\"Just because something doesn't \n      do what you planned it to do doesn't mean it's useless.\" - Thomas \n      A. Edison \n\n\n\nDID YOU KNOW?Chocolate manufacturers \n      currently use 40 percent of the world's almonds and 20 percent of the \n      world's peanuts. \n\n\n\nTONIGHT ON THE CBS EVENING \n      NEWSHere is an early preview of what we are \n      planning for tonight's CBS EVENING NEWS from Anchor and Managing Editor, \n      Katie Couric... Hi everyone, I'll be \n      anchoring a special hour-long broadcast tonight from Blacksburg, Virginia, \n      where earlier today a gunman opened fire multiple times at the Virginia \n      Tech University, resulting in the deadliest campus massacre in U.S. \n      history. Our team of correspondents will bring you complete coverage. \n      We will start by telling you about the incidents that began \n      unfolding at 7:15 this morning in one of the largest residence halls on \n      the Virginia Tech campus and continued two hours later at Norris Hall, an \n      engineering building. By late morning, at least 33 on campus were dead. President Bush said \n      he was \"horrified\" by the news of the shooting, and expressed his sympathy \n      for the victims and their families. Thalia Assuras will talk with \n      some of the students who survived the shooting and have more eyewitness \n      accounts. Daniel Sieberg, our Science and Technology \n      Correspondent, will detail how the university and the students who study \n      there used Internet communications to keep one another informed as the \n      tragedy unfolded. And in the wake of such a massacre, it is \n      natural to ask \"could this have been prevented?\" Hari Sreenivasan \n      will report on the state of security on campuses around the country. \n      In the meantime, residents of the Northeast are coping with the \n      remnants of a massive storm that hit over the weekend, bringing record \n      rainfall and strong winds. By Monday afternoon, much of the East Coast was \n      still under water and hundreds of thousands of people were without \n      electricity. Nancy Cordes will have the story. The National \n      Urban League is releasing a report tomorrow that will show that black men \n      in America don't have many of the same privileges as other citizens. We'll \n      have the study's findings tonight. I hope you'll join us. \n      In the meantime, stay updated on news out of Virginia by visiting \n      CBSNews.com. Thanks, Katie For more \n      information on these stories, please click on the following links:\nAt Least 31 Killed In Va. Tech Massacre Click \n      Here Flooded Homes, Power Outages On East Coast Click \n      Here And here's a look at one of the stories we're working \n      on for Tuesday's broadcast: We'll have all the latest on the \n      school massacre in Virginia. And Attorney General Alberto Gonzales goes to \n      Capitol Hill to fight for his job. That story and much more, Tuesday, on \n      the CBS Evening News. If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: evening@cbsnews.com \n\n\n\nTONIGHT ON DAVID \n      LETTERMANDave sits down with talk show \n      host/actress Kelly Ripa AND actor Simon Pegg... Plus, comedian Jim Short! \n      \n\n\n\nTUESDAY \n      MORNING ON THE EARLY SHOWHarry Smith \n      anchors THE EARLY SHOW from Blacksburg, VA. \n      Russ Mitchell and Maggie Rodriguez, of \n      our Miami affiliate WFOR, anchor from New York. Julie \n      Chen anchors from Los Angeles. Dave Price will \n      bring us the weather. Hannah Storm is off. \n      THE EARLY SHOW WILL HAVE SPECIAL COVERAGE OF \n      \"MASSACRE AT VIRGINIA TECH.\" Here is a look at some of the stories \n      we will be focusing on: VIRGINIA TECH LATEST: On Monday, \n      Virginia Tech was the scene of horrible massacre. With at least 30 dead \n      and close to 22 injured, it is the worst campus shooting in United States \n      history. Police say the gunman killed a victim in a dorm, and then later \n      opened fire in a classroom where most of the fatalities occurred. CBS News \n      Security Correspondent Bob Orr will have the latest on \n      the gunman and what exactly happened at Virginia Tech. LOU \n      DOBBS ON SCHOOL VIOLENCE: Lou Dobbs will offer his take on school \n      violence in his second weekly commentary. HISTORY OF \n      SCHOOL SHOOTINGS: School shootings are nothing new. In fact, \n      before the massacre at Virginia Tech, a shooting in 1966 was the most \n      devastating in United States history. Now, we once again are forced to \n      take a look at why such horrific violence is happening and has continued \n      to happen for decades. VIRGINIA TECH TRAUMA: \n      Clinical psychologist and Early Show Contributor \n      Robin Goodman will join us to take a look at the trauma \n      the students at Virginia Tech will be experiencing. How can they begin the \n      healing process? Also, we'll ask Dr. Goodman about the \n      trauma the shooting may be causing your children at home. Should they \n      watch the news with you? And is it good for them to do so? We'll take a \n      look. IS YOUR CHILD SAFE?: EARLY SHOW \n      National Correspondent Hattie Kaufman will take a look at \n      campus security. Is your child safe? We'll tell you what questions you \n      need to be sure to ask on any campus tour. If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: earlyshow@cbs.com \n\n\n \nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}