{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Morning HTML\" <cbsnews_weekday_morning_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 24, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIES9 U.S. Troops Die In Attack On Iraq Base\nNine U.S. troops were killed and 20 more wounded when a suicide bomber attacked a forward patrol base in the deadly Diyala\n                        province, north of Baghdad. Also, unknown gunmen in Iraqi army uniforms and vehicles have raided a village, killing six people. More...Watch: War Funding Deadlock Continues\n• Toyota Is World's #1 Automaker• David Halberstam Killed In Bay Area Crash• Border Patrol Agent Charged With MurderU.S.David Halberstam Killed In Bay Area Crash\nDavid Halberstam, a Pulitzer Prize-winning author who chronicled the Washington press corps, the Vietnam War generation and\n                        baseball, was killed in a car crash early Monday, a coroner said. He was 73. More...\n• Classes Resume At Virginia Tech\n                     \t\t\t\t\t| Watch• Execution Drugs Sometimes Fail To Work• Border Patrol Agent Charged With Murder• More StoriesWorldGetting Old In Cuba\nCubans enjoy one of the highest life expectancy rates in Latin America. But longer lives can create a strain for families\n                        who have little recourse to nursing homes or assisted living facilities, writes Portia Siegelbaum in Havana. More...\n• 9 U.S. Troops Die In Attack On Iraq Base\n                     \t\t\t\t\t| Watch• World Leaders Remember Yeltsin\n                     \t\t\t\t\t| Watch• Brits Arrest 6 On Terror Charges• More StoriesPoliticsReid: Bush In \"Denial\" On Iraq\nSenate Majority Leader Harry Reid said President Bush is in \"a state of denial\" about the war in Iraq. Reid said the Democratic-controlled\n                        Congress will pass a bill this week requiring U.S. troops to begin withdrawing from Iraq by Oct. 1. More...Watch: War Funding Deadlock Continues\n• Poll: Little Change In Views On Handguns\n                     \t\t\t\t\t| Watch• Gonzales Vows To Stay On The Job\n                     \t\t\t\t\t| Watch• Execution Drugs Sometimes Fail To Work• More StoriesHealthNew Drug May Treat Muscular Dystrophy\nAn experimental drug called PTC124 may override a gene glitch seen in Duchenne muscular dystrophy, according to lab tests\n                        done on mice. More...\n• Is FDA Capable Of Keeping Food Safe?\n                     \t\t\t\t\t| Watch• U.S. Food Safety Strained By Imports• Medicare Trust Fund To Last A Year Longer• More StoriesSciTechNASA Captures 3D Images Of Sun\nNASA has released the first three-dimensional images of the sun. The space agency says the photos taken from twin spacecraft\n                        may lead to better predictions of solar eruptions that can affect communications and power lines on Earth. More...Watch: First 3-D Images Of The Sun\n• MTV Shows Car Owners How To Go Green• Man Gets 5,000 Calls After YouTube Post• The Legacy Of \"Silent Spring\"\n                     \t\t\t\t\t| Watch• More StoriesBusinessToyota Is World's #1 Automaker\nToyota Motor Corp. became the world's top auto seller in the first three months of the year, passing rival General Motors\n                        Corp. for the first time ever.  Will it be able to sustain the surge throughout the rest of 2007? More...\n• Betting On The Next \"Big Thing\"• CBS Radio Suspends 2 For Racial Prank• Medicare Trust Fund To Last A Year Longer• More StoriesEntertainmentRethinking Rap\nHip-hop may be the culture and soundtrack to a generation, but it's getting more criticism for its vulgarity and profanity.\n                        Bill Whitaker reports. More...Watch: Rap Lyrics Under Scrutiny\n• Sneak Peek: Last Smith Role A Self-Parody\n                     \t\t\t\t\t| Watch• Letterman To Appear On Regis' Talk Show• CBS Radio Suspends 2 For Racial Prank• More StoriesOpinionPoll: Little Change In Views On Handguns\nLast week's shooting rampage at Virginia Tech did little to change Americans' views on gun control, according to a CBS\n                        News/N.Y. Times poll. A majority continues to favor stricter handgun laws, but oppose a ban on all handguns. More...Watch: Virginia Tech and Gun Control\n• Troops In Iraq Plead For Support \n                     \t\t\t\t\t| Watch• French Lessons\n                     \t\t\t\t\t| Watch• Andy Loves His Books• More StoriesCBS NEWS BROADCASTSThe Early Show: Colin Cowie: Wedding In A Week\nLisa Mayo and Stephen Wilfong plan, and have, one with the help of Early Show events planner extraordinaire\n                        Colin Cowie, in a special series culminating with their nuptials. Get daily updates here. More...Watch: Wedding In A Week: The Rings\n• SciTech: NASA Captures 3D Images Of Sun\n                     \t\t\t\t\t| Watch• CBS Evening News: Rethinking Rap\n                     \t\t\t\t\t| Watch• U.S.: DNA Tests Exonerate Illinois Man \n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nFirst 3-D Images Of The SunTwin stereo satellites recently took the first 3-D images of the sun. NASA scientists hope to use the date to forecast the\n                                    sun's weather. Jerry Bowen reports from Los Angeles.\nTOP VIDEOS\nBush: Gonzales Is Staying\nStudents Reclaim Virginia Tech\nDNA Evidence Exonerates Man\nGrowing Concern About The FDA\nEye To Eye: Barry Scheck\nFDA Under Fire\nBoris Yeltsin Dead At 76\nRap Lyrics Under Scrutiny\nLondon Cabs Go High Tech\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesAmid the debate whether life in Baghdad is getting better, Lara Logan meets ordinary Iraqis to find out. Sunday at\n                           7 p.m. ET/PT.\n                        48 Hours MysteryNightmare In Napa:A surprising murderer is unmasked in the Halloween killings of two young women. Bill Lagattuta\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}