{"category": "ham", "to_address": "Oliver Moldenhauer <Oliver.Moldenhauer@berlin.msf.org>", "from_address": "Oliver Moldenhauer <Oliver.Moldenhauer@berlin.msf.org>", "subject": "Re: [Ip-health] MSF statement for the NGO-Merkel-Meeting on the G8", "body": "Hi,\n\nI just realized that the listserv deleted the attachment. Therefore here\nour English text in the body of the message.\n\nCiao,\n\n        Oliver Moldenhauer\n___________________________________________\nDipl. Phys. Oliver Moldenhauer\nCoordinator Access Campaign Germany\nÄrzte ohne Grenzen e.V. / Médecins Sans Frontières\nAm Koellnischen Park 1 - 10179 Berlin - Deutschland\nTel. +49-30-22 33 77 90 (Fax - 88)\nmail to Oliver.Moldenhauer@berlin.msf.org\nvisit us http://www.aerzte-ohne-grenzen.de\n\nDear Chancellor Merkel,\n\nIn Médecins Sans Frontières programmes around the world, HIV/Aids and\ntuberculosis\npresent us with an enormous challenge, which we would like to bring to\nyour attention.\nWe believe tuberculosis illustrates the complex relationship between\ninnovation, medical\nneeds and access to healthcare. Our patients with TB are dying: we cannot\nreliably\ndiagnose them in half of the cases; the deadly, all too common of\ncombination of HIV\nand TB is hard to treat. More and more often, patients come to us with\nmulti-drug\nresistant or extensively drug resistant strains, which renders treatment\nwith existing drugs\nso difficult that it is almost impossible.\nThe constraints we are faced with are due to the inadequacy of the medical\ntools that we\nare forced to rely on as doctors. We are diagnosing patients by\nmicroscopy, a method\ninvented by Robert Koch in 1882. Our major weapons against the disease are\ndrugs that\nwere developed more than 40 years ago.\nInnovation is desperately needed for tuberculosis: we will simply not be\nable to stem the\ntide of the disease with current tools. Germany\\u2019s performance is\nparticularly\ndisappointing: within the little investment that exists for tuberculosis\ntoday, Germany\nranks a lowly 13th. TB is one example \\u2013 there are many other diseases that\nprimarily\naffect people in poor countries for which there is today insufficient\ninvestment into\nresearch and development.\nChancellor Merkel, you have made innovation one of the top agenda points\nfor this G8.\nAnd yet the only strategy you offer to foster innovation is the protection\nof intellectual\nproperty.\nUnder certain conditions intellectual property may have an important role\nto play.\nHowever it is widely recognized and well documented, including by WHO,\nthat\nprotection of intellectual property does nothing to stimulate innovation\nfor diseases \\u2013\nwhen there is no market, patent protection is not enough to attract\npharmaceutical\ncompanies\\u2019 investment. Innovation does not take place, and patients, like\nthose MSF\nsees with tuberculosis today, are left without the diagnostic tools or\ndrugs that work.\nInnovation is meaningless in health if the people who need access to the\nproducts are\nexcluded. Yet your innovation agenda ignores the needs of people in poor\ncountries,\nwhile Africa is a key focus of the G8.\nWhere there is no market, new approaches for innovation that are not based\non paying for\nthe innovation through high drug prices and patents are needed. Such new\nproposals for\nnew mechanisms to stimulate health innovation exist and these will be\nconsidered at the\nWHO Intergovernmental working group on public health, innovation and\nintellectual\nproperty (IGWG). This process offers an historic opportunity to change the\ncurrent\nsituation: the G8 should put its force behind this.\nWe also note that the G8 will discuss counterfeit medicines. Counterfeit\nmedicines are a\ndanger to people\\u2019s health. But it is necessary to deal with the issue in\nits entirety: the\nlack of effective quality medicines that people can afford fuels the\ncounterfeit problem.\nThis is the issue that the G8 must address.\nThe recent patent disputes in Thailand, Brazil and India show that the G8\ncannot state\nthat IP is the backbone of innovation without recognizing the enormous\nproblems patents\non pharmaceuticals cause for ensuring that people have access to these\ninnovations.\nThe rising prices of patented AIDS medicines are a huge concern. MSF\ntreats more than\n80,000 patients with HIV in more than 30 countries. We are facing a cost\nexplosion,\npossibly already a doubling of drug expenses within two years, as more and\nmore patients\nneed to change to second-line treatment. Other programmes will soon face\nthe same\nchallenge. We imagine this is the same for many countries.\nThe G8 must affirm the right of countries to use TRIPS flexibilities such\nas compulsory\nlicenses and support initiatives for a pro-health management of IP, such\nas a patent pool,\nto ensure that patents are not a barrier to access to life-saving\nmedicines.\nFinally, it is important for the G8 to ensure that adequate funding for\nhealth is available,\nsuch as through the Global Fund. However extra resources should not\ndevoted to\nsubsidising premium-priced health care products. Funding for health can\nhave a far\ngreater impact if the cost of medicines can be brought down.\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}