{"category": "ham", "to_address": "Robert A LaBudde <ral@lcfltd.com>", "from_address": "adschai@optonline.net", "subject": "Re: [R] Windows vista's early terminate Rgui execution", "body": "That's really helpful Robert! I was thinking of writing my output to a file periodically but that will make my runtime longer. I think this way is better. Running dir() which contacts windows periodically because it takes much less time than writing to a file. Thank you.- adschai----- Original Message -----From: Robert A LaBudde Date: Sunday, June 10, 2007 3:32 pmSubject: Re: [R] Windows vista's early terminate Rgui executionTo: R-help@stat.math.ethz.ch> At 03:28 PM 6/10/2007, adschai@optonline.net wrote:> >Hi,I have a frustrating problem from vista that I wonder if > anyone > >has come across the same problem. I wrote a script that > involves > >long computational time (although, during the calculation, it > spits > >out text on the gui to notify me the progress of the > calculation > >periodically). Windows vista always stopped my calculation and > >claimed that 'Rgui is stop-working. Windows is checking for > >solution.' And when I looked into task manager, windows alread!\n y > >stopped my Rgui process. I am quite disappointed with this. I > would > >really appreciate if anyone finds a solution to go around this > >windows vista problem? Particularly, how to turn off this > feature in > >vista? Any help would be really appreciated. Thank you!- adschai> > You probably need to contact Vista periodically so it knows you > are awake.> > Just include a line that does a call to Vista that doesn't do > output, such as> > useless <- dir()> > placed in some outer loop that satisfies the \"drop dead\" time > between calls.> > Alternatively, you can attempt to find out how to change the > registry > entry corresponding to the wait time and increase it to a value > you > can live with.> > ================================================================> Robert A. LaBudde, PhD, PAS, Dpl. ACAFS  e-mail: ral@lcfltd.com> Least Cost Formulations, Ltd.            URL: http://lcfltd.com/> 824 Timberlake Drive                     Tel: 757-467-0954> Virginia Beach, !\n VA 23464-3239            Fax: 757-467-2947> > \"Vere scire est per caus\nas scire\"> > ______________________________________________> R-help@stat.math.ethz.ch mailing list> https://stat.ethz.ch/mailman/listinfo/r-help> PLEASE do read the posting guide http://www.R-> project.org/posting-guide.html> and provide commented, minimal, self-contained, reproducible code.>\n\n\t[[alternative HTML version deleted]]\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}