{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 30, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESThompson To Take First Step Toward '08 Run\nFred Thompson, a former Tennessee senator and \"Law & Order\" actor, will take a step toward a formal presidential candidacy\n                        next week, several officials said. A \"testing the waters\" committee will allow him to begin raising money and hiring staff. More...Watch: Capitol Bob On Gore In '08\n• Bush Names New World Bank Chief• Man With Rare TB: I Sneaked Back Into U.S.\n                     \t\t\t\t\t| Watch• Aggressive Hunt For Brits Captured In Iraq\n                     \t\t\t\t\t| WatchU.S.\"Horrendous\" Scene As Mom Hangs Self, Kids\nAlejandra Estrada broke into her sister's trailer because she wanted to know why she hadn't shown up at work. Inside, she\n                        found Gilberta Estrada and Gilberta's four young daughters hanging in a closet from fabric nooses. Only the infant survived. More...Watch: Mom, Kids Found Hanging\n• American Al Qaeda Member Threatens Attack• Cruise Ship Jumper Now Faces Sex Charges• Man With Rare TB: I Sneaked Back Into U.S.\n                     \t\t\t\t\t| Watch• More StoriesWorldParents Of Missing U.K. Toddler Meet Pope\nThe parents of a 4-year-old British girl who disappeared weeks ago in Portugal have met Pope Benedict in St. Peter's Square.\n                        Kate and Gerry McCann say the greeting will \"sustain\" them in their search. They now plan a publicity tour of Europe.    More...Watch: Holding Out Hope For Madeleine\n• Aggressive Hunt For Brits Captured In Iraq\n                     \t\t\t\t\t| Watch• Chavez Threatens Last Opposition Network• The State Of The Surge\n                     \t\t\t\t\t| Watch• More StoriesPoliticsBush Names New World Bank Chief\nPresident Bush has selected former U.S. trade representative Robert Zoellick to be the next president of the World Bank. He\n                        would succeed Paul Wolfowitz, who resigned amid a controversy involving a pay raise he arranged for his girlfriend. More...\n• Thompson To Take First Step Toward '08 Run\n                     \t\t\t\t\t| Watch• Gore: Bush Leads \"Assault On Reason\"\n                     \t\t\t\t\t| Watch• Bush And Putin Plan Maine Summit• More StoriesHealthMan With Rare TB: I Sneaked Back Into U.S.\nA man placed under the first government-ordered quarantine since 1963 because of a dangerous form of tuberculosis took one\n                        trans-Atlantic flight for his wedding and honeymoon and another because he feared for his life, a newspaper reported. More...Watch: Do You Have TB?\n• Repairing The Ravages Of War Wounds\n                     \t\t\t\t\t| Watch• Outrage Over Organ Donor Reality Show• Big 3 Ponder Pawning Health Care On Unions• More StoriesSciTechSexy Photo Vaults Teen To Unwanted Fame\nA shot of star athlete Allison Stokke at a meet proliferated on the Web, much to her chagrin. On The Early Show,\n                        an expert offered tips to help parents keep their kids from meeting the same fate. More...Watch: Unwanted Web Celebrity\n• Whales May Be Heading Home\n                     \t\t\t\t\t| Watch• Microsoft Unveils Table-Shaped Computer• News Corp. Snaps Up Photobucket• More StoriesBusinessNews Corp. Snaps Up Photobucket\nMySpace's parent, News Corp.'s Fox Interactive Media, agreed to acquire Photobucket Inc. just weeks after a public spat in\n                        which MySpace partially blocked content from Photobucket. More...\n• The Five Best Gifts For Dads And Grads• Bush Names New World Bank Chief• Northwest Attendants Approve Pay Cuts• More StoriesEntertainmentRosie Shoe Shops On First Day Off\nIn a video posted on her Web site titled \"First Day Off,\" Rosie O'Donnell sits with her daughter in her lap and shoe shops\n                        online. More...\n• Larry Birkhead Sued By His Ex-Attorney\n                     \t\t\t\t\t| Watch• Lindsay Lohan Returns To Rehab\n                     \t\t\t\t\t| Watch• Barton Back To Work After Hospital Stay• More StoriesOpinionNew Hampshire, Join The Rest Of Us\nSpecial contributor Lloyd Garver notes that the ruggedly-individualistic New England state is the only one that doesn't\n                        require adults to wear seat belts.  More...\n• Failing Our Future Immigrants\n                     \t\t\t\t\t| Watch• No Alien Left Behind\n                     \t\t\t\t\t| Watch• Who's Pushing For Muslim Women's Rights?• More StoriesCBS NEWS BROADCASTSThe Early Show: Parenting: Sexy Photo Vaults Teen To Unwanted Fame\nA shot of star athlete Allison Stokke at a meet proliferated on the Web, much to her chagrin. On The Early Show,\n                        an expert offered tips to help parents keep their kids from meeting the same fate. More...Watch: Unwanted Web Celebrity\n• EARLY SHOW: Gore: Bush Leads \"Assault On Reason\"\n                     \t\t\t\t\t| Watch• EARLY SHOW: Kevin Costner Shows A Dark Side• EARLY SHOW: \"Fastest Golfer\" Hits 102 Balls In Minute\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nPrayers For Madeleine's ReturnCBS News RAW: Pope Benedict XVI comforted the parents of missing 4-year-old Madeleine McCann. They traveled to the\n                                    Vatican to meet him, asking for prayers and her safe return.\nTOP VIDEOS\nGore Blasts Bush\nHolding Out Hope For Madeleine\nKevin Costner Is 'Mr. Brooks'\nGrading No Child Left Behind \nOrgan Donor Show Under Fire\nRecord-Breaking Golf\nCapitol Bob On Gore In '08\nAsk The Potential New 'Jake'\nUnwanted Web Celebrity\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesScott Pelley follows a National Guard unit and their families for nearly two years. This Sunday, 7 p.m. ET/PT.48 Hou!\n rs Myste\nryDouble Feature:Beginning at 9 p.m., \"A Shot In The Dark,\" reported by Susan Spencer. Then at 10 p.m., Troy Roberts\n                           report is titled \"Secrets & Lies On Grapevine Lake.\"\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}