{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Graham Wideman <gwlist@grahamwideman.com>", "subject": "[R] Concepts question: environment, frame, search path", "body": "Folks:\n\nI'd appreciate if someone could straighten me out on a few concepts which \nare described a bit ambiguously in the docs.\n\n1.  data.frame:\n----------------\nRefan p84: 'A data frame is a list of variables of the same length with \nunique row names, given class \"data.frame\".'\n\nI probably don't need to point out how opaque that is!\n\nAnyhow, key question: Some places in the docs seem pretty firm that a \ndata.frame is basically a 2-D array with:\na) named rows and\nb) columns whose items within a column be of uniform data type.\n\nElsewhere, it seems like a data.frame can be a collection of arbitrary \nvariables.\n\n2. environment\n---------------\nRefman p122:  \"Environments consist of a frame, or collection of named \nobjects, and a pointer to an enclosing environment.\"\n\nIs the \"or\" here explaining parenthetically that a frame is a collection of \nnamed objects, or is separating too alternative structures for an \nenvironment?\n\nIf the former, does this imply that a frame can contain arbitrary variables?\n\nAnd \"pointer\"? Is that a type of thing in R?\n\n3.  R search path; attach()\n----------------------------\nThe R search path appears to hold the list of \"collections of data\" (my \nterm) that can be accessed by a users' commands. Refman p27 tells that \nsearch path can hold items that are data.frame, list, environment or R data \nfile (on disk).  Yet R-intro p28 describes attach() as taking a \"directory \nname\" argument.  What is the concept \"directory\" in this context?\n\n----------------------\n\nThanks,\n\nGraham\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}