{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] Congress Daily on possible partial fasttrack extension for Doha", "body": "Rangel: Dems Will Consider PTNA Extension For Doha Round\n\nApril 18, 2007\nMartin Vaughan\nNat. Journal's Congress Daily\n\n     House Ways and Means Chairman Rangel said Tuesday that Democrats\nwill consider granting a renewal of President Bush's trade negotiating\nauthority if that authority is limited to a possible global trade deal\nin the Doha round of negotiations.\n\n     But he implied that even that limited authority would have to be\nre-written to reflect Democratic priorities on issues such as access to\nmedicines and foreign investment.\n\n     \"We are prepared to give a restricted fast-track, limited to the\nDoha convention,\" Rangel said in response to a question after a speech\nat the National Press Club Tuesday.\n\n     He told reporters after the speech that he did not know how long a\nperiod would be required for such an extension, and that it is up to the\nadministration to ask for an extension, which it has not yet done.\n\n     Rangel said he continues to seek a bipartisan agreement with the\nadministration and Ways and Means ranking member Jim McCrery, R-La., on\nre-writing the terms of trade agreements in a number of areas. He said\nthe new terms would need to be agreed to even for a limited fast-track\nto take effect.\n\n     But Rangel said he did not know whether a deal on contentious labor\nissues would be a prerequisite for the fast-track extension, since labor\nprovisions are not part of the Doha negotiations.\n\n     He said Republican objections to the Democratic demand to\nincorporate International Labor Organization standards into bilateral\ntrade deals continue to stymie progress in those talks. \"It doesn't make\nany sense -- but that's what is holding it up,\" Rangel said.\n\n     Rangel said that objection came specifically from Senate Finance\nranking member Charles Grassley, R-Iowa, although he later clarified\nthat Grassley was not the only Republican raising the scenario that U.S.\nlabor laws could be subject to challenge if ILO standards are included.\n\"But he was the only one that I talked to in terms of trying to get his\nhelp on this, and I called the wrong guy,\" Rangel said.    By Martin Vaughan\n\n\n\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}