{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Steve Langasek <vorlon@debian.org>", "subject": "Re: Logo trademark license vs. copyright license", "body": "On Tue, Apr 24, 2007 at 04:43:26PM +0200, Michelle Konzack wrote:\n> Am 2007-04-18 03:39:58, schrieb Steve Langasek:\n> > Er, businesses selling t-shirts using the official debian logo is *not*\n> > permitted.  Currently, the manner in which this is being disallowed is\n> > suboptimal, but it's still not something that we *permit*.  (Perhaps what\n> > you're suggesting is that t-shirt manufacturers don't have to get permission\n> > because we have a mark in the field of computers/software, not in the field\n> > of clothing; but if what's being sold is Debian-related clothing, it's still\n> > the Debian mark that's being used, and it is infringement that we have\n> > standing to prevent.)\n\n> Now I am a little bit confused, since if Debian does not permit the use\n> of the Logo, why does some/many shops sell Coffe-Mugs and T-Shirts with\n> Debian Logo and phrases related to Debian?\n\nWhen I wrote \"the official Debian logo\", I was referring to the Debian\nOfficial Use Logo, not to the Debian Open Use Logo.\n\n> > Further, it's up to *Debian* to decide what uses of the logo reflect badly\n> > on it and consequently should be disallowed because we don't wish to be\n> > associated with them.  Your above statement includes an implicit value\n> > judgement about which sorts of activities Debian will or will not wish to be\n> > associated with, which may not be at all representative of the views of the\n> > project members at large.\n\n> Unfortunatly you can use Logos anzthing you like in Germany...\n\n> The is a Product called \"Dasch Ultra\" and it was transformed to \"Hash Ultra\"\n> :-)  , Henkel, the Manufacturer of this Soap has lost the juridical\n> procedure...  Even if the Graphical Logo was trademaked\n\nParody is not the same thing as copying a mark and using it to confuse the\nconsumer.  I'm not surprised at a ruling allowing parody of a mark, and I\ndon't draw any conclusion from this that \"you can use Logos any way you want\nin Germany.\"\n\n-- \nSteve Langasek                   Give me a lever long enough and a Free OS\nDebian Developer                   to set it on, and I can move the world.\nvorlon@debian.org                                   http://www.debian.org/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}