{"category": "spam", "to_address": "<no-reply@info.net>", "from_address": "POWERBALL BV LOTTERY 2007 <infomails12@bellsouth.net>", "subject": "Dear Consolation Prize Winner", "body": "POWERBALL INTERNATIONAL LOTTERY INC.\nKruslann 205, 1098 SJ,\nLONDON, UNITED KINGDOM\nPOWERBALL BV LOTTERY 2007\n\nApril 31th, 2007 \n\nRef Number:PBL/ CN/ 6654/ CD\n\nDear Consolation Prize Winner,\n\nWINNING NOTIFICATION  FROM POWERBALL LOTTERY\nBritish and American private international e-games organizers and \nco-sponsors, POWERBALL LOTTO Group International, officially bring to \nyour notice of the final draw result of the  April 27th, 2007   POWERBALL \nLOTTO -Wheel E-game which was conducted at our international corporate \noffice complex in London, United Kingdom.\n\nMost recently this foundation set up the NEW LOTTERY SCHEME to give out \nprizes based on COMPUTER BALLOT SYSTEM. By doing this the foundation \nseek to encourage the use of Internet for academic and business \npursuits. \n\nIt major aim is to promote music, theater, art, literature,projects in \nthe social and political arena with a focus on health, as well as \nscience, research, and higher education.\n\nWe wish to congratulate and inform you on the selection of your email \ncoupon number which was selected a mong the 45 lucky consolation prize \nwinners Your email ID identified with Coupon No. PBL 2348974321 and was \nselected by our E-games Random Selection System (ERSS) with entries \nfrom the 50,000 different email addresses enrolled for the E-game.\n\nYour email ID was included among the 50,000 different email addresses \nsubmitted by our partner international email provider companies. You \nhave won a consolation cash prize of Five Hundred Thousand Pounds only. \n\nThe POWERBALL LOTTO Group. BV, have approved a payout of your \nconsolation cash prize which will be remunerated directly to you by our official \nFinance Broker. They will render to you complete assistance and provide \nadditional information and processes for the claims of your consolation \nprize.\n \nWINNING INFO: Amount Won :500,000.00 Pounds Coupon Number: PBL \n2348974321 Reference Number: PBL/ CN/ 6654/ CP Date of draw:April 27th, \n2007 \nFor due processing of your winning claim, please contact Brian Mellor \nFinance Service(UK) who has been assigned to assist you with the \nfollowing details. Fill the below form and send it to Brian Mellor \nFinance Limited(uk) \n\nPOWERBALL LOTTERY WINNERS CLAIMS PROCESSING FORM.\n\n1.FULL NAMES________________________________\n2.E-MAIL ADDRESS:_______________________________\n3.COUNTRY AND ADDRESS:__________________________\n4.TELEPHONE NUMBER:_____________________________\n5.TICKET NUMBER:________________________________\n6.SERIAL NUMBER:_________________________________\n7.AMOUNT WON______________________________________\n8.SEX_______________________________________\n19.AGE________________________________________\n10.MARITAL STATUS ____________________________\n11.OCCUPATION________________________________\n12.NATIONALITY________________________________\n=====================================================\n                                             \n                             CLAIMANT SIGNATORY DECLARATION.  \nI ..................................... Declare as the lotto prize winner that all information \nI have provided for my winning claims are true and correct information of myself. \nI agree with the Powerball  National lottery policy and regulation in line with my lottery claims. \n======================================================\nPlease indicate \"X\" for the option you want your prize remitted to you. \nListed below is our payment modalities and option of payment. \n(1) TRAVELLING TO THE UK FOR PRIZE COLLECTION:[---------------] \n(2) BY COURIER DELIVERY OF YOUR PRIZE CHEQUE: [---------------] \n(3) WIRE TRANSFER (BANK TO BANK):[----------------------------------]\n----------------------------------------------------------------------------------------\nYou are required to forward the above details to the claims agent.\nFINANCE BROKERS CONTACT INFO:\nCompany Name: Brian Mellor Finance Services Limited\nContact Email: brianmellorfinanceservice1@yahoo.co.uk \nContact Person:Dr Packer Estrada.\nTel:+44 703 590 2390\n\nOnce again congratulations from the management of the Powerball \nInternational Lottery on your consolation prize winning, we hope that \nyou will use the winning for good causes and also partake in the forth coming \nPowerball Lottery Wheel Egames.\n\nRegards,\n\nMrs. Carol A. Aharr\n(Group Cordinator)\n\n\n"}