{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Shawna Washburn\" <nofdegeneratematterrod@degeneratematter.com>", "subject": "Shed weight now and enjoy the process", "body": "\nJoin the thousands of people who got slim\n\n\n\n\n\nAnatrim – The newest and most exciting product for weighty people available – As you could see on BBC\n\n\n\nDo you know superfluous body kilograms kill a plenty of people every year? We know that you hate the unsightly look of people like those and the social prejudice against them. \n\nMoreover, you got no will to withstand pressure of ruinous eating habits of yours. If this sounds familiar, then we got something for your consideration!\n\n\n\n\n\nIntroducing Anatrim, the recent product for the reduction of your body’s extra weight. The astonishing thing about Anatrim is it improves the quality of your life by repressing your feeling of hunger and giving you better cheer. Here you may read what people say about this product:\n\n\n\n\n\n\"It is outstanding! \n\n\nInstead of eating everything close at hand and watching TV constantly \n\n\nI became rather more interested in doing sport.\n\n\n\n\n\n\n Anatrim got me back on the right path.\n\n\n I have a great shape now and lots of men stare hard at me!\"\n\n\n\n\n\n\nLusia R., Chicago\n\n\n\n\n\n\n\"Passive weight losing was of no help to me. This terrible appetite would just rush in and spoil everything. \n\n\nOne day I heard about Anatrim in the media advertisement and I was really effected by the information.\n\n\n I had attempted using it, and my wife said to me I’m not more a weighty man now, 3 months later. \n\n\n28 pounds off and this is not a limit! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nSerge Smith, San Francisco\n\n\n\n\n\nAnatrim helps your mind to realize that you don't need that much food. It improves your mood, supplies you with energy, and attacks needless kilos. Especial thanks to its powerful comprehensive formula!!\n\n\n\nFind out more useful information about this excellent product now!\n\n\n\n"}