{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "1050a 6/19 Update: Atlantis undocks from station", "body": "\n\n\n\n\n1050a 6/19 Update: Atlantis undocks from station\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 77\nPosted: 10:45 AM, 6/19/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-74 (06/18/07): Critical computer test goes smoothly; station controlled by Russian thrusters\n   SR-75 (06/18/07): Shuttle crew bids station colleagues farewell; computers check out, but investigation continues\n   SR-76 (06/19/07): Shuttle undocking on tap\n   SR-77 (06/19/07): Atlantis undocks from space station\n\n=================================\n\n10:45 AM, 6/19/07, Update: Atlantis undocks from space station\n\nWith pilot Lee Archambault at the controls, the shuttle Atlantis undocked from the international space station today at 10:42 a.m. as the two spacecraft sailed high above New Guinea.\n\n\"Houston and ISS, from Atlantis, physical separation,\" radioed commander Rick Sturckow as the shuttle pulled away at a sedate tenth of a mile per hour.\n\n\"Thank you very much,\" called station commander Fyodor Yurchikhin, who followed naval tradition by ringing the ship's bell in the Destiny laboratory module. \"Atlantis departing.\"\n\n\"Thank you ISS,\" Sturckow radioed. \"Have a great remainder of your expedition 15. We'll see you back on planet Earth.\"\n\nJoining Archambault and Sturckow aboard Atlantis were flight engineer Steve Swanson, Patrick Forrester, Danny Olivas, Jim Reilly and Sunita Williams, who is returning to Earth after a record six months in space, the longest single flight by a female astronaut.\n\nShe was replaced by Clay Anderson, who hitched a ride to the station aboard Atlantis to join Yurchikhin and flight engineer Oleg Kotov.\n\n\"Godspeed, C.J.,\" Anderson radioed Sturckow as Atlantis pulled away. \"Thanks for everything.\"\n\nWorking from the aft flight deck, Archambault guided Atlantis straight away from the space station to a point directly in front of the lab complex before beginning a slow 360-degree fly-around to permit his crewmates to photograph the station and its new solar arrays.\n\n\"One of the big reasons we do this is so we can get good documentation, photo imagery of the space station as we leave it,\" Archambault said. \"At a minimum, we'll be backing out to approximately 400 feet. ... We'll do a 360-(degree trip) round the space station to get good photo imagery from all angles.\"\n\nAfter the fly-around is complete, the shuttle astronauts will take a break for lunch and then use the ship's robot around to pick up the orbiter boom sensor system, or OBSS, for a final set of nose cap and wing leading edge inspections.\n\n\"On flight day two, the scans are primarily looking for damage caused by the launch environment,\" said shuttle Flight Director Cathy Koerner. \"Here, what we're looking for are any micrometeoroid impacts that may have occurred while we were on orbit. And again, we're trying to ensure the integrity of the thermal protection system before entry day.\"\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}