{"category": "ham", "to_address": "Peter Dunn <dunn@usq.edu.au>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] Building package: What does this message about rcompgen\n imply?", "body": "We don't have any of the basic details the posting guide asks for!\n\nIf this is R 2.5.0, rcompgen is a recommended package and ought to be \ninstalled.  If it is not, then .check_Rd_refs cannot cross-check \nreferences against all the standard and recommended packages, and that \nlooks like the cause of the error.\n\nIf it is an earler version of R, the advice in the posting guide to update \napplies.  CRAN will be checking on 2.5.0 and later.\n\n\nOn Thu, 3 May 2007, Peter Dunn wrote:\n\n> Hi all\n>\n> I'm updating a package for submission to CRAN, and I am getting\n> an error message I never have seen before, and can't find out\n> what it implies or means (and hence, what I need to do to fix\n> it).\n>\n> After running R CMD check, I get this:\n>\n> \n> * checking foreign function calls ... OK\n> * checking R code for possible problems ... OK\n> * checking Rd files ... OK\n> * checking Rd cross-references ... WARNING\n> Error in .find.package(package, lib.loc) :\n>        there is no package called 'rcompgen'\n> Execution halted\n> * checking for missing documentation entries ... OK\n> * checking for code/documentation mismatches ... OK\n> * checking Rd \\usage sections ... OK\n> \n>\n>\n> I am informed: There is no package called 'rcompgen'.  True;\n> I never knew there was one, so I certainly never asked for\n> it to be loaded.  (I can search all the files in the package directory\n> and the string  rcompgen  never appears either, and nor does the\n> string  find.package.)  So somewhere, this package must be deemed\n> necessary to install.  (I have checked all dependencies too: none of\n> those packages need  rcompgen  either.)\n>\n> I can get this package from CRAN and install it of course, but I\n> don't think I need it.  (Not that I fully understand what it is for\n> or what it does...).  I'm sure it implies there is a problem in\n> my package, but i don't know what problem that is.\n>\n> So can anyone help me:  Why does R think I need package  rcompgen?\n> What error/mistake in my Rd files would invoke this?  Where should\n> I be looking, and what sort of problem might I be looking for?\n>\n> Thanks as always.\n>\n> P.\n>\n>\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}