{"category": "ham", "to_address": "Bjoern Jacke <bjoern@j3e.de>", "from_address": "James Peach <jpeach@samba.org>", "subject": "Re: setgroups problems on FreeBSD - proposed fix", "body": "On May 23, 2007, at 9:21 AM, Bjoern Jacke wrote:\n\n> Hi James,\n>\n> On Wed, May 23, 2007 at 08:35:46AM -0700, James Peach wrote:\n>> FWIW, Darwin does the same as FreeBSD ...\n>\n> maybe you can bring some light into the dark here: I did some tests  \n> with\n> Darwin (OS X with most recent patches) to see how it behaves with the\n> maximum number of supplementary groups. sysctl says ngroups max is 16\n> like on all *BSD systems.\n>\n> I saw that it is quite difficult to actually add any new groups on an\n> OS X client machine. I found that it is possible to add groups if you\n> download 50MB ServerAdminTools from Apple and connect to the  \n> \"localhost\"\n> server with the workgroup manager tool. This was the only way I found\n> out on OS X to add new groups, is there an easier way to create/manage\n> groups?\n\nI use dscl and dseditgroup, but the ServerAdmin tools are what you are  \nsupposed to use. I think that most users of desktop system don't have  \nmuch need to be adding groups :)\n\nhttp://developer.apple.com/documentation/Darwin/Reference/ManPages/man1/dscl.1.html\nhttp://developer.apple.com/documentation/Darwin/Reference/ManPages/man8/dseditgroup.8.html\n\n> Then I put myself into 17 newly created groups but \"id\" was saying  \n> that\n> I would only be in 15 groups (including the group which is reported\n> to be my primary group - but I don't know if OS X is actually making a\n> difference between primary and supplementary groups internally, does  \n> it?).\n\nThe kernel cred has an array of 16 groups and the first element is  \nyour primary gid. I don't know whether the kernel treats these any  \ndifferently when making authorisation decisions.\n\n> So on OS X it only seems to be possible to have 14 supplementary  \n> groups\n> at all. Is this by design?\n\nThe answer is both yes and no :)\n\nDarwin has true nested groups and users can be in an unlimited number  \nof groups. Unfortunately calling setgroups(2) disables this behaviour  \nand gives you 1 primary + 15 supplementary. This is for standards  \nconformance reasons.\n\nNow normally what happens is that the Directory Services guarantees to  \nanswer the question \"is user X a member of group Y\". It does not  \nprovide a method to enumerate all the groups a user is a member of,  \nand I don't know a way to do that. In this case, the supplementary  \ngroups list is best thought of as a group membership cache (though  \nthere are also other levels of caching involved). When the kernel  \nneeds to make an authorisation decision that might depend on the user  \nbeing a member of a specific group, it calls out to Directory Services  \nto check the user's group membership.\n\nhttp://developer.apple.com/documentation/Darwin/Reference/ManPages/man8/memberd.8.html\n\nSo every process gets on the memberd path by default. If you call  \nsetgroups or otherwise mess with your credential, you get kicked off  \nthe memberd path. getgroups(2) will simply not return your full group  \nlist if you have more than 16.\n\nIf you did through the Darwin mailing lists, there is probably a post  \nfrom Terry Lambert explaining this better than I can.\n\n--\nJames Peach | jpeach@samba.org\n\n"}