{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@speedy.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "supplant: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Monday, April 30, 2007\nsupplant \\suh-PLANT\\, transitive verb:\n1. To take the place of (another), especially through intrigue or underhanded tactics; as, a rival supplants another.\n2. To take the place of and serve as a substitute for.\nHe's your rival. The one you'll have to supplant. -- Peter Brooks, World Elsewhere\nIn traditional accounts, early Greek times appear as a succession of migrations; one tribe drives out and supplants another until driven out in turn by a third, and this process may have lasted many hundreds of years. -- Jacob Burckhardt, The Greeks and Greek Civilization\nEconomic opportunities for a saddler and harness maker were beginning to decline . . . as railroads supplanted the stagecoach trade. -- Dennis J. Hutchinson, The Man Who Once Was Whizzer White\nSupplant derives from Latin supplantare, \"to put one's foot under another, to throw down a person by tripping up his heels,\" from sub-, \"under\" + plantare, \"to stamp the ground with the foot,\" from planta, \"the sole of the foot.\"\nDictionary.com Entry and Pronunciation for supplant\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9478541-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}