{"category": "ham", "to_address": "Ip-health <ip-health@lists.essential.org>,\n   a2k discuss list <a2k@lists.essential.org>", "from_address": "James Love <james.love@keionline.org>", "subject": "[Ip-health] WSJ calls for compulsory license (or non-enforcement of exclusive rights) of Broadcom patents on cell phone chips", "body": "My blog entry on this case is here:\n\nhttp://www.keionline.org/index.php?option=com_jd-wp&Itemid=39&p=34\nITC allows some infringing Qualcom chips to be imported, bans others\n\nBelow is the WSJ editorial that calls upon Susan Schwab, head of\nUSTR, to overturn an injunction on importing infringing chips used in\ncell phones.   In this case, the WSJ sees the enforcement of the\nexclusive rights of the Broadcom patents as a very bad thing, for\ninnovation by U.S. firms that need the infringing chips in newer cell\nphones.\n\n\"Nobody, including Broadcom, actually makes competing chips in the\nU.S., so an import ban is tantamount to a total ban . . . anyone\nwho's shopped recently for a cell phone knows that the future arrives\nfast in that industry, with new models coming all the time. The ITC\nban is in effect a bar to innovation by these U.S. companies.\"\n\nJamie\n\nhttp://online.wsj.com/article/SB118134776605229702.html\n\nREVIEW & OUTLOOK\nPatent Bending\nJune 9, 2007; Page A8\n\nPaging U.S. Trade Representative Susan Schwab: Please call us on your\ncell phone. And better do it fast because cell phones may soon be\nharder to come by thanks to one of the dumber rulings ever by the\nU.S. International Trade Commission.\n\nBy a 4-2 vote on Thursday, the ITC decided to ban the import of any\nnew cell phone model produced with certain microchips made by\nQualcomm. ITC Chairman David Pearson dissented on grounds that the\nban was antithetical to the public good, which is certainly true. But\nthe import ban is effective immediately, and this means that\nPresident Bush, through Ms. Schwab, has just 60 days to set the\nruling aside before it becomes permanent. There's an overwhelming\ncase for doing so.\n\nBusinesses Battle Over Patent Laws\n\nThe ITC's power to ban foreign-made, patent-infringing products goes\nback to the infamous Smoot-Hawley Tariff of 1930 -- which ought to be\na hint that this is a bad idea. The fear was that American\nintellectual property would be stolen by foreign firms, which would\nuse U.S. patents to produce goods overseas without paying royalties\nand then ship those products to the U.S. The law was never intended\nto substitute for domestic patent-infringement suits in federal\ncourts between two American companies, which is the story here.\n\nThe patent holder in this instance is California-based Broadcom,\nwhich has sued Qualcomm for infringement. Broadcom owns several\npatents relevant to the production of certain cell phones sold by\nSprint, Verizon, Alltel, as well as T-Mobile and AT&T. In other\nwords, pretty much every large cell phone operator in the country\nsells at least some phones that contain the allegedly infringing chips.\n\nThe ITC tried to soften the blow of its ruling by grandfathering\nexisting models and applying the ban only to future models. This was\npresumably a nod to the extraordinary breadth of the ban: Nobody,\nincluding Broadcom, actually makes competing chips in the U.S., so an\nimport ban is tantamount to a total ban. However, anyone who's\nshopped recently for a cell phone knows that the future arrives fast\nin that industry, with new models coming all the time.\n\nThe ITC ban is in effect a bar to innovation by these U.S. companies\n-- a fact recognized both by Chairman Pearson in his dissent, and by\nthe administrative law judge who originally heard the case and\nrefused to issue a broad ban in October 2006. Moreover, Broadcom is\nalready suing Qualcomm in federal court over these very same patents.\nThere is thus no need for the ITC to muscle in, except to expand its\nown bureaucratic turf in the patent field. The ITC's separate process\nwas created only as a way to deal with patent infringers who were\nbeyond the reach of U.S. courts.\n\nThis case is part of a larger legal patent quagmire that now has\nCongress entering with its own reform proposals. Uh, oh. So far, the\nproposals are a jumble of good and bad ideas, and that's before the\nboys on Capitol Hill start mulching in earnest. Everyone from Big\nPharma to federal judges and small inventors is up in arms about\nsomething in the House and Senate twin bills. The only people not\nhowling seem to be the lawyers, who no doubt assume that any big\nreform will require years of litigation and millions of billable\nhours before anyone is sure what in the name of invention it really\nmeans.\n\nOur own sense is that the patent system needs two things above all:\nbetter patents and less litigation, and the two are related. The U.S.\nPatent Office needs to raise its standard of patent quality, so that\npatent-holders and potential licensees both know that any patent is\nlikely to be valid and upheld by the courts. Better patents also mean\nless costly litigation, because a patent that is both of high quality\nand clear purpose is much less likely to go to trial than one that is\ndubious, or too broad, or of uncertain application.\n\nBetter patents depend most of all on a Patent Office that gives its\nexaminers the right incentives -- which means rewarding them for\nissuing quality patents rather than disposing of patent cases. The\ncourts can help too, and recently they have been. Last month's\nSupreme Court decision in KSR v. Teleflex put down a marker on the\n\"obviousness\" of inventions that ought to be relevant to patent\nexaminers who are considering whether to grant an application.\n\nIf Congress really wants to help, it could start by refusing to let\ncompanies like Broadcom use the ITC as a legal backstop at the same\ntime they're suing in federal court. In the meantime, let's hope Ms.\nSchwab uses her power to overrule the ITC in this case and save\nAmerican cell phone companies and consumers from needless harm.\n\n------------------------------------\nJames Packard Love\nKnowledge Ecology International\njames.love@keionline.org\nWk +1.202.332.2670, US cell +1.202.361.3040, Geneva Cell +41.76.413.6584\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}