{"category": "ham", "to_address": "smiles@speedy.uwaterloo.ca", "from_address": "TopCoder Competitions <competitions@topcoder.com>", "subject": "TCO Round 1B", "body": "Hello sm1lies,\n\nUp next in the 2007 TopCoder(R) Open, sponsored by AOL(R) Algorithm Competition is Round 1B!  Join in to watch the action and chat with the contestants.  Round 1B takes place Tuesday, April 10, at 9:00 PM EDT (GMT/UTC -4).  \n\nSee what time it starts in your area: http://www.timeanddate.com/worldclock/fixedtime.html?month=4&day=10&year=2007&hour=21&min=0&sec=0&p1=98\n\n***********************************************************************\nWhere Intelligence Goes to Work\n\nAt the National Security Agency, we uncover foreign secrets and create ways to keep our own secrets safe. Our work makes a difference by making the world a safer place to live. And you can make a difference too.\n\nNSA has exciting career opportunities available in Computer/Electrical Engineering, Computer Science, Mathematics, Foreign Language, Intelligence Analysis, Cryptanalysis, and Signals Analysis. You'll enjoy an incredible benefits package, competitive pay, and the satisfaction of making the world a safer place.\n\nFor more information about the career opportunities available at NSA, apply here. U.S. citizenship is required. NSA is an Equal Opportunity Employer.\n\nhttp://www.topcoder.com/tc?module=Static&d1=tournaments&d2=tco07&d3=sponsorspatrons&d4=nsa\n***********************************************************************\n\nLogin to the applet to watch the next bit of action as Round 1B competitors get their game on. The next SRM is on Wednesday, April 18 at 11:00 AM EDT (UTC/GMT -4) - don't forget!  \n\nBest of luck to you in the Arena!\n\n- The TopCoder Competitions Team\n\n===================================================================\nYou have received this email because you indicated in your TopCoder profile that you want to be notified of TopCoder competitions.  If you no longer wish to receive these emails, log in to www.topcoder.com/tc and click on 'Update My Profile'.  In the 'Email Notification' section of your TopCoder profile, you have the option to enable or disable receipt of various types of TopCoder emails.  Be sure to save any changes to your member profile.\n\nwww.topcoder.com \nTopCoder, Inc.\n703 Hebron Avenue\nGlastonbury, CT 06033\nPhone: 1-866-867-2633\n\n\n"}