{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Gregory Nowak <greg@romuald.net.eu.org>", "subject": "Re: Software speech opinions", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nI personally feel, and I don't think I'm alone, that the rnd cost\nrecovery excuse goes only so far. True, rnd costs might have been an\nissue in the beginning, along with the size of the market the products\nare aimed at, but let's take for example the screen reader\nmanufacturers for the other popular os. With the kinds of prices they\ncharge, and given the large amount of sails they've most likely made\nover their product's lifetime, I would have thought they've recovered\ntheir rnd costs long, long ago, and then some. No, I think that what's\ndriving prices of A.T. for the most part these days is pure and simple\ngreed, not to mention that these companies' biggest customer is the\nU.S. government, and that it has deep pockets to boot, from the\nperspective of the companies.\n\nGreg\n\n\n\nOn Sun, Jun 24, 2007 at 07:58:43PM +0100, Gaijin wrote:\n>      I can understand that.  We're such a small market that it's \n> necessary to charge so much to recoup the expense of making the stuff. \n> It's relativity.  For every action, there's an equal and opposite \n> reaction, and someone is gonna starve.  That's why I feel like Linux is \n> so special.  People freely offer what we now have, without really \n> depriving little Cindy of what's on her dinner plate.  Money doesn't \n> even enter the picture.\n> \n>          Michael\n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n- -- \nweb site: http://www.romuald.net.eu.org\ngpg public key: http://www.romuald.net.eu.org/pubkey.asc\nskype: gregn1\n(authorization required, add me to your contacts list first)\n\n- --\nFree domains: http://www.eu.org/ or mail dns-manager@EU.org\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGfzOL7s9z/XlyUyARAklZAJ9vS+K7Si62iGATtamZBl0DhtdXUwCeP17E\nUBhj3h0aoqYObOeRdjTYkIs=\n=nVqI\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}