{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "Jonathan Yavner <jyavner@member.fsf.org>", "subject": "Re: Etch on a Thinkpad T23", "body": "> Well, I for one would be interested if I had a T22.\n\nWhere would you look for such a product?  How would a seller of such a \nproduct find you without offending you with his crass commercialism?\n\n\n> I have 600E that runs etch flawlessly except for the sound system and\n> modem (which never work under linux on any laptop in my experience)\n\nI haven't tried etch on my 600E, but to make sound work under Fedora \nCore 2 I had to put these in /etc/modprobe.conf:\n    alias snd-slot-0 snd-cs4236\n    alias snd-card-0 snd-cs4236\n    options snd-cs4236 port=0x530 irq=5 dma1=1 dma2=0 mpu_port=0x330 \nmpu_irq=7 cport=0x538 fm_port=0x388 isapnp=0\n\nI haven't bothered with the modem, but ThinkWiki says there is a driver:\n    http://www.thinkwiki.org/wiki/MWave_MDSP3780\n\n\n> if someone had a DVD that would solve any or all of  those problems, I\n> would be very keen:  I simply cannot afford a couple of days per\n> issue, which is what it usually takes even with a good\n> ADSL connection.\n\nI'm underemployed right now and can afford to spend some time to create \nsuch a disk for Etch on a 600E, but I'd like to get several hundred \ndollars for such work, which means I would need to find a bunch of  \ncustomers to share the cost.  The 600E is so old now that I doubt I \ncould find enough buyers to make it worthwhile.  Also, my 600E is \nfailing (which is why I bought the T23).  Only one of the RAM slots is \nstill working--Fedora runs poorly with only 96 MB!\n\nWould you be willing to take a \"dumb installer\" that erases your hard \ndrive and installs a tuned copy of Etch?  That would require backing up \nall your personal data beforehand and restoring after.  Also, the 600E \nusually shipped with a CD-ROM drive, not DVD-ROM, which is too small \nfor even the basic set of packages, so some disk-swapping would be \nneeded.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-laptop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}