{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tFRIDAY 4 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM KIRSTY WARK\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tTonight's the night when, barring any more problems north of the border (and lets face it Scotland's natural disposition is to cause problems!) the political picture of Britain will finally become clear.  On our special hour long edition of Newsnight we'll have the very latest results and analysis of how it all changes the way we'll be governed, and the impact the results will have on Zombie Brown's grand plans for leadership. \n\n\nMichael Crick will be in the studio with me, along with senior figures from each of the parties.  The biggest upset of the night may yet be the scandal over the way the vote in Scotland was conducted - both the estimated 100,000 ballot papers spoiled by people confused about the voting system and the computer failure which has held up the vote and may have rejected ballot papers.  An official inquiry has just been announced.  \n\n\nGavin will be live from Edinburgh where any one of the possible final results is going to cause fireworks, after Labour's worst result in half a century. The prospect of Prime Minister Brown and First Minister Salmond, is one which the former abhors and the latter relishes. In Wales, Labour may be forced into coalition. \n\n\nIn England, the results that affect the majority of the UK, the complexion of many councils has changed as Labour has lost one after another.  Tony Blair says the results are a \"springboard\" for a Labour victory in the next general election, but could the Conservative's showing at the local elections be enough to catapult Cameron towards Downing Street - or is this as good as it gets for him? And what about The Liberal Democrats - to continue the momentum analogies - is Menzies Campbell on the Big Dipper after last night's dramatic plunge in the polls? \n\n\nWe'll be asking whether the Iraq war was the main reason Labour took such a drubbing, and speaking to the man who wants to challenge Zombie Brown for Number 10, Michael Meacher.  \n\n\nTonight's the night for reconvening our wise and witty panel - Danny Finkelstein, Peter Hyman, and Olly Grender, to give the whole thing a bit of a spin.  \n\n\nReview is resting but will be back with a bang next Friday.\n\n\nSee you tonight. \n\n\nKirsty. \n\n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nPAISLEY PREPARES FOR OFFICE\n\n\t\t\t\t\t\t\tDr Ian Paisley is about to share office with his Republican enemies\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}