{"category": "ham", "to_address": "\"Bruno Costacurta\" <pubmb01@skynet.be>", "from_address": "ajdlinux@gmail.com", "subject": "Re: Copyright verification needed", "body": "On 6/24/07, Bruno Costacurta  wrote:\n> Many thanks for your attention.\n> I checked more closely the licenses related to OpenSSl and Trolltech\n> which I found within related Debian packages I install to build my own\n> package\n> (please find both licenses attached).\n> My personal feeling is that they looks fine.\n>\n> Maybe I should simply complete my first copyright file by adding licenses\n> from\n> OpenSSL and Trolltech (I repeat: both present in their respective Debian\n> packages) ?\n> I suppose I can rely on the fact that because such licenses are already\n> present in other debian packages I can build my own with same licenses.\n> Correct ?\n\nThe Trolltech license is still a problem, since it's GPL, and OpenSSL\ncannot be linked to a GPL program (quoting from\nhttp://www.fsf.org/licensing/licenses/index_html#GPLIncompatibleLicenses):\n\n\"\"\"\nThe license of OpenSSL is a conjunction of two licenses, one of them\nbeing the license of SSLeay. You must follow both. The combination\nresults in a copyleft free software license that is incompatible with\nthe GNU GPL. It also has an advertising clause like the original BSD\nlicense and the Apache license.\nWe recommend using GNUTLS instead of OpenSSL in software you write.\nHowever, there is no reason not to use OpenSSL and applications that\nwork with OpenSSL.\n\"\"\"\n\nIt is incompatible because there is an advertising clause and a\nname-change clause, both of which make it impossible to link to a GPL\nprogram.\n\nI think you'd need to do one of the following:\n   * not use OpenSSL\n   * convert the OpenSSL code to use GNUTLS\n   * or get a GPL exemption from Trolltech, which you most likely\nwon't be able to.\n\nCan another d-l regular confirm?\n-- \nAndrew Donnellan <><\najdlinuxATgmailDOTcom (primary)    ajdlinuxATexemailDOTcomDOTau (secure)\n     http://andrewdonnellan.com    http://ajdlinux.wordpress.com\n         ajdlinux@jabber.org.au    hkp://subkeys.pgp.net 0x5D4C0C58\n            http://linux.org.au    http://debian.org\n        Spammers only === ajdspambucket@exemail.com.au ===\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}