{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTHURSDAY 7 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM KIRSTY WARK\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nCONSTITUTIONAL CRISIS?\n\n\nAlex Salmond threw down the gauntlet to the Parliament at Westminster today. In a dramatic statement to the Scottish Parliament the new SNP First Minister claimed that Tony Blair has done a deal with Colonel Gaddafi that would allow the return of the Lockerbie bomber to Libya and in effect violate the independence of Holyrood. \n\n\nIs he right or are the nationalists deliberately using their new political powers to stir the pot? \n\n\nG8\n\n\nThe G8 summit is on the move - politically speaking. There appears to be real progress on climate change with the US agreeing to consider a 50% cut in carbon emissions by 2050 and to participate in a UN lead initiative. Stephanie Flanders is there.\n\n\nBAE\n\n\nLast night Panorama claimed Britain's biggest arms company, BAE systems secretly paid hundreds of millions of pounds to Prince Bandar, a member of the Saudi royal family. This was supposedly remuneration for smoothing through a $40 billion arms deal.\n\n\nTonight we investigate Prince Bandar. We also look into US attempts at possible action against BAE and the implications that could have here.\n\n\nISLAMIC ART\n\n\nAnd Islamic Art as a diplomatic tool. Madaleine Holt reports from the Venice Biennale on how Islamic Art from Lebanon, Syria and Turkey is designed to bring different cultures closer together. \n\n\nSee you at ten thirty.\n\n\nKirsty\n\n\nb>Missed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nIRAQ DAMAGING SOLDIER MORALE\n\n\t\t\t\t\t\t\tMark Urban reports on how the Iraq conflict appears to be eroding the morale of some British soldiers\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}