{"category": "ham", "to_address": "ctcfield@citizenstrade.org, ip-health@lists.essential.org", "from_address": "Ellen Shaffer <ershaffer@cpath.org>", "subject": "[Ip-health] CPATH: KORUS & meds, tobacco, health care", "body": "--\n[ Picked text/plain from multipart/alternative ]\n\n>Date: Thu, 28 Jun 2007 09:05:52 -0700\n>From: Ellen Shaffer \n>\n>The National Health Insurance Corporation of South Korea invited\n>CPATH Co-Directors Ellen Shaffer and Joe Brenner to visit early in\n>June and discuss our views on KORUS FTA's implications for access to\n>affordable drugs, tobacco control and the encroachment of\n>privatized, for- profit health care.  We found health advocates\n>deeply concerned that KORUS will send the health care system veering\n>off in just the wrong direction at just the wrong time.\n>\n>Although U.S. trade officials are attempting to ease threats to\n>affordable drugs in poor countries like Peru, they have contended\n>that in thriving economies like Korea's the market for medicines is\n>fair game.  CPATH counters that trade agreements should not\n>jeopardize public health, and rather should remedy the serious\n>problems of many in advanced economies like Korea and the U.S. who\n>can't afford life-saving medicines.\n>\n>Story and photos online at:\n>\n>http://www.cpath.org/id29.html\n>\n>Ellen R. Shaffer, PhD MPH, Co-Director\n>Center for Policy Analysis on Trade and Health (CPATH)\n>98 Seal Rock Drive\n>San Francisco, CA 94121-1437\n>\n>phone: 415-933-6204\n>email: ershaffer@cpath.org\n>mobile: 415-680-4603\n>www.cpath.org\n>fax: 415-831-4091 ---\n>The Globalization and Health list is a discussion group, an\n>information source, and an organizing tool for people concerned\n>about the impact of economic globalization on health. The list is\n>managed by CPATH, the Center for Policy Analysis on Trade and\n>Health, an independent research and advocacy group. www.cpath.org\n>\n>To post a message, send an email to G-H@list.cpath.org\n>\n>To unsubscribe via email, send a blank email to\n>leave-g-h-1061823P@list.cpath.org\n>\n>To subscribe via email send a blank email to join-G-H@list.cpath.org\n>\n>To subscribe, unsubscribe or view archived messages, visit the list\n>web site at \n--\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}