{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Latoya Monroe\" <mawchegwiddenfarmfig@chegwiddenfarm.com>", "subject": "Obesity is dangerous, stop it", "body": "\nShed weight now and enjoy the process\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most enchanting product for over-weight people is made available now – As you could see on CNN.\n\n\nCan you recall all the situations when you told yourself you would do any thing to get rid of this desperately growing number of kilos? Luckily, now no major price is to be paid. With Anatrim, the ground-shaking kilos-melting mixture, you can get healthier lifestyle and a really slender figure. Have a look at what our customers write!\n\n\n\n\"I hate to acknowledge it but I was an awful food addict. \n\n\nI greedily swallowed up all this rubbish \n\n\nand could not stop. \n\n\n\n\nThis suffering stopped after I started course with Anatrim! \n\n\nOh, God,\n\n\n\n\n my craving for food abated, \n\n\nspirits increased and I’m the happiest person in the world 28 pounds in 2.3 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nMaria H., Chicago\n\n\n\n\n\n\"Since the very childhood I was a weighty boy. \n\n\nYou can't imagine how I hated being derided at school. \n\n\n\n\nI hated my stoutness and I hated even myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nIt literally pulled me out of this terrible nightmare! The greatest respect to you, fellows.\"\n\n\n\n\n\nRikky Martin, Washington\n\n\n\n\n\n\"Know what? My marriage was saved thanks to Anatrim! I fell down into this circle, depression – more eating – just more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOnce one of my friends pointed at your site and I called for my pack of Anatrim right away. \n\n\nThe final result was excellent, my appetite came to admissible level, I was often in good spirits, and, of course, I went some belt holes back. And you know, the bedroom became cool also!\"\n\n\n\n\n\nBob\n\n\n\n\n There is a lot of sincere gratitudes left by happy people taking Anatrim. Don’t you wanna add yourself to the thousands and thousands of slender men and women and try this natural appetite-reducing power boosting product now!\n\n\nDo not lose the chance!\n\n\n\n\n"}