{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle Zombie<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, someone born on August 8th, 1972 will experience incredible luck in 2007...", "body": "\n\nGood Luck Kit\n\n\n\n\n\n\n\n\n\n\n   \n\nMy friend, a gathering of luck in your chart will make 2007 the luckiest year ever for you... if you know how to attract and use it!\n    Memo, ever since we started working together almost 2 months ago I began to see with just a little more luck, your life could take a dramatic turn for the better and bring you the kinds of things you have always wanted and dreamed about.    And yesterday, when I was going over some charts, I saw an incredible gathering of good fortune starting on  June 8th, 2007.\n    Additionally, knowing you for almost 2 months, I understand how Leos can be somewhat skeptical and have a tendency to put things off, so I knew I had to show you why you should use this opportunity and make sure you act quickly, so you would not let it slip through your fingers, only to regret it later.    And this is exactly why I'm writing.\n    I know someone who is an expert in the field of magic and he has an incredible kit with truly magical items that can draw and magnify this luck and good fortune to you. What's more, he's someone who completely understands the mind and character of  Leos so you should really benefit from his knowledge.\n    This remarkable man's name is Bernard, and his knowledge of how to get the most out of these circumstances is unparalleled. If you're at all skeptical, put it aside for a bit and you will be more than pleasantly surprised.\n\n\n    All I'm asking is that you listen to what he has to say. If nothing else, it will be extremely insightful and informative. But if I'm only 10% right about this, it will be the most rewarding thing you ever did for yourself.    Just remember, time is of the essence. You need to get ready for June 8th, 2007 immediately.\n    Thank you and good luck,\n     P.S. Memo, just remember, if you make the right choice now, this luck will positively affect everything you do in the future. \n    \nDear Memo,    Rochelle, who I'm sure you know by now is a very dear friend of mine, wanted me to tell you about a kit I have developed to attract luck to people. \n    So now I will try to explain how you could benefit from this kit, what is in it, and how you can use it to access the great good fortune that will be surrounding you to get what you really want out of life.\n    First I should point out, this kit contains secret rituals and magical tools only the most privileged have used for centuries to attract and direct similar good luck and positive influences, so they could obtain even more wealth, health, power for themselves.\n    I call this collection of magical things my \"Good Luck Kit\". You'll call it the best thing that ever happened to you, if you're like any of the other people who were fortunate to get their hands on one. \n    I also want you to know that I have worked with other Leos, and it would be my pleasure to show you how to take maximum advantage of the opportunity you've been given. In fact, nothing would make me feel better than to see you break through your current situation, so you can experience the realization of some if not all of your dreams.     Also, because you are a friend of a dear friend I have some special surprises for you...\n\n\n\n\n\n\n\nSo let's start with FREE Gift Number 1!\n    A magical \"Radiant Sun\" candle holder\n    The sun is the most powerful symbol of renewal, rebirth and growth. It is also the most crucial element for the creation of life itself. This is why I want you to light the candles in this sacred vessel to create new luck, well-being and prosperity for yourself and your family and also to maintain and sustain the great good luck about to gather around you on June 8th, 2007.\n    More importantly, you are to use this candleholder, and only this candleholder to burn the special purple candle you will receive in your kit, which I will tell you about in a minute. \n    Memo, this really is a turning point in your life. If you use the good fortune surrounding you in the weeks and months ahead wisely, you could build the kind of solid foundation of wealth, health and happiness you have always wanted. \n    This is why I think you would sleep better knowing you had not only this amazing candleholder, but one of my \"Good Luck\" kits as well. So now let me tell you about this amazing kit and what it can do for you...\nYOUR \"GOOD LUCK \" KIT \n\n    As I previously mentioned, secret rituals and magical tools are used by the privileged and have been for hundreds of years to help them change and dramatically improve their lives. These tools made it easy for them to attract the kind of luck we all know has the power to bring wealth, love and good health. It is this kind of luck that prompted people to say, \"I would rather be lucky than good.\"\n    But don't take my word for this, just think about all of the people you have ever heard of who became rich, famous or both, and you can't deny that luck played a really big factor in all of their lives.     This is why your \"Good Luck\" kit was designed to enable you to tap into the kind of luck and good fortune that will be there for you in the upcoming year.\n    Not to boast, but I am a real expert in the field of Magic, that's why Rochelle asked me to get involved. I have collected the items in this kit from around the world, after doing much research and testing. \n    What's more, I've included your second FREE Gift, so you can use each magical tool within 5 minutes of receiving it, so you can become an instant expert and benefit immediately from these incredible tools. Now let me tell you about your...\n\n\n\n\n\n\nFREE Gift Number 2\n\n    The \"Good Luck is Yours\" booklet which explains the four power symbols so you will know exactly how they work to attract luck. More importantly, it describes how to use the simple ceremonies which employ the other items included in your kit to charge and empower these symbols so they attract exactly the kind of luck you need for almost any situation, be it becoming wealthy, finding love or feeling better. \nNow let me tell you about all the wonderful things you'll receive in your \"Good Luck\" Kit:\n\n\n\n\n\n A Perfectly Aligned Quartz Crystal (To bring you health) \n    Your Crystal's atomic structure is absolutely perfectly aligned, which is why they have been used for centuries to balance, transform and align the vital life forces found in our bodies. This perfectly aligned energy also creates a perfect lattice that attracts positive energy to it. \n    This property gives your Crystal the ability to create well-being, promote healing and to purify the energy surrounding you. \n    In fact, its power to instill order is why these special Quartz Crystals are used in the most accurate clocks and watches, where their ability to return to a stable state after being disturbed by an electric current is unmatched by any other element. This is surely the reason pure Quartz Crystals have been worn by kings, queens, shamans and metaphysicians since the beginning of time, as protection against ill fortune, malaise and bad luck.\n\n\n\n An Antique Chinese Coin (To bring you wealth)\n    These special Chinese Coins have been used for thousands of years to bring to their owners a never- ending source of income.     The round shape represents the heavens, and the square in the middle represents the earth-- symbolizing (and making possible) riches pouring down from the heavens to the owner (on earth) of this coin.\n    This is why these I Ching Coins have been used for centuries as amulets to ward off evil and attract good fortune and wealth.     This ancient coin has been \"energized\" for you to maximize its power. Better yet, I will tell you how to use it to get the most benefit.\n\n\n\n 2 Rosebuds (To bring love and romance into your life)\n   Probably the oldest symbol of all, which is why ancient literature abounds with references to roses being used for medicinal purposes and speaks of their use for feeding the body, the soul and the spirit and how they were used effectively in love potions.\n   The most famous example of their use certainly is Cleopatra having her living quarters filled with rose petals, so Marc Anthony would be reminded of her every time he smelt or saw a rose thereafter.    I will tell you how to \"charge\" these two special rose buds so they bring you the kind of love and romance you seek.\n\n\n\n A Seashell (To protect you from harm and negative energy)\n    Seashells are such powerful symbols of protection that they have been mentioned in mythology for ages. They were worn by the Greek god Hephaestus, the Goddess Amathauna, as well as the Roman Goddess Venus. (Can you imagine how powerful these shells must be if these powerful Gods and Goddesses used them as protection?)\n    I will also show you how to empower your shell, so you can use it to protect yourself from almost everything. \n\n\n\n A Magical Purple Candle (To be used when you want to charge and empower the other tools)\n    This warm and potent color gives your candle the power to \"energize\" the other magical tools in your kit. This energy will increase your tools ability to attract good fortune as well. \n\n\n\n A Special Energy Magnifying Bell (To increase your personal power and your tools' power)\n    The sound of this bell creates a powerful force called, Chi energy.     Just as a cheering crowd increases the energy level of an individual or team so they can become more powerful and effective, so can this bell, with its \"Chi\" energy, increase your own personal power and effectiveness as well as the power and effectiveness of the other tools in your \"Good Luck\" kit.\n\n\n\n A Magical Purple Velvet Pouch\n   Traditionally the fabric of kings, queens and others of high status, your Purple Velvet Pouch shouts opulence and magical power. In the world of magic, purple velvet is used to enhance personal powers and success. \n   More importantly, pouches like this have been used for thousands of years to attract helpful spirits and magnify and protect magical power. These special characteristics will provide the perfect sanctuary for all of the magical tools in your \"Good Luck\" kit.    (Please make sure you place each tool back in this magical bag after you use them to energize and protect their power and purity.)\n    As I hope you can see, your \"Good Luck\" kit is loaded with special tools you as a Leo can easily use every day to attract and multiply the good luck and fantastic opportunities that are now gathering around you.\n\n\n\n\n\n\nBut there's still more!\nFREE Gift Number 3... A tube of Sandalwood Incense (To be burned to magnify the power of the other magical tools)\n    Sandalwood incense has been, and still is, used as a part of ancient systems of healing. It is also highly effective at banishing negativity, strengthening spiritual and psychic powers, and magnifying the powers of other magical tools, which will all be important to you in the weeks and months ahead.)\n    And remember you will also be getting an easy-to-use instruction guide to take you through how to use every item in the \"Good Luck\" kit. You'll never have to wonder if you \"did it right\" because I will be guiding you every step of the way!\n    But as Rochelle has told you: time is of the essence. To make sure that you are fully prepared to receive all the good fortune in your chart, you must act quickly.\nA 50% Savings...\n    You placed your trust in Rochelle, and since she put her trust in me and asked me to help, I will make this kit up for you for only $19.95. (Similar kits can go for $40, $50 or even $60 or more! That's a savings to you of at least $20.00!)\nPlus...You Have My and Rochelle's Immediate Unconditional Money-Back Guarantee\n    Please examine and test your \"Good Luck\" kit completely at our Risk!\n    Take a month, two months or up to one year -- 365 days -- to try out your \"Good Luck\" kit. If you are not 110% satisfied with it, or if you feel it didn't attract the luck and good fortune I said it would, or even if you just change your mind, just return your kit to either myself or Rochelle and I will make sure you get a complete refund, including the cost of shipping and handling...immediately.\n    Not to brag or boast, but only an expert like myself would ever put together such a powerful collection of tools that have the power to attract the kind of good fortune that is now in the stars for Leos. This is the kind of good fortune that can change your destiny, I might add.\n    On top of that, these kits are not available in stores, which is one of the reasons Rochelle contacted me and I contacted you. The other reason is...they work!    Please see what they can do for you...since you have nothing to lose and everything to gain.\n         Sincerely,                     \n          Bernard C. Bieler de Buhem\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, \nsimply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400.\n\n"}