{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] UPI -  Is PhRMA swimming against IP tide?", "body": "http://www.upi.com/Health_Business/Analysis/2007/05/23/analysis_pharma_swimming_against_ip_tide/8748/\n\nAnalysis: Pharma swimming against IP tide?\n\nBy OLGA PIERCE\nUPI Health Business Correspondent\n\nWASHINGTON, May 23 (UPI) -- In an effort to head off a potential\nworldwide flood of so-called compulsory drug licenses -- where foreign\ncountries skirt intellectual-property laws and make generic versions of\na patented drug -- the head of the U.S. pharmaceutical manufacturers'\ntrade group met with Thai officials this week, but activists say those\nefforts might not prove successful.\n\n\"It's not just what Thailand is doing,\" said Billy Tauzin, CEO of the\nPharmaceutical Research and Manufacturers of America, a lobbying group\nthat represents U.S. drug makers.\n\n\"The example set by the Thais is very important,\" Tauzin told reporters\nafter the meeting with Thai Health Minister Mongkol na Songkhla, where\nhe said he urged the government to return to negotiations with drug\nmanufacturers.\n\nWorld Trade Organization rules allow countries to issue a compulsory\nlicense overriding intellectual-property rights when they need drugs to\ncombat a public-health emergency. The license allows the country to\nmanufacture its own generic version of a drug while making a small\nroyalty payment to the drug company that holds the drug's patent.\n\nThe Thai government has taken advantage of the compulsory license\nprovision several times in the past year, issuing compulsory licenses\nfor the AIDS treatments Kaletra and Sustiva, saying it could not afford\nto provide treatment to the roughly 500,000 Thais with HIV at the prices\nthe manufacturers want to charge.\n\nPushing the definition of \"public health emergency,\" the government then\nissued a license for the blood thinner Plavix, and earlier this month\nthe Health Ministry said it will issue compulsory licenses for cancer drugs.\n\nUse of compulsory licenses could spread far beyond the borders of\nThailand. Brazil recently issued its own compulsory license for Sustiva,\nand other countries appear poised to follow suit.\n\nTo prevent a worldwide explosion of the licenses, the pharmaceutical\nmanufacturers' association is fighting back, Tauzin told United Press\nInternational. In addition to meetings with officials in developing\ncountries, the group is urging the U.S. government to consider pushing\nback at the Thai government by taking away preferential trade status or\nfiling a complaint with the World Trade Organization, a reversal of the\ncurrent official position that the Thai licenses are in accordance with\ninternational law.\n\n\"We can and will continue to have discussions with our own government\nand officials around the world to promote intellectual property\nprotection,\" he said.\n\nDrug manufacturers also hope their support of charity programs in the\nUnited States and the developing world will encourage countries to\nnegotiate, instead of issuing compulsory licenses, Tauzin added.\n\nBut those efforts may not be enough to outweigh the pressures countries\nface to expand access to AIDS treatment.\n\nLegally, countries are well within their rights to issue the licenses,\nand economically they have a tremendous incentive to do so, said Shamnad\nBasheer, a visiting professor of intellectual-property law at George\nWashington University.\n\n\"A lot of countries are going to see this as an enormous opportunity,\"\nBasheer told UPI.\n\nCountries like Thailand are such a small part of the global market for\nthe drugs that their licenses are unlikely to cost countries in the form\nof less research and development as drug manufacturers have alleged, he\nsaid, but the countries have a lot to gain by making cheaper drugs to\ntreat their AIDS populations.\n\nBecause those forces are strong, drug makers would have more success\nchanging the way they sell drugs than trying to legally or politically\npressure developing countries, Basheer said. \"There's a problem with how\nthey are selling in the global market, and they need to look at it and\nchange it.\n\n\"They need to think of innovative ways of changing their business model,\nof changing their pricing.\n\nMany advocates of the compulsory licenses are defiant in the face of\ndrug company admonitions.\n\n\"The bottom line here is that compulsory licenses are a right that every\nnation has and no amount of propaganda from (drug companies) is going to\nchange that,\" Michael Weinstein, president of the AIDS Healthcare\nFoundation, told UPI.\n\n\"Thailand is doing the right thing and the (pharmaceutical\nmanufacturers' association) is trying to demonize them and it won't\nwork,\" Weinstein said.\n\n\"If you want to take a stand on intellectual property (covering)\nsunglasses, that's one thing. But you can't do it over lifesaving\nmedication.\"\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}