{"category": "ham", "to_address": "B.Baker@neu.edu", "from_address": "B.Baker@neu.edu", "subject": "[Ip-health] Merck lowers price on efavirenz to meet generic price", "body": "Merck has verbally offered to meet the generic price for efavirenz, plus 5%\n(equivalent to a royalty), and in addition has offered access to a\npediatric formulation and assistance in diagnosing HIV+ children.\n\nIn doing so, Merck is making a shrewd calculation that staying ahead of\ngeneric prices on second-line medicines is the best way to go to forestal\ngeneric competition.  For this strategy to work, however, Merck will also\nneed to respond to Brazil's compulsory license, which will be harder for\nMerck because Brazil has a lower prevalence than Thailand and a richer\neconomy.  Since Merck's access policies for middle-income countries has\nbeen based in part on prevalence, it may have to totally rework its\nmid-tier pricing to offer Brazil the same price as Thailand.\n\nOn one hand, if confirmed, this price reduction is a victory for Thailand's\ncompulsory licensing initiative and for AIDS activists.  Once again, we\nhave proven that generic competition results in lower prices and increased\naccess.\n\nHowever, on the other hand, Big Pharma will continue to have the upper-hand\nover the long term if its price-matching strategy discourages generic\nproducers from developing generic equivalents.  To the extent that\ndeveloping countries like Thailand do not actually continue to purchase\ngeneric products, even when price match offers are made by patent holders,\ngeneric companies may be unwilling to invest in product development,\ncompulsory license applications, and product registration.\n\nTo counteract this risk, Thailand should not revoke its compulsory license\non efavirenz.  Instead, it should continue to procure at least part of its\nrequirements from generic producers. In this way, there will be a truly\ncompetitive market where a dominant company canot inhibit longer term\ncompetition through the temporary expedient of lower prices.\n\nProfessor Brook K. Baker\nHealth GAP, USA\nNortheastern U. School of Law, Program on Human Rights and the Global\nEconomy\n\n\nThe Nation (Thailand)\n\nMerck lowers price of patented Aids medicine\n\nCompany will also offer free drug package for 2,500 children\n\nAfter months of negotiations, the Public Health Minis-try has finally\nsucceeded in making the giant drug firm Merck lower the prices of its\npatented HIV/AIDS drug efavirenz.\n\nThe company will also offer a special package to provide free Aids drugs to\n2,500 children, said the chairman of the ministry's committee on compulsory\nlicensing.\n\n\nDr Vichai Chokewiwat, also chairman of the Government Pharmaceutical\nOrganisation (GPO) board, said yesterday that Merck's Thai subsidiary, MSD\nThailand, had agreed to cut the price of efavirenz to Bt767 per patient per\nmonth, almost half its original price of Bt1,400. The new price includes\nvalue added tax.\n\nVichai said the new price had been \"offered verbally\" yesterday by MSD\nThailand to Dr Siriwat Thiptaradol, secretary-general of the GPO,\nyesterday.\n\nBesides slashing the price, Merck offered a special package to give the\nliquid version of efavirenz free to 2,500 children infected with HIV, and\nto sponsor a programme to diagnose children as HIV positive and provide\nother treatment to children with HIV.\n\nVichai said that although the latest price offered by MSD Thailand was\nstill 5 per cent higher than the generic version it was likely the ministry\nwould buy the Aids drug, which has been put under compulsory licence, from\nMSD Thailand as the special package offered by the company was so\n\"interesting\".\n\nHowever, he said, Merck still has to officially submit its offer in writing\nby June 12 to the ministry's committee on price negotiation for patented\nessential drugs.\n\nEfavirenz was the first drug patent that Thailand decided to ignore by\nallowing a cheaper generic version to be imported for patients under three\ngovernment programmes: the universal health scheme, the social-security\nfund and medical-welfare benefit for state officials.\n\nThe process, called compulsory licensing, is allowed by the World Trade\nOrganisation's agreement on intellectual property rights.\n\nAround 20,000 Thais, including some 13,000 on the government programmes,\ntake efavirenz.\n\nEarly this year, the first lot of 16,000 doses of generic efavirenz were\nimported from India at Bt670 a dose, including tax and transportation and\nother related expenses.\n\nThe decision of MSD Thailand to halve the cost of its efavirenz was\nwelcomed by Aids activists and those who advocate drug access.\n\nJiraporn Limpananont, a lecturer from Chulalongkorn university's Faculty of\nPharmacy, said this proved the original price of the drug was set at\nwhatever the company liked.\n\n\"It is clear evidence that the original drug price does not reflect the\nreal cost of drug development and investment,\" she said.\n\nMSD Thailand became the first drug firm among the three companies that hold\npatents for the three drugs put under compulsory licence to lower its price\nto compete with the generic version.\n\nThe other two companies, Abbott Laboratories, which holds the patent for\nLopinavir/Ritonavir, and Sanofi-Aventis, the patent-holder of Clopidogrel,\nare still negotiating with the health ministry.\n\nDuangkamon\n\n\n Sajirawattanakul,\n\n\n Pennapa Hongthong\n\n\n The Nation\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}