{"category": "ham", "to_address": "edward baafi <edwardbaafi@gmail.com>", "from_address": "Marco Pesenti Gritti <mpg@redhat.com>", "subject": "Re: [sugar] [pyxpcom] PyXPCOM viability and OLPC", "body": "On Tue, 2007-05-08 at 14:12 -0400, edward baafi wrote:\n> Hi Marco,\n> \n> > What we need to do for pyxpcom to be actually useful is to bridge it to\n> > gtkmozembed. In particular we need to be able to access nsIWebBrowser,\n> > which gtkmozembed exposes, as a python object. Someone in the epiphany\n> > team might be able to give some guidance on this too.\n> \n> I guess I don't understand what the constraints are here..   Ian says\n> that the current web browser \"activity\" uses pygtkmozembed which is\n> lacking in terms of allowing you to customize the experience and thus\n> was looking for other options..\n> \n> One option discussed was to build a custom Xulrunner based browser\n> application, which would give you access to nsiWebBrowser..  The\n> Democracy Player is one application that uses Xul + PyXpcom and\n> apparently uses the nsiWebBrowser interface:\n> https://develop.participatoryculture.org/trac/democracy/browser/trunk/dtv-binary-kit/idlinclude/nsIWebBrowser.idl?rev=4572\n> \n\nBut it's a XUL application right? Not an embedding application.\n\n> You can also build a standalone PyXPCOM as discussed in this somewhat\n> outdated document: http://kb.mozillazine.org/Standalone_PyXPCOM but\n> this wouldn't get you access to nsiWebBrowser by default..\n> \n> My main question is whether you are open to a xulrunner based\n> application with xul widgets and either javascript or python front end\n> code as well as your choice of python, c, c++, and java components or\n> if you're locked into gtk widgets..\n\nWe are locked into gtk widgets, yeah. So I think there are two\npossibilities:\n\n1 Write an embedding widget from scratch in Pyxpcom. It has been done\nfor JavaXPCOM I think, so it's possible in theory.\n\n2 Use gtkmozembed (written in C) but give access to the gtkmozembed\nnsIWebBrowser as a PyXPCOM object so that we can access the DOM document\nfrom python. It should be possible but I never investigated it much.\n\nDoes this clarify?\n\nThanks,\nMarco\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}