{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Lorenzo Taylor <daxlinux@gmail.com>", "subject": "Re: gentoo dropping speakup support", "body": "For a couple of years now I have felt that Speakup should move into\nuserspace, and from time to time I have posted messages to this effect\non this list. However I have thought it over and have come to the\nconclusion that Speakup as it is should remain in the kernel for the\nsake of those of us who have hardware synthesizers and who can receive\nthe boot messages from start to finish for troubleshooting purposes. On\nthe other hand, speakup in its present form will never gain wide use in\nmajor distributions unless it makes it into the mainline kernel tree. My\npresent position is that an alternative userspace only application with\nthe functionality of Speakup should be developed. Unfortunately, the\ntext console userspace only screen reading applications are limited to\nYASR and Emacspeak. Despite being portable, these applications are quite\nlimiting, since YASR runs a subshell under a running shell in one\nconsole only and Emacspeak requires that Emacs be running. A screen\nreading application based on Brltty's direct access to the console is\nthe best approach to take, since it provides direct access to the\ncurrently visible console even if switched, including messages printed\nto the console by the kernel, and is quite portable, being able to run\non any Unix-like OS and even DOS. The configuration is also much easier\nsince it has a configuration menu and a persistent configuration file\nthat it reads automatically at startup so that the persistent files\ndon't have to be copied into /proc to change configuration options. I\nfound also that Brltty can actually start very early on in the boot\nprocess, and can even get access to boot messages earlier than Speakup\nas modules using software speech. I have for some time wanted to play\naround with PC/Free/Open/NetBSD, but it's nearly impossible, since\nSpeakup depends on the Linux kernel and only YASR and Emacspeak will run\non such systems, and I don't want to have access only via SSH or telnet.\nSome sort of Brltty derived or other userspace only app that will\nprovide the same type of access would help me and others to be able to\nuse and possibly help develope these other OS's.\n\nI guess this message has possibly become a call for developers/others\nwho can help me in developing a portable userspace only screen reading\napplication, based on Brltty or not, with as much of the functionality\nof Speakup as possible as an alternative to a kernel based screen\nreader. Speakup is good for what it does and should stay in the kernel.\nIt just needs a little work to become mainline kernel ready, and kernel\ncode tends to scare off some developers (like me).  I have played\nwith coding some userspace applications, and have contributed some code\nto others, but the kernel still scares me. I also like the userspace\napproach for portability. If anyone who knows anything about programming\nor can help me in any way and is interested in helping to develope such\na portable userspace only screen reader, feel free to contact me off\nlist for discussion of concepts and how to procede. I will be posting\nmessages to other blind Linux user lists as well, unless someone wishes\nto forward this message on to such lists. I look forward to getting this\nproject off the ground, not as an insult to the Speakup developers who\nhave put so much time and effort into a good application, but as an\nalternative when Speakup just won't do the job because of its dependence\non the Linux kernel and the extensive patching needed to make it work\nwith an upstream kernel.\n\nLive long and prosper,\nLorenzo\n\n-- \nI've always found anomalies to be very relaxing. It's a curse.\n--Jadzia Dax: Star Trek Deep Space Nine (The Assignment)\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}