{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Jayson Jewell\" <nifcomercialiasaw@comercialia.com>", "subject": "Summer is coming, time to tone up", "body": "\nWatch the pounds disappear\n\n\n\n\n\n\nAnatrim – The newest and most attracting lose flesh product available – As told on ABC.\n\n\nDo you remember all the times when you told yourself you would do any thing for being delivered from this desperately growing number of kilos? Happily, now no big price is to be paid. Thanks to Anatrim, the earth-shaking pound-melting medley, you can achieve naturally health life style and become really slimmer. Have a look at what our customers write!\n\n\n\n\"It’s quite difficult to admit it but I was an awful food addict. \n\n\nI greedily ate all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis misery ceased after I started taking Anatrim! \n\n\nGod,\n\n\n\n\n my inclination to eat constantly disappeared, \n\n\nspirits increased and I became the happiest person 17 pounds in 2.9 months. \n\n\n\n\nI can tell you now I became the happiest person in the world!\"\n\n\n\n\n\nLusia R., Bellevue WA\n\n\n\n\n\n\"Since my early childhood I was a weighty boy. \n\n\nIt’s pretty hard to imagine how I hated being mocked at school. \n\n\n\n\nI detested my weight and I detested even myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nIt literally took me out of this terrible nightmare! Lots of thanks to you, fellows.\"\n\n\n\n\n\nSteve Doubt, Boston\n\n\n\n\n\n\"You know what? My marriage was saved thanks to Anatrim! I got into the circle, depression – more eating – just more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOnce one of my friends showed me web page and I ordered pack of Anatrim at the same time. \n\n\nThe results were splendid, my appetite became normal, I was in a good mood oftener, and, be sure, I tightened my belt with no regrets. And you see, the sex became fantastic, too!\"\n\n\n\n\n\nFrank\n\n\n\n\n There is a lot of thanks happy people leave after taking Anatrim. Why don't you join the tens of thousands of slim men and women and try this natural appetite decreasing energy lifting product now!\n\n\nDo not decline the opportunity!\n\n\n\n\n"}