{"category": "ham", "to_address": "beginners@perl.org", "from_address": "Celice <celice@350.com>", "subject": "Re: logic not working", "body": "Tony Heal wrote:\n >\n> OK I am probably missing something stupid, but I can not get this to work.\n> The output should be 'Daily-{day of week)-{MMM}-{DD}-{YYYY}' for Sunday\n> thru Friday and 'Weekly-{1|2|3}-{day of week)-{MMM}-{DD}-{YYYY} for\n> Saturday and every fourth Saturday should start rotating months\n> 'Month-{1|2|3}-{day of week)-{MMM}-{DD}-{YYYY}\n> \n> Anyone got any ideas?\n> \n> Oh, there is some code at the front that changes the system date from May 1\n> to 31\n\nHi Tony\n\nI'm sorry I'm afraid there's so little chance of getting that code working I'm\nnot even going to try. I spent half an hour trying to understand how it was\nstructured and what you were trying to do and had to give up. It looks to me\nlike you've written the whole thing in one go and then started to get it to\nwork, which isn't the way to go about even simple coding problems: you need to\nmake software work in small steps at a time and gradually approach the final\nsolution, all the time with a working partial solution.\n\nTo try and get you started here are a few pointers, with most of the code\nremoved so that the problems are apparent:\n\nYou have written\n\n   while ($count lt 532){\n\n     my $backupDir = gfsBackup();\n\n     sub gfsBackup\n\n     }\n\n   $count++;}\n\n\nwhich I didn't even know would compile. Take the subroutine out of the while\nloop or there's really no point in having it there.\n\nOh, and it should be\n\n   while ($count < 532) {\n   }\n\notherwise you're comparing text instead of numbers.\n\n\nThe lines\n\n   opendir (DIR, $backupBaseDir);\n   my @readdir = readdir(DIR);\n   closedir(DIR);\n\n   while (<@readdir>)\n   {\n   }\n\nare wrong, and the most obvious fix is to put\n\n   foreach (@readdir) {\n\n   }\n\nbut I don't know if the code around this will work either way.\n\n\nYou have\n\n   if ( $days[$wday] =~ \"Saturday\" )\n   {\n   }\n   elsif ( $days[$wday] =~ \"Saturday\" )\n   {\n   }\n\nwhich is clearly wrong, and it isn't obvious what you meant. Furthermore these\ntwo conditional lines are indented by different amounts, making me think your\nnesting isn't what you think it is. Use less whitespace in your code and\ncarefully align matching braces.\n\nFinally, stuff like\n\n   if ($days[$wday] =~ \"Saturday\")\n\nshould be\n\n   if ($days[$wday] eq 'Saturday')\n\nalthough this won't actually stop it working.\n\nI think that's all I can do for you for now. Please try to clarify your code\nand make it look as if it ought to work before you try it. You are doomed to\nfailure if you throw together a few approximate source lines and try to hack\nthem until the output looks right.\n\nGood luck,\n\nRob\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}