{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Derrick Good\" <pifcfseugenegew@cfseugene.com>", "subject": "Summer is almost here, be ready", "body": "\nMelt away fat easily\n\n\n\n\n\n\nAnatrim – The very up-to-date and most exciting product for over-weight people is now available – As shown on CNN.\n\n\nCan you recall all the situations when you said to yourself you would do anything for being delivered from this quickly growing pounds of fat? Fortunately, now no big price is to be paid. Thanks to Anatrim, the ground-breaking weight-reducing combination of elements, you can get naturally health lifestyle and become really slimmer. Just look at what people write!\n\n\n\n\"It’s unbearably difficult to admit it but I was a junk food addict. \n\n\nI greedily devoured all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis suffering ceased when I started course with Anatrim! \n\n\nOh, God,\n\n\n\n\n my appetite abated, \n\n\nmood improved and I turned to the happiest person on the planet 25 pounds in 2.9 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nAmely S., Bellevue WA\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nYou can't even fancy how I abhorred being mocked at school. \n\n\n\n\nI hated my weight and I hated even myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nThis stuff literally dragged me out of this horrible nightmare! The very sincere thanks to you, guys.\"\n\n\n\n\n\nMike Brown, Las Vegas\n\n\n\n\n\n\"Do you know what? Anatrim preserved my marriage! I got into the circle, depression – more eating – just more depression. My wife had thought to leave the overweight psycho I was turning in. \n\n\nOne of my friends pointed to your site and I called for pack of Anatrim right away. \n\n\nThe results were excellent, my appetite came to normal level, I was often in a good mood, and, certainly, I tightened my belt with no regrets. And you see me, the bedroom became cool, too!\"\n\n\n\n\n\nFrank\n\n\n\n\n There is a lot of testimonials delighted people leave after taking Anatrim. Don’t you wanna join the thousands and thousands of slender women and men and take this natural appetite reducing power raising product now!\n\n\nDo not miss your chance!\n\n\n\n\n"}