{"category": "ham", "to_address": "Patrick Connolly <p_connolly@ihug.co.nz>,\n   R-help <r-help@stat.math.ethz.ch>", "from_address": "(Ted Harding) <ted.harding@nessie.mcc.ac.uk>", "subject": "Re: [R] Unix-like permissions to allow a user to update recommen", "body": "On 18-Jun-07 10:11:43, Patrick Connolly wrote:\n> I installed R from the tar.gz file (as root) in a directory under\n> /usr/local.  The recommended packages are installed in a library in\n> that directory whereas additional packages I install in a directory\n> under the /home directory as a user.\n> \n> Updating the additional packages is very easy with update.packages()\n> as a non-root user, but the recommended packages cannot be done so\n> readily because of file permissions.\n> \n> My question is how do I set the permissions or ownerships in the\n> /usr/local/R-2.5.0 directory so that everything necessary can be\n> writable by a user?  Should I make a group for R users (total of one\n> member) or is it simpler than that?\n\nSince you have root access, do you need to segregate the additional\npackages to a particular user?\n\nThough I don't run R as root for general use, I always install/update\nby running R CMD as root. This makes all of R (\"recommended\" and also\nany extras) available system-wide, and no pemission problems arise.\n\nThis of course does not stop you from setting up a special .Rprofile\nfor each user, since this by definition lives in the user's home\ndirectory.\n\nDoes this help? Or are there issues you haven't mentioned which make\nsuch an approach not feasible?\n\nBest wishes,\nTed.\n\n--------------------------------------------------------------------\nE-Mail: (Ted Harding) \nFax-to-email: +44 (0)870 094 0861\nDate: 18-Jun-07                                       Time: 11:53:19\n------------------------------ XFMail ------------------------------\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}