{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "Terry Hancock <hancock@anansispaceworks.com>", "subject": "Re: [cc-community] Does BY-SA extend to a newspaper?", "body": "Benj. Mako Hill wrote:\n> \n>>As things stand we have a situation with some admitted faults -- it may\n>>be a little *too* free.\n> \n> Weaker copyleft in this regards seems to lead people to license their\n> works under NC terms in situations where, if it were software or another\n> type of creative word, they would not.\n\nPerhaps true, though we have no experimental control on that observation.\n\n>>But trying to sew up the loopholes is going to cause problems, and I'm\n>>not convinced that the cure wouldn't be worse than the disease.\n> \n> I'm not convinced either. But I am quite sure it is an issue that is\n> important enough that's its worth thinking hard about. Thanks for doing\n> some of the hard work toward that end.\n\nWell, I'm not totally convinced of the opposite either. It could be that\none of these proposals is reasonable.\n\nI've been thinking that such a proposal *in combination* with a proposal\nto introduce standardized licensing fees and terms for clear copyrights\non By-SA works in commercial-proprietary container works might solve a\nlot of people's problems with the present situation.\n\nThe truth is, what I object to is the extra web of dependency checking\nthat binding containing works would impose, and the possibility of a\n\"mine\" going off (like a single author who decides to try to block the\nwork either by refusing permission or asking for ridiculously high fees,\nthus forcing me to rework to eliminate their work). If that part at the\nsame time got much simpler and less risky, then the idea of having to\nclear By-SA works becomes a lot more attractive.\n\nI'm both a producer and a consumer of By-SA licensed visual works. As a\nconsumer I'm bothered by the risk factors and \"chilling effects\" of such\nan extension to the copyleft. OTOH, as a producer I can appreciate the\nmotivations. To me it's a question of striking a fair balance (as are\nmost situations in this arena). If the By-SA introduced an extra rights\nclearing requirement into the existing situation, but also made all such\nrights-clearing activities simpler and less risky, then it might\nactually come out to a win for everybody.\n\nThis might even solve the NC problem for many of us (if for example,\nthere were a registry where you could look up any CC-By-NC work and\ndetermine what fee would be asked for licensing to CC-By-SA, or what\nwould be required for incorporation into a larger proprietary work --\nthe latter service is provided by Magnatune, for example, but not the\nformer).\n\nCheers,\nTerry\n\n-- \nTerry Hancock (hancock@AnansiSpaceworks.com)\nAnansi Spaceworks http://www.AnansiSpaceworks.com\n\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}