{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nTHIS WEEK AT EIA (Volume 9, Issue 17) (April 18 - April 26, 2007)\n\n\n\nEIA - Apr. 26, 2007 - THIS WEEK AT EIA is a list summarizing and providing URLs for every Energy Information Administration (EIA) product released during this week.\n\n\nApr 26, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Apr. 26, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 26, 2007\n\n\nApr 26, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for April 26, 2007    \n\n\n\nFirst Enercast Featured Articles for April 26, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories  \n\n\nApr 26, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nCEG profit rises 70%: Power demand, lifting of rate caps help 1st-quarter earnings gain\n\n\n\nApr. 26--The 1999 deal to move Maryland to a deregulated power market handed Constellation Energy Group title to a fleet of valuable power plants formerly owned by its utility subsidiary. But it also locked the company into multiyear agreements to sell the electricity they produced at bargain prices.  With those obligations recently ended, the company is seeing its profits soar and its shares ...\n\n\nApr 26, 2007 Knight Ridder Tribune Business News\n\n\n\nInvestors gathering: Power company chief Timmerman expected to offer updates on\n\n\n\nApr. 26--SCANA ANNUAL MEETING  Will today's SCANA annual meeting in Charleston hold a surprise for shareholders? Two years ago, SCANA announced a move to add nuclear generation. Last year, the company announced the retirement of Neville Lorick, SCE&G president. When SCANA chief executive William Timmerman offers his vision for the energy company's future, will it be a vision without Timmerman? ..\n\n\nApr 26, 2007 Knight Ridder Tribune Business News\n\n\n\nCounty supervisors sidestep power plant controversy\n\n\n\nApr. 25--WATERLOO -- The Black Hawk County Board of Supervisors has balked at the chance to weigh in on a proposed coal-fired power plant on Newell Road.  The supervisors voted unanimously Tuesday officially to take \"no position\" on Elk Run Energy Associates' request to voluntarily annex 345 acres of land into the city of Waterloo for a controversial $1.3 billion, 750-megawatt coal-fired power ...\n\n\nApr 25, 2007 Knight Ridder Tribune Business News\n\n\n\nBill may let TXU retain plants\n\n\n\nApr. 26--AUSTIN -- Under pending legislation, TXU could possibly hold onto all of its big electric generators in areas of Texas where the company has been accused of using its market dominance to unfairly jack up profits.  Instead, the company and other big power generators would have to get approval for regulatory plans showing how they would not unfairly benefit from their market position.\n\n\nApr 26, 2007 Knight Ridder Tribune Business News\n\n\n\nGreen is growing\n\n\n\nApr. 25--When Great River Energy CEO Michael Finley calls the company's future headquarters \"a showcase,\" he's not just talking about the building's sleek style and setting on the south shore of Arbor Lake in Maple Grove.  Great River's goal is to have the building set a standard in Minnesota for energy efficiency and environmentally conscious design. The initial cost of $42 million is about 5 ...\n\n\nApr 25, 2007 Knight Ridder Tribune Business News\n\n\n\nAEP says it won't abandon coal plans: Challenges add 4 years to timetable\n\n\n\nApr. 25--Regulatory hurdles, legal challenges and slow site work will keep American Electric Power from starting operations at two coal-fired plants along the Ohio River until the middle of the next decade.  That's about four years later than officials with the Columbus-based utility had hoped for when they announced plans for plants in Meigs County, Ohio, and Mason County, W.Va., in August 2004. ...\n\n\nApr 25, 2007 Knight Ridder Tribune Business News\n\n\n\nKohl's to go solar in California: It will be largest single purchase of sun power ever, provider says\n\n\n\nApr. 26--Kohl's Corp. will convert most of its California department stores to solar power starting next month, the company will announce today.  Kohl's agreement to buy solar power from SunEdison is the largest purchase and deployment of solar power by a single entity in U.S. history, according to SunEdison LLC, North America's largest solar energy service provider.\n\n\nApr 26, 2007 Knight Ridder Tribune Business News\n\n\n\nDNR OKs stricter emission controls: Business and green groups both criticize nitrogen oxide rules\n\n\n\nApr. 26--BEAVER DAM -- The state Department of Natural Resources took steps Wednesday to curb a key pollutant that forms smog by requiring new emissions controls that will primarily affect electric utilities.  The Natural Resources Board voted 7-0 in favor of regulations that drew fire from both a business group and environmentalists. The rules would cut emissions of nitrogen oxide by about ...\n\n\nApr 26, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nEPA Accused of Flouting Supreme Court in Proposing New Pollution Standard\n\n\n\n(AP) - WASHINGTON AP) - The government proposed a pollution standard for power plants Wednesday that critics said flouts the spirit of a Supreme Court ruling on clean air enforcement. The proposal would make it easier for utilities to expand plant operations or make other changes to produce more electricity without installing new pollution controls. Critics said the Environmental Protection ...\n\n\nApr 26, 2007 Omaha World-Herald\n\n\n\nAllegheny Energy, American Electric Power to Form Joint Venture to Build 765-kV Transmission\n\n\n\nVegetation Management  Innovations in City and Rural UtilitiesT&D World's special supplement to the August issue. More Katrina-Reflections from the Gulf Allegheny Energy, Inc. has signed a memorandum of understanding with American Electric Power to form a joint venture company to build and own new electric transmission assets within PJM Interconnection. Under the terms of the memorandum, ...\n\n\nApr 26, 2007 Transmission & Distribution World\n\n\n\nNSTAR and Evergreen Solar Announce Alliance to Spur Interest in Solar Energy\n\n\n\nVegetation Management  Innovations in City and Rural UtilitiesT&D World's special supplement to the August issue. More Katrina-Reflections from the Gulf NSTAR (Boston, Massachusetts, U.S.) and Evergreen Solar Inc. (Marlboro, Massachusetts), a manufacturer of solar power products, have formed an alliance to increase the role of solar power in eastern Massachusetts.\n\n\nApr 26, 2007 Transmission & Distribution World\n\n\n\nCalifornia ISO Board Approves Five-Year Business Plan\n\n\n\nVegetation Management  Innovations in City and Rural UtilitiesT&D World's special supplement to the August issue. More Katrina-Reflections from the Gulf The California Independent System Operator Corporation (California ISO) Board of Governors has approved a comprehensive five-year business plan that follows a thorough process of assessing the needs of the electricity industry and the consumers ...\n\n\nApr 26, 2007 Transmission & Distribution World\n\n\n\n\n\nTexas Energy Future Holdings and Oncor Electric Delivery File Voluntarily Expedited 14.101 Report With Public Utility Commission of Texas\n\n\n\n- No New Transaction-Related Debt at Oncor                       - No Basis for Rates to Increase                       - Independently Managed Company -  Request PUC Enforcement of Commitments     DALLAS, April 25 /PRNewswire/ -- Oncor Electric Delivery Company (Oncor), formerly named TXU Electric Delivery Company, and Texas Energy Future Holdings Limited Partnership (TEF) -- ...\n\n\nApr 25, 2007 PR Newswire\n\n\n\nCourt Rules Victory Energy Corporation in Breach of Settlement Agreement\n\n\n\nFormer Victory Capital Holdings Corp., now  Former Victory Capital Holdings Corp., now known as Victory Energy Corporation (OTCBB: VYEY) CEO George Sharp announced today that a California Superior Court Judge has found Victory Energy in material breach of a Settlement Agreement that the Company entered into with Mr. Sharp in settlement of a civil action he filed for Fraud, Negligent ...\n\n\nApr 26, 2007 Internet Wire\n\n\n\nFitch Downgrades Arkansas Electric Cooperative's $326MM Secured Bonds to 'A+'\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch has downgraded the underlying rating of Arkansas Electric Cooperative Corporation's (AECC) outstanding $326 million secured facility bonds (including its tax-exempt pollution control bonds issued by the City of Siloam Springs and Jefferson County, AR) to 'A+' from 'AA-'. The Rating Outlook is Stable. AECC has total debt outstanding, including its rural utility ...\n\n\nApr 25, 2007 Business Wire\n\n\n\n\n\nItem E-5: Commission grants California ISO financial flexibility to develop facilities to interconnect renewable resources\n\n\n\nCommission acts to remove regulatory barriers to renewable energy delvelopment in California The Federal Energy Regulatory Commission today approved the California Independent System Operator's (CAISO) proposed mechanism for financing facilities to interconnect location-constrained renewable resources such as wind, geothermal and solar generation to the CAISO's transmission grid.\n\n\nApr 25, 2007 Federal Energy Regulatory Commission\n\n\n\nEPA accused of flouting Supreme Court\n\n\n\n5:34 p.m. PT By H. JOSEF HEBERTASSOCIATED PRESS WRITER WASHINGTON AP) - The government proposed a pollution standard for power plants Wednesday that critics said flouts the spirit of a Supreme Court ruling on clean air enforcement. The proposal would make it easier for utilities to expand plant operations or make other changes to produce more electricity without installing new pollution controls. ...\n\n\nApr 26, 2007 Seattle Post Intelligencer\n\n\n\nCanadian Utilities reports increased Q1 of $134.7 million\n\n\n\nCALGARY (CP) - Canadian Utilities Ltd. (TSX:CU) reported a 55 per cent rise in profit for its first quarter due in part to favourable timing and demand of natural gas storage capacity.  The Atco Ltd. (TSX:ACO.X) subsidiary said after markets closed Wednesday that it earned $134.7 million, or $1.07 per share, for the three months ended March 31, compared to $86.9 million, or 68 per share, for the ...\n\n\nApr 26, 2007 Canoe Money\n\n\n\nCanada's largest solar farm to be built in Ont.\n\n\n\nET Canadian Press TORONTO -- A California company will build Canada's largest solar farm near Sarnia, Ont., installing more than one million panels on the ground to generate 40 megawatts of power that it will sell to the provincial government. The Canadian Press has learned OptiSolar plans to have the clean electricity on the Ontario power grid by 2010. OptiSolar will be paid 42 cents a ...\n\n\nApr 26, 2007 CTV.ca\n\n\n\nItem E-8 & E-23: Commission adopts transmission cost allocation plan for PJM\n\n\n\nCommission adopts transmission cost allocation plan for PJM The Federal Energy Regulatory Commission today accepted a plan for allocating transmission costs among PJM Interconnection's in-area transmission service customers. \"This has been a long and complicated proceeding. By modifying the PJM cost allocation rules we provide regulatory certainty that should encourage greater investment in the ...\n\n\nApr 25, 2007 Federal Energy Regulatory Commission\n\n\n\nTulsa Home Builder Responds to Energy Costs and Concerns with Energy Star Standards\n\n\n\nPMC Homes, a Tulsa home-building company, has made a commitment to the community and the environment by following the Energy Star program guidelines in every home they build. Tulsa, Okla. (PRWEB) April 26, 2007 - PMC Homes, a local home-building company, has raised the bar for Greater Tulsa homes. As the only Tulsa builder committed to Energy Star standards in every home they build, PMC Homes is ...\n\n\nApr 26, 2007 PRWeb\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nSpain Mulls Offshore Wind Farms\n\n\n\n-- As a way to boost its use of renewable energy sources, Spain is looking at building several offshore wind parks along its vast coastline, an industry ministry spokesman said April 24. The government plans to table a law to allow wind turbines to be built offshore before the end of the year and it will then identify the best places where they can be installed, he said.\n\n\nApr 26, 2007 Industry Week\n\n\n\nTaiwan power outage looms, some fear\n\n\n\nTAIPEI: China's missiles may not be the biggest danger to Taiwan. A possible power shortage could cause blackouts within three years and weaken the nation's economy. Power production is failing to keep pace with demand because of a ban on new nuclear plants and delays in completing projects already under way, says Jeffrey Bor, a fellow at the Chung-hua Institution for Economic Research, which ...\n\n\nApr 25, 2007 International Herald Tribune\n\n\n\nBolivia Takes Control Of Energy Reserves From Foreign Firms\n\n\n\n-- Contracts ceding control of Bolivia's energy reserves from foreign companies to its government have come into force, as President Evo Morales nationalizes the impoverished state's hydrocarbon industry. The 44 new contracts were signed in October with 10 companies including Repsol of Spain, Petrobras of Brazil, Total of France, Vintage and ExxonMobil of the U.S.\n\n\nApr 26, 2007 Industry Week\n\n\n\nAcciona denies it acted illegally in bid for Endesa\n\n\n\n- Spanish energy and construction group Acciona has denied that it acted unlawfully by making a joint bid with Italian utility ENI for Spain's Endesa. The allegation was made by Manuel Conthe, former president of Spain's national securities market commission, in his resignation speech. Mr Conthe is reported to have accused Acciona of acting illegally by making a rival joint bid for Endesa before ...\n\n\nApr 26, 2007 Power Engineering\n\n\n\nPlug Power Installs 63 GenCore(R) Systems In First Quarter 2007\n\n\n\n- Company announces first quarter financial results - GenCore(R) fuel cell systems successfully back up NYS agencies during outages LATHAM, N.Y., April 26 /PRNewswire-FirstCall/ -- Plug Power Inc. (Nasdaq: PLUG), a leader in providing clean, reliable on-site energy products, today announced it achieved record installations of its GenCore(R) fuel cell system, a backup power source for the ...\n\n\nApr 26, 2007 PR Newswire\n\n\n\nGrowth Opportunities and Key Drivers of Success of the Cogeneration Market in Europe\n\n\n\nLYON, France--(BUSINESS WIRE)--Reportlinker.com announces that a new market research report related to the European energy market is now available to its catalogue. The Future of Cogeneration in Europe: Growth Opportunities and Key Drivers of Success Cogeneration (simultaneous production of electricity and heat), offers significantly higher fuel efficiency compared with conventional ways of ...\n\n\nApr 26, 2007 Business Wire\n\n\n\nStung by bad experience, Dutch consider tough criteria for importing sustainable biofuels\n\n\n\nAssociated Press Writer AMSTERDAM, Netherlands (AP) -- It's the new climate change dilemma: finding alternatives for oil and gas without doing more harm than good. In the rush to develop biofuels, forests are burned in Asia to clear land for palm oil, and swaths of the Amazon are stripped of diverse vegetation for soya and sugar plantations for ethanol. On Friday, a Dutch committee will unveil ...\n\n\nApr 26, 2007 Charleston Gazette\n\n\n\nSiemens chief latest to be ousted amid scandals\n\n\n\nFRANKFURT: Klaus Kleinfeld, the embattled chief executive of Siemens, said Wednesday that he would step down when his contract expires in September, the latest casualty in a widening corruption scandal that has rocked corporate Germany. Events at the German engineering giant have grabbed headlines and airwaves in a country where corruption was rarely discussed, generating a debate about how ...\n\n\nApr 26, 2007 International Herald Tribune\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}