{"category": "spam", "to_address": "<captains@flax24.uwaterloo.ca>", "from_address": "\"Peace Arch Entertainment\"<Tommy.Gallegos@thebusinessforce.com>", "subject": "PAE to Acquire Premier Toronto Production Company", "body": "\n\n\nPAE to Acquire Premier Toronto Production Company\n\n\n\n\n\nPAE to Acquire Premier Toronto Production Company\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPeace Arch Entertainment Agrees to Acquire Toronto's Foremost Provider of Production Services and Facilities\n\nPurchase of Profitable Dufferin Gate Productions Enhances Vertical Integration and Increases Production Capacity to Further Expand Product Pipeline\n\n\n\n\n\nToronto  May 18, 2007  Peace Arch Entertainment Group Inc. (AMEX:PAE - News) (TSX:PAE.TO - News), an innovative film and television entertainment company, announced today that it has agreed to acquire the Toronto based production company Dufferin Gate Productions Inc. for CAD$6 million.  Under the terms of the deal, Peace Arch has agreed to acquire all of the shares of Dufferin Gate for approximately CAD$5.4 !\nmillion in cash and CAD$600,000 of Peace Arch common stock. The acquisition is the latest validation of Peace Archs high-growth business model focused on the acquisition of profitable assets in the entertainment industry to create a fully integrated entertainment company.\n\nIncorporated in July 1994, Dufferin Gate Productions has furnished production services on more than 150 cable movies, television series and feature films for such studios as Showtime Networks, Paramount Pictures, Viacom Productions, Columbia/TriStar and Peace Arch, including such notable productions as the recent Showtime/Peace Arch collaboration The Tudors.\n\nThe privately-held company owns property and a 72,000 square foot building in Torontos West End, with state-of-the-art production and post-production facilities. The company had unaudited normalized EBITDA of approximately CAD$1 million for the year ending December 31, 2006.\n\nWith its exemplary management, longstanding industry relationships and incomparable expertise in all aspects of the Canadian production industry, Dufferin Gate provides Peace Arch with a unique opportunity to expand our already robust production operations and provide more content to our rapidly growing distribution and sales divisions, said Gary Howsam, Chief Executive Officer of Peace Arch Entertainment. Dufferin Gate is a consistently profitable production service operation with highly valuable real estate. This facility will continue to offer to international productions a fully integrated base of operations in Canada, and give Peace Arch a fantastic opportunity to increase efficiencies and reduce costs on our own busy production schedule.\n\nPeace Arch will immediately acquire 40.01% of the shares and 50% of the votes of Dufferin Gate. Peace Arch has escrowed funds to secure a put granted to the remaining shareholder, which upon exercise will provide for Peace Arch to acquire all of the remaining shares and votes.\n\n This agreement with Peace Arch allows Dufferin Gate to expand its client-base and reliably increase its service activity with a steady supply of new productions, from both Peace Arch and its large contingent of international production and distribution partners, said John Weber, President and Chief Executive Officer of Dufferin Gate. With Peace Arch offices in Los Angeles, New York and Vancouver and an international sales team attending most major film and television markets, we believe the synergies offered by the combination of our two companies will make Dufferin Gate the service and facilities provider of choice for any production seeking to access the many benefits offered by the Canadian film and television industry.\n\nWeber will remain President of Dufferin Gate, which will be renamed Peace Arch Studios, and continue to oversee its day-to-day operations. He also joins Peace Arch as Executive Vice President of Production.  He will report to Lewin Webb, President of Peace Archs production division.\n\nAbout Peace Arch Entertainment Group Inc.\nPeace Arch Entertainment produces and acquires feature films, television and home entertainment content for distribution to worldwide markets. Peace Arch owns one of the largest libraries of top quality independent feature films in the world, featuring more than 500 classic and contemporary titles. Through its subsidiary, Peace Arch Home Entertainment, Peace Arch is also one of the leading distributors of DVDs and related products in Canada. For additional information, please visit www.peacearch.com.\n\nFor more investor-oriented information about Peace Arch Entertainment, visit http://Thebusinessforce.com/cgi-bin/clickthru/6087/2249/384573.\n\nFor current stock price quotes and news, visit http://Thebusinessforce.com/cgi-bin/clickthru/6088/2249/384573. \n\nTo view an Investor Fact Sheet, visit http://Thebusinessforce.com/cgi-bin/clickthru/6089/2249/384573.\n\nTo read a transcript of a recent Peace Arch investor conference call or listen to an archived recording, please visit http://Thebusinessforce.com/cgi-bin/clickthru/6090/2249/384573.\n\nCAUTIONARY STATEMENT\nNo stock exchange, securities commission or other regulatory authority has approved or disapproved the information contained herein. The closing of the transaction is subject to the negotiation and execution of definitive documentation and the approval of the Toronto Stock Exchange and the American Stock Exchange.\n\nFORWARD-LOOKING STATEMENT\nThis press release includes statements that may constitute forward-looking statements, usually containing the words \"believe,\" \"estimate,\" \"project,\" \"expect,\" or similar expressions. These statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements inherently involve risks and uncertainties that could cause actual results to differ materially from the forward-looking statements. Factors that would cause or contribute to such differences include, but are not limited to, continued acceptance of the Company's products and services in the marketplace, competitive factors, dependence upon third-party vendors, availability of capital and other risks detailed in the Company's periodic report filings with the Securities and Exchange Commission. By making these forward-lo!\noking statements, the Company undertakes no obligation to update these statements for revisions or changes after the date of this release.\n\nContacts:\nRoy Bodner\nVice President Public Relations\nPeace Arch Entertainment\n310.450.1711 or http://Thebusinessforce.com/cgi-bin/clickthru/6085/2249/384573\n\nOr\nFinancial Communications\nTrilogy Capital Partners\nRyon Harms\n800.592.6067 or ryon@trilogy-capital.com\n\n\n\n\n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}