{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "115p 6/10 Update: Final rendezvous sequence begins", "body": "\n\n\n\n\n115p 6/10 Update: Final rendezvous sequence begins\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 33\nPosted: 1:14 PM, 6/10/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-30 (06/09/07): Crew awake; updated FD-2 timeline; rendezvous timeline; TPS inspection on tap\n   SR-31 (06/09/07): MMT reviews initial inspection results\n   SR-32 (06/10/07): Shuttle Atlantis closes in on space station\n   SR-33 (06/10/07): Shuttle begins final rendezvous phase\n\n=================================\n\n1:14 PM, 6/10/07, Update: Shuttle begins final approach phase\n\nTrailing the international space station by about 9 miles, shuttle commander Rick Sturckow fired Atlantis' left-side maneuvering rocket today at 1:01 p.m. to begin the final phase of a two-day orbital chase that began with blastoff Friday. If all goes well, Sturckow, flying Atlantis from the aft flight deck, will guide the shuttle to a docking at pressurized mating adaptor No. 2 on the forward end of the Destiny laboratory module around 3:39 p.m.\n\nBut first, space station skipper Fyodor Yurchikhin and flight engineer Oleg Kotov plan to photograph the shuttle's heat shield with powerful digital cameras to help engineers in Houston assess the health of the tiles and blankets that protect the orbiter during re-entry.\n\nPositioned 600 feet directly below the space station, Sturckow plans to pitch the shuttle's nose up through a 360-degree flip known as a rotational (or rendezvous) pitch maneuver that will expose the belly of the orbiter to the station's cameras.\n\nThe RPM, scheduled to begin around 2:38 p.m., has turned out to be one of the most effective techniques yet developed to characterize the condition of critical tiles on the underside of the shuttle that are exposed to ice and foam debris during launch.\n\nOnce the pitch maneuver is complete, Sturckow will fly Atlantis up to a point about 310 feet directly in front of the station with the shuttle's tail pointed toward Earth and its open payload bay facing PMA-2. From that point, it will take about 40 minutes or so to move in for docking.\n\nThe linkup is the first of three major items in today's flight plan. The astronauts also plan to use Atlantis' robot arm to pull a 36,000-pound set of solar arrays out of the shuttle's cargo bay so it can be handed off to the station's arm for installation Monday.\n\nWhile that work is going on, Atlantis astronaut Clay Anderson will join Yurchikhin and Kotov as a member of the Expedition 15 crew while Sunita Williams, who was launched to the station last December aboard shuttle Atlantis, will take his place on the shuttle crew.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}