{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "Showbiz Tonight <showbiz@mail.cnn.com>", "subject": "TONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT", "body": "\n\n\nCNN.com - Showbiz Tonight\n\n\n\n\n\n\n\n\n\n\nTONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT\n\nPARIS HILTON'S FIRST INTERVIEW: HOW DID SHE DO?\nReaction is pouring in to Paris Hilton's first post-jail\ninterview, with CNN's Larry King. Did she come across as\nsincere? Is anyone buying that there is a new Paris in town?\nThe explosive reaction, tonight on TV's most provocative\nentertainment news show.\n\nPROFESSIONAL WRESTLING'S\nTRAGEDY\nThe unbelievable tragedy of Chris Benoit -- was\nroid rage behind the murder-suicide that has rocked the world\nof professional wrestling? WWE Chairman Vince McMahon gets\ngrilled on TV. Does this spell the beginning of the end for the\npopular sports and entertainment phenomenon that is\nprofessional wrestling? The heartbreaking story tonight on\nShowbiz Tonight.\n\nLARRY KING!\nHe's the man who sat across the table from Paris -- what\ndid Larry himself think about how the interview went? What is\nParis really like in person, and what happened when the cameras\nstopped rolling? Larry King gives Showbiz Tonight the inside\nscoop!\n\nSHOWBIZ TONIGHT QUESTION OF THE DAY:\nParis Hilton interview: Do you now have more respect for\nher?\nVOTE AT CNN.COM/SHOWBIZ TONIGHT. \n\nSEND US\nA VIDEO EMAIL!\nSend your response to the Question Of\nThe Day on video. Look into your camera and tell us what you\nthink. Responses must be no longer than 30 seconds. To send\nyour video email, go to cnn.com/showbiztonight.Watch your video\nresponses on \"Showbiz Tonight\" at 11 p.m. ET/PT on CNN Headline\nPrime.\n\n\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the Showbiz Tonight list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=showbiz\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}