{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Anthony W. Youngman\" <debian@thewolery.demon.co.uk>", "subject": "Re: Computer with Debian preinstalled", "body": "In message , Michael Bode  \nwrites\n>Hi,\n>\n>I'm planning to sell PCs with a preinstalled Debian system. This in\n>itself should not be problematic, I guess. But do I have to handle\n>sources? GPL section 3 requires me to either include all sources of\n>the installed GPL binaries or give a written offer to ship the sources\n>on CD/DVD/whatever media. Is that correct, or is it ok to say 'look,\n>it's Debian on that machine, go to debian.org for the sources'?\n>\n>What are other people who sell PCs with preinstalled Debian doing?\n>\nIf you're selling PCs as a business, YOU CAN'T say \"go to debian.org\" \n(or you might be able to but you're taking a massive risk!)\n\nIf I give a PC with Debian pre-installed to a friend, I can say \"go to \nDebian.org\" because I'm covered by the non-commercial bit.\n\nBut if you're a business, then YOU are liable to provide the source. If \nthe download site goes away and you haven't made a copy, you're sunk. \nYou have legal obligations and you can't meet them. You're in deep \ndoodoo if someone calls you on them.\n\nSo you NEED to make a copy. And once you've done that, you might as well \nburn a CD/DVD for every PC you sell. If you do that, then when they come \nto you saying \"I demand my copy of the source that the GPL says you have \nto give me\", you can say \"you got it with the PC. If you've lost it, \ntough luck\". Not that I'd advise being that harsh to your customers, but \nat least you can legally say \"shove off\" without being in breach of the \nlicence (good customer relations says you should say \"okay, I'll burn \nyou another copy\" :-)\n\nCheers,\nWol\n-- \nAnthony W. Youngman - anthony@thewolery.demon.co.uk\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}