{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Friedrick Chandler <istag@gownsales.com>", "subject": "Turbo orgasm", "body": "\n\nDon't want to expose your private life? \nOur shop\nErectile Dysfunction is one of the most serious problems that a man can get in his life. The best cure nowadays are Viagra and Cialis.\nAll this you can find here\nYou'll be a sexual giant all night long.\nWith best regards,\nFriedrick Chandler\n \n \nZatem ia Popadaiu na sheltu, uchastvuiu v ohote v kachestve dichi. A zatem on izo vseh silenok prinialsia zarabatyvat na Obrazovanie. Nu, tak kak tebe eto imechko Stilen Gladkolicyj? Leks, ne vyderzhav, korotko zarzhal, otvorachivaia lico v storonu. Vprochem, reshitelno Dobavil ia, kakie by motivy u tebia ni byli, ty delal dobroe delo, oblegchaia Sheltianam zhizn. \nVremia zamedlilos, slovno v Toshnotvornom nochnom koshmare, kogda net vozmozhnosti spastis ot nastigaiushchego tebia Uzhasa. Osnovnye pravila povedeniia na ih Territorii byli prosty: ne suj svoj nos tuda, gde nahoditsia ih Sviatilishche, i Prozhivesh dolgo. Trevozhnoe ozhidanie Preduprezhdaiushchij krik dozornogo donessia so storony zapadnyh vorot, i srazu Gustaia cep zakovannyh v stal voinov drognula i zashevelilas na krepostnoj Stene. I horoshij predlog vyrazit svoe nedovolstvo, Ne tak li? Podsotnik s nevinnym vidom pozhal shirokimi plechami. Sprava ot okna raspolagalsia pismennyj stol s ploskim Gorizontalnym terminalom nastolnogo gipertransliatora v centre. My ved Mogli pokinut tolkuchku mirno. Ia hmyknul. Kak prosto, usmehnulsia ia pro sebia. \nChuzhoj poiavilsia zdes Nesprosta, poetomu proshche srazu vyiasnit, chto emu ot menia nado, chem pytatsia Ot nego otviazatsia. Postaviv polupustuiu emkost s napitkom na sidene, Ia obespokoeno pokrutil golovoj i obnaruzhil Nkota nepodaleku, vsego v desiati Shagah ot mashiny. Pered licom mechnika melknuli temnye, kak Bezdonnaia propast, glaza chuzhaka. Pravaia noga u nee okazalas povrezhdennoj. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}