{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Felicity Jones <felicity.jones@stanford.edu>", "subject": "[R] sizing and saving graphics in R", "body": "\nDear R wizards,\n\nI am seeking advice on graphics in R.  Specifically, how to manipulate  \nthe size and save a plot I have produced using the LDheatmap library.   \nI confess I am relatively new to graphics in R, but I would greatly  \nappreciate any suggestions you may have.\n\nLDheatmap produces a coloured triangular matrix of pairwise  \nassociations between 600 genetic markers in my dataset.  Initially the  \ngraphical output was confined to the computer screen, such that each  \npairwise marker association was displayed as approximately 1 pixel  \n(too small for me to interpret).\n\nI have successfully managed to play with the LDheatmap function to  \nenlarge the size of viewport by changing the following code in   \nLDheatmap\n\n#From\n\nheatmapVP <- viewport(width = unit(0.8, \"snpc\"), height = unit(0.8, \"snpc\"),\n                        name=vp.name)\n\n#To\nheatmapVP <- viewport(width = unit(25, \"inches\"), height = unit(25,  \n\"inches\"), name=vp.name)\n\nThis produces a much larger plot (so big that the majority is not seen  \non the screen).  I would like to save the entire thing so that I can  \nimport it into photoshop or some other image software.\n\nMy problem is that when I save using the R graphics console  \n(File->Save As->bmp), it only saves the section I can see on the  \nscreen.  Any suggestions on how to save the whole plot or manipulate  \nthe plot so I get higher resolution would be much appreciated.\n\nThanks for your help in advance,\n\nFelicity.\n\n\n\n\n\n\n\n\n_______________________________________\n\nDr Felicity Jones\nDepartment of Developmental Biology\nStanford University School of Medicine\nBeckman Center\n279 Campus Drive\nStanford CA 94305-5329\nUSA\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}