{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"maillist@michaelmoore.com\" <maillist@michaelmoore.com>", "subject": "\"Sicko's\" Successful Weekend Puts My Movie in 200 More Cities Beginning Today!", "body": "\n\"Sicko's\" Successful Weekend Puts My Movie in 200 More Cities Beginning Today!\n\n\nTuesday, July 3rd, 2007\n\n\nFriends,\n\n\nThe results are in from the weekend -- and they are amazing! \"Sicko\" more than doubled what industry insiders had predicted it would do for the weekend and, as I predicted, it did indeed have the second largest opening weekend in film history for a documentary (after F911). It also had the second highest per screen average for the weekend (after the Pixar animated film, \"Ratatouille\"). All this in spite of the fact, as Variety wrote, it's not been a very good year for documentaries at the box office. According to Variety, there have been 29 docs released in theaters in 2007, and they have grossed less than two million combined. What does it say about the state of affairs for non-fiction films if, in just three days, one film more than doubles what all 29 of them did together? I've decided I want to do something about this. I see so many great documentaries and it's a shame that most of you don't get to see them. Later this year, I will announce a new project that will help other filmmakers get the distribution they deserve.\n\n\nOf course, if you live in Lincoln, NE; Bangor, ME; Reno, NV; New Haven, CT; Columbia, SC; or Oklahoma City, you didn't get to see \"Sicko\" this weekend either. But thanks to the massive turnout in the 440 theaters who had it, the studio has decided to expand \"Sicko,\" TODAY (Tuesday, July 3) to 200 more theaters! And this Friday, they will add another 100 cities. Those of you who went to see it in the last few days have made it possible for others around the country to see my movie. Thank you.\n\n\nSo this will become the make-it-or-break-it week for \"Sicko.\" Will you help me? Here's something you can do right now. Go to your address book icon on your computer and send a brief note to all your friends and associates about why they should see \"Sicko.\" Then organize a group of your friends to go see \"Sicko\" some night this week. I promise you that you won't be disappointed. After all, what's the worst that could happen -- a pardon or a commutation from the President of the United States?\n\n\nOn Sunday, Canada celebrated the 45th anniversary of its free, universal health care system -- with its built-in bonus of living longer than we do. Why do they have this and not us? We've already taken their Stanley Cup from them for good. Let's demand we get to live as long as they do, too! What good is a dumb ol' Cup if we aren't around long enough to use it?\n\n\nThe letters you are sending me are powerful and profound.  Thank you for sharing with me thousands of more stories about the criminal way our system operates.  One woman wrote to say her dentist just gave her this choice: have all her teeth pulled, or pay him $30,000 to fix and rebuild them.  She told me she's made the choice to give up her teeth -- a choice she was forced to make only because she lives from paycheck to paycheck in middle class America. This is a crime.\n\n\nGo to your address book on your computer now and send out that e-mail to everyone you know and tell them to find their way to the theater this week.  This film stands the chance of igniting a movement.  Let's not let this moment pass.\n\n\nYours,\n\n\nMichael Moore\nmmflint@aol.com\nwww.michaelmoore.com\n\n\n\n\n---\nYou are currently subscribed to Mike's Message as: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe click on the link below:\n\nhttp://go.netatlantic.com/u?id=52827208F&l=michaelmoore\n\n\n"}