{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Arnoud Engelfriet <arnoud@engelfriet.net>", "subject": "Re: Logo trademark license vs. copyright license", "body": "Francesco Poli wrote:\n> On Sun, 15 Apr 2007 21:24:00 +0200 Arnoud Engelfriet wrote:\n> > The sign [X] (hereafter \"the Mark\") is a trademark, rights to which\n> > are held by [Y], representing [Z] if applicable (hereafter \"the\n> > Mark Holder\").\n> \n> Wait, the \"Mark Holder\" would be [Y], I think.\n\nI thought you used Y and Z for cases where Y is licensing Z's\ntrademark (if Y is Z's subsidiary or authorized licensee for example).\nThen the trademark holder is Z but Y has certain rights to the mark.\n\nThe \"if applicable\" means if there is a Z. Perhaps the whole Z thing\nshould be taken out. \"Rights to which are held by Y\", and in the\ndocument where you define Y you can explain that Y is a subsidiary\nof Z or whatever.\n\n> | If the Mark qualifies as an original work of authorship under\n> | copyright law, then the Mark Holder hereby also grants you a copyright\n> | license, but that is not a trademark license and should not be\n> | construed as one.\n\nThat's what I meant. \n\nIf you're separating the two, I don't think the word \"also\" in the\nabove is appropriate. I guess in such a case you don't want to say\nmore than \"there's also a copyright license, go read that one, but\nremember it's not a trademark license.\" \n\n| If the Mark qualifies as an original work of authorship under\n| copyright law, then the Mark Holder SEPARATELY grants you a copyright\n| license, but that is not a trademark license and should not be\n| construed as one.\n\nThat word 'separately' makes it clear that this sentence is merely\nan explanation and not by itself a copyright license.\n\nArnoud\n\n-- \nArnoud Engelfriet, Dutch & European patent attorney - Speaking only for myself\nPatents, copyright and IPR explained for techies: http://www.iusmentis.com/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}