{"category": "ham", "to_address": "simo <idra@samba.org>", "from_address": "\"Gerald (Jerry) Carter\" <jerry@samba.org>", "subject": "Re: Short HOWTO on using git for Samba development", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nSimo,\n\nIt's a little mind bending to swap from the centralized\nworkflow to a distributed workflow.  I'm not claiming to\nhave figured it all out, but see comments below.\n\n> The only problem I see with git/bzr as the main tree is \n> that it seem to introduce a gatekeeper to the \"official\"\n> tree forcing all people to send around patches instead of\n> just committing.\n\nThe beauty is that there is no master tree. Everyone just\nhas their own tree.  Currently the svn model force feeds\nchanges to developers everytime you run \"svn up\".  The upside\nis that there is an easy way to run top of tree.  The\ndownside is that people too often use \"svn commit\" as the\nsave button.  This is basically what svk tried to solve.\n\nUsing a DSCM forces individual developers to pull others\ntrees (which can be automated via cron jobs).  But by the\ntime the patches end up in the stable tree, they should\nbe well tested and ready to go.\n\nThe other advantage of using something like git is that\nbranch maintenance is reduced as individuals no longer\nhave to checkin to multiple branches.  The SAMBA_3_0_*\nbranches we have in svn will simply go away.  Of course,\nthe patch release model doesn't go away, but the responsibility\nshifts.\n\n> This work flow model is ok if a few people work on a \n> very isolated part of a tree, or on some experimental\n> features, but if you need to collaborate it may\n> make things more annoying.\n\nI don't see any change here.  Instead of \"svn commit && svn up\",\nyou have \"git commit && git pull\".  This would also allow for\nmore of a maintainer model than we have now as well.\n\nAnyways, I'm not proposing any changes at this time.  I plan\nto spend the next couple ofmonths using git for daily\ndevelopment.  If things go well, there's a string possibility\nI will bring it up for discussion around the CIFS workshop\nin Sept.\n\n\n\n\n\ncheers, jerry\n=====================================================================\nSamba                                    ------- http://www.samba.org\nCenteris                         -----------  http://www.centeris.com\n\"What man is a man who does not make the world better?\"      --Balian\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\nComment: Using GnuPG with Mozilla - http://enigmail.mozdev.org\n\niD8DBQFGf9OKIR7qMdg1EfYRAqe5AKC0q5SCX89tKAIHNbH1a6NoPDjrzQCfYWGu\no5dfPdJYzR8mMf2mAAeJUWc=\n=aNvs\n-----END PGP SIGNATURE-----\n\n"}