{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\nPerformance \n\t\t\tBenchmarking For Energy Utilities\nSeattle, WA\n            May 23-24, 2007\n\nPandemic \n\t\t\tPreparedness For Utilities\nSeattle, WA\n            May 23-24, 2007\n\n\nCapacity \n\t\t\tMarkets\n\n\t\t\tWashington, DC\n\nJune \n4-6, 2007\n\nCoal-to-Liquids \n\t\t\tFinance and Development Summit\n\n\t\t\tNew York, NY\n\nJune \n4-6, 2007\n\n\nStrategies for \n\t\t\tBidding Ancillary Services in LMP Markets\n\nIndianapolis, IN\n\nJune 6-7, 2007\n\n\nIntro to Electric \n\t\t\tUtility Systems for Non Engineers\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nDistributed \n\t\t\tEnergy Resources-Emerging Business Models for Utilities\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nTHIS WEEK AT EIA (Volume 9, Issue 18) (May 4 - May 10, 2007)  \n\n\n\nEIA - May 10, 2007 - THIS WEEK AT EIA is a list summarizing and providing URLs for every Energy Information Administration (EIA) product released during this week.\n\n\nMay 10, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for May 10, 2007  \n\n\n\nFirst Enercast Featured Articles for May 10, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 10, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 9, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 9, 2007\n\n\nMay 10, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 10, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 10, 2007\n\n\nMay 10, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nDuke seeking easier nukes: Rogers wants smoother regulatory path for plant approvals\n\n\n\nMay 9--As his company reported reduced first-quarter earnings, Duke Energy Chief Executive Jim Rogers said Tuesday smoothing the way for nuclear plant construction is a major challenge for Duke to boost future profits.  The importance of nuclear energy is a familiar message from the Charlotte CEO, who wants an easier regulatory road for building twin reactors in Cherokee County, S.C., by 2016. ...\n\n\nMay 9, 2007 Knight Ridder Tribune Business News\n\n\n\nToledo Edison parent to seek 2009 fee hike: Separate surcharge to end; customers would save $9.46 a month\n\n\n\nMay 9--The parent firm of Toledo Edison plans to raise its charge to distribute power in 2009, but said that an average customer bill should drop because of the end of a separate surcharge it has leveled for three years.  Overall, the changes needing approval of state regulators mean a Toledo Edison customer using 750 kilowatts a month would have a $9.46 drop in his monthly bill.\n\n\nMay 9, 2007 Knight Ridder Tribune Business News\n\n\n\nOhio Edison bills might go down: FirstEnergy proposes to end one rate, raise another; result is lower payments\n\n\n\nMay 9--Akron-based FirstEnergy Corp. on Tuesday notified the Public Utilities Commission of Ohio that it will request an increase in its distribution rates, effective Jan. 1, 2009, for Ohio Edison.  However, customers will see a net decrease in their bills because at the same time the proposed rate increase would take effect, another portion of their bill -- the \"transition costs\" -- would be ...\n\n\nMay 9, 2007 Knight Ridder Tribune Business News\n\n\n\nWind turbine plan approved: Wisconsin Power and Light to operate Fond du Lac County farm\n\n\n\nMay 10--Wisconsin regulators on Wednesday approved construction of 41 wind turbines in Fond du Lac County that will provide power for up to 30,000 customers of Madison-based Wisconsin Power and Light Co.  The $180 million project is expected to go into operation at the end of 2008. Cedar Ridge wind farm will be located on a 12.2-square-mile area in the towns of Eden and Empire -- an area known ...\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nTXU records loss of $497 million: All is not lost as cold winter saw rise in retail revenue, subsidiary gain\n\n\n\nMay 10--Dig below the gloomy first-quarter loss figures from TXU Corp. and you find a company that managed pretty well despite halting a giant build-out program and cutting prices.  The company faced a hostile environment during the quarter that it received a buyout bid that broke all records. TXU said \"lower average retail pricing, customer attrition, an increase in the average cost of fuel and ...\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nChugach balks at wind farm\n\n\n\nMay 9--The change in leadership at the state's biggest electric company late last month has caused the utility to take a more critical look at a wind farm proposed for Anchorage's Fire Island.  The new majority on Chugach Electric Association's board campaigned on a cost-savings platform. It is raising questions about whether the wind farm makes financial sense.\n\n\nMay 9, 2007 Knight Ridder Tribune Business News\n\n\n\nPR executive foresees Inland area as major economic, social center\n\n\n\nMay 9--AARON KNOX  Title: President Company: TMG Communications Inc. Type of Industry: Public relations and public affairs Location: Riverside, with offices in Palm Desert and Victorville No. of employees: 12 Revenue: Undisclosed Year founded: 1989 Public relations head ushers in Inland growth  Over the past two decades, Inland Southern California has changed from a mostly rural afterthought into ...\n\n\nMay 9, 2007 Knight Ridder Tribune Business News\n\n\n\nTEP ordered to file proposals on calculating rate changes\n\n\n\nMay 9--State regulators have ordered Tucson Electric Power Co. to file a formal rate case to determine how its rates will be set after a freeze ends at the end of 2008.  The Arizona Corporation Commission prompted TEP to file three proposals by July 2. One will be market-based rates, which TEP favors. Another will be a \"cost of service\" regulation, with rates based on costs and an allowed maximum ...\n\n\nMay 9, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nCost of reopening U.S. nuclear reactor shows how difficult it will be to build new facilities\n\n\n\nWASHINGTON: The Tennessee Valley Authority plans to reopen its Browns Ferry 1 nuclear reactor this month - 22 years after it was shut for safety reasons and five years after extensive renovations began. The move reflects the increased interest in nuclear power as an energy source that does not contribute to global warming. But the government agency's willingness to spend $1.8 billion on the ...\n\n\nMay 9, 2007 International Herald Tribune\n\n\n\nProgress Moves Full Steam Ahead On Levy County Nuclear Plant Site\n\n\n\nProgress Moves Full Steam Ahead On Levy County Nuclear Plant Site Skip directly to the full story. By RUSSELL RAY The Tampa Tribune Published: May 10, 2007 More from this channel: This feature requires the Macromedia Flash Plugin. Please visit http://www.macromedia.com/go/getflashplayer to download this plugin.  Search for more information:  TBO.com Site Search | Tribune archive from 1990 ST. ...\n\n\nMay 10, 2007 Tampa Tribune\n\n\n\nRevised plan submitted for rejected wind farm\n\n\n\nAUGUSTA - Developers of the Redington Wind Farm, whose plan for 30 turbines on two western Maine mountains was rejected by state regulators earlier this year, said they will submit plans for a scaled-back project as early as this week. In January, the Land Use Regulation Commission voted down a plan calling for 18 turbines on Black Nubble Mountain and 12 on Redington Pond Range.\n\n\nMay 10, 2007 Bangor Daily News\n\n\n\nStop coal-fired power\n\n\n\nAs a resident of Sevier County, I would like to publicly thank the Utah Moms for Clean Air and the Utah Physicians for a Healthy Environment as they seek a moratorium on construction of new coal-fired power plants in Utah. A group of citizens in Sevier County called Sevier Citizens for Clean Air and Water, Inc. has been fighting for six years to stop the coal-fired power plant proposed by TDA ...\n\n\nMay 9, 2007 Salt Lake Tribune\n\n\n\nNew task force takes up wind power\n\n\n\nto review rules, incentives and siting guidelines for new wind power projects in Maine. The Governor's Task Force on Wind Power Development in Maine may recommend changes in the way projects are evaluated by the state. It also will explore technologies, identify benefits and incentives available to communities, help developers find the best locations for their projects and propose goals for wind ...\n\n\nMay 9, 2007 Portland Press Herald\n\n\n\n\n\nDominion's Free Video Helps Explain Customers' Natural Gas Supply Options\n\n\n\nUnderstanding the choices that customers have when it comes to buying natural gas just got easier, thanks to a free video from Dominion East Ohio.     (Logo: http://www.newscom.com/cgi-bin/prnh/20000831/DLOGO )     The six-minute video covers a number of topics, including the different selections available such as the Standard Service Offer (SSO), Energy Choice and aggregation.\n\n\nMay 9, 2007 PR Newswire\n\n\n\nComverge Announces California Public Utility Commission's Approval of Its C&I Demand Response Program with Pacific Gas & Electric Company\n\n\n\nEAST HANOVER, N.J., May 9 /PRNewswire-FirstCall/ -- Comverge, Inc. (Nasdaq: COMV) ('Comverge'), a leading provider of clean energy solutions through demand response, announced today that the California Public Utilities Commission has approved its Demand Response Purchase Agreement with Pacific Gas and Electric Company (PG&E). Under the agreement, a Virtual Peaking Capacity (VPC) program will ...\n\n\nMay 9, 2007 PR Newswire\n\n\n\nWebcast Alert: Johnson Controls Energy Efficiency Indicator Webcast\n\n\n\nJohnson Controls (NYSE: JCI) will release the results of the first-ever Energy Efficiency Indicator, a research report that examines how much North American businesses anticipate energy prices to increase and the actions they plan to take to combat those increases. Immediately following the research presentation, a panel of executives representing various organizations will describe their ...\n\n\nMay 9, 2007 PR Newswire\n\n\n\nWhiteFence Relaunch Improves Customer Experience\n\n\n\nHOUSTON--(BUSINESS WIRE)--WhiteFence today announced the relaunch of WhiteFence.com, the popular online comparison shopping marketplace for residential utilities and home services. WhiteFence provides the largest online one-stop comparison marketplace for consumers looking to compare and order essential home services, including electricity, natural gas, home phone, high-speed Internet, cable and ...\n\n\nMay 9, 2007 Business Wire\n\n\n\nToromont Sells Halton Property\n\n\n\nToromont Industries Ltd. (TSX: TIH) announced today that it has completed the sale of a 60-acre parcel of land in the Region of Halton for proceeds of $18 million. As a result of the sale, Toromont will recognize a gain of $12.9 million after tax, or approximately $0.20 basic earnings per share, in the second quarter of 2007.  Toromont Industries Ltd. (TSX: TIH) announced today that it has ...\n\n\nMay 9, 2007 Internet Wire\n\n\n\nWells Fargo Commits to Finance Fifth Wind Energy Project\n\n\n\nWells Fargo & Company ('Wells Fargo'), has committed to making an equity investment in the Fenton Wind Energy Project, Minnesota's largest wind farm, and Wells Fargo's fifth wind energy investment commitment in less than one year. Working with several other leading financial institutions, Wells Fargo will provide approximately $160 million in equity capital to the five projects, which will have ...\n\n\nMay 9, 2007 PR Newswire\n\n\n\nWorld Energy Solutions, Inc. Annual Meeting of Stockholders\n\n\n\nWORCESTER, MA, May 9 /PRNewswire-FirstCall/ - World Energy Solutions, Inc. (TSX: XWE) today announced it will hold its Annual Meeting of Stockholders on Thursday, May 17, 2007 at 10:00 a.m. ET.     WHAT:     WORLD ENERGY SOLUTIONS, INC.               ANNUAL MEETING OF STOCKHOLDERS     WHERE:    THE HILTON GARDEN INN  35 MAJOR TAYLOR BOULEVARD               WORCESTER, MASSACHUSETTS WHEN:     ...\n\n\nMay 9, 2007 PR Newswire\n\n\n\n\n\nCalpine Energy Services agrees to $4.5 million civil penalty to resolve self-reported shipper-must-have-title violations\n\n\n\nCalpine Energy Services agrees to $4.5 million civil penalty to resolve self-reported shipper-must-have-title violations The Federal Energy Regulatory Commission today issued an order approving a Stipulation and Consent Agreement requiring a Calpine Corporation affiliate, Calpine Energy Services, L.P. (CES), to allow a $4.5 million civil penalty claim in its bankruptcy proceeding to resolve ...\n\n\nMay 9, 2007 Federal Energy Regulatory Commission\n\n\n\nLehman to buy out Houston gas marketer Eagle Energy Partners\n\n\n\nNew York (Platts)--9May2007 New York investment bank Lehman Brothers said Wednesday it has agreed to buy out Houston natural gas and power marketer Eagle Energy Partners, founded in 2003 by former Dynegy CEO Chuck Watson. Lehman will acquire the two-thirds of Eagle it does not already own and combine Eagle's physical energy commodity marketing with Lehman's trading operation in financial energy ...\n\n\nMay 9, 2007 Platts\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nSouth Korea seeks cleaner energy sources\n\n\n\nSEOUL: South Korea plans to break ground for the world's biggest solar power plant on Thursday as it tries to diversify its power sources and use cleaner energy. The $170 million plant, along with the world's largest tidal power plant that is already under construction off the country's west coast, is part of an aggressive effort to seek new and renewable energy sources at a time when global ...\n\n\nMay 9, 2007 International Herald Tribune\n\n\n\nS. Korea to have world's top solar plant\n\n\n\nFront Page&gt; UPI Page advertisement SEOUL, May 9 (UPI) --  South Korea will have the world's largest solar power station in 2008 that will help the energy-poor country cope with high fuel costs. South Korea's Dongyang Engineering and Construction and Germany's SunTechnics will build a 20-megawatt solar plant in South Korea's southwest port town of Sinan by 2008, the companies said Wednesday. ...\n\n\nMay 9, 2007 Washington Times\n\n\n\nEvelop and Ballast Nedam Acquire Exclusive Rights to Develop Offshore Wind Farm 'Scheveningen Buiten'\n\n\n\nUTRECHT/NIEUWEGEIN, The Netherlands, May 9 /PRNewswire-FirstCall/ -- On 26 April, Rijkswaterstaat Noordzee announced that the permit application, including the EIA (Environmental Impact Assessment ) submitted by Evelop International and Ballast Nedam Concessies (Concessions) for the offshore wind farm Scheveningen Buiten has been approved. No further applications for this location will be ...\n\n\nMay 9, 2007 PR Newswire\n\n\n\nPower giant 'cashes in by keeping price cuts to itself'\n\n\n\nPowergen was accused of giving customers a raw deal after it revealed that its profits have soared tenfold. Experts put the boom down to the energy firm's failure to pass on cheaper wholesale gas prices to its customers. E.ON, the German parent company of the firm - which has six million customers in Britain -announced that Powergen's profits soared to 296million in the first quarter of 2007. ...\n\n\nMay 10, 2007 Evening Standard\n\n\n\nEDF Energies Nouvelles: First-Quarter 2007 Revenues: EUR 47.7 Million\n\n\n\nPARIS--(BUSINESS WIRE)--Regulatory News: EDF Energies Nouvelles (Paris:EEN) has reported near-stable consolidated revenues for the first quarter of the 2007 financial year. The key trends were as follows: a significant increase in Generation revenues to 44 million (up 23.9%), driven primarily by very strong growth in electricity generation using wind energy, an insignificant first quarter in ...\n\n\nMay 10, 2007 Business Wire\n\n\n\nWind financing grows despite risks\n\n\n\nMILAN, Italy, May 9 (UPI) --  Outdated coal and nuclear plants across Europe will need to be replaced in coming years, and investors are picking renewables. 'The renewable industry is here to stay, the investment community would not get involved otherwise and I wouldn't have said that maybe three years ago,' said Nick Gardiner, director of the Energy &amp; Utilities Group, Fortis, United Kingdom. ...\n\n\nMay 9, 2007 Washington Times\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}