{"category": "spam", "to_address": "l_ttery_drw@hotmail.co.uk", "from_address": "UK_LOTTERYDRWS_5 OFFICE <UK_LOTTERYDRWS_001@web.de>", "subject": "CONGRATULATIONS!!!", "body": "  EURO MILLIONS LONDON UK.PRICE AWARD DEPARTMENT.REF: UK/4920X2/68BATCH: 084/05/ZY360                                               WINNING NOTIFICATIONCONGRATULATIONS!!!We the Board and Management of Euro Millions London, UK wishes to inform you the results of the E-mail address ballot lottery international program held on 8th day of June, 2007. It is yet to be claimed and you are getting the final NOTIFICATION as regards this.This results is today released to you and Your e-mail address attached to ticket number:56475600545 189 with Serial number 5368/05 drew the lucky numbers.which subsequently won you the lottery in the 2nd category .You have therefore been approved to claim a total sum of £800,000 {Eight hundred thousand Pounds Sterlings) in cash credited to file KTU/9023118308/03.This is from a total cash prize of £8,000,000{Eight million pounds sterling} shared amongst the(10)lucky winners in this category. All participants for the online version were selected randomly from World Wide Web sites through computer draw system and extracted from over 100,000 unions, associations, and corporate bodies that are listed online. This promotion takes place bianually.CONGRATULATIONS!!!Due to mix up of some numbers and names, we ask that you keep your winning information confidential until your claims has been processed and your money Remitted to you. This is part of our security protocol to avoid double claiming and unwarranted abuse of this program by some participants.Please note that your lucky winning number falls within our Europe/Africa booklet representative office in UK as indicated in your play coupon, In view of this, your £800,000 {Eight hundred thousand Pounds Sterlings} will be released to you by any of our payment offices in Europe or AfricaEndeavor to Quote your reference/batch numbers in your correspondence with us and you are advised not to expose your numbers to avoid double clamming and unwarranted abuse of this program or you winnings will be void Please be warned. To file for your claim, please contact our fiduciary agent: MR.CLIFF ALEXANDEREmail:  uk.draw.consultantxx@gmail.comEmail:  uk_draw_agent@yahoo.comPHONE:  +44-703-183-4571  For further clarification/verification of your claims. Please contactyour fiduciary agent through the above, EMAIL ADDRES,AND PHONE NUMBER) stated in this notification e-mail. You are to fill the information below to enable you file your winnings sum. Full Names:...................................................................Physical Address:......................................................Nationality:............................... City............................Profession:....................................................................Company...................................................Age:................................................................................Sex:...............................................................................Marital status:..........................................................Winning numbers:..................................................Batch number:........................................................Amount won:............................................................Phone number{land/mobile}:............................                                       LOTTERY SPONSORS: CHIEF SPONSORS; MICROSOFT CORPORATION UK,             MICROSOFT CORPORATION AFRICA, MICROSOFT CORPORATION USA,           MICROSOFT CORPORATION ASIA.  Past winners.        Dr. Lucas Abel (Promotional Manager)                                                                       For ( UK NATIONAL DRAWS) Erweitern Sie FreeMail zu einem noch leistungsstärkeren E-Mail-Postfach!\t\t   Mehr Infos unter http://produkte.web.de/club/?mc=021131  \n"}