{"category": "ham", "to_address": "Don Hopkins <dhopkins@DonHopkins.com>", "from_address": "Dan Williams <dcbw@redhat.com>", "subject": "Re: [sugar] eBook Reader user interface", "body": "On Tue, 2007-06-05 at 12:38 -0700, Don Hopkins wrote:\n> print \"Hello world!\"\n> \n> I have made a version of the Read activity that supports navigation\n> and control with the gamepad, and has a few new features and\n> improvements. \n> The main problem is getting the two gamepads to send unique keycodes\n> that are not the numeric keypad arrow keys it currently sends (because\n> those are already bound to functions that don't do the appropriate\n> thing). \n> The problem right now is that somebody needs to run the command \"chmod\n> a+rwx /dev/input/event1\" to give Python the permission to perform the\n> ioctl that remaps the keys. \n> The solution to that problem is to decide on a standard set of\n> keycodes and have the operating system set them when it boots. \n> I have tried several sets of keycodes, unsuccessfully. The higher\n> keycodes with numbers >512 never seem to make it to the X server. \n> I tried using the keycodes for the higher numbered function keys\n> (KEY_F13 [183] - KEY_F20 [190]), which made it to the X server, but\n> all report X keycodes 0. \n> There may be some magic that needs to be done in\n> the /etc/X11/xorg.conf file to admit those keycodes, or maybe some\n> other arcane X server configuration. \n> So for now I am mapping to the letters \"esdx\" and \"ijkm\" to test out\n> the gamepad code until the OLPC has a fixed set of distinguishable\n> keypad keycodes. \n> It will be very nice to have a gamepad text input method like\n> triggerfinger or dasher, to input real text in book mode! \n> \n> The next issue is rotation. I have made the activity respond to top\n> level window resize events by running \"xrandr\" to figure out which\n> direction the screen is rotated. \n\nI think the plan here is to have Sugar or the hardware manager send out\nevents so that activities know when the screen is rotated.\n\n> Then it remaps the behaviors it assigns to the gamepads according to\n> the screen rotation. \n> I think screen rotation should be handled by the application, not the\n> operating system, because in some cases the application might want to\n> associate commands with the LABELS of the gamepad keys instead of the\n> DIRECTIONS of the keys, so it would not want to rotate their meaning. \n\nSo basically, you mean not _rotation_ handled by the activity, but\nallowing the game button meanings to be specified by the activity\ndepending on variables like rotation, right?\n\n> For example, a tic-tac-toe game that wanted to use X for X and O for O\n> would not want to remap the keys on screen rotation! (Admittedly\n> contrived, but hey it's a popular game!) c(-;\n> It would be great if there were a way to find out the screen rotation\n> via dbus. Maybe there is but I just haven't figured it out yet. Could\n> we add that, if it's not yet supported, please? \n\nYes, that's the way it should work.\n\n> Also, I wrote some stuff in the comments of the bug about the screen\n> rotation button: it's waaaaay too easy to rotate the screen\n> accidentally (not to mention turn the machine off accidentally,\n> ESPECIALLY when the screen is upside down and you reach for what you\n> think is the rotation button!!!)... \n\nThe power button functionality will be changed to put the machine to\nsleep rather than power off.  We may have a 2-second timeout before it\nsleeps though, to alleviate this problem further.  Note that it's the EC\nthat dictates the 4-second poweroff when holding down the power button,\nand we can't change that behavior easily.  We can make momentary presses\nof the power button, or holding it down up to 4 seconds, do anything we\nwant fairly easily though.\n\n> I propose that both the screen rotation button and the power button\n> simply pop up big fat obvious dialogs that pop down and do nothing if \n\nDialogs aren't the right solution here.\n\n> you press the button again, but require you to either press and hold\n> the button, or press another button (like the arrow keys) to actually\n> rotate the screen or power the system down.\n\nThat's pretty indirect; I'd argue the more direct the better.  The\nbutton has a rotation icon, and when you press it, it should rotate the\nscreen.\n\n> That will let users rotate the screen absolutely in one shot with the\n> arrow keys without going through all the intermediate rotations. \n> Rotating is extremely expensive because it laboriously repaints the\n> entire screen, requiring the application to do all kinds of memory\n> allocation of giant page sized double buffers. So it should be very\n> hard to do it accidentally, while right now it's very hard not to do\n> it accidentally. \n\nThis is not a problem with the B3 units and the LX processor, because\nthe LX is (a) faster and (b) can accelerate resizes.  It's so damn quick\non the LX you'll be literally blown away after seeing it on a B1/B2.\nObviously the activity has to redraw; but that should already be as fast\nas possible.\n\n> Of course the consequences of accidentally shutting the system down\n> with a mere press of the button are much worse, so the same thing goes\n> tenfold for the power button! \n\nAgain, slated to be fixed.\n\n> Kids will naturally go straight for the buttons on the screen and\n> press them many times in a row, so that should not cause any harm,\n> delay or distress. \n> \n> See: Rotating in reverse and/or better feedback for the rotate button\n> http://dev.laptop.org/ticket/1049\n> \n> Also: Rotate handheld keys with screen\n> http://dev.laptop.org/ticket/1443\n> \n> I decided to use the directional arrows for scrolling withing the page\n> selected, for when the entire page doesn't fit on the screen, or when\n> you're in continuous mode. \n> That is because it's possible to press the directional arrows\n> diagonally, sending two keycodes at once, which makes sense for\n> directional scrolling commands but not for discrete commands. \n> I used the other 4 button gamepad for discrete user interface\n> navigation commands. The left one and the right one move to the\n> previous and next selected button, in the same direction as they\n> appear on the screen.\n\nEben has some ideas on what the game buttons should mean when the\nkeyboard isn't available (ie, ebook mode).  We may want to standardize\nsome of the buttons so that you can do things like switch activities\nwhile in ebook mode, which would mean assigning some of the game\nkeycodes to standard Sugar actions, not activity actions.\n\n> The bottom one activates the selected button. The top one goes to the\n> first button. These button mappings rotate with the screen\n> appropriately. \n> \n> I added a couple buttons for \"first page\" and \"last page\", and I also\n> added another toolbar of \"View\" commands, including sizing: fit width,\n> best fit, zoom in, zoom out; rotating: rotate left, rotate right; and\n> toggle buttons for display mode: dual page, continuous. \n\nWe've got to keep in mind that the default UI should be as simple as\npossible, which should be the case here even with these additions.  ie,\nyou don't have to care about any of the options above unless you really\nneed to.  That's what nice about the toolbars; they aren't there and\nclickable when you open the activity.  Just keep in mind that for things\nlike the reader, the basic UI should keep out of the way until you\nreally need the function, which should then be easy to get to.\n\n> When you use the gamepad to navigate between user interface buttons,\n> it wraps back and forth from end of one toolbar to the beginning of\n> the other. \n> Gamepad navigation ignores the \"activity\" toolbar (for now). \n> When you navigate with the gamepad, it warps the mouse cursor so it's\n> in the upper right corner of the button.\n> I was hoping that warping the mouse into the button would be enough to\n> trigger the tooltip, but apparently not. \n> I have been looking into how to pop up and tear down the tooltip under\n> program control without resorting to ugly hacks like faking events,\n> but I can't figure out a way to do it short of hacking the C code. \n> Any suggestions? The other approach is not to use GTK tooltips at all,\n> and implement some nice Sugar tooltips that do the right thing, and\n> allow us to add more features like internationalized text (if that's\n> not already supported -- I dunno) and icons and animation and nice\n> stuff like that. \n> The tooltips in gamepad mode should be smart enough to pop up when you\n> navigate to a button, then go away after a few seconds or after you\n> use the button.\n> If you try to use a button that's \"not allowed\" (my alternative to\n> gtk's broken \"not sensitive\" which unfortunately disallows tooltips\n> and keyboard navigation), a tooltip should pop up explaining why the\n> operation is not allowed and what you can do to allow it. \n> I have written all the code to set the tooltip to the most important\n> explanation when buttons are not allowed (i.e. the \"back page\" button\n> says \"you need to load a document first\" if no doc is loaded, or\n> \"you're already at the first page\" if you do havea doc but you're on\n> the first page [duh]). \n> It's just that the tooltips don't display when I want them to, and\n> currently there is no visual indication that the button is not\n> allowed. I suppose the \"not allowed\" state should look just like the\n> \"not sensitive\" state, except that they let you navigate to the button\n> with the gamepad and display tooltips. \n> \n> I made a mixin class for widgets that includes intrinsics for gamepad\n> navigation, as well as some other useful stuff (like tooltips, and\n> disabling them without breaking keyboard navigation and tooltips). \n> It also lets (no, requires!) you to associate an \"info\" dictionary\n> with each widget, that tells the system useful stuff about the widget,\n> including the icon, default tooltip, and whether or not it's\n> accessible via the game controller keypad. \n\ninteresting; sounds useful\n\n> The toolbars have a method that returns a list of their navigable\n> widgets, and the application concatenates the widget lists of all\n> toolbars, handles keyboard events, and manages to navigate between\n> them. \n> (This gamepad navigation is in place of the standard GTK tab/arrow key\n> navigation, which I consider flawed and too hard-wired to fix, so I\n> just programmed around it. For example, on top of the focus and\n> tooltip problems, when you arrow to a text field, you're stuck and\n> can't arrow out!) \n> I made the search text field as well as the find next / previous\n> buttons inaccessibly from the game controllers, because currently\n> there is no way to input text when the keyboard is hidden. \n\nAlso, B3 units have replaced the Camera key with a Search key that when\npressed should automatically focus the search field or something like\nthat.\n\n> Once we have a gamepad based text input method we can hook that up to\n> the search field and enable it for navigation. \n> \n> I put in placeholder \"programmer art\" with text labels for the buttons\n> I added, which are ugly enough to remind everyone that we need real\n> icons, but I'm not a good enough artist to come up with appropriate\n> icons. \n>  \n> One usability problem I noticed is with the toggle buttons: the \"mouse\n> over\" highlighting obscures (overrides, conflates, is the same as) the\n> highlighting that tells you if the button is selected or not, so once\n> you're pointing at the button you have no idea about its current\n> state, and no feedback after you click it to change the state, that\n> the state was actually changed (modulo the actual effect of the button\n> toggle on the application of course). The \"mouse over\" highlighting\n> should be orthogonal to and composeable with the \"checked\"\n> highlighting. Moving over the toggle should activate the \"mouse over\"\n> highlighting but not change the \"checked\" highlighting. Pressing down\n> and holding should keep the \"mouse over\" highlighting and toggle the\n> \"selected\" highlighing to feedback that it will enter that state iff\n> you release while still in the button. If you move out of the button\n> while holding down the mouse, the \"mouse over\" should de-highlight and\n> the \"checked\" should go back to the previous state, to feedback that\n> pressing down and moving out is a no-op that cancels the toggle\n> action, and nothing should change when you release the button to\n> toggle (but of course you should be able to slide back in to resume\n> the \"mouse over\" and \"check toggled\" state, then release to toggle\n> it. \n\nCheck out how GTK theme states are done; there are 5 states and each\nshould be visibly independent of the others.  They are something like\nDISABLED, NORMAL, SELECTED, PRELIGHT, and one I forget.  It's quite\npossible that the Sugar GTK theme doesn't implement all of these\ncorrectly.\n\n> I heard a rumor that somebody had decided on some unique keycodes for\n> the gamepad. Is that true? What are they? Once I know, I'll put them\n> into the reader and put up a copy for people to try out. (Right now it\n> requires opening a shell and running chmod as root to get it to work,\n> which is kinda clumsy, but a great way to force kids to learn Linux,\n> you gotta admit.) \n\nJim Gettys is dealing with the X keycodes; but we're busy getting Xorg\n1.3/(X 7.3) into the builds so that we can actually do more flexible\ninput stuff like all this requires.\n\nDan\n\n>     -Don\n> \n> \n> Zvi Devir wrote: \n> > I have been collecting a few (more than a few) usability bugs and UI \n> > suggestions, which will hopefully be compiled to a list next month.\n> > \n> > In the meanwhile, I would like to share a couple of ideas regarding the \n> > mapping of the gamepad keys [which I hope won't state the obvious too much].\n> > \n> > Currently, the UP/DOWN/LEFT/RIGHT keys have a fixed functionality \n> > regardless of the screen orientation. This isn't a correct logic, as the \n> > expected functionality changes according to the current orientation. I \n> > guess the easiest way to implement this kind of behavior would be using \n> > a smart key mapping mechanism in X.\n> > Another thought -- the current input method treats those keys as \n> > direction keys. However, a better input method may be emulating the \n> > functionality of the mouse (touch pad) using the gamepad keys. In tablet \n> > mode this can really improve the user experience.\n> > \n> > Just my $0.04.\n> >     Zvi\n> > \n> > \n> > Don Hopkins wrote:\n> >   \n> > > Goal for improving the eBook reader user interface:\n> > > \n> > >   I've been doing some exploratory programming with GTK and Sugar,\n> > >   trying to improve the user interface of the eBook reader, and make\n> > >   it useable in book mode with the gamepad.\n> > > \n> > >   + Support the game keypads in eBook mode. \n> > > \n> > >     + Low level game keypad support\n> > > \n> > >       Need to remap low level keyboard scan codes to Linux keyboard codes. \n> > > \n> > >       The setolpckeys.c program remaps the keys and gamepad buttons.\n> > > \n> > > \tCurrently it maps both gamepads to the numeric keypad keys (KEY_KP8, etc),\n> > > \twhich the X server and GDK translates to directional keys (GDK_Up, etc).\n> > > \n> > > \tI tried to map them to buttons (BTN_A, etc), but the X server seems \n> > > \tto ignore keycodes in that range. \n> > > \n> > > \tThe xorg.conf file has a keycode mask that looked like it might help, \n> > > \tbut I couldn't get it to work. \n> > > \n> > > \tNeed to have unique keycodes reported for each of the two gamepads, \n> > > \twhich are not the same as any keyboard keys, without any predefined meanings\n> > > \tlike arrow keys have. \n> > > \n> > > \tNeed to define special purpose keycodes just for the OLPC gamepad,\n> > > \tinstead of trying to reuse existing but not appropriate keycodes. \n> > > \n> > > \tWhat is the process for defining new keycodes in ?\n> > > \n> > > \tHere's my strawman proposal for some new keycodes. \n> > > \n> > > \t  Use keys (\"KEY_*\") instead of buttons (\"BTN_*\"), since they\n> > > \t  seem to work better.\n> > > \n> > > \t  The 0x1b* range seems to be unused in , \n> > > \t  and it's between other groups of keycodes, so I'll\n> > > \t  propose using that range for the OLPC. \n> > > \n> > > \t  The UP/DOWN/LEFT/RIGHT keys correspond to the directional\n> > > \t  keypad.\n> > > \n> > > \t  #define KEY_XO_GAMEPAD_UP      0x1b0\n> > > \t  #define KEY_XO_GAMEPAD_DOWN    0x1b1\n> > > \t  #define KEY_XO_GAMEPAD_LEFT    0x1b2\n> > > \t  #define KEY_XO_GAMEPAD_RIGHT   0x1b3\n> > > \n> > > \t  The NORTH/SOUTH/EAST/WEST keys correspond to the other\n> > > \t  buttons. Those names are agnostic to the button labels,\n> > > \t  which may change from the current Playstation buttons\n> > > \t  (X/O/Triangle/Square). Can anyone suggest better names for\n> > > \t  the four buttons on the right?\n> > > \n> > > \t  #define KEY_XO_GAMEPAD_NORTH   0x1b4\n> > > \t  #define KEY_XO_GAMEPAD_SOUTH   0x1b5\n> > > \t  #define KEY_XO_GAMEPAD_EAST    0x1b6\n> > > \t  #define KEY_XO_GAMEPAD_WEST    0x1b7\n> > > \n> > > \t  While we're at it, we could define keycodes for the other\n> > > \t  OLPC buttons and switches on the screen. I think there are\n> > > \t  some other sensor switches that could generate keycodes,\n> > > \t  like opening the screen, rotating it around, and putting it\n> > > \t  into book mode, so I will make some guesses at names for\n> > > \t  them, just to get the discussion rolling. \n> > > \n> > > \t  #define KEY_XO_SCREEN_ROTATE   0x1b8\n> > > \t  #define KEY_XO_SCREEN_POWER    0x1b9\n> > > \t  #define KEY_XO_SCREEN_OPEN     0x1ba\n> > > \t  #define KEY_XO_SCREEN_CLOSE    0x1bb\n> > > \t  #define KEY_XO_SCREEN_IN       0x1bc\n> > > \t  #define KEY_XO_SCREEN_OUT      0x1bd\n> > > \n> > > \t  Is there an exhaustive list of all buttons and switches and\n> > > \t  events on the OLPC? Are any more planned? Which ones should\n> > > \t  be assigned keycodes?\n> > > \n> > >       Rewrote setolpckeys.c code in Python (just uses ioctl, but needs to know keycodes).\n> > > \tWriting utilities like that in Python instead of C makes it easier to \n> > > \treconfigure the keys on the OLPC without a C compiler. \n> > > \n> > >     \n> > \n> > \n> > _______________________________________________\n> > Devel mailing list\n> > Devel@lists.laptop.org\n> > http://lists.laptop.org/listinfo/devel\n> >   \n> \n> _______________________________________________\n> Sugar mailing list\n> Sugar@lists.laptop.org\n> http://lists.laptop.org/listinfo/sugar\n\n_______________________________________________\nSugar mailing list\nSugar@lists.laptop.org\nhttp://lists.laptop.org/listinfo/sugar\n\n"}