{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Morning HTML\" <cbsnews_weekday_morning_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 25, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESAl-Sadr Reappears In Iraq At Rally\nFirebrand, anti-American cleric Muqtada al-Sadr has appeared in public for the first time in months, leading a huge rally\n                        in one of Iraq's holiest Shiite cities. He's thought to be jockeying for political power in hopes of a U.S. troop reduction. More...Watch: One Missing Soldier Found Dead\n• Congress OKs War Funding, Minus Timeline• N. Korea Tests Short-Range Missiles• Minimum Wage Hike ApprovedU.S.New Tests Question JFK Lone Gunman Theory\nNew testing on the type of ammunition used in the 1963 assassination of President John F. Kennedy raises questions about whether\n                        Lee Harvey Oswald acted alone, according to a study by researchers at Texas A&M University. More...\n• Bizarre Execution In Ohio• FBI Releases Photos Of Deadly Bank Heist• Chandra Levy's Mother Wants Case Solved• More StoriesWorldU.S. Military Aid Reaches Lebanese Army\nU.S. military aid has been rushed into Lebanon, to help the army in its fight against an Islamic militant group holed up in\n                        a Palestinian refugee camp. Sporadic gunfire is still taking place near the camp's entrance, keeping the situation tense.\n                         More...Watch: Lebanon Cease-Fire Collapses\n• Al-Sadr Reappears In Iraq At Rally\n                     \t\t\t\t\t| Watch• N. Korea Tests Short-Range Missiles• Is Europe's Air Security Tight Enough?\n                     \t\t\t\t\t| Watch• More StoriesPoliticsCongress OKs War Funding, Minus Timeline\n\"We're going to have to fund them,\" said Sen. Joseph Biden, as he and other Democrats in Congress reluctantly approved billions\n                        to pay for the Iraq war, minus the troop withdrawal timeline that was previously met by a veto from President Bush. More...\n• CBS Poll: Clinton, Giuliani Still In Front• Minimum Wage Hike Approved• Fred Thompson Fuels Speculation In Ct.• More StoriesHealthWhen Health Coverage Doesn't Hold Up\nContinuing the CBS News Investigates series on questionable practices by health insurance providers to individuals,\n                        Armen Keteyian reports that for people with coverage, filing a simple, single claim can cost them big. More...Watch: Collecting On Insurance Claims\n• Tooth Whiteners: Something For Everyone• Pot During Pregnancy May Harm Fetal Brain• Study: Babies Understand Language Shifts• More StoriesSciTechBeing Here, Working There\nToday's videoconferencing technology is allowing film makers across the globe to meet face to face and moms to commute daily\n                        from Texas to California. John Blackstone has the story. More...Watch: Communicating On A New Level\n• Find Your Way To Latest GPS Devices• Whale Rescuers Take A Break \n                     \t\t\t\t\t| Watch• New Tests Question JFK Lone Gunman Theory• More StoriesBusinessMinimum Wage Hike Approved\nAmerica's lowest-paid workers won a $2.10 raise Thursday, with Congress approving the first increase in the federal minimum\n                        wage since 1997. By summer 2009, all minimum wage jobs will pay no less than $7.25 an hour. More...\n• Can Your Finances Survive A Hurricane?• Stations Boycott Their Own Gas Over Prices\n                     \t\t\t\t\t| Watch• New Home Sales Surge, But Prices Drop• More StoriesEntertainmentWill Rosie Leave \"View\" Early?\nThe bubbling political and personal tension between Rosie O'Donnell and Elizabeth Hasselbeck came to a head on \"The View\"\n                        when the two resurrected their fight about O'Donnell's comments on the U.S. troops in Iraq and terrorists. More...\n• Fans To Serenade Jim Nabors At Indy 500• Perez Hilton, Defender Of Bloggers Rights?• \"CSI\": The Museum Experience\n                     \t\t\t\t\t| Watch• More StoriesOpinionBarry Bonds: Cheater\nDick Meyer won't be cheering when Barry Bonds breaks Hank Aaron's home run record this summer. The reason? Bonds, says\n                        Meyer, is a cheater.  More...\n• CBS Poll: Clinton, Giuliani Still In Front• No Smoking Gun From Goodling\n                     \t\t\t\t\t| Watch• A Mormon Mission... For Romney?\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Find Your Way To Latest GPS Devices\nCBS News Science and Technology correspondent Daniel Sieberg does, in The Early Show's new \"Gadget\n                        Lab.\" He explains what GPS is, tells the features to look for, and has specifics on many new offerings. More...\n• EARLY SHOW: The Secrets Of Cupcake Perfection\n                     \t\t\t\t\t| Watch• EARLY SHOW: Tooth Whiteners: Something For Everyone• EARLY SHOW: Gardening To Make Small Spaces Beautiful\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nGood Luck Or Foul Behavior?During his recent speech in the Rose Garden, President Bush got flack not from Democrats or Republicans, but from a fine feathered\n                                    friend. Jeff Glor has more.\nTOP VIDEOS\nSummer Travel Begins\nOffsetting Gas Prices\nBush Embraces Benchmarks\nMoneyWatch\nHealthWatch\nWarning To Wear Your Seat Belt\nA British Trash Dump\nBush Warns Of Violent Summer\nCollecting On Insurance Claims\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMike Wallace profiles GOP presidential hopeful Mitt Romney, this Sunday, 7 p.m. ET/PT.48 Hours MysteryDeath Of A Dream:An aspiring Broadway dancer is murdered. Did her secrets contribute to her death? Erin Moriarty\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}