{"category": "ham", "to_address": "Ip-health <ip-health@lists.essential.org>", "from_address": "James Packard Love <james.love@keionline.org>", "subject": "[Ip-health] Post-Ebay Decision in D. Del.: Plaintiff Must Show Why Monetary Damages Aren't Enough", "body": "--\n[ Picked text/plain from multipart/alternative ]\nOne of the many new decisions by U.S. federal district courts, to\ndetermine when a compulsory license to a patent is better than an\norder to enforce exclusive rights (an injunction).   So far, the\ninjunction has been denied, but the patent owner may try again.  Jamie\n\nhttp://271patent.blogspot.com/2007/04/post-ebay-decision-in-d-del-\nplaintiff.html\n\nPost-Ebay Decision in D. Del.: Plaintiff Must Show Why Monetary\nDamages Aren't Enough\n\nPraxair Inc. v. ATMI Inc. (03-1158) District of Delaware, March 27, 2007\n\nAfter Praxair successfully sued ATMI for patent infringement, Praxair\nmoved for a permanent injunction on ATMI's infringing gas cylinder\ndevice. The two companies were in \"direct and head-to-head\ncompetition\" and are the two main mechanical-based systems for the\ncontrolled delivery of industrial gases on the market. Praxair argued\nthat this relationship, and ATMI's sale of the infringing product,\nentitled Praxair to an injunction.\n\nATMI countered that an injunction would force customers to incur\nsignificant costs by shutting down operations to qualify an\nalternative gas source or to switch to alternate cylinders. While\nATMI retained title to most of its cylinders, the customers own the\ngas stored in the cylinders.\n\nAfter reviewing the eBay four-factor test, the district court ruled\nthat Praxair has not provided sufficient evidence showing irreparable\ninjury and the inadequacy of legal remedies:\n\n     Under eBay, a plaintiff must prove that it is entitled to its\nstatutory right to exclude by demonstrating, inter alia, irreparable\ninjury and the inadequacy of legal remedies. Though the quantum of\nevidence required is relatively unclear, the court finds that Praxair\nhas not met its burden under eBav to put forward sufficient proof vis-\na-vis the broad scope of the relief requested. Praxair generally\nargues that VAC's presence in the market will cause Praxair to\n\"likely lose additional market share, profits, and goodwill,\" without\nfurther detail. Praxair has not provided or described any specific\nsales or market data to assist the court, nor has it identified\nprecisely what market share, revenues, and customers Praxair has lost\nto ATMI . . . While money damages are generally considered inadequate\nto compensate for the violation of a patentee's right to exclude,\nPraxair nonetheless had a burden to iterate specific reasons why\nATMl's infringement can not be compensated for with a money award.\n\nThe court stated that Praxair may renew its motion for injunctive\nrelief following appellate review of the jury verdict.\n\nDownload opinion here\n\nhttp://www.delawareiplaw.com/media/2/20070402-Praxair%20-%2003-1158-\nSLR.pdf\n\n\n----------------------------------------------\nJames Packard Love\nKnowledge Ecology International\nhttp://www.keionline.org\njames.love@keionline.org\nWashington, DC +1.202.332.2670\n\n\"If everyone thinks the same: No one thinks.\" Bill Walton\"\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}