{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Gregory Nowak <greg@romuald.net.eu.org>", "subject": "Re: moving from amd to p3?", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nOn Sat, Jun 16, 2007 at 09:49:27PM -0500, Spie Sutherland wrote:\n> Also, it doesn't seem right to copy an existing  .config after doing the \n> speakup patch. The speakup patch adds new items into .config after \n> speakup is selected in menuconfig, the CONFIG_SPEAKUP and \n> other related entries. If you copied in a .config from a kernel without \n> speakup then it won't have the speakup stuff in .config. \n\nIn that case, you'll be prompted for those options when doing\nconfig/menuconfig/oldconfig, and you'll be told that it's a new option.\n\n> If you copy \n> some existing .config then it may not match the kernel that you are\n> compiling from source. If it's the same kernel version that you used \n> before it will work, but if you now have a newer kernel it may or \n> may not work, and you might be missing some new stuff that's in the \n> newer kernel version. \n\nYes. If you're using a .config file that you didn't generate yourself from an older kernel to compile a\nnewer kernel, it's still fine to run oldconfig and get prompted for\nany new options. However, after doing that, you should do\nconfig/menuconfig, and verify the configuration. No, this isn't\nredundant. Doing oldconfig gives you the chance to configure any new\noptions the way you want them configured, while doing\nconfig/menuconfig let's you verify the configuration, without having\nto worry that you might miss any new, and maybe important options. However, if your\ndistribution's kernel version matches the kernel version you're\ncompiling, I still think using the distro's .config will give you a\ngood starting point.\n\n> \n> It is a pain to go through the config, but worthwhile to understand \n> what you need and don't for your hardware. There is so much in \n> the kernel that is not needed on most systems. If you set all those\n> to not be included, then you have a whole lot less to compile.\n> \n\nAgreed. It's too bad there isn't a script for linux that can examine\nthe hardware in a system, and generate a streamed down .config\nspecific to that system. One of the neat things about netbsd is that\nthere is a script that parses your dmesg output when running the\nnetbsd-supplied kernel, and then it generates a streamed-down kernel\nconfig specific to your hardware.\n\nGreg\n\n\n- -- \nweb site: http://www.romuald.net.eu.org\ngpg public key: http://www.romuald.net.eu.org/pubkey.asc\nskype: gregn1\n(authorization required, add me to your contacts list first)\n\n- --\nFree domains: http://www.eu.org/ or mail dns-manager@EU.org\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGdK3d7s9z/XlyUyARApjdAKCcUFqQi+AdKv2xJkFlPrcMxZSZegCglD1z\neRYg5bwoDePhKlRWFCZrhP4=\n=pOCk\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}