{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Robert Dwyer\" <veqdecorpressxod@decorpress.ro>", "subject": "Watch your body change with Anatrim", "body": "\nShed weight now and enjoy the process\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting product for weighty people is now readily available – As could be seen on ABC\n\n\n\nDid you realize that redundant body kilograms kill a plenty of people around the world? We know you hate the unsightly look of those people and the low status they obviously have in society. \n\nOr, maybe, you can’t withstand an assault of pernicious eating habits of yours. Does it all sound familiar? Then we have something for you!\n\n\n\n\n\nHere Anatrim comes, the new product for the elimination of your body’s extra weight. The amazing thing about Anatrim is it raises the quality of your life, repressing your feeling of hunger and giving you better cheer. Here you may read some notes received from our customers:\n\n\n\n\n\n\"It’s great! \n\n\nI stopped stuffing myself with food and watching TV continually \n\n\nI became more interested in doing sport.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I have a great form now and there are lots of men around me!\"\n\n\n\n\n\n\nLusia R., Bellevue WA\n\n\n\n\n\n\n\"I tried some passive weight burning, you know, but with little result. I was very hard for me to hold in my ravenous hunger. \n\n\nOnce I was told on Anatrim my very best friend by and I was really effected at the information.\n\n\n I had tried to take it, and my wife told me that I'm a different person now, 3 months later. \n\n\n34 pounds have gone away and I keep still losing them! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nSteve Burbon, New York\n\n\n\n\n\nAnatrim gives you an opportunity to understand that you got no such great need for that much food. It raises your spirit, provides you with extra energy, and attacks useless kilos. Great thanks to its powerful distinguished formula!!\n\n\n\nWorm out more!\n\n\n\n"}