{"category": "spam", "to_address": "<manager@speedy.uwaterloo.ca>", "from_address": "\"Monroe D. Fidelia\" <eqjoj@prodigy.net>", "subject": "revealing", "body": "\n\n\n\n\n\n\n\nHoward said it's pretty amazing what's gone on in a \nyear and he thinks that it really is the beginning of a revolution.\nArtie said that he's looking forward to seeing the \nprivate jet and people might want to see that on TV. He said that she has gotten \nupset and he just tells her that they don't have anything to do with \nher.\nThey also have couches, bean bags and concerts in \nthe court yard there. Scott said that what Howard has done for the business is \ngreat.\nHe said he went to sleep after that so Howard asked \nhim if he got the runs after eating that. Gary said the guy declined the offer so \nthe guys were going to try to find something else.\nThe guys got a few laughs watching that video a \ncouple of times.\nArtie said that he almost drove himself to a \npsychiatric hospital yesterday. The moon landing tape wasn't one of them \nthough.\n8:30am Artie mentioned that they have that \nbreakfast set up out in the lobby but they'd better hurry up and get something. The \nHoward on the phone would keep hanging up on him. '' over and over \nagain.\nThere was quite a bit of bacon on the plate, and it \nmay have been too much even for him. Gary said that he's not bringing his gift to \nFlorida. Artie said he was going to take time to write and do other stuff on the \nflight down there.\nHoward said that the guys from Inside Radio work \nfor terrestrial radio and never point that out when they write negative articles \nabout him and satellite radio.\nHoward heard about all of the stuff they have going \non down there and it sounds like they have 150,000 square feet with the amount of \nstuff they have in there.\n8:35am Howard took a call from a guy who \ncongratulated him on his year anniversary.\nHoward said he's horrible at archiving stuff \nhimself so he hired Jeff Shick and Laura Lackner to do all of that for \nhim.\nThey had Ray saying no over and over again but he \nwouldn't take no for an answer.\n7:25am Howard had Lisa G come in with her Howard \n100 News preview.\nGary warned Howard that it was pretty creepy \nstuff.\nLarry said this was the first time he's ever been \non national radio so  it was a big deal for him. 7:15am After the break Howard said \nhe had a big announcement to make.\nHoward thinks that's a great gift because he's so \ninto chess right now.\nArtie mentioned that Ralph has been trying to help \nhim get hooked up with some clothes but now he's starting to sound like he's doing a \nsales pitch. He had breaded chicken cutlets and two slices of pizza. Howard told \nScott he was choked up over this whole thing and thanked him for making everything \ncome true that he promised him. Artie said he wouldn't even know where to get \nshredded wheat.\nMartine for inventing the whole thing. Beetlejuice \nthought he was on the phone when Sal was standing behind him talking to him as if he \nwas on the phone and Beet though he was actually having a conversation. Scott said \nthat the volume seemed appropriate for him when they set it up but with him singing \nit may not have been loud enough.\nHoward read some news stories and one of them was \nabout this guy who had to be rushed to the hospital when he stapled his hand to a \ntable and got stuck. Howard told Richard to put all of those outtakes back into the \ncall so they can hear it in full.\nArtie said he now knows that they're not gay \nbecause they didn't commit to actually making out. Howard heard about all of the \nstuff they have going on down there and it sounds like they have 150,000 square feet \nwith the amount of stuff they have in there.\n"}