{"category": "spam", "to_address": "<manager@speedy.uwaterloo.ca>", "from_address": "\"Grace Crouch\" <kbgss@vbrick.com>", "subject": "refuge", "body": "\n\n\n\n\n\n\n\nHoward played an old song called ''Al Sharpton to \nthe Rescue'' that they've played on the show in the past. Jeff said that it's about \ntime he got fired for being the racist fuck that he is. Howard said that this guy \nhas no ratings and he has the balls to treat people like that. He said he told Beth \nthat he was going to challenge Imus to a fist fight if he would say something like \nthat to his face.\nHoward and the guys were talking about how big this \nSanjaya kid has become and how he's got to be the biggest star ever on \nthere.\nHe said he wanted to tell Martha not to feel bad \nfor him at all. He said KC had a lot of problems and didn't know just how messed up \nhe was.\nHe and his crew goof on Howard but even Imus says \nthat there could have been a Howard Stern without Imus.\nKeith was saying that they had to walk through \nwaist high excrement when they were working with the guy. That led to Howard talking \nabout her race that she did over the weekend. He said he doesn't look like he takes \ncare of himself and he's just a mess.\nShe said she really just wants to come and see  \nHoward and the guys.\nHe played more of the Keith Olberman interview and \nlistened to Keith telling his side of the story. Howard also had a new Wack Pack \nFeedback bit that Sal put together.\nImus denied it at first but then admitted that \nmaybe he did use it but he was probably doing it as a joke in an off-the-record \nconversation.\nMy guess is that what works for  text ads, is \nalmost certainly going to make a difference with  the image ads as \nwell.\nHe said that she probably figured he was going to \nbe voted off.\n11 15:12:14Bilder wollen gezeigt \nwerden.\n6:20am Howard said that the engineering department \nthere fixed his phones so he can actually see the numbers now. They'll probably \ncreate an initial template for the banner, and  then just alter some of the text to \ntarget certain keywords. Howard also talked about how awful Imus looks at the age of \n67. If we can establish exactly  what he 'wants', as an entrepreneur, we can then \nlook at what  we can offer him to specifically fill that demand.\nBlue Iris was in the bit as well and had some \ncomments about his old shriveled dick.\nHoward said that he has another example of what a \npiece of shit this guy is.\nHe told Artie that KC looked like a winner while \nArtie looks like a loser whether he's winning or losing. He had a nice apartment, a \nnice TV and he seemed to be set. Howard and the guys watched her video from when she \nwas evaluated back in June of last year. He said  no one should feel bad for Imus \nand no one should believe he has any job offers either. He said that if SIRIUS hires \nthat guy, he's out of there. Howard told the story of KC's gambling and how he had \nhit a royal flush on goldenpalace.\n"}