{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Dixie Kaiser\" <miqeksetfew@ekset.com>", "subject": "Summer is almost here, be ready", "body": "\nStop the painful craving for more food\n\n\n\n\n\n\nAnatrim – The very up-to-date and most fascinating lose flesh product is now easily available – As you could see on ABC.\n\n\nDo you recall all the times when you told yourself you would do any thing for being saved from this fastly growing pounds of fat? Fortunately, now no major sacrifice is required. Thanks to Anatrim, the ground-shaking weight-reducing combination of elements, you can get naturally health life style and become really thinner. Take a look at what our customers write!\n\n\n\n\"I hate to confess but I was an awful food addict. \n\n\nI greedily devoured all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis suffering left off after I started taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my craving for food vanished, \n\n\nmood increased and I turned to the happiest person on the planet 20 pounds in 2.5 months. \n\n\n\n\nI can tell you now I became the happiest person in the world!\"\n\n\n\n\n\nAmelia B., Bellevue WA\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nIt’s pretty hard to imagine how I abhorred being ridiculed at school. \n\n\n\n\nI detested my stoutness and I detested even myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nThis stuff literally pulled me out of this dreadful nightmare! Thanks and thanks to you, guys.\"\n\n\n\n\n\nCharley Mock, Chicago\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was luckily saved! I got into the circle, depression – more eating – more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nMy friend pointed at your web site and I called for Anatrim at once. \n\n\nThe final result was excellent, my appetite came to admissible level, I was often in good spirits, and, certainly, I went some belt holes back. And you know, the bed became cool, too!\"\n\n\n\n\n\nMikkey\n\n\n\n\n There are lots of sincere gratitudes left by delighted people trying Anatrim. Why don't you join the tens of thousands of slender women and men and try this original appetite-suppressing energy lifting product now!\n\n\nDon’t decline your chance!\n\n\n\n\n"}