{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nWednesday, 13 June, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nMan City close in on new manager\nMan City hope to appoint a new boss within a week, with Juande Ramos and Co Adriaanse topping their wanted list.\n\n\n\n \nSmith admits he may quit Man Utd\nMan Utd striker Alan Smith warns he may leave if he fails to receive assurances from boss Sir Alex Ferguson.\n\n\n\n \nSaha will be fit for season start\nThe agents of Man Utd striker Louis Saha's dismiss suggestions he will miss the first few months of the season.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nNew caddie helps Monty at Oakmont\nColin Montgomerie hires local caddie Billy Goddard for the US open at Oakmont, which starts this week.\n\n\n\n \nDavies untroubled by major stage\nWelsh amateur Rhys Davies says he is unfazed by the atmosphere at the US Open, his first major championship.\n\n\n\n \nWoods relishing Oakmont challenge\nTiger Woods expects the US Open at Oakmont to be \"one of the most difficult tests\" he will ever face.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nMcLaren look to cool Hamilton row\nMcLaren boss Ron Dennis denies claims the team is giving preference to rookie Lewis Hamilton over Fernando Alonso.\n\n\n\n \nMcNish pumped up for Le Mans test\nAudi's Allan McNish says he is confident they can keep up their winning streak at the Le Mans 24 Hours in the face of opposition from Peugeot.\n\n\n\n \nKubica 'feels ready for US race'\nBMW Sauber's team boss says Robert Kubica wants to race in Sunday's US Grand Prix after his 180mph crash in Canada.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nMcLaren look to cool Hamilton row\nMcLaren boss Ron Dennis denies claims the team is giving preference to rookie Lewis Hamilton over Fernando Alonso.\n\n\n\n \nWalker tips Hamilton for F1 title\nFormer commentator Murray Walker believes Briton Lewis Hamilton can win the Formula One World Championship.\n\n\n\n \nUnscathed Kubica out of hospital\nBMW Sauber driver Robert Kubica leaves hospital in Montreal after his horrific crash at the Canadian Grand Prix.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nWilliams desperate for comeback\nWelsh 400m hurdler Rhys Williams admits to frustration as injury keeps him out of the European Cup squad.\n\n\n\n \nPickering gets European Cup nod\nCraig Pickering beats Mark Lewis-Francis to the 100m berth in Great Britain's team for the European Cup on 23-24 June.\n\n\n\n \nGillick sets new Irish 400m mark\nDavid Gillick smashes the Irish 400m record at Switzerland's Atletica Geneve meeting.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nMoreau replaces Wiggins as leader\nChristophe Moreau wins stage two of the Dauphine Libere to replace Britain's Bradley Wiggins as overall leader.\n\n\n\n \nWiggins retains lead in Dauphine \nBritain's Bradley Wiggins retains a one-second overall lead after the first stage proper of the Dauphine Libere. \n\n\n\n \nWiggins wins Dauphine time-trial\nBritain's Bradley Wiggins gives his Tour de France prospects a boost by winning the prologue in the Dauphine Libere.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nTen to Tackle\nTest your knowledge of the last seven days in sport\n\n\n\n \nQuotes of the Week\nRamon Calderon on David Beckham, plus Lewis Hamilton and Graham Taylor\n\n\n\n \nComment: Formula fun with Lewis\nRobbo on Lewis Hamilton and the England cricket team\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}