{"category": "ham", "to_address": "debian-devel@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Steve Langasek <vorlon@debian.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "On Sun, Jun 03, 2007 at 10:54:38PM +1000, Anthony Towns wrote:\n> On Sun, Jun 03, 2007 at 04:51:40AM -0700, Steve Langasek wrote:\n> > On Sun, Jun 03, 2007 at 12:25:14PM +0200, Wouter Verhelst wrote:\n> > > Additionally, personally I don't think it's unreasonable for people to\n> > > say \"if you use my software in a way that I didn't want you to, I'll sue\n> > > you in a court that works by a set of rules that I'm actually\n> > > comfortable with\". You know, it makes fighting those who do not follow\n> > > your license the way you intended them to quite a bit easier.\n> > That's a strawman.  The objection raised to choice-of-venue clauses is not\n> > what they specify to happen when the licensee has *infringed* the license,\n> > it's what they specify to happen when the licensee *hasn't* infringed the\n> > license but the copyright holder files a lawsuit against them anyway out of\n> > malice.\n\n> I don't think that's meaningful; if I sue you in a court in Australia\n> for not complying with debootstrap's license, and they find that you've\n> infringed the license, it doesn't really matter if I'm doing that out\n> of maliciousness or a genuine.\n\nWhy doesn't it matter?  If I've been sued because of something I've actually\ndone that infringed the license, then surely the DFSG and Debian shouldn't\nbe concerned with that (other than the question of whether what I've done is\nsomething that the DFSG requires of copyright holders); but if I'm being\nsued over something I *didn't* do, isn't it relevant that this license\nclause is going to cost me something that I wouldn't otherwise have to give\nup, just because the copyright holder has taken a dislike to me?\n\n- If I don't have the resources to fight the case in a court overseas, I\n  risk summary judgement; the cost to me is the liberty to travel unmolested\n  to Australia at some future date when I might have resources for travel.\n- If I do have the resources to fight the case overseas, I can file a motion\n  to dismiss based on improper venue, which as a consequence of this license\n  clause may or may not be accepted.\n  - If the motion is granted, I can presumably ask for the plaintiff to pay\n    my legal costs; but I presumably can't ask for the plaintiff to\n    compensate me for my lost time (at least, this seems unlikely to be\n    granted by this court since the existence of the contract's clause is\n    likely to be a defense against assertions of bad faith; please correct\n    me if I'm wrong).\n  - If the motion is denied, I'm stuck litigating in a foreign court, which\n    implies certain costs in time and money that I wouldn't otherwise have,\n    some of which are not recoverable legal expenses and some of which are\n    expenses that may not be awarded to the defendant in all jurisdictions\n    and in all circumstances (concrete references here would be welcome):\n    * If I get sued in Oregon, I have a wide range of local resources at my\n      disposal to help me find appropriate legal representation; if I get\n      sued in Australia, I'm stretching my connections pretty thin to find\n      and evaluate legal counsel, and this process is going to cost more\n      time and money on my part (and may leave me with inferior legal\n      counsel anyway in the end due to logistical issues)\n    * Effective realtime communication with the lawyer is more expensive\n      (transoceanic phone calls), and more inconvenient due to timezone\n      differences (fine, fine, not for *me*, but you know what I mean)\n    * If I have to travel to Australia at any point during the suit, this\n      is an expensive and time-consuming trip.\n\nAFAICS, it's likely that the logistical problems of mounting a transoceanic\nlegal defense will also increase my up-front legal costs.  These costs are\nrecoverable if I win, but they may be large enough to make it infeasible for\nme to take the lawsuit all the way to the end at all.  At least around here,\nmost suits end up being settled out of court due to the uncertainty of a\nruling in one's favor and the high cost of seeing litigation through;\nincreased legal expenses imply an increased probability of settling out of\ncourt, which means the cost is whatever is specified in the settlement, plus\nlost time, plus whatever legal expenses are incurred up to that point.\n\nThere's also the additional issue that an evil copyright holder may be more\nlikely in the first place to file a lawsuit that they know they can't win,\nif they can do so in their own home jurisdiction at low cost to them with a\nhigher possibility of a default judgement or an out-of-court settlement.\n\nI'll grant that the absolute theoretical minimum cost increase to someone\ntargetted by the copyright holder as a result of this clause is still zero\n(and, in exceptional cases in exceptional jurisdictions, perhaps less than\nzero).  But that looks to me like a pretty low-probabilty outcome; in spite\nof the difficulties in measuring the probability of particular outcomes, or\ntheir associated costs, I don't think they should be ignored as a fee.\n\nAs an analogy, suppose that a license included the following clause:\n\n  By distributing the covered work, you agree that the copyright holder can\n  compel you at any time to play in an on-line black jack tournament at his\n  website, geekblackjackstars.net, with an initial ante of $100.\n\nShould Debian consider this to be a free license because the clause won't\nnecessarily be invoked and because some people win at blackjack?\n\n> And as far as the actual effects go, I'm not sure you're going to be any\n> better off without that clause in your license: if you set foot in\n> Australia, with an Australian judgement against you, there's a good\n> chance of it being enforced; and if you don't, there seems to be a\n> practical possibility of your extradition anyway, based on [0].\n\nIf the license doesn't have this clause and the copyright holder sues me in\nAustralia, the case can be dismissed on grounds of improper venue.  This is\nthe default state of affairs, and is exactly how this case would play out\neven if I didn't have a license from (and wasn't distributing any software\nwritten by) the hostile Aussie.\n\nIf the copyright holder is alleging criminal copyright infringement, yes,\nextradition applies.  But not all copyright infringement has criminal\npenalties associated with it; in the event of an allegation that doesn't,\nwe're back to the usual rules for determining venue in civil cases.\n\nIn the specific case of California (the default CDDL venue), the California\nSupreme Court has ruled that distributing something on the Internet from\noutside of the state does *not* give California's courts personal\njurisdiction over defendants[1].  So the only thing that could *possibly*\ntie me to a California venue would be this license clause.  (As for Germany,\nthe other real-world venue operating here, an opinion from someone versed in\nGerman law would be useful.)\n\n> Simon Phipps' argument, presented at debconf last year, is (aiui) that\n> the clause only comes into play when both parties are organisations\n> that cross multiple jurisdictions anyway -- in which case they're both\n> presumed to have a presence in the given jurisdiction anyway, and could\n> reasonably be expected to be following its rules, afaics.\n\nHas this opinion been confirmed by a lawyer on *SPI's* payroll, not just by\none on *Sun's* payroll? :)  The text of the license does not limit itself to\nresolving jurisdictional ambiguities, it asserts that the listed venue\napplies in all cases -- which as we've seen, has the opposite effect of\n*adding* uncertainty.\n\nThere are ways that a choice-of-venue clause could be fixed to not be\nunfairly weighted in favor of the licensor, to be sure; one that has been\ndiscussed in the past is to effect a choice-of-venue clause that only\napplies when the licensor is named as a defendant, and it seems you've just\nidentified another one, that of effecting a choice-of-venue clause that\nspecifies it only takes effect when disambiguation is needed.  The current\nclause, though, puts the copyright holder in the dealer's seat, and the\nhouse always wins.\n\n-- \nSteve Langasek                   Give me a lever long enough and a Free OS\nDebian Developer                   to set it on, and I can move the world.\nvorlon@debian.org                                   http://www.debian.org/\n\n[1] Pavlovich v. The Superior Court of Santa Clara County; it's so fun to be\n    able to cite a DD as a good legal precedent.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}