{"category": "ham", "to_address": "discuss@list.digital-copyright.ca", "from_address": "Russell McOrmond <russell@flora.ca>", "subject": "[d@DCC] What do you think the ideal copyright law would look like?", "body": "\n\n  First, please send letters to your MPs about the current consultation\nthat is happening on \"Counterfeiting and Piracy of Intellectual\nProperty\" - http://www.digital-copyright.ca/node/3930   I posted a copy\nof the letter I sent to my MP at\nhttp://www.cluecan.ca/pipermail/discuss/2007-May/001199.html\n\n\n\n\n  I posted a BLOG article earlier that might be interesting to discuss\nhere as well, for those who don't like commenting on the BLOG.\n\nCopyright is not a binary yes/no question. What should it look like?\nhttp://www.digital-copyright.ca/node/3932\n\n\n\n  A few differences from what I've written in the past.  I enjoy these\ntypes of conversations as it allows us to each think not only about\nchanges we don't want to see, but changes we do.\n\n  The one that I would like to highlight is:\n\n\n\"f. industries who only provide the technical means for recording,\ncommunicating or distributing works should not be offered copyright.\nOnly human creators (authors, photographers, performers, directors, etc)\nshould be offered copyright, not broadcasters or sound recording makers.\nCreators should be offered tools to enable them to skip intermediaries\nand make their own choices as to how to exercise their own rights. No\nmatter how a creator is employed, the first holder of copyright should\nbe the creator and copyright could only transfer to an employer as part\nof a contract.\"\n\n\n  As most will know, the loudest lobby group in the copyright revision\ntalks right now is the recording industry.  This makes sense, given\ntheir industry is currently redundant and they are fighting for basic\nsurvival against progress.   Musicians will tell you that the roll of\nthe labels is to be a \"big bank\" to pay the up-front capital costs for\nthe recording and distribution of recorded music.  As the capital costs\nwent down with new technology, so did the need for these third-party\ninvestments.\n\n  New technologies have always caused changes to copyright laws.  While\nthis has sometimes involved adding new exclusive rights, or transforming\na requirement to obtain permission to only a requirement for payment\n(compulsory licenses).\n\n  I think it is time that we removed the exclusive rights that were\ngranted to the providers of historically expensive means of recording,\ncommunicating or distributing works.  While there is a debate at WIPO\nright now about a broadcasting treaty, we need to go to opposite\ndirection and revoke the existing exclusive rights that providers of\nbroadcast equipment have.  The same with makers of sound recordings who\nno longer have any need for an exclusive right.  Songwriters and\nperformers should have rights, but makers should not any more than the\nlocal hydro company should have a copyright simply for providing\nelectricity.\n\n  Any thoughts on this idea, or anything else in my \"ideal copyright\"?\nDarryl Moore has posted some ways he agrees and disagrees with my ideal,\nand Karl Fogel offered a correction of my interpretation of his article.\n\n\n-- \n Russell McOrmond, Internet Consultant: \n Please help us tell the Canadian Parliament to protect our property\n rights as owners of Information Technology. Sign the petition!\n http://www.digital-copyright.ca/petition/ict/\n\n \"The government, lobbied by legacy copyright holders and hardware\n  manufacturers, can pry my camcorder, computer, home theatre, or\n  portable media player from my cold dead hands!\"\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}