{"category": "ham", "to_address": "\"Lucke, Joseph F\" <Joseph.F.Lucke@uth.tmc.edu>", "from_address": "Peter Dalgaard <p.dalgaard@biostat.ku.dk>", "subject": "Re: [R] Hotelling T-Squared vs Two-Factor Anova", "body": "Lucke, Joseph F wrote:\n> Sean\n>\n> Both Bill V and Peter D are right regarding traditional\n> repeated-measures ANOVA that assumes equality of the variance-covariance\n> matrices across groups and compound symmetry of the covariance matrix.\n> However, there is a multivariate approach to repeated measures that does\n> not require the assumption of compound symmetry.  This approach is given\n> in the reference below.  The difference between multivariate repeated\n> measures and general MANOVA is that the former imposes a model matrix\n> (contrasts) on the measures to reflect the repeated measures design.\n> General MANOVA does not have this extra matrix.  The Hotelling T-squared\n> approach with a measures model matrix would be equivalent to\n> multivariate repeated measures.\n>   \nI mentioned in my reply that one might look at successive differences to \nremove the mean level, I think this is effectively the same general \nidea. It is actually implemented in anova.mlm(), which allows you to \nspecify a transformation matrix, possibly using formula notation to \ncompute the relevant model matrix/matrices.\n\nThere is, btw, an alternative approach which involves _conditioning_ on \ncontrasts that at known to have mean zero (second order differences for \na linear within-subjects trend, e.g.). This is not implemented \nsystematically anywhere though, as far as I know.\n\n> In your case, you need to specify the measure model matrix for the 4\n> time points (polynomial, differences, Helmert), which usually cannot be\n> done in a standard T-square program.  However, you could compute the\n> model matrix results (contrasts) beforehand and submit them to the\n> T-square program.  Your taking the difference scores on the 1st factor\n> is doing just that.\n>\n> Joe\n>\n> @BOOK{Bock1975,\n>   author = {Bock, R. D.},\n>   title = {Multivariate statistical methods in behavioral research},\n>   year = {1975},\n>   publisher = {McGraw-Hill},\n>   address = {New York},\n>   keywords = {regression; analysis of covariance; analysis of variance;\n> log-linear\n> \tanalysis; matrices; distribution theory;},\n> }\n>\n> -----Original Message-----\n> From: r-help-bounces@stat.math.ethz.ch\n> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Sean Scanlan\n> Sent: Saturday, April 14, 2007 7:38 PM\n> To: r-help@stat.math.ethz.ch\n> Subject: [R] Hotelling T-Squared vs Two-Factor Anova\n>\n> Hi,\n>\n> I am a graduate student at Stanford University and I have a general\n> statistics question.  What exactly is the difference between doing a\n> two-factor repeated measures ANOVA and a Hotelling T-squared test for a\n> paired comparison of mean vectors?\n>\n> Given:\n>\n> Anova: repeated measures on both factors, 1st factor = two different\n> treatments, 2nd factor = 4 time points, where you are measuring the\n> blood pressure at each of the time points.\n>\n> Hotelling T^2: You look at the difference in the 4x1 vector of blood\n> pressure measurements for the two different treatments, where the four\n> rows in the vector are the four time points.\n>\n>\n> I am mainly interested in the main effects of the two treatments.  Can\n> someone please explain if there would be a difference in the two methods\n> or any advantage in using one over the other?\n>\n> Thanks,\n> Sean\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide\n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}