{"category": "ham", "to_address": "Patrick Burns <pburns@pburns.seanet.com>", "from_address": "Spencer Graves <spencer.graves@pdf.com>", "subject": "Re: [R] Nonlinear constrains with optim", "body": "Hi, Patrick, Paul, et al.: \n\n     \n\nPatrick Burns wrote:\n> I don't know of any sources, but the idea is quite simple.\n>\n> For each constraint that is broken, the penalty is the amount\n> by which the constraint is broken times a penalty rate.  The\n> total penalty to add to the objective is the sum of penalties\n> over all constraints.\n>\n> There is a catch or two when using this with derivative-based\n> optimizers.  The objective typically becomes non-differentiable\n> at the boundary, and optimizers can get confused.  \nI believe I've gotten good results with penalties that are the SQUARE of \nthe amount by which the constraints were violated.  These are \ncontinuously differentiable and so don't confuse the derivative-based \noptimizers much. \n\nAlso, I start with a small penalty, then increase the penalty until I \nget a solution that seems sensible.  If you can't handle a solution just \na little outside your constraints, shrink a little the place at which \nthe penalty starts. \n\n      Hope this helps. \n      Spencer Graves\n\n> They might\n> be less confused with smaller penalty rates.  However if the\n> penalty rate is too small, then you can get a \"solution\" that breaks\n> one or more penalties.\n>\n> Starting from a solution given by Rgenoud or its ilk is probably\n> a good idea.\n>   \n> Patrick Burns\n> patrick@burns-stat.com\n> +44 (0)20 8525 0696\n> http://www.burns-stat.com\n> (home of S Poetry and \"A Guide for the Unwilling S User\")\n>\n> Paul Smith wrote:\n>\n>   \n>> Dear All\n>>\n>> I am dealing at the moment with optimization problems with nonlinear\n>> constraints. Regenoud is quite apt to solve that kind of problems, but\n>> the precision of the optimal values for the parameters is sometimes\n>> far from what I need. Optim seems to be more precise, but it can only\n>> accept box-constrained optimization problems. I read in the list\n>> archives that optim can also be used with nonlinear constrains through\n>> penalizations. However, I am not familiar with the technique of\n>> penalizations. Could someone please indicate to me a site or a book to\n>> learn about that penalization technique?\n>>\n>> Thanks in advance,\n>>\n>> Paul\n>>\n>> ______________________________________________\n>> R-help@stat.math.ethz.ch mailing list\n>> https://stat.ethz.ch/mailman/listinfo/r-help\n>> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n>> and provide commented, minimal, self-contained, reproducible code.\n>>\n>>\n>>  \n>>\n>>     \n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}