{"category": "spam", "to_address": "<faisalabad@speedy.uwaterloo.ca>", "from_address": "\"Cooley\" <wjyxw@speakeasy.net>", "subject": "MOSTLY CLOUDY SKIES WITH SHOWERS THROUGH 3 AM.", "body": "\n\n\n\n\n\n\n\nTHIS BAND WILL LIFT NORTH AND GRADUALLY MOVE \nONSHORE BY 1 AM.\n07 - Sat - 04:49:55 AM (EDT) Warnings, Watches and \nAdvisories in Effect for the United States This page contains watches, warnings and \nadvisories that are in effect for the United States.\nA COLD FRONT ASSOCIATED WITH THIS SYSTEM WILL \nAPPROACH THE MISSISSIPPI AND ALABAMA STATE LINE BY MID MORNING ON \nSATURDAY.\nThis file is usually updated about every two \nminutes.\nHYDER 9 PM ADT FRI APR 13 2007 \nWINDS WILL REMAIN LIGHT. STAY TUNED TO NOAA WEATHER \nRADIO AND YOUR LOCAL BROADCAST NEWS MEDIA FOR THE LATEST FORECAST INFORMATION \nREGARDING THE UPCOMING PERIOD OF SEVERE WEATHER.\nESPECIALLY IN SCATTERED STORMS DEVELOPING AHEAD OF \nTHE MAIN LINE OF STORMS IN PARTICULARLY MARION. SOUTH WIND 10 TO 15 \nMPH.\nRAINFALL AMOUNTS WILL GENERALLY BE LESS THAN A \nTENTH OF AN INCH. PORT ALEXANDER 1230 AM ADT SAT APR 14 2007 \nSOUTH WIND AROUND 10 MPH. PARTLY TO MOSTLY CLOUDY \nWITH SCATTERED RAIN SHOWERS.\nA LINE OF STRONG TO SEVERE THUNDERSTORMS WILL MOVE \nEAST ACROSS ALL OF SOUTHEAST MISSISSIPPI.\nOTHER SCATTERED SHOWERS WILL CONTINUE THROUGH THE \nEARLY MORNING. AND ACROSS THE WESTERN FLORIDA PANHANDLE AND SOUTH CENTRAL ALABAMA IN \nTHE MID TO LATE AFTERNOON HOURS.\nISOLATED TORNADOES ARE ALSO POSSIBLE.\nKLAWOCK 9 PM ADT FRI APR 13 2007 . This file is \nusually updated about every two minutes.\nSHOWERS HAVE BEEN LIMITED TO THE HIGHER ELEVATIONS \nAROUND THE PORT AND POINTS SOUTH. THERE IS A MODERATE RISK OF SEVERE STORMS SATURDAY \nALONG THE CENTRAL GULF COAST REGION. EXPECT A FEW SPRINKLES OR FLURRIES. MOSTLY \nCLOUDY SKIES WITH ISOLATED RAIN SHOWERS CONTINUING THROUGH 6 AM. WIND GUSTS TO 25 \nMPH ARE ALSO POSSIBLE. CHECK THE BATTERIES IN THE WEATHER RADIO JUST IN CASE THE \nPOWER SHOULD GO OFF. LUCEDALE 945 PM CDT FRI APR 13 2007 .\nTHOSE WHO DO NOT HAVE A NOAA ALL HAZARDS WEATHER \nRADIO SHOULD STRONGLY CONSIDER INVESTING IN THIS POTENTIALLY LIFE SAVING \nDEVICE.\n07 - Sat - 04:49:55 AM (EDT) Warnings, Watches and \nAdvisories in Effect for the United States This page contains watches, warnings and \nadvisories that are in effect for the United States.\nDAMAGING WINDS AND LARGE HAIL ARE EXPECTED TO BE \nTHE PRIMARY HAZARD ASSOCIATED WITH THE SEVERE THUNDERSTORMS.\nTHIS BAND WILL LIFT NORTH AND GRADUALLY MOVE \nONSHORE BY 1 AM. LUCEDALE 945 PM CDT FRI APR 13 2007 . MOSTLY CLOUDY SKIES WITH \nISOLATED RAIN SHOWERS CONTINUING THROUGH 6 AM.\n"}