{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "New information about the patient with extreme drug-resistant tuberculosis....coming up tonight on the CBS Evening News. ", "body": "\n\n\nCBSNews.com\n\n\n \n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nQUOTE OF THE DAY\"I've always found paranoia to \n      be a perfectly defensible position.\" - Pat Conroy \n\n\n\nDID YOU KNOW?Oak trees do not have acorns until \n      they are fifty years old or older. \n\n\n\nTONIGHT ON THE CBS \n      EVENING NEWSHere is an early preview of what we \n      are planning for tonight's CBS EVENING NEWS... Good \n      afternoon, Katie's on assignment today. This is Anthony \n      Mason filling in. CBS News reported today that the patient \n      with extreme drug-resistant tuberculosis is 31-year-old Atlanta lawyer \n      Andrew Haley Speaker. In a strange twist, Speaker's new father-in-law is a \n      government scientist who has studied tuberculosis - but he says there's no \n      connection to his son-in-law's infection. Kelly Cobiella will have \n      the very latest on this evolving story and will also tell us how the \n      public is reacting. Also, the ease in which the patient crossed the \n      country's border has exposed cracks in the national security system. \n      Nancy Cordes will look at what this case can illustrate about our \n      country's preparedness. In Iraq, the troop surge has reached full \n      strength. But does it have a chance of succeeding by September? David \n      Martin will talk with one Lieutenant General who is not optimistic. \n      Meanwhile, President Bush prepared to clash with other world \n      leaders at the upcoming G-8 summit by announcing his own plan for battling \n      climate change. Who's backing it and who's calling it just another smoke \n      screen? Jim Axelrod will have the answers. Hate e-mail \n      Spam? You might be seeing a little bit less of it. Robert Alan Soloway, \n      now known as one of the world's top spammers, was arrested today. Bill \n      Whitaker will tell you how this could affect your in-box. Also \n      tonight, we'll take you inside the place a sophisticated form of drug \n      dealing takes place - and it looks just like a doctor's office. They're \n      called pill mills, and are the source of a CBS News investigation, which \n      reveals the ease with which prescription drugs can be purchased - without \n      a prescription. Chief Investigative Correspondent Armen Keteyian \n      will report. Finally, Byron Pitts will give you a look at \n      the library dedicated today to Rev. Billy Graham. I hope \n      you'll join us for this and more, Anthony Mason\nFor more information on these stories, please click on the \n      following links: Extreme TB Patient Taken To Denver\nClick \n      Here \"Top\" Spammer Nabbed For Fraud, ID Theft Click \n      Here And here's a look at one of the stories we're working \n      on for Friday's broadcast: A new bill approved in the House \n      gives a half million residents in Washington, D.C. something they've never \n      had: a full vote in Congress. All that and much more, Friday, on the \n      CBS Evening News live from Washington, D.C. If you \n      would like more information on any of these stories or the broadcast, \n      please click on the following address and e-mail us: evening@cbsnews.com \n\n\nTONIGHT ON DAVID \n      LETTERMANJoin Dave tonight on The Late \n      Show with talk show host Regis Philbin... \n      Plus, musical guest Darlene Love! \n\n\n\nFRIDAY\nMORNING ON THE EARLY SHOWHarry \n      Smith, Hannah Storm, and Russ Mitchell anchor \n      THE EARLY SHOW from New York. Julie Chen anchors from \n      Los Angeles. Bryan Norcross of our Miami affiliate, WFOR, will \n      bring us the weather. Dave Price is off. Along with the \n      top news of the day, we will also have the following stories:\nAMERICAN IDOL WINNER JORDIN SPARKS: She is only 17 years \n      old, but already the future looks very bright for Jordin Sparks. This \n      powerhouse singer impressed millions of people with her big voice and \n      bubbly personality making her the youngest contestant to take the coveted \n      idol crown. Sparks, daughter of a former New York Giants cornerback, has \n      been readying herself for Idol fame since she was 12. She will join \n      us Friday morning with her take on her instant success. Plus, don't miss \n      her exciting performance on our plaza! STUDY HALL - DANCE \n      TEACHER: Everyone has probably had a teacher that they remember as \n      being special. In our Study Hall, Early Show's\nSusan McGinnis will introduce us to Anna Lindsey of Birmingham, AL \n      who has been teaching high-schoolers how to dance for more than three \n      decades. At age 76, Lindsey could retire but she is determined to continue \n      a program that gives kids an outlet to express themselves. We'll meet this \n      inspiring lady Friday. BIRDWATCHING 101: It's been referred \n      to as the number one spectator sport. And if you're thinking Nascar, you \n      would be wrong. Believe it or not, it's bird watching! In fact, one out of \n      every five of us is a bird watcher, and it's a hobby that continues to \n      grow in popularity. Andy Thompson knows first hand. His family has been \n      publishing Bird Watcher's Digest for almost thirty years. He will \n      join us with the basics of backyard bird watching. POTTERY BARN \n      WEDDING REGISTRY: Wedding registries can be very helpful in creating \n      an ideal foundation for a couple's new home. But with more choices than \n      ever, the process often becomes a daunting task. To help make it easier, \n      design expert Susanna Salk will join us at the Pottery Barn in New \n      York with advice on what exactly you need to register for. If you \n      would like more information on any of these stories or the broadcast, \n      please click on the following address and e-mail us: earlyshow@cbs.com \n\n\n \nSATURDAY ON \n      48 HOURS\n48 Hours Mystery is preempted on Saturday \n      night. We'll be back next Tuesday with a show called, Love and \n      Lies. Murder exposes the secret lives of a suburban couple. \n      Peter Van Sant reports, Tuesday, June 5, 10 p.m. ET/PT. \n      If you would like more information on any of these stories or the \n      broadcast, please click on the following address and e-mail us at: 48hours@cbsnews.com \n\n\n\nSUNDAY ON 60 MINUTES\nJACK KEVORKIAN: Mike Wallace talks to \n      Dr. Jack Kevorkian in his first post-prison interview. The assisted \n      suicide activist went to prison as a result of his first interview with \n      Wallace, in which he showed himself on videotape injecting lethal \n      chemicals into a patient suffering from Lou Gehrig's disease. \n      VANESSA REDGRAVE: Up for a Tony Award for her solo role in \n      a play based on the Joan Didion best-selling book The Year of Magical \n      Thinking, Vanessa Redgrave talks to Mike Wallace for the first \n      time since 1979, when she appeared on 60 Minutes at the peak of her political activism. PRESIDENT \n      AHMADINEJAD: 60 Minutes re-broadcasts parts \n      of Mike Wallace's exclusive and rare interview with the president \n      of Iran. \n\n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}