{"category": "ham", "to_address": "\"General Copyright Discussions \\(questions, organizing,\n\tetc\\)\" <discuss@list.digital-copyright.ca>", "from_address": "mgurst@vcn.bc.ca", "subject": "Re: [d@DCC] MS censors UN document", "body": "Hi Scott,\n\nI am by no means defending MS who clearly over-reached in this instance\nbut the document in question wasn't to my knowledge published by the UN\nand at most would have had a UN logo somewhere alongside a bunch of other\nlogos from other financial sponsors...\n\nSo my guess is that the document has more or less disappeared.  The recent\nde facto endorsement of open source by the UNDP (in fact I believe it was\nby something called APDIP which is sponsored by the UNDP) is a far more\nimportant and long lasting development with practical results on the\nground especially in Asia.\n\nThere has been a lot of other to-ing and fro-ing around MS and OS in\nvarious UN post-WSIS venues but the story is too long and tangled and my\nmemory too selective to follow it... Do some searching on WSIS and IGF\n(Internet Governance Forum) and MS and see what turns up.\n\nGood luck with it,\n\nMG\n\n> On 5/29/07, mgurst@vcn.bc.ca  wrote:\n>> One final note, to call the proceedings a \"UN document\" is a gross\n>> distortion... The conference was not I believe an \"official\" UN\n>> conference\n>> but may have been \"endorsed\" by one or another UN agency--it happens\n>> fairly often; and the proceedings were the proceedings of a mostly\n>> Austrian funded and sponsored conference that mattered very little in\n>> the\n>> great scheme of things and wasn't so far as I know of much significance\n>> even in the context of WSIS.\n>\n> Thanks for your thoughts MG.  Again, more recent references would be\n> wonderful, but going on what you've provided thus far...\n>\n> I understand that happens, (too often for my personal liking) but does\n> not the fact that a document \"endorsed\" by a UN agency (regardless of\n> the sponsorship of any individual or group of nations), regarding a\n> related conference, make said document - in it's final form - an\n> \"official\" UN document?\n>\n> Perhaps it was sponsored by Austria, but if it is a UN document why\n> then should MS have _any_ control over the contents of the document?\n>\n> There are many areas in which I could use schooling - politics first\n> among them.  =)\n>\n> Thanks again.\n> - Scott.\n>\n> --\n> Scott Elcomb\n>\n> \"Our Founders' faith in the viability of representative democracy\n> rested on their trust in the wisdom of a well-informed citizenry,\n> their ingenious design for checks and balances, and their belief that\n> the rule of reason is the natural sovereign of a free people.\" - Al\n> Gore (The Assault on Reason, 2008)\n>\n> \"They that can give up essential liberty to obtain a little temporary\n> safety deserve neither liberty nor safety.\"  - Benjamin Franklin\n>\n> '\"A lie can travel halfway around the world while the truth is putting\n> on its shoes.\"  - Mark Twain\n> _______________________________________________\n> Discuss mailing list\n> Discuss@list.digital-copyright.ca\n> http://list.digital-copyright.ca/mailman/listinfo/discuss\n>\n>\n> !DSPAM:2676,465c940115221365620095!\n>\n\n\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}