{"category": "spam", "to_address": null, "from_address": "madam koku richard <m_koku7@hotmail.com>", "subject": "Your urgent response please.", "body": "\n\n\n\n\nFrom: Madam Koku RichardThe secertry of Auditing Dept.SOCIETE GENERALE DES BANQUES AU BURKINA(SGBB) Dear Partner,Compliment of the season,  Good day and how are you doing with your family? Hope fine. Please let this  message do not be a surprise to you because i got your contact information  and lay all the trust in you before i decided to disclose this confidential  and successful transaction to you.  I am the SECERTRY OF AUDITING DEPARTMENT of our bank and i decided to contact you over this financial transaction worth the sum of TEN MILLION,FIVE HUNDRED THOUSAND UNITED STATES DOLLARS($10,500,000.00 ) for our present future success. This is an  abandoned fund that belongs to one of our bank foreign customers who died  along with his entire family in Algeria Earthquake on 23 may 2003. Meanwhile i was very fortune to came across the deceased file when i was arranging the old and abandoned customers files of 2005-2006 in other to submit to the  entire bank management for an officialre-documentation.   Be obviously informed that it was stated in our BANKING POLICY and signed  lawfully that if such fund remains unclaimed till the period of FOUR (4) years started counting from the date when the beneficiary died, the money will be transferred into the BANK TREASURY as an unclaimed fund. Besides, it  is not authorized by the law guiding our bank for a citizen of BURKINA FASO to make the claim of the fund. So the request of you as a foreigner is necessary to apply for the claim and transfer of the fund smoothly into your reliable bank account as the EXTENDED RELATION BEING THE NEXT OF KIN to the deceased.And i have made inquiries about this deaceased customer, and i have enough information for the success all i need is your coperation and trust, i will guild you on how to go about it. Thanks, I expect your urgent communication, and let me know your mind.   My best regrads to you and your family, Madam Koku Richard.Your urgent response please.Live Earth is coming.  Learn more about the hottest summer event - only on MSN. Check it out!\n"}