{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Clinton Trout <ctrout@bu.edu>", "subject": "[Ip-health] Re: Ip-health digest, Vol 1 #2380 - 2 msgs", "body": "Hello Everyone-\n\nI'm working for LIGASIDA and the Fundacion Henry Ardila (AIDS Groups)\nin Bogota Colombia for the summer.  Folks here are very concerned about\nthe Colombia FTA but don't really understand the risks.  Is there any\nanalysis yet of the new Peru agreement?  The old one appears almost\nidentical to the Colombia one, so I imagine they will be similar.\nPerhaps there are opportunities for the Colombia activists to have\ninput when the Colombian gov reviews and approves the US changes.\nThanks!\n\n--\nClinton Henry Trout, MPH\nCandidate for Doctor of Public Health\nBoston University\n\n270 Harvard St., #4\nCambridge, Massachusetts 02138\nctrout@bu.edu\n\n\n\nQuoting ip-health-request@lists.essential.org:\n\n> Send Ip-health mailing list submissions to\n> \tip-health@lists.essential.org\n>\n> To subscribe or unsubscribe via the World Wide Web, visit\n> \thttp://lists.essential.org/mailman/listinfo/ip-health\n> or, via email, send a message with subject or body 'help' to\n> \tip-health-request@lists.essential.org\n>\n> You can reach the person managing the list at\n> \tip-health-admin@lists.essential.org\n>\n> When replying, please edit your Subject line so it is more specific\n> than \"Re: Contents of Ip-health digest...\"\n>\n>\n> Today's Topics:\n>\n>    1. Thailand: Compulsory Licensing Efforts Proceed (robert weissman)\n>    2. UK : New  MInister  to head DFID (Michelle Childs)\n>\n> --__--__--\n>\n> Message: 1\n> Date: Tue, 26 Jun 2007 22:22:40 -0400\n> From: robert weissman \n> To: ip-health@lists.essential.org\n> Subject: [Ip-health] Thailand: Compulsory Licensing Efforts Proceed\n>\n> http://www.bangkokpost.com/News/27Jun2007_news05.php\n>\n> Bangkok Post\n> Wednesday June 27, 2007\n>\n> *Govt to import generic version of heart drug*\n>\n> /*Health minister sticks to his guns over prices*/\n>\n> *APIRADEE TREERUTKUARKUL*\n>\n> Thailand plans to import a generic version of the heart drug\n> clopidogrel, marketed as Plavix, from an Indian drug maker next month as\n> price negotiations with patent holder Sanofi-Aventis have shown no signs\n> of progress. ''If the price of the original heart drug cannot be reduced\n> by more than this, any further negotiations may not be necessary. We\n> will buy the generic version to treat patients instead,'' said Public\n> Health Minister Mongkol na Songkhla yesterday.\n>\n> Thailand issued compulsory licences to bypass patents on the anti-Aids\n> drug Efavirenz last November, followed by licences for Kaletra and then\n> the heart medicine Plavix in January.\n>\n> Negotiations to bring down drug prices have been taking place since late\n> March between the government and the pharmaceutical giants Merck, Abbott\n> Laboratories and Sanofi-Aventis, the patent holders of the drugs.\n> However, no agreement has been reached.\n>\n> The government is asking the firms to lower the drug prices to a maximum\n> of 5% above the prices of the generic versions of the medicines.\n>\n> But Sanofi-Aventis is standing by its price of 27 baht a tablet for\n> patients receiving treatment under the Social Security Office and\n> universal healthcare scheme.\n>\n> The firm also demanded the compulsory licence for Plavix be revoked.\n>\n> Dr Mongkol, who was attending a meeting in Geneva, said the ministry is\n> going to import a second-line heart drug from a generic maker in India\n> next month due to the urgent need for the medicine among Thai patients.\n>\n> Thailand is currently only able to produce first-line heart medications.\n>\n> The second-line heart drug produced by the Indian drug maker costs only\n> about three baht per tablet and is still under the registration process\n> with the Food and Drug Administration, he said.\n>\n> Dr Mongkol said he was also working on cutting the price of cancer drugs\n> to about 20 times below those of original versions via compulsory\n> licensing.\n>\n> According to a source at the National Health Security Office (NHSO), the\n> leukaemia drug Imatinib is among the list of cancer drugs being targeted\n> for compulsory licensing. The medicine is not yet available under the\n> universal healthcare scheme due to its high cost. Cancer patients have\n> to spend up to 4,000 baht a day on the medication.\n>\n> The government spent more than 1.2 billion baht last year on about\n> 50,000 cancer patients receiving treatment through the universal\n> healthcare scheme run by the NHSO.\n>\n> Cancer is the among the most likely causes of death among Thais, along\n> with accidents, HIV/Aids, heart disease and natural causes.\n>\n> The Government Pharmaceutical Organisation has begun importing the\n> generic version of Efavirenz from a drug maker in India and plans to buy\n> Plavix and also Aluvia, the heat-stable version of Kaletra, next month\n>\n> --__--__--\n>\n> Message: 2\n> To: ip-health@lists.essential.org\n> From: Michelle Childs \n> Date: Thu, 28 Jun 2007 13:51:48 +0100\n> Subject: [Ip-health] UK : New  MInister  to head DFID\n>\n> --\n> [ Picked text/plain from multipart/alternative ]\n> Our new Prime Minister , Zombie Brown, is announcing his new\n> cabinet.  Hilary Benn is replaced as Secretary  of State for\n> International Development by Spielas Alexander see here for profile:\n> http://news.bbc.co.uk/1/hi/uk_politics/4978680.stm\n> Hilary Benn is moved to ENVIRONMENT\n>\n> Michelle\n>\n> ---------\n> Michelle Childs\n> Head of European Affairs\n> Knowledge Ecology International\n> michelle.childs@keionline.org\n>\n>\n>\n>\n> --__--__--\n>\n> _______________________________________________\n> Ip-health mailing list\n> Ip-health@lists.essential.org\n> http://lists.essential.org/mailman/listinfo/ip-health\n>\n>\n> End of Ip-health Digest\n>\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}