{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "\"Chester Elder\" <agsfcb@reuters.com>", "subject": "=?KOI8-R?Q?Reuters Financial Information?=", "body": "\nReuters Financial Information\n\n\n\n\n\n\nBoerse Invest Beteiligungs AG (BJ5N.F) Recommendations | Stocks | Reuters.com.\n\n\n\n\n\n\n\n\n\n\n\nRecommendations\nBoerse Invest Beteiligungs AG BJ5N.F (Frankfurt)\n\nSector:\n\nIndustry:\n\nView BJ5N.F on other exchanges\n\n\n\nAs of 10:48 AM EST\n\nEUR1.15EUR\n\n\n\nPrice Change\n\n0.00\n\n\n\nPercent Change\n\n0.00%\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFrankfurt, June 12 (finanztreff.de) - Analyst Nick James of Panmure Zombie reiterates his \"buy\" rating on BOERSE INVEST BETEI (BJ5N.F, 797639).  BOERSE INVEST BETEI develops its market of its services. The offices of the company appear in Russia and in Asian countries. Because of this fact the interest  of the investors is growing. The information has appeared in the press that GERRESHEIMER (WKN A0LD6E) has already announced the forthcoming purchase of 49% of shares of the company BOERSE INVEST BETEI, that's why small investors have big chances to obtain an enormous gain. The forthcoming purchase is planned for May 15 2007. Though the financial details of the transaction aren't exposed, the presumable sum makes 1,8 mln Euro. The analyst Nick James noticed that the quotation increase will make 70%. BOERSE INVEST BETEI is likely to return additional capital to its shareholders going forward, the analysts add. \n\n\t\tNYSE and AMEX quotes delayed by at least 20 minutes. Nasdaq and all other quotes delayed by at least 15 minutes.\n        Reuters does not endorse the views or opinions given by any third party content provider.\n        Data supplied by Reuters Estimates.\n\n\n\t\n\tReuters is the world's largest international multimedia news agency, providing investing news, world news, business news, technology news, headline news, small business news, news alerts, personal finance, stock market, and mutual funds information available on Reuters.com, video, mobile, and interactive television platforms. Reuters journalists are subject to the Reuters Editorial Handbook which requires fair presentation and disclosure of relevant interests.\n\n\n\n\n\n\n\n\n\n\n"}