{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 22, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESNation's Firefighters Mourn Their Own\nFirefighters from across the nation descended on Charleston, S.C., to attend a memorial service for nine firemen killed in\n                        a furniture store blaze. Recently released 911 tapes bolster theories that the fire started in the back of the store. More...Watch: Fatal Fire Probe Begins\n• Teen Loses Feet In Six Flags Accident• \"Killer King\" L.A. Hospital In Peril• Study: First Born Have Higher IQs U.S.CIA Skeletons Come Out Of Archive Closet\nLittle-known documents now being made public detail illegal and scandalous activities by the CIA more than 30 years ago: wiretappings\n                        of journalists, kidnappings, warrantless searches and more. More...\n• Nation's Firefighters Mourn Their Own\n                     \t\t\t\t\t| Watch• \"Killer King\" L.A. Hospital In Peril• Cruise Ship Passenger Still Missing• More StoriesWorldTroops Detain 18 In Iraq Raids\nU.S. soldiers conducting raids in the northwest Baghdad suburbs have arrested 18 suspected militants and confiscated weapons\n                        and equipment. Also, a suicide attack has killed two people in Anbar province, which has been largely wrested from al Qaeda.\n                         More...Watch: U.S., Iraq Troops Vs. Al Qaeda\n• 25 Afghan Civilians Killed By NATO Bombs• U.S.: N. Korea Ready To Shut Down Reactor\n                     \t\t\t\t\t| Watch• U.S. Searching Iwo Jima For Remains• More StoriesPoliticsSenate Passes Landmark Fuel Economy Bill\n\"This bill starts America on a path toward reducing our reliance on oil,\" says Senate Majority Leader Harry Reid of a bill\n                        to boost fuel efficiency by 40 percent.  The House acts next on what would be the first such legislation in 32 years. More...Watch: Fuel-Efficient Cars For All\n• CIA Skeletons Come Out Of Archive Closet• Is Guantanamo Closure Imminent?• EPA Proposes New Smog Standards\n                     \t\t\t\t\t| Watch• More StoriesHealthStudy: First Born Have Higher IQs \nA Norwegian study suggests that eldest children may have slightly higher IQ scores than their younger siblings. More...\n• Hope For Sufferers Of Parkinson's Disease\n                     \t\t\t\t\t| Watch• Yoga-Thon Marks Summer Solstice• Video Game Addiction: A Medical Disorder?\n                     \t\t\t\t\t| Watch• More StoriesSciTech\"Green\" Light Bulb Buying Guide\nThe Early Show environmental lifestyle expert Danny Seo explains the differences among them, and suggests\n                        choices for different parts of your home. More...\n• Video Game Addiction: A Medical Disorder?\n                     \t\t\t\t\t| Watch• Weather Keeps Shuttle Aloft Another Day\n                     \t\t\t\t\t| Watch• Lake Superior Feeling The Water Pinch\n                     \t\t\t\t\t| Watch• More StoriesBusinessPlanning Perfect Yard, Tag, Garage Sale\nBy any name, they're getting more popular, and home and family expert Anne-Mudle Barton offered pointers on putting them together,\n                        on The Early Show. More...\n• Continental Apologizes For Sewage Overflow• GE And Pearson Pass On Dow Jones Deal• The Case For Index Funds• More StoriesEntertainmentParis Humbled By Jail, Sick Of Media\nIn a phone call to E! News, Paris Hilton told Ryan Seacrest that she is \"sick\" of how the media has treated her and wants\n                        to use her fame in a good way. More...Watch: Neighbors Want Paris Evicted\n• Spice Girls Set Date To Reveal Plans• Clooney Protests Over Italy Project• R. Kelly's New Take On Deception• More StoriesOpinionIs Vice President's Office Above The Law?\nLegal analyst Andrew Cohen looks at how the Office of the Vice President appears to be trying to dodge the rules on\n                        protection of national security secrets, saying it's not governed by an executive order for the executive branch. More...\n• The Bloomberg Terminal\n                     \t\t\t\t\t| Watch• YouTube's Inflated Influence\n                     \t\t\t\t\t| Watch• Why Are We Abetting Terrorists?\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Home: Planning Perfect Yard, Tag, Garage Sale\nBy any name, they're getting more popular, and home and family expert Anne-Mudle Barton offered pointers on putting them together,\n                        on The Early Show. More...\n• EARLY SHOW: \"Green\" Light Bulb Buying Guide• CBS Evening News: Life Inside The Real \"CSI\"\n                     \t\t\t\t\t| Watch• CBS Evening News: Lake Superior Feeling The Water Pinch\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\n'A Mighty' Angelina JolieTracy Smith speaks with Angelina Jolie about her dramatic transformation into Mariane Pearl in \"A Mighty Heart,\" where she\n                                    plays a character who she befriended in real life.\nTOP VIDEOS\nThe 'Almighty' Wanda Sykes\nSearch For Iwo Jima\nAir Travel With Kids Made Easy\nEco-Friendly Light Bulbs\nVideo Game Addiction\nUnscrambling Enhanced Eggs\nTagging Sex Predators\nSwisher Sports A New Do\nFuel-Efficient Cars For All\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMorley Safer talks to long-driving, hard-drinking golfer John Daly. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMurder On Lockhart Road:A mother and two kids are murdered. There are bizarre clues, eyewitnesses, blood drops,\n                           and a killer with a foot fetish. Saturday, 9 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}