{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Science & Technology Newsletter May 21, 2007", "body": "\nhowstuffworks® | science & technology May 21, 2007\nRSS\n \n How the Bermuda Triangle Works \nYou won't\nfind it on any official map and you won't know when you cross the line, but\naccording to some people, the Bermuda Triangle is a very real place where dozen\nof ships, planes and people have disappeared with no good explanation. Discover\nthe mystery behind the controversy and learn about some disappearances in the\nTriangle that still defy explanation.\nAlso at HowStuffWorks\n \nHow\nLiquid Body Armor Works - Modern body armor slows down weapons and\ndiffuses the energy from their impact. But just like ancient suits of armor,\ntoday's body armor can be heavy and inflexible. Learn how liquid body armor can\nturn flexible fabric into bulletproof armor instantaneously.   \n\n\nHow\nEarthquakes Work - An\nearthquake is one of the most terrifying phenomena that nature can dish up.\nScientists understand to some extent what causes earthquakes, but there's still\na lot of mystery surrounding them. Find out how earthquakes work, what the\nRichter Scale is and how scientists and builders deal with earthquakes.\n \n\n\nHow MREs\nWork - Militaries\naround the world rely on small, carefully engineered packages of food called\nMREs to feed their soldiers. Learn about the surprisingly sophisticated design\nof these portable meals.\n   \nThis Week's Video \n\n\nHow Air\nConditioners Work - Air\nconditioners can be an essential tool in staving off the summer heat. If used\nand maintained properly, they can also be affordable and energy efficient. In\nthis video from HowStuffWorks, find out how air conditioners work.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved"}