{"category": "ham", "to_address": "Jeremy Allison <jra@samba.org>", "from_address": "Alexander Bokovoy <ab@samba.org>", "subject": "Re: svn commit: samba r22973 - in branches: SAMBA_3_0/source/utils\n SAMBA_3_0_25/source/utils SAMBA_3_0_26/source/utils", "body": "Jeremy Allison \\u043f\\u0438\\u0448\\u0435\\u0442:\n> On Thu, May 17, 2007 at 01:56:20PM +0000, ab@samba.org wrote:\n>> Author: ab Date: 2007-05-17 13:56:19 +0000 (Thu, 17 May 2007) New\n>> Revision: 22973\n>> \n>> WebSVN:\n>> http://websvn.samba.org/cgi-bin/viewcvs.cgi?view=rev&root=samba&rev=22973\n>> \n>> \n>> Log: Apparently, 3.0.25 broke smb4k badly ;-)\n> \n> Did they not test any of our pre-releases ?\nI doubt they test pre-releases. I also see great troubles within GNOME\ncommunity with SMB support within GNOME VFS, GVFS rewrite is coming but\nthey have experienced a lot of crashes (more below).\n\nI think we need to come and explain them proper use of libsmbclient and\nour utility (see below for example of misunderstanding).\n\n>> smb4k uses 'net rap server domain' to list servers in domain. \n>> Previously we just ignored all arguments in net_rap_server() but\n>> now we don't as 'net rap server name' has added an explicit check\n>> on arguments.\n>> \n>> Allow 'net rap server domain' to aid smb4k. Any other arguments\n>> will cause help message.\n> \n> Fine by me, but please encourage them to test much earlier than this\n> and submit bugs back if something gets broken.\nI've got this reported by users, not by smb4k developers. Partially my\nfault as I didn't bring pre-releases into ALT Linux repositories.\n\nWhat actually had happened is our documentation for net utility was\nunclear on parameters (from net(8)):\n  RAP SERVER DOMAIN\n       List  all  servers  in specified domain or workgroup. Defaults to\nlocal domain.\n\nwhile in the source net.8.xml we have following:\nRAP SERVER DOMAIN\nList all servers in specified domain or workgroup. Defaults\nto local domain.\n\nThis  tag is for arguments, i.e. it should be actual\ndomain name. As you can see, in formatted man page it is all lost, and\nsmb4k developers treated it wrongly.\n\nTo make worse, we didn't take care of arguments in net_rap_server()\nbefore Volker added 'net rap server name', so actual domain argument\ncame through -w option and never from DOMAIN argument.\n\nThis is our fault and unneeded confusion. I think in this particular\ncase we would be better refactoring code and documentation to stay as\nsmb4k and others use it.\n\nI think we need to talk to smb4k developers as well as GNOME VFS\ndevelopers but also fix our own misdocumentation. Code clean up in net\nsub commands would be good too as it has grown considerably and some\nparts of it behave differently than expected.\n\nFor GNOME attempts see http://hpj.blognaco.com/2007/05/17/gvfs-progress/\nand\nhttp://mail.gnome.org/archives/gnome-vfs-list/2007-February/msg00005.html\n-- \n/ Alexander Bokovoy\n\n\n"}