{"category": "ham", "to_address": "\"General Copyright Discussions (questions, organizing, etc)\"\n\t<discuss@list.digital-copyright.ca>", "from_address": "Charles MacDonald <cmacd@telecomottawa.net>", "subject": "[d@DCC] Backers of stronger copyright laws form lobby group", "body": "http://news.zdnet.com/2100-9595_22-6184604.html?tag=nl.e550\n\n\nThe Copyright Alliance--which launched, complete with electric-green and\nwhite T-shirts displaying its logo at a morning Capitol Hill event\nhere--consists of 29 national organizations and companies that purport\nto represent 11 million workers in copyright-related industries. Those\nmembers include the Recording Industry Association of America, the\nAssociation of American Publishers, the Motion Picture Association of\nAmerica, Microsoft, Viacom and Walt Disney.\n........\n\nBut according to a press release, they're all committed to broad goals\nlike promoting the \"vital role\" of copyright in the U.S. economy and job\nmarket, encouraging inclusion of copyright protection requirements in\ninternational agreements, supporting civil and criminal penalties for\npiracy, and advocating against \"diminishment\" of copyright law.\n\n...\n\n The Copyright Alliance's message, however, is not without competition.\nOctober marked the launch of a Washington-based alliance, called the\nDigital Freedom Campaign, whose members include the Consumer Electronics\nAssociation, advocacy group Public Knowledge, and the Electronic\nFrontier Foundation.\n\nThat group argues that big labels and studios are threatening to squelch\nnew gadgets and consumer freedom by chipping away at the fair use rights\nwritten into copyright law. They support proposals like the Fair Use\nAct, sponsored by Rep. Rick Boucher (D-Va.) and three of his House\ncolleagues, which would amend the controversial Digital Millennium\nCopyright Act to allow consumers the legal right to pick digital locks\non copyrighted works for certain home or educational purposes.\n\n(fair use act - http://thomas.loc.gov/cgi-bin/bdquery/z?d110:h.r.01201: )\n\n-- \nCharles MacDonald               Stittsville Ontario\n cmacd@TelecomOttawa.net        Just Beyond the Fringe\n        http://www.TelecomOttawa.net/~cmacd/\nTodays interesting #: 09 F9 11 02 9D 74 E3 5B D8 41 56 C5 63 56 88 C0\n   No Microsoft Products were used in sending this e-mail.\n\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}