{"category": "spam", "to_address": "undisclosed-recipients:;", "from_address": "barclaysbankb@aim.com", "subject": "MRS. RITA F. BOSMAN", "body": "INTERNATIONAL REMITANCE DEPARTMENT\nBARCLAYS BANK PLC,\nPIVATE BANKING SECTION,\n75 LOMBARD STREET EC3P AH,\nLONDON UK,\n\nCALVARY GREETINGS TO YOU.\n\nDEAR FRIEND,\n\nI AM MRS. RITA F. BOSMAN, HEAD INTL REMITTANCE DEPARTMENT, MY OFFICE \nMONITORS AND CONTROLS THE AFFAIRS OF ALL OTHER BANKS AND FINANCIAL \nINSTITUTIONS IN LONDON (UK). I AM THE FINAL SIGNATORY TO ANY TRANSFER \nOR REMITTANCE OF HUGE FUNDS MOVING WITHIN BANKS BOTH ON THE LOCAL AND \nINTERNATIONAL LEVELS.\n\nI HAVE BEFORE ME LIST OF FUNDS, WHICH COULD NOT BE TRANSFERRED TO SOME \nNOMINATED ACCOUNTS AS THESE ACCOUNTS HAVE BEEN IDENTIFIED EITHER AS \nGHOST ACCOUNTS, UNCLAIMED DEPOSITS AND OVER-INVOICED SUM ETC. YOUR NAME \nWAS AMONG THE PEOPLE EXPECTING THE FUNDS TO BE TRANSFERRED INTO THEIR \nACCOUNT, ON THIS NOTE; I WISH TO HAVE A DEAL WITH YOU AS REGARDS TO \nYOUR UNPAID FUNDS. I HAVE YOUR FILE BEFORE ME AND HOPE YOUR DATA'S ARE \nCORRECT AND UN-TAMPERED UNLESS U RECONFIRMS IT.\n\nAS IT IS MY DUTY TO RECOMMEND THE TRANSFER OF THESE SURPLUS FUNDS TO \nTHE FEDERAL GOVERNMENT TREASURY AND RESERVE ACCOUNTS AS UNCLAIMED \nDEPOSITS, I HAVE THE OPPORTUNITY TO WRITE YOU BASED ON THE INSTRUCTIONS \nI RECEIVED 2 DAYS AGO FROM THE SENATE COMMITTEE ON CONTRACT PAYMENTS / \nFOREIGN DEBTS TO SUBMIT THE LIST OF PAYMENT REPORTS / EXPENDITURES AND \nAUDITED REPORTS OF REVENUES.\n\nAMONG SEVERAL OTHERS, I HAVE DECIDED TO REMIT YOUR CONTRACT SUM \nFOLLOWING MY IDEA THAT WE HAVE A DEAL/AGREEMENT AND I AM GOING TO DO \nTHIS LEGALLY.\n\nMY CONDITIONS\n\n1. THE SUM OF USD$2M.ONLY WILL PAID INTO AN ACCOUNT I WILL PROVIDE YOU \nAFTER YOU HAVE CONFIRMED THE TRANSFER OF YOUR SUM INTO YOUR ACCOUNT BY \nTELEGRAPHIC TRANSFER (T/T), CONFIRMABLE IN 3 WORKING DAYS.\n\n2. THIS DEAL MUST BE KEPT SECRET FOREVER, AND ALL CORRESPONDENCE WILL \nBE STRICTLY BY EMAIL / TELEPHONE, FOR SECURITY PURPOSES.\n\n3. THERE SHOULD BE NO THIRD PARTIES AS MOST PROBLEMS ASSOCIATED WITH \nYOUR FUND RELEASE ARE CAUSED BY YOUR AGENTS OR REPRESENTATIVE.\n\nBELOW ARE THE REQUIREMENTS TO FACILITATE THE TRANSFER PROCESS:\n\nA. YOUR FULL NAMES\nB. YOUR HOME ADDRESS\nC. YOUR BANK ACCOUNT INFORMATION\nD. YOUR BUSINESS/OCCUPATION\nE. YOUR PRIVATE TELEPHONE AND FAX NUMBERS.\n\nALL THE RELEVANT INFORMATION SHALL BE FORWARDED TO ME, UPON MY RECEIPT \nOF THE ABOVE REQUESTED DATES ABOUT YOU.\n\nIF YOU AGREE WITH MY CONDITIONS, L ADVICE YOU ON WHAT TO DO IMMEDIATELY \nAND THE TRANSFER WILL COMMENCE WITHOUT DELAY AS I WILL PROCEED TO FIX \nYOUR NAME ON THE PAYMENT SCHEDULE INSTANTLY TO MEET THE THREE DAYS \nMANDATE. I HOPE YOU DON'T REJECT THIS OFFER AND HAVE YOUR FUNDS.\n\nWAITING FOR YOUR REPLY SOON.\n\nYOURS IN SERVICE,\n\nMRS. RITA F. BOSMAN\nHEAD INTL REMITTANCE DEPARTMENT\nBARCLAYS BANK PLC, LONDON UK.\n________________________________________________________________________ \n\nCheck Out the new free AIM(R) Mail -- 2 GB of storage and \nindustry-leading spam and email virus protection.\n\n________________________________________________________________________\nCheck Out the new free AIM(R) Mail -- 2 GB of storage and \nindustry-leading spam and email virus protection.\n\n"}