{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "Reliable Sources <reliablesrc@mail.cnn.com>", "subject": "This Week on Reliable Sources", "body": "\n\n\nCNN.com\n\n\n\n\n\n\n\n\n\n\nComing up this Sunday on Reliable Sources: \n\nOpen Season on Giuliani\n\nHe may be leading\nthe Republican polls, but Giuliani is taking a thrashing in the\npress.\tFrom his stance on abortion to his dressing as a woman\nfor a handful of comedy shows the attacks are coming fast and\nfurious, and often from the media on the right.  Is the former\nmayor of New York getting a fair shake?\n\nRomney Vs.\nSharpton\n\nAl Sharpton has been in the news a lot\nrecently since he lead the charge against radio show host Don\nImus.  Is the press now giving him a pass after making\ninsensitive comments about republican candidate Mitt Romney's\nreligion?\n\nVideo Voyeurism\n\nHas the\npublic's obsession with watching celebrity's gotten out of\ncontrol?  Paparazzi photos are one thing, but the recent spate\nof personal tapes and videos of celebrities at their worst\npersonal moments have caused celebrity watching to take an ugly\nturn.  Are the media crossing the line?  And the worse things\nget for Paris Hilton, the more coverage she gets, what's that\nall about?\n\nPlus,  Journalists rub elbows with\nthe queen, local newspapers outsourcing to India, and why the\nU.S. press is so much kinder to George W. Bush than the British\npress is to Tony Blair. \n\nJoin us this Sunday and\nevery Sunday at 10am ET / 7am PT for our critical look at the\nmedia! \n\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the Reliable Sources list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=reliablesrc\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}