{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Morning HTML\" <cbsnews_weekday_morning_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 30, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESPet Food Toxin Said To Be Common In China\nThe toxic chemical melamine is commonly added to animal feed in China, a manager of a feed company said, a process that boosts\n                        the feed's sales value. The U.S. recall of 100 brands of pet food has been tied to wheat gluten contaminated by melamine. More...\n• George Tenet: At The Center Of The Storm\n                     \t\t\t\t\t| Watch• 5 U.S. Troops Killed In Iraq, 104 In April\n                     \t\t\t\t\t| Watch• 4 Dead In Kansas City Shooting SpreeU.S.4 Dead In Kansas City Shooting Spree\nA man driving a dead woman's car shot a police officer, then opened fire in a parking lot and a mall Sunday, authorities said.\n                        By the end of the day, four people, including the gunman, were dead. More...\n• Pet Food Toxin Said To Be Common In China• Armed And Dangerous\n                     \t\t\t\t\t| Watch• Tanker Fire Causes Ca. Highway Collapse\n                     \t\t\t\t\t| Watch• More StoriesWorld5 U.S. Troops Killed In Iraq, 104 In April\nThe military says five more American troops were killed in Iraq during the weekend, pushing the U.S. death toll for April\n                        to 104. Meanwhile, daily violence continues to claim Iraqi lives, including two new bomb attacks in Baghdad. More...Watch: Iraq: Another New Way Forward?\n• U.K. Finds 5 Guilty Of Bomb Plot• New NATO Afghan Offensive Targets Taliban• Pet Food Toxin Said To Be Common In China• More StoriesPoliticsRice: Bush Will Not Give In On Iraq Bill\nPresident George W. Bush will not support a war spending bill that punishes the Iraqi government for failing to meet benchmarks\n                        for progress, Secretary of State Condoleezza Rice said on Face The Nation. More...Watch: Rice On Iraq, Tenet\n• Protests Greet Gonzales At Harvard Reunion• Rice Dismisses Tenet's Accusations\n                     \t\t\t\t\t| Watch• Wolfowitz Faces Ethics Panel At World Bank• More StoriesHealthDrink Away Your Weight?\nThere's a new category of soft drinks which promise to burn calories. Are they too good to be true? Nutritionist Samantha\n                        Heller of Health magazine has the low-down of these cutting edge diet drinks.  More...Watch: Mistaking Hunger For Thirst\n• Despite Drug War, Cocaine Purer, Cheaper• Depression Before Parkinson's Disease?• As Boomers Age, Arthritis Costs Rise• More StoriesSciTechE-Mail Etiquette: The Do's and Don'ts\nThe \"e\" in e-mail might as well stand for \"essential\": Most of us have become hopelessly dependent on communicating with e-mail.\n                        But as Daniel Sieberg notes, many of us can use tips on how to use this technology for good, not evil.  More...\n• Blasting Some Owls To Save Others?• The Great Midwestern Gold Rush\n                     \t\t\t\t\t| Watch• HD TV's Spark Rabbit Ear Revival• More StoriesBusinessGerman Supermarkets Become Senior-Friendly\nGermany's Kaiser grocery chain has transformed their supermarkets to \"senior markets\" with such improvements as step stools,\n                        magnifying lenses and \"relaxation zones\" to appeal to the country's fastest-growing demographic. More...Watch: Senior-Friendly Grocery Stores\n• Dow Reaches Record High\n                     \t\t\t\t\t| Watch• HD TV's Spark Rabbit Ear Revival• U.S. Economic Growth Slows To Near Crawl• More StoriesEntertainment\"Disturbia\" Is 3 Week Box Office Champ\nMovie-goers have put the thriller \"Disturbia\" at the top of the box office list for the third weekend in a row, but total\n                        ticket sales continue to slump ahead of an anticipated theater rush for the release of \"Spider-Man 3\". More...\n• Cops: Ex-Idol Finalist Busted For Drugs• Oh, What Webs Today's Superheroes Weave!• Scotty's Final Trip To The Final Frontier\n                     \t\t\t\t\t| Watch• More StoriesOpinionRocca On The Boards\nSunday Morning commentator Mo Rocca was always very serious about his fun, like his passion for appearing on\n                        stage. Now he's appearing on Broadway, and for all that work he is having a ball.  More...\n• Andy: Thanks For Writing• Schieffer: On Losing A Good Man\n                     \t\t\t\t\t| Watch• Corruption Comes Back To Haunt GOP\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Susan Koeppen: Proper Tire Pressure: Possible Lifesaver\nSusan Koeppen warns that under-inflated tires are a real risk: They can cause drivers to lose control and get into\n                        accidents. She explains, on The Early Show. More...\n• 60 Minutes: George Tenet: At The Center Of The Storm\n                     \t\t\t\t\t| Watch• 60 Minutes: Armed And Dangerous\n                     \t\t\t\t\t| Watch• A Few Minutes With Andy Rooney: Andy: Thanks For Writing\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nDeparture Of An ElephantDue to pressure from animal rights groups who believe elephants suffer in cramped enclosures at zoo's, this elephant is heading\n                                    into retirement. Dulary isn't alone though. Anthony Mason has more. \nTOP VIDEOS\nTenet: Center Of The Storm\nNew Approach To CEO Pay\nArmed And Dangerous\nBattle Of Words Over Iraq\nAndy Responds To Fan Mail\nStartling Scene On CA Freeway\nWolfowitz To Answer To Panel\nComplex Crisis In Darfur\nDebate Over CEO Pay\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesEx-CIA Chief George Tenet defends the controversial High Value Program and denies to agency uses torture. Scott Pelley\n                           reports, Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryMurder In The Fast Lane:A sister fights for justice in the murders of her brother and his wife. Bill Lagattuta\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}