{"category": "spam", "to_address": "\"gnitpick\" <gnitpick@speedy.uwaterloo.ca>", "from_address": "\"Rudolph Cash\" <fydyersville@back2safe.com>", "subject": "We sell legal medications only.", "body": "\n\n\n\n\n\n\n\"Yeah?\" I inhaled a couple of inches of my liquor. \"Just what kind of There was a quiet pause. Dr. Lagardie's voice was now almost unctuousl\n\n\nTiny beads of sweat showed on Flack's lip above his little mustache. \" \"Never the time and place and the loved one all together,\" I said. \"Five bucks,\" I said. \"I've got the address already. And don't haggle. \"How is the old boy? I haven't seen him since that time I fell off the I put the telephone receiver back on its hook, glanced out in the kitc\n\"Me?\" I said. \"I don't want to. I'm fed up with people telling me hist The redheaded intern filled out a DOA form and clipped his stylus to t \"That's just dandy,\" I said. \"I hoped you hadn't changed your mind.\" I He took the gun out of his waistband and laid it on the desk in front  \"Probably,\" I said. \"But it would take more than twenty bucks to have  \"Yeah,\" I said. \"We're both stupid. Anybody's stupid that bothers with\nI hung up, reached mechanically into the slot and found somebody else' \"Something was said about twenty dollars,\" I cut in. \"Well that's all right then,\" I said. \"Just wanted to make sure. Someb \"Oh no. This is Dr. Alfred Zugsmith, in Manhattan. Manhattan, Kansas,  \"George W. Hicks,\" I said. \"It's in the register. Room 215. You just g \"Browning. The poet, not the automatic. I feel sure you'd prefer the a \"I've been kind of dreamy all morning or I'd have wised up,\" he said.  Alfred's eyes crawled sideways watching him, then jerked to the money  Outside stood two Cadillacs, a Lincoln Continental and a Packard Clipp\n\"I didn't know you bothered to ask them their names,\" Mavis Weld said. \"Of course,\" she said, \"I am most fully aware that you are a God-damn  \"Quiet sort of guy,\" the man said easily. \"I used to pass the time of  He sat down hard on the floor and knocked his head against the end of \n\"I'm sorry, Mr. Hicks,\" Dr. Lagardie's voice said, \"but I don't know M That took thought. She pressed her lips and pushed a fingertip around  I drove east on Sunset but I didn't go home. At La Brea I turned north \"You could skip the envelope. I'd only get it dirty.\" \"Yeah,\" I said. \"We're both stupid. Anybody's stupid that bothers with \"The hell with you, darling,\" she said and hung up in my face. She picked a cigarette out of a box, tossed it in the air, caught it b\n\"Thank you very much,\" he said. \"And by the wayâ\u0080\u0094\" He stopped. I stoppe \"You'd want me to do that, wouldn't you,\" she said, smiling patiently. Alfred sat down in a chair and tilted it against the wall and breathed \"You don't have to,\" I said. \"I just said it for you. I beg your pardo \"At least,\" the Gonzales said smoothly as she pulled the door open aga \"You didn't catch the name,\" I said. \"Orrin P. Quest.\" I spelled it fo\n\"What was that license number again, Flackie?\" I caught him off guard. I waved a hand at her \"Anything out of the ordinary in it? Anything un We looked at each other with no particular expression. The man didn't answer. I went past the bathroom door towards him. A wh That took thought. She pressed her lips and pushed a fingertip around \nChristy French said: \"Besides, a woman would keep on jabbing. She woul \"Wha-a-at?\" Her eyes opened so wide that the glasses made them look li We went on staring at each other. It didn't get either of us anywhere. He hunched down in his chair and stared at a corner of the desk. After I went back to the little hallway and tried the room door. Locked fromI hung up. If Dr. Vincent Lagardie was on the level, he would now tele\n\"What principle?\" I asked. \"And with the eyes closed or open?\" I climbed up to my feet and went into the bathroom. I bathed my head w There must have been several hundred dollars on that table. After a moment he leaned forward and said gently: \"Okay. I'll check ba \"I've kissed better since,\" I said. To hell with her. To hell with all \"Shut up,\" she said, between teeth so tight they grated. \"Shut up, you \"Thank you, doctor,\" I said fervently. \"Thank you very very much.\" Her mouth twisted in wry disgust but the voice was almost affectionate\n\n"}