{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tMONDAY 2 JULY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nQuote for the Day:\n\nI've just returned from the United States where I have been researching a documentary series for Radio Four called \"The Clinton Years\" to be broadcast in August and September. Today's Quote for the Day comes from a former Clinton Cabinet member who started assessing George Bush's presidency. \"But George Bush has changed,\" I suggested to him. \"For example, now he seems to get Global Warming.\" The former Clinton Cabinet member started to laugh. \"President Bush does NOT get Global Warming,\" he insisted. \"In fact he doesn't even get Evolution.\" \n\n\nIn tonight's programme:\n\nForeign jihadists, not home grown terrorists? What difference does it make? We'll have the latest on the fast moving investigation into the terror attacks in London and Glasgow, and we'll also be assessing the motives behind the attacks. Is there really a link to British foreign policy? Or -- given that a nightclub was the target of one of the London attacks, and a previous bomb plot targeted The Ministry of Sound -- are these attacks primarily directed against the western way of life?  We hope to be speaking to leading politicians and a former jihadist about what can be done.   \n\n\nAnd we want to hear your views too - join the debate by clicking here\n\n\nTrouble for the Tories?\n\nAre the Conservatives stuck in a rut? As the Zombie Brown / New Labour re-launch gives way to the current terrorist attacks, can the Tories get any political traction at all? Why are they stuck at less than 40% in the opinion polls? And is there anything David Cameron can do about it in the Shadow Cabinet re-shuffle tonight?  Michael Crick is on the case.\n\n\nSPINVOX\n\nWhen the boss of a UK company says \"We're going to be the next billion dollar start-up\" there are inevitably weary groans from those who remember the dotcom boom and bust. But is this technology boom different? Paul Mason has been following the progress of Spinvox, a UK start-up company, to find out what it's really like to raise and spend £30 million of other people's money.\n\n\nAnd finally:\n\n\nJoke Fit For an Eleven Year Old\n\nRegular readers of this email - yes, we know you are out there - may remember that the current favourite for the Worst Joke of 2007, was sent in by a Newsnight member of staff whose identity we are protecting by calling him \"Peter C.\" Well, he has struck again: \n\nTwo fonts walk into a bar.\n\nBarman says....\n\n\"Oi! We don't serve your type in here.\"\n\nStop him before he strikes again.\n\n\nNewsnight is at 10.30pm on BBC 2.\n\n\nGavin  \n\n\n\nMissed Newsnight Review?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}