{"category": "spam", "to_address": "<warwick@speedy.uwaterloo.ca>", "from_address": "\"Dewey Briggs\" <jskelington@0800dial.com>", "subject": "For Warwick", "body": "\n\n\n\n\n\n\n\n\nFake enhancement meds have once again flooded the market. A recent polling has shown that as much as 90% of male enhancement pills sites out there are selling cheap knockoff versions of the original product! Don't be fooled by flashy online  webstores either or fabricated testimonials either!\nCanadian Pharmacy is the real deal - real ingredients, 100% guarantee, real results! Canadian pills have been proven to effect, and use only the highest quality ingredients available anywhere.\nDon’t waste time, join the millions of men already benefiting from using Canadian Pharmacy. Why be average when you can be the best?\nNew price special now in effect - visit website to see limited time discount prices on all orders!\nHere are just a few of the thousands of positive responses we have gotten recently:\n\"I Couldn't believe the change...\"\n\"Guys,  I took the plunge and ordered a 120 day supply of Canada based pills. All I can say is THANK God I DID! Using the measuring guide in the free enargement exercise section I can proudly tell you that I have gained over 1.8 inches in length and 1.6 inches in girth, AGAIN thank you!\"\nDewey, Arkansas\n\"I have been using Canadian pills for 3 months now and I must say I'm simply amazed. I really didn't think the product would have this many advantage. I really only bought the pills to help the reliability of my erections. But to my surprise every aspect of my penis and sex life has improved. I have 1arger, harder erections easily, and I can really satisfy my girlfriend fully now.\"\nDewey, Chicago\n\"My partner has no idea, but has commented on my penis feeling thicker on entry lol.. Another thing i have noticed and i know she has been telling her girlfriends is my increased sex drive and confidence in bed.\n  I want it far more often now and even if I had never gained I now know that with the improved confidence and fuller erections and also improved drive I can always put a smile on her face. So far so very good. Thank you sooo much!\"\nDewey, Denver\n\n\n\n"}