{"category": "ham", "to_address": "e-drug@healthnet.org, <aidsdrugs@lists.riseup.net>,\n   HGAPALLIES@LISTSERV.CRITPATH.ORG, ip-health@lists.essential.org,\n   thaiFTA@lists.riseup.net", "from_address": "B.Baker@neu.edu", "subject": "[Ip-health] Abbott's Against Thailand Blackmail Continues", "body": "\nAbbott's Blackmail against Thailand Continues - Lives Hang in the Balance\nProfessor Brook K. Baker, Health GAP\nApril 12, 2007\n\nAbbott Laboratories has attempted to temporarily regain lost ground in its\nongoing compulsory license dispute with Thailand by granting a further\nprice concession on Kaletra/Aluvia for forty-five low- and lower-middle\ncountries, including, in principle, Thailand.  The new price, $1000 per\npatient per year, is still twice Abbott's no-profit price to least\ndeveloped and African countries, but it is $1200 less than the \"discount\"\nprice Abbott offered under activist pressure last year on August 13 during\nthe International AIDS Conference in Toronto.  At the same that time Abbott\npromises a price discount, it has announced plans to register\nKaletra/Aluvia broadly, though it has not done much in this regard so far.\n\nHowever, the price discount and registration promise are doubly illusory in\nThailand because Abbott has withdrawn its registration application for\nAluvia, the new heat-stable, Meltrex form of Kaletra that is vastly\nsuperior in tropical countries like Thailand.  Not content with withdrawing\none key AIDS medicine that could adversely affect treatment options for\n8,000-20,000 patients in the next year alone, Abbott has also withdrawn six\nother registration packets and threatened to withhold all new medicines\nfrom the Thai market.  Abbott has initiated this new-product boycott of\nThailand in retaliation for Thailand's lawful issuance of a compulsory\nlicense for public, non-commercial use of Kaletra/Aluvia calling this a\n\"failure to honor intellectual property rights.\"  Contrary to Abbott's\nclaim, compulsory licensing is an essential part of the intellectual\nproperty regime having been recognized in national laws for over a century,\nhaving been used on thousands of occasions by the U.S. alone, and having\nbeen expressly ratified in the WTO TRIPS Agreement and the Doha Declaration\nof 2001.\n\nAs part of its long-term strategy, Abbott is attempting to realize three\ngoals simultaneously.  First, in concert with the entire industry and with\nthe assistance of the United States Trade Representative, Abbott is\nattempting to enshrine even higher standards of intellectual property\nprotection in an escalating series of \"free\" trade agreements.  These\nmonopoly-enhancing agreements extend patent terms beyond 20 years, extend\npatent rights to new uses of existing products, delay registration of\ngeneric equivalents through data exclusivity rule and patent/registration\nlinkage rules that prevent drug regulatory authorities from relying on or\nreferring to safety and efficacy data submitted by the data holder,\nrestrict compulsory licensing and parallel importation rights, and revoke\nprice control mechanisms like reference pricing and therapeutic-value\nformularies.  Although U.S./Thai negotiations were suspended last year,\npartially over access-to-medicines issues, a leaked version of the U.S.\nproposal exposed the U.S/Pharma effort to treat a very TRIPS-plus patent\nand data regime in Thailand.\n\nSecond, Abbott is trying to discover the price discount that will reduce\npressure from developing countries, AIDS activists, and multilateral\ninstitutions like the WHO and Clinton Foundation.  Rest assured that Abbott\nhas attempted to extract premium prices from low- and lower-middle income\ncountries in the past, charging between $3000 and $5000 per year as\nrecently as last August.  But the AIDS crisis and widespread poverty in\nmiddle-income countries confound Abbott's effort to extract thousands of\ndollars of profit from each AIDS patient each year, and thus Abbott has had\nto respond with a series of face-saving price cuts designed to relieve its\npublic relations nightmare.  As part of this strategy, Abbott is trying\nundercut the entry price of generic manufacturers that have not yet reached\nefficient economies-of-scale.  Abbott's effort to buy off the bigger\nmiddle-income markets in Brazil and Thailand is predictably undermining\nincentives for generic entry.\n\nThird, Abbott is trying to punish Thailand severely for using a fully\nTRIPS-compliant flexibility for accessing cheaper medicines.  Its product\nboycott represents a new low in Pharma's perverse pursuit of unassailable\nmonopoly protections.  By intimidating Thailand, like it did Brazil two\nyears ago, Abbott hopes to dissuade other developing countries from\nfollowing Thailand's lead.  Big Pharma would like to draw a boundary around\nAfrica and around AIDS drugs and declare a regional and disease-specific\ncease fire in its ongoing Pharma Wars.  But, by the same token, Big Pharma\nwould like to eliminate utilization of TRIPS flexibilities and\ndisincentivize the development of a robust generic industry that would\ncompete with regard to newer, more broadly patented medicines.\n\nThe price cuts offered by Abbott are insufficient to meet the long-term\nneeds of Thailand and other developing countries.  As can be seen, price\ncuts are conditioned on disavowal of key TRIPS-compliant flexibilities.\nAlthough the price discounts might temporarily beat start-up generic\nprices, the eventual prices of multiple generic producers manufacturing at\nefficient economies-of-scale will always beat the price of higher-cost\nWestern manufacturers.  Likewise, relying on single-source suppliers\nunavoidably raises the risk of stock-outs and product interruptions.\nFinally, developing countries have their own national and regional interest\nin promoting local manufacturing capacity.\n\nAlthough gaining a better price from Abbott is an important short-run\nvictory, Thailand should not relinquish its compulsory license on\nKaletra/Aluvia or other medicines.  The license can always be held in\nabeyance for use when generic prices drop further and when the generic\nversions of Aluvia are WHO-prequalified and registered in Thailand.\nMoreover, Thailand and other developing countries should continue to\npressure Abbott for voluntary access licenses, given to patent pools or to\nmultiple producers, so that generic pharmaceutical companies can begin to\nmanufacture and register more cost efficient forms of this very important\nAIDS medicine.  In fact, Thailand and other countries should go even\nfurther and grant compulsory licenses on ritonavir as a separate product so\nthat it can be co-formulated with other protease inhibitors that might be\nsuperior to lopinavir.\n\nAbbott's crude and unlawful boycott of Thailand cannot be made palatable by\na unilaterally granted and unilaterally revocable price discount.  The\nstakes of this boycott are death.  It's hard to understand why a company\nthat makes $1.1 billion a year from Kaletra sales is willing to kill people\nto secure more profits.  Hopefully this question will be asked at the\nAbbott shareholder meeting in Chicago on April 27.\n\nProfessor Brook K. Baker, Health GAP\nNortheastern U. School of Law\nProgram on Human Rights and the Global Economy\n400 Huntington Ave.\nBoston, MA 02115\n617-373-3217 (office)\n617-259-0760 (cell)\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}