{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "\"ArcaMax\" <ezines@arcamax.com>", "subject": "\"Tarzan of the Apes\" for Monday April 23, 2007", "body": "\n\n\n\n\nFREE Ezine from ArcaMax, Inc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMore from ArcaMax.com!\nFunnies\n |\n      Puzzle Games\n |\n      Quizzes\n |\n      Unsubscribe\n\n\nChat About Your Favorite Books\n\n\n\n\n\n\n\n\nwww.ArcaMax.com |\n     News |\n     Books |\n     Comics |\n     Games |\n     Subscribe |\n     My Account\n\n\n\n\n\n\n\n\n\n\n\nTarzan of the Apes\nby Edgar Rice Burroughs - Section 9 of 28\nFor B\n\n     Monday April 23, 2007\n     \n\n\n\nChapter 9\n\nMan and Man\n\nTarzan of the Apes lived on in his wild, jungle existence\nwith little change for several years, only that he grew\nstronger and wiser, and learned from his books more and\nmore of the strange worlds which lay somewhere outside his\nprimeval forest.\n\nTo him life was never monotonous or stale.  There was always\nPisah, the fish, to be caught in the many streams and the\nlittle lakes, and Sabor, with her ferocious cousins to keep\none ever on the alert and give zest to every instant that one\nspent upon the ground.\n\nOften they hunted him, and more often he hunted them,\nbut though they never quite reached him with those cruel,\nsharp claws of theirs, yet there were times when one could\nscarce have passed a thick leaf between their talons and his\nsmooth hide.\n\nQuick was Sabor, the lioness, and quick were Numa and\nSheeta, but Tarzan of the Apes was lightning.\n\nWith Tantor, the elephant, he made friends.  How?  Ask not.\nBut this is known to the denizens of the jungle, that on\nmany moonlight nights Tarzan of the Apes and Tantor, the\nelephant, walked together, and where the way was clear Tarzan\nrode, perched high upon Tantor's mighty back.\n\nMany days during these years he spent in the cabin of his\nfather, where still lay, untouched, the bones of his parents\nand the skeleton of Kala's baby.  At eighteen he read\nfluently and understood nearly all he read in the many and\nvaried volumes on the shelves.\n\nAlso could he write, with printed letters, rapidly and plainly,\nbut script he had not mastered, for though there were several\ncopy books among his treasure, there was so little written\nEnglish in the cabin that he saw no use for bothering with this\nother form of writing, though he could read it, laboriously.\n\nThus, at eighteen, we find him, an English lordling, who\ncould speak no English, and yet who could read and write his\nnative language.  Never had he seen a human being other\nthan himself, for the little area traversed by his tribe was\nwatered by no greater river to bring down the savage natives of\nthe interior.\n\nHigh hills shut it off on three sides, the ocean on the\nfourth.  It was alive with lions and leopards and poisonous\nsnakes.  Its untouched mazes of matted jungle had as yet\ninvited no hardy pioneer from the human beasts beyond its\nfrontier.\n\nBut as Tarzan of the Apes sat one day in the cabin of his\nfather delving into the mysteries of a new book, the ancient\nsecurity of his jungle was broken forever.\n\nAt the far eastern confine a strange cavalcade strung, in\nsingle file, over the brow of a low hill.\n\nIn advance were fifty black warriors armed with slender\nwooden spears with ends hard baked over slow fires, and long\nbows and poisoned arrows.  On their backs were oval shields,\nin their noses huge rings, while from the kinky wool of their\nheads protruded tufts of gay feathers.\n\nAcross their foreheads were tattooed three parallel lines of\ncolor, and on each breast three concentric circles.  Their\nyellow teeth were filed to sharp points, and their great\nprotruding lips added still further to the low and bestial\nbrutishness of their appearance.\n\nFollowing them were several hundred women and children,\nthe former bearing upon their heads great burdens of cooking\npots, household utensils and ivory.  In the rear were a\nhundred warriors, similar in all respects to the advance guard.\n\nThat they more greatly feared an attack from the rear than\nwhatever unknown enemies lurked in their advance was\nevidenced by the formation of the column; and such was the\nfact, for they were fleeing from the white man's soldiers who\nhad so harassed them for rubber and ivory that they had\nturned upon their conquerors one day and massacred a white\nofficer and a small detachment of his black troops.\n\nFor many days they had gorged themselves on meat, but\neventually a stronger body of troops had come and fallen upon\ntheir village by night to revenge the death of their comrades.\n\nThat night the black soldiers of the white man had had\nmeat a-plenty, and this little remnant of a once powerful\ntribe had slunk off into the gloomy jungle toward the\nunknown, and freedom.\n\nBut that which meant freedom and the pursuit of happiness\nto these savage blacks meant consternation and death to\nmany of the wild denizens of their new home.\n\nFor three days the little cavalcade marched slowly through\nthe heart of this unknown and untracked forest, until finally,\nearly in the fourth day, they came upon a little spot near the\nbanks of a small river, which seemed less thickly overgrown\nthan any ground they had yet encountered.\n\nHere they set to work to build a new village, and in a\nmonth a great clearing had been made, huts and palisades\nerected, plantains, yams and maize planted, and they had\ntaken up their old life in their new home.  Here there were no\nwhite men, no soldiers, nor any rubber or ivory to be gathered\nfor cruel and thankless taskmasters.\n\nSeveral moons passed by ere the blacks ventured far into\nthe territory surrounding their new village.  Several had\nalready fallen prey to old Sabor, and because the jungle was so\ninfested with these fierce and bloodthirsty cats, and with lions\nand leopards, the ebony warriors hesitated to trust themselves\nfar from the safety of their palisades.\n\nBut one day, Kulonga, a son of the old king, Mbonga,\nwandered far into the dense mazes to the west.  Warily he\nstepped, his slender lance ever ready, his long oval shield\nfirmly grasped in his left hand close to his sleek ebony body.\n\nAt his back his bow, and in the quiver upon his shield\nmany slim, straight arrows, well smeared with the thick, dark,\ntarry substance that rendered deadly their tiniest needle prick.\n\nNight found Kulonga far from the palisades of his father's\nvillage, but still headed westward, and climbing into the fork\nof a great tree he fashioned a rude platform and curled himself\nfor sleep.\n\nThree miles to the west slept the tribe of Kerchak.\n\nEarly the next morning the apes were astir, moving\nthrough the jungle in search of food.  Tarzan, as was his\ncustom, prosecuted his search in the direction of the cabin so\nthat by leisurely hunting on the way his stomach was filled by\nthe time he reached the beach.\n\nThe apes scattered by ones, and twos, and threes in all\ndirections, but ever within sound of a signal of alarm.\n\nKala had moved slowly along an elephant track toward the\neast, and was busily engaged in turning over rotted limbs and\nlogs in search of succulent bugs and fungi, when the faintest\nshadow of a strange noise brought her to startled attention.\n\nFor fifty yards before her the trail was straight, and down\nthis leafy tunnel she saw the stealthy advancing figure of a\nstrange and fearful creature.\n\nIt was Kulonga.\n\nKala did not wait to see more, but, turning, moved rapidly back\nalong the trail.  She did not run; but, after the manner of her\nkind when not aroused, sought rather to avoid than to escape.\n\nClose after her came Kulonga.  Here was meat.  He could\nmake a killing and feast well this day.  On he hurried, his\nspear poised for the throw.\n\nAt a turning of the trail he came in sight of her again\nupon another straight stretch.  His spear hand went far back\nthe muscles rolled, lightning-like, beneath the sleek hide.  Out\nshot the arm, and the spear sped toward Kala.\n\nA poor cast.  It but grazed her side.\n\nWith a cry of rage and pain the she-ape turned upon her\ntormentor.  In an instant the trees were crashing beneath the\nweight of her hurrying fellows, swinging rapidly toward the\nscene of trouble in answer to Kala's scream.\n\nAs she charged, Kulonga unslung his bow and fitted an\narrow with almost unthinkable quickness.  Drawing the shaft\nfar back he drove the poisoned missile straight into the heart\nof the great anthropoid.\n\nWith a horrid scream Kala plunged forward upon her face\nbefore the astonished members of her tribe.\n\nRoaring and shrieking the apes dashed toward Kulonga,\nbut that wary savage was fleeing down the trail like a\nfrightened antelope.\n\nHe knew something of the ferocity of these wild, hairy\nmen, and his one desire was to put as many miles between\nhimself and them as he possibly could.\n\nThey followed him, racing through the trees, for a long\ndistance, but finally one by one they abandoned the chase\nand returned to the scene of the tragedy.\n\nNone of them had ever seen a man before, other than Tarzan,\nand so they wondered vaguely what strange manner of\ncreature it might be that had invaded their jungle.\n\nOn the far beach by the little cabin Tarzan heard the faint\nechoes of the conflict and knowing that something was\nseriously amiss among the tribe he hastened rapidly toward the\ndirection of the sound.\n\nWhen he arrived he found the entire tribe gathered jabbering\nabout the dead body of his slain mother.\n\nTarzan's grief and anger were unbounded.  He roared out\nhis hideous challenge time and again.  He beat upon his great\nchest with his clenched fists, and then he fell upon the body\nof Kala and sobbed out the pitiful sorrowing of his lonely heart.\n\nTo lose the only creature in all his world who ever had\nmanifested love and affection for him was the greatest\ntragedy he had ever known.\n\nWhat though Kala was a fierce and hideous ape!  To Tarzan\nshe had been kind, she had been beautiful.\n\nUpon her he had lavished, unknown to himself, all the\nreverence and respect and love that a normal English boy\nfeels for his own mother.  He had never known another, and\nso to Kala was given, though mutely, all that would have\nbelonged to the fair and lovely Lady Alice had she lived.\n\nAfter the first outburst of grief Tarzan controlled himself,\nand questioning the members of the tribe who had witnessed\nthe killing of Kala he learned all that their meager vocabulary\ncould convey.\n\nIt was enough, however, for his needs.  It told him of a\nstrange, hairless, black ape with feathers growing upon its\nhead, who launched death from a slender branch, and then ran,\nwith the fleetness of Bara, the deer, toward the rising sun.\n\nTarzan waited no longer, but leaping into the branches of the\ntrees sped rapidly through the forest.  He knew the windings\nof the elephant trail along which Kala's murderer had\nflown, and so he cut straight through the jungle to intercept\nthe black warrior who was evidently following the tortuous\ndetours of the trail.\n\nAt his side was the hunting knife of his unknown sire, and\nacross his shoulders the coils of his own long rope.  In an\nhour he struck the trail again, and coming to earth examined\nthe soil minutely.\n\nIn the soft mud on the bank of a tiny rivulet he found\nfootprints such as he alone in all the jungle had ever made,\nbut much larger than his.  His heart beat fast.  Could it be\nthat he was trailing a MAN--one of his own race?\n\nThere were two sets of imprints pointing in opposite directions.\nSo his quarry had already passed on his return along the\ntrail.  As he examined the newer spoor a tiny particle of\nearth toppled from the outer edge of one of the footprints to\nthe bottom of its shallow depression--ah, the trail was very\nfresh, his prey must have but scarcely passed.\n\nTarzan swung himself to the trees once more, and with\nswift noiselessness sped along high above the trail.\n\nHe had covered barely a mile when he came upon the\nblack warrior standing in a little open space.  In his hand\nwas his slender bow to which he had fitted one of his death\ndealing arrows.\n\nOpposite him across the little clearing stood Horta, the\nboar, with lowered head and foam flecked tucks, ready to\ncharge.\n\nTarzan looked with wonder upon the strange creature beneath\nhim--so like him in form and yet so different in face\nand color.  His books had portrayed the NEGRO, but how\ndifferent had been the dull, dead print to this sleek thing of\nebony, pulsing with life.\n\nAs the man stood there with taut drawn bow Tarzan recognized him\nnot so much the NEGRO as the ARCHER of his picture book--\n\n              A stands for Archer\n\nHow wonderful!  Tarzan almost betrayed his presence in\nthe deep excitement of his discovery.\n\nBut things were commencing to happen below him.  The sinewy\nblack arm had drawn the shaft far back; Horta, the\nboar, was charging, and then the black released the little\npoisoned arrow, and Tarzan saw it fly with the quickness of\nthought and lodge in the bristling neck of the boar.\n\nScarcely had the shaft left his bow ere Kulonga had fitted\nanother to it, but Horta, the boar, was upon him so quickly\nthat he had no time to discharge it.  With a bound the black\nleaped entirely over the rushing beast and turning with\nincredible swiftness planted a second arrow in Horta's back.\n\nThen Kulonga sprang into a near-by tree.\n\nHorta wheeled to charge his enemy once more; a dozen steps\nhe took, then he staggered and fell upon his side.  For a\nmoment his muscles stiffened and relaxed convulsively, then\nhe lay still.\n\nKulonga came down from his tree.\n\nWith a knife that hung at his side he cut several large\npieces from the boar's body, and in the center of the trail he\nbuilt a fire, cooking and eating as much as he wanted.  The\nrest he left where it had fallen.\n\nTarzan was an interested spectator.  His desire to kill\nburned fiercely in his wild breast, but his desire to learn\nwas even greater.  He would follow this savage creature for a\nwhile and know from whence he came.  He could kill him at\nhis leisure later, when the bow and deadly arrows were laid\naside.\n\nWhen Kulonga had finished his repast and disappeared beyond\na near turning of the path, Tarzan dropped quietly to\nthe ground.  With his knife he severed many strips of meat\nfrom Horta's carcass, but he did not cook them.\n\nHe had seen fire, but only when Ara, the lightning, had\ndestroyed some great tree.  That any creature of the jungle\ncould produce the red-and-yellow fangs which devoured\nwood and left nothing but fine dust surprised Tarzan greatly,\nand why the black warrior had ruined his delicious repast by\nplunging it into the blighting heat was quite beyond him.\nPossibly Ara was a friend with whom the Archer was sharing his food.\n\nBut, be that as it may, Tarzan would not ruin good meat in\nany such foolish manner, so he gobbled down a great quantity\nof the raw flesh, burying the balance of the carcass beside\nthe trail where he could find it upon his return.\n\nAnd then Lord Greystoke wiped his greasy fingers upon\nhis naked thighs and took up the trail of Kulonga, the son of\nMbonga, the king; while in far-off London another Lord\nGreystoke, the younger brother of the real Lord Greystoke's\nfather, sent back his chops to the club's CHEF because they\nwere underdone, and when he had finished his repast he\ndipped his finger-ends into a silver bowl of scented water\nand dried them upon a piece of snowy damask.\n\nAll day Tarzan followed Kulonga, hovering above him in\nthe trees like some malign spirit.  Twice more he saw him\nhurl his arrows of destruction--once at Dango, the hyena,\nand again at Manu, the monkey.  In each instance the animal\ndied almost instantly, for Kulonga's poison was very fresh\nand very deadly.\n\nTarzan thought much on this wondrous method of slaying\nas he swung slowly along at a safe distance behind his\nquarry.  He knew that alone the tiny prick of the arrow could\nnot so quickly dispatch these wild things of the jungle, who\nwere often torn and scratched and gored in a frightful manner\nas they fought with their jungle neighbors, yet as often\nrecovered as not.\n\nNo, there was something mysterious connected with these\ntiny slivers of wood which could bring death by a mere\nscratch.  He must look into the matter.\n\nThat night Kulonga slept in the crotch of a mighty tree\nand far above him crouched Tarzan of the Apes.\n\nWhen Kulonga awoke he found that his bow and arrows\nhad disappeared.  The black warrior was furious and\nfrightened, but more frightened than furious.  He searched\nthe ground below the tree, and he searched the tree above the\nground; but there was no sign of either bow or arrows or of\nthe nocturnal marauder.\n\nKulonga was panic-stricken.  His spear he had hurled at\nKala and had not recovered; and, now that his bow and arrows\nwere gone, he was defenseless except for a single knife.\nHis only hope lay in reaching the village of Mbonga as\nquickly as his legs would carry him.\n\nThat he was not far from home he was certain, so he took\nthe trail at a rapid trot.\n\n>From a great mass of impenetrable foliage a few yards\naway emerged Tarzan of the Apes to swing quietly in his wake.\n\nKulonga's bow and arrows were securely tied high in the\ntop of a giant tree from which a patch of bark had been\nremoved by a sharp knife near to the ground, and a branch\nhalf cut through and left hanging about fifty feet higher up.\nThus Tarzan blazed the forest trails and marked his caches.\n\nAs Kulonga continued his journey Tarzan closed on him\nuntil he traveled almost over the black's head.  His rope he\nnow held coiled in his right hand; he was almost ready for\nthe kill.\n\nThe moment was delayed only because Tarzan was anxious to\nascertain the black warrior's destination, and presently he\nwas rewarded, for they came suddenly in view of a great\nclearing, at one end of which lay many strange lairs.\n\nTarzan was directly over Kulonga, as he made the discovery.\nThe forest ended abruptly and beyond lay two hundred\nyards of planted fields between the jungle and the village.\n\nTarzan must act quickly or his prey would be gone; but\nTarzan's life training left so little space between decision and\naction when an emergency confronted him that there was not\neven room for the shadow of a thought between.\n\nSo it was that as Kulonga emerged from the shadow of the\njungle a slender coil of rope sped sinuously above him from\nthe lowest branch of a mighty tree directly upon the edge of\nthe fields of Mbonga, and ere the king's son had taken a half\ndozen steps into the clearing a quick noose tightened about\nhis neck.\n\nSo quickly did Tarzan of the Apes drag back his prey that\nKulonga's cry of alarm was throttled in his windpipe.  Hand\nover hand Tarzan drew the struggling black until he had him\nhanging by his neck in mid-air; then Tarzan climbed to a\nlarger branch drawing the still threshing victim well up into\nthe sheltering verdure of the tree.\n\nHere he fastened the rope securely to a stout branch, and\nthen, descending, plunged his hunting knife into Kulonga's\nheart.  Kala was avenged.\n\nTarzan examined the black minutely, for he had never\nseen any other human being.  The knife with its sheath and\nbelt caught his eye; he appropriated them.  A copper anklet\nalso took his fancy, and this he transferred to his own leg.\n\nHe examined and admired the tattooing on the forehead\nand breast.  He marveled at the sharp filed teeth.\nHe investigated and appropriated the feathered headdress,\nand then he prepared to get down to business, for Tarzan\nof the Apes was hungry, and here was meat; meat of the kill,\nwhich jungle ethics permitted him to eat.\n\nHow may we judge him, by what standards, this ape-man\nwith the heart and head and body of an English gentleman,\nand the training of a wild beast?\n\nTublat, whom he had hated and who had hated him, he\nhad killed in a fair fight, and yet never had the thought of\neating Tublat's flesh entered his head.  It could have been as\nrevolting to him as is cannibalism to us.\n\nBut who was Kulonga that he might not be eaten as fairly\nas Horta, the boar, or Bara, the deer?  Was he not simply\nanother of the countless wild things of the jungle who preyed\nupon one another to satisfy the cravings of hunger?\n\nSuddenly, a strange doubt stayed his hand.  Had not his\nbooks taught him that he was a man?  And was not The\nArcher a man, also?\n\nDid men eat men?  Alas, he did not know.  Why, then, this\nhesitancy!  Once more he essayed the effort, but a qualm of\nnausea overwhelmed him.  He did not understand.\n\nAll he knew was that he could not eat the flesh of this\nblack man, and thus hereditary instinct, ages old, usurped the\nfunctions of his untaught mind and saved him from transgressing\na worldwide law of whose very existence he was ignorant.\n\nQuickly he lowered Kulonga's body to the ground, removed\nthe noose, and took to the trees again.\n\n\n\nRead Next Part online | Table of Contents | Discuss this Book\nPlease use our feedback form if there are any problems with your book selection.\n\n\nPrinter Friendly Version |\n      Send this story to a friend |\n      Search on Amazon™\n\n\n\n\nNew Books\n Peace on Earth, Good-Will to Dogs: Eleanor Hallowell Abbott What The Animals Do and Say: Eliza Lee Follen Lost Face: Jack London North of Boston: Robert Frost What Every Woman Knows: J.M. Barrie The World Set Free: Herbert George Wells Laughter:  An Essay on the Meaning of the Comic: Henri Bergson A Treatise on Good Works: Martin Luther The Princess Pocahontas: Virginia Watson\n\nWashington Post Book Reviews\nGet daily reviews of the newest books -- free. Washington Post writers analyze, praise, and criticize the newest book releases. \nClick here to instantly subscribe to the Book Reviews ezine.Click here for more information before subscribing.\n\n      -- From the ArcaMax Editors \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMore From ArcaMax Publishing\nNewsletters:\nComics -\n         Knowledge -\n         Lifestyles -\n         News -\n         More\n\nClassic Books:\nFiction -\n         Non Fiction -\n         Short Stories -\n         Sci Fi -\n         More\n\nMore:\nQuizzes -\n         Sudoku -\n         Crossword -\n         Weather -\n         Sports -\n         Columns\n\n\n\nAd Free Newsletter\n           ArcaMax publications are now available in an \"advertising-free\" format.\nPlease click here for details.\n         \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDo you suffer from Lactose Intolerance?\n\n\n\n\n\nRequest a free brochure for Lactagen today!\n\n\nLactagen is the ONLY one-time solution on the market to treat lactose intolerance. No\nmore worrying about dairy in your meals!\n\n\nGo here to learn more about Lactagen & get your free brochure.\n\n\n\n\n\n\n\n\nQuick Clicks\n\nWorking harder but getting nowhere? Change your results; Click to learn more!\n\n\nGOT INK? SAVE Up To 90% on Ink Cartridges 3 for 1 Pricing: Read more\n\n\nLose 20 lbs w/ the Hoodia Diet Patch - Get 1 week Free\n\n\nDream Job: Paid Surveys, Focus Groups at Home\n\n\n\"Seized Real Estate\" Guaranteed Bargains in Every US State\n\n\nPlay games - Get Paid. Simple. 150+ companies need you - Read more.\n\n\nWhy pay $90 a month for Cable or Sat.TV services? Download A TV!\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe found the answer to our Prayers:\nA Business That Set Us Free!\n\n\n\nA Home based business founded on Christian Principles:\n\n\n\n\n • Executive Incomes\n • Time for Family,\n • Personal growth,\n • Recreation & travel\n\n\nAnd so much more...\n\n\n\nPlease Read the Full Story Here.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      Make sure this email gets to your inbox (and not your junk\n      folder): just add ezines@arcamax.com to your e-mail address book or\n      safe list. Thank you!\n     \n\n\n\n\n        ArcaMax Publishing, Inc. \n        744 Thimble Shoals Blvd. Suite C \n        Newport News, VA 23606 \n\n        Fax: (757) 596-9731\n       \n\n\n\n        ArcaMax Publishing is a leading publisher of family-friendly newsletters, featuring popular comics, games, feature columns and books by email. Thank you for reading the \"Book Club\" newsletter from the following email address:\n        debian-laptop@lists.debian.org.\n\n        \nPlease feel free to forward this email on to your friends!\n\nADVERTISING With ArcaMax\n3.2 Million Active Subscriptions Permission email that pays - \nGet\n        details today!\n\n\n\n\n\nMy Account\nUnsubscribing\nAdvertiser's Directory\nFAQ / Help\nContact the Editor\n\n\nManage your subscriptions, change your email address, email format and more...\nIf you wish to no longer receive this newsletter you can unsubscribe here, or visit our unsubscribe page.\nContact information for recent advertisers.Consumer Online Buying Guide:  FTC Tips for shopping online\nAnswers to our most frequently asked questions. Contact Customer Service\nHave a question or comment about an article you read in one of our ezines?\n\n\n\n\n\n\n\n\n     Copyright © 2007 ArcaMax Publishing, Inc. and its licensors.\n     All registered trademarks are the property of their respective owners.\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n"}