{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"New Update to fix Windows File Errors\" <qy4d6-j-h@ventseparate.com>", "subject": "Another Update to fix Windows File Errors in registry ", "body": "here is the File Error Notification Follow-up that you have been expecting. We apologize for not sending it sooner.We noticed that you hadn't run the diagnostics test to check for any potentially harmful file errors located in your PC's or laptop's registry, so we wanted to send it to you again.\nPress below to launch the Diagnostics Test download:\n\nPress HERE to begin:\n\nhttp://keeperbasket.com/t/qy4d6-j-h/347320\n\nPlease read carefully to learn how to locate these potentially harmful file errors located on your PC, and how to fix them.\n\nAre you aware that over 95% of ALL PC's have file errors in Windows that could cause your PC to crash, lose important memory, and cause other software on your PC to fail or uninstall without your knowledge.\n\nProtect Your PC From Annoying and Harmful File Errors and Major System Problems today with a FREE PC Diagnostics Test and Report which will hunt out & rectify even the smallest Windows problems on your PC.\n\nPress below to launch the Diagnostics Test download:\n\nPress HERE to begin:\n\nhttp://keeperbasket.com/t/qy4d6-j-h/347320\n\nIf after completing the free Diagnostic Test it is brought to your attention that your computer's registry does contain file \"errors\", then it may be in your computer's best interest to fix the potentially harmful file errors in your registry.\n\nOnce again, there are NO OBLIGATIONS for this FREE OFFER that includes our FREE Software, FREE Analysis, FREE Report and 24 Hour Support !\n\nPress below to launch the Diagnostics Test download now:\n\nPress HERE to begin:\n\nhttp://keeperbasket.com/t/qy4d6-j-h/347320\n\n\n\n\nCopyright  2002 - 2007 All Rights Reserved\n\nTo not receive future offers/promotions from \"Error Nuker\" please press on the below link:\n\nhttp://keeperbasket.com/t/qy4d6-j-h/347321\n\nOr send us a letter at:\n100 E. San Marcos Blvd.\nSan Marcos, CA 92069 \n\n\nHi Subscriber! You are receiving this solicitation because producttestpanel@speedy.uwaterloo.ca previously agreed to receive correspondence from Copper Banana. If this service should fail to meet your expectations, feel free to disassociate yourself from our service.\nhttp://keeperbasket.com/u/1578/producttestpanel%40speedy.uwaterloo.ca/2\n\nShould you want to contact us via the United States Postal Service, our address is as follows:\n405 Tarrytown Road Suite 1203 White Plains, NY 10607\n\n\n"}