{"category": "ham", "to_address": "\"'Speakup is a screen review system for Linux.'\" <speakup@braille.uwo.ca>", "from_address": "\"Georgina Joyce\" <gena-j@bulldoghome.com>", "subject": "RE: e-books and the blind in the United States", "body": "Hi\n\nHey!  As a brit, don't know how to respond to that!  What's my cut? \n\nGena\n\nAmateur Call: M 0 E B P\n\nVOIP / IM: gena1959uk\n\n\n\n-----Original Message-----\nFrom: speakup-bounces@braille.uwo.ca [mailto:speakup-bounces@braille.uwo.ca] On Behalf Of Chuck Hallenbeck\nSent: Monday, June 18, 2007 11:11 PM\nTo: Speakup is a screen review system for Linux.\nSubject: Re: e-books and the blind in the United States\n\n\n>From the wikipedia:\n\nBritish Museum algorithm\n\nThe British Museum algorithm is a general approach to find a solution by\nchecking all possibilities one by one, beginning with the smallest.\nThe term refers to a conceptual, not a practical,\ntechnique where the number of possibilities are enormous.\n\nFor instance, one may, in theory, find the smallest program that solves a\nparticular problem in the following way:\nGenerate all possible source codes of length one character.\nCheck each one to see if it solves the problem. (Note:\nthe {halting problem} makes this check troublesome.)\nIf not, generate and check all programs of two characters, three characters, etc.\nConceptually, this finds the smallest program,\nbut in practice it tends to take an unacceptable amount of time (more than the\nlifetime of the universe, in many instances).\n\nSimilar arguments can be made to show that optimizations, theorem proving,\nlanguage recognition, etc. is possible or impossible.\n\n---- snip ---\n\nI have a vague recollection of mentioning this concept to Jude about a\nhundred years ago, but I certainly never recommended \"the package\".\nInterestingly, the origin of the term, not discussed above, is from the\nclassic \"Gulliver's Travels\" written by Dean Jonathan Swift many years\nago. In one of the lesser books, Lemuel Gulliver visits other lands\nbesides the one where he was imprisoned by the Lilliputians. In one of\nthose lands, he was shown a team of monkeys seated before mechanical\nwriting machines, pounding away at the keys, to produce strings of text\non paper. An interesting \"future glimpse\" of what would later be the\ntypewriter. Gulliver was told that, given enough time and sufficient\nresources, these very talented monkeys would eventually produce the\nentire contents of every book presently stored in -- guess where? --\n\"The British Museum.\" \n\nThe term \"British Museum Algorithm\" has been used facetiously ever\nsince the dawn of A.I. to refer disparagingly to a \"brute force\"\ndistinctly unintelligent solution method.\n\nIf anyone would like a copy of the B.M.A. package, please send a check\nin the amount of $100 to me, and if sufficient checks arrive, I will\nwrite one and send it to you.\n\nChuck\n\nPS: Jude, thanks for the plug -- I'll split the proceeds.\n\n\n\n-- \nThe Moon is Waxing Crescent (17% of Full)\n You can get downloads from http://www.mhcable.com/~chuckh/software.html\n The early bird may get the worm, but the second mouse gets the cheese.\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n__________ NOD32 2337 (20070618) Information __________\n\nThis message was checked by NOD32 antivirus system.\n  part000.txt - file is not an archive\n\nhttp://www.eset.com\n\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}