{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "This Weekend on BBC Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMANISH BHASIN ON THE CRICKET WORLD CUP FINAL\n Australia take on Sri Lanka in the Cricket World Cup final in Barbados on Saturday and the Aussies look unstoppable. \n\n\nThey've won every game comprehensively, they've been so clinical it's almost frightening, and the only crack in their armour would appear to be complacency. \n\n\nThey've yet to lose more than six wickets in a game so far and are unbeaten in their past 28 World Cup games, but after such a great run the law of averages says they are due to come unstuck at some stage.\n\n\nThe multi-talented Sri Lankans possess arguably the best bowling attack of the tournament and may have pulled off a masterstroke by not playing their three best bowlers against Australia in the Super Eight stage. \n\n\nAt the time I thought they had let themselves down slightly by not playing Chaminda Vaas, Muttiah Muralitharan and Lasith Malinga, but it could have a bearing on the outcome. \n\n\nIn Malinga they have one of the stars of the World Cup. \n\n\nUnbelievably the paceman has never faced Australia in a one-day international and has not played them in a Test since 2004. \n\n\nThis could work hugely in Sri Lanka's favour as he has come on leaps and bounds since then and is such a devastating bowler because of his unique style of delivery. \n\n\nThere is no doubt that some aspects of the World Cup have been disappointing, and the ICC must bear some responsibility for that. \n\n\nBy stopping musical instruments being brought into grounds and charging exorbitant ticket prices, the much-anticipated local Caribbean flavour has been lost. \n\n\nThe tournament has also had to cope with the shocking death of Pakistan coach Bob Woolmer. \n\n\nEveryone was talking about this being a carnival of cricket - let's hope the final can be just that. \n\n\nEnjoy the game, \n\n\nManish \n\n\nManish will present highlights of the Cricket World Cup final on Saturday from 2350 BST on BBC ONE.\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nCRICKET WORLD CUP\n bbc.co.uk/cricket\nSunday\nAustralia v Sri Lanka (1400-2330, Radio Five Live Sports Extra, BBCi and BBC Sport website); Cricket World Cup highlights (2350-0050, BBC ONE; repeated at 0500-0600 on Sunday).\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\tRead live text reports, expert opinion, blogs and photo galleries at bbc.co.uk/cricket.\n\n\n\n\n\n\nFOOTBALL ON THE BBC\n bbc.co.uk/football\nSaturday\nFootball Focus (1210, BBC ONE); Premiership commentary (1245, Radio Five Live/online); Score (1430, BBCi & BBC Sport website); Premiership commentary (Radio Five Live/online); Final Score (1630, BBC ONE); Match of the Day (2230, BBC ONE).\nSunday\nMatch of the Day repeat (0735, BBC ONE); Crystal Palace v Derby (1330, Radio Five Live/online); Arsenal v Fulham (1600, Radio Five Live/online); Match of the Day 2 (2230, BBC TWO).\n\n\n\n\n\n\nWORLD SNOOKER\n bbc.co.uk/snooker\nSaturday\n1000-2300, BBCi and website; 1300-1630, BBC ONE and website; 1730-2030, BBC TWO and website. Highlights: 0100-0350, BBC TWO.\nSunday\n1400-2300, BBCi and website; 1500-1730 and 1900-2200, BBC TWO and website. Highlights: 0030-0320, BBC TWO.\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\tChoose which match to watch on BBCi via the red button, and the BBC Sport website throughout the Championship from 1000-2300.\n\n\n\n\n\n\nEUROPEAN GYMNASTICS\n bbc.co.uk/gymnastics\nSaturday\n1125-1345 and 1425-1700 (Not available on Freeview), BBCi and BBC Sport website\nSunday\n0955-1300 and 1355-1700, BBCi and BBC Sport website; 1500-1730, BBC TWO and BBC Sport website.   \n\n\n\n\n\n\nMORE SPORT ON THE BBC \n bbc.co.uk/tvandradio\nSunday\nRugby league: Super League Show (1300-1400, BBC North and website); Rugby union: Premiership highlights (1330-1355, BBC TWO); Rugby league: Bradford v Warrington (1455-1645, Radio Five Live Sports Extra).\n\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tWorld Cup blog\n Expert opinion ahead of the big game in Barbados\n\t\t\t\t\t\n\t\t\t\t\t\tWorld Cup head-to-head\n How do Australia and Sri Lanka match up? \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}