{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "\"Aaron Boyle\" <aeboyle@hotmail.com>", "subject": "[Ip-health] FW: ACT UP zaps Magic Johnson", "body": "This is a multi-part message in MIME format.\n--\n\n>From: Mark M \n>Date: Thu, 26 Apr 2007 21:49:06 -0400\n>\n>Great action tonight to confront Abbott on their attempts to block generic\n>versions of their HIV drug, Kaletra, in poor countries.  The entire event\n>was just a huge Kaletra ad, so it was the perfect place to zap the many\n>Abbott reps, including Magic, who were there.\n>\n>Here's the press release - please spread it far and wide!\n>\n>Mark M.\n>___________________________________\n>\n>CONTACT:  Aaron Boyle - 917.621.6667\n>\n>AIDS ACTIVISTS CONFRONT MAGIC JOHNSON AT ABBOTT FORUM\n>\n>Former NBA Star Voices Support for Activist Demands for Access for Poor\n>Countries\n>\n>BROOKLYN, April 26 -  Earvin \"Magic\" Johnson, spokesperson for Abbott\n>Laboratories, voiced support for activist demands that Abbott cease its\n>efforts to block generic versions of its HIV drug Kaletra in Thailand and\n>other countries, at a forum sponsored by Abbott at Medgar Evers College in\n>Brooklyn, New York.\n>\n>When confronted by a dozen activists holding signs that read, \"Magic: Help\n>Us Get Kaletra To Thailand\" and \"Abbott's Greed Kills PWAs In Thailand,\"\n>Johnson first responded by saying, \"Let's give them a round of applause.\"\n>When pressed about Abbott's actions, he stated, \"I'm on it.  I'm talking to\n>Abbott about it.\"\n>\n>ACTUP/NY was participating in a Global Day of Action condemning Abbott\n>Laboratories for their recent move in Thailand to pull seven new\n>medications from the country in retaliation to the Thai government's lawful\n>attempts to secure access to affordable generic medicines for its citizens.\n>  AIDS activists in Thailand have called for this day of action which\n>coincides with Abbott Laboratories April 27 shareholder meeting in Chicago.\n>  Dozens of related protests will be occurring in several countries\n>throughout the world calling on Abbott to stop threatening the public\n>health of Thailand.\n>\n>\"While Magic Johnson enjoys easy access to Abbott's lifesaving medications,\n>countless others in need of HIV treatment across the globe are left out by\n>Abbott's unfair practices of setting overly expensive prices and blocking\n>legal generic production,\" stated Johnny Guaylupo of ACTUP/NY.\n>\n>\"Abbott has really exposed the depths of their greed this time as they\n>attempt to protect their profits by resorting to blackmail that puts Thai\n>lives in the balance.  We need Magic to take a stand against his sponsor's\n>abusive practices,\" said Amanda Lugg of ACTUP/NY.\n>\n>\"Magic Johnson was known for his gutsy play on the basketball court, but\n>where is that courage and leadership now as people with AIDS in Thailand\n>and around the world are being denied access to the Abbott medication he\n>endorses?\" remarked long-time ACTUP/NY member Ken Bing.\n>\n>_________________________________________________________________\n>Mortgage rates near historic lows. Refinance $200,000 loan for as low as\n>$771/month*\n>https://www2.nextag.com/goto.jsp?product=100000035&url=%2fst.jsp&tm=y&search=mortgage_text_links_88_h27f8&disc=y&vers=689&s=4056&p=5117\n>\n>HGAPALLIES is a closed, confidential list. Please do not forward any\n>messages from this list without the permission of the original poster.\n\n_________________________________________________________________\nMortgage refinance is Hot. *Terms. Get a 5.375%* fix rate. Check savings\nhttps://www2.nextag.com/goto.jsp?product=100000035&url=%2fst.jsp&tm=y&search=mortgage_text_links_88_h2bbb&disc=y&vers=925&s=4056&p=5117\n--\n[ MagicRelease.doc of type application/msword deleted ]\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}