{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Garry Dawkins\" <menedcareyphotopef@edcareyphoto.com>", "subject": "Watch the pounds disappear", "body": "\nMake yourself more attractive to others\n\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting product for weighty people is now easily available – As could be seen on BBC.\n\n\nCan you count up all the times when you told yourself you would do any thing for being rescued from this quickly growing pounds of fat? Happily, now no major offering is necessary. With Anatrim, the earth-shaking weight-reducing mixture, you can achieve naturally health lifestyle and become really slimmer. Have a look at what people write!\n\n\n\n\"It’s quite difficult to admit it but I was a junk food addict. \n\n\nI greedily devoured all this garbige \n\n\nand could not stop. \n\n\n\n\nThis fatal passion left off when I started taking Anatrim! \n\n\nGod,\n\n\n\n\n my appetite vanished, \n\n\nmood improved and I turned to the happiest person 28 pounds in 2.5 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person on the planet!\"\n\n\n\n\n\nSilvia D., Bellevue WA\n\n\n\n\n\n\"I had weight problems since a boy. \n\n\nYou can't even fancy how I detested being mocked at school. \n\n\n\n\nI detested my plumpness and I hated myself. \n\n\nAfter trying this and that I heard about Anatrim. \n\n\n\n\nIt literally dragged me out of this nightmare! A lot of thanks to you, my friends.\"\n\n\n\n\n\nSteve Burbon, Washington\n\n\n\n\n\n\"You know what? Thanks to Anatrim my marriage was saved! I got into this circle, depression – more eating – just more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nMy friend pointed to your web page and I asked for my pack of Anatrim at the same time. \n\n\nThe final result was excellent, my appetite came to normal level, I was in a good mood oftener, and, be sure, I tightened my belt with no regrets. And you see, the sex became fantastic also!\"\n\n\n\n\n\nCharley\n\n\n\n\n There many and many gratitudes left by delighted people taking Anatrim. Don’t you gonna join the tens of thousands of slim buyers and take this natural appetite decreasing energy raising product now!\n\n\nDon’t lose your chance!\n\n\n\n\n"}