{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Frederick Kidd\" <veqdelcotimesxod@delcotimes.com>", "subject": "A simple and safe way to weigh less", "body": "\nYou'll love the new, non-obese you\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting product for corpulent people available – As you could see on ABC\n\n\n\nDid you realize excessive body kilos kill a lot of people around the world? We know you hate the unattractive look of those people and the low status they obviously have in society. \n\nMoreover, you got no will to resist an assault of fatal eating habits of yours. If this all sounds familiar, then we got something for your consideration!\n\n\n\n\n\nHere there is Anatrim, the new product for the elimination of your body’s extra weight. The astounding thing about Anatrim is it improves the quality of your life, repressing the feeling of hunger and giving you gay spirit. Note what people say to us on this product:\n\n\n\n\n\n\"It is amazing! \n\n\nInstead of stuffing myself with food and watching TV continually \n\n\nI became keen on doing sport.\n\n\n\n\n\n\n Anatrim got me on the right path.\n\n\n I feel fit as a fiddle now and there are lots of men in my way!\"\n\n\n\n\n\n\nVictoria K., San Diego\n\n\n\n\n\n\n\"I tried some passive weight burning, you know, but all came in vain. I could not restrain my ravenous appetite. \n\n\nOne day I heard about Anatrim in the media and it brought a great influence on me.\n\n\n I had tried using it, and my wife said that I'm a different person now, 4 months later. \n\n\n27 pounds off and I keep still losing them! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nMike Brown, Bellevue WA\n\n\n\n\n\nAnatrim gives you an opportunity to understand your body doesn’t need that much food. It lifts your mood up, provides you with extra energy, and attacks useless kilos. Great thanks to its mighty comprehensive formula!!\n\n\n\nPry out latest intelligence!\n\n\n\n"}