{"category": "ham", "to_address": "\"Waichler, Scott R\" <Scott.Waichler@pnl.gov>", "from_address": "Martyn Plummer <plummer@iarc.fr>", "subject": "Re: [R] How to create an R RPM from source", "body": "On Mon, 2007-05-21 at 07:46 -0700, Waichler, Scott R wrote:\n> I use some computers that run older versions of Redhat Linux such as\n> EL3.  RPMs for the current version of R are no longer provided via CRAN\n> for these older operating system versions.  How can I compile my own RPM\n> for the current version of R, which I could then use to install R\n> quickly and easily on multiple machines?  Perhaps the answer to this\n> would be a useful addition to the manual R Installation and\n> Administration.   Obviously, I am not a system administrator and I don't\n> deal with compiling from source code or using SRPMs very much.  If\n> anyone can explain the process step-by-step or refer me to instructions\n> for the non-expert I would appreciate it.\n> \n> Thank you,\n> Scott Waichler\n> Pacific Northwest National Laboratory\n> scott.waichler _at_ pnl.gov\n\nHi Scott,\n\nYou need some sysadmin experience to do this.\n\nYou can build a new binary RPM from the source RPM, which is also\navailable from CRAN, by typing\n\nrpmbuild --rebuild /path/to/source.rpm\n\nIf you do this as root, then the result will be in \n/usr/src/redhat/RPMS/i386, or\n/usr/src/redhat/RPMS/x86_64\ndepending on your platform.\n\nYou will get an error if you have not installed all the RPM packages\nrequired to build R correctly. Install them. The best way to do this is\nto use \"yum\", since it handles dependencies between packages.\n\nIt is much more secure to build RPMs as a normal user. You just need to\ncreate a file .rpmmacros in your home directory, with a single entry,\nlike this:\n\n%_topdir        /home/martyn/mybuild\n\nThen create the same directory structure under the directory \"mybuild\"\nas you find under /usr/src/redhat.\n\nI hope this helps.\n\nMartyn\n\n\n-----------------------------------------------------------------------\nThis message and its attachments are strictly confidential. ...{{dropped}}\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}