{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Genesearch <enews@genesearch.com.au>", "subject": "Cell Signalling Resources", "body": "\nYou're receiving this email because of your relationship with Genesearch. Please confirm your continued interest in receiving email from us or refine the product types you would like to receive information on.  You may unsubscribe if you no longer wish to receive our emails.\n\n\n\n\n\n\n\n\n\n\n\n\n\nCell Signaling Resources \n\n\n\n\n\n\n\n\nInformation Resources + Sale Reminder\nJune 2007\n\n\n\n\n\n\n\n\nIn This Issue\n\n\nResources for Your Research\n\nCST Catalog\n\nPhosphoSite\n\nPathways in Human Cancer\n\nKinase-Disease Associations\n\nReference Guide\n\nAntibody Validation Tables\n\nCatalogs of Validated Antibodies\n\n\n\n\n\nLess than a fortnight remains to save 20%!\nOur 20% off sale on CST's range of total protein antibodies (i.e. ones that detect both the active and inactive forms of their target signaling proteins) expires at the end of June! Order now to take advantage of these exceptional prices.View a list of CST's total antibodies here.\n\n\n\n\n\nQuick Links\nCST Web Site\nGenesearch Web Site\nPhosphoSite\nAustralian Prices\n\n\n\n\n\n\n\n\n\n\n\n Resources for Your ResearchCell Signaling Technology is run by scientists in the field who understand the need for accurate, up to date information in this rapidly developing field.This issue of Genesearch's eNews features a selection of the information resources provided free of charge by Cell Signaling Technology, from their own Catalog and Technical Reference to the NIH-supported PhosphoSite curated by CST scientists.And don't forget there are less than 2 weeks remaining on our \"20% off total antibodies\" sale (see sidebar)!\n\n\n\n\n\n\n\n\n\n\n CST 2007-08 Catalog & Technical ReferenceCell Signaling Technology's 2007-08 Catalog & Technical Reference is now available.The Catalog & Technical Reference contains a complete product listing along with updated, detailed background information on signal transduction pathways critical for cell proliferation, growth, survival, differentiation and programmed death.Add your name to our catalog mailing list now.\n\n\n\n\n\n\n PhosphoSite®PhosphoSite is an expert-curated knowledgebase of information focused on protein phosphorylation, mainly in vertebrates. In addition to phosphorylation sites curated from the literature, large numbers of new unpublished sites discovered by MS/MS analyses are being added regularly. This unpublished information is added in order to rapidly disseminate information about the large numbers of new phosphorylation sites being discovered by scientists at Cell Signaling Technology and other institutions. Unpublised sites must meet rigorous quality standards before being curated into PhosphoSite.Visit PhosphoSite now.\n\n\t\t\t\n\n\n\n\n\n Pathways in Human Cancer PosterCell Signaling Technology's latest poster is a companion piece to the textbook The Biology of Cancer by Dr. Robert A. Weinberg of the Whitehead Institute for Biomedical Research, Massachusetts Institute of Technology, USA.Email us to request your poster.\n\n\n\n\n\n\n Kinase-Disease AssociationsAs key regulators of most cellular pathways, protein kinases are frequently associated with disease, as causative agents or points of therapeutic intervention. CST have summarised the disease associations for over 150 kinases, including the molecular basis of the association and relevant Medline and OMIM links.Availalbe on the web or email us for a printed copy.\n\n\n\n\n\n Reference GuideCST's catalog contains extensive technical information on signal transduction, but would you like the critical information in one handy guide?The Cell Signaling Technology Reference Guide is a booklet including the kinase disease associations table, detailed diagrams of the human kinome, a summary of human oncogenes and tumour suppressor genes, and more than 30 signal transduction pathway diagrams.Email us for your copy of the Reference Guide. \n\t\t\t\n\n\n\n\n\nAntibody Validation TablesEach activation-state antibody entry in CST's catalog includes which technologies the antibody is validated for. But CST also provide a handy printed set of Antibody Validation Tables listing comparative species reactivity and technology validation (WB, IP, Imunohistochemistry and Immunofluorescence) for their antibodies in the classes of Akt, Caspase-3, p44/42 MAPK Kinase, p38 MAP Kinase, SAPK/JNK, Stat3 and CREB.Email us to request your copy of the validation tables.\n\n\n\n\n\n Catalogs of Validated AntibodiesCell SIgnaling Technology provides the highest quality activation-state and total antibodies available for use in immunohistochemistry (IHC) and immunofluorescence (IF). CST's antibodies have been extensively validated for IHC and IF by their in-house clinical applications group. As a guide for your research, CST have produced separate catalogs of their antibodies validated for immunochemistry and immunofluorescence.Email us for your specialised application catalog (please specify whether you want the IHC or IF catalog).\n\n\n\n\n\n\n\n\n\n\n\n\nAbout GenesearchGenesearch is an Australian company founded in 1980. In addition to our own research and development we are the Australian distributor for New England Biolabs products for molecular biology; Cell Signaling Technology signal transduction antibodies; Finnzymes enzymes and equipment for PCR; Gene Codes' Sequencher, the premier software for DNA sequence assembly and analysis; and CLC bio, providers of complete software and hardware bioinformatics solutions\n\t\t\n\n\n\n\n\nFurther InformationFor further information, pricing and orders contact Genesearch on 1800 074 278 or email us at info@genesearch.com.auBest RegardsGenesearch\n\n\n\n\n\n\n\n\n\n\n\nForward email\n\n\n\n\nThis email was sent to ktwarwic@speedy.uwaterloo.ca, by enews@genesearch.com.au\nUpdate Profile/Email Address | Instant removal with SafeUnsubscribe™ | Privacy Policy.\n\n\nEmail Marketing by\n\n\n\nGenesearch | 14 Technology Dr | Arundel | 4214 | Australia\n\n\n\n\n"}