{"category": "ham", "to_address": "debian-desktop@lists.debian.org", "from_address": "Daniel Baumann <daniel@debian.org>", "subject": "Re: Debian GNU/Linux (kfreebsd anyone?) Lenny Desktop wishlist thread", "body": "Gustavo Franco wrote:\n> It's good to make sure that Debian Live desktop images matches the\n> Debian Desktop users needs.\n\n\"debian-live desktop\" == \"debian desktop\"\n\nwe use tasksel for the package selection on the desktop images. if you\ninstall debian with d-i/g-i and choose, e.g. kde-desktop, you have the\n99.99% exact same system as you have on the live system. why? because\nthe \"live system\" is a 'non-live system\" plus casper installed, that's\nthe only difference.\n\n> * More than have voice on the mailing list, rw access our svn being\n> able to prepare 'live flavored artwork' based on our debian-moreblue\n> update\n\ncenceptially, there shouldn't be live specific artwork in the live\nsystem than it is in debian. why? because *debian*-live is not just yet\nanother live system, it's debian.\n\n> * Make sure that the set of desktop related packages fit a live user need\n\nin an equality relation, the same from above is also valid in the other\ndirection: \"debian desktop\" == \"debian-live desktop\" :)\n\nas long as you care about tasksel for all debian users, you include \"us\"\nanyway.\n\n> Yeah, and I thought g-i was on track. Do you think that it will be\n> more like \"win32 loader\" or \"ubiquity\" in terms of usability ?\n\ni'm not sure if i understand you right.\n\nthe \"d-i/g-i on the same image\" is, from the usability pov, like the\nresult of win32 loader. you choose at the boot prompt, if you want to\ninstall or if you want to launch the live system\n\nthe \"d-i/g-i within the system\" is, from the usability pov, like\nubiquity, you click on your desktop an icon and it launches starts\nd-i/g-i in a terminal/opens a gui application.\n\n> 'live-to-hdd' as in 'the same thing you're running here live on your\n> hd', ubiquity-like, right?\n\nlike ubiquity, yes. ubiquity is nice, but it is not integrated into\nd-i/g-i. actually, we go for something like a d-i/g-i mini version;\nwhere most parts (e.g. hardware detection, package selection, package\ninstallation etc.) are skipped, and a new one is added to uncompress the\nsquashfs image to the harddisk.\n\n-- \nAddress:        Daniel Baumann, Burgunderstrasse 3, CH-4562 Biberist\nEmail:          daniel.baumann@panthera-systems.net\nInternet:       http://people.panthera-systems.net/~daniel-baumann/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}