{"category": "ham", "to_address": "debian-devel@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Don Armstrong <don@debian.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "Since it was requested, allow me to put forward a simple example of a\ncase where choice of venue coupled with choice of law is suboptimal.\nStar is licensed under a modified CDDL license, which specifies\nBerlin, Germany as the choice of law and venue. \n\nIf the author of Star decides that the Debian maintainer has\nincorrectly removed a \"copyright notice\",[1] he could terminate the\nlicense under 6.1, and bring action in Berlin for copyright\ninfringement; the maintainer and any other parties to the action\n(people to whom the work was distributed after notification of breech)\nwould then have to defend themselves in Berlin instead of notifying\nthe court that the venue was improper (or whatever the German\nequivalent is.)\n\nConsidering the saber rattling that has come from star's upstream over\nprecisely this issue in cdrecord, it's not so far fetched.\n\nOn Sun, 03 Jun 2007, Anthony Towns wrote:\n> On Sat, Jun 02, 2007 at 09:29:08PM -0700, Don Armstrong wrote:\n> > Choice of venue clauses can short circuit the normal determination of\n> > jurisdiction in civil cases in some jurisdictions in some cases.\n> \n> Contracts and licenses in general short-circuit the normal\n> determination of rights under common or legislated law in some\n> jurisdictions in some cases too.\n\nOf course; this is a refutation of the thesis that \"choice of venue\"\nclauses are legally void, not a claim that they are unique.\n\n> > Since this is giving up a right normally enjoyed in exchange for\n> > the ability to use or modify a work, it appears be a fee, and as\n> > such fails DFSG 1.\n> \n> You're not giving up any rights, you're gaining the right to modify\n> and distribute the software under certain conditions, just as you\n> are under the GPL.\n\nWe don't give up rights under the GPL that we otherwise enjoy though;\nwe only gain ones in specific circumstances. In the case of the CDDL,\nwe lose rights even in the case where we're only using the work.\n\n> You're required to give up something you might value and otherwise\n> demand compensation for, certainly, but there needs to be something\n> more than that to violate the DFSG.\n\n\"giving up something that you might value [or] otherwise demand\ncompensation for\" applies equally well to cash money as it does to any\nother intangible which has value. A requirement to send an email to\nthe licensor if you possibly can isn't \"cash money\" either, but it\nsure seems to be a fee to me.\n\n> The DFSG are a set of *guidelines*, if you can't explain violations\n> in simple, understandable terms, they're not violations.\n\nThis is my understanding as well; I'm only explaining the application\nto DFSG 1 to attempt to appease strict constructionists.\n\n> > I'm personally using \"feel\" as shorthand for \"my understanding of\n> > the legal situtation regarding this clause and its relation to the\n> > DFSG\"\n> \n> That's great, but *your understanding* isn't any more important than\n> anyone else's.\n\nI'm not claiming that it is; my point is that my understanding is not\n*less* important than anyone else's. I've done what everyone should do\nto come to an understanding.\n\n> There's something fundamentally wrong with the way discussions work\n> on debian-legal that people think that simply posting their\n> understanding is a valuable contribution.\n\nWhat else can we do? We take input, we examine it, we respond with our\nunderstanding of how the input meshes together. I don't believe we're\ncapable of presenting absolute truth.\n\n> The reason why it's not is that it doesn't provide any good way of\n> resolving disagreements: you can either revert to authority (such as\n> ftpmaster's), you can resort to polls (such as a GR or an informal\n> one on forums.debian.net), or you can attack people who hold\n> different opinions in the hopes that they'll stop speaking and thus\n> not be heard in future.\n\nOr we can try to understand the basis for our positions, and either\ncome to a place where we agree, or have completely plumbed the\nargument so that we agree to disagree. This is my goal. I don't\nbelieve we've come to this position on the CDDL yet.\n\nIf we end up agreeing to disagree, then we should punt, and use the GR\nprocess to decide whether the work goes in main or not, and have each\nside write up a explanation of the problems surrounding the license,\nand publicise it with those that agree signing on to it.\n\n> implying that other people aren't sufficiently \"concerned about\n> licensing matters\", aren't \"actually engag[ing] the analysis with\n> counter arguments\", don't have a \"complete understanding of the\n> problem\" in order to stop them \"mak[ing] a determination\" sounds\n> like a pretty good match for the last case.\n\nIt's very much the opposite, actually. I'd like nothing more than to\nhave people who disagree with my understanding attack the rationale\nbehind my understanding so at the end of the day, no matter how wrong\nmy understanding starts, I end up getting things right. I like to\nbelieve that many -legal contributors have this mindset as well.\n\n> Ultimately Debian's policy isn't going to be decided by whoever\n> understands legal issues the best, it's going to be decided by the\n> developers who contribute to Debian, whether they fully understand\n> things or not. Trying to limit the discussion to experts is all very\n> well, but it'll just leave non-experts ignoring the discussions when\n> they end up making the ultimate decision.\n\nSo what should we do? I can't force people to become experts, and I\nvery much want to avoid bludgeoning people with licensing issues who\naren't interested in hearing about them.\n\n> > My goal is to convince ftpmasters and developers that my analysis is\n> > reasonable, and that these works with licenses containing these kinds\n> > of clauses have no place in main. Failing that, I can only educate\n> > users and [...]\n> \n> If the project doesn't adopt your views, then promoting them to\n> users as though they're an official consensus isn't \"educat[ing]\n> users\", it's misleading them. That shouldn't stop you from promoting\n> your opinion *as your opinion*, but honesty demands that you at\n> least make it clear where official policy ends and your opinion\n> begins.\n\nI don't believe I've ever intentionally advocated my understanding or\nopinion as an official consensus, and I don't plan on starting now. In\nfact, when I talk publicly about such things, I'm very careful to\nindicate that my opinion is nothing more than my own. Insinuating that\nI would intentionally mislead users is rather insulting, frankly.\n\nGetting back to my point: users should be aware that CDDL licenses\nwith this clause may be result in giving away rights that they may\notherwise not want to give away, not that Debian's offical opinion is\nthat CDDL licenses are bad. This is the area that education is useful,\njust as explanations to users why GFDL works even without invariant\nsections still have problems that they may want to be aware of, even\nthough Debian's official opionion is that they aren't serious enough\nto exclude them from main.\n\n> while discussion on debian-legal of views [...] is more or less\n> unwelcome -- or at the very least seen as unwelcome by people who\n> hold those views -- I don't see any way of improving things.\n\nWhat would make it more welcoming? A large part of the problem is the\nneed to continuously point out counter arguments, but using wikis or\nstatements is an easy way of codifying the counter argument and\nallowing for refutation on both sides.\n\n> In particular, whoever ends up responsible for Debian's official\n> policy will need to spend their time educating users on what the\n> official policy actually *is*, not their opinion on what the\n> official policy should have been.\n\nWe have very few \"offical policies\" though; there are some things that\nare widely agreed to be free, some things that are widely agreed to be\nnon-free, and some things which are much more contentious. Someone who\nis capable of talking about the official policy is going to\nnecessarily have their own opinions and will express it.\n\n> To take a particular example: if you want to retain the privelege to\n> call the GFDL vote result \"wrong\", you're excluding yourself from\n> being in a position to define Debian's interpretation of \"free\n> software\".\n\nNot at all; it's quite possible to publicly state that a ruling was\nincorrect and still adjudicate under the ruling. Judges who have cases\nremanded to them have to do this all the time. I personally have had\nto explain the difference between my own personal opinion on the GFDL\nwith Debian's official position as described by the GR.\n\n> Personally, I think comparing the reactions to getting overruled by\n> GR of ftpmaster members to various subscribers of -legal is probably\n> instructive.\n\nLike whom? While many may have expressed dissatisfaction with the\noutcome,[2] to my knowledge no one on -legal has expressed as the\n\"offical policy\" on the GFDL contrary to the GR outcome without being\ncorrected.\n\n\nDon Armstrong\n\n1: We'll assume that this is a notice that serves a functional role.\n2: Considering that I've spent a great deal of time trying to get the\nother \"non-invariant\" issues fixed, my own opinion should be obvious.\n-- \n\"A one-question geek test. If you get the joke, you're a geek: Seen on\na California license plate on a VW Beetle: 'FEATURE'...\"\n -- Joshua D. Wachs - Natural Intelligence, Inc.\n\nhttp://www.donarmstrong.com              http://rzlab.ucr.edu\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}