{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"JUDY HYLTON\" <peritoneumbenefited@tecnichenuove.com>", "subject": "fool watch weekly", "body": "\n\n\n\n\n\n\n\n\n\n\nTable of Contents    \nHidden Gems: Introduction \nWhat exactly is a Hidden Gem? \nWhy does Wall Street overlook small companies? \nHidden Gems Ready to Run \n\n\n\n\n\nHidden Gems: Introduction\n\nI've spent years honing my approach to investing in under valued stocks.  \nNow, after beating the market by nearly 72% over the past 4 years in our sister newsletter, Stock Advisor, I'm focusing my attention on an area of investing that I believe offers the greatest rewards to long-term individual investors. \nSmall-capitalization stocks   \nBut not just any small-capitalization stocks. I'm concentrating on underfollowed, unloved, ignored stocks BUT strong, well-managed businesses.    \nThese stocks are temporarily under valued in this marketplace.    \nWall Street hasn't found them yet     \nThe universe of small companies underfollowed on Wall Street presents opportunities to make 5 to 10 times your initial investment without taking unnecessary risks. These companies may be relative unknowns on Main Street. But they're strong and well-managed businesses with stocks that are temporarily under valued only because Wall Street hasn't found them yet.   \nOver the past 50 years, this has proved an outstanding way to beat the market. It's part of the reason why my Hidden Gems newsletter is one of The Motley Fool's most successful services ever.    \nTell me what you think \nToday, I want to brief you about Hidden Gems -- the service and the stocks. If you have any questions, simply sign up for a free 30-day trial and post your thoughts on our Hidden Gems private discussion board.     \nYou'll hear back promptly.\nAnd remember, if for whatever reason you aren't absolutely satisfied with every aspect of the service, you can cancel, no questions asked, and receive a prorated refund. You have my word on it.  \nSo, let's get started . . . \n\nWhat exactly is a Hidden Gem?\nWell, two things really. \nFirst, it's my newsletter service. Motley Fool Hidden Gems is a comprehensive investment service that takes you from start to finish on every recommendation.    \nI research, value, recommend -- then eventually close out -- ALL my recommendations in full view. Along the way, members actively discuss each stock in our private discussion groups at Fool.com. I promise that you will never be left in the dark about any investment I recommend. I'm on each company like a hawk.\nBut what is a hidden gem investment? \nIt is essentially a stellar business (and stock) that is simply too small -- at least for now -- to attract Wall Street's attention. Of the thousands of stocks that fit that bill, hidden gems are those few poised to outperform the market in the coming years. \nAnd thus generously rewarding their stockowners. \nThese are extremely well-run small businesses with \n\npristine balance sheets \nheaps of free cash flow \nhonest management\nThey simply haven't attracted the attention of the big fish on Wall Street. Yet.\nOnce, Wal-Mart [NYSE: WMT] was a hidden gem.\nIn the early days, founder Sam Walton and his executive team got little more than a smirk from the analysts at Wall Street's most prestigious investment banks. They'd never heard of Wal-Mart. Or they believed Kmart [Nasdaq: SHLD] would eat the upstart's lunch. \nMost institutional investors didn't make time for this bunch of unproven entrepreneurs running a chain of small-town discount stores in Arkansas.\nThe rest is history\nOver the next 30 years, Wal-Mart emerged as one of THE great success stories. Trouncing virtually every other stock in the market, Wal-Mart made millionaires of its early investors -- many times over. \nThey laughed when we sat down in the pilot's seat \nOnce, Southwest Airlines [NYSE: LUV] was a hidden gem.\nSouthwest Airlines was laughed out of the offices of institutional investors in its early days. \nSo who's laughing now? The long-term individual investors who ignored the big-money ridicule. Who saw the value of a solid, unknown company with underfollowed, under valued stock.\nHidden gems like Wal-Mart and Southwest exist today, as much as they ever did. I'm here to help you find them. \n\nWhy does Wall Street overlook small companies?\nSimply put, our hidden gems are too small to attract the attention of many money managers.     \nThese large institutional investors have billions to invest. A money manager or pension fund with $5 billion in assets can hardly mess around with a company valued at just $500 million. After all, were the firm to commit 5% of its assets, or $250 million, to a particular favorite, it would end up buying half the business! Whoa there! They couldn't get a good price buying in.     \nThey'd rather be wrong than embarrassed\nFurthermore, most money managers would rather be wrong about a popular stock than have to explain to their investors an unknown, underfollowed business -- even if it's outperforming the market!    \nAsk Manny, Moe, and Jack\nThat was precisely the case with Pep Boys [NYSE: PBY], even as it was making legendary investor Peter Lynch a fortune. All the while, prestigious Wall Street brokers ignored the unknown business, with no desire to recommend its silly name to valued customers. \nLynch loved to find the hidden gems of American business. While Wall Street smirked at his choices, he laughed all the way to the bank.\nNot just any Tom, Dick, or Harry\nMy mandate in Hidden Gems is to separate the great overlooked companies from the ordinary ones. I'll make two recommendations each month. I will evaluate each and every investment for you as its quarterly earnings reports come through. And throughout, I'll track all of my returns clearly versus the S&P 500.  \n\nHidden Gems Ready to Run    \nIn Hidden Gems, you'll get two fresh recommendations each month, with research that's detailed and understandable. With each selection, we then also bring you an interview with the CEO of the company to give you direct access. And you'll also get reviews on three different promising small companies to watch. \nToday, this short report features three appealing prospects to mull over until you start your 30-day free trial, joining the #1 place for small-cap investors. Here are my abridged reports on each company.   \nOncology Med, Inc\n\nOncology Med, Inc [OTC:ONCO] Oncology Med is company engaged in the fulfillment of services related to the treatment of various cancers. It currently provides analysis and design of radiation treatment plans in order for radiation oncologists to administer radiation plans to cancer patients. Current services facilitate radiation treatment programs ranging from external beam radiation to more advanced radiation treatment technologies.  \n\nTHE MARKET -- The radiation oncology market is growing worldwide. Internationally the market is in its infancy. In the U.S. over 5,000,000 Americans have cancer. There are 850,000 new cancer cases diagnosed annually with 60% of all cancer patients being treated by radiation therapy. Radiation centers treat an average of 650 patients annually and smaller radiation centers generate revenues of up to $ 5,000,000 or more.\nRating: Strong \n\nDon't just take my word for it   \nSimply sign up for a free 30-day trial to Hidden Gems to learn more about all three. You'll never be left in the dark on my recommendations. You'll hear my thoughts about each selection as the companies announce earnings. And, you'll always be able to talk with thousands of other members in our 24-hour exclusive online community -- a classroom of sorts -- for Hidden Gems investors.   \nIf you aren't thrilled with the service, just let us know. We won't bill you a penny; you have my word on that. If you're like the thousands of smart and aspiring investors who have joined the service over the past year, I'm confident you'll love Hidden Gems.  \nTake your free trial today. \n\nLegal Information. \nc1995-2007 The Motley Fool. All rights reserved.\n\n\n\n\n"}