{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorksStuff Automotive June 19, 2007", "body": "June 19, 2007 \nRSS | \nautomotiveThis Week's Highlights:\nHow Car Crushers WorkHow Turbochargers Work\nFirst Look: 2008 Porsche CayenneHow EPA Fuel-Economy Testing Works\nNo '08 Honda Accord Hybrid \nThis Month in History- June: Historical events in June include \nthe first recorded lunar eclipse in North America, Amelia Earhart's \ntransatlantic flight, the debut of the \"Garfield\" comic strip and the Watergate \nbreak-in. Check out more.   This week's trivia question:In what James Bond movie was a car crusher used to dispose of a murdered gangster's body? \nClick here   \n \nHow Car Crushers Work - Recycling cars is big business, and one step in that business is the car crusher, a massive machine whose only purpose is to compress a car into a tiny cube or flattened slab. Learn how a car crusher can turn an entire car into a brick of crushed steel.  \n   This week's video:How Turbochargers Work\n - Turbochargers appear on all sorts of high-performance engines because they improve the power-to-weight ratio -- and they use some very cool technology to do it. Find out how turbos increase the speed in this video from HowStuffWorks. \n     Also at HowStuffWorks:\n \nFirst Look: 2008 Porsche Cayenne - More power and revised front-end styling mark the 2008 versions of Porsche's premium midsize SUV. Learn about the Base, S, and Turbo models and see interior and exterior pictures of the 2008 Porsche Cayenne. \n \nHow EPA Fuel-Economy Testing Works - New cars are required to have EPA fuel-economy ratings on their window stickers, but are these ratings a reliable gauge of real-world miles per gallon? Learn how the EPA arrives its fuel-economy ratings. \n \nNo '08 Honda Accord Hybrid - The Honda Accord will be redesigned for 2008, but the Hybrid model will not return. Honda recently announced plans to discontinue the Accord gasoline/electric Hybrid after the 2007 model year. Learn why. \n  \n  Coming Soon: - 2008 Audi R8 Review - How Speedometers Work \n  \n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved"}