{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Littlefield, tyler\" <compgeek13@gmail.com>", "subject": "Re: dectalk or double talk advice", "body": "First, you're not going to get speech support without a program.\nThe screen reader puts hooks in the kernel, or catches the video in the case \nof jaws, and translates.\nNext, I'd recommend USB, because, if you start using newer systems, most \ndon't have a serial port.\nThird, the accessibility of slackware is fine, unless you insist on running \nunder gnome, x, or something else, then you're really not getting the \nbenafit of linux.\nHTH,\n----- Original Message ----- \nFrom: \"Cody Hurst\" \nTo: \nSent: Friday, June 22, 2007 12:11 AM\nSubject: dectalk or double talk advice\n\n\n> Hi,\n>\n>  I am really in a bind here. I don't have a synth and will be needing\n> one for my networking course I'll be taking next year. For this purpose,\n> I'll need an external synth and don't really know anything about each\n> dectalk or double talk. I can easily borrow one, but first I'd like to\n> know which one would be more recommended. First I'll be doing installs\n> of Suse 9.x or maybe 10.x not sure yet, and netware. I am not sure if I\n> need special screen reading software that is always built into a kernel\n> such as speakup for double talk or dectalk to always work. I was just\n> checking mail and saw someone received their double talk in the mail and\n> said they'd try an install of slackware. I have no idea how slackware is\n> with accessibility, but I really need help on a decision before\n> september and what I should look into borrowing.\n>\n>  Does this mean that either one of these will work in reading text\n> allowed even if no special software is installed? I couldn't imagine\n> this one but maybe I'm wrong.\n>\n> Which port is more commonly used, serial or USB? I can't use an internal\n> double talk pc since I'll be moving from station to station most likely\n> and will want something portable. I have widdled it down to these two,\n> but please let me know if there are any better alternatives. Basically I\n> want to be able to take it out of the box, plug it in, and be able to\n> boot my pc, and have speech be spoke with as little issues as possible\n> and from what I hear, double talk is probably the way to go on this one.\n>\n> Thanx,\n> Cody\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}