{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 7/4/07 - On Being an American", "body": "Dear Cabot Wealth Advisory Reader,\n\nOn Sunday I watched the Boston Red Sox lose to the Texas Rangers by one\nrun, as part of the 345th consecutive sellout crowd in Fenway Park.  My\nson put away a hot dog, a bag of peanuts and an ice cream, while I stuck\nto peanuts and beer (at $7 a cup).\n\nBefore the game, a group of Navy Seals parachuted in and a girl from Maine\nsang the national anthem.  In the middle of the game, she came out again\nand sang God Bless America.  I felt like an American.\n\nToday I'm playing my clarinet with a neighborhood band in the local Fourth\nof July parade, which features both patriotic kids on red-white-and-blue\nhomemade floats and intoxicated adults pushing the boundaries of taste in\nfloats that address current events in a humorous fashion.  Odds are that\nlikenesses of both Scooter Libby and Hillary Clinton will appear this\nyear.\n\nI'll feel American all day.\n\nAnd tomorrow I'll be back at work, studying charts of both the market and\nindividual stocks, and then thinking about which stocks have the potential\nto keep on running . . . and which ones to write to you about on\nThursday.\n\nAnd even then I'll feel like an American.\n\nBecause investing is what has helped to build America.  For most\nAmericans, the first investment is a house, and that's great because while\nit appreciates, you can live in it, and avoid paying rent.   \n\nIt's tax-deductible, too.\n\nBut the sooner you get around to investing in stocks the better, for both\nyou and your country.  For your country, because your dollars, properly\nused, support growing businesses.\n\nAnd for you because, well, it's your future, and if you don't prepare for\nit properly, you can hardly expect anyone else to, including your own\ngovernment.\n\nAmateurs like to think that investing is about getting rich quick, but\nwiser minds know that it's about guaranteeing yourself a comfortable\nretirement.   And the sooner you start the better.\n\nNow, maybe you're already well down that path.  If so, I apologize for\nboring you with the basics.  But if you've yet to begin, I urge you to\nstart now.\n\nAnd I urge you to take a no-risk trial subscription to Cabot Stock of the\nMonth to help you make those all-important buy-hold-sell decisions in the\nmonths and years ahead.\n\nCabot Stock of the Month, you see, is unique among Cabot products because\nit practices Spectrum Investing, picking and choosing stocks from all\nother Cabot publications.\n\nWhen blue-chip growth stocks are leading the pack, Cabot Stock of the\nMonth will steer you to them.  When Chinese and Indian stocks are hot, it\nwill be there, too.  And when the market's at risk, it will serve up a\nperfect low-risk undervalued stock.\n\nIn the long run, the publication will help you build a portfolio that will\nhelp ensure your comfortable retirement.  And that's what it's all about.\n\nI've got a special trial rate for first time subscribers.  To get started,\nsimply click the link below.\n\nhttp://cabotmail.net/t/208277/13148861/103/0/\n\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\nP.S.  Remember, the sooner you start the better.  The July Stock of the Month is\nin one of my favorite sectors, education, and it's already up 15% since we\nrecommended it last week!\n\nhttp://cabotmail.net/t/208277/13148861/103/0/\n\n-----\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=208277&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}