{"category": "ham", "to_address": "\"Gerald (Jerry) Carter\" <jerry@samba.org>", "from_address": "simo <idra@samba.org>", "subject": "Re: Short HOWTO on using git for Samba development", "body": "On Mon, 2007-06-25 at 09:39 -0500, Gerald (Jerry) Carter wrote:\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA1\n> \n> Simo,\n> \n> It's a little mind bending to swap from the centralized\n> workflow to a distributed workflow.  I'm not claiming to\n> have figured it all out, but see comments below.\n> \n> > The only problem I see with git/bzr as the main tree is \n> > that it seem to introduce a gatekeeper to the \"official\"\n> > tree forcing all people to send around patches instead of\n> > just committing.\n> \n> The beauty is that there is no master tree. Everyone just\n> has their own tree.  Currently the svn model force feeds\n> changes to developers everytime you run \"svn up\".  The upside\n> is that there is an easy way to run top of tree.  The\n> downside is that people too often use \"svn commit\" as the\n> save button.  This is basically what svk tried to solve.\n\n\n> Using a DSCM forces individual developers to pull others\n> trees (which can be automated via cron jobs).  But by the\n> time the patches end up in the stable tree, they should\n> be well tested and ready to go.\n\nThe only downside of this is forgetting, missing parts.\nYour local tree works, but the patch you send does not as some of the\npremises are missing. But I guess this happen seldom enough it is not a\ngood reason to hold up using a possibly better model.\n\n> The other advantage of using something like git is that\n> branch maintenance is reduced as individuals no longer\n> have to checkin to multiple branches.  The SAMBA_3_0_*\n> branches we have in svn will simply go away.  Of course,\n> the patch release model doesn't go away, but the responsibility\n> shifts.\n\nUhmm how this is true? I mean, in some case the code need to be\ndifferent between 2 trees, who will adjust the patches to apply\ncleanly ?\n\n> > This work flow model is ok if a few people work on a \n> > very isolated part of a tree, or on some experimental\n> > features, but if you need to collaborate it may\n> > make things more annoying.\n> \n> I don't see any change here.  Instead of \"svn commit && svn up\",\n> you have \"git commit && git pull\".  This would also allow for\n> more of a maintainer model than we have now as well.\n\nAhh so more people can commit on the same tree?\nI didn't understand this, if that works then I guess we could end up\nwith the best mix between centralized and distributed development,\nsounds interesting.\n\n> Anyways, I'm not proposing any changes at this time.  I plan\n> to spend the next couple ofmonths using git for daily\n> development.  If things go well, there's a string possibility\n> I will bring it up for discussion around the CIFS workshop\n> in Sept.\n\nOk, but to really test the D in DSCM we need to be more than one and\ntest how the exchange of patches between individual trees works.\nI will try it as well.\n\nSimo.\n\n-- \nSimo Sorce\nSamba Team GPL Compliance Officer\nemail: idra@samba.org\nhttp://samba.org\n\n"}