{"category": "ham", "to_address": "\"ktwarwic@speedy.uwaterloo.ca\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "Brainbench <support@brainbench.com>", "subject": "Brainbench Assessment Results, English Vocabulary for Zombie Warwick", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThank you for taking the Brainbench English Vocabulary assessment.\nCongratulations!   You passed at the Master's Level with a score of 4.61.\nYou have now earned a Brainbench Master Certification in English Vocabulary, \nwhich is valid for 3 years from today's date.\n\n\n\n\nYou are eligible for a certificate! Would you like to receive it? \n       \t\t(Free for subscribers and for purchased tests!)\n     \n\n\n\nYes, I would like to order it!\n\n\n\n\nSubscriptions - The Best Value For Your Money\n\nReady to put your skills development plan into action?\nSign up for a Brainbench subscription today \n(http://www.brainbench.com/links/tosusbcribe.html) and gain unlimited \naccess to more than 400 skills assessments, a variety of practice tests,\ncareer planning resources, and more.\n\nOnline Transcript - Empower Them to Hire You\nYou are now authorized by Brainbench to reference this certification on\n your resume, personal web page, or elsewhere.  You may use the appropriate logo\n however you like.  Logos may be accessed in your account under Download Logos.\n\n\nYou can also prove your English Vocabulary skills to employers, recruiters, \nor anyone else by pointing them to your online Brainbench public transcript.  \nJust send them this link:  http://www.brainbench.com/transcript.jsp?pid=6754820.   \nOr give them your transcript ID number (6754820), which they can enter at \nhttp://www.brainbench.com.\n\nJob Roles - The Pathway to Skills Success\nThe skills certification you earned today also puts you one step \n closer to completing the Brainbench Job Role Certification for: \n\n\n  Technical Writer\n\n  Medical Transcriptionist\n\n  Editor\n\n\nLearn more about all of our Job Role Certifications in our Job Role Center.\n\n\n\nIndividual Test Results - Actionable Data Just For You\n\n\n\n\n\n\n\n\nTest:\n\nEnglish Vocabulary  \n               \n\n\n\nDate: \n\n 28-Apr-2007 \n               \n\n\n\nScore: \n4.61 \n               \n\n\n\nWeights: \n\n\n               \n                    100% English Vocabulary\n\n\n\n\nElapsed time: \n\n\n                    \n                    36 min\n                    3 sec\n                    \n                    \n              \n             \n\n\n\n\n\n\n\n\nEnglish Vocabulary\n\n\nScore:4.61\n\n\nPercentile:Scored higher than 99% of previous examinees\n\n\n\n\n\n\n\n\nDemonstrates understanding of most advanced concepts within the subject area.  Appears capable of mentoring others on the most complex projects.\n\n\nStrong Areas\n\nAnalogies\nChallenging Words\n\n\n\n\nWeak Areas\n\nNone noted\n\n\n\n\n\n\n\n\n\nYour results are now posted to your online account.  You can log \non to your account anytime via the Brainbench home page.\nOnce you have logged on to your account, you can modify any of \nyour demographic and career information, such as your resume and \ncareer objectives, and determine what information (contact and career \ninformation, tests, and certifications) you want to be part of your public transcript.   \n\n\nTo contact Brainbench regarding this test, please e-mail \nus at support@brainbench.com.\n\nThank you again for taking a Brainbench skills assessment.\n\n  Congratulations on your Master Brainbench Certification!\n\n\n\n\n\n\n\n\n"}