{"category": "ham", "to_address": "Ip-health@lists.essential.org", "from_address": "Sarah Rimmington <srimmington@essentialinformation.org>", "subject": "[Ip-health] Thailand's plans to issue CLs on cancer medicines moves forward", "body": "Bangkok Post\nJune 24, 2007\n\nPatent busting moves ahead\n\nBy Apiradee Treerutkuarkul\n\nThe plan to enforce compulsory licensing on cancer drugs has taken\nanother step closer to becoming reality.\n\nThe National Health Security Office (NHSO) has begun reviewing the\ndistribution system of the top 100-listed essential medicines, including\nhigh-priced cancer drugs needed for treating patients under the\nuniversal healthcare scheme.\n\nThe NHSO sub-panel overseeing the possibility of using compulsory\nlicensing on essential drugs will meet next week to discuss the\nefficiency of drug distribution methods for patients under the universal\nhealthcare scheme.\n\nThe panel has been studying the pros and cons of the system for over\nthree years, said panel member Samlee Jaidee, also an academic at\nChulalongkorn University's faculty of pharmaceutical sciences.\n\nThe meeting will take place as soon as Public Health Minister Mongkol na\nSongkhla returns from England. He is meeting executives of\npharmaceutical firm Dabur Pharma Limited, which makes generic versions\nof cancer-treating drugs, to seek out further options for treating\nchronic patients in Thailand.\n\nDr Mongkol earlier said compulsory licensing of cancer drugs was\nessential since the disease was the fifth most likely cause of death for\nThais, after accidents, HIV/Aids, heart diseases and old age.\n\nThe government spent more than 1.2 billion baht last year on about\n50,000 cancer patients receiving treatment through the universal\nhealthcare scheme run by the NHSO, he said.\n\nA source at the NHSO said the meeting would also review the feasibility\nof distributing more expensive cancer drugs for patients under the\nuniversal healthcare scheme.\n\nAmong the drugs on the list are leukaemia drug Imatinib sold by Novartis\nunder the trade name Glivec.\n\nGlivec is not yet available under the universal healthcare scheme due to\nthe high cost of the drug.\n\nIn Thailand, the drug costs about 900 baht per tablet and patients\nsuffering from leukaemia need to spend about 3,600 baht a day on treatment.\n\nHowever, the generic version of the drug would cost only 80 baht a day,\na source said.\n\nThailand approved compulsory licensing to bypass patents on anti-Aids\nand heart drugs Efavirenz, Kaletra and Plavix last November and January,\nand the Government Pharmaceutical Organisation has begun importing the\ngeneric version of Efavirenz from a drug maker in India.\n\nBut the health agency is still negotiating with MSD, Abbott and\nSanofi-Aventis, patent holders of Efavirenz, Kaletra and Plavix\nrespectively, to seek flexible solutions for both sides in terms of\nexpanding access to medicine for the public.\n\n--\nSarah Rimmington\nProject Attorney\nEssential Action, Access to Medicines Project\nWashington, DC\nOffice: (202) 387-8030 x34\nMobile: (202) 422-2687\nwww.essentialaction.org/access\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}