{"category": "ham", "to_address": "debian-devel@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Wouter Verhelst <wouter@debian.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "On Sun, Jun 03, 2007 at 05:09:57PM -0700, Don Armstrong wrote:\n> On Mon, 04 Jun 2007, Wouter Verhelst wrote:\n> > If you get sued and convicted as a private person in a jurisdiction that\n> > is not yours, there are two possible outcomes:\n> > * You try to defend yourself, and might win or lose depending on the\n> >   case. If you go to the jurisdiction where you are being sued, the end\n> >   result might be that enforcement is likely.\n> > * You do nothing, and nothing happens\n> \n> I'm not sure what any of this has to do with choice of venue;\n\nBy itself, nothing. But in a lawsuit in the context of a license with a\nchoice-of-venue clause, either you live in the jurisdiction that is\nclaimed in the license (in which case not much changes wrt what would be\nthe case if there were no choice-of-venue clause in the first place), or\nyou do not (in which case the above is appropriate).\n\n> the only thing choice of venue alters is your ability to stop the case\n> in the initial phases by advertising that venue is improper in that\n> jursidiction, not your ability to decide that ignoring German law is\n> the appropriate tactic.\n\nWhat I was trying to show is that the relevance of a copyright case\nbrought against you in a jurisdiction outside of your immediate concern\nis zero, for all practical matters; that means you can simply ignore it,\nand nothing Bad will happen. Therefore, I don't think it makes it\nanything even remotely representing non-freeness.\n\nIf you are a company or other organization which is large enough that\nchoice-of-venue clauses do matter, then you probably do have contacts\nwith a lawyer in the appropriate jurisdiction whom you can ask to\nrepresent you, anyway.\n\n[...]\n> [Who has no idea if these sorts of clauses even work in Germany or\n> Belgium]\n\nSeen how the Belgian Government wrote the first license in\n/usr/share/doc/libbeid2/copyright (in particular section 6.3 of that\nlicense), I guess they do.\n\n-- \nShaw's Principle:\n\tBuild a system that even a fool can use, and only a fool will\n\twant to use it.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}