{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "60 Minutes Newsletter <newsletter_sixty_minutes-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "60 Minutes E-mail Alert", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nWho is Mitt Romney \n      and what does he stand for? The Republican presidential candidate sits \n      down with Mike Wallace in our \n      lead piece to explain his political positions – some of which have changed \n      over the years – and to talk about his Mormon religion, which he thinks \n      few voters really understand. You’ll meet a man who, despite being a \n      dark horse, is convinced he can make a good president based on his success \n      in business, re-tooling ailing companies into profitable ones, his \n      budget-balancing record as governor of Massachusetts, and \n      his timely rescue of the 2002 Olympics from financial ruin. You’ll also \n      meet the entire Romney family at their lake house in New Hampshire, one \n      of the few states where he leads in the polls. If he can win that \n      state and two more early primary states like Iowa and South \n      Carolina, Romney says he’s halfway to Washington. \"Look, \n      if I do well in those first three and get the momentum from those wins, \n      why that carries me to the nomination of my party.\"\n \nWatch an excerpt of Wallace's \n      interview.\n \nYou’ve been hearing for months \n      about how weak the housing market is, with so much inventory and not \n      enough demand. It’s enough already to drive a real estate sales person \n      crazy, but it may be getting even worse for the traditional realtor. Lesley Stahl discovers in our \n      second report that the six percent sales commission that has been the \n      mainstay for realtors for decades could be in trouble, too.  Now \n      under pressure from Internet discounters, realtors may have to accept \n      lower commissions more regularly, as cyber dealers move onto their sacred \n      turf and charge less.\n \nOur third segment is about an \n      incredible young man whose luck and determination have allowed him to rise \n      above what for most would be a horrible fate. Ali Abbas lost most of \n      his family and both his arms to a stray American bomb in Iraq four years ago. But \n      thanks to many well wishers who learned about him through the news, he is \n      adjusting, even thriving in England. Bob Simon meets a boy whose \n      writing and drawing talents would be remarkable in a person who could use \n      his hands. The talented Ali does both with his feet.  \n      \n \nThese stories and Andy Rooney \n      reeling in the years, this Sunday, May 13, on 60 Minutes at 7 p.m. \n      ET/PT.\n\n \n       \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}