{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CNN Student News <CNNStudentNews@cnn.com>", "subject": "April 12, 2007", "body": "CNN.com Student News Newsletter\n\n\n\n\n\n\n \nThursday, April 12, 2007\n\n\n\n Watch and Learn \nTeachers, please preview today's program; it contains stories that may be inappropriate for some students.\nToday's edition of CNN Student News includes reports on the controversy surrounding Don Imus, a group of college students who say some words are never appropriate to use, and a man who swam from one end of the Amazon River to the other.\nEarth Day is just around the corner, and we want to know what your school is doing to mark the day. Send us an I-Report about your conservation efforts at CNN.com/EDUCATION.\n\n Nation's largest student-loan provider settles \nThe nation's largest student loan provider will stop offering perks to college employees as part of a settlement announced Wednesday in a widening probe of the student loan industry. SLM Corp., commonly known as Sallie Mae, also agreed to pay $2 million into a fund to educate students and parents about the financial aid industry, and it will adopt a code of conduct created by New York Attorney General Andrew Cuomo, who is heading the probe. \n\n\n \nCNN Student News is a 10-minute, commercial-free news program that airs on CNN Headline News at 3:12 a.m. EST as well as on CNN.com/EDUCATION. Created by a team of journalists and educators, the program provides the top stories of the day, segments that encourage student participation, and in-depth special reports. In addition, CNN Student News provides free curriculum at CNN.com/EDUCATION to accompany each program's content. CNN Student News, along with CNN Classroom Edition, is Turner Broadcasting's contribution to Cable in the Classroom.\n Forward this to a friend\nYou have received this email because you have signed up to receive the CNNStudent News newsletter. Click here to unsubscribe\nEdit your profile here \n"}