{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: The Manifesto", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nShould \n      The Media Have Shown Cho's \"Multimedia Manifesto?\"Even if \n      one feels that NBC did the right thing by airing the materials, it is \n      troubling that the decision to do so means giving Cho what he \n      wanted. Here's what FBI \n      profiler Clint Van Zandt told MSNBC's Tucker Carlson: \"He wants to be able \n      to reach his hand out of the grave and grab us by the throat and make us \n      listen to him one more time.\" He got his wish.[+ Read More]\n\nHow \n      CBS, And Its Competitors, Are Handling The Cho MaterialsIn \n      an email this morning, CBS News Vice President Paul Friedman \n      instructed staff not to use the Cho video without the approval of an \n      executive producer. He also wrote that stills from the video should be \n      used sparingly. \"In no case do we want this video to be used as wallpaper, \n      in much the same way we did not want to use the video of the planes going \n      into the World Trade Center or the buildings coming down,\" wrote Friedman. \n      [+ Read More]\n\nThe \n      Public Eye Chat With Andrew \n      Cohen\"It's a shame that there isn't a federal court TV, where you have \n      federal trials that are televised 24 hours a day. It's a shame that people \n      don't get to hear how smart the lawyers are who practice before the US \n      Supreme Court, and how smart – brilliant – the Justices are. That to me is \n      a tragedy. I don't know that it's going to be changed. But to me it's a \n      tragedy that those things don't come out, and yet people will think when \n      they go to court they're going to get a Judge Seidlin, or when they go to \n      court they're going to get a Judge Ito. And that's the perception, sadly, \n      that many people have.\"[+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nThe \n      Public Eye Chat With…Jennifer Siebens\n\nThe \n      Public Eye Chat With…Allen Pizzey\n \nThe Public Eye \n      Chat With...Elizabeth Palmer\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}