{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "An exclusive with Dr. Jack Kevorkian, you won't want to miss...That's tonight on the CBS Evening News with Katie Couric", "body": "\n\n\n\n\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nQUOTE\n  OF THE DAY\n\n\"Dying is a very\n  dull, dreary affair. And my advice to you is to have nothing whatever to do\n  with it.\" \n  - W. Somerset\n  Maugham \n\n\n\n\n\n\n\n\nDID YOU KNOW?\n\n  Of all the words in the English language, the word \"set\" has the\n  most definitions. \n\n\n\n\n\n\n\n\n \n\n\nSATURDAY ON 48 HOURS\n\n\n \n\n\n48 Hours Mystery is\n  preempted on Saturday night. We'll be back next Tuesday with a show called, Love and Lies. Murder exposes the secret\n  lives of a suburban couple. Peter Van Sant\n  reports, Tuesday, June 5, 10 p.m. ET/PT. \n\n  If you would like more information on any of these stories or the broadcast,\n  please click on the following address and e-mail us at: 48hours@cbsnews.com \n\n\n\n\n\n\n\n\nTONIGHT ON THE CBS EVENING NEWS\n\nHere is an early preview\n  of what we are planning for tonight’s CBS EVENING NEWS from Anchor and\n  Managing Editor, Katie Couric… \n\n  Hi everyone, \n\nI’ll be anchoring our\n  broadcast tonight from Washington, D.C., where I’ve\n  been working on a story about the U.S. capital’s long battle\n  for a single vote in Congress. We’ll show you my report tonight along\n  with the day’s news. \n\n  First, Dr. Jack Kevorkian called his release from jail today “one of\n  the high points in life.” Kevorkian, who has participated in at least\n  130 assisted suicides, spent eight years in jail – and says he still\n  believes people should have the right to die. Cynthia Bowers will have the story which includes an\n  exclusive 60 Minutes\n  interview with Kevorkian. Byron Pitts\n  will also report on how Kevorkian drew the country’s attention toward\n  how we live the end of our lives. \n\n  More of the story of Andrew Speaker, the Atlanta attorney infected with potentially\n  deadly tuberculosis, unfolded today. He apologized to those he may have\n  exposed. Tonight we’ll hear their reaction as some of them get results\n  of their TB tests. Kelly Cobiella\n  will have the very latest. \n\n  And new violence erupted in a Palestinian refugee camp in Lebanon,\n  where militants allegedly linked to al Qaeda are holed up. The Lebanese army\n  has the camp surrounded – and the United States is helping the\n  effort by sending in ammunition for this deadly standoff, Mark Phillips will report. \n\n  Finally, Steve Hartman will have\n  a special Assignment America\n  tonight. He’ll give you a behind-the-scenes look at the sacred ground\n  just outside of the nation’s capitol where the country’s fallen\n  soldiers rest. And now, a commemorative book of some of the most telling\n  images ever published of Arlington\nCemetery is being\n  published. Steve will tell what\n  that means to families of soldiers. \n\n  Have a great weekend! \n\nKatie \n\nFor more information on these stories,\n  please click on the following links: \n\nJack Kevorkian Is Out Of Jail \nClick\n  Here \n\nTB Patient: \"I'm Very Sorry\"\n\nClick\n  Here \n\nAnd here's an early look at one of the\n  stories we are working on for Monday’s broadcast: \n\n  One program is helping minority students graduate from top colleges at twice\n  the national rate. What's the secret to their success? We'll show you. All\n  that and much more, Monday, on the CBS Evening News. \n\nTHIS WEEKEND ON THE CBS EVENING NEWS: \n\nSATURDAY ON THE CBS EVENING NEWS…\n  \n\nKelly Wallace will anchor the Saturday\n  Edition of the CBS Evening News in New\n    York. \n\n  We'll have the latest news, including these stories: \n\n  INFANT MORTALITY PT1: Mississippi\n  faces an infant mortality crisis. Kelly\n  Wallace has the first of a two-part report on how public health\n  officials are trying to reverse a heartbreaking trend sweeping across Mississippi's\n  countryside. \n\nPEER COUNSELING: A shortage of\n  high school guidance counselors could be hurting high school students\n  ill-equipped to navigate the college admissions and financial aid process. Bill Whitaker reports on a California high school\n  where students are stepping into the breech. \n\nSUNDAY ON THE CBS EVENING NEWS…\n  \n\nAnthony Mason will anchor the Sunday\n  Edition of the CBS Evening News in New\n    York. \n\n  We'll have the latest news, including these stories: \n\n  DEM DEBATE: Senior Political Correspondent Jeff Greenfield looks ahead to the\n  Democratic Presidential debate in New\n    Hampshire. \n\nELECTRIC CARS: With gas prices\n  at record levels, a growing number of communities are changing laws to allow\n  more electric vehicles on the roads. Joie\n  Chen takes a look and the towns and their cars. \n\nINFANT MORTALITY PT2: In our\n  second of a two reports on the infant mortality crisis in Mississippi, Anthony Mason examines the faith-based organizations helping\n  to save lives. \n\n  If you would like more information on any of these stories or the broadcast,\n  please click on the following address and e-mail us: \nevening@cbsnews.com \n\n\n\n\n\n\n\nTONIGHT ON DAVID LETTERMAN\n\nDave\n  chats with actor Tobey Maguire AND impressionist John Byner... Plus, musical\n  guests Modest Mouse! \n\n\n\n\n\n\n\n\nTOMORROW ON THE SATURDAY EARLY SHOW\n\nMaggie Rodriguez\n  and Jeff Glor anchor THE SATURDAY EARLY SHOW\n  from New York.\n  Ira Joe Fisher will bring us the\n  weather from Newport, RI. \n\nAlong with the top news of the day, we will\n  also have the following stories: \n\n  GREAT CHOWDER COOK-OFF: Ira Joe Fisher will spend the morning at\n  the 26th Annual International Schweppes Great Chowder Cook-Off in Newport, Rhode\n    Island. \n\nSATURDAY QUESTION WITH BEN TRACY:\n  In our weekly feature, Ben Tracy\n  of our Minneapolis\n  affiliate, WCCO, will hit the streets with his Saturday Question… Why do we tell little lies? \n\nDRUG-RESISTANT BACTERIA: A man\n  with drug-resistant tuberculosis made headlines this week by endangering\n  others while flying to Europe and back. But\n  new research finds that infections from drug-resistant bacteria are a much\n  more widespread threat: millions of Americans may already have them in their\n  bloodstreams. Our Dr. Mallika Marshall\n  will explain the new findings and offers tips for protecting yourself. \n\nPARENTING - KIDS' HABITS:\n  Whether it's thumb sucking or nail biting, a child's bad habits can be a\n  major source of frustration for parents. Victoria Perricon of SavvyMommy.com\n  will have some advice on stopping the most common and annoying behaviors. \n\nHAPPY TOGETHER - SHOULD YOU TELL THEM?:\n  We wade into the dangerous territory that puts many friendships on shaky\n  ground… You know your friend's spouse is having an affair, but should\n  you get involved by spilling the beans? We’ll have advice on this\n  tricky situation. \n\nPOOL SAFETY: Splashing around in\n  the backyard pool is always a blast on a hot summer day, but you also need to\n  keep safety in mind. Early\n  Show Consumer Correspondent Susan\n  Koeppen will be on our plaza to show us how to make a day at the\n  pool both fun and safe this summer. \n\nCELEBRITY DISH: It’s been\n  a memorable week for all the wrong reasons for Lindsay Lohan. The 20-year-old\n  actress was scheduled to start filming a movie, but instead she’s\n  checked herself into rehab. Jill Dobson of Star\n  Magazine gives us the latest on LiLo and all the other stars\n  making headlines -- for better or for worse. \n\nCHEF ON A SHOESTRING:\n  Chris Kimball of Cook's Illustrated\n  will show us some tricks to preparing America's favorite summer\n  fare… burgers and potato salad! He'll put together a classic\n  three-course meal for four on our shoestring budget of $40. \n\nSECOND CUP CAFE: Mandisa, a\n  popular American Idol\n  contestant during season five, has returned to the spotlight with the release\n  of her first album True Beauty,\n  due out in July. She will join us with more on her new album… And, she\n  will perform her debut single “Only the World” in our Second Cup Café. \n\n  To look for our fabulous recipes... Click\n  Here \n\n  If you would like more information on any of these stories or the broadcast,\n  please click on the following address and e-mail us: sat@cbsnews.com \n\n\n\n\n\n \n\n\nHERE'S WHAT WE\n  HAVE PLANNED FOR SUNDAY MORNING\n\nHARRY SMITH\n  ANCHORS FROM NEW YORK.\n  CHARLES OSGOOD IS OFF. \n\nA LONG WAY GONE:\n  Harry Smith sits down with Ishmael Beah\n  – a young man from Sierra\n    Leone forced to become a child soldier.\n  Rescued by UN peacekeepers, Beah has a new life in America and a new book about his\n  struggles called A Long Way Home.\n  \n\n  Official Ishmael Beah Website Click\n  Here \n\n  Amnesty International Click Here \n\n  War Child USA Click Here \n  P.O. Box 212 \n  Peterborough, NH 03458 \n  603-924-4312 \n\n  Vera Viditz-Ward Click\n  Here \n  Professor of Fine Arts Photography \n  Bloomsburg University \n\n  Inko Productions Click\n  Here \n  “The Language You Cry In” \n\n  UNICEF Click Here \n\n  Joseph Opala Click\n  Here \n\n  Friends of Sierra Leone Click Here \n\n  Traditional Mende Music Click\n  Here \n\nSUNDAY ALMANAC: We look at the\n  70th anniversary of the marriage of Duke of Windsor and American Wallis\n  Simpson. Harry Smith reports. \n\nTELEVISION: David Edelstein says\n  goodbye to our favorite mafia family, HBO’s The Sopranos. \n\nHISTORY OF THE ASSOCIATED PRESS:\n  For more than 160 years, photographers and reporters for the Associated Press\n  have been breaking news and recording history. How the AP became what it is,\n  a vital force in the history of our times, recently hit home with the\n  unexpected discovery of a long forgotten archive. This Sunday Morning, Charles\n  Osgood takes us deep into the Manhattan\n  bedrock, well below the AP building in New\n    York, to see some of that history, firsthand. \n  http://www.breakingnewsbook.com Click\n  Here \n\nON BROADWAY: Actor Liev\n  Schreiber sits down with Correspondent Tracy\n  Smith on his new broadway hit Talk\n  Radio. \n  http://www.talkradioonbroadway.com/ Click Here \n\nCUTTING EDGE: Technology\n  Correspondent Daniel Sieberg\n  takes us to the annual Maker Faire, a world’s fair where the inventors\n  are individuals instead of corporations. We’ll get a peek at their\n  homemade creations. \n\nTHE SUMMER OF LOVE: The call\n  went out in 1967: “If you’re going to San Francisco, be sure to wear some flowers\n  in your hair.” Tens of thousands made the trip, in what was known as\n  the Summer of Love. The Haight-Ashbury\n  district filled with young people. Timothy Leary urged them to ‘turn\n  on, tune in, and drop out.’ The Monterey Pop Festival brought together\n  many of the musicians who would shape rock. It was the time of sex, drugs,\n  and rock and roll. Correspondent John\n  Blackstone looks back at those heady times with several who were\n  there, including Bob Weir of The Grateful Dead, and activists like Peter Berg\n  and Judy Goldhaft. And he looks at how the Summer of Love helped shape the\n  counter-culture, and how it’s remembered today, 40 years later. \n\n  Official Grateful Dead Website Click Here \n\n  The Digger Archives Click Here \n\n  Planet Drum Foundation Click Here \n\n  Todd Gitlin Click Here \n\n  The Whitney Museum of American Art Click\n  Here \n\nCOMMENTARY: Nancy Giles gives her view on\n  exclusive membership clubs… \n\nTHE STANLEY\n  CUP: Bill Geist on the Stanley\n  Cup. \n\nNATURE: Matinicus Rock off the\n  coast of Maine.\n  \n\n  If you would like more information on any of these stories or the broadcast,\n  please click on the following address and e-mail us: sundays@cbsnews.com \n\n\n\n\n\n\nSUNDAY ON FACE THE NATION Bob Schieffer moderates...\n\n  CBS News Face The\n  Nation with Bob Schieffer\n  is going to look at immigration this week. The bill is being debated in the\n  Senate this week before a version goes to the House. Opponents call it\n  amnesty. Proponents disagree. We'll talk to one of the forgers of the Senate\n  Bill, Ken Salazar, Democrat of Colorado. And for the other side, we'll go to\n  Peter King, Republican of New York. Then we'll have a roundtable on the rest\n  of the week's news, including Fred Thompson's possible entrance into the\n  Presidential race, with John Harris of Politico.com, David Sanger of the New York Times, and Lara Logan of CBS\n  News. There will be, as always, a final word. That's all on Face The Nation\n  this Sunday. \n\n\n\n\n\n\nSUNDAY ON 60 MINUTES\n\nJACK KEVORKIAN:\n  Mike Wallace talks to Dr. Jack Kevorkian in his\n  first post-prison interview. The assisted suicide activist went to prison as\n  a result of his first interview with Wallace,\n  in which he showed himself on videotape injecting lethal chemicals into a\n  patient suffering from Lou Gehrig's disease. \n\nVANESSA REDGRAVE: Up for a Tony\n  Award for her solo role in a play based on the Joan Didion best-selling book The Year of Magical Thinking, Vanessa\n  Redgrave talks to Mike Wallace\n  for the first time since 1979, when she appeared on 60 Minutes at the\n  peak of her political activism. \n\nPRESIDENT AHMADINEJAD: 60 Minutes re-broadcasts\n  parts of Mike Wallace's\n  exclusive and rare interview with the president of Iran. \n\n\n\n\n\n\n\n\nMONDAY MORNING ON THE EARLY SHOW\n\nHannah Storm,\n  Jeff Glor, and Kelly Wallace anchor THE EARLY SHOW from\n  New York. Julie Chen anchors from Los Angeles. Dave Price will bring us the weather. Harry Smith and Russ Mitchell are off. \n\nAlong with the top news of the day, we will\n  also have the following stories: \n\n  NORA THE PIANO PLAYING CAT: An internet sensation has everyone\n  buzzing. A cat perched atop a piano bench tickling the ivories? It’s\n  for real and little Nora has become a star overnight! Our resident\n  veterinarian Debbye Turner will\n  join us with more. \n\nPERFECT PARENTING - KEEPING YOUR NANNY:\n  It’s difficult for parents to resist micromanaging and possibly nagging\n  their diligent nanny or babysitter… understandable even. However,\n  we’ll have some tips to prevent your overprotective nature from causing\n  your nanny to quit. Sally Lee of Parenting\n  magazine will join us with her expert advice. \n\nBOX OFFICE PLUS – GRACIE:\n  Siblings Elisabeth and Andrew Shue are both well-known actors in their own\n  right… Elisabeth started her film career as Ralph Macchio’s\n  girlfriend in The Karate Kid.\n  She transitioned to critically-acclaimed actress after portraying a\n  prostitute in the edgy film Leaving Las Vegas,\n  opposite Nicholas Cage. Her brother Andrew found his success in the\n  90’s tv hit Melrose Place\n  as good guy “Billy Campbell”. They will star together this summer\n  in the touching new drama Gracie\n  out Friday. The film follows the true story of a teenaged girl who wants to\n  compete on her school’s all-male soccer team in the late 70’s.\n  They will join us with more on their latest movie and what it was like\n  working together Monday morning. \n\nGADGET LAB – BEACH TECH:\n  For all you beach bums, it’s time to soak up the sun. But if you still\n  can’t be away from your electronics, we will show you products that\n  will protect all of your gadgets… from your cell phone to your camera\n  to your iPod. CBS News Technology Correspondent Daniel Sieberg will join us with his top picks. \n\nTHE BEATLES’ BIGGEST FAN:\n  Turning your passion into your life’s work is something we all strive\n  for. That was the case for Baltimore\n  native Russ Lease, who went from co-owning a clothing store to selling exact\n  replicas of the Beatles’ costumes… fulltime! It appears that\n  there was a high demand for Beatles gear. We’ll meet this major Beatles\n  fan and hear all about his booming business. Plus, Lease’s very first\n  customers 1964 The Tribute, a Beatles cover band, will join us Monday morning\n  with their version of \"Twist and Shout\" live in our studio. \n\nTEA CONTEST: To encourage more\n  interest in tea, the Tea Council of the USA held a contest for the most\n  creative video about tea, why they liked it, and its health benefits.\n  Spokesperson Justin Guarini of American\n  Idol fame will introduce us to the winner who will receive a\n  $20,000 scholarship on our plaza. \n\n  If you would like more information on any of these stories or the broadcast,\n  please click on the following address and e-mail us: \nearlyshow@cbs.com \n\n\n\n\n\n\nTO SUBSCRIBE\nClick here to\n  subscribe to the Inside Scoop.\n\nTO UNSUBSCRIBE\n  Unsubscribe information is included in each e-mail you receive. \n\nTRANSCRIPTS AND VHS TAPES\n  For transcripts of our CBS News broadcasts, please call 1-800-777-TEXT. To\n  order VHS copies, please call 1-800-934-NEWS\n\nCOMMENTS \n  Please know that we do read all the e-mails that are sent to this newsletter\n  and when appropriate, these e-mails are forwarded to the each of the\n  respective broadcasts. Email us at InsideScoop@cbsnews.com. While we do try\n  to answer each e-mail, please be advised that sometimes we are just not able\n  to. Thank you. Your friends at the Scoop. \n\n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\n  CBSNews.com, 524 W. 57th St.,\n  Room 514/1, New York, NY, 10019\nHelp | Advertise\n  | Terms of Service | Privacy Statement\n  ©MMVII, CBS Interactive Inc. All Rights Reserved. \n\n\n\n\n \n\n\n\n\n\n"}