{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for April 18, 2007  \n\n\n\nFirst Enercast Featured Articles for April 18, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nApr 18, 2007 PowerMarketers Industry Publications\n\n\n\nTHIS WEEK AT EIA (Volume 9, Issue 16) (April 13 - April 17, 2007)  \n\n\n\nEIA - Apr. 18, 2007 - THIS WEEK AT EIA is a list summarizing and providing URLs for every Energy Information Administration (EIA) product released during this week.\n\n\nApr 18, 2007 PowerMarketers Industry Publications\n\n\n\nCoal Assaults Continue (EnergyBiz Insider - Apr. 18, 2007)\n\n\n\nEnergyBiz Insider - Apr. 18, 2007 - A federal judge has ruled that the U.S. Army Corps of Engineers needs to do more study before it issues permits to allow coal companies to perform any surface mining that would bury vital headwater streams.\n\n\nApr 18, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Apr. 18, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 18, 2007\n\n\nApr 18, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nReport raises red flags: Legislators, officials divided on likelihood of nightmarish threats of liquefied natural gas platform cited by GAO\n\n\n\nApr. 18--A Suffolk legislator yesterday described as \"something out of a science-fiction movie\" several possible scenarios from a terrorist attack on a liquefied-natural-gas platform proposed for Long Island Sound.  Staff of the congressional Government Accountability Office presented findings from a report on potential threats to LNG facilities at a special hearing of the Suffolk County ...\n\n\nApr 18, 2007 Knight Ridder Tribune Business News\n\n\n\nPSC hearings open with no easy fixes: Panel reviewing BGE rate rise scheduled for June\n\n\n\nApr. 18--The new Public Service Commission members began yesterday their first examination of the sharp rise in BGE electric rates they were appointed to challenge. But after eight hours of testimony, they uncovered no easy fixes for the 50 percent increase the utility's customers face this spring.  Gov. Martin O'Malley made the previous PSC's refusal to hold similar hearings last year a defining ...\n\n\nApr 18, 2007 Knight Ridder Tribune Business News\n\n\n\nPower remains out for thousands\n\n\n\nApr. 18--Appalachian Power Company crews cut electricity outages by more than half between Monday and Tuesday, but nearly 24,000 customers remained without power Tuesday afternoon.  And some customers were being told it could be as late as Thursday before they have power restored. A two-day windstorm, with winds gusting to nearly 50 mph, hit the region late Sunday knocking out power to about ...\n\n\nApr 18, 2007 Knight Ridder Tribune Business News\n\n\n\n250,000 without power after wind,rain: Storm downs trees and lines; damage's scope being assessed\n\n\n\nApr. 17----7-day forecast  Winds gusting as high as 63 mph blew out the lights for almost 250,000 electricity customers across Virginia yesterday. Flooding and wind-thrown trees and power lines also closed about 135 roads, most in mountainous localities, according to the Virginia Department of Transportation. \"More than 190,000 customers have been affected by this storm since it began,\" said ...\n\n\nApr 17, 2007 Knight Ridder Tribune Business News\n\n\n\nWind, water cut power to 250,000, close roads: Storm downs trees and lines; damage's scope being assessed\n\n\n\nApr. 17--Winds gusting as high as 63 mph blew out the lights for almost 250,000 electricity customers across Virginia yesterday.  Flooding and wind-thrown trees and power lines also closed about 135 roads, most in mountainous localities, according to the Virginia Department of Transportation. \"More than 190,000 customers have been affected by this storm since it began,\" said Dominion Virginia ...\n\n\nApr 17, 2007 Knight Ridder Tribune Business News\n\n\n\nPraxair to double output of gases at Niagara Falls plant: Multimillion-dollar expansion planned for air separation facility\n\n\n\nApr. 17--Praxair Inc. will about double production of industrial gases in Niagara Falls with a multimillion-dollar expansion of its air separation plant, state and company officials announced Monday.  \"It's a substantial investment, over $10 million,\" spokeswoman Maureen Fama said. The Niagara Falls plant on Royal Avenue pulls gases from the atmosphere including nitrogen, oxygen and argon.\n\n\nApr 17, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nDeveloper: Proposed coal-fired plant in Cochise County would be clean\n\n\n\nCochise County supervisors have begun considering a plan to allow a coal-fired power plant to be built outside Bowie. Supervisors heard a presentation from developers seeking a zoning change allowing the plant to be built on Monday. The 600-megawatt Bowie Power Plant is proposed for a site two miles outside Bowie, and would use a new technology called coal gasification which cuts emissions of ...\n\n\nApr 17, 2007 Tucson Citizen\n\n\n\nApproval of LNG deal confirmed by recount\n\n\n\nJohn Foster, attorney for Perry Citizens for Responsible Growth, Perry Town Clerk Janice Scanlon, petitioner Jane Cook and Perry town attorney Erik Sumpfel recount ballots on Frday. (PHOTO By Tom McLaughlin, WQDY News Director) Tuesday, April 17, 2007 - Bangor Daily News PERRY  A recount of last months vote on a deal with an Oklahoma-based liquefied natural gas developer has not changed the ...\n\n\nApr 17, 2007 Bangor Daily News\n\n\n\nPatrick unveils $150 million solar manufacturing plant plan\n\n\n\nEvergreen Solar Inc. will build a new $150 million manufacturing plant in Westborough that would create more than 350 new jobs and boost Massachusetts push to become a major alternative-energy center, Gov. Deval Patrick announced today. Ive said all along, if Massachusetts can get clean energy technology right, the world will be our customer, Patrick said in a statement.\n\n\nApr 17, 2007 Boston Herald\n\n\n\n\n\nWisconsin Power and Light Company Reopens 2006 Retail Electric And Natural Gas Rate Case Filing\n\n\n\nReopening reflects credits that will discontinue at the end of 2007     MADISON, Wis., April 17 /PRNewswire-FirstCall/ -- Alliant Energy -- Wisconsin Power and Light Co. (WP&L), an Alliant Energy company (NYSE: LNT) today filed to reopen its 2006 retail electric and natural gas rate case filing with the Public Service Commission of Wisconsin (PSCW). WP&L is requesting to reopen the case to allow ...\n\n\nApr 17, 2007 PR Newswire\n\n\n\nDate Set for Uranerz Energy's Annual General Meeting\n\n\n\nUranerz Energy Corporation (AMEX: URZ)(FRANKFURT: U9E) will hold its Annual General Meeting (\"AGM\") on June 19, 2007, at 10:30 am (MST) at the Holiday Inn Denver International Airport, 15500 East 40th Avenue, Denver, Colorado, 80239. The date of record for shareholders entitled to attend the AGM and vote on the matters that come before the meeting is April 23, 2007.\n\n\nApr 17, 2007 Internet Wire\n\n\n\nSpectra Energy Announces New Member of Board of Directors\n\n\n\nHOUSTON, April 17 /PRNewswire-FirstCall/ -- Spectra Energy Corp has appointed Pamela L. Carter, an executive with Cummins Inc., to the company's board of directors. (Photo: http://www.newscom.com/cgi-bin/prnh/20070417/CLTU042 ) Carter is an established business leader with a diverse background that includes experience in law, government, international business and general management.\n\n\nApr 17, 2007 PR Newswire\n\n\n\nEdison International Announces Tender Offers and Consent Solicitations by Subsidiaries\n\n\n\nROSEMEAD, Calif.--(BUSINESS WIRE)--Edison International (NYSE:EIX) announced today that three subsidiary companies of its Edison Mission Group (EMG) subsidiary have commenced separate cash tender offers and consent solicitations as follows: (i) Edison Mission Energy (EME) launched a tender offer for all $600,000,000 of its outstanding 7.73% Senior Notes due June 15, 2009 (the 'EME Notes'  CUSIP ...\n\n\nApr 17, 2007 Business Wire\n\n\n\nNSTAR and Evergreen Solar Announce Alliance to Spur Interest in Solar Energy\n\n\n\nBOSTON--(BUSINESS WIRE)--NSTAR and Evergreen Solar, Inc., a manufacturer of solar power products, today announced an alliance designed to increase the role of solar power in eastern Massachusetts. The alliance will leverage Evergreen Solars unique String Ribbon solar power technology with NSTARs expertise, capabilities, and customer relationships to promote cost-effective solar options for ...\n\n\nApr 17, 2007 Business Wire\n\n\n\nVideo: LVVWD dedicates hydrogen refueling station\n\n\n\nReflecting an ongoing commitment to utilize renewable energy in its fleet operations, the Las Vegas Valley Water District (LVVWD), in partnership with the UNLV Research Foundation, dedicated a unique pilot hydrogen refueling station that operates entirely on solar power during an event April 12, 2007.     To view the Multimedia News Release, go to: http://www.prnewswire.com/mnr/lvvwd/27686/  ...\n\n\nApr 17, 2007 PR Newswire\n\n\n\nFortisAlberta Inc. Announces Retirement of Philip Hughes, Appointment of Karl Smith as President\n\n\n\nFortisAlberta Inc., a wholly owned subsidiary of Fortis Inc. (TSX: FTS), announced today that Philip G. Hughes, President and Chief Executive Officer will be retiring effective May 1, 2007. The Board of FortisAlberta Inc. has appointed Karl Smith to succeed Mr. Hughes as President and Chief Executive Officer of FortisAlberta Inc. on May 1, 2007.  FortisAlberta Inc., a wholly owned subsidiary of ...\n\n\nApr 17, 2007 Internet Wire\n\n\n\nRestoration Nearly Complete in Central N.C.; Crews Still Working in Mountains\n\n\n\nBy 7 p.m. today, Progress Energy Carolinas expects to complete restoration of wind-storm power outages for customers whose homes and businesses are capable of receiving power in all areas other than Western North Carolina. (Logo: http://www.newscom.com/cgi-bin/prnh/20020923/CHM008LOGO-c ) The western part of the state sustained more damage and experienced stronger winds well into Tuesday.\n\n\nApr 17, 2007 PR Newswire\n\n\n\n\n\nPlatts/Capgemini Utilities Executive Study\n\n\n\nINCREASING AND EVER-CHANGING GOVERNMENT regulation, the ongoing challenge of infrastructure investments and the roller coaster ride of natural gas prices are the top issues on the minds of the movers and shakers in the North American electricity and natural gas utility industries, according to a recent survey by Platts and Capgemini. Completed in late 2006, the Platts and Capgemini survey of top ...\n\n\nApr 17, 2007 Platts\n\n\n\nBiofuels refinery\n\n\n\nCALGARY - A site north of Innisfail, Alta., will be home to North America's largest biofuels refinery starting this summer when construction begins on a $400-million plant that will produce 300 million US gallons per year of ethanol, biodiesel and crushed canola. The Calgary Herald has learned Dominion Energy Services, LLC along with New York-based private equity affiliates Riverstone Holdings ...\n\n\nApr 17, 2007 Canada.com\n\n\n\nCalifornia lawmakers reject bill to lift ban on new nuke plants\n\n\n\nA California bill that sought to lift the state's ban on new nuclear plants in an effort to help cut greenhouse gas emissions was rejected by a 6-3 vote Monday by the Assembly Natural Resources Committee. California law bans new nuclear plants until the waste storage problem is resolved. The bill by Assemblyman Chuck DeVore would have repealed that ban, citing the need to increase efforts to curb ...\n\n\nApr 17, 2007 Platts\n\n\n\nNor&#39;easter&#39;s ill winds still being felt by BGE customers\n\n\n\nBaltimore Gas and Electric customers were still without power at noon Tuesday as a result of the nor'easter that pounded the Eastern seaboard with rain and high winds. That number is down significantly from the 55,000 BGE households that were without power Monday afternoon. Baltimore County was still hardest hit, with a little less than 4,400 customers without power.\n\n\nApr 17, 2007 Washington Business Journal\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nRussia's Energy Reserve Constituted 12.0 Percent of the Global Primary Energy Production In 2005\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c54288) has announced the addition of Social and Infrastructure Analysis for the Russian Energy Industry to their offering. Vital growth trends such as robust economic policies, energy consumption patterns, and energy security are becoming increasingly prominent in the Asian energy industry.\n\n\nApr 17, 2007 Business Wire\n\n\n\nAMSC Receives PowerModule(TM) Order for VRB Power Systems Wind Energy Storage Device\n\n\n\nWESTBOROUGH, Mass.--(BUSINESS WIRE)--American Superconductor Corporation (NASDAQ: AMSC), a leading energy technologies company, announced today continued growth in orders for its power electronics solutions for the global wind power market. The companys PowerModule power converter technology has been selected to manage power for a unique wind energy storage system  a new product that is expected ...\n\n\nApr 17, 2007 Business Wire\n\n\n\nIdentify the Leading Companies Active in the World's Solid Oxide Fuel Cells (SOFCs) Market\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c54207) has announced the addition of Solid Oxide Fuel Cells (SOFCs) - Global Strategic Business Report to their offering. This report analyzes the worldwide markets for Solid Oxide Fuel Cells (SOFCs) in US$ Million. The report provides separate comprehensive analytics for the North America, Europe, ...\n\n\nApr 17, 2007 Business Wire\n\n\n\nEgypt accuses nuclear employee of spying\n\n\n\nCAIRO, Egypt  An engineer from the Egypt's nuclear agency stole documents and gave them to the Israel's Mossad intelligence service in exchange for $17,000, a prosecutor said Tuesday, announcing the man's arrest on espionage charges. The engineer's family denied the accusations. State security prosecutor Hisham Badawi announced that two foreigners, one Japanese and one Irish, were also wanted in ...\n\n\nApr 18, 2007 Augusta Chronicle\n\n\n\nCanadian Solar Officially Opens Cell Manufacturing Subsidiary\n\n\n\nCanadian Solar Inc. ('the Company'', or ''CSI'') (Nasdaq: CSIQ) celebrated the grand opening of its subsidiary, CSI Cells Co., Ltd. in Suzhou, China on April 15, 2007. The first phase of CSI Cell's new facility, with an area of about 10,000 sq meters, has an annual capacity of 25 MW, and is expected to be ramped up to 100 MW by the middle of Q4 of 2007.     ''The  manufacturing of cells is ...\n\n\nApr 17, 2007 PR Newswire\n\n\n\nSolar EnerTech Announces Appointment of Industry Specialist as Head of Systems Integration Division\n\n\n\nSolar EnerTech Corp. (OTCBB: SOEN) (the  Solar EnerTech Corp. (OTCBB: SOEN) (the \"Company\") is pleased to announce that Mr. Cai Qizhuang has joined Solar EnerTech to lead the Company's Systems Integration and Application Division, which is responsible for integrating the Company's products into both residential and commercial installations, as well as building-integrated PV systems (\"BIPV\").\n\n\nApr 17, 2007 Internet Wire\n\n\n\nRussia finishes 540 miles of EPSO pipeline\n\n\n\nFront Page&gt; UPI Page advertisement MOSCOW, April 17, 2007 (UPI) --  Russia's pipeline monopoly Transneft said Tuesday it had completed 540 miles of an oil pipeline from Eastern Siberia to the Pacific Ocean. Work on a section of the ESPO pipeline to China is now under way, said Marat Saifudinov, a Transneft vice president. 'The preparation of works in the section Talakan field-Aldan has been ...\n\n\nApr 17, 2007 Washington Times\n\n\n\nU.S. pursues ethanol technology as key to reducing oil dependence\n\n\n\nJENNINGS, Louisiana: The sun shone brightly on the crowd gathered at the rusting old oil refinery here, as company officials showed off diagrams explaining how they planned to turn weeds and agricultural wastes into car fuel. Government officials gave optimistic speeches. In the background, workers were preparing a new network of pipes, tanks and conveyor belts.\n\n\nApr 17, 2007 International Herald Tribune\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}