{"category": "spam", "to_address": null, "from_address": "\"DR. MACK WHITE\" <mackwhite_4@hotmail.com>", "subject": "OPEC STAR PRIZE WINNER", "body": "\n\n\n\n\n OPEC STAR PRIZE WINNER\nINTERNATIONAL AWARENESS PROMOTIONS,ORGANIZATION OF THE PETROLEUM EXPORTINGCOUNTRIES (OPEC)\n \nReference Number: CTC:2551256003/23 12th June 2007\nDear: WINNER\nThe Officials of International Awareness Promotion Department of the ORGANIZATION OF THE PETROLEUM EXPORTING COUNTRIES,(OPEC) wishes to congratulate you on your success as the STAR PRIZE WINNER in this years OPEC International Awareness Promotion (OIAP) held on Monday 4th of June, 2007.This makes you the proud owner of the cash prize of $1.300.000,00. One Million Three Hundred Thousand United States Dollars Only The selection process was carried out through random selection in our Computerized GSM Selection System (GSM.S.S.) from a database of over a million GSM numbers from the Oil Producing Countries. Each GSM was attached to a ticket number and your number with ticket number: C55T24 and serial number: CT/556543450906 was randomly selected as the star prize winner amongst other consolation prize winners.For you to collect your prizes, kindly fill the verification form below and send it to our claims department through this contact.Name DR. CHRISTIAN ANTHONY,Phone number +234-806-075-0191 E-mail: (claimsdepartment_1opec@hotmail.com) stating your receipt of this notification.He have been mandated to offer you assistance and facilitate the urgent payment of you winning fund.\nVERIFICATION FORM:\nFULL NAME:AGE:NATIONALITY:COUNTRY OF RESIDENCE:FULL ADDRESS:PHONE AND FAX NUMBER:EMAIL ADRRESS:OCCUPATION/POSITION:COMPANY:TICKET NUMBER:SERIAL NUMBER:NAME OF NEXT OF KINADDRESS OF NEXT OF KIN\nThe above information shall be forwarded to our paying bank for verification and immedaite release of your fund to your nominated bank account.\nCongratulations once more, and keep trusting in us..\n \nDR. MACK WHITE.\nINTERNATIONAL AWARENESS PROMOTIONS,ORGANIZATION OF THE PETROLEUM EXPORTING COUNTRIES (OPEC)Play free games, earn tickets, get cool prizes! Join Live Search Club.   Join Live Search Club!\n"}