{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Neva Clement\" <cijemaxescrowjaq@emaxescrow.net>", "subject": "Look in the mirror and enjoy the new you", "body": "\nSummer is coming, time to tone up\n\n\n\n\n\n\nAnatrim – The latest and most fascinating product for weighty people is made available now – As told on CNN.\n\n\nCan you remember all the situations when you appeal to yourself to do anything to get rid of this fastly growing pounds of fat? Happily, now no major sacrifice is necessary. With Anatrim, the ground-breaking kilos-melting combination of elements, you can achieve healthier life style and a really slender figure. Just look at what people write!\n\n\n\n\"I hate to acknowledge it but I was terribly addicted to food. \n\n\nI greedily ate all this trash \n\n\nand just could not stop. \n\n\n\n\nThis misery stopped when I started taking Anatrim! \n\n\nGod,\n\n\n\n\n my craving for food vanished, \n\n\nspirits increased and I’m the happiest person 19 pounds in 2.8 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person in the world!\"\n\n\n\n\n\nLusia R., Las Vegas\n\n\n\n\n\n\"I had weight problems since a boy. \n\n\nYou can't even fancy how I abhorred being ridiculed at school. \n\n\n\n\nI abhorred my weight and I detested even myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nThis stuff literally took me out of this dreadful nightmare! Lots of thanks to you, guys.\"\n\n\n\n\n\nRikky Martin, New York\n\n\n\n\n\n\"You know what? My marriage was saved thanks to Anatrim! I went into the circle, depression – more eating – more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nOne my best friend showed me web page and I called for my pack of Anatrim as soon as it was possible. \n\n\nThe results I achieved were magnficent, my appetite came to admissible level, I was often in a good mood, and, of course, I went some belt holes back. And you know, the bedroom became cool also!\"\n\n\n\n\n\nRikky\n\n\n\n\n There is a great number of gratitudes left by happy people trying Anatrim. Why don't you add yourself to the thousands and thousands of slender women and men and try this original appetite decreasing energy lifting product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}