{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Spie Sutherland\" <spie@proficio.ca>", "subject": "Re: gentoo dropping speakup support", "body": "Travis,\n\nI wasn't suggesting that this was addressing the real problem,\nas I said, it was a suggestion as interim way to at least have \nspeech if  the regular boot doesn't talk. \n\nThe problem is bigger than user space or not. Right now you\ncannot grab a doubletalk LT and plug it into a USB serial \nadapter and use speakup, or any RS232 synth. \n\nInterestingly though, you can plug a doubletalk LT into USB\nserial adapter and configure the kernel for usb serial console\nand get ALMOST all of the boot messages, but speakup \nwill not work.\n\nThe days of having RS232 ports on PCs might be limited, \nand  there's lots of RS232 synths around, so this is an \nexample where the real answer lies in at mininal some \nre-architecture of the speakup driver.  \n\nI'm perhaps a bit over the edge here, but I like to think \na lot in the multimodal sense that its always a bad idea \nto assume specific modality, like a PC keyboard for \nexample. What I would like to see happening in speech \nand accessibility in general is generic interfaces that do \nnot assume specific device. The synth has functions that\nyou invoke with keyboard, now let's say it was on a \nphone with 4x4 keypad, or on a remote control, it \nwould be nice if it could still be doable. So basically \nrather than assuming 104 key keyboard that would be\none mapping of function to controller. \n\nThere seems to be several good arguments for \nre-architecting the drivers in this way, on both the \nsynth and user ends of the whole. \n\nThe kernel versus user space argument is interesting.\nConsider ALSA, you have kernel drivers, but you \nalso have apps that use those drivers like the config\napps and the mixers and players. I tend to think that\nstrategically speakup needs to move in that direction.\n\nTactically my suggestion was coming up with some \nsmall easily installable root file system and kernel \nthat would enable speech for those who don't have\nit working, which from watching this list for several\nyears, seems to be many people.\n\nWhat would be really cool is a USB dongle that \nis not only a speech system but an entire linux \nsystem on flash too. You could boot it on a \nwindows machine and not use windows at all.\nAnd ideally it would also work with windows.\nOkay, now back to reality, I'd be happy just to \nfigure out how to solve the usb serial problem\nin the near term.\n\n  -- Spie\n\n\n\n----- Original Message ----- \nFrom: \"Travis Siegel\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Sunday, June 17, 2007 10:16 PM\nSubject: Re: gentoo dropping speakup support\n\n\n> Spie.\n> Your suggestion of having a small installation on the machine is a  \n> good one, and it probably would work.  However, this assumes you  \n> already know what the problem is that needs fixed.  Without having  \n> access to the actual boot messages (not just the ones you see while  \n> booting into your sandbox as it were) you'll never be able to solve   \n> any major problems that crop up in regards to the main system.\n> it is however, not a bad idea, since it would allow some degree of  \n> free usage w/o sighted assistance on simple fixes.  it wouldn't  \n> address the  main issue though.\n> And, in any case, it's functionally equivalent to the original  \n> suggestion of using a live cd to boot and work on fixing the issues  \n> from there.\n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}