{"category": "ham", "to_address": "\"\" <ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"The Internet Patrol\" <info@theinternetpatrol.com>", "subject": "\n The Internet Patrol - Search the Largest Collection of US Military Records in the World and Do a Free Ancestor Search!", "body": "\n\n\nThe Internet Patrol\n\n\n The Internet Patrol\nhttp://www.theinternetpatrol.com\n\nSearch the Largest Online Collection of US Military Records in the World and Do a Free Ancestor Search for US Military Personnel!\n\n\nLooking for ancestors who may have been military personnel or want to do a military family history search?  Now you can perform a free ancestor search through the largest online collection of US military records, courtesy of Ancestry.com! \n\nRead more here: Search the Largest Online Collection of US Military Records in the World and Do a Free Ancestor Search for US Military Personnel!\n \n\nHere are some amazing deals we've found on the Internet for ourselves recently:\n\nGet gadget insurance for your cell phone, PDA and all your electronic gadgets, to protect against los or theft!  http://www.theinternetpatrol.com/get-your-stuff-back-with-stuffbak-pdas-laptops-cell-phones-protect-them-all\n\nSend Unlimited Newsletters to Your Customers, Friends, Family, and Others:  http://www.theinternetpatrol.com/the-perfect-way-to-send-email-newsletters\n\nUnlimited Calls to Any Phone in the U.S.:  http://www.theinternetpatrol.com/make-unlimited-phone-calls\n\nCheck out our online audio show, \"Three Things You Should Know\"!  http://www.ThreeThingsYouShouldKnow.com\n\n\nAnd check out the best collection of how to videos at http://www.LearnHowTo.TV !\n\n\nKnow somebody who would like to receive these alerts?  Forward this one to them and let them know\nthat they can sign up for free by sending email to \"internetpatrol@aweber.com\" with the \nword 'Subscribe' in the subject!\n\n\n\n\n\nThe Internet Patrol, \n302 W. El Camino Real, #411, \nSunnyvale, CA 94087, USA \n\n\n\nTo unsubscribe or change subscriber options visit:\nhttp://clients.suretymailings.com/z/r/?TBwMLMwctMzsTCxMTJzs\n\n\n"}