{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "palliate: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Friday, June  8, 2007\npalliate \\PAL-ee-ayt\\, transitive verb:\n1. To reduce in violence (said of diseases, etc.); to lessen or abate.\n2. To cover by excuses and apologies; to extenuate.\n3. To reduce in severity; to make less intense.\nI had held a hope that she would take my class, that I would have the chance not only to cope with but to help palliate her pain. -- Steven Polansky, \"Pantalone\", Harper's Magazine, February 1997\nHe was widely praised in both East and West as a humanitarian seeking to palliate the excesses of a cruel regime. -- Joseph Finder, \"The Trade in Spies: Not All Black or White\", New York Times, June 22, 1993\nThe response to industrial decline was to cling even more to the British state, which had the resources to palliate its effects, and ease a transformation to a new economy -- or, indeed, as many hoped, to prop up the declining industries. -- Allan Massie, \"Scotland not so brave in push for home rule\", Irish Times, September 4, 1997\nPalliate derives from Late Latin palliatus, past participle of palliare, \"to cloak, to conceal,\" from Latin pallium, \"cloak.\"\nDictionary.com Entry and Pronunciation for palliate\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9853536-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}