{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 112", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Minneapolis Institute of Arts buys million dollar African\n      sculpture (Provenance?) (Museum Security Network Mailing list)\n   2. The news out of the Georgetown library fire is that the\n      damage is not quite as awful as was first feared. A fair\tportion\n      of the historical documents have been shipped off for\tfreezing\n      and preservation. (Museum Security Network Mailing list)\n   3. Germany. Geldstrafe f?r missgl?ckten Kunst diebstahl an\n      Bibliothek. (Museum Security Network Mailing list)\n   4. UK. Hunt for picture's owner\n      (Museum Security Network Mailing list)\n   5. Italia. Rubate opere d'arte da mostra a Montecatini\n      (Museum Security Network Mailing list)\n   6. Tutela dell?arte, a lezione di legalit? con il generale Ugo\n      Zottin (Museum Security Network Mailing list)\n   7. UK. ?45,000 Ringley sketch part of Lowry haul\n      (Museum Security Network Mailing list)\n   8. Art theft trial begins for former Olympian?s partner\n      (Museum Security Network Mailing list)\n   9. Conference report: How to handle executive pay, donors and\n      the press - Legal Issues in Museum Administration\n      (Museum Security Network Mailing list)\n  10. Famous Dominican impresario is in criminal court hearing\n      today (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Tue, 8 May 2007 20:32:02 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Minneapolis Institute of Arts buys million dollar\n\tAfrican\tsculpture (Provenance?)\nTo: \nMessage-ID: <009001c7919f$2ec6da40$8c548ec0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nMinneapolis Institute of Arts buys million dollar African sculpture\nBy Mary Abbe, Star Tribune\n\nLast update: May 07, 2007 - 7:57 PM\n\nThe Minneapolis Institute of Arts has bought a top-of-the-line bronze\nAfrican sculpture for an undisclosed price in excess of $1 million. \nThe 400-year-old portrait-head of a king, made in what is now southern\nNigeria, came from a Paris dealer who offered it to the Minneapolis museum,\nwhich has been seeking great objects for its already renowned collection of\nAfrican art.\n\n\"It's a very exciting acquisition,\" said William Griswold, the museum's\ndirector. He declined to say how much the museum paid but said it was \"in\nexcess of seven figures.\" \n\nBenin bronzes, as they are known, are rare and considered a high point in\npre-colonial African culture. By unusual coincidence, another Benin bronze\nhead from the same era will be up for auction at Sotheby's in New York on\nMay 17 and is expected to sell for between $1 million and $1.5 million. \n\nThe 12-inch head, which joins three other Benin pieces owned by the museum,\nwas probably made between 1600 and 1650 and depicts an unidentified king, or\nOba, wearing a necklace of coral beads.\n\nThe institute recently built a $50 million addition primarily to expand its\n20th century collection, and it continues to buy art across the board\nincluding contemporary prints, photos and paintings. \n\nGiven the extraordinary cost of 20th-century art, the museum expects it will\nhave to rely on gifts for many of its acquisitions in that field. \n\n\"There are many more works by [contemporary sculptor] Jeff Koons out there\nthan there are Benin heads,\" Griswold said.\n\nhttp://www.startribune.com/\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Wed, 9 May 2007 05:57:19 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The news out of the Georgetown library fire is that the\n\tdamage is not quite as awful as was first feared. A fair\tportion of\n\tthe historical documents have been shipped off for\tfreezing and\n\tpreservation.\nTo: \nMessage-ID: <002c01c791ee$24ac63f0$6e052bd0$@org>\nContent-Type: text/plain;\tcharset=\"US-ASCII\"\n\nGeorgetown Library Fire Aftermath\nThe news out of the Georgetown library fire is that the damage is not quite\nas awful as was first feared. A fair portion of the historical documents\nhave been shipped off for freezing and preservation. \n\nHere, via Jerry McCoy, one of the great resources this region has for\npreserving and promoting the record of our past, are some photos showing the\nPeabody Room before and after the fire:\nhttp://blog.washingtonpost.com/rawfisher/2007/05/georgetown_library_fire_bef\nore.html\n\nAnd here's the branch librarian's take on the fire:\nhttp://blog.washingtonpost.com/rawfisher/2007/05/georgetown_library_fire_bef\nore.html\n\nAnd just in case anyone is thinking of suing the District for failing to\nmaintain its fire hydrants properly, here's a West Coast firefighter's\nreport on how his department used to prevent the sort of disaster we saw\nhere last week, when D.C. firefighters discovered that the two hydrants\nclosest to the Georgetown library were not functioning:\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/05/04/AR2007050401\n650.html\n\n\nWe used to test each hydrant annually. The testing was done by the on duty\ncrews. The city and county were divided up by map page and it took several\nmonths to complete.\n\nWe would remove each of the hydrant caps, wire brush the threads, open up\nthe hydrant to ensure that it worked, graphite the threading and then put\nthe caps back on. This took approximately ten minutes per hydrant. \n\nToday there is no annual hydrant testing done by the fire department. It was\ndecided by the city that since the water department is out every day working\non the water lines they were the appropriate city department to handle\nhydrants. We do go out and put blue markers in the street to help locate\nhydrants at night. In addition we clear any vegetation 3' around the\nhydrant. \n\nWhen a hydrant is damaged or removed the water department lets us know and\nwe update our map pages and \"bag\" the hydrants with garbage bags and duct\ntape. \n\nSound like DC needs to get a better system to monitor their water system!\n\nhttp://blog.washingtonpost.com/\n\n\n\n------------------------------\n\nMessage: 3\nDate: Wed, 9 May 2007 06:48:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Germany. Geldstrafe f?r missgl?ckten Kunst diebstahl an\n\tBibliothek.\nTo: \nMessage-ID: <004201c791f5$5909ad90$0b1d08b0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\n09.05.2007Beitragsfunktionen:\nKommentieren Empfehlen Drucken \nAUS DEM GERICHTSSAAL Im Suff dem Uhu zu Leibe\nGeldstrafe f?r missgl?ckten Kunst diebstahl an Bibliothek\n\nEs geht um einen Uhu, eine Eule aus Schmiedeeisen, vielleicht 50 bis 80\nKilogramm schwer. Der Vogel h?ngt unter den Arkaden zwischen der Bibliothek\nund der ehemaligen Humboldt-Buchhandlung.\n\nWas sich am 13. November 2006 abends gegen 19.45 Uhr mit dem Uhu abgespielt\nhaben soll, klang gestern wohl nicht nur in den Ohren der Richter des\nAmtsgerichts bizarr. Alfried W., nach eigenem Bekunden \"wohl Alkoholiker,\nseit ich auf der Welt bin\", soll gemeinsam mit Andreas P. versucht haben,\ndas st?hlerne Unget?m abzuschrauben und zu stehlen. Gegen P., der im\nKrankenhaus liegt, wird in einem abgetrennten Prozess verhandelt, so dass\nsich gestern nur W. wegen des versuchten gemeinschaftlichen Diebstahls auf\nder Anklagebank wiederfand. Die drei als Zeugen vernommenen Polizisten\nerz?hlten im Wesentlichen die gleiche Geschichte. Ein Passant habe zun?chst\nauf der Langen Br?cke die Bundespolizei verst?ndigt, dass sich zwei M?nner\nauf einer Leiter an dem Kunstwerk zu schaffen machten. Als die Beamten vor\nOrt eintrafen, h?tten P. und W. auf der Betonkante einer Blumenrabatte\ngesessen. Beide seien \"stark alkoholisiert\" gewesen. In der Rabatte habe\neine lange Holzleiter gelegen, der Uhu sei bereits halb abgeschraubt\ngewesen. Zudem h?tte P. auf einem mit allerlei Werkzeugen gef?llten Beutel\ngesessen, wohl, um ihn zu verstecken. Die Beschreibung des Passanten h?tte\nauf die beiden Angeklagten gepasst.\n\nW. n?tzten auch seine Ged?chtnisl?cken nichts. Er beteuerte, beide h?tten\ndort nur gesessen in ihrem \"Suff\". Wie solle er denn als 90-prozentiger\nInvalide auf eine Leiter steigen und eine \"Eule von zwei Zentner\"\nabschrauben, fragte W. den Richter. Dem reichten die Indizien. Der\n55-j?hrige Berliner, der schon 21-mal verurteilt wurde und mehrfach\nGeldstrafen zahlte, muss abermals in die Tasche greifen: Das Gericht\nverurteilte ihn zu einer Geldstrafe von 750 Euro, aufgeteilt auf 50\nTagess?tze. Es gebe \"keinen Hinweis\", dass jemand anderes auf der Leiter\ngestanden habe. Pee\n\nhttp://www.maerkischeallgemeine.de/\n\n\n\n------------------------------\n\nMessage: 4\nDate: Wed, 09 May 2007 08:48:24 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] UK. Hunt for picture's owner\nTo: Museum Security Network Mailinglist \nMessage-ID: <46416EB8.2050209@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n  Hunt for picture's owner\n\nPOLICE are trying to trace the owner of a painting which was stolen from \nthe Huntingdon area 17 years ago.\n\nThe picture, a James Webb dating from 1878, was recently recovered in \nNorfolk after it was bought at auction for ?40 - but police records do \nnot go back far enough to let them reunite it with its owner.\n\nIt was one of a number of paintings taken in a burglary in 1989 and now \npolice want the owner to contact them.\n\nDetective Constable Martin Brocklebank said: \"I am appealing to anyone \nwho thinks this painting may be theirs or knows the owner of the paining \nto contact me.\n\n\"Unfortunately police records do not go back to 1989 and we are \ntherefore unable to trace the owner.\"\n\nDet Con Brocklebank can be contacted on 0845 4564564 and information can \nalso be given to Crimestoppers, anonymously, on 0800 555111.\n\nhttp://www.cambridge-news.co.uk\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Wed, 09 May 2007 08:48:30 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Italia. Rubate opere d'arte da mostra a Montecatini\nTo: Museum Security Network Mailinglist \nMessage-ID: <46416EBE.4090006@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n*Rubate opere d'arte da mostra a Montecatini *\n08.05.2007\n\nFurto di opere d'arte in una mostra in corso a Montecatini Terme \n(Pistoia). A ''Profondo rosa'' - questo il titolo della rassegna - che \nsi tiene all' interno dello stabilimento termale Tamerici i ladri hanno \nportato via un quadro e quattro sculture dopo aver rotto una vetrata d' \nepoca ed essendo attenti a non farsi riprendere dalle telecamere. Il \nvalore delle opere rubate e' stimato intorno ai 10.000 euro. (ANSA per \nintoscana.it).\n\nhttp://www.intoscana.it\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Wed, 09 May 2007 08:48:36 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Tutela dell?arte, a lezione di legalit? con il generale\n\tUgo Zottin\nTo: Museum Security Network Mailinglist \nMessage-ID: <46416EC4.4020507@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nTutela dell?arte, a lezione di legalit? con il generale Ugo Zottin\n\nFirenze- ?L?Arma dei Carabinieri e la tutela del patrimonio culturale?, \nquesto il titolo della lezione che il generale di brigata, comandante \ndella Regione Carabinieri Toscana, Ugo Zottin terr?, nell?Auditorium del \nConsiglio regionale (Via Cavour 4), gioved? 10 maggio alle ore 11.00, \nalla presenza del presidente del Consiglio regionale. L?incontro, \nrivolto agli studenti dell?Istituto d?Arte di Porta Romana, \ndell?Istituto per l'Arte e il Restauro Palazzo Spinelli e del liceo \nartistico di Firenze, verter? sull?attivit? del Nucleo Carabinieri \nTutela Patrimonio Culturale: le operazioni di servizio pi? importanti; i \nrecuperi d?arte pi? famosi; un bilancio dell?attivit?.\nL?appuntamento sulla legalit? che si svolge nell?ambito del progetto, \ngestito direttamente del Comando Regione Carabinieri Toscana, ha \nl?obbiettivo di avvicinare gli studenti alle istituzioni e favorire una \nconoscenza reciproca tra Arma e giovani. (bb)\n\nhttp://www.nove.firenze.it/\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Wed, 09 May 2007 08:48:42 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] UK. ?45,000 Ringley sketch part of Lowry haul\nTo: Museum Security Network Mailinglist \nMessage-ID: <46416ECA.4070200@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n?45,000 Ringley sketch part of Lowry haul3\n\nA SKETCH of Ringley Village by LS Lowry has been stolen in an armed robbery.\n\nMasked raiders tied up art dealer Ivan Aird and threatened to kill his \ntwo-year-old daughter before making off with ten Lowry paintings and \nsketches, believed to be worth more than ?1.4 million. The scene at \nRingley alone is worth ?45,000 Mr Aird's wife, Louise, opened the door \nof their home in Cheadle Heath, Stockport, at 7.50am last Thursday to \nwhat she believed was the postman, only for three men to rush in and \noverpower the couple and threaten them with a large knife as Mrs Aird \nheld daughter Sabrina in her arms.\n\nAmong the paintings stolen were The Viaduct', valued at in excess of \n?700,000, The Tanker Entering the Tyne', worth between ?500,000 and \n?600,000, and the unique The Artist's Palette and Paintbrushes.' \nDetectives investigating the robbery say the offenders knew exactly what \nthey were looking for.\n\nDetective Chief Inspector Linda Reid from Stockport CID said: \"The \nbrutality these men showed to the Aird family was horrific. They may not \nhave physically harmed them but they were left extremely shaken by the \nwhole ordeal.\n\n\"This would appear to be a targeted attack by burglars who knew exactly \nwhat they were looking for. They must have known Mr Aird was an art \ncollector and that he would have the paintings in the house. These \npaintings are extremely valuable to collectors but someone would have to \nknow the right people to sell them on to.\"\n\nOne of the offenders is described as white, in his 30s, with a round \nface and was wearing a fluorescent jacket. Another of the men is \ndescribed as mixed race and the third was wearing a balaclava. All three \nmen spoke with local accents.\n\n4:31pm Tuesday 8th May 2007\n\nhttp://www.thisislancashire.co.uk\n\n\n\n\n------------------------------\n\nMessage: 8\nDate: Wed, 09 May 2007 08:48:47 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Art theft trial begins for former Olympian?s partner\nTo: Museum Security Network Mailinglist \nMessage-ID: <46416ECF.5060905@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nArt theft trial begins for former Olympian?s partner\n \nRene Bruemmer\nThe Gazette\n\n\nTuesday, May 08, 2007\n\nThe trial of former Olympic athlete Myriam Bedard's partner, Nima \nMazhari, who is charged with the theft and possession of paintings \nvalued at $100,000, began this week at the Montreal courthouse.\n\nMazhari, who initially defended himself in the case after complaining of \nunfair treatment at the hands of Canada's justice system, appeared in \ncourt Monday with legal-aid lawyer Yves Graton.\n\n\"A judge told me it's very hard even for a lawyer to present a case like \nthis in front of a jury,\" Mazhari said in an interview today. \"So even \nthough we suffered this very hard situation, where we faced bureaucratic \nterrorism, where I was not trusting anybody ... we will have to try and \nhave trust.\"\n\nJury selection and witness testimony is scheduled to begin next week, \n\"but in court, you never know how long things will take,\" Mazhari said. \nThis week is reserved for legal motions by the defence. The case is \nscheduled to last eight weeks.\n\nMazhari is accused of stealing 20 paintings between December 2001 and \nNovember 2003 by the late Ghitta Caiserman-Roth, with whom Mazhari \nshared a studio on St. Laurent Blvd.\n\nBedard and Mazhari dominated headlines last December after a Canada-wide \nwarrant was issued for her arrest on charges they had fled to \nWashington, D.C., with her 11-year-old daughter in violation of a \ncustody agreement with the girl's father.\n\nBedard and Mazrahi said they were seeking asylum in Washington because \nthey were being persecuted in Canada after testifying about the Liberal \nsponsorship scandal.\n\nBedard, who won two Olympic gold medals for Canada in 1984, was arrested \nin Columbia, Md., on Dec. 22 and spent two weeks in a U.S. jail before \nbeing sent to Quebec City with an RCMP escort.\n\nIn April, she was ordered to stand trial on a charge of abducting her \ndaughter in violation of a court order by Superior Court Justice Pierre \nVerdon.\n\nhttp://www.canada.com/\n\n\n\n\n------------------------------\n\nMessage: 9\nDate: Wed, 09 May 2007 08:48:53 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Conference report: How to handle executive pay, donors\n\tand the press - Legal Issues in Museum Administration\nTo: Museum Security Network Mailinglist \nMessage-ID: <46416ED5.3070304@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nConference report: How to handle executive pay, donors and the press\n\nMuseum lawyers and employees met to discuss the most pressing legal \nissues faced by US institutions\n\nBy Martha Lufkin | Posted 09 May 2007\n\nThe 35th annual conference on Legal Issues in Museum Administration, \nattended by museum staff, lawyers and others, was held in Philadelphia \non 14-16 March.\n\nTargeting recent prickly issues that have made US museum officials \nsweat, the course gave top billing to stolen antiquities claims: what to \nask to conduct due diligence before acquisition, whether to settle or \nfight a claim, and how to draft your legal agreement with a foreign \ngovernment to ?transfer? (do not say ?return?) the antiquities it seeks.\n\nThe course tackled other problems, including legal and public relations \ncrises, the use of donors? names to recognise large gifts, tax \ncompliance, museum mergers, and copyright. The conference was \nco-sponsored by the Smithsonian Institution with the cooperation of the \nAmerican Association of Museums.\n\n*Pay your top people?reasonably?*\nTax laws impose a costly excise tax on public charity executives who \nreceive excess compensation, and on board members who knowingly approve \nit, says Celia Roady, a lawyer at the firm Morgan, Lewis & Bockius LLP, \nWashington, DC. Bad press about executive pay can lead to a drop in \npublic contributions, she warns. Ms Roady advises that museums follow \nIRS rules to ensure that executive pay is presumed to be reasonable: the \ncompensation decision must be made by an independent board or committee; \nthe board or compensation committee must rely on market data on \ncomparable pay for the position; and the board or committee must \ndocument its compensation decision in the minutes. In addition, says Ms \nRoady, the board should be ?fully engaged? in the compensation decision, \nall elements of compensation should be disclosed to the board, and the \nboard should play a role in setting expenses and privileges.\n\n*Sell everything, from the fountain to the new wing*\nMany museums have minimum donation policies for the use of donor names. \nLarry Dubinski, Vice President of Development and General Counsel of the \nFranklin Institute, Philadelphia, suggests an inventory of new \nopportunities: ?Start with everything possible that can be named, from \nthe water fountain to the stairs to the new wing.? Museums should \n?benchmark gift levels with peer institutions?, such as the local \nsymphony orchestra, to make sure that the minimum donations required for \nname use are realistic, Mr Dubinski says. One you have secured a gift, \ninvite the donor to a ?meaningful? public ceremony which includes the \ndonor?s family, to encourage continued giving.\n\nBut what about deviating from an agreement to use a donor?s name? This \nmay be desirable when circumstances change, says Elizabeth R. Salasko, \nAssociate General Counsel of the University of Pennsylvania, \nPhiladelphia. The gift agreement should allow a change if use of the \nname becomes detrimental. For example, Seton Hall University?s \n?Kozlowski Hall? was renamed Jubilee Hall after the donor, L. Dennis \nKozlowski, was convicted of grand larceny; Mr Kozlowski asked that his \nname be removed to avoid distraction. But after former Sotheby?s chief \nA. Alfred Taubman was convicted of auction house anti-trust violations, \nBrown University kept his name and money for its Center for Public \nPolicy and American Institutions, because the gift was given before the \ncriminal allegations. Other future changes in circumstance could include \na need to rebuild or renovate; in such cases, some donors will want \njoint recognition with a future donor.\n\n*When the crisis hits, call your lawyer*\nLawyers from the Smithsonian Institution (SI), Getty Museum and \nMetropolitan Museum, which have withstood significant recent negative \npress, gave tips on handling crises. John Huerta, General Counsel at SI, \ndescribed a public firestorm over its 2005 agreement with Showtime \nNetworks, intended to disseminate more information about SI activities. \nWhen press reports wrongly claimed that the deal would cut access to SI \ncollections, Congress slashed the SI?s budget and called for hearings. \nWhile the SI was able to correct the wrong impression, Huerta advises \ncreating a strategic communications plan to anticipate negative \nresponses from constituencies and head them off. A separate crisis \nmanagement plan should also be created, to make clear who will respond \nto criticism in a disaster.\n\nThe J. Paul Getty Trust has faced a barrage of bad press over its \nantiquities collection and the conduct of its executives. Former \nantiquities curator Marion True is currently on trial in Rome, accused \nof conspiring to receive illicitly excavated artefacts and former Getty \nTrust President Barry Munitz resigned in February 2006 after the Los \nAngeles Times reported a misuse of trust funds including lavish spending \nand other improprieties, later confirmed by an investigation by the \nCalifornia State Attorney General. Peter C. Erichsen, General Counsel \nand Secretary of the Getty Trust, noted that any chief executive or \nboard member could conceivably ?misbehave or be subject to allegations \nof misbehaviour?. In dealing with the press and public in a museum \ncrisis, lawyers should recognise that ?you may in fact be only at the \nbeginning of a bad story?, which may unfold unpredictably. When pressure \nbuilds for a quick response, take your time, Mr Erichsen says, ?and \nstick to the facts?. He added that a new model is emerging for the \ngeneral counsel as a whistleblower, ?who divorces himself from the \norganisation and becomes a truth teller?. But the lawyer should also be \nfair to the organisation, and guide the governing board, he says.\n\nSharon H. Cott, Secretary and General Counsel at the Metropolitan, \ndescribed the press coverage surrounding the Metropolitan?s return in \n2006 of antiquities sought by Italy as ?obsessive?. She said legal \ncounsel should be ?joined at the hip with the press office? during a \ncrisis, and should communicate with the governing board and press team \nas the situation unfolds, to avoid surprises. Until an answer is clear, \nthe lawyer?s role may be to advise a response of ?no comment? to a press \nquestion.\n\n*Controlling copyright*\nCan a museum control reproductions of objects in its collection which \nare not protected by copyright because they are in the public domain? To \nreproduce such an object, the user must have access to it, which public \ndomain status does not guarantee, says Lauryn H. Guttenplan, associate \ngeneral counsel of the Smithsonian Institution. When a museum grants a \nlicense limiting reproduction of an object in the public domain, are the \nrestrictions enforceable? No court decisions directly address this \nquestion, says copyright lawyer Simon J. Frankel of the firm Covington & \nBurling LLP, San Francisco. But the general rule is that reproduction \nlimits under a contract are enforceable, even if exceeding any \nreproduction limits under the copyright law, he says.\n\nBut even if they are legal, Mr Frankel asks, are limits on reproducing \nconsistent with the museum?s mission to educate and disseminate \ninformation?\n\n/ Written materials for the March 2007 course ?Legal Issues in Museum \nAdministration? can be ordered from ALI-ABA: tel +1 215 243 1630; \nwww.ali-aba.org \n\nhttp://www.theartnewspaper.com/\n\n// /\n\n\n\n------------------------------\n\nMessage: 10\nDate: Wed, 09 May 2007 08:48:58 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Famous Dominican impresario is in criminal court\n\thearing today\nTo: Museum Security Network Mailinglist \nMessage-ID: <46416EDA.2020400@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n\nFamous Dominican impresario is in criminal court hearing today\n\nSANTO DOMINGO. - The National District Appellate Court?s 2nd Penal \nChamber is now hearing the appeal on a lower court?s ruling that placed \nrestrictive measures against the impresario George Nader, accused of \nconspiracy to burgle the apartment owned by the Spanish businessman Jose \nCarlos Berganti?os.\n\nIn the case heard by judge Ramon H. Gonz?lez the Spaniard?s lawyers say \nNader sent his driver Boraldino de los Santos in his vehicle to break \ninto Berganti?os? apartment where a painting valued at some US$250,000 \nwas stolen, as well as other properties. Berganti?os lives in an \napartment located in the center of town.\n\nBerganti?o?s lawyer Vinicio Castillo said First Instance court judge \nNatividad de los Santos was mistaken in her ruling, because she \nshould?ve also set bond for Nader at RD$500,000, the same amount as his \ndriver.\n\nWhile Nader?s attorney, Carlos Balc?cer, said the motion is unsuitable \nand that two accusations are debated in the case; one against Nader and \nanother against Berganti?os. He said that though the two took part in \nthe transaction of a building,\n\nBerganti?os in fact wants to morally damage Nader.\n\nHe blamed Berganti?os of falsifying company documents and of refusing to \nhave his handwriting verified for forgery.\n\nBerganti?os says he was prevented from entering his own apartment and \nhad to get his lawyers to go before the Justice Ministry in order to be \nable to enter his residence.\n\nNader?s lawyers say this version is \"a lie.\"\n\nhttp://www.dominicantoday.com\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 112\n****************************************\n\n"}