{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Damien Betts\" <nexcapitalchordsmenwod@capitalchordsmen.org>", "subject": "Join the thousands of people who got slim", "body": "\nWatch your body change with Anatrim\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most delighting flesh loss product is now easily available – As were seen on ABC.\n\n\nDo you count up all the situations when you told yourself you would do anything for being saved from this desperately growing number of kilos? Luckily, now no big price is to be paid. Thanks to Anatrim, the ground-breaking kilos-melting blend, you can get naturally health lifestyle and a really slender figure. Take a look at what people state!\n\n\n\n\"It’s quite difficult to acknowledge it but I was dreadfully addicted to food. \n\n\nI greedily devoured all this garbige \n\n\nand could not stop. \n\n\n\n\nThis suffering stopped after I started course of taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite decreased, \n\n\nmood increased and I became the happiest person 29 pounds in 2.8 months. \n\n\n\n\nSo, I can tell you now I became the happiest person in the world!\"\n\n\n\n\n\nVictoria K., Bellevue WA\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nIt’s pretty hard to imagine how I detested being ridiculed at school. \n\n\n\n\nI hated the weight and I hated myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nThis stuff literally took me out of this terrible nightmare! The very sincere thanks to you, my friends.\"\n\n\n\n\n\nMike Brown, Boston\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was luckily saved! I got into the circle, depression – more eating – even more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nMy best friend pointed at your web page and I asked for pack of Anatrim right off. \n\n\nThe final result was excellent, my appetite came to normal level, I was in good spirits oftener, and, of course, I became able to tighten my belt on some holes. And you see me, the bed became cool also!\"\n\n\n\n\n\nLuis\n\n\n\n\n There many and many gratitudes delighted people leave after taking Anatrim. Why don't you join the thousands and thousands of slim people and take this all-natural appetite-suppressing energy increasing product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}