{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Willem van der Walt <wvdwalt@csir.co.za>", "subject": "Re: A computer issue, how should I deal with this? Best solution?", "body": "Hi,\nSetup a dual boot system with Windows as the default operating system to \nboot.  Give a long enough time delay to allow you to press the down arrow \nwhen you want to go into Linux.\nIf your farther starts up, he will go into windows.\nIf you start up, you press down arrow and enter and go into Linux.\nHTH, Willem\n\n\nOn Fri, 22 Jun 2007, Keith Hinton wrote:\n\n> Hi all,\n> My father is a person who expects Windows XP to be on my machine every day.\n> The deal is.\n> I bought a new gateway in April origenally intended to be the replacement Windows machine. But I have been considering running Linux natively entirely alone on it, and whiping Windows, and perhaps virtually running it instaead.\n> Problem is, My dad, who cannot understand much less begin to learn Linux, cannot stand anything then Windows.\n> I considered turning my pentium into a Windows box again, but relaly cannot aford to lose Linux on that box either.\n> A couple of months agoe, my dad logged in to my box, expecting a desktop, start menu, etc.\n> He saw a Linux log interminal, prompting for a password.\n> So he shut the system down improperly.\n> After that, I had to restore Windows from a clone.\n> I have done this too many times! And now I am being told by my dad who owns the electrical power (and who could kick my but and such) that I cannot, run Linux, whatsoever) and that he may unplug/ground me off the computer.\n> Any suggestions? This is really an act of unfairness!\n> But how can I explain to a sighted man who has a tempor and who cannot stand Linux or anything different? Thanks! Regards, --Keith\n> Skype- add skypedude1234\n> In fact, I only use WIndblows because of Skype. That's it.\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n\n-- \nThis message is subject to the CSIR's copyright, terms and conditions and\ne-mail legal notice. Views expressed herein do not necessarily represent the\nviews of the CSIR.\n \nCSIR E-mail Legal Notice\nhttp://mail.csir.co.za/CSIR_eMail_Legal_Notice.html \n \nCSIR Copyright, Terms and Conditions\nhttp://mail.csir.co.za/CSIR_Copyright.html \n \nFor electronic copies of the CSIR Copyright, Terms and Conditions and the CSIR\nLegal Notice send a blank message with REQUEST LEGAL in the subject line to\nCallCentre@csir.co.za.\n\n\nThis message has been scanned for viruses and dangerous content by MailScanner, \nand is believed to be clean.  MailScanner thanks Transtec Computers for their support.\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}