{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "Showbiz Tonight <showbiz@mail.cnn.com>", "subject": "TONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT", "body": "\n\n\nCNN.com - Showbiz Tonight\n\n\n\n\n\n\n\n\n\n\nTONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT\n\nVIRGINIA TECH MASSACRE - REACTION FROM THE STARS\nHollywood's biggest stars tell Showbiz Tonight their\nreaction to the horrifying news of the Virginia Tech shootings.\nJessica Biel, Julianne Moore, and Nicolas Cage give their\npassionate views, on TV's most provocative entertainment news\nshow.\n\nHOLLYWOOD AND VIOLENCE\nIn the wake of the\nVirginia Tech massacre, Showbiz Tonight asks: does the violence\nwe see on TV and in the movies desensitize us to real-life\nviolence? Is it time to take a closer look at how much violence\nwe're exposed to? The provocative debate, on Showbiz Tonight.\n\nTHE DON IMUS CONTROVERSY: THE ROLE OF HIP HOP\nAfter Don Imus' firing because of racist and sexist\ncomments, we're asking: is hip hop next? Is it different when\nrappers use the kinds of words that got Imus fired? Hip hop\nmogul Russell Simmons answers the tough questions, in the\ninterview you'll see only on Showbiz Tonight.\n\nSHOWBIZ\nTONIGHT QUESTION OF THE DAY: \nViolence and Hollywood: Is it\ntime to tone it down?\nVOTE AT CNN.COM/SHOWBIZ TONIGHT.\n\nSEND US A VIDEO EMAIL! \nSend your response to the\nQuestion Of The Day on video. Look into your camera and tell us\nwhat you think. Responses must be no longer than 30 seconds. To\nsend your video email, go to cnn.com/showbiztonight.Watch your\nvideo responses on \"Showbiz Tonight\" at 11 p.m. ET/PT on CNN\nHeadline Prime.\n\n\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the Showbiz Tonight list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=showbiz\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}