{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "omnipresent: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Friday, June  1, 2007\nomnipresent \\om-nuh-PREZ-uhnt\\, adjective:\nPresent in all places at the same time; ubiquitous.\nIt was rather that myth was omnipresent; the whole people thought in this way and were long confirmed in their belief. -- Jacob Burckhardt, The Greeks and Greek Civilization\nBut the music of Bortnyansky was exultant, and the canticleswere borne aloft to God the omnipotent, the omniscient, the omnipresent. -- Nikolai Ivanovich Bukharin, How it All Began (translated by George Shriver)\nThe novella moves at a pace as sluggish as that of the omnipresent moon making its way across the limpid summer sky. -- Tobin Harshaw, \"Pay the Piper\", New York Times, November 14, 1999\nCivilization is the preserve of the rich, with their polished cars, their locked houses and their omnipresent police force. -- Peter Conrad, Modern Times, Modern Places\nOmnipresent is from Medieval Latin omnipresens, from Latin omni-, \"all\" + praesens, present participle of praeesse, \"to be before, to be present,\" from prae-, \"before\" + esse, \"to be.\"\nDictionary.com Entry and Pronunciation for omnipresent\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9793808-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}