{"category": "ham", "to_address": "Sugar Mail List <sugar@laptop.org>", "from_address": "Mike Sloman <mikes@mikes.id.au>", "subject": "[sugar] More than 10 Activities Solution?", "body": "Hi all\n\nI have browsed through the mail lists and the HIG docs but have found no \nmention for a scheme to cope with more than 10 Activities in the Actions \n  section of the frame.\n\nIf there is a documented solution can someone please point me to it.\n\nIf this is all obvious and taken care of please ignore the rest of the \nemail.\n\n\nProblem:\n\nA the moment I have 11 Activities in the Action section of the frame. \nWhen do a screen rotate there is overspill of icons into corner of the \nframe. Add to that there is no room in rotated mode for any Activity \nInvites or Notifications.\n\nThe initial delivery may reduce the number of Activites shipped with the \nxo but after a while kids and teachers will develop and share their own \nand when installed will fill up the Action section of the frame, \npossibly causing problems with Sugar frame drawing and Notification/Invites.\n\nA sensible limit on Activities in the frame would be 8max allowing 2 \nslots for Invites and Notification icons to show unhindered. How to \nmanage more than 8 Activities installed then?\n\n=== Solution Step 1 (Temp,easily implemented in short term for \ndevelopment and framework for 2!)\n\n* Modify Sugar Frame draw code to place only those 8 Activities listed \nin a flat text file say, /usr/share/Activities/SugarFrameActivities in \nthe Actions section of the Frame.\n\n* The Activities listed in this file are presented on the Frame in the \norder listed in the file even allowing spaces. (This allows kids to \nchoose what they see and order)\n\n* When installing a new xo bundle add to end of list if less than 8 \nalready  present or manually edit file.\n\n=== Solution Step 2\n\n* Write a small utility to allow users to select what 7 Activities go in \nthe frame out of all installed.\n\n* This utility is permanently in the Action Frame section thus max \nactivities = 7 unless utility can be hidden elsewhere as a keystroke \npull up [right BigHand and Frame Keys together?] or elsewhere on frame \nthen 8.\n\n* The utility graphically shows on one side the Activities in the frame \nin the order required by user and on the other side the remaining \nActivities. Users drag icons to and from the Activity pool to the frame \ncontents list.\n\n* The utility mainly manages the file that contains the list of those to \nexpose in the frame.\n\n* To initiate an Activity NOT in the frame just click on the icon in the \npool and it should run and exit the utility. (perhaps double click or \nhover menu click to reduce accidentally starting activity instead of \nmoving it to the Frame list side)\n\n\nI realise this breaks some of the core design principles of Sugar but \nunless the school servers automatically remove user added Activities \nfrom the machines to keep numbers down there will come a time when more \nthan can be fitted in the frame will be installed. It is better to \naddress this now than wait for it to occur in the field.\n\nComments?\n\nCheers,\n\nMike Sloman.\n\n\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}