{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Brent Harding\" <bharding@doorpi.net>", "subject": "Re: Talking Myth TV?", "body": "Oh, thought there was something at Csun this year. I wish I knew what it \nwas.\n\n----- Original Message ----- \nFrom: \"Shane\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Wednesday, May 09, 2007 12:52 PM\nSubject: Re: Talking Myth TV?\n\n\n> On Wed, May 09, 2007 at 11:49:13AM -0500, Brent Harding wrote:\n>> Is that speech interface to MythTV, a box based on Myth that speaks, or\n>> whatever they were supposed to talk about at CSUN regarding this actually\n>\n> Do you mean the box I just posted or a different thread?\n> If a different thread, disregard this as it isn't really\n> relevant.  The box I posted uses Freevo rather than MythTV\n> but afaik, the functionality of the two apps is similar.\n> Freevo is more of a set-top frontend though which supports\n> extensive media playback options through mplayer.  The\n> speech interface to that is custom built.  A trivial patch\n> mind you but custom.  I've never played with MythTV but if\n> it doesn't use gtk, qt or whatever the X-windows based\n> screenreaders use, I'm sure you could modify Myth to simply\n> call an external program for speech output.  That's all my\n> freevo patch does, runs a script with the text on\n> commandline.  The script then takes care of the rest,\n> killing any other speak scripts which happen to be running\n> so you can interrupt it by pressing buttons quickly and\n> then calling a speech synthesizer, Festival, Dectalk or the\n> like.\n>\n> S\n>\n> -- \n> http://www.cm.nu/~shane/\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}