{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 136", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Germany. Call for papers--Conference on risk management\n      (Museum Security Network Mailing list)\n   2. Gods on display. An exciting exhibition in Berlin awakes a\n      plea for the return of stolen treasures.\n      (Museum Security Network Mailing list)\n   3. In Iraq's four-year looting frenzy,\tthe allies have become\n      the vandals. British and American collusion\tin the pillaging of\n      Iraq's heritage is a scandal that will\toutlive any passing\n      conflict. (Museum Security Network Mailing list)\n   4. Italy. Opere d'arte rubate,\tpiacentino nei guai. Manager di\n      58 anni accusato di incauto\tacquisto di due quadri.\n      (Museum Security Network Mailing list)\n   5. M?xico devolvi? este jueves a Guatemala el ?leo sobre tela\n      del siglo XVII Sue?o del papa Gregorio IX, que hab?a sido robado\n      el 2 de mayo de 2004 del Museo de Arte Colonial de Antigua,\n      Guatemala. (Museum Security Network Mailing list)\n   6. Peru. Objetos robados de la Catedral de Puno no est?n\n      catalogados. (Museum Security Network Mailing list)\n   7. Shrines devastated as militants target Iraq's ancient\n      heritage (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Fri, 8 Jun 2007 07:48:17 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Germany. Call for papers--Conference on risk management\nTo: \nMessage-ID: <01cb01c7a990$9ebfe770$dc3fb650$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nSubject: Call for papers--Conference on risk management\n\nRisk Assessment - Management Strategies\nAschaffenburg/Germany, Stadthalle am Schloss February 14-16, 2008\n\nInternational Conference of the Restorers Association of Germany (VDR -\nVerband der Restauratoren e.V.)\n\nWorking Group Preventive Conservation\n\nNatural disasters as flood disasters or burnings clarify the difficulties to\nprevent cultural heritage from such risks and to act in case of an emergency\nin a time-efficient way. Besides these disastrous catastrophes it is\nnecessary for every museum institution in terms of different risks and\nthreats to minimize cases of damage or loss by cautious risk assessment and\nto act on cost-efficient and time-effective management strategies.\nProtections should therefore include e.g. fire control, natural disasters,\nanti-theft devices and vandalism as well as war and terrorism. Management\nstrategies have to apply both for smaller emergencies and for big disasters.\n\nThis international conference is to set the state-of-the-art in the field of\nrisk assessment and management strategies. Participants are invited to an\nall-embracing exchange of experience and to discuss patterns of behaviour in\nemergencies, cost-efficient and time-efficient safety concepts as well as\nresponsibilities and information management. Due to the complexity of this\ntopic, papers from different fields are requested.\n\nThe official languages of the conference are German and English (no\nsimultaneous translation). Accepted papers are included in the conference\nmaterials, publication in a reviewed journal is foreseen.\n\nConference Deadlines:\n\nThe organizers invite you to contribute posters and papers in German and/or\nEnglish on your latest work to the mentioned subject areas.\nPlease use the abstract template which is available online at\n\n    http://www.restauratoren.de/index.php?id=240 \n\nand send your abstract by e-mail to the organization committee at\nFG-PraeventiveKonservierung [at] gmx__net\n\nAbstracts deadline is September 1,  2007.\n\nThe program will be available after review of all contributions.\n\nInformation: Details and further information (conference deadlines, fees,\naccommodation etc.) are available under URL above.\n\nFor questions please do not hesitate to contact FG-PraeventiveKonservierung\n[at] gmx__net\n\nAlexandra Schieweck\nCoordinator\nVerband der Restauratoren e.V. (VDR)\nWorking Group Preventive Conservation\nFG-PraeventiveKonservierung [at] gmx__net\n+49 531 2155 924\nFax: +49 531 2155 905\n\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Fri, 8 Jun 2007 08:13:21 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Gods on display. An exciting exhibition in Berlin\n\tawakes a\tplea for the return of stolen treasures.\nTo: \nMessage-ID: <020d01c7a994$1d1ad460$57507d20$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nGods on display\nJun 7th 2007\n>From The Economist print edition\n\nAn exciting exhibition in Berlin awakes a plea for the return of stolen\ntreasures\n\nPhotos:\nhttp://www.economist.com/books/displaystory.cfm?story_id=9298763\n\n\nFOR many, the word Angkor evokes a single temple packed with tourists eager\nto see what's left of a corner of Asia's ancient past. ?Angkor: Sacred\nHeritage of Cambodia?, an exhibition in Berlin, corrects this impression.\nSpanning more than 1,000 years of Hindu- and Buddhist-inspired art?stone\nsculptures, a handful of stunning bronzes and a coda of wooden statues?the\nshow makes clear that Angkor was a sophisticated complex led by a succession\nof kings who held sway over the Khmer people and hundreds of square miles of\nland studded with beautiful art created for the glory of the gods. \n\nGollings, St Kilda, Australien\n\nHevajra, a Buddhist deity, graces BerlinThere are two stories that unfold in\nthe cool lofty rooms of Berlin's 19th-century Martin-Gropius-Bau museum?a\nfar cry from the sweaty heat of the National Museum of Phnom Penh, which has\nlent many of the exhibits. First, are the splendid sculptures dominated by a\nprocession of the Hindu deities, Vishnu and Shiva, plus Harihara, who\nrepresents a mixture of both. One of the most striking is the serene face\nand upper body of Vishnu in a sleeping pose, an 11th-century fragment of\nwhat is believed to have been the largest bronze statue ever cast in\nCambodia.\n\n\nThe second story is less obvious and probably unintended by the show's\norganisers. It is to do with the wholesale looting of the temples that began\nwhen the French swept into Angkor 150 years ago. In the style of European\ncolonisers of the period, acquisitive French explorers strapped prize\nstatues onto the backs of locals for the trip out of the jungle, then loaded\nthem onto rafts for the journey down the Mekong river for dispatch to Paris.\nMany ended up as the core of the collection of Asian art at Paris's Mus?e\nGuimet. \n\nMore shocking has been the rape of Khmer art since Cambodia's independence.\nLittle free-standing statuary is left at the temples. Cambodian and Thai\nsoldiers, acting for well-organised rings, have hacked at much of it leaving\npedestals empty, walls with holes and, in some cases, headless and armless\ntorsos. \n\nUnfortunately, as a star statue in Berlin shows, possessions of the National\nMuseum in Phnom Penh were not always safe, either. A well-girthed Shiva,\nclasping a lotus in one outstretched hand, and his diminutive wife, Uma, in\nthe other is placed prominently in one of the Berlin rooms. But Uma's head\nis missing. The Berlin curators don't say so on their description, but her\nhead was stolen?literally hacked off?when the piece was on show at the Phnom\nPenh museum in the 1970s. \n\nSecurity, upkeep and finance have all greatly improved at the museum since\nthen. Indeed, the sculptures look a little lost away from their usual\nhabitat in the more informal setting of Phnom Penh. There, the galleries\nopen on to a courtyard filled with coconut palms and vermillion flowers,\nallowing a visitor to daydream about the landscape where the original\nartists of Angkor worked.\n\nIn their temporary home in Berlin, the sculptures are given descriptions\nthat are a little thin. A visitor would do well to invest in ?Art and\nArchitecture of Cambodia?, a history by Helen Ibbitson Jessup, the curator\nof the blockbuster Khmer exhibition that took place at Washington's National\nGallery of Art in 1997, which is available at the museum bookstore. \n\nWith the Phnom Penh collection now recognised as a great repository of Khmer\nart, might some collectors consider repatriating at least part of their\nbooty to its rightful place? Many possessors of stolen Khmer art argue that\nit is safer in their hands than it would be in Cambodia, but this may no\nlonger be the case. Where, for a start, is Uma's head? \n\n\n\n?Angkor: Sacred Heritage of Cambodia? is at Martin-Gropius-Bau, Berlin,\nuntil July 29th. It is then at Museum Rietberg, Zurich, from August 19th\nuntil December 2nd.\n\nhttp://www.economist.com/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Fri, 8 Jun 2007 08:13:28 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] In Iraq's four-year looting frenzy,\tthe allies have\n\tbecome the vandals. British and American collusion\tin the pillaging of\n\tIraq's heritage is a scandal that will\toutlive any passing conflict.\nTo: \nCc: msn-list@te.verweg.com\nMessage-ID: <021c01c7a994$2190cc20$64b26460$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nIn Iraq's four-year looting frenzy, the allies have become the vandals\n\n\nBritish and American collusion in the pillaging of Iraq's heritage is a\nscandal that will outlive any passing conflict \n\nSimon Jenkins\nFriday June 8, 2007\nThe Guardian \n\n\nFly into the American air base of Tallil outside Nasiriya in central Iraq\nand the flight path is over the great ziggurat of Ur, reputedly the earliest\ncity on earth. Seen from the base in the desert haze or the sand-filled\ngloom of dusk, the structure is indistinguishable from the mounds of fuel\ndumps, stores and hangars. Ur is safe within the base compound. But its\nwalls are pockmarked with wartime shrapnel and a blockhouse is being built\nover an adjacent archaeological site. When the head of Iraq's supposedly\nsovereign board of antiquities and heritage, Abbas al-Hussaini, tried to\ninspect the site recently, the Americans refused him access to his own most\nimportant monument.\n\nYesterday Hussaini reported to the British Museum on his struggles to\nprotect his work in a state of anarchy. It was a heart breaking\npresentation. Under Saddam you were likely to be tortured and shot if you\nlet someone steal an antiquity; in today's Iraq you are likely to be\ntortured and shot if you don't. The tragic fate of the national museum in\nBaghdad in April 2003 was as if federal troops had invaded New York city,\nsacked the police and told the criminal community that the Metropolitan was\nat their disposal. The local tank commander was told specifically not to\nprotect the museum for a full two weeks after the invasion. Even the Nazis\nprotected the Louvre.\nWhen I visited the museum six months later, its then director, Donny George,\nproudly showed me the best he was making of a bad job. He was about to\nreopen, albeit with half his most important objects stolen. The pro-war\nlobby had stopped pretending that the looting was nothing to do with the\nAmericans, who were shamefacedly helping retrieve stolen objects under the\ndynamic US colonel, Michael Bogdanos (author of a book on the subject). The\nvigorous Italian cultural envoy to the coalition, Mario Bondioli-Osio, was\ngiving generously for restoration.\n\nThe beautiful Warka vase, carved in 3000BC, was recovered though smashed\ninto 14 pieces. The exquisite Lyre of Ur, the world's most ancient musical\ninstrument, was found badly damaged. Clerics in Sadr City were ingeniously\nasked to tell wives to refuse to sleep with their husbands if looted objects\nwere not returned, with some success. Nothing could be done about the\nfire-gutted national library and the loss of five centuries of Ottoman\nrecords (and works by Piccasso and Miro). But the message of winning hearts\nand minds seemed to have got through.\n\nToday the picture is transformed. Donny George fled for his life last August\nafter death threats. The national museum is not open but shut. Nor is it\njust shut. Its doors are bricked up, it is surrounded by concrete walls and\nits exhibits are sandbagged. Even the staff cannot get inside. There is no\nprospect of reopening.\n\nHussaini confirmed a report two years ago by John Curtis, of the British\nMuseum, on America's conversion of Nebuchadnezzar's great city of Babylon\ninto the hanging gardens of Halliburton. This meant a 150-hectare camp for\n2,000 troops. In the process the 2,500-year-old brick pavement to the Ishtar\nGate was smashed by tanks and the gate itself damaged. The archaeology-rich\nsubsoil was bulldozed to fill sandbags, and large areas covered in compacted\ngravel for helipads and car parks. Babylon is being rendered\narchaeologically barren.\n\nMeanwhile the courtyard of the 10th-century caravanserai of Khan al-Raba was\nused by the Americans for exploding captured insurgent weapons. One blast\ndemolished the ancient roofs and felled many of the walls. The place is now\na ruin.\n\nOutside the capital some 10,000 sites of incomparable importance to the\nhistory of western civilisation, barely 20% yet excavated, are being looted\nas systematically as was the museum in 2003. When George tried to remove\nvulnerable carvings from the ancient city of Umma to Baghdad, he found gangs\nof looters already in place with bulldozers, dump trucks and AK47s.\n\nHussaini showed one site after another lost to archaeology in a four-year\n\"looting frenzy\". The remains of the 2000BC cities of Isin and Shurnpak\nappear to have vanished: pictures show them replaced by a desert of badger\nholes created by an army of some 300 looters. Castles, ziggurats, deserted\ncities, ancient minarets and mosques have gone or are going. Hussaini has 11\nteams combing the country engaged in rescue work, mostly collecting detritus\nleft by looters. His small force of site guards is no match for heavily\narmed looters, able to shift objects to eager European and American dealers\nin days.\n\nMost ominous is a message reputedly put out from Moqtada al-Sadr's office,\nthat while Muslim heritage should be respected, pre-Muslim relics were up\nfor grabs. As George said before his flight, his successors might be \"only\ninterested in Islamic sites and not Iraq's earlier heritage\". While Hussaini\nis clearly devoted to all Iraq's history, the Taliban's destruction of\nAfghanistan's pre-Muslim Bamiyan Buddhas is in every mind.\n\nDespite Sadr's apparent preference, sectarian militias are pursuing an orgy\nof destruction of Muslim sites. Apart from the high-profile bombings of some\nof the loveliest surviving mosques in the Arab world, radical groups opposed\nto all shrines have begun blasting 10th- and 11th-century structures,\nirrespective of Sunni or Shia origin. Eighteen ancient shrines have been\nlost, 10 in Kirkuk and the south in the past month alone. The great monument\nand souk at Kifel, north of Najaf - reputedly the tomb of Ezekiel and once\nguarded by Iraqi Jews (mostly driven into exile by the occupation) - have\nbeen all but destroyed.\n\nIt is abundantly clear that the Americans and British are not protecting\nIraq's historic sites. All foreign archaeologists have had to leave. Troops\nare doing nothing to prevent the \"farming\" of known antiquities. This is in\ndirect contravention of the Geneva Convention that an occupying army should\n\"use all means within its power\" to guard the cultural heritage of a\ndefeated state.\n\nShortly after the invasion, the British minister Tessa Jowell won plaudits\nfor \"pledging\" ?5m to protect Iraq's antiquities. I can find no one who can\ntell me where, how or whether this money has been spent. It appears to have\nbeen pure spin. Only the British Museum and the British School of\nArchaeology in Iraq have kept the flag flying. The latter's grant has just\nbeen cut, presumably to pay for the Olympics binge.\n\nAs long as Britain and America remain in denial over the anarchy they have\ncreated in Iraq, they clearly feel they must deny its devastating\nside-effects. Two million refugees now camping in Jordan and Syria are\nignored, since life in Iraq is supposed to be \"better than before\". Likewise\ndozens of Iraqis working for the British and thus facing death threats are\ndenied asylum. To grant it would mean the former defence and now home\nsecretary, the bullish John Reid, admitting he was wrong. They will die\nbefore he does that.\n\nThough I opposed the invasion I assumed that its outcome would at least be a\nmore civilised environment. Yet Iraq's people are being murdered in droves\nfor want of order. Authority has collapsed. That western civilisation should\nhave been born in so benighted a country as Iraq may seem bad luck. But only\nnow is that birth being refused all guardianship, in defiance of\ninternational law. If this is Tony Blair's \"values war\", then language has\nlost all meaning. British collusion in such destruction is a scandal that\nwill outlive any passing conflict. And we had the cheek to call the Taliban\nvandals.\n\nsimon.jenkins@guardian.co.uk\n\nhttp://www.guardian.co.uk/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Fri, 8 Jun 2007 08:17:28 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Italy. Opere d'arte rubate,\tpiacentino nei guai.\n\tManager di 58 anni accusato di incauto\tacquisto di due quadri.\nTo: \nMessage-ID: <021d01c7a994$b0dee4c0$129cae40$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nOpere d'arte rubate, piacentino nei guai\nManager di 58 anni accusato di incauto acquisto di due quadric\n\nPhoto:\nhttp://www.liberta.it/asp/default.asp?IDG=706075026&H=\n\n\nC'? anche un insospettabile manager piacentino fra gli acquirenti delle\nottantotto opere d'arte rubate e recuperate dai carabinieri del Nucleo\noperativo di Pordenone nei giorni scorsi in varie citt? del Nord Italia.\nLa notizia ? stata resa nota ieri. I militari dell'Arma hanno sgominato una\nbanda dedita al traffico di opere d'arte e sono scattate nove denunce per\nricettazione: si tratta per lo pi? di persone che abitano in Veneto. \nA Piacenza ? stato invece denunciato un manager di 58 anni, accusato di\nincauto acquisto. L'uomo si ? difeso con i carabinieri dicendo che non\nsapeva di aver acquistato quadri rubati. \nSecondo gli accertamenti degli investigatori dell'Arma il manager avrebbe\ncomprato un paio di dipinti del Seicento.\nPer la parte piacentina di questa indagine hanno collaborato con i\ncarabinieri di Pordenone i carabinieri del Nucleo operativo del reparto\noperativo della nostra citt?, diretti dal tenente Rocco Papaleo e coordinati\ndal colonnello Edoardo Cappellano.\nNel corso di questa indagine avviata nel settembre del 2006 in seguito al\nritrovamento avvenuto a Pordenone di un acquerello della scuola Bolognese\nrisalente a 1600 ? stato rinvenuto anche il dipinto \"Scena Carnevalesca\" di\nDomenico Tiepolo, risalente al 1765. Era stato trafugato a Roma nel 2001\ndallo studio di un noto avvocato. Il dipinto, del valore di circa un milione\ndi euro, ? una delle due copie originali (di cui una custodita in un museo\ndi Barcellona). Era stato rivenduto per poche migliaia di euro in un\nmercatino del nord est.\nUna cinquantina le perquisizioni compiute nel corso dell'operazione: in\nVeneto, Lombardia e Emilia Romagna.\nPer mettere a segno i colpi, i malfattori utilizzavano un sistema ormai\nrodato: agivano in studi professionali di avvocati, notai e commercialisti o\nin ville, castelli e dimore private della borghesia romana, approfittando di\nlunghi periodi di assenza dei proprietari.\nAssieme al Tiepolo, sono state sequestrate altre ottantasette opere d'arte\nma soltanto per 14 di esse ? stato possibile per ora, accertare la\nprovenienza e risalire ai legittimi proprietari. Le opere sequestrate sono\ntutte state ritrovate in case di collezionisti: tra di essi avvocati,\ncommercialisti, ma anche un fisico e un macellaio con la passione per la\npittura antica. Tra quelle ancora in cerca di un padrone c'? invece una\npreziosissima icona greco-ortodossa che - secondo gli esperti - proviene con\nmolta probabilit? da Costantinopoli e il cui valore ? inestimabile. \nGli investigatori hanno cos? anche lanciato un appello per cercare di\nrisalire ai proprietari dell'ottantina di opere ancora da attribuire che\nsar? possibile presto vedere sul sito internet dei carabinieri.\nErmanno Mariani\nVai all'articolo su LIBERTA'\n\nhttp://www.liberta.it/\n\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Fri, 8 Jun 2007 08:17:28 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] M?xico devolvi? este jueves a Guatemala el ?leo sobre\n\ttela del siglo XVII Sue?o del papa Gregorio IX, que hab?a sido robado\n\tel 2 de mayo de 2004 del Museo de Arte Colonial de Antigua, Guatemala.\nTo: \nMessage-ID: <021e01c7a994$b27207e0$175617a0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nEntrega PGR a Guatemala obra de arte sacro recuperada\nDpa \n\n07/06/2007 13:55\n\nCiudad de M?xico. M?xico devolvi? este jueves a Guatemala el ?leo sobre tela\ndel siglo XVII Sue?o del papa Gregorio IX, que hab?a sido robado el 2 de\nmayo de 2004 del Museo de Arte Colonial de Antigua, Guatemala.\n\nEl procurador general de la Rep?blica, Eduardo Medina Mora, hizo la entrega\nen la capital mexicana a su par guatemalteco, Juan Luis Florido, que\ncalific? de hist?rica la recuperaci?n del lienzo, en un acto al que asisti?\ntambi?n el embajador de Guatemala, Manuel Soto.\n\nLa pintura de Crist?bal de Villalpando, de 2.6 metros de alto por 3.6 de\nancho, muestra a un hombre recostado en una cama con la cabeza apoyada en el\nantebrazo y sobre almohadas, y frente a ?l, en una nube, a una figura que\nrepresenta a San Francisco de As?s.\n\nEl lienzo, con un valor estimado de 280 mil d?lares, hab?a sido dividido en\ndos partes para su venta por los ladrones, una con la imagen de San\nFrancisco y la otra con el resto del cuadro.\n\nLa primera parte se recuper? en enero del a?o pasado y la segunda un mes\ndespu?s, en el poblado de Ajij? del estado de Jalisco, en el centro-oeste de\nM?xico.\n\nSeg?n las autoridades, el cuadro fue sustra?do por miembros de una banda de\nladrones de arte sacro.\n\nhttp://www.jornada.unam.mx/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Fri, 8 Jun 2007 08:17:29 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Peru. Objetos robados de la Catedral de Puno no est?n\n\tcatalogados.\nTo: \nMessage-ID: <021f01c7a994$b51d2ab0$1f578010$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nObjetos robados de la Catedral de Puno no est?n catalogados \n\nEl robo perpetrado a la bas?lica menor de la Catedral de Puno, es el cuarto\nen lo que va del a?o. Seg?n informaci?n proporcionada por el mismo director\ndel Instituto Nacional de Cultura de Puno, Carlos Landa Gamio, los\nfacinerosos pertenecer?an a una mafia internacional, mientras que los\nobjetos robados desde la Catedral no est?n catalogados. \n\nLanda Gamio, visiblemente preocupado por los robos de valiosas joyas del\ntemplo, lament? lo ocurrido, dando a conocer que lamentablemente los objetos\nperdidos no est?n catalogados, seg?n dijo, por desinter?s de ex director de\nesa instituci?n, Rolando Paredes Eyzaguirre que, durante su gesti?n, habr?an\nmantenido serios problemas con el Obispo de Puno, Jorge Carri?n Pavlich, lo\nque limit? la realizaci?n del cat?logo de los objetos. \n\n?Objetos de muchos de los templos de la regi?n no est?n catalogados, para el\ncaso de la Catedral de Puno, ya hab?amos tenido conversaciones para\nemprender ese trabajo en esta semana?, se?al?, el titular del INC Puno,\ndando a conocer que el trabajo de catalogaci?n de los objetos de todos los\ntemplos de la regi?n se terminar?an en el presente a?o. \n\nTemplos robados 2007 \n\nSeg?n inform? el director del Instituto Nacional de Cultura de Puno, en el\npresente a?o, los facinerosos ya perpetraron cuatro robos, de los cuales dos\nfueron frustrados, mientras que desde los templos de San Pedro de Juli y de\nla bas?lica menor de la Catedral de Puno, s? lograron llevarse los objetos\nde valor incalculable, mientras tanto la Polic?a ya viene realizando las\ninvestigaciones correspondientes. \n\nTemplos robados 2006 \n\nEn la fecha 29 de enero del 2006, los delincuentes perpetraron al templo San\nMiguel de Ilave, el 11 de marzo al templo de San Pedro de Acora, el 19 de\njunio los delincuentes roban objetos del templo de San Miguel de Ilave, y el\n26 de julio, nuevamente el templo de San Pedro es robado, y el 13 de octubre\nel templo San Juan de Letr?n de Juli, es perpetrado por los facinerosos. \n\nObjetos robados \n\nPintura, la Anunciaci?n de 166 x 119 cm, pintura San Agust?n de 154.5 x 105\ncm, pintura Santa Cecilia de 108 x 87, Objeto Lit?rgico, acetre de plata,\nObjeto Lit?rgico atril de plata repujada, Objeto Lit?rgico cop?n de lat?n,\nObjeto Lit?rgico hostia sagrada que parte de una custodia, Objeto Lit?rgico\nC?liz con su patena, Objeto Lit?rgico Corona de la Virgen de la Merced de\nPlata repujada, Metalurgia y orfebrer?a, campa?illa de bronce, micr?fono\ninal?mbrico, y minicomponente.\n\nhttp://www.losandes.com.pe/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Fri, 8 Jun 2007 08:29:19 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Shrines devastated as militants target Iraq's ancient\n\theritage\nTo: \nMessage-ID: <023301c7a996$583a1ae0$08ae50a0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nShrines devastated as militants target Iraq's ancient heritage\n\n\nRachel Williams\nFriday June 8, 2007\nThe Guardian \n\n\nIraq's archaeological heritage is being systematically destroyed by militant\nattacks, the head of the country's antiquities board warned yesterday.\nA new phenomenon of holy shrines being targeted has emerged over the last\nyear, Abbas al-Hussainy told a meeting at the British Museum. At least 18,\ndating from the ninth or 10th century, have been hit by devastating bomb\nblasts since last February's attack, claimed by al-Qaida, on the Shia shrine\nin Samarra, and it is feared more have been struck.\n\nIn the provinces of Diyala and Kirkuk 10 shrines have been hit in the last\ntwo weeks, Dr Abbas said. Other archaeological sites are suffering from\nneglect.\n\nDr Abbas was in the UK to draw up a plan outlining how the international\ncommunity can help the state board of antiquities carry out its work in the\nface of violence.\n\nShowing pictures of shrines full of rubble, he called on foreign governments\nto fund scholarships and training for his team working on rescue operations\nat bombed sites and conserving damaged antiquities, many of whom lack\nqualifications.\n\nHe said he had recently been prevented by soldiers at an American checkpoint\nfrom visiting the ancient ziggurat at Ur, where he had been due to meet the\nkeeper of the British Museum's Middle East department, John Curtis, for a\nsite inspection.\n\nDr Curtis said: \"What is happening to the shrines is quite horrendous. It's\njust gratituitous damage.\"\n\nDr Abbas said the problem of looting of archaeological sites appeared to\nhave levelled off, but continued in some areas.\n\nAfter the fall of Baghdad in 2003 some 15,000 items were looted from the\ncity's National Museum, and around 8,000 are still missing. The threat of\ninsurgent attacks and further plundering means the museum remains closed.\n\nFull coverage and relevant links:\n\nhttp://www.guardian.co.uk/Iraq/Story/0,,2098255,00.html\n\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 136\n****************************************\n\n"}