{"category": "ham", "to_address": "Marco B <tymester@gmail.com>", "from_address": "Peter Dalgaard <p.dalgaard@biostat.ku.dk>", "subject": "Re: [R] Some questions on repeated measures (M)ANOVA & mixed models\n with lme4", "body": "Marco B wrote:\n> Dear R Masters,\n>\n> I'm an anesthesiology resident trying to make his way through basic\n> statistics. Recently I have been confronted with longitudinal data in\n> a treatment vs. control analysis. My dataframe is in the form of:\n>\n> subj | group | baseline | time | outcome (long)\n> or\n> subj | group | baseline | time1 |...| time6 | (wide)\n>\n> The measured variable is a continuous one. The null hypothesis in this\n> analysis is that the Group factor does not significantly influence the\n> outcome variable. A secondary null hypothesis is that the Group x Time\n> interaction is not significant, either. Visual of the group means\n> indicates the outcome measure decreases linearly (more or less) over\n> time from baseline values. The time==1...time==6 intervals are\n> equally-spaced and we have equal sample sizes for the groups.\n>\n> I've done a little reading around and found (at least) four possible approaches:\n>\n> A. Linear mixed model using lme4 with random intercept and slope with\n> lmer() or lme()\n>\n> B. Repeated measures ANOVA using aov() with Error() stratification\n> (found in Baron & Li, 2006), something along the lines of:\n> aov(outcome ~ group * time + baseline + Error(subj+subj:time))\n>\n> (from: http://cran.r-project.org/doc/contrib/Baron-rpsych.pdf, p. 41)\n>\n> C. \"Repeated measures\" MANOVA as follows (using data in wide format):\n> response <- cbind(time1,time2,time3,time4,time5,time6)\n> mlmfit <- lm(response ~ group)\n> mlmfit1 <- lm(response ~ 1)\n> mlmfit0 <- lm(response ~ 0)\n> # Test time*group effect\n> anova.mlm(mlmfit, mlmfit1, X=~1, test=\"Spherical\")\n> # Test overall group effect\n> anova.mlm(mlmfit, mlmfit1, M=~1)\n> # Test overall time effect\n> anova.mlm(mlmfit1, mlmfit0, X=~1, test=\"Spherical\")\n>\n> (taken from http://tolstoy.newcastle.edu.au/R/help/05/11/15744.html)\n>\n> Now, on with the questions:\n>\n> 1. This is really a curiosity. I find lmer() easier to use than lme(),\n> but the former does not allow the user to model the correlation\n> structure of the data. I figure lmer() is presently assuming no\n> within-group correlation for the data, which I guess is unlikely in my\n> example. Is there a way to compare directly (maybe in terms of\n> log-likelihood?) similar models fitted in lme() and lmer()?\n>\n> 2. Baron & Li suggest a painful (at least for me) procedure to obtain\n> Greenhouse-Geisser or Huyn-Feldt correction for the ANOVA analysis\n> they propose. Is there a package or function which simplifies the\n> procedure?\n>   \nThey're also computed as part of the anova.mlm(...test=\"Spherical\") route.\n> 3. I must admit that I don't understand solution C. I can \"hack\" it to\n> fit my model, and it seems to work, but I can't seem to grasp the\n> overall concept, especially regarding the outer and/or inner\n> projection matrices (M & X). Could anyone point me to a basic\n> explanation of the procedure?\n>   \nSomething is en route to R News, I hope....\n\n> 4. Provided the assumptions for ANOVA hold, or that deviations from\n> them are not horrible, am I correct in saying that this procedure\n> would be the most powerful one? How would you choose solution A over\n> solution B (or viceversa)?\n>\n>   \nAov, lmer, and anova.mlm with the Spherical option all fit essentially \nthe same model, but lmer has less fine control over small-sample \nproperties and the effect of departures from the assumptions (partly \nbecause it needs to deal with unbalanced data).\n\nLme with an estimated covariance matrix is similar to anova.mlm without \nassuming sphericity. They are often less powerful than the \nsphericity-with-correction alternative, because of the larger number of \nestimated parameters. The balance should shift in \"large N, small p\" cases.\n\n> My sincerest gratitude to anyone who will take the time to answer my questions!\n>\n> Best Regards,\n>\n> Marco\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}