{"category": "ham", "to_address": "tridge@samba.org", "from_address": "\"Christopher R. Hertel\" <crh@ubiqx.mn.org>", "subject": "Re: first swipe at ctdb spec file", "body": "tridge@samba.org wrote:\n> Chris,\n> \n>  > Quick question:  is this the pCIFS that Peter Brahm started working on a few\n>  > years back or something different?\n> \n> I've no idea what Peter worked on.\n\nHave you had a chance to look at pNFS (which is in the NFSv4.1 spec.)?\n\nA few years ago, Peter proposed a complimentary pCIFS which would allow\nclients direct access to the block storage.  Metadata management would be\nhandled via CIFS but the clients, once they held an appropriate lock, would\ndo direct block I/O (via iSCSI, Fibre Channel, or other methods).\n\nI was speaking with folks from Panasas a couple of weeks ago.  Garth gave a\npNFS presentation and afterwards we started talking about the flexibility of\nthe Linux implementation of pNFS, and the possibility that the client-side\ncode could also be used to support pCIFS functionality.  The Panasas folks\nsounded interested, but I think they'd want to know more about the\npossibility of follow-through from both Samba and the Linux CIFS VFS client.\n\nSo back to my question:  When Ronnie talks about pCIFS which pCIFS is that\nand what is it intended to do?  Do we have a collision in the name space or\nis someone (not unusually) way ahead of me?\n\n>  > I'm interested in the API at present.\n> \n> The API is there, but the client half of it (which is what you would\n> use) is not yet cleanly separated from the server. I've started doing\n> that, but it will take some time yet.\n> \n> We'll end up with a libctdb library, which is what applications will\n> use. The code in common/ctdb_client.c is the basis for that library.\n\nI will take a look.\n\nThanks.\n\nChris -)-----\n\n-- \n\"Implementing CIFS - the Common Internet FileSystem\" ISBN: 013047116X\nSamba Team -- http://www.samba.org/     -)-----   Christopher R. Hertel\njCIFS Team -- http://jcifs.samba.org/   -)-----   ubiqx development, uninq.\nubiqx Team -- http://www.ubiqx.org/     -)-----   crh@ubiqx.mn.org\nOnLineBook -- http://ubiqx.org/cifs/    -)-----   crh@ubiqx.org\n\n"}