{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Johnathan Mason\" <veccwastorenos@cwastore.com>", "subject": "Get your ideal weight with this natural method", "body": "\nWatch the pounds disappear\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most delighting product for over-weight people is now available – As shown on CNN.\n\n\nCan you hold in your memory all the times when you asked yourself to do anything to get rid of this quickly growing number of kilos? Luckily, now no big price is to be paid. Thanks to Anatrim, the earth-shaking kilos-melting combination of elements, you can get naturally health lifestyle and become really slimmer. Just look at what our customers write!\n\n\n\n\"It’s difficult to confess but I was an awful food addict. \n\n\nI greedily ate all this trash \n\n\nand could not stop. \n\n\n\n\nThis torment left off when I started course with Anatrim! \n\n\nHoly God,\n\n\n\n\n my craving for food decreased, \n\n\nmood increased and I’m the happiest person on the planet 28 pounds in 2.3 months. \n\n\n\n\nI can tell you now I became the happiest person!\"\n\n\n\n\n\nMaria H., Las Vegas\n\n\n\n\n\n\"I had weight problems since I was a boy. \n\n\nYou can't fancy how I detested being derided at school. \n\n\n\n\nI detested my weight and I abhorred even myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nIt literally dragged me out of this fearful nightmare! A plenty of thanks to you, fellows.\"\n\n\n\n\n\nRikky Martin, San Diego\n\n\n\n\n\n\"Know what? Anatrim saved my marriage! I went into this circle, depression – more eating – just more depression. My wife was about to leave me as I was turning in overweight psycho. \n\n\nOnce one of my friends showed me web site and I ordered up my pack of Anatrim right away. \n\n\nThe results were splendid, my appetite came to admissible level, I was often in good spirits, and, certainly, I tightened my belt with no regrets. And the sex became fantastic, too!\"\n\n\n\n\n\nFrancis\n\n\n\n\n There is a great number of testimonial letters happy people leave after taking Anatrim. Don’t you wanna join the tens of thousands of slim people and try this all-natural appetite reducing power boosting product now!\n\n\nDon’t miss your opportunity!\n\n\n\n\n"}