{"category": "spam", "to_address": "\"NewsReleases\" <chortled@plg.uwaterloo.ca>", "from_address": "\"Flight News\" <Aviation@FAARegulationsPolicies.prserv.net>", "subject": "FAA Issues Changes To Light-Sport Aircraft Rule", "body": "Friday June 22, 9:00 am ET    SEATTLE, WA--(MARKET WIRE)--Jun 22, 2007 -- Jim Bede, Director of Aeronautical Design for Exosphere Aircraft Company, Inc. (Other OTC:EXSA.PK - News), was featured on Market News First (www.mn1.com) in an exclusive live interview with MN1's Bob Leonard & Rich Hancock. The interview took place on June 20, 2007 at 10:30AM CDT. MN1 also wrote a feature story about EXSA that can be viewed on its website. The story focuses on EXSA's direction in 2007 under the tutelage of Jim Bede, the explosive light-sport aircraft marketplace and the evolution of the industry. Join Jim Bede to learn more about the goals of the design of the BD-22S and the BD-22, including his aim to build both the best and most affordable LSA in the market. View the story on MN1's website at the following link:  Website: Jim !\n Bede explains Exosphere.  The Podcast featuring Jim Bede can be viewed at the following link:  Listen: Windows Media    About Exosphere Aircraft Company - (ExosphereAir.com)  Exosphere Aircraft Company is a light-sport aircraft design and manufacturing company, pioneering new and innovative airplanes for the private builder. Exosphere aims to provide the marketplace with planes that meet the majority of consumer needs, finding ways to incorporate fuel efficiency, weight limitations, plane performance and current design trends into new planes.  Jim Bede is a well-known, innovative aircraft designer and has been highly influential in the kit plane market. Bill Lear, creator of the LearJet, called Jim, \"the best damned airplane designer in the world.\" Since 1961, Bede has focused on making flying affordable for ev!\n eryone, developing his own line of aircraft. The most famous of these,\n the BD-5 micro-plane was featured in two James Bond movies, \"Octopussy\" and \"Die Another Day.\"This is a public press release privacy statement\n"}