{"category": "ham", "to_address": "sugar@laptop.org", "from_address": "\"Benjamin M. Schwartz\" <bmschwar@fas.harvard.edu>", "subject": "[sugar] Dependency Handling in the Journal", "body": "I posted this on the wiki, but I thought I'd mention it here.  I think the\njournal should track inter-file dependencies.\n\nMany files we create depend on other files.  The most common example is probably\ndocuments that contain pictures.  In some document formats, these pictures are\ncopied into the document, and in others they are referenced by location.  To\navoid wasting storage space, we would like to insert pictures by reference\n(like in .html or .dvi) rather than include them (like in a .pdf).\n\nThere are two major problems with inter-file dependencies: deletion and\ntransmission.  Without dependency awareness, it is easy to accidentally delete\na file (such as a picture) on which another file depends.  This is true whether\nthe deletion is automated or requested by the user.  Without dependency\nawareness, it is easy to transmit a document that the recipient cannot use. \nAnyone who has been e-mailed an html file without the embedded pictures has\nexperienced this.\n\nTo avoid breaking dependencies, the metadata for each file should note the files\non which it depends. A dependency should never be suggested for deletion unless\nall files that depend on it will also be deleted, and users should be warned if\nthey explicitly attempt to delete a dependency of another file.  Also, when a\nstudent sends an item to another student (or to a teacher), all of its\ndependencies should be sent with it automatically.\n\nThis scenario does not apply only to text with embedded pictures.  Other\nexamples might include a vector graphic with an embedded photograph, or a video\nediting project that strings together a number of source clips.\n\nI just thought I'd throw that out before all the APIs get finalized.\n\n--Ben\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}