{"category": "ham", "to_address": "<ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Lifestyle Newsletter April 12, 2007", "body": "\nhowstuffworksÃ\\u201aÂ® | lifestyle April 12, 2007\nRSS\n   10 Things You Can Do to Help Save the Earth \n There are little\nthings you can do every day to help reduce greenhouse gases and make a less\nharmful impact on the environment. In the spirit of Earth Day, HowStuffWorks has\ncreated an Earth Day page\nwhich includes 10 things you can do to help save the Earth. Going green is easier than you think.  \nAlso at HowStuffWorks\n\nHow Craps Works - Have you ever walked into a casino and seen (and heard) the\naction at the craps tables? It's the most exciting game in the casino, and no\nwonder: It boasts better odds if you know the bets to avoid, and since it's a\nhands-on game, it's naturally more fun -- if you know how to play. Learn how to\nplay craps and about the strategies that winners use.     \n\n\n\nHow Nostradamus Works - Through the course of human history, there have been\nhundreds of supposed prophets, but in the wake of modern tragedies, one name\nseems to pop up more than any other: Nostradamus.\nFind out who Nostradamus was and whether his predictions are as credible as\nsome purport them to be.      \n\nHow Ecolodges Work - Tourism that respects natural habitats and helps improve the\nlocal community is often referred to a\"ecotourism,\"  \"responsible tourism\"  or \"sustainable tourism.\" Once you decide that you want to go on an eco-vacation,\nyou may encounter the term \"ecolodge.\" Learn what an ecolodge is and how it\nfollows the philosophy of ecotourism.\n   \nThis Week's Video \nHow Chocolate Works - Have you ever wondered what actually makes bakers chocolate\ndifferent from semi-sweet chocolate? Learn what distinguishes the various types\nof chocolate from one another and how chocolate gets from a cacao tree to your\nbelly in this video from HowStuffWorks.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click here.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. Ã\\u201aÂ© 2007, HowStuffWorks, Inc. All Rights Reserved\n"}