{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "Hatfield Frida <celw@sap.com>", "subject": "Institute of Validation Technology        Publications and training on manufacturing in a regulated environment; discussion forum for Regulated Industries professionals.", "body": "OTCPicks.com Picks SREA As The Stock to Watch. UP 272% In 7 Days!\n\nScore One Inc.\nSREA\n$0.30 UP 20% Today\n\nUp another 20% today and over 272% in the last 7 days, OTCPICKS.com puts\nSREA on their watch list. Read up and get on SREA first thing Wed!\n\nDetects new publication on PubMed, Scirus and several other scientific\nliterature databases. Site is being expanded to include more texts on\nthe biological sciences.\n\nnet         RNA interference.\n\nCodexis       Rapid generation of novel biological catalysts with\ndesired commercial properties. Enamine       Compound screening,\ntargeted libraries, custom synthsis and discovery chemistry. BioteCon   \n Developing novel products primarily tailored for the food industry,\nincluding kits for the rapid detection of pathogens and food-spoilage\nmicro-organisms.\n\nPrior Separation Technology              Recovery of molecules;\ndownstream process development and contract purification; methods\ndevelopment.\nDevelopmental Therapeutics Program        Resources for drug\ndevelopment, including compound libraries, cell lines, screening, and\ndatabases.\n\nPublications Resource Group            See Mindbranch.\nMedWrite International      A medical communications company offering\nmarketing solutions.\nCellGenix   CellGenix Technologie Transfer GmbH - development,\nproduction and marketing of cell and gene therapy related products.\nEnamine       Compound screening, targeted libraries, custom synthsis\nand discovery chemistry.\nPharma Growth Strategies             Consulting in pharmaceutical\ndevelopment.\nMolecular Biotech Consultants    Bio-business development network.\nCentocor     Research and technology based on monoclonal antibodies and\npeptides.\n\nCalibration Pipette Repair       Pipette calibration, repair and\ncertification. Jubilant Biosys      A service provider in\nbioinformatics, chemoinformatics and genomics. USP               United\nStates Pharmacopeial Convention, Inc. PharmaPortal           Advanstar's\nnews and information site. Central Drug Research Institute India  \nDeveloping drug, biologics and vaccines. org       News and information.\nDowpharma            Business-to-business services in\nbiopharmaceuticals, synthetic chemistry, oligonucleotides, and drug\ndelivery.\n\nLG Zangani    Business development and conferencing. GMP Publications   \nFDA rules and regulations. - Consultants helping small and medium-sized\norganizations to  manage biotechnology business efforts.\n\nB R A I N              Biotechnology Research And Information Network\nGmbH, focussing on technology in molecular biology and molecular\ngenetics. Biotec Distribution       Temperature controlled logistics and\ndistribution service for biotechnology companies.\n\nHumana Press            Methods in Molecular Biology book series and the\njournal Molecular Biotechnology. Universal Medical Press        \nBiotechnology International - an annual technical reference book\nfocusing on the latest research and industry developments in\nbiotechnology.\nWe offer profiling of effects of compounds on gene expression using\nreporter genes, microarrays, and real-time PCR. \" Full text available\nonline.\nPSF Biotech    Protein expression, crystallography and NMR services for\nstructure-based drug discovery. eBioinformatics     A bioinformatics\nservice provider offering a comprehensive suite of web-based tools\nworldwide.\n\nBioTrove     Focused on advancing life science and drug discovery\nresearch by leveraging  micro- and nano-scale technology platforms.\nCodexis       Rapid generation of novel biological catalysts with\ndesired commercial properties.\n\nComplete set of functions for SAGE analysis. Knowledge Express  Online\ndatabase for technology transfer, emerging technologies, ongoing\nresearch, and business development.\n\nAbeille Pharmaceuticals              Developing pharmaceutical products\nwith a focus on improving existing drugs or optimizing future drug\ncandidates.\n\nJapanese Pharmaceutical Business Information: consulting services to\nclients to develop corporate partnerships and strategic alliances in\nJapan, Korea, and other Asian Pacific Rim countries. BioWa          \nEnhancement and optimization of antibody molecules by increasing potency\nthrough various proprietary technologies. Cell Essentials     Services\nand products to facilitate research, including the production of custom\nhybridomas and related services as well as all aspects of cell culture.\n\n"}