{"category": "ham", "to_address": "debian-desktop@lists.debian.org", "from_address": "Luis Matos <a26652@alunos.mec.ua.pt>", "subject": "Re: Debian GNU/Linux (kfreebsd anyone?) Lenny Desktop wishlist\n\tthread", "body": "Qui, 2007-04-12 às 21:17 -0300, Gustavo Franco escreveu:\n> Hi list,\n> \n> First thanks everybody who contributed to Debian Etch Desktop. There's\n> no doubt that we've raised the bar with this release and of course the\n> expectations for Lenny.\nhell yes!\n\n> \n> Lenny general release goals and schedule is (in a way) being discussed\n> at debian-release. Keep an eye on that. I'm opening this thread to\n> point out my wishlist in terms of desktop wearing my debian-desktop;\n> pkg-gnome and tasksel hats. Feedback is needed. ;-)\n> \n> * Debian Desktop is the sum of important parts: d-i, debian-cd,\n> tasksel, pkg-gnome, pkg-kde and pkg-xfce were directly or indirectly\n> involved during the Etch development cycle. I would like to see\n> pkg-ltsp, XSF and debian live also join us, you will see the reasons\n> below;\n> \n> * Xorg \"autoconfiguration\": Hopefully it will be into the next\n> upstream release and since Lenny will be released in something like 18\n> months, we won't need to work hard to push it into.\n> \n> * Automount known partitions: People dual booting complained to me\n> that after installing Debian on their desktops/laptops their previous\n> systems weren't mounted.\n> \n> * preseeding for the win on key stuff: We need to work on grub\n> preseeding definitely to at least push the desktop to use stuff like\n> splashy/usplash and maybe an init replacement like upstart. Keep in\n> mind that with preseeding support into grub we can do it in a way that\n> 'regular' installs won't be affected, but only fresh Lenny desktop\n> installs.\n\ni think splshy will be ready for lenny and is  great improveent to have\nit. It is something that is really missed by the users.\n\n> \n> * cliparts: OpenClipart should be added into the desktop tasks\n> \n> * debian-moreblue update contest: I would like to setup a contest to a\n> debian-moreblue update. We don't need something 200% new, but just\n> people that wants to tweak the theme for Lenny. (btw, thanks Andre for\n> the work to Etch)\n\nwe definetly need better desktop graphics environment. Also continue\nthe d-i, gnome, kde, xfce, splash graphics integration.\n(thanks also to andre for the more blue theme) \n> \n> * live! There are live desktop images, but they're not official and\n> don't really match the desktop tasks.\n\nagreed. Live cd's (from debian-live) seem to be easy to create, so we\ncould have a set of the to show what we want. For instance, this was\ntalked in -devel about show development tools  for linux/debian.\n\n> \n> * ltsp: We need to work to make sure that the installer will contain a\n> polished ltsp-client-builder udeb and the user will be able to select\n> \"desktop environment\" and \"thin(fat, whatever) client server\" and end\n> with a system able to provide our desktop environment for these\n> clients. This is harder than you think due to dhcp and nfs servers\n> lack of preseeding support. Shame on me, since I'm one of the pkg-ltsp\n> founders. I'll do my best to prepare patches and send them atached to\n> the bug reports.\n\nHere i have a bigger word to say. \nDebian targeted users are mainly companies, or even small business, so,\ni think we could provide a set of tasks that coul easilly set up an\nenterprise environment with desktops and a main server.\n\nIn many comanies that use linux, set up a small shared user database and\nset up shared folders and info is quite hard.\n\nWe at debian-desktop should provide a task that is oriented for\nenterprise desktop. I don't really say that it should be too diferent\nfrom the main desktop task, but have libpam-ldap and other productivity\ntools.\n\nAlso a ldap server task should be added to perform the server side.\n\nI really think debian has a few cards to show in enterprises, so let's\nget it better.\n\n> \n> * menu system: The Debian menu system needs to be reviewed for both\n> GNOME, KDE, Xfce usage and what to do to not break others WMs.\n> \n> * website and wiki: I need help with wiki articles general cleanup and\n> website maintenance. The website needs to contain more general\n> information on how to download and use Debian Desktop, Etch\n> screenshots (GNOME, KDE and Xfce in action). The wiki should be our\n> dashboard and contains our todo, wishlists and some more stuff that\n> can be english-only.\n\nagreed. This weekend i'll submit some.\n> \n> Well, that's it. The rest is basically make sure we're in sync with\n> the last upstream release where it's possible and with less RC bugs\n> around testing.\n> \n> regards,\n> -- stratus\n> http://stratusandtheswirl.blogspot.com\n> \n> \n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}