{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "eMaxCash-Inc <Rowe@168city.com>", "subject": "RE", "body": "\n\n\nHello,\n\nThe eMaxCash company offers co-operation within the framework of\nservices working in system. Thus you should not search for\n\nclients independently or to carry out advertising campaigns. Everything\nyou need is to give us - your wiliness and readiness to work and get profits.\n\nCooperate with us\nDaily hundred monetary operations from $200-$25000 passes through our\ncompany. Partners from all over the world are\nconstantly needed. If you will cooperate with us, you will receive good\nprofit from each money transaction from our clients to the bank account you are willing to give us.\n\nUsually we pay from 5% to 7% depending on the ammount of transaction!!!\nAll we need from you is to open a checking bank account in your country\n(usually these are the largest banks, which are\nin any region of your country).\n\nAfter that our clients will transfer the funds to your account. As soon as you receive\nmoney from our clients you should immediately send it to us using Western union or Money Gram.\n\nAre you interested now?\nGood, In order to start working with us, you need to follow these\ninstructions:\n\nSend us you resume with the information below:\n\na. Your personal information (Gender, age, place of work)\nb. Your home address\nc. Phone number where you can be reached.\nd. List of banks where you could provide the accounts for money\ntransactions\n\nP.S. We would like to inform you, that all your personal information\nand transaction information will be kept confidentially.\n\nWe will not sell or give this information to anyone besides ourselves.\nWe will look at your resume and if everything is correct we will be\ncontacting your shortly. For security purposes we will also need the photo\ncopy of your Photo Identification (Passport or Driver's license)\n\nAfter approval of your resume, we will ask you to open a bank account\nfrom the list of the banks you provided to us.\nAs soon as you register one, and let us know that you are ready to accept the\ntransactions, we will be sending you the funds.\n\nIf you are interested becoming our partner, please feel free to contact us:\nE-mail: emaxcash@bossmail.ru\n\n--\neMaxCash, Inc.\nemaxcash@bossmail.ru\n\n"}