{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "\"Health Week\" <mailings@mail.cnn.com>", "subject": "This Week in Health", "body": "\n\n\n\n\nCNN.com - Health Week\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFriday, April 20, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAntidepressants' benefits outweigh risks for kids \nAuthors of a new comprehensive analysis of antidepressants for children and teenagers say the benefits of treatment trump the small risk of increasing some patients' chances of having suicidal thoughts and behaviors.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStrong emotions normal after trauma, expert says\nAnxiety, fear and depression are a normal response to violence, says Dr. Sheila Jowsey, a practicing psychiatrist and assistant professor of psychiatry at the Mayo Clinic.\nFULL STORY\n\n\n\n\n\n\nRecord 132 million flu shots to be made for next flu season \nFlu vaccine manufacturers expect to have a record 132 million doses ready for the 2007-2008 flu season, and even more could be available if a fifth company joins their ranks, officials said Thursday.\nFULL STORY\n\n\n\n\n\n\nStudies link hormone use to higher cancer risk \nNew research on two continents offers the strongest evidence yet that menopause hormones can raise the risk of breast cancer and are tied to a slightly higher risk of ovarian cancer.\nFULL STORY\n\n\n\n\n\n\nPoll: Picking healthy restaurant foods not so easy\nPicking the healthiest item on a restaurant menu is not as easy as it seems, according to a new poll; most respondents were unable to identify the dishes lowest in calories, salt and fat.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Health Week email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}