{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] PIJIP Comments on the Korus FTA Pharmaceuticals and IP Chapters", "body": "KORUS FTA Pharmaceuticals and IP Chapters\n\nSean Flynn and Mike Palmedo\nProgram on Information Justice and Intellectual Property\nAU, Washington College of Law\n\nMay 25, 2007\n\nToday, USTR released the negotiated text of the Korea-US free trade\nagreement.  The text can be found at:\n\nEnclosed are some of our preliminary thoughts on the text.\n\nI.    Pharmaceuticals and Medical Devices Chapter Favors U.S. Firms\n\nThe Korus FTA's chapter on drugs and medical devices will force Korean\nhealth authorities to favor brand name drugs when negotiating drug\nreimbursement rates for the Public Health Insurance.  This is the second\nbilateral trade agreement to include a section on the pricing and\nreimbursement of pharmaceuticals - the other was annex 2c of the\nAustralia-US FTA.\n\nAnnex 2(c) was viewed by many as a direct attack on the Australian\nPharmaceuticals Benefits Scheme under which reimbursement rates for\nmedicines are set by comparing their safety, efficacy and cost\neffectiveness to that of existing medicines in the same therapeutic\nclass.  Annex 2c included a host of procedural requirements intended to\ngive pharmaceutical companies opportunities to challenge listing\ndecisions by Australian health authorities.  There is some debate\nwhether Annex 2c succeeded in this aim; some argue that Australian\nnegotiators effectively protected the most important parts of the\nprogram and succeeded in agreeing only to relatively weak notice and\nprocedural requirements most of which were already in Australian law.\n\nThe Korus FTA chapter on Pharmaceuticals is based on Annex 2(c) of the\nUS-Australia FTA, yet it is more obstructive and burdensome to health\nofficials in Korea than the Annex 2 (c) is to the Australians.\n\n\"Pharmaceuticals\" v. \"Pharmaceuticals and Medical Devices\"\n\nWhile Annex 2(c) of the US-Australia FTA applies specifically to\npharmaceuticals, the scope of the corresponding chapter of the Korus FTA\napplies to medical devices as well.  Article 5.8 defines a\n\"pharmaceutical product or medical device\" as \"a pharmaceutical,\nbiologic, medical device, or diagnostic product.\"  These types of\nproducts can be very expensive.  An example of a popular medical device\nis a cochlear implant for the hearing impaired, which costs over\n$20,000.  Biologics (medicines derived from living organisms) often cost\nmany tens of thousands of dollars as well - one example is Avastin, the\n$100,000 cancer treatment that saved the life of PhRMA President Billy\nTauzin.\n\n \"Innovative\" v. \"Patented\"\n\nThe US-Australia FTA included a commitment to \"promote timely and\naffordable access to innovative pharmaceuticals.\" This wording is\nintentionally vague, allowing negotiators from both sides to claim they\nwon a concession in the deal.  The meaning of the phrase depends on the\ndefinition of \"innovative,\" which the Australians define as conferring a\nclinically important improvement in patient outcome.  When setting\nreimbursements for the Pharmaceutical Benefits Scheme, they do not count\nme-too drugs as especially \"innovative.\"  The US pharmaceutical industry\nand American trade negotiators tend use \"innovative\" as a synonym for\npatented.\n\nIn order to avoid further confusion on this matter, the Korus FTA\nspecifically requires greater access to \"patented and generic\"\nmedicines.  It specifies that when a government is determining\nreimbursement for a specific product, it must \"appropriately recognize\nthe value of patented pharmaceutical products and medical devices in the\namount of reimbursement it provides.\" (Art. 5.2.B)  This provision may\nrequire drug price negotiators to favor expensive brand name drugs over\nlower-priced generics.\n\nTransparency\n\nAnnex 2C  of the US-Australia FTA required that the system ensure\ndecisions within a specified period of time, disclose \"procedural\" rules\nand guidelines used to assess a proposed listing, afford opportunities\nto companies to provide comments, provide written reasons for listing\ndecisions, and \"make available an independent review process\" for the\ndecisions.\n\nThe Korus FTA section on transparency contains the same requirements as\nAnnex 2(c) and adds more requirements.  Health care authorities are\nrequired to provide pharmaceutical companies \"meaningful and detailed\nwritten information regarding the basis for recommendations or\ndeterminations of the pricing and reimbursement of pharmaceutical\nproducts or medical devices.\"  Changes in procedures for determining\nformulary listings be made only if the government formally solicits\ncomments and replies to them in writing.  A confirmation letter from the\nKorean Minister of Trade agrees to create an \"independent review body\"\nthat is composed of individuals completely outside of the health\nministry.  Whether this body will have the authority to overturn\ndecisions of the health authorities is left ambiguous in the letter and\ntext of the agreement.\n\nII.    Korus FTA Chapter on Pharmaceuticals May Not Affect the U.S.\n\nThe chapter on Pharmaceuticals and Medical Devices is designed to hamper\nthe operations of the Korean National Health Insurance.  Provisions of\nthe chapter apply to formulary-based price negotiations conducted by the\npublic sector.  Nearly all drug prices in the US are negotiated through\nthe use of a formulary, but the negotiations are not carried out through\nthe federal government.  Most Americans receive pharmaceuticals at\ndiscounts negotiated by private insurance companies.  Elderly Americans\nwho receive the prescription drug benefit through Medicare are actually\nenrolled in private plans which are contracted by the US government -\nthe government is paying money, but the actual price negotiation is\ncarried out by a private firm.\n\nBoth the Department of Defense and the Veterans Administration run\nhealth programs that directly purchase drugs at negotiated prices.\nAnother chapter of the Korus FTA places rules on government procurement,\nand a footnote to Article 5.2 exempts these programs from the rules in\nthe pharmaceuticals chapter based on this fact:\n\n         Pharmaceutical formulary development and management\n         shall be considered to be an aspect of government\n         procurement of pharmaceutical products for healthcare\n         agencies that engage in government procurement. Chapter\n         Seventeen (Government Procurement) and not the provisions\n         of this Chapter shall govern government procurement of\n         pharmaceutical products.\n\nThis language may effectively exempt DoD and VA programs from the scope\nof the pharmaceuticals chapter, although there is not explicit text or\nletter conclusively demonstrating this fact.  VA describes its program\nas a reimbursement formulary and VA officials have privately expressed\nreservations about the impact of USTR's excursions into this area.\n\nThe other major government program that negotiates drug prices in the\nUnited States is Medicaid, which provides medical insurance for 47\nmillion poor and disabled people.  Medicaid is a health program\nadministered by state governments under federal guidelines. Most state\nMedicaid programs negotiate drug discounts through open formularies,\ncalled \"Preferred Drug Lists.\" In apparent response to public opposition\nby states to formulary restrictions in FTAs, the KORUS pharmaceuticals\nchapter applies only to each Party's \"central level of government.\"\nFurthermore, a footnote to Article 5.8 reads:\n\n        For greater clarity, Medicaid is a regional level of\n        government health care program in the United States,\n        not a central level of government program.\n\nThis language ensures that government programs that provide drugs for\npoor Americans are not bound by the same burdensome Korus FTA rules as\ngovernment programs that provide drugs for poor Koreans.\n\nIII.    TRIPS-Plus Intellectual Property Provisions\n\nThe intellectual property chapter of the Korus FTA is designed to delay\ngeneric competition in Korea and thereby keep drug prices higher for\nlonger periods of time.  Like other bilateral FTAs, its rules on IP\nexceed those mandated by the World Trade Organization's Agreement on\ntrade Related Aspects of Intellectual Property Rights (TRIPS).  The\nrules in the Korus FTA are also considerably tougher than the \"New Trade\nPolicy for America\" (NTPA) framework agreed to by the US Congress and\npresident last week for the FTAs with Panama, Colombia and Peru.\n\nSummary of TRIPS-Plus Provisions\n\nThe agreement includes the following TRIPS-Plus provisions:\n\n*    Five years of data exclusivity for new chemical entities and three\nyears for less innovative medicines\n\n*    Linkage requirement for health authorities to block generic\nregistrations for patented medicines\n\n*    Mandatory extensions of patents beyond the original 20-year term in\ncases of delay in the granting of the patent or registration with health\nauthorities\n\n*    Patents required for new uses of known products\n\nData Exclusivity\n\nWhen a generic firm seeks approval from health authorities to sell its\nproduct, it does not generally repeat the human trials performed by the\nbrand name firm to prove safety and efficacy.  Repeating the trials\nwould be unethical, prohibitively expensive, and extremely time\nconsuming.  Instead, a generic firm shows that its product is\nbioequivalent to the brand name drug, meaning that it is chemically\nidentical and behaves the same way in the body.\n\nThe TRIPS Agreement requires that the data submitted to national health\nauthorities be protected from \"unfair commercial use.\"  In the US, this\nis done by granting a period of data exclusivity during which time no\ngeneric competitors can apply for FDA approval of their products based\non the originator's test data.  It should be clear, however, that such\nperiods of exclusivity are not required by the TRIPS agreement.  Other\nmodels of data protection such as monetary payment to the originator in\nreturn for use of the data have been proposed.\n\nKorus FTA Article 20.9.1 requires five years of data exclusivity for new\nchemical entities, and three years of data exclusivity for compounds\nthat do not include new medicinal substances.  If one country allows\napproval based on previous approval in another, a firm may further delay\ngeneric competition by not registering the drug in the second country\nuntil exclusivity is about to expire in the first.\n\nThis is stronger protection than was agreed to the \"New Trade Policy for\nAmerica,\" which does not explicitly include exclusivity for medicines\nother than new chemical entities, and which requires concurrent periods\nof exclusivity in situations where one country bases approval on\napproval in another country.\n\nLinkage\n\nLinkage provisions in free trade agreements prevent health regulatory\nauthorities from approving the sale of generics while the brand name\ndrug is still under patent.  In the United States, our system of linkage\nhas led to widespread abuse since the Food and Drug Administration lacks\nthe expertise to adjudicate intellectual property disputes.  Companies\nare able file patents for insignificant changes to their products and\nwin extensions of marketing exclusivity.  In many cases, patents that\nwould not survive legal challenge are filed, but the cost of challenging\na pharmaceutical patent is prohibitively high.\n\nKorus FTA Article 20.9.4 requires each country to prevent the health\nauthorities from approving the sale of generics while the brand-name\ndrug is still under patent.  The TRIPS Agreement makes no mention of\nlinkage, and the NTPA specifically excludes linkage provisions (though\nit says some sort of procedural remedy for patent holders will be\nnecessary).\n\nPatent Extensions\n\nThe TRIPS Agreement mandates 20 year patents.  Many bilateral trade\nagreements require extensions of patents to make up for delays in the\nissuance of the patent or in the winning of marketing approval for a new\ndrug.  The NTPA makes such extensions optional for the FTAs with Peru,\nPanama and Colombia, but Korus FTA Article 20.8.3 requires mandatory\nextensions of the patent term.\n\nSecond Use Patents\n\nOften, medicines developed for one disease are found to be effective in\nthe treatment of another.  Gleevec, for instance, was originally\ndeveloped for the treatment of a rare form of leukemia, and was\nsubsequently found to also fight another cancer called GIST. The TRIPS\nAgreement requires patents for new inventions, but not for new uses of\nexisting products.  The NTPA does not address the issue of so-called\nsecond use patents, but the Korus FTA confirms that new uses for\nexisting products will be patentable.\n\nCONCLUSION\n\nThe Korus FTA includes many provisions that ratchet up IP protection and\nratchet down government regulatory and price negotiation powers compared\nto all previous FTAs.  The intended and likely result is clear: drug\nprices will be much higher, particularly in Korea.\n\n\n---------------------------------------------------------------------------------------------------\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}