{"category": "ham", "to_address": "\"Mario Dejung\" <forum@dejung.net>", "from_address": "\"hadley wickham\" <h.wickham@gmail.com>", "subject": "Re: [R] problem with hist()", "body": "On 6/15/07, Mario Dejung  wrote:\n> > On 6/14/07, Mario Dejung  wrote:\n> >> Hey everybody,\n> >> I try to make a graph with two different plots.\n> >>\n> >>\n> >> First I make a boxplot of my data. It is a collection off correlation\n> >> values of different pictures. For example:\n> >>\n> >> 0.23445 pica\n> >> 0.34456 pica\n> >> 0.45663 pica\n> >> 0.98822 picb\n> >> 0.12223 picc\n> >> 0.34443 picc\n> >> etc.\n> >>\n> >> Ok, I make this boxplot and I get for every picture the boxes. After\n> >> this\n> >> I want to know, how many correlations per picture exist.\n> >> So I make a new vector y <- as.numeric(data$picture)\n> >>\n> >> So I get for my example something like this:\n> >>\n> >> y\n> >> [1] 1 1 1 1 1 1 1 1 1 1\n> >> [11] 1 1 1 1 1 1 1 1 2 2\n> >> ...\n> >> [16881] 59 59 59 60 60 60 60 60 60 60\n> >>\n> >> After this I make something like this\n> >>\n> >> boxplot(cor ~ pic)\n> >> par(new = TRUE)\n> >> hist(y, nclass = 60)\n> >>\n> >> But there is my problem. I have 60 pictures, so I get 60 different\n> >> boxplots, and I want the hist behind the boxes. But it makes only 59\n> >> histbars.\n> >>\n> >> What can I do? I tried also\n> >> hist(y, 1:60) # same effect\n> >> and\n> >> hist(y, 1:61)\n> >> this give me 60 places, but only 59 bars. the last bar is 0.\n> >>\n> >> I hope anyone can help me.\n> >\n> > What does the y axis represent?  It will be counts for the histogram,\n> > and correlations for the boxplots.  These aren't comparable, so you're\n> > probably better off making two separate graphics.\n> >\n> > Hadley\n> >\n> The boxplots show only the median, min, max, etc of the different\n> pictures, but I want to know, how many entry's are in this plot. Now I\n> have done this by the hist function, and when I use different colors, you\n> can see, for the first picture there are about 130 entry, but for the 8th\n> picture, there are only 40 entry's...\n> Doesn't make this sense?\n\nI think your plot would be more clear if you used two graphics - one\nshowing the spread, and one showing the number of points (you might\nalso want to look at notched boxplots).  In the graphic you attached\nthe bars of the barchart (not histogram! - that's for continuous data)\ndistract the eye from the boxplots.  You might also want to try\nordering the x axis by mean or number of observations as this will\nmake it easier to see trends in the data.\n\nThe confusion with the barchart arises because there are really two\nquite different types of barcharts.  One type is basically the same as\na dotchart, but you draw bars instead of dots - this is the default in\nR.  The other type is the categorical analog of the histogram, and\nthis is the default in ggplot2\n(http://had.co.nz/ggplot2/geom_bar.html), allow the next version will\nautomatically work out which version you want.\n\nHadley\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}