{"category": "ham", "to_address": "\"Leeds, Mark \\(IED\\)\" <Mark.Leeds@morganstanley.com>", "from_address": "\"Patrick Wang\" <pwang@berkeley.edu>", "subject": "Re: [R] Split a vector(list) into 3 list", "body": "Thanks,\n\nno index function was defined in R.\n\nI try to use the split(order(temp), temp), the number of groups are\ncorrect, however the result doesnot seem to be correct. I try to match\nbefore the ordered index and the original index.\n\nPat\n\n> If  temp is your vector then split(index(temp),temp) will give you what\n> you want.\n>\n>\n> -----Original Message-----\n> From: r-help-bounces@stat.math.ethz.ch\n> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Patrick Wang\n> Sent: Thursday, May 17, 2007 8:15 PM\n> To: r-help@stat.math.ethz.ch\n> Subject: [R] Split a vector(list) into 3 list\n>\n> Hi,\n>\n> I have a vector contains values 1,2,3.\n>\n> Can I call a function split to split it into 3 vectors with 1\n> corresponds to value ==1, which contain all the indexes for value==1.\n>\n> 2 corresponds to value ==2 which contain all the indexes for value=2\n>\n> Thanks\n> pat\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide\n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n> --------------------------------------------------------\n>\n> This is not an offer (or solicitation of an offer) to buy/sell the\n> securities/instruments mentioned or an official confirmation.  Morgan\n> Stanley may deal as principal in or own or act as market maker for\n> securities/instruments mentioned or may advise the issuers.  This is not\n> research and is not from MS Research but it may refer to a research\n> analyst/research report.  Unless indicated, these views are the author's\n> and may differ from those of Morgan Stanley research or others in the\n> Firm.  We do not represent this is accurate or complete and we may not\n> update this.  Past performance is not indicative of future returns.  For\n> additional information, research reports and important disclosures,\n> contact me or see https://secure.ms.com/servlet/cls.  You should not use\n> e-mail to request, authorize or effect the purchase or sale of any\n> security or instrument, to send transfer instructions, or to effect any\n> other transactions.  We cannot guarantee that any such requests received\n> via e-mail will be processed in a timely manner.  This communication is\n> solely for the addressee(s) and may contain confidential information.  We\n> do not waive confidentiality by mistransmission.  Contact me if you do not\n> wish to receive these communications.  In the UK, this communication is\n> directed in the UK to those persons who are market counterparties or\n> intermediate customers (as defined in the UK Financial Services\n> Authority's rules).\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}