{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "Retired MILF <RetiredMILF@bigenginemen.com>", "subject": "SEXUALLY-EXPLICIT: Life Begins at 40 gnitpick!", "body": "\n\ngnitpick Life Begins at 40\n\n\n\n\n\n\n\n\n\nCaution: Graphic Adult Material Below. This email contains Sexual Explicit Material.\nIf you do not wish to view Sexual Explicit Material \nPlease follow This Link to exit. \nOnly 21+ years of age can Enter.  Move Down To See Ad. If you cannot see images on this page, please \nRefresh Here.\n\n \n\n\n\nMILF, Grand-MILF... and just Plain Old Women gnitpick\n\nMature Women Who Are Not Picky About Age, Size, Race...\nThey Take Them All In!\n \n\nJOKES OF THE DAY\nPondering Old Age \nHow do I know that my youth is all spent?\nWell, my get up and go has got up and went.\nBut in spite of it all I am able to grin\nwhen I recall where my get up has been.\nOld age is golden-so I've heard it said-\nbut sometimes I wonder when I get into bed,\nwith my ears in a drawer and my teeth in a cup,\nmy eyes on the table until I wake up.\nAre sleep dims my eyes I say to myself,\n\"Is there anything else I should lay on the shelf?\"\nAnd I'm happy to say as I close my door,\nmy friends are the same, perhaps even more.\nWhen I was young, my slippers were red,\nI could pick up my heels right over my head.\nWhen I grew older, my slippers were blue,\nbut still I could dance the whole night through.\nBut now I am old, my slippers are black,\nI walk to the store and puff my way back.\nThe reason I know my youth is all spent,\nmy get up and go has got up and went.\nBut I really don't mind when I think, with a grin,\nof all the grand places my get up has been.\nSince I have retired from life's competition,\nI accommodate myself with complete repetition.\nI get up each morning, and dust off my wits,\npick up my paper and read the \"obits\".\nIf my name is missing, I know I'm not dead,\nso I eat a good breakfast and go back to bed. \n \n\n\nThe Old Lady \nA family took their frail, elderly mother to a nursing home and left her, hoping she would be well cared for.\nThe next morning, the nurses bathed her, fed her a tasty breakfast, and set her in a chair at a window overlooking a lovely flower garden. She seemed okay, but after a while she slowly started to tilt sideways in her chair.\nTwo attentive nurses immediately rushed up to catch her and straighten her up. Again she seemed okay, but after a while she slowly started to tilt over to her other side.\nThe nurses rushed back and once more brought her back upright. This went on all morning. \nLater, the family arrived to see how the old woman was adjusting to her new home. \"So Ma, how is it here? Are they treating you all right?\"\n\"It's pretty nice,\" she replied. \"Except they won't let me fart.\"The Hearing Aid \nAn elderly gentleman had serious hearing problems for a number of years. \nHe went to the doctor and the doctor was able to have him fitted for a set of hearing aids that allowed the gentleman to hear 100%. \nThe elderly gentleman went back in a month to the doctor and the doctor said, \"Your hearing is perfect. Your family must be really pleased that you can hear again.\" \nThe gentleman replied, \"Oh, I haven't told my family yet. I just sit around and listen to the conversations. I've changed my will three times!\" \n\n\n\n\n\n\n\n\n\n"}