{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nPresident Bush’s sweeping immigration plan is\n  dead. The administration’s hard-fought legislation would have legalized\n  millions of immigrants currently living in the country without requisite documentation,\n  but as Sharyl Attkisson reports, the bill fell 14 votes short of going to a\n  final vote – and despite the president’s major lobbying efforts\n  on Capitol Hill, most of the opposition to the bill was from his own party.  \n \nChief White House correspondent Jim Axelrod will\n  give us some perspective on what is going right, and the many more things\n  that are going wrong for the Bush White House.\n \nFirst it was pet food, then toy trains and then toothpaste.\n  Now there are concerns about imports of shrimp and fish from China after repeated testing has shown samples\n  were contaminated with potentially dangerous antibiotics not approved for use\n  in U.S.\n  farmed seafood. Bob Orr will report.\n \nIt’s been a bloody day in Iraq. A car bomb killed at least\n  25 at a busy intersection in Baghdad\n  and 20 decapitated bodies were found in a Sunni village southeast of the\n  city. And the offensive north of Baghdad,\n  in Baqouba, continues. Tonight, Lara Logan will show you video that tells the\n  story of how troops in the Baqouba offensive are able to track down and\n  capture suspected al Qaeda insurgents. \n \nMeanwhile, more than 2,100 firefighters are still\n  battling the raging wildfire near Lake\n    Tahoe, California. They’re\n  fighting the blaze on two fronts, trying to keep it contained and away from\n  densely populated subdivisions nearby. Bill Whitaker will have the latest.\n \nFinally, that big, soaring symbol of America\n  – and I don’t mean the Boeing 747 – is being taken back off\n  the protected species list. The bald eagle has landed, John Blackstone will\n  report.\n \nThanks and I hope you’ll join us tonight,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}