{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Stephan Mccarty\" <powclaimsimplicitydeq@claimsimplicity.com>", "subject": "Control your weight and appetite", "body": "\nCheck out the wonders of pound melting\n\n\n\n\n\nAnatrim – The very up-to-date and most exciting flesh loss product is now easily available – As could be seen on CNN\n\n\n\nDo you see superfluous body kilos kill a plenty of people for every new year? We know that you hate the ugly look of those people and the low status they obviously have in society. \n\nMoreover, you got no will to resist a siege of terrible eating habits of yours. This all sounds familiar? Then we have something for you!\n\n\n\n\n\nIntroducing Anatrim, the ultimate product for the elimination of your body’s extra weight. The amazing thing about Anatrim is it raises the quality of your life by making you crave food less and giving you better spirit. Here’re some notes from our customers:\n\n\n\n\n\n\"It’s outstanding! \n\n\nInstead of watching TV constantly and eating anything close at hand \n\n\nI became more interested in exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I am in a great shape now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nAmely S., Bellevue WA\n\n\n\n\n\n\n\"Passive weight losing was of little help to me. I was rather difficult for me to restrain my ravenous appetite. \n\n\nOnce I was told about Anatrim my very best friend by and I rather liked the information.\n\n\n I had tried to use it, and my wife said to me I look very good now, 5 months later. \n\n\n30 pounds have gone away and this is still far to an end! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nSteve Burbon, Washington\n\n\n\n\n\nAnatrim helps you to understand that you got no such great need for the constant eating. It improves your spirit, supplies you with energy, and attacks useless kilos. All thanks to its mighty newly-elaborated formula!!\n\n\n\nWorm out more information!\n\n\n\n\n"}