{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CNN Student News <CNNStudentNews@cnn.com>", "subject": "June 8, 2007", "body": "CNN.com Student News Newsletter\n\n\n\n\n\n\n \nFriday, June 8, 2007 \n\n\n\n Watch and Learn\nIn our last show of the school year, we examine a possible compromise over a missile defense system in Europe, and we check out an invention that can draw water out of thin air.\nToday's edition of CNN Student News is the last broadcast of the school year. Watch for the program over the summer at CNN.com/EDUCATION. \n\nOfficial: Private college loans marked by abuses\nRampant abuses by lenders have followed a boom in higher-priced college loans not guaranteed by the government, and lax federal oversight has made the situation worse, New York's attorney general said Wednesday.\n\n June 11, 2007\nThe June 11, 2007, airing of CNN Classroom Edition: We Were Warned: Edge of Disaster has been preempted. Record the commercial-free CNN Classroom Edition every Monday between 4:00 am and 5:00 am ET. Educational materials for the episodes are available at CNN.com/EDUCATION. Please note that CNN Classroom Edition may be pre-empted at any time for coverage of breaking news.\n\n Week of June 4\n1. Gerald Ford 2. Iraq 3. Steve Irwin 4. Virginia Tech 5. Democratic 6. Watergate 7. Iran 8. Saddam Hussein 9. North Korea 10. Nancy PelosiAccess this week's Newsquiz here!\n\n\n\n\n \nCNN Student News is a 10-minute, commercial-free news program that airs on CNN Headline News at 3:12 a.m. EST as well as on CNN.com/EDUCATION. Created by a team of journalists and educators, the program provides the top stories of the day, segments that encourage student participation, and in-depth special reports. In addition, CNN Student News provides free curriculum at CNN.com/EDUCATION to accompany each program's content. CNN Student News, along with CNN Presents: Classroom Edition, is Turner Broadcasting's contribution to Cable in the Classroom.\n Forward this to a friend\nYou have received this email because you have signed up to receive the CNNStudent News newsletter. Click here to unsubscribeEdit your profile here  \n"}