{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Confirmation # 469 \" <q8gdw9y7j@ventshamble.com>", "subject": "Final Attempt : You've Been Awarded 4 Free Nights In Cancun ", "body": "\n\n\n   \n<!--The four-city push comes as the        FBI is expected to report a 1.3 percent rise in violent crime nationwide in 2006 — an increase for the second straight year.\n\nAt the same time, a new internal Justice report rapped crime-busting task forces for failing to coordinate efforts and potentially endangering agents' lives.\n\n\"Each of these cities has seen an unacceptable increase in homicides or other violent crimes,\" Attorney General Alberto Gonzales told employees at the Washington headquarters of the Bureau of Alcohol, Tobacco, Firearms and Explosives. \"Authorities in each have come forward and asked for our help.\"\n\nDefying critics who have demanded his resignation over the firings of U.S. attorneys, Gonzales said he would spend the final 18 months of his tenure \"in a sprint\" to curb violent crime.\n\nThe influx of agents brings the number of ATF Violent Crime Impact Teams, which first deployed three years ago, to 29 cities. The FBI is also adding to its more than 180 Safe Streets Task Forces by sending one to Orlando, which Gonzales said has been plagued by gang violence.\n\nOrlando police spokeswoman Barbara Jones said the department \"welcomes any additional federal support in our efforts to combat violent crime.\"\n\nNo additional funds or grants are expected to be funneled to communities to bolster their own law enforcement efforts, Justice officials said. Gonzales also called anew for new laws to strengthen penalties against criminals, including imposing mandatory minimum sentences on federal convicts.\n\n--!>   This advertisement is brought to you by Experience Sunset Resorts. To discontinue future offers,click here or write to Experience Sunset Resorts, 3300 W Lake Mary Blvd, Ste 300, Lake Mary, FL 32746.\n\n\n\n\n\n"}