{"category": "spam", "to_address": "<Undisclosed-Recipient:;>", "from_address": "\"Isa.W\" <aitech.sandy@gmail.com>", "subject": "Free HDTV With No Monthly Fee!", "body": "\n\n\n\n\n\n\n\n\n \nThe email contains an \r\nadvertisement.\nFor subscription changes, see the bottom of this \r\nmessage.\n \nDear AITech customer:\n \nHow about watching HDTV on your \r\nNotebook and Desktop computer without a monthly fee from your satellite or cable \r\nHDTV providers?\n \nBetter yet, you don’t even need to \r\nbuy an expensive HDTV set! \n \nJust plug in AITech HDTV USB and the \r\nHDTV antenna and you are ready to enjoy dazzling High-Definition TV programming. \r\nIt works up to the true HD 1080i resolution. The included software allows you to \r\nrecord the HDTV programming on your PC and to watch it any time you like. This \r\nis truly a device that can turn your laptop into a walking media center.  \n \n   \n \nPC magazine (December 5, 2006 issue) \r\nhas an extensive article on how to get HDTV on your computer. It uses the \r\ninternal HDTV tuner card on a PCI bus. Our product is even better. No messy \r\ninternal installation which requires you to unplug everything and open up your \r\nPC, AITech HDTV USB plugs right into the USB port for ultra easy installations. \r\n\n \nCelebrating our \r\n20th anniversary this year, AITech has \r\nbeen the world leader in PC multimedia accessories and applications for over 19 \r\nyears. We are an USA company \r\nbased in Silicon Valley, \r\nCalifornia. Our products are well \r\nrespected and our support is right here in the USA, too. We are \r\noffering the Buy Direct and Save discount by clicking this link www.aitechusa.com.\n \n \nStart enjoying 1080i HDTV on your PC \r\nwith this simple and effective product from AITech. This is a great gift item \r\nfor the Tech person who “has everything” already. He or she will be pleasantly \r\nsurprised with this great ultra-portable device. \n \n \n \n \nIn addition to your option \r\nof buying from AITech online \r\ne-store, you can also purchase our \r\nproducts at \n \n    \n \n \n \nBest \r\nRegards,\n \nIsabelle \r\nWu\nInternet Sales \r\nManager\nAITech International \r\nCorporation\na Silicon-Valley \r\nCompany in U.S.A \n408-991-9699 ext. \r\n504\nisabelle@aitechusa.com\nwww.aitechusa.com\n \nThis is an advertisement sent by a contract-marketing \r\ncompany.\nIf you are not interested in receiving future \r\nadvertisement from us, please click here\n \n"}