{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] The Nation: Thaskin Linked to US Criticism of Government", "body": "http://nationmultimedia.com/2007/04/30/national/national_30033014.php\n\nPUBLIC-RELATIONS BATTLE: Thaksin linked to US criticism of government\nDemocrat calls for swift response to article by adviser to ousted PM's\nlobby firm\n\nThe Nation\nApril 30, 2007\n\nA top Democrat yesterday urged the government to respond swiftly to what\nhe described as a coordinated attempt to discredit Thailand in the\nUnited States that is being orchestrated by former premier Thaksin\nShinawatra.\n\nKorbsak Sabhavasu, a member of the Democrat Party's executive board, was\nresponding to an opinion piece by Ken Adelman - a former US ambassador\nto the United Nations and an adviser to Edelman Public Relations - in\nthe Washington Times on Friday.\n\nThe article blasts the Thai government over its patent dispute with US\ndrug firms.\n\n\"We've long regarded Thailand as a fine little country,\" Adelman wrote\nin the article that accuses Thailand's military of trying to steal US\nintellectual property (IP).\n\nThailand now belongs to what he calls \"the axis of IP evil\".\n\nKorbsak said the tone of Adelman's article made it apparent that he was\ntrying to discredit the government on behalf of Thaksin, although\nAdelman signed the article in his capacity as director of USA for\nInnovation, a group that lobbies for US pharmaceutical firms.\n\nEdelman PR was hired by Thaksin earlier this year to launch a public\nrelations campaign to help him return to the Kingdom, Korbsak noted.\n\nThe Chicago-based firm also represents Abbott Laboratories, which is\ninvolved in a patent dispute with Thailand over its life-saving Aids\ndrug Kaletra.\n\nAdelman's article attacks the Thai government over its capital controls\nas well as the drug patent row, Korbsak said.\n\nHe said the article written on behalf of USA for Innovation sounded like\nit was actually written by Edelman on behalf of its client.\n\nThe website for USA for Innovation advises visitors to \"tell President\nBush to stand up to Thailand's military\".\n\nUSA for Innovation also turned to YouTube last week to \"release a\nmessage to the people of Thailand\". It claimed that the video-sharing\nsite was blocked in Thailand for criticising the government.\n\nKorbsak said he suspected Adelman, Edelman and USA for Innovation were\ncoordinating attacks against the Thai government on behalf of Thaksin.\n\nThe Public Health Ministry is negotiating with Abbott so there is no\nneed for other people to interfere, Korbsak added.\n\nAdelman's article also likens the Thai government to the Burmese junta\nbecause it increased the military budget by US$1.1 billion (Bt36.12\nbillion), Korbsak said.\n\nHe urged the government, the Foreign Ministry and the Council for\nNational Security to respond swiftly to this attempt to discredit Thailand.\n\nAdelman is the high-profile neoconservative pundit who famously forecast\nthat the invasion of Iraq would be a \"cakewalk\" and derided the war's\ncritics. He was accused of hypocrisy when he subsequently switched sides\nand blamed Bush for the debacle.\n\n\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}