{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Guillermo Trejo\" <nexcanstagewod@canstage.com>", "subject": "Join the thousands of people who got slim", "body": "\nPounds down, mood up\n\n\n\n\n\n\nAnatrim – The very up-to-date and most delighting product for over-weight people is now readily available – As seen on CNN.\n\n\nCan you hold in your memory all the situations when you told yourself you would do anything for being delivered from this quickly growing pounds of fat? Happily, now no big sacrifice is necessary. With Anatrim, the earth-shaking pound-melting mixture, you can get naturally health lifestyle and become really slimmer. Just look at what our customers say!\n\n\n\n\"It’s quite difficult to acknowledge it but I was an awful food addict. \n\n\nI greedily ate all this garbige \n\n\nand was unable to stop. \n\n\n\n\nThis torment finished after I started taking Anatrim! \n\n\nGod,\n\n\n\n\n my inclination to eat constantly vanished, \n\n\nmood increased and I turned to the happiest person 23 pounds in 2.2 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person on the planet!\"\n\n\n\n\n\nVictoria K., Boston\n\n\n\n\n\n\"Since my early childhood I was a weighty boy. \n\n\nIt’s pretty hard to imagine how I hated being mocked at school. \n\n\n\n\nI hated my plumpness and I abhorred myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nIt literally dragged me out of this horror! A plenty of thanks to you, fellows.\"\n\n\n\n\n\nCharley Mock, Colorado\n\n\n\n\n\n\"You know what? Thanks to Anatrim my marriage was happily saved! I got into this circle, depression – more eating – even more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nMy best friend pointed to your web page and I ordered up pack of Anatrim at the time. \n\n\nThe final result was excellent, my appetite came to acceptable level, I was often in a good mood, and, be sure, I became able to tighten my belt on some holes. And you know, the sex became fantastic, too!\"\n\n\n\n\n\nBob\n\n\n\n\n There is a lot of thanks left by happy people taking Anatrim. Don’t you wanna join the tens of thousands of slim women and men and try this all-natural appetite-abating energy increasing product now!\n\n\nDo not decline the chance!\n\n\n\n\n"}