{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Brittany Walsh <vsheets@griffilms.com>", "subject": "Switch ON your penis!", "body": "\n\nTired with your sexual problems? Looking for an effective and cheap solution?\nBuy medications at RX online drug store!\nAbsolutely legal, licensed and CHEAP pills at your choice. Confidential purchase. Instant shipping\nOrder now!\nThe highest quality, cheap prices, instant shipping worldwide, friendly support!\nWith best regards,\nBrittany Walsh\n \n \nKak ia i ozhidal, prezhnee oshchushchenie dejstvitelnosti pobleklo do unyloj Serosti. Tolko li chuvstvo viny zastavilo Preodolet ee ogromnoe rasstoianie mezhdu planetami, chtoby izbavit moih Rodnyh ot neizvestnosti o moej sudbe? Net. On smotrel na Klinok nichego ne vyrazhaiushchim vzgliadom. PEREKRESTOK SMERTI Etot rajon otlichalsia ot zabroshennyh kvartalov, cherez kotorye ia proshel v Samom nachale svoego znakomstva s Gorodom, tolko tem, chto zasteklennye okna Koe-gde byli zavesheny iznutri triapem, chto pridavalo im somnitelno zhiloj Vid. \nTy menia ogorchaesh, Dos, posetoval ia, ottiagivaia vremia, razve ty Uzhe ne hochesh vyslushat moiu istoriiu ob imevshih mesto sobytiiah v Giblyh Zemliah? Dos snova ne obratil na moi slova ni malejshego vnimaniia. Zakonchilo svoe sushchestvovanie Vmeste s Prokoldom. Do Gilsveri vnezapno doshlo, chto vnutrennim zreniem on vidit lish plotnuiu Serebristuiu auru neznakomca, vernee, ee kontur vokrug tela, no ne chuvstvuet ego Samogo. Nesmotria na tridcatimetrovyj prostor dna, menia ne Ostavlialo oshchushchenie, chto ia popal v nebolshoe zamknutoe pomeshchenie, potomu chto ia ne Oshchushchal vnutrennim vospriiatiem svoih sputnikov, hotia oni byli riadom. Kogda-nibud etot Volshebnyj Zver snova vdovol naguliaetsia po zvezdnym lesam i ravninam i po Zavedennomu raz i navsegda poriadku ustroit ocherednoj cikl otdyha eshche na Kakoj-nibud planete. Sledovalo podumat, na kakuiu kletku postavit etu novuiu figuru. A vperedi nih, slovno Vzdernutoe v atakuiushchuiu poziciiu kope, neslas z!\nhguchaia issushaiushchaia zloba. K pristani napravlialsia Gront. \nKak liubaia kiberneticheskaia sistema, Ferma naverniaka zapomnila adres Perepravki poslednego klienta, i vriad li ej sostavit trud dostavit menia v To zhe mesto. Prosto shevelni Myslishkoj i otpusti etalonchiki na moj schet. Ia Sovsem zabyl o nem, no pochemu-to ne slishkom byl udivlen, obnaruzhiv ego Zdes. Pochti kak ia. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}