{"category": "spam", "to_address": "<ktwarwic@flax24.uwaterloo.ca>", "from_address": "\"The Bull Report\" <news@thebullreport.com>", "subject": "SSPE Capitalizing on the Fastest Growing Sport in America", "body": "    To view this email as a web page, go    here.     \n\n\n\nThe Bull ReportMay 29th, 2007If you are not familiar with a Mixed Martial Arts (MMA) or cage fighting, you soon will be. Combining the skill and authenticity of professional boxing with the hype and sizzle of pro wrestling, this once obscure sport is now spawning superstar athletes and record-breaking events that led Newsweek Magazine to call MMA “the fastest growing sport in America.\nSaturday night, millions watched UFC 71 featuring a title bout between reigning Light-Heavyweight Champion Chuck “The Iceman” Liddell and Quinton “Rampage” Jackson.This event along with the success of shows such as The Ultimate Fighter further substantiate that MMA (Mixed Martial Arts) is here to stay, and growing like wildfire. \nWhile the UFC dominates the current market, other leagues have shown significant promise as more space is a must for this growing phenomenon.  The IFL (OTCBB: IFLI) recently went public and skyrocketed to $17.00 a share in January of this year.And, while the UFC remains private, a new up-and-comer has recently garnered the attention of the OTC exchange.\nLast Friday, I told everyone to put Sun Sports and Entertainment, Inc. (OTCBB:  SSPE) on your radar.  Friday, SSPE went on to trade 8,309,038 while traveling from $.09 to a high of $.22 and closed at $.21.SSPE recently entered the MMA arena, and the timing couldn’t be better.  SSPE has been involved in the sports and entertainment business for more than 25 years, and has developed events for the NFL, NBA, NHL, Major League Baseball, the PGA and World Cup Soccer.\nSSPE now looks to capitalize on the attention that MMA/Cage Fighting is garnering. SSPE offers the opportunity to get in on the ground-floor of this MMA phenomenon that is becoming so popular and attracting the much sought after 18-34 male demographic.\nRead the full report on SSPERead the full disclaimer Click here\n\n\n\n\n\n                                    This email was sent to:  ktwarwic@flax24.uwaterloo.ca\n\n\n\n\n                                                            This email was sent by: The Bull Report                                                                                                              \n                                                            1846 rosemeade 104 dallas, TX 75007 USA \n                                                            \n\n\n          \n                                    We respect your right to privacy - view our policy\n\n\n\n\n\n\n\n\n\nManage Subscriptions | \n                                    Update Profile | \n                                    One-Click Unsubscribe\n\n\n\n\n\n"}