{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 9, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESFailing Levees Spur Major Missouri Floods\nAt least 20 levees have been overtopped as flood waters make their way down Missouri streams and rivers, flowing over farmland\n                        and downtown streets. Hundreds of homes have been flooded, their residents evacuated, in the worst flooding since 1993. More...Watch: Rising Water Threatens Town\n• Wildfire Threatens L.A. Landmarks\n                     \t\t\t\t\t| Watch• White House Vows Another Iraq Veto• Subtropical Storm Forms Off Atlantic CoastU.S.Fort Dix Plot Called \"New\" Form Of Terror\nSix foreign-born Muslims were arrested and accused of plotting to massacre scores of U.S. soldiers at Fort Dix in New Jersey.\n                        An FBI agent said the arrests display a \"brand-new form of terrorism,\" involving smaller, more loosely defined groups. More...Watch: Fort Dix Terror Plot Foiled\n• Failing Levees Spur Major Missouri Floods\n                     \t\t\t\t\t| Watch• Wildfire Threatens L.A. Landmarks\n                     \t\t\t\t\t| Watch• Vegan Couple Gets Life For Child's Death• More StoriesWorldMexico City Politicians In Hot Holy Water\nPope Benedict XVI says he supports excommunication for politicians who backed legalized abortion recently. The pontiff made\n                        the remarks on a plane en route to Brazil for his first pilgrimage to Latin America in two years as head of the Church. More...\n• Cheney Pushing Reconciliation In Iraq\n                     \t\t\t\t\t| Watch• Afghan: 21 Civilians Killed In Air Strike• Brit Convicted Of Leaking Secret Iraq Memo• More StoriesPoliticsWhite House Vows Another Iraq Veto\nThe White House said President Bush would veto the Democrats' latest version of the Iraq war funding bill. The measure would\n                        provide funds for the war only through July, then give Congress the option to cut off money if conditions do not improve. More...\n• Obama Gaffe: \"10,000\" Died In Kan. Tornado• Thompson Campaign Slowly Taking Shape\n                     \t\t\t\t\t| Watch• House Democrats Pitch New Iraq Plan\n                     \t\t\t\t\t| Watch• More StoriesHealthChina Makes Arrests In Pet Food Case\nChina announced that authorities have detained managers from two companies linked to contaminated pet food that killed pets\n                        in the U.S. A top government drug regulator is also about to go on trial, as China promises to boost food and drug safety. More...\n• Women Suffer In Silence With ADHD• Study: Baby Aspirin Best For Heart• Clinton Group Makes Cheap AIDS Drug Deal• More StoriesSciTechComcast Unveils Super-Fast Modem\nComcast Corp. dazzled a cable industry audience, showing off for the first time in public new technology that enabled a data\n                        download speed of 150 megabits per second, or roughly 25 times faster than today's standard cable modems. More...\n• Subtropical Storm Forms Off Atlantic Coast• Scientists Plan \"Encyclopedia Of Life\"\n                     \t\t\t\t\t| Watch• Cutting Edge Kitchen, Bath Products\n                     \t\t\t\t\t| Watch• More StoriesBusiness\"Trigger Lists\" Spur Privacy Worries\nMore mortgage applicants and holders are being barraged by calls from prospective lenders after credit bureaus sell info on\n                        them to a slew of those would-be lenders. Mark Strassmann's report includes word on how to stop the calls. More...Watch: Lenders Target Home Buyers\n• Fed Expected To Keep Interest Rates Static• Comcast Unveils Super-Fast Modem• Warner Music's Losses Widen• More StoriesEntertainmentO.J. Tossed From Steakhouse On Derby Eve\nThe owner of an upscale steakhouse in Louisville said he asked O.J. Simpson to leave his restaurant the night before the Kentucky\n                        Derby because he is sickened by the attention Simpson still attracts. More...\n• Queen Wraps Up Visit With Toast To U.S.\n                     \t\t\t\t\t| Watch• Billy Ray Cyrus Booted From \"Dancing\"• \"Free Paris Hilton!\" Petition Begs\n                     \t\t\t\t\t| Watch• More StoriesOpinionElizabeth II And George II\nGuess who's coming to a state dinner? It wasn't special contributor Lloyd Garver, so he speculates on what he might\n                        have overheard had he been seated near America's favorite monarch. More...\n• Why '08 Will Belong To The Democrats\n                     \t\t\t\t\t| Watch• Buying Into The Macho Myth\n                     \t\t\t\t\t| Watch• Sarkozy Won't Be Bush's French Poodle\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Money: \"Trigger Lists\" Spur Privacy Worries\nMore mortgage applicants and holders are being barraged by calls from prospective lenders after credit bureaus sell info on\n                        them to a slew of those would-be lenders. Mark Strassmann's report includes word on how to stop the calls. More...Watch: Lenders Target Home Buyers\n• EARLY SHOW: Cutting Edge Kitchen, Bath Products\n                     \t\t\t\t\t| Watch• EARLY SHOW: Women Suffer In Silence With ADHD• EARLY SHOW: Meet The \"Jakes\"\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nHappy To Be Alive In KansasStories of heroism are emerging in Greensburg, Kan. as residents of the town return to see what is left of their lives. Hari\n                                    Sreenivasan met some of the survivors.\nTOP VIDEOS\nWeapons Amassed In Terror Plot\nRising Water Threatens Town\nParis Won't Go To Jail Quietly\nGlamour's Search For 'Jake'\nWildfire Burns Hollywood Hills\nBrushfires Plague Florida\nLenders Target Home Buyers\nBush To Tour Devastated Kansas\nSenator's Secret Mission\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesDoes fiery CNN anchor Lou Dobbs consider himself a journalist? Lesley Stahl finds out, Sunday, 7 p.m. ET/PT.48 Hours!\n  Mystery\nPower, Passion And Poison:An ambitious politician meets a suspicious death. Troy Roberts reports, Saturday at 10\n                           p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}