{"category": "ham", "to_address": "Sugar List <sugar@laptop.org>", "from_address": "Don Hopkins <dhopkins@DonHopkins.com>", "subject": "[sugar] Launching and debugging activities under gdb", "body": "It would be useful to be able to run activities from a command line, so \nyou can launch and debug them under gdb.\nI looked in /proc/ to figure out the command line and \nenvironment that were being executed to launch an activity, and I typed \nthe same thing into the shell to launch it by hand.\nThe activity started and ran without any errors, but no window showed up.\nOf course I can attach gdb to an activity that's already running, but \nall the interesting bugs happen while the activity is starting up, and I \ncan't type fast enough to catch it.\n\nWhat else do I need to do, in order to get an activity to launch from \nthe command line or gdb?\nIs dbus passing in some one-time environment variables, or setting up a \nrendezvous that's not set up when I run an activity from the command line?\nIs there some way I can invoke an activity manually from Python?\n\nAlso, it would be great to be able to turn off the stdout/stderr \nredirection so I get all the stack dumps, prints and debug messages \ndumped out to the debugger window!\nThe way some error messages go into shell.log and others into Read.log \n(but no stack traces!) make it very hard to debug and figure out what \norder things happened in.\nDoing a tail -f of the log files gets confused when the files get \ntruncated/removed, so I have to restart the tail each time I start the \napplication. (The inode number of shell.log stays the same, but Read.log \ngets removed each time I restart Sugar, so the inode number changes and \ntail loses track of the log file.)\n\nAnother thing that would make debugging easier:\nDoes anyone know of a handy-dandy off-the-shelf Python command line \ntelnet server that I can run, so I can telnet into my application after \nit launches and meddle around with it Python?\n\nThanks for any advice you can share to make debugging sugar applications \neasier!\n\n    -Don\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}