{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Are you addicted to your PC?  Caught in the Web, a new series beginning tonight on the CBS EVENING NEWS WITH KATIE COURIC", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n \n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening \n            News | 48 Hours | 60 Minutes | The Saturday Early \n            Show | CBS Sunday \n            Morning | Face The \n            Nation\n\n\n\n\n(CBS) QUOTE OF THE DAY\n“The only way to make a man trustworthy is to trust him.” - \n      Henry Stimson \n\nTODAY’S TRIVIA The longest name in the Bible is \n      Mahershalalhashbaz (Isaiah 8:1). \n\nTONIGHT ON THE CBS \n      EVENING NEWS Here's an early look \n      at what we are working on from Anchor and Managing Editor, Katie Couric \n      Hi everyone, The scourge of terrorism got worse last \n      year. A new report says attacks worldwide jumped 25 percent — and that's \n      not all. David Martin at the Pentagon will have the latest on what \n      the report means for the war on terror. A victory in that war was \n      won in Britain today. Five defendants were found guilty of plotting a \n      massive terrorist attack. They were discovered during one of the country’s \n      most intensive surveillance operations ever. Sheila MacVicar will \n      have the latest. A woman known as the D.C. Madam has everyone \n      talking inside the Beltway and beyond. She says she's not naming names — \n      exactly. Instead, she has handed over her phone records, which reportedly \n      list prominent individuals — among them executives, the head of a \n      conservative think-tank and an administration economist — as clients. \n      Bob Orr will have the story. Venezuelan president Hugo \n      Chavez claimed today that Cuban president Fidel Castro is back \"in charge\" \n      after being out of the public eye for more than nine months while \n      recovering from intestinal surgery. But is the 80-year-old Castro well \n      enough to lead? Lara Logan, our chief foreign correspondent, will \n      report from Cuba. We will also take you to Shandong Province, \n      China, known as the world’s salad bowl — it exports more produce than \n      anywhere else on the planet. It's an open secret that manufacturers there \n      add melamine to pet food to boost apparent protein content — a fact that \n      has brought the entire region under intense international scrutiny. Can \n      Shandong convince the world its products are safe to eat? Barry \n      Petersen will report. Had you heard of melamine before it \n      tainted pet food? The chemical can to be used to coat tabletops, fertilize \n      crops and even masquerades as a protein. Nancy Cordes will have \n      more. Cigarettes and drugs can be addictive, but what about your \n      PC? Daniel Sieberg will begin our series \"Caught in the Web\" with \n      the story of a family torn apart by computer-game addiction. \n      Finally, our chief White House correspondent Jim Axelrod \n      will report on White House press secretary Tony Snow’s return to work five \n      weeks after doctors discovered a recurrence of his cancer. Snow said he \n      feels \"unbelievably lucky and unbelievably blessed.\" I hope you’ll \n      join us. Katie For more on two of the stories noted \n      above, please click on the following links: D.C. Madam \n      \"Sorry\" For Outing Client Click Here Pet Food Toxin Said \n      To Be Common In China Click Here Here's an early look \n      at one of the stories we are working on for tomorrow's broadcast... A \n      STAGGERING number of people are addicted to Internet pornography. Part 2 \n      of our series, \"caught in the web\" shows you where MANY are going for \n      help. That story and more, Tuesday night on THE CBS EVENING NEWS. \n      If you would like more information on any of these stories or the \n      broadcast, please click on the following address and e-mail us: \n      evening@cbsnews.com \n\nTONIGHT ON DAVID LETTERMAN Dave sits down with \n      actress Kirsten Dunst AND impressionist Rob Magnotti… Plus, musical guests \n      Dinosaur Jr! \n\nTUESDAY MORNING ON THE EARLY SHOW Harry Smith, \n      Hannah Storm, and Russ Mitchell anchor THE EARLY \n      SHOW from New York. Dave Price will \n      bring us the weather. Julie Chen is off. Along with the \n      top news of the day, we will also have the following stories:\nGEORGE TENET AT THE CENTER OF THE STORM: In his new book, \n      At the Center of the Storm, former CIA director George Tenet \n      reveals his feelings behind the way the Bush administration handled the \n      war in Iraq. He says that he and other CIA officials were “betrayed”. In \n      an exclusive interview on 60 MINUTES \n      this Sunday, Tenet told Scott Pelley that the White House misused \n      the phrase “slam dunk,” attributing those two words as justification to go \n      to war. Tuesday morning, Tenet will join us with more on his book and how \n      he feels now about the Bush administration. CSI MIAMI BEHIND \n      THE SCENES: On Monday night's CSI:Miami, one of the Crime Scene \n      Investigators is forced to face his vices, with some alarming \n      repercussion. Two of the stars of the hit show, David Caruso and Jonathan \n      Togo, will tell us about the consequences of Ryan's actions. EARLY \n      SHOW National Correspondent Tracy Smith \n      will have all the details. DAVE RAMSEY VIEWER LETTERS: YOUR \n      FINANCIAL QUESTIONS ANSWERED: When it comes to personal finances, a \n      lot of people have a lot of questions. How can you pay off your credit car \n      debt? What about investing your pension to maximize your money? And, how \n      can stay-at-home parents achieve financial freedom – is it feasible? We \n      decided to call on our financial guru Dave Ramsey to answer a \n      handful of those questions Tuesday morning. ALEX’S LEMONADE \n      STAND: You may remember the story of Alexandra Scott: the brave little \n      girl from Pennsylvania who decided to fight childhood cancer by selling \n      lemonade. It's been seven years since Alex set up her first stand...and \n      almost three years since she lost her own battle with cancer. But the \n      movement Alex Scott started continues to grow. EARLY \n      SHOW National Correspondent Tracy Smith \n      has her story and Alex’s parents Liz and Jay, and her brothers Patrick, \n      Eddie and Joey, will join us Tuesday morning to give us an update on the \n      amazing work they are continuing to do in Alex's honor. CHUCK \n      BARRIS ON THE BIG QUESTION: In his new novel, game show host turned \n      writer Chuck Barris paints a vivid portrait of a daring new game show. In \n      The Big Question, the plot revolves around an idea for a new \n      reality show, in which contestants have the chance to win $100 million \n      dollars or be executed on live television. Sound over the top? The book’s \n      central character doesn’t think so. And, not surprisingly, the premise of \n      the show within the book is not the most shocking aspect of the story, but \n      rather what gives shock value are the lives of three potential contestants \n      who all eager to change their fates. If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: earlyshow@cbs.com\n\n\n\nTO SUBSCRIBEClick here to subscribe to \n      the Inside Scoop.TO UNSUBSCRIBEUnsubscribe information \n      is included in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, \n      click here.Contact: Email Administrator, \n      CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n      10019Help | Advertise | Terms of \n      Service | Privacy \n      Statement©MMVII, CBS \n      Interactive Inc. All Rights Reserved. \n\n"}