{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: \"You Just Hope He's OK.\"", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe \n      Public Eye Chat With Sharyn \n      Alfonsi\"I think the thing you end up doing is you end up kind of putting \n      your head down and really just trying to stay focused on the story. And \n      when you take that moment later and you try and reflect on it, it hits \n      you. It really does hit you. And I know that after Columbine, I know that \n      after 9/11, that there is this time that you start to process what you've \n      seen, you start to think about the people you've talked to. Even now, \n      being back in New York, there's a couple of students that we talked to \n      that you want to reach out to, just to see how they're doing. You feel \n      like you leave a lot of those ends untied. I think that's the hardest \n      part.\"[+ Read More]\n\n\n\nMark Knoller On What Bill Moyers Got \n      Wrong\"To hear Bill \n      Moyers tell it last evening on his PBS program 'Buying The War,' the White House press corps was a \n      willing participant in its own deception about the President’s case for \n      war in Iraq. He portrays us as easily-manipulated stooges on \n      bended-knee to the President and his top aides. Now, I’m the first \n      to concede there are plenty of good reasons to criticize the White House \n      Press. We’re an irascible and unlikable bunch. I’m one of us and I don’t \n      like us very much. But the point made by Bill Moyers at the start of his \n      program last night is just off base.\"[+ Read More]\n\n\n\nRules \n      Of EngagementThis morning, an email landed in my inbox with \n      the usage guidelines for tonight's MSNBC-sponsored debate between the \n      Democratic presidential candidates. These are the rules that non-NBC media \n      outlets need to follow if they want to use any of video of the event. The \n      rules are fairly standard of the restrictions that media outlets often \n      apply when it comes to content like this, and they are nothing if not \n      thorough. Jeff Jarvis argues that NBC is claiming \"the \n      right to own the democratic discussion in this country.\" Check the rules out here.[+ Read More]\n\n\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nThe \n      Public Eye Chat With…Andrew Cohen\n \nThe \n      Public Eye Chat With…Jennifer Siebens\n \nThe Public Eye \n      Chat With…Allen Pizzey\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}