{"category": "ham", "to_address": "Chris Linton <connect.chris@gmail.com>", "from_address": "Thomas Lumley <tlumley@u.washington.edu>", "subject": "Re: [R] importing .dta files", "body": "On Fri, 15 Jun 2007, Chris Linton wrote:\n\n> I'm trying to read in a Stata file but I've never used this function (\n> read.dta).  It's the only one that seems to come close to working, but I\n> keep getting this error:\n>\n>> data<-read.dta(\"C:/Documents and\n> Settings/Chris/Desktop/S4412/catestscores.dta\")\n> Error in read.dta(\"C:/Documents and\n> Settings/Chris/Desktop/S4412/catestscores.dta\",  :\n>        a binary read error occurred\n>\n>\n> There's little chance the data is corrupt considering it came from my\n> professor and he used the data earlier.  So, either I'm doing something\n> wrong or R just doesn't like to read in Stata files.  If it's a problem with\n> R, how can I easily convert the file without purchasing Stata?\n>\n\nR does read Stata files -- I use this facility frequently.  It's hard to \ntell why it isn't working in your case, since we don't know anything about \nthe file, your version of R, version of Stata, etc (we can guess you are \non windows from the file name).\n\nThe error message implies that the file was found, and that it started \nwith the right sequence of bytes to be a Stata .dta file, but that \nsomething (probably the end of the file) prevented R from reading what it \nwas expecting to read.\n\nThis is why (in the absence of any further information) the natural \nsuspicion is that the file is corrupt.  It is possible that we have \nmisunderstood some unusual possibility in the Stata file format -- this \nhas happened once before -- but it is fairly well documented.  In any \ncase, there is not much that can be done without more information.\n\n\n \t-thomas\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}