{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWEDNESDAY 11 APRIL 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello, \n\n\n\n\t\t\t\t\t\tAnd today's Quote for Today: \n\n\n\"My wife is starting to refer to me as her first husband. It's a little disturbing\" - Barack Obama, would-be Democrat candidate for the US Presidency, on how his campaign is keeping him away from home.\n\n\nIn tonight's programme:\n\n\nETHICAL MAN IS COMPOST \n\n\nNewsnight has decided to kill off its Ethical Man. After a year of trying to live with due consideration to his impact on the planet, Justin Rowlatt is moving on to other challenges. \n\n\nBut the serious point behind the project was to try to gauge what difference an individual can make to the environment. \n\n\nJustin will conclude his series of reports and will join in the debate with those who can make an even bigger difference, including the Environment Secretary David Miliband. \n\n\nClick here to post your comments\n\n\nEthical end - trailer\n\n\nTHE MoD AND IRAN \n\n\nThe Defence Secretary Des Browne has admitted errors were made in the handling of the Iranian hostages. \n\n\nWe'll hear from a Lib Dem spokesman whose also a former RAF officer on how he sees the difficulties of adapting the military machine to the demands of 24 hour news. \n\n\nAND FINALLY\n\n\nToday's Joke Fit For an Eleven Year Old comes from Newsnight viewer Zombie: \n\n\nAn English doctor is being shown around a Scottish hospital. At the end of his visit, he is shown into a ward with a number of patients who show no obvious signs of injury. He goes to examine the first patient he sees, and the man proclaims:\n\n\n\"Fair fa' yer honest, sonsie face,\n\nGreat chieftain o' the puddin' race!\"\n\n\nThe English doctor, somewhat taken aback, goes to the next patient, and immediately the patient launches into:\n\n\n\"Some hae meat and canna eat,\n\nAnd some wad eat that want it.\"\n\n\nThis continues with the next patient:\n\n\n\"Wee sleekit cow'rin tim'rous beastie,\n\nO what a panic's in thy breastie!\"\n\n\n\"Well,\" the English doctor mutters to his Scottish colleague, \"I see you saved the psychiatric ward for the last.\"\n\n\n\"Oh no,\" the Scottish doctor corrected him, \"this is the serious Burns unit.\"  \n\n\nNewsnight is at 10.30 on BBC2.\n\n\nGavin \n\n\nEthical Man's Website\n\nCLICK HERE\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nTHAI DRUGS MOVE\n\n\t\t\t\t\t\t\tThe Thai government has stunned the US after declaring war on big pharmaceutical companies.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}