{"category": "ham", "to_address": "cc-bizcom@lists.ibiblio.org", "from_address": "Marshall Van Alstyne <marshall@MIT.EDU>", "subject": "Re: [Cc-bizcom] an alternate licensing option where the 'community'\n determines value-not the contributors", "body": "\n\nRyan, here are several thoughts based on the questions you raised. \nApologies for a delay, I've been preparing a tenure package and that has\ndominated all other tasks.    Your set of issues around\nNonCommercial and Commercial licenses raise multiple follow up\nideas!\nAt 03:16 PM 4/17/2007, you wrote:\nLet’s say I make a derivative\nwork using someone else work that’s under the “NonCommericial” license\noption and I want to commercialize it to make money.  Under this\nlicense I have to approach the original licensor to work out a commercial\nlicensing agreement to establish payout percentages.  I run the\nrisk, however, that the original licensor will not want to come to a fair\nand balanced assessment of each other’s contribution.  With this\npotential risk loaming in the future, I am less likely to even start a\nderivative work in the first place­there’s less initial incentive. \n\nI think you've nailed one of the biggest problems.  In fact, it\nseems there are related two sub-problems.  One is hold-up from a\nsingle owner -- in this case the (c) holder -- who will want to negotiate\nfor a chunk of value.  The other is the cleverness of the idea can\nbe lost if you try to negotiate and accidentally disclose it.\nEither way, I agree that these 2 kinds of risk discourage a person from\nmaking any kind of investment beforehand.\nWhat if, however, there was a\nNew Licensing option­somewhere between ‘Attribution Non-commercial’ and\n‘Attribution No Derivatives’­that stated that you are free to pursue\ncommercial gain without consent, but if the derivative work marks money,\nthe payout percentages are assessed by the community and not left up to\nthe individuals and their lawyers to determine?  \nOne possibility that I like a lot is to use a default menu.  That\nis, suppose the license has an offer of the following form:\nIf you make $x amount of money, then contribute y% of revenue to the\noriginal work.\nIf you make $(x+d) amount of money, then contribute (y+n)% of revenue to\nthe original work.\netc.\nAlternatively,\nIf you keep your piece closed for x years, then contribute y% of revenue\nto the original work.\nIf you keep your piece closed for (x+d) years, then contribute (y+n)% of\nrevenue to the original work.\netc.\nThis set of default options lets the person writing the derivative work\nchoose based on a fairly clear set of terms.\nSo in other words, under this\nagreement the assessment of value contribution is determined by the\ncommunity and not the individual parties.  In this case I can have a\nlittle more confidence using someone else work initially, knowing that if\nmy derivative work does indeed make money, that the community’s\nassessment will mostly likely grant a fair evaluation. \nThis idea is pretty interesting.  I see at two possible\nconcerns.  (1) Is that there is still some uncertainty over what the\nfinal % will be.  I agree it seems that the \"community,\"\nhowever defined, is likely to be more neutral in assessing value but\nthere is still some lack of clarity beforehand. (2) Have you thought\nabout how large a community you need?  If it's very small, there may\nbe too few voters to establish a meaningful baseline so there might be a\nneed to build the community first.\n \nWhat is the community in this case?  Well that could take many forms\ndepending on the media and/or mode of distribution.  In the music\nindustry, diehard fans could determine, through some type of ranking\nsystem, how each artist should be paid out.  If, however, asking the\npublic to audit contribution becomes too overwhelming, there could be a\npool of editors that get paid to make these assessments.   This\nsystem of editors, however, would have to be anonymous in a sense, to\navoid the possibility of bribery or kickbacks.  An additional\nsafeguarding mechanism could be utilized were the editors in turn rank\neach other.  Editors that show an unusual high level of bias would\nbe flagged by the community of editors and thus facilitate a higher level\nof consistency.\nOverall, this idea sounds quite useful.  A good reputation system\ncan be used to \"rate the rater\" and help ensure integrity in\nthe review process.\nThis \"information revelation\" mechanism looks like it should\nrequire a subsidy i.e. some means of compensating the raters for their\ntime and effort.  If done well, it could be covered out of the\nrevenues generated by the pool of derivative works themselves.\nAnother form of information disclosure mechanism could be to have people\nwho actually download the derivative work themselves state what % of\nvalue the new piece adds.  This is harder to \"fake\" since\nsomeone must actually pay for the good (so if you're going to stuff a\nballot box it's going to be costly).  It's also unbiased because the\nperson doing the buying is not independent of the person doing the\nrating.\n \nAlthough I’m sure there’s ways to establish a fair assessment of value,\nthis licensing system would require a transparency in accounting as\nwell­such that contributors would be assured that all the revenue is\naccounted for.  Transparent accounting might be a tall order, but if\nartists demand it, producers will find a way too oblige. \n\nThis is also an excellent point.  It has long been an established\ntenet of economics that more complete information leads to greater\nefficiency in production.  Such a system should be as transparent as\npossible.\nNote also that it should also align incentives the right way e.g. no one\nshould have a reason to misrepresent their rating, and the raters' votes\nshould correspond closely to the consumers' reasons for buying.\n \nAnyways, Just a little food for thought.  Let me know if there’s any\nmajor hurdles I’m not considering in implementing a system like this…\njust thinking out loud here.\nPersonally, I think the questions you raise are very interesting. \nPlenty of thought munchies here! :-)\n \nIs there any current discussion out there that addresses this idea? \nI could not find any. If you could forward, I’d be much appreciative.\n\nThere is some good discussion on the Free Software Business (fsb)\ndiscussion group but aside from that, I've found very little on this\ntopic.  Thanks for raising some interesting issues.\nMVA\n \n \nThanks  \n \n \n \n \n \n \n \n_______________________________________________\nCc-bizcom mailing list\nCc-bizcom@lists.ibiblio.org\n\nhttp://lists.ibiblio.org/mailman/listinfo/cc-bizcom\n\n\n"}