{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Marlon Grady\" <veqdejanasolutionsxod@dejanasolutions.com>", "subject": "Become fit and happy again", "body": "\nGet your ideal weight with this natural method\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most enchanting lose flesh product is now available – As seen on BBC.\n\n\nDo you retain all the situations when you appeal to yourself to do any thing for being saved from this fastly growing pounds of fat? Happily, now no great offering is necessary. Thanks to Anatrim, the ground-breaking kilos-melting combination of elements, you can achieve healthier life style and a really slender figure. Take a look at what people state!\n\n\n\n\"It’s rather difficult to admit it but I was an awful food addict. \n\n\nI greedily swallowed up all this garbige \n\n\nand just could not stop. \n\n\n\n\nThis misery stopped after I started taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite vanished, \n\n\nspirits increased and I turned to the happiest person in the world 26 pounds in 2.8 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person!\"\n\n\n\n\n\nSilvia D., Washington\n\n\n\n\n\n\"I had weight problems since a boy. \n\n\nYou can't fancy how I hated being derided at school. \n\n\n\n\nI hated my stoutness and I abhorred myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nIt literally pulled me out of this nightmare! The warmest thanks to you, guys.\"\n\n\n\n\n\nSteve Burbon, New York\n\n\n\n\n\n\"Know what? Anatrim preserved my marriage! I got into this circle, depression – eating more – even more depression. My wife was about to leave me as I was turning in overweight psycho. \n\n\nOne my best friend showed me web site and I called for my pack of Anatrim at the same time. \n\n\nThe results were splendid, my appetite came to normal level, I was often in good spirits, and, be sure, I became able to tighten my belt on some holes. And you see, the bed became cool, too!\"\n\n\n\n\n\nFrank\n\n\n\n\n There is a great number of gratitudes left by delighted people trying Anatrim. Don’t you gonna join the tens of thousands of slim buyers and try this natural appetite-reducing power raising product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}