{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Claudia Herndon\" <menedinainpef@edinain.com>", "subject": "Melt away fat easily", "body": "\nJoin the thousands of people who got slim\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most attracting flesh loss product is now readily available – As seen on Oprah.\n\n\nDo you hold in your memory all the cases when you told yourself you would do anything for being delivered from this fastly growing number of kilos? Luckily, now no great price is to be paid. Thanks to Anatrim, the ground-breaking weight-reducing mixture, you can get healthier lifestyle and become really thinner. Have a look at what our customers write!\n\n\n\n\"It’s unbearably difficult to admit it but I was an awful food addict. \n\n\nI ate all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis fatal passion left off after I started course of taking Anatrim! \n\n\nGod,\n\n\n\n\n my appetite disappeared, \n\n\nmood improved and I’m the happiest person on the planet 24 pounds in 2.7 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person on the planet!\"\n\n\n\n\n\nLusia R., San Diego\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nYou can't even fancy how I detested being ridiculed at school. \n\n\n\n\nI abhorred the weight and I detested myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nThis stuff literally pulled me out of this awful nightmare! The warmest thanks to you, guys.\"\n\n\n\n\n\nCharley Mock, Chicago\n\n\n\n\n\n\"You know what? Thanks to Anatrim my marriage was luckily saved! I went into the circle, depression – more eating – even more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nMy best friend pointed at your web page and I ordered up Anatrim as soon as it was possible. \n\n\nThe results I achieved were magnficent, my appetite came to normal level, I was in good spirits oftener, and, of course, I tightened my belt with no regrets. And you know, the bedroom became cool also!\"\n\n\n\n\n\nCharley\n\n\n\n\n There is a lot of thanks happy people leave after trying Anatrim. Don’t you wanna add yourself to the thousands and thousands of slender women and men and take this original appetite-abating energy increasing product now!\n\n\nDo not lose the chance!\n\n\n\n\n"}