{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Lisa Dalton <extrememwf@glenncunningham.com>", "subject": "Explode your orgasm!", "body": "\n\nAre you afraid that she will meet someone who is better than you in bed? \nBuy medications at RX online drug store!\nErectile Dysfunction is one of the most serious problems that a man can get in his life. The best cure nowadays are Viagra and Cialis.\nOur pharmacy\nSwitch on your penis!\nWith best regards,\nLisa Dalton\n \n \nI eshche ia nemnogo zhalel, chto Tak i ne osmelilsia priglasit ee v svoiu kaiutu. I posle etogo ia ne poterpliu nikakih Somnenij ot ostalnyh. U kogo-nibud est pravdopodobnye predpolozheniia, dlia Chego nas nanial chuzhoj? Da plevat, dlia chego on nas nanial! tak zhe na vzvode prorychal Bigman. Ia otvel vzgliad i zadumalsia. \nTy snova spas mne zhizn, tak vovremia podvernuvshis pod Ruku. A vdrug eta korobka radiomaiak, nepreryvno opoveshchaiushchij o nashem Mestonahozhdenii vsiu sheltianskuiu bratiiu? Ia razmahnulsia i izo vseh sil Zapustil kroder daleko v kusty. Pohlopav Obormota po krupu, on snial so steny sedlo i prinialsia prilazhivat ego na shirokuiu Spinu drakha. Vozmozhno, on ne dozhdalsia vsego kakih-to schitannyh dnej, ne Znaiu telo davno okochenelo, no razlozhenie ego ne kosnulos, chto moglo byt Svojstvami dannogo mesta. No vse puteshestvie, do Kruga Prichastiia i obratno, dolzhno zaniat ne bolshe shesti-semi dnej, a dlia menia eto ne Tak uzh mnogo. Uh ty, eto chto zhe poluchaetsia?! Ne Niksard li pribil etogo terha? Nichego sebe. Novichok ne iz sheltian, obladaiushchij empaticheskimi Sposobnostiami. Celitel neopredelenno hmyknul. \nNo kakogo Zla molchit trans?! On chto, nichego ne chuvstvuet?! Celitel. Vazhno, chto on iakoby Sushchestvuet, i ego poiski Mesta ne okonchatsia nikogda, po krajnej mere, poka Sushchestvuet Vselennaia. Skolko vremeni trebuetsia na razgruzku? Nu, esli kak sleduet potoropitsia, to chasa dva. No svoiu sudbu nelzia doveriat emociiam, v chem ia ubedilsia ochen Bystro. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}