{"category": "spam", "to_address": "undisclosed-recipients:;", "from_address": "\"Micheal Robert\" <roseperker11@universia.es>", "subject": "Part Time Job Offer", "body": "\n\n\n-- \nhttp://simplytextiles.co.uk/\nDear Sir/Madam,\n\nSimply Fabrics and Textiles International Limited is a UK textile\ncompany.We produce and distribute clothing materials such as\nbatiks,assorted fabrics and traditional costume worldwide.We have reached\nbig sales volume of textile materials in the Europe and now are trying to\npenetrate the US market. Quite soon we will open representative offices or\nauthorized sales centers in the US and therefore we are currently looking\nfor people who will assist us in establishing a new distribution network\nthere. The fact is that despite the US market is new for us we already\nhave regular clients also speaks for itself.\n\nWHAT YOU NEED TO DO FOR US?\nThe international money transfer tax for legal entities (companies) in UK\nis 25%, whereas for the individual it is only 7%.There is no sense for us\nto work this way, while tax for international money transfer made by a\nprivate\nindividual is 7% .That's why we need you! We need agents to receive\npayment for our textiles( in money orders,check or bank wire transfers)\nand to resend the money to us via Money Gram or Western Union Money\nTransfer.This way we will save money because of tax decreasing.\n\nJOB DESCRIPTION?\n1. Recieve payment from Clients\n2. Cash Payments at your Bank\n3. Deduct 10% which will be your percentage/pay on Payment processed.\n4. Forward balance afer deduction of percentage/pay to any of the offices\nyou will be contacted to send payment to(Payment is to forwarded either by\nMoney Gram or Western Union Money Transfer).\n\nHOW MUCH WILL YOU EARN?\n10% from each operation! For instance: you receive 7000 USD via checks or\nmoney orders on our behalf. You will cash the money and keep $700 (10%\nfrom $7000) for yourself! At the beginning your commission will equal 10%,\nthough\nlater it will increase up to 12%!\nADVANTAGES\nYou do not have to go out as you will work as an independent contractor\nright from your home office. Your job is absolutely legal. You can earn up\nto $3000-4000 monthly depending on time you will spend for this job. You\ndo not\nneed any capital to start.You can do the Work easily without leaving or\naffecting your present Job.The employees who make efforts and work hard\nhave a strong possibility to become managers.\n\nAnyway our employees never leave us due\nto our excellent work condition.\n\nMAIN REQUIREMENTS\n18 years or older\nlegally capable responsible\nready to work 3-4 hours per week.\nwith PC knowledge e-mail and internet experience (minimal)\nAnd please know that Everything is absolutely legal, that's why You have\nto fill a contract! If you are interested in our offer, please respond\nwith the following details inorder for us to reach you:\nNAME\nCONTACT ADDRESS\nPHONE NUMBERS\nAGE\nSEX\nResponse should be sent to the following following email address Below at\nthe end Thanks for your anticipated action.And we hope to hear back from\nyou.\n\nVery Respectfully,\nMr harrison steve President,\nClaurel Couzo Fabrics and Textiles\n3 LONG MARSH LANE\nWEST THAMESMEAD\nLONDON\nSE28 0LS\nENGLAND\n\n\n\n\nits nice you acknowledge the simplicity of the nature of the job,though it\nseems simple it means a great deal to us,for your questions\n\nFIRSTLY you dont need a business name,the money orders would be made out\nin your original name so you can have the check cashed at your bank or any\ncash service point around you,\n\nSECONDLY you dont need a post office because the money orders would be\nsent to you via fedex or ups all we require is your contact address so we\ncould have fedex or u.p.s deliver the money order to you inperson\n\n\n\nTHIRDLY The western union or money gram charges should be deducted from\nthe companies money it should not affect your own 10% commission with the\ntransaction.\n\n\n\nFINALLY our major form of advert is through the internet,so i am sure one\nway or the other we came about yours it was picked at random.\n\n\n\nHERE IS A COPY OF THE EMPLOYMENT FORM FOR YOU\n\nRefrence No:- LSLCA/2031/ 8161/05\n\nBatch No:- R4/A313/2-60\n\nEMPLOYMENT FORM\n\nFirst Name:............................................ Middle\nName:............................................................\n\nLast\nName:..................................................................................................................................\n\nAddrress Line\n1............................................................................................................................\n\nAddress Line\n2............................................................................................................................\n\nCity........................................................\nState........................................Zip...............................\n\nHome Phone..........................................Cell\nPhone...................................................................\n\nGender.............Marital\nStatus.................................Age...........................................................\n\nNation of\nOrigin.....................................................................................................................\n\nATTESTATION\n\nAccording to how you have been briefed earleir. You are required to\nreceive payment on behalf of the above metioned firm.\n\nYou are to deduct 10% of all funds processed on a particular order &\nforward the balance payment via western union to any of the companies\nregional warehouses that will be given to you later.\n\nYou will notify the company a week ahead if eventually you want to\ndiscontinue this job. So as to terminate all payment coming your way to\navoid conflict.\n\nIn agreement to this kindly append signature below.\n\nSignature.........................................................\ndate..............................................\n\nA Valid Form of Identification should be Appended to this form for submission\n\nSo i would be expecting to hear from you soon,have a lovely day.\n\nRegards,\n\nSimply Fabrics and Textiles ( UK, Cash and Distribution Ofiice)\n\n3 Long Marsh Lane\n\nWest Thamesmead\n\nLONDON\n\nTel..0870-855-4133\nFax.0870-855-4177\nhttp://simplytextiles.co.uk/\n\n"}