{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Danial Davidson\" <besfauxsterspod@fauxsters.com>", "subject": "Get out of the obese crowd", "body": "\nA simple and safe way to weigh less\n\n\n\n\n\nAnatrim – The newest and most attracting lose flesh product is now available – As told on ABC\n\n\n\nDid you know that redundant body kilos kill very much people for every new year? We believe that you hate the ugly appearance of people like those and the low status they obviously have in society. \n\nMoreover, you’ve not the will to withstand pressure of your ruinous eating habits. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nHere Anatrim comes, the new product for the elimination of your body’s extra weight. The most astounding thing is that Anatrim improves the quality of your life, repressing your feeling of hunger and giving you joyful spirit. Note what people write to us about this product:\n\n\n\n\n\n\"It is wonderful! \n\n\nI stopped gorging anything close at hand and watching TV continually \n\n\nI became more interested in taking exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I feel fit now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nLinda F., San Diego\n\n\n\n\n\n\n\"Passive weight reducing was of little result to me. I was difficult for me to restrain my ravenous appetite. \n\n\nOne day I heard about Anatrim from my very best friend and I rather liked the information.\n\n\n I had tried to take it, and my wife said to me that I’m not more a weighty man now, 4 months later. \n\n\n25 pounds have gone away and I continue to become slimmer! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nSteve Burbon, Las Vegas\n\n\n\n\n\nAnatrim helps you to understand that you got no such great need for that much food. It raises your mood up, gives you energy, and attacks needless kilos. All thanks to its mighty newly-elaborated formula!!\n\n\n\nFind out more useful information about this excellent product now!\n\n\n\nhttp://www.smergeil.com/?g36974726845756A7E7A666A71746868776670786A69337C7977743366w7rnfzkx\n"}