{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 104", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Gallery owner has eye for 'naive' art, Unusual paintings are\n      shipped from rural Croatia - a delicate art in itself.\n      (Museum Security Network Mailing list)\n   2. Manhunt starts following theft of golden model boat\n      (Museum Security Network Mailing list)\n   3. Les criminels de l'art pris dans le ? Net ?\n      (Museum Security Network Mailing list)\n   4. Profession: chasseurs de criminels de l'art\n      (Museum Security Network Mailing list)\n   5. Currency caper at Bank of Canada leaves cash till short\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Mon, 30 Apr 2007 08:02:47 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Gallery owner has eye for 'naive' art, Unusual\n\tpaintings are shipped from rural Croatia - a delicate art in itself.\nTo: Museum Security Network Mailinglist \nMessage-ID: <46358687.6080703@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nGallery owner has eye for 'naive' art\n\n    Unusual paintings are shipped from rural Croatia - a delicate art in \nitself.\n\nBy PAUL SWIDER\nPublished April 29, 2007\n\nST. PETERSBURG - After six months of flawless operation at his new \ngallery, Jim Nannen's worst business fear came to pass: A shipment of \nfragile glass paintings worth $70, 000 had gone missing somewhere in Europe.\n\n\"Nobody was able to give us a proper answer, \" said Nannen, the owner of \nCroatian Naive Art Gallery on Beach Drive. \"When I went into this \nbusiness, this was my biggest concern.\"\n\nNannen sells and displays artworks painted in reverse on glass. They \ncome from a decades-old tradition of artists, often referred to as \namateur or naive artists, who live in rural border regions of Croatia \nnear Hungary. Because the paintings are relatively rare and delicate and \ncome from a remote part of the world, Nannen was always worried about \ntransferring them from the Croatian countryside to the United States.\n\nThis latest shipment was bundled up April 11 by a FedEx franchise in \nZagreb, the Croatian capital. It was supposed to reach Nannen, as had \nall his previous packages, in about three days. This was the largest and \nmost valuable shipment to date.\n\n\"Once it left Zagreb, it was impossible to find, \" Nannen said.\n\nSome reports had the 400-pound crate in Paris; others in Frankfurt. \nThere were suggestions the package had been stolen, and Interpol called \nthe gallery about its investigations. There was even talk of getting the \nFBI involved. The story was picked up by the Zagreb media.\n\nThen on April 21, Nannen got a call that the package was on its way to \nFedEx headquarters in Memphis, Tenn. When it didn't arrive the next day, \nhe called and learned it hadn't been shipped to Tampa, as expected, but \nwas on its way to Seattle.\n\nFedEx spokesman Steve Barber did not have details about the specific \nshipment but he said the company's systems eventually worked. The \nshipment arrived on April 26. He said he's investigating whether FedEx \nwill offer the gallery a discount for its troubles.\n\nNannen was ill prepared for such international intrigue. He'd spent his \nlife running pet stores, first in Massachusetts and then starting and \ngrowing the Animal House chain here. But he caught the art bug when he \nwent to a Croatian art exhibit in 2000 at the Museum of Fine Arts. He \nwas so captivated by the mood, texture, color and character of the naive \nart that he set about creating a collection.\n\nAs he scoured the Internet for dealers, Nannen learned that the art form \nwas rare in the United States. He visited Croatia for an exhibit there \nand was driven to tour the country, knocking on farmhouse doors \nsearching for the farmer artists. Seeing a business opportunity, he \ndecided to start a U.S. gallery.\n\nThe business now sits on the ground floor of Parkshore Plaza, across \nfrom Straub Park. His pieces range from $300 to $400 for a postcard-size \nwork to $30, 000 for larger pieces.\n\nHe has about 200 paintings on display, but this latest shipment of 67 \nrepresented a significant new addition. \"I was concerned about how I was \ngoing to continue the business, \" he said.\n\nNow that his box has arrived, Nannen said he can sleep again.\n\n\"This is very different from the pet business.\"\n\nIf you go:\nCroatian Naive Art Gallery\n300 Beach Drive NE\n824-2800\n\nhttp://www.sptimes.com/\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Mon, 30 Apr 2007 08:02:57 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Manhunt starts following theft of golden model boat\nTo: Museum Security Network Mailinglist \nMessage-ID: <46358691.5040501@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nManhunt starts following theft of golden model boat\nNAUTICAL HEIST: Police are reviewing surveillance footage that showed a \nman hiding the model boat in a white bag before fleeing the university's \nmuseum\nBy Rich Chang\nSTAFF REPORTER\nSunday, Apr 29, 2007, Page 2\n\nPolice said yesterday they are looking for a man who stole a gold model \nboat from Tamkang University.\n\nThe university said the gold model boat, valued at more than NT$3 \nmillion (US$90,220), was a gift from South Korea's Kyungnam University \nin 2000 to celebrate the university's 50th anniversary.\n\nLast week the university put the boat on display in it's museum, and \ninvited students to guess how much it weighed. It was going to announce \nthe correct answer and winner on Wednesday, with the winner receiving a \nNT$5,000 prize.\n\nHowever the competition has now been canceled because of the theft, the \nuniversity said.\n\nTaipei County police officer Tseng Yung-hui (???) told reporters \nyesterday the robbery occurred on Friday afternoon.\n\n\"The suspect sprayed a liquid into the face of a graduate school student \nwho was guarding the boat for the museum,\" he said.\n\nTseng said according to the victim, surnamed Huang, he felt pain in his \neyes, and the suspect had told him that he had better wash his face and \neyes quickly in the restroom, adding that he would take Huang to a \nhospital after he was finished.\n\nHuang told police that when he returned he found that both the man and \nthe boat were gone.\n\nHuang said he remembered the suspect visiting the museum on Tuesday, and \nthat he had stayed in the museum for a quite a while before the robbery.\n\nPolice reviewed surveillance footage and discovered video showing the \nman hiding the gold boat in a white bag, then leaving the museum.\n\nThe suspect wore white clothes and a black peaked cap, Tseng said.\nPolice have not identified the suspect, but they were investigating \nwhether any of the staff or students at the university were involved in \nthe robbery, he added.\n\nhttp://www.taipeitimes.com/\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Mon, 30 Apr 2007 08:03:05 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Les criminels de l'art pris dans le ? Net ?\nTo: Museum Security Network Mailinglist \nMessage-ID: <46358699.8060707@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nLes criminels de l'art pris dans le ? Net ?\n\nR?gis Tremblay\nLe Soleil\n\nLes voleurs de tableaux, les faussaires et les revendeurs malhonn?tes \nsont de plus en plus pi?g?s dans le Grand Filet ! Gr?ce ? Art Alerte, un \nsite Internet unique au monde imagin? par le policier qu?b?cois Alain \nLacoursi?re, l??re du Far West dans le march? de l?art tire ? sa fin !\n\nEn quelques ann?es, Aide Alerte a r?uni une masse d?informations sur \ntous les acteurs du march? de l?art : acheteurs, vendeurs, galeristes, \nexperts en authentification, etc. Sur Art Alerte, on trouve un catalogue \nde tableaux, un bottin d?artistes, une liste de transactions, des \nrapports des vols, un r?pertoire des galeries, des mus?es, des encans, \ndes march?s aux puces, des informations sur les r?seaux criminels...\n\n? M?me si les lois qu?b?coises et canadiennes sont moins s?v?res que \ndans d?autres pays, notre taux de r?cup?ration de tableaux vol?s et de \nfaux vendus frauduleusement est plus important au Qu?bec que partout \nailleurs, depuis que nous avons instaur? Art Alerte ?, constate le \nsergent-d?tective Alain Lacoursi?re, du Service de police de la \nCommunaut? urbaine de Montr?al, le seul sp?cialiste de ce type de crime \nau Canada, avec son coll?gue Jean-Fran?ois Talbot.\n\nArt Alerte multiplie ses ramifications ? l?infini : ? Rien qu?en \nexp?diant nos informations ? l?Association des antiquaires des \n?tats-Unis, nous rejoignons 16 000 vendeurs, qui peuvent chacun \nrejoindre des milliers de clients ! ? rapporte Alain Lacoursi?re, qui \nsera ? Qu?bec demain, ? l?invitation de Marc Bellemare et de son Club \ndes collectionneurs.\n\nhttp://www.cyberpresse.ca\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Mon, 30 Apr 2007 08:03:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Profession: chasseurs de criminels de l'art\nTo: Museum Security Network Mailinglist \nMessage-ID: <463586A1.3070003@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nProfession: chasseurs de criminels de l'art\n\nR?gis Tremblay\nLe Soleil\n\nS?il est vrai que le r?seau Internet est la porte ouverte ? toutes \nsortes de crimes qu?on n?imaginait m?me pas auparavant, il est aussi \nvrai qu?il est une arme redoutable dans les mains des chasseurs de \ncriminels. Le sergent-d?tective Alain Lacoursi?re, du Service de police \nde la Communaut? urbaine de Montr?al, a compris avant tout le monde que \ncette arme pouvait faire des ravages dans le monde des criminels de l?art !\n\n? Avant notre site Art Alerte et sa masse ?norme d?information, il ?tait \ntr?s difficile de coincer les fraudeurs. Dans nos lois, il n?est pas \ncriminel de vendre ou d?acheter des tableaux vol?s, dans la mesure o? \nl?on ne sait pas qu?ils sont vol?s. Il est facile de pr?tendre qu?on ne \ns?en doutait pas ! L?ignorance ?tait une excuse parfaite. Il fallait \ndonc prouver qu?il y avait intention frauduleuse, chose ? peu pr?s \nimpossible ?, explique M. Lacoursi?re.\n\nAujourd?hui, le fardeau de la preuve est invers?. ? D?s qu?il y a un vol \nde tableau, nous en avisons tout le monde par courriel. Que les gens ne \nl?aient pas lu n?est plus une excuse : on peut prouver qu?ils l?ont \nre?u. Ils auraient d? v?rifier avant de faire la transaction ! La \nrapidit? d?Internet fait qu?un vol perp?tr? hier est connu aujourd?hui \nsur tout le r?seau. En faisant circuler la photo du tableau, il est tout \nde suite br?l? pour la revente. ?\n\nLe principe est simple, mais il repose sur une fantastique collecte \nd?information. Alain Lacoursi?re et Jean-Fran?ois Tardif sont les seuls \npoliciers au monde ? fr?quenter assid?ment les vernissages, ? assister \naux encans, ? fouiller dans les march?s aux puces. ? Nous visitons \n?norm?ment ! Je parlais r?cemment au patron de Scotland Yard, et il ne \ncomprenait pas cette approche. Je lui ai r?pondu qu?il faut aller l? o? \nles fraudeurs se tiennent. J?en ai d?j? arr?t? un en plein vernissage ! ?\n\nAlain Lacoursi?re rencontre aussi beaucoup de monde ? l?occasion des \nconf?rences qu?il donne ? gauche et ? droite. Demain, il sera l?invit? \nde Marc Bellemare au Club des collectionneurs de Qu?bec. ? Je donne ce \ngenre de conf?rence un peu partout. R?cemment, je suis all? au Br?sil, \nen Gr?ce, en ?gypte, o? j?ai pris la parole devant le Conseil \ninternational des mus?es, ? l?invitation de l?UNESCO. Prochainement, ce \nsera l?Afrique... ?\n\nLes faux\nContrairement ? des pays comme la France et l?Italie, il n?est pas \ninterdit au Canada de fabriquer des faux tableaux orn?s de fausses \nsignatures. ? Chez nous, on peut impun?ment peindre un Picasso et le \nsigner Picasso ! Il n?est pas non plus criminel de le vendre, ? \ncondition qu?il soit pr?sent? comme un faux. ?videmment, c?est loin \nd??tre toujours le cas, autrement ce genre de commerce ne serait pas \ntr?s lucratif. Quant au march? du faux vendu comme du vrai, il est en \nr?gression, gr?ce ? l?informatique. Nous recevons de moins en moins de \nplaintes dans ce domaine. Les galeristes nous appellent quand ils ont \ndes doutes. Nous pouvons les ?clairer, car nous connaissons suffisamment \nle milieu pour savoir qui a fait quoi ! ? explique M. Lacoursi?re.\n\nLe blanchiment d?art...gent\nSi les voleurs et les faussaires ont d?sormais la vie plus dure, il n?en \nva pas de m?me pour les organisations criminelles qui se servent du \nmarch? de l?art sur Internet pour blanchir de l?argent.\n\n? La police ne peut rien faire, quand les Hells de Montr?al ont une \nfacture pour prouver qu?ils ont achet? un Riopelle 50 000 $ ? Montr?al \net qu?ils exhibent une autre facture prouvant qu?ils l?ont vendu 500 000 \n$ chez Christie?s ? Londres ! Nous savons que c?est une fa?on de \nblanchir l?argent du crime, mais tout est fait dans la l?galit?. Les \ngroupes criminalis?s en profitent pour s?engouffrer dans cette br?che ! \nIl reste que nous pouvons limiter les d?g?ts en surveillant les \ntransactions. Si le m?me tableau est revendu trop souvent, cela peut \nconstituer un d?but de preuve ?, explique l?enqu?teur.\n\nAlain Lacousi?re, le bum qui est devenu un expert en art\n\nQuand Alain Lacoursi?re entre au Service de police de la Communaut? \nurbaine de Montr?al, en 1984, il n?y a pas de sp?cialiste des crimes \nentourant les ?uvres d?art : il cr?e donc son poste, pour satisfaire sa \npassion des tableaux.\n\nPourtant, rien ne semblait le destiner ? pareil destin. Dans son \nadolescence, Lacoursi?re est plut?t un bum qui se montre peu int?ress? \naux ?tudes. Le tournant survient au secondaire, lorsqu?un enseignant le \nforce ? suivre des cours de peinture : il se passionne pour cet art, et \ntoutes ses notes scolaires se bonifient.\n\nAlain Lacoursi?re oublie la peinture jusqu?en 1989. Cette ann?e-l?, il \nvisite Paris et en profite pour aller dans tous les mus?es de la Ville \nlumi?re. Le d?clic se fait ? nouveau.\n\nDe retour au pays, il abandonne ses ?tudes en gestion et entreprend un \nbac en histoire de l?art, ? l?Universit? de Montr?al. Apr?s avoir ?t? \nsergent-d?tective ? la brigade des stup?fiants et dans celle de la \nmoralit? ? Montr?al, Lacoursi?re commence ? accumuler une banque de \ndonn?es personnelle sur le march? de l?art. C?est le d?but d?une grande \naventure.\n\nAlain Lacoursi?re prendra sa retraite en 2009. Mais avec le \nsergent-d?tective Jean-Fran?ois Talbot, il est convaincu que la rel?ve \nest assur?e.\n\nhttp://www.cyberpresse.ca/\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Mon, 30 Apr 2007 08:03:44 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Currency caper at Bank of Canada leaves cash till short\nTo: Museum Security Network Mailinglist \nMessage-ID: <463586C0.8090903@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n*Currency caper at Bank of Canada leaves cash till short*\n*By DEAN BEEBY*\n\nOTTAWA (CP) - Someone has helped themselves to a few choice specimens \nfrom the Bank of Canada's currency museum, newly released documents show.\n\nRed-faced bank officials are short about $16,700 following the unsolved \ntheft at the central bank's popular tourist attraction.\n\n\"There is no plausible explanation for the discrepancy other than \ntheft,\" says an internal audit obtained by The Canadian Press under the \nAccess to Information Act.\n\n\"The procedures for note holdings should have been stronger . . . some \nof the procedures that did exist were not followed.\"\n\nThe missing money came not from the display cases, but disappeared from \na stash of cash the museum uses to help teach visitors about counterfeit \ncurrency.\n\nThe so-called note exchange program allowed patrons to swap their \nold-style bills for new-series money with special security features \ndesigned to thwart counterfeiters. The popular program, created in 2001, \nhas been abruptly cancelled in the wake of the currency caper.\n\nBank officials first noticed money was missing in June last year, but \ntook five months to complete an audit and call in the Ottawa police, \ninternal documents show.\n\nAsked why the process took so long, bank spokesman Christian Vezeau said \nonly that \"we conducted a thorough internal investigation through which \nwe were able to rule out any accounting errors and we concluded that the \nmoney was stolen.\"\n\nDet. Tracey Turpin of the Ottawa police said the case is now considered \nclosed, partly because the bank complained long after the alleged theft.\n\n\"A lot of time had passed and just about everybody that had worked at \nthe time had moved on,\" Turpin said in an interview. \"To track who was \nworking when, when the money would have gone missing, was virtually \nimpossible.\"\n\nThe police did not conduct any interviews. But the Bank of Canada's own \ninvestigation suggested it was an inside job because the money went \nmissing in an area accessible only to employees, Turpin said.\n\nVezeau declined to say whether any staff members have been disciplined \nor fired, citing privacy rules.\n\nHe added: \"The procedures in place for the storage, handling and regular \ncounting of the money for the boutique till were further tightened when \nthe museum became aware of the shortage.\"\n\nThe currency museum, which attracts 35,000 visitors a year, is nestled \ninside the original 1934 Bank of Canada building, which itself is \nembedded inside the bank's modern glass-and-steel towers near Parliament \nHill.\n\nOpened in 1980, the modest facility costs about $1.5 million a year to \noperate, with 20 full-time staff. There's no admission charge and guided \ntours are free. The galleries feature coins and currency from around the \nworld, with an emphasis on Canadian money.\n\nThe internal audit, dated November last year, noted that \"high staff \nturnover\" was partly responsible for the lax security that apparently \nallowed the theft. \"Management oversight in such an environment should \nhave been stronger,\" it said.\n\nThe heist at headquarters is not the first time the central bank - which \nprides itself on tight security - has seen its assets go AWOL.\n\nIn 2004, a bank employee was fired and charged with theft after $10,000 \nwas stolen from a Toronto bank-note facility, where large bundles of \ncash are received from chartered banks.\n\nAnd in 2001, the central bank lost track of $1 million worth of $1,000 \nnotes at an Ottawa-area shredding facility. An exhaustive internal \ninvestigation found that \"misappropriation of bank notes cannot be \nconclusively ruled out,\" and a new security camera system was installed.\n\nhttp://cnews.canoe.ca/\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 104\n****************************************\n\n"}