{"category": "spam", "to_address": "<iplacereports@speedy.uwaterloo.ca>", "from_address": "\"JohnLansing@Investorplace.com\" <JohnLansing@Investorplace.com>", "subject": "Trending 123 Trade Talk Weekly: April 11", "body": "\n\nTrade Talk Weekly Update\n\n\n\n\n\n\n\nApril 11, 2007\n“The Big Picture”\nIt was a wacky, crazy day for Trending123 folks.   At least it seemed that way to me after spending time in our trading room.   I’m in there all the time and one of the things I like most about hanging out with my subscribers each day, is being able to get an instant, accurate temperature on market participants and what they are feeling.\nToday the overriding sentiment is screaming: I’m anxious and a little crazed.   Hmm, who does that remind me of?   Oh, yes, our volatile markets!   I really believe that the markets are neurotic and so are we.\n\nSince you aren’t a Trending123 subscriber (though I hope you will become one someday soon), you don’t know about my Buy Alerts.   I send out A LOT of ‘em.   Well, it’s funny to me because it seems that when I recommend a stock that dips, everyone is paying attention and gets right in on the stock.   But when I send out an alert on a stock that moves right up, everyone gets a little freaked out and acts like they never received that email.\nMeet the RST\nRight now, because of this highly volatile market we are in, there are a bunch of stocks that are trading in a familiar pattern known as the RST.   It stands for Reverse Symmetrical Triangle.   You can learn more about it here.\n\n\n\n\n\nWilliams Percent Range\nThe Williams Percent Range, usually abbreviated “Williams %R,” is one of the top three indicators we use at Trending123 to identify trend reversals.   It’s named after its developer, Larry Williams.   Williams used a scale of 0% to 100% to show the relationship of the current closing price relative to the range of prices from the highest to the lowest over a certain period of time.   As the closing price approaches the high, the Williams %R will approach 0%.   And as the closing price approaches the low, the Williams %R will approach 100%.\nThe Williams %R gives us an easy-to-read signal for when the trend might be turning bullish or bearish.   If the Williams %R rises above the 50% line, it’s bullish.   If it falls below the 50% line, it’s bearish.   Even better, when you use the Williams %R in conjunction with two other top Trending123 indicators—the Aroon and the PPO—you’ve got three tools that together allow you to identify what I call 1-2-3 bullish and bearish trend reversals.   And as Trending123 subscribers have seen again and again, that’s where the best profits are.\n\n\n\n\nAnd for some reason, when a stock is stuck in this pattern, people become a little edgy!   It’s psychologically so mind-boggling that people seem to go a little nuts as they follow it.   The pattern is jumpy, no doubt about it.   And that’s why if you own EOG or HMY for example and you are following the charts, you probably hate both of these stocks.   My Trending123 subscribers certainly do.   But not because the stocks don’t continue to be potential money-makers for them — they definitely are still holding steady in the Trending123 portfolio.\nSo then why the hatred for these stocks?\nBecause the buying pressure in this market is causing stocks to enter this RST pattern—the pattern that makes you feel like you are trapped in a Fun House and you’re not sure what is going on!   It’s intense.   It’s volatile.   It will make you feel like pulling your hair out because you will feel out of control.\nOne of my subscribers recently asked me why it seems like the market will open up in one direction and then gyrate to another and then gyrate back to the original location again?   Plain and simple: it’s because everyone is reacting.   And as I have mentioned before and will continue to reiterate until everyone knows it like they know their name—you must not react to the market.   You want to be an ACTor not a REACTor.\nLike do you notice how volume comes in when a stock goes up and volume comes in when a stock goes down?   Everybody is reacting to what has already happened.   And that’s why it is so easy for the market participants—the people with the most money—to fleece the people with the least amount of money.   Nobody likes stocks where they should like them.   They like them at current levels.   They like them when everything seems rosy and picture-perfect.\n\n\n\n\n\n\nStuck in the Volatility Vortex?\nIt sure as heck feels like we are getting tossed around in the market these days!   Some people are starting to get a little nervous—for good reason!\nThe Dow drops 400 points one day.   It jumps 200 points another day.   Then it falls 150 points again.   Then up 45 once more.   Back and forth, back and forth.\nSo how are my Trending123 subscribers are taking it all in stride?   How can they concentrate on the opportunities that await them rather than focusing on the stress?\nI’ll tell you the secret: the charts are telling us to expect a stealth bull market in the weeks ahead.   And the charts don’t lie.\nI’d love to see you get your share of the profits.   Click here to view a free seminar that will show you a few of the profit opportunities that lay ahead.\n\n\n\n\n\n\nYou need to force your mind out of this type of thinking.   You need to open up your eyes wide and see the big picture.   Where is the stock headed further down the line?\nPeople that can overcome the everyday thought process (focusing just on what is directly in front of them) and instead look around and over it…those are the people that will end up making the most money in the long run.\nAnd of course I want YOU to be one of these people.   A true participant in the market who is in control and leading the charge to their own financial destiny.   And I’m here to help you make get there.   You can swing by my site anytime you want.\nBut if you want the grand tour, you need to try my service out for real.   It’s free with no strings attached for a full two weeks.   And in that time you will be fully on-board, meaning you’ll get to peek behind the curtain and see and get and try everything that my current Trending123 subscribers do.   Click here to give it a try.\n\nSincerely,\n\nJohn LansingTrending123\n\n\nP.S. I have tailored my Trending123 service for every kind of investor.   I didn’t want to leave anyone out!   Whether you are just beginning or you trade every day, you will find my service helpful and profitable!   Give it a risk-free try today.\n\n\n\n\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you. Please tell us if your email has changed by visiting here: http://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice from InvestorPlace advisors, you can let us know by visiting \nhttp://www.investorplace.com/u/?p=7WM199-1&e=iplacereports@speedy.uwaterloo.ca\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,2420A Gehman LaneLancaster, PA 17602\nCopyright © 2007 ACP Phillips Investment Resources, LLC.\nAll rights reserved.\n04/11/2007 4:06PM\n\nThank you for subscribing to InvestorPlace.com.   Please note that we cannot be liable for any missed bulletins caused by overzealous spam filters.   To ensure that you continue to receive this valuable part of your service please take a moment to add (JohnLansing@InvestorPlace.com) to your address book.   Click here for instructions:\nhttp://www.investorplace.com/whitelist.php?eml=JohnLansing@InvestorPlace.com\n\nee==7WM199\n\n\n\n\n\n\n"}