{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Steve Langasek <vorlon@debian.org>", "subject": "Re: New Ion3 licence", "body": "On Sat, Apr 28, 2007 at 06:48:15PM +0200, Mike Hommey wrote:\n> On Sat, Apr 28, 2007 at 09:14:32AM -0700, Steve Langasek  wrote:\n> > On Sat, Apr 28, 2007 at 02:09:21PM +0200, Mike Hommey wrote:\n> > > > > To have a trademark license, ion3 should be a trademark in the first\n> > > > > place. Is it ?\n\n> > > > It's not a *registered* trademark, but it may yet be a trademark, as the\n> > > > author claims.  I don't think we really want to test that claim, do we?\n\n> > > IANAL, but I think you can hardly have a \"trademark license\" if it's not\n> > > registered.\n\n> > Why not?  Someone may dispute whether the license has any legal *force*, but\n> > in law you can provide a license to just about anything you're willing to\n> > assert ownership over... including, practically speaking, things you don't\n> > have any legal right to (such as bullshit software patents).\n\n> What does a trademark license serve if you can't enforce it ? Nothing. I\n> don't think that's the intent of ion3's upstream.\n\nI said \"someone may dispute whether the license has any legal force\", not \"a\nlicense for an unregistered trademark is not enforceable\".  An unregistered\ntrademark is still a trademark, it just takes more effort on the part of the\nholder to enforce it /at the time of enforcement/ because you have to do\nmore than just point to the government's recognition of your mark.  But if\nyou don't think you're ever going to have to resort to legal enforcement on\nyour mark, what difference is there between a registered and an unregistered\nmark?\n\nIn this case, it's certainly in our interest to honor the ion3 upstream's\nproposed trademark license, because even if we don't believe it's\nenforceable directly, he can always enforce it by reverting to a non-free\ncopyright license, and that's not in anybody's interest here AFAICS.\n\n-- \nSteve Langasek                   Give me a lever long enough and a Free OS\nDebian Developer                   to set it on, and I can move the world.\nvorlon@debian.org                                   http://www.debian.org/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}