{"category": "ham", "to_address": "Ivan Baxter <ibaxter@purdue.edu>", "from_address": "Duncan Murdoch <murdoch@stats.uwo.ca>", "subject": "Re: [R] loop causes syntax error in print()", "body": "On 7/3/2007 10:23 AM, Ivan Baxter wrote:\n> \n> Duncan Murdoch wrote:\n>> On 7/3/2007 1:59 AM, Ivan Baxter wrote:\n>>> I am having trouble printing a table out to the GUI display when the \n>>> table is created and printed within a loop.\n>>>\n>>> I get a \"Error: syntax error message\"\n>>>\n>>> If I comment out the print statement, the loop runs fine and I can \n>>> print out the last iteration of the table.\n>>\n>> You should simplify your loop until it's something you can post for us \n>> to try.  Chances are you'll notice the error when you do that, but if \n>> not, someone else will be able to tell you what's going on.\n>>\n>> Without a reproducible example, it's more or less hopeless.\n>>\n>> Duncan Murdoch\n> Right- well I did as you suggested and seem to have fixed the problem.\n> \n> The problem appeared to be that some carriage returns were not \n> registering in the Mac Os X R editor. So even though it looked like it \n> was on a new line, it wasn't. It wasn't a line wrap issue, these were \n> actually returns that I had hit that just weren't registering. I had one \n> chunk of code which showed what I thought was the problem when R \n> crashed. When I opened up the script again after restarting, the problem \n> disappeared, so somehow the returns started to be seen.\n> \n\nIf you can reproduce this in the future, it might be worth trying to use \ncut and paste to save a record of the offending text, and sending it to \nthe Mac GUI maintainers.  I would guess there's some special code that \nis shown by the editor as a newline but seen by the parser as just \nanother character.\n\nDuncan Murdoch\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}