{"category": "ham", "to_address": "\"r-help-request@stat.math.ethz.ch\" <r-help@stat.math.ethz.ch>", "from_address": "genomenet@gmail.com", "subject": "[R] how to use chi-square to test correlation question", "body": "Hi There,\n\nThere are 300 boy students and 100 girl students in a class. One interesting question is whether \nboy is smarter than girl or not.\n\nfirst given the exam with a difficulty level 1, the number of the student who got A is below\n31 for boy, 10 for girl.\n\nThen we increase the difficulty level of the exam to level 2, the number of the student who got A is below\n32 for boy, 10 for girl.\n\nWe did this 10 times, we got the following table\n                                    score\ngender  level1 level2 levle3 level4 level5 level6 level7 level 8 level9 level10\nboy       31     32      33     34     35     36     37     38     39      40\ngirl      10     10      10     10     10     10     10     10     10      10\n\n\nMy question is how to use chi-square test to test if score is independent of gender.\nThat is whether boys is significantly smarter than girls.\n\nI used a chisquare test to do this.\nThe null hypothesis is score is not correlated with gender. and we can also say\nthe null hypothesis is boys are the same smart as girls.\nthe alternative hypothesis is that boys are significantly smarter than girls.\n\nboyscore=c(31,32,33,34,35,36,37,38,39,40)\ngirlscore=c(10,10,10,10,10,10,10,10,10,10)\nratioscore=boyscore/girlscore;\nexpratio=300/100;   #300 boy students and 100 girl students\n\nchisq=sum((expratio-ratioscore)^2/expratio)\ndf=9\npvalue=1-pchisq(chisq,df)\n\nSince the pvalue (0.9984578) is greater than significance level (0.05), we cannot\nreject the null hypothesis. Therefore the conclusion is that boys are not significantly \nsmarter than girls.\nor we can say the conclusion is that score is not correlated with gender.\n\nAm I right?\n\nThank you very much.\n\nVan\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}