{"category": "spam", "to_address": "kahlia@flax9.uwaterloo.ca", "from_address": "OBS <OBS@zenoverdiehosts.net>", "subject": "Get paid to spend time with your kids. Are we nuts?", "body": "\n\n\n\n\n\n\n\n\n\n\n13 People Needed Immediately!\n\nWe're Looking For 13 People Who Want To Earn . . .\n\n--> up to $3,450+/month PART time\n--> up to $7,600+/month FULL time\n\nOnline Business Systems is expanding AGAIN -- and \nwe have a special invitation for you!\nVisit here \nGet Ready... Get Set... GO! \n\nBuild an International business from your living room.\n\nImagine -- all the time you need to do the things \nyou really want! Live freely without financial \nfears holding you back. Eliminate the pressure of \nday to day living and build your work schedule \naround your personal goals and desires.\n\n13 People Needed Immediately! \n\nNot too long ago, you visited our site looking for \na legitimate opportunity to make serious income \n...from home. At the time, our Decision Pack (a \nloaded Work-At-Home Kit containing more than 3 \nhours of solid business information) cost $49.98 \nto order.\n\nTODAY - you can get it F-REE!\n\nIf you're serious and ready to transform \nyour life, then this invitation is for YOU!\n\nToday -- and for the next 24 hours -- you can \nGet Your Decision Pack F*R*E*E Through This Special Link: \nVisit here \n\n\n\n\n...all you pay is the small $9.95 shipping and handling.\n\nHurry ...13 openings won't last long! \n\nOur Business Coaches are standing by, ready to help \nyou design your new future -- today.\n\nGet Your Kit Immediately and qualify to be one of \nthe 13 people who step up to be the next success \nstory here at Online Business Systems.\n\nDon't miss out! Get it now:\n\n\n\nOur Story . . . \n\nBefore we were introduced to this business, \nwe had spent 25 years working hard for \nsomeone else. We racked up our c_redit cards, \nre-mortgaged our house a few times and were \nliving pay check to pay check. \n\nWe both were working full time; often more \nthan 40 hours a week; and we hardly ever seemed \nto have enough family time. We have four \nteenagers and we were worried about how we \nwere going to pay for clothes, cars and college.\n\nWe knew that if we were ever going to get \nout from under our mountain of debt, set \nour own hours, and take charge of our \nfinancial future, our best option was to \nbuild our own business based from our home. \n\nSo about a year ago, we learned about this \nbusiness opportunity and we decided to check \nit out.\n\nWith the help of our business coach, we earned \nan extra $600 in our first month working part \ntime. By our third month, we earned more than \n$1,500 and now we're consistently earning \nmore than $4,000 a month part time! \n\nNow we work our business around our family's \nschedule and our earnings continue to grow.\n\nIt took courage to step out of our comfort \nzone and look for a way out of the rat race. \n\nAnd we're so glad we did! We're now building \na solid financial wall around our family and \nwe look forward to our days of living a life \nthat we hadn't ever dreamed possible.\n\nKaren and Curt\nWisconsin\n\n\nAvoid further deliveries of this message by following this web \n\naddress.\nYou may also send written postal request to:\nOnline Marketing Solutions\nPMB #511\n250 H St.\nBlaine, Washington\n98230\n\n\n\n\n\n\n\n\n\n\nYou are subscribed to zenoverdiehosts.net with the email address kahlia@speedy.uwaterloo.ca.\nIf you wish to be excluded from future zenoverdiehosts.net mailings,\nplease click here\nor write us at:\n287 S. Robertson Blvd., Suite #407, Beverly Hills, CA 90211\n\n\n\n\n\n\n\n\n"}