{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Gaijin <gaijin@clearwire.net>", "subject": "Re: Hello...", "body": "ace wrote:\n> if your budget allows, you should probably purchase a DoubleTalk LT \n\n     Now I just heard something about the DoubleTalk...something about\nit having some kind of command language.  Is this anything like the\nHayse AT modem command set?  That would rock.  Especially if I can issue\ncommands from a script, and perhaps have it say things I don't care to\nclutter up the screen with.  I loved Redhat's init scripts during\nboot-up, where the message results were something like \"Pass\" and\n\"Fail.\"  Would be nice to have that in Slackware.  Real sanitary.\nBuying a synth will be no problem.  !Finding! one is another. \nI'm still stuck with the demo version of Win-Eyes, and it's a bear\ntrying to find anything useful, let alone keeping the same train of\nthought.   Just had to reboot between this sentence and the last. \n  I'm !dying! to get back to Linux.  Could you tell me a bit more about \nthe DoubleTalk, or point me in the right direction?  If it works with \nSpeakUp in Slackware, I'll buy it in a heartbeat.  Just spent three \nweeks trying to find someone selling a DecTalk Express, only to find \nthat Internet Explorer was getting in the way.  My afore-mentioned \nfriend showed me that Firefox was better, and I found Artic \nTechnologies, only my stoopid Cricket phone won't connect me.  \n  I keep getting a fast-busy signal until after hours.  Haven't been \nable to get through ever since.   Life in the Mighty Metropolis \nof Delhi, California...armpit of the state. \n     Any opions on hardware speech synthesizers will be gratefully \naccepted.  A URL where they can be bought is welcomed, too.  Thanks \nguys, for all the help.  This is the kind of effort I can feel proud to \njoin.  Helping the blind (and myself) sounds like a much worthier cause.\n\n         Michael\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}