{"category": "ham", "to_address": "edward baafi <edwardbaafi@gmail.com>", "from_address": "Marco Pesenti Gritti <mpg@redhat.com>", "subject": "Re: [sugar] [pyxpcom] PyXPCOM viability and OLPC", "body": "On Wed, 2007-05-09 at 10:51 -0400, edward baafi wrote:\n> > I looked a bit into this, it seem pretty simple in theory. Then I tried\n> > to compile pyxpcom and it fails to build on the trunk:\n> >\n> > https://bugzilla.mozilla.org/show_bug.cgi?id=375318\n> >\n> > The last patch there apply cleanly but doesn't solve the problem for me.\n> > I didn't try the previous patches but bsmedberg think they are wrong\n> > so...\n> >\n> > Pyxpcom looks pretty much unmaintained, which isn't promising :/\n> \n> \n> To be fair, I think people are confusing the state of the mozilla\n> beast with the state of pyxpcom..\n\nWell, I'm used to deal with the mozilla beast...\n\n> If pyxpcom doesn't build, it usually means that someone else has\n> broken it..\n\nYeah but the fact that the maintainer didn't care about getting it fixed\nfor more than one month (the bug has been reported on 2007-03-25) is not\nencouraging.\n\n>  Remember, mozilla is a beast and major revisions need to\n> land before we jump from Firefox2 (gecko1.8.1) to Firefox3\n> (gecko1.9)..  I haven't built the trunk in a while.. I might have some\n> time over the weekend to try to build it..  In the meantime:\n> \n> 1) how are you trying to build pyxpcom: standalone, or as part of xulrunner?\n\nPart of xulrunner.\n\n> 2) If you're building as part of xulrunner, can you build xulrunner\n> without pyxpcom? (this is a prerequisite)\n\nSure.\n\n> 3)What does your build environment look like? Are you doing anything\n> laptop.org specific?\n\nNothing particular no. I'm pretty sure you will get the same issue if\nyou try to build trunk.\n\n> Some things to keep in mind:\n> \n> 1) I'm a single developer who was able to navigate the mozilla beast\n> to get some traction with xulrunner + pyxpcom on my own time.. This\n> was early when people were having trouble just building xulrunner so\n> this is definitely doable now, but you have to decide that you need\n> this technology first and just dive in..\n\nWe *do* need the technology. We might not have resources to make it\nwork, though.\n\n> 2) To decide that you need this technology, you only have to ask\n> yourselves two questions:  a)Do we want a gecko based browser? b)are\n> proper python bindings a must?\n> \n\nDefinite yes to both a) and b)\n\n> 3) I think once you're able to build xulrunner + pyxpcom, you should\n> really give some thought to using xul widgets as enabling them by\n> default on the laptop allows people with web backgrounds to build\n> compelling UIs.. This doesn't break sugar's \"1 toolkit\" rule as you\n> can build xulrunner to use gtk/cairo:\n> http://developer.mozilla.org/en/docs/Configuring_Build_Options#Graphics_Toolkit\n\nxulrunner doesn't use gtk widgets (except for the toplevel window) even\nif you build it with gtk support, it just try to emulate the theme.\n\nIt's hard to explain to someone which is not familiar with the Sugar UI\ndesign but we will need a bunch of custom widgets to implement it. And\nxulrunner does not provide those. Sure you could reimplement the\ncontrols we need in xulrunner, and write xulrunner components to talk\nwith sugar presence service and...\n\nThe Sugar platform is pretty well defined at this point and we made the\nconscious decision to *not* use xulrunner to build it a while ago.\nEvolving two different platforms, one based on GNOME and one on\nxulrunner would be a non sense.\n\nConvergence between the GNOME platform and the mozilla.org one has been\ndiscussed multiple times in the past. It would be awesome in principle\nbut it won't happen any time soon. The only practical approach is to use\nembedding to bridge the two worlds.\n\nMarco\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}