{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Arnoud Engelfriet <arnoud@engelfriet.net>", "subject": "Re: Logo trademark license vs. copyright license", "body": "Francesco Poli wrote:\n> On Sat, 14 Apr 2007 20:29:09 +0200 Arnoud Engelfriet wrote:\n> > Your argument is that the trademark holder will win, because the\n> > licensee exceeded the trademark license. I am afraid someone will\n> > argue that the copyright license (from the same entity) should count\n> > for more than the trademark license, and that therefore he should win.\n> \n> That is why (I think) the original proposal by Nathanael included the\n> sentence \"but that is not a trademark license and should not be\n> construed as one\".\n> Does this clarification prevent the misinterpretation you're afraid\n> about?\n\nYes, I think so. Sometimes the simplest solution is best. \n\n> > On the other hand, someone further down the road may remove the fish\n> > and recover the swirl-and-bottle, then put that on his own CD-ROMs\n> > with operating systems, which he then sells. Now what?\n> \n> That same person could modify the fish into the logo of Red Hat, Inc.,\n> then put that on his own CD-ROMs with OSes, which he then sells.  Now\n> what?  Should we add a restriction to prevent this?  And then to prevent\n> the same with the logo of Sun Microsystems?  Of Microsoft Corporation? \n> Of Adobe Systems Inc.?  Of ...?\n\nThe reason I'm worried is because the copyright holder is the\nsame entity as the trademark holder. That is a special case.\nIf I give you an image and you turn it into a sign that's\nconfusingly similar to Red Hat's logo, you can't argue I gave\nyou permission to do that. But if I *am* Red Hat and let you\n\"do whatever you want\", you *can* argue that. \n\n> But companies do distribute images, and (only sometimes, sigh!) in a\n> DFSG-free manner.  Their licenses do not usually include a restriction\n> that prevents the licensee to derive a modified image that is\n> confusingly similar to the company logo (and then use it in commerce to\n> cause confusion as to the affiliation, etc.).\n\nTrue. Again, it's a special case. You are giving people the logo\nand telling them \"do whatever you want\" under copyright. Is\ncreating a confusingly-similar logo \"whatever you want\"?\n\n> > so my opinion is based on hearsay, but in my opinion\n> > the last thing you want in a lawsuit is hoping the jury agrees with\n> > you.\n> \n> I'm not sure I follow you here: what do you hope in a lawsuit?  That the\n> jury *disagrees* with you?\n\nYou hope never to go before a jury at all. Settle if you can,\nbecause all bets are off.\n\nArnoud\n\n-- \nArnoud Engelfriet, Dutch & European patent attorney - Speaking only for myself\nPatents, copyright and IPR explained for techies: http://www.iusmentis.com/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}