{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Tammy Mccormick <jacobs@grand-comm.com>", "subject": "Spermgun", "body": "\n\nTired with your sexual problems? Can't have sex like you had 10 years ago? \nClick here to be the best lover in the world!\nUse licensed Viagra and Cialis pills from our drug store. You will be the best, you will have perfect sex in your life!\nOrder now!\nJust buy medication called Viagra or Cialis and you'll have unbelievable sex 24/7!!!\nWith best regards,\nTammy Mccormick\n \n \nOnni. Ona snova podavila v sebe vspyshku zlosti i obrisovala situaciiu korotkimi, Rublenymi frazami, vsem svoim vidom demonstriruia, chto vinovnik sluchivshegosia Stoit priamo pered nej. Iz ushej ot sotriaseniia Posle udara potekla krov. Bigman vyrugalsia, skorchiv nepriiaznennuiu grimasu, da i ia ispytal ne Menshee razdrazhenie. \nTeper poniatno, pochemu sheltiane tak boiatsia etogo mestechka, Probormotal ia, v legkom zameshatelstve dogoniaia transa, ono prosto vyshe ih Ponimaniia, nesmotria na vse ih mentasposobnosti. On videl ee naskvoz, ej stalo nepriiatno Tolko na mig, no eto zastavilo ee samu srazu perejti k delu. Da, starika nado meniat. Nu i chto, chto on, Jeveld, molod. Ia vdrug ulovil mezhdu nimi oboimi nesomnennoe Shodstvo, i menia eto nepriiatno porazilo. Takimi veshchami ne razbrasyvaiutsia. Chto zhe im Ot menia nado? Ne oshchushchaia ishodiashchej ot nih opasnosti, ia podozhdal, poka oni podojdut. Ia ponimaiu, chto eto neobhodimo, Mas, hotia mne eto i ne nravitsia. \nRazmyshliaia nad etim, ia povernulsia Vokrug osi, no, kuda ni brosal vzgliad, ravnina uhodila v beskonechnost. Da kto zhe mozhet zamenit takoe moguchee sushchestvo?! Volna bodriashchej energii, poslannaia Celitelem po nezrimym kanalam, Vstriahnula menia i Bigmana odnovremenno. Zvuk golosa smahival na shipenie vozduha, vyhodiashchego Iz prokolotogo vozdushnogo shara, priklad pod podborodkom ne pozvolial Govorit normalno. Magicheskie sledy. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}