{"category": "ham", "to_address": "sugar@laptop.org", "from_address": "Simon McVittie <simon.mcvittie@collabora.co.uk>", "subject": "Re: [sugar] Obtaining Buddy objects as contacts are encountered", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nOn Thu, 10 May 2007 at 19:19:18 +0100, Dafydd Harries wrote:\n> We'd like this to work, but it's very much secondary to having everything\n> working well within one network.\n\nIf we have support for opportunistically subscribing to people who're in\nyour activities, this would work for people on other servers too. How they get\ninto your activities in the first place is harder - there'd have to be\nsome way to invite them (in a way it's a pity our JIDs are so\nhuman-unreadable, but there's not really any better way to allocate\nthem, and having the key fingerprint in the JID is very useful for our\nautomatic contact coalescing). I agree that this should be something to\ndevelop later, but I'll keep it in mind when I set up the API for\ncurrent work.\n\n> Certainly Jabber supports communication between people on different servers.\n> Getting it to work well on the OLPC would probably require some specific\n> support for it in Sugar. Also, some activities currently assume that anybody\n> you talk to has a routable IP address, which it not necessarily the case on\n> the Internet unless you have IPv6.\n\nThis isn't a problem for activities which use tubes (Connect, at\nthe moment; Write, relatively soon) and is less of a problem for activities\nwhich use UDP and have NAT traversal support (Call, which can work through\nreasonably permissive NATs).\n\n\tSimon\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\nComment: OpenPGP key: http://www.pseudorandom.co.uk/2003/contact/ or pgp.net\n\niD8DBQFGRE7rWSc8zVUw7HYRAtypAKCPVFsjoBrsIbPf9LIr9Ew9kgzzogCfUcIR\nxpre0yuzbWYQJyDqJf72fZY=\n=K6FB\n-----END PGP SIGNATURE-----\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}