{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Dwayne Jefferson\" <menecolooppef@ecoloop.se>", "subject": "Obesity is dangerous, stop it", "body": "\nBe leaner and slimmer by next week\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting lose flesh product available – As were told on ABC\n\n\n\nDid you realize redundant body kilograms kill a plenty of people around the whole world? We know you hate the ugly appearance of those people and the social bias against them. \n\nMoreover, you’ve not the will to resist a pressure of baneful eating habits of yours. If this sounds familiar, then we got something to propose to you!\n\n\n\n\n\nHere there is Anatrim, the new product for the elimination of your body’s extra weight. The greatest thing about Anatrim is it raises the quality of your life by making you eat less and giving you joyful spirit. Pay you attention to what people say to us on this product:\n\n\n\n\n\n\"This is outstanding! \n\n\nInstead of watching TV continually and always glutting myself with food \n\n\nI became keen on doing sport.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I have a great shape now and lots of men fix their eyes on me!\"\n\n\n\n\n\n\nSilvia D., San Diego\n\n\n\n\n\n\n\"I tried some passive weight reducing, but with no result. I could not restrain my ravenous appetite. \n\n\nOne day I heard on Anatrim from my very best friend and I was really impressed at the information.\n\n\n I had attempted taking it, and my wife said I had changed for the better since then, 3 months later. \n\n\n32 pounds off and I continue to become slimmer! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nSteve Burbon, Chicago\n\n\n\n\n\nAnatrim helps you to realize that your body doesn’t need that much food. It lifts your mood up, gives you extra energy, and attacks needless kilos. Great thanks to its mighty comprehensive formula!!\n\n\n\nWorm out more useful information!\n\n\n\n"}