{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Google Alerts <googlealerts-noreply@google.com>", "subject": "Google Alert - bush", "body": "\nGoogle News Alert for: bush\n\n\nBush chooses Pentagon official to be 'war czar' for Iraq, Afghanistan\nSan Diego Union Tribune - San Diego,CA,USA\nWASHINGTON – President Bush has chosen Lt. Gen. Spielas Lute, the\nPentagon's director of operations, to oversee the fighting in Iraq and\nAfghanistan as a ...\n\nSee all stories on this topic\n\n\nBush Calls to Throttle Down Greenhouse Gas Emissions\nTechNewsWorld - Sherman Oaks,CA,USA\nNow that Supreme Court has ruled that the EPA is responsible for cutting\ngreenhouse gas emissions from motor vehicles, President Bush has\ncalled for cuts in ...\n\nSee all stories on this topic\n\n\nBush Renews Support for Wolfowitz as World Bank Chief\nVoice of America - USA\nWolfowitz, a former deputy secretary of defense and architect of the war in\nIraq, was named to the World Bank post in 2005 by President Bush.\n...\n\nSee all stories on this topic\n\n\nHighest-ranking Bush Administration official so far has resigned ...\nWBIR-TV - Knoxville,TN,USA\nIn February, he told senators that one prosecutor was fired to make room\nfor a protégé of Bush confidante, Karl Rove. \"That's not\nperformance-related stuff. ...\n\nSee all stories on this topic\n\n\nBush conducts Liberty Orchestra students\nKansas City Star - MO,USA\nThe conductor, JoAnn Falletta of the Virginia Symphony, stepped aside, and\nBush took over for a few bars. Several players were so star-struck\nby the ...\n\nSee all stories on this topic\n\n\nHouse Votes to Put Brakes on Bush Administration Plan to Allow\nMyFox Washington DC - Washington,DC,USA\nThe House voted overwhelmingly Tuesday to delay a Bush\nadministration plan to allow Mexican trucks full access to US highways.\n...\n\nSee all stories on this topic\n\n\nCongress to jab Bush on Iraq\nRaw Story - Cambridge,MA,USA\nAnti-war Democrats will Wednesday vent anger at US Iraq strategy and dial\nup the heat on President George W. Bush, but look set to drop, for\nnow, ...\n\nSee all stories on this topic\n\n\nBush Reels in Gifts\nWashington Post - Washington,DC,USA\nWASHINGTON -- President Bush loves fishing, so people aiming to\nimpress him often go that direction. Last year alone, he was given three\nrods and three ...\n\nSee all stories on this topic\n\n\nWeinstein On 'Sicko' Controversy: Bush Should Back Off\nCinematical - Santa Monica,CA,USA\nIt has been four days since the New York Times published this article on\nthe Michael Moore in Cuba controversy, but by Saturday I had already\nwritten on the ...\n\nSee all stories on this topic\nGoogle Blogs Alert for: bush\n\n\nPresident Bush Calls for Higher Fuel Economy Standards & Use of ...\n\nBy CEI Staff\n\nWashington, DC, May 14, 2007—President Bush’s announcement today that his administration will push for higher fuel economy standards and increased use of alternative fuels was met with disappointment by energy policy analysts at the ...\n\n\nCompetitive Enterprise Institute... - http://www.cei.org/\n\n\n\nACTIVE GENERALS READY TO REVOLT AGAINST BUSH IRAQ SURGE\n\nThe active Generals are close to fed up with Bush's denial of the Iraq quagmire and are ready to stage an intervention against his surge plan ~ as the American body count continues to accelerate. General John Batiste started the ball ...\n\n\nAllen L Roland's Radio Weblog - http://blogs.salon.com/0002255/\n\n\n\nPoll: Congress sliding, Bush low\n\nBy Newsdesk\n\nPresident Bush's own job approval remains in the low 30s. Both are running lower than their averages for the year, according to the results of a May 10-13 Gallup Poll released today. Congress had reached a relative high point in public ...\n\n\nThe Swamp - http://newsblogs.chicagotribune.com/news_theswamp/\n\n\n\nCongress Dives Below Bush Line\n\nBy comments@captainsquartersblog.com(comments@captainsquartersblog.com)\n\nIf the Democrats have had a few laughs looking at approval ratings for George Bush, the laughter has probably stopped this morning after Gallup's latest survey. It shows that Congress has even lower ratings than the President, ...\n\n\nCaptain's Quarters - http://www.captainsquartersblog.com/mt/\n\n\n\nSee Bush Dance\n\nBy Miray Lozada\n\nA Spanish instant message travelling via MSN Messenger promises an animation of, presumably, US President George Bush once the recipient links on the given link. Of course clicking the link downloads a copy of a worm detected by Trend ...\n\n\nTrendLabs | Malware Blog - by... - http://blog.trendmicro.com\n\n\n This as-it-happens Google Alert is brought to you by Google.\n \nRemove this alert.\n  Create another alert.\nManage your alerts.\n\n"}