{"category": "spam", "to_address": "langa@speedy.uwaterloo.ca", "from_address": "\"Windows Secrets\" <Editor@WindowsSecrets.com>", "subject": "Save money with OEM software [Newsletter Comp Version]", "body": "\n\nSave money with OEM software\n\n\n\n\n\n\nIf your software garbles this newsletter, read \nthis issue \nat WindowsSecrets.com.\n\n\n\n   \n\n\n\n\n\n\n \n\n\n\n\nYOUR NEWSLETTER PREFERENCES\nChange\nDelivery address: langa@speedy.uwaterloo.ca\nAlternate address: langa1@speedy.uwaterloo.ca\nLocale: United States 90210\nReader number: 82003-13329\n\n\n   \n\n\n\n\n\n   \n\n\n\n\n Home \n Newsletter \n WinFind \n Reviews \n Polls \n Contact \n \n\n\n\n\n This issue \n Past issues \n Upgrade \n Prefs \n Unsubscribe \n \n\n\n\n\n   \n\n\n\n\n\n   \n\n\nWindows Secrets Newsletter • \nIssue 105 • \n2007-04-26 • \nCirculation: over 270,000\n\n\n\n\n   \n\n\n\n\n\nConfused about Vista? Let us explain\n\n\n\nMy co-author Paul Thurrott and I are constantly floored by the nice things \ncritics are saying about our new work. \"Amazing how useful a book like this \ncan be to ease your transition into the Microsoft Maze,\" writes Amazon.com \nRealName participant Sanford J. Langa (no relation to Fred Langa), in a \nreview posted at the giant bookselling site. \"It's almost \nas if Microsoft conspired with Mr. Livingston to create an operating \nsystem that cannot be used unless we buy the book.\" Hey, Vista isn't \nthat hard to understand — but we're glad we can help! Check it out \nfor yourself. —Brian Livingston, Editorial Director\nFor more information:\nUnited States / \nCanada / \nElsewhere\n\n\n   \n\n\n\n\n\n\n   \n\n\n\n \nContents\n\n\nINTRODUCTION: \n\nWhere in the world is Fred Langa?\n\n\nTOP STORY:   Save money with OEM software  \nKNOWN ISSUES:   More on getting educational discounts  \nWACKY WEB WEEK:   The great musical keyboard prank  \nWOODY'S WINDOWS:   Vista Timesaver #6 — how to preview promptly  \nPC TUNE-UP:   With Internet safety, be prepared, not paranoid  \nPERIMETER SCAN:   Don't ignore QuickTime zero-day threat  \n\nYOUR SUBSCRIPTION:   How to change your address or unsubscribe  \n\n   \n\n\n\n\n\n\n   \n\n\nFor links to every subtopic in this issue, scroll down to the \nIndex\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nGet free Cisco training (and be  famous)\nTrain Signal wants to help you get your Cisco CCNA. Here's how it works: We cover all your expenses (CCNA training videos, hardware, and exam fee) and you share your learning experience by posting to the Train Signal Training blog. See more details!\nwww.TrainSignalTraining.com\n\n\n\n\n\n\n\n\n\n \n\nBackup your data with ZipBackup\nFinally, a backup program that is easy to use.  ZipBackup's Wizard makes backups a snap for beginners. Filtering,  scheduling, and disk spanning make it a powerful tool for experts. For a limited time, Windows Secrets readers receive 25% off.\nwww.zipbackup.com\n\n\n\n\n\n\n\n\n\n \n\nGet your product seen by 270,000 readers\nDoes your company offer a product or service? Now you can place an ad in the Windows Secrets Newsletter and be seen by more than 270,000 active buyers of PC hardware and software. Bid as much or as little as you like to get the ideal ad placement.\nwww.WindowsSecrets.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\n\n\nINTRODUCTION\n\n\n\n\nWhere in the world is Fred Langa?\n\n\n\n\n\n\n\n\n\n\n\nBy Brian Livingston\nWe received over 3,000 entries in our \"Win a Housecall from \nFred Langa\" contest — and our esteemed editor is now \ngoing through them to pick four or more winners.\n\nHaving been promoted to editor-at-large, Fred's taking time \noff from writing a weekly column and is preparing for a radical \nchange in lifestyle.\n\n\n\n\n\n\n\nThat roaring sound is Fred on his bike\n\n\n\nAs I reported \n last issue, Fred (at left) will be spending the \nsummer riding his cherished motorcycle from his home in New Hampshire \nto the West Coast and then back via the Trans-Canada Highway. Out \nof all the entrants in his Housecall contest, he'll choose at least four \nreaders to visit so he can personally optimize their PCs.\n\nFred says it's the first time in 30 years of computer journalism \nthat he hasn't been facing a deadline. I hope you'll agree that the \neditor of everything from Byte Magazine to Windows Secrets deserves \nto rest up after all the good information he's brought us over the \nyears. (The contest closed on Apr. 25, and we'll name the winners in our June 7 \nnewsletter.)\n\nFred has promised to tell us what his Housecalls have taught him \nin a series of occasional columns that will start this September. \nI'm looking forward to them, and I hope you are, too.\n\n\n\n\nWe're planning new content for you\n\n\n\nAs mere mortals, we can only stand in Fred's shoes, not fill them. \nBut the rest of us here at Windows Secrets are striving to bring you \neven more great information while Fred is riding in the wind.\nAssociate editor Scott Dunn will write the top story for us in \nnewsletters to come, where Fred's column would ordinarily appear. \nIn today's issue, for example, Scott reveals the secrets of buying the OEM and \nnonprofit versions \nof software at far lower cost than Microsoft's \"upgrade\" \nversions.\n\nWe're also introducing in the free version of the newsletter a new column called Known Issues. \nWe'll use this feature to answer questions you've sent in, just as Fred has done \nin his columns for years. This week in Known Issues, Scott reports on the comments \nwe received after we published his \nApr. 12 \nanalysis of who can get \"educational discounts\" for Windows software. \n(Even kindergartners and parents of kindergartners, it turns out.)\nContributing editor Mark Edwards is also starting a new column \nentitled PC Tune-Up in the paid version of the newsletter. In this space, \nhe'll continue writing up readers' tips, as he's done since December in our former LangaList Plus section. But \nMark is planning on covering his own, new topics, \ntoo. Recipients of the paid version of the newsletter are in for some \njuicy revelations, I'd say. \n\n\n How to upgrade\n\n\nStay with us as we forge into new areas in the weeks to come. Thanks \nfor your support.\n\nBrian Livingston is editorial director of WindowsSecrets.com and the co-author of \nWindows Vista  Secrets and 10 other books.\n\n\nContents\n Index\n\n\n\n   \n\n\n\n\n   \n\n\n\nTOP STORY\n\n\nSave money using OEM software\n\n\n\n\n\n\n\n\n\n\nBy Scott Dunn\nIn last week's issue, I told you how to get great prices on Windows \nand other software using educational discounts. Unfortunately, not \neveryone has the credentials to get these discounts.\n\nFor those lacking the academic qualifications, Original Equipment Manufacturer \n(OEM) discounts offer a tempting alternative.\n\n\n\n\n\n\n\nWho can buy OEM software?\n\n\n\nIn theory, software sold at OEM discounts is intended for the makers of \ncomputers to install on their systems before selling the systems to the public. \nIn practice, however, anyone can purchase OEM software. But because of its \npurpose, the package usually assumes a level of expertise higher than the \naverage software buyer, omitting, for example, instructional manuals and \ntechnical support options. I'll tell you more about that later.\n\nOne advantage of OEM products over academically discounted software is that more \nprograms are available in OEM versions. For example, if you’re shopping for a \ncopy of Windows Vista, only the Home Premium Upgrade version is available for \nacademic discounts. But, you can get OEM discounts on nearly every edition of \nVista that Microsoft makes. (Note that OEM discounts of upgrade versions are \nrare, since OEM products are typically intended for new computers.)\n\nIn addition, educational discounts are usually limited to a single copy. But you \ncan buy many copies of OEM-discounted products, some of which come in \nmulti-packs that let you save a few dollars more.\n\n\n\nBig savings in the U.S. and U.K.\n\n\n\nOEM versions of Windows offer substantial \nsavings over the equivalent retail versions. My survey of prices of several \nonline stores in the U.S. showed savings up to 47 percent. (Amounts are averages.)\n\n\n\n \n\nOEM\n\nFull version\n\nSavings\n\n\n\nVista Ultimate\n\n$202.48\n\n$376.12\n\n46%\n\n\n\nVista Business\n\n$155.89\n\n$291.98 \n\n47%\n\n\n\nVista Home Premium\n\n$121.26\n\n$230.69\n\n47%\n\n\n\nXP Pro SP2\n\n$151.07\n\n$275.21\n\n45%\n\n\n\nMy survey of online stores in the U.S. showed OEM prices even beat out \nthose of upgrade versions by more than 20%. (Amounts are averages.)\n\n\n\n \n\nOEM\n\nUpgrade version\n\n\nSavings\n\n\n\nVista Ultimate\n\n$202.48\n\n$256.06\n\n21%\n\n\n\nVista Business\n\n$155.89\n\n$196.95\n\n21%\n\n\n\nVista Home Premium\n\n$121.26\n\n$157.87\n\n23%\n\n\n\nXP Pro SP2\n\n$151.07\n\n$205.60\n\n27%\n\n\n\nOf course, nobody actually pays an \"average\" price. To get you started, \nhere are the lowest prices I found as of April 24, 2007 (with links to the \nonline sources I found):\n\n\n\n \n\n\nOEM price (U.S. $)\n\n\nOEM price (U.K. £ incl. VAT)\n\n\n\n\n\n\t\tVista Ultimate\n\n\n\n\n\t\t$189.99\n\n\n  \t\t£116.05\n\n\n\nVista Business\n\n$127.00\n\n£86.74\n\n\n\nVista Home Premium\n\n$119.99\n\n£67.79\n\n\n\nXP Pro SP2\n\n$126.95\n\n£64.99\n\n\n\n\n\n\nOEM software isn't without risks and limitations\n\n\n\nProducts intended to be pre-installed on machines for other customers \nomit some \nof the goodies normally included with full versions and have some licensing \nrestrictions as well. For example, OEM software lacks the usual packaging and \ninstructional manuals. But since third-party books on Windows abound, this \nshouldn't be seen as a hurdle.\n\nIn addition, OEM software usually doesn't offer any free options for technical \nsupport from the software publisher. If you have a problem, you may be able to \nuse paid support or consult one of the many third-party technical support Web \nsites. Some, such as \nExperts Exchange, \nwill cost you ($13 a month, or $100 a year). But several of these are \nfree, including the following examples:\n\n• Google Groups\n• Suggest a Fix\n• Tech Support Forum\n• Tech Support Guy\n\nOEM versions of Windows cannot be used to upgrade an existing system. The only \noption available is a clean install, which, according to one dealer (Tiger Direct), \nwill delete your existing data. For a trouble-free experience, most PC gurus \nrecommend a clean install of new instances of Windows anyway. So the lack \nof an upgrade option is not necessarily a problem.\n\nThe OEM discount also comes with some extra licensing restrictions. In \nparticular, you're limited to installing the product to a single machine \n— the license cannot be transferred to another machine. Although \nit's normal for Windows to be limited to a single machine at a time, the \nEULA for retail versions usually permits Windows to be removed from one \ncomputer and transferred to another. (See section 14 of this \n typical Microsoft EULA for XP.)\n\nIn many cases, OEM software also comes with a no-refund, no-return \npolicy, even if the package has not been opened. So, make sure you specify the \nright product at the time you place your order.\n\n\n\nStill more ways to save big\n\n\n\nOEM and academic discounts are not the \nonly way to trim your software budget. For example, cheaper even than an OEM \nversion is a \"work at home\" package of Windows XP Pro SP2 available \nin the U.S. for $105 \nfrom Von1. According to Christina Philpot, \nmanager of operations at Von1, the lower price represents a promotion to home \nand student users — the product is not to be used for businesses.\n\nReader Chris Miller points out that Microsoft offers a similar deal for \n Office Home and Student 2007, which includes Word, Excel, PowerPoint, \nand OneNote. Like the \"work at home\" XP product, Office Home and Student is \nfor noncommercial home (not business) use. Despite the name, you do not need \nto have a student in your home to buy this product, according to a Microsoft FAQ. (See question 13.) \nMicrosoft's suggested retail price in the U.S. is \n$149.\n\nLast, and most certainly least expensive, here's a tip from reader Linda \nJones. She points out that \n\nTechSoup, which coordinates donation programs by software vendors, \nlets qualified nonprofit organizations purchase \nsoftware for a substantial discount. For example, U.S. libraries, 501(c)(3) \nnonprofit organizations, Canadian charitable organizations, and Canadian \nnonprofits can purchase Windows XP Professional Upgrade with Service Pack 2 \nfor as little as $8. That's hard to beat.\n\n\n\t\t\t\tReader, please rate the above article:\n1: Poor \n\t\t\t\t2: Fair \n\t\t\t\t3: Good \n\t\t\t\t4: Great  5: Superb\n\n\n\nScott Dunn is associate editor of the Windows Secrets Newsletter. He is \nalso a contributing editor of PC World Magazine, where he has written a \nmonthly column since 1992, and co-author of \n 101 Windows Tips & Tricks (Peachpit) with Jesse Berst and Charles Bermant.\n\n\nContents\n Index\n\n\n\n   \n\n\n\n\n   \n\n\n\nKNOWN ISSUES\n\n\nMore on getting your educational discount\n\n\n\n\n\n\n\nBy Scott Dunn\nReader responses poured in after last week's article about the steep \nacademic discounts available for Windows and other software.\n\nSome readers felt that we took a U.S.-centric view. It's true — \neducational pricing isn't limited to the United States. This week, I'll \nalso tell you where to find some of these deals in the U.K.\n\n\n\n\n\n\n\nAcademic pricing outside the U.S.  \n\n\n\nReader Jim Irving writes:\n\n\n\"As you have readers from many other countries, this article would be improved by \nmaking it clear that its contents only related to persons resident in the USA. \nThis may be something that is taken for granted, but it would acknowledge the \nworldwide extent of your readership.\"\n\n\nGood point! Academic discounts are harder to find in Canada and the United \nKingdom. But, since the discounts originate with the manufacturer rather than the \nretailer, it's sometimes possible to find these discounts in countries other \nthan the U.S. For example, a search for the keywords Windows and \nacademic at \n DealTime U.K. turns up a number of sites selling Vista Home Premium \nand XP Home Upgrade at prices in this range:\n\n• Windows XP Professional Upgrade: \n£57.07 with VAT \n— compared to £151.58 without academic \npricing. (Prices from GenStar U.K..)\n\n• Windows Vista Home Premium Upgrade: £53.33 with VAT — \ncompared to £130.77 without academic pricing. (Prices from \nPyramid Distribution Ltd.)\n\nOther sites that sell the academic upgrade \nversion of Vista Home Premium in the U.K. include \n Microwarehouse U.K. and \nEbuyer.com. \nCuriously, none of these sites mention requiring any academic qualifications \n(although I didn't actually complete a purchase, so some such requirement \nmay arise at the end of the process). Thanks to reader Terry Bernstein for \nhelping us locate these resellers.\n\n\n\nOther issues with educational discounts\n\n\n\nNaturally, you don't need to rely on online stores exclusively for \nacademically discounted software. As reader Jim Phelps points out, \nmany school bookstores sell these products at even better prices.\n\nReader David Dows, however, highlights a potential drawback of educational \npricing:\n\n\n\n\"This article failed to mention that academic versions often are not eligible for \nupgrade pricing to the next release. Academic versions offer a one-time, \nsingle-version discount. If the buyer won't be able to qualify for the academic \ndiscount on future releases, it may not be cheaper in the long \nrun.\"\n\nFurthermore, as Tim Wagner points out, the licenses for software programs \npurchased through academic discount programs typically state a restriction \nto non-commercial uses only.\n\nFinally, a reader named Neal has this complaint:\n\n\n\"As a legitimate educational (university) user, I've found that when word of how \nto get education pricing, especially when it stretches the original basis, gets \ncirculated to a wider general public, many manufacturers limit or stop offering \nthese discounts, causing bona fide educators to lose them. I'm all for getting \nsoftware at the lowest price, but not at the cost of causing the hen that lays \nthe golden egg to stop laying.\"\n\nI've been buying software for a long time and haven't noticed the problem \nthat Neal reports. But, since the wider general public includes many people \nwith legitimate connections to education (parents, staff, and so forth), \nthere doesn't seem to be any reason to withhold information about these \nprograms. I suspect that companies choosing to make educational discounts \navailable are more concerned about enforcing their sales policies regarding \nacademic credentials than keeping the entire program a secret.\n\n\nContents\n Index\n\n\n   \n\n\n\n\n   \n\n\n\nTELL A FRIEND\n\nHow you can share this information\nWe love it when you send your friends links to our articles. But please don't \nforward your copy of our e-mail newsletter to people, which subjects us to spam \ncomplaints. Instead, simply suggest that your friends visit this issue's permanent \nWeb address, shown below. A complete index at the bottom of the \nWeb page provides you with hyperlinks to any article you'd like to recommend.\n\nThe address of this issue is http://WindowsSecrets.com/comp/070426\n\n   \n\n\n\n\n\n   \n\n\n\nWACKY WEB WEEK\n\n\nThe great musical keyboard prank\n\n\n\n\n\n\n\n\n\n\nOffice pranks — not to mention hardware \nsabotage — are liable to get you fired from many companies. But, that didn't deter the folks at Metacafe from showing how to hijack a keyboard to make the Caps Lock key play a goofy \nsound. \n \n\n\nThe gimmick involves finding a high-tech greeting card, the kind with hardware built in to play music or sound effects. You'll also need an NPN switching transistor from your local electronics store and a few tools to disassemble and reassemble the keyboard.  Got all that? \n \nYou can try this at home, but you may find it safer just to watch the video explaining how it all works.\n\n\nMore info\n\n\n\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n\n   \n\n\n\nINDEX\n\nThe following topics appear in the free version\n\n\n\n\nINTRODUCTION  \nWhere in the world is Fred Langa?\n\n \nThat roaring sound is Fred on his bike\n\n \nWe're planning new content for you\n\n \n \n\n\nTOP STORY  \nSave money with OEM software\n\n \nWho can buy OEM software?\n\n \nBig savings in the U.S. and U.K.\n\n \nOEM software isn't without risks and limitations\n\n \nStill more ways to save big\n\n \n \n\n\nKNOWN ISSUES  \nMore on getting your educational discount \n\n \nAcademic pricing outside the U.S. \n\n \nOther issues with educational discounts \n\n \n \n\n\nWACKY WEB WEEK  \nThe great musical keyboard prank\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou get all of the following in the paid version\n\n\nWOODY'S WINDOWS  \nVista Timesaver #6 — how to preview promptly\n\n \nIn praise of previews vs. opens\n\n \nHow to turn on Vista previews\n\n \nPlaying with previews\n\n \nPreviewing PDFs — free\n\n \n \n\n\nPC TUNE-UP  \nWith Internet safety, be prepared, not paranoid\n\n \nOpenDNS: free antiphishing for your network\n\n \nMake your own external hard-disk system\n\n \nTesting your electrical outlets for proper ground\n\n \n \n\n\nPERIMETER SCAN  \nDon't ignore QuickTime zero-day threat\n\n \nMake sure QuickTime updates work\n\n \niTunes installer fails to clean up\n\n \nInstaller battles are far too common\n\n \nPlan on a new QuickTime update\n\n \n \n\n\n\nPaid subscribers can access all old and new paid newsletter content\nMake a contribution to support our research into Windows and you'll immediately\nbe able to read and search through scores of valuable articles. In addition,\npaid subscribers are entitled to download valuable content that we license for\nyou at least once every calendar quarter.\nTo upgrade, simply make a contribution of any amount you choose.\nIf you do this by May 2, 2007, \nyou'll instantly be sent the full, paid version of today's newsletter.\n\nTo upgrade to the paid version of the Windows Secrets Newsletter, please visit our \n upgrade page.\n\nThanks in advance.\n\n\n   \n\n\n\n\n\n   \n\n\n\nContents\n Index\n\n\n   \n\n\n\n\n\n   \n\n\n\nYOUR SUBSCRIPTION\n\nThe Windows Secrets Newsletter is published weekly on \nthe 1st through 4th Thursdays of each month, plus occasional news updates. \nVacation breaks occur in late August, Thanksgiving Week, and Christmas/New Year's.\nPublisher: WindowsSecrets.com LLC, 300 Queen Anne Ave. N. #456, Seattle, WA 98109\nUSA. Vendors, please send no unsolicited packages to this address (readers' letters\nare fine).\nEditorial Director: Brian Livingston. Editor-at-Large: Fred Langa. Associate \nEditor: Scott Dunn. Contributing Editors: Susan Bradley, Mark Edwards, Woody \nLeonhard, Chris Mosby, Ryan Russell. Research Director: Vickie Stevens. \nProgram Director: Brent Scheffler. Managing Editor: Jody Braverman.\nTrademarks: Microsoft and Windows are registered trademarks of Microsoft \nCorporation. The Windows Secrets series of books is published by\nWiley Publishing Inc. The Windows Secrets Newsletter,  \nWindowsSecrets.com, LangaList, LangaList Plus, WinFind, Security Baseline, Patch Watch, \nPerimeter Scan, Wacky Web Week, the Logo Design (W, S or road, and Star), and the \nslogan Everything Microsoft Forgot to Mention all are trademarks and service \nmarks of WindowsSecrets.com LLC. All other marks are the trademarks or service \nmarks of their respective owners.\n\n\nYOUR SUBSCRIPTION PREFERENCES\n(change \nyour preferences):\nDelivery address: langa@speedy.uwaterloo.ca\nAlternate address: langa1@speedy.uwaterloo.ca\nCountry: United States\nZIP or postal code: 90210\nReader number: 82003-13329\nBounce count: 0\n\nYour bounce count is the number of times your server has bounced a newsletter back to us\nsince the last time you visited your preferences page. We cannot send newsletters to you\nafter your bounce count reaches 3, due to ISP policies. If your bounce count is higher\nthan 0 or blank, please visit your\npreferences page.\nThis automatically resets your bounce count to 0.\nTo change your preferences: Please visit your \npreferences  page.\nTo access all past issues: Please visit our\npast issues page.\nTo upgrade your free subscription to paid: Please visit our \nupgrade  page.\nTo resend a missed newsletter to yourself: If your mail server filtered \nout a\nnewsletter, you can resend the current issue to yourself. To do so, visit your\npreferences page\nand use the Resend link.\nTo get subscription help by e-mail (fastest method): Visit our \ncontact page.\nSubscription help by facsimile:\n206-282-6312 (fax). Emergency subscription help by phone: 206-282-2536 (24\nhours).\n\nHOW TO SUBSCRIBE: Anyone may subscribe to this newsletter by visiting our \nfree signup page.\nWE GUARANTEE YOUR PRIVACY:\n\n1. We will never sell, rent, or give away your address to any outside party, ever.\n2. We will never send you any unrequested e-mail, besides newsletter updates.\n3. All unsubscribe requests are honored immediately, period.  \nPrivacy policy\nHOW TO UNSUBSCRIBE: To unsubscribe\nlanga@speedy.uwaterloo.ca\nfrom the Windows Secrets Newsletter,\nUse\nthis 2-click\nUnsubscribe\nlink; or\nSend\na blank e-mail to\nunsub@WindowsSecrets.net\nwith leave langa@speedy.uwaterloo.ca\nas the Subject line; or\nVisit our \nUnsubscribe page.\n\n\nCopyright © 2007 by WindowsSecrets.com LLC. All rights reserved.\n\n\nContents\n Index\n\n\n\n\n\n\n   \n\n\n\n\n\n"}