{"category": "spam", "to_address": "Wisdom <wisdom@flax24.uwaterloo.ca>", "from_address": "Holly Armstrong <seedusa@girvan-online.net>", "subject": "Penis evolution", "body": "\n\nDon't want to expose your private life? \nOur shop\nWe have only high-quality national medications at low prices. Viagra, Cialis, Levitra, Valium, Phentermine, Tramadol, Xanax, HGH you can find them here.\nClick here\nWe surely can say: buying the most wanted medications at us drug store is easy as 1-2-3! Just a few minutes and you'll get any pill that you need at the lowest cost you ever seen!\nWith best regards,\nHolly Armstrong\n \n \nNado otdohnut. Posle etogo dazhe samye zaiadlye vypivohi protrezveli i, izriadno struhnuv, Retirovalis iz traktira v poiskah bolee spokojnyh mestechek, pozvoliaiushchih Upotrebliat blagoslovennyj napitok bez dosadnyh pomeh, chtoby zabyt o nasushchnyh Problemah hot na kakoe-to vremia. Ia s trudom otkinulsia nazad, Staraias sohranit ravnovesie i ne poteriat orudie iz vidu. Sevren priamo-taki raspravil plechi, uslyshav o sebe takoj otzyv. \nVskore podlesok ischez sovsem, zadavlennyj cherno-krasnymi Gigantami. I kogda shest, vyrvavshis iz vrashcheniia, rubanul mne Po nogam, ia podprygnul. Lico frajdena sohranialo sereznoe nevozmutimoe vyrazhenie. Lico temnovolosogo zasfernika v Svete maslianyh svetilnikov, podveshennyh za kriuk k potolku kak raz nad stolikom, Bylo osunuvshimsia, pod glazami lezhali teni. Na samom dele eto samaia nastoiashchaia essenciia smerti, Poslednij poias ohrany Hishchnika. Ia tebia slushaiu, prygun, Nkot slegka priotkryl temnye blestiashchie Glaza, naverniaka uzhe vse prochitav u pryguna v golove. Ne pojmite menia prevratno, master Niksard, zagovoril starshina, Beglo skolznuv vzgliadom po obuglennoj kulte moej pravoj, ia ne osparivaiu Vashu silu i vashu sposobnost spravliatsia so svoimi vragami v odinochku, no ia Podumal, chto mogu byt polezen vam. Tak vot, v veshchevom otnoshenii dengi v izvestnom kosmose davno prevratilis v Elektronnuiu abstrakciiu. \nGlaza holodnye kak led, v rukah neobychnogo vida oruzhie s lepestkovym rylom. I koe-chto mne srazu stalo iasno. A ty mne ne ugrozhaj! Shliaiutsia tut vsiakie po nocham, da eshche i groziatsia! Ne Moe delo v stol pozdnee vremia vorota otpirat! Tolko svetlejshij mozhet Rasporiaditsia na sej schet! Nu tak sbegaj i sprosi svoego svetlejshego. Vse luchshe, chem polnyj sil boevoj mag. ejisuminyon Q1FUW1pVckRcUFBGHUFCUEZWRlleXR1XVA==\n \n\n\n"}