{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "\"Isabel Cartwright\" <lazclublistbow@clublist.net>", "subject": "Melt away fat easily", "body": "\nShed weight now and enjoy the process\n\n\n\n\n\nAnatrim – The up-to-the-moment and most fascinating product for weighty people is now readily available – As seen on CNN\n\n\n\nDo you see excessive body kilos kill a lot of people for every new year? We know you hate the ugly look of those people and the low status they have in modern society. \n\nOr, maybe, you’ve not the will to withstand a siege of your fatal eating habits. If it sounds familiar, then we got something for your consideration!\n\n\n\n\n\nHere comes Anatrim, the recent product for the reduction of your body’s extra weight. The greatest thing is that Anatrim improves the quality of your life by repressing the feeling of hunger and giving you gay spirit. Read some e-mails from our customers:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of eating everything close at hand and watching TV constantly \n\n\nI became more interested in taking exercise.\n\n\n\n\n\n\n Anatrim got me on the right path.\n\n\n I am in a great shape now and there are lots of men in my way!\"\n\n\n\n\n\n\nLusia R., New York\n\n\n\n\n\n\n\"I tried some passive weight losing, you know, but with little result. I could not restrain my ravenous appetite. \n\n\nOnce I was told about Anatrim my very best friend by and I was really effected at the information.\n\n\n I had tried using it, and my wife said to me I’m not more a weighty man now, 3 months later. \n\n\n25 pounds off and I continue to become slimmer! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nMike Brown, Las Vegas\n\n\n\n\n\nAnatrim helps you to understand that you got no such great need for that much food. It improves your mood, gives you additional energy, and attacks useless kilos. Especial thanks to its mighty original formula!!\n\n\n\nWorm out more!\n\n\n\n"}