{"category": "ham", "to_address": "random-bits@lists.essential.org, ip-health@lists.essential.org", "from_address": "james.love@keionline.org", "subject": "[Ip-health] John Edwards: Prizes not patent monopolies", "body": "http://www.huffingtonpost.com/james-love/john-edwards-prizes-not-_b_52323.html\n\nThe Huffington Post, June 15, 2007\nJohn Edwards: Prizes not patent monopolies\n\nJames Love\n\nJohn Edwards has issued a statement on affordable health care, and one new\nitem is the newest idea to control drug costs -- to replace monopolies\nwith prizes, to reward drug developers. The details of the Edwards\nstatement on prizes are here. The fact sheet said:\n\n----------------\nEdwards will convene an expert panel to identify whether there are\ndiscoveries where prizes - not patent monopolies--would offer new\nincentives to researchers, guaranteed gains to companies, and lower costs\nto patients. Drug companies would know that if they generated a\nlife-saving breakthrough, they would be guaranteed a significant payment\nin exchange for allowing competition in manufacturing and distribution.\nWith prizes, the government will pay more up front, but it will save\ntaxpayers in the end because companies will generate breakthrough drugs\nmore quickly and provide it to patients at a lower cost. Key questions\nabout the pricing of prizes, the appropriateness of prizes for different\ndiseases, and the relationship to patent protections remain to be\nresolved, but prizes are a promising innovation that Edwards will pursue.\n----------------\n\nIt is quite important that Edwards has raised this issue, which is both\nthe most radical and the most insightful reform of the crazy mess we have\nto finance new drug development. The clearest explanation of the use of\nprizes to pay for drug development was given in an August 22, 2003 guest\neditorial in the Washington Post by the economist Burton Weisbrod. The\nmost complete explanation of the possible approaches is this paper: The\nBig Idea: Prizes to Stimulate R&D for New Medicines, which I recently\nco-authored with the Welcome Trust Scientist, Tim Hubbard.\n\nLegislation to create a medical innovation prize system was introduced in\nthe Congress in 2005 (109th Congress, HR 417), and will soon be\nre-introduced in the U.S. Senate, by Bernie Sanders.\n\nEdwards has taken just a first step, calling for the creation of an expert\ncommittee to see how prizes can be used to enhance access to medicines,\nwhile stimulating more innovation (by targeting incentives much more\nefficiently than market monopolies have done). This is a big idea, and can\nsolve a very big problem -- how do you reconcile access and innovation?\nHow do you control costs, without introducing rationing?\n\nThe use of prizes to stimulate innovations that become public goods is\nbecoming the next big thing. (see these (1,2) blog entires on other\nprizes). Edwards is on to something quite important, and it may stimulate\na broader debate on the way we foster innovation for health care and other\nimportant areas of the economy.\n\nThere is indeed a growing interest in the use of innovation prizes, as\npeople look for ways to get a payday for things that cost a lot of money\nto do, but which should be freely available (such new medicines).\nEconomists from the right (Steven Shavell), left (Stiglitz) and the middle\n(Suzanne Scotchmer) have championed the use of prizes, and a number of\npoliticians, foundations and others are calling for the use of prizes for\neverything from clean energy, to agricultural inventions and medical\nresearch.\n\nIn the area of medicines, there is a lot going outside the United States.\nSeveral countries have called for the WHO's new initiative on innovation\nand access to medicines to create new innovation prizes for R&D on\nneglected diseases, and this idea will be discussed next Thursday in\nNoordwijk, the Netherlands, at a high level OECD forum on \"medicines for\nneglected and emerging infectious disease, policy coherence to enhance\ntheir availability.\" Policy coherence? What an interesting idea -- having\nboth innovation and access to the innovation.\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}