{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nI'll be anchoring our broadcast tonight from Chicago, the unofficial capital of the Midwest\n  — known for its deep-dish pizza, vibrant sports teams and rich\n  political history. \n \nWe’ll bring you up to date on the political significance\n  of the Windy City\n  to the presidential race, and I'll be taking a look at the life of one of the\n  favorite sons of Illinois\n  politics today: Senator Barack Obama. \n \nOverseas, Saudi police have arrested more than 170\n  militants who planned to carry out suicide attacks against oil facilities and\n  public figures, according to the Interior Ministry. Richard Roth will have\n  more on this massive bust of terror suspects.\n \nFormer CIA director George Tenet's memoir will be\n  released next week and it's already making a stir in Washington. Jim Axelrod will give us a\n  preview of what Tenet is likely to reveal in \"At the Center of the\n  Storm.\" \n \nAnd Senior Political Correspondent Jeff Greenfield\n  will give you an overview of last night’s debate of Democratic\n  presidential hopefuls.\n \nThere's a new gold rush in the Midwest.\n  But this time, the prized loot is not a mineral — it's a vegetable. As\n  Cynthia Bowers will report, farmers are planting record crops of corn this\n  season to keep up with the growing demand for the corn-derived fuel additive\n  ethanol. \n \nFinally, I'll give you a look at the political\n  character of the Windy\nCity, from its earliest\n  days right up to the 2008 election. I hope you'll join me.\n \nHave a great weekend! \n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}