{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "11a 6/9 Update: Crew away; heat shield inspections on tap", "body": "\n\n\n\n\n11a 6/9 Update: Crew away; heat shield inspections on tap\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 30\nPosted: 10:55 AM, 6/9/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-28 (06/08/07): NASA managers pleased with performance of repaired external tank\n   SR-29 (06/09/07): Pulled up insulation blanket on rocket pod assessed\n   SR-30 (06/09/07): Crew awake; updated FD-2 timeline; rendezvous timeline; TPS inspection on tap\n\n=================================\n\n10:55 AM, 6/9/07, Update: Crew gears up for heat shield inspection, spacesuit checkout\n\nThe Atlantis astronauts were awakened a few minutes past 10 a.m. for their first full day in space by a recording of \"Big Boy Toys\" beamed up from mission control in Houston.\n\n\"Good morning, Houston, thanks to my wife, Michelle, and my kids for playing that song,\" commander Rick Sturckow radioed.\n\nThe astronauts plan to spend the day testing spacesuits that will be used during three spacewalks at the international space station next week; checking out the tools they will use during rendezvous with the station Sunday; and carrying out a detailed inspection of the shuttle's nose cap and wing leading edge panels.\n\nThe heat shield inspection, using Atlantis' robot arm and a 50-foot extension known as the orbiter boom sensor system, or OBSS, is a now-standard part of every shuttle flight to look for any signs of impact damage that might have occurred during launch.\n\nWhile engineers are still reviewing launch imagery, no major debris could be seen in video from a camera mounted on the side of the shuttle's external tank that was aimed at the ship's belly. The only damage seen so far is a pulled-up corner, a few inches across, of an insulation blanket on Atlantis' left-side orbital maneuvering system rocket pod.\n\n\"It doesn't look too bad, but we knew everybody would want to look at it down there,\" Sturckow radioed before the crew went to bed last night.\n\nThe re-entry environment on the upper part of the shuttle is relatively benign and the protruding blanket did not appear to be a serious issue. But engineers have not completed their assessment and it's too soon to say what impact, if any, it might have. Mission managers likely will address the issue at a daily news briefing scheduled for 7 p.m. to review the day's activities and the results of initial inspections.\n\nFor today's OBSS inspections, a laser sensor on the end of the boom will be used to look for any wing leading edge damage that could pose a threat to the shuttle. The reinforced carbon carbon - RCC- nose cap and leading edge panels experience the most extreme heat during re-entry - more than 3,000 degrees Fahrenheit - and even minor damage can have serious consequences.\n\nThe astronauts will start with the starboard, or right-side, wing leading edge, making multiple passes up and down the wing to cover all the angles. After scanning the nose cap, they will move on to the port wing and repeat the procedure.\n\nFor Atlantis' flight, the inspection procedures have been modified based on lessons learned during the previous three post-Columbia missions. The scans will take less time, cover a larger area and incorporate the use of a camera on the end of the OBSS to take close-up photographs at the same time the laser scanner is collecting data. With high-resolution photos in hand, flight controllers hope to avoid the need for potential \"focused inspections\" later, if analysis of the laser data indicates any areas of concern.\n\nThe astronauts will need 75 to 90 minutes to complete the starboard leading edge scan, 50 minutes for the nosecap and another 90 minutes for the left wing. The new scanning procedure covers most of the crew cabin as well, eliminating the need for separate photo scans of the cabin. All in all, the flight day two thermal protection system inspections will only take about four hours instead of six.\n\nHere is an updated timeline of today's activities (include revision B of the NASA TV schedule; in EDT and mission elapsed time):\n\nDATE/EDT.......HH...MM...SS...EVENT\n\n06/09/07\nSat 10:08 AM...00...14...30...Crew wakeup\nSat 12:43 PM...00...17...05...NC-2 rendezvous rocket firing\nSat 12:43 PM...00...17...05...Spacesuit checkout preps\nSat 12:48 PM...00...17...10...Robot arm (RMS) powerup\nSat 01:03 PM...00...17...25...OBSS unberthing\nSat 01:13 PM...00...17...35...Spacesuit checkout\nSat 02:03 PM...00...18...25...OBSS surveys starboard wing\nSat 02:58 PM...00...19...20...Spacesuit transfer preps\nSat 03:33 PM...00...19...55...OBSS surveys nose cap\nSat 04:23 PM...00...20...45...Crew meals begin\nSat 05:23 PM...00...21...45...OBSS surveys port wing\nSat 06:38 PM...00...23...00...Ergometer setup\nSat 06:53 PM...00...23...15...OBSS berthing\nSat 07:00 PM...00...23...22...Mission status briefing on NTV\nSat 07:08 PM...00...23...30...Centerline camera installation\nSat 07:38 PM...01...00...00...Orbiter docking system ring extension\nSat 08:03 PM...01...00...25...Laser dynamic range imager downlink\nSat 08:33 PM...01...00...55...Wing leading edge sensor system downlink\nSat 08:43 PM...01...01...05...Rendezvous tools checkout\nSat 09:15 PM...01...01...37...NC-3 rendezvous rocket firing\nSat 10:08 PM...01...02...30...LDRI downlink\n\n06/10/07\nSun 01:08 AM...01...05...30...Crew sleep begins\nSun 02:00 AM...01...06...22...Video highlights reel (repeated hourly)\nSun 09:08 AM...01...13...30...STS/ISS crew wakeup\n\nDuring final approach to the space station on Sunday, Expedition 15 commander Fyodor Yurchikhin, Oleg Kotov and Sunita Williams will use digital still and video cameras to photograph the heat shield tiles on the shuttle's belly. For readers interested in looking ahead, a docking timeline has been posted on the CBS News STS-117 Quick-Look page.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}