{"category": "ham", "to_address": "debian-legal@lists.debian.org, debian-vote@lists.debian.org", "from_address": "Nathanael Nerode <neroden@fastmail.fm>", "subject": "Re: Request for GR: clarifying the license text licensing/freeness issue", "body": "I wrote:\n>> Historically, this exception has been an unwritten assumption; in most \n>> discussions, this exception has been agreed on by everyone involved.  \n\nWouter Verhelst wrote:\n>If that is the case, then why would it be necessary to write this down\n>in the DFSG? Personally, I don't think we need to go through all this\n\nAlthough most people agreed that there should be an exception, their \nmental ideas about the reason for the exception seem to have varied \nwildly.  (For the extreme case, a lot of people honestly thought license \ntexts were excepted because they were not executable binaries.)  \nOnly more recently has there been some sort of approximate-consensus \nrationale for it, which is the rationale I stated.\n\n>effort just so that nutcases can no longer use \"But look, we do this \n>for license texts, too\" as an argument. They're nutcases, anyway.\n\nI don't think they were all nutcases -- the difference between this \nexception and other proposed exceptions is not immediately obvious, \nthough I think I explained it in the parent post.\n\nI think there's near-consensus on this -- but I also think it isn't so \nobvious that it can go without saying, and is so common that it cannot \nafford to be relegated to the DFSG FAQ.  Your mileage may vary.\n\nAnyway, two other reasons were given in the parent post:\n\n(1) \"However, unwritten exceptions are not really a good idea.\nIt is more honest and straightforward to Debian's users to state the\nexception outright.... It is better to have all exceptions upfront, so \nthat Debian's users know exactly what they are getting.\"\n\nFrankly I was surprised when I first noticed the \"verbatim \ncopying only\" statements.  I may be in a minority, but I don't think I'm\nunique.  I think a \"Social Contract\" should be readable like a contract:\nwell-written contracts don't have implied, unwritten exceptions to \notherwise clear text.  Again, your mileage may vary.\n\n(2) \"However, Debian should encourage the licensing of license texts \nso that derivative license texts are allowed.\"\n\nCurrently Debian takes no position on this.  I think it should, much \nas it takes a position on patch clauses.  A counterproposal might \ndecide that Debian does *not* care about the licensing of license \ntexts, period.  Or might confirm that Debian takes no position on this \n(while still specifying that license texts have an exception).\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}