{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Blasts hit Green Zone as Blair makes farewell visit", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMay 19, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nBlasts hit Green Zone as Blair makes farewell visit\n\n\n\n\n\nThree explosions rocked Baghdad's heavily fortified Green Zone hours on\nSaturday after British Prime Minister Tony Blair arrived for meetings with\nIraqi government leaders, officials said. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfghan bomb kills 3 German troops\n\n\n\n\n\nA suicide bomber killed three German soldiers and four civilians on Saturday\nin the northern Afghan province of Kunduz, Afghan security officials said.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nShipwreck yields historic riches -- $500M worth \n\n\n\n\n\nDeep-sea explorers said Friday they have mined what could be the richest\nshipwreck treasure in history, bringing home 17 tons of colonial-era silver\nand gold coins from an undisclosed site in the Atlantic Ocean. \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFlights halted at bombing range linked to N.J. wildfires\n\n\n\n\n\nMilitary officials announced Friday they were suspending training at an aerial\nbombing range where a flare dropped from a military jet may have caused a\n27-square mile wildfire.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNavy lawyer convicted of leaking Guantanamo names\n\n\n\n\n\nA military jury recommended that a Navy lawyer spend six months in prison and\nbe dismissed from the service for sending a human rights attorney the names of\n550 Guantanamo Bay detainees in an unmarked Valentine's Day card.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCanadian military aerobatic jet crashes, killing pilot\n\n\n\n\n\nA Canadian Forces Snowbirds jet crashed Friday during rehearsal for weekend\nperformances at Malmstrom Air Force Base, killing the pilot, the Federal\nAviation Administration said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nIsraeli strikes in Gaza could grow harsher, envoy warns\n\n\n\n\n\nIsrael's response to rockets launched from Gaza into its cities has been\n\"measured\" so far but could grow harsher if the attacks continue, Israel's\nambassador to the United States said Friday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFour arrested in Iraq 'honor killing'\n\n\n\n\n\nAuthorities in northern Iraq have arrested four people in connection with the\n\"honor killing\" last month of a Kurdish teen -- a startling, morbid pummeling\ncaught on a mobile phone video camera and broadcast around the world.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n13 die in mosque blast, violence\n\n\n\n\n\nA bomb ripped through a historic mosque Friday in south India, and 13 people\nwere killed -- 11 in the blast and two in subsequent clashes between angry\nMuslim worshippers and security forces, police said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChina anger over Darfur criticism\n\n\n\n\n\nChina on Friday rejected growing criticism it is not wielding its influence\nwith Sudan to stop bloodshed in the Darfur region and said attempts to use the\nconflict to politicize Beijing's Olympic Games will fail.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nTake your home outside\n\n\n\n\n\nPam and Mark Elmore weren't in the market for a home last summer. But when the\nBend, Ore. couple happened to stop by a newly built house with a\n1,000-square-foot patio, a fully equipped outdoor kitchen - fridge and range\nincluded -and a fire pit, they immediately realized they had to have it.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDow hits record, S&P close to one\n\n\n\n\n\nStocks rallied Friday, with the Dow Jones industrial average closing at\nanother record and the broader S&P 500 ending just shy of an all-time high, as\ninvestors hailed merger news from Microsoft and talk of a deal involving\nGeneral Electric.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nIan Thomsen: Spurs pull no punches in victory\n\n\n\n\n\nIt was as ruthlessly artistic as the finest victories of Muhammad Ali, Sugar\nRay Robinson and Joe Louis. The San Antonio Spurs physically hemmed in their\nyounger, more athletically dangerous opponents, frustrated them with muscle\nand guile and then with meticulous accuracy knocked out the Phoenix Suns with\na 114-106 victory in Game 6 of their Western conference semifinal Friday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJon Heyman: Storylines to watch for the Subway Series\n\n\n\n\n\nAlso in this column:  \\u2022 New Braves owners won't spend  \\u2022 Ozzie awaits\nA-Rod in Chicago  \\u2022 An omission from my over-40 list\t\\u2022 More news and\nnotes\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nStill no answers in '06 lettuce E. coli outbreak\n\n\n\n\n\nThursday after work was Terri Kaiser's favorite night: It was bowling night\nwith her three sisters.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLawmakers push for change in food safety oversight\n\n\n\n\n\nSpurred by deadly outbreaks of E. coli and other food-borne pathogens, a group\nof U.S. lawmakers is pushing to put all food safety oversight under a single\nfederal agency.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nInventor: Camera phone evolution has only just begun\n\n\n\n\n\nThe chilling sounds of gunfire on the Virginia Tech campus; the hateful taunts\nfrom Saddam Hussein's execution; the racist tirade of comedian Michael\nRichards.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudy: 25 countries block Web sites \n\n\n\n\n\nAt least 25 countries around the world block Web sites for political, social\nor other reasons as governments seek to assert authority over a network meant\nto be borderless, according to a study out Friday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nIf you're a female singer, you'd better be sexy\n\n\n\n\n\nShe was an \"amazing talent,\" a young singer with a wonderful voice who wrote\nbeautiful songs. But she was no beauty, plus flat-chested and overweight to\nboot.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCourt: Liz Taylor can keep Van Gogh painting\n\n\n\n\n\nActress Elizabeth Taylor can keep a Van Gogh painting that might have been\nillegally seized by the Nazis because the family who once owned it waited too\nlong to ask for it back, a U.S. appeals court ruled on Friday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}