{"category": "ham", "to_address": "Kern Sibbald <kern@sibbald.com>", "from_address": "Steve Langasek <vorlon@debian.org>", "subject": "Re: Bacula: GPL and OpenSSL", "body": "Hi Kern,\n\nOn Thu, Jun 07, 2007 at 11:53:19PM +0200, Kern Sibbald wrote:\n> Well, the above is total Greek to me.  However, I must say that there is \n> absolutely no reason why Bacula would every accompany OpenSSL in any sense\n> of the the English meaning of accompany that I am aware of\n\nBacula doesn't accompany OpenSSL when you distribute it, but they certainly\ndo accompany one another when we distribute them both as part of the Debian\nOS.  This is a plain English meaning of \"accompany\".\n\nI have seen various FSF FAQs over the years that have claimed that\ndistributing binaries linked against OpenSSL is ok, but these FAQs have been\nmute on the matter of distribution as part of an OS.  In recent times, it\nappears that some Unix vendors such as Sun and Apple have also begun\ndistributing GNU software as part of systems whose cores are not licensed\ncompatibly with the GPL, with the FSF's tacit consent; that seems\nill-advised to me, but in any case the FSF's interpretations of the GPL\naren't binding on other copyright holders where those interpretations don't\nfollow logically from the text of the license.\n\n> By the way, just to be clear, I consider all this (not you guys but these \n> license difficulties) to be a real pain.  As long as the code is Open Source \n> (i.e. I can get it, see it and modify it), I have no problem with it being \n> linked with Bacula. \n\nAh, well, that right there is sufficient for us to use as a license\nexception grant. :)  But of course it's not binding on other copyright\nholders.\n\n\n> > So the question really is: how can we have Bacula in Debian, with SSL\n> > support, but without that clause?  \n\n> This is apparently possible because GNUTLS seems to have an OpenSSL \n> compatiblity layer.\n\nNot much of one, I fear...\n\n> The problem is that those third-party sources are linked into the Bacula \n> binaries, and since they are licensed as GPL with no modifications, I cannot \n> include them in a binary that has code that is licensed in a way that is \n> incompatible with the GPL.  Adding the OpenSSL exception to my license makes \n> my code incompatible with the non-modified GPL, and hence I was violating the \n> license on those 3rd party files (copyrighted by FSF, ATT, Sun, and a few \n> others ...). \n\nTo be clear here, it's not incompatible with the GPL for you to grant\nadditional linking permissions, which is what is being done.  The only real\nissue is that you can't grant such permission on behalf of other copyright\nholders.\n\nCheers,\n-- \nSteve Langasek                   Give me a lever long enough and a Free OS\nDebian Developer                   to set it on, and I can move the world.\nvorlon@debian.org                                   http://www.debian.org/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}