{"category": "spam", "to_address": "\"Rene Willard\" <the00@plg.uwaterloo.ca>,\n   \"Eduardo Daryl\" <ajmalton@plg.uwaterloo.ca>,\n   \"Terrence Ross\" <nishi@plg.uwaterloo.ca>,\n   \"Enrique Virgil\" <holt@plg.uwaterloo.ca>,\n   \"Freddie Andy\" <fjburkowski@plg.uwaterloo.ca>", "from_address": "\"Theresa.\" <Cora@sds-consulting.com>", "subject": "Are you ready for dinner at Beverlys this 4th of July?", "body": "TIRED OF THE SAME OLD ROUTINE?\n\nThis is just the solution you've been searching for- the Vibrator Ring has\nbeen specifically designed to increase both his and her pleasure. The\nsilicone rubber ring expands to comfortably fit all sizes, and will give you\nthe same incredible results every time. \n\nThe Vibrator Ring is a safe, user-friendly, pleasure-generating device that\nnot only stimulates her, but also allows him to maintain it longer and\nstronger. If it's an enjoyable, vigorous love-life you want, then try the\nVibrator Ring. \n\nVibrator Ring features include:\n: Raised tickler for her external massaging pleasure.\n: Long-life battery so the ring can give you satisfaction again and again\n: Non-toxic, silicone rubber for the everyone's comfort.\n\nRead on and see why the Vibrator Ring is taking the world's bedrooms by\nstorm!\n\nhttp://service86.hourforlove.com\nMen and Women, Boys and Girls.. It will bring a Smile to all Who try it!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nManage your subscription: http://service86.hourforlove.com/index.asp\n\n\n\n\narms and broken legs akimbo. vast hole where his face been stared back at\nBanzai. Keying walkie-talkie again, Banzai's voice \"Horse. We need Send\nanother bunch guys with some rockets. need...\" \"What the fuck's going on!\"\nthe voice from the radio. \"You got them Now you need rockets- What of\njerk-off are You got grenades, use them!\" \"We need more men. I've lost guys\nalready. We need the rockets knock down the building.\" \"Okay, on their way.\nUse your grenades, \nthe place up. The rockets will there in four fragmentation grenade from\njacket pocket, Banzai crept up two parked cars. motioned the biker behind\nhim to The biker carried an Thompson submachine gun with drum magazine. \"Put\nburst in there stand up throw. I'll tell you when.\" He the warehouse door,\nnow open six inches. muzzle flashed fire. Another weapon \nfrom one of the small windows. Banzai the pin from grenade. \"Okay, right\nnow!\" The behind Banzai stood up and fired Thompson, which jumped awkwardly\nin his hands. waved the muzzle back and the .45 caliber slugs the thin\ncorrugated metal of warehouse. Banzai swung his arm back to throw. biker\nbehind him fired the Thompson point-blank into the back of his Banzai! I'm\nsorry!\" The live fell at the fool biker's then rolled under \ncar. In panic he dropped to his and knees, grabbing for the grenade. rolled\nbeyond his reach. He up; slugs ripped his head. He reached his Thompson.\nSuddenly the grenade shockingly fierce; it tore away his feet, also the\ngrasping the Thompson. The man fell to knees almost on top of \nmangled body of Banzai. More slugs into the cars. shock and panic, the rose\nagain and staggered backward on his legs. He fell in the center of parking\nlot, wailing, blood spurting from stumps of his legs and from behind an oil\ndrum, with braided heard the grenade explode. through the thick, smoke, he\nsaw fall back screaming. He called out:\n\n\nsee you next week\n\n\n\nDenise\n\n\n\n"}