{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Ben Lund\" <nofdegettrod@degett.com>", "subject": "Losing weight has never been so easy", "body": "\nEnd the annoying obesity now\n\n\n\n\n\nAnatrim – The up-to-the-moment and most exciting product for over-weight people is made available now – As seen on BBC\n\n\n\nDid you know that redundant body kilograms kill a plenty of people for every new year? We know that you hate the ugly appearance of those people and the social stigmata attached to them. \n\nOr, maybe, you’ve not the will to withstand a siege of your ruinous eating habits. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nHere comes Anatrim, the new product for the elimination of your body’s extra weight. The most astounding thing is that Anatrim improves the quality of your life by soothing the feeling of hunger and giving you better spirit. Pay you attention to some notes received from our customers:\n\n\n\n\n\n\"It is wonderful! \n\n\nI stopped gorging everything close at hand and watching TV \n\n\nI became more interested in doing exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I am more fit now and lots of men fix their eyes on me!\"\n\n\n\n\n\n\nLusia R., Texas\n\n\n\n\n\n\n\"Passive weight reducing was of no result to me. It was rather difficult for me to hold back and not to eat something just at hand. \n\n\nOne day I was told on Anatrim the media by and I was really effected by the information.\n\n\n I had attempted taking it, and my wife told me that I had changed for the better since then, 4 months later. \n\n\n32 pounds have gone away and I keep losing them! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nMikkey Fox, Bellevue WA\n\n\n\n\n\nAnatrim gives you an opportunity to realize you doesn’t have such a great need for the constant eating. It improves your spirit, gives you energy, and attacks useless kilos. Especial thanks to its powerful distinguished formula!!\n\n\n\nPry out latest intelligence!\n\n\n\n"}