{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CNN Student News <CNNStudentNews@cnn.com>", "subject": "May 11, 2007", "body": "\nCNN.com Student News Newsletter\n\n\n\n\n\n\n \nFriday, May 11, 2007 \n\n\n\n Watch and Learn\nBefore you head off for the weekend, check out today's CNN Student News. We examine the legacy of Tony Blair, review the week's top stories, and report on Olympic construction in China.\n\n College cost crunch felt worldwide\nA college cost crunch is bearing down on governments worldwide -- not just in America -- and some innovative approaches to student loans are being taken overseas, although you wouldn't know it on Capitol Hill. \n\n May 14, 2007 - Chasing Life\nFor centuries, scientists, explorers and the curious have searched for the secrets of eternal youth. In Chasing Life, CNN senior medical correspondent Dr. Sanjay Gupta reveals amazing discoveries that could add years to your life.Record the commercial-free CNN Classroom Edition every Monday between 4:00 am and 5:00 am ET. Educational materials for the episodes are available at CNN.com/EDUCATION. Please note that CNN Classroom Edition may be pre-empted at any time for coverage of breaking news.\n\n Week of May 7\n1. Kansas 2. Iraq 3. Belfast 4. Fort Dix 5. the Middle East 6. Missouri 7. Europe 8. the White House 9. Cameroon 10. BeijingAccess this weeks Newsquiz here!\n\n\n\n\n\n \nCNN Student News is a 10-minute, commercial-free news program that airs on CNN Headline News at 3:12 a.m. EST as well as on CNN.com/EDUCATION. Created by a team of journalists and educators, the program provides the top stories of the day, segments that encourage student participation, and in-depth special reports. In addition, CNN Student News provides free curriculum at CNN.com/EDUCATION to accompany each program's content. CNN Student News, along with CNN Classroom Edition, is Turner Broadcasting's contribution to Cable in the Classroom.\n Forward this to a friend\nYou have received this email because you have signed up to receive the CNNStudent News newsletter. Click here to unsubscribeEdit your profile here \n\n\n"}