{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\nPerformance \n\t\t\tBenchmarking For Energy Utilities\nSeattle, WA\n            May 23-24, 2007\n\nPandemic \n\t\t\tPreparedness For Utilities\nSeattle, WA\n            May 23-24, 2007\n\n\nCapacity \n\t\t\tMarkets\n\n\t\t\tWashington, DC\n\nJune \n4-6, 2007\n\nCoal-to-Liquids \n\t\t\tFinance and Development Summit\n\n\t\t\tNew York, NY\n\nJune \n4-6, 2007\n\n\nStrategies for \n\t\t\tBidding Ancillary Services in LMP Markets\n\nIndianapolis, IN\n\nJune 6-7, 2007\n\n\nIntro to Electric \n\t\t\tUtility Systems for Non Engineers\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nDistributed \n\t\t\tEnergy Resources-Emerging Business Models for Utilities\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for May 19, 2007  \n\n\n\nFirst Enercast Featured Articles for May 19, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 19, 2007 PowerMarketers Industry Publications\n\n\n\nUtility Industry's Largest Meter-to-Cash BPO Provider Acquired and Going Private! Blackstone Affiliate Acquires Alliance Data (UtiliPoint.com - May 18, 2007) \n\n\n\nUtiliPoint.com - May 18, 2007 - On May 17, 2007, Alliance Data (NYSE: ADS), a noted loyalty and marketing solutions provider headquartered in Dallas and employing over 9,000 associates, announced that it agreed to be acquired by Blackstone Capital Partners V L.P., an affiliate of The Blackstone Group, in a transaction valued approximately by The Blackstone Group for $7.8 Billion.\n\n\nMay 19, 2007 PowerMarketers Industry Publications\n\n\n\nUtiliPoint Interviews Eugene N. (Gene) Dubay Senior Vice President and Chief Operating Officer SEMCO Energy Gas Company (UtiliPoint.com - May 18, 2007)\n\n\n\nUtiliPoint.com - May 18, 2007 - Last year SEMCO ENERGY undertook an effort to replace its customer information system (CIS). SEMCO ENERGY is headquartered in Port Huron, Michigan and is a diversified energy and infrastructure company that distributes natural gas to more than 400,000 customers in Michigan and Alaska.\n\n\nMay 19, 2007 PowerMarketers Industry Publications\n\n\n\nDriving Down High Prices (EnergyBiz Insider - May 18, 2007)\n\n\n\nEnergyBiz Insider - May 18, 2007 - Consumers are bellowing for relief from near-record high gasoline prices. Congress is acting.\n\n\nMay 19, 2007 PowerMarketers Industry Publications\n\n\n\nWhen Barbie Met RECs (Roger Feldman - May 11, 2007) \n\n\n\nRoger Feldman - May 11, 2007 - Barbie has gone virtual -- from vinyl idol to computer-based avatar for on-line purchase by her worshipers of a whole new world of goods.\n\n\nMay 19, 2007 PowerMarketers Industry Publications\n\n\n\nTHIS WEEK AT EIA (Volume 9, Issue 20) (May 11 - May 17, 2007)\n\n\n\nEIA - My 18 2007 - THIS WEEK AT EIA is a list summarizing and providing URLs for every Energy Information Administration (EIA) product released during this week.\n\n\nMay 19, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 18, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 18, 2007\n\n\nMay 19, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 17, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 17, 2007\n\n\nMay 19, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nPipeline to expand\n\n\n\nMay 18--A short arm of a 10,500-mile long natural gas pipeline will be expanded this summer in Campbell and Pittsylvania counties.  The Transco Natural Gas pipeline, owned by The Williams Companies Inc., stretches from far south Texas to New York City. In Virginia, the pipeline runs along the Piedmont with a section branching off to serve South Central portions of the state.\n\n\nMay 18, 2007 Knight Ridder Tribune Business News\n\n\n\nMEA energizes bureaucracy, not renewables, some say\n\n\n\nMay 18--WASILLA -- A number of Matanuska-Susitna Borough residents say the Matanuska Electric Association erects more hurdles than it removes for the type of small-scale renewable energy encouraged elsewhere.  They say the co-op utility requires potentially costly insurance and equipment, doesn't allow customers to sell surplus renewable energy on the grid at retail rates and requires businesses ...\n\n\nMay 18, 2007 Knight Ridder Tribune Business News\n\n\n\nNuclear plant plans expansion: STP picks company for construction of two new reactors\n\n\n\nMay 18--Sargent & Lundy LLC, a leading engineering consulting firm, will be the engineer on the South Texas Nuclear Project's proposed expansion project in Wadsworth. NRG Energy announced in June 2006 that the project would construct two new nuclear reactor units, which will produce an additional 2,700 megawatts of electricity.  A letter of intent was filed June 19 with the Nuclear Regulatory ...\n\n\nMay 18, 2007 Knight Ridder Tribune Business News\n\n\n\nGas bills to jump in June: Company says customers to see a 9.9 percent increase in their costs.\n\n\n\nMay 17--Rising natural gas costs will push monthly bills higher for UGI Penn Natural Gas customers next month and again in December, the utility company said Wednesday.  The combined increases will add $19.75 a month to a typical residential customer's bill based on usage figures provided by the utility. The cost increases to be submitted to the Pennsylvania Public Utility Commission on June 1 ...\n\n\nMay 17, 2007 Knight Ridder Tribune Business News\n\n\n\nXcel wins United Way award\n\n\n\nMay 18--United Way of America has named Xcel Energy its Spirit of America Award winner, the first utility company to win the award, which recognized Xcel's commitment to community improvement.  Xcel Energy Chairman, President and CEO Dick Kelly accepted the award at the 2007 United Way Staff Leaders Conference in Pittsburgh Thursday. Xcel provides electric and natural gas to 3.3 million ...\n\n\nMay 18, 2007 Knight Ridder Tribune Business News\n\n\n\nEnergy bill makes it to House\n\n\n\nMay 17--A high-profile renewable energy bill is on its way to a House vote after a committee tacked on two compromise amendments aimed at clinching majority support.  But opponents led by economic powerhouses such as Intel say they haven't given up the fight for more revisions aimed at containing potential electricity rate increases. The bill pits utilities, environmentalists and residential ...\n\n\nMay 17, 2007 Knight Ridder Tribune Business News\n\n\n\nUGI says its rates will rise June 1: Natural gas customers will see a 3.9 percent increase then -- and could see their bills jump another 3 percent by year's end.\n\n\n\nMay 17--UGI Utilities natural gas customers will start paying 3.9 percent more beginning June 1, and the company also plans to increase rates an additional 3 percent Dec. 1, the company said Wednesday.  The June 1 increase will reflect the higher cost the company is paying for wholesale gas, UGI spokeswoman Deborah Leuffen said. The state Public Utilities Commission allows that type of hike ...\n\n\nMay 17, 2007 Knight Ridder Tribune Business News\n\n\n\nOMU electric bills to increase\n\n\n\nMay 18--Owensboro households will see an average increase of about $3 on their monthly electric bills after the City Utility Commission approved a hike Thursday to counter rising fuel costs and an extensive maintenance project scheduled for the power plant.  The commission approved the increase after signing off on Owensboro Municipal Utilities' proposed annual budget, which reflects sharp ...\n\n\nMay 18, 2007 Knight Ridder Tribune Business News\n\n\n\nAnother new power line proposed: $133 million project would lower energy costs, utility says\n\n\n\nMay 18--American Transmission Co. wants state regulators to approve its plan to build a 345,000-volt power line that it says would allow cheaper power from across the Midwest to reach more Wisconsin customers.  The new line would cost $133 million. The Pewaukee-based utility built a $5 million line two years ago that added a fifth interstate electrical tie for the state.\n\n\nMay 18, 2007 Knight Ridder Tribune Business News\n\n\n\nFeds OK Williams Colorado pipeline: The $86 million project will help transport gas from producing properties in the Piceance Basin.\n\n\n\nMay 17--Federal regulators approved the Northwest Pipeline project Wednesday, allowing Williams Cos. Inc. to place the natural gas conduit into service.  The $86 million Parachute Lateral Pipeline project will connect Williams' facilities in Garfield County, Colo., with the Greasewood Hub in Rio Blanco County, Colo., according to a statement from the Tulsa-based company.\n\n\nMay 17, 2007 Knight Ridder Tribune Business News\n\n\n\nUGI Utilities expects to hike rates nearly 7 percent\n\n\n\nMay 17--It was nice while it lasted.  After holding at a two-year low during the first half of the year, natural-gas rates are heading back up. UGI Utilities announced Wednesday that residential customers face a pair of rate hikes this year that could total about 7 percent. The first rate bump will be a 3.9 percent increase effective June 1. This will lift the monthly bill for the average ...\n\n\nMay 17, 2007 Knight Ridder Tribune Business News\n\n\n\nPSC controversy fuels debate at power summit: State legislators bicker over delay in approving Spitzer's nomination for agency's leader\n\n\n\nMay 17--COLONIE -- The controversy over Gov. Eliot Spitzer's nomination to head the Public Service Commission was front and center Wednesday during the annual spring conference of the Independent Power Producers of New York.  Spitzer in January nominated energy industry executive Angela Sparks-Beddoe to be chairwoman of the PSC, the state agency that regulates the energy, telecommunications and ...\n\n\nMay 17, 2007 Knight Ridder Tribune Business News\n\n\n\nCompany won't build renewable-energy plant\n\n\n\nMay 18--A company that announced in 2005 that it would build a renewable-energy plant that could convert animal waste into electricity has applied for a permit to build. But it won't be a renewable-energy plant.  EnviroDyne Corp. plans to build a natural gas-based plant on 156 acres of what's now agricultural land southwest of Wendell in the Magic Valley. According to the 98-page application with ...\n\n\nMay 18, 2007 Knight Ridder Tribune Business News\n\n\n\nSan Diego region speaks out on power corridor\n\n\n\nMay 18--SAN DIEGO -- Dozens of community activists, public officials and environmentalists Thursday criticized a plan that sets the stage for the federal government to overrule state decisions on new power lines.  At the same time, several elected officials and business leaders supported giving the federal government power to solve Southern California's electricity problems if the state fails to ...\n\n\nMay 18, 2007 Knight Ridder Tribune Business News\n\n\n\nCarteret seeks $1.6 million for college capital projects\n\n\n\nMay 18--MOREHEAD CITY -- Carteret County's decision to pursue approximately $1.6 million in financing for Carteret Community College capital projects will mean more than just building renovations and improvements.  College officials say it will also be an opportunity to return focus to a much-needed area of training. \"It's wonderful. It will really allow us to get back into the vocational and ...\n\n\nMay 18, 2007 Knight Ridder Tribune Business News\n\n\n\nFlorence County Council closes in on budget\n\n\n\nMay 18--FLORENCE -- Florence County Council has moved a step closer to approving its proposed 2007-08 fiscal year budget, which contains $46.3 million in general fund appropriations.  The council on Thursday unanimously approved second reading of the budget, as well as the release of a deed that would allow Wellman Inc. to sell part of its Johnsonville plant.\n\n\nMay 18, 2007 Knight Ridder Tribune Business News\n\n\n\nSummertime and the music is sizzling: Here's your complete guide to the top acts headed to metro Detroit this summer\n\n\n\nMay 18--There's still a lot to be said for the summer concert season. More than ever, in fact.  As we burrow into our personal iPod worlds and insulate ourselves with our Tivos and laptops, live performance lets us experience music with something refreshingly old-fashioned: a human connection. In Detroit -- where the act of concertgoing has long been part ritual, part art -- area music fans will ...\n\n\nMay 18, 2007 Knight Ridder Tribune Business News\n\n\n\nAftershock: Earlier predictions of a 30% rate hike in 2010 likely to be on the low side, utility's top executives say\n\n\n\nMay 18--PPL Corp.'s 2010 electricity rate hike will be even higher than 30 percent, if predictions the Allentown company's top executives shared with investors this month prove to be accurate.  In August, PPL told state regulators the average bill could go up 20 percent to 30 percent in 2010, when the company's rate cap expires. Last week, in a news release, the company refined the figure to 30 ...\n\n\nMay 18, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nColorado Gov. and FPL Energy break ground at nation's second largest wind farm\n\n\n\n-- Colorado Gov. Bill Ritter has joined FPL Energy, Xcel Energy, Invenergy Wind and approximately 300 dignitaries and guests in Peetz, Colo., to break ground at the 400 MW wind generation facility that will be the nation's second largest. 'Colorado's Eastern Plains boast some of the best wind resources in the nation. With the addition of this new wind farm, Colorado increases its supply of clean, ...\n\n\nMay 17, 2007 Power Engineering\n\n\n\nFeds OK Williams Colorado pipeline\n\n\n\nThe $86 million project will help transport gas from producing properties in the Piceance Basin. Federal regulators approved the Northwest Pipeline project Wednesday, allowing Williams Cos. Inc. to place the natural gas conduit into service. The $86 million Parachute Lateral Pipeline project will connect Williams' facilities in Garfield County, Colo., with the Greasewood Hub in Rio Blanco County, ...\n\n\nMay 17, 2007 Tulsa World\n\n\n\nNebraska Public Power District Finishes Storm Restoration\n\n\n\n2:11 PM Nebraska Public Power District At 4:31 p.m. last Friday, the Nebraska Public Power District placed into service the last of 37 transmission line segments damaged, or destroyed, by the late December ice storm. This accomplishment comes six weeks ahead of the original reconstruction schedule. Along with good weather and an ability to secure agreements with multiple contractors early in the ...\n\n\nMay 17, 2007 Transmission & Distribution World\n\n\n\nEPA deal saved Massey contracts with government\n\n\n\nWeb Tools: Federal regulators cut a deal four years ago that saved Massey Energy from potentially losing at least $85 million in coal sales to government-owned power plants, according to new court documents and records obtained under the Freedom of Information Act. U.S. Environmental Protection Agency officials have not previously disclosed the settlement. The deal kept Massey from being barred ...\n\n\nMay 18, 2007 Charleston Gazette\n\n\n\nFuel cell audit sought\n\n\n\nFuel cell audit sought Charges that the low-emission units are substandard spurs legislator to scrutinize LIPA deal for devices BY MARK HARRINGTON A state senator yesterday expressed 'grave concerns' about a program by the Long Island Power Authority to test short-lived fuel cells and called on the state comptroller to audit the no-bid contract between LIPA and the project's Albany-area supplier. ...\n\n\nMay 17, 2007 Newsday\n\n\n\nLawmakers Try to Pinpoint the Source of Alabama's Nuclear Plant Shutdown\n\n\n\nWASHINGTON (AP) - An overloaded computer network shut down a nuclear reactor in Alabama last year, and even nine months later, regulators cannot pinpoint the source of the failure. The incident occurred last August at the Tennessee Valley Authority's Browns Ferry plant. Since the Sept. 11 strikes, Congress has been concerned that utilities and other high-risk facilities might be vulnerable to ...\n\n\nMay 18, 2007 Omaha World-Herald\n\n\n\nNERC projects reliable electricity this summer, barring extreme weather\n\n\n\n-- Electricity capacity margins are expected to be adequate to ensure reliable electric service throughout North America this summer, under normal summer weather conditions, according to Rick Sergel, president and CEO of the North American Electric Reliability Corporation (NERC). However, widespread and sustained hot and humid weather could threaten that reliability.\n\n\nMay 18, 2007 Power Engineering\n\n\n\n\n\nGulfstream Natural Gas System L.L.C. Sets Open Season for Proposed Mainline Expansion\n\n\n\nTAMPA, Fla., May 17 /PRNewswire/ - Gulfstream Natural Gas System, L.L.C. announced today that it will conduct an open season from June 1 to August 31 to gauge market interest in an expansion of its existing natural gas pipeline system to serve Florida's rapidly growing natural gas market.     New service from the mainline expansion is anticipated to be available beginning in late 2011, pending ...\n\n\nMay 17, 2007 PR Newswire\n\n\n\nOGE Energy Corp. Celebrates 2006, Focuses Forward on Growth\n\n\n\nDirectors elected, dividend declared at annual meeting OKLAHOMA CITY, May 17 /PRNewswire-FirstCall/ -- OGE Energy Corp. (NYSE: OGE) enjoyed a record-setting year in 2006, the company's Chairman and CEO Steven E. Moore told shareowners gathered today for their annual meeting. 'We achieved record earnings, investors sent our stock price to new record highs, and we increased our dividend for the ...\n\n\nMay 17, 2007 PR Newswire\n\n\n\nChesapeake Utilities Corporation Appoints Thomas A. Geoffroy as Vice President\n\n\n\nDOVER, Del., May 17 /PRNewswire-FirstCall/ -- John R. Schimkaitis, President and CEO of Chesapeake Utilities Corporation (NYSE: CPK), announced today that the Company's Board of Directors has promoted Thomas A. Geoffroy to the position of Vice President of the Company. 'Tom has been instrumental in driving the Company's expansion and execution of its growth strategy within the Company's service ...\n\n\nMay 17, 2007 PR Newswire\n\n\n\nEnergy Savings Enters the Texas Electricity Market through Acquisition of Billing, Supply and Marketing Platform of Just Energy\n\n\n\nEnergy Savings Group (TSX: SIF.UN) announces the signing of a definitive agreement for the purchase of the partnership units of Just Energy Texas LP (\"Just Energy\"), a Texas marketer of deregulated electricity. Houston-based Just Energy was founded in 2002 and has established a full featured, utility-compliant billing platform, as well as a supply procurement and marketing platform.\n\n\nMay 17, 2007 Internet Wire\n\n\n\nCMS Energy Shareholders Re-elect 11 Members to Board of Directors\n\n\n\nJACKSON, Mich., May 18 /PRNewswire-FirstCall/ -- Shareholders re-elected 11 incumbents to CMS Energy's Board of Directors during the company's annual meeting today. The board members re-elected were Kenneth Whipple, chairman of CMS Energy and its principal subsidiary, Consumers Energy, and David Joos, president and chief executive officer of CMS Energy and chief executive officer of Consumers ...\n\n\nMay 18, 2007 PR Newswire\n\n\n\nAlternate Energy Holdings (AEHI) Will Produce Ethanol for Below $1.00 Per Gallon\n\n\n\nLYNCHBURG, Va., May 17 /PRNewswire-FirstCall/ -- Alternate Energy Holdings (Pink Sheets: AEHI) announced recent research that indicates its proposed Idaho Energy Complex (IEC) will have the capabilities to generate ethanol for less than $1.00/gallon, depending on feedstock used. Current ethanol production costs, including a $0.51 federal credit per gallon, are approximately $2.00/gallon.\n\n\nMay 17, 2007 PR Newswire\n\n\n\nAllegheny Energy Chairman Outlines Growth Path at Annual Shareholders Meeting\n\n\n\n04:08 PM Eastern Daylight Time Allegheny Energy Chairman Outlines Growth Path at Annual Shareholders Meeting NEW YORK--(BUSINESS WIRE)--Paul J. Evanson, Chairman, President and Chief Executive Officer of Allegheny Energy, Inc. (NYSE:AYE) today outlined the companys plan for future growth at the annual meeting of shareholders, while also recognizing the financial progress that has occurred in the ...\n\n\nMay 17, 2007 Business Wire\n\n\n\nRegional and Statewide Leaders Urge CPUC to Approve Sunrise Powerlink\n\n\n\nA coalition of regional and statewide leaders urged the California Public Utilities Commission (CPUC) today to approve San Diego Gas & Electric's Sunrise Powerlink transmission line as quickly as possible in light of a recent declaration by the federal government that San Diego is in one of the two weakest and most congested energy corridors in the U.S. The coalition, called the  Community ...\n\n\nMay 17, 2007 PR Newswire\n\n\n\nEdison Crews Restore Power to Parts of Catalina Interior Including Two Harbors\n\n\n\nPM Eastern Daylight Time One Million Watt Generator Shipped to Island to Aid in Restoration Effort ROSEMEAD, Calif.--(BUSINESS WIRE)--Southern California Edison (SCE) crews this afternoon fired up a temporary one million watt generator capable of providing the electricity needed by interior Catalina communities until the infrastructure destroyed by last weeks wildfire can be rebuilt.\n\n\nMay 17, 2007 Business Wire\n\n\n\nIdaho Power Announces Memorandum of Understanding Regarding Development of Major Transmission\n\n\n\nIdaho Power today announced the signing of a Memorandum of Understanding with PacifiCorp under which the companies would pursue possible development of new high voltage transmission lines from Wyoming across southern Idaho. The companies anticipate that various segments of the project under consideration would be completed between 2012 and 2014, and would be designed to meet growth in customers' ...\n\n\nMay 18, 2007 PR Newswire\n\n\n\n\n\nFor first time, US FERC relieves utility of duty to buy from QFs\n\n\n\nIssuing its first order under a new provision of law, the US Federal Energy Regulatory Commission Thursday said Duke Energy's Midwestern utilities no longer have to buy power from so-called qualifying facilities. The QFs, often cogeneration plants at industrial facilities, operate under the Public Utility Regulatory Policies Act, which obligates utilities to buy QF power.\n\n\nMay 18, 2007 Platts\n\n\n\nCalifornia LNG terminal sponsor promises to meet strict air rules\n\n\n\nNew York (Platts)--16May2007 Mindful of air quality issues that have plagued a competitor, NorthernStar Natural Gas told regulatory agencies late Tuesday that it will amend its application for approval of the Clearwater Port liquefied natural gas import project to reflect its commitment to meeting local air quality regulations. The 1.2 Bcf/d Clearwater Port facility would be located 12.6 miles ...\n\n\nMay 17, 2007 Platts\n\n\n\nKCC approves route for Westar transmission line\n\n\n\nWestar Energy Inc. can start construction a $90 million transmission line project. The Kansas Corporation Commission approved Westar's (NYSE: WR) plan to build a 345 kilovolt high-capacity transmission line from the utility's Zombie Evans power plant northwest of Wichita to Hutchinson and Salina. The KCC also approved a proposed route for the line, including alternatives suggested by affected ...\n\n\nMay 17, 2007 Wichita Business Journal\n\n\n\nUS senators criticize as too weak EPA rule on mercury emissions\n\n\n\nA Bush administration rule designed to reduce mercury emissions from coal-fired power plants came under fire at a Senate hearing Wednesday by members of both parties who criticized the regulation as too weak to protect human health and the environment. Democrats and some Republican members of a Senate Environment and Public Works subcommittee said the March 2005 rule issued by the Environmental ...\n\n\nMay 17, 2007 Platts\n\n\n\nAmerican Transmission Co. asks Wisconsin to approve power line\n\n\n\nPortland, Maine (Platts)--17May2007 American Transmission Co. has asked Wisconsin regulators to approve plans for a 345-kV power line that would stretch across part of the state and into Illinois, giving Wisconsin utilities improved access to the Midwest Independent Transmission System Operator markets. The proposed line would run about 35 miles from the Paddock Substation in northern Illinois to ...\n\n\nMay 17, 2007 Platts\n\n\n\nATC Files Application For Transmission Access Project In Midwest..\n\n\n\nMadison, WI - American Transmission Co. is proposing a project to construct a new 345-kilovolt electric transmission line in south central Wisconsin on existing transmission right-of-way that will complete a connection to Illinois and allow local distribution companies access to lower-cost power produced in the region. The company yesterday filed an application with the Public Service Commission ...\n\n\nMay 18, 2007 Power Online\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nShell Global Solutions Rolls Out Carbon & Energy Management Programme to Address Asia Pacific Energy Challenge\n\n\n\nSINGAPORE, May 18 /Xinhua-PRNewswire / -- -- Two-prong strategy to improve energy efficiency and reduce carbon emissions -- First roll-out of the integrated programme in the Asia Pacific for its customers Shell Global Solutions launched its Asia Pacific Carbon and Energy Management programme at the Asia Pacific Media Technology Day here today. The launch was officiated by Bob Frith, President, ...\n\n\nMay 18, 2007 PR Newswire\n\n\n\nAnalysis: India pursues coal gasification\n\n\n\nUPI Energy Correspondent NEW DELHI, May 17 (UPI) --  In a bid to promote coal gasification as an alternative energy source, India says it plans to pursue the technology for power generation. Following recommendations from a parliamentary standing committee attached to the Petroleum and Natural Gas Ministry, the federal government, in consultation with the country's Planning Commission and the ...\n\n\nMay 17, 2007 Washington Times\n\n\n\nGain an Insight into the Government/Regulator Involvement in the Turkish Energy Market\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c56956) has announced the addition of Turkey Energy Market Organisation and Regulation Report to their offering. The Turkey overview report can help you to quickly understand the countrys energy market structure and organisation. For each of the 4 main energy sources, coal, oil, gas and electricity, ...\n\n\nMay 17, 2007 Business Wire\n\n\n\nNew South East Asia Oil & Gas Wall Map Indispensable To Anyone Interested In The South East Asia Energy Sector\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c57353) has announced the addition of South East Asia Oil & Gas Wallmap to their offering. This is a detailed wall map of South East Asia showing the latest information about the oil and gas infrastructure in the region. The map shows active oil and gas fields, refineries, LNG terminals, gas and ...\n\n\nMay 18, 2007 Business Wire\n\n\n\nBelching chimneys instead of solar panels\n\n\n\nThe truth of Blair's environmental legacy Last November Greenpeace anticipated the Prime Minister's departure by climbing to the top of Didcot power station's main chimney and painting 'Blair's Legacy' in 20-foot-high letters down the side. The point was well made: as I pointed out in this column a month ago, coal has been enjoying a resurgence in Blair's Britain, despite being the most CO2- ...\n\n\nMay 17, 2007 New Statesman\n\n\n\nSuez seeks to boost Gas Natural stake\n\n\n\n- French utility Suez is seeking to strengthen its hand ahead of the next stage of consolidation in Europe's energy market by raising its stake in Spain's Gas Natural. According to the Financial Times, the French company will become Gas Natural's third biggest shareholder after spending ?1bn ($1.36bn) to increase its holding from a previous 5.4 per cent to a proposed 11.3 per cent.\n\n\nMay 17, 2007 Power Engineering\n\n\n\nEDF Energies Nouvelles 2006 Reference Document\n\n\n\nPARIS--(BUSINESS WIRE)--Regulatory News: EDF Energies Nouvelles (Paris:EEN) announces the filing today of its 2006 Registration Document (Document de Rfrence) with the French market regulator Autorit des Marchs Financiers (A.M.F.), with the visa number R.07-071 This document is available on the Company's website (www.edf-energies-nouvelles.com, under the heading Investors Relations / Press ...\n\n\nMay 18, 2007 Business Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}