{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "Rosado Polly <htgrb@firstam.com>", "subject": "THE UPPER LEVEL PATTERN REMAINS BLOCKED.", "body": "ERMX Grabs Edge Of US Trade With China And Moves Into Nitride Devices!\n\nEntreMetrix Inc. (ERMX)\n$0.16\n\nCongress's push to increase trade agreements with China gives ERMX huge\nadvantage as they enter joint venture to manufacture Nitride Devices for\nmilitary, energy and technological solutions in China. This is huge. Get\non ERMX Monday!\n\nTHE UPPER LEVEL PATTERN REMAINS BLOCKED. IN NORTHEAST OKLAHOMA.\nRESULTING IN CONTINUED AREAS OF FLOODING.\n\nWAGONER AND WASHINGTON.\nEXCEPT SHOWERS IN NORTH-CENTRAL AND NORTHEAST OKLAHOMA WERE MOVING IN A\nCIRCULAR PATTERN.\n\nSHOWERS AND THUNDERSTORMS ARE EXPECTED TO INCREASE IN COVERAGE AND\nINTENSITY THIS AFTERNOON.\n\nAND MAY RESULT IN SCATTERED FLASH FLOODING. BE ESPECIALLY CAUTIOUS AT\nNIGHT WHEN IT IS HARDER TO RECOGNIZE THE DANGERS OF FLOODS. MOST OF THE\nSHOWERS WERE MOVING SLOWLY TOWARD THE EAST.\n\nBE ESPECIALLY CAUTIOUS AT NIGHT WHEN IT IS HARDER TO RECOGNIZE THE\nDANGERS OF FLOODS. AS THE TROUGH DRIFTS BACK TO THE SOUTH AND WEST. A\nFLASH FLOOD WATCH MEANS RAPIDLY RISING WATER OR FLOODING IS POSSIBLE\nWITHIN THE WATCH AREA. IF YOU ARE IN THE WATCH AREA.\n\nFLASH FLOOD WATCH REMAINS IN EFFECT THROUGH SUNDAY EVENING.\nSEMINOLE AND STEPHENS. ADDITIONAL RAINFALL AMOUNTS ARE GENERALLY\nEXPECTED TO BE LIGHT.\nMOVE TO HIGHER GROUND.\n\nTHE UPPER LEVEL PATTERN REMAINS BLOCKED. BE ESPECIALLY CAUTIOUS AT NIGHT\nWHEN IT IS HARDER TO RECOGNIZE THE DANGERS OF FLOODS. BE ESPECIALLY\nCAUTIOUS AT NIGHT WHEN IT IS HARDER TO RECOGNIZE THE DANGERS OF FLOODS.\nLOCAL AREAS OF HEAVY RAIN WILL BE POSSIBLE FROM MID-AFTERNOON INTO THIS\nEVENING.\n\nAROUND A LOW CENTERED NORTHWEST OF TULSA.\n\nSEMINOLE AND STEPHENS.\n\nDO NOT LET YOUR CHILD BE A VICTIM OF DANGEROUS FLOOD WATERS!\n\nTHE BANKS OF STREAMS AND FLOODWAYS ARE SLIPPERY AND RAIN SOFTENED GROUND\nMAY GIVE WAY EASILY. RAIN WILL BECOME MORE WIDESPREAD AGAIN ON SUNDAY.\n\n"}