{"category": "ham", "to_address": "\"Ramon Diaz-Uriarte\" <rdiaz02@gmail.com>", "from_address": "\"Matthew Keller\" <mckellercran@gmail.com>", "subject": "Re: [R] Rserve and R to R communication", "body": "Hi Ramon,\n\nI've been interested in responses to your question. I have what I\nthink is a similar issue - I have a very large simulation script and\nwould like to be able to modularize it by having a main script that\ncalls lots of subscripts - but I haven't done that yet because the\nonly way I could think to do it was to call a subscript, have it run,\nsave the objects from the subscript, and then call those objects back\ninto the main script, which seems like a very slow and onerous way to\ndo it.\n\nWould Rserve do what I'm looking for?\n\nOn 4/7/07, Ramon Diaz-Uriarte  wrote:\n> Dear All,\n>\n> The \"clients.txt\" file of the latest Rserve package, by Simon Urbanek,\n> says, regarding its R client,\n>\n> \"(...) a simple R client, i.e. it allows you to connect to Rserve from\n> R itself. It is very simple and limited,  because Rserve was not\n> primarily meant for R-to-R communication (there are better ways to do\n> that), but it is useful for quick interactive connection to an Rserve\n> farm.\"\n>\n> Which are those better ways to do it? I am thinking about using Rserve\n> to have an R process send jobs to a bunch of Rserves in different\n> machines. It is like what we could do with Rmpi (or pvm), but without\n> the MPI layer. Therefore, presumably it'd be easier to deal with\n> network problems, machine's failures, using checkpoints, etc. (i.e.,\n> to try to get better fault tolerance).\n>\n> It seems that Rserve would provide the basic infrastructure for doing\n> that and saves me from reinventing the wheel of using sockets, etc,\n> directly from R.\n>\n> However, Simon's comment about better ways of R-to-R communication\n> made me wonder if this idea really makes sense. What is the catch?\n> Have other people tried similar approaches?\n>\n> Thanks,\n>\n> R.\n>\n> --\n> Ramon Diaz-Uriarte\n> Statistical Computing Team\n> Structural Biology and Biocomputing Programme\n> Spanish National Cancer Centre (CNIO)\n> http://ligarto.org/rdiaz\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n\n-- \nMatthew C Keller\nPostdoctoral Fellow\nVirginia Institute for Psychiatric and Behavioral Genetics\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}