{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Ross Ricks\" <miqelcapinavegantefew@elcapinavegante.com>", "subject": "Pounds down, mood up", "body": "\nStop gaining weight and get the figure you want\n\n\n\n\n\nAnatrim – The newest and most enchanting product for over-weight people is now easily available – As seen on BBC\n\n\n\nDo you see redundant body kilograms kill a plenty of people around the planet? We know that you hate the unsightly appearance of those people and the social bias against them. \n\nOr, maybe, you got no will to withstand pressure of fatal eating habits of yours. This all sounds familiar? Then we have something for you!\n\n\n\n\n\nWe’re proudly introduce you Anatrim, the new product for the elimination of your body’s extra weight. The greatest thing is that Anatrim improves the quality of your life, making you crave food less and giving you better mood. Look at some notes from our customers:\n\n\n\n\n\n\"This is amazing! \n\n\nI stopped watching TV and stuffing myself with food \n\n\nI became keen on taking exercise.\n\n\n\n\n\n\n Anatrim placed me back on the right path.\n\n\n I am in a great fit now and there are lots of men in my way!\"\n\n\n\n\n\n\nSilvia D., Las Vegas\n\n\n\n\n\n\n\"I tried some passive weight reducing, but with no result. This terrible appetite would just rush in and spoil everything. \n\n\nOne day I was told on Anatrim the media by and it brought a great influence on me.\n\n\n I had attempted taking it, and my wife said to me that I'm a different person now, 4 months later. \n\n\n25 pounds off and this is still far to an end! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nMike Brown, Chicago\n\n\n\n\n\nAnatrim helps your brain to realize your body doesn’t need that much food. It raises your spirit, gives you additional energy, and attacks useless kilos. All thanks to its powerful distinguished formula!!\n\n\n\nElicit more useful information!\n\n\n\n"}