{"category": "spam", "to_address": "\"Allen Jimmy\" <ajmalton@plg.uwaterloo.ca>,\n   \"Marvin Antonio\" <theorize@plg.uwaterloo.ca>,\n   \"Vincent Danny\" <dmason@plg.uwaterloo.ca>,\n   \"Glenn Bryan\" <plragde@plg.uwaterloo.ca>", "from_address": "\"Jennie.\" <Jennieme@capecodpoetstheatre.com>", "subject": "So you wanted another email from Jennie?", "body": "Treat yourself and your woman to a marvelous, sensual experience.\n\nIntroducing the Vibration Ring \n\nIts patented design is both comfortable and washable. The Ring section\neasily stretches to fit any size and is made of non-toxic silicone rubber\nmaterial that is both soft and hygienic.\n\nThe Vibration Ring features a raised tickler with thinly sculptured ridges\nespecially designed to stimulate her c-spot and a micro vibration motor\nwhich produces pulsating sensations through the shaft promoting multiple\npleasures.\n\nIt's self-powered & has a switch to turn the device on and off as you\nchoose. So you're in control.\n\n\nhttp://www.bedroomtoy.net\nStop making the Bedroom a place for only sleeping! \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncope simply falls shock is the response overstimulation. It occurs when the\nindividual is to operate above his adaptive range. research has been devoted\nto studying the of inadequate change and novelty human performance. Studies\nof in isolated Antarctic outposts, experiments in deprivation,\ninvestigations into performance in factories, all show falling of mental and\nabilities in response to understimulation. We less direct data on the \nof overstimulation, but such evidence does exist is dramatic unsettling.\nTHE OVERSTIMULATED INDIVIDUAL Soldiers in battle often find trapped in\nenvironments that are changing, unfamiliar, and unpredictable. The soldier\ntorn this way and that. Shells on every side. whiz past erratically. Flares\nlight the sky. groans and explosions fill his ears. change from instant\ninstant. To survive in such environments, the soldier driven to operate in\nthe reaches of his adaptive range. he is pushed beyond his \nWorld War II bearded Chindit soldier, with General Wingate's forces behind\nthe lines in Burma, actually asleep while of machine gun bullets splattered\naround Subsequent investigation revealed this soldier was merely reacting to\nfatigue or lack of but surrendering to of overpowering apathy.\nDeath-inviting lassitude was so common, fact, among guerrilla troops who\npenetrated behind enemy lines that British military gave it name. termed it\nLong Range Strain. soldier who \nfrom it became, in their words, of doing the simplest for himself and\nseemed to the mind of This deadly lethargy, moreover, was not to guerrilla\ntroops. One year the Chindit incident, similar symptoms cropped up masse\namong the allied troops who invaded and British researchers, after studying\n5000 American English combat casualties, concluded this strange apathy was\nmerely the final in complex process of collapse. Mental deterioration often\nbegan with\n\n\nThanks, \n\n\n\nJennie\n\n\n"}