{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\nPerformance \n\t\t\tBenchmarking For Energy Utilities\nSeattle, WA\n            May 23-24, 2007\n\nPandemic \n\t\t\tPreparedness For Utilities\nSeattle, WA\n            May 23-24, 2007\n\n\nCapacity \n\t\t\tMarkets\n\n\t\t\tWashington, DC\n\nJune \n4-6, 2007\n\nCoal-to-Liquids \n\t\t\tFinance and Development Summit\n\n\t\t\tNew York, NY\n\nJune \n4-6, 2007\n\n\nStrategies for \n\t\t\tBidding Ancillary Services in LMP Markets\n\nIndianapolis, IN\n\nJune 6-7, 2007\n\n\nIntro to Electric \n\t\t\tUtility Systems for Non Engineers\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nDistributed \n\t\t\tEnergy Resources-Emerging Business Models for Utilities\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (May 16, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 16, 2007\n\n\nMay 16, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for May 16, 2007  \n\n\n\nFirst Enercast Featured Articles for May 16, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 16, 2007 PowerMarketers Industry Publications\n\n\n\nAmeren Real Time Pricing: Access to Lower Energy Prices (UtiliPoint.com - May 16, 2007) \n\n\n\nUtiliPoint.com - May 16, 2007 - As utilities across North America embrace time-based rate plans to offer customers options that can provide an alternative to increasing higher averaged prices for electricity, a new market has opened up for outside firms to provide assistance to utilities in marketing and supporting these programs.\n\n\nMay 16, 2007 PowerMarketers Industry Publications\n\n\n\nRethinking Retail Markets (EnergyBiz Insider - May 16, 2007) \n\n\n\nEnergyBiz Insider - May 16, 2007 - New studies looking at the merits of electricity deregulation are springing forth.\n\n\nMay 16, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nTXU adds to wind-power portfolio\n\n\n\nMay 16--TXU Wholesale, already the state's largest purchaser of wind-generated electricity, said Tuesday it signed a five-year contract to buy all the power from a 209-megawatt wind farm southwest of Abilene.  The agreement with Chicago-based Airtricity North America will boost TXU's wind-power portfolio to 914 megawatts of electrici- ty from 965 turbines, including those at Airtricity's Ros- coe ...\n\n\nMay 16, 2007 Knight Ridder Tribune Business News\n\n\n\nLow-impact paper, high profile: Mohawk says investment in environmental projects makes premium lines \"carbon neutral\"\n\n\n\nMay 16--COHOES -- Mohawk Fine Papers Inc.'s premium sheets include such shades as mahogany, ocean mist, desert haze, eucalyptus and balm.  But starting today, all that high-end paper will come in one color: green. That's green in the environmental sense, since the company has made its premium line \"carbon neutral.\" The environmental designation refers to a company's attempt to offset its burning ...\n\n\nMay 16, 2007 Knight Ridder Tribune Business News\n\n\n\nProposed transmission corridor brings more than 100 to meeting\n\n\n\nMay 16--ARLINGTON -- For the most part, a three-person energy panel stared icily, took occasional notes and rarely smiled at clever remarks from a room of mostly angry citizens questioning the timing, environmental impact and placing of federally proposed national electric corridors.  Panelist Poonum Agrawal couldn't help but crack a smile, however, when a stay-at-home mom brought her own kitchen ...\n\n\nMay 16, 2007 Knight Ridder Tribune Business News\n\n\n\nFuel cell audit sought: Charges that the low-emission units are substandard spurs legislator to scrutinize LIPA deal for devices\n\n\n\nMay 16--A state senator yesterday expressed \"grave concerns\" about a program by the Long Island Power Authority to test short-lived fuel cells and called on the state comptroller to audit the no-bid contract between LIPA and the project's Albany-area supplier.  The request follows a report last week in Newsday that of the more than 160 experimental fuel cells LIPA purchased from Plug Power Inc. ...\n\n\nMay 16, 2007 Knight Ridder Tribune Business News\n\n\n\nChapel Hill's green dream hits snag: Greenbridge developers say geothermal system appears unlikely\n\n\n\nMay 16--CHAPEL HILL -- For renewable energy sources, the Greenbridge developers may choose the sun over the Earth.  Greenbridge partner Michael Cucchiara said this week that geothermal heating and cooling planned for the future $50 million eco-towers on West Rosemary Street is now unlikely. \"We just had a partners meeting [Monday] morning, and we told them we didn't think we were going to do it,\" ...\n\n\nMay 16, 2007 Knight Ridder Tribune Business News\n\n\n\nHousing authority awards contract: Ameresco Inc. to review utility systems, recommend upgrades.\n\n\n\nMay 15--In a meeting marked by sharp words, a divided Bethlehem Housing Authority decided Monday to award a lucrative contract to the company that its full-time staff and $35,000 consultants recommended.  The commissioners voted 3-2 to pay Ameresco Inc. $40,000 to review the heating, electrical and water systems on the authority's properties to determine what upgrades could be made to save the ...\n\n\nMay 15, 2007 Knight Ridder Tribune Business News\n\n\n\nPower outage hits Wesley Medical Center\n\n\n\nMay 15--A short circuit in one of Wesley Medical Center's main power systems has knocked out electricity at the hospital.  The short, which occurred at about 5:15 a.m. today, was initially thought to be a lightning strike from thunderstorms pounding the city at the time because people heard a pop, hospital spokeswoman Helen Thomas said. The hospital is using generators to provide electricity to ...\n\n\nMay 15, 2007 Knight Ridder Tribune Business News\n\n\n\nEDITORIAL: KeySpan cleanup: It's past time to remediate MGP sites\n\n\n\nMay 15--The cleanup of contaminated soil at sites where gas was last produced more than a half-century ago has been on the back burner far too long. So it's good that the heat is getting turned up under KeySpan Corp., as it seeks state approval of its takeover by National Grid Plc.  The point of the pressure, however, should be a timetable for addressing the worst sites quickly and economically, ...\n\n\nMay 15, 2007 Knight Ridder Tribune Business News\n\n\n\nBear Creek Twp.'s rejection of wind park appealed to state Superior Court\n\n\n\nMay 15--Despite a crippling setback earlier this year, backers of the Penobscot Mountain Wind Project are refusing to let the idea blow away quietly.  Energy Unlimited Inc. announced on Monday it had filed an appeal before the state Supreme Court of a lower court decision that had upheld Bear Creek Township's rejection of the wind turbine park. That Commonwealth Court decision in February was a ...\n\n\nMay 15, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nTXU Wholesale adds 209-MW deal to wind energy portfolio\n\n\n\n-- TXU Wholesale announced it has increased its portfolio of wind power contracts with a 209 MW agreement with Airtricity, a renewable energy company based in Dublin, Ireland. Under terms of the five-year contract, Airtricity will provide the wind power generated by its Roscoe Wind Farm, currently under construction about 45 miles southwest of Abilene in West Texas.\n\n\nMay 15, 2007 Power Engineering\n\n\n\nAdvocates for cleaner energy face big obstacles in their quest to win Long Islanders' support\n\n\n\nSEEKING THE 'GREEN' LIGHT BY KEIKO MORRIS Going 'green' and making climate change a top concern is often easier said than done on Long Island. Although some local business leaders say Long Island has already begun the shift toward more 'green' practices, and a new report by an international panel of scientists emphasizes that affordable tools to slow global warming exist, others say that these ...\n\n\nMay 15, 2007 Newsday\n\n\n\n\n\nFirstEnergy Holds 2007 Annual Meeting\n\n\n\nCEO Reports on Financial and Operational Progress Shareholders Reelect Directors; Consider Company and Shareholder Proposals AKRON, Ohio, May 15 /PRNewswire-FirstCall/ -- In his address at the FirstEnergy Corp. (NYSE: FE) Annual Meeting of Shareholders today, President and Chief Executive Officer Anthony J. Alexander said he feels confident about the company's future based on its continued ...\n\n\nMay 15, 2007 PR Newswire\n\n\n\nClean Coal Plant in Taylorville Would Be Economic Boon, NIU Study Finds\n\n\n\nAM Eastern Daylight Time Clean Coal Plant in TaylorvilleWould Be Economic Boon, NIU Study Finds Project would revitalize states coal industry while providing thousands of jobs and hundreds of millions of dollars in investment for Central Illinois TAYLORVILLE, Ill.--(BUSINESS WIRE)--A proposed clean coal power plant in Taylorville, Illinois, would be an economic boon to the region, according to a ...\n\n\nMay 15, 2007 Business Wire\n\n\n\nSCR-Tech Announces SCR Catalyst Regeneration Orders Totaling $1.0 Million\n\n\n\nSCR-Tech, a subsidiary of Catalytica Energy  SCR-Tech, a subsidiary of Catalytica Energy Systems, Inc. (NASDAQ: CESI), announced today that it has secured new contracts totaling approximately $1.0 million from a leading independent power producer in the Southeast and a top Midwestern utility to provide SCR catalyst regeneration services.  Under the terms of the purchase orders, SCR-Tech will ...\n\n\nMay 15, 2007 Internet Wire\n\n\n\nEnvironmental Power Corporation Reports First Quarter 2007 Financial Results\n\n\n\nPORTSMOUTH, N.H., May 15 /PRNewswire-FirstCall/ -- Environmental Power Corporation (Amex: EPG) today announced results for the quarter ended March 31, 2007.     Total revenues for the three months ended March 31, 2007 remained relatively flat at $14.2 million, as compared to $14.4 million for the same period in 2006.     Overall revenues at the Company's subsidiary Buzzard Power Corporation ...\n\n\nMay 15, 2007 PR Newswire\n\n\n\nHomeland Renewable Energy LLC and Fibrowatt LLC Welcome John O'Neill as Chief Financial Officer and Treasurer\n\n\n\nNEWTON, Pa.--(BUSINESS WIRE)--Homeland Renewable Energy LLC (HRE) announced today that John ONeill has been appointed Chief Financial Officer and Treasurer, with responsibility for the companys finance, treasury and accounting operations. As an important member of the HRE leadership team, Mr. ONeill will assist the company and its principal subsidiary, Fibrowatt LLC, in executing its strategic ...\n\n\nMay 16, 2007 Business Wire\n\n\n\nInvestments in Boilers and Steam Capacity in the Chemical Processing Industry Remains Strong\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). Steam and heat generated from process and utility boilers plays a significant role in the production of chemicals. The cost to produce steam and energy often influences the profitability of the end products manufactured and ultimately the bottom line for the Chemical Processing Industry (CPI) ...\n\n\nMay 16, 2007 Internet Wire\n\n\n\nPower Efficiency Corporation Reports Q1 2007 Results and Outlook for Q2 2007 and Beyond\n\n\n\nLAS VEGAS--(BUSINESS WIRE)--Power Efficiency Corporation (OTCBB: PEFF), a developer and manufacturer of advanced energy savings technologies for electric motors, today announced its first quarter 2007 financial results on Form 10-QSB. Power Efficiencys Chairman and CEO, Steven Strasser, had the following comments on the first fiscal quarter of 2007 and looking forward to Q2 and beyond.\n\n\nMay 15, 2007 Business Wire\n\n\n\nSeminole Energy Services Announces Open Season on Nebraska Pipeline Project\n\n\n\nPM Eastern Daylight Time TULSA, Okla.--(BUSINESS WIRE)--Seminole Energy Services, LLC reported today that the open season for capacity bids on the NRC pipeline opens today. The open season will run until 4 p.m. (CST) on June 15, 2007. As previously announced, Seminole plans to build the pipeline through its affiliate Nebraska Resources Company, LLC (NRC). NRC plans to construct a 150 to 200-mile ...\n\n\nMay 15, 2007 Business Wire\n\n\n\nITC Holdings Corp. Named as Finalist in 2007 American Business Awards(SM)\n\n\n\n5th annual Stevie(R) Awards will be presented on June 11 in New York City NOVI, Mich., May 16 /PRNewswire-FirstCall/ -- ITC Holdings Corp. (NYSE: ITC) today announced that it was named a Finalist in the Best Overall Company category in The 2007 American Business Awards. Hailed as 'the business world's own Oscars' (New York Post, April 27, 2005), The American Business Awards are the only national, ...\n\n\nMay 16, 2007 PR Newswire\n\n\n\nMidwest Air Group Files Proxy Statement for 2007 Annual Meeting; Urges Shareholders to Re-Elect Three Directors\n\n\n\nMILWAUKEE, May 16 /PRNewswire-FirstCall/ -- Midwest Air Group, Inc. (Amex: MEH), parent company of Midwest Airlines, today filed with the Securities and Exchange Commission and mailed to shareholders its definitive proxy statement. The proxy statement includes formal notice of the company's 2007 Annual Meeting of Shareholders, as well as instructions for shareholders to vote on the re-election of ...\n\n\nMay 16, 2007 PR Newswire\n\n\n\n\n\nCanada should seize challenge of clean coal\n\n\n\nOTTAWA - In basic ways, Alex Fassbender's breakthrough in clean-coal technology retains James Watt's methodology from the 18th century. You pulverize coal into particles as fine as talcum powder, then burn it in a furnace surrounded by pipes filled with water. You direct the steam into turbines that spin to produce electricity. In other basic ways, though, it is very different.\n\n\nMay 16, 2007 CTV.ca\n\n\n\nInertia leads to high gas prices\n\n\n\nHalf the population are paying up to 250 a year more for their gas and electricity because the power companies know they will never switch supplier, it was claimed yesterday.A report by the Centre for Competition Policy at the University of East Anglia concluded that a lack of competition in the market is effectively allowing the six big power firms to keep bills artificially high for the 50% of ...\n\n\nMay 15, 2007 Guardian Unlimited\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nSolar EnerTech Ships First Container of Solar Modules to Africa\n\n\n\nSolar EnerTech Corp. (OTCBB: SOEN) (the  Solar EnerTech Corp. (OTCBB: SOEN) (the \"Company\") is pleased to announce that its first container of solar modules produced for the South African market has been shipped from the Company's facility in Shanghai.  The shipment is part of the Fan Qie Trading, Ltd. sales order that the Company announced earlier this year.\n\n\nMay 16, 2007 Internet Wire\n\n\n\nCore Resources Enter Uranium Mining Business\n\n\n\nCore Resources (PINKSHEETS: CRLJ) announced  Core Resources (PINKSHEETS: CRLJ) announced today that it has reached a preliminary agreement to acquire the rights to mine Uranium in the Pontiac region in Quebec, Canada. The terms of the agreement are not available at this time pending customary due diligence on the property. It is projected by management that the transaction should be consummated ...\n\n\nMay 16, 2007 Internet Wire\n\n\n\nInvenergy Completes Project Financing for 620 MW Grays Harbor Energy Center\n\n\n\nInvenergy LLC announced today that it has completed project financing for the 620 MW Grays Harbor natural gas-fueled facility located in Washington. The $216,500,000 financing was completed with the Royal Bank of Scotland as the lead arranger and underwriter.     Invenergy acquired the partially constructed facility from Duke Energy North America in early 2005 after construction was 50% complete ...\n\n\nMay 16, 2007 PR Newswire\n\n\n\nNew North Sea Oil & Gas Wall Map is Invaluable to Anyone Interested in the North West Europe Energy Sector\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c57036) has announced the addition of 'North Sea Oil & Gas Wall Map' to their offering. This is a detailed wall map of the North Sea showing the latest information about the oil and gas infrastructure in the North Sea area. The map shows active licences, operators, fields and exploration/appraisal ...\n\n\nMay 16, 2007 Business Wire\n\n\n\nAnalysis: Venezuela takes over oil rigs\n\n\n\nUPI Energy Correspondent MIAMI, May 15 (UPI) --  Venezuelan state-oil company PDVSA said it will take over day-to-day operations of 18 oil rigs now run by foreign companies, the latest move in the country's effort to take control of its petroleum sector. Energy Minister Rafael Ramirez told a Venezuelan newspaper earlier this week that South America's No. 1 petroleum exporter would be taking over ...\n\n\nMay 16, 2007 Washington Times\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}