{"category": "ham", "to_address": "Michael Adam <ma@sernet.de>", "from_address": "James Peach <jpeach@samba.org>", "subject": "Re: svn commit: samba r23389 - in branches/SAMBA_3_0/source: .", "body": "On 08/06/2007, at 3:44 PM, Michael Adam wrote:\n\n> Hi James,\n>\n> On Fri, Jun 08, 2007 at 08:55:42AM -0700, James Peach wrote:\n>> On Jun 8, 2007, at 7:37 AM, obnox@samba.org wrote:\n>>>\n>>> Log:\n>>> Disabling ACL support on Darwin/Mac OS X for now.\n>>>\n>>> Current configure check detects posix ACL support\n>>> but compile of modules/vfs_posixacl.c fails due\n>>> to missing defines in sys/acl.h:\n>>> ACL_USER, ACL_USER_OBJ, ACL_GROUP, ACL_GROUP_OBJ, ACL_OTHER,\n>>> ACL_MASK, ACL_WRITE, ACL_READ\n>>>\n>>> It has to be investigated, if this can be fixed within\n>>> the posixacl vfs module or if we need a darwinacl module.\n>>\n>> The Darwin ACL model is a lot closer to the Windows/NFS4 model  \n>> than it\n>> is to the traditional Posix model. I have a module, which I'll post\n>> for review in due time. If you have a particular need for it, I can\n>> accelerate the process.\n>\n> Yes, I would like to see that module. No hurry though - samba\n> didn't have working Darwin ACL support up to now if I am not\n> mistaken.\n>\n> Is the module you are referring to by chance the one available under\n> http://www.opensource.apple.com/darwinsource/Current/samba-100.7/ \n> darwin_vfs/darwin_acls.c\n\nYep, though its now slightly altered from that code.\n\n> In this case, it does of course not fit into our acl schema.\n> But with some work it could (judging from a first glance)\n> be integrated.\n> Or do you already have something that integrates with upstream Samba?\n\nWell we hook in at the nt_acl VFS layer, not the POSIX ACL layer  \nthough I could probably add support for that as well. I guess we  \ncould do the native->NFSv4->NT conversion, but it feels icky. I'll  \nlook at it more closely when the time comes.\n\n> I don't have any special or urgent need, just want to make Samba's\n> ACL support more complete.\n\nOk, no rush then\n\n--\nJames Peach | jpeach@samba.org\n\n\n"}