{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Don Armstrong <don@debian.org>", "subject": "Re: help with crafting proper license header for a dual-licensing project", "body": "On Sun, 27 May 2007, Francesco Poli wrote:\n> On Sun, 27 May 2007 02:43:41 -0700 Don Armstrong wrote: \n> > On Sun, 27 May 2007, Francesco Poli wrote:\n> [...]\n> > > Whatever the its origin is[1], the term \"proprietary\" is now a\n> > > well-established[2] word used as opposed to \"free\" (as in freedom).\n> > \n> > And no, it's not a well-established word in that regard. Like many\n> > terms in the Copyright/Trademark/Patent rights space, it gets\n> > missused by people who are not familiar with it and haven't\n> > bothered to consult a dictionary.\n> \n> If you consult a dictionary you won't find any reference to the FSD\n> or to the DFSG in the definition of the adjective \"free\".\n\nOf course, but the usage of free there is merely an extension of its\nactual english meaning.[1] We use \"free\" in our conversations about\nlicensing and software because of the meaning that it already\nposseses, not the other way around.\n\n> Please bear in mind that we are talking about technical meanings\n> that have to be defined in their field: a non-technical dictionary\n> won't help.\n\nThe word \"proprietary\" has a perfectly well defined meaning in this\nfield. It means closed or exclusive. That people mistakenly conflate\nit with being non-freeness has little to do with its actual meaning.\n\nThings that are non-proprietary are perfectly capable of being\nnon-free. See for example the works in non-free for which we actually\nhave source code. They are clearly not proprietary, but are definetly\nnot free.\n\n> I've sometimes seen the closed/open distinction used to refer to the\n> availability of source code (which is a necessary, but\n> non-sufficient, condition for freeness).\n\nIt can refer to that, but it can also refer to specifications,\nstandards, protocols, goods, etc. Exclusivity is nearly a synonym for\nproprietary.\n\n> I don't see the term \"proprietary\" as more confusing than \"free\".\n> Once they are defined in the context of software freedom, they are\n> perfectly clear to me.\n>\n> If, on the other hand, you insist that a dictionary must be\n> consulted, then you will find many meanings for the term \"free\"\n> (including \"gratuitous\"), none of which specifies which freedoms\n> should be granted over a piece of software in order to call it \"free\n> software\".\n\nEnglish has a great deal of words which have multiple definitions on\nwhich generations of english speakers have agreed upon and/or abused.\nThe meaning of a word which has multiple definitions is generally\nclarified from context, and if not, it's trival to ask.\n\nWhat you're attempting to do is not comparable; it's inventing new\ndefinitions for words which are not commonly or historically agreed\nupon.\n\n\nDon Armstrong\n\n1: Not surpisingly, the meaning we use is actually the first meaning\nin most dictionaries; gratis typically is found farther down.\n-- \nThe sheer ponderousness of the panel's opinion ... refutes its thesis\nfar more convincingly than anything I might say. The panel's labored\neffort to smother the Second Amendment by sheer body weight has all\nthe grace of a sumo wrestler trying to kill a rattlesnake by sitting\non it--and is just as likely to succeed.\n -- Alex Kozinski in Silveira V Lockyer\n\nhttp://www.donarmstrong.com              http://rzlab.ucr.edu\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}