{"category": "spam", "to_address": "Theorize <theorize@plg.uwaterloo.ca>", "from_address": "Donald Green <jeffii@gezairiturk.com>", "subject": "Explode your orgasm!", "body": "\n\nYou need to buy lots of meds, but you don't want to pay huge sums of money? \nOur site\nWe have only high-quality national medications at low prices. There is no need for someone to know about your sexual problems. \nClick here\nInstant shipping worldwide!\nWith best regards,\nDonald Green\n \n \nDazhe na takom rasstoianii ego sedok Pokazalsia mne opasno blizkim prishlos podniat vzgliad, chtoby ne upustit iz Vidu hishchnoe poluzverinoe lico etoj ustrashaiushchej mahiny. Eto bylo vyshe ego sil, s etim Nelzia bylo nichego podelat. Liubopytno. Staia neslas vpered. \nOstavte svoi ugrozy pri sebe, Niksard. Esli budet Neobhodimo, nadenesh na sebia moiu lichinu, chtob ni odin haaskin nichego ne Zapodozril. Zaberu etogo bedniagu Valigasa i pominaj kak zvali. Chto delaet chuzhoj na shelte, ne tak li? Imenno eto interesuet shefira? Na eto ia mogu otvetit. Sily Zla, da erunda vse eto. Shutka. Privstav v stremenah, Master izvlek iz svoej suti chistoe plamia i Tolknul ego ladoniami, tolknul pered soboj zhelto-krasnoj stenoj, vysokoj, vyshe Golovy vsadnika. Soznanie brodilo v potemkah, ne v silah vyrvatsia na voliu, porozhdaia Strannye videniia. \nOzhiv svoej sobstvennoj zhizniu, oskolki makama ustremilis k Gilsveri i Proshli skvoz ego zashchitu tak, slovno ee i ne sushchestvovalo. Sverkaiushchij Plastik parketa, stilizovannye pod fakely lampy na stenah, ot pola do Vysokogo potolka zatianutyh tiazhelymi skladkami nastoiashchego rozovogo barhata, Ogromnaia, v polpotolka, hrustalnaia mnogoiarusnaia liustra. Zheltye glaza goreli Vnutrennim ognem, pronikaia mne priamo v mozg. I vse zhe vsia eta istoriia s Celitelem i Nkotom po-prezhnemu Predstavlialas ochen zagadochnoj i ne davala mne pokoia svoej Nezavershennostiu, otkrytyh voprosov bylo eshche velikoe mnozhestvo. ejisuminyon UkFHXFBeQEp0RV1VHUFCUEZWRlleXR1XVA==\n \n\n\n"}