{"category": "ham", "to_address": "<ip-health@lists.essential.org>", "from_address": "\"MSF Michel Lotrowska\" <access@msf.org.br>", "subject": "[Ip-health] Brazilian speech at the 60th World Health Assembly", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nThis is this excerpt of the speech of the Minister of Foreign Affairs of\nBrazil - Ambassador Celso Amorim - this morning at the 60th World Health\nAssembly\n\n\n\n..Madam Chairman,\n\n\n\nBrazil has been scrupulously enforcing its intellectual property\ncommitments. But rules governing intellectual property, especially when they\nrelate to public health, must respond to the public interest. The TRIPS\nagreement itself recognizes this fact. Furthermore, the Doha Ministerial\nDeclaration on TRIPS and Public Health states that the TRIPS Agreement \"does\nnot and should not prevent Members from taking measures to protect public\nhealth\".\n\n\n\nOn May 4, 2007, President Lula determined the compulsory licensing of\npatents related to an anti-retroviral medicine used by the National STD/AIDS\nProgramme. This programme, which is mandatory by law, ensures free-of-cost,\nuniversal treatment to Brazilians infected with HIV/AIDS. It is\ninternationally recognized as an example of a successful public policy.\nApart from being entirely consistent with international rules on\nintellectual property, the measure adopted by the Brazilian Government has\nbeen taken in full transparency and respect towards the patent holder.\n\n\n\nThis time, not even those who are normally critics of any form of Government\naction in socio-economic affairs were able to deny that the measure taken by\nBrazil was unassailable either on moral or legal grounds. Some of them\nexpressed preoccupation with its negative impact on investment. But here one\nis led to ask: what kind of investment? Not in manufacturing of the\nmedicaments. Much less in R&D leading to new technologic advances, since, as\nwe all know, such activities are reserved for the headquarters of the big\npharmaceutical companies or, at most, for their affiliates in other\ndeveloped countries. In any case, no consideration of an economic nature can\nstand on the way of actions deemed to save tens of thousands of human lives.\nAs President Lula has said, commercial reasons of any sort, including\nprofits, cannot have precedence over the health of the Brazilian people or,\nfor that matter, any people.\n\n\n\nWhatever expertise and technology we are able to develop, we will be glad to\nshare with other countries, especially the poor nations in Africa, Asia and\nLatin America.\n\n\n\nThe WHO is currently involved in the examination of issues related to\nintellectual property from the perspective of public health. We are\nconfident that the Working Group on Intellectual Property, Innovation and\nPublic Health will build upon the flexibilities enjoyed by developing\ncountries, in order to find new and innovative ways to deal with the issue\nof better, free access, to healthcare for those who need it most.\n\n\n\nMadam Chairman,\n\n\n\nIt has often been said that hunger does not result from lack of food, but\nfrom lack of income. Likewise, disease is often not caused by the absence of\nmedicines, but by the absence of adequate means to have access to them.\nThis, along with the promotion of R&D in developing countries, is the\nbiggest challenge faced by this Organization.\n\n\n\nThank you.\n\n\n\n--\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}