{"category": "spam", "to_address": "", "from_address": "foreignpb2002 <foreignpb2002@yahoo.com>", "subject": "CONFIDENTIAL AND VERY URGENT", "body": "\nFROM: MOHAMMED USMAN TAFIQ.\nAMMAN JORDAN.\nEmail: usmanahmed007@o2.pl\n\nHello Dear,\n\nMy Name is Mohammed Usman Tafiq, an Iraqis National from the Kurds an\nAccountant in Oil refinery in Durra. I am presently in Amman, Jordan Capital since U.S.strike Iraqi, few days to the expiration of the 48 hours Ultimatum before the strike.\n\nI moved $45.5 Million dollars call-deposit to Security Company in Iran for safe-keeping.In my capacity as the accountant to the oil refinery in durra, I was the only person aware of this financial\ntransaction call-deposit with the security company in Iran to be released to whom I will introduce to the security company as the beneficiary of the call-deposit of $45.5M, whom the oil installation company is been owed since I can not be able to go to Iran because of the war.\n\nNow that the situation is not condusive for me to go to Iran and the WAR in my country becoming worse, I am appealing to you if i can present you as the beneficiary of the call-deposit to the security company for the release of the deposit to your Account or any of your destination as part of the money being owed to you by Durra oil Refinery Company Iraq.\n\nAs soon as this deposit is released to your Account by the security company in Iran or any of your destination, I will come over to meet you  for disbursement 30%-70% . On your acceptance on this transaction I will send to you the deposit slip Certificate for the call deposit to you as the beneficiary to be release to you as part of the refunds owed to you by Durra Oil RefineryBcompany Iraq.\n\nPlease do not fail to contact me through this E-mail address: \nusmanahmed007@o2.pl\n\nAwaiting your quick response,\n\nBest Regards,\nMohammed Usman Tafiq.\n\n___________________________________________________________________________\nMail enviado utilizando el servicio de WebMail de PHP-Nuke Powered Site\n- http://tusitio.com\n\n"}