{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nSunday, 17 June, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nBeckham primed for title decider\nDavid Beckham hopes to end his Real Madrid career on a high by helping the club win the title before he leaves to join LA Galaxy.\n\n\n\n \nMotherwell to announce new boss\nMotherwell owner John Boyle says the club will reveal the identity of their new manager on Tuesday.\n\n\n\n \nBlades set for tribunal decision\nSheffield United are hoping an independent arbitration panel will overturn their relegation from the Premier League this week.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nLive - US Open\nLeader Aaron Baddeley will tee off with Tiger Woods at 2000 BST in the final round at Oakmont.\n\n\n\n \nWoods calls on 'major experience'\nTiger Woods is confident he can see off golf's younger guard and win his 13th major at the US Open on Sunday.\n\n\n\n \nBaddeley in front but Tiger looms\nAaron Baddeley will take a two-shot lead into the final round of the US Open but the chasing pack is led by Tiger Woods.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nLive - US Grand Prix\nBriton Lewis Hamilton starts on pole at Indianapolis aiming for his second straight Formula One win.\n\n\n\n \nBayliss celebrates double success\nTroy Bayliss wins both races in San Marino to cut James Toseland's lead in the World Superbikes standings.\n\n\n\n \nAudi win to retain Le Mans crown\nAudi's No 1 car comes home first in the Le Man 24-Hours race in France.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nLive - US Grand Prix\nBriton Lewis Hamilton starts on pole at Indianapolis aiming for his second straight Formula One win.\n\n\n\n \nHamilton on pole at US Grand Prix\nBritain's Lewis Hamilton pips McLaren team-mate Fernando Alonso to pole at the US GP at Indianapolis.\n\n\n\n \nUS GP's future set to be decided\nF1 supremo Bernie Ecclestone will decide the future of the US Grand Prix by mid-July, say Indianapolis officials.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nDevonish best dashed by mistake\nMarlon Devonish could see his 100m personal best removed from the records because of an administrative mistake in Oslo.\n\n\n\n \nIdowu shines in Golden League win\nPhillips Idowu beats the world's best triple jumpers to claim the opening Golden League meeting in Oslo.\n\n\n\n \nYelling withdraws from GB squad\nLiz Yelling pulls out of the GB marathon squad for this summer's World Athletics Championships in Osaka.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nMoreau secures Dauphine victory\nFrenchman Christophe Moreau wins the Dauphine Libere after a rain-hit final stage is won by Alexandre Vinokourov.\n\n\n\n \nUnibet blasts cycling 'scandal'\nAn online gaming firm says a decision to ban the cycling team it sponsors from the Tour de France is a \"scandal\".\n\n\n\n \nMoreau into lead as Iglinsky wins\nFrenchman Christophe Moreau leads the Dauphine Libere after the sixth stage is won by Kazakhstan's Maxim Iglinsky.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nReview of the week\nMichael Vaughan hits the town as Messi keeps his hand in\n\n\n\n \nQuotes of the Week\nRamon Calderon on David Beckham, plus Lewis Hamilton and Graham Taylor\n\n\n\n \nTen to Tackle\nTest your knowledge of the last seven days in sport\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}