{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "Tonight on CNN <mailings@mail.cnn.com>", "subject": "Can a comic make it on Capitol Hill?", "body": "\n\n\n\nTonight On CNN Email\n\n\n\n\n\n\n\nApril 11, 2007\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n9 p.m. ET\n\n\n \n\nLARRY KING LIVE: Al Franken\n\n\nCan a comedian make it in politics? Al Franken gives his first prime-time interview since entering a Senate race in Minnesota. He tells Larry King why he's running -- and what he thinks about Don Imus. Watch tonight, 9 p.m. ET, on CNN!\n\n\n\n\n\n\n\n\n\n \n \n\n\n\n\n\n \n\n\n\n\n6:00 a.m. ET\n\n\n \n\nAmerican Morning\n\n\nThe inside scoop on home buying and selling. From mortgage rates to closing costs, get the most news in the morning about your American home.\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n6:00 p.m. ET\n\n\n \n\nLou Dobbs Tonight\n\n\nWe'll explore why workers are demanding special treatment form their employers based on their religious beliefs.\n\n\n\n\n\n\n\n7:00 p.m. ET\n\n\n \n\nThe Situation Room\n\n\nSen. Chris Dodd announced his presidential run on the Don Imus show. Now what does he have to say?  He'll tell us in \"The Situation Room.\"\n\n\n\n\n\n\n\n8:00 p.m. ET\n\n\n \n\nPaula Zahn NOW: Out in the Open\n\n\nIs the American dream now an American nightmare? Immigrants are one of the hardest hit in the mortgage meltdown. You'll be amazed to find out why. \"Debtor Nation\" series continues.\n\n\n\n\n\n\n\n9:00 p.m. ET\n\n\n \n\nLarry King Live\n\n\nCan a comedian make it in politics? Al Franken gives his first prime-time interview since entering a Senate race in Minnesota. He tells Larry King why he's running.\n\n\n\n\n\n\n\n10:00 p.m. ET\n\n\n \n\nAnderson Cooper 360\n\n\nDon Imus has a track record when it comes to uttering racial slurs.  Should his sponsors and even his guests be held accountable too?  Anderson Cooper is keeping them honest.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n\nSend us your feedback >  |  CNN's full program schedule >  |  E–mail sign up >\n\n\n\n\n \n \n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network LP, LLLP.\nA Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us. \n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the Tonight on CNN list, click here. \n\n\n\n\n\n\n\n"}