{"category": "ham", "to_address": "debian-desktop@lists.debian.org", "from_address": "\"Gustavo Franco\" <stratus@debian.org>", "subject": "Re: Debian Desktop Etch+1 - the long road to binoculars.", "body": "On 6/28/07, Sebastian Heinlein  wrote:\n> Am Mittwoch, den 27.06.2007, 16:55 -0300 schrieb Gustavo Franco:\n>\n> > * Flash and Java support\n> >\n> > It would be amazing if we could add stable enough: gnash or swfdec\n> > (flash) and basically gcjwebplugin (java) or maybe something that will\n> > come out from openjdk.\n>\n> Asac works on a kind of gnome-plugin-install based on gnome-app-install\n> for Ubuntu.\n\nDoes it install the non-free plugins? If it install the free ones we\ncan push them directly through the tasks, unfortunately not now since\nthe upstream code isn't mature enough.\n\n> > I've already seen people watching movie trailers from Apple website\n> > (as I do) using Debian Desktop Etch without considering what was under\n> > the hood to make that possible. We picked totem mozilla (gecko) based\n> > browsers plugin with xine backend (packages: totem-mozilla and\n> > totem-xine). Avoid gstreamer usage was intentional. I would be glad to\n> > review such a decision, but with proof that we can support more\n> > formats out of the box (about:plugins is your friend).\n>\n> Gstreamer improved a lot recently and it does support gnome-vfs.\n\nI'll look into this, but do you know how it compares with the xine\nbackend actually?\n\n> > * Upgrade manager (update-manager)\n> >\n> > I've discussed with kov some of the stuff that can be done to make\n> > sure Debian Desktop Etch upgrades to Lenny will be easier than\n> > Sarge->Etch.\n>\n> I am going to remove the Ubuntu specific parts of the latest\n> update-manager soon, so that we can update the Debian package.\n> Furthermore mvo did a great job in providing a dist-upgrade (with\n> terminal, gtk and qt frontend) tool that is quite flexibel and could be\n> extended for Debian. Perhaps it is also worth to look at his update unit\n> tests for Ubuntu.\n\nSounds good. Are you coordinating with Gustavo Noronha (kov) too ? He\nworks on the package in Debian as you might now and AFAIK has some\ncontributions all over the code.\n\nthanks,\n-- stratus\nhttp://stratusandtheswirl.blogspot.com\nget debian @ http://get.debian.net/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}