{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@speedy.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "abecedarian: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Monday, April  9, 2007\nabecedarian \\ay-bee-see-DAIR-ee-uhn\\, noun:\n1. One who is learning the alphabet; hence, a beginner.\n2. One engaged in teaching the alphabet.\n3. Pertaining to the letters of the alphabet.\n4. Arranged alphabetically.\n5. Rudimentary; elementary.\nLorraine Heggessey and executive producer Jeremy Mills adroitly tapped into a national obsession at exactly the right time, presenting the topic in a way that appealed to experts and abecedarians alike. -- Victor Lewis-Smith, \"Lords of the mobile dance\", The Evening Standard, June 11, 2001\nWhile much of the work resembled abecedarian attempts of a novice choreographer, \"Duet,\" sensitively danced by Jennifer A. Cooper and William Petroni, is surprisingly sophisticated in its careful deployment of formal thematic manipulations in the service of emotional expression. -- Lisa Jo Sagolla, \"Open 24 Hours Dance Company\", Back Stage, September 1, 1998\nThe approach may seem abecedarian today, but his was among the first endeavors of the sort. -- Jennifer Liese, \"May 1973\", ArtForum, May 2003\nIt is also quite abecedarian in that it presents introductory material apt to be known by all linguists and Semitists. -- Alan S. Kaye, \"Linguistics and Biblical Hebrew\", Journal of the American Oriental Society, January 1, 1994\nColumba's poem is fittingly 'abecedarian', each stanza starts with a subsequent letter of the alphabet -- a harbinger of the Scottish appetite for cataloguing, and delight in craft. -- WN Herbert, \"A rhyme and a prayer\", Scotland on Sunday, December 10, 2000\nAbecedarian derives from Latin abecedarius, from the first four letters of the alphabet.\nDictionary.com Entry and Pronunciation for abecedarian\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9224459-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}