{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "410p 6/22 Update: Atlantis lands at Edwards", "body": "\n\n\n\n\n410p 6/22 Update: Atlantis lands at Edwards\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 93\nPosted: 04:00 PM, 6/22/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-89 (06/22/07): Astronauts gear up for entry\n   SR-90 (06/22/07): Updated weather forecast\n   SR-91 (06/22/07): NASA waves off first Florida landing attempt\n   SR-92 (06/22/07): Atlantis diverted to California; landing on tap at 3:50 p.m. EDT\n   SR-93 (06/22/07): Shuttle Atlantis glides to California landing\n\n=================================\n\n04:00 PM, 6/22/07, Update: Atlantis glides to California landing\n\nRunning a day late because of blustery Florida weather, the space shuttle Atlantis dropped out of a sunny Mojave Desert sky and swooped to a smooth touchdown on runway 22 at Edwards Air Force Base, Calif., to close out an action-packed space station assembly mission.\n\nFlying upside down and backward over the Indian Ocean half a world away, shuttle commander Rick Sturckow and pilot Lee Archambault fired Atlantis' twin braking rockets at 2:43:47 p.m. EDT for 2 minutes and 33 seconds, slowing the ship by about 200 mph - just enough to drop it into the atmosphere for an hourlong glide back to Earth.\n\nThe astronauts had hoped to return to Florida, but cloudy weather and rain showers prevented a landing Thursday. With a forecast for more of the same on tap today, entry Flight Director Norm Knight diverted the crew to Edwards one orbit after waving off the first of two opportunities to land at the Kennedy Space Center.\n\nApproaching California from the southwest just off the Baja peninsula, Atlantis streaked above San Diego in a steep descent toward Edwards some 100 miles northeast of Los Angeles. Heralded by twin sonic booms, Sturckow took over manual control as the shuttle descended through 50,000 feet, guided the orbiter through a sweeping right overhead turn and then down to a picture-perfect touchdown on runway 22 at 3:49:38 p.m. EDT.\n\n\"Houston, Atlantis, wheels stopped,\" Sturckow radioed mission control when the shuttle rolled to a halt.\n\n\"Atlantis, Houston, copy wheels stopped. Welcome back, congratulations on a great mission,\" replied astronaut Dominic \"Tony\" Antonelli from the Johnson Space Center.\n\nFlight surgeons were standing by to assist returning space station astronaut Sunita Williams, who made the trip back to Earth resting on her back in a recumbent seat bolted to the floor of the shuttle's lower deck. Launched to the station last December, Williams logged 195 days off the planet - a single-flight record for female astronauts.\n\n\"I can't wait to get back and feel the air on my face and the sea breeze,\" Williams told a reporter Wednesday. \"I'm looking forward to hopefully going to the beach and taking a walk with my husband and my dog. That's the first thing. And secondly, I just can't wait for a good piece of pizza.\"\n\nAnd a hair cut.\n\n\"I think I'm going to have a lot flatter hair when I get back,\" she laughed. \"So I think I'm going to have to work on getting a hair cut as soon as I get back so it looks a little bit normal. I have been living like this with hair up and flying around for a little while, so it's going to be funny to see what it looks like when I get home.\"\n\nShe might get the haircut, but it might be a while before Williams feels up to a stroll on the beach. It typically takes returning space station astronauts a month or so to get their land legs back and up to a full year to completely recover from the bone and muscle loss associated with long stays in weightlessness.\n\nWilliams said earlier she had exercised as required throughout her stay aboard the station and she did not anticipate any major problems readapting to gravity.\n\nHer shuttle crewmates - Sturckow, Archambault, flight engineer Steve Swanson, Pat Forrester, Danny Olivas and Jim Reilly - were expected to doff their pressure suits and greet NASA officials on the runway for a quick inspection of the orbiter. All seven astronauts plan to spend the night at Edwards before flying back to the Johnson Space Center on Saturday.\n\nMission duration was 13 days 20 hours 11 minutes and 34 seconds covering 219 complete orbits and 5.8 million miles since blastoff June 8.\n\nAtlantis blasted off three months late because of hail damage to the ship's external fuel tank. The shuttle's primary payload was a 36,000-pound $367 million solar array truss segment, along with a fresh station crew member - Clay Anderson - to replace Williams.\n\nThe S3/S4 solar array truss was attached to the right side of the lab's main power truss the day after docking and hooked up during three spacewalks by Reilly, Olivas, Swanson and Forrester. The astronauts also completed the retraction of another set of arrays that must be repositioned later this year.\n\nBecause of concern about a peeled-back insulation blanket on the shuttle's left-side Orbital Maneuvering System rocket pod, NASA managers extended the shuttle flight two days and added a fourth spacewalk to give the crew time to make repairs and complete their other work. The repair job eventually was added to the third spacewalk and Olivas, anchored to the end of the shuttle's robot arm, pushed the blanket back down and used a surgical stapler and stainless steel pins to hold it in place.\n\nEngineers will examine the rocket pod later to make sure it didn't suffer any heat damage during re-entry. But the blanket appeared intact and in place on the runway, indicating the repair job worked as expected. The shuttle's critical nose cape, wing leading edge panels and heat-shield tiles showed no obvious signs of any major damage.\n\nAtlantis' mission was challenging enough without major space station problems but that's exactly what happened last week during installation of the S3/S4 solar array truss. At roughly the same time the new arrays were attached, the Russian command module's three guidance, navigation and control computers, known collectively as the terminal computer, along with three high-level command-and-control machines known as the central computer, failed to reboot after the guidance system crashed. After three days of around-the-clock troubleshooting, Russian engineers asked station commander Fyodor Yurchikhin and flight engineer Oleg Kotov to install jumper cables to bypass suspect secondary power supply switches.\n\nThe repair worked and after additional tests and checkout, two computers, or \"lanes,\" in each system were brought back on line. The other two were kept off line in backup mode. But engineers still don't know what caused the so-called soft switches in the secondary power supplies to act up. The circuitry is designed to cut off power to the computers if the incoming electricity isn't stable to within fairly narrow parameters.\n\nSome engineers suspected the new solar arrays caused some slight change in the station's power grid that affected the power supply switches. But during a test last Friday, the computers were isolated from the new arrays and they still failed to boot up. Yurchikhin and Kotov then bypassed the secondary power supply switches and all six computers ultimately were successfully activated.\n\nOn Thursday, the two off-line backup computers - lane No. 1 of the central computer and lane No. 2 in the terminal computer - were powered back up, verified to be healthy and then shut down so Yurchikhin and Kotov could remove the power supply bypass jumpers in a test to help engineers determine whether the cause of last week's problem was transitory or the result of some ongoing issue.\n\nBut the computers failed to boot up without the jumpers, indicating whatever caused the problem last week is still there, or at least the problem in the power supplies is still present. Russian mission managers plan to launch replacement computer gear aboard an unmanned Progress supply ship scheduled for takeoff July 22. But before they install any new gear, engineers would like to pin down the root cause of the earlier computer problems.\n\nNext up for NASA is launch of the shuttle Endeavour around Aug. 7 to deliver a short spacer segment that will be attached to the S4 solar array permitting the eventual attachment of a new set of arrays - S6 - next year. The crew also will deliver an external equipment storage platform.\n\nThe Endeavour mission features educator-astronaut Barbara Morgan, backup to Challenger \"teacher-in-space\" Christa McAuliffe. Morgan is now a full-fledged astronaut making her first flight.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}