{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle and Bethea<rochelle@myhealthwealthandhappiness.com>", "subject": "As a Leo, Memo, you're due to get 36 days of extraordinary good luck", "body": "\nMagick Eletter\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMemo, 34 could be the year when everything turns around for you... \n...because now you'll have the power of secrets guarded carefully for thousands of years!\n\nDear Memo,\nI'm so excited because soon your fortunes will shine like the brightest star... \n    Because you were born  a Leo, you're about to have 36 days of extraordinary positive energy that could bring on a gold rush of good luck and opportunity, starting June 26th, 2007.\n    And I know this is true since I've had over 2 months now to examine the forces affecting your chart and to understand how they'll affect you.\n    From the beginning, Memo, you've shown you have an open mind and the precious faith that your life can be better.  That made me realize that my dear friend, Bernard C. Bieler de Buhem, has something that will be perfect for you.\n    Bernard is ready to pass on a secret to you...exclusive knowledge that has helped people like you for thousands of years.\n\n\n\n\n\n\n    An international scholar, author and psychic astrologer, Bernard has used this ancient power to make his own life and the lives of his friends and clients richer, more loving and extraordinarily successful.\n    You'll see exactly what I mean when you hear from Bernard yourself.  All I ask is that you keep your open mind and positive outlook going strong, so you can join forces with Bernard to get the most from the incredible lucky period opening up for you in the weeks just ahead...\n\nDear Memo,\n    If you have been looking for the exact right time to change your life...let me make one thing crystal clear, there will never be a better time than right now. If you're looking for money, if you want happier, more satisfying relationships, if you want the good life, please let me help you. I guarantee you'll be delighted with what you find!\n\nAnd to make it even easier for you to connect with the powers of Good Fortune favoring you now... I'm going to send you this specially-designed PROSPERITY TALISMAN, as my FREE Gift to help ensure your success!\n    Memo, please take a moment to get comfortable now...because if you give me your full attention, for just a few minutes, I will show you how you can easily connect with the extremely beneficial power of the unique Venus-Mercury aspect, starting June 26th. \n    This promises to be the beginning of something huge. Believe me, my dear, the stars have blessed you.  In fact, I can't imagine the future for  a Leo, being any better.\n    Unfortunately, not everyone who can take advantage of this blessing will actually do so. But, I am sure you will be one of the lucky ones who do..., not only because you have read this far, but also because I know how special you are and how much I believe in you.\n    And if you let me help you, Memo, I'll even go so far as to say that in a month or so from now, you will be so thankful you received this letter.\nHere's why I'm sure of what I am telling you\n    As a psychic, knowledge of certain things just comes to me.  I've devoted my life to gaining a deeper understanding of the forces behind my psychic perception.  I have traveled the world...Africa, Asia and Europe...to study astrology, metaphysics and ancient sciences with the greatest Teachers and Initiates of the spiritual world. Thanks to them, my gift and my power over it has grown even stronger.  And after decades in my field, I've come to deeply trust the knowledge that comes to me.\n    That is how I know this is a crucial time for you. I know you can benefit from it. You don't even have to believe me, because if I am wrong...about any of this...my help is FREE!\n    Additionally, the planets have all aligned themselves in an incredibly positive way.  From Venus, which brings love and money and makes life sweet...to Mercury which transmits good luck, joy and rewards...to Uranus the planet of magick, wishes, and unexpected gains  -- these alignments couldn't be better. Believe me, this is something unique.\n    And then there are the incredible houses where the planets will fall in your horoscope. For example, the 2nd house represents material and financial resources and the ability to earn money, and the 4th house represents security and family matters.\n    And it gets better, because these planets can also activate the 7th house which represents long-term partnerships that bring love and money, the 8th house which represents financial windfalls, inheritances, and lottery winnings...and especially the 11th house which represents your highest aspirations.\n    I'm telling you, Memo, Someone Upstairs must really like you. I have never seen anything close to this in all my life. \nThis just might be the miracle you've been needing!\n    Before I go into details, let me backtrack for a second, because you will need to believe what I'm telling you is real. This way you can act upon this information so you can reap the full benefits.\n    And even though I really hate talking about myself, you will find some pertinent information just below to aid you in this. I hope it convinces you to act quickly...because I don't want you to miss a minute of what could be a bright new future filled with endless possibilities for luck, money and complete fulfillment.\n    For more than 20 years, I have studied, practiced and written extensively about magick, astrology and other metaphysical phenomena.  I use it to advise and empower people from almost every walk of life, from industrial CEOs, to students, to homemakers...and virtually everyone in between.  I tell you this, not to boast about myself, but so you will take what I'm saying about this incredible opportunity seriously.\n    More importantly, the sooner you accept my help...the sooner I can guide and advise you through every important decision and every opportunity, during what could be the greatest period in your life.\nNow, let me show you just a bit about this powerand how it can help you and others.\n    As reported in such papers as The Boston Globe and The Gloucester Daily Times, one practitioner used these secrets to help a Florida mother find her missing daughter and the police to find a victim's body so they could arrest the murderer.\n\n\n\n\nIn another case, a lonely, divorced man needed help with finding a new love.  Although it had been years since his marriage ended, he had been unable to meet anyone and was just about ready to give up on dating.  With the help of Magick, he was able to meet someone very special in just a month...and by the end of the year, he had three lovely ladies vying for his affection!\n    Magick helped to remedy an urgent situation when a woman found she did not have enough money to pay for a necessary surgical procedure and couldn't take on a second job.  She sought the aid of an expert in magick who helped attract the money. Within a week she had the $21,000.00 she needed -- without having to do anything to earn it.\n    I truly believe you can have the same happy results, Memo, once you discover how to access this power. Best of all, it's easy, fun to do and will make you feel confident and just plain good!\nThis Is an Exclusive Invitation for You, Memo...to Gain Extraordinary Knowledge and Power\n    I want to hand you the keys to an incredible power. A power that can do everything from attracting money and love to preventing illness and loss, even help keep you safe from misfortune.\n    With the methods I will share with you, you'll be able to use this power for the things that are most important to you -- such as increasing your wealth and attracting good relationships, luck, success in a certain endeavor, or any other wish that is important to you.\n    Now, Memo, it's important to understand what the power of Magick really is. And please, don't confuse this true Magick with the kind of fake magic (without the \"k\") you see by magicians or illusionists on TV...they are not the same!\nWhere Magick Comes From and Who Has Used It\n\n\n\n\nThousands of years ago, when human beings lived closer to the land, they revered the many mysterious forces of nature that affected them. Certain individuals at that time had a special talent for connecting with and using natural forces to create harmony, bring comfort and relief and to create better conditions for all.\n    In time, these individuals became known as shamans, healers and priests. Many of the greatest heroes of the Bible, like Moses, were among these people who helped and intervened in behalf of others.\n    Perhaps the most famous were \"The Magi,\" the 3 Wise Men who followed the Star of Bethlehem to bear gifts and blessings to the newborn Jesus.  It is believed The Magi were astrologers, following, as they did, a Star.  And of course, the words \"Magick\" and \"Magi\" come from the same root, meaning \"great wisdom and knowledge.\"\n    In the thousands of years since then, religion veered away from its natural spiritual roots. But the ancient Celtic people, known as the Druids, preserved the old ways and passed them down to us today -- in what is now known as Magick or Wicca. \nLet me tell you why I am so positive about this...\n    I had the most amazing vision that I believe is symbolic of the potential and promise of this period for you.\n\n     I see a person driving in a car down a deserted two-lane road, through a flat and empty landscape. Grey clouds gather above. As the car rolls on, the driver becomes concerns about being alone and isolated.\n    In the distance, the driver spots a fork in the road, slows down as it approaches, then rolls to a stop. Looking from side to side, the driver's confusion turns to worry as rain starts to fall and a strong wind whips against the car.\n    Then a figure appears and walks toward the car. The apprehension on the driver's face quickly turns to calm as the driver sees a smiling old man whose face is kind, understanding and knowing. \n    In a gentle voice, the old man says, \"Take the road on the right, it leads to where you want to go. You will be delighted with the good fortune you will find there.\" \nWhat I think this vision means for your future...\n    I bet you can already sense what I am going to say. Can you see yourself in this vision? Can you see why I believe it refers to you and your life? Can you see that the golden glow and the bright new path are symbolic of a future that will be incredibly enriching and rewarding?\n    Let me tell you, Memo, I am certain it does.\n    I am seldom wrong about my visions. More importantly, when these visions match what I have seen or see in the stars, amazing things often happen. So I suggest, especially since you have absolutely nothing to lose and everything to gain, that you let me help you use this time to get on the road to the better days, weeks and months you truly deserve.\nHow I am going to help you take advantage of this opportunity\n    If you are ready to start having good times that could involve winning a large sum of money, travel, a new home, and almost certainly rediscovering someone special...\n    Whatever you may feel is missing from your life -- be it wealth, love, companionship, freedom from debt, or simply personal power and fulfillment -- I am convinced that Magick can help you get it.\n    And to show you how easy it is to get all this, I want you to have the incredible collection of mystical spells and essential practices in:\n\"MAGICKAL FORCES\"\n    Since you are one of the select people with whom I will share this precious and sacred knowledge, I especially want to see you benefit from these powerful secrets!\n  Here's what you'll find in  \"MAGICKAL FORCES\"  \n\nYou'll discover that Magick is first and foremost a way of understanding life. You'll see that practitioners of Magick use many of the same rituals used in religious ceremonies...like lighting candles and incense, and even prayer. \nYou'll appreciate the practical side of Magick -- how to put together spells for protection, prosperity, success and love. For example, one woman recently used a protection spell to safeguard her house after there was a burglary in her neighborhood.\nYou'll see how to use everyday items like herbs, incense and positive affirmations in your spells. Affirmations are statements that help make something come true. For example, a man short of cash recently used a money affirmation and got an unexpected refund check from the government.\nYou'll discover the Magick of colors, crystals, oils, incense and plants and how all these things can really boost and intensify the power of your spells!\nYou'll find out how to perform ceremonies, like what is called an \"emotional housecleaning,\" that can clear away negative energies and anything that is blocking happiness, luck and prosperity from flowing freely in your life.\nLet Me Show You How Powerful This Can Be:\n    Mark, a talented carpenter and craftsman, always wanted to buy a \"fixer-upper,\" a house he could use his skills to renovate and increase its value.  But his own fear of failure kept attracting obstacles that frustrated his dream. So he used a \"success ritual\" -- the same one I will share with you.\n    Six weeks later, he got the house he was looking for at the price he wanted to pay, and he has increased its value by many times what he paid.  The fulfillment of this one wish enabled him to invest in additional properties and launched him on a cycle of ongoing, multiplying prosperity that shows no sign of stopping!\n    And there's so much more...You'll also discover the Four Forces of Nature, and how they can enhance all your Magickal work. You'll see how powerful Amulets, Talismans and Mojos can change your luck instantly. You'll discover the Magickal properties of different materials like silk, cedar, parchment paper...and how you can \"charge\" these materials to amplify their strength.\n    Memo, with your open mind, positive outlook and sensitive instincts, you'll need only a few hours to start using Magick to help make dreams come true for yourself or someone you care about.\nAnd to help you connect with this powerful force, I will give you this FREE GIFT!\nYOUR PROSPERITY TALISMAN \n\n\n\n\n\nThis is the special talisman, designed for you, as you begin your journey in the fascinating world of Magick! Based on the Holy Pentacle, or Great Seal, this sigil includes the names of the 7 most powerful Ancient Egyptian deities, who are known to repelling harm.\nThe names on the inner septagon are spirits called on to find love, win promotions or success, and attain wealth. Everything is contained in a circle that represents the Universe and humanity.\n    In the center is the sigil for Prosperity, created with the Table of Saturn, the planet that rules banks, real estate and investments. In front is a pentagram, representing the spirit. All around is an ancient inscription used to invoke powerful magick.\n    Usually, a talisman like this would be very costly and difficult to obtain. But because I know what this special power can do for you, I'm giving you the Prosperity Talisman FREE!\nI understand that you may never have tried anythinglike this before in your life.\n    I know the idea of Magick might seem strange or even a little scary.  You might wonder, \"What if it doesn't work? Won't I feel stupid? Won't people think it's silly?\"\n    But I also know that you are not the kind of person who will rule out a promising idea based only on what other people say...or at least without first seeing for yourself if it's for real.\n    Memo, don't make up your mind just based on what I say.  See for yourself how many people are already using Magick to help turn events and decisions their way.  If you do that you'll be amazed...and I trust that your doubts will disappear.\n    Think of the most successful people you know. How do you suppose they got that way? Not because they're incredibly lucky -- but because they're incredibly good at overcoming obstacles.\nAnd that's what Magick will do for you, Memo...give you a powerful way to overcome your own obstaclesand clear your path to joy and fulfillment.\n    Sure, some people might say it's unusual. But I can tell you have more imagination than that! An open mind, a sense of adventure and the willingness to try something new are all you need. \n    Look at it this way...how are the old ways working for you?  Have you been doing the same thing but never getting a different result?  Always dealing with the same hardship and disappointment and tired of it all?  Then it's absolutely the right time to try something new! And if you're ready to take a fresh approach, everything can change for you in brilliantly positive ways.\n    The truth is, Memo, it's your life. You are the one who can decide to stick with the same-old, same-old, or to take a bold step towards living the way you really want!\n    You deserve better, and you can have more!\nI believe this could be the answer you've been looking for.\n    I want to share these very special enchanted magickal secrets and tips with you, so you can take full advantage of all the luck and opportunity coming your way, and of course, I will send you my most positive magickal vibrations of success and joy to make sure everything possible goes your way.\nIf You Want the Good Life -- Now Is the Time to Prepare\nAnd I guarantee you will be happy with what you'll discover!\n    So if you're willing to have some fun, and maybe change your life...I believe you're ready to become a part of the select group of people who have been entrusted with these secrets!\n    Here's All You Have to Do:\n    Just click the button below, Memo, and you can bring the life-and-luck-changing power and benefits of Magick.\n    And now that I've had the honor of making your acquaintance, I want to make it as easy as possible for you to obtain your \"MAGICKAL FORCES\" Guide. Because you are a friend of Bethea's, I am making these powerful secrets available to you at a special price of $14.95.  That's a 60 percent discount and a savings of more than $15.00 for you.\nAnd with my Unconditional Lifetime Moneyback GuaranteeYou can try this without any kind of risk!\n    Not only do I think you're perfect for this, I know you will have so much fun discovering the power of Magick and using these exciting secrets to help make life brighter and richer for yourself and your loved ones.\n    And with the protection of my Unconditional Lifetime Moneyback Guarantee, you can have and use these Magickal Secrets for as long as you want. Remember: If at any time, for any reason, you are not totally thrilled by what I show you...just send back your book, and I will return every penny you paid, including the shipping and handling,...with no explanation necessary.  So, in effect, you can get all these secrets and ancient knowledge FREE. But you must keep your Prosperity Talisman--no matter what, so you can at least be in touch with the good fortune surrounding you.\n    Memo, I cannot encourage you enough to take part in this wonderful adventure and see what Magick can do for you. Please click the button below right away. I guarantee you will be thrilled with your results. (I am seldom wrong about the people I select.)     Your friend and mentor,\n\n    Bernard C. Bieler de Buhem \n\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for offers and discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford CT 06460-3400.\n\n"}