{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Terry Hancock <hancock@anansispaceworks.com>", "subject": "Re: License concerns regarding package lft", "body": "MJ Ray wrote:\n> Terry Hancock \n> So, in your opinion, houses are not made using tools and binary packages\n> are not made using compilers?\n\nNo, what I *said* is that \"tools\" are not \"materials\", which they are\nnot -- at least not unless you use them as such. If you build a house\nout of hammers, *then* the hammers are \"materials\", otherwise, they are\n\"tools\".\n\nAnd yes of course that means that hammers used to build one house and\nthen used as materials for another are both \"tools\" and \"materials\", but\nit is a foregone conclusion in a license text that definitions are\nrelative to the work being licensed! When a license says \"derivative\",\nwe all understand without being told that \"derivative of the work being\nlicensed\" is meant, and not \"derivative of some other, unrelated work\".\n\nHence, when we say \"materials\", we mean \"used AS materials\", not \"things\nthat could in principle be used as materials but were in fact used as\ntools\".\n\nBecause the license does say \"materials\", it confines the meaning of the\nword \"using\" (which can have multiple meanings -- a flaw in the wording,\nbut not a flaw in the intent).\n\nThe strawman you are attempting to bait me with is an assertion of the\nexact opposite claim: i.e. that \"using\" not only confines the meaning of\n\"materials\" but that it would confine the meaning of a word like \"tools\"\nto mean \"materials\".\n\nThis claim is obviously false. However, that has no bearing at all on\nwhat I said. In fact, it is the nature of the word \"using\" to be almost\nentirely defined by the noun: to \"use X\" means \"to do whatever you\nnormally do with X\". Thus, the meaning of \"use materials\" lies entirely\nin the definition of \"materials\".\n\nHence, the definition of the word -- which you did not refute -- is what\ndetermines the meaning of that phrase in the license.\n\nCheers,\nTerry\n\n-- \nTerry Hancock (hancock@AnansiSpaceworks.com)\nAnansi Spaceworks http://www.AnansiSpaceworks.com\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}