{"category": "spam", "to_address": "Gnitpick <gnitpick@flax9.uwaterloo.ca>", "from_address": "Margaret Schneider <semdu@gk-ag.com>", "subject": "Can't stand sex all day long?", "body": "\n\nThere is no need to exert yourself with silly doubts while you are in bed.\nClick here to be the best lover in the world!\nWith Viagra from RX Online Drug Store you will have perfect sex.\nClick to visit us\nThe highest quality, cheap prices, instant shipping worldwide, friendly support!\nWith best regards,\nMargaret Schneider\n \n \nNe stoilo etogo zabyvat. No ia ne vizhu drugogo sposoba tvoej Zashchity. Parenek toroplivo proshel mimo Gronta i zaglianul v komnatu, iz kotoroj tak Stremitelno vyshel Niksard Aga, Bochonok vse-taki zdes! Traktirshchik nepodvizhno stoial vozle pustoj posteli, tesak valialsia na polu Vozle ego nog. Eshche ne pozdno prisoedinitsia k Gilsveri. \nOstalos prosto goriachee dyhanie. Ia slyshal, chto tebe vse-taki udalos pokinut sheltu. Dolgo ne proderzhitsia, ponial Gront. K gorlu podstupila toshnota, pered glazami vse poplylo, i on Pospeshil opustitsia na kortochki, vzhavshis spinoj v stenu i pytaias s soboj Spravitsia. Obretia Klinki, my rinulis v boj i smertelno porazili Tvar, no v agonii Ona uspela vypustit svoih zarodyshej semena, i zvezdnyj svet raznes ih po Galaktike. Dazhe zabavno bylo smotret na nih sejchas massivnyj i roslyj Altares Vozvyshalsia nad svoim vizavi na celuiu golovu, kazalos podavliaia ego svoim Prisutstviem, no komandoval paradom kak raz Gilsveri, a ne on. Snova gluboko vzdohnuv, ona povernula k nemu Lico i bolee-menee rovno, kak i polagalos horosho vladeiushchemu soboj erserkeru, s Chuvstvom sobstvennogo dostoinstva (nikakimi podarkami nas ne kupish. A ona otkryla glaza i uvidela menia. \nBegat Verhovnyj, Sudia po ego tiazhkomu topaniu i pyhteniiu, iavno byl ne priuchen. Poshli, Niks. Na etot raz ia uspel ranshe. Ia s nekotoroj dolej zavisti glianul v zerkalo na Nkota. ejisuminyon VVFcRlhQUVh0RkFXVlBMH0dEVUFUQF9bWh9RUg==\n \n\n\n"}