{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Gaijin <gaijin@clearwire.net>", "subject": "Re: ftp question", "body": "Gregory Nowak wrote:\n> Say I want to get 2 files via ftp, but I want to do it in a specific\n> order, and I don't want file2 to start downloading until file1 is\n> finished downloading.\n\n     This may need a little editing:\n\n#!/bin/bash\nfor ( file in filelist.txt ) do {\n     lynx -d ftp.wherever.com/directory/%file >  ~/savedir/%file\n     grep -i \"%file\" filelist.txt > filelist.tmp\n     mv -f filelist.tmp filelist.txt\n} done\n\n     Crap it's been a long time.  Anyway, if you have a list of files\nyou'd like to download saved to filelist.txt, you can run it in a for\nloop.  Use the lynx dump feature to dump  what you want to a file.  Just\npoint lynx at it and redirect the output to %file, which will be the\nfile listed in filelist.txt.  Then do an inverse grep on filelist.txt to\nremove the filename and redirect grep's output to a temp file.  Then\nmove the temp file back to filelist.txt, overwriting it, and you should\nbe done.  [Ctrl+C] will interrupt this script at any time, and resume\nwhere you left off .  I'm *pretty* sure it will work.  I'm just not sure\nI got the for command written properly.  Yeah, it could really be \nprettied up using %1 from the command line to name filelist.txt instead. \n  Also pointing lynx's output to a download dir would help too, but the \nprincipal idea is there.  Have you considered the 'wget' command?  I \ndon't know why you're downloading files that way.  Are you on a dialup \nconnection?  The only thing about the script above is it expects a \nspecific site and directory.  Considerably more work would be needed to \nmake it a more generic script that could be used for any site, dir, and \nfile list.  Anyway, I HTH,\n\n         Michael\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}