{"category": "ham", "to_address": "avcooper@speedy.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 4/28/07  Things You Put In Your Body", "body": "April 28, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\nFeaturing Lutts' Logic:\n\nThe Great National Temperance Beverage\n\nTurkey and Gravy, Part 2\n\nFeeling Better Now?\n\n-----\n\nToday I want to start with a look at Coca Cola, one of the world's most\nrespected companies.  What Coke sells is sugar and water, and flavoring,\nbut it does it so well - in the process making people all over the world\nfeel better - that we give them an A for achievement.\n\nInterestingly, there's a Wikipedia page that lists all of Coke's slogans\nover the years, and there, along with \"The Pause That Refreshes\" (1929)\nand \"Things Go Better With Coke\" (1963) is \"The Great National Temperance\nBeverage\" (1906).\n\nFor marketers, Coke is a model of success.  For investors, however, Coke\nis stuck in the slow lane.  With $25 billion in revenues, it's too big to\ngrow fast; over the past decade its growth rate has averaged just 3% per\nyear.\n\nAnd the stock?  It's underperformed the market since 1998!\n\nIf you want to get rich, you want to find the next Coke.\n\nFor a while it was Hansen Natural (HANS), the maker of natural juice\ndrinks, as well as Monster, Lost Energy and Rumba energy drinks.  The\nstock was a top performer from 2003 until the middle of 2006; it gained\nsome 10,000%!  Even if you didn't get on board until May 2004, when the\nstock first appeared in Cabot Top Ten Report, you could have earned\n1,600%.\n\n>From today's perspective, it's interesting to note that in the first two\nyears of the stock's run, the growth of the stock paralleled the growth of\nearnings; in other words, the stock's action was \"sensible.\"  But in the\nfinal year of the advance, from September 2005 to July 2006, HANS actually\nbegan to accelerate!  It was a well-known top performer by then, so people\nwere buying a winner.  They love to do that.  And skeptics were\nincreasingly beginning to question the sustainability of the company's\ngrowth, so more and more short-sellers began to bet against the stock.\n\nBut as the stock continued to climb, short-sellers were forced to buy back\ntheir shares of stock, and the resulting short squeeze pushed the stock\nhigher still!  Finally, in May 2006, the company announced that Anheuser\nBusch would distribute Hansen's energy drinks through its giant network. \nThe best news always comes at tops, and this news did the trick for\nHansen!\n\nIn August the bottom fell out, and the shares of the stock tumbled 26% in\none day.  The reason?  Revenues for the second quarter were up 83% to $156\nmillion . . . and analysts had been expecting $157.3 million.\n\nOuch.\n\nIn the months that followed, investors learned that Hansen had backdated\nstock option grants to certain key executives, too, and the sharks\ncircled, with lawyers filing class action suits against the company.  As I\nwrite, the company has yet to file correct financial returns for the third\nand fourth quarters of last year.\n\nAnd the stock has performed no better than the market for the past nine\nmonths.\n\nI'm not recommending Hansen here.  I think it needs more time to recover\nits equilibrium.  And I need to see an attractive chart before I even\nconsider recommending it.\n\nBut I write about it here because, like all history, it can teach you\nlessons.  Or, to put it more elegantly, \"History doesn't repeat itself,\nbut sometimes it rhymes.\"\n\nWhich brings us to Jones Soda (JSDA).\n\nSimply, Jones may be the next Hansen.  Based in Seattle, Jones makes soda,\naddressing the traditional carbonated drink market, the organic fruit\ndrink market and the energy drink market.\n\nJones has two big assets.  The first is founder and stem-winder Peter Van\nStolk, who's an ace marketer.  Thanks to him, and the creative people he\nhires, Jones has been able to attract a wide following of people who want\nan alternative beverage and are ready to pay a premium price.\n\nFor example, the labels on Jones Soda's bottles feature an ever-changing\ngallery of photos that have been submitted by customers via the web site. \nThere's no guarantee that the company will use your photo and, if they do,\nthe chance that you actually see it may be rather small . . . but it still\nfeels good to customers.  And if you really want to see your photo, you\ncan custom-order a twelve-pack of soda online adorned with a label\nfeaturing your photo, for just $29.99, plus shipping and handling.\n\nFurthermore, Jones makes you smile with its roster of creative flavors. \nI've listed them here before - nearly a month ago - so I won't do it\nagain; suffice to say that with flavors like Turkey and Gravy, Cranberry\nand Mashed Potatoes, alongside \"normal\" flavors like Tangerine, Watermelon\nand Twisted Lime, the company cultivates an image that younger customers,\nin particular, identify with.\n\nAnd Jones has just switched from corn syrup to cane sugar for sweetening,\nsaying it's healthier and it tastes better, and its customers deserve the\nbest.\n\nFinally, the company - a la Starbucks - has launched Jones Independent\nMusic, which supports independent musicians and makes a buck, too.\n\nThe company's second big asset is its new distribution agreement with\nNational Beverage, announced back in September.  Under this agreement,\nJones sells concentrate to National Beverage, which makes the drinks in\ngreater volumes than previously possible, and distributes them through its\nwide network.\n\nThis makes Jones a marketer and customer relations company (those are its\nstrengths) and leaves the grunt work to its partner.  And the results\nappear extremely promising!\n\nIn the fourth quarter of last year, revenues grew 15% (the same pace as\nthe previous quarter) but earnings shot up 167% to $0.08 per share.  And\nafter-tax profit margins, previously 2.0%, exploded to 20.5%.\n\nFundamentally, we think the company has great potential.  Consider.\n\nCoke has $24 billion in revenue\nHansen has $479 million.\nJones has $39 million.\n\nWhich one has the greatest growth potential?  Jones.\n\nBut buying this stock is going to be tricky.\n\nWhen I wrote about Jones here on April 5, the stock was at 22, and I\nsuggested, because the stock had just run up from 14 and was 30% above its\n25-day moving average, that it was rather extended.  I wrote, \" . . .you\ncould buy a little now, but what you really want, to improve your\nrisk/reward relationship, is to buy on a pullback, ideally to the 25-day\nmoving average or even 50-day moving average.\"\n\nBut the pullback didn't come, and the stock ran all the way to 32 before\nbeginning its current well-deserved correction.  As I write, the stock has\nfallen through its 25-day moving average at 24 and is heading toward its\n50-day moving average at 20.  If the story appeals to you, I suggest you\nwait until the current correction ends - it shouldn't be long - and then\nbuy between those two moving averages.\n\n\n----- Advertisement -----\n\nTo Sit On The Sidelines Now Would Be Nuts\n\nWe're right smack in the middle of one of the strongest, broad-based bull\nmarkets we've seen in years. If you add any of our top stocks to your\nholdings now, you could easily see a $10,000 investment mushroom into\n$15,000 in six months...into $20,000 in a year...into $35,000 in 18\nmonths.\n\nIf you fail to take advantage of this major buying opportunity, we\nguarantee that you'll be kicking yourself for years. Wouldn't you like to\nfind yourself toasting some big profits come New Year's 2008?\n\nPlease read the special report below and join us:\n\nhttp://cabotmail.net/t/168072/13148861/78/0/\n\n-----\n\nSwitching gears, I now want to talk about a big pharmaceutical company\nthat you've all heard about.\n\nBut first a brief refresher.\n\nWhat moves stocks?  Changes in perception.\n\nWhat are the two kinds of companies where you're most likely to encounter\nsuch changes in perception?\n\nSmall fast-growing companies, like Jones Soda.  And big old companies that\nwere once loved by everyone, but have fallen on such hard times that\ninvestors have thrown away their shares in disgust.\n\nLike Schering Plough (SGP).\n\nHere's what editor Mike Cintolo wrote in Cabot Top Ten Report when the\nstock popped up on Monday.\n\n\"Most of the stocks chosen by OptiMo for inclusion in Cabot Top Ten are\nsmall companies, simply because it's easier to grow fast when you're\nsmall.  Sometimes, though, a whole sector will turn strong, as we've seen\nwith steel stocks in recent months; in these cases we're not surprised to\nsee behemoths leaping ahead.  But when a loner like Schering Plough, with\n$11 billion in sales, comes along, it piques our interest.  So what's\nhappening here?  Basically, after peaking at 61 in 1999 with a PE ratio of\n42, and then falling to a low of 14 before losing $0.30 per share in 2004,\nthe company is on the rebound.  Bright spots include joint ventures in\ncholesterol drugs, where sales totaled $1.2 billion in the March quarter,\nup 48% from the before; arthritis treatment Remicade, which saw sales rise\n37% to $373 million in the quarter; antihistamine Nasonex, which saw sales\ngrow 24% to $284 million; and allergy medication Clarinex, which saw\ngrowth of 28% to $204 million.  Also bright: the ongoing acquisition of\nNetherlands-based Organon, and NOXAFIL, a new therapy for preventing\ndeadly fungal infections.  Last Thursday's earnings results, which easily\neclipsed analysts' projections, suggest there's an under-appreciated\ngrowth wave going on here. \"\n\nWhat I see when I look at Schering Plough is a company that used to be\ngolden, right up there with Pfizer, GlaxoSmithKline and Merck.   \nInvestors loved those stocks!  But when the bull market of the 1990s\nended, all those big pharmaceutical stocks suffered, and investors who had\nfallen in love with stocks on the way up ended up selling in disgust on\nthe way down.\n\nToday, however, as explained above, business is turning around (not just\nat Schering Plough but at most of the other big pharmaceutical companies,\ntoo), earnings are on the rise again, and the stocks are generally strong.\n But Schering Plough is the strongest of the entire sector, the only one\nwith the performance that earned it a spot in Cabot Top Ten.\n\nNow, you could try to compare all these big old pharmaceutical companies\nby examining their product lines, their development pipelines, their\nprojected growth rates and more.  Or you can just trust the stocks\nthemselves, recognizing that the stocks reflect the combined judgments of\nall investors with knowledge and opinions of those stocks.  It's not only\nquicker; it's a lot more productive.\n\nIn Monday's issue of Cabot Top Ten Report, we recommended buying SGP\nbetween 30 and 32, and as I write, the stock is still in that range.\n\n-----\nEditor's Note\n\nSchering Plough's first appearance in a Cabot product came on April 2,\nwhen it appeared in Cabot Top Ten Report.  That's our weekly publication\nthat focuses on finding the market's strongest stocks, and then analyzing\nwhy they're so strong.  Many times they're smaller companies, but\nsometimes they're big old companies coming out of the basement.   If\nyou're looking for more hot stocks like this, I suggest you give it a try,\nwith a no-risk trial subscription, and be among the first to read about\nthe market's next great growth stories.  It's your first step to finding\nthe next Ultra Petroleum, the Next Hansen Natural and the next Intuitive\nSurgical.  To get started, simply click the link below.\n\nhttp://cabotmail.net/t/168072/13148861/81/0/\n\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n-----\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=168072&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}