{"category": "spam", "to_address": "\"Elaastic\" <elaastic@flax9.uwaterloo.ca>", "from_address": "\"Larry Ledford\" <genniyetta@ctjmb.org>", "subject": "Re: READ", "body": "  R O L     Full                         18K                         Gold                                 Daytona                  -                           $269.00 E X  Yes               it's                         our           real                     prices,        over                                  1000                 models              just                for           you! Visit                  our    shop: http://081.sgqavwot.com \"But characters in stories DO NOT just slip away!                                        Don't tell me I'm crazy, there's something down there!       So stop waiting, Paulie — the only elf that's going to show up here is that all-time heavyweight, Annie Wilkes.                                    He had done amazingly well for a man who had once found it impossible to write if he was out of cigarettes or if he had a backache or a headache a degree or two above a low drone.                    only her screams were becoming weird buzzing noises, and her body was rippling and humping and changing under her skirt and cardigan sweater, because Annie was changing into a bee.                                     She looked bigger that way, with her shoulders rounding the pink housecoat, her hair like some battered helmet            He put the book carefully back in its place arid began rolling the wheelchair toward the guest room.He was cold.                but all three obits identified Saint Joseph's as the place of expiration.                              \"Maybe three.                                    \"No,»he said.            \"Jesus,»he whispered. Save that one for the Annie Wilkes lexicon in your memoirs — if you ever get a chance to write your memoirs, that is.                                       \"she screamed, hooking her fingers into claws and shaking them at him, as if she would tear his eyes out.                         Would she have behaved in this same fashion if it had been Joe Blow from Kokomo she had hauled out of the wreck?              The invitation (however parenthetically made) to call her \"Virginia»had been withdrawn.                  When she came in he thought at first that she must be a dream, but then reality — or mere brute survival — took over and he began to moan and beg and plead, all of it broken, all of it coming from a deepening well of unreality.                           She had the luck of the devil, and when she was pressed she had almost the cleverness of the devil — but almost was the key word.           In early February of 1983, the district attorney's office issued a statement saying that while the cases of infanticide at the Boulder Hospital were still very much alive, the case, against Anne Wilkes was closed.                                When this prickly knitting was padlocked across the driveway, she reached into her breast pocket, and took out some red pieces of cloth.                                He had thought she was putting on an editor's hat — maybe even trying on a collaborator's chapeau, preparing to tell him what to write and how to write it.                                   He yanked with all his might and his leg slithered footlessly out of her grasp, leaving her with nothing but the circlet of leather with which she had capped the stump.   So best to eradicate the phone, silence it, as she would silence him if she knew he had gotten even this far.        \"I'll get the paper-clips later,»she said, as if this was a question which must already have occurred to him.                                     Paul had known writers who found it impossible to write after so much as a minor marital spat, and he himself usually found it impossible to write when upset.                          He understood how she could like what he had written and still know it was not right — know it and say it not with an editor's sometimes untrustworthy literary sophistication but with Constant Reader's flat and uncontradictable certainty.                             She had splinted them — of course he had known that, felt the rigid ungiving shapes, but until now he had not known what she had done it with.                          His first really clear memory of this now, the now outside the storm-haze, was of stopping, of being suddenly aware he just couldn't pull another breath, and that was all right, that was good, that was in fact just peachy-keen; he could take a certain level of pain but enough was enough and he was glad to be getting out of the game.                       He had no idea if what he had seen was licit or illicit, and by the time he had walked another two or three blocks, he no longer cared.   As a common noun it meant pain, usually lengthy and often pointless; as a proper one it meant a character and a plot, the latter most assuredly lengthy and pointless, but on which would nonetheless end very soon.          That she would do that to him — that she could, when he had spent most of his adult life thinking the word writer was the most important definition of himself — made her seem utterly monstrous, something he must escape.           She came two or three hesitant steps closer yet, and observed a hand reaching from the earth of a fresh grave, the fingers frozen in a hideous gesture of supplication.                                       There are lots of guys out there who write a better prose line than I do and who have a better understanding of what people are really like and what humanity is supposed to mean — hell I know that.     Because the principle doesn't change if you were out seven times, or seventy, or seventy times seven. \n\r\n_____________________________________\r\n\n\n\n\r\n\t\tLetter content was scanned\r\n\t\tNo threat detected\n\n\nwww.winantivirus.com\n\n\n\n\n\n\n\n \n"}