{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Confirmation # SB467\" <kz71tkwcu@fashgobet.com>", "subject": "Final Attempt : Claim Your Free Stay in Cancun, Vegas, or Napa=?UTF8?Q?=21?=", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n*This promotion is open to U.S. and Canadian residents 18 years of age or older.  \nNo purchases or offers are required to complete, and traveler is responsible for \napplicable hotel taxes.  See terms and conditions inside for complete \ndetails on this promotion.\nThis advertisement is brought to you by ExperienceSummerBayResorts. To discontinue future offers,click here or write to ExperienceSummerBayResorts, 3300 W Lake Mary Blvd, Ste 300, Lake Mary, FL 32746.This advertising material is being used for the purpose of soliciting sales of vacation ownership periods.\n\n\n\n \nchoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summechoose your resort and have a blast this summe\n\n\n\n\n\n\n\n______________________________________________________\n\nNo More Mail\nor write to:\nPadneck\n\n2309 Bel Air Rd.,Suite 311\nFallston, MD 21047\n"}