{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nA dramatic moment on Capitol Hill today: the brother\n  of former NFL player and Army Ranger Pat Tillman told legislators that the\n  military’s account of Tillman’s death was “pure\n  fiction.” The Tillman family says they didn’t hear the truth\n  – that friendly fire in Afghanistan\n  killed Pat – for more than a month after his death. David Martin\n  and Jim Axelrod will have reports.\n \nIt was another bloody day in Iraq – and the deadliest one for U.S. troops\n  in more than a year. A suicide bomber in a truck killed nine paratroopers\n  from the 82nd Airborne Division and wounded another 20, Mark Strassmann will\n  report. And on the domestic front, Sharyl Attkisson will have the latest on\n  the Capitol Hill battle over the new Iraq War spending bill.\n \nIn the race for car sales, Toyota has pulled ahead of General Motors\n  for the first time, outselling the American car powerhouse in the first\n  quarter of this year. But GM isn’t being left in the dust – a\n  slim margin separates the companies’ sales. Anthony Mason will have the\n  details.\n \nVirginia’s\n  governor said today he might be able to close the loophole that allowed\n  Seung-Hui Cho to buy the guns he used against Virginia Tech students and\n  professors. Wyatt Andrews will have this and more.\n \nIn an attempt to pressure Congress to extend the No\n  Child Left Behind law, President Bush is leaving Washington\n  today for a visit to Harlem. The president\n  will tour a charter school that has soaring reading scores – even\n  though most of the students in the neighborhood live at or near the poverty\n  level. Byron Pitts is going along and will bring you the story.\n \nFinally, a tale about dogs’ tails. Of course\n  animal body language can tell you a lot, but is deciphering your pet’s\n  emotion as easy as seeing which direction its tail wags? Richard Schlesinger\n  has gone to fetch the story.\n \nThanks!\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}