{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle and Bethea<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, August 8th, 1972 at 5:13 a.m., holds the secret power to taking control of your destiny", "body": "\n\n\nMemo, August 8th, 1972 at 5:13 a.m., holds the secret power to taking control of your destiny\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMemo, I am going to give you two valuable gifts absolutely free that will give you the power to control \nYOUR DESTINY!\n\n\n\n\n\n\n\n\tDear Memo,\n\n    First, let me tell you why you will need these 2 special gifts. I have just made an astonishing discovery that I must share with you! A very special occurrence will take place on June 30, 2007 at 9:45 a.m. It’s a time that will begin a wondrous period of luck and opportunity...a time when you can make all of your dreams come true!\n    Beginning June 30th and on a few special days every single month for the next year, a door will open on an endless source of power that can help bring you riches, find your true love, enhance your beauty and health... even allow you to live free from care! Yes, all that and even more.\n\n\t\t\t\t\t\t    This tremendous energy source is as old as the universe itself and, for thousands of years, people have called upon its powers to help change their destiny! Now it is your turn to do the same!\nYou, Memo, can unlock\n\t\t\t\t\t\t\tthe same mystical power for yourself!!!\n    It’s true! It is possible to tap this boundless energy and make it work for you. That is why I am so anxious to have you share in my incredible discovery.\n\n\t\t\t\t\t\t    I believe that everyone -- especially you, Memo -- should have the ability to turn dreams into reality! And I know that once you’ve learned how to use this remarkable power, you’ll be able to get everything you’ve always desired.\n\nHere are just some of the wonderful things\n\t\t\t\t\t\t\tyou can make happen\n\n\n\nAttract big money ($10,000, $20,000 or more!)\n\n\nGuarantee good luck, each and every month!\n\n\nFind true love and keep it!\n\n\nProtect yourself from people who may do you harm!\n\n\nFree yourself from worry!\n\n\nGet the dream job you have always wanted!\n\n\n    You see, June 30th signals the beginning of an incredible time of power when all these things can be yours -- but only if you know how and when to take advantage of the force I spoke of. I want to show you the ways in which you can do just that.\n\t\t\t\t\tWhy is June 30th so important to you?\n    June 30, 2007 is the time of an especially powerful Full Moon in Capricorn,  the sign of amazing money and success. Because Capricorn is ruled by success-driven Saturn, this Moon Phase will be supercharged with radiant transformative energy. As a result, this will be your most powerful Lunation of the year for breaking out of a rut, getting energized and having the power to turn your life and your luck around.\n\t\t\t\t\t    \n\t\t\t\t\t    Don't miss this amazing chance to get exactly what you want most!  If you use the extraordinary energy of this Full Moon in Capricorn, amazing things can happen for you!\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tHere’s how I know this to be true...\n    For centuries, man has acknowledged that the phases of the Moon bring out the fullest potential of all living things. Farmers know that crops planted during the New Moon will yield an abundant harvest. Fishermen know that their largest catches and, consequently, their greatest financial gains will happen at the Full Moon! Even the seas themselves respond to the Moon as it controls the rise of the tides.\n\n\t\t\t\t\t\t    With its remarkable ability to affect billions of gallons of water at the same time, the Moon must also have a similar effect on our bodies, which are 70% water!\n\n\t\t\t\t\t\t    Can you harness for yourself the same power that affects the Earth and Seas? Yes, Memo, you can!\n\n\t\t\t\t\t\t    Just think, the same Moon that has inspired the writings of poets and invited enchanted lovers to walk hand in hand under its spellbinding light also holds the power to help you change your life forever!\nThe Full Moon and the New Moon mean good fortune for you!\n    The ancient Druids revered the Moon as the ultimate symbol of good luck and built Stonehenge to predict the Moon’s movements and draw upon its power. The great armies of Sparta believed so strongly in lunar power that they refused to march into battle before the Moon was Full. In Gaelic, the traditional language of Ireland, the word for “Full Moon” is the basis of the word which actually means “good fortune.”\n\n\t\t\t\t\t\t    Lottery winners can certainly swear to that fact. Enormous lottery jackpots of $16 MILLION, $8 MILLION and $8.4 MILLION dollars have been won recently during the time of the Full Moon! And jackpots of $27.4 MILLION, $3.2 MILLION and $49.7 MILLION were awarded at the time of the New Moon.\n\n\n\t\t\t\t\t\t\tEvery month is a time of luck and opportunity...\n    Perhaps the most amazing thing about the Moon is that every month a special window of opportunity exists when you can benefit from its powers! Wouldn’t you like to know precisely when to enter a lottery...and win?\n\n\t\t\t\t\t\t\tLet me explain...\n\n\t\t\t\t\t\t    Every month, the Moon passes through a cycle called phases. The most powerful phase of the Moon, the Waxing Moon, is the period of time from the New Moon to the Full Moon. This is the key time for using the Moon’s powers to help you make all of your dreams come true! But only if you know how!\n\n\t\t\t\t\t\t    Once you learn the secrets of what to do during this phase, you can use it to your best advantage. Imagine, every month you will have the chance to make incredible things happen in your life! That’s one full year of luck, love and success just waiting for you!\n\n\n\t\t\t\t\t\t\tDiscover Your Special Moon Sign!\n\n\t\t\t\t\t\t    Almost everyone knows their astrological sign, but did you know that you have a Moon Sign as well? Yes! And knowing it will help you determine the best times for making important decisions and pursuing activities that you may be thinking about.\n\n\t\t\t\t\t\t    The Farmer’s Almanac, which has been in use since 1792, has a monthly chart that shows the best time to seek favors, begin dieting, start new projects, quit smoking ... all according to the sign of the Moon! If the Almanac recognizes the importance of Moon Signs and their influence on our lives, who are we to disagree?\n\n\t\t\t\t\t\t    You can discover your own special Moon Sign, and I’ll show you the ways it can be used to magnify your good luck. But only if you share in my discovery!\n\n\n\t\t\t\t\t\t\tTime is of the essence!\n    As I have told you, the most intense time of the Moon’s energy and power is during the Waxing Moon. Very soon now, we will be entering that phase of the Moon! You must make the most of this crucial period of time.\n\n\t\t\t\t\t\t    It is extremely important that you take advantage of my discovery now and learn how you can call on the powers of the Moon. Why wait for another month to go by before you begin to attain your heart’s desires?\n\n\n\t\t\t\t\t\t\tWait! I have some surprises for you!\n    I have chosen, just for you, two unique and powerful tools that will enhance your ability to channel and use Lunar Power, especially during peak periods, like the New Moon and the Full Moon.\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\tThe first free gift I am sending you is\n\t\t\t\t\t\t\tan authentic “Lunar Talisman.”\n\n\n\n\n\n    This ancient and mystical talisman enables its wearer to use the powers of the Moon more effectively. I want you to wear this exquisite talisman every month during the time of the Waxing Moon. It will help you to connect to the beneficial energies of the expanding Moon.\n\n\n\t\t\t\t\t\t\tThe second free gift that you will receive\n\t\t\t\t\t\t\tis a genuine polished Moonstone.\n\n\n\n\n\n\n\t\t\t\t\t\t    This rare and beautiful stone is said to possess remarkable powers, which some cultures even regard as sacred. The Moonstone has long been treasured as a good luck charm and it is often carried as a protective amulet. Moonstones are also believed to bring true love. A friend of mine was wearing a Moonstone when she and her husband met and fell in love at first sight!\n    Because Moonstone amplifies the energies and potentials present in an individual or the environment, you can use your Moonstone to harness the power of the Moons phases. You will find that when you know the techniques of Moon power, your Moonstone can accelerate the fulfillment of your wishes and hopes.\n    Both of these gifts are yours to keep forever! They are my way of thanking you for allowing me to show you how the power of the Moon can change the course of your life!\nTake the pathway to the powers of the Moon!\n    I am sure you’re wondering how to call upon the powers of the Moon to get the things you want most out of life. You can, with the amazing guide to:\n\n\"The Secret Powers of the Moon\"\n    It will give you the knowledge you need to access this unlimited energy and benefit from it!\n    This incredible guide will reveal to you special and powerful “luck enhancing” activities, including ways to accumulate wealth, make yourself more attractive to the opposite sex, protect yourself, and much much more!\n    Yes, you are about to discover some of the ways in which you can use the Moon’s magnetic energy to change your life. By practicing the simple techniques found in the guide to \"The Secret Powers of the Moon,\" you will become more confident about yourself and your future. You will finally be able to knock down the barriers that have stood in the way of your success and happiness.\n\n\t\t\t\t\t\t    Let me assure you that the methods are not complicated, nor do they require any unusual talents. The only things that you will need are concentration and the desire to see your dearest hopes and wishes come true! Believe me, I have done it -- and you can too!\n\n\t\t\t\t\t\t    I must also tell you that these techniques cannot be found anywhere else! And right now, this amazing power can be exclusively yours! (Along with your free gifts that will help you make the most of this power!)\nYou have absolutely nothing to lose...\n\t\t\t\t\t\t\tIt’s a Risk-Free Offer!\n\n    Please understand that if for any reason you are not 100% satisfied with your own copy of \"The Secret Powers of the Moon,\" simply return it to me -- at any time! -- and you will be reimbursed immediately for the entire cost. I sincerely doubt that will occur, since this has to be the most fascinating item you will ever have owned!\n\n\t\t\t\t\t\t    Nevertheless, I assure you that you have everything to gain and nothing to lose! The only risk you take by accepting my offer is the chance to see many marvelous transformations occur in your life!\n    I want you to have one more reason to send for this fantastic guide. Because you are my friend, Memo, you can have this incredible guide for only $14.95. I am making this gesture so that nothing will stand in the way of your dreams.\n\n\t\t\t\t\t\t    Remember, Memo, the Waxing Moon is fast approaching and I sincerely want you to be able to make the most of the opportunity that it brings.\nBelieve me when I say, “KNOWLEDGE IS POWER!”\n    The knowledge contained in \"The Secret Powers of the Moon\" will empower you in a way that is virtually unknown to others. It can get you riches, love and success! It’s knowledge that you simply can’t afford to be without.\n\n\t\t\t\t\t\t    Memo, if the things you want most in life have always been just beyond your reach and good luck seems to belong to everyone else but you, I sincerely urge you to take advantage of this great opportunity right now. Remember, timing is essential. Click the box to say, \"Yes!\" to your chance for a lifetime of happiness and success.\n\n\t\t\t\t\t\t    Your friend,\n\t\t\t\t\t\t    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for offers and discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you’ve asked to be deleted from one kind of email from me, I’m required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford CT 06460-3400.\n\t\t\t\n\t\t\t\n\n\n\n\n\n\n"}