{"category": "ham", "to_address": "<ip-health@lists.essential.org>", "from_address": "\"MSF Michel Lotrowska\" <access@msf.org.br>", "subject": "[Ip-health] G8 document on PROMOTING INNOVATION - PROTECTING INNOVATION -  In the document GROWHT AND RESPONSIBILITY IN THE WORLD ECONOMY", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nPROMOTING INNOVATION - PROTECTING INNOVATION\n\n30. Science, research and innovation today more than ever form the basis of\neconomic\n\ngrowth and prosperity. Political and economic strategies to foster\ninnovation are therefore\n\nkey elements for the future development of industrialised countries,\nemerging\n\neconomies and developing countries alike. We will undertake to bring forward\nan international\n\neconomic and political environment that promotes and protects innovation.\n\nInnovation for Sustainable Growth\n\n31. Forward looking innovation policy is geared towards promoting the\nresearch community\n\nand towards translating ideas, the product of the research process, into\ninnovative\n\nproducts and services. Whereas the promotion of research involves education\nand\n\nhigher-education policy, economic policy can play a crucial role in\npromoting the translation\n\nof research into innovative products and in fostering an innovation-friendly\nbusiness\n\nenvironment. Both tasks benefit from the engagement of national governments.\nInternational\n\ncooperation and exchanges can supply a substantial impetus in the shaping of\n\n\nnational policy. Cooperation between advanced and developing countries in\nresearch\n\nactivities in the field of science and technology should also be\nstrengthened.\n\n32. Because we strive to provide scientific and technical leadership we also\nrecognize\n\nour responsibility for a long-term oriented research initiative that will\nfocus on concentration\n\nof scientific research and improved technological capacity in order to be\nable to react\n\nmost effectively to future global challenges. We recognize the increasing\nsignificance\n\nof many emerging economies in science and research and invite them to\nactively\n\nparticipate in this process by reinforcing already existing cooperative\nefforts in the\n\nOECD building also on the results of ongoing work promoted inter alia by the\nrelevant\n\nUN bodies.\n\n33. In this respect we support the engagement of the OECD to work on\nproposals for\n\ntopical international collaborative efforts. Based on the work of the Global\nScience Forum\n\n(GSF), we recognize the value that the GSF will bring as the moderator of\nthis\n\nprocess. We also support the sharing of information among the G8 and\nemerging\n\neconomies on national research endeavours in order to identify priorities\nthat could be\n\nenhanced by collaborative research efforts, joint initiatives and programmes\non areas of\n\ncommon interest. Possible areas of cooperation could be sustainable use of\nwater and\n\n\n\n\n\n\n10\n\nland and research in the field of energy efficiency as well as the promotion\nof environmentally-\n\nrelated innovations both in the public and in the business sector. We will\nwork\n\ntogether to achieve more effective coordination and cooperation in our\nresearch efforts\n\nin these fields.\n\nIntellectual Property Protection as the Backbone of Innovation\n\n34. A fully functioning intellectual property system is an essential factor\nfor the sustainable\n\ndevelopment of the global economy through promoting innovation. We recognize\n\n\nthe importance of streamlining and harmonizing the international patent\nsystem in order\n\nto improve the acquisition and protection of patent rights world-wide.\n\n35. The benefits of innovation for economic growth and development are\nincreasingly\n\nthreatened by infringements of intellectual property rights worldwide. We\ntherefore\n\nstrongly reaffirm our commitment to combat piracy and counterfeiting. Trade\nin pirated\n\nand counterfeit goods threatens health, safety and security of consumers\nworldwide,\n\nparticularly in poorer countries. In this regard we welcome work on the WHO\ninitiative to\n\nimplement the International Medicinal Products Anti-Counterfeit Taskforce\n(IMPACT).\n\nOur common efforts in this combat are therefore in the interest of all\ncountries at all levels\n\nof development.\n\n36. We commit to strengthen cooperation in this critical area among the G8\nand other\n\ncountries, particularly the major emerging economies, as well as competent\ninternational\n\norganizations, notably the World Intellectual Property Organization (WIPO),\nWTO,\n\nthe World Customs Organization (WCO), Interpol, the World Health\nOrganization\n\n(WHO), the OECD, APEC, and the Council of Europe. We invite these\norganizations to\n\nreinforce their action in this field.\n\n37. We welcome the joint Declaration of the business communities of all G8\ncountries\n\non \"Strategies of G8 Industry and Business to Promote Intellectual Property\nProtection\n\nand to Prevent Counterfeiting and Piracy\" which highlights actions companies\nare taking\n\nto secure their intellectual property rights at home and abroad and to keep\ntheir global\n\nsupply chains free of pirated and counterfeit goods - from producers and\ndistributors,\n\nretailers and merchandisers. Industry and business have an essential role to\nplay in protecting\n\ninnovation, and we will engage our respective private sectors on effective\nsolutions\n\nwith regard to both the supply and the demand side of piracy and\ncounterfeiting.\n\nWe also welcome educational campaigns with the help of business communities\nin our\n\ncountries directed at raising awareness of consumers with regards to the\nnegative effects\n\nof counterfeiting and piracy.\n\n38. In light of the urgency to implement concrete measures which will\nimprove and\n\ndeepen cooperation among G8 partners and deliver real enforcement results,\nwe decide\n\nto undertake the following:\n\n\n\n\n\n\n(a) We endorse the Guidelines for Customs and Border Enforcement Cooperation\ndesigned\n\nto strengthen cooperation and coordination among our national customs and\nlaw\n\nenforcement administrations. In this context we especially welcome the\ndevelopment of\n\nan effective information exchange system - where appropriate -in close\nassociation\n\nwith the WCO which will lead to improved cooperation among the relevant\nenforcement\n\nauthorities worldwide.\n\n(b) We endorse new Guidelines for Technical Assistance on intellectual\nproperty rights\n\nprotection to interested developing countries, as well as a mechanism to\nbetter coordinate\n\nand leverage existing G8 assistance to such countries with a view to\nbuilding the\n\ncapacity necessary to combat trade in counterfeited and pirated goods to\nstrengthen\n\nintellectual property enforcement. In partnership with certain developing\ncountries we\n\nagree to launch technical assistance pilot plans with a view to building the\ncapacity necessary\n\nto combat trade in counterfeited and pirated goods to strengthen\nintellectual\n\nproperty enforcement. The progress on these pilot plans will be reviewed by\nthe G8 in\n\n2008.\n\n(c) We endorse the recommendations aimed at improving G8 member countries'\ncooperative\n\nactions to combat serious and organized intellectual property rights crimes\nand\n\nthe further work on their basis to facilitate structured international\ncooperation regarding\n\nthe investigation and prosecution of those crimes.\n\n(d) While appreciating the information contained in the OECD report\nestimating the economic\n\nimpacts of counterfeiting and piracy on national economies and right\nholders, as\n\nwell as public health and safety, we will encourage the OECD to work with\nmember\n\nstates to further identify and target in its report specific areas for\nconcrete actions.\n\n(e) We recognize the need for continued study by national experts of the\npossibilities of\n\nstrengthening the international legal framework pertaining to IPR\nenforcement.\n\n(f) We consider the establishment of an IPR Task Force focusing on\nanti-counterfeiting\n\nand piracy to look together at how best to improve the working of the\ninternational IPR\n\nprotection and enforcement, and produce recommendations for action including\nimproved\n\npeer review. The issue will also be considered in the Heiligendamm Process.\n\n\n\n\n12\n\nA New Dialogue on Innovation and Intellectual Property Protection\n\n39. Lively interaction between science and business, strong protection and\nenforcement\n\nof intellectual property rights, and the combination of market-based\nentrepreneurship\n\nand science-based research are increasingly decisive factors in promoting\neconomic\n\ngrowth and development around the world. We invite the major emerging\neconomies to\n\na follow up process using the OECD as a platform with the aim of\nestablishing a new\n\ninternational dialogue on innovation and intellectual property protection as\npart of the\n\nHeiligendamm Process. Such a dialogue will provide a forum for the positive\nexchange\n\non topics critical for growth of successful knowledge economies and the\npromotion of an\n\ninnovation-friendly business environment also taking into account the needs\nof small\n\nand medium sized enterprises, including: (a) the crucial role and economic\nvalue of intellectual\n\nproperty protection and implementation as a central framework condition for\n\nthe development of a future-oriented economy based on technological progress\nand\n\ninnovation; (b) effective market incentives for innovation and the diffusion\nof knowledge\n\nat the national level taking into account recent developments in technology\nmarkets;\n\nand (c) the crucial importance of efficient innovation value chains that\npromote business\n\ncommercialization of patented research results and exploit licensing as a\nmajor\n\ndriver for the international transfer of technology. The dialogue could\nfurthermore ascertain\n\nmeasures the industrialized countries and major emerging economies can take\nto\n\nachieve fully effective implementation and protection of intellectual\nproperty rights within\n\ntheir own territory. Fully respecting the mandate, function and role of the\ncompetent\n\nmultilateral organizations, in particular the WTO and the WIPO, participants\nin the dialogue\n\nmay also discuss initiatives aimed at strengthening intellectual property\nrights protection\n\nwhich should then be addressed in the appropriate international fora. The G8\n\n\nSummit 2009 will take stock of the progress made by that date.\n\n\n\n--\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}