{"category": "ham", "to_address": "perl6-internals@perl.org", "from_address": "\"Nikolay Ananiev\" <ananiev@thegdb.com>", "subject": "Re: Is Parrot 1.0 too late?", "body": "Yes I know about Parrot's great features, but Parrot is still not\nready for the mainstream and won't be ready in the next two years (maybe?).\nThat's a lot of time for commercial projects like CLR and JVM and\nthe competition between MS and Sun is quite serious, so I expect\nthe dynamic features in their VMs to progress very fast. I'm also afraid\nthey have the resources to create compiler tools comparable to PGE and TGE\n(you know that MS can always steal).\nI think in 2-3 years CLR and JVM will be a serious competition to Parrot\nand I just hope people won't say \"uh, another VM for dynamic languages\"\nabout Parrot 1.0.\nMaybe we have to search harder for new ways to advertise Parrot to other\ncommunities and get new developers and supporters to the project.\nCurrently, Parrot looks too Perlish and is mainly supported by the Perl \ncommunity.\nI think that has to change.\n\n\"Allison Randal\"  wrote in message \nnews:462EEE7F.9040207@perl.org...\n> Nikolay Ananiev wrote:\n>>\n>> So, is one of parrot's biggest strengths gone? Are we too late?\n>> Why would the developers use Parrot instead of JVM/CLR/Mono?\n>\n> We're certainly pleased that we kicked off a revolution in virtual \n> machines, and that others are beginning to catch on to the fact that \n> they'll have to support dynamic languages to compete. But, it would be a \n> little silly to throw in the towel just when others are beginning to \n> follow your lead. (And I do mean beginning. They're making great strides, \n> but I still hear strange comments like \"We support all features of dynamic \n> languages. Of course some features, like multiple inheritance, may be \n> slow, but we don't encourage the use of those features.\" from the JVM \n> team.)\n>\n> The plan to run Perl, Python, PHP, Ruby, etc. is not the only innovative \n> feature of Parrot. To list a few:\n>\n> - PGE provides parsing tools that are light years ahead of what's in \n> common use today (what's commonly used today hasn't seen much in the way \n> of technological advances in the past 20 years).\n>\n> - TGE is a powerful tool for manipulating trees of data, like the output \n> of a parse, or an abstract syntax tree (think of it as XSLT on steroids).\n>\n> - Those parsing and transformation tools are valuable both for writing \n> compilers and for data processing tasks (handling database output, screen \n> scraping, combination and modification of Atom streams in an AJAXian way, \n> etc.), giving a big boost in ease of use for both areas.\n>\n> - Parrot is a register-based virtual machine instead of stack-based like \n> .NET, Mono, JVM. Register-based machines require fewer instructions to \n> complete the same operations (no need to push and pop the stack), \n> eliminating some unnecessary overhead. JIT-ed code is also register-based \n> (since the actual machine under the virtual machine is register-based), so \n> the register-based bytecode makes that transformation simpler.\n>\n> - Parrot moves beyond the fragile stack-based control flow common to \n> virtual machines today, to a continuation-based control flow. (I can \n> recommend a few good books and articles if you're curious.)\n>\n> While the other VMs are catching up to supporting the features of dynamic \n> languages from 10-40 years ago, we plan to open the way for a whole new \n> breed of dynamic languages. Will others follow our example? I won't \n> complain if they do. \"Imitation is the sincerest form of flattery.\"\n>\n> Allison\n> \n\n\n\n"}