{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "Newsnight talking point", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTALKING POINT\n\n\n\t\t\t\t\t\tThe Cult of the Amateur\n\t\t\t\t\t\n\n\n\n\n\"If we are all amateurs, there are no experts.\"\n\n\nAndrew Keen's new book, The Cult of the Amateur is the latest addition to the Newsnight book club. In it, the author expresses his concern for the profligacy of online amateurism, spawned by the digital revolution.  This, he feels, has had a destructive impact on our culture, economy and values.\n\n\nHe says, \"[They] can use their networked computers to publish everything from uninformed political commentary, to unseemly home videos, to embarrassingly amateurish music, to unreadable poems, reviews, essays, and novels\".\n\n\nHe complains that blogs are \"collectively corrupting and confusing popular opinion about everything from politics, to commerce, to arts and culture\".\n\n\nHe claims that Wikipedia perpetuates a cycle of misinformation and ignorance, and labels YouTube inane and absurd, \"showing poor fools dancing, singing, eating, washing, shopping, driving, cleaning, sleeping, or just staring at their computers.\"\n\n\nHe warns that old media is facing extinction - \"say goodbye to experts and cultural gatekeepers - our reporters, news anchors, editors, music companies, and Hollywood movie studios.\"\n\n\nWhat do you think? We've published two extracts from Andrew Keen's book on the Newsnight website. Have a read and share your thoughts - is he being alarmist about the effects of the Web 2.0 revolution, or raising genuine concerns? Are we at the mercy of the amateur? Can kids tell the difference between credible news sources and the amateur's blog? What, in any case, can be done?\n\n\nClick here to join the debate\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}