{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "\"Diana Law\" <RutherfordSJulialimp@catholic-forum.com>", "subject": "Fwd: ", "body": "\n\n\n\n\n\n\n\nFor example, a mating ritual indicates that a \ndemon conquers a plaintiff behind a cloud formation. After all, it was her \nsingle hesitant suggestion about the bee-sting which had shaped the book and \ngiven it its urgency when Paul had firmly believed he could never feel urgent \nabout Misery again.For example, a \nmating ritual indicates that a demon conquers a plaintiff behind a cloud \nformation. After all, it was her single hesitant suggestion about the \nbee-sting which had shaped the book and given it its urgency when Paul had \nfirmly believed he could never feel urgent about Misery \nagain.The tale of Misery and her \namnesia and her previously unsuspected (and spectacularly rotten) blood kin \nmarched steadily along toward Africa, which was to be the setting of the novels \nsecond half.\"That was the question I had to ask myself, and as much as I \nmay have wanted to pull the wool over my eyes, I knew the answer to that - I \nknew even before I saw the marks on the door over there.After all, it was her single hesitant suggestion about the \nbee-sting which had shaped the book and given it its urgency when Paul had \nfirmly believed he could never feel urgent about Misery again. Having a novel \nend exactly the way you thought it would when you started out would be like \nshooting a Titan missile halfway around the world and having the payload drop \nthrough a basketball hoop. The tale of Misery and her amnesia and her \npreviously unsuspected (and spectacularly rotten) blood kin marched steadily \nalong toward Africa, which was to be the setting of the novels second half. \n\"That was the question I had to ask myself, and as much as I may have wanted to \npull the wool over my eyes, I knew the answer to that - I knew even before I \nsaw the marks on the door over there.\n"}