{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "denouement: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\nFind out how to release your inner genius and ace your exams in Teresa Bolen's epochal book, MASTER PLAN TO MASTER EXAMS: HOW TO DISCOVER YOUR HIDDEN ABILITIES TO CREATE THE SUCCESS YOU DESIRE.\nYou'll get a package of wonderfully empowering F-R-E-E Bonus Gifts from some of the world's leading success and learning experts -- take action NOW.\nRelease Your Inner Genius Abilities Today\nADVERTISEMENT\nWord of the Day for Thursday, May 10, 2007\ndenouement \\day-noo-MAWN\\, noun:\n1. The final resolution of the main complication of a literary or dramatic work.\n2. The outcome of a complex sequence of events.\nAnd perhaps this helps to explain the frequency of the violent denouement in contemporary novels: in the country that embraced the slogan \"Today is the first day of the rest of your life,\" how do you call it quits on a character who is still breathing? -- Brad Leithauser, \"You Haven't Heard the Last of This\", New York Times, August 30, 1998\nOf course, the crusaders were losers in the short run, but Europe's storytellers have traditionally awarded them the righteous victory and not dwelt on the embarrassing denouement. -- Todd Gitlin, The Twilight of Common Dreams\nThough still only a prospect on the horizon, this, I think, could well be the next revolution. What a denouement if it is! -- Julian Barbour, The End of Time\nDenouement is from French, from Old French denoer, \"to untie,\" from Latin de- + nodare, \"to tie in a knot,\" from nodus, \"a knot.\"\nDictionary.com Entry and Pronunciation for denouement\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9555392-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}