{"category": "spam", "to_address": "<iplacereports@speedy.uwaterloo.ca>", "from_address": "\"JohnLansing@Investorplace.com\" <JohnLansing@Investorplace.com>", "subject": "Trade Talk Weekly April 24 2007: Snap Out of It (7WM287)", "body": "\n\nTrade Talk Weekly Update\n\n\n\n\n\n\n\nApril 24, 2007\n“Snap Out of It Sheeple™!”\nHave you found yourself slumped over lately, robotically moseying along and occasionally letting out a faint “Baaaahh”?\nIf so, you might be a member of the growing number of Sheeple™ infiltrating the marketplace.\nShould you be alarmed?   Absolutely.   In fact, if you have found yourself with any of the following symptoms, please contact me immediately at Trending123 here.\n\nYou do whatever the financial talking heads say (no matter what)\nYou buy out of a stock as soon as it hits a rough patch\nYou buy into a stock when, and only when, everyone else is doing it too\nYou have trouble differentiating between a stock “winner” and a stock “loser”\n\nI assure you, if these symptoms persist, your transition from “Peoplehood” to “Sheeplehood” will only continue to worsen.   And your portfolios will suffer the consequences.\nIs there a cure?   Of course!   Get the wool out of your eyes and read this carefully: You don’t have to follow everyone else.   You can be the leader of your own financial destiny.   You can learn to expect bigger and better gains.\nGot it?   Okay, let’s smooth your transition to the newer, better side of life — where you promise to lead and not follow!\n\n\n\n\n\nSit up and take note, ‘cause I’ve got great news for those of you who bought ALAN as I had suggested in last week’s Trade Talk.   If you recall, I told you that the stock was in an Ascending Triangle pattern and looked ready to break out at a moment’s notice.   The charts had been showing massive bullish divergence with all the indicators pointing up.\nWell gosh darn it, ALAN is chugging along just as the charts predicted.   As of right now, if you bought when I urged you to do so last week, you’d be sitting pretty with a 37% gain thus far!\n\nNow that I have everyone’s attention — here’s another stock I am recommending you buy today:\n\n\nPool Corporation (POOL)\nSCP Pool Corporation operates as a wholesale distributor of swimming pool supplies, equipment, chemicals, replacement parts, and complementary items in North America and Europe.   It offers approximately 91,000 national brand and private label products that include maintenance products, such as chemicals, supplies, and pool accessories; repair and replacement parts for cleaners, filters, heaters, pumps, and lights; packaged pool kits, including walls, liners, bracing, filters, heaters, pumps, and lights for in-ground and above-ground pools; and pool equipment and materials for new pool construction and the remodeling of existing pools.   SCP Pool’s customers include swimming pool remodelers and builders; retail swimming pool stores; and swimming pool repair and service companies.\nCurrent Outlook: Now let me tell you this stock concerned a lot of people when it dipped considerably earlier this month.   But you know what I said in response?   Buy more now!   Considering this week it went up nearly 10% AND it’s breaking the downtrend line on the weekly.   Not to mention the monthly, where it’s up almost 15%!   So for goodness sakes, dip into this POOL, on the pullbacks!\n\n\n\n\n\n\n\n\n\n\n\n\nCritical Attention Required!\nA few weeks ago, I wrote about a stealth bull market — a very powerful uptrend — that most investors know nothing about.\nAt the time I told you about one specific trade that had a great chance at doubling your money over the next 4–5 months.\nSince that time, this stock has already started its move — up 10% so far in April already!\nYou still have the opportunity to capture the lion’s share of the profits—but you MUST take action now.   Click here to watch an important video message about this trade.\n\n\n\n\n\n\n\n\n\n\n\nPPO: It’s not just a medical plan\nWe’ve gone over the first two indicators we use to identify trend reversals at Trending123—the Aroon indicator and the Williams Percent Range (Williams %R).   So what’s the third?   As it turns out, it’s a three-letter abbreviation: PPO.\nPPO stands for percentage price oscillator.   It’s a lot like the MACD, but with one critical difference.   Both indicators calculate the difference between a shorter-term moving average and a longer-term moving average, but where the MACD expresses it as an absolute value (dollars), the PPO expresses it as a percentage.   For instance, a PPO of +5% means that the shorter-term moving average is 5% higher than the longer-term moving average.   A PPO of -5% means that the shorter-term moving average is 5% lower than the longer-term moving average.\nBecause it’s expressed as a percentage instead of as an absolute value, the PPO is much more reliable than the MACD, especially for long-term trends.   And that’s why we can use it to help identify trend reversals: When the PPO rises above zero, it’s bullish, and when it falls below zero, it’s bearish.   Now isn’t that as easy as 1, 2, 3?\n\n\n\n\n\nSincerely,\n\nJohn LansingTrending123\n\nP.S. I’ve done 75 updates this month for my Trending123 subscribers.   That’s no misprint—75 big ones—and it’s not even the end of April! Show me another newsletter writer service that has sent you 75 updates about what your stocks are doing, where the market is going and the detailed analysis (tick by tick) day in and day out, weekend or weekday. I am the only one I know doing this for my subscribers—and I want you to experience it for yourself. Click here for details on a very special offer to join Trending123 today.\n\n\n\n\n\n\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you. Please tell us if your email has changed by visiting here: http://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice from InvestorPlace advisors, you can let us know by visiting \nhttp://www.investorplace.com/u/?p=7WM287-1&e=iplacereports@speedy.uwaterloo.ca\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,2420A Gehman LaneLancaster, PA 17602\nCopyright © 2007 ACP Phillips Investment Resources, LLC.\nAll rights reserved.\n04/24/2007 8:31PM\n\nThank you for subscribing to InvestorPlace.com.   Please note that we cannot be liable for any missed bulletins caused by overzealous spam filters.   To ensure that you continue to receive this valuable part of your service please take a moment to add (JohnLansing@InvestorPlace.com) to your address book.   Click here for instructions:\nhttp://www.investorplace.com/whitelist.php?eml=JohnLansing@InvestorPlace.com\n\nee==7WM287\n\n\n\n\n\n\n"}