{"category": "spam", "to_address": "<kedda@flax24.uwaterloo.ca>", "from_address": "\"INA Trades\"<Crystal.LeSure@blackernight.com>", "subject": "Deer Valley Corporation Update Issued", "body": "\n\n\nDeer Valley Corporation Update Issued\n\n\n\n\n\nDeer Valley Corporation Update Issued\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nDeer Valley  Corporation Update Issued; Speculative Buy Rating and \n                              $3.05 Target Price Reiterated  by Beacon Equity Research\n\n\n\n\n \n\n\n\n\n \n\n                          An update on Deer Valley Corporation (OTCBB:  DVLY) has been issued by Beacon Equity Research. The update reiterates the Speculative  Buy rating and \n                          $3.05 target price for this company.\n\n                          In the report, the analyst writes, Deer  Valley Corporation (OCTBB: DVLY) is an emerging player in the US manufactured housing market. The  Company, through its wholly-owned subsidiary Deer Valley Homebuilders, Inc.  produces, markets and sells factory-built homes. It offers a variety of HUD  Code and modular manufactured homes marketed under its Deer  Valley and Sun   Valley brands. The Companys operating subsidiary, established in  2004 in Alabama, has developed a network of  110 independent dealers/retail centers to market its products, particularly in  the south central and southeastern parts of the US.\n\n \n\n\n\n\n \nInvestment  Highlights\n\n                      - Deer  Valley enjoys a strong reputation in  its industry and is benefiting from the strategic location of its production  facilities near storm-ravaged areas of the Gulf Coast.  Demand for housing in this region, supported by government funding, is fueling  demand for Deer Valleys manufactured housing  products.  \n\n                      - \n                      Nationally,  the demand for factory-built homes is rising due to their uniform quality,  reduced vulnerability to adverse weather conditions during the construction  phase, lower price, and faster delivery compared to traditional, site-built  homes. \n\n                      - Rising  US interest rates may contribute to a shift in buyers preference that favors  increased sales of more affordable manufactured and modular homes.\n- The  Companys strong dealer network, established presence in the Gulf Coast  reconstruction market and focus on high-end HUD Code homes are competitive  advantages that position Deer   Valley to outperform its  manufactured housing peers.  \n- Deer Valley has  added a new product line of modular homes marketed under the Sun   Valley name  .  The initial  models will be sold through the Companys existing  dealer network. In addition, the Company is actively working with several  private and public entities which are seeking to develop relatively large scale  modular communities intended to replace a portion of the housing destroyed by  Hurricane Katrina. In anticipation of sales growth, the Company recently  expanded its bank revolving credit line.  Furthermore, in  response to a significantly increased order  rate attributable to expanded retail dealers sales  activities, the Company has   resumed  five-day-per-week production at both of its Alabama manufacturing facilities.                      \n \n \n\n\n \n\n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n\n"}