{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Hank Steele\" <dofcouttsgus@coutts.org>", "subject": "Doctors and Celebrities endorse Anatrim", "body": "\nWatch the pounds disappear\n\n\n\n\n\nAnatrim – The latest and most enchanting flesh loss product is now easily available – As could be seen on BBC\n\n\n\nDid you realize redundant body kilos kill a lot of people around the planet? We know you hate the ugly appearance of people like those and the low status they have in modern society. \n\nOr, maybe, you can’t withstand a siege of your baneful eating habits. This all sounds familiar? Then we have something for you!\n\n\n\n\n\nHere comes Anatrim, the new product for the elimination of your body’s extra weight. The astonishing thing about Anatrim is it improves the quality of your life by soothing your feeling of hunger and giving you better cheer. Here you may read some notes from our customers:\n\n\n\n\n\n\"It is wonderful! \n\n\nI stopped gorging anything close at hand and watching TV constantly \n\n\nI became keen on doing exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I’m in a great form now and lots of men cast their covert glances at me!\"\n\n\n\n\n\n\nLusia R., Bellevue WA\n\n\n\n\n\n\n\"Passive weight losing was of little help to me. I was rather difficult for me to hold in my ravenous appetite. \n\n\nOne day I was told about Anatrim the media by and I was really effected by the information.\n\n\n I had tried to take it, and my wife told me I look very good now, 5 months later. \n\n\n25 pounds off and I keep still losing them! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nSerge Smith, San Francisco\n\n\n\n\n\nAnatrim helps you to understand that you doesn’t have such a great need for the constant eating. It improves your spirit, provides you with additional energy, and attacks unnecessary kilos. Great thanks to its powerful distinguished formula!!\n\n\n\nElicit more!\n\n\n\n"}