{"category": "ham", "to_address": "Alison Winters <alisonw@sgi.com>", "from_address": "James Peach <jpeach@samba.org>", "subject": "Re: samba profiling and pcp pmda", "body": "On 12/04/2007, at 1:15 AM, Alison Winters wrote:\n\n> James Peach wrote:\n>> I mean to use one mmap per record type. The current scheme is ugly\n>> because it really doesn't want to be a proper allocator but it has to\n>> deal with 2 different sizes of records in the mmap. If you have a\n>> separate mmap for each record type, the allocator goes back to being\n>> nice and simple.\n>>\n> Surely the only benefit of splitting out record types per-file (i.e.\n> client and share) is that you can step through the allocated records  \n> as\n> an array rather than a linked list?  Is there really much performance\n> gain there?  I imagine the code to step through the list and add/ \n> remove\n> records will stay pretty much the same.\n\nNo the benefit is in reducing the complexity of allocation. As you  \nallocate more different types of object, the code moves closer to  \nbeing a general purpose allocator. That's not something I want to  \nwrite or maintain, and as it becomes more complex it is harder to grow  \nthe mmap.\n\n>\n>\n>>> That's in the pipeline :)  What i'm planning is to just add a bit of\n>>> extra magic to the existing Samba profiling macros that allow us to\n>>> split it out per-client and per-share along with the existing  \n>>> recording\n>>> of global counts and times.  I'm pretty sure this is going to be  \n>>> fairly\n>>> elegant and small if i get it right.\n>> That sounds neat. It would be great if you had some code to reconcile\n>> the existing profiling stats with these metrics.\n>>\n> That's pretty much the plan.  Each class of extended stats when summed\n> together should equal the existing profiling stats (in theory).\n>\n>>> I have a separate patch which i can't submit yet (it's copyright  \n>>> SGI)\n>>> that splits out all of the current profiling statistics into smaller\n>>> groups that we can turn on and off independently.\n>> Do you mean the stats that currently live in the sysv shared memory\n>> segment?\n>>\n> Yep.\n>\n>> IIRC you only get a big performance hit when you are timing  \n>> operations.\n>> You can probably avoid this (to some degree) by using platform- \n>> specific\n>> timers.\n>>\n> I'll look into it, thanks :)  Right now there's just the regular\n> GetTimeOfDay calls.\n>\n>> IMHO, the Samba PMDA belongs in the PCP tree, not in the Samba tree.\n>> Since you are going to be the one maintaining it, it's easier all  \n>> round\n>> if it lives there. We can simply remove the existing PMDA from the  \n>> Samba\n>> tree.\n>>\n> Sure that makes sense.  So, with that in mind, what's the best way to\n> export a Samba header file for consumer apps?\n\nThat depends on exactly what you want.\n\n> For instance, in the case\n> of the smbprofile.h header, it uses stuff like enum flush_reason_enum\n> and typedef BOOL which are defined elsewhere that third-party apps  \n> can't\n> see.\n\nIf you think that smbprofile.h is OK for client apps, then it should  \nbe standalone. IMHO smbprofile.h is not the right solution for this,  \nand from the sounds of the above, you have some changes.\n\n--\nJames Peach | jpeach@samba.org\n\n"}