{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Littlefield, tyler\" <compgeek13@gmail.com>", "subject": "Re: [ot] Windows programming", "body": "The windows API is... weird.\nI went from windows API to linux, and it was a nice change.\nWith windblows, you get to pass the size of everything, and it doesn't know \nhow to take arguments by reference, or return something besides 0 or error \nmost of the time.\n\n----- Original Message ----- \nFrom: \"Steve Holmes\" \nTo: \nSent: Thursday, June 21, 2007 10:55 PM\nSubject: Re: [ot] Windows programming\n\n\n>I might give mingw a looky some time.  I messed with cygwin a while\n> back and I didn't mind the overall environment all that much but I\n> hated the installer! I found the pick list to be completely\n> inaccessible.  I couldn't track the selection status of any of the\n> list items within each package category.  I sure didn't want to\n> install every single package so when I had such a hard time picking\n> packages, I finally gave up on it.  I also wrote to the developers on\n> the support list about the installer and the response was the program\n> was so complex and intrenched that it would be nearly impossible to\n> change it.  So I am no longer interested in doing anything with\n> cygwin.\n>\n> My only other experience with the windows API was with Visual Basic\n> and the internal object browser.  I found quite a bit of information\n> in the help system within the browser.  That would probably next to\n> impossible to pull that info without the Microsoft development\n> environments such as in Visual Studio.  Perhaps the tutorials Greg\n> mentions is a big help.\n> -- \n> HolmesGrown Solutions\n> The best solutions for the best price!\n> http://holmesgrown.ld.net/\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}