{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"INA Trading\"<Tammie.Kielpinski@rightbattle.com>", "subject": "Company Reports $0.02 per share in Earnings for Quarter", "body": "\n\n\nCompany Reports $0.02 per share in Earnings for Quarter\n\n\n\n\n\nCompany Reports $0.02 per share in Earnings for Quarter\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nU.S. STARCOM 1ST QUARTER REVENUES AND  NET INCOME SOAR \n                              OVER LAST YEAR. COMPANY REPORTS $0.02 PER  SHARE \n\n                              IN EARNINGS FOR QUARTER \n\n\n\n \n\n\n\n \nPerth  Amboy, New Jersey: U.S. Starcom, (Pink Sheets: USTA), announced today that its  1st quarter 2007 results, posted on www.pinksheets.com, soared above the same  figures of the same period last year. With the recent acquisition of Mundetel  Communications, core revenues soared over 400%, even excluding the results of  their rapidly expanding Bell Latino chain. Net income increased to $842,854, or  $.02/share, an increase of $1,221,419 over last years loss of $378,565. Gross  revenues increased to $7,449,605 from last year’s $709,282.\n\n\n\n \n\n\n\n\n \n“The  company is now entering an exciting phase of growth,” said John DiDomenico,  President of US Starcom. “Bell Latino is expanding rapidly\n  in  the Tri-state area, as well as in Miami, while  Mundetel is adding service to new countries in Central and South America, as  well as the Caribbean. Our music division is  going to announce some very big surprises in the coming weeks, and our Sky  Distribution subsidiary is adding new product, and expects impressive results  will be forthcoming. For these and other reasons, we expect record results for  our 2nd quarter.”\nUSTA  had previously announced $0.02 per share in earnings for the fourth quarter of  2006.  The company is on track for record  profits in 2007.\nFor  a profile on the company, please visit:\nwww.wallst.net/superstocks/superstocks_profile.asp?ticker=usta \nAbout  U.S.  Starcom\n  With a sales distribution network extending to  thousands of urban locations, U.S. Starcom continues its rapid expansion into  the distribution of alternative communication products and services, including  music, media, international long distance, prepaid services, wireless dial  around applications, stored value services, remittances, money debit cards, and  internet service enhancements. U.S. Starcom provides access to the latest  entertainment offerings from the recording industry through strategic alliances  and joint distribution campaigns. The company provides product development,  distribution, and system installation through its three independent  subsidiaries, Sky Distribution and Mundetel,   money remittances and telecom services through its Bell Latino  subsidiary and music and media distribution through its La Corporacion  subsidiary.\nSafe Harbor Statement\nThis release contains statements that  constitute forward-looking statements within the meaning of Section 27A of the  Securities Act of 1933, as amended, and Section 21E the Securities Exchange Act  of 1934, as amended. These statements appear in a number of places in this  release and include all statements that are not statements of historical fact  regarding the intent, belief or current expectations of the Company, its  directors or its officers. Investors are cautioned that any such  forward-looking statements are not guarantees of future performance and involve  risks and uncertainties, many of which are beyond the Company's ability to  control, and that actual results may differ materially from those projected in  the forward-looking statements as a result of various factors.                      \n  \n \n\n\n \n\n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n\n"}