{"category": "ham", "to_address": "\"avcavc\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"AccuWeather.com Alert\" <inbox@messaging.accuweather.com>", "subject": "AccuWeather.com Alert(tm) Advisory  (avcavc)", "body": "\n\nAccuWeather.com Alert[TM]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSevere Watches and Warnings for BEVERLY HILLS \n\n\n\n\n\n\n\n\n\n\n\n\n\nLOXCFWLOX\r\nWHUS46 KLOX 260649 CCA\r\nCFWLOX\r\n\nCOASTAL HAZARD MESSAGE...CORRECTED\r\nNATIONAL WEATHER SERVICE LOS ANGELES/OXNARD CA\r\n1148 PM PDT WED APR 25 2007\r\n\n..HIGH SURF EXPECTED ON EXPOSED WEST FACING SHORES...\r\n\nHIGH SURF WILL CONTINUE AND STRONG RIP CURRENTS WILL PERSIST\r\nTHROUGH THURSDAY AFTERNOON ALONG EXPOSED WEST FACING SHORES. THIS\r\nLARGE NORTHWEST SWELL WILL BRING THE HIGHEST SURF CONDITIONS TO\r\nTHE COASTAL AREAS OF SAN LUIS OBISPO AND WESTERN SANTA BARBARA\r\nCOUNTIES. DUE TO THE LONGER PERIOD OF THE SWELL...SOME OF THIS\r\nENERGY WILL SPREAD INTO THE INNER COASTAL WATERS...RESULTING IN\r\nHIGHER THAN NORMAL SURF CONDITIONS ACROSS WEST FACING BEACHES OF\r\nLOS ANGELES AND VENTURA COUNTIES.\r\n\nCAZ046-260800-\r\n/O.COR.KLOX.CF.S.0006.000000T0000Z-070426T2200Z/\r\nSANTA MONICA MOUNTAINS RECREATIONAL AREA-\r\n1148 PM PDT WED APR 25 2007\r\n\nHIGHER THAN NORMAL SURF FOR THE SANTA MONICA MOUNTAINS WAS\r\nINCLUDED IN ERROR IN THE LAST ISSUANCE. NO SURF IS EXPECTED FOR\r\nTHE SANTA MONICA MOUNTAINS.\r\n\n$$\r\n\nCAZ034-035-261515-\r\n/O.CON.KLOX.SU.Y.0007.000000T0000Z-070426T2200Z/\r\nSAN LUIS OBISPO COUNTY CENTRAL COAST-\r\nSANTA BARBARA COUNTY CENTRAL COAST-\r\n1148 PM PDT WED APR 25 2007\r\n\n..HIGH SURF ADVISORY REMAINS IN EFFECT UNTIL 3 PM PDT THURSDAY...\r\n\nTHE NATIONAL WEATHER SERVICE IN LOS ANGELES/OXNARD HAS CONTINUED A\r\nHIGH SURF ADVISORY FOR THE SAN LUIS OBISPO AND SANTA BARBARA\r\nCOUNTY CENTRAL COASTS. THIS ADVISORY REMAINS IN EFFECT UNTIL 3 PM\r\nPDT THURSDAY.\r\n\nBREAKERS BETWEEN 10 AND 13 FEET WILL CONTINUE THROUGH THURSDAY\r\nAFTERNOON...WITH HIGHEST SURF CONDITIONS ON WEST AND NORTHWEST\r\nFACING BEACHES.\r\n\nA HIGH SURF ADVISORY MEANS THAT HIGH SURF WILL AFFECT BEACHES IN THE\r\nADVISORY AREA...PRODUCING STRONG RIP CURRENTS AND LOCALIZED BEACH\r\nEROSION. ALL PERSONS SHOULD BE AWARE OF THE RISKS ASSOCIATED WITH\r\nWATER RELATED ACTIVITIES AND USE EXTREME CAUTION WHEN ENTERING THE\r\nOCEAN. WHEN IN DOUBT...JUST STAY OUT.\r\n\n$$\r\n\nCAZ040-041-261515-\r\n/O.CON.KLOX.CF.S.0006.000000T0000Z-070426T2200Z/\r\nVENTURA COUNTY COAST-\r\nLOS ANGELES COUNTY COAST INCLUDING DOWNTOWN LOS ANGELES-\r\n1148 PM PDT WED APR 25 2007\r\n\n..HIGHER THAN NORMAL SURF EXPECTED TO CONTINUE...\r\n\nHIGHER THAN NORMAL SURF EXPECTED TO PERSIST AT THE LOS ANGELES AND\r\nVENTURA COUNTY BEACHES THROUGH THURSDAY AFTERNOON. BREAKERS\r\nBETWEEN 4 AND 6 FEET WILL BE COMMON ACROSS WEST FACING BEACHES OF\r\nLOS ANGELES AND VENTURA COUNTIES THROUGH THURSDAY AFTERNOON...WITH\r\nLOCALLY HIGHER SETS LIKELY ACROSS WELL EXPOSED AREAS.\r\n\nTHE HIGHER THAN NORMAL SURF CONDITIONS WILL LIKELY PRODUCE STRONG\r\nRIP CURRENTS. ALL PERSONS SHOULD BE AWARE OF THE RISKS ASSOCIATED\r\nWITH WATER RELATED ACTIVITIES AND USE EXTREME CAUTION WHEN ENTERING\r\nTHE OCEAN. WHEN IN DOUBT...JUST STAY OUT.\r\n\n$$\r\n\nHALL\n\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChoose another forecast:\n\t\t\t\t\t\t\t\t\t\tEnter a zipcode, or a city, state\n  \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n©2007\n\t\t\t\t\t\t\tAccuWeather, Inc. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}