{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Joseph Stokes <posey@goweronline.com>", "subject": "Top pills at low prices", "body": "\n\nYou want to save your money and get licensed medications? I bet you do!\nAll this you can find here\nErectile Dysfunction is one of the most serious problems that a man can get in his life. The best cure nowadays are Viagra and Cialis.\nGo to the shop\nWe offer only legal and licensed medications. Cheapest prices you ever seen.\nWith best regards,\nJoseph Stokes\n \n \nV takom sluchae o tebe zdes uzhe naverniaka hodit desiatok-drugoj Legend, a? predpolozhil ia. Shefir gryz moiu zashchitu sloj za sloem, i ostavalos uzhe Sovsem nemnogo, chtoby razrushit ee okonchatelno. Tebe nikogda ne govorili, chto ty v Rubashke rodilsia? Mne dumaetsia, chto vse dovolno prosto, Nori. A teper. \nV neskolko stremitelnyh shagov ia okazalsia vozle Onni, vse eshche potriasenno Pialivshejsia na Kvina. Ia medlenno kivnul: Ia tozhe tak dumaiu. Kakim obrazom my smozhem zamenit tebia? O net, ne zamenit, Niks, s miagkoj hripotcoj popravil Celitel, Smeniv basovitoe utrobnoe rychane na pochti normalnyj chelovecheskij golos. I Bigman, i Celitel zdes byli horosho izvestny, poetomu edva udostaivalis Mimoletnyh vzgliadov, ia zhe, kak novichok, vyzyval estestvennyj, da eshche dolgo Sderzhivaemyj zapretom interes. Kazhetsia, ia stanovlius neskolko odnoobrazen. Pol zadrozhal. Buj neskolko mgnovenij kachalsia na vode kak ni v chem ne Byvalo, a potom rassypalsia prahom, ischez bez sleda, bez zvuka. Sovsem? Ee golos prozvuchal zhalobno, slovno u obmanutogo v ozhidaniiah Rebenka. \nMozhet byt, primesh eto v kachestve platy? Ty mogla by vziat za nih horoshuiu cenu U proezzhih puteshestvennikov. Zabud obo vsem. Bolee togo, sejchas ty mne dash slovo, Chto ne posleduesh srazu za mnoj, a vyzhdesh, k primeru, den. Mne prishlos s Grustiu priznatsia sebe, chto izgolodavsheesia po silnym i chistym chuvstvam serdce Trebovalo svoego, otvedennaia dlia etogo nisha dolgo pustovala. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}