{"category": "ham", "to_address": "sugar@lists.laptop.org", "from_address": "Yoshiki Ohshima <yoshiki@squeakland.org>", "subject": "Re: [sugar] Rebe", "body": "  Eben,\n\n> I think the biggest point to be made here is an argument for a \"document\" or \"object\" of sorts.  Etoys definitely seems\n> to have most of the types of interaction and media embedding solutions I believe Rebecca and I both want, but (as far as\n> I know, though I admittedly don't know that much) it does so in an all encompassing environment.  What we really need is\n> a lightweight format that lets one pass around these \"scratchpads\" or \"collages\" as objects, so the teacher can create a\n> file, pass it out as homework, etc.  I could be very wrong in my assumptions, though, so please correct me where I am.\n>  I see lots of potential for Etoys, and I'd like to better understand how it integrates with Sugar now, and how we can\n> push it in the most effective direction.\n\n  Currently, for historical reasons, an EToys \"project\" is saved into\na file (relatively small, but can be big if you use a lot of media)\ncalled a project file or (\".pr\" file).  The file can be passed around:\nIf the user type an URL for a .pr file into XO's browser, it fetches\nthe file from the server and launch Etoys with it.  In short, you can\njust think that a .pr file is a document file for the Etoys\napplication.\n\n  We do have a higher-level document format (document formats, to be\nprecise) and thinking to migrate that.\n\n  Also, we are almost ready to merge the drag-and-drop code that lets\nthe user to drag an Etoys object onto the frame, and paste it into\nWrite and other activities (and vice versa).  This drag-and-drop code\nlets the user copy and paste text as well.\n\n-- Yoshiki\n\n> On 6/21/07, Bert Freudenberg  wrote:\n> \n>     Indeed, \"scratchpad\" describes Etoys pretty precisely ;)\n>    \n>     You can draw, write (even with multi-column text layout flowing\n>     around abjects), and of course calculate.\n>    \n>     It's not just \"type anywhere and a curve pops up\", although in fact\n>     such an extension exists (but not included in the OLPC Etoys\n>     version): called MathMorphs and MorphicWrappers done by the\n>     Argentinian Squeak community a couple years ago:\n>              http://www.dm.uba.ar/MathMorphs/\n>    \n>     and updated to work in recent Squeak releases\n>    \n>             http://wiki.squeak.org/squeak/5855\n>    \n>     If there is enough interest in this (and I agree it's a great\n>     environment for exploring Math) we might try to find someone porting\n>     it to the OLPC version. Or maybe it just works if installed, I\n>     haven't tried (unfortunately our plates are still full with lower-\n>     level stuff).\n> \n>     - Bert -\n>    \n>     On Jun 21, 2007, at 22:01 , Eben Eliason wrote:\n>    \n>     > Rebecca -\n>     >\n>     > This sounds similar to some of my ideas for \"Collage\"...allowing\n>     > combinations of text, drawing, image, and other media formats in a\n>     > freeform canvas.  The response there seemed that Etoys was, in many\n>     > ways, already providing such a thing.  I think this is a really\n>     > interesting area though, and the potential to be able to send\n>     > multimedia documents around, specifically in an educational\n>     > environment, is huge. Do you have more thoughts on specifically how\n>     > this could be distinguished from Etoys?\n>     >\n>     > Additionally, there is the Sophie project, but I'm not that\n>     > familiar with it or how far along they've come with the project on\n>     > the XO.\n>     >\n>     > - Eben\n>     >\n>     >\n>     > On 6/21/07, Rebecca Gettys  wrote:\n>     > Hello all,\n>     > I had an idea while playing witha green machine...this may be a little\n>     > late, I don't know. What if ther was some sort of \"scratchpad\"\n>     > activity,\n>     > not draw, or write,or calculator but a kind fusion of all three.\n>     > mathimatical equasions could be typed out and then they could solve\n>     > with\n>     > typing and or drawing for their work, and they could write guides and\n>     > picture books and such with this activity as well. Is this in\n>     > possible/in the plans/something similar is being made???\n>     > ~Rebecca Gettys\n>     >\n> \n> \n> [2  ]\n> _______________________________________________\n> Sugar mailing list\n> Sugar@lists.laptop.org\n> http://lists.laptop.org/listinfo/sugar\n_______________________________________________\nSugar mailing list\nSugar@lists.laptop.org\nhttp://lists.laptop.org/listinfo/sugar\n\n"}