{"category": "ham", "to_address": "thaifta lists <thaifta@lists.riseup.net>, e-drug@healthnet.org,\n   ip-health <ip-health@lists.essential.org>, aidsdrugs@lists.riseup.net", "from_address": "Kannikar KIJTIWATCHAKUL <kakablue@yahoo.com>", "subject": "[Ip-health] Thai civil society supports the health ministers of Thailand and Brazil and calls on pharmaceutical companies and lobbyists to stop abusing their power", "body": "Thai civil society supports the health ministers of\nThailand and Brazil and calls on pharmaceutical\ncompanies and lobbyists to stop abusing their power\n\nThe campaign in Thailand for affordable access to\nlife-saving drugs dates back more than a decade. Civil\nsociety groups, including consumer and health\norganisations, health professionals and people living\nwith HIV-AIDS, have worked together with officials of\nthe ministry of public health to achieve affordable,\naccessible and quality health care for every Thai\ncitizen. We have worked with many different\ngovernments, but always with the clear objective of\npromoting health for all Thai people.\n\nWe are concerned that pharmaceutical companies,\nlobbyists and interest groups are using misleading,\nfalse and emotive arguments and advertising to\ndiscredit the recent decision of the Thai government\nto issue compulsory licences on the life-saving drugs.\n\n\nThese attempts to attack the legitimacy of the Thai\ngovernment's decisions are insulting and mischeivous.\nThe present Thai government -- which was indeed\nappointed by the military following the coup of 19\nSeptember 2006 -- has not broken any laws: rather, the\nMinister for Public Health and officials from the\nDepartment of Health have acted according to the\nflexibilities laid out in Article 31(b) of the WTO\nintellectual property (TRIPS) agreement. These\nflexibilities are available to all WTO members and\nhave been used by many countries in the past,\nincluding the United States. (1)\n\nIt seems, however, that when faced with the prospect\nof losing profits, the pharmaceutical companies,\nbacked by the US Chamber of Commerce and lobby groups\nsuch as USA for Innovation, will stoop to any argument\nto discredit the legitimate actions of the present\ngovernment. For example, in an advertisment published\nin the Wall Street Journal on 9 May, 2007, the lobby\norganisation USA for Innovation accused the Thai\ngovernment of \"stealing\" American assets to fund\nincreased militarisation. One week earlier,\nadvertising in the same newspaper, the lobbyists drew\na bizarre parallel between the current Thai\ngovernment's compulsory licencing decision and the\nBurmese junta. (2)\n\nWe know that the pharmaceutical corporations have\nunlimited financial resources to mount these\naggressive campaigns of dis-information. As public\nhealth advocates, we believe that health policy should\nnot be subjected to the vicissitudes of politics, nor\nshould it be driven by the interests of transnational\npharmaceutical companies. Their current campaign of\ndisinformation shows the limits of \"corporate social\nresponsibility.\"\n\nWe support fully the actions of the Thai and Brazilian\nhealth ministers who exercised their right to issue\ncompulsory licences in the interests of public health,\nthus taking us one step closer to realising the goal\nof health for all.\n\n(1)\nhttp://www.cptech.org/ip/health/cl/recent-examples.htm\n(2) http://www.usaforinnovation.org/home/index.cfm\n\nSigned by:\n\nThai Network of People Living With HIV/AIDS (TNP+)\nThai NGO Coalition on AIDS\nAIDS Access Foundation\nDrug Study Group\nRural Pharmacist Foundation\nConfederation of Consumer Organization\nFoundation for Consumers\nBiodiversity and Community Rights Action Thailand\nAlternative Agriculture Network\nFTA Watch\nCorporate Watch, Thailand\nFocus on the Global South (Thailand)\nThe Strategic Policy on Natural Resources Base\nProject, National Human Right Commission\nThe Rural Reconstruction Alumni and Friends\nAssociation\nMedecins Sans Frontiers-Belgium (Thailand)\n\n\nKannikar KIJTIWATCHAKUL (Kar)\nMobile 66-85-0708954\nkakablue@yahoo.com\n\n__________________________________________________\nDo You Yahoo!?\nTired of spam?  Yahoo! Mail has the best spam protection around\nhttp://mail.yahoo.com\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}