{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Cristina Gee\" <dhf@lycos.de>", "subject": "=)", "body": "\n=)\n\n\nHello!\n  My name is Elena, I which girl of 26 years, I was born on June,\n  27, 1980 in city Kazan in Russia, my growth of 173 sm, my weight of 63\n  kg. I investigated English language in institute, I studied there as\n  the architect, but have then connected the life with Landscape\n  designer. I write to you this letter in full despair. The matter is\n  that I have got acquainted with the man through the Internet. I\n  corresponded with him many months, we very well understood each other,\n  and during our dialogue became very much close people. I have\n  understood, that we need to receive a meeting, in fact, one real\n  meeting, can tell about the person, it is more than thousand letters.\n  I began to prepare for documents for departure Russia. While we\n  communicated, I saved money for travel. I worked much, I make\n  everything what to earn money for the trip. I went to the purpose, and\n  I her have achieved! But when I have written him that have invited me\n  in embassy, concerning consultation for reception of the visa. he has\n  told that all this was for him game. he received pleasure from\n  dialogue, but he did not think, that my intentions were very serious.\n  Then I have received the letter where he wrote \" that him is very a\n  pity, he the married person and is happy in marriage \". When I have\n  written him a question why he so severely played with me. he has\n  ceased to write and began to ignore my letters which I wrote. I write\n  to you this letter, with hope that you will answer me! A problem that\n  in a week I shall receive the visa. I do not want to cancel trip from\n  for this cowardly loser. I not when was not abroad Russia, and it was\n  very pleasant for me to look the country. I want to tell to you, that\n  I have all necessary what to arrive to you. Whether I simply want ask\n  you I can to make it?! I understand, that this offer can be very\n  interesting and strange simultaneously. But very much frequently, the\n  life, brings to us surprises which we simply do not wait. And now at\n  us two such surprise. My heart prompts me, that we could take pleasure\n  in dialogue, pleasantly spend. Together we could embellish our boring\n  life. Now I am in Moscow, I live here in cheap hotel as I have no\n  relatives in Moscow. This week I shall go to receive the visa. I very\n  strongly want, that you with understanding would consider my\n  situation. I want to look the world, and to see as people live, than\n  they are engaged. I shall be simply happy to get acquainted and arrive\n  to the person who has rescued me in such difficult situation. I want\n  to use one chance which was given to me with my destiny. And who\n  knows, this chance be given and to you can. I the usual woman which\n  have remained in private, with such big problem. I ask you to\n  understand my letter correctly, and to try enter my position. I shall\n  be very grateful to you, if you write to me the letter. I can send you\n  the picture, that you could see the woman which so has severely been\n  deceived. I was to be trusted, that you will not laugh on up to me. I\n  hope that you will correctly react to my unexpected letter!!! In fact\n  lives it is a strange piece, and not when you do not know, where you\n  will find, and where you will lose. That you would think of that that\n  I have arrived to you on a visit, I shall be very glad to receive from\n  you the letter. My address of e-mail (listersster@bk.ru).Yours\n  faithfully Elena.\n"}