{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Kimberly Dozier Returns", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nKimberly \n      Dozier, Back On The Job\"Now, those times I see a \n      correspondent in the middle of the action, I say to myself, I know how \n      you're operating. You're operating with that same sense of, uh, plausible \n      deniability that I need to do my job. It won't happen to me. That is just \n      the only way you walk out the door everyday. I mean, if you're smart. If \n      you're not thinking about the dangers you need to get your head examined. \n      Because if you're in Baghdad, you're listening to explosions galore all \n      day long. If you have a brain in your head, you know that they're – you \n      know who they're aimed at. And you know if you go out with either an Iraqi \n      government official or a US patrol, or a foreign aid worker, any one of \n      those groups, you're a target.\"[+ Read More]\n\nThe Rules Are \n      ... There Are No RulesIf you’re a fan of Mitt Romney, than \n      you think that Mike Wallace was unprofessional when he asked if there had \n      been any premarital sex before Mitt and his wife tied the knot – but if \n      you’re an Obama fan, you may not have found it inappropriate. Likewise, \n      Bill Richardson’s supporters aren’t fans of the Albequerque reporter who \n      asked him if he had “a bimbo problem.” [+ Read More]\n\nHow Much \n      Should The Military Constrain Journalists In \n      Iraq?Journalists have a responsibility to be sensitive to \n      the privacy and personal concerns of soldiers and their families, but they \n      also have an obligation to tell the story of a war that has become \n      increasingly difficult to cover. The military's guidelines limit \n      journalists' ability to weigh these two considerations on a case by case \n      basis, making it harder for them to generate the kinds of powerful and \n      enduring images that can become icons of a conflict. [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nThe \n      Accidental \"It\" Girl Bury \n      The Press At Wounded \n      KneeHow \n      To Manufacture A Late December Story\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}