{"category": "spam", "to_address": "<jarvismaxwellrevesjr@yahoo.co.jp>", "from_address": "CPT JARVIS MAXWELL REEVES <info_online002@bellsouth.net>", "subject": "PARTNERSHIP PROPOSAL", "body": "Capt Jarvis Maxwell Reeves Jr,\nof D Company, 2nd Battalion, \n22nd Infantry Regiment \nGood day,\n \nI am Capt Jarvis Maxwell Reeves Jr, an American Soldier. I am serving in the US Army of D Company, 2nd Battalion 22nd,Infantary Regiment, Iraq.As you know we are being attacked by insurgents everyday and car bombs.I and my crew members discovered $650M USD in Saddam Hussein's palace in April 2003. We managed to move away a total sum US$25 Million dollars cash out from the $650M USD, mostly 100-dollar bills and was quickly flown out of the warzone and deposited in an undisclosed security company in U.A.E. You can click on the site for more details about the funds.\n \nhttp://news.bbc.co.uk/2/hi/middle_east/2988455.stm\n \nUnfortunately, the rest of my crew members have lost their lives to the wicked Iraqi insurgents. I therefore seek your partnership to assist me transfer these funds into your account and invest the funds without further delay.I will take 65% while you take the other 30% and 5% will be for expences, no strings.If you are interested I will send you the full details but my fear is Can I trust you? When you receive this letter, kindly send me an e-mail signifying your interest including your most confidential telephone/fax numbers in order to forward to the security firm for the release of the funds in your names or your company.\n \nRespectfully,\nCapt Jarvis Maxwell Reeves Jr.\nIf interested reply to my personal email:jarvismaxwellreevesjr@yahoo.co.jp\n\nAmbrogino Fondazione \nAnnex Office\n31b Highgate High Street,\nLondon, N6 5JT.\nUnited Kingdom.\n\nRecipient,Dear \nYou are lucky to have been selected among the 15 Recipient of\n500,000pounds each by Ambrogino Fondazione. For further inquiry, \nplease Contact our secretary:\nName: Mr.Mike solis\nTel:  +44-703-192-9857\nEmail:ag_foundation01@yahoo.com.hk\n\n\nCheers\nMrs. susan Davies\n\n\n"}