{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 110", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. USA. Bringing trust back to the Getty\n      (Museum Security Network Mailing list)\n   2. Theft is chipping away slowly but surely at India's heritage\n      treasures,\twith at least 32 idols and artefacts under the\n      protection of the\tarchaeological authority going missing in the\n      last three years. (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Sun, 6 May 2007 11:42:36 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] USA. Bringing trust back to the Getty\nTo: \nMessage-ID: <000401c78fc2$e0c8c570$a25a5050$@org>\nContent-Type: text/plain;\tcharset=\"US-ASCII\"\n\nBringing trust back to the Getty \nAs L.A. giant struggles, new chief takes helm \nBy Jim Farber, Staff Writer\nU-Entertainment \nArticle Last Updated:05/05/2007 06:06:23 PM PDT \n \nWith a scant three months on the job under his belt, James Wood, the new\npresident and CEO of the J. Paul Getty Trust, is trying to get his arms\naround his new position. \n\nAt the same time, he's confronting the Gulliver-esque challenge of being a\nstranger in the strange land of Los Angeles. \n\nThe 66-year-old Bostonian, who from 1980 to 2004 served as director and\npresident of the Art Institute of Chicago, finds himself presiding over the\nthird-largest foundation in America, at a time when the Getty Trust is eager\nto dispel the clouds of scandal that have blackened its reputation. \n\nWood replaces former president Barry Munitz, who resigned under pressure in\nFebruary 2006, following revelations that he had abused the trust's\nnot-for-profit status. \n\nA civil investigation by the state Attorney General's Office, the results of\nwhich were released Oct. 2, concluded that \"while improper expenditures were\nmade\" - such as using charitable funds for first-class travel and luxury\nlodging and dining for Munitz - no crimes had been committed. \n\nNevertheless, the attorney general determined, \"It is appropriate to appoint\nan independent monitor to ensure that trustees and employees of the trust\nimplement and comply with the policy and procedural reforms\" recommended in\nthe report. \n\nSeated in the trust's panoramic boardroom atop the Getty Center in\nBrentwood, with its Olympian view of the city below, Wood comes across as\ncandid and enthusiastic about his new role. \n\nWhite-haired, tall and distinguished, the first thing he does is shed the\njacket of his elegant black suit, revealing a scarlet and black knit tie\nthat, perhaps, hints at a piquant subversiveness beneath his otherwise\nconservative exterior. \n\nWood's love and appreciation of art is obvious, especially as Entering eye\nof the storm \n\nthe recipient of multiple degrees in art history nostalgically recalls the\nyear he spent as a student exploring the treasures of Italy on a motorcycle.\n\n\nHe's also a realist and a sufficiently skilled administrator to admit that,\nat this point, he doesn't have all the answers to the hard questions that\nconfront the Getty. \n\nBefore accepting the job, Wood says, there was one important factor he\nneeded to determine - whether the Getty had hit bottom with its problems. \n\nWas the institution on the way up, or was it still spiraling down? \n\n\"I had plenty of chances to talk with the board,\" he says. \"And it was clear\nto me that they had absolutely hit bottom. They had grasped the problems.\nThey had dealt with the problems. I wanted to know enough not to repeat\nmistakes.\" \n\nWood points out that the institution has a monitor overseeing it, which he\ncalls \"understandable given what we went through.\" \n\n\"The board has totally redone its guidelines for expenditures, which they\nshould. We are a nonprofit institution, a public trust. Every penny that is\nnot spent on salaries, operations and expenses needs to go into programs and\ncollection acquisitions. ... We have an opportunity to set an example of\ncorrect governance and the wise use of funds. And we damn well better.\" \n\nThere still remains, however, one rattling skeleton in the Getty's closet -\nformer curator of antiquities Marion True, who remains on trial in Rome (and\ncould go on trial in Greece) for conspiring to purchase and import for the\nGetty's collection that prosecutors allege were looted and smuggled out of\nthe country. True has denied any wrongdoing. \n\n\"The Getty made mistakes in acquisition,\" Wood says categorically. \n\n\"But with hindsight - and I am not trying to justify it - the ethics of\ncollecting have changed a lot over the last 30 years. And they should have\nchanged. \n\n\"The Getty's not the only museum that's struggled through that evolution,\nbut I think it was more about poor governance and management. We hope we can\nresolve the problem with the Italians. It will take time.\" \n\nIn Wood's estimation, the components that make up the Getty Trust - the\nFoundation, the Conservation Institute, the museums and the Research\nInstitute - should add up to something greater than the sum of its parts. \n\n\"It's a question of getting together the right creative mix of people,\nexpertise and programming,\" Wood says. \"The Getty has the resources and\ncapabilities to go way beyond the needs of its own collections. We can\nliterally go out and create a project to preserve cave paintings in China.\nThat's totally different from a regular museum and something I find very\nexciting.\" \n\nThe critical consideration \n\nof antiquities Maximizing its potential \n\nA justified image? \n\nAccurate or not, the Getty has always had something of an ivory tower image,\nwhether it's the perception of the Getty Villa as a hidden refuge or the\nimposing architecture of the Getty Center (conceived by architect Richard\nMeier) that stands above the 405 Freeway like a fortress. \n\n\"Everyone has their analogy. The worst is Masada,\" he says with a laugh. \n\nA key question he faces - and it's not a new one - is, how can he and his\ninstitution best relate to such a sprawling megalopolis. \n\n\"That's a really important issue to me,\" Wood says. \"We've got to be a\nstrong, generous citizen. But, at the same time, we are an institution with\ninternational responsibilities. They should not be contradictory. It's a\nbalancing act. \n\n\"The kids on the buses and the scientific project in China are the ends of a\nspectrum that should help each other,\" he says. \n\nAs for his own description of the Getty, the former student of Italian art\nand architecture chooses one in keeping with his background. \n\n\"To me, the really important analogy is the piazza. It's the place where art\nand the public mingle.\"\n\nhttp://www.dailynews.com/\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Sun, 6 May 2007 20:22:48 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Theft is chipping away slowly but surely at India's\n\theritage\ttreasures,\twith at least 32 idols and artefacts under the\n\tprotection of the\tarchaeological authority going missing in the last\n\tthree years.\nTo: \nMessage-ID: <006601c7900b$8d00d330$a7027990$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nLost and not found: India's stolen artefacts\n\nTheft is chipping away slowly but surely at India's heritage treasures, with\nat least 32 idols and artefacts under the protection of the archaeological\nauthority going missing in the last three years.\n\n>From correspondents in Delhi, India, 6 May 2007 - (www.indiaenews.com)\n\nTheft is chipping away slowly but surely at India's heritage treasures, with\nat least 32 idols and artefacts under the protection of the archaeological\nauthority going missing in the last three years.\n\nAccording to data from the ministry of culture, 38 protected works of art\nhave been stolen since 2004 but law-enforcing agencies have managed to find\nonly six of them.\n\nAmong those recovered are a Shivling from the Bumzuva Cave in Anantnag\ndistrict of Jammu and Kashmir, a Jain image of Alathur in Tamil Nadu and an\nAnant Shesh idol from the Laxman temple in Chhattisgarh.\n\nWhile these were under the protection of the Archaeological Survey of India\n(ASI), many others too have been stolen and probably smuggled abroad.\n\n'The theft cases are a cause of concern for the ministry of culture and we\nhave asked the concerned state governments to take up the issue in a more\nstrict manner. Two cases, one each in West Bengal and Bihar, have been\nhanded over to the CBI and they are doing a good job,' Tourism and Culture\nMinister Ambika Soni told IANS.\n\nThe ASI has collected theft data from all over the country and submitted a\nreport card to the culture ministry. Among the states, Madhya Pradesh tops\nthe list of places from where relics have been stolen followed by Rajasthan.\n\nIn Madhya Pradesh, 14 art objects, including 11 sandstone sculptures, and\none stone sculpture have been stolen.\n\nAmong these are two Buddha idols - one in sitting posture and the other in\nmeditating posture - that have been missing since Jan 20 this year. However,\nthe state police recovered one female deity, Tara.\n\nIn Rajasthan, 10 artefacts, including seven sculptures from several parts of\nthe state and one wheel and cart frame from the Archaeological Museum in\nKalibagan, are missing.\n\nHowever, what is heartening is the recovery of 17 of the 18 idols that had\nbeen missing from Patna Museum. These are not part of the 32 ASI protected\nartefacts missing since 2004.\n\nEighteen bronze idols have been stolen from the state-owned museum Sep 27,\n2006. The case was handed over to the CBI and so far 17 idols have been\nrecovered, the theft report card of the ministry stated.\n\nApart from ASI protected artefacts, one relic from the Kolkata-based Indian\nMuseum, an autonomous body under the ministry of culture, has been missing\nsince Dec 29, 2004.\n\nAfter the state police failed to crack the case and recover the stone head\nof Lord Buddha, the case was handed over to the Central Bureau of\nInvestigation (CBI).\n\nElaborating on the smuggling of artworks from India, ASI director general C.\nBabu Rajeev said: 'We have already signed an agreement with China to stop\nillegal smuggling of these heritage items. Such agreements with other\ncountries are in the pipeline.'\n\nIdol theft in Delhi and its adjoining areas is also peaking. In January,\nthis year, 10 precious idols were stolen from a Jain temple in Gurgaon on\nthe outskirts of Delhi. The idols were made of 'ashtadhatu' or eight metals,\nand some were up to five centuries old.\n\nA 900-year-old idol stolen from a temple in Uttar Pradesh was recovered in\nDelhi and two people were arrested in connection with the theft last month.\n\nIn another incident, three 700-year-old Jain idols costing Rs.130 million on\nthe international market were recovered in Delhi in March from a man who\nallegedly planned to smuggle them out of the country. In the three above\ncases, the idols were not ASI protected.\n\nSoni said her ministry is in touch with Indian embassies abroad to keep a\nclose tab on such illegal activities and is consulting the CBI to devise\nways to curb them. The government is planning amendments to the Antiquities\nand Art Treasures Act, 1972 to make the provisions more stringent.\n\nBy Prashant K. Nanda (Staff Writer, C IANS)\n\nRead more at: http://www.indiaenews.com/art-culture/20070506/50469.htm\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 110\n****************************************\n\n"}