{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "Amateur BONUS <AmateurBonus@bigenginemen.com>", "subject": "SEXUALLY-EXPLICIT: Amazing Amateur Bonus 14 for 1 gnitpick!", "body": "\n\nred lagoon gnitpick\n\n\n\n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n14 Sites For the Price of 1, gnitpick\n\nHard Core Bonus Instant Access 05/24/2007 10:54:54\n\nJokes of the day\nJoke 1 Those raccoons are not luggage\nAs migration approached, two elderly vultures doubted they could make the trip south, so they decided \nto go by airplane.\nWhen they checked their baggage, the attendant noticed that they were carrying two dead raccoons. Do \nyou wish to check the raccoons through as luggage? she asked. \nNo, thanks, replied the vultures. They're carrion. \nJoke 2 What just happened here?\nA military cargo plane, flying over a populated area, suddenly loses power and starts to nose down. \nThe pilot tries to pull up, but with all their cargo, the plane is too heavy. So he yells to the \nsoldiers in back to throw things out to make the plane lighter. They throw out a pistol. Throw out. \nshouts the pilot. So they throw out a rifle. They heave out a missile, and the pilot regains control.\nHe pulls out of the dive and lands safely at an airport. They get into a jeep and drive off. Pretty \nsoon they meet a boy on the side of the road who's crying. They ask him why he's crying and he says A \npistol hit me on the head.\nThey drive more and meet another boy who's crying even harder. Again they ask why and the boy says, A \nrifle hit me on the head.\nThey apologize and keep driving. They meet a boy on the sidewalk who's laughing hysterically. They ask \nhim, Kid, what's so funny? The boy replies, I sneezed and a house blew up. \n\n \n\n\n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n\n"}