{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "1120a 6/6 Update: Shuttle countdown on track; weather still 70 percent 'go'", "body": "\n\n\n\n\n1120a 6/6 Update: Shuttle countdown on track; weather still 70 percent 'go'\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 19\nPosted: 11:10 AM, 6/6/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-17 (06/04/07): Astronauts arrive for launch\n   SR-18 (06/05/07): Countdown on tap; launch forecast 70 percent 'go'\n   SR-19 (06/06/07): Countdown underway; weather still 70 percent 'go'\n\n=================================\n\n11:10 AM, 6/6/07, Update: Countdown underway; weather still 70 percent 'go'\n\nThe shuttle Atlantis' countdown to blastoff began on time Tuesday night and while stormy weather was expected later today, forecasters continue to predict a 70 percent chance of good weather at launch time Friday.\n\nThe only technical issue under discussion involves 2-inch and 4-inch hydrogen pressurization lines on the external tank that will be used by shuttle Endeavour in August that are very slightly - a few ten-thousandths of an inch - out of spec. NASA managers are re-evaluating the results of 400-psi leak checks done after Atlantis' tank was mated with the shuttle to make sure the lines in question are properly seated.\n\nSome engineers have suggested an additional 600-psi leak test to double-check the connections, work in Atlantis' engine compartment that would delay launch three days or so. But given the results of the earlier tests - and normal checks during the fueling process Friday - it appears likely NASA managers will press ahead with the countdown for a launch attempt at 7:38 p.m. Friday.\n\nNASA managers will brief reporters on the status of launch processing later today after a traditional launch-minus two-day review.\n\n\"As always when these things come up with any of our flight hardware, we go off and evaluate if there's any implications to any of our other missions,\" said NASA Test Director Jeff Spaulding. \"They're off looking at that right now. All of the tests to date and all of the leak checks were all satisfactory on (Atlantis) and what we're going through today is to talk about the flight rationale.\"\n\nShuttle weather officer Kathy Winters said the forecast for Friday calls for a 70 percent chance of good weather and that the outlook for emergency runways in California, New Mexico, Spain and France is favorable as well. The forecast worsens a bit to  60 percent \"go\" Saturday and Sunday should launch be delayed, primarily due to the threat of afternoon and evening thunderstorms.\n\n\"Our launch day weather actually looks like the best day of the three days,\" Winters said. \"If we happen to delay 24 or 48 hours, the weather looks a little bit worse.\"\n\nPossibly severe afternoon thunderstorms were expected today, with high winds at the launch pad. But Winters said the odds of hail at the pad were low. Atlantis originally was scheduled for launch March 15, but the flight was delayed three months to repair damage to the external tank from hail strikes during a freak storm in late February.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}