{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Michael Poole <mdpoole@troilus.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "Anthony W. Youngman writes:\n\n> In message <20070604080423.GA2236@dario.dodds.net>, Steve Langasek\n>  writes\n>>On Sun, Jun 03, 2007 at 09:33:12PM +0100, Anthony W. Youngman wrote:\n>>> I'm in the UK, and if I wasn't but the choice of venue specified\n>>> \"England and Wales\", I'd probably have a very nice holiday at the\n>>> copyright holder's expense :-)\n>>\n>>> Look at SCOG and how they got dealt with in Germany ...\n>>\n>>What license did SCOG have that specified Germany as a choice of venue?\n>>\n> They didn't.\n>\n> But they made loads of noise about how linux infringed their\n> copyrights. One complaint to a court by an infuriated linux developer,\n> and one injunction and fine later, they shut up shop.\n>\n> I think that took less than six months. Look at where we are now in\n> the US - four or five years later and still going strong ...\n\nThere are several points that can be made here:\n\n(1) If I recall correctly, SCO's speaker was from the US and probably\ndid not get advice from German legal counsel on what to say.  Such an\ninjunction is almost impossible to get in the US due to differences in\nfree speech laws.  Copyright laws tend to be more uniform thanks to\nthe Berne Convention and UCC.  Because SCO's questionable behavior in\nGermany was commercial speech rather than anything related to\ncopyright, the contrasts or similarities may not give that much\ninsight into how free software licenses should work.\n\n(2) This is an example of how normal rules on venue can reach results\npreferable to those under unilaterally selected or convenient venue\n(since SCO would love to have all its lawsuits venued in Utah).\n\nMichael Poole\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}