{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Terry Hancock <hancock@anansispaceworks.com>", "subject": "Re: CC Sampling Plus 1.0", "body": "Ben Finney wrote:\n>>  1.the Derivative Work(s) constitute a good-faith partial or\n>>recombined usage employing \"sampling,\" \"collage,\" \"mash-up,\" or\n>>other comparable artistic technique, whether now known or hereafter\n>>devised, that is highly transformative of the original, as\n>>appropriate to the medium, genre, and market niche; and\n> \n> Trivially non-free. The DFSG freedom to create a derived work is the\n> freedom to create *any* derived work, not some limited subset as\n> defined in this license.\n\nI agree.\n\nHowever, I do have a question about this ...\n\nIf I myself have sampled from a CC sampling plus work in producing a new\nwork, I am under the impression that I'm pretty free to re-license as I\nplease. (In other words, we move forward one generation of derivation).\n\nSo, assuming that I pick a license that is otherwise an approved \"DFSG\nfree\" license (not wanting to open that can of worms right now), would\nthe fact that I had used CC Sampling+ work in my project be a problem?\n\nIn particular, with respect to the \"source\" of my work, I would clearly\nhave actually worked from the original work, being somewhat constrained\nin what I could do, but would my collection of pre-processed samples\n(say, sound effects), be a sufficient \"source\" provision? (I could\ncertainly argue that the pre-processed samples are a \"preferred form for\nmodification\", since it's much less work to relocate samples than to\nextract them from an original work -- the latter process is generally an\ninteractive creative one that doesn't ordinarily leave an electronic\nrecord anyway -- or perhaps, the preprocessed samples *are* the\nelectronic record). AFAIK, such a collection of samples itself (as well\nas my final product) meets the requirements to escape the CC Sampling+\nlicense restrictions (sufficiently transformative).\n\nI believe that in such a case I have not only evaded the legal\nrestrictions of the CC Sampling license, but also that (in most cases) I\nam outside of what the original artist was trying to control (IOW, I'm\nwithin both the \"letter\" and \"spirit\" of the license; the artist is\nunlikely to consider this practice \"unethical\". So this is not merely\n\"exploiting a legal loophole\", but is rather a \"legitimate use of the\nlicense, following the author's intent\").\n\nFor comparison, this would be like using samples permitted under \"fair\nuse\" from an \"all rights reserved\" work in a free-licensed project. What\nthe CC Sampling+ does is to make this \"fair use\" exemption larger and\nmore clearcut than it is with \"all rights reserved\" (in which case, it\nmight be much more legally ambiguous, and therefore riskier to use --\nalso, it's much less clear that the author intended to allow such uses).\n\nISTM that none of this is different for CC \"Sampling\" than for \"Sampling\nPlus\". \"Noncommercial Sampling Plus\" is a whole different matter,\nthough, since it attempts to control the uses of the samples (meaning\nwe're back to only \"fair use\" exemptions).\n\nBTW, \"sampling\" in the sense of the CC sampling licenses seems to be\npretty broadly interpreted (much more so than allowed by \"fair use\").\n\nSo, in some ways, it may be that the Sampling licenses are actually\n\"more friendly\" to the free commons than is the NC or NC-SA license --\nin that you can actually extract something usable in free works from them.\n\nAm I right?\n\nCheers,\nTerry\n\n\n-- \nTerry Hancock (hancock@AnansiSpaceworks.com)\nAnansi Spaceworks http://www.AnansiSpaceworks.com\n\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}