{"category": "ham", "to_address": "IP-Health <ip-health@lists.essential.org>", "from_address": "Benjamin Krohmal <ben.krohmal@keionline.org>", "subject": "[Ip-health] PR and lobbying on Thai CLs", "body": "great story on the role of PR firms in the CL debate:\n\n\n\nhttp://www.bangkokpost.com/Perspective/27May2007_pers01.php\n\nSPINNING A NEW IMAGE\n\nOne of the more interesting stories to come out of the ongoing US-led\nbattle against Thailand's stance on compulsory licensing of\npharmaceuticals is the increasing role of public relations firms in\nthe global political sphere, writes ERIKA FRY\n\nEarlier this month, while Thai Health Minister Mongkol na Songkla was\nin the United States making a case for the country's decision to\nissue compulsory licenses on Aids drugs, American Ashley Wills - a\nformer ambassador and present adviser for a Washington DC law firm\nwith drug company clients - was in Bangkok to speak at the Foreign\nCorrespondent's Club. Turnout was low and those that showed up were\nprone to asking Wills questions that, representing neither the drug\ncompanies nor the American government, he couldn't answer.\n\nHe had made the trip to Thailand on behalf of a concerned and\ninformal group of \"friends of Thailand,\" (no connection to his firm's\npharmaceutical clients, he assured) and given the urgency of the\nmatter, had planned the trip hastily, with just 24 hours to pack his\nbags, send a few emails, and arrange for \"Road Map to Fostering Good\nThai-US Relations\" press kits.\n\nThe urgent matter at hand was the souring of US-Thai relations which,\nhaving withstood the coup, the YouTube debacle, and an alleged threat\nby a Thai health official to kidnap western tourists, had become\nofficially pack-the-bags-and-fly-to-Thailand sour when Thailand's\nhealth ministry decided to issue the compulsory licenses for Aids and\nheart disease medications.\n\nLike Thailand's decision to issue the compulsory license, Wills'\nvisit was not particularly transparent. While he conceded that\nintellectual property laws as they related to drugs needed to be\nreviewed and targeted drug pricing strategies needed to be examined,\nit was clear that his views ran west of centre and that he wished to\nsteer clear of any talk about people dying because of a lack of\naccess to prescription drugs.\n\n\"Thailand has many friends, but this decision hurt and depleted some\nof Thailand's reputational capital,\" he said.\n\nAlong with that loss, Thailand patent-breaking helped place it on the\nUS' intellectual property priority watch list (though the country's\ncontinued counterfeiting of optical discs and software may be just as\nmuch to blame) and subject of a \"Sliding towards Burma\" smear\ncampaign that ran - with some truths and some fictions - in\nadvertisements in this paper, the Post Today, the Wall Street\nJournal, and the Nation.\n\nThe campaign's efforts, which even Wills called \"extreme,\" also\nincluded the mounting of the thailies.com and thaimyths.com websites\n(the buck apparently stops at thaifibs.com) and were the work of USA\nfor Innovation, an organisation which seems to exist only with a\nwebsite, a telephone number, an employee named Maura\n(@usaforinnovation.org) who receives but does not respond to emails,\nand another former ambassador (to the United Nations in the early\n'80s), Ken Adelman, at its helm.\n\nBesides being the Executive Director of USA for Innovation, Adelman\nis based in Washington DC as a senior counselor with Edelman Public\nRelations Worldwide, a firm with drug company clients and a history\n(sometimes embarrassing - see walmartingacrossamerica.com) for\ncreating front groups and making up organisations.\n\nWhether through elaborate acts of subterfuge or more diplomatic\nefforts to sway public opinion and Thailand's patent-breaking stance,\nboth Wills' visit and Adelman's campaign reflect the growing role\nlobbying and public relations firms are playing in international\ntrade and modern politics.\n\nThey also hint at the increasing importance of international\nperception, and in striving for that, only one aspect of the Thai\ngovernment's current public relations mess.\n\nThe government has also been occupied with Edelman's other - possibly\nformer - client, ousted prime minister Thaksin Shinawatra. While no\nlonger in power, Dr Panitan Wattanayagorn, an academic adviser to the\nPrime Minister in foreign affairs and an associate professor of\ninternational relations at Chulalongkorn University says \"Thaksin\ncontinues to captivate the imagination of the people\" with the help\nof a handful of foreign PR firms and a range of stunts that have\nincluded his election to Thailand's PGA presidency and a prolonged,\npublic mulling over a bid for the Manchester City football club.\n\n\"It is a sophisticated and orchestrated effort with fingerprints of a\nbig corporation, but he has a winning PR formula,\" says Dr Panitan.\n\"Few leaders can keep up with him.\"\n\nMESSAGE MUST BE REPETITIVE\n\nMeanwhile, the government's struggle with its public and\ninternational image is just as much due to its own foibles and the\nfact that it came to power via a military coup in the 21st century.\n(Even smooth as silk and with flower-laden tanks, a coup is a coup.)\n\nAnd so when the government announced that it, too, would hire a US\nlobbying firm for $600,000 and three months of PR, the last thing it\nneeded - but perhaps the first thing it should have expected - was\nbad publicity.\n\nWhile there were supporters, the government was widely ridiculed for\nspending so little, while simultaneously lambasted for spending so\nmuch (USA for Innovation issued a press release stating \"PR trumps\nPublic Health\").\n\n\"Three months is either very naive or very ambitious,\" says Ken Hong,\nManaging Director of the public relations firm Weber Shandwick Thailand.\n\nHong says the PR business is about conveying a particular message and\ninfluencing people. It takes a repetitive, long term effort to change\nminds. It takes us 3 months to plan a press conference.\"\n\nHe said he wouldn't have taken the assignment and hopes that the firm\nthat did was clear and realistic about what the government stands to\ngain from a 3-month contract.\n\nTharit Charungvat, Director-General of the Foreign Ministry's\nDepartment of Information tried to clarify the pricing issues,\nexplaining that while the firm they were negotiating with had strong\nconnections and a history with foreign government clients, Thailand\nhad been able to strike a deal through long negotiations because\nThailand was a poor country.\n\nHe added that the firm was hired not to counter a particular person\nor particular organisation, but to promote foreign understanding of\nthe Thai situation and to help the country advocate its causes in\nWashington, where trade deals are made and where Thailand, with an\n$11 billion trade surplus, has many interests to protect (see side\nstory about lobbying industry).\n\nDr Panitan acknowledged the government is working to put together a\n\"we will recover soon\" package, but that it is a challenge as\nThailand is a very small player in a large and well-funded PR war.\n\n\"Hiring these firms is not cheap, but in the end you cannot avoid it.\nThai politics are increasingly global and connected to the\ninternational community. This is new era politics where government\nmust be marketed to media and a foreign audience,\" he says.\n\nHong agrees, but adds that the new importance of nation-branding is\nglobal. \"Sooner or later, countries are going to realise the way the\ninternational community perceives them on matters in business and\npolitics.\"\n\nHe says for most it will become an issue \"when it hits the\npocketbook,\" or when something affects a country's tourism or revenue\ngenerating means.\n\nWhile Thailand recently saw tourism earnings rise, Dr Yubol\nBenjarongkij, dean of Chulalongkorn's Faculty of Communication Arts\nsays the government's PR campaign will need to demonstrate to\ntourists, investors, and the international community that the country\nis stable and on a swift path back towards democracy.\n\nBecause it is an interim government, political leaders don't need to\nfocus on their image, but simply \"prove that the country is not\ncollapsing or going backward into the junta system,\" she says.\n\nTo some the hiring of the firm came as a surprise. \"The coup\ngovernment is not keen in terms of advertising,\" she said.\n\nYet, while the call to hire communication specialists may not have\nbeen expected from a group of cabinet ministers who have been branded\nthe \"Old Ginger\", public relations are not new to Thailand, or Thai\npolitics.\n\nDr Gee Ekachai, an associate communications professor at Marquette\nUniversity in the United States who has written a book chapter on the\nsubject, says \"Professional PR in the very beginning was used as a\nmouthpiece of the Thai government starting in 1932, when the nation\nchanged its political system. The government felt the need to educate\nthe Thai population, who at the time were not well educated about\ndemocracy. It was mostly one-way, persuasive communication.\"\n\nTHAKSIN'S PR BLITZ\n\nDr Panitan says the field first began entwined in modern politics\nduring some low-profile campaigns in the 80s, and then more publicly\nin 1996, with an effort to soften and internationalise the image of\nSuphan Buri boss-turned-prime minister Banharn Silpa-archa.\n\nEven so, it was really Thaksin who took the use of public relations\nto new heights in politics, he says, through policy branding efforts\nlike the 30-baht health scheme and OTOP, and ploys like a highly\npublicised helicopter ride over Bangkok (which came with his promise\nto rid the city of traffic jams in 6 months or less).\n\nHe says Thaksin's approach to politics was novel, and in the void\nleft by the '97 economic crash, his ability to reinvent himself and\npolitics, made him popular and energised the electorate.\n\nWhile Dr Panitan says this approach was much less successful during\nThaksin's second campaign because he had failed to produce on earlier\npromises, he believes the technique signalled a new era of Thai\npolitics, and the style - if not the man - is here to stay.\n\nOther parties have started following suit, he notes, including the\nDemocrat Party which, although \"less dynamic and flamboyant\" than\nThaksin's efforts, is currently rebranding itself through new logos\nand can-do policy.\n\n\"Capitalism and politics are merging,\" he says, predicting that money\npolitics - with focuses on image building and marketing tools - will\nassume new importance in running campaigns. \"This is a new phase of\nThai politics where politicians will be more sophisticated, well-\nrounded and connected.\"\n\nHe generally believes this to be a good thing, as governments or\npoliticians with a public relations focus, can reach larger\naudiences, promote better understanding of issues, and also better\nunderstand and \"penetrate the mood\" of its people.\n\nThis is especially beneficial to young democracies, he asserts,\nbecause the improved understanding from both ends can lead to more\nmodern and appropriate policy for the people as well as a more\ninterested and engaged public.\n\nCRISIS CONTROL\n\nThe PR industry has also become a force in government and politics\nbecause of its role in crisis (Hong says this is an overstatement and\nprefers \"issue\") management. Hong explains that firms assist clients\nto develop strategies, responsibility and contact lists, victim\npolicies, and a comprehensive plan to handle any reputation-\nimperiling issues that come about.\n\nHe uses Thailand's YouTube blocking debacle, which he says could have\nbeen handled in better ways, to explain the value of crisis\nmanagement, and how a small issue can sometimes lead to\ndisproportionate change in international perception.\n\nHe notes that the blocking of YouTube is ultimately not a big deal,\nthough in the ordeal \"Thailand has received a black eye from the IT\ncommunity\" and categorisation by some with China and Myanmar.\n\n\"This is not accurate, but ask 100 westerners, and they wouldn't know\nthe difference. In general, the 'we will just shut you down\nmentality' will almost always trigger negative perceptions. Everyone\nknows that's how China works, but it was surprising for Thailand,\nespecially because of the severity of the response.\"\n\nWhile he supports Thailand's right to exercise its laws, he suggests\nspelling out and educating the international community on little-\nunderstood cultural laws in order to avoid conflict in the future.\n\n\"Californians don't know lese majeste laws,\" he says, adding that the\nsituation could also be improved with more open communication to\nlocal citizens and the IT community.\n\n\"The decision makers don't understand the IT community, where there's\nlots of quick, word-of-mouth exchanges. While the government might\nnot consider this a priority audience, their perception of Thailand\nhas fallen.\"\n\nHe says this can have repercussions because \"major news outlet\nmonitor the Internet for news stories. It's not just 18-year-olds\nanymore - communication is much faster. The Internet has changed\neverything.\"\n\nHong believes openness and transparency is the key ingredient to good\npublic relations.\n\n\"If people smell spin and propaganda, they shut you down right away.\nPeople have to believe you are being honest. Honesty is more\neffective than invisibility these days.\"\n\nHe notes that technology, and particularly the Internet, make it easy\nfor consumers to know when they are being duped.\n\nIt took only a few days, for example, for Internet audiences to\nconnect Adelman-Edelman-USA for Innovation and the pharmaceutical\nindustry and post it all on SourceWatch.org, a site run by the US'\nCenter for Media and Democracy that monitors public relations\nprofessionals and lobbying activities.\n\nMaybe because of this, USA for Innovation's web Action Center has\nbeen quiet since the last in its flurry of press releases (\"USA for\nInnovation Launches Thai Myth #4\") was posted May 10, only a few\nweeks after the site was launched.\n\n(The answering machine at USA for Innovation still picks up, though\nemails, phone calls and inquiries regarding USA for Innovation at\nEdelman have been ignored or passed off with an \"I have no idea. Ken\nAdelman is only a consultant here.\")\n\nNonetheless, the organisation still incenses some, including Dr\nYubol, who found USA for Innovation's ads to be in violation of the\nspirit and ethics of public relations.\n\n\"Like in any career there are those that will do things they want,\nbut I don't think PR is something we use to attack other people.\nMaybe explain misunderstandings, but not to attack.\"\n\nShe added that she understood the drug companies needed money for\nresearch and development purposes, but thought that the USA for\nInnovation smear campaign was the wrong way to pursue that goal.\n\nStriking a compromise and \"making the drug available to Thais for an\naffordable price, would be the best PR move a drug company could\nmake,\" she says.\n\nAs an afterthought, Dr Panitan mentions that even in these globalised\ntimes, there are probably cheaper and more natural means to bettering\na country's international image. He suggests the work of NGOs or the\nold-fashioned diplomacy for which Thailand has been admired and which\nproved successful earlier this year at the EU-ASEAN summit.\n\nHe adds that while PR and lobbying firms may help settle anxieties of\ntourists, investors and parties abroad, \"in the end it comes down to\nreal facts.\"\n\n\"It is quite complicated to win the hearts and minds of people,\" he\nsays \"A government has to capture the feelings of its constituents as\nwell as the mood as it changes day to day and with current issues.\n\n\"That's going to take effective communication, management and\ngovernance.\"\n\nIt wasn't until ex-prime minister Thaksin Shinawatra hired an\nAmerican lobbying firm late last year that many Thai citizens had\nheard of the business, says Dr Yubol Benjarongkij, dean of\nChulalongkorn University's Communication Arts Faculty.\n\nYet, while lobbying may have been relatively unknown to the general\npublic, Dr Panitan Wattanayagorn, an associate professor of\nInternational Relations at Chulalongkorn and an academic adviser to\nthe Prime Minister on foreign policy, explains that lobbying has been\n\"a practice adopted from time to time\" by Thailand to protect the\nagricultural sector or to push for Thai candidates within\ninternational organisations like the WTO or the UN.\n\nHe explains that lobbying organisations are hired to help represent a\npoint of view to policy makers in Washington. Lobbyists are good at\npackaging information, and oftentimes, being former politicians\nthemselves (like Adelman), have the connections necessary to get the\nmessage out there.\n\nFor example, it was reported that the Thai government in 2002 hired a\nlobbying firm to keep its rice crop from use in the genetic\nmodification experiments of US biotech firms. Meanwhile, the Center\nfor Public Integrity's LobbyWatch site, which reports on all moneys\nregistered in the US lobbying system, shows that individuals or\norganisations in Thailand spent around $970,000 in lobbying efforts\nfrom 1998-2004 (some of which came from Thailand's steel and garment\nindustries, but the majority of which was sourced by Prachai\nLeophairatana, the founder and former CEO of Thai Petrochemical\nIndustry.)\n\nIf this sounds like a little money, Cambodia, Malaysia, Vietnam spent\nfar less. If it sounds like a lot, consider Japan, whose Honda\ncompany alone spent $2.5 million (Japan spent $13 million), or\nFrance, which spent $45 million, or the US which spent over $11\nbillion on lobbying during the same period.\n\nThough Thailand's overseas lobbying efforts have been limited,\naccording to Dr Panitan, \"our lobbying efforts have been quite\nsuccessful in the past.\"\n\nHe says that lobbying firms have become critical tools shaping\ninternational affairs and trade, as \"the companies are well connected\nto overseas business and political elites.\" He adds that they\nlobbyists are often ex-politicians that having served in top\npositions, can easily connect with overseas governments, arrange\nintimate meetings with top officials, and exert tremendous influence\non policy.\n\nThis also helps explain the attention Thailand has received in its\npatent-breaking battle.\n\nThe amount Thailand (or even France) expends on lobbying also pales\nin comparison to what is spent by the US pharmaceutical industry,\nwhich according to a report from the US Center for Public Integrity,\nhas 1,100 lobbyists (basically a 2:1 lobbyist to policy maker ratio\nworking in Washington) and spent $155 million in just January 2005-\nJune 2006.\n\nThe report also showed that drug companies on average spend twice as\nmuch on marketing as on research and development, the aspect of\npharmaceutical work that the industry claims stands gravely imperiled\nby the patent-breaking ways of Thailand and other developing nations.\n\nEdelman-client and Kaletra-producing Abbott Laboratories spent $4.9\nbillion on marketing, as opposed to $1.7 billion on R&D in 2004,\nwhile Merck, the producer of Efavirenz, spent $7.35 billion for\nmarketing and just $4.01 billion on R&D.\n\nKen Hong says that the dominance and political influence that such\nindustries gain in lobbying efforts is what has given the practice\nnegative connotations.\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}