{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@speedy.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "cavort: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nDictionary.com Premium makes a great gift for students and word lovers of all ages!\nAdvertising-free access, Audio pronunciations, and Color illustrations.\nMore word games: Cryptogram, Hangman, Maze, Phrase Invaders, Slide Solve, and\nWord game archives with the last 30 days of puzzles.\n\nBuy a gift certificate today!\n\nADVERTISEMENT\nWord of the Day for Monday, April 16, 2007\ncavort \\kuh-VORT\\, intransitive verb:\n1. To bound or prance about.\n2. To have lively or boisterous fun; to behave in a high-spirited, festive manner.\n. . .Enkidu, who was seduced by gradual steps to embrace the refinements of civilization, only to regret on his deathbed what he had left behind: a free life cavorting with gazelles. -- Yi-Fu Tuan, Escapism\nBut why struggle with a term paper on the elements of foreshadowing in Bleak House when I could be cavorting on the beach. -- Dani Shapiro, Slow Motion\nBy 1900, Leo-Chico would have been thirteen years old, and just past his bar mitzvah, or old enough to know better than to cavort with street idlers and gamblers. -- Simon Louvish, Monkey Business\nThe men spent the next few weeks there drinking beer, eating hibachi-grilled fish, and cavorting with the young ladies. -- Robert Whiting, Tokyo Underworld\nCavort is perhaps an alteration of curvet, \"a light leap by a horse\" (with the back arched or curved), from Italian corvetta, \"a little curve,\" from Middle French courbette, from courber, \"to curve,\" from Latin curvare, \"to bend, to curve,\" from curvus, \"curved, bent.\"\nDictionary.com Entry and Pronunciation for cavort\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9308032-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}