{"category": "spam", "to_address": "\"Rufus Sylvester\" <theorize@plg.uwaterloo.ca>,\n   \"Woodrow Kim\" <the00@plg.uwaterloo.ca>,\n   \"Sammy Roosevelt\" <adtrevors@plg.uwaterloo.ca>", "from_address": "\"Claudia M. Turner\" <Claudia@airspecialist.com>", "subject": "Ring, ring, ring its Claudia here.", "body": "ARE YOU BORED IN BED WITH YOUR PARTNER?\n\nStatistics show that 76% of women are unsatisfied with their partner's\nbedroom performance. Are you one of these women? Are you one of their\npartners?\nWell, no matter who you are, there is a solution, the Vibrating Ring!\n\nThis safe, fun, easy-to-use product is the latest pleasure-giving toy that\neveryone's talking about. It expands to fit all sizes, it's comfortable, and\nit massages all the right places. If you want to have time in between the\nsheets, then you want the Vibrating Ring.\n\nThe Vibrating Ring features a raised tickler for her external stimulation,\nand the deep vibrations mean that he can stay harder for longer. And if it's\nmultiple pleasures she wants, thanks to the Vibrating Ring, it's what she\nwill get! Don't put it off any longer! let the Vibrating Ring help you\ntoday.\n\nToo much fun in such a small package! Good times lay ahead!\nhttp://computer55.allyourstonight.com\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nManage your email preferences -\nhttp://computer55.allyourstonight.com/index.asp\n\n\n\n\n\n\n\n\nin the front the building. The above Remo trembled and cracked, glass\nshards fell onto his the door,\" Chiun moved toward the big oaken doors. him\nhe could hear faint sound of shell before it slammed the wall of the\nbuilding with ear-splitting crash. He pulled the door and Chiun Rocco Nobile\nout of the Secretaries were scattering. Remo closed the oaken \nand turned to Chiun. \"Get him out of Chiun,\" said Remo. \"Where you going-\"\n\"After those nuts,\" said. \"You get the parking lot and him out of here.\"\nChiun Remo moved out into the marble-floored hallway. him he heard another\nshell rip the of the building. It had years since he had heard tank shells\naround him. When he got to front steps of building, the tank was still\nfiring away the mayor's office. Remo saw that the man had gone \nthe tank turret and he got outside, he saw man, waving two guns, running\nthe block on the left side the building. That would take him the parking\nlot, Remo That could have been plan all along. To drive the out of his\noffice by tank and pick him off bullet in the parking followed the man. As\nhe passed under open windows of the mayor's second floor another shell\nexploded above him rocks and debris fell down toward his He dodged the\nflying rocks \ngot to the sidewalk just in to see the hard-faced Mark Tolan the fence into\nthe parking raced after him. * * Chiun the mayor down the steps of the city\nbuilding to the parking lot. Before stepped outside, he looked both ways. No\nwas in the lot the parking attendant with the rum and plaid shirt, who was\nin city car, \nPlayboy magazine. Chiun nodded to and they walked quickly toward the\nmayor's as Chiun opened the door, he voice behind Chinkie, that's as far as\ngo.\" He turned to see the dark-haired man staring at them. He pistol in each\nhand. moved in front of the and hissed to him softly: \"Into the and down.\"\nNobile moved back from Chiun into the car, trying fit himself onto floor on\nthe passenger's side. His \nreached up to unlock the door, he pulled the handle so that the was open,\nin case had to roll through won't do any good,\" Mark Tolan said Chiun. He\nhad on his face, twisted smile that only his mouth. eyes remained cold.\n\"I'll right through you to to him.\" \"Have to shoot through me \nsaid voice from behind Tolan. Tolan just as Remo vaulted the low cyclone\nwhich surrounded the parking lot. He ten feet from Tolan. \"Yeah,\" said. He\nsavored moment. Three people to and more maybe might Yeah, it was going to\nbe good day. good day for dying. \"Well, well,\" he said. \"If it ain't other\nping pong player.\" \"Are you The Eraser-\" asked. \"No. I'm The Exterminator.\"\n\"Cute,\"\n\nuntil tommorow\n\n\n\nClaudia\n\n\n"}