{"category": "ham", "to_address": "\"Gerald (Jerry) Carter\" <jerry@samba.org>", "from_address": "simo <idra@samba.org>", "subject": "Re: getting rid of mkproto.sh from Samba3", "body": "On Sun, 2007-06-03 at 20:29 -0500, Gerald (Jerry) Carter wrote:\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA1\n> \n> Simo,\n> \n> > On Sun, 2007-06-03 at 14:31 -0700, James Peach wrote:\n> >> Hi all,\n> >>\n> >> Is there any interest in moving Samba3 from generated prototypes to  \n> >> static headers. ie. getting rid of mkproto.sh and \"make headers\"? I'd  \n> >> like to start doing a bit of work in this area, but I don't want to  \n> >> upset anyone if there's a lot of love out there for generated  \n> >> prototypes ...\n> > \n> > If that means you can come out with another method to \n> > avoid changing .h files by hand, then you are welcome.\n> > Otherwise I think it would just be a step back I really \n> > don't see the need for.\n> \n> mkproto.sh promotes lazing programming, leads to bad interfaces\n> and to monolithic code.\n> \n> We should all suffer the pain of change *.h and *.c when\n> change an interface.\n\nYou say it right here, \"when change an interface\".\nWhat would be nice, is to have something like in samba4, where you can\nmark an interface as public or private, and have a much better\ndependency driven set of auto-generated proto headers.\n\nChanging a private interface pose no problem, the real problem is with\npublic interfaces, well I'd agree to keep manually changing public\ninterfaces eventually, as that would make you immediately (hopefully :)\nunderstand you are changing a public facing interface non just an\ninternal function.\n\nBut for most of the internal code, having to change headers by hand is\njust an annoying slowdown imo.\n\n> I strongly agree with James on this one\n> since it was already on my list of things to work on.\n\nI agree we have a problem with bad internal dependencies, and that we\ncould have a better way to build and manage them so that modularization\nis easier. But I think that going back to just manually built headers is\nnot necessarily the best way to go.\n\nI agree with Tridge that the Samba4 build system shows we can achieve a\nbetter system that address all concerns.\n\nSimo.\n\n-- \nSimo Sorce\nSamba Team GPL Compliance Officer\nemail: idra@samba.org\nhttp://samba.org\n\n"}