{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Is Rudy In Trouble?", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nWere \n      Alleged Dix Plotters \"Terrorists?\"Andrew Tyndall argues that the term \n      terrorism \"refers to violence against civilian targets for political \n      aims\" -- so the term isn't appropriate. \n      Responds Correspondent Bob Orr: \"I think it's an academic \n      debate on what you think qualifies. I would suggest one person with an \n      automatic weapon in a crowded area could terrorize \n      people.\"  [+ Read More]\n\nA Rudy Tipping Point?Rudy Giuliani has been trying to keep \n      the abortion issue from hurting \n      him with prospective primary voters, and based on the polls, he has been \n      able to pull it off so far. But the sudden emergence of the news that \"in \n      the '90s he contributed money at least six times to Planned Parenthood, \n      one of the country's leading abortion rights groups and its top provider \n      of abortions\" is going to complicated matters. [+ Read More]\n\nIn With The \n      Old, Out With The New\"The Googles of the world, they are \n      the Custer of the modern world. We are the Sioux nation.\" --Time \n      Warner Inc. Chief Executive Richard Parsons. He was, as Reuters \n      notes, \"referring to the Civil War American general George Custer who was \n      defeated by Native Americans in a battle dubbed 'Custer's Last Stand.'\" \n      [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nThe \n      Public Eye Chat With...Bob Orr\n \nBe \n      Afraid, Be VERY Afraid\n \nCovering \n      The Thwarted Plot\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}