{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Liberty Direct\" <ql0dw9y7j@protectdraw.com>", "subject": "Life insurance issued in minutes. No physical ", "body": "\n\n\n   \n<!--MEYERS, Calif. - A raging wildfire near Lake Tahoe on Monday forced hundreds of residents to flee towering flames that destroyed more than 200 buildings, turned the sky orange and fouled the lake's famously clear waters with falling ash. \n\nADVERTISEMENT\n \nMany hotels offered free rooms as families clung to one bit of good news: Despite the destruction, there were no reports of injuries.\n\n\"All the memories are gone,\" said Matt Laster, a legal assistant forced to flee his rented home of five years with his wife, two young children and cat. He showed up at a recreation center looking for clothes and a sleeping bag.\n\nThe blaze had scorched almost 2,500 acres — nearly 4 square miles — but by early Monday evening fire officials said the blaze was about 40 percent contained. Full containment was expected by Sunday, the U.S. Forest Service said.\n\nAbout 1,000 people had evacuated from the path of the flames, and authorities feared up to 500 other houses could be threatened in this resort area along the California-Nevada state line.\n\nMore than 700 firefighters were on hand, but plans to send up airborne tankers and helicopters to drop water and retardant over the heavily wooded, parched terrain were scrapped because of low visibility from the thick smoke.\n\nFirefighters hoped to bring the blaze under control ahead of high winds and low humidity forecast for the middle of the week. Dozens took up defensive positions around South Lake Tahoe High School as flames came within a quarter mile of the 1,500-student school.\n\n\"We have a window right now where we're really trying to aggressively attack this fire,\" said Daniel Berlant, a spokesman for the California Department of Forestry and Fire Protection in Sacramento.\n\nEl Dorado County Sheriff's Lt. Kevin House said there were no reports of missing persons, but \"the truth is we haven't really been able to get in there and see.\"\n\nAlong the lake's southern shore, a layer of black, mushy ash lapped along boat docks, raising fears the fire also could have disastrous long-term economic consequences for a community heavily dependent on the lake's recreational tourism.\n\nCalifornia officials declared a state of emergency, meaning the state would cover all firefighting costs. The National Weather Service issued a dense smoke advisory warning people from South Lake Tahoe to Carson City, Nev., that heavy ash was making it difficult to see and breathe.\n\nThe fire began Sunday afternoon on a ridge separating the resort community of South Lake Tahoe from Fallen Leaf Lake, a recreation area where a U.S. Forest Service campground was evacuated.\n\nFirefighters were aided Monday by winds that had slowed to 12 mph after gusting to about 35 mph the day before. Forecasters warned that if high winds and low humidity returned, the fire could threaten more than 500 homes bordering the lake.\n\nBy early afternoon Monday, 173 homes had been lost to flames and many others were damaged, along with dozens of outbuildings, authorities said. All that remained of entire neighborhoods in Meyers were the smoldering silhouettes of stone and concrete chimneys.\n\nIn other areas, the fire seemed to randomly skip some homes, but downed power lines, trees and debris made clear that life would not return to normal anytime soon, even for those whose homes were spared.\n\nThe burned neighborhoods were a hodgepodge of million-dollar vacation homes, cabins and modest houses strung along the east side of the ridge. At least three members of the local fire department were believed to have lost their homes.\n\nSteve Yingling, sports editor for the Tahoe Tribune newspaper, had little hope that his house survived. He was leaving for work Sunday afternoon when he heard the sirens.\n\n\"I looked back and saw the huge plume of smoke,\" he said Monday. \"That's when I really started to get scared because I know the danger alert that we've had in this area. Especially this year with the mild winter that we had.\" \n\nState and federal fire officials had warned of a potentially active wildfire season in the Sierra Nevada following an unusually dry winter. The annual May 1 snow survey found the Tahoe-area snowpack at just 29 percent of normal levels, the lowest since 1988. \n\nFire restrictions have been in effect in the Tahoe National Forest since June 11. The most common cause of blazes in the area is abandoned campfires, according to the U.S. Forest Service. \n\nAnxious residents barred from returning to the fire-damaged area jammed the lobby of Lake Tahoe Community College in South Lake Tahoe, hoping to get word from authorities on whether their homes were still standing. Some left in tears; others were thankful to have escaped the worst. \n\nCathy Martin of South Lake Tahoe e-mailed her son, a Marine serving in Iraq, to tell him about the fire. \n\n\"We're very lucky that we are safe,\" said Martin, whose home was not damaged. \"But I'm telling you this is awful for this community.\" \n\nIn Alaska, damp, cooler weather helped slow a wildfire in a popular recreation area on the Kenai Peninsula south of Anchorage that had destroyed about 88 homes and cabins and almost 110 outbuildings and was threatening hundreds more. \n\nThe Kenai blaze, reported on June 19, had spread across nearly 90 square miles and was only about 10 percent contained Monday, fire officials said. \n\nIn north-central Colorado, a wildfire Monday forced the evacuation of 300 campers and counselors at a YMCA camp and prompted officials to warn residents in 118 homes to be ready to leave, authorities said. The fire had burned 50 acres. No injuries were reported. MEYERS, Calif. - A raging wildfire near Lake Tahoe on Monday forced hundreds of residents to flee towering flames that destroyed more than 200 buildings, turned the sky orange and fouled the lake's famously clear waters with falling ash. \n\nADVERTISEMENT\n \nMany hotels offered free rooms as families clung to one bit of good news: Despite the destruction, there were no reports of injuries.\n\n\"All the memories are gone,\" said Matt Laster, a legal assistant forced to flee his rented home of five years with his wife, two young children and cat. He showed up at a recreation center looking for clothes and a sleeping bag.\n\nThe blaze had scorched almost 2,500 acres — nearly 4 square miles — but by early Monday evening fire officials said the blaze was about 40 percent contained. Full containment was expected by Sunday, the U.S. Forest Service said.\n\nAbout 1,000 people had evacuated from the path of the flames, and authorities feared up to 500 other houses could be threatened in this resort area along the California-Nevada state line.\n\nMore than 700 firefighters were on hand, but plans to send up airborne tankers and helicopters to drop water and retardant over the heavily wooded, parched terrain were scrapped because of low visibility from the thick smoke.\n\nFirefighters hoped to bring the blaze under control ahead of high winds and low humidity forecast for the middle of the week. Dozens took up defensive positions around South Lake Tahoe High School as flames came within a quarter mile of the 1,500-student school.\n\n\"We have a window right now where we're really trying to aggressively attack this fire,\" said Daniel Berlant, a spokesman for the California Department of Forestry and Fire Protection in Sacramento.\n\nEl Dorado County Sheriff's Lt. Kevin House said there were no reports of missing persons, but \"the truth is we haven't really been able to get in there and see.\"\n\nAlong the lake's southern shore, a layer of black, mushy ash lapped along boat docks, raising fears the fire also could have disastrous long-term economic consequences for a community heavily dependent on the lake's recreational tourism.\n\nCalifornia officials declared a state of emergency, meaning the state would cover all firefighting costs. The National Weather Service issued a dense smoke advisory warning people from South Lake Tahoe to Carson City, Nev., that heavy ash was making it difficult to see and breathe.\n\nThe fire began Sunday afternoon on a ridge separating the resort community of South Lake Tahoe from Fallen Leaf Lake, a recreation area where a U.S. Forest Service campground was evacuated.\n\nFirefighters were aided Monday by winds that had slowed to 12 mph after gusting to about 35 mph the day before. Forecasters warned that if high winds and low humidity returned, the fire could threaten more than 500 homes bordering the lake.\n\nBy early afternoon Monday, 173 homes had been lost to flames and many others were damaged, along with dozens of outbuildings, authorities said. All that remained of entire neighborhoods in Meyers were the smoldering silhouettes of stone and concrete chimneys.\n\nIn other areas, the fire seemed to randomly skip some homes, but downed power lines, trees and debris made clear that life would not return to normal anytime soon, even for those whose homes were spared.\n\nThe burned neighborhoods were a hodgepodge of million-dollar vacation homes, cabins and modest houses strung along the east side of the ridge. At least three members of the local fire department were believed to have lost their homes.\n\nSteve Yingling, sports editor for the Tahoe Tribune newspaper, had little hope that his house survived. He was leaving for work Sunday afternoon when he heard the sirens.\n\n\"I looked back and saw the huge plume of smoke,\" he said Monday. \"That's when I really started to get scared because I know the danger alert that we've had in this area. Especially this year with the mild winter that we had.\" \n\nState and federal fire officials had warned of a potentially active wildfire season in the Sierra Nevada following an unusually dry winter. The annual May 1 snow survey found the Tahoe-area snowpack at just 29 percent of normal levels, the lowest since 1988. \n\nFire restrictions have been in effect in the Tahoe National Forest since June 11. The most common cause of blazes in the area is abandoned campfires, according to the U.S. Forest Service. \n\nAnxious residents barred from returning to the fire-damaged area jammed the lobby of Lake Tahoe Community College in South Lake Tahoe, hoping to get word from authorities on whether their homes were still standing. Some left in tears; others were thankful to have escaped the worst. \n\nCathy Martin of South Lake Tahoe e-mailed her son, a Marine serving in Iraq, to tell him about the fire. \n\n\"We're very lucky that we are safe,\" said Martin, whose home was not damaged. \"But I'm telling you this is awful for this community.\" \n\nIn Alaska, damp, cooler weather helped slow a wildfire in a popular recreation area on the Kenai Peninsula south of Anchorage that had destroyed about 88 homes and cabins and almost 110 outbuildings and was threatening hundreds more. \n\nThe Kenai blaze, reported on June 19, had spread across nearly 90 square miles and was only about 10 percent contained Monday, fire officials said. \n\nIn north-central Colorado, a wildfire Monday forced the evacuation of 300 campers and counselors at a YMCA camp and prompted officials to warn residents in 118 homes to be ready to leave, authorities said. The fire had burned 50 acres. No injuries were reported. \n\n\n\n--!>Buy term life in under 15 minutes, no physical required                              Our postal address is 27881 La Paz, Suite G-157, Laguna Niguel, CA 92677 In order to be excluded from future mailings, please click here.  \n\n\n\n\n\n"}