{"category": "ham", "to_address": "\"Michael B Allen\" <mba2000@ioplex.com>, <samba-technical@samba.org>", "from_address": "\"Dave Daugherty\" <dave.daugherty@centrify.com>", "subject": "RE: Cross Realm SMB Signature Failure", "body": "Saw similar behavior a couple of years back with a windows 2000 server,\nand a different smb client I was working on.  I just worked around it by\nchecking specifically if my signed messages were being reflected and\nlived with it.  On the otherhand the Windows server really wanted the\nclient to sign :)\n\nSomeone else posted this failure mode about a month ago, but once again\nnot as complicated a setup as yours. So it's a mystery.\n\nI think the signing key is communicated in the AP_REP coming back from\nthe server.  Maybe the Windows server does not like something about the\nAP_REQ packet.\n\nAre you running the latest MIT Kerberos libraries?\n\nDave Daugherty\n\n-----Original Message-----\nFrom:\nsamba-technical-bounces+dave.daugherty=centrify.com@lists.samba.org\n[mailto:samba-technical-bounces+dave.daugherty=centrify.com@lists.samba.\norg] On Behalf Of Michael B Allen\nSent: Thursday, May 03, 2007 7:54 PM\nTo: samba-technical@samba.org\nSubject: Cross Realm SMB Signature Failure\n\nWhen smbclient authenticates across realms (from MIT realm S.W.NET to\nW2K3 realm W.NET) I'm seeing the server is just echoing back the same\nsignature sent by client. That signature of couse fails verification:\n\n$ kinit -f ioplex@S.W.NET\nPassword for ioplex@S.W.NET: \n$ smbclient -k -U ioplex //dc1.w.net/tmp\nsigning_good: BAD SIG: seq 1\nSMB Signature verification failed on incoming packet!\nsession setup failed: Server packet had invalid SMB signature!\n\nIf I use a W.NET cred it works fine and ssh works in the other direction\nso I think the trust is good.\n\nAll enctypes are RC4. Haven't updated the W2K3 server since installing\nit. Trying that now ...\n\nI'm using stock 3.0.23c-2 on CentOS 5.0 with an unmodified smb.conf.\n\nHas anyone seen this before?\n\nMike\n\n"}