{"category": "ham", "to_address": "Marc Lehmann <schmorp@schmorp.de>", "from_address": "Shlomi Fish <shlomif@iglu.org.il>", "subject": "Re: Working on punie + rindolf (the implementation) Reloaded", "body": "On Monday 02 April 2007, Marc Lehmann wrote:\n> On Sat, Mar 31, 2007 at 05:06:34AM +0300, Shlomi Fish  \nwrote:\n> > Hi Marc!\n> >\n> > May I forward my reply to the list?\n>\n> Yes, you may. Sorry for replying probably too late, thanks for asking\n> first!\n>\n\nOK. Replying to two different list (which I'm not subscribed to).\n\n> > > Well, to me, that very much sounds like \"we do not openly admit it, but\n> > > we want to have Perl 5+1 working now, not whatever the Perl 6 people\n> > > claim they will deliver 5 years ago\".\n> >\n> > Heh. Well, I don't expect to be able to duplicate the Pugs functionality\n> > in a short time. :-). However, if you look at:\n> >\n> > http://www.shlomifish.org/rindolf/\n>\n> I wasn't clear then. Many peopel do not want a completely\n> different-in-spirit language called \"Perl6\", but many people atcually want\n> a language very much in spirit as Perl 5, just with a few important changes\n> done.\n\nYou're right. I used to be very opposed to Perl 6. Now understand that it has \nsome nice improvements over Perl 5, but still find looking at its code to be \nquite a bit of a future shock. \"Perl 6 is a nice language. Too bad it's not \nPerl.\" ;-)\n\n>\n> What important changes is a matter of taste and debate, but static typing\n> is certainly not on the wishlist, especially if its just going to be a\n> hack to help your optimiser doing stuff it should do without limiting your\n> expressibility.\n>\n\nYes, that's right.\n\n> > You'll see that back at the time, I was bothered with making Rindolf a:\n> >\n> > 1. Backwards compatible with Perl 5.\n>\n> Original Perl 6 goal.\n>\n\nHmmm... are you sure?\n\n> > 2. Not entirely compatible with Perl 6.\n>\n> Well :)\n>\n\nWell hopefully you would be able to call Rindolf code from Perl 6 code and \nvice versa. Also see:\n\nhttp://www.shlomifish.org/philosophy/ideas/#tucan\n\nFor a different approach for creating a cross-language interaction layer. I \nadmit that I haven't started working on it yet.\n\n> > 3. Much less of a future shock than Perl 6 is.\n>\n> Original Perl 6 goal.\n>\n\n:-)\n\n> If you look at the history, you will see that Perl 6 died halfway in\n> between, and then completely changed its character. It has very little to\n> do with Perl 5 anymore, and is probably actively hurting Perl 5 (but it\n> seems Perl 5 is regenerating slowly).\n>\n\nWell, I prefer a \"Do and let do\" and (less preferably) a \"Complain and let \ncomplain\" approach than a hurt calcalution. Some people found value in Perl \n6, and Audreyt actually created an implementation that sort-of-works. People \nare also having fun working on Parrot and other related projects. As you \nknow, perl5 (the C-based implementation) has also not been completely \nneglected, and its hackers are doing fine.\n\nThis reminds me of the standard \"isn't there a better way to spend the time \nworking on Porting to MS Windows\" myth. If there are people who are willing \nto do something FOSSy, then it is worth doing.\n\n> > I neglected working on Rindolf because I realised I was not particularly\n> > bothered by the features I suggested, or often found out these features\n> > were doable in Perl 5. Since then, however, I often found places where I\n> > could use some more advanced features. Not critically, since perl 5 was\n> > good enough, but still.\n> >\n> > As much as I respect lwall (and a lot of respect is due), I believe his\n> > use of Perl for practical applications is rather minimal and does not\n> > make use of the full range of the Perl 5 hollow technologies (CGI,\n> > Catalyst/CGI::App/etc., POE, TT/H::T/Petal/etc., etc.). As such, while he\n> > has a good intuition on what's missing in the core language, he's still\n> > probably not making the full use of Perl 5's expressive power, much less\n> > Perl 6's.\n>\n> Wouldn't outright agree to that (because I cannot make up my mind about\n> this interestign aspect so quickly), but I wish you success in Rindolf.\n\nThanks!\n\nLike I said - no promises. Maybe I'll get to hacking on punie - maybe I won't. \nThe day is short, and I have a lot of work to do.\n\n>\n> (Although it seems the most interesting promises made by parrot - fast\n> typeless code for example - are not going to be delivered, too).\n\nHmmm.... I haven't been closely following Parrot.\n\n>\n> (I do not think sending this mail to p5p is a good idea, but it is ok with\n> me if you want to make a reply to it and want that published).\n\nAs I said, I'm sending it to p6-language and p6-internals instead.\n\nRegards,\n\n\tShlomi Fish\n\n---------------------------------------------------------------------\nShlomi Fish      shlomif@iglu.org.il\nHomepage:        http://www.shlomifish.org/\n\nIf it's not in my E-mail it doesn't happen. And if my E-mail is saying\none thing, and everything else says something else - E-mail will conquer.\n    -- An Israeli Linuxer\n\n"}