{"category": "spam", "to_address": null, "from_address": "\"abdalla07@terra.es\" <abdalla07@terra.es>", "subject": "URGENT BUSINESS PURPOSAL", "body": "URGENT BUSINESS PURPOSALFROM: MR. AHMED ABDALLADirector  & Board Member, Transparency International,Kenya.\nDear Sir/Madam, My name is Mr. Ahmed Abdalla, Director and Board Member, Transparency International, Kenya. I got your email address from the web directory so I decided to contact you. We are interested in diverting some funds currently floating in the suspense account of the federal pay office to your account as soon as possible. Source of the funds are:   During the Arap Moi's government, government's officials awarded contracts to their own companies; these contracts were grossly over invoiced. Now the present government set up contract review panel to settle those owed outstanding amount. My colleagues and I have identified a huge amount totaling US$ 370m (Three hundred and seventy million us dollars) oversea. We would want US$20.8m (Twenty million Eight Hundred Thousand) dollars out this money oversea transferred to your account because we are not eligible to operate foreign account, and I have been mandated to search for a partner abroad. We really want this transfer made as soon as possible before the governments, who have started refunding money from Moi's foreign accounts track this money. We will be offering 40% for your assistance. If you would want to proceed with this transaction please reply with your name and phone number to (ahmeddalla2006@aim.com) and if you do not accept my offer please treat with utmost confidentiality. For more information check and browse carefully all the links in the website below.http://news.bbc.co.uk/2/hi/business/3324369.stm Best Regards, Mr. Ahmed Abdalla, Transparency International,Kenya.\n \n\n\nAhora también puedes acceder a tu correo Terra desde el móvil.\nInfórmate pinchando aquí.\n"}