{"category": "ham", "to_address": "sugar@laptop.org", "from_address": "Dafydd Harries <dafydd.harries@collabora.co.uk>", "subject": "Re: [sugar] A place to point new developers", "body": "\nI've written a new chat activity based on Telepathy. I've made it as simple as\npossible: when you launch it, it joins the Jabber multi-user chat\nchat@conference.olpc.collabora.co.uk.\n\nRight now, it's hard-coded to use Gabble (the XMPP backed for Telepathy), but\nit should be pretty easy to make it use Salut (for local network Jabber). If\nyou want to run this, you'll need to have the telepathy-gabble binary and its\n.service file installed.\n\nGit repository is here:\n\nhttp://projects.collabora.co.uk/~daf/chat-activity.git/\n\n(This is my first time with git, so I'm not sure if I got that right.)\n\nThere's one really annoying bug I couldn't work out: the conversation is\ninside a Gtk scroll area, using a hack I lifted from the journal code. The UI\nstructure looks like this:\n\n - hippo.Canvas\n   - hippo.CanvasWidget\n     - gtk.ScrolledWindow\n       - gtk.Viewport\n         - hippo.Canvas (*)\n           - hippo.CanvasBox\n             - (conversation items)\n   - sugar.graphics.entry.Entry\n\nIt seems that the inner hippo.Canvas gets allocated more space than it wants,\nwhich messes up the vertical adjustment of the ScrolledWindow. It turns out\nthat the allocation is always 804 pixels larger than the request, which I'm\nguess is 844 (screen height) - 40 pixels for the Entry. This is annoying\nbecause I want to scroll the conversation down when somebody says something,\nbut it ends up showing a mass of empty space if I scroll to what should be the\nbottom. Hence this gross hack which makes it kinda work:\n\n        adj.set_value(adj.upper - adj.page_size - 804)\n\nIf somebody can shed some light on this, I'd be very happy.\n\n-- \nDafydd\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}