{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 86", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Art and Police Powers (Museum Security Network Mailing list)\n   2. Another Omaha church is reporting the theft of a valued piece\n      of art. (Museum Security Network Mailing list)\n   3. A Bone to Pick: Paleontologists Attack Christie's Fossils\n      Sale (Museum Security Network Mailing list)\n   4. Vol de 22 vases prestigieux de la c?l?bre collection Harrach\n      ? Vienne (Museum Security Network Mailing list)\n   5. Thieves target Aboriginal art\n      (Museum Security Network Mailing list)\n   6. Kunstr?uber in Wien erbeuten Vasen im Millionen-Wert\n      (Museum Security Network Mailing list)\n   7. The heist of the century (Museum Security Network Mailing list)\n   8. Stolen 'Scream' may undergo surgery\n      (Museum Security Network Mailing list)\n   9. Thieves Take 3-Foot Statue Of National Revolutionary War Hero\n      From Moorings At Hale Homestead (Museum Security Network Mailing list)\n  10. MORE than 40 indigenous paintings,\tworth hundreds of\n      thousands of dollars and stolen from Melbourne\tgalleries over the\n      past 18 months,\tare thought to have ended up in the lucrative art\n      markets of Europe\tand the US, where supply sources are much\n      harder to (Museum Security Network Mailing list)\n  11. Woman caught on camera stealing hospital art\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Wed, 11 Apr 2007 11:20:53 -0400 (EDT)\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Art and Police Powers\nTo: msn-list@te.verweg.com\nMessage-ID: <1313.68.81.242.194.1176304853.squirrel@email.powweb.com>\nContent-Type: text/plain; charset=\"iso-8859-1\"\n\n\n\nThe Heat on the Beat\nAnd the Artists on the Street-Part 1\nBy Charles Vincent Sabba Jr.\nRahway News Record- Rahway Arts District Column\nApril 12, 2007\n\n   I have been approached by a couple of readers of this column who have\nexpressed their bewilderment about a cop who is devoted to art. This\ninspired me to write this two part article about artist encounters with\nthe law and two art loving police officers who are great characters in\nthe history of art: NYPD Detective Robert Volpe, who was known as the\n\"Art Cop,\" and Commissioner Zamaron who at the beginning of the 20th\ncentury befriended many of the legendary artists of Monmartre and\nMontparnasse, Paris.\n  The artist colonies of Monmartre and Montparnasse were made up of many\ndifferent nationalities.French, Italian, Dutch, Mexican, Scandinavian,\nRussian, Spaniards, to name a few. The artists of Montmartre and\nMontparnasse had a special friend and protector named Zamaron.\nCommissioner Zamaron was the officer in charge of foreign nationals at\nthe Prefecture of Police in Paris. He was an ardent art lover and always\ncame to the assistance of the artists in need, especially his personal\nfavorite, Maurice Utrillo. When off duty, this police officer would seek\nout his artist friends at the cafes such as the Dome and the Rotonde for\ndrinks and good intellectual conversations. His friend's paintings\ncovered the walls of his police station office; there he proudly\ndisplayed works by the Italian Modigliani, the Lithuanian Kikoine, the\nBelarus-born Lithuanian Soutine, the Montmartre native Utrillo, and\nUtrillo's mother, Suzanne Valadon. There was another, less honest\nofficer named Descaves in Paris who loved art as well. Descaves would\nshake down the artists for their art works. Once in a while he would\ntake a painting and pay a tiny installment after instructing the artist\nto stop by his office for the remaining sum on a future date. Of course\nthe artists knew better not to do so. The honorable Zamaron was\nconstantly protecting the artists from the dirty Descaves.\n  As you can imagine, the artists kept Zamaron quite busy. Modigliani and\nhis pal Utrillo were constantly being picked up for drunk and disorderly\nconduct; Utrillo was an alcoholic and drank eight liters of wine a day.\nBoth Picasso and Alfred Jarry (but Jarry was a more frequent violator)\ncocked and waved their pistols in the faces of drunken adversaries at\nthe slightest insult and they loved to shoot out the gas lamps that\nlined the streets. In fact, pistol packing was in vogue in the artist\nquarters of those days; Picasso carried a browning every where he went,\nwhich he shot in the air in festive drunken folly and fired out of his\nbedroom window every morning as an alarm clock to awaken his friends.\nWhile dueling was illegal in this era, fistfights were not considered\ngentlemanly behavior, so the artists resorted to crossing swords and\ncocking pistols quite frequently. These neighborhoods, and a few of the\ncafes located in them, were breeding grounds for the popular anarchist\nmovement. A number of illegal anarchist newspapers were being printed\nand distributed there. The artist Juan Gris was erroneously arrested\nafter police officials mistakenly identified him as an anarchist named\nGarnier, who was a main suspect in a band of political bombers in Paris.\n   One of the most famous police encounters involved Picasso and the poet\nGuillaume Apollinaire after the Monalisa, which was painted by Leonardo\nDaVinci, was stolen from the Louvre on Aug 21, 1911. Both Picasso and\nApollinaire were both brought in for questioning as suspects in this\ncrime. In 1907, a friend of Apollinaire's named Ge'ry Pieret, stole\nseveral valuable artifacts from a storeroom at the Louvre, simply by\nplacing them under his overcoat and walking out. Pieret was a former\nboxer from Belgium who turned to writing. Both Picasso and Apollinaire\nbought objects from Pieret and later denied knowing they were stolen.\nPicasso's lover, Fernande Olivier, stated that Pieret warned Picasso on\nthe day he bought two small Iberian heads, not to display them but to\nkeep them hidden from view. Picasso kept the objects in an\ninconspicuous place, fully aware of their illicit nature.\n   After the theft of the Monalisa, Pieret sold his story, along with a\nfull confession and a statuette from the museum, to the Paris-Journal.\nPieret wanted a little cash and some notoriety. The article further\nhumiliated the Louvre and implemented Picasso and Apollinaire; both\nwere overcome with fear and contemplated throwing the artifacts into\nthe Seine. Picasso was brought in for questioning, where he turned over\nthe artifacts he possessed, and was released. Apollinaire was arrested\non Sept 7, 1911. He was not released until Sept 12, 1911. Apollinaire\nwas extremely frightened and hated his stay in a cell, however, for\nyears after the fact, he would boast of being the only man in France to\nbe arrested for the famous crime. The real culprit, Vincenzo Perugia,\nwas arrested for this crime on Dec 11, 1913 in Florence, Italy. Perugia\ndeclared he was an Italian patriot and only stole the Monalisa so he\ncould return her to Italy where she belonged. He incorrectly believed\nthat Napoleon Bonaparte stole the painting from Italy as war loot and\ncouldn't stand seeing her in French hands.\n  In my next article I will introduce Robert Volpe to you; Bobby was an\nartist, a dedicated art lover, an NYPD art theft investigator and a\nprotector of New York artists, collectors and dealers. In fact, many\npeople in the N.Y. art world called him their archangel.\n\n Rahway News Record- Promoting Art in the Community:\nwww.new-jersey.ws/modules.php?name=News&new_topic=67\n\n\n------------------------------\n\nMessage: 2\nDate: Thu, 12 Apr 2007 06:46:23 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Another Omaha church is reporting the theft of a valued\n\tpiece\tof art.\nTo: \nMessage-ID: <001d01c77cbd$857fb1f0$907f15d0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nApril 11, 2007\nArt stolen from another Omaha church\n\n\nAnother Omaha church is reporting the theft of a valued piece of art.\n\nThe Rev. Will Howell of First Covenant Church at 201 N. 90th St. said\nWednesday that police have been contacted about a missing charcoal sketch of\n\"The Head of Christ\" by artist Warner Sallman. It had been a prized\npossession of the church since the artist donated it during a visit.\n\n\"I can't imagine someone walking around with a stolen picture of the head of\nJesus Christ,\" Howell said. \"It would have to be someone with pretty much no\nmorals.\"\n\nThe theft may have occurred as early as last October, Howell said. The\npicture had been hanging in the back of the church.\n\nThe picture's value is hard to assess, he said, although the church valued\nit at $50,000 in the report to the Omaha Police Department.\n\nSallman first drew \"The Head of Christ\" in 1924 for the cover of the\ndenominational magazine of the Evangelical Covenant Church while he was\nliving in Chicago.\n\nHe did several variations of the painting over the years, and the first oil\nversion was done in 1935 for the 50th anniversary celebration of the\nEvangelical Covenant Church.\n\nEileen Brown, of Brown's Art Consultants and Appraisals in Omaha, said\nSallman often visited churches in the Midwest and re-created the famous\npicture while talking about his faith.\n\nBrown said her father, a pastor in Muscatine, Iowa, told her about Sallman's\nvisit to their Nazarene Church during the 1930s.\n\n\"(Sallman) gave away all of his work,\" Brown said. \"There's no record of any\nof his works having been sold commercially because he gave them all away.\n\n\"When you come right down to it, the picture is priceless because you can't\nget another one.\"\n\nSallman died in 1968.\n\nFirst Covenant Church becomes the sixth Omaha church to report an art theft\nsince last summer.\n\nPaintings from All Saints Episcopal Church, Immaculate Conception Church,\nSt. Thomas More Church and St. Joseph Church also have been taken, and none\nhas been recovered.\n\nMost recently, a 300-year-old painting, \"The Virgin Immaculta\" valued at\n$100,000, was stolen from St. Cecilia Cathedral.\n\nOfficer David Spizzirri, a spokesman for the Police Department, said law\nenforcement agencies specializing in art thefts are assisting in\ninvestigating whether the recent thefts are connected.\n\n\"The FBI, the New York Police Department and Interpol have joined the Omaha\ndepartment's major crimes unit in the investigation,\" Spizzirri said.\n\nInvestigators have notified eBay and local art dealers of the thefts.\n\nAnyone with information about any of the thefts is asked to call\nCrimeStoppers at 444-STOP.\n\nhttp://www.omaha.com/\n\n\n\n------------------------------\n\nMessage: 3\nDate: Thu, 12 Apr 2007 06:46:23 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] A Bone to Pick: Paleontologists Attack Christie's\n\tFossils Sale\nTo: \nMessage-ID: <001f01c77cbd$8774f240$965ed6c0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nA Bone to Pick: Paleontologists Attack Christie's Fossils Sale \n\nBy Gregory Viscusi\n\nApril 11 (Bloomberg) -- Visitors to Christie's International's Paris auction\nhall are being greeted by the upright skeleton of a 2.3 meter (7 1/2 feet)\nprehistoric cave bear, poised to strike with his four fangs and full set of\neight molars. \n\nThe bones of the creature, which lived in what's now Siberia before the last\nice age ended about 10,000 years ago, will be auctioned April 16 along with\nthose of an even larger mammoth, a woolly rhinoceros, and about 80 smaller\nfossils. \n\nPaleontologists are taking a similarly aggressive stance about the sale, the\nfirst of its kind for France and Christie's. \n\n``When you sell a skeleton in an auction, you are taking something away that\nshould be available for science,'' said Jean-Louis Hartenberger, a professor\nat the University of Montpellier. ``You encourage looting.'' \n\nChristie's estimates the bear will sell for 20,000 euros ($26,900) to 25,000\neuros. The mammoth, which stands 3.8 meters tall and is 4.8 meters long with\nhis tusks, may fetch 150,000 to 180,000 euros. The rhino, whose resin horns\naren't original, may go for 55,000 to 65,000 euros. All three were found in\nSiberia. \n\nThose prices aren't worth paying given that the origin of such skeletons is\ndubious, said Michel Guiraud, curator at the National Museum of Natural\nHistory in Paris. \n\n``Specimens sold in these sort of sales are usually not from scientific digs\nand there's generally no documentation about where or how it was found,''\nGuiraud said. ``The scientific value of natural history specimens resides in\nthe information that accompanies them.'' \n\nExport Licenses \n\nGuiraud said there's no way to tell if the skeleton is from a single animal\nor a composite. \n\nThe pieces come from ``European collections,'' aren't composites and have\nRussian export licenses, said Eric Mickeler, Christie's scientific adviser\nfor the sale. The buyers will receive official documents with details of the\ndigs. The smaller fossils come mostly from the collection of Jean Bouhanna,\na veterinarian from Nice. \n\n``It's alarming and dishonest to say every mammoth must be in a museum or an\ninstitution,'' Mickeler said. ``There are already plenty, and all that can\nbe said or written about them has been.'' \n\nThe sale record for a prehistoric creature's bones was $8.4 million for the\nlargest Tyrannosaurus Rex found, a 90 percent complete skeleton dug up in\nSouth Dakota. It was bought by Chicago's Field Museum with backing from\nMcDonald's Corp., Walt Disney World Resort and private donors. Called\n``Sue,'' it has been on display since 2000. \n\nSmuggled Fossils \n\n``Although laws in France allow for scientists to rely on benefactors and\nprivate funds for their purchases, they maintain a conservative and passive\nattitude,'' Mickeler said. ``It's a shame that once again France is\nbehind.'' \n\nThe U.S. isn't spared from similar polemics, said Roger Thomas, secretary of\nthe Paleontological Society and a professor at Franklin & Marshall College\nin Lancaster, Pennsylvania. \n\n``There's no doubt that high prices paid for fossils encourage theft from\nmuseums and university collections,'' he said. There is ``a vigorous\nblack-market trade in fossils smuggled out of countries like Canada and\nGermany where fossils are treated as antiquities.'' \n\nThere is a long tradition of museums buying at auctions, starting with the\nBritish Museum acquiring the first specimen of the fossil bird\nArchaeopteryx, discovered in 1860, Thomas said. \n\nMeteorites and Butterflies \n\n``The commercial market does from time to time cause important specimens to\nbe lost to science,'' he said. ``On the other hand, it also encourages\ndiscovery of specimens that might not otherwise have been found.'' \n\nThe April 16 sale has about 500 lots, including meteorites and butterfly\ncollections, ceramics and porcelains from the 17th to the 20th centuries, as\nwell as tapestries, furniture and some minor old-master paintings. \n\nStill, 14 of the 15 highest-estimated items are prehistoric, including a\nmammoth tusk for 8,000 to 12,000 euros. At the other end of the scale are\nfish fossils starting at 400 euros. The most expensive non-prehistoric item\nis a Louis XIII ebony cabinet estimated at 20,000 to 30,000 euros. \n\nTo contact the reporter on this story: Gregory Viscusi in Paris at\ngviscusi@bloomberg.net \n\nLast Updated: April 11, 2007 01:30 EDT\n\nhttp://www.bloomberg.com/\n\n\n\n------------------------------\n\nMessage: 4\nDate: Thu, 12 Apr 2007 06:46:23 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Vol de 22 vases prestigieux de la c?l?bre collection\n\tHarrach ? Vienne\nTo: \nMessage-ID: <002601c77cbd$89da0b60$9d8e2220$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nVol de 22 vases prestigieux de la c?l?bre collection Harrach ? Vienne \nAFP 11.04.07 | 18h06 \n\n\n ingt-deux vases d'une valeur estim?e entre 500.000 et 1 million d'euros\nissus de la plus grande collection priv?e d'objets d'art d'Autriche, ont ?t?\nvol?s dans la nuit de mardi ? mercredi dans un palais de Vienne, a indiqu?\nle fond? de pouvoir des propri?taires de la collection.\n\nCes pi?ces, qui n'?taient pas prot?g?es par un syst?me d'alarme et devaient\nprochainement ?tre expos?es ? Hongkong, selon la m?me source, font partie du\npatrimoine de l'une des familles les plus riches de la grande aristocratie\nde la monarchie austro-hongroise, les comtes Harrach.\n\nLes 22 vases, dont le plus cher vaut 95 000 euros, mesurent pour certains\npr?s d'un m?tre de hauteur et p?sent jusqu'? 50 kg, selon les d?tails\nfournis par le fond? de pouvoir Josef Payer.\n\nDeux ?tag?res avec une trentaine d'oeufs Faberg?, dont le plus cher vaut 22\n000 euros, ont ?galement ?t? d?rob?s, selon lui.\n\nDepuis des d?cennies les collections du palais Harrach, notamment celles de\nporcelaines et de tableaux, sont quotidiennement ouvertes au public.\n\nLes cambrioleurs, des professionnels selon la police, se sont introduits\ndans le palais Harrach par une entr?e secondaire dont la porte en verre a\n?t? fractur?e, selon M. Payer.\n\n\"Les cambrioleurs sont certainement venus avec une voiture pour transporter\nces vases dont le plus haut fait 92 cm avec un couvercle. Je n'aurais jamais\ncru qu'on allait les voler\", a-t-il pr?cis?.\n\nEn 2003 le plus grand vol d'objet d'art de l'histoire de l'Autriche a eu\nlieu au Kunsthistorisches Museum, le mus?e national des Beaux-Arts ? Vienne\n: la pi?ce d'orf?vrerie Renaissance \"La Saliera\", un chef d'oeuvre du\nsculpteur florentin Benvenuto Cellini (1500-1571) d'une valeur de 36 ? 50\nmillions d'euros, y a ?t? d?rob?e par un voleur ayant agi seul. \n\nhttp://www.lemonde.fr/\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Thu, 12 Apr 2007 06:46:23 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Thieves target Aboriginal art\nTo: \nMessage-ID: <001e01c77cbd$86607500$93215f00$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nThieves target Aboriginal art\n\nSecurity footage showing two men gaining access to the Aboriginal Art\nGalleries of Australia in Spring Street, Melbourne, on February 1 by\nsmashing a side window with rocks:\nhttp://www.theage.com.au/news/national/thieves-target-aboriginal-art/2007/04\n/11/1175971144714.html#\n\nApril 11, 2007 - 4:37PM\n\nPolice believe a gang specialising in stealing Aboriginal art has struck\nagain, this time stealing $80,000 worth of art from a city gallery.\n\nPolice said in the early hours of last Wednesday thieves smashed the front\ndoors of the Kimberly Art Gallery in Flinders Lane.\n\n\"Once inside the thieves have selected 10 artworks, valued at a total of\n$80,000,\" police said.\n\nAnd at 5am on Friday March 30, two men broke into a High Street art gallery,\nstealing four paintings.\n\nThe paintings, valued at a total of $14,000, were recovered a short time\nlater in an abandoned vehicle.\n\n\"This is the third time this particular gallery has been targeted.\nPreviously stolen were two very distinctive works Possum & Kangaroo and Body\nPaint.\"\n\nArt dealers are warned to be on the lookout for anyone trying to sell\nAboriginal paintings.\n\nThe latest burglary is just the latest in a string of thefts to hit\nMelbourne galleries specialising in Aboriginal art.\n\n\"It is estimated that the thieves have stolen in excess of $250,000 worth of\nAboriginal art since December 2005,\" police said.\n\nThe same thieves are believed to have targeted the Aboriginal Art Galleries\nof Australia in Spring Street, Melbourne, on February 1, when two men gained\naccess to the gallery by smashing a front window.\n\nOn that occasion two paintings worth $40,000 were stolen.\n\nIt's believed the same thieves attended this gallery a year earlier when\n$120,000 worth of aboriginal paintings were stolen in February 2006.\n\nOn January 9 this year thieves smashed the front glass door of Aboriginal\nGallery of Dreamings in Bourke Street and stole 20 unframed paintings.\n\nPolice believe the same thieves struck the High on Art Aboriginal Gallery in\nArmadale on January 19, 2007, which was also burgled in October 2006 and\nDecember 2005.\n\nMelbourne Criminal Investigation Unit's Detective Senior Constable Rebecca\nHall told theage.com.au the thieves appear to be more opportunistic, rather\nthan deliberately targeting valuable Aboriginal art.\n\n\"Whether they've got knowledge of what they're actually taking is debatable,\nbecause one of the owners did state to me that there was more valuable\npaintings nearby and they were just left (behind).\"\n\nDetective Hall said selling the stolen artwork could be hard within\nAustralia, but not overseas.\n\n\"I spoken to some of the art gallery owners and they're at a loss as to\nwhere they are going . . . it could be going overseas, but it's difficult to\nsay where it's going.\"\n\nPolice are warning art dealers to be on the lookout for anyone trying to\nsell Aboriginal paintings.\n\ntheage.com.au\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Thu, 12 Apr 2007 06:46:23 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Kunstr?uber in Wien erbeuten Vasen im Millionen-Wert\nTo: \nMessage-ID: <002501c77cbd$89b9d930$9d2d8b90$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nKunstr?uber in Wien erbeuten Vasen im Millionen-Wert \n\nWIEN - Bei einem spektakul?ren Kunstraub in Wien haben Diebe Vasen im\ngesch?tzten Wert von bis zu einer Million Euro erbeutet. Die Kunstr?uber\nbrachen in das Palais Harras in der Innenstadt ein und stahlen dort in der\nNacht zum Mittwoch mehrere wertvolle Vasen.\n\nWie das . Einige der Vasen waren nach Angaben des Unternehmens, dem die\nKunstwerke geh?ren, bis zu einem Meter hoch und bis zu 50 Kilogramm schwer.\nAuch kostbare Faberg?-Eier seien gestohlen worden. Die Polizei nahm\nErmittlungen auf.\n\n\n\n Es habe sich offensichtlich um Profis gehandelt, die mindestens zu zweit am\nWerk gewesen seien, erkl?rte die Polizei. Die Kunstobjekte geh?ren dem\nGrafengeschlecht der Harrach, einer der wohlhabendsten Adelsfamilien der\n?sterreichisch-ungarischen Monarchie.\n\nIm Palais Harras in Wien ist seit 1994 das Kunsthistorische Museum\nuntergebracht. Seitdem findet dort regelm?ssig Sonderausstellungen und\nandere Kulturveranstaltungen statt.\n\nhttp://www.tagesanzeiger.ch/\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Thu, 12 Apr 2007 06:46:23 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The heist of the century\nTo: \nMessage-ID: <002401c77cbd$89509010$9bf1b030$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nThe heist of the century \nFor more than 30 years, he was the scourge of the world's art thieves.\nWorking deep under cover, often for months at a time, FBI special agent\nThomas McShane recovered $900m of stolen art - from Rembrandts lifted in\nFrance, to Van Goghs snatched in Manhattan. But the biggest heist of all\nleft him and his team confounded. And the case remains unsolved to this\nday... \nPublished: 11 April 2007 \nIf you take a look at Interpol's list of the top five criminal enterprises\nin the world, number four might surprise you. Art theft. Interpol, the\ninternational police agency based in France, has determined that stealing,\ncopying, and reselling pretty works of art is only exceeded by the much\nuglier businesses of illicit drugs, arms smuggling, and money laundering. \n\nIn the US, the Federal Bureau of Investigation concurs. My former employer\nbelieves that art theft now exceeds $5bn (?2.65bn) a year - and counting.\n\nNone of this surprises me. I've spent the past 35 years tracking pilfered\npaintings across the planet. For 22 of those years, I was the FBI's main art\ntheft undercover agent. Few knew, even within the bureau, because I operated\nin the shadows buried under multiple aliases.\n\nOne of the things I learned early on is that there are two contrasting\nreasons why art theft and forgery is such a bullish growth industry. The\nsoaring value of classic paintings has combined with a comparatively\nminuscule legal risk, to create a landscape that has become every criminal's\ndream job. With the auction price of a single Picasso topping $100m in 2004,\nthe sky is now the limit in this crazy, highly specialised industry.\n\nYet the legal statutes haven't remotely kept up with the unprecedented\ntemptation to cross over to the dark side.\n\nSomeone could snatch the Mona Lisa off the wall of the Louvre in Paris, sell\nit in New York's Central Park for a cool $350m, get caught a week later, and\nexpect to be given no more than 18 months or so for the \"sale and\ntransportation of stolen property\". While stealing Leonardo's heavily\nguarded masterpiece might be an absurd example, what about that Monet the\nrich guy down the street has in his study? It might only produce a mere\n$10m, but most people could survive on that.\n\nIt's my estimation that every day, thousands of people gaze at the beauty of\na stolen painting. They're everywhere, right under our noses: big, framed,\nlavishly pigmented lottery tickets hanging on walls like the proverbial\nmoney growing on trees.\n\nTake my word for it; many stolen paintings are kept in open view, and they\ncould be anywhere. I've seen nearly $300m worth of classics in the oddest\nplaces. A Van Gogh at a grimy gas station. A Picasso in a $20-a-night roach\nmotel. A Rubens in the back of a beat-up van. A Rembrandt in the bathroom of\na small antique store. Two more Rubenses spinning down from a hotel balcony,\nplunging to the grass below. You name it...\n\n***\n\nON 18 MARCH 1990, as Boston's boisterous St Patrick's Day parties were\nwinding down, two men dressed as city police officers pulled off the biggest\nart heist in modern history. Since then, the ice-cold case has grown into\none of the most frustrating mysteries imaginable. Who were the thieves? Who,\nif anyone, were they working for? Why did they take what they did - 11\nassorted artworks worth an estimated $200m in 1990 dollars - and leave\nbehind a wide array of historic masterpieces that might have doubled or\ntripled the value of their haul? Most of all, where are those 11\nirreplaceable paintings, drawings, and etchings today, and why hasn't a\nsingle one surfaced in nearly two decades?\n\nIn the early morning hours of the day in question, a dark-haired pair of\nalleged Boston patrol officers, each sporting what were later believed to be\nfake moustaches, knocked on the office door in the rear of the\ninternationally famous Isabella Stewart Gardner Museum, at 2 Palace Road,\nBoston, Massachusetts. They informed the security guard who greeted them\nthat they were responding to a call regarding a disturbance in the compound,\ncaused by a marauding group of celebratory teenagers. The story was a ruse\nto get inside.\n\nThe visitors, dressed in authentic police hats and coats adorned with shiny\nsilver badges, asked the security guard if anyone else was working that\nmorning. He responded that his partner was making the rounds in the\nbuilding. The cops asked him to summon the second guard. When he arrived,\nthe officers announced that they had a warrant for the first security\nguard's arrest, and proceeded to handcuff them both. \"Gentlemen,\" the\nofficers announced once the guards were secured, \"this is a robbery.\" The\nsecurity guards were taken to the basement, where they were separated, then\nelaborately trussed-up with duct tape around their hands, ankles, mouths,\nchins, and heads. The robbers even taped over the handcuffs, blocking the\nkeyhole. Two additional pairs of handcuffs were produced. They were used to\nsecure the guards to structures in the basement.\n\nThroughout the ordeal, the soft-spoken, apparently unarmed robbers asked the\nguards if they were comfortable, and if any of the bindings were causing\nexcessive pain. They then took the men's wallets, removed their driver's\nlicences, and informed them that they now knew where they lived. The\nimplication being that the security officers should not go out of their way\nto help in the subsequent police investigation, or else. \"Don't tell anybody\nanything,\" one of the robbers said. \"If everything goes right, you'll get a\nnice reward in a year's time.\" (No such gift was ever reported.)\n\nThe Gardner Museum had an elaborate computerised tracking system that noted\nthe time various doors were opened. From the records, the robbers arrived at\n1.24am, and spent 24 minutes securing the guards. After that, they\nimmediately travelled to the second-floor Dutch Room Gallery in the\nmaze-like building to begin lifting a very specific group of paintings off\nthe walls. They took Vermeer's The Concert; Rembrandt's A Lady and Gentleman\nin Black; Rembrandt's The Storm on the Sea of Galilee; Rembrandt's Self\nPortrait etching; and then two quizzical works, Govaert Flinck's Landscape\nwith an Obelisk that for centuries had been attributed to Rembrandt; and\neven more inexplicably, a drab, 10in Chinese bronze beaker known as a ku\nfrom the Shang Dynasty dating to 1200-1100BC. The oil paintings ranged in\nsize from the two large Rembrandts - Lady and Storm - checking in at 4.3ft x\n3.6ft, and 5.3ft x 4.3ft respectively, to the tiny Rembrandt etching, which\nwas little more than a postage stamp at 1.75in x 2in. A fourth Rembrandt, a\nlarger and more valuable self-portrait, was anchored tightly to the wall and\noffered resistance. When the crooks finally pried it down, they realised\nthat it was painted on wood, not canvas, and couldn't be cut from a frame\nand rolled up. They had to leave it behind. Ruffled and insulted, the great\nmaster sat across the room, \"watching\" as the rest of the event transpired.\n\nAfter that mixed bag, the duo went to the Short Gallery on the other side of\nthe room and honed in on five extremely quizzical works by Degas: La Sortie\nde Pesage, a pencil and watercolour on paper; Cortege Aux Environs de\nFlorence, a pencil and wash on paper; Three Mounted Jockeys, a black ink,\nwhite, flesh, and rose wash on paper; Program for an Artistic Soir?e; a\ncharcoal on white paper; and Program for an Artistic Soir?e II, an\nunfinished version of the previous work.\n\nThe above selections have had experts shaking their heads for decades. With\nthe almost unlimited quantity of priceless oils available to them, including\nTitian's The Rape of Europa, which itself might be worth $300m alone today,\nwhy did the thieves ignore the Raphaels and select this bizarre collection\nof pencils, washes, charcoals and inks from a prolific artist like Degas who\nflooded the market? Those particular works by Degas are mediums, which can\nsometimes be purchased for mere thousands on slow days at the neighbourhood\nauction house.\n\nAs if to send a message, or to display an odd sense of humour, the robbers\nmade another astounding choice, taking a bronze, gilded, 9in x 7in metal\neagle known as a finial from the top of a Napoleonic flag jutting out of a\ncase. The relic is so insignificant it's usually not included in the list of\nstolen works - which actually totalled 13 when figuring in the ku and the\nfinial.\n\nThe Gardner Museum offered the thieves more than 2,500 pieces of ancient\nart, including oil paintings, sculptures, furniture, manuscripts, books,\nsilver, photographs, textiles, artefacts, and relics, some dating back 30\ncenturies, and the pair took a weathered flagpole ornament? After those\nhead-scratchers, the robbers returned to the first floor Blue Room and made\na more logical selection, Manet's Chez Tortoni, a small, but traditionally\nmore valuable, oil on canvas that was 10.5in x 13.5in. Having their fill -\nand leaving more than a billion dollars worth of historic masterworks behind\n- the duo left the building one at a time at 2.41am and 2.45am, exiting\nseparately for reasons only known to them. The computer records indicated\nthat the pair never bothered to venture to the third-floor galleries where\nthe prized Titian, the Raphaels, and countless other Italian masterpieces\nhung untouched. Were they unaware that the Titian was up there - in The\nTitian Room?\n\n***\n\nBECAUSE OF A quirk in the otherwise elaborate security system, the theft\nwasn't discovered until the morning shift of guards arrived at 8am. They\nfound the security station unmanned, so they called the police. The\nlate-shift crew was then discovered hog-tied in the basement. Although the\nalarms had engaged, and times were recorded when the works were removed, the\nmuseum had only internal signals that did not alert an external police or\nsecurity company. That notification was supposed to have been accomplished\nby the manual pressing of a \"panic button\" at the main security desk. By\nneutralising the security officers at the start, the knowledgeable robbers\nhad eliminated outside intervention. When the arriving police and security\nguards checked the facilities, they learned that the thieves had taken the\nvideo from the surveillance recorder, turned the first-floor camera away\nfrom the security desk, and tore off and removed a computerised printout\nthat reported all the alarm and door engagements.\n\nA disk that held the printed information remained, as did the computer's\ninternal hard drive. That enabled investigators to simply reprint the\ninformation that was taken.\n\nIt was also determined, to everyone's horror, that some of the paintings,\nincluding Rembrandt's Storm and Gentleman had been cut from their frames and\nstretchers and probably rolled up, which would cause the ancient paint to\ncrack and flake. (A Vermeer, stolen in Brussels in 1971, was not only rolled\nup, but the thief sat on it in a cab, all but destroying it.)\n\nTaken as a whole, the theft was puzzlingly schizophrenic. On one hand, there\nwas an extensive knowledge of the Gardner's security operation, a solid\nunderstanding of art when considering the first three primary targets, and a\ncleverly devised plan that worked without a hitch. In contrast, there were\nthe baffling subsequent selections, the weird secondary artefact choices,\nand the confusing attempt to blot out the computer records by taking a\nprintout, but not the disk containing the information. Were the thieves\ngeniuses or dunces? Or, was there an agenda involved that no one has ever\nfigured out?\n\nWhat about the festive date chosen for the headline-grabbing event? Was the\nIrish holiday selected in deference to Isabella Stewart Gardner herself, a\nglobe-trotting party girl who opened the grand museum in 1903 on New Year's\nnight?\n\nEven more intriguing, was this a theft that eliminated all the crass\nmonetary values and returned to the very crux of art itself? Meaning, were\nthe thieves working from a childlike Christmas list of things someone simply\nsaw and liked during a casual trek through the museum?\n\n***\n\nTHE MEDIA BROUGHT out their biggest headlines, reacting to the intrigue, the\ndrama, the $200m to $300m figure, and the famous names involved. Putting\nVermeer, Rembrandt, Degas, Manet, and even Napoleon in the same sentence\nmakes for a star-studded cast. As expected, for the general public at least,\nGovaert Flinck was like the answer to the routine multiple choice question,\n\"Which name doesn't belong in this group?\"\n\nFlinck, a 17th-century Dutch technician, was a student of Rembrandt who\ncopied his style so well that many of the Rembrandts in the world are\nactually Flincks. Even after being included in such lofty company, his\npaintings aren't wildly popular and sell for five figures when they\noccasionally appear on the market. Which begs the question: did the thieves\nreally want a Flinck, or did they fail to read the inscription and think it\nwas another Rembrandt? If they were limited by time and carrying ability,\nwhy did they choose Flinck over Titian? Or, did they simply like the\npainting?\n\nThe Flinck dilemma aside, the robbery remained huge international news.\nEverybody was shocked and horrified - everybody except award-winning Time\nmagazine art critic Robert Hughes, who stuck up his nose and produced one of\nthe classic art snob dismissals of all time. Positioning himself as the\nultimate authority, the bestselling author ripped into the thieves as\nNeanderthals, the media as ignorant troglodytes, the museum itself for\ncaring a whit about such mostly insignificant pieces, the museum's\ncondition, the museum's security, the police, the French, greedy art auction\nhouses, and even the great artists themselves for producing so much inferior\njunk.\n\n\"It seems quite clear that the thieves had very little idea of what to go\nafter, since the glory of the Gardner Museum is its Italian paintings,\nstarting at the top with Titian's Rape of Europa, regarded by some as the\ngreatest single Italian Renaissance canvas in the US... This was more the\nGang That Couldn't See Straight.\"\n\nThis is where I disagree. It's my belief that these thieves, either by their\nown devices, or working from a specific list, took exactly what they wanted,\nright down to the silly little eagle on Napoleon's flag.\n\n***\n\nI WAS SUMMONED to Boston on the Monday after the weekend robbery. Walking\nthrough the museum, and reading all the reports, I came across two curious\nitems that were potentially revealing. There was a five-minute period just\nprior to the thieves' arrival in which the computer system was dormant. From\n12.39am until 12.44am, the machine recorded no activity. When the system\nreactivated at 12.44am, alarms indicating a glass break and a fire went off\non the fourth floor, a residence area where, according to the computer, the\nthieves never ventured. The readings were checked by the security guard,\ndeemed a malfunction, and the alarm reset.\n\nThat kind of pre-theft distraction was the calling card of both the Irish\nRepublican Army, a band that was noted worldwide for art thefts dating back\ndecades, or its rival loyalist group, the Ulster Volunteer Force, which was\nstarting to follow suit. What was the IRA/UVF doing in America, one might\nask? Was this really America, might be the best answer. Boston, like so many\nUS cities, is filled with ethnic pockets that are deeply rooted in the\nculture and politics of the \"old country\". Boston is so Irish even some of\nthe Italians speak with a brogue. The city has long crawled with IRA and UVF\nagents, either hiding out, recruiting, lobbying, or raising money for the\ncause.\n\nBoston's notorious Irish Winter Hill mob, headed by the FBI's Top Ten Most\nWanted fugitive James \"Whitey\" Bulger, has at times wielded more power than\nthe traditional Patriarca Italian Mafia that supposedly controls the city\nfrom its headquarters in Providence, Rhode Island. Whitey had strong IRA\nties, along with compromised law enforcement officers inside the Boston\npolice department, and, unfortunately, Boston's FBI office. The deadly mob\nboss, who didn't go on the lam until 1995, could have easily given his IRA\npals a pair of authentic Boston police uniforms - or even arranged for a duo\nof legitimate cops on his payroll to pull off the heist.\n\nNine years earlier, Martin \"The General\" Cahill, a Dublin mobster with loose\nties to the UVF, hit the famous Sir Alfred Beit collection at Russborough\nHouse in Blessington, Ireland. This was the same palatial 18th-century\nPalladian mansion/museum, robbed by the IRA a decade before. Cahill's gang\nused a glasscutter to make a hole in a large French window, opened the\nshutters, deliberately set off the alarm, altered it in some manner so it\nwouldn't go off again, then hid outside in the grass as the police and\nsecurity checked it out.\n\nOnce the coast was clear, they returned and lifted 18 paintings worth $40m,\nincluding a Vermeer and the usual Rubens, Goyas, and Renoirs, along with the\nsame exact Gainsborough, Madame Baccelli, that the IRA had grabbed 12 years\nearlier.\n\nThe matching modus operandi in each case was the alarm tripped within an\nhour of the thieves' entry. In the Gardner heist, however, there was no\nindication of how an accomplice could have entered the building\nclandestinely and scurried to the fourth floor undetected prior to the\nrobbers' official entry at the main security station 40 minutes later. There\nwas, however, an employee who failed a polygraph, quit his job, and didn't\nbother to return for his last pay cheque. The person denied any\nparticipation in the robbery, and no connection beyond his highly suspicious\nbehaviour was ever established.\n\nResidents celebrating St Patrick's Day in the area reported seeing a\nmedium-sized, light-coloured vehicle parked near the museum from 12.30am to\n1.15am. Two men were inside that fitted the description of the\nthirtysomething robbers. The first was about 5ft 10in, medium build, with a\nshiny fake moustache, short dark hair, and square gold-framed glasses. The\nsecond man was taller and heavier, about 6ft 1in, 200lb, with \"puffy\"\ncollar-length black hair and the same type of fake moustache. They were not,\nhowever, described as wearing police uniforms - at least not then.\n\nContinuing my on-site inspection of the castle-like museum, I wondered anew\nwhy the grand Titian wasn't taken, and why the ku and finial were. It again\nseemed like part theft of the century, and part fraternity prank. Looking\ncloser, I noticed a small dent in the wall above the now finial-less\nNapoleonic flag. The crooks had banged the eagle against the wall in the\nprocess of yanking it off, possibly damaging it. That was telling. Not only\nwere they determined to take the curious item, they apparently had a hard\ntime doing so. From a psychological profiling perspective, I reconsidered\nthe possibility that the culprits were real cops. They had acted with the\nconfidence and gumption of men who had worn the badge and blue uniform\nbefore, and knew the respect the symbols commanded. A notation buried in a\nfile mentioned that the pair each wore standard black police radios on their\nhips, live transmitters that crackled with authentic police activity,\nincluding the array of codes dispatchers use to designate particular crimes.\n\nThe \"cops\" additionally acted like men who knew their way about a crime\nscene investigation lab. The FBI CSI types went over the place with a\nfine-toothed computerised comb and came up with nothing, not a fingerprint,\nfootprint, hair, DNA sample, clothing fibre, nothing. The duct tape was the\nkind that can be purchased anywhere on the planet with no tracing codes. The\nhandcuffs, surprisingly enough, were nearly as prevalent, available\neverywhere from security supply stores to S&M sex shops. The robbers\noperated completely off the CSI radar - a neat trick considering that the\nsecurity guards said they weren't wearing gloves. If the suspects had\noutfoxed the lab techs because they were indeed real Boston Blues who knew\nthe score, what a hornet's nest this was going to be. Either way, the\ndisguise was an extremely effective ruse.\n\n***\n\nTHE SPECULATION CIRCLED back around to Bulger and/or Ireland's notorious\nGeneral. Was Cahill in town? That was easy enough to check and dismiss,\nunless he was travelling under an alias, which he wasn't known to do. In\nfact, like most mobsters, he was mostly provincial and territorial. Plus,\nthere was no indication that his previous art robberies had brought him\nanything but the same grief his predecessors quickly discovered - no buyers\nstepping forward to take a chance on anything so well known. Whoever was\nresponsible, the key to solving it was the same as always - follow the money\nto the oil.\n\nThe law enforcement strategy was for everybody to pound their informants.\nThat was especially true of me, as my sources were directly connected to the\nart world. The problem was, a $1m reward had them all salivating. Nobody was\ngoing to give up their lottery ticket by admitting they didn't know\nanything. Most didn't even wait until we called, jumping on the phone and\ninforming us that they \"might\" know something. All they needed, they kept\nrepeating, one con man after the other, was a little up-front flash money to\nget the ball rolling. The grifters were hustling up a storm as fierce as the\none in Rembrandt's missing sea painting.\n\nNeeding a new identity to deal with them, I became super 1990s art dealer\nThomas Russell, international man of money and action. I put out the word\nfar and wide that I was in the market for Vermeers, Rembrandts, Degas and\nManets, baby! I'd even be interested in paying top dollar for a Chinese ku,\nor a French finial once waved by a general with a severe short guy's\ncomplex. That is, if anybody out there just happened to have any of those\nthings.\n\nWhile waiting for the leads to filter in, I hit the files and read\neverything I could about New England art thefts. Some of the cases I knew\nwell, like the Fogg Museum coin heist from decades past. I also took\nrefresher courses in the techniques of Rembrandt, Degas, Manet and Vermeer\nin case I had to start inspecting the rash of forgeries that often\nmaterialise after a sensational theft. I noted with interest that Vermeer\nwas a tavern owner with lots of kids, two things that probably were\ninstrumental in keeping his production numbers so low.\n\nOf all the tips that flooded in, only three or four were deemed worth\npursuing. One pointed to a noted Boston fence who was spreading the word\nthat he had a bead on the Gardner art and could broker the deal. I phoned\nhim as Tom Russell, shady art dealer extraordinaire, and listened as he\ntried to work me for a $20,000 finder's fee - paid up front. Since he had\nsome credibility with the Boston agents, we agreed to have a sit down at a\nritzy Pier 4 restaurant, my treat. When the time came, he never showed. We\nwrote it off as another attempted hustle.\n\nThe unusual no-show was the beginning of a disturbing trend. One of the\nlocal agents had some solid contacts with the IRA, and nothing came through\nwith them either. Another Boston agent was in tight with Bulger, who was\nactually a long-time FBI informant dating back to when he was a street punk.\nThat extremely rare inside connection nonetheless failed to produce any\nworthwhile information.\n\nI was starting to get a really bad feeling about what was going on - on both\nsides of the law. With such a wealth of informants, including a top mob\nboss, how come nobody knew anything about such a major theft? Where was the\ntraditional \"mob blessing\" required to operate in someone's territory?\n\n***\n\nTHAT QUESTION WOULDN'T be answered until a decade later. In 1999, a federal\ninvestigation headed by Judge Mark Wolf accused 18 Boston FBI agents and\nsupervisors of handling informants in an illegal manner. That set off one of\nthe worst scandals in bureau history. Special Agent John Connolly, the man\nclosest to Bulger, was subsequently convicted in 2002 of one count of\nracketeering, two counts of obstruction of justice, and one count of making\na false statement to the FBI. He was found innocent of the even nastier\ncharges of leaking information that led to the deaths of three informants.\n\n\"Today's verdict reveals John Connolly for what he became, a Winter Hill\nGang operative masquerading as a law enforcement agent,\" said US Attorney\nMichael J Sullivan. Connolly was sentenced to 10 years in prison. Connolly's\nsupervisor, John Morris, confessed to receiving payoffs, and to leaking\ninformation to Whitey about police investigations. He was granted immunity\nfor testifying against Connolly.\n\nSuffice it to say, the informant tips coming into the Boston field office\nregarding the Gardner theft were no doubt being finely screened. It may also\nexplain why a legitimate source may not have even bothered calling, and why\nmy fence stood me up. It's only natural to assume that one of the main\nfunctions of a police officer or a special agent on the mob's payroll is to\ntip them off regarding the activities of undercover agents.\n\nOn the positive side, the lead investigator who caught the case and worked\nit for more than a decade, Daniel J Falzon, was a squeaky-clean kid of 26\nwhose father, Frank, was a well-respected San Francisco homicide detective.\nFalzon was completely out of the loop of the older Connolly and his group of\nlong-time cronies, and was never suspected of any foul play.\n\n\"It wasn't a task, it was a passion, and it still is,\" Falzon told a\nreporter in the late 1990s. \"You get involved in something like this, it's\npart of your life. It's part of you.\"\n\n***\n\nAS TIME PASSED, the lid on what happened at the Gardner Museum closed\ntighter than a Scotsman's wallet. The tips became fanciful. We were told by\nsomeone with an Aristotle Onassis/Jackie Kennedy complex that the theft was\ndone on behalf of a Greek tycoon who wanted the art as a gift for his new\nhigh-society girlfriend. That lead went nowhere.\n\nAnother wild goose chase took me to Canada. I was dispatched to Toronto to\nmeet with this Little Caesar character with a French accent, an Edward G\nRobinson-looking yoyo who claimed, see, to have an in, see, with the guys\nwho have the goods, see. Little French Caesar set up a meeting with the\nguys, see, and they didn't show either, see.\n\nThe next wild goose led me to New York, where this giant African-American\nguy tried to sell me a painting purportedly by Samuel Finley Breese Morse,\nthe man who invented the Morse code. I didn't even know Morse was an artist.\nThe painting was garbage. Bubba said he'd only tell me about the Gardner\ntheft after we did the Morse code deal. Right. And we'd do The Da Vinci Code\ndeal after that.\n\nAfter a few weeks of this run-around, I again sensed that something was\nterribly wrong in Boston, and that nothing was going to get done as long as\nI stayed there. I retreated to Oklahoma, and worked my national and\ninternational sources without having to report to the nosey Boston\nsupervisors.\n\nI narrowed my suspects down to a pair. The first was a man named Brian\nMichael McDevitt, a noted con man who had attempted to rob similar paintings\nfrom the Hyde Collection in Glens Falls, New York, a decade earlier.\nMcDevitt, who was living in Boston at the time of the Gardner robbery, had\ndevised an elaborate plan for the New York caper. He and the night manager\nof the Queensbury Hotel where he was staying, Michael Brian Morey, dressed\nthemselves in Federal Express uniforms, hijacked a Federal Express truck,\nkidnapped the female driver, knocked her out with ether, and headed to the\nHyde. The express mail carrier ruse was going to be their cover to get\ninside the museum.\n\nThe scheme was foiled when they became stuck in traffic, and the Hyde closed\nbefore they could get there. Police officers responding to the vehicle theft\nfound an elaborate diagram of the museum in the truck, along with 14 pairs\nof handcuffs, duct tape, medical tape, and sharp instruments the pair\nadmitted would have been used to cut the paintings from their frames.\n\nConvicted of unlawful imprisonment and attempted grand larceny, they spent\nless than a year in jail.\n\nMcDevitt, who fitted the description of the larger of the Gardner robbers,\nexcept for his thinning red hair, was brought in and interrogated. He\nnaturally denied it. His alibi for the night in question bounced, and he\nrefused to take a polygraph. When brought in, he was discovered to be\nclean-shaven for the first time in eight years. His easy-to-identify bushy\nred beard was gone, and his short red hair could have been muted under a\n\"puffy\" dark wig.\n\nAn extremely interesting tid-bit in McDevitt's file was the fact that he was\na flag aficionado. In the mid 1980s, while attending the University of\nMassachusetts, Boston, McDevitt spearheaded an effort to raise money,\npurchase, and display more than 100 flags around the institution to reflect\nthe diversity of its student body. That sure sounds like a guy who, in\nmid-robbery, would have taken the time to try and filch a Napoleonic flag\nand its capping finial. Still, other than a pile of compelling\ncircumstantial evidence, we had nothing that enabled us to hold him.\n\nMy second theory involves the IRA or UVF. If they did the job, the paintings\nmore than likely ended up overseas. From there, they were either sold in\nJapan, or to someone in one of the Arab nations. Back in Boston, the empty\nframes from the Gardner theft still hang in the museum. Isabella Stewart\nGardner collected the valuables herself during her frequent trips to Europe\nin the 1880s. Her will decreed that nothing would ever be removed from, or\nadded to, her Venetian-style palace. That means the empty spots on the\nwalls, and the dent from the eagle, will remain until they are filled with\nprecisely what was there before.\n\nThat should be the policy of all museums. The empty spaces should forever\nstand as enduring reminders of the beauty, and irreplaceable history, that's\nconstantly chiselled away by growing legions of thieves.\n\nThis is an edited extract from 'Loot: Inside the World of Stolen Art' by\nThomas McShane and Dary Matera (Maverick House, ?8.99)\n\nhttp://news.independent.co.uk/\n\n\n\n------------------------------\n\nMessage: 8\nDate: Thu, 12 Apr 2007 06:46:23 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Stolen 'Scream' may undergo surgery\nTo: \nMessage-ID: <002701c77cbd$8a082040$9e1860c0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nStolen 'Scream' may undergo surgery\nBy Spie Mellgren\nASSOCIATED PRESS\nApril 12, 2007 \n\n\nOSLO, Norway \n    The theft-damaged Edvard Munch masterpieces \"The Scream\" and \"Madonna\"\nmay require treatment by an eye surgeon to remove tiny splinters of glass\nduring their restoration, the Munch Museum's director said yesterday. \n    \"That is one of the options under consideration,\" Lise Mjoes said after\ntestifying at a court hearing in Oslo. \n    She said an eye surgeon has skills and equipment to remove glass\nfragments without damaging the surrounding area. \n    The paintings were recovered by police on Aug. 31, about two years after\nthey were stolen by masked gunmen in a brazen daylight heist at Oslo's Munch\nMuseum. Both were damaged and are being repaired. \n    Last month, an Oslo appeals court upheld the conviction of three men for\ntaking part in the robbery, and yesterday it began hearing testimony ahead\nof their sentencing. The prosecution demanded prison terms ranging from\nseven to 12 years. Sentencing is expected April 23. \n    In yesterday's testimony, Miss Mjoes described the damage to the\npaintings as the result of the heavy-handed theft and two years of improper\nstorage. She said the damage was the same as previously described by the\nmuseum: scrapes, holes, loose paint and moisture damage. \n    She said because the frames and glass on both works had been broken\nduring the theft, tiny glass fragments were embedded in the paintings, with\n\"Madonna\" being especially hard hit. \n    \"We want to get those out to prevent them from causing more damage\nlater,\" Miss Mjoes told the court, adding that the museum might ask an eye\nsurgeon to remove the glass. \n    After the hearing, she said a painstaking process of assessing the\ndamage to the paintings and deciding the best approach to repairing them was\nstill under way. Miss Mjoes said no decision had been made on when to start\nthe restoration work or how long it would take to complete it. \n    The city-owned Munch Museum has demanded that the thieves pay $262,000\nfor the restoration process and $213,000 for lost income as a result of the\ntheft. \n    Although the paintings are broadly considered priceless, prosecutors in\nthe original trial demanded that the thieves pay $123 million in\ncompensation. That demand was dropped after police recovered the paintings\nin a secret operation they still refuse to discuss. \n    \"The Scream\" and \"Madonna\" were part of Munch's \"Frieze of Life\" series,\nin which sickness, death, anxiety and love are central themes. The artist\ndied in 1944 at age 80. \n    There are four versions of \"The Scream,\" probably Munch's best-known\nwork, depicting a waiflike figure apparently screaming or hearing a scream. \n\n\nhttp://www.washingtontimes.com/entertainment/20070411-101220-1198r.htm\n\n\n\n------------------------------\n\nMessage: 9\nDate: Thu, 12 Apr 2007 07:13:26 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Thieves Take 3-Foot Statue Of National Revolutionary\n\tWar Hero\tFrom Moorings At Hale Homestead\nTo: \nMessage-ID: <005c01c77cc1$4d3d8c00$e7b8a400$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nhttp://www.courant.com/hc-ctnathanhale0411.artapr11,0,6429365.story?coll=hc-\nbig-headlines-breaking \n\nNathan Gone, Feet Secure \n\nThieves Take 3-Foot Statue Of National Revolutionary War Hero From Moorings\nAt Hale Homestead \n\nBy STEPHANIE SUMMERS\nCourant Staff Writer\n\nApril 11 2007\n\nCOVENTRY -- As a spy, Revolutionary War hero Nathan Hale was hanged by the\nBritish. As a statue, he's been cut off at the ankles ... and stolen from\nhis historic family homestead.\n\nThieves removed the 3-foot bronze sculpture of Hale, leaving behind only his\nshoes and the statue base, sometime between March 29 and April 4,\nAntiquarian and Landmarks Society officials said Tuesday.\n\nThe statue was the work of eminent New England sculptor Bela Lyon Pratt,\nwhose pieces also adorn the Library of Congress, Museum of Fine Arts in\nBoston, Yale, Harvard, the Connecticut state Capitol and myriad other sites.\n\n\"What a shame,\" said Sheryl Hack, executive director of the society, which\nowns the Hale Homestead and eight other house museums. \"Is it a prank? Is it\nserious? It certainly is disrespectful.\"\n\nBen Wilson, the society's building conservator, discovered the theft April 4\nwhen he walked from the house, where he stays overnight for part of each\nweek.\n\n\"If you don't look for it, you wouldn't necessarily see it,\" he said\nTuesday, because the brown and green figure is nestled in leaves and plants\nnear a stone wall in the crux of the L-shaped house. Hale grew up in the\nolder part of the house, which adjoins the main structure built the year he\nwas hanged in 1776.\n\nAt first Wilson thought it might be a prank akin to stealing a garden gnome,\nbut then realized the thieves had to really want the 100-pound sculpture to\ngo to so much trouble. \"Nathan Hale is a beloved Connecticut figure, so\npossibly it was a Hale fanatic,\" he said partly in jest, adding that\nCoventry citizens have a deep affection for the Hale heritage.\n\nThe society just wants the statue of the national and state hero, best known\nfor saying at his hanging, \"I only regret that I have but one life to lose\nfor my country,\" to be brought back to the homestead. If that happens, no\nquestions will be asked. There will be no hanging, no amputation at the\nankles, no prosecution, they say.\n\nThe society has a twin of the statue from the same Pratt cast in storage but\nwould not use it to replace the stolen one, Wilson said, adding that he did\nnot know its value.\n\n\"The significant thing is that it was stolen and it's Nathan Hale. It would\nbe like stealing a piece of the Statehouse,\" he said.\n\nCoventry Police Chief Mark Palmer speculated it could have been removed by\ntying a rope to it and pulling it with a vehicle. Police have notified other\njurisdictions and plan to check with metal dealers, although Palmer said he\ndoubted legitimate enterprises would consider buying such a piece.\n\nPalmer said anyone with information should call the anonymous police tips\nline at 860-742-2400 or the main number, 860-742-7331.\n\nHack, who worked at the Canterbury Shaker Village in New Hampshire before\ncoming to the antiquarian society more than a year ago, said a 1790s granite\nwatering trough was stolen from that historic site but was returned after a\nstrong public plea was made.\n\n\n\"We'd like to hear a hue and cry that it's not only important to us but to\nthe residents of the state - that it's really important to bring Nathan\nback.\"\n\nContact Stephanie Summers at ssummers@courant.com.  \n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 10\nDate: Thu, 12 Apr 2007 07:13:26 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] MORE than 40 indigenous paintings,\tworth hundreds of\n\tthousands of dollars and stolen from Melbourne\tgalleries over the past\n\t18 months,\tare thought to have ended up in the lucrative art markets\n\tof Europe\tand the US, where supply sources are much harder to\nTo: \nMessage-ID: <005d01c77cc1$4e6fa360$eb4eea20$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nStolen art on global markets\nCorrie Perkin \nApril 12, 2007 \n\nMORE than 40 indigenous paintings, worth hundreds of thousands of dollars\nand stolen from Melbourne galleries over the past 18 months, are thought to\nhave ended up in the lucrative art markets of Europe and the US, where\nsupply sources are much harder to trace.\nInternational buyers, keen to get into one of the world's hottest art\nmovements, are less likely to demand authenticity papers if it helps them\npurchase an indigenous painting. \nMost of the late-night heists have involved more than one person. At each\nrobbery, the galleries' windows or doors have been smashed, activating\nsecurity alarms. The thieves then appear to have grabbed paintings randomly\nbefore making their getaway. \n\nSince December 2005, there have been eight break-ins at different Melbourne\nlocations, including the High on Art Aboriginal Gallery in Armadale, which\nhas been hit four times. \n\nThe other galleries are the Aboriginal Gallery of Dreamings, the\ntwice-burgled Aboriginal Art Galleries of Australia, and last week Kimberley\nArt. \n\nThe robbery last week occurred at about 2am on April 3. Thieves stole 10\nworks valued at a total of $80,000. \n\nDetective Senior Constable Rebecca Hall of Victoria Police said yesterday:\n\"We want to alert art dealers and buyers in relation to these paintings, to\nbe on the look-out if a painting doesn't have a certificate of\nauthenticity.\" \n\nClaude Ullin is the owner of High on Art. \"I'm shattered,\" he said\nyesterday. \n\n\"I can't sleep at night and I leave the mobile phone by the bed expecting to\nget a phone call saying I've been burgled again.\" \n\nMr Ullin said he believed the perpetrators had little or no understanding of\nindigenous art. In the last break-in they left behind a painting worth\n$65,000 that was right next to where they entered the building. \n\n\"It's just a smash-and-grab situation,\" he said. \"If they knew anything\nabout the work at all, they would be taking other primary works.\" \n\nThe alarming spate of thefts has prompted renewed calls for the federal\nGovernment to act quickly in its proposed shake-up of the industry. \n\nYesterday, police released images of the stolen Kimberley Art paintings -\nthe same day the Government's Senate committee inquiry into the indigenous\nart and craft sector held its final hearing. The inquiry's much-awaited\nreport will be released in June. \n\n\"If works are stolen, hopefully it will force people to introduce 21st\ncentury technology methods of tracking artworks as a deterrent,\" Aboriginal\nart advocate Colin McKinnon said.\n\nhttp://www.theaustralian.news.com.au/\n\n\n\n------------------------------\n\nMessage: 11\nDate: Thu, 12 Apr 2007 07:13:26 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Woman caught on camera stealing hospital art\nTo: \nMessage-ID: <005e01c77cc1$4fa51620$eeef4260$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nWoman caught on camera stealing hospital art\n>From staff reports\nArticle Last Updated: 04/11/2007 03:54:21 PM PDT\n\n\nREDWOOD CITY - Police are searching for a woman who swiped $1,600 worth of\npaintings from Sequoia Hospital in Redwood City.\n\nThe theft, which was carried off in the early afternoon of March 21, was\ncaught on tape by a hospital security camera.\n\n\nVideo footage indicated that the woman looked directly into a security\ncamera, then brazenly removed a painting from a hospital hallway wall and\ncarried the art into a nearby women's restroom.\n\n\nThe woman then left the bathroom to remove another painting from the wall\nand walked out of the hospital's north exit with both paintings.\n\n\nThe artwork, both privately owned by local artists, were on display at the\nhospital. The paintings - a landscape and painting of \"a dog looking\nupward,\" according to police - are valued at $800 each.\n\n\nAnyone with information about the crime is asked to contact Redwood City\nPolice at (650) 780-7100.\n\nhttp://www.insidebayarea.com/\n\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 86\n***************************************\n\n"}