{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Joe Nahmias <jello@debian.org>", "subject": "Knowledgetree Public License [KPL] v1.1.1", "body": "Hello -legal,\n\nI recently came across Knowledgetree which is a web-based document\nmanagement system.  There is a (very old) version of it currently in\nDebian that is licensed under the GPL2.  However, it seems that newer\nversions are licensed under what they call the KPL [ see\nhttp://www.knowledgetree.com/KPL/KPL_License ] which is a derivative of\nthe MPL.\n\nOf particular interest is the new Exhibit/Appendix B:\n\n> KnowledgeTree Public License 1.1.1 - Exihibit B\n> \n> Additional Terms applicable to the KnowledgeTree Public License.\n> \n> I. Effect.\n> These additional terms described in this KnowledgeTree Public License \\u2013\n> Additional Terms shall apply to the Covered Code under this License.\n> \n> II. KnowledgeTree and logo.\n> This License does not grant any rights to use the trademarks\n> \"KnowledgeTree\" and the \"KnowledgeTree\" logos even if such marks are\n> included in the Original Code or Modifications.\n> \n> However, in addition to the other notice obligations, all copies of the\n> Covered Code in Executable and Source Code form distributed must, as a\n> form of attribution of the original author, include on each user\n> interface screen (i) the \"KnowledgeTree Document Management Made Simple\"\n> logo and (ii) the copyright notice in the same form as the latest\n> version of the Covered Code distributed by The Jam Warehouse Software\n> (Pty) Ltd. at the time of distribution of such copy. In addition, the\n> \"KnowledgeTree Document Management Made Simple\" logo must be visible to\n> all users and be located at the top right-hand corner of each user\n> interface screen, other than the user log-in page, on which it must be\n> located at the top-center of the user log-in form. Notwithstanding the\n> above, the dimensions of the \"KnowledgeTree Document Management Made\n> Simple\" logo must be at least 200 x 40 pixels. When users click on the\n> \"KnowledgeTree Document Management Made Simple\" logo it must direct them\n> back to http://www.knowledgetree.com. In addition, the copyright notice\n> must remain visible to all users at all times at the bottom of the user\n> interface screen. When users click on the copyright notice, it must\n> direct them back to http://www.knowledgetree.com\n\nThis reads to my inexperienced eye as a particularly heavy-handed form\nof the good old BSD advertising clause, which irrespective of anything\nelse would send this straight to non-free.\n\nI would like to approach upstream about modifying the licensing in\naccordance with the DFSG.  Not being very familiar with the MPL, aside\nfrom this clause, what else do I need to address with them?\n\n\nThanks in advance for your help.\n--Joe\n\nPS - Please cc me as I do not subscribe to -legal\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}