{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Automotive Newsletter July 3, 2007", "body": "July 3, 2007 \nRSS | \nautomotiveThis Week's Highlights:\nFuture CarsHow Segways Work\nThe R8: On the Track With Audi's new Mid-Engine ExoticHow the Smart Car Works\n2008 Maserati GranTurismo Review \nFuture Cars Edition - Sure, the calendar says we're only halfway through 2007, but here at HowStuffWorks we've always got our eyes on the future. In this edition of the Automotive newsletter, we take you forward in time to see car models from 2008, 2009 and even 2010. Check out our future cars \nimage gallery.   This week's trivia question:\nThe man who invented the Smart Car also invented a type of wristwatch that was wildly popular in the 1980s. Can you name that watch? Find out here   \n \nFuture Cars - They're right around the corner and come from every corner of the globe. This article lets you peek into the new-car showroom of tomorrow. Check out the new cars, trucks and SUVs going on sale in the coming months and years, so you can decide whether to buy today or wait for what's on the horizon. \n    This week's video:How Segways Work\n - What if the cars of the future weren't cars at all, but scooter-like vehicles that run on ordinary household electricity? If inventor Dean Kamen has any say about it, the Segway human transporter will be the vehicle of the future. Learn how the Segway works in this video. \n     Also at HowStuffWorks:\n \nThe R8: On the Track With Audi's New Mid-Engine Exotic - Consumer Guide's reviewer took a hot lap in the Audi R8 around the storied Road America race course with professional driver Michael Galati at the wheel. Read his impressions. \n \nHow the Smart Car Works - Already popular in Europe, the Smart Car is small in stature but big on economy. The updated Smart Fortwo is ready for release in 2008, so we could be seeing a lot more Smart Cars in the near future. \n \n2008 Maserati GranTurismo Review - The 2008 Maserati GranTurismo dumps the lumpy form of the outgoing Maserati GT for an aggressive new shape stretched over a longer chassis. Read the full review. \n \n   Coming Soon:\nSpeedometers Tucker Cars   \n\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please unsubscribe here\n or change your preferences using our profile manager.To view this email as a web page, click here.\nHowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved"}