{"category": "ham", "to_address": "Ip-health <ip-health@lists.essential.org>", "from_address": "James Packard Love <james.love@keionline.org>", "subject": "[Ip-health] Money instead of monopolies:  European Patent Forum discussion", "body": "--\n[ Picked text/plain from multipart/alternative ]\n\n\nhttp://www.epo.org/focus/patent-system/scenarios-for-the-future/\nforum.html\n\nDiscussions at the European Patent Forum\n\nMoney instead of monopolies\n\nPatents confer to the holder the right to prevent others from\nselling, offering or using the patented invention. While this was\nseen as the appropriate means of protection for innovation in the\nnineteenth and twentieth centuries, it was felt by many to be\nunsuitable for the collaborative innovation processes of the 21st\ncentury.\n\nPatents are considered by some to block the modern innovation and\ntechnological diffusion process. They see the only solution to this\nproblem in a weakening of patent rights in order to balance the\nsystem. A \"license of right\" regime in which exclusive patent rights\nare transformed into the right to collect license fees - money\ninstead of monopoly - was specifically addressed.\n\nSome regarded the introduction of a prize system parallel to or\ninstead of the patent system as necessary in the pharmaceutical\nsector. Such a system, they argued, would create incentives in the\nmedical field without leading to exaggerated and unaffordable prices\nfor medication. This view was contradicted by the pharmaceutical\nindustry. They feel that the strongest possible patent rights are\nnecessary to compensate the huge investment needed for pharmaceutical\ninventions.\n\n----------------------------------------------\nJames Packard Love\nKnowledge Ecology International\nhttp://www.keionline.org\njames.love@keionline.org\nWashington, DC +1.202.332.2670\n\n\"If everyone thinks the same: No one thinks.\" Bill Walton\"\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}