{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"Powermarketers.com\"<Powermarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nRisk Management 101: Managing Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nEPRI's Value \n\t\t\tand Risk in Energy Markets - Introduction & Principles\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (Jun. 22, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 22, 2007\n\n\nJun 23, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jun. 21, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 21, 2007\n\n\nJun 23, 2007 PowerMarketers Industry Publications\n\n\n\nUtiliPoint Forecasts MDM Market Growth (UtiliPoint.com - Jun. 22, 2007)\n\n\n\nUtiliPoint.com - Jun. 22, 2007 - UtiliPoint International, Inc. hosted four webinars for utilities from November 2006 thru January 2007.\n\n\nJun 23, 2007 PowerMarketers Industry Publications\n\n\n\nThe Next Wave (EnergyBiz Insider - Jun. 22, 2007)\n\n\n\nEnergyBiz Insider - Jun. 22, 2007 - The next wave of hydropower may be tidal power, or harnessing the energy of the oceans and rivers to generate pollution-free electricity.\n\n\nJun 23, 2007 PowerMarketers Industry Publications\n\n\n\nLetters From Readers (EnergyBiz Insider - Jun. 21, 2007)\n\n\n\nEnergyBiz Insider - Jun. 21, 2007 - Below are a few letters we received on topics that appeared in the past few weeks. They capture the essence of how many readers say they feel. \n\n\nJun 23, 2007 PowerMarketers Industry Publications\n\n\n\nTHIS WEEK AT EIA (Volume 9, Issue 25) (June 15 - June 21, 2007)\n\n\n\nEIA - June 21, 2007 - THIS WEEK AT EIA is a list summarizing and providing URLs for every Energy Information Administration (EIA) product released during this week.\n\n\nJun 23, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nPresident Bush's Appearance at Browns Ferry Pays Tribute to Nuclear Energy's Revitalization\n\n\n\nPresident Bush toured the Browns Ferry nuclear power plant in Decatur, Ala., today to acknowledge the completion of the refurbishment one month ago of the 1,150-megawatt Browns Ferry 1 reactor. This was President Bush's third visit to a nuclear power plant since June 2005. Following is a statement from Frank L. 'Skip' Bowman, the Nuclear Energy Institute's president and chief executive officer. ...\n\n\nJun 21, 2007 PR Newswire\n\n\n\nEnergy Transfer Declares Increase in Unitholder Distributions\n\n\n\nDALLAS--(BUSINESS WIRE)--Energy Transfer Partners, L.P. (NYSE: ETP) and Energy Transfer Equity, L.P. (NYSE: ETE) today announced their respective quarterly distribution increases. ETP has approved its new quarterly distribution of $0.80625 per unit ($3.225 annualized) on ETPs outstanding limited partner interests for the quarter ended May 31, 2007. The new quarterly distribution of $0.80625 per ...\n\n\nJun 21, 2007 Business Wire\n\n\n\nPJM Authorizes Construction of $2.9 Billion in Transmission Additions and Upgrades\n\n\n\nThe PJM Interconnection Board today authorized $2.9 billion in electric transmission upgrades and additions, including two major new transmission lines. The authorization came with the Board's approval of changes to PJM's Regional Transmission Expansion Plan, which maintains the reliability of the power supply system serving 51 million people in 13 states and the District of Columbia.\n\n\nJun 22, 2007 PR Newswire\n\n\n\nSantee Cooper Adds 600 MW of Coal-Fired Generation, an Industrial Info News Alert\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). Santee Cooper is finishing permitting for two new 600-megawatt generating units in South Carolina.  For details, view the entire article by subscribing to Industrial Info's Premium Industry News at http://www.industrialinfo.com/showNews.jsp?newsitemID=115332, or browse other breaking industrial ...\n\n\nJun 21, 2007 Internet Wire\n\n\n\nDistributed Energy Systems Ships Wind Turbines To Malaysian Resort Island\n\n\n\nWALLINGFORD, Conn., June 21 /PRNewswire-FirstCall/ -- Distributed Energy Systems Corp. (Nasdaq: DESC) today announced the shipment of two 100 kilowatt (kW) wind power systems for installation this summer on the Malaysian resort island of Pulau Perhentian.     The company, which creates and delivers products and solutions to the emerging decentralized energy marketplace, said the project consists ...\n\n\nJun 21, 2007 PR Newswire\n\n\n\nShanghai Municipal Electric Power Will Add 36 Electrical Substations to Expand Regional Power Grid, an Industrial Info News Alert\n\n\n\nResearched by Industrial Info Resources (Sugar  Researched by Industrial Info Resources (Sugar Land, Texas). Shanghai Municipal Electric Power Company will invest $393 million to build 36 transformer substations during the eleventh five-year period. Once completed, this project will add another 1,623 mega-volt-amperes to the district's current transformer capacity and serve nearly 350,000 users ...\n\n\nJun 22, 2007 Internet Wire\n\n\n\nThe Future is Bright for Envision Solar, LLC, as the Solar Developer Announces a Series of Strategic Alliances Worldwide\n\n\n\nSAN DIEGO--(BUSINESS WIRE)--Envision Solar, LLC of San Diego, a group of visionary architects, solar integrators, builders, and engineers, has developed a revolutionary way of transforming heat-absorbing parking lots into beautiful and efficient solar power plants. The company has recently partnered with Kyocera Solar, Inc., the first of several alliances and projects worldwide for Envision, to ...\n\n\nJun 21, 2007 Business Wire\n\n\n\nEnhanced Natural Gas Pipeline Safety\n\n\n\nGoal of Ameren Illinois Communication Initiative PEORIA, Ill., SPRINGFIELD, Ill. and DECATUR, Ill., June 22 /PRNewswire-FirstCall/ -- People who live and work in the vicinity of natural gas pipelines owned and operated by Ameren in Illinois are now receiving a special pipeline safety pamphlet. 'Natural gas pipelines have a long and enviable record of safety and reliability,' said Jerome Themig, ...\n\n\nJun 22, 2007 PR Newswire\n\n\n\nPeople Power Trumps Dirty Power: Dominion Sees the Light, Pulls the Plug on Three Dirty Coal-Fired Plants\n\n\n\nCo-op America Consumer Action Campaign Successful in Helping Halt Construction of Dominion Coal-fired Plants. WASHINGTON, June 21 /PRNewswire-USNewswire/ -- Co-op America's Climate Change Program today applauded a decision by Dominion Power to cancel three of four new dirty coal-fired power plants originally slated for construction by the company. Co-op America thanked the participants in its ...\n\n\nJun 21, 2007 PR Newswire\n\n\n\n\n\nUtility-line accidents increasing: Workers are asked to call before digging\n\n\n\nJun. 22--The phone and power companies say they have been dealing with a high rate of accidents resulting from people digging up underground service lines. But blackouts and service disruptions aren't the only result of workers and homeowners coming into contact with utilities. Power lines are a lethal threat to cable installers, construction workers and the unaware homeowner trimming a tree or ...\n\n\nJun 22, 2007 Knight Ridder Tribune Business News\n\n\n\nStorms cut power to nearly 9,000 in Western Pa.\n\n\n\nJun. 22--Evening storms Thursday left more than 3,600 Allegheny Power customers without electricity in Westmoreland and Indiana counties, according to a utility Web site and spokesman.  As of 6 p.m., the electricity provider reported 3,112 customers without service in Westmoreland and 522 users without power in Indiana. Overall, 8,800 customers in southwestern Pennsylvania were without power as ...\n\n\nJun 22, 2007 Knight Ridder Tribune Business News\n\n\n\nKeySpan to address plant concerns\n\n\n\nJun. 22--KeySpan Corp., the owner of more than two dozen former utility gas-plant sites on Long Island, yesterday sought to allay concerns about one of the largest sites as community members prepare to meet about it in Hempstead next week.  The Hempstead manufactured natural gas plant, near Intersection and North Franklin streets, spawned a nearly 4,000-by 600-foot plume from the 7.5 acre site, a ...\n\n\nJun 22, 2007 Knight Ridder Tribune Business News\n\n\n\nAlternative energy sellers court Duke\n\n\n\nJun. 22--CHARLOTTE -- Duke Energy said that about 70 alternative energy providers submitted proposals to sell power to the Charlotte-based utility. Duke is accepting proposals as part of the company's plan to offset 1,700 megawatts of conventional electricity, the equivalent of several power plants. It will accept bids until July 27 and plans to negotiate contracts this year for approval by the ...\n\n\nJun 22, 2007 Knight Ridder Tribune Business News\n\n\n\nCharged up over power lines: McKinney: Neighbors protest substation, take fight to PUC\n\n\n\nJun. 21--MCKINNEY -- Moms and dads sat in the City Council chambers until no seats were left; then they stood in the back, their strollers blocking the aisles.  Residents of two neighborhoods had come in force to protest power-line towers that could be built a few hundred feet from their back yards. A power substation covering several acres could also be part of the package.\n\n\nJun 21, 2007 Knight Ridder Tribune Business News\n\n\n\nScientists call for more research on coal\n\n\n\nJun. 21--The federal government should quadruple annual funding for coal research to $190 million to make better use of the nation's resources and minimize the impact on the environment, the National Research Council says. More than half of the nation's electricity comes from coal, a fuel that will help satisfy the country's energy appetite for decades. But the extent to which it will be relied ...\n\n\nJun 21, 2007 Knight Ridder Tribune Business News\n\n\n\nPlan to keep steam utility going as bankruptcy court OKs temporary fix\n\n\n\nJun. 21--A U.S. bankruptcy judge has approved a temporary plan to keep Akron Thermal in business through July 9.  Judge Marilyn Shea-Stonum will allow the indebted steam utility to use cash collateral to pay its 45 employees and resume coal purchases to fuel its boilers. Akron Thermal Limited Partnership filed for bankruptcy protection on Monday, on the eve of an eviction from the plant that ...\n\n\nJun 21, 2007 Knight Ridder Tribune Business News\n\n\n\nPower is back on in Madison Heights\n\n\n\nJun. 21--A circuit problem caused 900 customers in Madison Heights to lose power this morning, said Eileen Dixon, a DTE Energy spokeswoman. She said power was restored by 2:42 p.m.  The problem hit around 9:30 a.m. in the area of 12 Mile Road and Stephenson Highway. The cause of the outage is under investigation.\n\n\nJun 21, 2007 Knight Ridder Tribune Business News\n\n\n\nReview on gas terminal to go on\n\n\n\nJun. 21--WASHINGTON -- Legislation that would have halted federal regulators' review of the proposed Broadwater liquid natural gas terminal in Long Island Sound failed to gain House support yesterday.  An amendment to the House energy bill introduced by Rep. Tim Bishop (D-Southampton) would have barred the Federal Energy Regulatory Commission from using any federal funds next year to continue ...\n\n\nJun 21, 2007 Knight Ridder Tribune Business News\n\n\n\nSenate rejects LNG plant measure: Amendment would have allowed state to stop Dundalk terminal\n\n\n\nJun. 21--WASHINGTON -- The Senate has rejected a measure that would have allowed opponents of the liquefied natural gas terminal proposed for Sparrows Point to defeat the project.  Sen. Benjamin L. Cardin had introduced the measure to restore to states the authority to block new LNG terminals after residents rose up against plans to build the facility on the former site of the Bethlehem Steel ...\n\n\nJun 21, 2007 Knight Ridder Tribune Business News\n\n\n\nEx-Enron official settles for $300,000\n\n\n\nJun. 21--A former top Enron executive who was entangled in a string of company deals that drew the attention of regulators and prosecutors agreed today to pay $300,000 to settle civil allegations.  Jeff McMahon, who replaced Andrew Fastow as finance chief during the company's spiral into bankruptcy in late 2001, neither admitted nor denied wrongdoing as part of the settlement with the Securities ...\n\n\nJun 21, 2007 Knight Ridder Tribune Business News\n\n\n\nJordan braces for heatwave: Electricity demand to reach record levels\n\n\n\nJun. 21--AMMAN -- A huge increase in demand for electricity to power fans and air-conditioning systems is expected over the weekend as the Kingdom faces its first heatwave of the summer.  A hot mass coming from the Arabian Peninsula is expected to reach the country on Friday, raising temperatures in Amman to around 39  C. The heatwave, which is expected to last until the middle of next week, will ...\n\n\nJun 21, 2007 Knight Ridder Tribune Business News\n\n\n\nWind turbine locations sent back to board\n\n\n\nJun. 21--The location of nine turbines in the Oliver Wind II project will be altered from the original plan, requiring a return of the project to the Oliver County Planning and Zoning Commission next week.  Oliver Wind II will go into full-blown construction soon, but changes with landowners and design mean that some of the wind turbines will be moved outside of the previously approved project ...\n\n\nJun 21, 2007 Knight Ridder Tribune Business News\n\n\n\nPSC hiring consultants to study rate options\n\n\n\nJun. 21--State utility regulators said yesterday that they are looking to hire several industry consultants to help them study options for reducing electricity rates in Maryland.  The cluster of studies was required in legislation passed earlier this year in response to concerns about rising electric rates hitting customers of Baltimore Gas and Electric Co.\n\n\nJun 21, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nNew Jersey passes CO2 \"leakage\" legislation supported by Governor\n\n\n\nNew York, New York (Platts)--22Jun2007 The New Jersey Legislature passed the Global Warming Response Act late Thursday evening, requiring mandatory reductions of greenhouse gas emissions to below 1990 levels by 2020, and to 80% below 2006 levels by 2050. The state Department of Environmental Protection will determine how far below 1990 levels emissions will fall when it implements the measure, ...\n\n\nJun 22, 2007 Platts\n\n\n\n2 Major Mid - Atlantic Power Lines Get Key Endorsement\n\n\n\n2 Major Mid-Atlantic Power Lines Get Key Endorsement Marc Levy HARRISBURG, Pa. (AP) - Two proposals for major mid-Atlantic power transmission lines received critical endorsements Friday from the company that operates the mid-Atlantic electricity grid. The proposed high-voltage lines, which would cost more than $2.7 billion, are aimed at bringing surplus electricity from coal-fired power plants in ...\n\n\nJun 22, 2007 Canadian Business Magazine\n\n\n\nAP Centerpiece: 2 Famed Texas Ranches at Odds Over Wind Energy\n\n\n\nAP Centerpiece: 2 Famed Texas Ranches at Odds Over Wind Energy John Porretto June 22, 2007 - 12:35 a.m. SARITA, Texas (AP) - After a century and a half as cordial neighbors, two of the nation's biggest ranches find themselves feuding like the Hatfields and McCoys over wind energy and wildlife and whether the two can coexist. The storied King and Kenedy ranches, which together cover nearly 1.3 ...\n\n\nJun 22, 2007 Canadian Business Magazine\n\n\n\nAlcan signs deal for Kitimat smelter high-voltage substation with ABB Group\n\n\n\n- 5:59 p.m. KITIMAT, B.C. (CP) - Alcan Inc. (TSX:AL) has signed a deal for the design and engineering of a new high-voltage substation that will provide power for planned expansion of its aluminum smelter in Kitimat, the company announced Thursday. Financial details of the agreement with ABB Group were not disclosed. The Kitimat works modernization project was announced last August still needs ...\n\n\nJun 21, 2007 Canadian Business Magazine\n\n\n\nAlpha to bulk up with 1 mil st/year of CAPP coal production\n\n\n\nArch Coal will gain $40 million through the sale of its Mingo Logan Ben Creek mining complex in Mingo County, West Virginia, to Alpha Natural Resources when the deal closes later this year. ANR, in turn, will gain a mining operation that can produce 1 million short tons/year of coal for electric utility and metallurgical customers. The two companies said in Wednesday announcements that they ...\n\n\nJun 21, 2007 Platts\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nCantorCO2e Facilitates First Ever Biomass Emissions Reduction Project in Chile\n\n\n\nLONDON--(BUSINESS WIRE)--CantorCO2e Limited (a subsidiary of Cantor Fitzgerald, L.P.), a leading global provider of financial services to the worlds environmental and energy markets, announced today their facilitation of a groundbreaking transaction involving the first ever Biomass Clean Development Mechanism (CDM) Project in Chile. The multi-million dollar transaction involving contracts between ...\n\n\nJun 21, 2007 Business Wire\n\n\n\nInvensys wins automation order from major Chinese contractor for mega power plant project in India\n\n\n\nFOXBORO, Mass.--(BUSINESS WIRE)--Invensys Process Systems (http://ips.invensys.com) has been selected by Shandong No. 3 Electric Power Construction Corporation (SEPCO III) of China to implement Foxboro (www.foxboro.com) I/A Series distributed control systems (DCS) for a 3,600-megawatt generating station being built in Jharsuguda district, Orissa state, India.\n\n\nJun 21, 2007 Business Wire\n\n\n\nWorld's largest power and desalination project reaches financial close\n\n\n\n- A consortium consisting of Suez Energy International, Gulf Investment Corporation and the Arabian Company for Water & Power Projects, has completed limited recourse financing for the Marafiq Independent Water and Power Project (IWPP) in Jubail, North-East of Saudi Arabia. The Marafiq IWPP is a 23-year BOOT (build, own, operate, transfer) contract for a 2750 MW combined cycle power station and a ...\n\n\nJun 21, 2007 Power Engineering\n\n\n\nAlstom and Statoil to Jointly Develop Project for Chilled Ammonia-Based CO2 Capture for Natural Gas in Norway\n\n\n\nLEVALLOIS-PERRET, France--(BUSINESS WIRE)-- Regulatory News: Alstom (Paris:ALO) has signed a joint development contract with Norwegian gas and oil company Statoil, to test Alstoms chilled ammonia technology for CO2 capture from flue gases particular to natural gas combined cycle (NGCC) power plants. The objective of the agreement covers the design and construction of a 40MW test and product ...\n\n\nJun 21, 2007 Business Wire\n\n\n\nChina's now worst on carbon dioxide\n\n\n\nBEIJING // It was only three months ago that international energy officials revised a prediction that China would surpass the United States as the world's largest producer of greenhouse gases by 2009 or 2010. It could happen, they warned, as early as the end of this year. That might have been conservative. China's emissions of carbon dioxide, the most significant greenhouse gas, have exceeded ...\n\n\nJun 21, 2007 Baltimore Sun\n\n\n\nThe Status of the Nuclear Energy Market: Past, Present and Future Overviews\n\n\n\nLYON, France--(BUSINESS WIRE)--Reportlinker.com announces that a new market research report related to the Worldwide nuclear industry is now available to its catalogue. Nuclear Energy Report http://www.reportlinker.com/p049670/nuclear-energy.html Introduction \" Nuclear power is back on the menu for 20 countries as a potential base load generator \" In 2007 there are 442 nuclear power reactors in ...\n\n\nJun 21, 2007 Business Wire\n\n\n\nGE-Hitachi Nuclear Energy Submits ESBWR to U.K. Regulators for Generic Design Assessment\n\n\n\nWILMINGTON, N.C.--(BUSINESS WIRE)--GE-Hitachi Nuclear Energy (GEH) today submitted its ESBWR reactor design to government regulators in London to initiate the generic design assessment (GDA) process as the United Kingdom considers whether to build a new fleet of reactors to help meet its energy and emissions-reduction requirements. GEH is seeking design acceptance confirmation from U.K.\n\n\nJun 21, 2007 Business Wire\n\n\n\nGerman firm ventures into power project in Pakistan\n\n\n\n- Pakistan's top motorcycle manufacturer and a leading German diesel engine provider have agreed to set up a commercial power plant in the country's central Punjab province to produce 450 MW. Atlas Honda Limited of Pakistan and MAN Diesel Group of Germany will build the electricity generation unit near the city of Shiekhupura, 75 kilometres west of the Punjab capital Lahore, in two phases.\n\n\nJun 21, 2007 Power Engineering\n\n\n\nGain an Insight into Existing and Proposed Gas Pipelines within Australia\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c60207) has announced the addition of Australia Gas & Power Wall Map to their offering. This is a detailed wall map showing the Australian Gas & Electrical Infrastructure. The map displays: Insert maps detailing the major basins supplying gas into and within Australia Existing and proposed gas ...\n\n\nJun 21, 2007 Business Wire\n\n\n\nSparton to Evaluate Uranium Extraction Possibilities From Waste Material in South Africa With Akanani Investment Corporation\n\n\n\nSparton Resources Inc. (TSX VENTURE: SRI)(the \"Company\") reported today that it has signed an Exclusivity and Confidentiality Agreement (the \"ECA\") with Akanani Investment Corporation (Proprietary) Limited (\"AIC\") to cooperate jointly and exclusively with AIC in a long term program for the evaluation of the possibility of extracting uranium and other valuable metals from waste coal ash and other ...\n\n\nJun 21, 2007 Internet Wire\n\n\n\nGEH submits ESBWR to U.K. regulators\n\n\n\n-- GE-Hitachi Nuclear Energy (GEH) submitted its ESBWR reactor design to government regulators in London to initiate the generic design assessment (GDA) process as the United Kingdom considers whether to build a new fleet of reactors to help meet its energy and emissions-reduction requirements. GEH is seeking 'design acceptance confirmation' from U.K. nuclear energy regulators-- the Health and ...\n\n\nJun 21, 2007 Power Engineering\n\n\n\nInvensys wins automation order for mega project in India\n\n\n\n-- Invensys Process Systems has been selected by Shandong No. 3 Electric Power Construction Corporation (SEPCO III) of China to implement Foxboro I/A Series distributed control systems (DCS) for a 3,600-MW generating station being built in Jharsuguda district, Orissa state, India. The plant is one of the largest power plants under construction in India. The DCS contract will encompass an I/A ...\n\n\nJun 21, 2007 Power Engineering\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}