{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "An EXCLUSIVE report on Pentagon planning and the war in Iraq.... tonight on the CBS Evening News with Katie Couric, anchoring tonight from Philadelphia. ", "body": "\n\n\nCBSNews.com\n\n\n \n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\nQUOTE OF THE DAY\"Some people never go crazy. \n      What truly horrible lives they must lead.\" - Charles Bukowski \n\n\nDID YOU KNOW?Frank Baum named \"Oz\" after a file cabinet \n      in his office. One cabinet was labeled \"A to N,\" and the second was \n      labeled \"O to Z.\" \n      \nTONIGHT ON THE CBS \n      EVENING NEWSHere is an early preview of what we \n      are planning for tonight's CBS EVENING NEWS from Anchor and Managing \n      Editor, Katie Couric... Hi everyone, Tonight, \n      we'll be broadcasting from Philadelphia, home of the Independence Hall, \n      the Liberty Bell and a vibrant population that is the sixth-largest in the \n      United States. Philly is also known as the city where American democracy \n      was born - and tonight we'll have a cultural and historical view of a city \n      that has contributed so much to our country's history. This city, \n      which was home to the country's first hospital - founded by Benjamin \n      Franklin in 1751 - now is having a health-care crunch that's particularly \n      acute for pregnant women and the care they're getting when it counts. \n      I'll take a closer look at this story for you. Before that, \n      the news of the day. To start out our broadcast, David Martin will \n      have an exclusive report on Pentagon planning and the war in Iraq. \n      Meanwhile, are Democrats blinking first on the prospect of a withdrawal \n      deadline? Sharyl Attkisson will fill you in. A different \n      kind of debate is heating up on the streets - and on the Web. An \n      anti-informant \"stop snitching\" campaign now has a high-tech edge. And \n      this is infuriating federal prosecutors, Bob Orr will explain. \n      As hurricane season approaches, National Weather Service \n      forecasters warn that they expect between 13 and 17 tropical storms this \n      year, with at least seven of them becoming hurricanes. Is the Gulf Coast \n      ready? Hari Sreenivasan will examine New Orleans' levee system and \n      whether it is equipped to survive a major storm. We've been \n      following the story of the two whales stranded 60 miles up the Sacramento \n      River in California. Sandra Hughes will tell you about the \n      obstacles still in their way en route to their ocean home - and the hope \n      spectators have for their safe return. Finally, we'll come back to \n      Philadelphia, where we will settle down with a cheese steak and channel \n      some memories from decades past in the City of Brotherly Love. \n      I hope you'll join us. Katie For \n      more information on these stories, please click on the following \n      links: Dems Back Off Deadline For Troop Pullout\nClick Here Experts Predict \n      Active Hurricane Season Click Here And here's a look at \n      one of the stories we're working on for Wednesday's broadcast:\nStarting Wednesday, a two-part look at \"Insurance Outrage\"... Some \n      people just can't GET coverage, while others HAVE it until they really \n      NEED it. This story and much more, Wednesday, on the CBS Evening \n      News. If you would like more \n      information on the broadcast, please click on the following address and \n      e-mail us: evening@cbsnews.com \n\nTONIGHT ON DAVID \n      LETTERMANNBA commentator/basketball legend Charles Barkley \n      joins Dave tonight along with actor Seth Rogen... Plus, musical \n      guest Michael Martin Murphey! \n\nWEDNESDAY MORNING ON THE \n      EARLY SHOWHarry Smith, Hannah \n      Storm, Julie Chen and Russ Mitchell anchor THE \n      EARLY SHOW from New York. Dave Price \n      will bring us the weather. Along with the top news of the day, \n      we will also have the following stories: CELLULITE \n      SOLUTIONS: Why do women get cellulite and men don't? Well, you can \n      blame estrogen. But there is hope! If you have cellulite, you know all \n      about trying to hide it. But now some new treatments on the market may \n      help it go away. EARLY SHOW Consumer \n      Correspondent Susan Koeppen will join us with the news every woman \n      wants to hear -- \"How to get rid of that cellulite.\" HAPPILY \n      EVER AFTER, PART 3: Our special series, Happily Ever After, \n      continues Wednesday morning with an incredible story of love and \n      parenting. The Luchsingers met in college, married after graduation and \n      are now dealing with the challenge of three children, one of whom is \n      autistic. For Kadi and Todd, like all parents, they have to balance taking \n      care of their kids with all of life's other demands. Nearly 85% of parents \n      with special needs children end up divorcing... but Kadi and Todd are \n      battling the odds and making it work. MONEY MATTERS: STUDENT \n      LOANS: Getting a loan to help pay for college is nothing new. But \n      there are certain things you should look out for before you, or your \n      child, signs on that dotted line. How can you choose an offer that will \n      leave you worry free? Our financial advisor Ray Martin will join us \n      with tips on what to look for in a student loan. BEST YOU CAN \n      BE: SUMMER BATHING SUITS: Summer is just a few weeks away and for many \n      of us, that means time spent poolside and at the beach! But dreaded \n      bathing suit season comes with its pitfalls. How can you find a suit that \n      both fits and flatters? Style expert Rachael Zalis will help you find the \n      best suit for your body as swimsuit season gets underway. SUSAN \n      CRANDELL: THINKING ABOUT TOMORROW: You have probably heard the term \n      midlife crisis. It typically refers to the time when a person in their \n      forties and fifties realize that they are no longer young and start to \n      feel that perhaps they haven't really lived. In her new book, Thinking \n      About Tomorrow: Reinventing Your Midlife, author Susan Crandell tells \n      us how you can fulfill dreams that you may have been holding on to or how \n      you can create new ones in your middle years. Wednesday morning, Crandell \n      will join us with her advice. If you would like more information \n      on any of these stories or the broadcast, please click on the following \n      address and e-mail us: earlyshow@cbs.com \n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved.   \n"}