{"category": "ham", "to_address": "\"MJ Ray\" <mjr@phonecoop.coop>", "from_address": "\"Ondrej Certik\" <ondrej@certik.cz>", "subject": "Re: slepc license", "body": "> Permission to distribute binary packages at least.  While you're asking,\n> why not ask for it as free software?  Even one with an obnoxious ad\n> clause (so they get their attribution) would be an improvement.\n>\n> Hope that helps,\n\nThat helps a lot. Thanks. I asked the upstream and they seem not to be\nagainst using the old BSD license with the ad clause, so that maybe\nthe next version will be distributed with that license.\n\nI realized, that 2.3.2 version that I am going to package at the\nmoment contains the license below, which is not free, but can go to\nnon-free. The problem above is only for the 2.3.3 version.\n\nOndrej\n\nCopyright (c) 2002-2006, Universidad Politecnica de Valencia, Spain\n\n This  software is provided 'as is', with absolutely no warranty, expressed  or\n implied.  Any use is at your own risk. In no event shall the authors be liable\n for  any direct or indirect damages arising in any way out of the use of  this\n software.\n\n The  user will acknowledge (using references [1] or [2]) the  contribution  of\n SLEPc  in any publication of material dependent upon the use of  the  package.\n The  user  will reasonably endeavour to notify the authors of the  package  of\n this publication.\n\n The  user can modify the code but, at no time shall the right or title to  all\n or  any  part  of  this  package pass to the user. Contributions  are  welcome\n relating  to any alteration or addition made to this package for the  purposes\n of  extending the capabilities or enhancing its performance.  Credit  will  be\n given in the documentation for contributed code.\n\n This  package (or a modified version) may not be sold. It is freely  available\n and  it can be redistributed provided that redistribution comprises all  files\n including this copyright notice. No license is required for research use.  For\n commercial use, written permission must be granted by the authors.\n\n\n [1] V. Hernandez, J. E. Roman and V. Vidal (2005),\n     SLEPc: A Scalable and Flexible Toolkit for the Solution of\nEigenvalue Problems\n     ACM Trans. Math. Softw. 31(3), 351-362.\n\n [2] V. Hernandez, J. E. Roman and V. Vidal (2002),\n     SLEPc Users Manual, Technical Report DSIC-II/24/02,\n     Universidad Politecnica de Valencia, Spain.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}