{"category": "spam", "to_address": "avcooper@speedy.uwaterloo.ca", "from_address": "Instant.Booster@speedy.uwaterloo.ca", "subject": "Get 1000's of Highly Targeted visitors to your web site or affiliate web site overnight", "body": "This brand new advertising tool has never been used\n\n\n\n\n\n\nCan you afford to lose 300,000 potential customers per year ?\nHow would You like to divert 1000s of fresh,new visitors daily to Your web site or affiliate web site fromGoogle, Yahoo, MSN and others At $0 cost to you...?\nNever seen before! Brand new for 2007!\nIf you don't try this incredible software, you are just plain off your rocker.\n...iNSTANT BOOSTER diverts 1000s of fresh,new visitors daily to Your web site or affiliateweb site from Google, Yahoo, MSN and othersat $0 cost to you!\n...No matter what you are selling or offering -INTSANT BOOSTER will pull in hordes of potential customers to your website - instantly!\n...Automatically Get 1000's of other High Ranking websites eagerly linking to your web site no questionsasked.\n...your web site will quickly achieve Ultra High LinkPopularity on the Major Search Engines\n...you'll get 1000's of Highly Targeted visitors to yourweb site or affiliate web site overnight\niNSTANT BOOSTER WILL:------------------------Instantly boost your website's traffic--Instantly boost your sales--Instantly boost your income\nFeeling desperate by the lack of traffic coming to your site ?Tried every imaginable \"guaranteed traffic\" system ?\nIf your sales are lagging, you could score a success for your business byimplementing iNSTANT BOOSTER.\nThe truth is you do NOT need 30 different systems bringing a hand full of trafficto your site - you only need ONE surefire method thatwill bring thousands of potential customers to your site.\nWell, I've got great news for you.\nOne day I had an idea. An amazing idea actually.\nWhat if you could drive 1000s of customers to your website from the majorsearch-engines that are exclusively looking for your product/offer for free ?\nWhat about an instant number one ranking for your keywords, for free ?!\nI have developed a program that will automatically do this for you- it's called iNSTANT BOOSTER.\nUnlike any other advertising software iNSTANT BOOSTER willinstantly divert 1000s of fresh new visitors daily to your web site oraffiliate web site from Google, Yahoo, MSN and others - FOR FREE!\n\nFor Full details please download the attached .html file\n \n \nTo Unsubscribe please click here"}