{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 6/23/07 - The Biggest Story Of Our Generation", "body": "June 23, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\nRunning Out Of Oil\n\nWho Needs A Private Airbus 380?\n\nMy Favorite Solar Power Stock\n\n-----\n\nIs the world running out of oil?  In a strict sense, yes.  The earth's\nnatural process of manufacturing the stuff is very slow, and our ability\nto use it up is relatively rapid.  Strictly speaking, we've been running\nout since the first commercial oil well was drilled in Titusville,\nPennsylvania in 1859.\n\nThe better question is, \"Are we in danger of running out of oil in the\nnear future?\"  And the answer?  Depends who you listen to.\n\nIf you'd listened to Shell geologist M. King Hubbert, who devised the Peak\nOil Theory back in 1974, you'd have expected the peak of oil production to\ncome in 1995.\n\nObviously it didn't.\n\nBut peak oil talk is back in the news these days, mainly because, as in\n1974, the high price of gas at the pump hurts.  Adding to the worries are\nthe questions about international politics, mainly in the Middle East. \nWhile back in the 1970s, the U.S. depended on other countries for a third\nof its oil needs, today the number has grown to 56%.  And the world is no\nmore stable now than it was then.\n\nSo people are worried.\n\nBut a review of the current wisdom on the question reveals no consensus. \nThere are too many variables - too many unknowns.\n\nWe know that oil production is in decline in 33 of the 48 largest\noil-producing countries.  We know that the peak of oilfield discoveries\noccurred way back in 1965.  And we know that global demand has been\ngrowing at a rate of about 2% in recent years, driven mainly by increased\ndemand from China and India, and to a lesser extent from emerging markets\nin Africa.\n\nThe U.S. Department of Energy predicts the peak of oil production will\noccur in 2037.  BP says the world still has enough \"proven\" reserves to\nprovide 40 years of consumption at current rates.  But you know these\ninstitutions have an agenda to pursue.  In fact, it appears that most of\nthe participants in the global oil economy have a vested interest in\npushing peak numbers out as far as possible.\n\nThe oil companies, led by ExxonMobil, Royal Dutch Shell, PetroChina and\nBP, all have an interest in inflating their \"proven reserves.\"   \nIt makes their companies, and thus their stocks, more valuable.\n\nDitto for the producer countries. They all want to be perceived to be as\nrich as possible, both to encourage investment by oil companies and to\nassure their citizens that the future is bright.\n\nConsumer countries as well want to reassure their citizens that the\noutlook is equally rosy.  Thus the sanguine reassurances of the U.S.\nDepartment of Energy.\n\nSo who do you trust?\n\nI have a brother-in-law with a doctorate in geology who flies around the\nworld advising companies and governments where they can best find oil.  He\ntells me there's plenty more of the stuff left in the ground, and that new\nextraction techniques can easily keep our planet running on oil for the\nrest of our lives.  But he doesn't address the costs of getting that oil\nout of the ground.  And he's too smart to make a guess about peak oil.\n\nAs I said, there are too many variables.\n\nSo in the end we're left trusting the market.  The market, remember is\nalways right, because it integrates the opinions of all the participants\nwho have a financial interest in that market.\n\n-----\n\nBut before I get to that, let me take a detour into the world of\nperception, to comment on a few \"thin reeds\" that may shed light on the\npicture.\n\nExhibit A is the United Arab Emirates, which in the past thirty years has\nridden a wave of oil money to become the 38th biggest economy in the\nworld.  In 2006, the country's GDP grew at a rate of 35%.  And the money\nis flowing!  Its capital, Dubai, has an indoor ski mountain.  F1 racing is\ncoming.  The world's richest horse race takes place there.  And Tiger\nWoods, who won the inaugural Dubai Classic this year, was recently hired\nto design a golf course/resort in Dubai (its ninth).\n\nExhibit B is the news from the Paris Air Show that an individual \"not from\nthe U.S. or Europe\" had placed an order for a new Airbus 380 superjumbo to\nuse as a private jet.  The cost is over $300 million, and the smart money\nsays that's Arab oil money.\n\nExhibit C is the action in Congress, where Democrats this week tried to\nimpose nearly $29 billion in taxes on oil companies.  Why?   \nBecause that's where the money is.  But punitive economics is bad\neconomics.  Remember the Windfall Profits Tax? According to a 1990\nCongressional Research Service study, the windfall profits tax (in place\nfrom 1980 to 1988) \"reduced domestic oil production from between 3 and 6\npercent, and increased oil imports from between 8 and 16 percent.\"  I\ndon't think that's what we want.\n\nAll these exhibits, and more, combine to create a picture of an industry\nenjoying good times.  But they make me wonder if we're nearing a peak of\noil money today.  As a contrary thinker, I'm wondering if it's brightest\njust before the lights go out.\n\n\n----- Advertisement -----\n\nIncreased Profits For 13 Cents Per Day!\n\nWhen we could see that Apple Computer's earnings momentum was shooting\nthrough the roof in October 2004, we named it Stock of the Month. It was\nselling for a shockingly low $35 per share. Today, (adjusted for a 2-for-1\nsplit) it has turned a $10,000 investment into $43,000.\n\nThere are 16 more Stocks of the Month I could name that have handed us an\n88% average profit per stock over the past two years.\n\nJoin Cabot Stock of The Month and get in on the next stock that explodes,\nlike past picks Intuitive Surgical (up 600%), Broadvision (up 670%), and\nAmazon (up 1,290%). Sign up today and you'll get immediate access to all\ncurrent recommendations, along with the free bonus report, Sector of the\nYear.\n\nTo learn more, please visit this link:\nhttp://cabotmail.net/t/202785/13148861/86/0/\n\n-----\n\nWhich brings me back to the market.  Today, oil stocks are strong across\nthe board.  Whether they're finding it, refining it or transporting it,\ncompanies in the business are prospering today, and the stocks say the\ngood news will continue at least a few months longer.\n\nIn short, there's no worry about peak oil at present.\n\nOf the five investment advisory letters Cabot publishes, four have\ninvestments in oil companies.  The profits, like the oil, are flowing.\n\nThe one letter that doesn't have an oil stock is the one I edit, Cabot\nStock of the Month.  As the title suggests, it picks only one stock per\nmonth, so it's particularly choosy.\n\nAnd the stock I chose to play the energy bull market is not an oil stock\nbut an alternative energy stock, First Solar (FSLR).\n\nHere's what I wrote back at the end of March.\n\n\"There are four big reasons why solar cells will be in high demand for\nyears to come. One, they provide non-polluting electricity, so they help\nto reduce greenhouse gases that contribute to global warming. Two, they\ntake advantage of the free energy that the sun provides, thus avoiding the\npolitical complications of Middle East oil. Three, costs are falling fast,\nas innovations in the field reduce the cost of manufacturing and increase\nthe efficiency of solar cells. And four, governments around the world,\nworking to reduce pollution and greenhouse gases, are introducing and\nextending incentives that will accelerate adoption of the technology. All\ntold, we can't think of a single downside to the technology.\n\nAfter waiting some 30 years since the first \"oil shock,\" we're confident\nthat solar power is finally going to fulfill its promise. And we're very\nexcited about the investment opportunities in the industry,\n\nToday, there are at least eight public companies in the industry. Most\nboast triple-digit revenue growth, thanks in large measure to subsidies by\nGermany that stimulated demand in recent years. Most are profitable, with\nprofit margins ranging from 11% to 20%. And with one exception, they're\nbased in either China or the U.S. Our favorite of the group is First\nSolar, for two big reasons.\n\nFirst is that it's the strongest stock of the group. Second is that First\nSolar has a technological advantage. While most other companies build\ntheir cells on slices (wafers) of silicon ingots, First Solar builds its\ncells using thin-film technology. Doing this, it uses just 1% of the\nsilicon used by other manufacturers, a fact that frees it from serious\npricing pressures felt by the others, for whom silicon represents some 45%\nof the product's total cost. These pressures stem from the fact that\nsilicon is the main component of semiconductors made by companies like\nIntel, Motorola and SanDisk, and these companies pay a premium price for\npremium product, leaving the solar companies paying through the nose for\nthe silicon needed to grow their business.\n\nAnother advantage to First Solar's thin-film technology, which uses\ncadmium telluride (CdTe) as the semiconductor, is that it remains very\nefficient at generating electricity at higher temperatures, while\ntraditional silicon cells see their performance degraded as temperatures\nrise. Also, cadmium and tellurium are abundantly available in today's\nworld; tellurium is produced during the refining of copper, while cadmium\nis derived from zinc smelting.\n\nThe company's cells, interestingly, aren't designed for home or office\ninstallation; they're designed to replace power plants!\"\n\nSince that was written, First Solar has reported its first quarter\nresults, and they were terrific.  Revenues grew 392% to $67 million, while\nearnings hit $0.07 per share, up from a loss of $0.08 the year before. \nLooking ahead, analysts expect a profit of $0.52 per share this year and\n$1.12 next year.\n\nAnd the stock is up 51% since my recommendation.\n\nI have no target on the stock; the sky's the limit.  And right now, I'm\nfeeling pretty good about this one because First Solar is still the\nstrongest solar power stock in the market.\n\nAnd that's impressive because the high times have attracted more IPOs to\nthe sector in recent months, so the competition for money in the sector is\nescalating.  New players in the sector include LDK Solar (Chinese), Yingli\nGreen Energy Holding (Chinese) and Solaria Energia (Spanish).\n\nBut First Solar keeps on attracting new buyers!  One key reason - and this\ngoes back to the fact that it uses far less silicon in its solar cells -\nis that First Solar promises to offer grid-parity pricing of $1.00 to\n$1.25 per watt by 2010 or 2012, while maintaining operating margins of\n25%.\n\nGrid-parity means electricity generated by solar power cells will cost no\nmore than electricity generated by traditional fossil fuels.   \nAnd isn't that the Holy Grail?\n\nSo should you run out and buy the stock?  Not necessarily.  Investing is\nnot that easy.  Now up above 80, the stock is at risk of pulling back to\nits 25-day moving average at 70, or even its 50-day down at 68.  A\nwell-earned correction that took the stock down to that neighborhood would\ncertainly present a lower-risk buy point.\n\nBut it may not come.  And I say this because Thursday's defeat of the\nextra taxes on oil companies also closed the door (at least for a while)\nto nearly-matching incentives for alternative energy (taxing one industry\nto support its competitor).   This was not good news for alternative\nenergy investors.  But the stock shrugged it off, climbing to new highs on\nFriday!\n\nMy interpretation:  There are bigger forces at work here than the U.S.\nCongress . . . and that's a good thing.\n\nWe've got growing global demand for energy, driven above all by the\nbooming economies of China and India.  We've got a growing demand for\nclean power, to combat global warming and - in China in particular - to\ncombat pollution.  We've got peak oil . . . somewhere.  And we've got\npolitical instability that threatens our growing need for imported oil.\n\nCombine that \"perfect storm\" with improving technologies that promise\nprogressively lower costs of solar energy, and I think you've got a\nwinner.\n\n-----\nEditor's Note:\n\nThe status of First Solar is followed in every issue of Cabot Stock of the\nMonth.  To keep up to date - on this and other select stocks (like CROX\nand NCTY) consider a no-risk trial subscription today.   \nYou'll get the complete story on my favorite stock every month.   \nYou'll get precise, unhedged buy-hold-sell advice in every issue.   \nAnd if you subscribe now, I promise to sign you up in time to catch next\nTuesday's issue!  To get started, simply click the link below.\n\nhttp://cabotmail.net/t/202785/13148861/86/0/\n\n-----\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n-----\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=202785&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}