{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 116", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. UK. Antiques expert found not guilty\n      (Museum Security Network Mailing list)\n   2. SAFE and the Bayside Historial Society Announce the Second\n      Event in its Spring 2007 Lecture Series: \"Preservation\n      Imperative\" (Museum Security Network Mailing list)\n   3. Peru. Roban lienzos de v?rgenes en iglesia de Jun?n\n      (Museum Security Network Mailing list)\n   4. Nolde's Nadja has reappeared\n      (Museum Security Network Mailing list)\n   5. Peru. Roban esculturas de incalculable valor de catedral San\n      Pedro de Lur?n (Museum Security Network Mailing list)\n   6. Italy. PALERMO: FURTO INTERNO BIBLIOTECA COMUNALE\n      (Museum Security Network Mailing list)\n   7. Canada. Bedard?s father pointed finger in art-theft case\n      (Museum Security Network Mailing list)\n   8. North Korea. Golden Buddha Stolen From Haeju Museum\n      (Museum Security Network Mailing list)\n   9. UK. Bungling thieves wreck Banksy murals\n      (Museum Security Network Mailing list)\n  10. Netherlands: Restitutions Committee made the headlines on\n      several occasions because of a claim filed by the Goudstikker\n      heirs. Annual report recently published.\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Tue, 15 May 2007 08:04:40 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] UK. Antiques expert found not guilty\nTo: Museum Security Network Mailinglist \nMessage-ID: <46494D78.20902@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nAntiques expert found not guilty\nA TV antiques expert accused of stealing two paintings from an elderly woman's home has been found not guilty.\n\nMichael Hogben, 54, of Dymchurch Road, Hythe, had denied one count of theft between 2 June and 4 November, 2005.\n\nHe appeared before Canterbury Crown Court on Monday where the case was dropped following legal argument.\n\nMr Hogben is known for his appearances on television shows such as the BBC's Bargain Hunt and ITV's Real Deal and is also an auctioneer and valuer.\n\nhttp://news.bbc.co.uk/\n\n\n\n------------------------------\n\nMessage: 2\nDate: Tue, 15 May 2007 17:21:41 -0400\nFrom: Museum Security Network Mailing list \nSubject: [MSN] SAFE and the Bayside Historial Society Announce the\n\tSecond\tEvent in its Spring 2007 Lecture Series: \"Preservation\n\tImperative\"\nTo: msn-list@te.verweg.com\nMessage-ID:\n\t<2C069458-3A5A-4F44-BFF9-B1B88E6E10E9@savingantiquities.org>\nContent-Type: text/plain; charset=WINDOWS-1252; delsp=yes;\n\tformat=flowed\n\n\n\n\nSAFE/Saving Antiquities for Everyone and the Bayside Historical  \nSociety Announce the Second Event in its Spring 2007 Lecture Series:  \n\"Preservation Imperative\"\n\nWho Owns the Past?\nCultural Heritage and the Law in the 21st Century\nwith Lucille Roussin\n\nSunday, May 20th at 3:00 pm\n\nThe Bayside Historical Society\nThe Officers? Club\nFort Totten Park\n208 Totten Avenue\nBayside, NY  11359\n\nSuggested donation: $3.00\n\nWhile antiquities are as old as civilizations, a body of law  \nconcerning antiquities began relatively late, primarily in the last  \ncentury. There are two types of laws that govern the transfer of  \ncultural objects, national laws and international law. By referencing  \nlegal constructs we attempt to address relevant issues in cultural  \nproperty legislation, such as: How may we distinguish the term  \n\"cultural heritage\" from \"cultural property?\" One expert has  \ndistinguished \"heritage\" as being essentially a collective and public  \nnotion, belonging by definition in the realm of public interest and  \nheld for the public good. Cultural \"property\" embraces many objects -  \nvirtually anything that can be collected and displayed, but is more  \nnarrowly defined as antiquities. This lecture will discuss how the  \nfield of law is being defined and refined as more and more legal  \nissues as to the trade in objects of cultural heritage arise.\n\n???????\n\nLucille A. Roussin is the founder and director of the Holocaust  \nRestitution Claims Practicum at the Benjamin N. Cardozo School of Law  \nin New York City, where she teaches a seminar, Remedies for Wartime  \nConfiscation. She also teaches a course on \"Art, the Law and  \nProfessional Ethics\" at the School of Graduate Studies at the Fashion  \nInstitute of Technology. She is an associate with the firm of  \nMcCallion & Associates and earned her law degree in 1996 from the  \nBenjamin N. Cardozo School of Law, where she was a Belkin Scholar.  \nShe was Deputy Research Director of the Art and Cultural Property  \nTeam of the Presidential Commission on Holocaust Assets and was an  \nassociate in the Art and International Law Practice Group at Herrick,  \nFeinstein LLP in New York City. In 2001, she negotiated the first  \nrestitution of a rare Jewish ritual object to a private family in the  \nUnited States.\n\n???????\n\nFor more information, please telephone (718) 352-1548\n\nor visit us on the Web at\nhttp://www.baysidehistorical.org/home/home.html\nand\nhttp://www.savingantiquities.org/event.php?eventID=67\n\n\n\n------------------------------\n\nMessage: 3\nDate: Thu, 17 May 2007 10:46:59 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Peru. Roban lienzos de v?rgenes en iglesia de Jun?n\nTo: Museum Security Network Mailinglist \nMessage-ID: <464C1683.7010200@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nRoban lienzos de v?rgenes en iglesia de Jun?n\n\nPinturas y otros objetos valiosos fueron robados en la madrugada del s?bado. Robos sistem?ticos a los templos se presentan en varias regiones del pa?s.\n\nUn grupo de delincuentes sustrajo, a plena luz del d?a, valiosos lienzos, madera tallada en pan de oro y otros objetos valiosos de una de las iglesias m?s antiguas de Jun?n, ubicada en San Juan de Jarpa en Chupaca.\n\nSeg?n informaci?n de un medio local, el crimen tuvo lugar al promediar las 05:30 horas del s?bado, cuando los ladrones violentaron la puerta de la iglesia, escalaron la pared y por el techo, sacaron lienzos en ?leo especial de Santa Rosa y la Virgen del Rosario, maderas talladas en pan de oro y otros objetos de valor.\n\nPoco antes, los pobladores de la zona avistaron a tres sospechosos que se desplazaban a bordo de un auto, pero no les tomaron importancia. M?s tarde, dar?an cuenta de lo sucedido. El presidente de la comunidad de Misquipata, Abraham Aquino Camargo, fue quien hizo la denuncia. La comunidad de Chupaca ha reclamado a la Polic?a identificar y ubicar a los ladrones.\n\nPero no solo Chupaca y Jun?n se han visto afectados por la codicia de los facinerosos, ya que hace unos d?as la Polic?a de Trujillo inform? de una serie de robos que evidencian la presencia de grupos organizados con v?nculos internacionales.\n\nhttp://www.peru21.com\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Thu, 17 May 2007 10:47:05 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Nolde's Nadja has reappeared\nTo: Museum Security Network Mailinglist \nMessage-ID: <464C1689.9090600@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nUNBELIEVABLE: NOLDE'S NADJA HAS REAPPEARED\n\nPress release from: Ketterer Kunst\nPublished date: 05-15-2007 16:10 PM - CET\n\nMunich, 10 May 2007, (kk) - For nearly 30 years the whereabouts of Emil Nolde?s world-famous portrait ?Nadja? was unknown. Now it is up for sale at Ketterer Kunst?s auction Modern Art on 12 June 2007 in Munich, a world sensation.\n\nThe story reads like the plot of a detective story: In the late 1970s the painting was stored in the depot of a shipping agent from where it disappeared. It was rediscovered in an attic by an unnamed art collector late in 2006 after the death of his daughter, who had presumably played a role in the theft. The art collector arranged for the painting to be handed to the police in the Ladenburg/Rhein-Neckar district for clarification of ownership. By this time, however, the statutory period of limitation for the theft had expired.\n\nThe provenance turned out to be extraordinary: According to Emil Nolde?s own records, the oil painting, which he had painted in 1919, belonged to the murdered foreign minister of the Weimar Republic and son of the AEG founder, Dr. Walther Rathenau. We now know that Nolde must have made a mistake here. It is certain, however, that the work belonged to Dr. Ernst Rathenau, the founder and former owner of the publishing companies Euphorion and Ernest Rathenau, New York. He considered ?Nadja?, which had been in the possession of the Rathenau family since the 1920s, the most important painting in his collection. When Dr. Ernst Rathenau had to emigrate to the USA, his secretary saved ?Nadja? from the National Socialists by depositing the oil painting in a safe deposit box at the bank Merck Finck & Co in Berlin. ?Nadja? was thus spared the fate of so many other works, which did not survive the War and the period after National Socialism.\n\nThe small portrait gives evidence of the extraordinary talent of Emil Nolde, who is also praised as a ?colour magician? and who was declared a degenerate artist by the National Socialists. It is furthermore an important piece of German history and art history.\n\nAll the more reason for Robert Ketterer to be proud to present such an important work - it is estimated at ? 1,2 to 1,8 million - in his sale. The firm?s owner and auctioneer remarked: ?It was by no means easy to obtain this work, which was much sought-after among all the important international auction houses. Our house?s reputation over the past 50 years, particularly in the field of Expressionist art, convinced the heirs, however. It was, after all, Ketterer, then at the Kunstkabinett in Stuttgart, who arranged the first auction of works by Expressionist artists.?\n\nNoteworthy is also that Nolde?s ?Nadja? is one of the first works valued over ? 1 million to be auctioned in Germany since the partial standardisation of the directive on the resale right in the EU. A comparable work has hitherto only come on the market in the USA or in London.\n\nFurther information about Emil Nolde and ?Nadja?: www.kettererkunst.com/emil-nolde-nadja.shtml.\n\nhttp://www.openpr.com/\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Thu, 17 May 2007 10:47:09 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Peru. Roban esculturas de incalculable valor de\n\tcatedral San Pedro de Lur?n\nTo: Museum Security Network Mailinglist \nMessage-ID: <464C168D.6050904@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nRoban esculturas de incalculable valor de catedral San Pedro de Lur?n\n\nLima, may. 15 (ANDINA).- Tres esculturas religiosas de incalculable valor y que forman parte del Patrimonio Cultural de la Naci?n, as? como otros objetos de oro y plata, fueron robados de la Catedral San Pedro de Lur?n, denunci? el p?rroco El?as Zavaleta.\n\nLa madrugada del viernes ?ltimo los ladrones se llevaron las esculturas de la Virgen Inmaculada, del Cristo Crucificado y de San Francisco de As?s, im?genes talladas en madera que datan del siglo XVIII y, que por su antig?edad, tienen un gran valor en el mercado negro que trafica piezas de arte.\n\nOtra pieza hurtada es un ni?ito Jes?s de la imagen de la Virgen de la Candelaria. Estas reliquias cuentan incluso con c?digos del Instituto Nacional de Cultura pues son consideradas como patrimonio nacional.\n\n?Seguramente se trata de una banda de ladrones que se especializa en este tipo de robos de estos bienes culturales?, anot? el p?rroco en di?logo con Andina.\n\nLos malhechores tambi?n hurtaron recuerdos y milagros de oro y plata que los fieles suelen depositar en los templos como actos de fe, cuyo valor tampoco ha sido determinado.\n\nSeg?n inform? el religioso, los delincuentes ingresaron trepando un muro de la calle San Pedro e ingresaron por la puerta lateral del templo, forzando las cerraduras con una ?pata de cabra?.\n\nPese a las valiosas reliquias y joyas que guarda, el templo no cuenta con personal de vigilancia propio sino s?lo con la seguridad que brinda la Polic?a y el Serenazgo que rondan las calles de Lur?n.\n\nZavaleta se?al? que ante estos hechos ahora tendr? que pedir seguridad especial para el templo. Agreg? que est? a la espera de los resultados de la investigaci?n policial, luego de haberse tomado las huellas digitales dejadas por los ladrones.\n\nLa Catedral de San Pedro de Lur?n fue construida en el a?o 1703 y declarada por el Instituto Nacional de Cultura como monumento hist?rico nacional en 1972.\n\n(FIN) ART/RRC\n\nhttp://www.andina.com.pe\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Thu, 17 May 2007 10:47:14 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Italy. PALERMO: FURTO INTERNO BIBLIOTECA COMUNALE\nTo: Museum Security Network Mailinglist \nMessage-ID: <464C1692.1090503@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nPALERMO: FURTO INTERNO BIBLIOTECA COMUNALE\n\n(PRIMA) PALERMO - Nella mattinata di ieri, un funzionario del Comune di Palermo sporgeva formale denuncia presso la Stazione Carabinieri Palermo Pretoria per alcuni furti avvenuti all?interno della Biblioteca Comunale, ubicata in Piazza Casa Professa. I furti sarebbero avvenuti tra il mese di settembre del 1997 ed il mese di marzo del 2007. Nel contesto i ladri hanno asportato alcune opere d?arte risalenti al XIX secolo che si trovavano temporaneamente custodite presso una stanza della citata biblioteca, in attesa del completamento dei lavori di restauro che interessano l?immobile. Sull?episodio indagano i Carabinieri della Compagnia Piazza Verdi.\n(PRIMA)\n\nhttp://primapress.it\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Thu, 17 May 2007 10:47:19 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Canada. Bedard?s father pointed finger in art-theft\n\tcase\nTo: Museum Security Network Mailinglist \nMessage-ID: <464C1697.3050804@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nBedard?s father pointed finger in art-theft case \nThe Gazette\nTuesday, May 15, 2007\n\nIt was Myriam Bedard's father who first signalled the alarm that her boyfriend, Nima Mazhari, was in possession of stolen paintings, the Crown alleged today.\n\nIn January 2004, Pierre Bedard sent an anonymous letter and photos of paintings to Kathe Roth, daughter of the late artist Ghitta Caiserman-Roth, to denounce Mazhari for alleged theft and possession  of the works, prosecutor Mario Dufresne told a Quebec Superior Court jury.\n\nRoth did not take action until the Montreal police fraud squad in April 2004 received a photos of four paintings allegedly stolen and opened an investigation, Det. Sgt. Alain Lacoursire of Montreal police, told the court.\n\nThe photos were provided to police by a Bedard family friend, the court was told.\n\nWhen questioned by police that month, Mazhari said he had seen the paintings but \"never had them in his possession,\" Lacoursire said.\n\nSitting in the prisoner's dock, Mazhari, dressed in a  black shirt and trousers listened intently as did the black-clad Bedard, sitting in the audience and taking notes.\n\nDufresne outlined his case before Justice Wilbrod-Claude Decarie and jury of 10 men and women against the Iranian-born artist, charged with theft and possession of 20 paintings by Caiserman-Roth.\n\nMyriam Bedard, who has not been charged in this case, won two gold medals for Canada in 1984.\n\nhttp://www.canada.com\n\n\n\n\n------------------------------\n\nMessage: 8\nDate: Thu, 17 May 2007 10:47:28 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] North Korea. Golden Buddha Stolen From Haeju Museum\nTo: Museum Security Network Mailinglist \nMessage-ID: <464C16A0.6080100@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nGolden Buddha Stolen From Haeju Museum, North Korea\n\nNational Safety Agency rounds up an arrest\nBy Kwon Jeong Hyun, of China\n[2007-05-16 18:02 ] \t\n\nOn the 11th, robbers raided the Haeju Historical Museum in Haejoo, North Hwanghae, stealing golden statues of Buddha and ancient Korean pottery worth a large amount, an inside source disclosed.\n\nThe source said, ?On the night of 11th, golden statues of Buddha and ancient Korean pottery were stolen from Haeju Museum. The exact identity of which Buddha statues and rare artifacts were stolen has not been revealed, however, it appears the goods were rather important considering a special order was given to the border guards and the National Safety Agency has become involved.?\n\nHaeju Historical Museum opened in 1949 and has maintained its heritage for 60 years. The museum displays a collection of ancient Korean pottery from the area and a variety of golden Buddha statues. This museum falls under the same category as the top 5 museums located in North Korea including the Central Historical Museum in Pyongyang and Kaesong Museum, Sariwon Museum and Chongjin Museum.\n\n?If the thief escaped Hwanghae on the day of the raid, then he will be difficult to catch. However, if that is not the case, there is a high chance that the thief will be caught within the next couple of days,? said the source.\n\nHe said, ?An order has already been made to strictly control the smuggling routes around the border of Shinuiju.? He added, ?Stealing historical artifacts and exporting them out of the country is a crime punished with death.?\n\nFollowing the food crisis in the 90s and early 2000, there were many cases where military officials, security agents and the elite frequently stole historical artifacts. The whole city was affected especially if there were many people living in the area who had inherited historical artifacts from ancestors.\n\nHowever, for the past 3~4 years, there was a decrease in stolen articles as the number of ancient artifacts had been depleted and furthermore because authorities immediately punished those who stole and sold the goods overseas with capital punishment.\n\nHowever, as this case shows, stealing a number of articles from museums has continued. In particular, imitations of artifacts have been sold outside the country, and North Korean authorities are facing complaints from foreign buyers. Consequently, there have been cases where affiliated persons have also been executed.\n\nA defector who has experience in selling antiques said, ?In 1993, a picture of a Great Monk Seosan was sold in Hong Kong but then returned to North Korea after it was discovered to be a fake. Parties concerned were punished.?\n\nHe said, ?Precious artifacts are either sent to Pyongyang to be exhibited at the Central Historical Museum or stored separately. A curator affiliated to Mansudae Art Institution then makes a copy and sends it to either the country or, in most cases, puts it on display in Pyongyang.?\n\nHe said, ?Even if the Japanese buy $10,000 worth of Nihontou (Japanese swords) with the carved seal of a Japanese Emperor, there are still many people who want to possess artifacts from the Chosun Revolutionary Museum. Even I went around until my feet were worn out carrying antiques to make money. However, most of these goods were imitations copied by Mansudae Art Institution.?\n\nLast year, there was one case where a group of 22 people were caught stealing tombstones off royal tombs. Though it is difficult to transport these tombstones, since they weigh a minimum of 500kg and as much as 2-3tons, once they are secretly transported to China, the tombstones sell at a very high price.\n\nThe moment North Korean authorities discovered the case, Chinese authorities were contacted and a cooperative investigation begun. The tombstones were redeemed from a storage area in Dandung. At the time, the Chinese dealers were given a heavy fine and the organizer of the North Korean exports, a national security agent, was known to have committed suicide.\n\nhttp://www.dailynk.com\n\n\n\n\n------------------------------\n\nMessage: 9\nDate: Thu, 17 May 2007 10:47:23 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] UK. Bungling thieves wreck Banksy murals\nTo: Museum Security Network Mailinglist \nMessage-ID: <464C169B.9060009@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nBungling thieves wreck Banksy murals\nBy Ben Leach, Evening Standard 16.05.07\n\nThieves have made a botched attempt to steal murals by street artist Banksy. They had intended to neatly chisel the slabs of concrete painted with images of flying rats off a wall in Whitechapel.\n\nBut instead they tore a great rift in the concrete, destroying tens of thousands of pounds worth of street art. Local resident Jennifer Floyd, 34, said: \"It is a great shame. There are loads of Banksys in the area but they are slowly disappearing. Thieves are resorting to ripping stuff off the walls at every opportunity... Even though they failed the first time, ruining the mural, they had the nerve to try it again, and ruined the second one.\"\n\nBanksy's art is fetching ever-increasing amounts. Owners include Brad Pitt, Angelina Jolie and Jude Law. Last month a Banksy piece sold for ?288,000 - 20 times its estimate. Late last year thieves using an angle grinder cut out a section of wall in Gloucester Gardens, Paddington, bearing a Banksy stencil of a rat bouncing a beach ball under a \"No Ball Games\" sign and put it on eBay for ?20,000.\n\nDesigns that featured on Blur's Think Tank album were removed from walls in Deptford, and the \"No Swimming\" sign in St James's Park has been stolen. Banksy pieces have also been painted over accidentally.\n\nhttp://www.thisislondon.co.uk/\n\n\n\n\n------------------------------\n\nMessage: 10\nDate: Tue, 15 May 2007 07:28:08 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Netherlands: Restitutions Committee made the headlines\n\ton\tseveral occasions because of a claim filed by the Goudstikker\n\theirs. Annual report recently published.\nTo: \nMessage-ID: <002e01c796b1$e23488e0$a69d9aa0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\n\nPress release: Restitutions Committee presents report on 2006\n\nThe Hague, 11 May 2007 \n\nRESTITUTIONS COMMITTEE PRESENTS REPORT ON 2006 \n?\nTHE HAGUE ? The Restitutions Committee made the headlines on several\noccasions because of a claim filed by the Goudstikker heirs. Apart from\nthat, the committee handled a total of 35 applications for restitution, as\nthe recently published annual report shows. \n?\nThe 2006 annual report of the Advisory Committee on the Assessment\nof?Restitution Applications for Items of Cultural Value and the Second World\nWar ? Restitutions Committee in short ? was published on 11 May 2007. Last\nyear, the committee was repeatedly mentioned in the press mainly in\nconnection with the settlement of the Goudstikker case. The committee had\nissued a recommendation about the case to the Dutch State Secretary for\nCulture, Education and Science in December 2005.\nBut even apart from the Goudstikker claim, 2006 proved to be an\nexceptionally busy year. The committee handled a total of 35 applications\nfor restitution, of which 17 were new. In 2006, the committee issued\nrecommendations on such cases as a claim to objects from Anne Frank's estate\nand a claim from the descendants of Czech art lover Arthur Feldman.1[1] The\nrelatively large number of new claims was partly attributable to the\nexpiration of the term for filing restitution applications, which was ?\nstrictly speaking ? to end on 4?April 2007. It has become clear since then\nthat claims for stolen items of cultural value can still be filed. \n?\nFive years of research and advice\n2006 also marked the fifth anniversary of the Restitutions Committee. In the\ncourse of these five years, 56 claims were filed. Between 2002 and 2006, the\ncommittee issued recommendations on 33 restitution applications. As of 11\nMay 2007, this number has risen to 78 submitted cases and 40 recommendations\nmade. These reports related to more than 600 items of cultural value from\nthe Dutch National Art Collection, varying from valuable articles for daily\nuse to paintings by 17th-century Dutch masters. The scope of the cases also\nvaried, ranging from claims to a single work of art to applications for the\nrestitution of several hundreds of items. To date, the committee has\nrecommended that approx. 420 items of cultural value be returned. \n?\nBesides the recommendations, the annual report also contains information\nabout the investigation and the comprehensive assessment of the facts that\nprecede each recommendation. As of 11 May 2007 the number of claims the\nRestitutions Committee is addressing stood at 38. Although there was\nuncertainty for a while about the continued existence of the Restitutions\nCommittee, it became apparent on 4 April 2007 that the committee would be\nable to continue its work for at least another three years.\n?\nFurther information\nFor more information on the 2006 annual report, please contact Evelien\nCampfens, secretary/rapporteur of the Restitutions Committee, telephone\n+31(0)70 376 59 93.\nIn addition, you will find current recommendations, annual reports and other\ninformation about the committee on our website:\nwww.restitutionscommittee.org\n?\n\n_______________________________________\\\nRestitutions Committee?\nLange Voorhout 9\nP.O. Box 556\n2501 CN? THE HAGUE\nThe Netherlands?\nT +31 (0) 70 376 5992\nF +31 (0) 70 362 9654\nE info@restitutiecommissie.nl\nwww.restitutionscommittee.org\n_________________________________\n\n\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 116\n****************************************\n\n"}