{"category": "ham", "to_address": "\"John Christie\" <jc@or.psychology.dal.ca>", "from_address": "\"Marco B\" <tymester@gmail.com>", "subject": "Re: [R] repeated measures regression", "body": "Hi John,\n\nI have collected a few methods for doing this in a very empyrical\nfashion. I've asked a few questions on r-help about them, and got\nmixed responses. You can find the archived thread at:\n\nhttp://tolstoy.newcastle.edu.au/R/e2/help/07/05/16660.html\n\nThe responses and linked resources might be of some interest to you,\ntoo... Basically, my understanding is that ANOVA procedures are the\nmost powerful ones, provided you can meet their  assumptions. MANOVA\nprocedures do not require sphericity, but your design should be\nbalanced and time intervals should be equally-spaced. Finally,\nassumptions for lme(r) models are the most forgiving, but their power\nis also reduced.\n\nI may be wrong on my conclusions, though, so I'm looking forward to\ncomments on this, especially on the lme(r) approaches...\n\nRegards,\n\n-- \nMarco B\n\n\nOn 5/17/07, John Christie  wrote:\n>\n> How does one go about doing a repeated measure regression? The\n> documentation I have on it (Lorch & Myers 1990) says to use linear /\n> (subj x linear) to get your F.  However, if I put subject into glm or\n> lm I can't get back a straight error term because it assumes\n> (rightly) that subject is a nominal predictor of some sort.\n>\n> In looking at LME it seems like it just does the right thing here if\n> I enter the random effect the same as when looking for ANOVA like\n> results out of it.  But, part of the reason I'm asking is that I\n> wanted to compare the two methods.  I suppose I could get it out of\n> aov but isn't that built on lm?  I guess what I'm asking is how to\n> calculate the error terms easily with lm.\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}