{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Max X. Puckett\" <xph@pop.com.br>", "subject": "LOOK FOR THESE CONDITIONS TO PERSIST OVERNIGHT WITH AN INCREASE IN HIGH LEVEL CLOUDS AFTER MIDNIGHT.", "body": "ERMX Grabs Edge Of US Trade With China And Moves Into Nitride Devices!\n\nEntreMetrix Inc. (ERMX)\n$0.16\n\nCongress's push to increase trade agreements with China gives ERMX huge\nadvantage as they enter joint venture to manufacture Nitride Devices for\nmilitary, energy and technological solutions in China. This is huge. Get\non ERMX Monday!\n\nThis same information is available in other file formats including the\nXML based RSS and CAP formats.\nANY REMAINING SHOWERS AND THUNDERSTORMS WILL BE QUITE A BIT WEAKER THAN\nSTORMS FROM EARLIER THIS EVENING.\nLINGERING ISOLATED TO SCATTERED SHOWERS AND THUNDERSTORMS WILL CONTINUE\nTHROUGH THE LATE EVENING HOURS ACROSS THE SOUTHERN HALF OF CENTRAL\nALABAMA.\n\nMOSTLY CLOUDY WITH ISOLATED RAIN SHOWERS NORTHEAST OF YAKUTAT.\n\nThis same information is available in other file formats including the\nXML based RSS and CAP formats.\n\nMOSTLY CLOUDY SKIES THIS EVENING WITH OCCASIONAL SHOWERS.\n\nMOSTLY CLOUDY WITH ISOLATED RAIN SHOWERS NORTHEAST OF YAKUTAT.\n\nMOSTLY CLOUDY WITH ISOLATED RAIN SHOWERS NORTHEAST OF YAKUTAT. MOSTLY\nCLOUDY WITH ISOLATED RAIN SHOWERS NORTHEAST OF YAKUTAT. LINGERING\nISOLATED TO SCATTERED SHOWERS AND THUNDERSTORMS WILL CONTINUE THROUGH\nTHE LATE EVENING HOURS ACROSS THE SOUTHERN HALF OF CENTRAL ALABAMA.\n\nTHE STEESE HIGHWAY FROM TWELVE MILE SUMMIT TO FOX IS ESPECIALLY LIKELY\nTO GET SHOWERS. This file is usually updated about every two minutes.\nEXPECT CLOUDY SKIES WITH LIGHT RAIN SHOWERS TO CONTINUE PUSHING IN FROM\nTHE EAST.\n\nCONDITIONS CONTINUING THROUGH THE EVENING.\nWINDS DIMINISHING LATE THIS EVENING. AREAS OF DENSE FOG REDUCING\nVISIBILITY TO ONE QUARTER MILE OR LESS AT TIMES. MOSTLY CLOUDY SKIES\nTHIS EVENING WITH OCCASIONAL SHOWERS.\nTHE STEESE HIGHWAY FROM TWELVE MILE SUMMIT TO FOX IS ESPECIALLY LIKELY\nTO GET SHOWERS. STRONGEST WINDS NEAR LYNN CANAL. WINDS DIMINISHING LATE\nTHIS EVENING.\nCLOUDY SKIES AND LIGHT WINDS. This file is usually updated about every\ntwo minutes.\n\nLOOK FOR THESE CONDITIONS TO PERSIST OVERNIGHT WITH AN INCREASE IN HIGH\nLEVEL CLOUDS AFTER MIDNIGHT.\n\nLOOK FOR THESE CONDITIONS TO PERSIST OVERNIGHT WITH AN INCREASE IN HIGH\nLEVEL CLOUDS AFTER MIDNIGHT. RAINFALL AMOUNTS WILL BE UP TO ONE-QUARTER\nAN INCH.\n\nCLOUDY SKIES AND LIGHT WINDS. ROUGHLY ALONG AND SOUTH OF A LINE FROM\nEUTAW TO CLANTON. CLOUDY SKIES AND LIGHT WINDS. STRONGEST WINDS NEAR\nTAIYA INLET. RAINFALL AMOUNTS WILL BE UP TO ONE-QUARTER AN INCH. ANY\nREMAINING SHOWERS AND THUNDERSTORMS WILL BE QUITE A BIT WEAKER THAN\nSTORMS FROM EARLIER THIS EVENING. STRONGEST WINDS NEAR LYNN CANAL.\nThis same information is available in other file formats including the\nXML based RSS and CAP formats. ROUGHLY ALONG AND SOUTH OF A LINE FROM\nEUTAW TO CLANTON. This same information is available in other file\nformats including the XML based RSS and CAP formats.\nMOSTLY CLOUDY SKIES WILL GRADUALLY GIVE WAY TO PARTLY CLOUDY SKIES THIS\nEVENING OVER NORTHEAST PRINCE WILLIAM SOUND. AREAS OF DENSE FOG REDUCING\nVISIBILITY TO ONE QUARTER MILE OR LESS AT TIMES. This file is usually\nupdated about every two minutes. MOSTLY CLOUDY SKIES WILL GRADUALLY GIVE\nWAY TO PARTLY CLOUDY SKIES THIS EVENING OVER NORTHEAST PRINCE WILLIAM\nSOUND.\n\nSTRONGEST WINDS NEAR LYNN CANAL.\nMOSTLY CLOUDY SKIES THIS EVENING WITH OCCASIONAL SHOWERS.\n\nCONDITIONS CONTINUING THROUGH THE EVENING. MOSTLY CLOUDY SKIES THIS\nEVENING WITH OCCASIONAL SHOWERS.\n\n"}