{"category": "ham", "to_address": "speakup@braille.uwo.ca", "from_address": "Spie Smith <bdsmith@buncombe.main.nc.us>", "subject": "possible error", "body": "I might have found an error, but I am not sure.  I just have a few\nquestions about the following article.  \n\nhttp://live.gnome.org/Orca/UbuntuFeisty\n\nHere are the points of concern I have.  Please look at this and see if\nI have misunderstood, or help me with getting a stable install.  \n\nFirst of all, I did get the live cd: \n\nhttp://cdimages.ubuntu.com/daily-live/current/feisty-desktop-i386.iso\n\nNow, I have it on a cd and have tried several times to get the\nfollowing to happen.  \n\nIt boots just fine, but, when it stops, orca does not come up talking.\nI have to launch it independently of all the other startup stuff by\nusing the alt f2 run application dialog.  \n\nNow, when I booted, I did this: \n\nWhen the drive stopped spinning the first time, after the short spin,\nI immediately pressed f5.  This should, it is stated, cause the list\nof accessibility functions to appear.  I really wonder if it does,\nand, please forgive me for saying this.  Here's why.  \n\nWhen I look into the isolinux directory on the ubuntu 7.04 disk, I see\nnothing about accessibility mentioned there.  In fact, take a look at\nthe following file.  \n\n/mnt/cdrom/isolinux/f5.txt\n\nThis is with the ubuntu disk in your drive, and running something else\non the machine.  If it gives a list of what is to appear on the screen\nwhen this function key is pressed, look closely.  It actually mentions\nsomething about boot parameters for machines with special hardware\nconfigurations, not accessibility.  \n\nNow, when you are in this menu, you are supposed to hit 3 to give\nfocus to the orca screen reader.  Here's another concern: It does not\nseem to work.  I may be wrong, but I would appreciate some help here.\nIf that description of those special hardware configurations is on\nthere, it is impossible to press 3 to give foxus to an element that is\nnot around anywhere.  \n\nNow, something must happen, but not the whole thing.  When I just let\nubuntu boot up, then try to access orca, it does not work right at\nall.  In fact, it is impossible to get anything permanent out of it.\nIt allows you to set up part of the accessibility, but not all.  \n\nNow, when I press 3 from the whatever's there after pressing f5, there\nis a change.  Even though orca does not come up talking, I get the\nconfiguration gui when I launch it.  This is strange, indeed.  \n\nNow, here's another concern I have.  When you finish setting up orca,\nnone of the settings appears to be taking effect.  In fact, I appear\nto be losing controls, gradually.  How strange on a live cd.  The\nother day, I was able to get to the volume control for the master\nsystem volume.  It does not exist anymore.  Just last night, I was\nable to log in and out and all this with no problem, causing the\nsettings I had in the orca configuration dialog to take effect, not\ntoday, won't do it.  I cannot get the \n\nquit...\n\noption on the system menu to do a thing other than send me back to the\ndesktop. \n\nNow, the last point of concern is this.  On the article page, it says\nto use the control tab to get out of the city combo box when you have\nyour city and region selected.  Won't do it.  Once you get in there,\nthere's no way out except to shut the entier machine down, losing your\nsettings and all.  How do you really get that installer to work? \n\nIf anyone out there has had better results than this, I would\nappreciate some help.  If this cannot be accomplished, it will be\nnecessary to wait for the next stable release of the system I am using\nto come out, then re-invent all the things that have been done in the\ngraphical environment.  I would really like to have some help,\nhowever.  \n\n\n\nThanks. \n\n\n\n\n-- \nSpie Smith: C.S.F.C.\nComputer Scientist For CHRIST\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}