{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "\"Charles Bryan\" <lexexeterpdvub@exeterpd.com>", "subject": "Check out the wonders of pound melting", "body": "\nA simple and safe way to weigh less\n\n\n\n\n\nAnatrim – The latest and most enchanting lose flesh product is now easily available – As seen on CNN\n\n\n\nDo you see redundant body kilograms kill a plenty of people every year? We know that you hate the unsightly appearance of those people and the social bias against them. \n\nMoreover, you can not resist a siege of your fatal eating habits. If this all sounds familiar, then we got something to propose to you!\n\n\n\n\n\nWe are proudly introduce you Anatrim, the recent product for the reduction of your body’s extra weight. The astonishing thing about Anatrim is it improves the quality of your life by repressing your feeling of hunger and giving you joyful spirit. Note what people write on this product:\n\n\n\n\n\n\"It is great! \n\n\nI stopped gorging everything easy to reach and watching TV \n\n\nI became rather more interested in doing sport.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I’m more fit now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nMaria H., Las Vegas\n\n\n\n\n\n\n\"I tried some passive weight reducing, but with little result. I could not restrain my ravenous hunger. \n\n\nOne day I was told about Anatrim the media by and I was really effected by the information.\n\n\n I had tried to use it, and my wife said I had changed for the better since then, 3 months later. \n\n\n34 pounds have gone away and it’s still far to an end! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nCharley Mock, Colorado\n\n\n\n\n\nAnatrim helps your brain to realize that you don't need that much food. It raises your spirit up, provides you with additional energy, and attacks useless kilos. Great thanks to its mighty original formula!!\n\n\n\nFind out latest intelligence on this great product now!\n\n\n\n"}