{"category": "ham", "to_address": "debian-mirrors@lists.debian.org", "from_address": "Josip Rodin <joy@entuzijast.net>", "subject": "Re: Can I get some help, please?", "body": "On Sat, May 19, 2007 at 09:18:22PM -0400, Carl T. Miller wrote:\n> I'm trying to write a script to efficiently make a mirror\n> of a Debian archive, and I need some help understanding the\n> structure of the archives.\n\n[I went back to this after answering the rest]\n\nIt looks like you didn't see the existing script. Here it is:\nhttp://www.debian.org/mirror/anonftpsync\n\n> I'm sure there is a document that answers these questions.\n> Would you please tell me where I can find the answers?\n\nhttp://www.debian.org/mirror/\n\nFor setting up new mirrors, make sure you notice\nhttp://www.debian.org/mirror/ftpmirror\n\n> Is there a way to tell whether or not the current archive\n> or mirror is being updated?\n\nThe project/trace directory.\n\n> Is there a way to tell when the current archive or mirror\n> was last updated?\n\nThe timestamp of the file named as the mirror you are using in the\nproject/trace directory.\n\n> Is there a standard for using soft links and hard links\n> within the filesystem?\n\nYes. Both are used, I think.\n\n> Is there a way to tell when the available dists change?\n\nThere is no single marker, other than an additional file/directory in the\ndists/ directory.\n\n> Is there a way to tell when the available archs change?\n\nDitto. The Contents-*.gz files could be an easy way to scan for changes.\n\n> What is the purpose of each of the directories?\n\nNow this is getting ridiculous... read the Debian FAQ?\n\nhttp://www.debian.org/doc/FAQ/ch-ftparchives.en.html\n\nMaybe some question is not answered, but please ask non-generic questions\nafter reading that.\n\n> How are source files distinguished from others?\n\nWith filename extensions.\n\n> What all files are required to fully mirror a single distro?\n> \n> What are the minimal files required for installation only of\n> a single distro?\n\nWe do not support mirroring a single distro; there's no observable purpose\nto it. If you want a single distribution, mirror its CD/DVD images.\n\n> What all files are required to fully mirror a single arch?\n\nhttp://www.debian.org/mirror/ftpmirror#partial\n\n> What are the minimal files required for installation only of\n> a single arch?\n\nHmm. I don't think we have this documented anywhere properly, because\nthe netinst CD gets all the debs of the base system, and optionally gets\nwhatever is in the tasks that the user selects. Those various sets of\npackages are fairly intricate...\n\n> Are there a set of files required by the original archive\n> and official mirrors (that would let me test to find a\n> limited mirror)?\n\nAs we only support removal of architectures, you can simply check the fourth\ncolumn of http://www.debian.org/mirror/list if you want to find how each\nmirror is limited (which architectures are missing).\n\n-- \n     2. That which causes joy or happiness.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-mirrors-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}