{"category": "spam", "to_address": "\"Subscriber\" <cruiseca@flax9.uwaterloo.ca>", "from_address": "\"Prostate Cancer Information\" <rlzdavxywb@sunnyrunning.com>", "subject": "Important Prostate Cancer Information - Be Proactive - Get the Facts", "body": "Important \nProstate Cancer Information - Be Proactive - Get the Facts \nDiscover IMPACT Prostate Cancer and Make a Decision \n  to Learn More\nLearning you or someone you love has androgen-independent prostate \n  cancer (AIPC) can be very difficult. But today there's more hope than ever for \n  men with AIPC. In fact, by taking an active role in learning about the disease \n  and the treatment options available, you can do more to fight your disease than \n  you may realize. An important step toward managing your condition is learning \n  how to talk openly and work closely with your healthcare team, and enrolling \n  in IMPACT Prostate Cancer can help you do just that.\nTo \n  enroll in IMPACT Prostate Cancer\nEnroll and receive:\n* Doctor Discussion Guide\n  * Personalized, Informative E-mails\n  * Treatment Options\n  * Lifestyle Tips\n  * Links to Online Resources\nIMPACT Prostate Cancer is a program designed to help patients \n  and their loved ones cope with AIPC. It provides access to reliable information \n  that may help you understand the disease, available treatment options, and practical \n  tools so you can work as a partner with your healthcare providers.\nBy enrolling in IMPACT Prostate Cancer today, and completing \n  the simple questionnaire, you will receive:\n*A complimentary, personalized Doctor Discussion Guide—this \n  customized Guide is tailored to your needs based on the responses you provide \n  in your enrollment form, and will give you an overview of your various healthcare \n  team member's roles and responsibilities as well as suggested questions to help \n  you have open, informed conversations with your healthcare team. \n  *A series of personalized E-mails with valuable information to help you: \n  *Communicate with your healthcare team \n  *Understand androgen-independent prostate cancer \n  *Learn about treatment options that may help you manage your condition if you \n  are no longer responding to hormonal therapy \n  *Learn helpful, practical ways for you to cope with AIPC and continue living \n  your life to the fullest \nTo enroll \nin IMPACT Prostate Cancer\n\n  By taking advantage of all that IMPACT Prostate Cancer has to offer, you'll \n  benefit from your personal Doctor Discussion Guide, a series of personalized, \n  educational E-mails, and other resources to help you manage AIPC—so enroll \n  today!\nSincerely, \n  The IMPACT Prostate Cancer Team\nThe health information contained herein is provided for general \n  educational purposes only. Please consult your healthcare professional if you \n  have any questions about your health or treatment.\nTo \n  stop receiving announcements\nsanofi-aventis\n  300 Somerset Corporate Bld.\n  Bridgewater, NJ 08807-2854\n(C) 2002-2006 sanofi-aventis U.S. LLC. All rights reserved.\n  Legal Disclamer Information and Prvacy Policy\nTo \n  view our Legal Disclamer\nTo view \n  our Prvacy Policy\nTo view Questions \n  or Comments\nCertain links on this page will take you to Web sites that are \n  not owned or controlled by sanofi-aventis.\nSanofi-aventis is not responsible for the accuracy of the information \n  contained on third-party Web sites and does not recommend or endorse the content \n  provided on these Web sites.\nLast Updated: April 2006\n  US.DOC.06.03.171\n\n\n\n\n\n______________________________________________________\n\nNo More Mail\nor write to:\nTurnCoach\n\n2309 Bel Air Rd.,Suite 311\nFallston, MD 21047\n"}