{"category": "ham", "to_address": "<ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Lifestyle Newsletter April 19, 2007", "body": "\nhowstuffworks® | lifestyle  April 19, 2007\nRSS\n   How Laughter Works \n Human beings love to laugh: the average adult laughs 17\ntimes a day. For us it seems so natural, but the funny thing is that humans are\none of the few species that laugh. Laughter is actually a complex response\nthat involves many of the same skills used in solving problems. In this\narticle, learn how laughter works and why laughter can make people healthier\nand happier.\nAlso at HowStuffWorks\n How Espresso Works - It's a great pick-me-up in the morning and a perfect finish\nto a good meal. Ever think about trying to make this stuff at home? Find out\nwhat espresso actually is and how to make a perfect shot every time.\n \nHow Gossip Works - More than 200 years ago, Catherine the Great's enemies\ninvented a bit of gossip about her that has persisted until today. Learn how\ngossip gets passed off as fact, about the different types of gossip and why\ngossip is so ubiquitous.\n \nHow Karate Works - Karate is an incredible art form, built on the concept of\nmerging body and mind into a defensive weapon. See how practitioners of karate\nuse this technique to break wood and cinder blocks with their hands and feet.\n   \nThis Week's Video \nHow Skydiving Works - Imagine falling out of an airplane -- on purpose\n-- and heading toward the ground at 120 miles per hour. Welcome to the world of\nskydiving. In this video, watch as HowStuffWorks' founder, Marshall Brain, explores\nthe incredible thrill of skydiving.  This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click here.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved\n"}