{"category": "ham", "to_address": "debian-vote@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Josip Rodin <joy@entuzijast.net>", "subject": "Re: Request for GR: clarifying the license text licensing / freeness issue", "body": "On Mon, Apr 23, 2007 at 12:37:16PM +1000, Ben Finney wrote:\n> > Yes, the social contract says that the Debian system and all of its\n> > components will be fully free; but for all practical intents and\n> > purposes (heh), the accompanying license texts are as much a\n> > \"component\" of the \"system\" as is the media the system is\n> > distributed on.\n> \n> I don't see the relevance of this. If you're referring to the\n> GPL-specific exception for source code\n\nNo, I'm not, I'm referring to the second sentence in the document,\n'We promise that the Debian system and all its components will be free\naccording to these guidelines.'.\n\n> > Yes, you can't do without it, but you also can't start obsessing on\n> > it because the matter can soon get absurd after that. (There is no\n> > free hardware to run it on, oh my!)\n> \n> When hardware is something distributable by the Debian project as part\n> of Debian, then this might be relevant; it isn't an issue with current\n> technology.\n> \n> License texts *are* distributed by Debian, now, under terms that are\n> non-free. This behaviour doesn't match the Social Contract.\n\nSure, they are technically being distributed, but not as something\nthe social contract cares about. (Pardon the personification.)\n\n> > Lawyers would likely ask us - what would be the legal purpose of\n> > addressing this concern?\n> \n> Why would lawyers ask us that, and why are their questions about the\n> Social Contract germane here? It's not a legally-binding document.\n\nMy point exactly. There is no reason to apply the \"we must clarify\neverything and anything in order to not get sued\" legal logic.\n\n> > Trying to \"clarify\" the social contract by elaborating on peripheral\n> > things that aren't immediately obvious, is basically nitpicking, and\n> > it shouldn't be done.\n> \n> I would think thazt *only* things which are immediately obvious are\n> exempt from the need for clarification. Anything else needs to at\n> least be considered on its merits, and not dismissed because it's \"not\n> immediately obvious\".\n\nIt is being considered on its merits, it's not dismissed because it's\n\"not immediately obvious\", but because it's \"nitpicking\".\n\n> > Also, nobody cares for statements that can be normalized to 'you can\n> > do all this, except that, that, that, and that', and those should\n> > also be avoided if we want readers to take the spirit of the\n> > document seriously.\n> \n> I don't see how that's at all true. Contrariwise, I would hope you\n> agree that a document that says \"we will always do this, and never do\n> that\", but which is routinely violated in practice, is one that\n> readers will not take seriously.\n\nExcept that we seem to disagree on whether the obligatory distribution of\nlicenses, regardless of their own license, falls under the \"that\" which we\npromised never to do.\n\n-- \n     2. That which causes joy or happiness.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}