{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGood afternoon. This is Harry Smith filling in for\n  Katie.\n \nIt’s a state of emergency in part of Northern California, where thousands of acres of\n  woodlands have been burned, and hundreds of homes have been destroyed in a\n  massive forest fire. The blaze, near Lake Tahoe,\n  is heading straight toward another residential area. Bill Whitaker will be\n  live with the latest.\n \nTurning our attention to Iraq,\n  a suicide bomber penetrated layers of security in a highly guarded Baghdad hotel before\n  blowing himself up in lobby. The blast killed four tribal leaders and eight\n  others – it was apparently targeting a meeting of U.S.-allied Sunni\n  leaders. Our chief foreign correspondent Lara Logan reports from the scene.\n \nMany call the 9/11 aftermath an environmental\n  disaster. Former EPA administrator, Christie Todd Whitman faced questioning today\n  on Capitol Hill over her reaction to the attack. National Correspondent Byron\n  Pitts will report.\n \nAlso in Washington,\n  new rulings by the Supreme Court are exposing its political colors since\n  President Bush’s appointees joined the bench. Call it the Roberts and\n  Alito factor. Wyatt Andrews will have the story.\n \nIn health news, more doctors are asking mothers if\n  they’d like to save their baby’s umbilical cord blood – and\n  more mothers are doing it. The blood is rich in stem cells that can be used\n  to treat certain diseases later in life. Dr. Jon LaPook will have the story.\n \nAlso tonight, Tracy Smith will have a follow-up of\n  the Iraqi orphan story Lara Logan broke on the CBS Evening News last week.\n  Smith will talk to the wife of one of the soldiers about why his role in the\n  rescue effort meant so much to her personally.\n \nFinally, what would you do to get into the next\n  restaurant hotspot? Wait in line? Max out your credit card? Go behind bars?\n  If the latter seems unreasonable, you probably haven’t heard of the new\n  Italian dinner spot, where you can eat alongside convicted murderers and\n  mobsters. Allen Pizzey will take you inside for a meal you can’t\n  refuse.\n \nSee you tonight, \n \n\n\n\n\nHarry Smith\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}