{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Lifestyle Newsletter May 17, 2007", "body": "\nhowstuffworksÂ® | lifestyle  May 17, 2007\nRSS\n  \n How Autism Works  Some children seem to live in a world all their own. They\nappear distant and closed-in, avoiding eye contact and shying away from their\nparents' hugs, and may exhibit strange behaviors. These children are among\napproximately 1.5 million in America\nwho have autism. Learn about the causes and symptoms of\nautism and the treatments and help available for autistic children.\nAlso at HowStuffWorks\n \n\nHow Aromatherapy Works - Aromatherapy is a popular form of alternative medicine that uses the smell from essential oils to treat a variety of conditions. Learn about the history of aromatherapy, how to do aromatherapy at home and what conditions some people think may be improved by aromatherapy treatment.\n \n\nHow Political Conventions Work - The next presidential election is 18 months away, but the\ncampaign season is already here. Find out how political conventions work to\nchoose presidential candidates and why conventions are an important part of the\nelection process.\n \n\nHow Self-Publishing Works - Thanks to the development of print-on-demand services,\nself-publishing offers great opportunities to writers with an entrepreneurial\ninstinct or those who simply wish to produce a bound copy of their work for\nthemselves and some friends. Discover the world of self-publishing, and find\nout if itâ\\u20ac™s a viable alternative to working with a traditional publisher.\n   \nThis Week's Video\n \n\nHow ATMs Work - Have you ever wondered what it looks like inside an ATM?\nSee how automated teller machines ensure you get your money at the push of a\nbutton in this video from HowStuffWorks.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. Â© 2007, HowStuffWorks, Inc. All Rights Reserved "}