{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Duncan Harrington\" <wufeskipab@eski.hu>", "subject": "Join the Anatrim revolution", "body": "\nSummer is coming, time to tone up\n\n\n\n\n\nAnatrim – The very up-to-date and most fascinating product for over-weight people available – As you could see on CNN\n\n\n\nDo you see excessive body kilos kill a plenty of people around the whole world? We believe you hate the ugly appearance of people like those and the social stigmata attached to them. \n\nMoreover, you got no will to resist a pressure of your baneful eating habits. Does it all sound familiar? Then we have something for you!\n\n\n\n\n\nIntroducing Anatrim, the new product for the elimination of your body’s extra weight. The greatest thing about Anatrim is it raises the quality of your life by making you crave food less and giving you better spirit. Read what people say to us on this product:\n\n\n\n\n\n\"It is amazing! \n\n\nInstead of stuffing myself with food and watching TV continually \n\n\nI became more interested in taking exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I am more fit now and lots of men fix their eyes on me!\"\n\n\n\n\n\n\nLusia R., Chicago\n\n\n\n\n\n\n\"I tried some passive weight losing, you know, but with little result. I could not restrain my ravenous appetite. \n\n\nOnce I was told on Anatrim my very best friend by and I was really effected by the information.\n\n\n I had attempted using it, and my wife said that I’m not more a weighty man now, 3 months later. \n\n\n33 pounds off and I keep still losing them! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nSteve Burbon, Washington\n\n\n\n\n\nAnatrim helps your mind to understand that you doesn’t have such a great need for that much food. It improves your spirit, gives you extra energy, and attacks needless kilos. Especial thanks to its mighty comprehensive formula!!\n\n\n\nPry out latest intelligence!\n\n\n\n"}