{"category": "ham", "to_address": "<ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Lifestyle Newsletter April 26, 2007", "body": "\nhowstuffworks® | lifestyle April 26, 2007\nRSS\n   How Hypnosis Works \n Our understanding of hypnosis has advanced a great deal in\nthe past century, but the phenomenon still holds many mysteries. Take a look\nat some popular theories of hypnosis and explore the various ways hypnotists\nput their art to work in this HowStuffWorks article.  \nAlso at HowStuffWorks\n How Strikes Work - Labor strikes can cause major disruptions to industry, commerce\nand the lives of people who aren't even connected to the strike itself. Learn\nabout the effects of strikes and the complex reasons behind them.\n \nHow Start-up Capital works - When you start a new business, you need money to get it off\nthe ground. Learn about the various types of capital available to new\nbusinesses, including what venture capital and \"angel investors\" can offer.\n \n\nHow Radon Works - If you live in certain parts of the United States,\nyou might be aware of the threat that radon gas poses. Radon gas is\nradioactive, and in tightly insulated houses it can accumulate to\nconcentrations that pose a health threat. Find out how radon works and the\nhealth risks associated with it.\n   \nThis Week's Video \n\nHow the Nintendo Wii Works - The Nintendo \nWii has been generating impressive sales and receiving rave reviews for its \ninnovative controller and emphasis on fun and gameplay over graphical \npyrotechnics. In this video from HowStuffWorks, learn what\nsets the Wii apart from other video game consoles.  This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click here.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved\n "}