{"category": "spam", "to_address": null, "from_address": "gekitzmiller@austin.rr.com", "subject": "CONGRATULATIONS!!!", "body": "\n\nFROM THE DESK OF THE DIRECTOR \nINTERNATIONAL PRIZE AWARD DEPT \n\nAttn Lucky Winner, \n\nWINNING NOTIFICATION FOR CATEGORY \"A\" WINNER ONLY \nWe are pleased to inform you of the result of the last final annual \ndraw of our Lottery International Programs. \nThe online cyber lotto draws was conducted from an exclusive list of \n25,000,000 e-mail addresses of individual and corporate bodies picked \nby an advanced automated random computer search from the internet. No \ntickets were sold. \n\nCONGRATULATIONS!!! \nAfter this automated computer ballot, your e-mail address emerged as a \nwinner in the category \"A\" with the following numbers attached Ref \nNumber: PW 9590 ES 9414,Batch Number: 573881545-NL/2006 and Ticket \nNumber: PP3502 /8707-01 You are therefore to receive a cash prize of \n$2,500,000.00.(TWO Million Five Hundred Thousand United States \nDollars) from the total payout \n\nCONGRATULATIONS!!!. \nYour prize award has been insured with your e-mail address and will be \ntransferred to you upon meeting our requirements, statutory \nobligations, verifications, validations and satisfactory report. To \nfile in for the processing of your prize winnings,you are advised to \ncontact our Certified and Accredited claims agent for category \"A\" \nwinners with the information below:\n \n************************************* \nMR SCOTT MICHEALS \nE-mail: claimsagent_authorised@yahoo.de\nTel: +31 616 853 427 \n************************************* \n\nYou are advice to provide him with the following information: \nNames: \nTelephone/Fax number: \nNationality: \nAge: \n\nNOTE: All winnings must be claimed not later than 14 \ndays,thereafterunclaimed funds would be included in the next stake. \nRemember to quote your reference information in all correspondence. \nYou are to keep all lotto information confidential, especially your \nreference and ticket numbers. (This is important as a case of double \nclaims will not be entertained).Members of the affiliate \nagencies are automatically not allowed to participate in this program. \nFurthermore, should there be any change of address do inform our \nagent as soon as possible. Congratulations once more from our members \nof staff and thank you for being part of our promotional \nprogram. \n\nYours Faithfully, \nWalter Jones. \nLottery Coordinator. \n\n"}