{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\nPerformance \n\t\t\tBenchmarking For Energy Utilities\nSeattle, WA\n            May 23-24, 2007\n\nPandemic \n\t\t\tPreparedness For Utilities\nSeattle, WA\n            May 23-24, 2007\n\n\nCapacity \n\t\t\tMarkets\n\n\t\t\tWashington, DC\n\nJune \n4-6, 2007\n\nCoal-to-Liquids \n\t\t\tFinance and Development Summit\n\n\t\t\tNew York, NY\n\nJune \n4-6, 2007\n\n\nStrategies for \n\t\t\tBidding Ancillary Services in LMP Markets\n\nIndianapolis, IN\n\nJune 6-7, 2007\n\n\nIntro to Electric \n\t\t\tUtility Systems for Non Engineers\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nDistributed \n\t\t\tEnergy Resources-Emerging Business Models for Utilities\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nMergers & Acquisitions in the Customer Service Space: What Does it Mean For Utilities? (UtiliPoint.com - May 21, 2007) \n\n\n\nUtiliPoint.com - May 21, 2007 - As CIS Week prepares to launch in sunny Orlando, Florida this week, many have been asking UtiliPoint about the recent mergers & acquisitions that have occurred over the past year.\n\n\nMay 21, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 21, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 21, 2007\n\n\nMay 21, 2007 PowerMarketers Industry Publications\n\n\n\nInfluencing Climate Change Policies (EnergyBiz Insider - May 21, 2007)\n\n\n\nEnergyBiz Insider - May 21, 2007 - Corporate America considers climate change legislation to be inevitable and has begun to factor that into the cost of production.\n\n\nMay 21, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for May 21, 2007  \n\n\n\nFirst Enercast Featured Articles for May 21, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 21, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nWilliams selling power-trading unit\n\n\n\nMay 22--Williams Cos. Inc. announced plans to exit the power business Monday through the sale of most of its energy-trading assets to Bear Stearns Co. for $512 million.  About 200 Tulsa employees could be affected, company officials said. Some jobs could move to Houston. The deal is expected to strengthen Williams' credit profile and allow the Tulsa-based company to focus growing its natural gas ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nDTE to sell non-utility business for $1.23 billion\n\n\n\nMay 21--DTE Energy said it has agreed to sell its Michigan Antrim Shale gas-exploration assets to Atlas Energy Resources LLC for $1.23 billion.  The deal is expected to close by June 30. In addition, DTE's board of directors authorized a stock-repurchase agreement program of up to $1.55 billion, up from the previous plan of $700 million. J.P. Morgan Securities Inc.\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\nSantee Cooper to buy from customers\n\n\n\nMay 22--MONCKS CORNER, S.C. -- State-owned utility Santee Cooper approved a plan Monday to buy excess power from customers who make their own electricity with solar panels and other generators.  \"As a utility looking to the future and trying to be progressive, this is where we need to go,\" Santee Cooper Chief Executive Officer Lonnie Carter said. The utility said it will buy power from customers ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nEnergy co-op eyes Norwalk power plant\n\n\n\nMay 22--WALLINGFORD -- Officials with the Connecticut Municipal Electrical Energy Cooperative want the town to invest in restarting a Norwalk power plant, similar to the project nearing completion at Pierce Station on East Street. Officials from the Norwich public power cooperative were in Wallingford for meetings with members of the town Public Utilities Commission and Mayor William Dickinson ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nBills to cut energy costs failing to take charge\n\n\n\nMay 21--Senate Democrats in Hartford have sent constituents mail touting their work on bills to reduce energy costs.  But for the second year in a row, philosophical differences between Senate and House Democrats over deregulation could jeopardize efforts to pass any bills before the session ends June 6. \"I think we're certainly at risk of nothing happening because of the gulf between the two ...\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\nChevron is selling Dynegy stake\n\n\n\nMay 22--Chevron Corp. will sell its 11.5 percent stake in Houston power plant operator Dynegy, citing the changing relationship between the two companies and Chevron's need to focus on its main businesses.  Chevron said it will sell its 96.9 million shares of Dynegy on the open market through Goldman Sachs by week's end. Chevron first acquired a stake in Dynegy in 1996 when it transferred most of ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nBPA legal shift unfair to Oregon, critics say\n\n\n\nMay 22--Ratepayer advocates, industry regulators and electric utilities in Oregon rose in collective outrage Monday over a decision by the Bonneville Power Administration that would increase monthly bills for most residents by 13 percent beginning next month.  The increase applies only to investor-owned utilities such as Portland General Electric and PacifiCorp, which supply power to about 75 ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nSolar energy helps pay bills at aviary\n\n\n\nMay 22--Tracy Aviary is harvesting rays to light up their Australian lorikeets, tropical flamingos and the stars of the bird show.  Photovoltaic solar collectors now grace the roof of the lorikeets' winter digs, a new building at the aviary that has the sanctuary's only south-facing rooftop with airspace unobstructed by trees. The collectors are creating enough electricity for the nearby flamingo ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nIdaho Power customers to take hit this summer\n\n\n\nMay 22--TWIN FALLS -- Pull out the checkbook.  Idaho Power Co. customers will pay an average of $5.35 more on their power bills this summer after the Bonneville Power Administration announced Monday it will cut credits to utility companies. The cuts could increase energy bills across the Northwest and will block six regional power companies from combined credits worth about $28 million a month. ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nGas plant opinions vary at sea, ashore\n\n\n\nMay 22--NEW HAVEN -- Broadwater Energy hired a marine service vessel to take media out to the middle of Long Island Sound Monday to show that the floating liquefied natural gas plant the company wants to build 10.5 miles off the Connecticut shoreline would be safe.  But when the boat returned to the dock across the Mill River from the former United Illuminating power plant, one thing hadn't ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nLearn the basics about windows\n\n\n\nSelecting windows for your new home?  Troy Dally, vice president of merchandising for millwork at Lowe's, answers some questions about the choices you'll face. ___ What are the most common materials? _ WOOD: The entire window both the interior and exterior are made of wood. _ WOOD CLAD: These windows are made of wood but the exterior of the window is covered in cladding such as aluminum or vinyl. ...\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\nLearn the basics about windows\n\n\n\nSelecting windows for your new home?  Troy Dally, vice president of merchandising for millwork at Lowe's, answers some questions about the choices you'll face. ___ What are the most common materials? _ WOOD: The entire window both the interior and exterior are made of wood. _ WOOD CLAD: These windows are made of wood but the exterior of the window is covered in cladding such as aluminum or vinyl. ...\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\nGorge locals blast plan for wind farm\n\n\n\nMay 22--A group of residents in The Dalles area has come out against a proposed wind farm along the nearby ridges of the Columbia River Gorge.  Wind farms are popping up throughout the Gorge, but this is the first time any notable opposition has arisen in Oregon. Members of the group, Families for Sevenmile Hill, say the wind turbines could cause health and noise problems and could be a danger to ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nElectricity bills from PSE could increase 13 percent\n\n\n\nMay 22--Puget Sound Energy ratepayers should expect a 13.2 percent increase in their monthly electricity bills triggered by a federal court ruling earlier this month.  That ruling by the 9th U.S. Circuit Court of Appeals questioned the legality of Bonneville Power Administration payments to Puget Sound Energy (PSE) and other investor-owned Northwest utilities that collectively serve some 60 ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nNeighbors awake to explosion: 3 family members hospitalized with burns\n\n\n\nMay 22--It sounded like thunder.  Neighbors awoke from the noise around 3:40 a.m. Monday on Scott near Gratiot and Joy in Clinton Township. \"I looked out my window and saw orange,\" said Samantha Schroeder, 20. What she and other residents of the street witnessed in disbelief was a white-and-brown home with a \"for sale\" sign exploding. A natural gas leak, according to investigators, reduced the ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nCaught: Suspect in 17th Ave. fire: Speeding car hits homes, gas main\n\n\n\nMay 22--GULFPORT -- Police have taken into custody a man matching the description of a motorist whose vehicle struck a mobile home and a natural gas main, causing a fire that destroyed one residence and damaged three others. Police have not identified the suspect, but said he was arrested later Sunday night on a warrant for old fines. The crash and resulting fire occurred at a mobile home park ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nGas leak blamed in Clinton Twp. home explosion\n\n\n\nMay 21--The house explosion in Clinton Township early this morning was likely caused by a natural gas leak, fire officials said.  A mother and her two children are in Detroit Receiving Hospital, receiving treatment for burns. They are expected to survive, fire officials said. A firefighter was treated and released from Mt. Clemens Regional Center for minor burn injuries.\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\nEDITORIAL: For thousands, a dark future\n\n\n\nMay 21--The lights and gas could be shut off in the homes of thousands of Massachusetts families who can't afford to pay their utility bills. Instead of leaving these families in the dark, state and federal officials should provide fast financial relief.  The problem started last year when Congress began handing out fuel assistance funds. Formally known as the Low Income Home Energy Assistance ...\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\nDaily News local briefs\n\n\n\nMay 21--Firefighters leave  before roof collapse FLOROSA -- Firefighters were ordered out of a house fire Sunday in Florosa five minutes before the roof collapsed. The fire started at about 1 p.m. at 216 Oakdale Ave., according to Florosa Fire Chief Mark Lee. Within minutes, the fire had consumed the roof. About eight firefighters were battling the blaze from inside the manufactured home when Lee ...\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\nEDITORIAL: Building momentum: Bill Clinton highlights a ready way to fight climate change\n\n\n\nMay 21--How to slow climate change? The answers usually begin with coal-fired power plants and gas-guzzling cars and trucks. Rarely does the conversation turn to energy use in buildings, and yet this realm of consumption is the source of one-third of all greenhouse gases such as carbon dioxide.  Climate scientists have argued that more efficient use of energy in buildings is a way to make early ...\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\nPublic clear about cutting smog, but plan does minimum\n\n\n\nMay 22--After Texas officials rolled out their new smog plan for Dallas-Fort Worth late last year, members of the public had lots to say about it.  Some asked for a crackdown on new coal plants, cement kilns, cars and other polluters. Some asked the state to combat global warming. Most asked for an aggressive assault on air pollution in all its forms. None got their wish.\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nTreasury seen opposing new tender for Ramat Hovav power plant: Finance Ministry D.G. Ariav: Barriers should be removed under the auspices of the existing regulatory framework.\n\n\n\nMay 21--The Ministry of Finance is apparently opposed to the Ministry of National Infrastructures' plan to publish a new tender for the building of a power plant at Ramat Hovav. Finance Ministry director general Yarom Ariav indicated the ministry's objections in a letter to Minister of National Infrastructures Benjamin Ben-Eliezer and director general Hezi Kugler.\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\nCity helps fund home repairs, keep work on track\n\n\n\nMay 21--Dave Harding is having a tough time getting a contractor to do all the work he promised on a home-remodeling job.  The bathroom in Harding's modest house in the Patty Jewett neighborhood is gutted. Lead paint chips are scattered in the dirt around his home, ruining his garden. A new paint job already is peeling. Harding, 53, would fix it himself if he wasn't disabled.\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\nFactory, neighbors reach possible compromise over pollutants\n\n\n\nMay 21--A Waco factory for bullet-resistant panels has reached a tentative compromise with neighbors who were protesting its plans to increase emissions of styrene fumes.  Waco Composites, 302 S. 27th St., now proposes to reduce its styrene emissions by 25 percent by altering its manufacturing process and possibly using exhaust vent filters, even as the company expands production.\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\nWhat makes compact development work?\n\n\n\nMay 21--East Lampeter Township's supervisors in March increased the density of homes permitted in a Residential-2 zoning district.  That will allow a developer to build 400 or more houses on a 46-acre tract. Depending on your point of view, that was either a first-rate decision or a first-rate disaster. The Coalition for Smart Growth, which supports denser housing projects as a way to balance ...\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\nCity seeks the limelight\n\n\n\nMay 22--GRAND TERRACE -- Hollywood filmmakers have used the varied landscapes of San Bernardino County as a backdrop for dozens of movies.  But Grand Terrace has been mostly invisible on the industry's radar screen. City officials are hoping to change that by launching an effort to market the city as a desirable location for film shoots. \"We're trying to put Grand Terrace on the map in a good ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nLandslide threatens another home\n\n\n\nMay 22--STEVENSON -- Laura Foster never imagined owning river-view property when she and her late husband, Merton Foster, retired to the Columbia River Gorge four years ago.  Now that view comes at a steep cost. Foster's children and grandchildren, joined by community volunteers, hurriedly moved a lifetime's worth of belongings Monday as a fast-moving landslide migrated to within 20 yards of her ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nLegislature takes aim at global warming\n\n\n\nMay 21--The Minnesota Legislature took steps early today to cut the state's contributions to global warming.  The Senate and House overwhelmingly approved legislation setting long-range targets for cutting greenhouse-gas emissions by 80 percent by 2050, with interim targets of 15 percent by 2015 and 30 percent by 2025. The compromise bill was approved 59-5 in the Senate and 125-9 in the House. ...\n\n\nMay 21, 2007 Knight Ridder Tribune Business News\n\n\n\nBethlehem developer to move to Allentown: Zawarski will switch cities to build new headquarters into old Schoen's building.\n\n\n\nMay 22--In the latest corporate relocation to downtown Allentown, developers Nic Zawarski and Sons plan to move from Bethlehem to a long-vacant building on Hamilton Street.  Under the proposal, the former Schoen's furniture store at 612 Hamilton St. would be renovated for the Zawarski headquarters, 18 loft apartments, and an upscale restaurant on the first floor.\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nHemaraj to raise funds as interest rates drop\n\n\n\nMay 22--Hemaraj Land and Development Plc will float one to two billion baht worth of debentures in the second half of the year to take advantage of declining market interest rates.  Paopitaya Smtrakalin, director of Hemaraj's business planning department, said the industrial land developer was still studying the best type of structure and duration for the bond issue.\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\nCITY'S GREEN ENVY\n\n\n\nMay 22--TAMPA -- Sarasota County is at the forefront of the green building movement. Hillsborough County is on board, and Pasco County is catching on.  And Tampa? Compared with other governments in the region, Tampa's is lagging behind a national and regional trend to offer incentives to developers who build environmentally sensitive buildings. Some council members wish Tampa were doing more. ...\n\n\nMay 22, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nWilliams selling power-trading unit\n\n\n\nMore than 200 Tulsa employees could be affected when Bear Energy takes operations to Houston. Williams Cos. Inc. announced plans to exit the power business Monday through the sale of most of its energy-trading assets to Bear Stearns Co. for $512 million. About 200 Tulsa employees could be affected, company officials said. Some jobs could move to Houston. The deal is expected to strengthen ...\n\n\nMay 22, 2007 Tulsa World\n\n\n\nDuke Energy's plan wins state approval\n\n\n\nDuke Energy Ohio's plan to build a 16.4-mile underground natural gas pipeline from the Ohio River to Bethel to improve gas transmission in Clermont and Brown counties was approved Monday by the Ohio Power Siting Board.The siting board's approval of the $10.5 million project to begin next spring includes 38 conditions to remediate the environmental and other impacts of construction.&#8226; Check ...\n\n\nMay 22, 2007 Cincinnati Enquirer\n\n\n\nState Audit Rips UConn For Taking Highest Bid\n\n\n\nSTORRS -- State auditors slam the University of Connecticut in a newly released audit because the university chose the highest bidder to build its new energy plant, then agreed to switch the project's subcontractor to the politically connected O&G Industries partway through the project.State Auditor Robert G. Jaekle said Thursday that when auditors asked why the subcontractor change was made ...\n\n\nMay 22, 2007 Hartford Courant\n\n\n\nState Audit Rips UConn\n\n\n\nBy GRACE E. MERRITT Courant Staff Writer May 18 2007 STORRS -- State auditors slam the University of Connecticut in a newly released audit because the university chose the highest bidder to build its new energy plant, then agreed to switch the project's subcontractor to the politically connected O&G Industries partway through the project.State Auditor Robert G.\n\n\nMay 21, 2007 Hartford Courant\n\n\n\nOhio OK's natural gas pipeline\n\n\n\nDuke Energy Ohio's plan to construct a 16.4 mile underground natural gas pipeline from the Ohio River to Bethel to improve gas transmission in Clermont and Brown counties, was approved today by the Ohio Power Siting Board.The siting's board's approval of the $10.5 million project to begin next spring includes 38 conditions to remediate the environmental and other impact of the construction.\n\n\nMay 22, 2007 Cincinnati Enquirer\n\n\n\nCalifornia nut growers use sun for power, too\n\n\n\nLOS ANGELES (Reuters) - The ample sunshine that has made California's San Joaquin Valley among the world's best places to grow everything from almonds to zucchini on Wednesday will also become a source of power at a huge nut farm there. Paramount Farms, which claims the title of the largest supplier of almonds and pistachios to the world, tomorrow will start up a $7.5 million 1.1-megawatt solar ...\n\n\nMay 22, 2007 Scientific American\n\n\n\nNYC to Be Testbed for Power Project\n\n\n\nWASHINGTON -- New York City is the testing ground for a $39.3 million Department of Homeland Security project that will use new superconductor cables designed to prevent blackouts caused by power surges. 'This is about Wall Street, this is about making the electric grid for the financial capital of the world ... more defensible against potential problems,' including a terrorist attack, Jay M. ...\n\n\nMay 21, 2007 Newsday\n\n\n\nNYC to Be Testbed for Power Project\n\n\n\nSFGate Technology: It's a high-tech world - - we just plug you into it... (05-21) 14:52 PDT WASHINGTON (AP) -- New York City is the testing ground for a $39.3 million Department of Homeland Security project that will use new superconductor cables designed to prevent blackouts caused by power surges. 'This is about Wall Street, this is about making the electric grid for the financial capital of ...\n\n\nMay 21, 2007 San Francisco Chronicle\n\n\n\nTVA cranks up Browns Ferry Unit 1\n\n\n\nNORTH MISSISSIPPI The Tennessee Valley Authority (TVA) has restarted Unit 1 at the Browns Ferry Nuclear Plant in North Alabama, completing one of the most extensive recovery efforts in the nuclear industry for an operating plant, according to TVA. TVA received permission from the Nuclear Regulatory Commission (NRC) May 15 to restart the reactor. TVA told the NRC May 9 that it has the ability to ...\n\n\nMay 22, 2007 Mississippi Business Journal\n\n\n\n\n\nTXU Energy Brings Storm Safety Awareness Campaign to Senior Citizens in Corpus Christi\n\n\n\nIn observance of National Hurricane Preparedness Week, TXU Energy, the City of Corpus Christi Parks & Recreation Department's Senior Community Services Division, the Office of Emergency Management and the National Weather Service have joined forces to raise community awareness about storm safety and preparedness, especially among senior citizens. These organizations are hosting a storm safety ...\n\n\nMay 22, 2007 PR Newswire\n\n\n\nAlgonquin Power Income Fund declares cash distribution for May 2007\n\n\n\nOAKVILLE, ON, May 22 /PRNewswire-FirstCall/ - Algonquin Power Income Fund (the 'Fund') (TSX:APF.UN) of Oakville, Ontario announced today that its Trustees have declared a cash distribution on its trust units. The distribution is $0.0766 per trust unit payable on July 16, 2007 to the unitholders of record on May 31, 2007 for the period from May 01, 2007 to May 31, 2007.\n\n\nMay 22, 2007 PR Newswire\n\n\n\n\n\nWilliams to sell power assets to Bear Stearns for $512 mln\n\n\n\nPM NEW YORK (MarketWatch) -- Bear Stearns moved to substantially increase the size of its energy unit after the investment bank said Monday it would pay $512 million to buy all power assets from The Williams Cos. Bear Stearns (BSC) shares rose $2.03 to $151.60 after it said its Bear Energy LP will buy 7,700 megawatts of gas-fired tolling capacity, 1,800 megawatts of full requirements power supply ...\n\n\nMay 21, 2007 Investors Business Daily\n\n\n\nCommission to ensure balance in location of power plants\n\n\n\n(NAN) The Nigeria Electricity Regulatory Commission (NERC) says it will ensure balance in the location power plants in the country. NERC Chairman Ramsome Owan gave the assurance today in Abuja in a chat with journalists on activities of the commission. The chairman was responding to a report released by the commission which showed that of the 16 licenses issued for power generation 99 per cent of ...\n\n\nMay 22, 2007 UPI\n\n\n\nPeabody Energy Marketing Chief Whiting Exercises Options for 7,946 Shares, Sells at a Profit\n\n\n\nPeabody Energy Marketing Chief Whiting Exercises Options for 7,946 Shares, Sells at a Profit May 22, 2007 - 12:58 a.m. NEW YORK (AP) - The chief marketing officer of coal company Peabody Energy Corp. exercised options for 7,946 shares of common stock under a prearranged trading plan, according to a Securities and Exchange Commission filing Monday. In a Form 4 filed with the SEC, Richard M. ...\n\n\nMay 22, 2007 Canadian Business Magazine\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nChina Energy Market Organisation And Regulation Report Available Now\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c57453) has announced the addition of China Energy Market Organisation and Regulation Report to their offering. The China overview report can help you to quickly understand the countrys energy market structure and organisation. For each of the 4 main energy sources, coal, oil, gas and electricity, ...\n\n\nMay 22, 2007 Business Wire\n\n\n\nTesla Energy Group, a New Division of Tesla Motors, Signs Development and Supply Agreement Worth $43 Million With Think of Norway\n\n\n\nTesla Energy Group, a newly formed division  Tesla Energy Group, a newly formed division of Tesla Motors, recently signed an agreement to supply Think Global with lithium-ion battery packs for their line of \"TH!NK city\" electric cars. The supply agreement covers the development and delivery of battery packs starting in December 2007 and continuing through 2008.\n\n\nMay 22, 2007 Internet Wire\n\n\n\nENDESA to Invest Euro 54 Million in Modernising Its Coal-Fired Plants Located in the Iberian Peninsula\n\n\n\n04:05 PM Eastern Daylight Time ENDESA to Invest Euro 54 Million in Modernising Its Coal-Fired Plants Located in the Iberian Peninsula The project in question involves modernising the steam turbines in use at the As Pontes (La Corua), Compostilla (Ponferrada), Teruel, Litoral (Almera) and Los Barrios (Cdiz) plants, and will allow the Spanish energy giant to extend the useful life of the turbines ...\n\n\nMay 22, 2007 Business Wire\n\n\n\nEastern Germany's sunny future\n\n\n\n(Fortune Magazine) -- The former East Germany, once one of the world's gloomiest places, has become home to one of the world's brightest industries: solar power. In late April ground was broken at a former Soviet air base near Leipzig for a $176 million, 40-megawatt photo-voltaic power plant, four times the size of the largest existing solar plant in the world.\n\n\nMay 22, 2007 Fortune\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}