{"category": "spam", "to_address": "smile@speedy.uwaterloo.ca", "from_address": "\"Mr.Eiji Cheng\" <eijicheng6@yahoo.com.hk>", "subject": "please reply (investment trade)", "body": "\nDBS BANK.\nDBS Bank, Hong Kong Branch.\n16th Floor Man Yee Building   \n68 Des Voeux Road\nCentral, Hong Kong.\nEmail:eijicheng6@yahoo.com.hk\n\nI am Mr. Eiji Cheng Liu, Bank Manager DBS Bank Hong Kong branch, I am contacting you for a  highly confidential business intrest that is of mutual benefit to you and me. \nHere it is:\n\nAn Arabian Oil Consultant and Contractor with the Chinese Solid Minerals Corporation, Fawzy Sameh,  made a numbered time (Fixed) Deposit of US$11,500,000.00 (Eleven  Million Five Hundred Thousand United States Dollars) with my bank in 1998-1999.\nAt maturity of this Investment, I sent series of notification to his forwarding address but got no response. After a month, we sent a reminder and finally we discovered from his contract employers, the Chinese Solid Minerals Corporation that Mr. Fawzy Sameh died in a plane crash in EgyptAir Flight 990,1999 air crash.\nSince we got this information about his death and on further investigation, I found out that he died without making a WILL, and all attempts to trace his next of kin was fruitless. I therefore made further investigation and discovered that FAWZY SAMEH did not declare any kin or relations in all his official documents, including his Bank Deposit paperwork in my Bank. This amount US$11,500,000.00 is still in my Bank at this moment and the interest is being rolled over with the principal sum at the end of each year. With my many years of banking experience, i know that no one will ever come forward to claim it. \n\nAccording to Laws of Hong Kong, at the expiration of 7 (seven) years, the money will revert to the ownership of the Hong Kong Government if nobody applies to claim the fund. Now. my proposal to you is that I will like you as a foreigner to stand in as the next of kin to Fawzy Sameh, so that the fruits of this man's labor will not get into the hands of some corrupt government officials here in Hong Kong. \nHow it will work is this,  I will like you to provide me immediately your full names and address so that the attorney will prepare the necessary documents and affidavits that will put you in place as the next of kin of Fawzy Sameh. We shall employ the services of an attorney here for drafting and notarization of the WILL and to obtain the necessary documents and letter of probate/administration in your favor for the transfer. A bank account outside Hong Kong that you will provide will then facilitate the transfer of this money to you as the beneficiary/next of kin. The money will be paid into your account for us to share in the ratio of 85% for me and 15% for you.There is no risk at all as all the paperwork for this transaction will be done by the attorney and my position as the Branch Manager guarantees 100% successful execution of this transaction. \nPlease If you are interested, i want you to  reply immediately via the private email address above. Upon your response, I shall then provide you with more details that will help you understand the transaction. Please send me your confidential \ntelephone and fax numbers for easy communication. \nI want you to observe utmost confidentiality, please. \nAwaiting your urgent reply via my confidential email address:eijicheng6@yahoo.com.hk\n\nMuch Regards, \n\nEiji Cheng Liu ( Central Hong Kong).\n\n\n\n"}