{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "drew Roberts <zotz@100jamz.com>", "subject": "Re: [cc-community] Does BY-SA extend to a newspaper?", "body": "My take on how a modified BY-SA could work follows...\n\n\nOn Friday 13 April 2007 10:02 am, rob@robmyers.org wrote:\n> Quoting \"Benj. Mako Hill\" :\n> > CC seems to have a taken a position that the license basically stops at\n> > the edge of a photograph. Basically, this means that if you don't modify\n> > the content of a photograph, you can basically do what you want with it\n> > under an an SA license (of course, Evan's comments, and a few things he\n> > didn't say, still need to be kept in mind).\n>\n> CC have limited SA's copyleft to derivative works. This is a\n> reasonable position but doesn't always meets people's expectations or\n> model the existing \"social contract\" for use of different kinds of work.\n\nIt is reasonable, but it is not the only reasonable way to do SA.\n>\n> > This is one reason a number of photographs who upload to Wikimedia\n> > Commons prefer the GFDL\n>\n> The GFDL seems to define both texts and images as \"documents\" and\n> replace the concept of derivation with the concepts of modification\n> and combination. The reason that photographs would work as expected\n> under the GFDL would be because it defines a modified version as:\n>\n> \"... any work containing the Document or a portion of it, either\n> copied verbatim, or with modifications and/or translated into another\n> language.\"\n>\n> But this crucially assumes that an article illustrated by a photo\n> constitutes a \"work\". From the discussion of using photography for\n> illustration I'm not sure that it does. If it doesn't, it might be the\n> case that you can just use the photograph under the GFDL's unmodified\n> copying permission, which is how you can use a photo as an\n> illustration under BY_SA.\n>\n> IANAL, TINLA.\n>\n> > and its related to the reason why Larry Lessig\n> > has analogizing NC clauses and copyleft for software -- although I\n> > personally disagree with Lessig's argument in this respect.\n>\n> Yes. I'm very glad that Lessig is talking about this and urging a\n> broader discussion though.\n\nOK,\n\nhere goes (rough thoughts so far)\n\nA modified BY-SA could work along these lines...\n\nIf you make a derivative of the work, you must put BY-SA on the derivative.\n\nIf you use the work in another work where a copyright arises, the work getting \nthe copyright must be BY-SA and any works also used in the larger work must \nbe compatible with BY-SA for use in collections and the like.\n\nThis would not attempt to force a BY-SA license on works used alongside a \nBY-SA work in a collection, but it would require the collection as a whole to \nbe BY-SA and it would limit the licenses on works used in the collection to \nones which carry a \"compatible for collections\" license.\n\nAs a first cut on \"compatible for collections\" licneses, they would need to be \nFree.\n\nPerhaps the over all work would only need to carry such a license and not \nBY-SA itself. I don't know how copyrights work on collections. If so, then \nsince the works used alongside the BY-SA work and the overall work are not \nderivatives (or would not necessarily be?) actual derivatives of the BY-SA \nwork, they could be licensed in other ways when not in the presence of hte \nBY-SA work.\n\nIn cases where no copyright would arise from putting the BY-SA work together \nwith other works, none of this would apply.\n\nFirst, have I been clear in the above?\n\nSecond, have I failed to cover some inportant point(s)?\n\nThird, benefits of such an approach over the current BY-SA?\n\nFourth, costs of such an approach over the current BY-SA?\n\nFifth, overall, would you prefer such an approach to the current BY-SA \napproach?\n>\n> - Rob.\n\nall the best,\n\ndrew\n-- \n(da idea man)\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}