{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "\"Rochelle and Bethea\" <rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, here's your forecast for June 4th - June 10th", "body": "\n\n\n\n\n\n\n\n\nMemo, to ensure that your weekly forecasts are delivered correctly to your inbox, please add our email address Rochelle@myhealthwealthandhappiness.com to your address book.\n \n\nLast Quarter Moon, June 8, 7:44 AM EST\n\n\n\n\n\n\n               \n\n\n\n\nDear Memo,\n\n    Feeling bored?  If so, that could mean that your brain is \"hungry.\"  Did you know that you can \"feed\" and keep your brain in shape, just like you can with your body?  I've just been reading about what seems to be a growing movement to encourage people to do mental aerobics, or exercise for the brain.\n    Just like the body, your brain needs stimulation, or exercise, to keep its cells active and efficient.  It's rather like the old saying, \"use it or lose it.\"  And it isn't only elderly people who may be concerned about such things as memory loss.  According to Dr. Gary Small, the director of the Center on Ageing at the University of California, brain \"ageing\" can occur in people in their twenties or thirties.  Evidently genetics plays a part in brain ageing, but only by about a third.  The other two-thirds has to do with our environment and lifestyle choices.\n    The next time you're feeling bored or perhaps less than alert, why not try a little mental exercise to sharpen up those brain cells?  I've started to collect some exercises, and here are just a few suggestions:\n\nTry counting backwards from 100 to zero as fast as you can.\nPick a letter from the alphabet and name 20 words that start with it as quickly as you can.\nRecite the names of all the teachers you've ever had.\nSwitch to the other hand to do tasks.  For example, if you are right-handed, use your left hand, and vice versa.\n\n    And one of my favorites is – wiggle your toes!  This is a good way to \"wake up\" your brain in the morning.  While you're still in bed, slowly begin to move your toes, wiggling, scrunching and stretching them.  Move them up and down, and then try just moving your big toes.  This actually activates nerves that stimulate your brain.  You can also do this if you've been sitting a while; it will help you become more alert.\n    So, Memo, put your mind to it!\n\n                        Until next week,                            \nP.S.  Memo, we hope that you are enjoying your Biorhythm readings.  Remember that you can check them daily to monitor your emotional, intellectual and physical rhythms.  They can come in handy.\n\n\n\n\n                      \n\n\n\n\n\n\n\n                 \n\n\n    Venus moves into Leo on June 5th and it's a great time to reward yourself, my dear.  Give yourself permission to dress up, treat yourself and even be a little bit flirty.  This is certainly not the time to turn down gifts or offers of support, Memo – get ready to receive!  On the 7th the Moon and Mercury combine, encouraging the sharing of confidences.  The last Quarter Moon on the 8th links up with unruly Uranus – expect a breakthrough or unexpected release of some kind.  The week ends on an upbeat note.\n\n\n\n\n\nMemo             June 4 - June 10             \n\n\n\n\n \n\n\n\n    Memo, I want you to take maximum advantage of the luck coming your way this week. From my calculations, Saturday is going to be your lucky day for this period.  And your Lucky Numbers are 05, 11, 22, 21, 36, 43.  I hope you'll make the best of them.\n\n\n\n\n\n\n\n\n\n\n\nJune 4th for Memo\n\n\n\n\n\n\n\n\n\n    Practical considerations are important if you are working out a problem.  Others may offer to help.  If you need their skills, I suggest that you accept the offer.\n\n\n\n\n\n\n\n    Don't be surprised if you are surprised today my friend, since a very unpredictable energy seems to be pulsing throughout the day.  Do whatever feels healthy and liberating to you.\n\n\n\n\n\n\n\n    It may be time to pay the piper, my dear, and the piper is likely to collect.  Keep your nose out of other people's business today, especially where your work or daily responsibilities are concerned.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJune 5th for Memo\n \n \n \n \n \n\n \n \n    Other people can be informative to you today, my dear.  I suggest that you take advantage of the bright lights others may be shining in your direction and be open to them.\n\n\n  \n \n \n    Someone close to you may need a bit of time on their own, but don't worry about there being a problem between you.  All will end well if you hold on with an open palm. \n\n \n \n\n \n \n\n\n\n\n    You have been known to be social and outgoing and if you feel the slightest inclination toward this today, you will not lack for companionship.  You would benefit from entertaining certain contacts.\n \n \n  \n\n\n\n\n\n\n\n\nJune 6th for Memo\n\n \n \n \n\n\n \n \n    Your stars suggest that a great variety of unusual people can stream in and out of your life today, my dear.  This can be pleasant and perhaps even entertaining, so have a good time.\n\n\n \n\n \n \n    Are you willing to make adjustments in order to accommodate the needs of your partner?  Economic trends may be less predictable on the surface; however, you are energized from intuitive flashes today.\n\n \n \n \n \n\n\n\n\n    Close personal relationships will require the utmost in sensitivity, kindness and consideration today.  Your partnership and joint financial affairs will require your complete attention now.  Try not to get sidetracked.   \n\n \n\n\n\n    You can start over on a project that wasn't going well, and this time find success.  Rely more on others this time, for their support may be what makes the difference.\n \n\n \n \n\n\n    Today is a good day to take care of practical matters.  Projects that have seemed tedious or that require you work with some troublesome agency will begin to work out.  Take advantage and get started.\n \n\n\n\n\n\n\n\nJune 7th for Memo\n  \n \n\n \n \n \n    The stars indicate that you may feel the need to \"let go\" in some way today.  This could have to do with a possession, or even just a desire that you no longer care about.\n\n\n\n\n\n \n \n    You will be motivated to deal with partnership interests through communications, letter writing and negotiation procedures.  You have great insight today and can make a positive difference.\n\n\n\n\n\n\n\n\n\n\nJune 8th for Memo\n  \n \n \n\n\n \n \n    Your dreams can be a wonderful guide for making plans.  If you want to travel, perhaps to visit family at a distance, today is a good day for it.  Maintain your convictions, my dear.\n\n\n \n\n\n \n \n    Your happiness today will come from fulfilling your wish to express your tenderness to your friends, or compassionately giving to a cause you believe in with all your heart and mind.\n\n \n\n\n \n\n\n\n\n\n    Avoid self-indulgent behaviors in eating or drinking at social functions today.  Organize your time to allow for proper rest and relaxation.  Read inspirational materials and improve your outlook.    \n\n \n \n\n\n    Taking up an unusual course of study could be very engrossing.  Don't be surprised if you meet some offbeat people as a result of your research.  New worlds are about to open to you.\n  \n\n\n\n\n\n\n\n\nJune 9th for Memo\n  \n \n \n \n \n \n    There may be more than one right answer, so I advise you not to worry too much about meeting rigid expectations to the letter.  Please yourself and you're likely to please others.\n\n\n \n \n\n \n \n    Take the initiative if you see someone struggling to figure something out.  You could have the perfect experience or know-how to help them discover which way is up.\n\n\n \n \n\n \n \n    You may have to learn a lesson that was not resolved, but this doesn't phase you.  You grow strong in the process, but you might not even realize it as it's going on.  Look forward to the future.\n\n \n\n\n \n \n\n\n\n\n    Institutions of higher education can now provide a backdrop for some pleasant interactions with a wide variety of scholarly types.  You may decide to take up cultural studies or look into travel possibilities.   \n\n \n \n\n\n    Your personal philosophy values freedom and no restraints of any kind.  On the inside, however, you may be feeling pulled by your childhood upbringing.  Read inspirational books.\n \n \n\n\n\n\n\n\n\nJune 10th for Memo\n \n \n \n \n \n \n \n    Life can bring some wonderful opportunities today, so I'm all in favor of your having an adventure by trying something new.  Follow your instincts -- I don't think you'll go wrong.\n\n\n  \n\n \n \n    Clear concise communication is important today.  If you don’t understand what someone is talking about, ask questions.  You want to avoid misunderstandings that can happen now.\n\n\n  \n\n \n \n    Do you have a personal interest in the education of children and young people?  My friend, this is also a good time for you to look into taking a specialty class or correspondence course yourself.\n\n \n\n\n \n \n\n\n\n\n\n\n    While you are probably known for your progressive thinking and generally positive attitude, others may be surprised to see that you also have the ability to back up your beliefs with active commitments.\n \n \n\n \n \n\n\n    This is a fine time for beginning a long journey or arranging  travel plans.  You are probably feeling more positive and philosophical now.  Take advantage of ways to increase your knowledge.   \n\n \n \n\n\n    Plan a trip and get away for some quiet time.  You deserve to have time to yourself for adventure, discovery, or just relaxation.  Think about that dream trip you long fantasized over.  This could be it.\n \n\n\n\n\n\n\n\n    With a New Moon coming up next week, Memo, it would be a good time to start planning for your next big idea.\n\n                       Best Regards, \n                        \n\n\n\n\n\n    If at any time you no longer wish to receive your weekly forecast, you can simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400, and I will stop emailing them to you. It's as simple as that. My only desire is to help you, Memo.\n\n"}