{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "abstruse: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Monday, June 25, 2007\nabstruse \\ab-STROOS; uhb-\\, adjective:\nDifficult to comprehend or understand.\nEinstein's theories of relativity, so abstruse yet so disturbing in the popular press of the 1930s. -- David J. Skal, Screams of Reason\nOne should be particularly suspicious when abstruse mathematical concepts (like the axiom of choice in set theory) that are used rarely, if at all, in physics -- and certainly never in chemistry or biology -- miraculously become relevant in the humanities or the social sciences. -- Alan Sokal and Jean Bricmont, Fashionable Nonsense\nWhat attracts students to the study of a foreign language is not its appearance as an abstruse code saying the very same things that are said more simply in their mother tongue, but, rather, the opening up of a new world by the foreign language. -- Jackie-Ann Ross, \"New Zealand's Educational TV\"\nAbstruse comes from Latin abstrusus, past participle of abstrudere, \"to push away from any place, to hide,\" from ab-, abs-, \"away from\" + trudere, \"to push, to thrust.\"\nDictionary.com Entry and Pronunciation for abstruse\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-10044358-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}