{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Power Marketing Association<Power.Marketing.Association@calcium.netcontentinc.net>", "subject": "Developing and Launching New Products and Services for Utilities May 17-18  Dallas", "body": "\n\n\n\n\nEUCI Newsletter\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Developing and Launching New Products and Services for Utilities\n \n\n\nMay 17 - 18, 2007  Dallas, Texas\n\n\n \nClick Here \n            To Download A Complete Conference Brochure\n Click Here For A Complete Listing\n              Of Upcoming Conferences\n \n\n\n\n\n\nOVERVIEW\n\n\n\n \nUtilities and energy companies across the country are continually seeking the perfect product and service mix that they can offer to residential and commercial clients, thereby maximizing revenue.\n \n EUCI has designed its 5th annual interactive conference to bring together energy leaders in this quest as well as forward-thinking consultancies.\n \nThe focus of this event is on the experiences of individual utilities and energy companies, each sharing the lessons they have learned from new product and service development and deployment. The conference is filled with case study presentations to enable attendees to learn from the successes and challenges of others. The conference brings together experiences of both regulated and non-regulated utilities to share marketing ideas and strategies that have been successful.\n \nThis conference addresses four main components:\n \n\n\nUsing technology to effectively segment target markets\n\nDetermining new products and services for commercial and industrial customers\n\nEmerging products and services for residential markets\n\nLeveraging the contact center to deliver new products and services to customers\n\n                        Each session has case study presentations to help you decide which products and services to offer in order to grow your business and promote customer satisfaction. Learn what you can do to offer new products and services, re-offer old products and services in a new regulatory environment, or revitalize current product and service offerings by using new marketing technology, partnering with external companies, and partnering with internal organizations.\n\n\n \nAttendees learn from the experiences of nine companies, answering such critical questions as:\n \n\nHow do we choose which product or service to launch?\n\nHow much investment should we make toward product development?\n\nHow closely should we factor market research into our product design?\n\nHow will we launch the product and get customer attention?\n\nWhat response rate represents a success?\n\nHow can we launch new products and services with a minimal investment?\n\nHow does revenue generated benefit a regulated utility?\n\nHow can we identify customer needs to fit our abilities?\n\n\n\n \nTARGET AUDIENCE\n \nThe target audience for this conference includes:\n \n\n\nVice Presidents of Marketing\n\nGeneral Managers, Directors, and Project Managers involved in Marketing, Marketing Analytics, Market Research, Customer Strategies, Market Planning & Research and/or Business Development\n\nDirectors and Managers of Products & Services\n\nAnalysts and Planners in Strategic Marketing\n\nManagers of Key Accounts\n\nCustomer Services and Marketing\n\nProduct Development and Consumer Product Marketing\n\nContact Center Management\n\n\n\nWHAT PAST ATTENDEES HAVE SAID:\n \n“As a new employee in the utility industry, this conference packed three months of training into two days.”~ B.C., Market Analyst, Dominion\n \n“The EUCI conference on developing and launching new products and services provided several thought provoking ideas and concepts warranting further investigation withinmy company’s business model. The pre-conference workshop was excellent!”~ S.H., Electric Customer Choice Program Manager, CMS Energy\n \n“Great way to expand thinking, network and share ideas with peers in the industry.”~ K.G., Manager, Customer Programs and Product Development, OGE Energy Corp.\n \n“Very interesting to share practices across the industry.”~ R.F., Project Manager, Chilectra S.A.\n \n“I found the conference informative and timely as we are growing into the utility space.” ~ E.S., SilverStone Group\n\n\n\nREGISTER\n\n\n \n  Click\n                      Here To Download A Complete Conference Brochure\n \n \n\n\n\n\n\n\nUpcoming Conferences \n\n\n \n  In-Depth \n                            introduction to the Natural Gas Industry\nDallas, TX\n                              May 15-16, 2007\n  Natural Gas \n                            Transactions, Trading and Origination for Non-Traders\nDallas, TX\n                              May 16-17, 2007\n  Developing and \n                            Launching New Products and Services for Utilities\nDallas, TX\n                              May 17-18, 2007\n   Carbon Finance \n                            and Investment Summit\n New \n                            York, NY\n May 21-23, 2007\n  Performance \n                            Benchmarking For Energy Utilities\nSeattle, WA\n                              May 23-24, 2007\n  Pandemic \n                            Preparedness For Utilities\nSeattle, WA\n                              May 23-24, 2007\n  Capacity \n                            Markets\n Washington, DC\n June  4-6, 2007\n  Coal-to-Liquids \n                            Finance and Development Summit\n New York, NY\n June  4-6, 2007\n   Strategies for \n                            Bidding Ancillary Services in LMP Markets\n Indianapolis, \n                IN\n June 6-7, 2007\n  Intro to Electric \n                            Utility Systems for Non Engineers\n Austin, \n                TX\n June 14-15, 2007\n   Distributed \n                            Energy Resources-Emerging Business Models for Utilities\n Austin, \n                TX\n June 14-15, 2007\n  Managing Physical \n                            & Financial Uncertainty in the Power Industry\n New York, \n                 NY\n June 19-20, 2007\n  Value \n                            and Risk in Energy Markets - Introduction & Principles (Program 8)\n San Diego, CA\n June 19-21, 2007\n  Alternative \n                            Regulation for Electric and Gas Utilities\n Boston, MA\n June 25-26, 2007\n  In Depth \n                            Introduction to Electricity Markets\n  Alexandria, VA\n June 25-26, 2007\n  Customer \n                            Communications for Utilities\n Boston, \n                            MA\n June 27-28, 2007\n  Implementation \n                            and Cost-Benefit of Workplace Weight Management Strategies\n  Chicago, IL\n June 28-29, 2007\n\n\nPlease forward this invitation to \n                          colleagues who may benefit from attending.\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}