{"category": "spam", "to_address": "Theorize <theorize@plg.uwaterloo.ca>", "from_address": "Richard Chase <istineil@greenmon.com>", "subject": "Tired of sexual troubles?", "body": "\n\nCan't satisfy your girlfriend? Do you want to?\nBuy medications at RX online drug store!\nMake your life better. Even your sexual partner won't know you are using Viagra if you buy it here.\nOrder now!\nDon't miss your chance to recover your health!\nWith best regards,\nRichard Chase\n \n \nEgo sgubila maniia velichiia, pustivshaia raskidistuiu kronu ego slavy za Sem let besspornyh pobed i uviadshaia v odin den. Lico ego vyrazhalo lish vezhlivoe liubopytstvo, a Magicheski zashchishchennyj mozg kazalsia vmestilishchem sosushchej pustoty. Krug Prichastiia vse eshche demonstriruet raznye interesnye kartinki, vot on i reshil Posmotret, poka est vozmozhnost. Ne ozhidal ot tebia takoj pryti. \nIa Chuvstvoval ee nelovkost i styd za proiavlennuiu peredo mnoj slabost, Svojstvennuiu zhenshchine, i ne speshil so slovami utesheniia, ponimaia, chto sdelaiu Tolko huzhe. Ne baluj, strogo osadil Jeveld. Vot tak vsegda s nami, prostymi liudmi, postupaiut eti vlast imushchie Zasrancy. Mnozhestvo temnyh businok veerom Sorvalis s ego palcev, i totchas v otdalenii po ravnine prokatilos Negromkoe stakkato neskolkih desiatkov mini-vzryvov. Da glaza otvodiat, chtoby v burelom kakoj neprohodimyj zavesti ili v Boloto, ohotno soobshchil Kvin, nichut ne ispugannyj prostym podzatylnikom. S toboj ne soskuchishsia, podruga. Slabye, truslivye i zhadnye vlastiteli adalaev Byli postoianno zaniaty iskliuchitelno mestnymi rodovymi driazgami, davno uzhe ne Utruzhdaia sebia zabotami o svoem narode Imenityh semej za poslednee stoletie Rasplodilos stolko, chto chut li ne kazhdaia kochka pretendovala na tron makora. Zabud. \nOstalnye instrukcii po hodu Dejstvij. A Celitel? Sily Zla, on byl uveren v chuzhom kuda bolshe, chem ia, i pochti sklonil menia k Mysli, chto etomu golubomu tipu mozhno doveriat. Ia Proletel by eto rasstoianie po vozduhu golovoj vpered. Skoree vsego, energiiu dlia svoej lovushki lovchij mag pocherpnul priamo iz Samogo kruga. ejisuminyon UkFHXFBeQEp0RV1VHUFCUEZWRlleXR1XVA==\n \n\n\n"}