{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Automotive Newsletter June 12, 2007", "body": "\nhowstuffworks® | automotive June 12, 2007\nRSS\n \n Ferrari\n  Whether you're a car expert or casual enthusiast,\nFerrari defines motoring excitement. Learn about the greatest Ferrari road and racing cars -- and the people who designed them, built and drove them -- in our picture-packed celebration of Ferrari history.\n \nAlso at HowStuffWorks \n\n\nHow HEMI Engines Work -The word \"HEMI\"\nhas become a synonym for big, powerful engines. Learn about the legendary HEMI\nengine and find out what sets a HEMI apart from other engine types.\n \n\nHow Tire Pressure Gauges\nWork - If you have a car, chances\nare you also have a tire-pressure gauge. Learn how this pen-sized device\nmeasures air pressure and why the little stick inside doesn't just fly right\nout the back.\n \nHow Airbags Work - Airbags inflate in a fraction of a second, and they can reduce the risk of dying in a head-on crash by 30 percent. Learn about airbag inflation, airbag design and what that powdery substance is. \n  \nWant more from HowStuffWorks? We've recently added 12 new RSS feeds. Besides the Daily Feature you can now enjoy feeds from Entertainment, Health, Auto, Home and Garden, Science and more. \nThis Week's Video \nNissan plugs a major gap\nin its lineup with the 2008 Rogue, its first compact SUV available in the United States.\nGet an up-close look at the Nissan Rogue in this video from HowStuffWorks and\nConsumer Guide. \n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved "}