{"category": "ham", "to_address": "<srkhasru@bdcom.com>", "from_address": "\"Bala\" <bala@haiap.org>", "subject": "[Ip-health] Re: Export of under patent medicine by Bangladesh Pharmaceutical\tIndustries", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nDear Dr Md Sayedur Rahman Khasru,\n\nReference to your questions posted in IP-health on 31st May and Ms Anne St Martin's response, I wish to point out the following:\n\nBangladesh is governed by the Patent Act 1911 which provides product patents.  In view of this Act Bangladesh would be under obligation to grant product patents.  The Bangladesh national pharmaceutical companies will not be able to manufacture the patented product without taking a compulsory license from the Bangladesh patent authority.  The question of export will be governed by the procedure laid down by the WTO in the Ministerial meeting in Hong Kong.\n\nIt should be noticed that Bangladesh can repeal the PA1911.  Once the PA is repealed, no enterprise will be able to get a product patent in Bangladesh.  This will enable the national pharmaceutical companies to manufacture and export the product up to 2016.    One cannot understand why Bangladesh authorities are not repealing the Patent Act 1911.\n\nBest regards,\n\nBala\n___________________________________\nDr K Balasubramaniam\nAdvisor and Coordinator\nHealth Action International Asia - Pacific\n5, Level 2, Frankfurt Place\nColombo 4\nTel: (94 11) 2554353\nFax: (94 11) 2554570\nE-mail: bala@haiap.org\nWebsite: http://www.haiap.org\n\nHealth Action International (HAI) is an independent, global network working to increase access to essential medicines and improve their rational use.\n\nImportant E-mail Information:\nThe information contained in this e-mail is confidential and may be legally privileged. It is intended solely for the addressee and is for the exclusive use of the intended recipient (s). If you are not the intended recipient (s), please note that any form of disclosure, distribution, copying or use of this information in it or in any attachments is strictly prohibited and may be unlawful. If you are not the intended addressee, please contact the sender and dispose of this e-mail immediately. Any opinions expressed are those of the author, not of HAI\n--\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}