{"category": "ham", "to_address": "Andrew Perrin <clists@perrin.socsci.unc.edu>", "from_address": "Frank E Harrell Jr <f.harrell@vanderbilt.edu>", "subject": "Re: [R] OT: Predicted probabilities from ordinal regressions", "body": "Andrew Perrin wrote:\n> Sorry if this is too off-topic, as we may not implement this in R \n> (although we may do so).\n> \n> A student of mine is looking at some public opinion data in which there \n> appears to be a statistically significant difference between levels of \n> support for a proposal based on which of two question wordings is used. \n> That is, roughly half the sample was asked the question with wording 1, \n> the other half with wording 2, and the difference is large enough to be of \n> interest (approx. 6 percentage points different with an N of about \n> 30,000).\n> \n> The question is how best to model this. In the past I have generated \n> predicted probabilities based on the sample asked wording 1, used these to \n> assign those asked wording 2 to predicted categories, and used a logistic \n> regression to predict difference between predicted and actual response. In \n> this case, though, the question of interest uses a four-level ordinal \n> response, so ordinary predicted probabilities based on, e.g., and ordinal \n> logistic regression generate literally probabilities of being in each of \n> the four categories. Transforming this outcome into a prediction of \n> membership in one of the given categories is not straightforward. Can \n> anyone provide some insight into how to model predicted vs. actual \n> outcomes on an ordinal scale?\n> \n> Thanks.\n\nWith the lrm function in the Design package you can get predicted \nprobabilities for each class as well as predicted mean scores.\n\nFrank\n\n> \n> ----------------------------------------------------------------------\n> Andrew J Perrin - andrew_perrin (at) unc.edu - http://perrin.socsci.unc.edu\n> Assistant Professor of Sociology; Book Review Editor, _Social Forces_\n> University of North Carolina - CB#3210, Chapel Hill, NC 27599-3210 USA\n> New Book: http://www.press.uchicago.edu/cgi-bin/hfs.cgi/00/178592.ctl\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n> \n\n\n-- \nFrank E Harrell Jr   Professor and Chair           School of Medicine\n                      Department of Biostatistics   Vanderbilt University\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}