{"category": "ham", "to_address": "IP-Health <ip-health@lists.essential.org>", "from_address": "Benjamin Krohmal <ben.krohmal@cptech.org>", "subject": "[Ip-health] million-dollar cancer prize announced", "body": "--\n[ Picked text/plain from multipart/alternative ]\nhttp://news.com.com/Million-dollar+prize+aims+to+lure+new+cancer\n+ideas/2100-11393_3-6186144.html\n\nMillion-dollar prize aims to lure new cancer ideas\n\nBy Reuters\nStory last modified Wed May 23 16:21:37 PDT 2007\n\n\nMedical researchers teamed up with hedge fund managers on Wednesday\nto offer a new million-dollar prize for the best new idea for cancer\nresearch in the hopes of kick-starting innovative approaches.\n\nThey invited cancer experts, scientists and the general public to\njoin an Internet-based club and compete for the Gotham Prize for\nCancer Research.\n\nFederal funding of cancer research has been flat, and is in fact\nlower than in recent years when inflation is taken into account, said\nGary Curhan of Harvard Medical School.\n\nAnd the system of seeking grants--money to do research--is based\naround pleasing either National Institutes of Health supervisors or\ngatekeepers at the advocacy organizations that pay for research on\nspecific types of cancer, he said.\n\nCurhan teamed up with hedge fund managers Joel Greenblatt and Robert\nGoldstein of private investment firm Gotham Capital to set up the\nprize club.\n\n\"The goal here is to open up the site to people with ideas,\" Curhan\ntold reporters in a telephone briefing.\n\n\"The winners of these prizes are not going to be those who are\nsuccessful in evaluating the idea. It is going to be the person with\nthe best idea.\"\n\nMembers post an essay or thesis outlining their ideas. Cancer\nresearchers will be invited to peruse the ideas. At the end of the\nyear cancer experts such as Bert Vogelstein of Johns Hopkins\nUniversity, one of the best-known researchers in colon cancer and\ncancer genes, will judge the entries.\n\n\"I have seen firsthand how many ideas with incredible potential never\nreach fruition,\" Curhan said. \"We will only make significant progress\nin cancer research by learning from each other's successes and\nmistakes, and by building on each other's knowledge.\"\nNow on News.com\nIs Vista helping boost PC sales Newsmaker: In the heart of Texas, a\nmayor goes 'green' Photos: High-tech vans map out Europe Extra: The\nlast person to see 'Star Wars' Video: Cisco mixes it up with Interop\nmashup\n\nPeople who want to make individual contributions to a particular\nresearcher, as opposed to making a general donation to a charity, are\nalso invited to look at the site.\n\nCurhan stressed he does not believe the NIH is unimaginative in\nfunding research.\n\n\"Most of the work is incremental just because of the long tradition\nand because people tend not to pick risks. And you tend to write\ngrants to what you think will get funded as opposed to your most\ninnovative idea,\" he said.\n\n\"If you want to study something that may be relatively rare, it is\nnot going to be given the same priority as something that is more\ncommon such as breast cancer or prostate cancer.\"\n\nThe prize was launched at the Ira Sohn Investment Research\nConference, a charity cancer event named after a trader who died of\ncancer at the age of 29. A second, $250,000 prize will be offered for\npediatric oncology.\n\nBenjamin Krohmal\nCoordinator - Project on Medical Innovation\nKnowledge Ecology International\nTel: +1-202-332-2670 ex. 14\nFax: +1-202-332-2673\nben.krohmal@keionline.org\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}