{"category": "spam", "to_address": "\"Subscriber\" <cruiseca@flax9.uwaterloo.ca>", "from_address": "\"Adult Singles searching for Adult Singles\" <qsee84ezw@basketballlap.com>", "subject": "Did you get LUCKY with someone special this weekend ", "body": "-FREE*- DATING SITE and DATING COMMUNITY FOR ALL SINGLES THAT WANT TO GET LUCKY!\n\nDid you go on a date this weekend? If not then we can make sure you have a HOT and fun date next weekend with the exact person you would want to be on a date with! \n\nWe would like to give you a membership to our dating site and dating community for no charge at all, and no credit card is required to get it!\n\nPRESS HERE TO JOIN FOR NO COST (MUST BE 18 and OLDER):\n\n\nhttp://understintleft.com/t/qsee84ezw/527213\n\nwe have thousands of SINGLE women and men in your city who have joined our dating community just to have intimate encounters with other singles with no strings attached! Then we have other single women and men that are looking for love! You get to choose what you want! Do you want to date many different singles who are just looking for a good time...or do you want to meet someone special..You choose!\n\nAnd best of all, No Credit Card is Required to get your membership! \n\n\nPRESS HERE TO JOIN FOR NO COST (MUST BE 18 and OLDER):No Credit Card Required:\n\n\nhttp://understintleft.com/t/qsee84ezw/527213\n\n\nWith your membership you will have access to all of the following:\n\n* view pictures\n* send e-mails to members \n* receive e-mails from members \n* reply to e-mails from members\n\n**No Credit Card Required**\n\n\nPRESS HERE TO JOIN FOR NO COST (MUST BE 18 and OLDER):No Credit Card Required:\n\n\nhttp://understintleft.com/t/qsee84ezw/527213\n\n-----\n\nShould you wish to stop receiving these messages, \nyou may opt-out at any time by clicking here \n\nhttp://understintleft.com/t/qsee84ezw/527214 \n\nsetlocation=unsubscribe and updating your e-mail preferences. \nAlternatively,  may contact Singlesnet.com Customer Service directly:\n\nSinglesnet .com, \n13A Highland Cir, Needham, \nMA, 02494-3031 \n\nor \ntelephone (617) 301-6210 9am-5pm EST Weekdays.\n\n \n\nHi Subscriber! You are receiving this solicitation because cruiseca@speedy.uwaterloo.ca previously agreed to receive correspondence from Splash Tree. If this service should fail to meet your expectations, feel free to disassociate yourself from our service.\nhttp://understintleft.com/u/173a/cruiseca%40speedy.uwaterloo.ca/2\n\nShould you want to contact us via the United States Postal Service, our address is as follows: 333 Mamaroneck Avenue Suite 193 White Plains, NY 10605\n\n\n"}