{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 18, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESTexas Flooding Sweeps Away 4-Year-Old Girl\nTorrential rains swamped North Texas towns, killing at least two people, prompting hundreds of evacuations and leaving numerous\n                        people stranded on rooftops. Alexandria Collins, 4, died after she was swept away in floodwaters in a Fort Worth suburb. More...Watch: Rains Flood Texas Town\n• Boy Killed By Black Bear In Utah• Duke And Lacrosse Players Reach Settlement\n                     \t\t\t\t\t| Watch• U.S. Lifts Sanctions On Some Palestinians\n                     \t\t\t\t\t| WatchU.S.Duke And Lacrosse Players Reach Settlement\nDuke University says it has reached an undisclosed financial settlement with three former lacrosse players falsely accused\n                        of rape. More...Watch: Duke Victim's Lawyer On Nifong\n• Pregnant Mother Goes Missing In Ohio\n                     \t\t\t\t\t| Watch• Boy Killed By Black Bear In Utah• Police Probe Drag Racer's Deadly Burnout\n                     \t\t\t\t\t| Watch• More StoriesWorldSurvey: Sudan, Iraq Most Unstable Nations\nThe annual \"Failed States Index,\" which measures the stability of countries relative to social, economic, political and military\n                        indicators, found two nations (whose success is important to the Bush administration) mired in the 10 worst.  More...\n• Pakistan Condemns Rushdie Knighthood• 100 Killed In 3 Days In Afghanistan\n                     \t\t\t\t\t| Watch• U.S. Lifts Sanctions On Some Palestinians\n                     \t\t\t\t\t| Watch• More StoriesPoliticsMcConnell: Immigration Too Close To Call\nThe Senate's top Republican said he could not predict whether the stalled immigration reform bill will pass, citing questions\n                        among conservatives as to whether it guarantees amnesty to illegal immigrants. More...Watch: Face The Nation, 06.17.07\n• Agreed: Something Needs To Change In Iraq\n                     \t\t\t\t\t| Watch• President Bush And The National Debt• Romney Surges Ahead In Bellwether States\n                     \t\t\t\t\t| Watch• More StoriesHealth111-Year-Old Cited As World's Oldest Man\nTomoji Tanabe, at age 111 the world's oldest man, keeps a daily diary, drinks milk and stays away from alcohol and smoking. More...\n• A Pill To Forget?\n                     \t\t\t\t\t| Watch• A Lyme Disease Warning From The CDC\n                     \t\t\t\t\t| Watch• Is America Too Sweet On Sugar?• More StoriesSciTechOil Industry Scales Back Expansion Plans \nA push from Congress and the White House for huge increases in biofuels, such as ethanol, is prompting the oil industry to\n                        scale back its plans for refinery expansions. That could keep gasoline prices high, possibly for years to come. More...\n• Space Station's Computers Seem A-OK• Wireless Technology Takes A Leap Forward• Massive Global Pedophile Ring Busted\n                     \t\t\t\t\t| Watch• More StoriesBusinessFormer Enron Broadband Exec Sentenced\nThe former chief of Enron Corp.'s high-speed Internet unit, who turned government witness and testified in the trial of former\n                        Enron CEO Jeffrey Skilling and company founder Kenneth Lay, was sentenced to 27 months in prison. More...\n• Airbus Makes A Splash With US Airways• Dubai Company Buys QE2 Ocean Liner • NASCAR Countersues AT&T For $100M• More StoriesEntertainmentJulia Roberts Welcomes A Son\nActress Julia Roberts gave birth to her third child, Henry Daniel, on Monday in Los Angeles. More...\n• A Weekend Of Visitors For Paris\n                     \t\t\t\t\t| Watch• Britney To Clear Channel: I'll Sue You!• Beckham Nearly Gets Hollywood Ending• More StoriesOpinionFatah's Fall\nThe New Republic says that with the rise of Hamas in Gaza, the Bush administration must alter its tactics and make\n                        a more concerted effort for peace in the Middle East.  More...Watch: Escaping Hamas-Ruled Gaza\n• Lieberman Takes Heat For Iran Warnings\n                     \t\t\t\t\t| Watch• Andy's Personality Quiz\n                     \t\t\t\t\t| Watch• Maybe There Should Be A Third Party\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Pregnant Mother Goes Missing In Ohio\nJessie Mudle Davis, who is nine months pregnant, was last heard from June 13. She spoke to her mother on the phone, but after\n                        that, Davis, who has a 2-year-old son, vanished. More...Watch: Pregnant Woman Missing\n• EARLY SHOW: When Teen Dating Turns Bad\n                     \t\t\t\t\t| Watch• EARLY SHOW: Missing:  Pamela Waldher, Teen\n                     \t\t\t\t\t| Watch• EARLY SHOW: Sedgwick Thrives As \"The Closer\"\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nCops Probe Dragster DeathsPolice are investigating how a Tennessee parade ended in tragedy when pro drag racer Troy Critchley lost control of his car\n                                    and plowed into a crowd of spectators. Drew Levinson reports.\nTOP VIDEOS\nRice: Palestine Not Divisible\nFirst Look: Iraqi Orphanage\nRains Flood Texas Town\nPlane Lands Without Gear\nKeoghan's Heroes: Ecuador\nDeadly Flood In North Texas\nAbbas: Resume Peace Talks\nClashes After Real Madrid Win\nNotebook: Speedy Games\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMorley Safer talks to long-driving, hard-drinking golfer John Daly. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMurder On Lockhart Road:A mother and two kids are murdered. There are bizarre clues, eyewitnesses, blood drops,\n                           and a killer with a foot fetish. Saturday, 9 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}