{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "termagant: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Wednesday, May  2, 2007\ntermagant \\TUR-muh-guhnt\\, noun:\n1. A scolding, nagging, bad-tempered woman; a shrew.\n2. Overbearing; shrewish; scolding.\nThe termagant who had dragged him out on long, boring walks, who had tried in vain to censor his reading, who had labelled him an impious liar and criminal, was dead at last, and the boy, hearing a servant say 'she has passed away', sank to his knees on the kitchen floor to thank God for so great a deliverance. -- Jonathan Keates, Stendhal\nFamily legend recounts that Sister Garrison once quite literally brokeup her husband's drinking party by smashing the offending bottles, and this is sometimes taken to mean that Abijah Garrison was driven to desert his family by his termagant of a wife. -- Henry Mayer, All on Fire\nThe music critic Maclintick, with his termagant wife and his book which will never be finished, who in a moment of drunken despair throws his cherished text down the lavatory and then gasses himself. -- David McKie, \"Secret harmonies\", The Guardian, March 30, 2000\nTermagant comes from Middle English Termagaunt, alteration of Tervagant, from Old French. Termagant was an imaginary Muslim deity represented in medieval morality plays as extremely violent and turbulent. By the sixteenth century, termagant was used for a boisterous, brawling, turbulent person of either sex, but eventually it came to refer only to women.\nDictionary.com Entry and Pronunciation for termagant\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9503809-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}