{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Bert Dawson\" <kordjmanueldelorenzinaw@djmanueldelorenzi.com>", "subject": "Burn pounds off with Anatrim", "body": "\nPounds down, mood up\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most delighting flesh loss product available – As were seen on ABC.\n\n\nDo you recall all the situations when you told yourself you would do anything for being delivered from this desperately growing number of kilos? Happily, now no big price is to be paid. With Anatrim, the ground-breaking kilos-melting blend, you can get naturally health lifestyle and a really slender figure. Take a look at what our customers write!\n\n\n\n\"I hate to acknowledge it but I was dreadfully addicted to food. \n\n\nI greedily devoured all this garbige \n\n\nand just could not stop. \n\n\n\n\nThis torment left off when I started course of taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite vanished, \n\n\nspirits improved and I became the happiest person 19 pounds in 2.7 months. \n\n\n\n\nSo, I can tell you now I became the happiest person in the world!\"\n\n\n\n\n\nVictoria K., Boston\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nYou can't imagine how I detested being mocked at school. \n\n\n\n\nI abhorred my plumpness and I hated myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nThis stuff literally dragged me out of this horrible nightmare! Thanks and thanks to you, fellows.\"\n\n\n\n\n\nMikkey Fox, Chicago\n\n\n\n\n\n\"You know what? Thanks to Anatrim my marriage was saved! I went into the circle, depression – more eating – just more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce my friend showed me web page and I asked for Anatrim at once. \n\n\nThe results I achieved were great, my appetite came to normal level, I was in good spirits oftener, and, of course, I tightened my belt with no regrets. And you know, the bed became cool, too!\"\n\n\n\n\n\nMichael\n\n\n\n\n There many and many gratitudes delighted people leave after trying Anatrim. Don’t you wanna join the tens of thousands of slim men and women and try this original appetite-suppressing energy increasing product now!\n\n\nDo not decline the chance!\n\n\n\n\n"}