{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "Johannes Wiedersich <johannes@physik.blm.tu-muenchen.de>", "subject": "Re: Sony or Toshiba? (corrected)", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nJim Moore wrote:\n[big snip]\n> Would really like to replace the Gateway.  Under Linux the keyboard, touchpad \n> and face of the computer are extremely sensitive;i.e.; if one's finger touches \n> the bezel around the touchpad it will jump to another open application; likewise \n> say I'm using the terminal, if the cursor gets moved out of the terminal window, \n> keyboard entry stops until the cursor is again placed in the terminal area.\n\n- - Take care to buy a laptop with a touchpad that is *not* leveled with\nthe surface, but slightly lower. (So you won't touch it accidentally)\n\n- - Take care to buy a laptop with a touchpad that is *centered* below the\nletter 'b'. (So you won't touch it when you type with 10 fingers.)\n\n- - Take care to buy a laptop that has a touchpad with palm and\nmultifinger detection that works on linx. (So even if the above fail it\nwon't shoot your mouse into nirvana)\n\nMy thinkpad has all these features, that one would think are a must for\nany laptop. I know quite a few other brands that don't follow those\nrules, and not following these rules is one of the reasons why so many\npeople deactivate their touchpad and use an external mouse.\n\nJohannes\n\nNB: My first unbranded laptop bought in 1999 didn't have palm detection,\nbut followed at least the other rules. I don't want to know how later\ngenerations of laptop designers could get the idea of putting a leveled\ntouchpad right or left of the center position in a way it is unavoidable\nto touch it while typing.\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGON8iC1NzPRl9qEURArdYAJ9xfak1eRQc+S1IvhF2gx0vxeAWigCfWHfY\n4n9yIYQpPUUBHGODihMIg1A=\n=qU2C\n-----END PGP SIGNATURE-----\n\n\n-- \nTo UNSUBSCRIBE, email to debian-laptop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}