{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "\"Law Watch\" <mailings@mail.cnn.com>", "subject": "Law Watch: Legal News and Analysis from CNN.com", "body": "\n\n\n\n\nCNN.com - Law Watch\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTuesday, April 17, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n'Tragic rush to accuse' in Duke case\nAll sexual assault and kidnap charges against three men stemming from a Duke lacrosse team party were dropped today. North Carolina State Attorney General Roy Cooper said: \"We believe that these cases were the result of a tragic rush to accuse and a failure to verify serious allegations.\" \nFULL STORY\n\n•  Audio slide show: Duke players cleared\n•  D.A. aplogizes to cleared players\n•  Players might sue\n•  Case raises questions about anonymous accusers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNANCY GRACE Airs on Headline PRIME, 8 p.m. ET\n\"Nancy Grace\" is television's only justice-themed interview and debate show. Nancy Grace challenges guests\non the most controversial and high-profile legal issues of the day by drawing on her unique perspective\nas a former violent crimes prosecutor and as a crime victim herself.  Send your questions and comments.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPastor's daughter recounts slaying\nProsecutors rested their case against Mary Winkler, a preacher's wife accused of murdering her husband, with the heartbreaking testimony of the couple's 9-year-old daughter.\nFULL STORY\n\n\n\n\n\n\n'Girls Gone Wild' founder surrenders \nJoe Francis, the founder of the \"Girls Gone Wild\" video empire, surrendered to federal marshals early Tuesday to face a contempt of court citation after initially defying a federal judge.\nFULL STORY\n\n\n\n\n\n\nTeen gets 45 years for school shooting\nA 15-year-old boy pleaded guilty Tuesday in the killing of a high school official and the wounding of two others under a plea deal announced after jury selection for his trial had started.\nFULL STORY\n\n\n\n\n\n\nAstronaut had bondage photos\nA police search of former astronaut Lisa Nowak's car turned up bondage photos on a computer disk, British currency and pills, according to documents released Tuesday by prosecutors.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Law Watch email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}