{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Christoper Clay\" <lexexportsfideliovub@exportsfidelio.com>", "subject": "Stop the painful craving for more food", "body": "\nGet your ideal weight with this natural method\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most delighting flesh loss product available – As were seen on ABC.\n\n\nDo you count up all the times when you plead to yourself to do any thing for being saved from this quickly growing pounds of fat? Happily, now no major price is to be paid. With Anatrim, the ground-breaking pound-melting medley, you can get healthier life style and become really slimmer. Have a look at what our customers write!\n\n\n\n\"It’s rather difficult to confess but I was an awful food addict. \n\n\nI greedily ate all this garbige \n\n\nand could not stop. \n\n\n\n\nThis fatal passion passed away when I started course with Anatrim! \n\n\nHoly God,\n\n\n\n\n my inclination to eat constantly abated, \n\n\nspirits improved and I’m the happiest person 27 pounds in 2.3 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person in the world!\"\n\n\n\n\n\nLinda F., Las Vegas\n\n\n\n\n\n\"Since my early childhood I was a weighty boy. \n\n\nIt’s difficult to fancy how I abhorred being ridiculed at school. \n\n\n\n\nI abhorred the weight and I detested myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nThis stuff literally dragged me out of this horror! The very sincere thanks to you, fellows.\"\n\n\n\n\n\nDave Klark, Chicago\n\n\n\n\n\n\"Do you know what? Anatrim kept my marriage intact! I fell down into this circle, depression – more eating – more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nOne of my friends pointed at your site and I called for Anatrim immediately. \n\n\nThe final result was splendid, my appetite came to normal level, I was in a good mood oftener, and, certainly, I became able to tighten my belt on some holes. And you see me, the sex became fantastic also!\"\n\n\n\n\n\nFrancis\n\n\n\n\n There many and many gratitudes left by delighted people taking Anatrim. Don’t you gonna add yourself to the thousands and thousands of slim women and men and try this natural appetite-reducing power boosting product now!\n\n\nDo not decline the chance!\n\n\n\n\n"}