{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"Law Watch\" <mailings@mail.cnn.com>", "subject": "Law Watch: Legal News and Analysis from CNN.com", "body": "\n\n\n\n\nCNN.com - Law Watch\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTuesday, June 26, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJudge tosses $54 million suit over missing pants\nA judge in the District of Columbia dismissed a case against a dry cleaner who was sued for $54 million in damages over a pair of missing pants.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNANCY GRACE Airs on Headline PRIME, 8 p.m. ET\n\"Nancy Grace\" is television's only justice-themed interview and debate show. Nancy Grace challenges guests\non the most controversial and high-profile legal issues of the day by drawing on her unique perspective\nas a former violent crimes prosecutor and as a crime victim herself.  Send your questions and comments.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWas innocent man executed?\nTo the very end, convicted killer Larry Griffin shouted his innocence to the world -- through court filings, in pleas to the governor and to nearly any reporter willing to listen.\nFULL STORY\n\n\n\n\n\n\nSpector jury sees gory photos\nJurors in Phil Spector's murder trial are bombarded with photos of actress Lana Clarkson's face, some showing blood oozing from her mouth.\nFULL STORY\n\n\n\n\n\n\nMob not like 'Sopranos,' jury told\nChicago's biggest mob trial in years started with a prosecutor urging the jury to forget what they know about movie mobsters and see the defendants for who they are.\nFULL STORY\n\n\n\n\n\n\nTax dodgers taunt police\nTo avoid serving prison sentences for tax-evasion convictions, Ed Brown and his wife, Elaine, have locked themselves off from the world on their own terms.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Law Watch email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}