{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: Bacula: GPL and OpenSSL", "body": "John Goerzen  wrote:\n> [...] FSFE does not believe that an exception clause to\n> the GPL is necessary to legally link to OpenSSL in the manner that\n> Bacula is (dynamic linking).\n\nI'm always open to learning more about this fiddly problem.\nFSFE's reasoning for this seems to be:\n\n[Kern's mail]\n> I've been in conversation with FSFE, and from what they tell me, the GPL \n> prevents distribution of non-GPLed code not loading it in dynamic modules, \n> which is done quite frequently.  Bacula does not distribute any OpenSSL code, \n> and there is no OpenSSL code mixed with the Bacula binaries, therefore \n> according to FSFE there is no problem.\n\nThis seems to contradict oft-repeated views such as:\nhttp://www.openssl.org/support/faq.html#LEGAL2\nhttp://www.gnome.org/~markmc/openssl-and-the-gpl.html\n\nFurther, if Bacula uses openssl-specific calls, isn't it a derived work\nof openssl?\n\nFinally, does licensing@FSF agree with the FSFE opinion?  Having the\nlicence author on board would probably strengthen the argument for\nincluding a whole range of plain-GPL+OpenSSL software.\n\n[back to John's mail]\n> Further, could we not consider OpenSSL to\n> be a major component of the OS on which the executable runs, and thus\n> fall under that exemption in the GPL anyway? [...]\n\nNo.  At least we haven't in the past AIUI because OpenSSL is not a\nrequired part of debian installations.  See end of Anthony Towns's\nMessage-id: <20010616160333.A21471@azure.humbug.org.au>\nhttp://lists.debian.org/debian-legal/2001/06/msg00043.html\n\nShould we ask bap to add this link to the FAQ?\n\nCan Bacula build against GNUTLS or Mozilla NSS?\n\nWill the copyright holders of other code grant the exception?\nWho are they?\n\n(+1 to the 'pain in the neck' comment, by the way.)\n\nHope that helps,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}