{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Randi Small\" <heddorlandses@dorland.at>", "subject": "Be leaner and slimmer by next week", "body": "\nSay goodbye to extra pounds\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting flesh loss product is now easily available – As told on Oprah\n\n\n\nDid you realize that excessive body kilograms kill a lot of people around the whole world? We know you hate the ugly appearance of people like those and the social prejudice against them. \n\nMoreover, you can’t withstand an assault of baneful eating habits of yours. If this sounds familiar, then we got something to propose to you!\n\n\n\n\n\nHere there is Anatrim, the recent product for the reduction of your body’s extra weight. The astounding thing about Anatrim is it raises the quality of your life by soothing the feeling of hunger and giving you joyful spirit. Pay you attention to what people write on this product:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of always glutting myself with food and watching TV constantly \n\n\nI became keen on doing exercise.\n\n\n\n\n\n\n Anatrim set me on the right track.\n\n\n I have a great shape now and there are lots of men around me!\"\n\n\n\n\n\n\nMaria H., Colorado\n\n\n\n\n\n\n\"Passive weight reducing was of little help to me. I could not restrain my ravenous appetite. \n\n\nOnce I was told about Anatrim the media by and I rather liked the information.\n\n\n I had attempted taking it, and my wife said I’m not more a weighty man now, 4 months later. \n\n\n33 pounds off and I keep losing them! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nSerge Smith, Chicago\n\n\n\n\n\nAnatrim gives you an opportunity to understand that you got no such great need for that much food. It improves your mood, gives you additional energy, and attacks useless kilos. All thanks to its powerful distinguished formula!!\n\n\n\nFind out more information on this excellent product now!\n\n\n\n"}