{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "\"CNN Political Ticker\" <politicalticker@cnn.com>", "subject": "The CNN Political Ticker PM, Friday, April 27", "body": "\n\n\nCNN.com - CNN Political Ticker\n\n\n\n\n\n\n\n\n\n\nFor the latest, breaking political news, check for updates\nthroughout the day on the CNN Political Ticker\nhttp://www.cnn.com/ticker All politics, all the time.\n\nToday on the Ticker\n\nWaxman invites Tenet to\ntestify at Iraq hearing\n\nWASHINGTON (CNN) -- Rep. Henry\nWaxman, chairman of the Committee on Oversight and Government\nReform, invited former CIA director George Tenet to testify at\na hearing on the steps leading up to the war with Iraq.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/04/waxman-invites-tenet-to-testify-at-iraq.html\n\n***\n\nBush: Patience on North Korea 'not unlimited'\n\nCAMP DAVID, Maryland (AP) -- President Bush and Japanese\nPrime Minister Shinzo Abe demanded on Friday that North Korea\nlive up to its promises and abandon its nuclear weapons\nprogram.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/04/bush-patience-on-north-korea-not.html\n\n***\n\nSpitzer says Clinton would be 'amazing president,' but\ndoesn't endorse\n\nWASHINGTON (AP) -- New York Gov. Eliot\nSpitzer, who has yet to endorse a presidential candidate,\ntouted home state Sen. Hillary Rodham Clinton for the job\nFriday.\n\nBoth Democrats spoke to a convention of New\nYork State teachers at a Washington hotel, and when Spitzer\nfollowed Clinton to the podium, he gushed that she would be the\nnext president.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/04/spitzer-says-clinton-would-be-amazing.html\n\n***\n\nRichardson gave Gonzales chance to defend himself but\n'he didn't do well'\n\nORANGEBURG, South Carolina (CNN)\n-- While acknowledging he gave Alberto Gonzalez some leeway due\nto their shared Hispanic ethnicity, Democratic presidential\naspirant Bill Richardson said Monday he wanted to hear the\nattorney general's testimony before calling for his ouster.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/04/richardson-gave-gonzales-chance-to.html\n\n***\n\nCorzine will pay all costs related to crash, recovery\n\nNEW YORK (CNN) -- New Jersey Gov. Jon Corzine intends to\npay all costs associated with his April 12 car crash, from the\nMedivac ride to Cooper University hospital to the cheeseburgers\nand milkshakes he has consumed during his recovery, his\nspokesman said Friday. \n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/index.html\n\n***\n\nMcGreeveys appear in divorce\ncourt\n\nNEWARK, New Jersey (AP) -- The nation's first\nopenly gay governor and his estranged wife will be in public\ntogether for the first time since he told the world he was \"a\ngay American\" when they appear in divorce court in Elizabeth on\nFriday.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/04/mcgreeveys-appear-in-divorce-court.html\n\n***\n\nDay after debate, Giuliani rips Dems on 'socialized\nmedicine'\n\nRALEIGH, North Carolina (CNN) -- Republican\npresidential candidate Rudy Giuliani wasted little time before\ntaking a swipe his Democratic rivals who debated last night in\nSpartanburg, South Carolina. \n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/index.html\n\n***\n\nCapitol Hill committees query\ndeputy AG over attorney firings\n\nWASHINGTON (CNN) --\nDeputy Attorney General Paul McNulty was interviewed Friday by\nstaffs of the House and Senate Judiciary committees, as part of\ntheir investigations into the firing of the eight U.S.\nattorneys last year. \n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/index.html\n\n***\n\nBill aims to close 'terror' gap\nin gun laws\n\nWASHINGTON (AP) -- The Justice Department\nand a Northeastern Democrat have formed a rare alliance\nintended to restrict gun sales to terror suspects. \n\nThe bill, introduced late Thursday by Sen. Frank\nLautenberg, D-New Jersey, after two years of study produced an\nendorsement by the Justice Department, would give the attorney\ngeneral power to block gun sales to persons on terrorism watch\nlists. In some instances, the attorney general could let a sale\ngo through -- for example, when stopping the sale would hinder\na terrorism investigation. \n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/index.html\n\n***\n\nClinton: Southern accent is a\nvirtue, not a vice\n\nGREENVILLE, South Carolina (AP) --\nDemocratic presidential hopeful Hillary Rodham Clinton said\nFriday she sees her sometimes Southern accent as a virtue.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/index.html\n\n***\n\nRenzi not resigning\n\nWASHINGTON (CNN) -- Rep. Rick Renzi, R-Arizona, shot down\nany rumors that he will resign Friday. \n\n\"For several\nweeks, I have been the subject of leaked stories, conjecture,\nand false attacks about a land exchange,\" the Arizona\nCongressman said in a press release. \"None of them bear any\nresemblance to the truth, including the rumor that I am\nplanning on resigning.\" \n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/04/renzi-not-resigning.html\n\n***\n\nStatement\nfrom Edwards Campaign:\n\nEDWARDS DECLARED WINNER OF\nTONIGHT'S DEBATE\nDaily Kos Readers Declared Edwards The\nWinner. According to the Daily Kos poll, \"Who won the debate,\"\nas of 10:30 pm after the debate John Edwards led the pack with\n20% of the vote (1034), leading Obama at 17% (881), followed\nClinton at 10% (530). The answer \"More than one of the above\"\nreceived 12% of the vote (600) and \"None of the above\" had 11%\nof the vote (584).\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/04/statement-from-edwards-campaign.html\n\n***   \n\nDean expresses condolences over Valenti's death\n\nWASHINGTON (CNN) -- DNC chairman Howard Dean expressed his\ncondolences over the death of Jack Valenti, a former Hollywood\nlobbyist and adviser to President Lyndon Johnson.\n\nFull\nstory:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/04/dean-expresses-condolences-over.html\n\n\n\n\n\n\nFor the latest breaking political news click here.\nBookmark the CNN Political Ticker here.\nFor news tips, political nuggets, feedback and suggestions, please drop us a line at politicalticker@cnn.com\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the CNN Political Ticker list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=morninggrind\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}