{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "acrimony: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\nFind out how to release your inner genius and ace your exams in Teresa Bolen's epochal book, MASTER PLAN TO MASTER EXAMS: HOW TO DISCOVER YOUR HIDDEN ABILITIES TO CREATE THE SUCCESS YOU DESIRE.\nYou'll get a package of wonderfully empowering F-R-E-E Bonus Gifts from some of the world's leading success and learning experts -- take action NOW.\nRelease Your Inner Genius Abilities Today\nADVERTISEMENT\nWord of the Day for Friday, May 11, 2007\nacrimony \\AK-ruh-moh-nee\\, noun:\nBitter, harsh, or biting sharpness, as of language, disposition, or manners.\nIn years to come, liturgical infighting ranked alongside disputed patents, contested fortunes, and savage political feuds as a source of McCormick family acrimony. -- Richard Norton Smith, The Colonel\nThe partnership eventually broke up in acrimony. -- Henry Grunwald, One Man's America\nAs losses swelled, acrimony led to lawsuits, countersuits, and the bankruptcy of the ironworks. -- Patricia O'Toole, Money & Morals in America\nMr. Cioran himself once wrote: \"However much I have frequented the mystics, deep down I have always sided with the Devil; unable to equal him in power, I have tried to be worthy of him, at least, in insolence, acrimony, arbitrariness and caprice.\" -- Eric Pace, \"E. M. Cioran, 84, Novelist And Philosopher of Despair\", New York Times, June 22, 1995\nAcrimony is from Latin acrimonia, from acer, \"sharp.\"\nDictionary.com Entry and Pronunciation for acrimony\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9565667-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}