{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Gaijin <gaijin@clearwire.net>", "subject": "Re: HardWare Synthesizers", "body": "Gregory Nowak wrote:\n> As for a usb synth, you should be able to use your lt under windblows\n\n     I'm not concerned about Mickeysoft.  S'why it took almost five\nyears to finally break down and put the $#%$%&^ garbage back on my\ncomputer.  I've regretted every single day it has ran.   Never\ncould get W95 to consistantly connect at 56K...even with programming the\nNVRAM on my external modem and re-writing the .inf file.  That was the\nmain reason I ported to Linux.  I could no longer control my own\ncomputer.  (Lovingly pets \"his Precious.)  Linux gave me my computer\nback.  Makes my skin crawl to consider how Microsoft is trying to horn\nin on Linux.  I !know! they're working with the govt. to eliminate the \n4th Amendment against warrantless searches.  I don't trust Redhat, \neither.  Getting rid of Debian too, because it's too easy to infiltrate \na trojan via dpkg.  Yeah, I'm paranoid, but when you examine the \nevidence...  Bugrit!\n\n> There is. Its called provox, and is under the gpl. Its author is on\n> this list as well.\n\n\t   Good deal.  I was thinking of using something to wipe my WinXP drive \nand fdisk the thing into about 16 different fat-16 partitions and \ninstalling freedos and Win 3.11.  Use it as an emergency dual-boot setup \nin case my Seagate croaks.  I'm running removable hard drives.  I don't \ntrust Windows not to infect my Linux drive.   Give it cooties, \nor something.  Six different OS releases, multiple IE upgrades, and \nthousands of security updates and they still haven't closed the \nemail/address book vulnerability.  They want that sucker left wide open.\n\n> In fact, if you tried to use both speakup and provox in a dosemu \n> session with the same synth, I wouldn't be\n>  surprised if you ran into problems.\n\n     Couldn't be any worse than Narrator and Win-Eyes both running at\nthe same time.   Wouldn't be any less understandable, anyway. \nI'm thinking of getting another couple screen readers working all at the \nsame time.  It'll be just like being right in the middle of a Jerry \nSpringer show. \n     Thank you for the URL's.  I have many of them.  They're just in a \nbig pile in Firefox's bookmarks.  Can't organize them using Win-Eyes \nyet. \n\n         Michael\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}