{"category": "ham", "to_address": "sugar@laptop.org", "from_address": "msevior@physics.unimelb.edu.au", "subject": "[sugar] Write Activity.", "body": "Hi everyone,\n            I just been pointed to the new mockups for Write.\n\nhttp://wiki.laptop.org/go/Write\n\nWe have almosts all the features requested in libabiword for this. The\nonly one currently missing is rotating the image, but this should not be\ntoo hard to implement.\n\nIt is certainly an interesting design, I'm not enough of an expert to know\nif this accessible to children but I can it could well be.\n\nI have a few questions about this.\n\nWhat is the time frame for implementing this?\n\nI notice that undo/redo is only available for text, whereas all the\nmanipulations shown in the mockups can be undone/redone. Does it make\nsense to provide undo/redo for all toolbars or even on the menu bar?\n\nDo you intend that different toolbars are automatically changed upon\ncontext? For example, if a user clicks on an image, does the toolbar\nchange to \"image\" automatically?\n\nRegarding \"insertTable\", I think our little inserttable widget which lets\nthe user interactively size the dimensions is easier and more intuative\nthan selecting x and y dimensions.\n\nRegarding the table toolbar, there are two entries shown with \"100\" and\n\"24\", which appear to be size in percent of the width of the page of the\nhorizontal and vertical dimensions. Is that correct? I wonder if these are\nneccessary? It seems a rather esoteric idea to young children. The width\nan heights of the columns can be adjusted by dragging the column and row\nseperators on screen.\n\nIn there place you might want to provide buttons to merge and split cells\nhorizontally and vertically.\n\nRegarding the page margins, could you clarify how you would like this to\nbe displayed on screen? Currently we suppress the top, bottom, right and\nleft margins to get the maximum amount of text on screen. To show margins\nwe go into what we call \"print view\" which is what the text will look like\nonce printed. Given this, do you intend for write documents to be printed?\nIf so should we enable printing for Write?\n\nThanks very much, it is an interesting design and it's nice to a get a\ndirection.\n\nCheers\n\nMartin\n\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}