{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "New hope for people at risk for heart failure.  That story tonight on the CBS EVENING NEWS with KATIE COURIC", "body": "\nCBSNews.com\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\nQUOTE OF THE DAY\"There's a fine line between \n      fishing and just standing on the shore like an idiot.\" - Steven \n      Wright \n      \nDID YOU KNOW?Julius Caesar and Napoleon Bonaparte both \n      suffered from epilepsy. \n\nTONIGHT ON THE CBS EVENING NEWSHere is \n      an early preview of what we are planning for tonight’s CBS EVENING NEWS \n      from Anchor and Managing Editor, Katie Couric… Hi, \n      everyone, Tens of thousands draped themselves in Iraqi flags and \n      marched through the streets of two Shiite holy cities today to mark the \n      fourth anniversary of Baghdad's fall to U.S. troops. The show of force was \n      orchestrated by the radical Shiite cleric Moqtada al Sadr, who proved that \n      he commands an enormous following among Iraq's largest religious group. \n      Martin Seemungal is in Baghdad, and will have more on this story \n      tonight. Iran announced a dramatic expansion of uranium \n      enrichment, saying it has begun operating 3,000 centrifuges. That's nearly \n      10 times the previously known number, and is in defiance of U.N. demands \n      that it halt the program or face increased sanctions. We will have a \n      reality check on the real threat from Iran. President Bush is \n      making another push for immigration reform. He visited the U.S.-Mexico \n      border to tout a guest worker program for immigrants. With up to 12 \n      million illegal immigrants in the U.S., lawmakers haven't agreed on how to \n      uphold the law without disrupting lives, eroding the work force and \n      risking political upheaval. Kelly Cobiella will report from the \n      desert stretch where Arizona and Mexico meet. Border agents there say they \n      are pelted with rocks and the victims of assault from smugglers. In fact, \n      there have been more assaults against agents in the Yuma sector this year \n      than all of last year. At any one time in this country, as many as \n      100,000 people are suffering from heart failure, but only about 2,000 \n      people a year receive heart transplants. For a long time, doctors were \n      focused on developing a heart pump as a bridge to when a new heart becomes \n      available. But a new device is showing it can be more than just a bridge. \n      Our contributing medical correspondent, CNN's Dr. Sanjay Gupta, \n      will tell you about this. There's also a growing uproar over radio \n      host Don Imus' racially charged comments about the Rutgers University \n      women's basketball team. Despite his on-air apologies, the calls continue \n      for him to be fired from his syndicated morning program, after his \n      racially charged comments. Imus appeared on the Rev. Al Sharpton's radio \n      program today and issued another apology. Richard Schlesinger will \n      have this report, and will discuss the FCC's regulations as well. \n      Finally, for computer researcher Zombie Bell even his morning walk \n      to work is part of a grand experiment in digitizing and remembering \n      everything. The little camera around his neck takes a picture every 30 \n      seconds or so, and a sound recorder rolls non-stop. Bell is saving his \n      whole life on computer, from childhood certificates to all his medical \n      records. John Blackstone will have his story. I hope \n      to see you tonight. Katie For more information on these \n      stories, please click on the following links: Iraqi Shiites \n      Hit Streets To Protest U.S. Click Here Bush Renews Push For \n      Immigration Reform Click Here And here's a look at \n      one of the stories we’re working on for Tuesday’s \n      broadcast:   \n      Dr. Jon LaPook reports on how stem cell research \n      could revolutionize the treatment of juvenile diabetes. That story and \n      much more, Tuesday, on the CBS Evening News. If you would like more information on any of these \n      stories or the broadcast, please click on the following address and e-mail \n      us: evening@cbsnews.com \n\nTONIGHT ON DAVID \n      LETTERMANDave sits down with 2008 Democratic Presidential \n      Candidate Sen. Barack Obama... Plus, actress Halle Berry! \n\nTUESDAY\nMORNING ON THE EARLY SHOWHarry \n      Smith, Hannah Storm, Julie Chen, and Russ \n      Mitchell anchor THE EARLY SHOW from New York. Dave \n      Price will bring us the weather. Along with the top news of \n      the day, we will also have the following stories: ANNA \n      NICOLE'S SISTER: NEW BOOK, PT. 1: In the first of an exclusive \n      two-part interview, Donna Hogan, sister of Anna Nicole Smith, will join us \n      to talk about the death of the blonde bombshell. Tuesday morning, in her \n      first interview since her sister's death, Hogan will join us to discuss \n      her unauthorized biography of the late actress entitled, Train Wreck: \n      The Life and Death of Anna Nicole Smith. LOU DOBBS: In \n      the first of his new weekly commentaries, Lou Dobbs, anchor and managing \n      editor of CNN's Lou Dobbs Tonight, will join \n      us. TWO HEROES who have \n      made a difference: In another installment of \n      our special series, Second Act, we will take a look at Jim Laws, a \n      cardiologist from Ohio, and Ed Artis, who began his career as a juvenile \n      car thief. Ed soon found himself in the Army, where he learned to get \n      things done in hostile places. It was not long after that he began his \n      life as a freelance humanitarian. When Ed met Jim in Moscow in 1993, the \n      two knew they were destined for great things. In Moscow, Ed became a \n      Knight of Malta, a humanitarian order that dates back to the Crusades. \n      Jim, already a Knight for his Community Service, became intrigued by Ed's \n      courage. The two formed Knightsbridge and raise money like any charity, \n      but their ability to distribute large quantities of aid and medicine \n      directly to the people at the end of the line is what sets them apart. Ed \n      Artis and Jim Laws have risked their lives distributing tens of millions \n      of dollars worth of aid to the needy, and they couldn't be happier. We'll \n      hear their amazing story Tuesday morning. For information on \n      how you can help Ed Artis and Jim Laws on their next humanitarian mission \n      to Darfur, go to: OneDollar4Darfur Click Here For \n      information on the documentary Beyond the Call featuring Ed Artis \n      and Jim Laws, go to: Beyond The Call The Movie Click Here\nCHRIS KIMBALL: EASY MAKE AHEAD RECIPES: Cook's \n      Illustrated is the definitive source for all your questions in the \n      kitchen. And what they have found out is that preparing a delicious meal \n      does not have to be a huge undertaking. Now, their latest book, The \n      Best Make-Ahead Recipe, offers closet o three hundred easy recipes \n      that you can prepare ahead of time. How can you cook now to save time \n      later? The Best Make-Ahead Recipe is a cookbook for people who want \n      homemade meals, but don't always have the time to pull a meal together on \n      a weeknight. These recipes are ones you can prep in advance - they store \n      well, and cook well. The book is full of advice on freezing, using \n      leftovers, and other simple tricks. Tuesday morning, Cook's \n      Illustrated founder and editor Chris Kimball will join us with recipes \n      from the exciting new make-ahead recipe cookbook - a must for any cook \n      concerned with time. HOW SAFE IS YOUR DRINKING WATER?: A \n      new study to be released on Tuesday takes a look at the quality of \n      drinking water across the country. How safe is your drinking water? The \n      results may surprise you. CBS News Transportation and Consumer Safety \n      Correspondent Nancy Cordes will join us with more. She'll also shed \n      some light on the best filtration products that are available. \n      MARTIN SHORT: On Tuesday, the original cast recording of \n      Martin Short: Fame Becomes Me, will be released. Joining us to \n      celebrate the release of his album will be the very funny Martin Short! \n      CONSUMER REPORTS: BEST AND WORST APPLIANCES: Well it turns \n      out that paying more for your kitchen appliances does not guarantee \n      reliability. The Consumer Reports Annual Product Reliability Survey \n      identifies the most and least reliable product brands and the results just \n      may surprise you. Tuesday morning, we'll take a look at how some of the \n      more popular kitchen ranges, refrigerators, dishwashers and microwaves \n      fared in the recent survey. Mandy Walker, Senior Editor of Consumer \n      Reports, will join us with a roundup of the latest. SHIA \n      LEBEOUF ON DISTURBIA: Actor Shia LaBeouf is one of Hollywood's \n      hottest rising stars. He first gained attention at age thirteen with his \n      Emmy winning role on the Disney series Even Stevens. He parlayed \n      that into a successful film career with a starring role in Holes, \n      and was soon teaming up with A-listers like Will Smith in I, Robot \n      and Keanu Reeves in Constantine. Now, LaBeouf has three films being \n      released in the next three months, including Disturbia, which opens \n      this Friday. The rising star will join us Tuesday morning to talk about \n      his new film and newfound success. FURNITURE AND TAXES: \n      With tax season upon us, many of us are looking for an easy way to reduce \n      some of our out-of-pocket costs. Jennifer Litwin, author of Furniture \n      Hot Spots and Best Furniture Buying Tips Ever!, and a \n      contributor to Consumer's Digest magazine, recommends donating \n      gently used furniture to save money on income taxes. So how can you decide \n      what items will make the most sizable contributions? Jennifer Litwin will \n      join us with advice. If you would like more information on any of \n      these stories or the broadcast, please click on the following address and \n      e-mail us: earlyshow@cbs.com \n      \n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}