{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTUESDAY 24 APRIL 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tToday's Quote for the Day: \n\n\n\"What changed everything for women was not feminism or exercise but hair dye. It almost never gets the credit but it is partly responsible for women being able to stay in the job market\" - Writer Nora Ephron, of Sleepless in Seattle fame.\n\n\nIn tonight's programme:\n\n\nTHE ECONOMY \n\n\nTen years after the creation of the Monetary Policy Committee to take control of interest rates, the Bank of England Governor has been forced to write a letter explaining why inflation is more than 1% above the Bank's target. \n\n\nIt comes as a group of economists urges the MPC to be more hawkish on inflation, and with an increasing political debate about the public finances. We'll explain what's going on - what might be going wrong - and the political impact on Zombie Brown. \n\n\nIRAQ\n\n\nThe battle comes to Washington. George Bush has refused once again to set a timetable for withdrawing US troops from Iraq and says he will veto the emergency Iraq war-funding bill proposed by the Democrats which states that troops should begin withdrawing by October. \n\n\nThe Democrats say they won't back down. Yesterday in one of the worst attacks on US troops since March 2003, a further nine US soldiers were killed. So has America lost the war? \n\n\nSCOTLAND \n\n\nFor the first time it looks as though the Scottish National Party could be the biggest party in the Scottish parliament. Is this really the first step towards the break up of the Union - or simply a sign of disillusionment with Labour as the natural party of government North of the Border? \n\n\nDavid Grossman will figure it out. \n\n\nAND FINALLY...\n\n\nRetaliation for yesterday's anti-Arsenal joke was swift. It came from Newsnight viewer Roy who, I think it can be assumed, is not a fan of Tottenham Hotspur: \n\n\n\"Why is it impossible to get a cup of tea at White Hart lane?  \n\n\nBecause all the mugs are on the pitch - and all the cups are at Arsenal.\"\n\n\nNewsnight is at 10.30 pm on BBC2.\n\n\nGavin \n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nLONDON'S WiFi HEALTH WORRIES\n\n\t\t\t\t\t\t\tAs London's new wifi zone goes live, some people are concerned about the low-level microwave radiation generated.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}