{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "robert weissman <rob@essential.org>", "subject": "[Ip-health] Bangkok Post letter: Abbott's law firm's deceptions", "body": "http://www.bangkokpost.com/260407_News/26Apr2007_news24.php\n\nBangkok Post\nApril 26, 2007\n\n*Article misleads in support of Big Pharma*\n\nPeerapan Tungsuwan and William McKay (Business Post, April 23)\nmisleadingly and incorrectly argue that Thailand's compulsory licensing\nactions violate World Trade Organisation rules.\n\nThis comes as little surprise. The two work at the global law firm Baker\n& McKenzie, which has a huge business representing Big Pharma. Among\nBaker & McKenzie's clients is Abbott, the drug multinational attempting\nto blackmail Thailand by withdrawing drugs it has submitted for\nmarketing approval in the country. Other clients include Aventis and\nBristol-Myers Squibb, Pfizer and Eli Lilly.\n\nThe lawyers' arguments do not pass the laugh test.\n\nThey argue that Thailand's action does not constitute \"public\nnon-commercial use\" because the compulsory licence permits the\nGovernment Pharmaceutical Organisation (GPO), an arguably commercial\norganisation, to use the patents. That is irrelevant. The licences are\nfor government use - distribution through the public health sector -\nwhich is what matters.\n\nThe United States, for example, routinely issues \"public non-commercial\nuse\" licences in the defence sector to clearly commercial ventures (like\nBoeing and Lockheed Martin).\n\nThey complain that Thailand's royalty rate is too low. They neglect to\nmention that the patent holders are free to appeal the royalty rates,\nbut have in fact been uninterested in negotiating or litigating over\nroyalties.\n\nAnd they contend that Thailand did not consider each licence on its own\nmerits. They ignore the reasoned basis that the Thai government has set\nout for its decision in each case. They creatively interpret provisions\nof WTO rules to suggest that governments must always enter negotiations\nprior to issuing compulsory licences, despite explicit language to the\ncontrary - and despite common practice in the United States and\nelsewhere, where government-use licences are issued with no prior\nnegotiations.\n\nPeerapan Tungsuwan and William McKay aim to confuse readers by\nmisleadingly citing international law with which few non-specialists are\nfamiliar. Had they disclosed their firm's ties to Big Pharma, everything\nwould have been much clearer.\n\nROBERT WEISSMAN\n\nDirector, Essential Action, Washington DC\n\nPROFESSOR BROOK K BAKER\n\nHealth GAP, Northeastern University School of Law, Programme on Human\nRights and the Global Economy, Boston\n\nSEAN FLYNN\n\nAssociate Director, Programme on Information Justice and Intellectual\nProperty,\n\nWashington College of Law, Washington DC\n\nJUDIT RIUS SANJUAN\n\nForeign law adviser, Knowledge\n\nEcology International, Washington DC\n\n\n\nBangkok Post, April 23, 2007\n\nBY Invitation\n\nCompulsory drug licences violate world trade treaty\n\n\nPEERAPAN TUNGSUWAN and WILLIAMMCKAY\n\n\nWe are familiar with the controversy that has been swirling around the\nissue of compulsory licensing (CL) of patented pharmaceuticals in Thailand.\n\n\nThe Public Health Ministry has issued a white paper called \"10 Burning\nIssues\", which is an apologia for CL. The ministry proclaims CL is \"a form\nof social movement that aims at improving access to essential medicines and\nthe health of people\".\n\n\nIn spite of substantial increases in budget expenditure in other areas, the\nministry justifies CL by asserting that patented pharmaceuticals are too\nexpensive for the Thai budget. It proclaims that the \"public health\ninterest must come before commercial interests\".\n\n\nWith this line of reasoning, the ministry might just as well announce that\nit will be compulsorily acquiring beds in private hospitals. Private beds\nare undoubtedly too expensive. Such an action would also improve access and\nplace public health before commercial interests.\n\n\nPerhaps sensing that it needs to find some additional rationale, the\nministry also asserts that its CL is in \"full compliance with the Thai\nnational and international framework\". In this context, this means in full\ncompliance with section 51 of the Thai Patents Act and Article 31 of the\nWorld Trade Organisation's Agreement On Trade Related Aspects of\nIntellectual Property Rights (Trips).\n\n\nIn reality, we think the ministry has failed to comply with Trips in a\nnumber of important respects. In this article we will explain why this is\nso. In the next article, we will discuss what might be done about it.\n\n\nFirst, we believe the ministry has failed to comply with Article 31(b) of\nTrips because it did not have prior consultations with patent holders. In\nour view, the CLs in favour of the Government Pharmaceutical Organisation\n(GPO) are for commercial use, not for \"public non-commercial use\" as the\ngovernment claims and as required by Article 31 (b).\n\n\nSecond, the ministry has failed to comply with Article 31(h) of Trips\nbecause the royalty rates stipulated (0.05% in every case) are not\n\"adequate\" and fail to take into account the \"economic value of the\nauthorisation\" (the CL).\n\n\nAnd third and most important, the ministry has failed to comply with\nArticle 31(a) because it has not considered each case \"on its own merits\".\n\n\nLet's discuss each of these failures in more detail:\n\n\nFailure to Consult: Article 31(b) of Trips mandates prior consultations\nwith the patent holder except in cases of emergency or \"public\nnon-commercial use\". The ministry does not claim there is an emergency.\nHowever, it does assert that the CLs in favour of the GPO are for a\n\"non-commercial purpose\".\n\n\nWe think the GPO's use of the CL will be for a commercial purpose. In fact,\nSection 6(5) of the GPO Act states that the GPO carries on \"business\".\nSections 34 and 35 reinforce this basic objective.\n\n\nFor example, legislators envisaged the organisation making a surplus and\nhaving an obligation to pay this surplus to the government. The GPO also\nhas joint ventures with private pharmaceutical companies. In the past, some\nwanted the GPO privatised.\n\n\nThe GPO will be selling the products for which Thailand is issuing CLs. The\nroyalty obligations are expressed as a percentage of the GPO's \"sale\nvalue\". In short, the activities are commercial, both in form and\nsubstance. They do not cease to be such simply because the GPO is owned by\nthe government.\n\n\nContrary to what the Public Health Ministry asserts in its white paper,\nSection 51 of the Patents Act is in fact silent on the issue of whether\nthere ought to be prior consultations with the patent holder. However,\nArticle 31(b) of Trips does say negotiations are required if the CL is\nissued for commercial use, and we think the ministry has failed to comply.\n\n\nInadequate Royalty Rate: The royalty rate of 0.05% of the GPO's sales value\nis not \"adequate\" and does take into account the \"economic value\" of the CL\nas required by Article 31(h) of Trips. The sales value, and hence the\neconomic value, of each product varies. Prima facie, one would expect that\nthe royalty rates for each product should vary. But they do not. The rate\nis the same for all three products.\n\n\nThere is some curious logic in the White Paper. The ministry asserts that\nsince the GPO will charge high retail prices for the products, royalty\nrates paid to the patent holders should be low.\n\n\nThe opposite conclusion is more apt. If prices are high, royalty rates\nought also to be high to provide adequate compensation to the patent\nholder. To make the royalty rate \"adequate\" within the meaning of Article\n31(h), authorities should assess what rate might be applicable if this was\na voluntary licensing situation, not just a CL situation.\n\n\nIn our experience, rates in voluntary licensing situations would be much\nhigher, typically in the range of at least 5% to 7.5 %, and quite possibly\nsubstantially more. In one recent case in South Africa, a 5% rate was\ndetermined for an antiretroviral, and that involved a licence to settle a\ncompetition dispute. In short, any adequate rate would be likely to be way\nin excess of the derisory 0.05% stipulated by the ministry.\n\n\nFailure to Consider Individual Merits: The ministry failed to comply with\nArticle 31(a) of Trips because it did not consider each case on \"its\nindividual merits\". This is the most basic and fundamental of all of the\nministry's failures to comply.\n\n\nTo consider any case on \"its individual merits\" by definition requires\nprior consultations with the affected party. That party must be given the\nopportunity to make its case and provide relevant evidence. These\nprinciples resonate in provisions such as Article 41(3) of Trips, which\nsays: \"Decisions on the merits of the case shall be based only on evidence\nin respect of which parties were offered the opportunity to be heard.\"\n\n\nIn the case of every announcement of a CL, the ministry ignored these\nprinciples. It deliberately decided not to hold prior consultations. It\nseems the ministry had a preconceived view that any prior consultations\nwere unlikely to be productive as far as it was concerned.\n\n\nBy stipulating a blanket, uniform royalty rate of 0.05% for each product,\nthe ministry also failed to consider the individual merits of the products.\nHad it done so and given the patent holders the opportunity to present\ntheir cases, it may have realised each product and each CL is different,\nand accordingly the rates ought to have been different and more adequate.\n\n\nTrips is an international treaty to which Thailand is as signatory. Under\nthe new interim constitution, Thailand has an obligation to comply with its\nobligations under international treaties, including Trips. We will explore\nthe legal implications of this obligation in our next article.\n\n\nPeerapan Tungsuwan is a partner at Baker & McKenzie. She can be reached at\npeerapan.tungsuwan@bakernet.com. William McKay is a consultant with the\nfirm, and can be reached at william.mckay@bakernet.com.\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}