{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Michael Steffen <michael.steffen@yale.edu>", "subject": "[Ip-health] Boston Globe: Biotech -- Not Just For the Rich", "body": "See below the top editorial in yesterday's Boston Globe.\n\nMichael Steffen\nExecutive Director\nUniversities Allied for Essential Medicines\n\n\n> GLOBE EDITORIAL\n> Biotech: Not just for the rich\n>\n> May 8, 2007\n>\n> BEHIND THE vibrancy of the life sciences industry so visible at the\n> 2007 BIO convention this week in Boston is a sobering statistic\n> from the World Health Organization: Each year, 10 million people in\n> poor nations die because they lack access to existing medicines or\n> vaccines. In his keynote address yesterday, Michael J. Fox, the\n> actor and founder of a Parkinson's disease research foundation,\n> said that of the 30,000 known human diseases, there are treatments\n> for just 10,000. Many of the diseases without treatments afflict\n> residents of resource-poor countries, which draw little interest\n> from drug makers.\n>\n> This is a challenge for biotech that goes beyond finding life-\n> extending medications for cancer victims or a drug to encourage the\n> good cholesterol, as important as such advances would be. In much\n> of the world, preventable or treatable illnesses like tuberculosis\n> and cervical cancer are still major killers. In his videotaped\n> remarks to BIO yesterday, Senator Edward Kennedy called for one\n> approach to this imbalance in the world's access to the fruits of\n> biotechnology. His reform legislation for the Food and Drug\n> Administration includes a plan for accelerated FDA review of drug\n> candidates for tropical diseases.\n>\n> Last year, Senator Patrick Leahy sponsored a bill to ensure that\n> medical technologies developed at federally funded labs would be\n> available not just to branded drug makers but also to low-cost\n> generic drug makers serving developing countries. This is also the\n> goal of a student group called Universities Allied For Essential\n> Medicines. It wants research universities that hold rights to new\n> medical discoveries to license them to branded drug makers with the\n> condition that they be usable by generic makers in developing\n> countries.\n>\n> When generic makers are granted these rights, neither the\n> universities nor the pharmaceutical companies lose substantial\n> revenues, since the patented, branded versions of the drugs are\n> usually unaffordable in low-income countries. At a UAEM meeting at\n> Harvard last month, Dr. Jim Kim, the former AIDS director for WHO\n> and now chairman of the Department of Social Medicine at Harvard\n> Medical School, urged students to pressure universities to insist\n> on making their technology accessible to the poor.\n>\n> The benefits of medical advances from earlier generations could\n> also save lives with more support from the West and from the\n> developing countries themselves. In a report released this week,\n> Save the Children says that 400,000 children die each year of\n> measles, which can be prevented by a 15-cent vaccine. \"We must lead\n> in compassion as we have led in innovation,\" Kennedy told the BIO\n> audience. Researchers, drug company executives, and elected\n> officials should seek all possible ways to make the miracles of\n> medicine the birthright of all, not just the rich.\n>\n>\n>\n> http://www.boston.com/news/globe/editorial_opinion/editorials/\n> articles/2007/05/08/biotech_not_just_for_the_rich/\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}