{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "ben.krohmal@keionline.org", "subject": "[Ip-health] BBC on Thai CLs", "body": "http://news.bbc.co.uk/2/hi/asia-pacific/6587379.stm\n\nThailand takes on drugs giants\nby Jonathan Head\nBBC News, Bangkok\n\nThe Thai government's decision to break the patents on two Aids drugs and\none heart drug, so it can offer them to all Thai citizens, is a bold move,\nwhich has put the country on a collision course with the big\npharmaceutical firms.\n\nSix years ago I visited a clinic outside Bangkok, where a locally-made\npill, called V1 Immunitor, was being distributed.\n\nThe claim that it could treat HIV/Aids was widely discredited, yet the\nqueues went right around the block.\n\nThe people waiting patiently in the Bangkok heat came from all walks of life.\n\nThere were street vendors, civil-servants and respectable-looking\nmiddle-class women - evidence of the extraordinary reach of the HIV/Aids\nepidemic in Thailand.\n\nFew were under any illusions that V1 Immunitor would help them, but then\nwhat did they have to lose?\n\nNone could afford the anti-retroviral drugs (ARVs) available in Europe and\nthe US.\n\nTo them, the HIV virus was a virtual death sentence.\n\nGeneric copies\n\nFast-forward six years, and nobody talks about V1 Immunitor any more.\n\nAffordable ARVs are now available to tens of thousands of Thais - in fact\nmany do not pay anything at all for them, as they are provided by the\ngovernment's universal healthcare scheme or by HIV/Aids organisations.\n\nThis is possible because of Thailand's decision to make cheap, generic\ncopies of ARVs at a fraction of the cost of the branded drugs.\n\nIt is something the big pharmaceutical companies resisted at first, but\nthen went along with.\n\nBut they are strongly resisting Thailand's latest move. Last November the\nnew country's health minister, Dr Mongkol na Songkhla, announced he would\nissue what is known as a compulsory licence to manufacture low-cost\nversions of the HIV drug Efavirenz.\n\nEfavirenz - which is made by the German pharmaceutical giant Merck MSD,\nand protected by a patent in Thailand - is an alternative treatment for\npatients who do not respond well to the locally made ARVs.\n\nThree months later, Dr Mongkol announced that two more drugs would be\ntargeted with compulsory licences - the second-line ARV Kaletra, which is\nmanufactured by the US company Abbott and is important for HIV/Aids\npatients showing signs of resistance to first-line ARVs - and most\ncontroversially the heart-drug Plavix, manufactured by the French company\nNovartis.\n\nSuddenly Thailand, long seen as a loyal trading partner of the US, has\nseen its image transformed into that of a violator of intellectual\nproperty rights.\n\nIts decision has been condemned by the pharmaceutical industry, but\napplauded by non-governmental organisations campaigning for wider access\nto affordable medicines.\n\nActually what Thailand has done is completely legal under international\ntrade regulations.\n\nThe landmark 1995 World Trade Organisation agreement on intellectual\nproperty, Trips, gives governments a large amount of freedom to bypass\npatents on drugs if they face any kind of health crisis.\n\nThe language of the agreement is vague. It recommends that governments\nconsult the drug companies first, and requires them to pay a small\nroyalty. But crucially, the government itself can decide what constitutes\na health crisis.\n\nThe drug companies have always assumed that the Trips exception would only\nbe used for a dire emergency, like HIV/Aids or avian flu.\n\nIssuing a compulsory licence for a heart drug, they say, breaks the spirit\nof the agreement.\n\nAbbott has now withdrawn all its future products from the Thai market -\nincluding a new heat-resistant form of Kaletra which is desperately needed\nby HIV patients.\n\nHealthcare for all\n\nDr Mongkol is quite open about his motives for challenging the patents on\nthese three drugs.\n\n\"Our health system is in danger of going bankrupt,\" he said, \"and one of\nthe biggest expenses we face is the cost of drugs.\"\n\nA developing country now approaching middle-income status, Thailand has\nvery high levels of heart disease.\n\nAt Bangkok's main chest hospital, doctors say they spend almost 20% of\ntheir entire budget on Plavix, which is why it was one of the drugs\ntargeted.\n\nBut should a developing country be allowed to fund its public health\nservice by breaking the patents of drugs developed by multi-national\npharmaceutical companies?\n\nThailand is one of the first countries at its income level to introduce\nsuch a service.\n\nRicher countries like Britain have difficulty funding their health\nsystems; Thailand, with a much lower government budget, inevitably finds\nit harder still.\n\nThe nationwide health scheme was first introduced in 2001 by then-Prime\nMinister Thaksin Shinawatra, who had a gift for coming up with populist\npolicies that would keep getting him elected.\n\nWhen he was over-thrown by a military coup last September, the new\ngovernment, needing to shore up its own legitimacy, went even further and\neliminated the nominal charge for treatment.\n\nIt was encouraged in this by Dr Mongkol, who suddenly found himself\npromoted to becoming a minister after 40 years fighting for better health\ncare as a career civil servant in the Ministry of Health.\n\nSupporters of the compulsory licences, like Paul Cawthorne from Medicins\nSans Frontiers, believe Thailand's bold step is the right one.\n\nHe argues that the big pharmaceutical companies make plenty of money from\nless essential drugs, like Viagra, and that they spend a lot more on\nadvertising their products than they do on research and development.\n\nMuch of the research in the US is, in any case, done by government-funded\nuniversities, he says.\n\nHe is calling for a radical shake-up in the pricing of a whole range of\nessential drugs, to make them affordable in every country - and he\nbelieves Thailand has set an example other governments should follow.\n\nOpponents argue that governments cannot feel free to break the patents on\nany drugs they choose, just to fund cheap healthcare for their citizens.\n\nThat, they say, destroys the incentive to develop new drugs.\n\nBacking down?\n\nBut the situation varies enormously from country to country.\n\nUntil recently India, for example, did not recognise the patents of\nmultinational drug companies, and has built up a huge industry making\ncheap generic drugs without incurring the wrath of the industry.\n\nBecause Thailand went along with patent protection many years ago, it is\nbeing criticised for following India's example.\n\nIndeed, some of the cheap drugs Thailand now wants to give its patients\nare actually imported from India.\n\nTellingly the US, normally a vocal defender of intellectual property\nrights, has not criticised Thailand's decision, nor has the World Health\nOrganization.\n\nThe drug companies are also showing signs of flexibility, offering\nsignificant price cuts to Thailand.\n\nEven Abbott, which has taken the most hardline stand, is under great\npressure to reverse its decision to pull future products from the Thai\nmarket.\n\nWhatever the rights and wrongs of Thailand's drugs pricing policy, it\nlooks as though Dr Mongkol is starting to win his battle for affordable\nhealthcare.\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}