{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nTuesday, 26 June, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nEriksson set to take Man City job\nFormer England coach Sven-Goran Eriksson agrees a three-year deal in principle to take over at Man City.\n\n\n\n \nEriksson targets Sweden assistant\nSweden's assistant manager, Roland Andersson, says Sven-Goran Eriksson has contacted him about being his number two at Man City.\n\n\n\n \nFour resign from Newcastle board\nFour of Newcastle's' board members resign, while two new appointments are made.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nCabrera set to compete at K Club\nUS Open champion Angel Cabrera will compete in the European Open at the K Club in Ireland next week.\n\n\n\n \nMonty hires Casey's former caddie\nColin Montgomerie is to employ caddie Craig Connolly, who recently split with Paul Casey, for the French Open.\n\n\n\n \nFasth holds on to thwart Langer\nNiclas Fasth wins the BMW International Open by two shots from Jose-Filipe Lima and Bernhard Langer.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nDennis should enjoy battle - Hill\nDamon Hill says McLaren boss Ron Dennis to sit back and enjoy Lewis\nHamilton and Fernando Alonso's world championship tussle.\n\n\n\n \nStoner scorches to Donington win\nChampionship leader Casey Stoner produces another dominant display to win the British MotoGP.\n\n\n\n \nFerrari mechanic denies sabotage\nFerrari technical manager Nigel Stepney denies allegations of sabotage made against him by the F1 team.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nDennis should enjoy battle - Hill\nDamon Hill says McLaren boss Ron Dennis to sit back and enjoy Lewis\nHamilton and Fernando Alonso's world championship tussle.\n\n\n\n \nFerrari mechanic denies sabotage\nFerrari technical manager Nigel Stepney denies allegations of sabotage made against him by the F1 team.\n\n\n\n \nFerrari wait for 'real Raikkonen'\nFerrari president Luca di Montezemolo says they are still waiting for Kimi Raikkonen to produce his best form.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nGay to take on Don Valley clock\nThis season's fastest man, Tyson Gay, is lined up for the for the Norwich Union Grand Prix in Sheffield.\n\n\n\n \nInjury may ruin Powell's $1m bid\nAsafa Powell could miss the Golden League meeting in Paris after suffering a groin injury in the 100m at the Jamaican championships.\n\n\n\n \nDevonish leads GB to fourth place\nBritain's men finish fourth in the European Cup, while the women secure promotion back to the top flight.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nCooke excited by home race return\nNicole Cooke will make a rare appearance on home soil on Wednesday when she competes in the Ras de Cymru.\n\n\n\n \nCavendish can be a star - Museeuw\nBelgian cycling great Johan Museeuw believes Mark Cavendish can help take cycling to a wider audience in Britain.\n\n\n\n \nCooke retains Grande Boucle title\nNicole Cooke successfully defends her Grande Boucle Feminine title by winning the 2007 tour in France.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nQuotes of the Week\nThierry Henry is gunning for Barcelona, plus Jose Mourinho gets fruity\n\n\n\n \nTeesside tennis\nRobbo wonders what would happen if Wimbledon came to the north east\n\n\n\n \nTen to Tackle\nHow much can you remember about the past week's sport?\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}