{"category": "ham", "to_address": "\"Wensui Liu\" <liuwensui@gmail.com>", "from_address": "\"Greg Snow\" <Greg.Snow@intermountainmail.org>", "subject": "Re: [R] Reasons to Use R", "body": "I think SAS has the database part built into it.  I have heard 2nd hand\nof new statisticians going to work for a company and asking if they have\nSAS, the reply is \"Yes we use SAS for our database, does it do\nstatistics also?\"  Also I heard something about SAS is no longer\nconsidered an acronym, they like having it be just a name and don't want\nthe fact that one of the S's used to stand for statistics to scare away\ncompanies that use it as a database.\n\nMaybe someone more up on SAS can confirm or deny this.\n\nAlso one issue to always look at is central control versus ease of\nextendability.  If you have a program that is completely under your\ncontrol and does one set of things, then extending it to a new model\n(big data) is fairly straight forward.  R is the opposite end of the\nspectrum with many contributers and many techniques.  Extending some\nbasic pieces to be very efficient with big data could be done easily,\nbut would break many other pieces.  Getting all the different packages\nto conform to a single standard in a short amount of time would be near\nimpossible.\n\nWith R's flexibility, there are probably some problems that can be done\nquicker with a proper use of biglm than with SAS and I expect that with\nsome more work and maturity the SQLiteDF package may start to rival SAS\nas well on certain problems.  While SAS is a useful program and great at\ncertain things, there are some tecniques that I would not even attempt\nusing SAS that are fairly straigh forward in R (I remember seeing some\nSAS code to do a bootstrap that included a datastep to read in and\nextract information from a SAS output file, <>  SAS/ODS has\nimproved this, but I would much rather bootstrap in R/S-PLUS than\nanything else).\n\nRemember, everything is better than everything else given the right\ncomparison.\n\n-- \nGregory (Greg) L. Snow Ph.D.\nStatistical Data Center\nIntermountain Healthcare\ngreg.snow@intermountainmail.org\n(801) 408-8111\n \n \n\n> -----Original Message-----\n> From: Wensui Liu [mailto:liuwensui@gmail.com] \n> Sent: Tuesday, April 10, 2007 3:26 PM\n> To: Greg Snow\n> Cc: Bi-Info (http://members.home.nl/bi-info); Gabor \n> Grothendieck; Lorenzo Isella; r-help@stat.math.ethz.ch\n> Subject: Re: [R] Reasons to Use R\n> \n> Greg,\n> As far as I understand, SAS is more efficient handling large \n> data probably than S+/R. Do you have any idea why?\n> \n> On 4/10/07, Greg Snow  wrote:\n> > > -----Original Message-----\n> > > From: r-help-bounces@stat.math.ethz.ch \n> > > [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Bi-Info \n> > > (http://members.home.nl/bi-info)\n> > > Sent: Monday, April 09, 2007 4:23 PM\n> > > To: Gabor Grothendieck\n> > > Cc: Lorenzo Isella; r-help@stat.math.ethz.ch\n> > > Subject: Re: [R] Reasons to Use R\n> >\n> > [snip]\n> >\n> > > So what's the big deal about S using files instead of \n> memory like R. \n> > > I don't get the point. Isn't there enough swap space for S? (Who \n> > > cares\n> > > anyway: it works, isn't it?) Or are there any problems with S and \n> > > large datasets? I don't get it. You use them, Greg. So you might \n> > > discuss that issue.\n> > >\n> > > Wilfred\n> > >\n> > >\n> >\n> > This is my understanding of the issue (not anything official).\n> >\n> > If you use up all the memory while in R, then the OS will start \n> > swapping memory to disk, but the OS does not know what \n> parts of memory \n> > correspond to which objects, so it is entirely possible \n> that the chunk \n> > swapped to disk contains parts of different data objects, \n> so when you \n> > need one of those objects again, everything needs to be \n> swapped back \n> > in.  This is very inefficient.\n> >\n> > S-PLUS occasionally runs into the same problem, but since \n> it does some \n> > of its own swapping to disk it can be more efficient by swapping \n> > single data objects (data frames, etc.).  Also, since S-PLUS is \n> > already saving everything to disk, it does not actually \n> need to do a \n> > full swap, it can just look and see that a particular data \n> frame has \n> > not been used for a while, know that it is already saved on \n> the disk, \n> > and unload it from memory without having to write it to disk first.\n> >\n> > The g.data package for R has some of this functionality of keeping \n> > data on the disk until needed.\n> >\n> > The better approach for large data sets is to only have some of the \n> > data in memory at a time and to automatically read just the \n> parts that \n> > you need.  So for big datasets it is recommended to have the actual \n> > data stored in a database and use one of the database connection \n> > packages to only read in the subset that you need.  The SQLiteDF \n> > package for R is working on automating this process for R.  \n> There are \n> > also the bigdata module for S-PLUS and the biglm package for R have \n> > ways of doing some of the common analyses using chunks of data at a \n> > time.  This idea is not new.  There was a program in the late 1970s \n> > and 80s called Rummage by Del Scott (I guess technically it \n> still exists, I have a copy on a 5.25\"\n> > floppy somewhere) that used the approach of specify the model you \n> > wanted to fit first, then specify the data file.  Rummage \n> would then \n> > figure out which sufficient statistics were needed and read \n> the data \n> > in chunks, compute the sufficient statistics on the fly, \n> and not keep \n> > more than a couple of lines of the data in memory at once.  \n> > Unfortunately it did not have much of a user interface, so \n> when memory \n> > was cheap and datasets only medium sized it did not compete well, I \n> > guess it was just a bit too ahead of its time.\n> >\n> > Hope this helps,\n> >\n> >\n> >\n> > --\n> > Gregory (Greg) L. Snow Ph.D.\n> > Statistical Data Center\n> > Intermountain Healthcare\n> > greg.snow@intermountainmail.org\n> > (801) 408-8111\n> >\n> > ______________________________________________\n> > R-help@stat.math.ethz.ch mailing list\n> > https://stat.ethz.ch/mailman/listinfo/r-help\n> > PLEASE do read the posting guide \n> > http://www.R-project.org/posting-guide.html\n> > and provide commented, minimal, self-contained, reproducible code.\n> >\n> \n> \n> --\n> WenSui Liu\n> A lousy statistician who happens to know a little programming\n> (http://spaces.msn.com/statcompute/blog)\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}