{"category": "ham", "to_address": "GNITPICK@SPEEDY.UWATERLOO.CA", "from_address": "Bicycling <BikeNews@rodale.com>", "subject": "Build Strength, Speed, and Endurance...", "body": "\n\nBicycling's Maintenance Repair Guide\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Spie,\nInside this revised popular guide, you’ll find thousands of up-to-date tips to repair and maintain any road or mountain bike.\nWhether you have the latest model or a classic that has thousands of miles on it, both beginning and experienced riders can keep their bikes on the road longer and spend less time in the repair shop. \nWith this ultimate repair manual, you can:\n\n\nBuild a dream bike workshop of your own, using complete plans and comprehensive tool lists\n\nFix roadside and trailside breakdowns quickly and with a minimum of tools\n\nLearn the principles of suspension tuning for top performance and comfort\n\nSet up and maintain all styles of rim and disc brakes, including hydraulic models\n\nKeep wheels spinning smooth and true\n\nChoose a frame design that best fits your body and riding style\n\nDiscover top tricks from professional mechanics\n\nWhat’s new in the expanded and revised fifth edition?\n\n\n\n\n\n\n\n\n\n\nUpdated text that covers the latest models and parts\n\nMore than 250 new photos so you get repairs right the first time\n\nClearer, better-designed captions so you can read as you repair\n\nTroubleshooting sections to quickly identify and correct common problems\n\nWeb sites and phone  numbers for dozens of bicycle and parts manufacturers\n\nAn updated glossary with technical terms and jargon to help you understand and be understood\n\n\n\n\n\n\n\nBest of all, you can give this amazing book a try— FREE for 21 days  with no obligation whatsoever! You pay nothing unless you’re totally satisfied. Click here!\nSincerely,\n\nChris Cunningham\nBicycling Magazine\n\n\n\n\n\n\n\n\n\nUnsubscribe   |   Privacy Policy\n\n\n\n\n\n\n\n\n\n\nCustomer Service Dept., 33 East Minor Street, Emmaus, PA 18098\n© 2007 Rodale Inc., all rights reserved.\n\n\n\n\n\n\n\n"}