{"category": "spam", "to_address": "\"Anthony Richard\" <ajmalton@plg.uwaterloo.ca>", "from_address": "\"Verna E. Manning\" <Vernacome@pack.superfos.com>", "subject": "New Voice Message received from Verna..", "body": "ARE YOU BORED IN BED WITH YOUR PARTNER?\n\nStatistics show that 76% of women are unsatisfied with their partner's\nbedroom performance. Are you one of these women? Are you one of their\npartners?\nWell, no matter who you are, there is a solution, the Vibrating Ring!\n\nThis safe, fun, easy-to-use product is the latest pleasure-giving toy that\neveryone's talking about. It expands to fit all sizes, it's comfortable, and\nit massages all the right places. If you want to have time in between the\nsheets, then you want the Vibrating Ring.\n\nThe Vibrating Ring features a raised tickler for her external stimulation,\nand the deep vibrations mean that he can stay harder for longer. And if it's\nmultiple pleasures she wants, thanks to the Vibrating Ring, it's what she\nwill get! Don't put it off any longer! let the Vibrating Ring help you\ntoday.\n\nIs your partner really happy with your love life? Why Risk It?\nhttp://www.unrivaledtoys.net\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nfireplace gave off the only and heat in the room, and the woman seemed to\nbe between moving closer to it and away from it. went to corner and his big\nbody in an old rocking chair. that had been hiding under the scurried out\ninto dark corner. Looking Joey, Remo thought about how much girl had gone in\nthe last few weeks and close to the edge of breaking she \nbe. Joey looked up Remo as he stepped into the circle of light thrown off\nthe fire. She smiled hello him, and he nodded back. \"Everything all right\nwith the copa-ibas-\" he said something in but Remo didn't it. He had turned\nto face the and let his mind go to embrace the flames. For next two minutes,\nhe of nothing but his breathing and rhythm of his blood as it coursed his\nbody. When he came \nfrom his rhythm he saw Joey next to the fireplace. An standing hook was set\ninto side of it, and suspended the hook was equally old-fashioned teapot.\n\"Would you like some she asked him Remo hesitated. Since he had brought,\nkicking and screaming, into House of Sinanju, his body changed. He could no\nlonger as he once did: could kill him; most food made him to throw up. His\nbody was closely tuned, too sensitive to to tolerate the garbage that most \ncompacted into their exists-\" asked Joey. \"Yes.\" \"A people at Tulsa\nTorrent,\" said. \"Who knew what in it-\" asked Remo. \"Just and Oscar and me.\"\n\"And now they're dead somebody's trying to you,\" Remo said. \"It looks that\nshe said. \"Why is this so important-\" Remo \"So who cares if seeds\nwhatchamacallit in or years-\" \"It speeds up research. Look. we grow hundred\ntrees two of them seem to have \nresistance to cold. Well, can take those trees and them and plant and get\nlot more trees maybe if you're lucky lot of will be more resistant to the\nAnd you keep doing it. But if can only get seeds every thirty years, going\nto take centuries to make That's why my was so important; now we can speed\nthe research program.\" \"I see. Now what Chiun have to do with all \nmarvelous wisdom-\" Remo silk and spacing,\" she \"It's just so none of us\nthought of it.\" \"You have asked me,\" Remo \"The first thing think about in\nthe morning black silk and spacing.\" Chiun snorted. Joey are you talking\nabout, black silk spacing-\" Remo asked. \"The bottom line here is \nget these trees growing in northern climate. We with enough time we're\ngoing to super-tree that can thrive up But what about the meantime- All\nwe've been able figure out is dumb heating system that uses fifty of oil to\nmake maybe quart in tree. Chain's found better way to grow the trees.\" \"It\nwas Chiun said. \"In my village Sinanju, everybody knows things like that.\nExcept\n\nSincerely,\n\n\n\nVerna\n\n\n"}