{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "John Baldwin <editor@gocwi.org>", "subject": "Report", "body": "\n\nAre you afraid that she will meet someone who is better than you in bed? \nClick here to be the best lover in the world!\nWe have only high-quality national medications at low prices. There is no need for someone to know about your sexual problems. \nGo to the site\nThe highest quality, cheap prices, instant shipping worldwide, friendly support!\nWith best regards,\nJohn Baldwin\n \n \nREALNOST KLINKA Ochen dolgo ia visel v pustote, ne chuvstvuia tela, lishennyj vospriiatiia Vseh organov chuvstv zreniia, sluha, osiazaniia i obonianiia. Pishcha dlia Zlydnia imelas v izbytke. Ia popytalsia proshchupat svoej novoj sposobnostiu ego Istinnye emocii, skrytye pod lakirovannoj privetlivostiu, ne slishkom nadeias Na to, chto mne eto udastsia, eto ne udalos dazhe Nkotu, kotoryj byl ochen Udivlen v svoe vremia etim obstoiatelstvom. Kak liubaia kiberneticheskaia sistema, Ferma naverniaka zapomnila adres Perepravki poslednego klienta, i vriad li ej sostavit trud dostavit menia v To zhe mesto. \nChto zh, ostavalos tolko priznat, chto etomu Posviashchennomu ego magicheskij klinok ne pomog, kak i Drahubu. V pervyj i Poslednij raz, poklialsia ia pro sebia uzh ne znaiu v kotoryj raz, gliadia vsled etoj Vysokoj i mrachnoj figure, napravivshejsia k stojke bara. Esli ia sejchas ne pridumaiu, kak s etim spravitsia. Togda primenim odnu iz celoj kuchi vozmozhnostej, imeiushchihsia u menia v Zapase. Poka on pytalsia otdyshatsia, ia vrezal emu V visok, chuvstvuia, kak beznadezhno bystro rasseivaiutsia, uhodiat sily. V dushu Taj vkralis pervye podozreniia. Aura demona vdrug vzorvalas, vybrosiv v storonu terha desiatki zubastyh Mysleshchupalec, i svirepaia oglushaiushchaia bol ohvatila telo dal-rokta s golovy do Nog, kazalos razryvaia ego v melkie krovotochashchie klochia. Koncy brevna skryvalis v zarosliah po obe storony dorogi, tak chto Neponiatno bylo, gde komel, a gde verhushka, ono bylo rovnym po vsej dline. \nRech idet o tvoej zhizni, i sejchas dlia tebia Doroga kazhdaia minuta. No pered etim ia spushchu na nego tebia i posmotriu, chego stoiat Tvoi mechi v boiu, a tvoia preslovutaia zhazhda mesti na dele. Na zvuki padeniia obernulsia sedousyj. Ego ogromnogo Rosta na eto hvatilo. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}