{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Norma Coffman\" <cebcaltekusahog@caltekusa.com>", "subject": "You'll love the new, non-obese you", "body": "\nCheck out the wonders of pound melting\n\n\n\n\n\nAnatrim – The newest and most fascinating flesh loss product is made available now – As you could see on Oprah\n\n\n\nDo you see excessive body kilograms kill more and more people for every new year? We know that you hate the unattractive appearance of those people and the low status they have in modern society. \n\nOr, maybe, you can’t resist a pressure of your pernicious eating habits. If this all sounds familiar, then we have something for you!\n\n\n\n\n\nWe’re proudly introduce you Anatrim, the new product for the elimination of your body’s extra weight. The greatest thing is that Anatrim raises the quality of your life by making you eat less and giving you better mood. Note what people write about this product:\n\n\n\n\n\n\"It is amazing! \n\n\nInstead of gorging any food close at hand and watching TV \n\n\nI became more interested in doing exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I have a great shape now and there are lots of men around me!\"\n\n\n\n\n\n\nLusia R., Bellevue WA\n\n\n\n\n\n\n\"I tried some passive weight reducing, but with little result. It was difficult for me to hold back and not to eat something just at hand. \n\n\nOnce I heard about Anatrim from my very best friend and I rather liked the information.\n\n\n I had tried using it, and my wife said to me that I had changed for the better since then, 5 months later. \n\n\n27 pounds have gone away and I continue to become slimmer! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nRikky Martin, Colorado\n\n\n\n\n\nAnatrim gives you an opportunity to understand that you doesn’t have such a great need for the constant eating. It raises your mood up, supplies you with extra energy, and attacks useless kilos. Great thanks to its mighty comprehensive formula!!\n\n\n\nPry out more!\n\n\n\n"}