{"category": "spam", "to_address": "Gnitpick <gnitpick@flax24.uwaterloo.ca>", "from_address": "Nicolas Vaughan <jmandymoorethailand@greaterannapolisreikicenter.com>", "subject": "Straining yourself when you are with a woman?", "body": "\n\nIs there any reasons to pay more? Do you want to save your money? I bet you do! \nOur shop\nYou can spend thousands and buy pills at your local drug store. But you can spend less by ordering the same quality Viagra and Cialis at Online pharmaceuticals.\nClick here to become a sex giant\nWe offer only legal and licensed medications. Cheapest prices you ever seen.\nWith best regards,\nNicolas Vaughan\n \n \nOt Silnejshego potriaseniia soznanie sorvalos i zaskolzilo v nebytie, no sily Gruppy tut zhe podhvatili ego. I kak ni Stranno, potoki neveroiatnyh krasok, zvukov, oshchushchenij i obrazov, stremitelno Dopolniaias mnozhestvom ranee nedostupnyh, nevedomyh podrobnostej, ne Dezorientirovali, a, naprotiv, vyiavliali melchajshie detali okruzhaiushchego Prostranstva. Ili, Naprimer, chto Geroem mozhet stat nekto, voobshche ne prinadlezhashchij k etomu miru, to Est liuboj chuzhak, pribyvshij iz-za Sfery. Siglajzer ia poluchil ot nanimatelia v chisle Prochih universalnyh veshchic i ne somnevalsia, chto poslednemu prishlos vylozhit za Modifikaciiu pribora kruglenkuiu summu. \nOn zhil sam po sebe, vpletaia nas v svoiu tkan Kak estestvennye sostavliaiushchie prichudlivye uzelki edinoj energeticheskoj Seti, raskinutoj v bespredelnom prostranstve. A chto za Solnce! Kakaia-to blednaia kliaksa, izredka progliadyvaiushchaia skvoz sluchajnye razryvy Tuch v tshchetnoj popytke osvetit prostiraiushchuiusia pod nej zemliu. Nori, s izumleniem prosheptal ia, chto ty zdes delaesh? Ia chuvstvoval ee vzgliad, ustremlennyj na menia skvoz temnuiu vual. Devochka Zakonchila zhenskij kolledzh na svoej rodnoj planete, i ia vez ee na sheltu, Chtoby pokazat svoe korolevstvo. Blizhe. Ledianye potoki vozduha, nepreryvno Tekushchie snizu. Net. Malovato, Celitel. \nNo s takim zhe uspehom Nori mogla iskat sochuvstviia u ogorodnogo pugala, Nabitogo solomoj i obveshannogo starym triapem dlia ustrasheniia pernatyh. S postroeniem fraz u etogo mladshego kurera iavno byli problemy. Mne nechego teriat, a mestsladkaia shtuka, i ia hochu dostavit sebe Podobnoe udovolstvie, raz ono budet poslednim v moej zhizni. Ne izdav ni zvuka, on vzmetnul priklad smercha vverh. ejisuminyon VVFcRlhQUVh0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}