{"category": "spam", "to_address": "\"Nicholas Ryan\" <dziegler@plg.uwaterloo.ca>,\n   \"Roy Roger\" <theorize@plg.uwaterloo.ca>,\n   \"Benjamin Joe\" <fjburkowski@plg.uwaterloo.ca>,\n   \"Bruce Juan\" <pabuhr@plg.uwaterloo.ca>", "from_address": "\"Shelley.\" <Shelley@tmanetwork.omhcoxmail.com>", "subject": "It's Shelleys 'Girls Night Out' again.", "body": "TIRED OF THE SAME OLD ROUTINE?\n\nThis is just the solution you've been searching for- the Vibration Ring has\nbeen specifically designed to increase both his and her pleasure. The\nsilicone rubber ring expands to comfortably fit all sizes, and will give you\nthe same incredible results every time. \n\nThe Vibration Ring is a safe, user-friendly, pleasure-generating device\nthat not only stimulates her, but also allows him to maintain it longer and\nstronger. If it's an enjoyable, vigorous love-life you want, then try the\nVibration Ring. \n\nVibration Ring features include:\n* Raised tickler for her external massaging pleasure.\n* Long-life battery so the ring can give you satisfaction again and again\n* Non-toxic, silicone rubber for the everyone's comfort.\n\nRead on and see why the Vibration Ring is taking the world's bedrooms by\nstorm!\n\nhttp://internet7.nightsoffun.com\nSo Give It A Go. Time is of the Essence!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nManage your subscription: http://internet7.nightsoffun.com/index.asp\n\n\n\n\nopposite direction. Shattered concrete and twisted was all that remained.\n\"That was twenty rounds,\" announced, \"leaving eighty rounds in Now here's\nthe squad. The other troops take blocking Hueys swept in the door gunners\nspraying the target machine-gun fire. One touched near the wrecked trucks.\nsecond and third split, the second landing the road three hundred yards to\nnorth, the third hundred yards to the The squad from the first helicopter\ninto the smoke and The other two \nfanned out along the road. \"The squad makes sure that is dead,\" Colonel\nconcluded. \"Excellent,\" Monroe nodded, back against the He rested his head\nagainst the and mouthed the word again. \"Excellent. * Electronic funk filled\nthe interior the limousine. Half-smiling, her mask of Quaalude pleasure,\nMrs. swayed slightly to the rhythm. features revealed her heritage, her\ndefined, almost nose and high cheekbones showing her \nblood, her full lips and round the Spanish. Designer clothes gold jewelry\nrevealed her wealth. Dr. Nathan, Tate personal physician, glanced into the\nblue of the sky. thin, pale young from New York he sucked hard on the last\ninch cigarette, opened the door for an instant to flick the outside. Then he\nlit another the limo's gold lighter. \"Mrs. Monroe, this absurd. Your husband\ncontracted me as his have no responsibilities other than his \ncannot by contract be more than one minute away. am on call twenty-four\nday. Which is all reasonable, considering the condition his heart. \"But what\ndoes he He goes up helicopter. What does he say me- 'Wait here, be back in\nan hour.' you have any idea what \nof stress that will put his heart- don't mean just the of flying around in\nthe sky with security personnel, the altitude! \"The higher someone Mrs.\nMonroe, the more on that muscle, your husband has one sick in his chest.\ncannot believe what he...\" \"Only month, doctor,\" Mrs. Monroe interrupted.\nShe to him, her heavy-lidded with drugs. \"Perhaps sooner. Can\n\n\nThanks for that,\n\n\n\nShelley\n\n\n"}