{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 98", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Recuperan cuatro pinturas valuadas en U$S 80.000\n      (Museum Security Network Mailing list)\n   2. Education in the field of CP Protection\n      (Museum Security Network Mailing list)\n   3. Egyptian statue that cost council ?440,000 is a forgery\n      (Museum Security Network Mailing list)\n   4. Dealer changes position in dispute over Renoir-Guino bronzes\n      (Museum Security Network Mailing list)\n   5. Gewissen oder Geldgier, Konferenz zum Thema Raubkunst\n      (Museum Security Network Mailing list)\n   6. Court rules Italy should return Venus to Libya\n      (Museum Security Network Mailing list)\n   7. Replica of prehistoric croc stolen\n      (Museum Security Network Mailing list)\n   8. Foreign smugglers target China's sunken treasures\n      (Museum Security Network Mailing list)\n   9. Oslo court sentences three in theft of Munch paintings\n      (Museum Security Network Mailing list)\n  10. Man held for stealing painting from sister\n      (Museum Security Network Mailing list)\n  11. Four on fake statue charge (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Mon, 23 Apr 2007 20:31:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Recuperan cuatro pinturas valuadas en U$S 80.000\nTo: Museum Security Network Mailinglist \nMessage-ID: <462CFB68.3010808@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nRecuperan cuatro pinturas valuadas en U$S 80.000\nHab?an sido robadas de un museo mendocino. El departamento Interpol de \nla Polic?a Federal las encontr? en una galer?a de arte en Capital Federal\n\nCuatro pinturas valuadas en 80,000 d?lares, que hab?an sido robadas de \nun museo de la provincia de Mendoza, fueron recuperadas por el \ndepartamento Interpol de la Polic?a Federal en una galer?a de arte del \nporte?o Barrio Norte, informaron hoy fuentes policiales.\n\nSe trata de una acuarela sobre papel denominada \"Botes\", de Jorge Larco, \notra sobre papel denominada \"Ma?ana en Venecia\", de Aquiles Badi, y dos \n?leos sobre tela denominados \"Pensativa\", de Horacio Bultler, y \n\"Pasan...1939\", de Raquel Forner.\n\nLas obras de arte fueron recuperadas en el marco de las investigaciones \ndesarrolladas por la Interpol, en cumplimiento de sus funciones \nespec?ficas de prevenci?n y represi?n del tr?fico il?cito de bienes \nculturales.\n\nDurante la pesquisa, los investigadores hab?an tomado conocimiento de la \nreciente sustracci?n de varias obras pict?ricas de un museo de la \nprovincia de Mendoza, las cuales, seg?n los datos obtenidos, se estar?an \nofreciendo a la venta en alguna galer?a de arte de Barrio Norte.\n\nLa investigaci?n realiz? bajo las directivas del titular del Juzgado de \nInstrucci?n 3 de San Rafael, Mendoza, Gabriel Oscar Ravagnani Navarrete.\n\nhttp://www.eldia.com.ar\n\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Sun, 22 Apr 2007 08:28:59 -0700\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Education in the field of CP Protection\nTo: msn-list@te.verweg.com\nMessage-ID: <2E542B8F-BA52-41B9-B077-269A41B9C9B1@earthlink.net>\nContent-Type: text/plain; charset=US-ASCII; delsp=yes; format=flowed\n\nGreetings,\n\nMy name is Christine C. Maasdam. I am presently a subscriber to the  \nmsn-list link.\n\nI would like to inquire into how one becomes professionally involved  \nin the developing field of protection and security of art.\n\nI hold a B.A. in Geography and a M.A. in Humanities. I am completing  \na Certification in Museum Studies with Lanier Graham at East Bay- \nHayward.\n\nAre there any forums, symposiums or programs that your organizations  \ncould point me towards?  I am aware of the IFCPP and am prepared to  \nattend the Chicago Workshop offered in conjunction with the AAM  \nConvention. I would be greatly interested in a more in depth program  \nthat would merge the academic with the security considerations.\n\nI would certainly appreciate and value your insight.\n\nThanking you in advance.\n\nBest thoughts,\n\nChristine C. Maasdam\nmaasdam@earthlink.net\n818.469.6907 mobile\n\n\n------------------------------\n\nMessage: 3\nDate: Mon, 23 Apr 2007 20:32:43 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Egyptian statue that cost council ?440,000 is a forgery\nTo: Museum Security Network Mailinglist \nMessage-ID: <462CFBCB.7000007@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n  Egyptian statue that cost council ?440,000 is a forgery\n\n23.04.07\n\nThe offer from the antiques dealer seemed too good to be true.\n\nHe had a 3,000-year-old Egyptian artefact, a statue of King Tut's \nhalf-sister, which had been in his family for more than a century.\n\nAnd although it was worth ?1million, he was prepared to sell it to his \nlocal authority for a knockdown ?440,000 so it could remain in his home \ntown.\n\nAfter experts from the British Museum and Christie's had vouched for its \nauthenticity, Bolton Council raised the money to buy the sculpture, \nknown as the Amarna Princess.\n\nIt was not until three years later, when a similar item arrived at the \nMuseum, that the Princess's guilty secret was exposed.\n\nShe was a fake. Far from being made in Ancient Egypt, the alabaster \nsculpture has more in common with Modern Lancashire. Police believe the \nsculpture was created in Bolton. When they raided a house in the town, \nthey discovered marble and other artists' equipment inside.\n\nAn elderly couple and their two sons have been arrested and charged with \noffences connected to forgery.\n\nThe 20-inch figure was said to date back to 1350 BC, and to be one of \nonly three known pieces from the period in existence. The forgery came \nto light when another sculpture, from Syria, was sent by a private \nclient for examination at the British Museum.\n\nThis time, experts failed to be taken in and on further investigation \ndiscovered that it must have come from the same dubious source as the \nAmarna Princess. Scotland Yard's Arts and Antiques squad seized the \nSyrian relief, along with two other pieces from London, and impounded \nthe Princess. But by then the sculpture, much feted despite its lack of \nhead, arms or lower legs, had been proudly displayed across Britain.\n\nThe vendor had claimed that his great-grandfather had bought it at the \nauction of the property of the Earl of Egremont in 1892. Bolton council \nofficials who uncovered a copy of the sale catalogue were unable to find \nany mention of the Princess in it. But they went ahead anyway.\n\nGrants were obtained of ?360,000 from the National Heritage Memorial \nFund, a part-Government funded body, as well as ?75,000 from the \nindependent charity the National Art Collections Fund and ? 2,500 from \nthe Friends of Bolton Museum and Art Gallery.\n\nA series of experts said that the woman was the daughter of King \nAkhenaten and Nefertiti, his most senior wife. Akhenaten was succeeded \nby Tutankhamun, his son by another wife.\n\nThe sculpture initially went on display at the the Hayward Gallery, on \nLondon's South Bank, as part of its Saved! celebration of 100 years of \nsaving art for the nation, before being moved to Bolton Museum in \nJanuary 2004.\n\nAt the time, securing the Princess was hailed as a great coup for the \ntown. Councillor Laurie Williamson, spokesman on culture, said: 'This \nlatest addition will enhance Bolton's reputation as a cultural \ndestination.' Last week, antiques dealer George Greenhalgh, 84, and his \n82-year- old wife Olive were quizzed by detectives from the Metropolitan \nPolice.\n\nThe couple and their 52-year- old son, Shaun, have each been charged \nwith conspiracy to defraud, including alleged offences of selling faked \nand forged works as genuine between 1989 and 2006 and money laundering \nthe proceeds of the sale of such antiques.\n\nGeorge Greenhalgh and Shaun Greenhalgh also face an additional charge of \nlaundering the proceeds of the sale of the Amarna Princess.\n\nThe couple's elder son, George jnr, aged 53, has also been charged with \nmoney laundering. The four are due to face Bolton magistrates on Thursday.\n\nhttp://www.thisislondon.co.uk\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Tue, 24 Apr 2007 06:47:33 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Dealer changes position in dispute over Renoir-Guino\n\tbronzes\nTo: Museum Security Network Mailinglist \nMessage-ID: <462D8BE5.7010803@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nDealer changes position in dispute over Renoir-Guino bronzes\n\nBy Georgina Adam \n \n| Posted 23 April 2007\n\nLONDON. Emmanuel Javogue, a US-based dealer who has opposed Renoir?s \ngreat-grandson Emmanuel in a long-running dispute over copyright to \nRenoir bronzes in the US, has now changed his position. He now claims \nthat many pieces he believed were authentic may actually be unauthorised \nfakes.\n\nMany ?Renoir-Guino? bronzes sold on the market have authenticity \nproblems, he says. ?I am disappointed by how the two families are \nhandling the heritage of their ancestors,? he told /The Art Newspaper/. \n?There is no respect for the oeuvre, it?s all about the money they can \nmake.?\n\n?Renoir-Guino? bronzes were made at the end of Renoir?s life when the \nartist used an assistant, Richard Guino, as his ?hands?. With Auguste \nRenoir, Guino won joint copyright to these pieces, which has passed to \nGuino?s heirs. They have produced and sold the bronzes for many years, \nas well as issuing certificates of authenticity.\n\nMr Javogue was associated with the Guinos for some years as their US \nrepresentative and sold some pieces. He now says that the Guinos have \nproduced sculptures with the same edition numbers, claims that the \nfamily deny.\n\nHis change of opinion comes during a long-running series of lawsuits \nbetween the Guinos and Emmanuel Renoir, who is claiming the right to \nreproduce Renoir-Guino pieces in the US.\n\nThe Guinos accuse Mr Renoir and his partners of making unauthorised \nrepro?ductions of the sculptures from original plasters to sell in the \nUS, a charge Mr Renoir denies because he says the works are in the \npublic domain in the US and so cannot be copyrighted.\n\nIn a sworn statement seen by /The Art Newspaper/, Mr Javogue says he now \nhas ?concerns? about a Venus Victrix he consigned to Christie?s and \nwhich the firm sold in New York on 5 May 2005 for $284,800; it was \nnumbered EA I/IV, with a Valsuani founder?s mark. The problem, according \nto court papers filed in France, was that another sculpture with the \nsame number was sold by Michel Guino to the Michido Gallery in Japan in \n1993, for FFr1.6m ($282,000). Mr Javogue?s statement mentions a number \nof other pieces which he says are problematic, as well as accusing \nMichel Guino (one of the heirs) of producing false certificates of \nauthenticity.\n\nAccording to the Guinos? US lawyer Richard Morris, his clients ?deny \nhaving made any unauthorised pieces?the owner of the copyright cannot by \ndefinition make an unauthorised piece. Further, [they deny] ?double \nnumbering? or any other impropriety.? Mr Renoir has brought a suit in \nFrance accusing Michel Guino of making unauthorised pieces. Christie?s \nsaid in a statement: ?We are monitoring the matter. As with all \nproperties sold at Christie?s, this bronze was researched prior to sale \nby specialists, and?we also worked with an outside authority. Both \nChristie?s and the authority concluded that there were no issues with \nthe work.?\n\nhttp://www.theartnewspaper.com/\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Tue, 24 Apr 2007 06:49:55 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Gewissen oder Geldgier, Konferenz zum Thema Raubkunst\nTo: Museum Security Network Mailinglist \nMessage-ID: <462D8C73.3060606@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n    Gewissen oder Geldgier\n\n\n  Konferenz zum Thema Raubkunst\n\nWELF GROMBACHER\n\nBis vor kurzem gab es hinter vorgehaltener Hand in Berlin eine \nAnweisung, wonach Bilder der Bundeskunstsammlung, bei denen Gefahr \nbestehen k?nnte, dass Restitutionsforderungen geltend gemacht werden, \nnichts in Amtsstuben mit ?ffentlichem Publikumsverkehr zu suchen haben. \nMan wei? ja nie. Am Ende k?nnte jemand in einem Ministerium ein Gem?lde \naus ehemals j?dischem Familienbesitz entdecken, das im Dritten Reich von \nden Nazis enteignet wurde, und es zur?ck haben wollen.\n\nDie Angelegenheit zeigt, dass in Sachen Beutekunst und R?ck?bertragung \nin Deutschland immer noch Redebedarf besteht. Auch, wenn einige meinen, \nmehr als 60 Jahre nach Kriegsende sei es an der Zeit, die Sache endlich \nruhen zu lassen. Seit Sonntag findet in Potsdam nun eine internationale \nKonferenz zum Thema statt. Eingeladen vom Moses Mendelssohn Zentrum \n(MMZ), debattieren 250 Experten aus zw?lf L?ndern ?ber moralische, \njuristische und politische Fragen.\n\nIn der vergangenen Zeit sei oft auf eine polemische, emotionale Art ?ber \nRaubkunst gesprochen worden, wie Julius H. Schoeps, Direktor des MMZ, \nmeinte, was nicht zu einer Kl?rung, sondern zu noch mehr Verwirrung \nbeigetragen habe. Die Konferenz wolle darum helfen, den Diskurs zu \nversachlichen und konstruktive L?sungsans?tze zu erarbeiten.\n\n*Wabernder Moralraum*\n\n\"Eine Debatte ohne Ende?\" ist das Motto des dreit?gigen Symposiums. Und \ndas Fragezeichen kann durchaus als ein rein rhetorisches verstanden \nwerden, wie Michael Naumann in seinem Er?ffnungsvortrag am Sonntag schon \nklarstellte. Die Washingtoner Erkl?rung von 1998, in der sich 44 Staaten \ndazu verpflichtet haben, den R?ck?bertragungen nachzukommen, habe \ndeutlich gemacht, dass Anspr?che nicht verj?hren. In einer vehementen \nRede sprach sich der ehemalige Kulturstaatsminister und heutige \n\"Zeit\"-Herausgeber gegen die von Juristen immer wieder geforderten \nFristen aus. \"Derlei Fristen dienen zwar dem Rechtsfrieden. Der \nRechtsfrieden aber ist nicht gleichzusetzen mit Gerechtigkeit\", so Naumann.\n\nDieser Meinung sind nicht alle. \"Wir brauchen klare Fristen, um den \nDruck auf alle Beteiligten zu erh?hen, sich f?r das Thema einzusetzen\", \nforderte etwa der M?nchner Rechtsanwalt Hannes Hartung, der zu den \nReferenten des Symposiums z?hlt. \"Bislang befinden wir uns in einem \nwabernden Moralraum.\" Hartungs Ansicht nach w?re ein Limit bis 2020 f?r \ndie Anmeldung von Besitzanspr?chen hilfreich. \"Diese Frist kann aber nur \ndann funktionieren, wenn bis dahin die Thematik durch eine l?ckenlose \nProvenienzforschung in den betroffenen ?ffentlichen und privaten \nInstitutionen aufbereitet ist.\"\n\n*Nachschub f?r den Kunstmarkt?*\n\nGenau hier aber liegt das Problem. Nur wenige Museen sind finanziell \ndazu in der Lage, Provenienzforschung zu leisten und fr?here Besitzer \nausfindig zu machen. Mal ganz davon abgesehen, dass es nicht wirklich in \nihrem Interesse liegt, sich selbst die eigenen Exponate abzusprechen, um \nsie an Alteigent?mer zur?ck zu geben. Zwischen 1933 und 1945 sind 650 \n000 Kunstwerke in den Besitz der Nationalsozialisten ?bergegangen. \nMichael Naumann sprach vom \"umfangreichsten Kunstdiebstahl der deutschen \nGeschichte\". 100 000 Werke davon seien bis heute spurlos verschwunden.\n\nEs k?nne nicht angehen, den j?dischen Erben Geldgier vorzuwerfen, wie es \nvor kurzem im Rahmen der R?ckgabe von Ernst Ludwig Kirchners \"Berliner \nStra?enszene\" passiert sei. Mit ungewohnt harten Worten griff Naumann \ndie R?delsf?hrer der Debatte an und nannte sie mit Namen, wie \nbeispielsweise den Chef des Auktionshauses Villa Grisebach, Bernd \nSchultz. Der hatte in der \"Frankfurter Allgemeinen\" damals geschrieben: \n\"Man sagt Holocaust und meint Geld\" und von \"ausgebufften \nRestitutionsanw?lten in den Vereinigten Staaten\" gesprochen, die in den \nDepots deutscher Museen lediglich \"Nachschub f?r den internationalen \nKunstmarkt\" wittern. Naumann trat daf?r ein, dass auch diesen Kritikern \nbei der Nennung des Wortes \"Holocaust\" bald nicht mehr Geld in den Sinn \nkomme, sondern vielmehr \"Schuld\" und \"Verantwortung\".\n\n/Konferenz \"Eine Debatte ohne Ende? Raubkunst und Restitution im \ndeutschsprachigen Raum\": Heute, 9.15-16 Uhr. Altes Rathaus, Am Alten \nMarkt, Potsdam./\n\nhttp://www.maerkischeallgemeine.de/\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Tue, 24 Apr 2007 06:49:59 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Court rules Italy should return Venus to Libya\nTo: Museum Security Network Mailinglist \nMessage-ID: <462D8C77.5050506@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n  Court rules Italy should return Venus to Libya\n\n/Mon Apr 23, 1:09 PM ET/\n\nItaly can return to Libya an ancient statue of Venus taken to Rome \nduring Italian colonial rule in 1912, after a court ruled on Monday it \nwas not part of Italy's cultural heritage.\n\nThe headless \"Venus of Cyrene\" was carried away from the town of Cyrene \n-- an ancient Greek colony -- by Italian troops and put on display in Rome.\n\nFormer prime minister Silvio Berlusconi's promise to return it on a \nvisit to Libyan leader Muammar Gaddafi in 2002 was blocked by legal \naction lodged by a group called \"Our Italy,\" whose aim is to keep \nItaly's cultural treasures in Italian ownership.\n\nAlessandro Ruffini, lawyer for the Libyan embassy in Rome, told Reuters \nthe Lazio appeals court ruling that Italy did not have an historic claim \nto the statue was \"well grounded.\"\n\nHe said this could set a helpful precedent for Italy's own efforts to \nrecover works of art smuggled abroad.\n\nSome Italians oppose the return of such works of art, with National \nAlliance deputy Fabio Rampelli lamenting \"the systematic looting of \nItaly's 'naturalized' artistic heritage.\"\n\nHe hoped the Venus would not \"suffer the same fate\" as the ancient Axum \nObelisc which troops of dictator Benito Mussolini took from what was \nthen Abyssinia in 1937. It was returned to Ethiopia to be \"abandoned on \na rooftop,\" according to Rampelli.\n\nLate last year Rome was rebuffed by the Getty Museum when it requested \nthe return of a 2,500-year-old Greek statue of a boy. Italy threatened \nto break off ties with the wealthy Los Angeles museum over the statue \nand other works that it says were looted.\n\nhttp://news.yahoo.com/\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Tue, 24 Apr 2007 06:50:07 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Replica of prehistoric croc stolen\nTo: Museum Security Network Mailinglist \nMessage-ID: <462D8C7F.2090308@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n  Replica of prehistoric croc stolen\n\nNAPLES --\n(AP) -- The fiberglass model of an eight-foot primitive crocodile looked \nreal enough to slither off, so the staff at the Naples Botanical Garden \nknew something was amiss when visitors weren't commenting on the \nrealistic replica.\n\nThe $15,000 Crocodile Africanas replica was gone. The staff believes it \nwas taken the night of April 14 when the facility's gate was open but \nmost of the visitors were indoors. They reported the theft to the \nCollier County Sheriff's Office on April 16.\n\n''It's so sad,'' said Jill Barry, Naples Botanical Garden director of \nexternal affairs. ``We're hoping they didn't understand it was an item \nof great value. It qualifies as grand theft. We're hoping someone will \nreturn it so we do not have to pursue further action.''\n\nThe crocodile was among about two dozen prehistoric creatures on display \nduring the /Dinosaurs in the Garden /exhibit. The life-size fiberglass \ndinosaur sculptures are part of a traveling show made by Missouri artist \nand fossil collector Guy Darrough.\n\n''It's one of a kind,'' Barry said of the stolen crocodile. ``It's \nessentially a work of art.''\n\n  http://www.miamiherald.com/\n\n\n\n\n------------------------------\n\nMessage: 8\nDate: Tue, 24 Apr 2007 06:50:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Foreign smugglers target China's sunken treasures\nTo: Museum Security Network Mailinglist \nMessage-ID: <462D8C85.2010202@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n  Foreign smugglers target China's sunken treasures\n\nMon Apr 23, 2007 10:36PM EDT\n\nBEIJING (Reuters) - Foreign smugglers are making use of advanced \ntechnology to steal China's seabed treasures, mostly priceless porcelain \nfrom ancient shipwrecks, the China Daily said on Tuesday.\n\nThe relics, from thousands of sunken ships, were traded beyond China's \nmaritime boundaries before they are shipped to markets worldwide, many \nto the United States, the newspaper said.\n\nShan Jixiang, director of the State Administration of Cultural Heritage, \nwas quoted as saying the government had recovered a \"great number\" of \nprecious items stolen from the country in the past few decades.\n\nChina's seabed heritage has been pursued in earnest by art collectors \nand dealers since the beginning of 2005, when about 15,000 pieces, \nmainly blue-and-white porcelain about 300 years old, were found in a \nshipwreck off the coast of east China's Fujian province.\n\nhttp://www.reuters.com\n\n\n\n\n------------------------------\n\nMessage: 9\nDate: Tue, 24 Apr 2007 06:50:22 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Oslo court sentences three in theft of Munch paintings\nTo: Museum Security Network Mailinglist \nMessage-ID: <462D8C8E.7070202@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n  Oslo court sentences three in theft of Munch paintings\n\n\n        Published: 24 April 2007\n\nAn Oslo appeals court sentenced three men to prison terms of up to nine \nand a half years yesterday for their roles in the 2004 theft of the \nEdvard Munch masterpieces \"The Scream\" and \"Madonna.\"\n\nThe paintings, which were insured for 750 million kroner (US$125 \nmillion), were recovered by police on 31 August, just over two years \nafter they were stolen by masked gunmen in a brazen daylight heist at \nOslo's Munch Museum. Both were damaged and are undergoing repairs.\n\nThe three defendants were also ordered to jointly pay 1.57 million \nkroner (US$262 million) in compensation to the City of Oslo, which owns \nthe paintings.\n\nThere are four versions of \"The Scream,\" probably Munch's best-known \nwork, depicting a waif-like figure apparently screaming or hearing a \nscream. The image has become an icon of modern human anxiety.\n\nIn late March, the Borgarting appeals court in Oslo found the three men \nguilty of helping the armed robbers, and acquitted three others.\n\n\"There has to be a sharp reaction to such a serious crime,\" the court \nsaid during sentencing, describing the paintings as \"two of the \ncornerstones of Munch's production.\" Police also suspect that the \nrobbery was organized to draw police resources away from a 2004 bank \nrobbery in which a police officer was killed.\n\nPetter Tharaldsen, 35, was sentenced to nine-and-a-half years in prison \nfor driving the getaway car that spirited off the paintings and robbers. \nHis term also included a sentence for an unrelated robbery.\n\nBjoern Hoen, 39, convicted of masterminding the theft, was sentenced to \nnine years for grand theft. Tharaldsen and Hoen were also convicted of \nbeing part of an organized crime group.\n\nStian Skjold, 31, was sentenced to five and a half years as one of the \ntwo gunmen who raided the Munch Museum. The second suspected gunman died \nin November before charges were brought against him.\n\n\"I will advise my client to appeal. The sentence is much too long,\" \nMorten Furuholmen, who defended Skjold, was quoted as telling the \nNorwegian news agency NTB. The other two defense lawyers and the \nprosecution said they would review the ruling before deciding on appeals.\n\nProsecutor Elisabeth Ramstad said she was satisfied that the court had \ncompletely accepted her description of the suspects roles and other \nfacts in the case.\n\nPolice have refused to say how they recovered the paintings, which \nsuffered scrapes, holes, loose paint and moisture damage. The museum is \nconsidering using an eye-surgeon to remove tiny fragments of glass \nembedded in the works after their frames were broken.\n\nMunch's emotionally charged painting style became a major influence in \nthe birth of the 20th-century expressionist movement. Munch died in 1944 \nat the age of 80.\n\nhttp://news.independent.co.uk/\n\n\n\n\n------------------------------\n\nMessage: 10\nDate: Tue, 24 Apr 2007 06:50:19 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Man held for stealing painting from sister\nTo: Museum Security Network Mailinglist \nMessage-ID: <462D8C8B.3090707@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n    *Man held for stealing painting from sister *\n\n/Rustom Mehta allegedly took the Rs 60-lakh Jehangir Sabavala painting \nfrom his sister?s residence /\n\n*Express News Service* \n \n\n\n*Mumbai, April 23:* Rustom Mehta (57), a Pune based businessman was \narrested by the Gamdevi police on Saturday for allegedly stealing a \npainting worth over Rs 60 lakh from his sister's residence at Kemps \ncorner. The painting is by renowned artist Jehangir Sabavala.\n\n?Mehta's sister Mehar Devis (50) is an acupuncturist residing at Raj \nMahal building at Kemps Corner. Her husband and daughter live in Europe. \nWhenever Mehta is in town, he stays with his sister. On March 26, Devis \nlodged a complaint at the Gamdevi police station stating that her \nbrother had stolen the Sabavala painting from her house. After \nconducting inquiries, we registered an offence of theft against Mehta on \nApril 16,? said Police Inspector Shyam Parulekar of the Gamdevi police \nstation, who is the investigating officer in the case.\n\nAccording to the police, Mehta took the painting from his sister's house \non March 3. He kept it at a friend's house before leaving on a business \ntrip to Bangkok. In a note to his sister, he said he had taken the \npainting as their mother Tehami Mehta had left it to him in her will.\n\n?The will was drafted in 1992, and it stated that the painting above the \nsideboard in the living room was to be given to Rustom Mehta. According \nto Devis, when their mother died in 1993, Mehta took the concerned \npainting, which was by another artist. A written agreement was also \nsigned by the two siblings on this matter. The complainant later shifted \nthe Sabavala painting from the verandah to the same spot above the \nsideboard,? said Parulekar.\n\nA servant working at the Devis residence told the police that he saw \nMehta remove the agreement signed by the two siblings from a rack near \nthe sideboard. The Gamdevi police issued a lookout notice for Mehta to \nimmigration authorities at Sahar airport and Mehta was arrested when he \nreturned on Saturday. He was produced at the Girgaum Metropolitan \nMagistrates Court on Sunday and released on bail. The court has directed \nthe police to keep the painting in its custody till the dispute is \nresolved.\n\nWhen contacted, Mehta's lawyer Satish Maneshinde said, ? The matter did \nnot require the police to issue a lookout notice as my client had \nassured them that he would submit the painting after his return. The \nownership of the painting cannot be decided by the police as the will \nhas not been probated yet. Also, my client has not signed any agreement \nregarding the painting.?\n\nhttp://cities.expressindia.com\n\n\n\n\n------------------------------\n\nMessage: 11\nDate: Tue, 24 Apr 2007 06:50:30 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Four on fake statue charge\nTo: Museum Security Network Mailinglist \nMessage-ID: <462D8C96.1070305@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n      Four on fake statue charge\n\n23/ 4/2007\n\nFOUR family members - two in their 80s - have been charged over the sale \nof a fake Egyptian statue once thought to be worth ?1m.\n\nThe Amarna Princess, said to represent King Tutankhamun's sister, was \nthought to be about 3,300 years old.\n\nIt was bought by Bolton council for ?440,000 in September 2003.\n\nHowever, experts last year declared the 20in sculpture a fake.\n\nOfficers from the Metropolitan Police's Art and Antiques Unit removed \nthe statue last March after concerns were raised about a Syrian \nsculpture which had arrived at the British Museum in London.\n\nPolice have now charged George Greenhalgh, 84, Olive Greenhalgh, 82, and \ntheir sons, George Jnr, 52, and Shaun, in his 40s, over the sale of fake \nantiques.\n\nAll four live together in The Crescent, Bromley Cross, Bolton. An \nanonymous seller claimed their great grandfather had bought the statue \nfrom an earl in 1892 and had taken it to his Bolton home.\n\nThe private collector expressed a wish for the Amarna Princess to return \nto the town.\n\nOnly two similar pieces are thought to exist - one in the Louvre and the \nother in a museum in Philadelphia.\n\nThe council paid for the `bargain' with the help of ?360,000 from the \nNational Heritage Memorial Fund, ?75,000 from the National Art \nCollections Fund and ?2,500 from the Friends of Bolton Museum and Art \nGallery.\n\nThe statue went on display in the town's museum after being featured at \na London exhibition opened by the Queen. George Greenhalgh, the father, \nOlive Greenhalgh and Shaun Greenhalgh are accused of conspiracy to \ndefraud, including allegedly selling faked and forged works of arts as \ngenuine between 1989 and 2006.\n\nThey are also charged with money laundering fake arts and antiques and \nthe proceeds of the sales from the antiques. George Greenhalgh senior \nand Shaun Greenhalgh face an additional charge of laundering the \nproceeds of the sale of the Princess.\n\nGeorge Greenhalgh, the son, is charged with money laundering fake arts \nand antiques and the proceeds of the sales from the antiques.\n\nThe four are due to appear before Bolton magistrates on Thursday.\n\nhttp://www.manchestereveningnews.co.uk\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 98\n***************************************\n\n"}