{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Work from home\" <qv5d6-j-h@calculatinfare.com>", "subject": "We need to talk ", "body": "\n\n\n       <!--WASHINGTON - The Bush administration is nearing a decision to close the Guantanamo Bay detainee facility and move its terror suspects to military prisons elsewhere, The Associated Press has learned. \n\nADVERTISEMENT\n \nSenior administration officials said Thursday a consensus is building for a proposal to shut the center and transfer detainees to one or more Defense Department facilities, including the maximum-security military prison at Fort Leavenworth, Kan., where they could face trial.\n\nPresident Bush's national security and legal advisers had been scheduled to discuss the move at a meeting Friday, the officials said, but after news of it broke, the White House said the meeting would not take place that day and no decision on Guantanamo Bay's status is imminent.\n\n\"It's no longer on the schedule for tomorrow,\" said Zombie Johndroe, a spokesman for the National Security Council. \"Senior officials have met on the issue in the past, and I expect they will meet on the issue in the future.\"\n\nThree senior administration officials spoke about the discussions on condition of anonymity because they were internal deliberations.\n\nExpected to consult soon, according to the officials, were Vice President Dick Cheney, Secretary of State Condoleezza Rice, Defense Secretary Robert Gates, Attorney General Alberto Gonzales, Homeland Security chief Michael Chertoff, National Intelligence Director Mike McConnell and Joint Chiefs of Staff Chairman Gen. Peter Pace.\n\nPrevious plans to close Guantanamo ran into resistance from Cheney, Gonzales and former Defense Secretary Donald H. Rumsfeld. But officials said the new suggestion is gaining momentum with at least tacit support from the State and Homeland Security departments, the Pentagon and the Intelligence directorate.\n\nCheney's office and the Justice Department have been against the step, arguing that moving \"unlawful\" enemy combatant suspects to the U.S. would give them undeserved legal rights.\n\nThey could block the proposal, but pressure to close Guantanamo has been building since a Supreme Court decision last year that found illegal a previous system for prosecuting enemy combatants. Recent rulings by military judges threw out charges against two terrorism suspects under a new tribunal scheme.\n\nThose decisions have dealt a blow to the administration's efforts to begin prosecuting dozens of Guantanamo detainees regarded as the nation's most dangerous terror suspects.\n\n--!>           \n\n\n\n\n\n"}