{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Power Marketing Association<Power.Marketing.Association@calcium.netcontentinc.net>", "subject": "Power Delivery Planning:  Aug 1-2 Chicago", "body": "\n\n\n\n\nEUCI Newsletter\n\n\n\n\n\n\n\n\n\n\n\n\nPower Delivery Planning: \nManaging the Distribution Planning Process to Maximize Value\n\n\nAugust 1 – 2, 2007 / Chicago, IL\n\n\n\nClick Here \n            To Download A Complete Conference Brochure\n Click Here For A Complete Listing\n              Of Upcoming Conferences\n \n\n\n\n\n\nOVERVIEW\n\n\nThis intensive two-day course is aimed at supervisors, managers, and senior professionals who have been appointed as              “change agents” to help make their company’s power delivery planning function more strategic, responsive, and effective\n              at delivering maximum value to their company. It assumes a working familiarity with power distribution systems, utility\n              processes, T&D planning, engineering, and operations. Emphasis is on establishing an efficient but rigorous technical business\n            process that identifies and justifies projects fitting the company’s priorities and matching its budget requirements.\n The course looks both inward and outward from the distribution process. Externally, the products and value provided to\n                      the rest of the utility by the distribution planning process are examined, along with how they are valued. How planning\n                      interacts with, depends upon, and supports other functions is examined and used to identify requirements and constraints\n                      that planning must accommodate. The internal look at the distribution planning process breaks it into its various\n                      steps. Each is examined with respect to the functions, tools, procedures, skills, periodicity and thoroughness needed.\n                      Examples of the different ways utilities accomplish each step are examined. How each step interacts with the other parts,\n                      where, when and how each needs to be done, typical shortcomings that can occur, and ways utilities can improve the\n                      performance of each step to assure consistent, repeatable, and traceable results are examined. \nFinally, the course addresses several issues most utilities face.\n\n How to make the distribution planning function more strategic and supportive of company efforts to improve business\n                        and customer performance while adhering to its financial targets.\n How to “armor-plate” defensibility of budgets, plans, and particularly projects calling for new sites and right of way.\n How to integrate aging infrastructure issues into the capacity expansion/system growth process.\n How to best integrate distribution planning with other key functions of T&D.\n And how to address the loss of skills and experience that are common due to aging workforce retirement issues.\n\n Major Topics Include\n\n A detailed look at the distribution planning process, its component steps and the how, where, when, who and why of each\n Different prioritization/decision/approval methods, and how to select and implement the proper one\n Defensibility, justification and documentation of plans. Guiding projects through opposition\n Standards, guidelines, targets and practices. Evaluating, revising, and fine-tuning\n Project cost estimation: Use and abuse\n Products and value of the distribution planning process: What does it contribute, to where in the company, and what is\n                        that worth?\n Reliability and contingency planning goals and approaches\n Interaction with and support to upper management\n Load data, load projections: setting capacity targets\n Putting together an efficient, effective process\n\n\n\nREGISTER\n\n\n\nClick Here \n                    To Download A Complete Conference Brochure\n Click Here For A Complete Listing\n                    Of Upcoming Conferences\n \n\n\n\n\n\n\nUpcoming Conferences \n\n\n \nCapacity \n\t\t\tMarkets\n Washington, DC\n June  4-6, 2007\n  Coal-to-Liquids \n                            Finance and Development Summit\n New York, NY\n June  4-6, 2007\n   Strategies for \n                            Bidding Ancillary Services in LMP Markets\n Indianapolis, \n                IN\n June 6-7, 2007\n  Intro to Electric \n                            Utility Systems for Non Engineers\n Austin, \n                TX\n June 14-15, 2007\n   Distributed \n                            Energy Resources-Emerging Business Models for Utilities\n Austin, \n                TX\n June 14-15, 2007\n  Managing Physical \n                            & Financial Uncertainty in the Power Industry\n New York, \n                 NY\n June 19-20, 2007\n  Value \n                            and Risk in Energy Markets - Introduction & Principles (Program 8)\n San Diego, CA\n June 19-21, 2007\n  Alternative \n                            Regulation for Electric and Gas Utilities\n Boston, MA\n June 25-26, 2007\n  In Depth \n                            Introduction to Electricity Markets\n  Alexandria, VA\n June 25-26, 2007\n  Customer \n                            Communications for Utilities\n Boston, \n                            MA\n June 27-28, 2007\n  Implementation \n                            and Cost-Benefit of Workplace Weight Management Strategies\n  Chicago, IL\n June 28-29, 2007\n  EEI's 2007 \n                            Transmission and Wholesale Market School\n  Madison, WI\n July 9-13, 2007\n  \n\n\nPlease forward this invitation to \n                          colleagues who may benefit from attending.\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}