{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Market, bridge bombings kill dozens in Iraq", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApr 14, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nMarket, bridge bombings kill dozens in Iraq\n\n\n\n\n\nBombings in Baghdad and Karbala killed at least 56 people and wounded 78 more\nSaturday morning, police and medical officials said.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNorth Korea disarmament deadline slips\n\n\n\n\n\nThe U.S. envoy to North Korea's nuclear talks said Saturday that a\ntwo-month-old disarmament plan lacks \"momentum\" as North Korea failed to meet\na deadline for shutting down its main nuclear reactor and processing facility.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nPlains get snow, Texas gets tornado as storm moves east\n\n\n\n\n\nA severe storm dropped nearly a foot of snow on parts of the central Plains\nFriday and spawned at least one tornado in Texas, where one death was blamed\non high winds.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nMarines to deploy tilt-rotor aircraft to Iraq\n\n\n\n\n\nThe military's controversial V-22 Osprey tilt-rotor aircraft will head to Iraq\nfor its first combat tour later this year, Marine officials announced Friday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWildfire brings destruction to Beverly Hills\n\n\n\n\n\nFires erupted in the hills above Los Angeles on Thursday, damaging or\ndestroying several homes as dangerous north winds fueled the flames. Farther\ninland, a blinding sandstorm triggered a deadly highway pileup.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrincipal, teacher quit after sex video surfaces\n\n\n\n\n\nA principal and a teacher at a suburban elementary school quit amid\nallegations they were caught on video having sex in the principal's office,\nauthorities say.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCheney plane undamaged in collision with bird\n\n\n\n\n\nAir Force Two carrying Vice President Dick Cheney struck a bird as the plane\nneared O'Hare International Airport on Friday. \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nKasparov held at Russian demo\n\n\n\n\n\nRussian chess champion and opposition activist Garry Kasparov has been\ndetained by police in Moscow as he tried to attend a banned protest march, his\naide told Reuters on Saturday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHope fades for 5 missing from capsized ship\n\n\n\n\n\nRescuers said Friday they had all but given up hope of finding five crewmen\nalive after their ship capsized off northern Scotland.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nU.S.: Al Qaeda in Iraq 'probably' tied to bombing\n\n\n\n\n\nA U.S. Army commander on Friday said authorities still can't verify who bombed\nthe Iraqi parliament complex on Thursday, but al Qaeda in Iraq probably was\ninvolved.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGaming sting nets judge, prosecutor, Carnival organizer\n\n\n\n\n\nFederal police arrested the chief organizer of Rio's annual Carnival parade,\nalong with a federal judge and prosecutor, in a crackdown on illegal gaming\nand money laundering Friday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nSubprime bailout? $120 billion\n\n\n\n\n\nWant to pick up the check for every homeowner who got saddled with a risky\nmortgage? It's a big one - on the order of $120 billion.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGoogle to buy DoubleClick for $3.1 billion\n\n\n\n\n\nSearch engine leader Google is buying privately held DoubleClick, a top\ndigital marketing services firm, for $3.1 billion in cash, the companies said\nFriday afternoon.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nIan Thomsen: Best and worst of the 2006-07 season\n\n\n\n\n\nThursday we submitted our official NBA awards ballots, but those results only\nbegin to explain what's gone on this season. Let's try to make further sense\nof the last six months, shall we?\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPhil Taylor: Robinson set an example of how to deal with racism\n\n\n\n\n\nIn many ways the 21st century sports world, with its round-the-clock cable\nnetworks, Web site wise men and ceaseless talk-radio debates, would have been\nunrecognizable to Jackie Robinson. He no doubt would have been amazed by the\nsheer number of voices crashing into each other in our modern-day Babel, not\nto mention their volume. But there is at least one thing that hasn't changed\nin the 60 years since Robinson broke baseball's color barrier: The most\nhateful loudmouths are the ones that seem to make themselves heard above the\ndin. \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nDr. Gupta: The lessons I learned in 'Chasing Life'\n\n\n\n\n\nWhen I began researching \"Chasing Life\" a year and a half ago, I wanted to\nwrite a book about immortality. Futurists are envisioning a time when science\nis able to beat death, and I was fascinated by what that would mean, both\nphysiologically and philosophically. \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1st U.S. baby reportedly from frozen sperm, egg born\n\n\n\n\n\nA California woman has given birth to the first baby conceived in the United\nStates by means of frozen sperm and a frozen egg, according to the fertility\nfirm that sponsored the study in which she took part.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\n'Super Bowl of Smarts' brings on robot invasion\n\n\n\n\n\n\"Robot coming through. 'Scuse me, robot coming through.\"\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n'TMNT' game may leave you fighting boredom \n\n\n\n\n\nEither Ubisoft is running out of ideas or they were so busy working on the\nTeenage Mutant Ninja Turtles video game they didn't realize they plagiarized\ntheir own material.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nReview: 'Stranger' far from 'Perfect'\n\n\n\n\n\nBack when Kirk Spielas and Spencer Tracy were on the job you could spot a\nnewshound by his rolled-up sleeves, the way he wore his fedora and his\ntwo-fingered typing style (with a smoke and a flask nearby).\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStern sues Anna Nicole Smith's mother's lawyer\n\n\n\n\n\nHoward K. Stern, Anna Nicole Smith's attorney and partner, filed a defamation\nlawsuit Friday against the lawyer for Smith's mother.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}