{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Dustin Price <sdwight@greatparks.org>", "subject": "Penis power", "body": "\n\nCan't have sex like you had 10 years ago? Tired with your sexual problems?\nOrder now!\nWe have only high-quality national medications at low prices. Viagra, Cialis, Levitra, Valium, Phentermine, Tramadol, Xanax, HGH you can find them here.\nEverything for your sexual health\nLicensed medications! Confidential and secure purchase\nWith best regards,\nDustin Price\n \n \nI snova vovremia! Balkon, pod kotorym ia priatalsia ot oblomkov Obrushivshegosia zdaniia, bukvalno vzorvalsia pod udarom lapy, razletevshis Veerom pyli i kamennogo grada, i vse eto s shumom ruhnulo vniz, kak raz na to Mesto, gde sekundu nazad stoial ia. Tochno skazat ne smogu, Niks. Mestnye rebiatishki mogut tolko chitat emocii. Ne Pomniu uzhe, gde i kogda ia videl poslednij raz kassira zhivem. \nSerdce zabilos Silnee, kogda ia dostig zala Fermy, vspyhivaiushchego so vseh storon sinimi, Zheltymi i zelenymi ogniami, i vstupil v nego. Otkuda-to so storony poslyshalsia golos, nizkij, skripuche rychashchij, Ravnodushnyj: Kazhetsia, on ochuhalsia, Dos. Ostav ego v pokoe, prygun, poslyshalsia eshche odin neznakomyj golos. Ostaviv Onni na proizvol sudby, ia brosilsia k Taj i podhvatil ee na Ruki. Prihodi v sleduiushchij raz, rab, fyrknul chuzhoj, kogda u tebia budet Svoe telo i svoi mozgi. My tut, esli ty eshche ne znaesh, ne na piknike. Pozhaluj, luchshe vsego budet smytsia etim zhe vecherom, blizhe k nochi. Teper ej samoj hotelos okazatsia podalshe ot etogo mesta Da chto zdes proishodit?! Mogu lish dogadyvatsia, napriazhenno otvetil ia, prodolzhaia nabliudat za Narastaniem processa. \nPoniatno, skazala ona chut pogodia. Pochemu? Pochemu ty eto delaesh dlia menia? Vriad li podobnye uslugi vhodiat v mestnye Tradicii. Za mesiac? God? Dva? U menia eshche ne Bylo stol pechalnogo opyta na etot schet, no ia znal, chto blagodaria Izmeneniiam, vnesennym v moj organizm Nkotom, mogu regenerirovat tkani v Desiatki raz bystree. Mozhesh na menia Rasschityvat. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}