{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Power Marketing Association<Power.Marketing.Association@calcium.netcontentinc.net>", "subject": "Diversity and Inclusion- Best Practices   July 24-25  San Francisco", "body": "\n\n\n\n\nEUCI Newsletter\n\n\n\n\n\n\n\n\n\n\n\n\nDIVERSE WORKFORCE—\n                    BEST PRACTICES FROM UTILITIES\nHarnessing the Power of Diversity and Inclusion\n \n\n\nJuly 24 - 25, 2007 / San Francisco, CA\n\n\n\nClick Here \n            To Download A Complete Conference Brochure\n Click Here For A Complete Listing\n              Of Upcoming Conferences\n \n\n\n\n\n\nOVERVIEW\n\n\nAs the baby boomer generation approaches retirement, utilities have recognized the dual challenges of maintaining\n              crucial experience and knowledge, while recruiting, developing and retaining a 21st century workforce. Some proactive\n              organizations have identified and implemented strategies and tactics to meet these challenges. Knowledge retention\n              programs and joint efforts with local colleges and universities are underway. Enhanced recruitment and retention\n              programs are also being developed to fill the workforce with employees that represent the communities they serve. \n \nUtilities recognize the challenges and opportunities of the changing demographics. Those utilities that implement a\n                      strategic diversity process will be able to create a strong, high-performing organization. These companies are making\n                      a business case to manage and leverage diversity by linking it to their organizational business plan. Leadership’s true\n                      understanding of, and commitment to diversity and inclusion sets the strategic direction for the organization and is key to\n                      success. Leadership must transition from diversity as a program to an integral component of daily business operations. \n \nDiversity and inclusion are not only key from a workforce perspective, but from a community and marketplace perspective\n                      as well. Work with community organizations through volunteer efforts or foundation funding become essential\n                      components of the extension into the service area community. As one tactic, Supplier Diversity also enhances the\n                      economic development within the community and demonstrates good corporate citizenship.\n  \nThis conference will provide insight into the unique path utilities are taking towards a high-performing, diverse and\n                      inclusive workforce culture. Starting with some of the basic components of a diversity process, and working through\n                      examples from existing programs that are thriving, this conference will highlight the initiatives that generate inclusiveness\n                      as a key to utilities successfully competing in the marketplace.\n \nWho Should Attend:\n \nUtility CEOs, vice presidents and managers interested in creating or promoting diversity efforts in their organization\n\n Human resource and diversity professionals interested in learning more about diversity programs in the utility industry\n Diversity consultants who would like to learn more about efforts in the utility industry\n Non-profit foundation managers wanting to become more involved in the diversity efforts of the organization\n Other managers who will be working with the utilities emerging diverse workforce:\n                        \n Generation, T&D operations/maintenance/construction\n Strategic planning\n IT\n Marketing\n Communication\n Staffing and recruitment\n Community and public relations\n Career development\n Employee training\n Organizational development\n Power operations\n Customer service\n Supplier Diversity programs \n\n\n\nWhy Attend?\n \nSeveral factors are coming together to change the nature of the utility’s workforce. This conference will provide exposure\n                      to some of the significant issues in creating a diversity program, some of the issues utilities have faced when pursuing\n                      diversity efforts, and ideas to move diversity efforts toward establishing a high-performing organization. \n \nWhat Will You Learn?\n\nAn overview of creating a diversity and inclusion process\n The difference between inclusion and diversity\n How to include traditional utility employees in diversity and inclusion efforts\n What is a Diversity Council and how does it promote the strategic development process?\n How to build community in the workplace by supporting the service area community\n What does an excellent Supplier Diversity program look like?\n How to use non-profits in your diversity program\n How to effectively use affinity groups to establish diversity\n What is “Diversity Thinking”?\n What are some low-cost options to establishing a diversity program?\n How to institutionalize diversity within your organization to establish high performance\n How to incorporate diversity into succession planning\n What is a diversity scorecard? \n\n\n\nREGISTER\n\n\n\nClick Here \n                    To Download A Complete Conference Brochure\n Click Here For A Complete Listing\n                    Of Upcoming Conferences\n \n\n\n\n\n\n\nUpcoming Conferences \n\n\n \n \n  Customer \n                            Communications for Utilities\n Boston, \n                            MA\n June 27-28, 2007\n  Public \n                            Participation in Utility Siting\n Boston, \n                            MA\n June 27-28, 2007\n  Implementation \n                            and Cost-Benefit of Workplace Weight Management Strategies\n  Chicago, IL\n June 28-29, 2007\n  EEI's 2007 \n                            Transmission and Wholesale Market School\n  Madison, WI\n July 9-13, 2007\n  Carbon \n                            Sequestration Development & Finance Summit\n  Houston, TX\n July 11-13, 2007\n  Coal Combustion \n                            Products\n  Charlotte, NC\n July 16-17, 2007\n  T & D Asset \n                            Management\n  Charlotte, NC\n July 16-17, 2007\n  Wind Power \n                            Development Tutorial\n Denver, \n                            CO\n July 16-18, 2007\n  FERC Electric \n                            101\n Denver, \n                            CO\n July 17-18, 2007\n  Electric Power \n                            Planning\n San \n                            Francisco, CA\n July 23-24, 2007\n  NERC Reliability \n                            Standards\n San \n                            Francisco, CA\n July 23-24, 2007\n  Project Finance \n                            Tutorial\n New \n                            York, NY\n July 23-25, 2007\n  Diversity and \n                            Inclusion- Best Practices\n San \n                            Francisco, CA\n July 24-25, 2007\n  Energy \n                            Efficiency, Demand Response and Load Management\n San \n                            Francisco, CA\n July 24-27, 2007\n  Revenue \n                            Management\n San \n                            Francisco, CA\n July 26-27, 2007\n  New FERC Filing \n                            and FASB Fair Valuation Standards\n  Chicago, IL\n July 30-31, 2007\n  Power Delivery \n                            Planning: Managing the Distribution Planning Process to Maximize \n                            Value\n  Chicago, IL\n Aug 1-2, 2007\n  Electric Safety \n                            in Utilities\n  Washington, DC\n Aug 15-16, 2007\n  Protective \n                            Relaying\n  Washington, DC\n Aug 16-17, 2007\n\n\nPlease forward this invitation to \n                          colleagues who may benefit from attending.\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}