{"category": "ham", "to_address": "ip-health <ip-health@lists.essential.org>,\n   thaifta lists <thaifta@lists.riseup.net>, e-drug@healthnet.org,\n   aidsdrugs@lists.riseup.net", "from_address": "Kannikar KIJTIWATCHAKUL <kakablue@yahoo.com>", "subject": "[Ip-health] US action plan must be opposed, groups tell govt", "body": "US action plan must be opposed, groups tell govt\n\nPlan full of drug licensing demands, not IP\nprotection, Aids activists say\n\n\nAids activists and academics called on the Commerce\nMinistry yesterday to reject the \"action plan\"\nproposed by the United States to remove Thailand from\nits priority watch list for intellectual property\nprotection.\n\n\nJon Ungphakorn, secretary-general of the Aids Access\nFoundation, said if the government agreed with the\naction plan, not only would its use of compulsory\nlicensing to make generic copies of patented drugs for\nmedical emergencies be more restricted, it would also\nhave to tighten drug patents for US companies.\n\n\nAfter insisting last week that the downgrading of\nThailand's trade status reflected increased piracy of\nCDs and software, the US Trade Representative (USTR)\ncame up with an action plan full of demands to tighten\nThailand's drug patenting system, he said.\n\n\nKannikar Kijtiwatchakul, from FTA Watch, said the\ndemands listed in the action plan were similar to\nthose the US made in its talks with the Thai\ngovernment about a free-trade agreement.\n\n\nHe said the key demands were an extension of drug\npatents from the normal 20 years to compensate for\nadministrative delays in granting patents; imposition\nof data-exclusivity provisions, which mean a delay in\nthe production of general versions of patent-expired\ndrugs reaching the market; expansion of drug patents\nto cover the diagnosis process and surgery; and\nrestricting reasons for the Thai government to issue\ncompulsory licences.\n\n\nCommerce Ministry officials are due to meet\nrepresentatives of the US on the action plan on\nFriday.\n\n\nVithaya Kulsomboon, a pharma-cology lecturer at\nChulalongkorn University, said that helping people\nwith HIV get access to cheaper drugs, and lead normal\nlives, would boost the Thai economy much more than\ntrade privileges from the US.\n\n\n\"The Commerce Ministry should place more concern on\nthe lives of patients not on commercial profit,\" Jon\nsaid. And the ministry should not be afraid of\npressure from the US, as the government was not alone\nin the struggle for easier access to key medicines.\n\n\nLast Friday, the Brazilian president issued a\ncompulsory licence to allow the import of a generic\nversion of Efavirenz, after the drug's patent holder\nMerck & Co failed to match the 60-per-cent price\nreduction requested.\n\n\nJon hoped that more developing countries would follow\nsuit. Many developing countries want to use compulsory\nlicensing as allowed by the World Trade Organisation,\nbut were afraid of US economic sanctions, he said.\n\n\n\"This is not just a fight for Thai patients, but for\nall in developing countries,\" he said.\n\nPennapa Hongthong\n\n\nThe Nation\n\n\nKannikar KIJTIWATCHAKUL (Kar)\nMobile 66-85-0708954\nkakablue@yahoo.com\n\n__________________________________________________\nDo You Yahoo!?\nTired of spam?  Yahoo! Mail has the best spam protection around\nhttp://mail.yahoo.com\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}