{"category": "ham", "to_address": "Sean Kellogg <skellogg@gmail.com>", "from_address": "Gervase Markham <gerv@mozilla.org>", "subject": "Re: Final text of GPL v3", "body": "Sean Kellogg wrote:\n> Francesco...  as I've said on this list before, \"IANAL\" is not a sufficient \n> disclaimer.  Nor is saying \"this is not legal advice.\"  There are laws, \n> criminal laws, against the providing of legal advice by those who not \n> certified by the Bar Association within the jurisdiction the advice is given \n> in. \n\nAre you familiar enough with the laws of Italy (where Francesco appears \nto reside) to state that there are such laws which apply to him?\n\n> There is no exception provided by adding disclaimers, there is only the \n> question of whether or not legal advice was given.\n\nHow are you defining \"legal advice\"? If it is \"advice on matters which \nmay relate to the law\", then that could be taken to be anything. It's a \ndefinition so broad as to be useless.\n\n> This, of course, is patently false.  Anyone can provide legal advice...  \n> people do it all the time (\"gee Bob, you should claim X on your taxes\", \n> or \"the judge will reduce your ticket if you show up in court\", etc).  You \n> don't have to be a lawyer to provide it, you just need to be a lawyer to do \n> so legally in those jursidictions that require certification.  \n\nSo if the speaker in your \"Bob\" example is in one of these \njurisdictions, saying what he said is technically illegal? Do you not \nthink that this makes the law an ass?\n\n> Of course, the \n> law is an awfully grey space, so there's lots of flexibility, and for the \n> most part lay-persons can get away with providing legal advice to their \n> friends because the relationship is clear.  Here, on an email list \n> entitled \"debian-legal\" I think one might have a reasonable expectation that \n> actual lawyers were providing advice.\n\nWhy? I've never seen that happen (although I've only been on the list \nfor a year or two). It's certainly not a regular occurrence.\n\nDoes this line of argument mean that when I watch \"Boston Legal\", and \ndecide to follow the advice some of those (fictional) lawyers gave their \nclients, I can sue the program when it all goes wrong, because the word \n\"Legal\" in the name gave me a reasonable expectation that they were \nproviding \"legal advice\"?\n\nGerv\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}