{"category": "ham", "to_address": "avcooper@speedy.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 4/23/07 - Apple vs. eBay", "body": "April 23, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\nFeaturing Lutts' Logic:\n\nThe Most Creative Company on Earth?\n\nThe People's Auctioneer\n\nThe Surprise Winner!\n-----\n\nEvery Wednesday in our office we have a meeting that includes not just our\nthree in-house editors but also my father and brother.  The purpose?  To\npresent original stock research and share ideas about investments that are\nworking in the current environment . . . all in a friendly atmosphere.\n\nMy father, Carlton, is the founder of this company, and retired three\nyears ago.  My guess is that you've never met a man who likes to jump on a\nstrong stock as much as my father.  No stock is too strong or too high for\nhim!  My brother, Robert, is the President of Cabot Money Management, and\ntends to be more fundamentally oriented.  Today he loves natural resource\nstocks and foreign stocks, particularly those in India.\n\nMike Cintolo and Paul Goodwin you're getting to know through these\nletters.  And me?  I appreciate them all, though I confess to a contrary\nstreak.  Plus, I'm the guy who likes to run contests . . . just to make it\ninteresting.\n\nWe have one running now.  The question, which I posed back at the start of\nthe year: Which stock will do better in 2007, Apple or eBay?\n\nPaul and I picked eBay, the other three picked Apple.  And you can read\ntheir arguments below.\n\n-----\nApple Pro.\n\nApple has Steve Jobs, perhaps the greatest CEO on Earth today . . . and he\nworks for only a buck a year!  In our experience, an innovative leader\nwith an excellent track record is a huge plus for a stock.\n\nThanks to iTunes and the iPod, Apple is the world's leading legal provider\nof downloaded music, having achieved what the music companies could not. \nThanks to that, its share of the computer business, which has been\nfamously small for years, is growing fast.   \n\nIn the quarter ended December 30, Apple sold 5% of the computers in the\nU.S., up from 4% a year ago.  That's a 25% jump!  Dell, by contrast, sold\n28%, down from 34% a year ago.\n\nBut the future lies in music and TV, so Apple has removed the word\n\"Computer\" from its name.   The company has already sold 100 million\niPods.  The Apple TV was launched in March.  And the Apple iPhone comes in\nJune!\n\nI love Apple products; I've been buying them since 1986, for both business\nand home.  Our office uses Dell computers, too, but Apple dominates.  And\nat home, it's all Apple, all the time, with every person having a computer\nand an iPod.  I don't have an Apple TV yet, but that's only because I\ndon't have a wide-screen TV, and that's only because replacing the current\nCRT set will require some major cabinetry work, and I'm putting it off as\nlong as I can.\n\nBut I think Apple will continue to sell millions of computers, iPods,\nApple TVs and (soon) iPhones, as well as millions and millions of songs\nand movies.  For the company, the future is very bright!\n\nLooking at the latest numbers, we see that Apple's revenues grew 24% in\nthe fourth quarter, to $7.1 billion.  Earnings, though, soared 75% from\nthe year before, to $1.14 per share, as profit margins swelled to 14.1%.\n\nEven the valuation might be argued to be reasonable, as the current PE\nratio is 33, and that's well below both this year's earnings growth rate\nof 75% and 2007's forecast of 43% earnings growth.\n\nAnd the stock?  After hitting a high of 98 in January, it corrected to a\ndouble bottom at 83 in February, and it's now following its 50-day moving\naverage up, preparing to break out to new highs.\n\n -----\n\nApple Con.\n\nValuation, when examining distant earnings estimates, appears elevated. \nAnalysts are looking for 2008 earnings growth of just 21%, and that makes\nthe current PE ratio look high.\n\nAs for the products . . . there's no argument against the products.   \nAll parties admit they're elegant, easy-to-use, and thus extremely\nsatisfying.  But this year, less than half-over, has brought two instances\nof delays, and that's rather unusual at Apple.  The first came when the\nlaunch of Apple TV was delayed from February until March.  The second is\nthe delay of the next Macintosh operating system (Leopard) from June until\nOctober.\n\nThe cons' real case lies in two more \"advanced\" areas of investment\nanalysis.  The first is based on Contrary Opinion, which reminds us that\nstocks peak when public perception is at its highest . . . when all the\npotential buyers have already bought.  Cons say it's hard to imagine\nApple's star glowing more brightly than it is now, and thus there's more\npotential downside this year than upside.\n\nFor example, at last count there were 733 mutual finds owning Apple, and\nthat's just 32 off the peak number, hit last year.  Furthermore, there's\nanother contest I have running now, the annual employee stock-picking\ncontest.  Employees can pick any stock in the world, but this year, out of\nfifteen entrants, four chose Apple!\n\nFinally, there's the RP (relative performance) line, which gives us a\nvisual look at the performance of Apple stock compared to the performance\nof the market (the Wilshire 5000).  While the peak for Apple stock, 97.80,\ncame in the first week of January, the RP line shows a long series of tops\ndating back to January 2006.  In other words, Apple has performed no\nbetter than the market over the past 15 months, and that's a sign of a\nstock that may be transitioning from a leader to an average performer.\n\n\n----- ADVERTISEMENT -----\n\nDo You Hate to See a Great Stock Take Off and Not be Part of it?\n\nWhen we saw that Apple Computer's price and earnings momentum was shooting\nthrough the roof in September 2004, we named it Stock of the Month. It was\nselling for a shockingly low $35 per share. Sixteen months later (adjusted\nfor a 2-for-1 split), it had turned a $10,000 investment into $49,370.\n\nCabot's May Stock of the Month, due to be released tomorrow, is another\nU.S. company that serves a mass market.  Its products are very affordable.\nThey bring high profit margins to the company . . . over 18%.  Revenues\ngrew at a rate of over 200% in the latest quarter.  The stock came public\njust last year . . . and institutional investors are climbing on board\nfast.   This is THE stock to buy before it soars to new highs.\n\nTry a Risk Free Subscription to Cabot Stock of the Month - Grow 50% in the\nnext 12 months or Pay Nothing!\n\nhttp://cabotmail.net/t/164096/13148861/86/0/\n-----\n\nMoving on to eBay, on the plus side.\n\nMeg Whitman, though not as creative or charismatic as Steve Jobs, is\nnevertheless an excellent manager.\n\neBay's online auction business is #1 in the world, and its growth derives\nfrom the creativity not of the person at the top but its more than 200\nmillion users, who use it to buy and sell millions of items per day.\n\nThen there's PayPal, acquired in 2002, which enables anyone with an e-mail\naddress to safely and legally send and receive money online.\n\nAnd finally there's Skype, acquired in 2005.  The world's fastest-growing\nInternet communication system, it enables users to make phone calls around\nthe globe via the Internet for pennies instead of dollars.\n\nLooking at the numbers, we see first quarter revenues grew 27% to $1.8\nbillion, while earnings grew 38% to $0.33 per share.  Profit margins were\n26.0%.  And in the past two years, profit margins have been extremely\nsteady, ranging from 24.9% to 28.3%.\n\nAs to valuation, the current PE ratio is 29, and analysts are looking at\nearnings growth of 28% this year and 18% next year.\n\nBut the biggest reason to like eBay today is that it's not well loved! \nIt's been years since the company was front-page copy.  And mutual fund\nownership is down to 552 funds, from a peak of 858 at the end of 2004.  If\nyou admit that the company has great growth ahead of it, you've got to say\nthat at some point, the selling by funds will end, and that the end of the\nselling will mark a great bottom.\n\nValuation measures speak to the same idea, which brings us to the real\nimpetus for my contest.  eBay was a recommendation of Roy Ward, editor of\nCabot Benjamin Graham Value Letter, back in January.  Roy points out that\nrecent investments have cut eBay's earnings power temporarily, but sees\nthe potential for earnings growth of 42% in 2007, and says that makes it\nattractive today.\n\nLooking at the stock, we see that eBay hit a peak of 59 at the end of 2004\n(its PE ratio then was 97), declined to a low of 23 last fall, and is now\nperforming about as well as the market.  Last week it broke out to new\nhighs above 34, but the breakout failed.  An RP analysis shows a low last\nJuly, and a rather flat trend in recent months.\n\n-----\n\neBay Con\n\nIt's no fun knocking a stock when it's already down, and eBay is now 43%\noff its high.  But there is one fundamental negative that may hold it back.\n It's that eBay shows decelerating revenue growth, and that's a hard trend\nto reverse without a blockbuster product.  Skype may be it, if it's\nmarketed right and becomes easy enough to use, but the profits may not be\nin it.\n\nTechnically, the stock, as mentioned above, is only a market performer,\nand when the market heads down, the risk is that eBay is pulled down with\nit, to become even \"cheaper.\"\n\nAs the year progresses, I'll be keeping up on these stocks.  As I write, AAPL\nis up 9% year-to-date, while EBAY is up 12%.  In any event, the exercise\nmakes for some interesting thinking, and with enough thinking comes\nwisdom.\n\n-----\n\nEditor's note,\n\nNone of Cabot's editors are currently recommending AAPL, but if breaks out\nto new highs they certainly might.  EBAY, on the other hand, is still\nrecommended by Roy Ward, editor of Cabot Benjamin Graham Value Letter, and\nif you'd like to keep up to date on that stock, as well as other\nundervalued stocks, I recommend a trial subscription.  Simply click the\nlink below to get started.\n\nhttp://cabotmail.net/t/164096/13148861/79/0/\n\n-----\n\nThe Winner\n\nThe jury on my Apple vs. eBay contest will convene at year-end to announce\nthe winner.  But there's already a winner in the industry, working\nbehind-the-scenes, and it's CommScope (CTV).\n\nOf course, you've probably never heard of CommScope, and that's a good\nthing.  Neither have millions of other investors, and that means potential\nbuying power is huge!\n\nCommScope first came to our attention when it earned a spot in Cabot Top\nTen Report on March 19, and editor Mike Cintolo was so impressed that he\nnamed it Editor's Choice, both then and when it returned in April.  The\nstory is simple, and it's big.  And here's what Mike wrote:\n\n\"CommScope is one of the leading producers of a variety of cabling systems\nfor telecom companies around the world.  In fact, it's the leading\nprovider of coaxial cable for Hybrid Fiber Coaxial applications (read: a\nnetwork that uses both coaxial cable and optical cable to deliver\nbroadband content).  And that's a market that's growing fast; telecom\nfirms are busy beefing up their networks so that they can offer voice,\nvideo, Internet and more.  AT&T is even planning to offer an online TV\nservice within a couple of years!  In other words, more bandwidth is\nneeded, and after the huge build-up seen during the bubble years, the next\nwave of upgrades is here - and benefiting CommScope.  Revenue growth is\ndecent, earnings growth has been 33% or better the past eight quarters,\nand the company just bumped up its outlook for the first quarter.  Bottom\nline, we like it.\"\n\nAs long as this bull market persists, CTV is likely to keep on running. \nEarnings are out after the market close on Thursday, April 26, and I\nrecommend that you check them out, and then decide if CTV deserves a spot\nin your portfolio\n\n-----\n\nEditor's Note\n\nTo get weekly updates on CommScope, along with detailed analysis of the\nstrongest ten stocks in the market, join the thousands of other satisfied\nreaders of Cabot Top Ten Report.  It's the best place to find the next\nHansen Natural, the next NutriSystem, and the next Western Refining. \nSimply click the link below to begin.\n\nhttp://cabotmail.net/t/164096/13148861/81/0/\n-----\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n----------\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=164096&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}