{"category": "ham", "to_address": "r-announce@stat.math.ethz.ch", "from_address": "Luke Tierney <luke@stat.uiowa.edu>", "subject": "[R] Subject: useR! 2007 --- programming competition", "body": "R Users and Developers,\n\nThe first North American useR! to be held at Iowa State University,\nAmes, Iowa, August 8-10, 2007, will include a programming\ncompetition. The challenge:\n\n     Develop a package useful for the analysis of large data sets.\n\n     Your package could augment an existing package like biglm, for\n     example, by providing graphical or numerical diagnostic tools, or by\n     adding support methods for transparently handling data from a\n     database. Alternatively, you could develop a package for fitting\n     linear or generalized linear models to large data sets that takes an\n     entirely different approach.\n\nThe winning team will receive a cash prize. The submission deadline is\nJune 30, 2007. Further details are available at the conference website\nat http://www.user2007.org/.\n\nAs a reminder, we are also calling for papers for presentation at the\nmeeting.  Papers are encouraged in all areas, but particular emphasis\nis given to work describing newly created or improved R\npackages. Papers will be refereed and a best paper/presentation award\nis likely.\n\nAlso, if you wish to apply for financial support, please send an\napplication to user2007@iastate.edu by April 23 (include a brief CV\nand a statement that demonstrates your eligibility, your need for\nsupport, and an amount of support required - students should include\nthe name of their supervisor).\n\nuseR! Program Committee\nuser2007@iastate.edu\n\n_______________________________________________\nR-announce@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-announce\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}