{"category": "spam", "to_address": "<iplacereports@flax9.uwaterloo.ca>", "from_address": "\"JohnLansing@Investorplace.com\" <JohnLansing@Investorplace.com>", "subject": "Trade Talk Weekly June 12: Time to Reboot", "body": "\n\nTrade Talk Weekly Update\n\n\n\n\n\n\n\n\nJune 12, 2007\n“Reboot Your System”\nYou may be thinking that due to this little “vacation” from stocks we’ve been taking at Trending123, you can exist on auto-pilot.\n\nWell I don’t recommend it.\nWhen you aren’t trading stocks, you should actively be trying to better yourself as an investor.   That way when it comes time to buy stocks, you are amply prepared and confident in your trades.\nOtherwise it’s kind of like when you were a kid coming off of summer break.   School work is familiar but it takes you awhile to remember the process and fully be back in the swing of things.\nAnd when it comes to investing, the further you get behind, the less profits you will end up making, while those that have kept their “game face” on will whiz right past you — collecting their profits (and yours!) along the way.\n\n\n\n\n\nThe Power of 3\nRemember — there are 3 indicators that we use to identify where the market or a particular stock is headed.   All three are key to understanding what is happening and even more important, what will happen.\nLet’s review them now.\nAroon:\nHow do you tell that a new trend in a certain stock or index has begun?   Look no further than the Aroon indicator.\nThe Aroon system uses two lines to plot market trends: an “Aroon up” line and an “Aroon down” line.   The Aroon-up line measures how long it has been since the highest closing price, and the Aroon-down line measures how long it’s been since the lowest closing price.   When the Aroon-up line is going up and crosses the Aroon-down line as it is going down, that’s a good indication that the trend is becoming bullish.   When the opposite happens—that is, the Aroon-down line is going up and crosses the Aroon-up line as it goes down—that may mean the trend is becoming bearish.\nPPO:\nPPO stands for percentage price oscillator.   The PPO expresses the difference between a shorter-term moving average and a longer-term moving average as a percentage.   For instance, a PPO of +5% means that the shorter-term moving average is 5% higher than the longer-term moving average.   A PPO of -5% means that the shorter-term moving average is 5% lower than the longer-term moving average.\nBecause it’s expressed as a percentage instead of as an absolute value, the PPO is very reliable.   And that’s why we can use it to help identify trend reversals: When the PPO rises above zero, it’s bullish, and when it falls below zero, it’s bearish.\nWilliams %Range:\nLarry Williams, its developer, used a scale of 0% to 100% to show the relationship of the current closing price relative to the range of prices from the highest to the lowest over a certain period of time.   As the closing price approaches the high, the Williams %R will approach 0%.   And as the closing price approaches the low, the Williams %R will approach 100%.\nThe Williams %R gives us an easy-to-read signal for when the trend might be turning bullish or bearish.   If the Williams %R rises above the 50% line, it’s bullish.   If it falls below the 50% line, it’s bearish.\nNow you’ve got three tools that together allow you to identify what I call 1-2-3 bullish and bearish trend reversals.   And as Trending123 subscribers have seen again and again, that’s where the best profits are.\n\n\n\n\nA Refresher Course\nLet me remind you what pattern we are in right now and why it can drive us insane.\nIt’s called the RST, or Reverse Symmetrical Triangle.   Or some of you may know it under my nickname for it: the Nut Hut.\nI call it this because it can drive any investor nuts!\nThe pattern looks like this:\n\nAnd as you can see, it creates a “megaphone” formation.   This is considered a bearish signal, which indicates that indicating that the current uptrend may reverse to form a new downtrend.\nThat is where we’re at.   That is where we have been for several weeks now.\nAnd though it seems as though we will continue a never-ending ride upwards — don’t let the talking heads fool you — this pattern is DESTINED to come down.\nI wish I could pinpoint when it will begin its descent.   I wish I could prove this to all of you non-believers.   But I can’t.\nI can only remind you that these charts that have been used for over a century, have been followed for a reason: THEY WORK.   And they don’t lie!\nContinue your education today — sign-up for Trending123 at a reduced price now!\nAs I said, there’s no way to tell you exactly when the market will tip over and barrel down but when it does come, I’ll be right there,leading the charge!   Leading you and my Trending123 subscribers towards the stocks that you can count on for profits—correction be darned!\nYou’ve been forewarned.   Now take the next sensible step — arm yourself with knowledge!\n\nSincerely,\n\nJohn LansingTrending123\n\nP.S. Each pattern has a varying degree of likelihood that it will play out the way the technician thinks it will.   The RST has a 98% probability of unfolding the way I say it will.   98%!   When was the last time you saw odds like that?   Join me at Trending123 and let’s get ready to profit together.\n\n\n\n\n\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you.   Please tell us if your email has changed by visiting here: http://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice from InvestorPlace advisors, you can let us know by visiting \nhttp://www.investorplace.com/u/?p=8FP165-1&e=iplacereports@speedy.uwaterloo.ca\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,2420A Gehman LaneLancaster, PA 17602\nCopyright © 2007 ACP Phillips Investment Resources, LLC.\nAll rights reserved.\n06/12/2007 8:04PM\n\nThank you for subscribing to InvestorPlace.com.   Please note that we cannot be liable for any missed bulletins caused by overzealous spam filters.   To ensure that you continue to receive this valuable part of your service please take a moment to add (JohnLansing@InvestorPlace.com) to your address book.   Click here for instructions:\nhttp://www.investorplace.com/whitelist.php?eml=JohnLansing@InvestorPlace.com\n\nee==8FP165\n\n\n\n\n\n\n"}