{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS News Early Show <cbsnews___early_show_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Hannah Storm: Singing and Dancing", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n                                                             \n      May 24, \n  2007\n\n\nHello, everybody,\nMaybe you’re \n      really sleepy today like I am after staying up late to watch \"American \n      Idol.\" I tried to put my kids to bed about half-way through the show at \n      9 and after howls of protest and crying I let everybody stay up past 10. \n      You should have seen their reaction when Jordin Sparks was declared the \n      winner -- lots of singing, screaming and dancing! It was really \n      cute!\n \nWe all had the \n      chance to meet Jordin a couple of week ago in L.A. and I’m happy to report \n      that she is just as sweet and charming in person as she is on TV. She is \n      also extremely well-grounded and I think she'll be able to handle all the \n      opportunities headed her way at the age of 17 with grace and \n      determination. Check \n      out Giuliani Depandi's interview with \n      her.\n \nAlso today, we \n      had the latest in our \"Happily Ever After\" series. In fact Harry was \n      teasing me about all the “ooohs” and “ahhs” and sighs coming from the set \n      while these wonderful stories are airing. Today we had the story of twin \n      sisters who got married on the same day and even have the same wedding \n      band. One of their husbands suffered serious injuries during Hurricane \n      Isabel almost four years ago and this is the story of how the marriage \n      survived the accident. \n \nAnd Harry had a \n      dream come true when he got to spend the afternoon yesterday playing the \n      tuba with the jazz greats, including the legendary Wynton Marsalis, at \n      Lincoln\nCenter. Harry began \n      playing the tuba in the 5th grade and had dreams of actually playing \n      professionally at one point. He compared playing with Wynton to someone \n      else’s dream of “playing with the New York Giants.\"\n \nOne of the great \n      things about being on the show is working on projects that involve things \n      that you feel really passionate about. I feel that way about my kids, \n      sports, music and, believe it or not, cooking! Take \n      a look at my latest segment with Torie Ritchie at Williams-Sonoma \n      about picnic lunches. In case you’re wondering, I end up eating most of \n      the stuff that we make -- there’s not much left \nover!\n \nTomorrow on the \n      show, Johnny Depp will talk about his new \"Pirates of the Caribbean\" \n      movie; author and editor Kate White will tell us about her new thriller, \n      \"Lethally Blonde\"; technology correspondent Daniel Sieberg will show us \n      the newest, coolest gadgets and you'll learn everything you'll ever need \n      to know about making cupcakes. \nTake care,\n\n\n\nHannah \n      Storm\nEarlyShow@cbs.com \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}