{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTHURSDAY 28 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER SIMON ENRIGHT\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nNew Cabinet\n\n\nTonight the challenge of change has begun. Zombie Brown has kept in post only one of Tony Blair's cabinet. He's got the first female Home Secretary, two brothers and a husband and wife team all attending cabinet. Jeremy has promised to make sure that he goes through the whole cabinet so you feel fully informed. Michael Crick will explain what it all means.\n\n\nForeign Secretary\n\n\nFor the 41 year old David Miliband quite a daunting task - Foreign Secretary. Mark Urban assesses the challenge for the youngest foreign minister in 30 years. And we'll speak to a panel of \"all the talents\" to see what they think this all means.\n\n\nFlood\n\n\nAs parts of England prepare for another weekend of rain we speak to the boss of the Environment Agency - Baroness Young. Has her agency done enough to stop the flood waters?\n\n\nManchester International Festival\n\n\nFinally today is the start of the Manchester International Festival. Tomorrow Kirsty hosts Newsnight Review from the city. Ahead of that, tonight we interview \"Manchester Man\" Tony Wilson - the original 24 hour party person.\n\n\n\nJoin Jeremy at 2230. \n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nTONY AND ME\n\n\t\t\t\t\t\t\tNewsnight has spoken to three people who worked closely with Tony Blair during his 10 years as prime minister.\n\n\nWatch the item\n\n\n\nMP WINS NEWSNIGHT AWARD\n\n\t\t\t\t\t\t\tThe Order of the Brown Nose is awarded to Quentin Davies MP after his defection from Conservatives to Labour.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}