{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGood afternoon. This is Russ Mitchell filling in for\n  Katie.\n \nWe’ll begin our coverage tonight with the\n  riveting testimony from one of the accused Duke lacrosse players – and\n  from the man accused of unethical conduct in the case, Durham district attorney Mike Nifong. Last\n  year Nifong called the accused students a “bunch of hooligans,”\n  but admitted in court today that he “maybe got carried away.” If\n  convicted by the state bar’s disciplinary board, Nifong could be stripped\n  of his law license. Byron Pitts will have the story.\n \nThe computer breakdown aboard the international\n  space station is keeping the astronauts busy and NASA consumed with\n  recovering critical Russian computer systems. But what’s the source of\n  the problem? Some are pointing to the station’s new solar panels;\n  others blame a connector that was plugged in when Atlantis docked. Daniel\n  Sieberg will have the latest.\n \nIn the Middle East, on Hamas’ first full day\n  in control of Gaza,\n  triumphant mobs looted Fatah offices and areas and tore into the office of\n  Palestinian President Mahmoud Abbas. Richard Roth will have the latest from Israel.\n \nNext, we’ll tell you about some disturbing\n  numbers brought to light by the Pentagon’s latest mental health study.\n  Thirty-one percent of Marines, 38 percent of soldiers and 49 percent of\n  national guardsmen returning from Iraq\n  and Afghanistan\n  reported psychological symptoms – from depression to alcohol abuse.\n  David Martin will look at whether the care they receive at home is adequate.\n \nWe’re keeping tabs on the housing crunch in\n  the United States,\n  and as Anthony Mason will report tonight, mortgage rates – and delinquencies\n  on those mortgages – are on the rise.\n \nAnd for our Assignment America this week, Steve\n  Hartman will introduce you to a young lady who’s been acting more like\n  a fairy godmother. She has a potentially fatal disease, but that isn’t\n  stopping her from using her talents to help others.\n \nThanks and I hope you have a wonderful weekend,\n \n\n\n\n\nRuss Mitchell\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}