{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Harvey Pittman\" <lexexpoprovub@expopro.de>", "subject": "Women will love your new figure", "body": "\nCheck out the wonders of pound melting\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most attracting flesh loss product is now readily available – As shown on ABC.\n\n\nDo you recall all the cases when you appeal to yourself to do any thing for being delivered from this desperately growing number of kilos? Luckily, now no great offering is necessary. Thanks to Anatrim, the ground-shaking weight-reducing medley, you can achieve healthier life style and a really slender figure. Have a look at what people state!\n\n\n\n\"I hate to admit it but I was a junk food addict. \n\n\nI swallowed up all this garbige \n\n\nand could not stop. \n\n\n\n\nThis misery stopped when I started taking Anatrim! \n\n\nGod,\n\n\n\n\n my appetite disappeared, \n\n\nspirits increased and I became the happiest person on the planet 22 pounds in 2.5 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person in the world!\"\n\n\n\n\n\nAmelia B., Las Vegas\n\n\n\n\n\n\"I had weight problems since I was a boy. \n\n\nYou can't fancy how I hated being ridiculed at school. \n\n\n\n\nI hated my weight and I detested even myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nThis stuff literally dragged me out of this nightmare! Many thanks and a great respect to you, my friends.\"\n\n\n\n\n\nRikky Martin, Boston\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was happily saved! I got into this circle, depression – more eating – more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOne my best friend showed me site and I called for pack of Anatrim immediately. \n\n\nThe result was excellent, my appetite came to admissible level, I was often in good spirits, and, of course, I became able to tighten my belt on some holes. And the bed became cool, too!\"\n\n\n\n\n\nTom\n\n\n\n\n There are lots of gratitudes happy people leave after trying Anatrim. Don’t you gonna add yourself to the thousands and thousands of slender clients and try this natural appetite suppressing power raising product now!\n\n\nDon’t decline your opportunity!\n\n\n\n\n"}