{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nIt’s getaway day across the country as we gear\n  up for the Fourth of July. Roadways and the skies are already showing signs\n  of the travel crunch as an estimated 41 million Americans are traveling more\n  than 50 miles from their homes. Will that congestion be intensified due to\n  heightened security? Nancy Cordes will report on transportation and holiday safety.\n \nWe’ll also have two reports on the U.K.\n  terror plot, including the latest updates on the investigation, arrests and\n  intelligence about who was responsible for what could have been very deadly\n  explosions.\n \nAnd as so many Americans will be on the road over\n  the holiday, I’ll give you a look at a new crash-test study that shows\n  your neck might not be as safe as you’d think – even in\n  larger-size vehicles.\n \nYesterday, we told you a little about how Bill\n  Clinton is stepping up to support his wife’s presidential bid. Tonight,\n  Jim Axelrod will have the story from the road with the new team of Clinton\n  & Clinton. \n \nAnd what if someone told you that eating chocolate\n  every day could keep the doctor away? Sound more appealing than an apple?\n  Michelle Miller will report on the surprising results of a new study.\n \nFinally, we’ll leave you tonight with some\n  entrancing melodies – and some momentous passings. I hope you’ll\n  join us.\n \nThanks!\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}