{"category": "spam", "to_address": "", "from_address": "\"SENATOR PATRICK OSAKWE\" <sent@ORGANISMPESTANIMAL.NET>", "subject": "CONTACT ME FOR INVESTMENT", "body": "\nFROM: Senator Patrick OsakweNational Assembly ComplexBlock 14, Suite 5Senators Crescent,LAGOS-NIGERIA.\nDear Friend\nCompliment of the season.\nMy name is Senator Patrick Osakwe, the Chairman of the Senate committee on Niger Delta in the National Assembly of the Federal Republic of Nigeria. I am writing you to earnestly Solicit for your assistance in helping to receive some sum of money into your account for safe keeping.\nTHE PROPOSAL:\nI have the sum of US$31,000,000.00 (Thirty One Million Dollars) that I intend to transfer overseas through the assistance of a foreign partner. This money came as a result of Over provision in the budget for unpaid contract sum, to foreign contractors.\nThis over provision was done by my committee, but all payments have been made to beneficiaries leaving behind the over budgeted amount which amounts to US$31,000,000.00 which is deposited in the NigeriaDeposit Bank here in Nigeria but as civil servants we can not make claim of the funds or operate anyforeign account which is against the code of conduct of my country hence I am calling for your assistance to transfer this fund into your acount at the shortest period.\nI have agreed to transfer the funds overseas for my campaign funding and other investment purposes, private use and for investment purposes with your help.\nI am contacting you therefore, to stand in as the beneficiary to process this fund into your custody. Assoon as you consent to this I will immediately send you title documents to the fund in your name so you can make claim for it. I will provide you with 30% for assisting us and 10% to be set aside for reimbursement,for expenses that may arise during the process of concluding the transaction.\nThe fund shall be transferred to you legally in accordance to all laid down procedures governing transferof funds. I have perfected all modalities for the successful transfer of this money to you as thebeneficiary.\nFinally, I have to reassure you that this transaction is 100% risk free and should be kept absolutelyconfidential. Presently, you can reach me by return mail,you should also include your telephone numbers if any,for secured communication between us.\nThank you for your anticipated cooperation.\nI await your response. \nAlso Note that we need to conclude this transaction before the end of next month as we can still make payments on last years budget till this time.\nBest Regards,\nSenator Patrick Osakwe\n \n"}