{"category": "ham", "to_address": "Sugar List <sugar@laptop.org>", "from_address": "Jim Gettys <jg@laptop.org>", "subject": "[sugar] BTest-4 vs. Trial-2 & Dates", "body": "\nFor sanity's sake, and to give everyone as much time as possible this\ntime around, to *not* try to have everyone update for our BTest-4 build,\njust to turn around and a few weeks later want another stable build for\nuse in trials.\n\nSo we split our schedule to have two different pieces, and different due\ndates:\n    1) a stable build, based on the 406 image, that will be updated with\nkernel support for suspend/resume and autonomous networking.  This is\nwhat we're calling \"BTest-4\".  It will *not* attempt to update sugar and\napplications.  It is almost entirely focused on finishing up the basic\nhardware support and as a result, ensuring the BTest-4 hardware works\ncorrectly.\n    2) The next functional release, called \"Trial-2\", which is the next\nversion we intend to deploy for trials.  This is scheduled around the\nfact that it is approximately a month from when machines are built (in\nmid to late June) until they are tested, shipped to OLPC, transshipped\nto countries, unpacked, and ready for actual use in field trials. This\nis the much more ambitious integration of all the work going on in\nSugar, the presence and \"tubes\" middle ware,  and applications.\n\nYou can see this (and the expected contents) on:\n\nhttp://dev.laptop.org/roadmap\n\nHere are the dates (all dates and times are Cambridge MA):\n\nBTest-4:\n        6/7  6PM OFW Drop to Quanta\n        6/11 6PM Last possible OFW update to Quanta\n        6/13 6PM NAND B4 Release Candidate to Quanta\n        6/15 6PM NAND B4 Drop dead date\n        6/29 First B4's start shipping to Cambridge\n\nTrial-2:\n        6/19 6PM Proposals for any new activities due\n        6/26 6PM Trial-2 feature freeze - Activity bundles due\n        6/29 6PM Trial-2 RC-1\n        6/29 6PM Decisions on new activities\n        7/06 6PM Trial-2 RC-2\n        7/16 6PM Trial-2 RC-3 (code freeze)\n        7/23 6PM Trial-2 Final.\n\n                                                    - Jim\n\n-- \nJim Gettys\nOne Laptop Per Child\n\n\n_______________________________________________\nSugar mailing list\nSugar@lists.laptop.org\nhttp://lists.laptop.org/listinfo/sugar\n\n"}