{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 2, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESHouse Bid To Override Bush Veto Fails\nThe Democratic-controlled House fell far short in its bid to override President Bush's veto of an Iraqi war spending bill\n                        with timetables for troop withdrawals. Lawmakers went directly to the White House to talk about a compromise bill. More...Watch: Pelosi: The President Is Wrong\n• Train Carrying NASA Boosters Derails• Accused Daughter Rapist Held In Hong Kong• FDA Seeks New Antidepressant WarningU.S.Halberstam Crash Driver: I Had Green Light\nA 64-year-old man whose car was involved in the accident that killed Pulitzer Prize-winning journalist David Halberstam claims\n                        he had the green light at the time of the crash. More...Watch: Notebook: David Halberstam\n• Train Carrying NASA Boosters Derails• Immigration Protest In L.A. Turns Ugly\n                     \t\t\t\t\t| Watch• Study On Race Calls Foul On NBA Referees• More StoriesWorldIsraeli Foreign Minister To PM: Step Down\nTzipi Livni, Israel's popular foreign minister, says Prime Minister Ehud Olmert's resignation would be \"the right thing to\n                        do.\" She could succeed Olmert if he steps aside. Olmert says rivals should \"slow down.\"  More...\n• Tiny Caribbean Nation Feels China's Wrath• Swedish Companies Acknowledge Diversity• 4,000 U.S. Troops Headed To Baghdad • More StoriesPoliticsSounding Like Reagan Not Easy For GOP\nThe war in Iraq has left the GOP feeling gloomy and pessimistic about it's future, making it difficult for any of the party's\n                        presidential hopefuls to express the upbeat optimism Ronald Reagan was known for, The Politico reports. More...Watch: GOP Alternative Wanted\n• House Bid To Override Bush Veto Fails\n                     \t\t\t\t\t| Watch• Feeling Safe Isn't Safe\n                     \t\t\t\t\t| Watch• Senate Skeptical Over Revised Spying Rules• More StoriesHealthCandy-Flavored Meth Targets New Users\nMeth makers are combining the illicit drug Methamphetamine with sweet drinks, lollipops and more to mask its normally bitter\n                        taste and entice first-time users. \"Strawberry Quick,\" as it's called, has been found in several states. More...\n• FDA: Tainted Feed Is Low Risk To Humans• Passive Smoke Boosts Dementia Risk• FDA Seeks New Antidepressant Warning• More StoriesSciTechAustralia Working On Beer Power\nScientists and Australian beermaker Foster's are teaming up to generate clean energy from brewery waste water by using sugar-consuming\n                        bacteria. More...\n• Car-Free Zones On Rise In U.S.• NASA Ponders Death, Sex On Mars Mission• X-Rated Internet Addiction\n                     \t\t\t\t\t| Watch• More StoriesBusinessMurdoch's Dow Jones Bid Is Marketing Coup\nWith the news of a dramatic, unsolicited bid to acquire Dow Jones & Co. for $60 a share, Rupert Murdoch has created a tremendous\n                        amount of excitement, MarketWatch's Jon Friedman notes. More...Watch: Murdoch Bids For Dow Jones\n• Media Magnate Murdoch Faces Dow Battle• WSJ's Take On Rupert Murdoch\n                     \t\t\t\t\t| Watch• Auto Sales Take Nosedive In April• More StoriesEntertainmentBritney Back On Stage\nBritney Spears has made her comeback. The rehabbed pop princess took the stage for a five-song set at San Diego's House of\n                        Blues in what is thought to be her first concert in nearly three years. More...Watch: Britney's Comeback Performance\n• Japanese Audiences Warned About \"Babel\"\n                     \t\t\t\t\t| Watch• MTV Takes Its VMA Awards Bash To Sin City\n                     \t\t\t\t\t| Watch• Bush Thanks \"Idol\" Viewers• More StoriesOpinionReid Misplays His Hand\nTrue or not, Senate Majority Leader Harry Reid made a grave mistake when he said \"this war is lost,\" and ended up defending\n                        himself when he could have shifted the debate to President Bush's responsibility for the fiasco, says The New Republic. More...Watch: War Bill Sent To President\n• Bush Thwarts Bid To Short-Change War\n                     \t\t\t\t\t| Watch• Is 60 The New 40 Or Is 40 The New 60?• Republicans For Hillary?\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Tracy Smith: Bipolar Disorder Plagues A Child's Life\nHaley Abaspour looks like a normal 11-year-old girl, but she suffers from a multitude of mental problems, the most severe\n                        being bipolar disorder.  More...Watch: Treating Bipolar Kids\n• EARLY SHOW: Beware Of Fake Drugs Online, FDA Warns\n                     \t\t\t\t\t| Watch• EARLY SHOW: Grass Is Green? The Mower Should Be Clean\n                     \t\t\t\t\t| Watch• CBS Evening News: Immigration Raids Leave Children Behind\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nBritney's Comeback PerformanceShowBuzz RAW: Britney Spears made her comeback performance at the House of Blues in California, singing some of her\n                                    earliest songs. Her performance reportedly lasted less than 15 minutes.\nTOP VIDEOS\nRoyal Watch On Queen's Visit\nPelosi: The President Is Wrong\nFirst Look: War Funding Debate\nBush, Congress To Meet On Iraq\nSeeking Answers At Iraq Summit\nFunnel Cloud Caught On Tape\nSexless Marriage Relief\nNantucket Windmill Controversy\nSecuring Retirement Savings\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesEx-CIA Chief George Tenet defends the controversial High Value Program and denies to agency uses torture. Scott Pelley\n                           reports, Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryMurder In The Fast Lane:A sister fights for justice in the murders of her brother and his wife. Bill Lagattuta\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}