{"category": "ham", "to_address": "r-packages@stat.math.ethz.ch", "from_address": "\"Michael Lawrence\" <lawremi@iastate.edu>", "subject": "[R] [R-pkgs] RGtk2 2.10.x series available", "body": "The new 2.10.x series of the RGtk2 package has recently become available on\nCRAN. RGtk2 is a package for creating graphical user interfaces (GUI's) in R\nand is similar in purpose to the tcltk package. RGtk2 binds to and enables\nthe extension of the GTK+ user interface library, as well as several other\nlibraries that are integrated with GTK+. The gWidgetsRGtk2 package provides\nan RGtk2 implementation of the elegant toolkit-independent gWidgets API. The\ncairoDevice package allows embedding of R graphics inside RGtk2 interfaces.\n\nRGtk2 2.10.x (currently at 2.10.9-1) brings several major improvements:\n\n* Updated bindings to the latest stable versions of all bound libraries,\nwhich include: GTK+, GDK, GdkPixbuf, Cairo, Pango and libglade.\n* The ability to create new GObject classes, including new types of widgets,\nentirely from within R.\n* The compilation of RGtk2 now conditions on the versions of the libraries\ninstalled on the system. This means that RGtk2 has the same dependencies as\nthe original 2.8.x series, but if newer versions of libraries (ie GTK+\n2.10.x) are available, it will bind to the new API.\n* Much of the C-level API has been registered to be callable from the C code\nof other packages (allowing packages binding other GObject-based libraries\nto borrow from RGtk2).\n* Many, many bugfixes and minor improvements.\n\nRGtk2 offers several advantages over tcltk:\n\n* Many more features (too many more to list)\n* Arguably cleaner API\n* Integration with gWidgets (via gWidgetsRGtk2); see the 'pmg' package for\nan example of this in action.\n* The ability to create new types of widgets from scratch.\n* Support for building GUI's using the point-and-click interface design tool\nGlade (via libglade); see the 'rattle' package for example.\n* Extras: Cairo vector graphics, GdkPixbuf image manipulation, etc.\n\nRGtk2 as well as all other packages mentioned here are available on CRAN.\n\nMichael Lawrence\n\n\t[[alternative HTML version deleted]]\n\n_______________________________________________\nR-packages mailing list\nR-packages@stat.math.ethz.ch\nhttps://stat.ethz.ch/mailman/listinfo/r-packages\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}