{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 146", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. United States and Peru Extend Agreement to Protect\n      Archaeological and Ethnological Heritage of Peru.\n      (Museum Security Network Mailing list)\n   2. Germany. Lassalle ist kopflos. Arbeiterf?hrer ist von seinem\n      Sockel im Park am Stadtmuseum verschwunden. Polizei sucht nach\n      ihm. (Museum Security Network Mailing list)\n   3. Spain. Roban obras de arte del XVII en la iglesia de\n      Candemuela (Museum Security Network Mailing list)\n   4. Jail for thief who stole piece of Britain's are heritage\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Tue, 19 Jun 2007 06:03:21 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] United States and Peru Extend Agreement to Protect\n\tArchaeological and Ethnological Heritage of Peru.\nTo: \nMessage-ID: <035301c7b226$c6849eb0$538ddc10$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nOffice of the Spokesman\nWashington, DC\nJune 18, 2007\n\n\nUnited States and Peru Extend Agreement to Protect Archaeological and\nEthnological Heritage of Peru\n\n\nThe United States and Peru agreed to extend for an additional five years the\nMemorandum of Understanding (MOU) restricting pre-Columbian archaeological\nmaterial and ethnological colonial material from importation into the United\nStates without an export permit issued by Peru. Both countries originally\nentered into this agreement on June 9, 1997, and this is its second\nextension. The MOU underscores U.S. appreciation of the artistic and\ntechnical accomplishments of the peoples of ancient Peru, among the world's\nmost advanced civilizations. The cultural resources protected under this MOU\nare non-renewable and important both to Peruvians and to cross-cultural\nunderstanding and appreciation throughout the hemisphere. \n\nThe import restrictions encompassed by the MOU cover the material culture of\nthe Chav?n, Chim?, Paracas, Moche, Inca, and others inhabiting what is now\nPeru from c.12,000 B.C. to 1532 A.D. The restrictions also protect certain\nethnological material from the colonial period, 1532-1821 A.D. United States\nenforcement of these restrictions has resulted in the seizure and\nrepatriation of many hundreds of Peru's cultural treasures over the past\ndecade, including a group of some 400 objects returned to Peruvian\nauthorities on June 13, 2007. \n\nThis bilateral collaboration on behalf of Peruvian heritage is made possible\nby U.S. legislation implementing the 1970 UNESCO Convention on the Means of\nProhibiting and Preventing the Illicit Import, Export, and Transfer of\nOwnership of Cultural Property, an international framework of cooperation\ndesigned to stem pillage and unauthorized transport of cultural objects\nacross borders.\n\nThis MOU followed on an emergency import restriction that entered into force\nin 1990 reducing the incentive for pillage of Moche artifacts newly found in\nthe royal tombs of Sip?n, Peru. This new extension of the MOU is consistent\nwith the recommendation of the Cultural Property Advisory Committee, which\nis administered by the Department's Bureau for Educational and Cultural\nAffairs. In 1997 U.S. Customs published in the Federal Register the full\nlist of the categories of archaeological and ethnological material that are\nrestricted from import into the United States. Referred to as the\n\"Designated List,\" this document, as well as the newly amended MOU, and\nother information may be found at\nhttp://exchanges.state.gov/culprop/pefact.html. \n\nhttp://www.state.gov/\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Tue, 19 Jun 2007 06:03:21 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Germany. Lassalle ist kopflos. Arbeiterf?hrer ist von\n\tseinem Sockel im Park am Stadtmuseum verschwunden. Polizei sucht nach\n\tihm.\nTo: \nMessage-ID: <035401c7b226$c6a434a0$53ec9de0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nLassalle ist kopflos\n\n  \nDIEBSTAHL. Der Arbeiterf?hrer ist von seinem Sockel im Park am Stadtmuseum\nverschwunden. Polizei sucht nach ihm. \nMutma?ungen, die Linke stecke dahinter und habe aus Freude ?ber ihre\nGr?ndung den Kopf ihres Vordenkers Lassalle demontiert, um ihn durch einen\nseiner Nachfolger zu ersetzen, sind rein spekulativer Natur. Auch die\nspontane Reaktion eines Spazierg?ngers, \"den haben wohl die Russen\neingeschmolzen\", wird durch sein entwaffnendes Lachen entsch?rft. Fakt ist\nallerdings: Der Sockel im lauschigen Stadthaus-Park, auf dem seit mehr als\nzweieinhalb Jahrzehnten Ferdinand Lassalle, der gro?e Politiker,\nStaatssozialist und Arbeiterf?hrer in Bronze gegossen ?ber seine\nD?sseldorfer Jahre sinnierte, ist verwaist.\n\n\nWeiter reinigen die Kunstwerke\n\nSein Kopf ist weg. Die Polizei ist auf der Suche nach ihm, die Versicherung\ninformiert. Und im Stadtmuseum, das den Park und dessen Kunstwerke unter\nseinen Fittichen hat, herrscht seit Freitag Ratlosigkeit. \n\nSeitdem wei? man dort um den dreisten Klau, der, wie Kulturdezernent\nHans-Georg Lohe sagt, bislang einmalig ist in der Landeshauptstadt.\n\nRuth Willigalla, Ehrenvorsitzende der D?sseldorfer Weiter, hatte den Verlust\nentdeckt und ihn sofort im Museum gemeldet. \"Ich war mit einer\nKindergartengruppe im Park und wollte den Kleinen gerade etwas ?ber\nFerdinand Lassalle erz?hlen, da sah ich, dass er nicht mehr an seinem Platz\nstand. Die Woche davor habe ich ihn noch dort gesehen\", erz?hlt Willigalla\nder NRZ.\n\nIhr Frauen- und Brauchtumsverein D?sseldorfer Weiter hat im Park des\nStadtmuseums die Pflege einiger Kunstwerke ?bernommen. Lassalles Kopf, der\nBronzeabguss eines Originals von 1931, das der D?sseldorfer Bildhauer\nWilhelm Martini schuf, geh?rt dazu - aus gegebenem Grund: Lassalle hatte\nsich nicht zuletzt auch um die Rechte der Frauen verdient gemacht.\n\nEr hat nach Studien der Rechtswissenschaften der Gr?fin Hatzfeld zur Seite\ngestanden, als die sich von ihrem Mann scheiden lassen wollte, weil der sie\nst?ndig mit anderen Frauen betrog. Lassalle tat dies aufgrund seines\nRechtsverst?ndnisses, wohl auch aus pers?nlicher Neigung. Am Schloss Kalkum,\nauf dem die Gr?fin damals residierte, erinnert noch heute eine Bronzetafel\ndaran, dass \"der Begr?nder der Deutschen Sozialdemokratie\" in den Jahren\n1856/57 hier lebte.\n\nErst im Mai haben die Weiter den Herrn mit dem Schnurrbart, der seit 1980\nden Park mit seinem Denker-Antlitz bereichert, ihrer allj?hrlichen Pflege\nunterzogen. \"Da stand er noch unversehrt unter den B?umen, h?tte allerdings\nmal mit Seifenlauge behandelt werden m?ssen, weil seine Oberfl?che recht rau\ngeworden war\", meint Willigalla.\n\nOriginal im Museum\n\nDiese Ma?nahme ist nun obsolet. Verzichten muss D?sseldorf aber nicht auf\nden gro?en Mann. Im Stadtmuseum steht sein Original. \n\nUnd dort hofft man auch auf Schadensersatz durch die Versicherung. \"Dann\nkann man einen neuen Bronzeabguss fertigen lassen\", beruhigt die\nstellvertretende Leiterin, Annette Baumeister. Sie ist dennoch sp?rbar\nemp?rt ?ber die Dreistigkeit der Diebe.\n \n\n18.06.2007    BIRGIT KLAUSMANN  \n\nhttp://www.nrz.de/\n\n\n\n------------------------------\n\nMessage: 3\nDate: Tue, 19 Jun 2007 06:03:21 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Spain. Roban obras de arte del XVII en la iglesia de\n\tCandemuela\nTo: \nMessage-ID: <035501c7b226$c82ecc40$588c64c0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nEXPOLIO AL PATRIMONIO LEON?S\n \nRoban obras de arte del XVII en la iglesia de Candemuela  \n\n \n  \nLa iglesia de Candemuela ha sido la ?ltima de la provincia en recibir la\nvisita de los cacos, forzando la puerta. / F. FERN?NDEZ  \n    NOTICIAS RELACIONADAS  \nFrancisco Garz?a ?lvarez \n \nhttp://www.elmundo-lacronica.com/cronicadeleon/articulo_01.asp?idart=3430043\n&idcat=8215\n \n \n \nFULGENCIO FERN?NDEZ \n\nCANDEMUELA.? En Candemuela bromean con el hecho de que de all? sea el\ncomisario Segundo Mart?nez, en la actualidad Jefe de Seguridad del\npresidente del Gobierno. ?Ser? capaz de mantener la seguridad del\npresidente, pero la de la iglesia de su pueblo, no?. Aunque nada m?s gastar\nla broma la buena mujer que lo escucha sale en defensa de quien es muy\napreciado en el lugar. ?Si de ?l dependiera...?.\nY es que hace unos d?as, no se sabe cu?ntos pues ya hace tiempo que la falta\nde vecinos propicia que no se haya dicho misa en el lugar, se ha producido\nun nuevo robo en una iglesia de la provincia, en el bello templo\nrepresentativo del barroco rural de Candemuela. Los cacos forzaron la puerta\ny, con tiempo suficiente a la vista de lo que se llevaron, sustrajeron\nvarias piezas de bastante valor: dos relieves del altar, una imagen de Santa\nCatalina y otra de San Francisco de los dos retablos laterales del templo,\nun atril repujado con ala y ?guila (todos ellos del siglo XVIII), una\ncustodia de plata del siglo XVII y hasta el escudo de armas del benefactor\nque mand? construir el templo, el capit?n Francisco Garc?a ?lvarez, aunque\nde ?ste qued? otro escudo en piedra en la fachada exterior.\n\nLos vecinos no saben muy bien cu?ndo se pudo producir el robo pues ya hace\nun tiempo que no se abr?a la iglesia pues ante la escasez de vecinos en el\npueblo y las numerosas parroquias que atiende el sacerdote de la comarca,\nBruno Cuadrado, no hab?a dicho misa en este templo construido en el a?o\n1725. Ayud?, seguramente, al robo el hecho de que esta iglesia se encuentre\nsituada al lado de la carretera y las casas del pueblo est?n en el otro\nlado, lo que permitir?a a los cacos trabajar con mucha m?s tranquilidad y el\ntiempo suficiente para arrancar 'con cuidado' todas las piezas que\nfinalmente se llevaron, de los siglos XVII y XVII y en bastante buen estado\nde conservaci?n.\n\nSe da adem?s la casualidad que los cacos sab?an o, al menos, pod?an saber\nperfectamente lo que se llevaban pues a muy pocos metros de la iglesia la\nasociaci?n Cuatro Valles ha colocado un panel explicativo de las\ncaracter?sticas de la iglesia. \n\nUn nuevo robo en un templo de la provincia que reabre el debate sobre la\nseguridad de los templos y la necesidad de alguna iniciativa para proteger\nestos bienes. \n \nhttp://www.elmundo-lacronica.com/\n \n \n  \n\n\n\n------------------------------\n\nMessage: 4\nDate: Tue, 19 Jun 2007 06:05:12 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Jail for thief who stole piece of Britain's are\n\theritage\nTo: \nMessage-ID: <037301c7b227$089f6140$19de23c0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nJail for thief who stole piece of Britain's are heritage\nBy Echo Reporter\nComment\nAN \"idiotic\" art thief from Southampton who stole a valuable treasure from a\nHampshire art gallery was caught out when he tried to get a valuation from a\nworld expert in ceramics.\n\nJason Cochlin was part of a gang which stole a unique piece of 17th century\nearthenware from the gallery back in 2002.\n\nThe porcelain figurine of Ignis - the personification of fire - described as\na national treasure worth up to ?160,000, was among a dozen items taken from\nthe Allen Gallery in Alton.\n\nadvertisement\nBut after several years of lying low, Cochlin, 32, of Tankerville Road,\nWoolston, stupidly decided to contact a world expert on English ceramics,\nJonathan Horne, in London, for a valuation.\n\nMr Horne immediately knew the unsaleable treasure was stolen, contacted the\nmuseum and they called the police.\n\nCochlin, who had previous convictions for dishonesty, denied he had stolen\nit with the gang, thought to number at least three others, but his\nfingerprints were found by police at the gallery.\n\nCochlin, who has not named his fellow thieves, was found guilty of\nconspiracy to steal the piece and 11 others at Winchester Crown Court. He\nwas jailed for 12 months.\n\nHe was caught when he tried to get a valuation from an expert in London. \n \n \nThe tin-glazed figure made in 1679 and worth up to ?160,000, was described\nas being among the top 20 pieces of English ceramics when it was sold to the\nHampshire Museums Service in 1987.\n\nThe other pieces stolen were worth ?13,000.\n\nThe court heard that Cochlin laid low for several years after the theft\nbefore he was \"idiotic\" enough to contact Mr Horne.\n\nIn mitigation, Cochlin's barrister Robert Pawson said he had been forced to\ntake part in the conspiracy to steal the figures because he owed a debt to\nsomeone.\n\nMr Pawson explained that Cochlin had used a loan of ?20,000 to buy Ignis\nback from the criminal who had it, and told the court the married father of\nthree could not name him otherwise he would be shot.\n\n\"Mr Cochlin was idiotic enough to write to a world expert on English\nearthenware, Jonathan Horne, giving the insignia of the figure and asking\nfor a valuation,\" Mr Pawson said.\n\n\"He was used as a patsy by the more sophisticated criminal enterprise who\nare hardened criminals,\" he added.\n\nAfter his conviction, Cochlin handed the undamaged figure - described in\ncourt as a \"piece of national heritage\" - back to police in a shoebox and\nwrapped in towels.\n\nIt is now undergoing minor conservation work.\n\nSentencing Cochlin at Winchester Crown Court, Judge John Dixon said he would\nhave been jailed for four years if the figure had not been returned.\n\nHe called the theft an \"audacious conspiracy\" that had \"plundered the\nnational heritage\".\n\nMr Horne said after the case that he knew immediately when Cochlin had\nphoned him what the figure was.\n\n\"It was easily recognisable from his description even though it was wrong\nbut I knew what it was from the date,\" he explained.\n\nThe figure was made in Southwick, London in 1679 as a special one-off\ncommission for a wealthy client interested in Alchemy and Science.\n\n12:01pm Monday 18th June 2007\n\nhttp://www.dailyecho.co.uk/\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 146\n****************************************\n\n"}