{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "This Weekend on BBC Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCLARE BALDING ON THE GRAND NATIONAL\nIt's one of the most open Grand Nationals in years and you could make a case for almost half the field having a chance of glory.\n\n\nAs always there are some wonderful stories behind the runners and riders.\n\n\nOne of the most well-backed horses is Simon, owned by 87-year-old Mercy Rimell.\n\n\nThe great-grandmother's late husband Fred trained four National winners between 1956-1976 and his father Tom also won in the 1930s, so it would be wonderful if jockey Andrew Thornton could make it win number six for the Rimell family.\n\n\nOne horse that has slipped under the radar a little is L'Ami, who could finally give jockey AP McCoy his first National success.\n\n\nOut of the field, I think he is the horse with the most potential. \n\n\nHe is only eight years old and could easily go on and win a Cheltenham Gold Cup, which you can't say about many of the others.\n\n\nLast year's winner Numbersixvalverde is in with a very good shout. \n\n\nThroughout history winners of the big race have always had a strong record when they return to Aintree and he should challenge for a place. \n\n\nMy tip though is the mare Liberthine.\n\n\nThe rumours were that she was in foal (pregnant) and her hormones would be raging in a positive way, but late on Thursday it was revealed that she actually isn't. \n\n\nDespite this I still fancy her as jockey Sam Waley-Cohen has a great record over the National fences, even though he has never ridden in the big race itself before, and his mount has proved she likes jumping them. \n\n\nMy advice to all of you wanting to put a bet on, is to go for a yard that is in good form and a horse that enjoys quicker ground as it's going to be a scorcher here at Aintree on Saturday.\n\n\nEnjoy the race,\n\n\nClare\n\n\nClare Balding will present BBC ONE's Grand National coverage from 1310 BST on Saturday. The big race is at 1615 BST.\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nTHE GRAND NATIONAL\n bbc.co.uk/racing\nSaturday\nCoverage is on BBC ONE and the BBC Sport website from 1300-1710. Races are at 1345/1415/1450/1535 with the Grand National at 1615. Radio Five Live has commentary on all the big races  throughout the afternoon. Highlights at 0050-0120 on BBC ONE.\n\n\n\n\n\n\nFOOTBALL ON THE BBC\n bbc.co.uk/football\nSaturday\nFootball Focus (1210, BBC ONE); Score (1430, BBCi & BBC Sport website); Premiership football (1500, Radio Five Live/online); Final Score (1630, BBC ONE); FA Cup: Watford v Man United (1725, BBC ONE; 1730, Radio Five Live/online); Match of the Day (2230, BBC ONE).\nSunday\nMatch of the Day repeat (0735, BBC ONE); Premiership: Wigan v Tottenham (1330, Radio Five Live/online); FA Cup: Blackburn v Chelsea (1600, Radio Five Live/online); Match of the Day 2 (2230, BBC TWO).\n\n\n\n\n\n\nCRICKET WORLD CUP\n bbc.co.uk/cricket\nSaturday\nSouth Africa v New Zealand (1415-2230, Radio Five Live Sports Extra, BBCi and website); Cricket World Cup highlights (2350-0050, BBC ONE; repeated at 0500-0600 on Sunday).\nSunday\nBangladesh v Ireland (1415-2230, Radio Five Live Sports Extra, BBCi and website); Cricket World Cup highlights (2330-0030, BBC ONE; repeated at 0500-0600 on Monday).\n\n\n\n\n\n\nRUGBY UNION\n bbc.co.uk/rugbyunion\nSunday\nAdelaide Sevens (1300-1410, BBC TWO); Anglo-Welsh Cup final, Ospreys v Leicester (1410-1640, BBC TWO and website); Premiership highlights - Wasps v Northampton (1640-1720, BBC TWO). \n\n\n\n\n\n\nMORE SPORT ON THE BBC \n bbc.co.uk/tvandradio\nSaturday\nMotorsport: Bahrain Grand Prix qualifying (0855-1000 and 1155-1300, Radio Five Live Sports Extra/online).\nSunday\nMotorsport: Bahrain Grand Prix (1145, BBC Radio Five Live/online); Rugby league: Super League Show (1310-1400, BBC North and website).\n\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tGrand National runners and riders\n Pinstickers' guide to the big race at Aintree\n\t\t\t\t\t\n\t\t\t\t\t\tAintree sweepstake\n Download and print out this year's runners and riders\n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}