{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Carlene Pryor\" <coseutoviw@euto.org>", "subject": "Less weight - more pleasure and joy", "body": "\nCheck out the wonders of pound melting\n\n\n\n\n\nAnatrim – The latest and most exciting flesh loss product is now easily available – As you could see on ABC\n\n\n\nDid you understand that excessive body kilos kill a lot of people around the planet? We believe you hate the unattractive look of those people and the social bias against them. \n\nMoreover, you’ve not the will to withstand a siege of ruinous eating habits of yours. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nHere there is Anatrim, the recent product for the reduction of your body’s extra weight. The most astonishing thing is that Anatrim improves the quality of your life, making you crave less food and giving you better spirit. Pay you attention to some notes received from our customers:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of watching TV continually and always glutting myself with food \n\n\nI became keen on doing sport.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I have a great form now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nRita R., Bellevue WA\n\n\n\n\n\n\n\"I tried some passive weight losing, but almost with no result. It was difficult for me to hold back and not to eat something just at hand. \n\n\nOne day I was told on Anatrim my very best friend by and I was really impressed at the information.\n\n\n I had tried taking it, and my wife said to me I'm a different person now, 3 months later. \n\n\n32 pounds have gone away and I keep losing them! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nRikky Martin, Colorado\n\n\n\n\n\nAnatrim helps you to realize you got no such great need for that much food. It lifts your mood up, gives you additional energy, and attacks needless kilos. All thanks to its mighty newly-elaborated formula!!\n\n\n\nFind out more on this excellent product now!\n\n\n\n"}