{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"CNN Political Ticker\" <politicalticker@cnn.com>", "subject": "The CNN Political Ticker AM, Thursday, May 31, 2007", "body": "\n\n\nCNN.com - CNN Political Ticker\n\n\n\n\n\n\n\n\n\n\nFor the latest, breaking political news, check for updates\nthroughout the day on the CNN Political Ticker\nhttp://www.cnn.com/ticker. All politics, all the\ntime. \n\nCompiled by Alexander Mooney \nCNN\nWashington Bureau\n\nMaking news today...\n\n* The\nThompson presidential speculation buzz reached a feverish pitch\nyesterday with the news that the \"Law and Order\" star has taken\n\"new steps that make it clear that he is likely to run for the\nWhite House.\"\n(New York Times)\n\nThough not all\nRepublicans are head-over-heels for the former senator just\nyet, as some GOP strategists \"cautioned that Thompson will need\na more refined message and an error-free start to live up to\nthe publicity surrounding his all-but-certain candidacy.\"\n(Washington Post)\n\nMeanwhile, though Thompson has\n\"signaled GOP officials in Iowa that he would campaign for the\ncaucuses,\" (Des Moines Register) he is likely to be forced onto\nthe Iowa GOP straw poll in August \"whether he wants to or not.\"\n(Politico)\n\nAnd Arizona Sen. John McCain's message for\nhis old Senate ally: \"Come in, the waters fine.\"\n\n*\nElsewhere on the campaign trail, former New York City Mayor\nRudy Giuliani \"lashed into\" fellow New Yorker Hillary Clinton\nfor proposing a \"staggering tax increase.\" (New York Sun)\n\n* Meanwhile, in California Wednesday, Clinton maintained\n\"she followed all Senate rules when she accepted rides on a\nprivate jet from a longtime benefactor.\" (Associated Press)\n\n* And, Louis Freeh, the former FBI head under Clinton,\nwill endorse Giuliani's presidential bid Thursday, \"a boon to\nthe former mayor, whose views on security and terrorism can\nonly benefit from having an international lawman like Freeh in\nhis corner.\" (New York Daily News)\n\n* Thompson's news\nmay have stole the spotlight on Al Gore's potential White House\nbid -- at least for a day -- though a \"standing-room-only\ncrowd\" packed into George Washington University's Lisner\nAuditorium Wednesday night to hear the former vice president\nplug his new book. (DC Examiner)\n\nBut Al isn't the only\nGore family member bringing in the money.  Find out what his\nwife Tipper is selling for between $750 and $2,950 a pop in\nPolitical Hot Topics below!\n\nPresident's Schedule:\n\nAt 10:10 a.m. ET, President Bush will deliver remarks on\nthe United States' international development agenda at the\nRonald Reagan Building and International Trade Center in\nWashington, DC.  \n\nShortly after returning to the White\nHouse, the president will meet with Iraqi President Jalal\nTalabani at 2:20 p.m. ET in the Oval Office. \n\nAlso on\nthe Political Radar: \n\n* The House and Senate are not\nin session this week.\n\n* Former Presidents Bill\nClinton, George H. W. Bush, and Jimmy Carter are slated to be\non hand in Charlotte, North Carolina to help Billy Graham\ndedicate his library.\n\n* Meanwhile, Sen. Hillary\nClinton, D-New York, stays in California Thursday, scheduled to\naddress Silicon Valley leaders in Sunnyvale, California at 5:45\np.m. ET.\n\n* Sen. Barack Obama, D-Illinois, heads to\nReno, Nevada for a health care rally at 3 p.m. ET.\n\n*\nFormer North Carolina Sen. John Edwards makes a visit to San\nJose University Thursday, scheduled to speak in the school's\nstudent union at 8 p.m. ET.\n\n* New Mexico Gov. Bill\nRichardson has a fundraising event planned in Sante Fe, New\nMexico tonight.\n\n* Sen. Joe Biden, D-Delaware,\ncampaigns in the Hawkeye State Thursday, slated to attend a\nbreakfast with Benton County Democrats in Vinton, Iowa at 9\na.m. ET.\n\n* Sen. John McCain, R-Arizona, spends the\nday in Mississippi, scheduled to attend two fundraising events\nin Jackson, one at 6 p.m. ET, and one at 7 p.m. ET. \n\n*\nFormer New York City Mayor Rudy Giuliani will make a \"key\nendorsement\" announcement in New York City at 2 p.m. ET.\n\n* Former Massachusetts Gov. Mitt Romney spends another busy\nday in the Hawkeye State.  At 9 a.m. ET he attends a breakfast\nwith potential supporters in Newton; at 12:15 p.m. ET he\nattends a lunch with area voters in Sioux City; at 2:30 p.m. ET\nRomney is slated to visit the Wells Blue Bunny Museum Stop in\nLe Mars; At 5:45 p.m. ET, he will hold a \"Ask Mitt Anything\"\ntown-hall in Sioux Center. \n\n=========================================================\n\nPolitical Hot Topics \n(Today's top political\nstories from news organizations across the country) \n\nTHOMPSON TAKES KEY STEPS TOWARD WHITE HOUSE RUN: Former\nSenator Fred D. Thompson of Tennessee has taken new steps that\nmake it clear that he is likely to run for the White House,\npotentially shaking up a field of candidates that has failed to\nstrike a chord with the Republican base. Mr. Thompson is\ncreating a committee that will let him begin raising money on\nMonday toward a full-blown national campaign, advisers said\nWednesday. They hope his name recognition as an actor and radio\ncommentator, conservative stands on issues like immigration and\ngovernment spending, and strength in the South will\ndifferentiate him from the current crop of candidates. The\ndisclosure of his intensifying activities sent ripples through\nthe party, with the campaigns of two of the main Republican\ncandidates checking with their deputies in Iowa and New\nHampshire to monitor any hiring or fund-raising efforts by Mr.\nThompson, 64. New York Times: Stir in GOP as ex-senator move to\nrun\nhttp://www.nytimes.com/2007/05/31/us/politics/31thompson.html\n\nTHOMPSON COULD BE FORCED ONTO IOWA STRAW\nPOLL:  Whether he wants to be or not, former Sen. Fred Thompson\nwill probably be on the ballot when thousands of Iowa\nRepublicans meet on Aug. 11 at the Ames straw poll. After\nmonths of speculation that the \"Law & Order\" star would leap\ninto the crowded race for the Republican nomination for\npresident, aides let the cat out of the bag on Wednesday,\nsaying Thompson was likely to declare his intentions in early\nJuly. But that does not automatically mean he will participate\nin the much-hyped event. The Politico: Iowa GOP could force\nFred onto straw poll.\nhttp://www.politico.com/news/stories/0507/4252.html\n\nWILL THOMPSON COMPETE IN IOWA? Former Tennessee\nSen. Fred Thompson is expected to take steps toward a\nRepublican presidential campaign, but is unsure to what extent\nhe will compete in Iowa. Thompson, who is expected to form a\ngroup this week to allow him to test the waters, has signaled\nGOP officials in Iowa that he would campaign for the caucuses.\n\"Fred Thompson is taking all the necessary steps to come to his\nfinal decision,\" Thompson spokesman Mark Corallo told The Des\nMoines Register. \"Stay tuned.\" Des Moines Register: Thompson\nreaches out to Iowa GOP\nhttp://www.desmoinesregister.com/apps/pbcs.dll/article?AID=/20070530/-NEWS/70530012/1001\n\nTHOMPSON SET\nTO RUN AGAINST AN OLD FRIEND: He endorsed Sen. John McCain's\n2000 insurgent campaign for president, at the time saying the\nArizona Republican \"has shown characteristics of leadership\nlike nobody I've ever seen.\" After that election, he was a key\nGOP ally in the 2002 passage of McCain's signature\ncampaign-finance-reform legislation. But now former Sen. Fred\nThompson, R-Tenn., has become the latest challenge to McCain's\n2008 White House hopes. The Law & Order actor plans to\nofficially enter the Republican presidential race in July,\naccording to news reports. \"Fred's a very good friend,\" McCain\nsaid Wednesday in Phoenix. \"I guess my words are, 'Come on in,\nthe water's fine.'\" Arizona Republic: One-time ally set to\ncompete vs. McCain\nhttp://www.azcentral.com/news/articles/0531thompson-mccain0531.html\n\nBUSH REACHES OUT TO PUTIN:\nPresident Bush yesterday launched a high-stakes effort to\nrepair the dramatically deteriorating U.S. relationship with\nRussia by inviting President Vladimir Putin to visit the family\ncompound in Kennebunkport, Maine, after weeks of rhetoric\nreminiscent of the Cold War. The White House has grown\nincreasingly alarmed lately with the harsh tone coming out of\nMoscow and its hardening positions on issues that include\nIran's nuclear program, Kosovo statehood and missile defense.\nAdministration officials said privately that the situation has\nreached a crisis stage and needs to be reversed before it gets\nworse. Although the president's aides do not expect to resolve\nthe stickiest issues dividing the two sides during the visit to\nthe Bush family retreat on the rocky Maine coast July 1-2, they\nhope the relaxed setting will restore U.S.-Russian relations to\na more constructive footing. Washington Post: Bush reaches to\nPutin as relations continue to slide\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/05/30/AR2007053001017.html\n\nSPOTLIGHT SHINES\nON ZOELLICK: Robert B. Zoellick, freshly anointed by President\nBush as his choice to lead the World Bank, yesterday spoke in\nconciliatory tones about healing the rifts left from the tenure\nof the previous appointee, Paul D. Wolfowitz. \"The World Bank\nhas passed through a difficult time for all involved,\" Zoellick\nsaid at a morning announcement at the White House. \"There are\nfrustrations, anxieties, and tensions about the past that could\ninhibit the future. This is understandable but not without\nremedy. We need to put yesterday's discord behind us and to\nfocus on the future together.\" Zoellick, a former U.S. trade\nrepresentative and deputy secretary of state, said he would\nspend the coming weeks sounding out bank staff, development\nexperts and governments around the world on what the World Bank\nshould focus on, while courting support. Washington Post:\nZoellick debuts as Bank nominee\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/05/30/AR2007053000974.html\n\nFREEH TO ENDORSE\nGIULIANI: Louis Freeh, Democrat Bill Clinton's FBI director, is\ngoing over to the other side in a big way today -- endorsing\nRepublican presidential hopeful Rudy Giuliani, the Daily News\nhas learned. The high-profile endorsement is a boon to the\nformer mayor, whose views on security and terrorism can only\nbenefit from having an international lawman like Freeh in his\ncorner, experts said. \"Any endorsement that lets Rudy talk\nabout fighting crime and terrorism is good for him,\" said GOP\nconsultant Dan Schnur. \"And if Giuliani and [Hillary] Clinton\nare the nominees, you can be sure that Louis Freeh ends up in\nthe front row of every debate, just to try and knock her off\nher game.\" New York Daily News: Ex-Clinton FBI chief pushing\nPrez Rudy\nhttp://www.nydailynews.com/news/wn_report/2007/05/31/2007-05-31_exclinton_fbi_chief_pushing_prez_rudy-1.html\n\nOBAMA, ROMNEY OFFER SHARP CONTRASTS ON IRAQ:\nDemocratic presidential candidate Barack Obama and Republican\ncandidate Mitt Romney outline their respective foreign policy\nvisions in lengthy articles in the next issue of Foreign\nAffairs magazine, offering sharp contrasts on issues including\nthe war in Iraq and climate change. Obama calls the Bush\nadministration's Iraq policies \"tragically misguided\" and\nadvocates a phased withdrawal of U.S. combat forces, to be\ncompleted by next March. Romney notes that there is \"no\nguarantee\" that the administration's current strategy will\nsucceed but says that \"the stakes are too high and the\npotential fallout too great to deny our military leaders and\ntroops on the ground the resources and the time needed to give\nit an opportunity.\" Washington Post: Obama and Romney lay out\npositions on Iraq and beyond\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/05/30/AR2007053002302.html\n\nBROWNBACK ON\nEVOLUTION: In our sound-bite political culture, it is\nunrealistic to expect that every complicated issue will be\naddressed with the nuance or subtlety it deserves. So I suppose\nI should not have been surprised earlier this month when,\nduring the first Republican presidential debate, the candidates\non stage were asked to raise their hands if they did not\n\"believe\" in evolution. As one of those who raised his hand, I\nthink it would be helpful to discuss the issue in a bit more\ndetail and with the seriousness it demands.  The premise behind\nthe question seems to be that if one does not unhesitatingly\nassert belief in evolution, then one must necessarily believe\nthat God created the world and everything in it in six 24-hour\ndays. But limiting this question to a stark choice between\nevolution and creationism does a disservice to the complexity\nof the interaction between science, faith and reason. New York\nTimes Op-Ed: What I think about Evolution\nhttp://www.nytimes.com/2007/05/31/opinion/31brownback.html\n\nDEMS CAUSING MORE EXCITEMENT IN THE GRANITE\nSTATE: Democratic presidential candidates are drawing bigger\ncrowds, more donors, and more energy from the New Hampshire\nelectorate than Republican hopefuls are, a sign to officials in\nboth parties of a lack of enthusiasm for the current GOP field\nand a tired state Republican Party still reeling from a\nhistoric defeat in November. New Hampshire Republicans, who\nlost control of both chambers of the state Legislature and both\nUS House seats last fall, are showing only moderate interest in\nthe 10 GOP presidential candidates who have trooped to their\nstate. Democratic candidates for the 2008 nomination,\nmeanwhile, have had to issue tickets to campaign events to\naccommodate large crowds, and are already conducting statewide\ncanvassing efforts usually unheard of at this early stage of\nthe campaign. Average donations to Democratic contenders from\nNew Hampshire residents are also higher and more numerous,\naccording to campaign finance records. Boston Globe: Democrats\npress advantage in New Hampshire\nhttp://www.boston.com/news/nation/articles/2007/05/31/-democrats_press_advantage_in_nh/\n\nGIULIANI SLAMS\nCLINTON'S PROPOSED 'STAGGERING TAX INCREASE': Mayor Giuliani is\nlabeling Senator Clinton's plan to reverse President Bush's tax\ncuts \"an astounding, staggering tax increase\" that would turn\nback the clock and damage America's economy. In a potential\npreview of next fall's presidential contest, Mr. Giuliani, who\nis seen as the front-runner for the Republican nomination,\ndirectly attacked the leading Democratic candidate, Mrs.\nClinton, over a speech she gave Tuesday in New Hampshire\nbemoaning the return of \"robber barons\" and promising to pursue\n\"shared prosperity\" by increasing taxes on Americans making\nmore than $200,000 a year. New York Sun: Giuliani lashes into\nClinton over 'staggering' tax hike\nhttp://www.nysun.com/article/55535\n\nCLINTON: JET TRAVEL COMPLIED WITH SENATE RULES: Sen.\nHillary Rodham Clinton said Wednesday that she followed all\nSenate rules when she accepted rides on a private jet from a\nlongtime benefactor. \"Whatever I've done, I complied with\nSenate rules at the time. That's the way every senator\noperates,\" the Democratic presidential contender said in an\ninterview with The Associated Press during a campaign stop in\nLas Vegas. Clinton's travel, along with and consulting fees\npaid to her husband, the former president, have come to light\nrecently in a lawsuit against Vinod Gupta, a Clinton\ncontributor and chief executive of the data company, InfoUSA\nInc. AP via Yahoo News: Sen. Clinton defends private jet travel\nhttp://news.yahoo.com/s/ap/20070531/ap_on_el_pr/clinton_iraq\n\nAL NOT THE ONLY GORE MAKING MONEY: Looks\nlike former Vice President Al Gore -- and the will he? Won't\nhe? run for president game -- isn't the only Gore family member\ngenerating excitement these days. His wife, Tipper, is creating\nquite a buzz herself on 14th Street. The Mitchell Gold + Bob\nWilliams furniture store, which opened in late April, sells\nprints of some of Tipper's photography. (She's been shooting\nsince the 1970s and even put out a book of photographs in 1996\ntitled, \"Picture This.\") Turns out, they've already sold four,\nincluding \"Pyramids in Egypt\" and \"Shanghai Scene.\" And that's\nno small feat, considering that it'll run you anywhere from\n$750 to $2,950 to walk out of the store with a Tipper photo\nunder your arm. DC Examiner: Yeas and Nays\nhttp://www.examiner.com/blogs/Yeas_and_Nays\n\n\n\n\n\n\nFor the latest breaking political news click here.\nBookmark the CNN Political Ticker here.\nFor news tips, political nuggets, feedback and suggestions, please drop us a line at politicalticker@cnn.com\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the CNN Political Ticker list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=morninggrind\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}