{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Glenn Ervin\" <GlennErvin@cableone.net>", "subject": "Re: A computer issue, how should I deal with this? Best solution?", "body": "Hi Greg,\nKeep in mind that the file system manages the mechanics of a drive, thus the \nfile system does have an effect on the success of a drive, as does other \nfactors, like how fragmented your data is on the drive, as if your data is \nvery fragmented, the drive will have to work much harder.  This is just one \nof the ways that the file system, and manner in which data is stored can \neffect the life expectancy of a drive.\nGlenn\n----- Original Message ----- \nFrom: \"Gregory Nowak\" \nTo: \nSent: Sunday, June 24, 2007 5:40 PM\nSubject: Re: A computer issue, how should I deal with this? Best solution?\n\n\n-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nOn Sun, Jun 24, 2007 at 11:16:27AM -0500, Glenn Ervin wrote:\n> As far as NTFS being more reliable than FAT32, I would argue on personal\n> experience  that I have had more drives go bad that were running NTFS than\n> those running FAT32.\n\nWhile I don't mean to, and can't dispute your personal experience, as far as \nI know, there is no connection what so ever between the file\nsystem on a drive, and whether the drive goes bad or not, I don't\nfollow this line of reasoning. That's like someone saying they got a\nflat tire, because they were driving in a rain storm.\n\n> I have owned more drives formatted with FAT32, so I should have \n> experienced\n> more FAT32 file system problems, yet I have experienced the opposite.\n\nThis looks logical on the surface, but really isn't if you think about\nit. Sticking with the car analogy, that's like saying that if you\ndrive the same model/year of car for an equal amount of time, both cars\nwill use exactly the same amount of gas. On the surface, this looks\nlogical, but really isn't if you stop and consider it, (I won't\nexplain why here. Coming back to the hd and fs comparison, the only\nway to test such a hypothesis, would be to have 2 drives of the same\nmake and model, produced in the same factory on the same date, one\nformated with fat32, the other with ntfs. Even then, your results\nstill couldn't be said to be accurate, because the workmanship on each\ndrive might have varied, the materials, although the same, used to\nconstruct the drives might have varied in some small way, and the\namount of use each drive got would most likely vary as well.\n\nKeep in mind that modern drives have more heads, and more cylinders than\nolder drives, while still being confined to the same physical size\nlimit. Therefore, there are more heads, and more media in a newer\ndrive that could fail, as opposed to the older drives. It is also\npossible that due to newer drives being internally more complex then\nolder drives (see previous head/cylinder comparison), that quality\ncontrol today isn't as thorough as it once used to be. In addition to\nmore complexity, another reason for poorer quality control is that the\nsize of drives is increasing, and prices are coming down steadily. So,\ncompanies making these drives either could be expecting people to\nupgrade more often, thus they aren't concerned with the drive having\nan especially long lifetime, or they could purposefully be making more\nflaky drives, so as to force people to buy newer drives, thus keeping\ntheir business going. I am only proposing a theory here, I'm not saying\nthat this is what manufactures are actually doing, though they might be.\n\n> Now this can be due to mechanical problems un-relat\ned to the file system,\n> but it is often unclear whether the hard-drive crash was due to an \n> inability\n> for the file system being able to repair itself.\n\nYou said it yourself, a hard drive is a mechanical, (well actually, an\nelectro-mechanical) device. If it\nmechanically breaks, and crashes, no file system put on it, before, or\nsomehow after the crash, would bring that drive magically back to\nlife. As for the inability of a file system to repair itself causing\nthe drive to crash hardware wise, this is something else that doesn't\nmake sense, to me at least.\n\nGreg\n\n\n- -- \nweb site: http://www.romuald.net.eu.org\ngpg public key: http://www.romuald.net.eu.org/pubkey.asc\nskype: gregn1\n(authorization required, add me to your contacts list first)\n\n- --\nFree domains: http://www.eu.org/ or mail dns-manager@EU.org\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGfvLa7s9z/XlyUyARAmKfAKCpOqomieK3EELD8VO3lStdPbF/4gCglSHn\nbhqImSZ+e6gBNLWzkgYFn0A=\n=FEjp\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}