{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "Tonight on CNN <mailings@mail.cnn.com>", "subject": "Katie Couric Interviews Larry King Tonight!", "body": "\n\n\n\nTonight On CNN Email\n\n\n\n\n\n\n\nMay  2, 2007\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n9 p.m. ET\n\n\n \n\nLarry King Live: 50 Years in Broadcasting\n\n\nKatie Couric takes over Larry's chair and asks the King of Talk all the things you want to know as we celebrate Larry's 50 years in broadcasting. Watch CNN tonight at 9 p.m. ET.\n\n\n\n\n\n\n\n\n\n\n\n\nRelated:• DeGeneres hosting show from hospital bed\n\n\n\n\n\n\n\n \n \n\n\n\n\n\n \n\n\n\n\n6:00 a.m. ET\n\n\n \n\nAmerican Morning\n\n\nControversial research for a rare disease. Could it spell hope for those suffering from Lou Gehrig's disease?\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n6:00 p.m. ET\n\n\n \n\nLou Dobbs Tonight\n\n\nLou Dobbs draws the line on illegal immigration live from a small town. Find out what they're doing to fight broken borders.\n\n\n\n\n\n\n\n7:00 p.m. ET\n\n\n \n\nThe Situation Room\n\n\nFormer C.I.A. Director George Tenet calls out the Bush Administration on prewar intelligence, but why has he waited until now? Find out tonight.\n\n\n\n\n\n\n\n8:00 p.m. ET\n\n\n \n\nLou Dobbs Prime-time Special: Broken Borders\n\n\nLou Dobbs is live in Hazleton, PA where the immigration fight heats up. Find out what they're doing to fight broken borders, in a prime-time special.\n\n\n\n\n\n\n\n9:00 p.m. ET\n\n\n \n\nLarry King Live\n\n\nKatie Couric flips the script and asks Larry all the things you want to know as we celebrate Larry's 50 years in broadcasting.\n\n\n\n\n\n\n\n10:00 p.m. ET\n\n\n \n\nAnderson Cooper 360\n\n\nThe popularity of the TV show CSI has now influenced the way some juries think. Anderson Cooper investigates why the CSI effect may be a dangerous thing.\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n\nSend us your feedback >  |  CNN's full program schedule >  |  E–mail sign up >\n\n\n\n\n \n \n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network LP, LLLP.\nA Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us. \n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the Tonight on CNN list, click here. \n\n\n\n\n\n\n\n"}