{"category": "ham", "to_address": "debian-desktop@lists.debian.org", "from_address": "Sebastian Heinlein <debian@glatzor.de>", "subject": "Re: Debian Desktop Etch+1 - the long road to binoculars.", "body": "Am Freitag, den 29.06.2007, 12:11 -0300 schrieb Gustavo Franco:\n> On 6/28/07, Sebastian Heinlein  wrote:\n> > Am Mittwoch, den 27.06.2007, 16:55 -0300 schrieb Gustavo Franco:\n> >\n> > > * Flash and Java support\n> > >\n> > > It would be amazing if we could add stable enough: gnash or swfdec\n> > > (flash) and basically gcjwebplugin (java) or maybe something that will\n> > > come out from openjdk.\n> >\n> > Asac works on a kind of gnome-plugin-install based on gnome-app-install\n> > for Ubuntu.\n> \n> Does it install the non-free plugins? If it install the free ones we\n> can push them directly through the tasks, unfortunately not now since\n> the upstream code isn't mature enough.\n\nIt is up to us to decide what will be available and how easy. Currently\nthe default filter is set to \"open source software only\". So the user\ndoesn't even see the propriatary packages. You have to change the filter\nto \"all software\" before.\n\nJulian Adres Klode works on getting the basic app-data from the Debian\nrepository. He can easily add manual virtual applications: flash,\ncodecs, etc.\n\nThe codec/plugin installation would require some patching of other\napplications. The gstreamer part should be integrated upstream already,\nso that it allows to launch a generic codec installer. But I don't know\nabout firefox, asac, would be the person to talk to.\n\n\n> I'll look into this, but do you know how it compares with the xine\n> backend actually?\n\nI cannot provide any numbers to you. AFAIK the missing dvd menu support\nis still the greatest disadvantage of gstreamer. Totem switched to\ngstreamer as the default recently: \nhttp://svn.gnome.org/viewcvs/totem?view=revision&revision=3725\n\nAnd gstreamer has support for the codec installer :)\n\n> > > * Upgrade manager (update-manager)\n> > >\n> > > I've discussed with kov some of the stuff that can be done to make\n> > > sure Debian Desktop Etch upgrades to Lenny will be easier than\n> > > Sarge->Etch.\n> >\n> > I am going to remove the Ubuntu specific parts of the latest\n> > update-manager soon, so that we can update the Debian package.\n> > Furthermore mvo did a great job in providing a dist-upgrade (with\n> > terminal, gtk and qt frontend) tool that is quite flexibel and could be\n> > extended for Debian. Perhaps it is also worth to look at his update unit\n> > tests for Ubuntu.\n> \n> Sounds good. Are you coordinating with Gustavo Noronha (kov) too ? He\n> works on the package in Debian as you might now and AFAIK has some\n> contributions all over the code.\n\nNot really yet. But a good idea.\n\nSebastian\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}