{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Chauncey Hendricks\" <menecotekkpef@ecotekk.com>", "subject": "Watch your body change with Anatrim", "body": "\nJoin the thousands of people who got slim\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most attracting product for weighty people is now readily available – As shown on Oprah.\n\n\nDo you hold in your memory all the times when you told yourself you would do any thing for being delivered from this fastly growing pounds of fat? Luckily, now no major price is to be paid. With Anatrim, the earth-shaking weight-reducing medley, you can get naturally health mode of life and a really slender figure. Take a look at what people say!\n\n\n\n\"It’s difficult to acknowledge it but I was a junk food addict. \n\n\nI swallowed up all this rubbish \n\n\nand was unable to stop. \n\n\n\n\nThis torment stopped when I started course with Anatrim! \n\n\nGod,\n\n\n\n\n my inclination to eat constantly decreased, \n\n\nspirits improved and I turned to the happiest person 18 pounds in 2.7 months. \n\n\n\n\nSo, I can tell you now I became the happiest person!\"\n\n\n\n\n\nMaria H., Las Vegas\n\n\n\n\n\n\"I had problems with over-weight since I was a boy. \n\n\nIt’s difficult to fancy how I hated being mocked at school. \n\n\n\n\nI abhorred my stoutness and I hated even myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nIt literally dragged me out of this horror! The very sincere thanks to you, guys.\"\n\n\n\n\n\nSteve Doubt, San Diego\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was luckily saved! I went into this circle, depression – more eating – more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce one of my friends pointed at your web page and I called for my pack of Anatrim at the same time. \n\n\nThe results were magnficent, my appetite came to acceptable level, I was often in good spirits, and, be sure, I went some belt holes back. And you know, the bed became cool, too!\"\n\n\n\n\n\nJoe\n\n\n\n\n There is a lot of thanks delighted people leave after taking Anatrim. Don’t you gonna add yourself to the thousands and thousands of slim people and take this original appetite reducing power raising product now!\n\n\nDo not lose the opportunity!\n\n\n\n\n"}