{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "340p 6/11 Update: Truss attached; spacewalk on tap", "body": "\n\n\n\n\n340p 6/11 Update: Truss attached; spacewalk on tap\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 39\nPosted: 3:39 PM, 6/11/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-36 (06/10/07): Flight director thrilled with smooth rendezvous; pitch maneuver finds no obvious signs of damage to shuttle's heat shield\n   SR-37 (06/10/07): Shannon leaning toward spacewalk repair of protruding blanket\n   SR-38 (06/11/07): Astronauts gear up for spacewalk, solar array install\n   SR-39 (06/11/07): S3/S4 bolted to station power truss\n\n=================================\n\n3:39 PM, 6/11/07, Update: S3/S4 bolted to station power truss; spacewalk on tap\n\nRunning about an hour behind schedule, the Atlantis astronauts successfully bolted a new 36,000-pound solar array truss and rotary joint to the international space station today, setting the stage for a spacewalk by Jim Reilly and Danny Olivas to activate and outfit the new equipment.\n\nShuttle pilot Lee Archambault, operating the space station's Canadian-built robot arm, eased the huge truss segment into place for an initial capture around 2:27 p.m. A large claw on the outboard end of the existing S1 truss then rotated and locked onto a capture bar in the S3 segment.\n\nAs the claw pulled the S3/S4 segments in tight, alignment guides ensured four motorized bolts lined up properly. By 3:11 p.m., three of the bolts had been successfully driven home - a requirement for pressing ahead with today's spacewalk - and a few minutes later, Archambault, operating the robot arm, released the now-firmly-attached truss. The fourth bolt was in place by 3:38 p.m.\n\nThe work ran about an hour behind schedule after the space station's control moment gyroscopes became \"saturated,\" losing their ability to maintain the station's orientation. This is a routine issue with gyroscope systems and after using the shuttle's thrusters to maintain control, the station gyros were reset and able to resume control.\n\nReilly and Olivas are suited up in the station's Quest airlock module. Today's spacewalk originally was scheduled to begin at 2:58 p.m., but it was delayed, along with truss attachment, by the gyro problem. As of 3:34 p.m., the crew was preparing to depressurizing the airlock, which would result in a spacewalk start time of around 4:10 p.m.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}