{"category": "ham", "to_address": "dev-zero@gentoo.org", "from_address": "Jelmer Vernooij <jelmer@samba.org>", "subject": "Re: Install additional header-files to allow separate plugin builds", "body": "On Wed, 2007-07-04 at 15:03 +0200, Tiziano Müller wrote:\n> Gerald (Jerry) Carter schrieb:\n> > Tiziano Müller wrote:\n> >> I just wondered recently why all available plugins (samba-vscan, pdbsql)\n> >> need the complete samba source tree to build. So I started to experiment\n> >> and with the tree below, it's possible to successfully build the\n> >> mentioned plugins/backends (but didn't test them yet :-)\n> > \n> >> Now, are there any plans to install the relevant header-files in the\n> >> future? Even if the API is still unstable?\n> > \n> > It's not a good idea to install all these headers.  We need to\n> > clean up  the code to allow a small set of public headers\n> > that people can build against.\n> I know that it's a bad idea. The problem is only that at the moment\n> samba-vscan is integrated into the samba-package here on Gentoo (don't\n> worry, the user has to enable it separately). And we got another request\n> for pdbsql. The only possibility for us to separate the packages is to\n> install those headers.\n> \n> Is there somebody working on it or some concrete plans when the cleanup\n> will happen?\n> At the moment, samba-vscan and pdbsql are broken anyway for samba-3.0.25\n> due to api-changes, so, no hurry :-)\nAs far as I know there isn't anybody actively working on anything at the\nmoment.\n\nRather than installing all we thing could be public, I think it makes\nsense to start by installing just the things that are being used by\nplugins /and/ we think should be public. We can always expand later, if\nnecessary. So I think the first step towards getting this resolved would\nbe to investigate what functions plugins such as samba-vscan and\nsamba-pdbsql need exported.\n\nCheers,\n\nJelmer\n\n-- \nJelmer Vernooij  - http://samba.org/~jelmer/\n\n\n"}