{"category": "ham", "to_address": "\"General Copyright Discussions (questions, organizing,\n\tetc)\" <discuss@list.digital-copyright.ca>", "from_address": "\"Scott Elcomb\" <psema4@gmail.com>", "subject": "Re: [d@DCC] MS censors UN document", "body": "On 5/29/07, mgurst@vcn.bc.ca  wrote:\n> One final note, to call the proceedings a \"UN document\" is a gross\n> distortion... The conference was not I believe an \"official\" UN conference\n> but may have been \"endorsed\" by one or another UN agency--it happens\n> fairly often; and the proceedings were the proceedings of a mostly\n> Austrian funded and sponsored conference that mattered very little in the\n> great scheme of things and wasn't so far as I know of much significance\n> even in the context of WSIS.\n\nThanks for your thoughts MG.  Again, more recent references would be\nwonderful, but going on what you've provided thus far...\n\nI understand that happens, (too often for my personal liking) but does\nnot the fact that a document \"endorsed\" by a UN agency (regardless of\nthe sponsorship of any individual or group of nations), regarding a\nrelated conference, make said document - in it's final form - an\n\"official\" UN document?\n\nPerhaps it was sponsored by Austria, but if it is a UN document why\nthen should MS have _any_ control over the contents of the document?\n\nThere are many areas in which I could use schooling - politics first\namong them.  =)\n\nThanks again.\n- Scott.\n\n-- \nScott Elcomb\n\n\"Our Founders' faith in the viability of representative democracy\nrested on their trust in the wisdom of a well-informed citizenry,\ntheir ingenious design for checks and balances, and their belief that\nthe rule of reason is the natural sovereign of a free people.\" - Al\nGore (The Assault on Reason, 2008)\n\n\"They that can give up essential liberty to obtain a little temporary\nsafety deserve neither liberty nor safety.\"  - Benjamin Franklin\n\n'\"A lie can travel halfway around the world while the truth is putting\non its shoes.\"  - Mark Twain\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}