{"category": "spam", "to_address": "\"Matt Dana\" <plragde@plg.uwaterloo.ca>", "from_address": "\"Nina Rice\" <Ninaz@starblvd.com>", "subject": "Not another email from Ms. Rice:)", "body": "EVER DREAM OF MIND-BLOWING LOVE-MAKING THAT NEVER FAIL TO SATISFY?\n\nWell, you don't need to dream anymore. At last there is a solution to all\nyour bedroom setbacks. The Vibrating Ring is the latest toy taking the world\nby storm. It's fun, safe, easy-to-use, and it's available now. \n\nThe Vibrating Ring features a raised tickler to stimulate her externally,\nwhile the expandable silicone ring sends deep vibrations up the shaft for\nboth his and her pleasure. If you want unbeatable results every time, you\ncant go past this amazing new product. \n\nThe Vibrating Ring expands to fit any size and is designed to massage those\noften neglected areas. If you are ready to experience a fantastic love-life,\nthen this is the perfect product for you.\n\n\nSee why everyone else Loves It! It is so Much! \nhttp://www.unrivaledtoys.net\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncould not remember where he parked the car, so he was wearing the flowered\ndress, the wig and his makeup the previous day. whiskered stubble had grown\nan day longer. He had powdered it make it lighter. \"This it-\" asked Gregory.\n\"Absolutely,\" said Al Baker. He no idea what place was. He conned Gregory\nout of two hundred the night before to do more infiltration work, but when\nhe gotten to the loft building, was closed for the \nSo when he got back to the he had no choice but to Gregory that absolutely\npositively, the building housed drug operation. Maybe it Who knew- Who would\nmove into City except somebody doing something illegal- \"A big factory,\nright-\" Gregory again. \"No doubt about it,\" said. \"That's what sources in\nthe family tell right. This is what do. Lizzard, you go \nand case the joint. out what they're doing who's up there. Then down and\ntell us and move. We want to be sure it's trap.\" \"Who'd set trap us-\" Tolan\nsaid. \"Nobody knows we're alive, Gregory.\" \"You can't too sure,\nExterminator,\" said Gregory. \"And call me Eraser.\" Fearful of an ambush, of\nbeing killed, \nLizzard walked across the and through the ground floor of the factory He\nlooked back toward car for encouragement and Gregory waved him Lizzard found\nsmall hall that read: WO FAT FORTUNE COMPANY. While he waited in the looking\naround and listening, inside second floor factory, and Mrs. Wo Fat and three\nchildren were busy preparing the\n\n\nbye bye\n\n\n\nNina\n\n\n"}