{"category": "ham", "to_address": "<Roger.Bivand@nhh.no>", "from_address": "\"Andrew Niccolai\" <andrew.niccolai@yale.edu>", "subject": "[R] Follow up:  surfaces and digital terrain model", "body": "I realize that as of yesterday, this message thread is 4 years old but can\nsomeone possibly post the clines function that Renaud mentions in the\nposting below?  That would be wonderful and most appreciated.\n\nThanks,\nAndrew \n\n\nAndrew Niccolai\nDoctoral Candidate\nYale School of Forestry\n\n\n \nFrom: Renaud Lancelot \nDate: Fri May 30 22:37:02 2003\n\nYesterday, I posted the following:\n\n>>I have computed a digital terrain model from a set of points (x, y, z)\n>>using the function interp() in package akima. I want to predict flooded\n>>surfaces given target values of z. I can display the flooded surfaces\n>>with contour() or image(), but I don't know how to get the polygons\n>>delimiting the surfaces. Did anyone write a function for this purpose ?\n\nMany thanks to Roger Bivand, Paul Murrel, Deepayan Sarkar, Barry\nRowlingson and Thomas W Blackwell for their replies and their help. Paul\nMurrel provided me with a function \"clines\", kindly ported to Windows by\nDuncan Murdoch. This function does exactly what I need, i.e. it returns\na list of polygons corresponding to target value(s) of z.\n\nI wrote a function to compute (hopefully !) what I want, i.e. predicted\nflooded surfaces given target values of z (managing the cases of several\nindependent watered surfaces, possibly with islands). Provided that Paul\nMurrel agrees to share his function, I will be happy to send it to\nanyone wishing to use and improve it (and debug it ;-) ).\n\nBest regards and thanks again,\n\nRenaud\n\n-- \nDr Renaud Lancelot, v?t?rinaire\nCIRAD, D?partement Elevage et M?decine V?t?rinaire (CIRAD-Emvt)\nProgramme Productions Animales\nhttp://www.cirad.fr/fr/pg_recherche/page.php?id=14\nISRA-LNERV                      tel    +221 832 49 02\nBP 2057 Dakar-Hann              fax    +221 821 18 79 (CIRAD)\nSenegal                         e-mail renaud.lancelot_at_cirad.fr\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}