{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Spie Sutherland\" <spie@proficio.ca>", "subject": "Re: A computer issue, how should I deal with this? Best solution?", "body": "The way they do it is to allow more than one 2GB partition!\nThat's the primary and logical drives. From microsoft:\n\nMicrosoft MS-DOS versions 4.0 and later allow FDISK to \npartition hard disks up to 4 gigabytes (GB) in size. However, \nthe MS-DOS file allocation table (FAT) file system can \nsupport only 2 GB per partition. Because of this fact, a hard \ndisk between 2 and 4 GB in size must be broken down into \nmultiple partitions, each of which does not exceed 2 GB. \n\nhttp://support.microsoft.com/kb/118335\n\nAfter you use the Fdisk tool to partition your hard disk, use the \nFormat tool to format those partitions with a file system. The file \nsystem File Allocation Table (FAT) allows the hard disk to \naccept, store, and retrieve data. Windows 95 OEM Service \nRelease 2 (OSR2), Windows 98, Windows 98 Second Edition, \nWindows Millennium Edition (Me), and Windows 2000 support \nthe FAT16 and FAT32 file systems. When you run the Fdisk tool \non a hard disk that is larger than 512 megabytes (MB), you are \nprompted to choose one of the following file systems: \n\nFAT16: This file system has a maximum of 2 gigabytes (GB) for \neach allocated space or drive letter. For example, if you use the \nFAT16 file system and have a 6-GB hard disk, you can have \nthree drive letters (C, D, and E), each with 2 GB of allocated \nspace.For additional information about the FAT16 file system, \nclick the article number below to view the article in the Microsoft\nknowledge base:\n\nMaximum Partition Size Using FAT16 File Syetem\nhttp://support.microsoft.com/kb/118335/EN-US/\n\nFAT32: This file system supports drives that are up to 2 terabytes \nin size and stores files on smaller sections of the hard disk than the \nFAT16 file system does. This results in more free space on the hard \ndisk. The FAT32 file system does not support drives that are \nsmaller than 512 MB.For additional information about the FAT32 \nfile system, click the article number below to view the article in the \nMicrosoft Knowledge Base: \n\nDescription of the FAT32 File System\nhttp://support.microsoft.com/kb/154997/EN-US/\n\n>From the above\nWindows 95 OSR2, Windows 98, and Windows Me include an \nupdated version of the FAT file system. This updated version is called \nFAT32. The FAT32 file system allows for a default cluster size as \nsmall as 4 KB, and includes support for EIDE hard disk sizes larger \nthan 2 gigabytes (GB).\n\nThese microsoft documents are dated 2007, they are not old.\nAgain, if you use Win95 OSR2 or Win98 to make a boot disk\nyou're not making DOS. The command.com created by these\nis not the same as DOS, it has the new 0B and 0C partition \ntype support for FAT32 and VFAT, completely different.\n\nAlso, even on WinNT, Win2k, and WinXP, try creating a FAT32 \npartition greater than 32GB and then try formatting it:\n\nLogical Disk Manager: Volume size too big.\n\nDOS (FAT16) supports 2GB partitions.\nWindows (FAT32) supports 32GB partitions.\n\nThere is this theoretical 2TB partition size, but if you can't \nformat it, then, well the wind blows.\n\n  -- Spie\n\n.\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}