{"category": "ham", "to_address": "Robert Wilkins <irishhacker@gmail.com>", "from_address": "Gavin Simpson <gavin.simpson@ucl.ac.uk>", "subject": "Re: [R] How do you do an e-mail post that is within an\n\tongoing\tthread?", "body": "On Fri, 2007-06-08 at 20:39 -0500, Robert Wilkins wrote:\n> That may sound like a stupid question, but if it confuses me, I'm sure\n> it confuses others as well. I've tried to find that information on the\n> R mail-group info pages, can't seem to find it. Is it something\n> obvious?\n> \n> To begin a brand new discussion, you do your post as an e-mail sent to\n>  r-help@stat.math.ethz.ch .\n> As I am doing right now.\n> \n> How do I do an additional post that gets included in the\n> \"[R] Tools For Preparing Data For Analysis\" thread, a thread which I\n> started myself yesterday ( thanks for all the responses everybody )?\n\nJust reply all (to the list and the sender of the email, plus any other\nrecipients in the CC list if appropriate) to the email you wish to\ncomment on. You can reply at any point in the thread and your email will\nend up located in that position in the thread, i.e. underneath the\nmessage you replied to in the thread.\n\nThe actual threading is dealt with by peoples own email software (and by\nthe software used to manage the archives), via some of the headers sent\nalong with your email, for example:\n\nIn-Reply-To: <83dca7860706081427j24cd4071l35e462470ec02e61@something.com>\nReferences: <83dca7860706081427j24cd4071l35e462470ec02e61@something.com>\n\nThe long code there is the Message-Id header of the email that the reply\nreferences.\n\nMost emailers will hide all of these headers from you, but a good one\nwill allow you to look at all the headers or the actual source of the\nemail, where you will be able to see them, along with a lot of other\ninformation about the message sent.\n\n> \n> There's got to be a real easy answer to that, since everybody else does that.\n> (I'm using gmail, does it make a difference what e-mail host you use?).\n\nI've not use gmail much, but many people on the list do and they end up\nin the correct place in the thread. Note that in Gmail to see the\nheaders for a message you can select \"show original\" from the little\ndrop down menu (down triangle) next to the reply button.\n\nHTH\n\nG\n-- \n%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%\nGavin Simpson                     [t] +44 (0)20 7679 0522\nECRC                              [f] +44 (0)20 7679 0565\nUCL Department of Geography\nPearson Building                  [e] gavin.simpsonATNOSPAMucl.ac.uk\nGower Street\nLondon, UK                        [w] http://www.ucl.ac.uk/~ucfagls/\nWC1E 6BT                          [w] http://www.freshwaters.org.uk/\n%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%~%\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}