{"category": "ham", "to_address": "\"\" <ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"The Internet Patrol\" <info@theinternetpatrol.com>", "subject": "Exclusive Sneak Preview of the iPhone!", "body": "Dear Internet Patrol Readers,\n<p>\nThe interest and curiousity over the iPhone has reached a fever\npitch!  Analysts anticipate record lines at both Apple and AT&T\nstores this Friday, when the iPhone officially goes on sale.\n<p>    \nBut *you* can get a sneak peak this Wednesday - two days early - \nwith our special iPhone Scoop edition of our online show, Three Things\nYou Should Know!\n<p>\nOur special mystery guest, a noted expert in the Apple community, has\nbeen using his iPhone since last week, and on Wednesday he is going to \nreveal all - to you - our faithful readers and listeners!\n<p>\nEverything you wanted to know about the iPhone, and more!\n<p>\nSo tune in this Wednesday - that's just in *two* days - and two full\ndays earlier than the iPhone is even available to the general public!\n<p>\nOur show is online at http://www.ThreeThingsYouShouldKnow.com\n<p>\nAnd to be sure that you don't miss the show, while you're at the site\nyou can sign up for our free email alerts of new shows, so that as soon \nas the show is available you'll receive an email reminder.\n<p>\nImpress all your friends with how much *you'll* know about the iPhone,\nbefore it's even released!   Or tell them about it so that they can\nlisten too! http://www.ThreeThingsYouShouldKnow.com\n<p>\nSee you Wednesday!\n<p>\nP.S. If you read this far, as a special reward, if you would like to\n*submit a question* for our mystery guest, about the iPhone, send your\nquestion to info@threethingsyoushouldknow.com or info@theinternetpatrol.com .\nBe sure to use a subject of \"iPhone Question\"\n\n \nThe Internet Patrol, \n302 W. El Camino Real, #411, \nSunnyvale, CA 94087, USA\n\n\nTo unsubscribe or change subscriber options visit:\nhttp://clients.suretymailings.com/z/r/?TBwMLMwctMzsTCxMTJzs\n\n"}