{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Michael Poole <mdpoole@troilus.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "The troll checklist:\n\nAnthony Towns writes:\n\n> The debian-legal checklist:\n>\n> On Sun, Jun 03, 2007 at 11:28:22AM -0400, Michael Poole wrote:\n>\n> Posted by a non-DD, non-maintainer and non-applicant: Check.\n\nAd hominem attack: Check.  (For what it's worth, I am an upstream\nmaintainer of one package in Debian (ircd-ircu) and another GPL'ed\nsoftware package that is not.  I am not inclined to adopt the\nobviously orphaned ircd-ircu package just to satisfy people who look\nat credentials over facts.)\n\n>> Anthony Towns writes:\n>> > [...] And as far as the actual effects go,\n>> > I'm not sure you're going to be any better off without that clause in\n>> > your license: if you set foot in Australia, with an Australian judgement\n>> > against you, there's a good chance of it being enforced; and if you don't,\n>> > there seems to be a practical possibility of your extradition anyway,\n>> > based on [0].\n>> Extradition is for criminal cases, not civil cases.  I cannot imagine\n>> how a choice of venue clause would significantly either help or hurt a\n>> criminal defendant.\n>\n> Confident assertion of legal facts, with little basis, no references,\n> and without an \"IANAL\" disclaimer, or \"I am a lawyer and this is legal\n> advice\", or a \"I am a lawyer but this does not constitute legal advice\":\n> Check\n\nBlatant and proud ignorance of the field: Check, check and check.  (I\nam not a lawyer.  Under US law, I am not required to declare that when\nI make legal commentary.  As a rule, I do not offer legal advice to\nanyone, since I do not wish to practice law.)\n\n> Since copyright is increasingly covered by criminal penalties (in at\n> least Australia and the US) as well as civil ones, I don't think that\n> dismissal is even particularly useful.\n\nTotally missing the point: Check.  (Choice of venue is for civil\ncases.  Extradition is for criminal cases.  Your attempt to link the\ntwo is irrelevant to whether choice of venue is free.)\n\n>> As has been previously discussed on -legal -- several times, I might\n>> add -- there are a variety of reasons that the rest your argument is\n>> flawed.  \n>\n> Condescending dismissal of arguments: Check.\n\nI was -- and am -- in no mood to repeat the full reasons for these\npositions for the fourth or fifth time.  If you cannot bother to read\nthe archives, that is your loss.\n\n>> To summarize: Most of the expense of non-local defense\n>> litigation is in advance of any court judgment on the merits.  The\n>> cost to dismiss a lawsuit for lack of personal jurisdiction is an\n>> order of magnitude (or more) less than litigating it through trial.\n>> It is harder to set aside a default judgment than to dismiss a\n>> complaint for improper venue.\n>\n> Confident assertion of legal facts, [...]: Check.\n\nI said it was a summary and that it had been discussed on -legal\nbefore.  Citations are available in the archives.\n\nIn the paragraph above, except for the last sentence (which has been\nsupported by others in this thread), the data are also from my\npersonal experience of being sued in a California federal court while\nI was a resident of Virginia.  That experience is a major reason that\nI am so adamantly against this kind of clause in licenses for free\nsoftware.\n\n> In the example Don presented, of the Debian star maintainer removing\n> some output from the Debian star package, that the star upstream claims\n> constitutes a \"copyright notice\", then there are the following options:\n>\n> \t1. avoid the conflict by removing star from Debian\n> \t2. avoid the conflict by replacing the output at upstream's request\n> \t3. dispute the claim that they're copyright notices and keep acting\n>\n> At this point upstream likewise has some choices -- ignore the (perceived)\n> license violation, sue in the court that's most convenient for them, or\n> sue in the court that's most likely to act against you. If they ignore\n> the violation, then that's where it ends. If they sue in the court that's\n> convenient for them, then:\n>\n> \t4. they need to demonstrate jurisdiction (which should be\n> \t   relatively easy even without a choice of venue clause,\n> \t   because Debian operates globally anyway: in the Berlin case\n> \t   ffis would be a potential target, I'd imagine)\n> \t5. they'd need to subpoena the respondent (ffis, pavel, SPI, whoever)\n> \t   following usual procedures\n> \t6. they'd need to convince the judge that the case is worth hearing\n> \t   and that they're correct\n\nDebian's global activities do not in general affect jurisidiction over\nindividuals, so (4) primarily applies to Debian rather than its\ndevelopers or end users.\n\nNitpick: The plaintiff would need to issue a summons to the defendant.\nA subpoena is for testimony or other fact discovery[1].  A defendant\ndoes not become a respondent until he responds to a particular\nfiling[1]; the plaintiff would usually also be a respondent to certain\nmotions[1].\n\n[1]- Ask Wikipedia, Google, or whatever floats your boat.  These are\nnot obscure legal facts or specific instances, they are basic terms.\nWould you take someone seriously who had strong programming opinions\nbut thought \"CC\" was the name of a C compiler or claimed to know the\nPearl _scripting_ language?\n\n[snip]\n>> Even if the license provides for recovery of costs and attorneys' fees\n>\n> It does provide for recovery of costs and attorneys' fees. No need to\n> be hypothetical.\n\nI am aware that CDDL provides for that, but that is separate from\nchoice of venue.\n\n>> Those are the costs of a choice-of-venue clause.  The (apparently one\n>> and only) benefit is that it is cheaper for the licensor to sue people\n>> and/or the results of lawsuits are more predictable.  \n>\n> The benefit is that it's clearer as to how the license will be enforced.\n> Is it a big benefit? No, probably not. Supposedly Sun have it on their\n> TODO list to remove it, though presumably it's safe to say they've been\n> more focussed on getting Java under GPLv2 and seeing what happens with\n> GPLv3 over the past little while.\n\nHow many free software licenses have been enforced thanks to choice of\nvenue?  gpl-violations.org seems to be doing quite well without one,\nand I imagine that a choice of venue for Linux kernel litigation (to\nany non-German venue) would have impaired that.\n\nThe first line of license enforcement for free software has been and\nprobably always be social pressure.  As has been frequently argued,\nhigh-profile prospective defendants are likely to have legal presence\nin most of the places that plaintiffs would like to sue anyway.  This\nmakes a choice of venue most applicable to low-profile defendants.\n\n>> Is that truly acceptable in a free software license?\n>\n> Is it acceptable that a free software license makes it cheaper for\n> the licensor to sue people, or that the results of lawsuits are more\n> predictable?  Of course it is.\n>\n> Is it acceptable that a free software license has drawbacks associated\n> with it for potential licensees? Well that's a no-brainer too: all\n> licenses (with the possible exception of public domain equivalents) have\n> drawbacks of some kind. \n\nNot all \"drawbacks\" are \"shifted costs\".  The effect of choice of\nvenue is to shift a significant potential cost from the software\nlicensor to the software's users.  That is the reason that many of us\nlook at it as a fee or cost, and why we think it is a violation of\nfree software principles.\n\nMichael Poole\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}