{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nAfter the town of Greensburg,\n  Kansas, was\n  reduced to little more than rubble over the weekend, rescuers found a\n  survivor in the wreckage today – bringing some good news to the grim\n  story. Hari Sreenivasan will have our report on the aftermath from Greensburg.\n \nWhen a disaster like this massive tornado strikes,\n  the National Guard is often called upon to help citizens piece together\n  broken lives. But during wartime, the guard can’t always be there in\n  full force, David Martin will report. \n \nReports said the tornado was more than a mile wide\n  and it was a whopping F-5 storm – the classification for the very\n  strongest twisters. What’s behind such a monster tornado? Cynthia\n  Bowers will have the story from a storm prediction center in Norman, Oklahoma.\n \nIn business news, prices at the gas pump surged over\n  the weekend, reaching $4.00 per gallon in some places. Anthony Mason will\n  have the reasons behind the pump price spike.\n \nYesterday French voters elected Nicholas Sarkozy,\n  the pro-American conservative candidate, in a close election that had a huge\n  turnout. But would the French candidates’ personal lives horrify\n  American voters? Jeff Greenfield will take a look at some of the culture\n  behind France’s\n  election.\n \nAnd correspondent John Blackstone reports on what\n  some are calling an agricultural emergency in the United States: the sudden\n  disappearance of honeybees. The die-off has hit 27 states – and with\n  about 30 percent of the nation’s food supply being pollinated by bees,\n  the risk is great and scientists are scrambling to nail down the cause.\n  We’ll have the story in a segment we’re calling Saving the World.\n \nFinally, it was a day of much pomp and fanfare at\n  the White House, as Queen Elizabeth II was welcomed to Washington. President Bush tonight is\n  hosting the first white-tie dinner of his presidency in honor of the queen.\n  Mark Phillips will share details of Elizabeth’s\n  elegant day inside the beltway.\n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}