{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Fanny Montes\" <pofchiroflostyd@chiroflos.be>", "subject": "Anatrim will change your life", "body": "\nMelt away fat easily\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most enchanting product for corpulent people is now easily available – As shown on ABC.\n\n\nDo you remember all the times when you appeal to yourself to do any thing for being delivered from this quickly growing pounds of fat? Happily, now no major price is to be paid. Thanks to Anatrim, the earth-shaking kilos-melting combination of elements, you can achieve healthier life style and become really slimmer. Just look at what our customers write!\n\n\n\n\"It’s unbearably difficult to acknowledge it but I was a junk food addict. \n\n\nI swallowed up all this rubbish \n\n\nand was unable to stop. \n\n\n\n\nThis torment left off when I started taking Anatrim! \n\n\nGod,\n\n\n\n\n my appetite abated, \n\n\nspirits increased and I turned to the happiest person 27 pounds in 2.9 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person on the planet!\"\n\n\n\n\n\nMaria H., Las Vegas\n\n\n\n\n\n\"I had problems with over-weight since I was a boy. \n\n\nYou can't even fancy how I abhorred being derided at school. \n\n\n\n\nI hated the weight and I abhorred even myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nThis stuff literally took me out of this dreadful nightmare! Thanks and thanks to you, guys.\"\n\n\n\n\n\nMike Brown, Washington\n\n\n\n\n\n\"Know what? Anatrim saved my marriage! I got into this circle, depression – more eating – just more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce one of my friends pointed at your web page and I called for pack of Anatrim as soon as it was possible. \n\n\nThe results I achieved were great, my appetite came to admissible level, I was often in good spirits, and, certainly, I went some belt holes back. And the sex became fantastic, too!\"\n\n\n\n\n\nMichael\n\n\n\n\n There are lots of testimonial letters delighted people leave after trying Anatrim. Don’t you wanna add yourself to the thousands and thousands of slender buyers and try this original appetite-decreasing power raising product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}