{"category": "spam", "to_address": "<theorize@plg.uwaterloo.ca>", "from_address": "\"Freeman G. Morgan\" <uwpcr@skynet.be>", "subject": "dollhouse", "body": "\n\n\n\n\n\n\n\nI had loaded up on more pork buns and an order of \nbeef flank noodles at a nearby bakery.\nAll in all, not a bad trip, except for the scary \nlady touts.\nThen, back to the carriage house for tea and \nkibble. Above - Natasha plays the troll under the bridge and Leroy is the Billy Goat \nGruff.\nHis head now rests on a shelf at the Museum's Paul \nE. Oh, what a coincidence!\nAnd Snarleyyow is indeed a fiendish doggy. We've \ndiscovered that Allan Janus has an almost Anne of Green Gables popularity in Japan, \nthough there's no anime version of his life, yet. Forget Chinese fire drills - \nChinese bus stops are where the action is.\nJust started it; so far, it's a thumping good \ntwo-fisted yarn. Stud locators are cheap and easy to use. All in all, not a bad \ntrip, except for the scary lady touts.\nAs I passed him, I winked and said On les aura! \nIt's by Captain Frederick Marryat, author of Mr.\nCamilla is adored by a gallant young Spanish \nnobleman; soon, he's joined as a suitor by the colon\nTake it from me, people; find the damn stud, or \nyou'll be sorry.\nThere's a lesson there, I think; something about \npride coming before the moths before a fall. All in all, not a bad trip, except for \nthe scary lady touts. I prepared to flee, of course, but something stopped me - his \nlook; proud and fierce, and yet strangely vulnerable and even wistful.\nMy one reservation with the film is that it's a bit \nhard on poor Crown Prince Rudolf - he of Mayerling fame, who was actually a good \nsort of fellow.\nHis head now rests on a shelf at the Museum's Paul \nE. A mad world, my masters. Of course, they could always be better.\nI read my book - The Fall of the House of Habsburg, \nby Edward Crankshaw - very exciting - which distracted me from the uproar of the \nChinese variety show playing on the bus TVs.\nThe mountain was discovered by Col. Stud locators \nare cheap and easy to use. It's by Captain Frederick Marryat, author of \nMr.\nMy one reservation with the film is that it's a bit \nhard on poor Crown Prince Rudolf - he of Mayerling fame, who was actually a good \nsort of fellow.\nI prepared to flee, of course, but something \nstopped me - his look; proud and fierce, and yet strangely vulnerable and even \nwistful. There's a bus stop in nearby Rockville, just down the road from the Janus \nMuseum.\nI tried climbing Sugarloaf once, but tragically, I \ncame down with high altitude sickness and had to be evacuated.\nMuch hilarity and bloodshed ensues. My one \nreservation with the film is that it's a bit hard on poor Crown Prince Rudolf - he \nof Mayerling fame, who was actually a good sort of fellow. All in all, not a bad \ntrip, except for the scary lady touts. We've discovered that Allan Janus has an \nalmost Anne of Green Gables popularity in Japan, though there's no anime version of \nhis life, yet. \" to every passerby, trying to shanghai people to board her bus. I \nfinally feinted and dodged around her and got away.\nNext time I walk in the woods, I'll take some \nhamburger or a chicken or something; see if I can lure him to come closer and get \nused to me. I can't wait to get to the fiendish Jacobite plots and \nstuff.\n"}