{"category": "ham", "to_address": "\"Prof Brian Ripley\" <ripley@stats.ox.ac.uk>", "from_address": "\"Junnila, Jouni\" <Jouni.Junnila@PERKINELMER.COM>", "subject": "Re: [R] Problem with binding data-frames", "body": "Hi, \n\nYes, I'm aware that the problem is that I have differing number of\ncolumns in the different datasets. My question still remains. Is there\nsome way I can allow column numbers to be different, or is there some\nother way combining these datasets?\n\nThanks,\n-Jouni\n\nOn Mon, 18 Jun 2007, Petr Klasterecky wrote:\n\n> Junnila, Jouni napsal(a):\n>> Hello,\n>>\n>> I'm having a problem concerning r-binding datasets.\n>>\n>> I have six datasets, from six different plates, and two different\ndays.\n>> I want to combine these datasets together for analysis. Datasets from\n\n>> day 2, have all the same columns than datasets from day 1. However in\n\n>> addition, there are few columns more in day 2. Thus, using rbind for \n>> this, results a error, because the objects are not the same length.\n>>\n>> Error in paste(nmi[nii == 0L], collapse = \", \") :\n>>         object \"nii\" not found\n>> In addition: Warning message:\n>> longer object length\n>>         is not a multiple of shorter object length in: clabs == nmi\n>\n> Hi,\n>\n> 1. the error has nothing to do with differing lengths of your objects \n> - that's what the following warning is about. The error occured \n> because your indexing object 'nii' does not exist where R is looking\nfor it.\n\nIt's because the dataframes have differing number of columns, and that\nhas not been allowed for in the error message in that version of R.\n\n> 2. using rbind on dataframes is a bad practice, since the input is \n> converted to marices if possible. Use merge() instead.\n\nNot so: rbind on data frames does no such conversion, and is not\nproblematic provided they have the same column names (and hence the same\nnumber of columns).  You may have missed in ?rbind\n\n      The functions 'cbind' and 'rbind' are S3 generic, with methods for\n      data frames.  The data frame method will be used if at least one\n      argument is a data frame and the rest are vectors or matrices.\n...\n\nand a later description of the data frame method for 'rbind'.\n\n>\n> Petr\n>\n>>\n>>\n>> What I need, is to combine all the six together, and give for example\n\n>> NA-value in day 1, for those columns which can only be found in day\n2.\n>> Is this somehow possible?\n>>\n>> I have several of these six-datasets groups, and only few of them are\n\n>> having this problem described above, and I cannot know in advance\nwhich.\n>> With most of the groups writing\n>> rbind(data1,data2,data3,data4,data5,data6)\n>> works easily, but these few problematic groups need also to be \n>> combined...\n>> Any help greatly appreciated!\n>>\n>> -Jouni\n>>\n>> ______________________________________________\n>> R-help@stat.math.ethz.ch mailing list \n>> https://stat.ethz.ch/mailman/listinfo/r-help\n>> PLEASE do read the posting guide \n>> http://www.R-project.org/posting-guide.html\n>> and provide commented, minimal, self-contained, reproducible code.\n>>\n>\n>\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}