{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "erik <erik@not-on.tv>", "subject": "[cc-community] introducing myself and an idea", "body": "Hallo cc-community,\n\nI just subscribed to the list on advise of BjornW of Simuze.\nI'm Erik Visser and live in Amsterdam.\nGraduated as an artist I am, next to the founder of the publicworks  \nfoundation, a passionate vlogger and blogger and happy user of cc  \nsince its introduction.\nI'm not a wealthy man nor I'm I a code wizard. Within my work I'm an  \n'interaction designer' or anything that relates to that title. I  \ncreate ideas and concepts for clients (mostly in the cultural sector)  \nand have a broad knowledge of internet and new media.\n\nI have an idea I want to put to the community and see if you can give  \nme pointers in creating a valid, practical service for all to enjoy.\nI already mailed the idea to cc.org, but Bjorn told me within the  \ncommunity there are more people with similar idea's and maybe we can  \nput our heads together and create something beautiful.\n\nHere it is:\n\nI'm a very active vlogger and blogger for quite some years now and  \nintent to do this for a long time to come.\nIn my two years of videoblogging I have cut away a lot of video stuff  \nthat I liked quite a lot and have a universal quality or theme.\nI would love to put it out there for the cc community to use within  \ntheir projects or personal video's.\nI know the broadcasters have such a system and you can also buy video  \non for example istockphoto.com.\nI notice that there is becoming an increasing need for stuff like  \nthis within the vlogger community.\nAnd will become more and more needed in the future.\n\nSo I was thinking of creating a database of video shots and put them  \non a special website.\nAt first I thought of using Wordpress as an engine, but then I  \nthought I should take it more serious and look for better ways to  \ndisclose the video content to the people who need it.\nLike Bjorn for example told me to look at cchost. Do people agree or  \nhave other suggestions?\n\nI think the goal is quite simple. Finding what you need quick and  \neasy in a way you are used to.\nAnd having the cc rights straight when you decide to use it.\n\nI already taken the liberty to register ccvideo.org.\nI also have a colocated server I can put to use for this project and  \nare more then willing to get my hands dirty.\nI hope that this community can help me make it happen.\n\n\ngreetings\nErik Visser\n\nhttp://not-on.tv\nerik@not-on.tv\nskype: epjvisser\naim: epjvisser\nmob: 0031 (0)643544782\n\nthe publicworks foundation.\nhttp://www.publicworks.nl\n\n\n\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}