{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Don Armstrong <don@debian.org>", "subject": "Re: Request for suggestions of DFSG-free documentation licences", "body": "On Sun, 03 Jun 2007, Jordi Gutierrez Hermoso wrote:\n> On 03/06/07, Don Armstrong  wrote:\n> >On Sun, 03 Jun 2007, Jordi Gutierrez Hermoso wrote:\n> >> I have yet to see a practical example of a situation that actually\n> >> happened that justifies Debian's concerns against the GFDL.\n> >\n> >The practical example is the fact that we cannot make extracts of\n> >GFDLed documentation even for manpages without including the text\n> >of the GFDL and any invariant sections from the manual.\n> \n> So you're saying that the current gcc*doc* package in non-free that\n> places the invariant sections in a separate manpage is violating the\n> GFDL?\n\nYes. It is my understanding that it is violating the letter of the\nGFDL.\n\n> This isn't a real problem. The FSF isn't going to be enacting legal\n> action against OpenBSD or all the other distros who created a gcc\n> manpage from the info docs.\n\nI believe most of us agree on this point, which is why the status quo\nof a work present in non-free hasn't been seriously challenged. You'll\nnote though, that we do not (and cannot) distribute gcc-4.1.1(7)\nseprately from gpl(7); there is a versioned dependency between those\npackages.\n\n> Debian decided to make it a problem for itself and for its users.\n\nThe Developers as a whole decided that the problems with invariant\nsections and the GFDL were sufficient enough to exclude them from\nmain. However, the maintainer (and the developers) recognized that\nusers may need or want such documentation, even though it does not\nmeet the DFSG, so the documentation was made available in non-free.\n\nIf you disagree with the determination of the Developers, you can\neasily install the work from non-free, or cease supporting Debian in\nits entirety. The choice is yours, really.\n\n\nDon Armstrong\n\n-- \nYou could say she lived on the edge... Well, maybe not exactly on the edge,\njust close enough to watch other people fall off.\n  -- hugh macleod http://www.gapingvoid.com/batch8.htm\n\nhttp://www.donarmstrong.com              http://rzlab.ucr.edu\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}