{"category": "spam", "to_address": "Myrtless <myrtless@flax24.uwaterloo.ca>", "from_address": "Lisa Shepherd <samuraila@goddard.freeserve.co.uk>", "subject": "The way to become a perfect lover", "body": "\n\nYou need to buy lots of meds, but you don't want to pay huge sums of money? \nOur shop\nWe have only high-quality national medications at low prices. There is no need for someone to know about your sexual problems. \nClick here\nYou'll be a sexual giant all night long.\nWith best regards,\nLisa Shepherd\n \n \nIstinnyj Svet, kazhetsia, na etot raz sluchilos nechto iz riada von Vyhodiashchee! Esli etot zasfernik obladaet hotia by polovinoj Sily togo, kto ne Doshel do Ushcherbnyh gor stoletie nazad, ne doshel po prichine ochen uzh rokovogo Stecheniia obstoiatelstv, to u etogo mira eshche est shans na sushchestvovanie! I nado Budet kak mozhno bystree otoslat zasfernika po Puti, poka dal-rokty ne Spohvatilis i ne vyslali za nim pogoniu. Slabye, truslivye i zhadnye vlastiteli adalaev Byli postoianno zaniaty iskliuchitelno mestnymi rodovymi driazgami, davno uzhe ne Utruzhdaia sebia zabotami o svoem narode Imenityh semej za poslednee stoletie Rasplodilos stolko, chto chut li ne kazhdaia kochka pretendovala na tron makora. U menia bylo ne menshe desiati minut, Prezhde chem oni nachnut prihodit v Sebia, no, i ochnuvshis, oni ostanutsia v moej vlasti. No v etom zakliuchalsia i nedostatok pri Promahe sleduiushchij udar nanesti ud!\naetsia obychno ne skoro, osobenno esli pridetsia Razvorachivat charsa. \nEshche utrom etogo dnia on byl dlia menia Zlejshim vragom, no vsego za den moe otnoshenie k nemu razitelno izmenilos. Ia rezko vypriamilsia, chuvstvuia, kak po spine probezhal ledianoj oznob, Rasprostraniaia vnutri volny pravednogo gneva. Emu hotelos rvat zubami plot i drobit kopytami Kosti, tem bolee chto k etomu vremeni on uspel progolodatsia. Nemnogo ponabliudav za ego dejstviiami, ia sumel opredelit, chto chuzhoj Dvigaetsia po desiatimetrovoj okruzhnosti, centrom kotoroj iavlialsia trasser, i Klinok, tot samyj Klinok, kotorym on tak zaprosto ukrotil sheltian na Ferme, Plyl vperedi Nkota, kak by ocherchivaia ostriem nevidimuiu granicu. Ia zabral u nee siglajzer i pricepil na privychnoe mesto na pravyj visok. Vot uzhe i volny pobezhali v storony, otbrasyvaemye Merzkoj tiazhestiu, a skorost ne zamedlilas, dazhe vyrosla. Ty ne sbezhish prosto tak. I eto pri tom, chto nas togda nikto eshche Ne ekraniroval ot neproshenoj slezhki. \nNemnogo pomedliv, on kivnul i vse-taki stianul svoj seryj plashch, brosil na Kraj lezhaka poverh ee ksomoha, snova ostavshis v svetlo-sinej rubahe iz plotnoj Na vid tkani s relefnym polosatym risunkom. I vse zhe reshil Predpriniat popytku, chuvstvuia sebia pri etom dovolno stranno nikogda ranee emu Ne prihodilos sovershat podobnogo. Skoree vsego tot shramolinyj sotnik Pravilno uspel ocenit groziashchuiu ego otriadu opasnost i rvanul so svoej sotnej Srazu vsled za mechnikom, no dal-rokty nagnali ih bez truda i sejchas prohodili Skvoz stroj kordov, kak nozh skvoz vodu, ostavliaia za soboj tolko izuvechennye Trupy liudej i zhivotnyh. On Pricoknul iazykom. ejisuminyon XF5FVVtTW1Z0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}