{"category": "ham", "to_address": "perl6-internals@perl.org", "from_address": "\"Nikolay Ananiev\" <ananiev@thegdb.com>", "subject": "Re: Is Parrot 1.0 too late?", "body": "\n\"Allison Randal\"  wrote in message \nnews:462F8BF2.6090407@perl.org...\n> Nikolay Ananiev wrote:\n>> Yes I know about Parrot's great features, but Parrot is still not\n>> ready for the mainstream and won't be ready in the next two years \n>> (maybe?).\n>> That's a lot of time for commercial projects like CLR and JVM and\n>> the competition between MS and Sun is quite serious, so I expect\n>> the dynamic features in their VMs to progress very fast. I'm also afraid\n>> they have the resources to create compiler tools comparable to PGE and \n>> TGE\n>> (you know that MS can always steal).\n>\n> That's a possibility, but what are you afraid of?\n\nI'm afraid these companies have the opportunity to take the niche\nthat Parrot aims at, before we get there.\n\n> This is how open source software works. We develop in the open to promote \n> the greater advance of all technology. We don't hoard our advances in the \n> fear that others will use them (that's what proprietary companies do).\n>\n\nI just want Parrot to \"make it\" an be successful as a project. I think\nthis will happen if we manage to make it popular among other\ncommunities, before JVM or CLR become popular as platforms\nfor dynamic languages.\n\n> One of the greatest advantages of the open source model is the fact that \n> Parrot isn't tied to a particular company's profit strategy. This gives us \n> a much greater flexibility to take bold risks on new technology. I expect \n> that this will keep Parrot consistently ahead of the CLR and the JVM. They \n> have more resources to throw at it, but they also have strong motivations \n> not to radically change their architecture.\n\nNew technology doesn't make a popular project. And a big\nproject like Parrot needs a popularity to survive.\n\n>\n> But, there's really no way to be certain how the game will play out until \n> we play the game. If poker players all threw in their cards as soon as \n> they were dealt, it would make for a pretty boring game.\n>\n\nBut we have to be prepared for the game before it starts.\n\n>> Maybe we have to search harder for new ways to advertise Parrot to other\n>> communities and get new developers and supporters to the project.\n>\n> On that I completely agree, but as a simple matter of practicality, not \n> some desperate bid for market dominance. If you want to recruit new C \n> developers, you go where C developers hang out. (chromatic and I are \n> speaking at a Linux conference this weekend.)\n>\n>> Currently, Parrot looks too Perlish\n>\n> On that I completely disagree. Parrot looks very Perlish because it's \n> highly dynamic and intended to be easy to use (which happen to also be \n> goals of Perl). This is an advantage.\n\n\nBy \"too Perlish\" I mean that not many developers outside the\nPerl community have heard of Parrot. If you go to the PHP\ncommunity and ask them about this project, they'll tell you\nthey don't care. And the ones that know something will tell you\n\"Why to use Parrot? We have Zend 2.0\".\n\nAnyway, I expect Zend will never officially support Parrot,\nbecause they are working too closely with Sun.\n\nMaybe the big question here is:\nWhat do you think Parrot needs to get to 1.0?\n\nDoes it need the masses from the Perl and other communities?\nIs it ready for this?\n\nor it needs just a few more highly motivated developers? \n\n\n\n"}