{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] Korean govt to subsidize local generics to help them cope w/ Korus\n FTA", "body": "http://www.outsourcing-pharma.com/news/ng.asp?n=77891-south-korea-office-of-the-uited-states-trade-represe-fta-pharmaceutical\n\nSouth Korea acts to save its pharma industry from US competition\n\nUS-PharmaTechnologist.com\nBy Katrina Megget\n03/07/2007\n\nSouth Korea is to inject about one trillion won ($1.07bn) into its\npharmaceutical industry to give it a rev up as the newly signed free\ntrade agreement (FTA) with the US comes into force.\n\nThe North Asian country's pharmaceutical industry, which is mostly\ndependent on generics production, is, according to reports, anticipated\nto be hit hard by the agreement, which will see innovative US\npharmaceuticals flooding the South Korean market as restraints on the\nimports are removed and regulatory processes made more transparent.\n\nWhile the South Korean pharmaceutical market is currently estimated to\nbe worth 13 trillion won, think tanks have forecast that local\nproduction could fall by up to 168.8 billion won annually for a decade\nas domestic products are forced to compete with US drugs.\n\nSouth Korea, which is Asia's third-largest economy and the US's\nseventh-largest trading partner, struck the free trade deal with the US\nin April this year and signed it off on Saturday.\n\nConsidered the most commercially significant FTA for the US in 15 years,\nthe KORUS agreement would eliminate tariffs and non-tariff barriers to\ntrade in goods and services, promote economic growth, and enhance trade\nbetween the US and South Korea.\n\nIn terms of the pharmaceutical sector, the FTA means the regulatory\nprocess on drugs would be more transparent, less discriminatory and\naccess to drugs would be improved. There is also a commitment to\nestablish a patent linkage system to ensure adequate enforcement of\npharmaceutical patent rights. The provisions are reciprocal for both\ncountries.\n\nThe road to agreement has been rocky with the US seeking revisions to\nthe deal. Among those were changes to intellectual property rights and\npharmaceuticals.\n\nThe December 2006 implementation of the National Health Insurance Drug\nExpenditure Rationalization Plan (DERP) by South Korea caused some\nconcern with changes to drug reimbursement policy, but this has been\nassured to be implemented in a fair and transparent manner.\n\nA spokesman from the Office of the United States Trade Representative\ntold US-PharmaTechnologist.com that the FTA was a positive and\nbeneficial move for US pharmaceutical companies and the Korean citizen\nalike.\n\n\"We believe the pharmaceutical markets access portions of the KORUS FTA\nwill markedly improve the environment for U.S. pharmaceutical and\nbiotechnology products in Korea and enhance Korean patients' ability to\ngain access to the newest and most effective medicines.\"\n\nLikewise Pharmaceutical Research and Manufacturers Association of\nAmerica president and chief executive Billy Tauzin was pleased with the\ndeal.\n\nHe said in a statement: \"The FTA will help enhance Korean patient's\naccess to the most effective, innovative cures. I am particularly\npleased by the strong protection of intellectual property rights\nprovided in the FTA. In the context of the FTA negotiations, Korea\ncommitted to some significant improvements in market access for\npharmaceuticals.\n\n\"Further, Korea will enhance intellectual property protection increasing\nKorean patients' access to the most innovative medicines. This will\nsupport ongoing investment in research and development by pharmaceutical\ncompanies,\" he said.\n\nMeanwhile, South Korean health and welfare minister Byun Jae-jin said in\na press conference last week: \"[The FTA] could serve as stepping stones\nfor tapping overseas markets as Korea already stands as the world's\n10th-largest pharmaceuticals producer.\"\n\nPrior to the deal, South Korea had a somewhat monopolized system over\ndrugs, unlike the market-based system in the US, whereby the South\nKorean Government decided on the pricing and reimbursement process for\npharmaceutical products.\n\nThis system has been argued to be discriminatory and non-transparent.\n\nBut the opening up of the system, while being heralded as a significant\nstep forward, has provoked concerns within the domestic industry which\nhave been exacerbated by potential future trade deals with Canada and\nthe EU.\n\nTo counteract the anticipated competitive damage to the domestic\npharmaceutical industry, the South Korean Ministry of Health and Welfare\nannounced the cash injection would take place over 10 years as a\nthree-phase investment plan, beginning next year.\n\nThe focus would be in the areas of new drug development and\nstrengthening related infrastructure, increasing exports and improving\nmanufacturing practices.\n\nAbout 810 billion won will be invested in research and development, 180\nbillion won for new infrastructures, and 44 billion won used to support\ncompanies' exports and related overseas marketing during the 10 years.\n\nFollowing the FTA, Business Monitor International estimates the value of\nthe South Korean pharmaceutical market to be worth $21.6bn by 2011.\n\nThe signed agreements now have to be ratified by the respective\ncountries legislative bodies.\n\nIf ratified, the agreement could generate $20bn in bilateral trade in\ncoming years.\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}