{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's Newsnight & Newsnight Review", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tFRIDAY 20 APRIL 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM KIRSTY WARK\n\t\t\t\t\t\n\t\t\t\t\tDear viewers,\n\n\n\nCASH FOR HONOURS\n\n\nJust before 3pm this afternoon, the Cash for Honours story moved into a new realm. The Metropolitan Police announced they have handed a 216 page long file of evidence to the Crown Prosecution Service.  \n\n\nAfter an inquiry that lasted more than a year, during which time 136 people were interviewed, we now await the CPS's judgement on whether charges will be brought and against whom.  With elections in the coming weeks - and the impending departure of Tony Blair - the timing of any prosecution could have significant consequences.  Michael Crick will be making his assessment.\n\n\nFRENCH ELECTION\n\n\nThe French presidential elections are shaping up into a classic Right/Left battle between the two leading candidates, the former Interior Minister Nicolas Sarkozy and the socialist Segolene Royal. \n\n\nAfter a campaign in which the two of them criticised each other for talking about themselves, the voters have two polling rounds to decide which (and it could just be a matter of degrees) is better equipped to pull the country out of the economic and cultural doldrums.  \n\n\nThe first round campaign concludes as we're on air this evening with polling on Sunday. Allan Little is in Paris and we'll host a debate between proxies for Sarkosy and Royal here in the studio.\n\n\nWELSH ELECTIONS\n\n\nAnd looking ahead to elections here - Michael Crick has been noseying about the Welsh valleys to find out just how much pressure Labour is under in one of their heartlands.\n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nROAD SAFETY IN INDIA\n\n\t\t\t\t\t\t\tA road safety campaigner travels to India and Brazil to find out if anything can be done to halt road deaths\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\nnewsnight review\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tPRESENTED BY KIRSTY WARK\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tAnd then it's snap, crack and some pop with my guests on Review Paul Morley, John Harris, Julie Myerson and Sam Tanenhaus.\n\n\nHALF NELSON\n\n\nHalf Nelson is the small indy film that has already made a big splash on the festival circuit garnering numerous prizes and plaudits for direction and topping it all off with a Best Actor Oscar nomination for Ryan Gosling, who plays a well worn Hollywood role, an inspirational teacher BUT with a big difference.\n\n\nThis history teacher, Dan, is a crackhead. Working in a poor Brooklyn school he is befriended by a 13 year old student Drey played by Shareeka Epps, who has many troubles of her own, but who after discovering him flat out in the school lavatory with a crack pipe tries to look out for him - and vice versa. \n\n\nIt's the feature debut of Ryan Fleck, and the film is suffused with a political consciousness that threatens to become too obvious at times but is saved by their performances. The soundtrack by Broken Social Scene is outstanding. \n\n\nMAXWELL\n\n\nCaptain Bob the great big fraudster aka media tycoon Robert Maxwell died 16 years ago, when his body was found floating in the Atlantic. David Suchet plays the charismatic monster in his final months when his whole shaky business empire was crashing down around his ears and, it emerged after his death - he'd emptied the coffers of several of his companies and most notoriously the Mirror Group pension fund. \n\n\nThis 90 minute BBC film is the latest to tap into our fascination for dramas about real figures - swiftly following on from those on Blair, Blunkett and Prescott. Maxwell was penned by Craig Warner who also wrote the BAFTA nominated The Queen's Sister and features real life characters such as Betty, Maxwell's wife, played by Patricia Hodge as well as some composite minor ones. \n\n\nARCTIC MONKEYS\n\n\nArctic Monkeys new album Favourite Worse Nightmare is out next week. Their first turned them into the biggest band in Britain - but this one may make them the most loved. The lyrics are more thoughtful, every song has a different character and the guitars just sound great. \n\n\nCOMPACT EDITIONS\n\n\nGreat classics in half the time. That's the big sell behind Orion Publishing's editions of six classic novels each cut to less than 400 pages, more suited to the busy lives we lead, they claim. Among this batch are Moby Dick and Anna Karenina - a bit like two minute Shakespeare? What will Review's panel of busy people think? \n\n\nDo watch to find out. \n\n\nKirsty \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}