{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Allison Bolton <albright@giftsjust4u.com>", "subject": "Sexual power", "body": "\n\nTired with your sexual problems? Can't have sex like you had 10 years ago? \nClick to visit us\nWe have pills for any disease: ED, Weight loss, Antibiotics etc. Instant shipping, perfect support!\nOur site\nYou will have unbelievable sex 24/7!\nWith best regards,\nAllison Bolton\n \n \nNemedlenno. Ostav svoe pozzhe dlia drugih lopuhov, kotoryh Ugorazdit popast siuda posle menia. No zhelanie-to ostavalos neudovletvorennym. Kassir kosmoporta iavno ne sidel slozha ruki v tom Zlokliatom sklepe. \nNe ponimaiu, kak ty cherez eto sumel projti. Sejchas tebe neobhodimo chut Napriachsia i osvobodit svoj bankos ot denezhnogo bremeni. Ne pomeshaet, esli ty nazovesh Starshinu llerom, po ih poniatiiam, starym imenem rasy frajdena imeet pravo Nazvat tolko master, ne nanesia priamogo oskorbleniia, to est nikto, ved Master dlia nih ostalsia tolko v mifah i legendah. Mag-samouchka, samorodok, ochen umnyj i talantlivyj kord. Hotelos by uslyshat i o nih. Ia Govoriu eto sejchas, chtoby okonchatelno vnesti iasnost v eto delo. No nikogda ne predast ego! Ibo boevoj chare dal-roktov byl odnoj iz teh velikih sil, chto delali ego Nemnogochislennuiu rasu, Rod, moguchim. Dvor kakoj-to strannyj, zadumchivo obronila Nori. \nKrovishchi bylo more, menia dazhe vyrvalo do togo vse bylo Pravdopodobno. Puzatyj Bochonok provodil zadumchivym vzgliadom magika, iurko probiravshegosia k Vyhodu mimo Spornogo shchita, na kotorom v eto vremia dvoe obnazhennyh po poias Sporshchikov, bronzovokozhij svetlovolosyj kord i blednyj ryzhevolosyj haaskin, v Okruzhenii zevak bespechno zveneli korotkimi duelnymi zhalnikami, zatem molcha Zabral pustye kuvshiny u podbezhavshih podrug Lesty i Bai, horoshenkie lichiki Kotoryh vsegda svetilis veselem, i otkryl kran bochki s parshivym deshevym Kislinom. Rasslabsia, pliun Na vse svoi principy. Inache ia smog by pomoch, ne otvlekaia tebia. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}