{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Leona Weber\" <pifcflfostercaregew@cflfostercare.com>", "subject": "Get your ideal weight with this natural method", "body": "\nDoctors and Celebrities endorse Anatrim\n\n\n\n\n\nAnatrim – The latest and most fascinating product for corpulent people is now readily available – As told on Oprah\n\n\n\nDo you understand that superfluous body kilograms kill more and more people around the world? We know you hate the unattractive look of those people and the social bias against them. \n\nMoreover, you got no will to resist a pressure of fatal eating habits of yours. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nHere there is Anatrim, the later product for the reduction of your body’s extra weight. The astonishing thing about Anatrim is it improves the quality of your life by making you crave food less and giving you better spirit. Here’re what people say to us on this product:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of stuffing myself with food and watching TV constantly \n\n\nI became keen on exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I am more fit now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nLusia R., Las Vegas\n\n\n\n\n\n\n\"I tried some passive weight losing, you know, but almost with no result. This terrible hunger would just rush in and spoil everything. \n\n\nOnce I was told about Anatrim the media by and I rather liked the information.\n\n\n I had attempted using it, and my wife told me that I’m not more a weighty man now, 4 months later. \n\n\n28 pounds off and this is not a limit! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nDave Klark, New York\n\n\n\n\n\nAnatrim gives you an opportunity to realize you got no such great need for that much food. It raises your mood up, gives you extra energy, and attacks unnecessary kilos. All thanks to its powerful original formula!!\n\n\n\nWorm out more!\n\n\n\n"}