{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Covering Virginia Tech", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nIn \n      The Virginia Tech Tragedy, What Is The Right Amount Of \n      Coverage?There is little doubt that the coverage has, at \n      times, seemed repetitious – though it's somewhat unfair to blame news \n      outlets for that fact, as they have had a lot of airtime to fill, and have \n      largely done so admirably. My only complaint is that, in the early going, \n      there was more discussion about who we should blame than seemed \n      appropriate so soon after the tragedy. [+ Read More]\n\nA \n      \"Massacre\" Or A \"Tragedy?\"Today, CBS News made the decision \n      to stop referring to the Virginia Tech shootings as a \"massacre.\" Instead, \n      the outlet will use the word \"tragedy.\" The change in terminology shifts \n      focus from the horror of the shootings to the sadness they have caused. \n      \"Massacre\" is a dramatic word that evokes slaughter; \"tragedy\" is more \n      passive, less tied to an individual \n      act. [+ Read More]\n\nCBSNews.com \n      Adopts Abortion Terminology If not for the Virginia Tech \n      tragedy, the top story on CBSNews.com right now would likely be the \n      decision by the Supreme Court to uphold the Partial Birth Abortion Ban \n      Act. People on opposite sides of contentious issues like this often use \n      certain terminology to try to frame the debate – see the \"death tax\" vs. \n      \"estate tax\" argument. In this case, some, including President Bush, \n      prefer the phrase \"partial birth abortion,\" while others favor \"late term \n      abortion.\"[+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nDavid \n      Martin Dispatch: Holding A Story Is A Judgment Call\n \nWhen \n      A Network Owns The Story. Literally.\n \nQuestions \n      And Answers About Questions And Answers\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}