{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "130p 6/13 Update: Russian computer glitches continue; array work on hold for EVA", "body": "\n\n\n\n\n130p 6/13 Update: Russian computer glitches continue; array work on hold for EVA\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 49\nPosted: 1:29 PM, 6/13/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-46 (06/12/07): Computer glitches resolved; blanket repair decision deferred\n   SR-47 (06/13/07): Crew awake; prepares for spacewalk, solar panel retraction\n   SR-48 (06/13/07): Solar array retraction work begins\n   SR-49 (06/13/07): Solar array retracted 7.5 bays; EVA on tap; Russian computers down again\n\n=================================\n\n1:29 PM, 6/13/07, Update: Array retraction halted for spacewalk; Russians troubleshoot more computer problems\n\nThe Atlantis astronauts, working step-by-step with flight controllers, successfully retracted the 115-foot P6-2B solar array 7.5 45-inch mast bays today, or about 28 feet, before standing down for the start of a planned spacewalk by astronauts Pat Forrester and Steve Swanson.\n\n\"We appreciate the hard work and we got a lot further than we anticipated,\" Steve Bowen radioed the crew from space station control in Houston.\n\nSpace station commander Fyodor Yurchikhin and flight engineer Oleg Kotov, meanwhile, worked with engineers in Russian to recover from yet another computer crash in the Russian segment of the outpost. Computer glitches Tuesday caused major problems, preventing the station from switching back to gyroscope control of its orientation as planned.\n\nNASA engineers ultimately figured out a way to switch back to gyro control Tuesday night and there are no problems on that front today. But the Russian computers are critical to space station operations. It's not yet clear what is causing the trouble or what might be needed to fix it. Troubleshooting continues.\n\nFor the NASA flight control team, the morning was devoted to retraction of the P6-2B solar array.\n\nAt 6:47 a.m., ground controllers started the long-awaited retraction, pulling the central mast in one-half bay to release tension on the springs holding the flexible blankets taut.\n\nThe astronauts then commanded the mast to retract one bay at a time, starting at 10:42 a.m., stopping between each cycle to give ground controllers time to assess the alignment of the blankets. Commands were sent to wiggle the mast, rotating it back and forth like a pencil between thumb and forefinger, to provide enough motion to coax blanket grommets to slide along guidewires as needed.\n\nBy 12:36 p.m., the mast had been retracted 7.5 bays, or about 28 feet. Commander Rick Sturckow and Jim Reilly noted several hung-up grommets and another wiggle test was ordered.\n\n\"OK, Houston. It doesn't appear to me that that had the same effect it had last time,\" Sturckow reported. \"There are several grommets that are not pointing directly at me. They are either pointing up or down. ... Basically, on the left blanket, the inner wire has got like the first, the second, the third, the fifth and maybe the sixth pointing down toward the blanket box and then on the left blanket outboard, the guidewires, there's a couple of grommets pointing up, out of the box.\n\n\"But JR and I've been looking at it and thought we might try one more bay and if that doesn't look good then we might be good to do either another wiggle or to extend, whatever you like.\"\n\nFlight controllers debated that approach but decided to stand down for the spacewalk.\n\n\"After even more discussion, we're going to stand down,\" Bowen said. \"We're starting to get concerned about potential billowing and the damage that may cause the panel. So we think we're in a good config for the EVA and we're going to stand down here.\"\n\nThe P6-2B array's central mast is an open framework truss that assembles itself into cube-like bays when driven outward and collapses into a canister as it is retracted. The mast stretches some 115 feet and is made up of 30.5 open-framework bays when fully extended.\n\nThe array must be retracted 19 or 20 bays - 70 to 75 feet - to provide the clearance needed to begin rotating the newly installed S4 solar arrays on the right side of the station's main power truss so they can track the sun as required.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}