{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 18, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESMassive Global Pedophile Ring Busted\nAuthorities in the United Kingdom say they've smashed a huge international Internet pedophile ring, rounding up more than\n                        700 suspects and rescuing 31 children from sexual exploitation. The 10 month investigation involved agencies from 35 countries.\n                         More...Watch: Pedophile Ring Busted\n• Will Fed Trial Put \"Hit\" On Chicago Mob?• West Rallies To Aid West Bank Palestinians\n                     \t\t\t\t\t| Watch• 36 Killed In Fierce Iraq Clashes\n                     \t\t\t\t\t| WatchU.S.Will Fed Trial Put \"Hit\" On Chicago Mob?\nExperts say a trial commencing this week stemming from the FBI's \"Operation Family Secrets\" investigation into the Outfit,\n                        Chicago's organized crime family, could be one of the most significant ever in the government's war against the mob.  More...\n• Thousands Of Pearls Found In Shipwreck• Pregnant Mother Goes Missing In Ohio\n                     \t\t\t\t\t| Watch• Pa. Teen Charged In Triple Murder• More StoriesWorldWest Rallies To Aid West Bank Palestinians\nThe EU is restoring millions in aid to the emergency government that Palestinian President Mahmoud Abbas installed after Hamas\n                        took control of Gaza. The U.S. and Israel also prepare to lift economic sanctions. But a humanitarian crisis looms in Gaza. More...Watch: Gaza Refugee Crisis\n• 36 Killed In Fierce Iraq Clashes\n                     \t\t\t\t\t| Watch• Fighting Resumes At Lebanon Refugee Camps• U.S. Air Strike Kills 7 Afghan Kids\n                     \t\t\t\t\t| Watch• More StoriesPoliticsMcConnell: Immigration Too Close To Call\nThe Senate's top Republican said he could not predict whether the stalled immigration reform bill will pass, citing questions\n                        among conservatives as to whether it guarantees amnesty to illegal immigrants. More...Watch: Face The Nation, 06.17.07\n• Agreed: Something Needs To Change In Iraq\n                     \t\t\t\t\t| Watch• President Bush And The National Debt• Romney Surges Ahead In Bellwether States\n                     \t\t\t\t\t| Watch• More StoriesHealthA Pill To Forget?\nMany of us would pay top dollar for a pill that would enhance our ability to remember. But Lesley Stahl found a scientist\n                        who is far more excited about a pill that promises to do exactly the opposite. More...Watch: The Memory Pill\n• A Lyme Disease Warning From The CDC\n                     \t\t\t\t\t| Watch• Is America Too Sweet On Sugar?• Weight Loss Surgery Safer For Teens?• More StoriesSciTechCrew Set To Test Space Station Computers\nRussian controllers want to make sure the space station's revived computers can keep station stable so the space shuttle Atlantis\n                        can depart Tuesday. Atlantis has been keeping the station in its proper orbit since the computers crashed last week. More...\n• Wireless Technology Takes A Leap Forward• Massive Global Pedophile Ring Busted\n                     \t\t\t\t\t| Watch• Blu-Ray Scores A Coup In Format War• More StoriesBusinessAirbus Makes A Splash With US Airways\nAirbus made a splash at the Paris Air Show with the announcement that US Airways will replace its fleet of Boeing 737s with\n                        Airbus craft, and will be the first North American carrier to launch Airbus' new extra-widebody A350 model. More...\n• Blu-Ray Scores A Coup In Format War• eBay At Middle Age• Wireless Technology Takes A Leap Forward• More StoriesEntertainmentA Weekend Of Visitors For Paris\nKathy and Rick Hilton visited their daughter in jail on Sunday, which was Father's Day. And Paris' sister, Nicky, dropped\n                        by on Saturday. More...Watch: An Idea For Ms. Hilton\n• Fans Flock To This Year's Bonnaroo• Ex-Beatle To Sell Solo Songs Online• The ShowBuzz Weekly Forecast• More StoriesOpinionAndy's Personality Quiz\nEver wonder if you are a Type A or Type B personality? You could take a test from a magazine or consult your horoscope in\n                        the paper. Or you could take Andy Rooney's quiz. More...Watch: Type A, Type B Personalities\n• Maybe There Should Be A Third Party\n                     \t\t\t\t\t| Watch• Hands Off S-CHIP!\n                     \t\t\t\t\t| Watch• Tet All Over Again\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Pregnant Mother Goes Missing In Ohio\nJessie Mudle Davis, who is nine months pregnant, was last heard from June 13. She spoke to her mother on the phone, but after\n                        that, Davis, who has a 2-year-old son, vanished. More...Watch: Pregnant Woman Missing\n• EARLY SHOW: When Teen Dating Turns Bad\n                     \t\t\t\t\t| Watch• EARLY SHOW: Missing:  Pamela Waldher, Teen\n                     \t\t\t\t\t| Watch• EARLY SHOW: Getting Kids Ready For Camp\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nPlane Lands Without GearCBS News RAW:  A small passenger plane carrying 17 people in New Zealand made an emergency landing on its belly after\n                                    its landing gear failed to deploy.\nTOP VIDEOS\nClashes After Real Madrid Win\nGaza Refugee Crisis\nPedophile Ring Busted\nEscaping Hamas-Ruled Gaza\n'Closer' To Kyra Sedgwick\nWhat's Next For Nifong?\nAustralian Blackhawk Crash\nAbusive First Relationships\nRubik's Cube Craze Revived\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMorley Safer talks to long-driving, hard-drinking golfer John Daly. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMurder On Lockhart Road:A mother and two kids are murdered. There are bizarre clues, eyewitnesses, blood drops,\n                           and a killer with a foot fetish. Saturday, 9 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}