{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "This Weekend on BBC Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBRENDAN FOSTER ON THE LONDON MARATHON\nEvery April millions of people around the UK watch the London Marathon, and in sitting rooms up and down the country someone will lean across to their partner and say: \"I could do that\". \n\n\nThat's the beauty of the London Marathon and what makes it a unique top-class sporting event - anyone can start running and sign up to take part. \n\n\nAnd it's not just a one-day event, participants have to change their lifestyles, get fit and of course raise millions for charity. \n\n\nA healthy contingent of celebrities put themselves through the mill too which is fantastic. \n\n\nSeeing Zombie Ramsay or Matt Dawson running 26 miles makes people think: \"If he can do it, so can I,\" and that provides so much encouragement and inspiration. \n\n\nFor the more serious athletes, the line-up for the men's elite race is arguably the strongest marathon field ever assembled. \n\n\nThe likes of Haile Gebrselassie, Paul Tergat, Felix Limo and Khalid Khannouchi reads like a Who's Who of distance running. \n\n\nFor me Gebrselassie is the one to watch. He decided after his glittering track career that the marathon was going to be his event. \n\n\nHe didn't take to it too kindly at first, but he's adapted his training, approached things differently and is now bang in form. \n\n\nAs far as British interest is concerned we are once again relying on Jon Brown. \n\n\nHe has been a great athlete for his country and is our only male world-class marathon runner but I don't expect him to feature, which can also be said of Liz Yelling in the women's elite race. \n\n\nLornah Kiplagat is my favourite for that event after her performance holding off the challenge of the Ethiopians at the recent World Cross Country Championships. \n\n\nShe will face the might of Berhane Adere and Gete Wami on Sunday, but I think she is strong enough to prevail again. \n\n\nEnjoy the race, \n\n\nBrendan \n\n\nBrendan Foster MBE will be commentating on Sunday's London Marathon (coverage starts at 0830 BST on BBC ONE).\n\nDuring his athletics career he won an Olympic bronze medal in the 10,000m and broke two world records.\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nLONDON MARATHON\n bbc.co.uk/athletics\nSunday\n0830-1400, BBC ONE and BBC Sport website; 0800-1600, BBCi and BBC Sport website; 0900-1300, BBC Radio Five Live. Highlights: 1810-1900, BBC TWO and BBC Sport website.\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\tSend your comments about friends and family who are running in the Marathon to BBC Sport - Text to 81111 or E-mail athletics@bbc.co.uk.\n\t\t\t\t\t\n\n\n\n\n\nFOOTBALL ON THE BBC\n bbc.co.uk/football\nSaturday\nFootball Focus (1210, BBC ONE); Tottenham v Arsenal (1245, Radio Five Live/online); Score (1430, BBCi & BBC Sport website); Premiership football (1500, Radio Five Live/online); Final Score (1630, BBC ONE); Manchester United v Middlesbrough (1715, Radio Five Live/online); Match of the Day (2230, BBC ONE).\nSunday\nMatch of the Day repeat (0705, BBC ONE); Newcastle v Chelsea (1330, Radio Five Live/online); Aston Villa v Portsmouth (1600, Radio Five Live/online); Match of the Day 2 (2230, BBC TWO).\n\n\n\n\n\n\nCRICKET WORLD CUP\n bbc.co.uk/cricket\nSaturday\nWest Indies v England (1415-2230, Radio Five Live Sports Extra, BBCi and website); Cricket World Cup highlights (2355-0055, BBC ONE; repeated at 0500-0600 on Sunday).\n\n\n\n\n\n\nWORLD SNOOKER\n bbc.co.uk/snooker\nSaturday\n1000-2300, BBCi and website; 1300-1630, BBC ONE and website; 1630-1730 and 1900-2030 BBC TWO and website. Highlights: 2320-0200, BBC TWO and website.\nSunday\n1000-2300, BBCi and website; 1400-1810 and 1900-2000, BBC TWO and website. Highlights: 0000-0250, BBC TWO and website.\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\tA choice of tables at the Crucible is on BBCi, via the red button, and the BBC Sport website every day of the Championship from 1000-2300.\n\t\t\t\t\t\n\n\n\n\n\nMORE SPORT ON THE BBC \n bbc.co.uk/tvandradio\nSaturday\nMotoGP: Turkey Grand Prix qualifying (1145-1300, BBCi); Rugby union: Under-19's World Cup Final, (1715-2130, BBCi, BBC Northern Ireland and BBC Sport website). \nSunday\nMotoGP: Turkey Grand Prix live (1230-1400, BBC TWO), MotoGP Extra (1400-1430, BBCi); Rugby league: Super League Show (1130-1230, BBC North and website); Rugby union: Heineken Cup semi-final - Wasps v Northampton (1455-1645, Radio Five Live Sports Extra).\n\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tLondon Marathon course guide \n Follow all the twists of the unique 26-mile route\n\t\t\t\t\t\n\t\t\t\t\t\tMarathon tips\n Expert advice on how to handle the big day\n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}