{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nThe U.S. Congress and President Bush are facing off\n  in a historic showdown. Earlier today the Senate followed the House’s\n  lead and passed legislation that would begin the withdrawal of U.S. troops from Iraq this fall – but the\n  president has promised to veto it. Sharyl Attkisson will report from Washington, D.C., on\n  the battle over Iraq.\n \nWe’ll also show you some of the results of a\n  new CBS News/New York Times poll, which includes Americans’ opinions\n  about the troop withdrawal bill as well as the environment. For complete poll\n  results this evening, go to CBSNews.com.\n \nTonight is an important milestone in the race for\n  2008 – the first debate of the Democratic presidential candidates. Our\n  new senior political correspondent Jeff Greenfield will report that this South Carolina event\n  will be a major test for the eight contenders, each of whom will only have a\n  short time to make a lasting impression.\n \nChina\n  is still denying that the chemical melamine contaminated pet food and led to\n  the deaths of dozens of pets. But Chinese officials have offered to cooperate\n  with broader inspections of these products. Nancy Cordes will tell you what\n  other foodstuffs enter the United States\n  from China\n  and Barry Peterson will report on how those products are inspected. What they’ve\n  found might surprise you.\n \nFinally, we’ll have the story of a gospel\n  choir found in an unexpected place. Steve Hartman will share their songs in\n  this special Thursday edition of Assignment America.\n \nI hope you’ll join us tonight for these\n  stories and an early look at Scott Pelley’s exclusive 60 Minutes\n  interview with former CIA director George Tenet.\n \nThanks,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}