{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "Direct2Drive <owner-d2d_cp_announce_list@news.ign.com>", "subject": "Download Call of Juarez on Direct2Drive Today!", "body": "\n\n\nDirect2Drive\n\n\n\n\n\n\n\n\nJune 22th, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWorld of Warcraft - $19.95\nForge alliances and compete with enemies for power and glory.\n \nEverQuest?II: All in One Compilation - $39.99\nThe EverQuest?II \"All In One\" Compilation includes all the features and content from base EQ II through all three expansions, Desert of Flames, Kingdom of Sky, and Echoes of Faydwer.\n \nPhylon - $14.95\nPhylon (from the Greek Phylon, meaning tribe) combines the fast-paced action of a third person shooter with the persistence and depth of an MMO.\n\n\n \n \n \n \n \n\n\nValue Games Zone\nDownload the best in digital entertainment at $20 or less!\n \nTomb Raider Anniversary w/ Bonus Comics - $29.95\nCelebrate and commemorate ten years of Tomb Raider with Tomb Raider: Anniversary, a new action adventure inspired by the original Tomb Raider video game.\n \nRocket Magazine Special Bundle Offer 2007 - $7.95\nFrom the creators of Play Magazine comes America's new pop-culture multi-media magazine. Buy now and get four issues for one low price!\n\n\n \n \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\nCall of Juarez\n$49.95\n6\n\n\nNeverwinter Nights 2\n$29.95\n\n\n2\n\n\nPhylon\n$19.95\n7\n\n\nThe Matrix Online\n$19.99\n\n\n3\n\n\nWorld of Warcraft\n$19.95\n8\n\n\nCaesar IV\n$19.95\n\n\n4\n\n\nVampire: The Masquerade - Bloodlines\n$19.95\n9\n\n\nTitan Quest\n$19.95\n\n\n5\n\n\nCivilization 4\n$39.95\n10\n\n\nArmA: Combat Operations\n$39.95\n\n\n\n\n\n\n\n\n\nTo Unsubscribe: Click Here.\n\t\t\t\nYou have received this e-mail because you are a registered user of GameSpy and have opted-in to receive GameSpy email updates concerning new products and services. If you believe you're receiving this e-mail in error or prefer not to receive promotions from GameSpy.com, reply to this message to opt out of future promotional mailings. Our privacy policy is viewable at http://corp.igngamespy.com/privacy.html. You may still receive other e-mails from GameSpy. To update your e-mail address or manage your account, visit GameSpyID.com. It may take up to 10 days for adjustments to your email preferences. If you have questions about this offer or your services, you can reach Customer Service here.\n\t\t\n\t\tYou may mail inquiries to: IGN Entertainment, Inc., 8000 Marina Boulevard, 2nd Floor, Brisbane, CA 94005\nCopyright © IGN Entertainment, Inc. All rights reserved.  \n\n\n\n\n\n\n\n\n\n\n\n\n"}