{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Morning HTML\" <cbsnews_weekday_morning_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 8, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIES6 Arrested In New Jersey Terror Plot\nSix men accused of plotting to kill soldiers on the Fort Dix Army base in New Jersey were arrested Monday night, the U.S.\n                        Attorney's office said. A spokesman said the six men were planning to \"kill as many soldiers as possible.\" More...\n• Historic N. Ireland Deal Becomes Reality• Blast Kills 16 In Shiite Holy City\n                     \t\t\t\t\t| Watch• Midwest Braces For Major FloodingU.S.Midwest Braces For Major Flooding\nThe same group of storms that whipped up a devastating F-5 tornado in Kansas last week is producing heavy rains across the\n                        Midwest. Missouri, in particular, has begun evacuating several communities in anticipation of major flooding later this week. More...\n• 6 Arrested In New Jersey Terror Plot• Auto Loan Rates Higher For Blacks• Survivor Found In Kansas Tornado Rubble\n                     \t\t\t\t\t| Watch• More StoriesWorldBlast Kills 16 In Shiite Holy City\nA car bomb has torn through a market in the Shiite holy city of Kufa, leaving at least 16 people dead, including women and\n                        children. The U.S. military is relying on Shiite militants from the Mahdi Army to police some key areas around the capital. More...Watch: Sen. Snowe's Plan For Iraq\n• Historic N. Ireland Deal Becomes Reality• Archaeologist Finds King Herod's Tomb• Rebels: 3 Nigeria Oil Pipelines Destroyed\n                     \t\t\t\t\t| Watch• More StoriesPoliticsA White House Dinner Fit For A Queen\nThe White House pulled out all the stops for President George W. Bush's first-ever white-tie state dinner to honor Queen Elizabeth\n                        II. More...Watch: White-Tie Dinner For The Queen\n• Sen. Lott Joins Republican War Weary• Obama: U.S. Needs More Fuel-Efficient Cars\n                     \t\t\t\t\t| Watch• Could Fred Thompson Please The Right?• More StoriesHealthRating The Best Diets\nConsumer Reports surveyed diet plans to find out which was the most effective and easiest to follow. The magazine also talked\n                        to people who have lost a lot of weight, to learn about their strategies. More...\n• \"Cocaine\" Pulled From Shelves Nationwide• Study: Moms Of Autistic Kids Cope Well• D.C. Is \"Sun-Smartest\" City In U.S.• More StoriesSciTechAstronomers Spot Biggest Supernova Ever\nA massive exploding faraway star, the brightest supernova astronomers have ever seen, has scientists wondering whether a similar\n                        celestial fireworks show may light up the sky much closer to Earth sometime soon. More...\n• Obama: U.S. Needs More Fuel-Efficient Cars\n                     \t\t\t\t\t| Watch• Are You A High Tech \"Omnivore\"?• Internet Gambling Ring Busted Near NYC• More StoriesBusinessAuto Loan Rates Higher For Blacks\nBlacks have been charged higher auto loan rates than other auto buyers, federal research says. But the gap in loan rates could\n                        narrow, and possibly disappear, as the result of recently concluded lawsuits. More...\n• Gas Prices Keep Climbing\n                     \t\t\t\t\t| Watch• Alcoa Bids For Canadian Aluminum Rival• Dow Jones Bid Puts CNBC On The Defensive• More StoriesEntertainmentJudge Suspends Hasselhoff's Visitation\nA judge has suspended David Hasselhoff's visitation rights with his two teen daughters after a videotape showing him apparently\n                        drunk was leaked. More...Watch: Hassling 'The Hoff' On Tape\n• Actress Kim Fields Has A Boy• Pennington: DUI Arrest Is \"Wake-Up Call\"• Justin-Cameron Reunite For \"Shrek\" Sake\n                     \t\t\t\t\t| Watch• More StoriesOpinionTurning Over A Nouveau Leaf\nFrench voters have elected a pro-American, conservative market reformer. While there's strong resistance to Nicolas Sarkozy's\n                        proposals, he displayed promising political skill in winning a tough election, writes the National Review Online. More...Watch: France Elects Next President\n• Sarkozy Won't Be Bush's French Poodle\n                     \t\t\t\t\t| Watch• What War? We Have Sanjaya!• Trying To Make Sense Of The Papers• More StoriesCBS NEWS BROADCASTSThe Early Show: Susan Koeppen: Rating The Best Diets\nConsumer Reports surveyed diet plans to find out which was the most effective and easiest to follow. The magazine also talked\n                        to people who have lost a lot of weight, to learn about their strategies. More...\n• EARLY SHOW: Best Drugstore Beauty Products• CBS Evening News: Flight Of The Honeybee\n                     \t\t\t\t\t| Watch• CBS Evening News: Wartime Shortages Hamper National Guard\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nPicking Up The PiecesFor the first time since Friday's deadly tornado touched down in Greensburg, Kan., residents returned to try and pick up the\n                                    pieces of their houses and lives. Hari Sreenivasan reports.\nTOP VIDEOS\nNational Guard Equipment Woes\nFrance Votes Conservative\nWhite-Tie Dinner For The Queen\nShop Around For Your Gas\nWhere Have All The Bees Gone?\nBush Entertains The Queen\nBeing Green On Two Wheels\nObama: 'Age Of Oil Must End'\nSpider-Man Swings Past Records\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesDoes fiery CNN anchor Lou Dobbs consider himself a journalist? Lesley Stahl finds out, Sunday, 7 p.m. ET/PT.48 Hours!\n  Mystery\nPower, Passion And Poison:An ambitious politician meets a suspicious death. Troy Roberts reports, Saturday at 10\n                           p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}