{"category": "ham", "to_address": "smiles@flax9.uwaterloo.ca", "from_address": "TopCoder Competitions <competitions@topcoder.com>", "subject": "TopCoder(R) Single Round Match sponsored by UBS - $5,000 prize\n purse!!", "body": "Hello sm1lies,\n\nTopCoder Single Round Match 353 is scheduled for Thursday, June 7, 2007 at 11:00 AM Eastern Daylight Time (UTC/GMT -4 hours).\n\nPlease be sure to check here for the coding phase start time in your time zone:\nhttp://www.timeanddate.com/worldclock/fixedtime.html?month=6&day=7&year=2007&hour=11&min=0&sec=0&p1=98\n\n* $5,000 in SRM prizes, provided by UBS, will be given away during this match\n* Registration will begin at 8:00 AM and will end at 10:55 AM Eastern Daylight Time\n* Allowable programming languages are Java, C++, Microsoft Visual C#(R) .NET, and Microsoft Visual Basic(R) .NET\n* TopCoder Administrators will be available in the Admin Lobby Room to answer questions\n* For more details click here: http://www.topcoder.com/tc?module=MatchDetails&rd=10710 \n\nSRM 353 is sponsored by UBS.  Don't miss the UBS chat session starting at 10:00 AM EDT (GMT.UTC -4).  You'll have an opportunity to chat with UBS representatives about their career opportunities.\n\n*********************************************************************\nYour skills expand our world of opportunities.  It starts with you.\n\nThe global financial markets are increasingly electronic and trading in these markets presents a unique combination of technical and trading acumen.  \n\nUBS is responsible for trading 1 out of every 9 shares globally (leading private industry survey) and is looking for technologists to help us develop advanced trading algorithms, build the underlying infrastructure to trade with milliseconds of latency, and integrate access to a wide range of global products.\n\nWe have numerous career opportunities for exceptional TopCoder members interested in joining one of the global market leaders in the financial services industry.  \n\nConsider becoming part of an exciting future at UBS.  \n\nYou & Us. UBS.\n\nUBS is an equal opportunity employer committed to diversity in its workplace. (M/F/D/V)\nhttp://www.topcoder.com/tc?module=Static&d1=tournaments&d2=tco07&d3=sponsorspatrons&d4=ubs\n*********************************************************************\n\nBest of luck to you in the Arena! \n\n\n- The TopCoder Competitions Team \n\n\n===================================================================\nYou have received this email because you indicated in your TopCoder profile that you want to be notified of TopCoder competitions.  If you no longer wish to receive these emails, log in to www.topcoder.com/tc and click on 'Update My Profile'.  In the 'Email Notification' section of your TopCoder profile, you have the option to enable or disable receipt of various types of TopCoder emails.  Be sure to save any changes to your member profile.\n\nwww.topcoder.com\nTopCoder, Inc.\n703 Hebron Avenue\nGlastonbury, CT 06033\nPhone: 1-866-867-2633\n\n\n"}