{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tMONDAY 14 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM KIRSTY WARK\n\t\t\t\t\t\n\t\t\t\t\tDear viewers,  \n\n\n\n\t\t\t\t\t\tTonight we have two extraordinary films on Newsnight. \n\n\nIRAQ\n\n\nWe devote much of the programme to the first of a series of reports from Mark Urban in Iraq, in which we see at first hand the US troop surge in action and gauge its impact. \n\n\nMark spent 72 hours embedded with US forces in Al Doura - a Sunni dominated area in the south of Baghdad. He's given us a fascinating insight into the everyday dangers faced by Iraqis, and the pressures on US soldiers as they try to bring security to the area, as they round up what seems like a never ending stream of insurgents, and at the same time try to win hearts and minds. \n\n\nAnd today's confirmation by the US army that three of their soldiers have been kidnapped in Baghdad - seemingly by Al Qaeda - is just the latest indication of what they are up against. \n\n\nCANCER\n\n\nAlso tonight to mark the start of BBC cancer care week, Charlotte Esler, the fourteen year old daughter of my Newsnight colleague Gavin has made a film about her own cancer story. Charlotte was diagnosed with Hodgkin's Lymphoma in November, and after treatment her cancer is now in remission. \n\n\nShe explains the impact it had on her and the family, and interviews another person who was diagnosed with lymphoma - Sir Menzies Campbell.\n\n\nLABOUR LEADERSHIP\n\n\nMichael Crick will be with me for the latest on potential challengers to Gordon Brown, and the competition to become deputy leader.\n\n\nAnd looking ahead to tomorrow, we'll be launching a key element of our coverage of the Prime Ministerial succession: The Order of the Brown Nose. Can you help us find a worthy winner?\n\n\nRead Steve Smith's article here\n\n\nDo join us at 10.30pm.\n\n\nLiz\n\n\nMissed Newsnight Review?\n\nClick here to watch online\n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}