{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nHundreds of Americans have been sickened by –\n  and some have died from – contaminated spinach and peanut butter in the\n  past year. A report in today’s Washington Post revealed that the FDA\n  has known for years about contamination problems at the facilities that\n  produced these products. Nancy Cordes will have the full story, and\n  we’ll also take a look at whether the FDA has the financial ability to\n  fix the problem.\n \nClasses resumed today at Virginia Tech one week\n  after the shooting rampage that left 32 students dead. Sharyn Alfonsi has our\n  report from Blacksburg, Virginia.\n \nJim Axelrod will bring you the latest on Attorney\n  General Alberto Gonzales, who has just received another vote of confidence\n  from President Bush. Gonzales has promised to stay in his post as long as he\n  can “continue to serve effectively.”  \n \nPolitics has become a popular pastime in France.\n  At least 84 percent of the country’s voters cast ballots in the first\n  round of presidential elections. Now, it is down to two candidates with very\n  different visions for the country’s future, Sheila MacVicar will\n  report.\n \nBoris Yeltsin, the man who engineered the final\n  collapse of the Soviet Union and brought a market economy to Russia,\n  died this morning. Elizabeth Palmer will report on Yeltsin’s effect on\n  democracy in Russia.\n  She’ll also give you a peek into some of the lesser-known events of the\n  former president’s life.\n \nBack in the United States, a judge exonerated\n  a man – after he had served 25 years in prison. Jerry Miller had been\n  found guilty of rape, robbery, aggravated kidnapping and battery in 1981.\n  Today he became the 200th prisoner exonerated due to DNA evidence,\n  according to a group that works to free wrongly-convicted inmates. Byron\n  Pitts will have the story.\n \nThe soundtrack of the young generation is hip-hop\n  music – and its biggest consumers are young white males. It is an\n  industry where sex and violence sell – but not everyone’s happy\n  about that. Bill Whitaker will examine the debate over vulgar, violent\n  lyrics. \n \nRemember those funky, flimsy 3D glasses from decades\n  ago? NASA is bringing them back. It has compiled images of the sun from two\n  orbiters and laid them on top of each other for a three-dimensional effect.\n  Jerry Bowen will give you a look.\n \nThanks, and I hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}