{"category": "ham", "to_address": "r-packages@stat.math.ethz.ch", "from_address": "\"hadley wickham\" <h.wickham@gmail.com>", "subject": "[R] [R-pkgs] Clusterfly", "body": "clusterfly\nhttp://had.co.nz/clusterfly/\n\nTypically, there is somewhat of a divide between statistics and\nvisualisation software. Statistics software, particularly R, provides\nimplementation of cutting edge research methods, but limited graphics.\nVisualisation software will provide sophisticated visual interfaces,\nbut few statistical algorithms. The clusterfly package presents some\nearly experimentation aimed at overcoming this deficiency by linking R\nand GGobi. Cluster analysis was chosen as it is an exploratory method\nthat needs sophisticated visualisation and statistical algorithms.\n\nClusterfly provides some tools that work with all clustering\nalgorithms, and some that are tailored for particular ones.  Generic\ntools allow you to animate between clusterings (see ?cfly_animate) and\nproduce common static graphics (?cfly_dist, ?cfly_pcp).  Specific\nalgorithms are available for:\n\n* Self organising maps (aka Kohonen neural networks), ?ggobi.som.\nDisplays the self organising map/net in the original space of the\ndata.\n\n* Hierarchical clustering, ?hierfly. Connects data points with lines\nlike a dendrogram, but in the high-dimensional space of the original\ndata\n\n * Model based clustering, ?mefly. Adds ellipsoids from the\nmultivariate normal distributions the clusters are based on\n\nYou will need GGobi (http://www.ggobi.org) and rggobi\n(http://www.ggobi.org/rggobi) installed to be able to use clusterfly.\n\nRegards,\n\nHadley\n\n_______________________________________________\nR-packages mailing list\nR-packages@stat.math.ethz.ch\nhttps://stat.ethz.ch/mailman/listinfo/r-packages\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}