{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle and Bethea<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, be a millionaire at 34 without ever leaving your home", "body": "\n\n\n\nRGEM1973 Millionaire club eletter\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \nMEMO,THIS CHECK COULD BE YOURS!I'M GOING TO HELP YOU MAKEA MILLION DOLLARSWITHOUT EVEN LEAVING YOUR HOME!\n \n\nDear Memo,    That's right - you can earn a million dollars!  You won't have to leave your house or apartment.  You don't even have to make a phone call.  All you need to do is rearrange your furniture.  Clean a special area of your kitchen.  Or hang a mirror on the correct wall.  It's easy - once you know the secret! \n    Yes, Memo!  Feng Shui Master Vincent Pak Chung, wants to reveal to you an ancient Chinese secret that will show you how to turn your home into a powerful magnet for wealth and good fortune.\n    Vincent's rags-to-riches story is so incredible, I simply have to let him tell it to you directly, in his own words.\n   \nDear Memo,\n      I want to thank Bethea for giving me this chance to speak to you.      My name is Vincent Pak Chung.  I was born to a poor family in China in 1935, and began my education with the very selective Black Hat FENG SHUI School of Buddhist monks when I was a child of eight.  There I was taught the closely guarded secrets of FENG SHUI that can provide the \"3 Great Blessings\" of Health, Happiness and Prosperity to those who understand its mysteries.      Years later, after we'd escaped the Communist regime in China, I used the wisdom I had attained as a master of FENG SHUI to help my parents make a fortune!      Knowing that I had given riches and security to my parents filled me with pride.  Despite my schooling, I am a devout Christian and I vowed that I would use my mastery of FENG SHUI not for my own profit, but to help other people like you, Memo - good, honest people who struggle every day to make ends meet.\n\n\n\n\n\n     To me, FENG SHUI was the key to making the American dream come true - the promise that anyone, with enough luck and the right help, can become magnificently wealthy!\n      Successful businessmen around the world have already cashed in on this ancient miracle of wealth and power.  Major magazines and newspapers have reported how Michael Ovitz and Donald Trump, two of America's most dynamic tycoons, have consulted traditional masters of this powerful art to help design and bless their offices.  It is said you can see its principles in the design of the Trump Tower!      Citibank, Chase Asia, PaineWebber, the Asian Wall Street Journal -- all respected, conservative financial institutions -- as well as the firm of renowned architect I.M. Pei are a few of the more prominent businesses that have paid thousands of dollars to have this secret of gaining and preserving their staggering fortunes.  But YOU don't have to! \n\n\n\n\n\nI want YOU to use the power of FENG SHUI to attract money, good luck and happiness.\n      I'm going to give you the key to a new life of luxury and freedom, because I think that anyone who wants to be rich should have a chance to make that dream come true.  That's why I've put all of these remarkable secrets into one clear and simple guide I call \nFENG SHUI: ASIAN MIRACLE POWER FOR INSTANT WEALTH.             Here's what FENG SHUI did for one client of mine, J.G. of Oakland, CA: \n\n\"I had a table and a mirror in my front hallway.  According to you, it was blocking the flow of positive energy into my home.  I moved the table and changed the mirror to the other wall.  Two days later I got a call from a lawyer.  A distant relative I had never heard of had just died.  He left me $500,000.00 in his will.  How's that for positive energy!?\"      FENG SHUI could work for you as it did for J.G. and hundreds of my clients.  And you won't have to spend years learning mystical secrets like I did.  You won't have to pay the outrageous fees that millionaires pay to other FENG SHUI masters.       I'm offering all the secrets of Asia's most closely guarded mystery at an amazingly low price because I want to see good people like you - hard-working citizens - enjoy the fun and freedom of being incredibly rich!      These are some of the amazing discoveries you'll find in my secret guide, FENG SHUI: ASIAN MIRACLE POWER FOR INSTANT WEALTH:\n\n\n\n\n\nWhat your front door opens up to - how it can bring in good luck.\n\n\n\nThe arrangement of furniture in your living room - creates a whirlwind of positive energy that delivers money through telephone or mail.\n\n\n\nThat special part of your kitchen - clean it once a day and increase your chances of winning the lottery.\n\n\n\nThe ceiling in your bedroom - it can energize your sex life, attracting rich lovers.\n\n\n\nThe direction of your bed - allows dreams to reveal lucky numbers.\n      Do you have a mirror?  I'll tell you exactly where to hang it so it turns your home into a beacon of light that attracts money energy.  I'm sure you love the sound of wind chimes.  So do the prosperity spirits you'll draw to your home.  I'll show you how to hang your chimes and create the special music that brings the sound of money into your life!      There's one special corner in your living room.  Put a red object there and your money doubles within two weeks!  That's right - DOUBLES!  Find out where that corner is in my secret guide, FENG SHUI: ASIAN MIRACLE POWER FOR INSTANT WEALTH.      Did you know that a small aquarium, if placed correctly, cleans your room of all negative energy?  Or that a plant, growing in the right spot, makes that area a fertile ground for spirits of abundance?  With FENG SHUI, these spirits establish themselves in your home and become powerful money-making forces!      I'm saving the best for last.  Here's an amazing fact:       Every home has a MAGNETIC MONEY POWER POINT.  Sit there for 10 minutes a day and you'll be able to predict winning lottery numbers, sports teams and stocks.       I'll show you how to find your home's MAGNETIC MONEY POWER POINT in your secret guide FENG SHUI: ASIAN MIRACLE POWER FOR INSTANT WEALTH.      So many of my overjoyed clients have sent me letters telling me how they have benefited from the power of FENG SHUI to attract money.  It is my most sincere wish that you too could someday send me a letter like this: \n\"I set up the mirrors, fans and plants like you said.  I'd been unemployed and was down to the end of my savings.  I sat down in the MAGNETIC MONEY POWER POINT and waited for a miracle.  Five different people called in the next hour, all asking for the same wrong number.  I played the number five plus that 'wrong' number in the lottery, and guess what?  I won 3 million dollars!\"\n\n\n\n\n\n      Good luck, incredible fortune and astonishing amounts of money are out there.  Direct them into your home, work space and bank account with FENG SHUI!\n\n\n\n\n\n\nI've mentioned there's a MAGNETIC MONEY POWER POINT in every home -- including yours! -- where money forces converge and cross-energize.  I want to make sure that you know how to find this spot with one quick glance.  Along with your Feng Shui secret guide, I'll send you a great gift - a visual diagram that reveals exactly which part of your home is your MAGNETIC MONEY POWER POINT.  This diagram is called the Ba-gua.  It's beautifully printed in two colors.  Use your Ba-gua to find the exact location of your MAGNETIC MONEY POWER POINT, then follow the instructions in your secret guide to absorb that energy and become a money-making magnet!      Yes, I'm completely certain FENG SHUI will turn your home into a powerhouse of good fortune and help you become a multi-millionaire.  I'll back that claim with an absolute guarantee.  Order FENG SHUI: ASIAN MIRACLE POWER FOR INSTANT WEALTH totally at my risk. I'll give you as much time as you need to read it, follow the simple instructions and make a million dollars.  \nThis is your chance to become a member of theFENG SHUI Millionaires Club.\n      You have nothing to lose, Memo.  It's that simple.  Nothing to lose and millions to gain.  And because you are a friend of Bethea's, I would be delighted to offer you this invaluable guide for only $14.95.  That is 60 percent off the regular price, which comes to a savings of over $15.00 for you.\n      Ask for your FENG SHUI: ASIAN MIRACLE POWER FOR INSTANT WEALTH today and then, if you haven't made ONE MILLION DOLLARS during your lifetime -- or if at any time, for any reason, you are not completely satisfied -- just return your secret guide and I'll immediately send you a complete refund, including the shipping and handling charge,...with no explanation necessary.\n      So you see, you don't have to take any chances to begin a life filled with riches and good fortune!  All you have to do to get started is click the button below.\n      Don't let this once-in-a-lifetime opportunity slip by.  Accept your Invitation to the FENG SHUI Millionaires Club today!\n\n\n            Sincerely,\n\n       \n\nJust click the button below and order FENG SHUI: ASIAN MIRACLE POWER FOR INSTANT WEALTH, and you will receive as your second FREE gift, your certificate for membership in the FENG SHUI MILLIONAIRES CLUB. Here's what it will look like:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI, Memohereby certify that I have submitted my Invitation to theFENG SHUI Millionaires Club and ordered the secret guide,FENG SHUI: ASIAN MIRACLE POWER FOR INSTANT WEALTH On DATE:__June 21, 2007__\nI understand that along with my secret guide,FENG SHUI: ASIAN MIRACLE POWER FOR INSTANT WEALTH,I will receive for free myCertificate of Full Membershipin the FENG SHUI MILLIONAIRES CLUB\nI further understand that my membership becomes effective two (2) weeksfrom the above date, and at that time I will be entitled to all the benefits, power, riches and privileges that I can attract using my FENG SHUI power.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that she will not be able to send you exclusive opportunities for offers and discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, she's required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from her, simply click here or send a letter to to me at 167 Cherry St. PMB 292, Milford CT 06460-3400.\n\n\n\n"}