{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "lumpen: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Wednesday, June  6, 2007\nlumpen \\LUHM-puhn; LUM-puhn\\, adjective;plural lumpen, also lumpens:\n\n1. Of or relating to dispossessed and displaced individuals, especially those who have lost social status.\n2. Common; vulgar.\n3. A member the underclass, especially the lowest social stratum.\n. . .an academic sweatshop where underpaid lumpen intellectuals slave for a pittance. -- Ashlea Ebeling, \"I got my degree through e-mail\", Forbes, June 16, 1997\nIf traditionally cricket has been the game of the elite, and football strictly for the lumpen masses, all that's changed now. -- Louisa Buck, \"Fever pitch\", ArtForum, October 1996\nThough I appreciate that Mavericks owner Mark Cuban is a self-made man, having made his billions by selling the voltage of his brainpower to behemoths such as CompuServe and Yahoo!, and though I also appreciate that he has maintained his ability to mingle with the lumpen, he still is a very, very rich man. -- Sean Deveney, \"Mavs make their move, but at what cost?\", Sporting News, March 4, 2002\nThe New Russians are depicted as lumpens who have left the countryside and never fully adjusted to city life. -- Emil Draitser, \"The new Russians' jokelore: Genesis and sociological interpretations\", Demokratizatsiya, Summer 2001\nLumpen is from German Lumpenproletariat, \"degraded stratum of the proletariat,\" from Lump, \"a contemptible person\" (from Lumpen, \"rags\") + Proletariat, \"proletariat,\" from French.\nDictionary.com Entry and Pronunciation for lumpen\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9841595-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}