{"category": "spam", "to_address": "undisclosed-recipients:;", "from_address": "Sachsen Lotto-GmbH <lotto_gmbh@yahoo.de>", "subject": "Congratulations! You Have Won One Million Euro...Contact Your\n\tClaims Agent Now", "body": "\n\nSachsen Lotto-GmbH\nCentral Office\nManagement and Central Services:\nSachsen-Strasse 52,DE-13370 Postdam\nGermany.\n\n\nReference Number: SL/06-GmbH/4009\nBatch: SL/06- GmbH/3434\n\n\nCongratulations!!!\n\n\nWe are pleased to inform you of the result of the just concluded annual final\ndraws of Sachsen Lotto-GmbH Program.\n\nSachsen Lotto-GmbH draws was conducted from an exclusive list of 25,000,000 e-\nmail addresses of individual and corporate bodies picked  by an advanced\nautomated random computer ballot search from the internet as part of our\ninternational promotions program which we conduct every year.No tickets were\nsold.\n\nAfter this automated computer ballot, your e-mail address attached to serial\nnumber 06-3434 drew the lucky numbers 7-17-21-26-37-42 which consequently\nemerged you as one of first fifty (50) lucky winners in this category.\n\nYou have therefore been approved for a lump sum payout of ?1,000,000.00 (One\nMillion EURO) in cash credited to file SL/06-GmbH/4009. This is from a total\ncash prize of ?50 Million Euro shared amongst the first fifty (50) lucky\nwinners in this category.\n\nThis year Lottery Program Jackpot is the largest ever for Sachsen Lotto-GmbH.\nThe estimated ?50 million jackpot would be the sixth-biggest in Europe  \nhistory.\nThe biggest was the ?363 million jackpot that went to two winners in a Febuary\n2000 drawing of The Big Game Mega Millions' predecessor.\n\nYour fund is now deposited in an offshore bank with a hardcover insurance. Due\nto the mix up of some numbers and names, we advice that you keep this award\nfrom public notice until your claim has been processed and your money remitted\nto your nominated bank account as this is part of our security protocol to\navoid double claiming or unwarranted taking advantage of this program by the\ngeneral public.\n\nPlease note that your lucky winning number falls within our European booklet\nrepresentative office in London. In view of this, your ?1,000,000.00 (One\nMillion Euro) would be released to you by our affiliate bank in Europe. Our\nagent will immediately commence the process to facilitate the release of your\nfunds to you as soon as you make contact with him.\nTo begin your claim please contact our licensed and accredited agent assigned\nto you:\n\nMr.Gray Armstrong\nSachsen Lotto-GmbH\nInformation and Payment Bureau:\nLondon Representative Office.\nPhone: +44-702-402-0585\nFax:    +44-870-068-8245\nE-mail: info_armstrong2007@uk2.net\n\n\n\nYour claims agent will assist you in the processing and remittance of your\nprize funds into your designated bank account.\n\n  Note that all prize funds must be claimed not later than 3 weeks. After this\ndate all funds will be returned to the LOTTERY TREASURY as unclaimed. In order\nto avoid unnecessary delays and complications, please endeavor to quote your\nReference Number:SL/06-GmbH/4009 and Batch numbers:SL/06-GmbH/3434 in every\ncorrespondence with your agent. Furthermore, should there be any  \nchange in your\naddress, do inform your claims agent as soon as possible.\n\n\nMembers of the affiliate agencies are automatically not allowed to participate\nin this program.\n\nCongratulations once again from all members of our staff and thanks for being\npart of our promotions program.\n\n\nYours faithfully,\nMrs.Julia Flo\nPromotions Manager.\nSachsen Lotto-GmbH.\n\n----------------------------------------------------------------\nThis message was sent using IMP, the Internet Messaging Program.\n\n\n"}