{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] Tech Central Station: India - Patently Wrong", "body": "http://www.aei.org/publications/filter.all,pubID.25989/pub_detail.asp\n\nIndia: Patently Wrong\n\nRoger Bate\nApril 19, 2007\nTech Central Station\n\nWhile many Indians are still upset by their countrymen's premature\ndeparture from the Cricket World Cup, those interested in Indian\nprosperity should be even more upset by the equally recent departure of\nthe head of a technical committee designed to analyse India's patent\nlaw. With the resignation of R.A Mashelkar, due to politically motivated\npersonal attacks, the Indian Government has lost a firm defender of\nintellectual property, which is a key means for increased growth and\nprosperity for India.\n\nDr. Mashelkar is both a respected scientist and administrator and his\ncommittee was formed to review the 2005 Indian Patent Amendment Act. But\nfrom the moment the committee's report was published, and Mashelkar\nspoke favourably about patents, he has been cast as a villain by leftist\nactivists.\n\nCritics have jumped on mistakes that were made in the drafting of the\nreport. The most damaging to Dr. Mashelkar was that certain sections of\nthe report's recommendations were directly taken from one of the studies\nsubmitted to the committee during its deliberations. Dr. Mashelkar\nimmediately apologised to the author whose work was incorporated without\ndue acknowledgement. He also requested that the government withdraw the\nreport and he offered to re-write it. But the damage was done. Under\npressure by media and activists, the Indian government forced Dr.\nMashelkar to resign. With his departure, perhaps the best hope for\nIndia's increasing competitiveness in the pharmaceutical sector is gone.\n\nIndian protectionist interests have historically prevented global\ncompetition and innovation in drug manufacturing. Yet in 1995 India\nsigned on to the World Trade Organization's agreement and was given\nuntil January 2005 for product patents to be in place. With the new\nIndian patent law of 2005, protection for innovation seemed assured. But\nafter lobbying from local producers, amendments were made to the law,\nwhich are unique to India and in my opinion illegal under the WTO\nagreement. It is these amendments that Dr. Mashelkar's committee was\nasked to review.\n\nWhat is depressing for India watchers is that activist efforts are\nshort-sighted and unfair both to Indian scientists who are more than\ncapable of competing globally, and to Indian consumers who will not\nreceive the best drugs under the current law.\n\nThe key amendment to the patent law, Section 3(d), creates additional\nhurdles for pharmaceutical patents by deeming that derivatives of known\nsubstances are not considered patentable unless they can be shown to\ndiffer in terms of efficacy. One has to demonstrate more than the usual\n\"novelty, commercial applicability and non-obviousness\" criteria under\nthe WTO agreement.\n\nApplying only to drug development, this amendment violates the WTO\nagreement because the agreement disallows WTO member states from\nrendering it more difficult to obtain a patent in one technical field\nover another.\n\nThe first impact of this amendment came when drug company Novartis'\napplication for a patent for its cancer drug Gleevec was rejected.\nNovartis brought an action in the Chennai High Court (the case is still\nongoing) claiming that it should have been granted a patent. Indeed,\nmost physicians and patients would agree that the Novartis drug Gleevec\nrepresents an innovative anti-cancer breakthrough and deserves a patent.\nIn 1983, Novartis scientist Dr. Alex Matter led the charge for a new\ndrug that would target only cancer cells. As greater genomic knowledge\nbecame available, Novartis scientists ultimately were successful,\nresulting in Gleevec.\n\nFirst patented in 1994 in Taiwan and then in 1996 in America, Gleevec\nwas first used on leukemia patients in 2001.\n\nNovartis continued to work on the drug, developing another, beta\ncrystal, version. That is the one for which it applied for a patent in\nIndia. Ironically, had India had patent laws when Novartis first started\nfiling globally, the company probably would have received a patent. For\nthe Indian government denied Novartis a patent under Section 3(d),\nclaiming that the second version was not sufficiently distinct from the\nfirst.\n\nEven under Indian law today, Novartis arguably should qualify for a\npatent. The beta version performs better in some tests, implying that it\nis a clinical improvement over the older version, just what Section 3(d)\ndemands.\n\nFar from Novartis keeping the poor from receiving needed drugs, it is\nIndia's patent law that limits India's drug market. India's patent\nhurdles discourage drug companies from operating there, undermine\ninnovation (as many drugs are developed from existing substances), and\nput off drug companies from working on diseases that may be unique to India.\n\nThis case is one of principle. It will not affect Indian patients, for\nNovartis distributes the drug free to most of those who need it. But if\nNovartis loses the case, as insiders think is likely now that Mashelkar\nhas been discredited, it will send a signal to drug companies that India\nis not welcoming. And even Indian drug company, Ranbaxy Laboratories,\nwhich has historically copied western drugs, has come out in favor of\nNovartis.\n\nThe stakes are high. About 70% of Indians do not receive modern\nhealthcare treatment, many buy sub-standard drugs and perhaps half of\nthose drugs are counterfeits. No doctor in public sector healthcare can\ncredibly claim that patients' problems are related to patents. But\nrather than looking into the whole chain of delivery--medical\nprofessionals, diagnostic facilities, dispensaries and hospitals--it is\neasier to wave the national flag, and claim that western drug companies\nare at fault. The reality is that even if there were no patents, or if\nmedicines were distributed free, many patients would still not benefit.\nNothing else can explain the failure to provide oral rehydration therapy\nto diarrhoea patients, or the failure to vaccinate children against polio.\n\nIndia is at a crossroads. It can follow the route it has taken in\nsoftware engineering, with sensible intellectual property protection\nthat spurs growth, or it can travel the opposite route with\nidiosyncratic rules that limit growth and innovation.\n\nIf Novartis loses the case in the next week or so, the Government can\nstill intervene to change the law-it should do so.\n\nRoger Bate is a resident fellow at AEI.\n\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}