{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Sebastian Jackson\" <paxengncotuf@engnco.com>", "subject": "Control your weight and appetite", "body": "\nGet your ideal weight with this natural method\n\n\n\n\n\nAnatrim – The up-to-the-moment and most enchanting product for over-weight people is now readily available – As were seen on BBC\n\n\n\nDid you see superfluous body kilograms kill a lot of people for every new year? We believe you hate the unattractive look of those people and the social stigmata attached to them. \n\nOr, maybe, you’ve not the will to withstand pressure of baneful eating habits of yours. If you think it sounds familiar, then we got something to propose to you!\n\n\n\n\n\nHere Anatrim comes, the later product for the reduction of your body’s extra weight. The most amazing thing is that Anatrim raises the quality of your life, repressing your feeling of hunger and giving you better mood. Note what people write about this product:\n\n\n\n\n\n\"This is outstanding! \n\n\nInstead of gorging everything close at hand and watching TV \n\n\nI became keen on doing sport.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I have a great form now and lots of men cast their covert glances at me!\"\n\n\n\n\n\n\nLusia R., New York\n\n\n\n\n\n\n\"I tried some passive weight burning, but almost with no result. It was difficult for me to hold back and not to eat something just at hand. \n\n\nOne day I heard on Anatrim in the media and I was really effected by the information.\n\n\n I had tried taking it, and my wife said to me I had changed for the better since then, 3 months later. \n\n\n31 pounds have gone away and it’s still far to an end! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nDave Klark, Bellevue WA\n\n\n\n\n\nAnatrim helps your mind to realize that you got no such great need for the constant eating. It improves your spirit, provides you with additional energy, and attacks unnecessary kilos. Especial thanks to its powerful original formula!!\n\n\n\nWorm out more useful information!\n\n\n\n"}