{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "leitmotif: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n101 Questions Answered!\n\nWhat is Hezbollah? What are stem cells?\nHow'd those swimsuits get so skimpy?\n\nClick here for the KnowledgeNews answers\nADVERTISEMENT\nWord of the Day for Sunday, June 10, 2007\nleitmotif \\LYT-moh-teef\\, noun:\n1. In music drama, a marked melodic phrase or short passage which always accompanies the reappearance of a certain person, situation, abstract idea, or allusion in the course of the play; a sort of musical label.\n2. A dominant and recurring theme.\nEach actor to appear on stage is accompanied by a musical phrase on the drum -- a sort of leitmotif to characterize an emotion, much like a Wagnerian drama. -- Eleanor Blau, \"Connecticut's Shakespeare\", New York Times, July 9, 1982\nOne theme had recurred so frequently in these conversations that it had become the leitmotif of the trip. -- Jack F. Matlock Jr., Autopsy on an Empire\nAs is so often the case in a crazy household . . . guilt becomes a leitmotif. -- Frederick Busch, \"My Brother, Myself\", New York Times, February 9, 1997\nSuch sudden whims, seeming to fly in the face of conventional expectations but really motivated by profound, if unexamined, psychological needs, become a leitmotif of the novel, whose chief concern is whether people can ever claim to know themselves -- or one another -- at all. -- Elizabeth Tallent, \"Thou Shalt Settle for Less and Less'\", New York Times, May 7, 1989\nLeitmotif (also spelled leitmotiv) is from German Leitmotiv, \"leading motif,\" from leiten, \"to lead\" (from Old High German leitan) + Motiv, \"motif,\" from the French. It is especially associated with the operas of German composer Richard Wagner.\nDictionary.com Entry and Pronunciation for leitmotif\nYesterday's Word - Previous Words - Help\n\n101 Questions Answered!\n\nWhat is Hezbollah? What are stem cells?\nHow'd those swimsuits get so skimpy?\n\nClick here for the KnowledgeNews answers\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9871357-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}