{"category": "ham", "to_address": "\"Chas Owens\" <chas.owens@gmail.com>", "from_address": "\"Bob McConnell\" <rvm@CBORD.com>", "subject": "RE: Having trouble porting an application to MS-Windows - corrected", "body": "> -----Original Message-----\n> From: Chas Owens [mailto:chas.owens@gmail.com] \n> Sent: Friday, June 15, 2007 7:43 PM\n> To: Bob McConnell\n> Cc: beginners@perl.org\n> Subject: Re: Having trouble porting an application to MS-Windows\n> \n> On 6/15/07, Bob McConnell  wrote:\n> > > -----Original Message-----\n> > > From: Chas Owens [mailto:chas.owens@gmail.com]\n> > > Sent: Friday, June 15, 2007 11:33 AM\n> > > To: Bob McConnell\n> > > Cc: beginners@perl.org\n> > > Subject: Re: Having trouble porting an application to MS-Windows\n> > >\n> > > On 6/15/07, Bob McConnell  wrote:\n> > > snip\n> > > > Or have I found a bug in the ActiveState implementation?\n> > > snip\n> > >\n> > > Are you currently paying for ActiveState support?  If so, I would\n> > > suggest filing a ticket with them.  In the mean time, try \n> modifying my\n> > > code to do a sysread from a socket.\n> >\n> > No, we are not \"officially\" using the ActiveState tools. \n> Only a few of\n> > us recognize that anything other than VBScript might \n> actually be useful.\n> >\n> > I'll have to set up a socket that won't return anything and \n> try that. If\n> > that times out as expected, then it looks like a bug report will be\n> > needed.\n> >\n> > Thank you,\n> >\n> > Bob McConnell\n> >\n> \n> Even if it does timeout a bug may still need to be filed.  I just want\n> to understand the scope of the problem first and I don't have easy\n> access to an XP machine at the moment.\n\nWhat I can define so far:\n  Win2K Pro SP4 fully patched.\n  Dell Optiplex GX270, 3.0 GHz, 1GB RAM.\n  ActivePerl 5.8.8.820 installed after uninstalling 5.8.0.806.\n  Code snippet was sent earlier in this thread.\n\nAttempting to set an alarm for 3 seconds then call sysread() on a serial\nport within an eval, as per the recommended form. The eval will never\nreturn without receiving a character on the port. SIGBRK does get caught\nand terminates the script. I have not yet tried this on a socket.\n\n--->>> Sorry, that should be SIGINT, from CTRL->BREAK!\n\nI don't see anything that matches in the ActiveState bug tracker, but I\ndon't have an ASPN account needed to add bug reports. I am looking at\ntheir community support forum. A search there on \"alarm sysread\" does\nnot produce any results. It looks like I need to create an account there\nbefore I can post a message.\n\nThank you,\n\nBob McConnell\n\n\"If you notice anything funny, record the amount of funny.\"\n Milligan's law as reported by Bob Pease.\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n\n"}