{"category": "ham", "to_address": "\"'Speakup is a screen review system for Linux.'\" <speakup@braille.uwo.ca>", "from_address": "\"Adam Myrow\" <myrowa@bellsouth.net>", "subject": "RE: Stopping Speakup while using Gnome.", "body": "You have to kill Speakup after you start Gnome.  The reason is that when X\nstarts, it allocates itself a new virtual terminal.  The commands to kill\nSpeakup only effect the virtual console that they are run from.  Let's say\nyou are on tty1, which is the case when you first log in.  When X starts, it\nwill turn TTY1 into a console for error messages and debugging output.  X\nwill get the first free TTY.  Using Slackware as an example, this will be\nTTY7 since Slackware allocates 6 TTYs by default at boot time assuming you\nare in run level 3.  Thus, the command to kill Speakup should be given once\nGnome is up and running.  HTH.\n\n-----Original Message-----\nFrom: speakup-bounces@braille.uwo.ca [mailto:speakup-bounces@braille.uwo.ca]\nOn Behalf Of Darragh\nSent: Saturday, April 21, 2007 1:25 PM\nTo: speakup\nSubject: Stopping Speakup while using Gnome.\n\nHello,  \n\nHow can I stop speakup listening for key presses when I'm in gnome?\nI've tried pressing the ... I think it's the scrole lock. I cant remember\nthe name of the button. sorry. it's late. it's the third button in from the\ntop row on the right. that says you killed speakup. then I press insert and\nenter and it says you turned me off but when I'm in gnome and I'm using orca\nkeystrokes speakup starts talking again.  I don't want to unlode speakup\nfrom memory as I often go back to a console to continue working on other\nthings so I would really like to know how to just temporarily stop it.  \n\nOr maybe I do need to completely unlode the module.  but, how do I do this\nwithout needing a reboot to get it working again? using modprobe\nspeakup_apollo doesn't work after using the command rmmod.  \nnow, I may have that rmmod command wrong. It's been some time since I used\nit and as I said, it's late and I'm probably not thinking as clarly as\nusual.\n\nThanks in advance.\n\n\n\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}