{"category": "spam", "to_address": "Gnitpick <gnitpick@flax24.uwaterloo.ca>", "from_address": "Bridget Morrow <crushice@gramegna.net>", "subject": "The way to make your girlfriend happy", "body": "\n\nGoing to have sex with two ladies at the same time? You need a strong erection, or they will have to satisfy each other. You really need Viagra!\nClick to visit us\nThere is no need to parade your problems. There is no need to visit your local drug store. Cheapest Viagra and Cialis you can find! \nClick here\nBest quality drugs, instant shipping worldwide, friendly support! Lowest prices on the web!\nWith best regards,\nBridget Morrow\n \n \nLork prinadlezhal k klassu samyh opasnyh Hishchnikov Novy-2, svirepyh, moguchih, bezzhalostnyh, pochti neuiazvimyh. Sam ty otsiuda vmeste S Nori ne vybereshsia, Celitel dejstvitelno mozhet pomoch tolko tebe Odnomu. Tresk gnilogo plastika Vyvel menia iz stupora, a instinkt otbrosil v storonu. Hotelos by nadeiatsia, chto Budet stol zhe effektivno. \nSama zhe Nori smozhet vhodit i vyhodit besprepiatstvenno. Postoianno imeia Klinok pod rukoj, chuvstvuia ego Mogushchestvo, ia stal teriat instinkt samosohraneniia. Dvor zhe byl obiazatelno Okruzhen izgorodiu, spletennoj iz zhivyh kustov koliuchego miata. Vot Primerno v sta metrah vverh po ulice vzvihrilas pyl i tonkim smerchem Potekla k ploshchadi, slovno za skolziashchej po poverhnosti nevidimoj metloj. Odno bylo neponiatno, pochemu eshche v zabroshennom Gorode on ne predprinial podobnuiu ataku? Kakie-to zakulisnye igry, kak i u Nkota, ili prosto ne rasschital svoih sil, reshil poigratsia po predlozhennym Chuzhim pravilam silnym ved tozhe svojstvenno oshibatsia? Ili chelovecheskij material dlia nego deshevle stoimosti sengrov, primenennyh uzhe kak poslednee Sredstvo? Vprochem, kakoj teper smysl lomat nad etim golovu. Ostanovivshis v treh shagah ot maga, demon shiroko raspahnul Cheliusti i vybrosil dlinnyj zheltyj iazyk. Vchera ty natravil na nas liudej Dosa i Brosil na !\nproizvol sudby, i, chestno govoria, ia do sih por ne mogu pridumat Razumnogo obiasneniia etomu gnusnomu postupku. chto daet tebe podobnuiu uverennost? Sovokupnost Priznakov. \nDerzhi svoj mrachnyj Iumor pri sebe, on nikomu ne interesen. Ia mogu chem-to pomoch? neuverenno sprosil ia, chuvstvuia sebia pochemu-to Glupo. Zlyden vozbuzhdenno triahnul ushami, gromko, s podvyvaniem, fyrknul, slovno Zhelaia sbrosit nadoedlivye povodia, snova povernul golovu, ustavivshis na menia Blestiashchim chernym glazom, na etot raz trebovatelno i azartno. Prigotovtes! neozhidanno gromko promurlykal szadi chuzhoj. ejisuminyon VVFcRlhQUVh0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}