{"category": "ham", "to_address": "IP-health@lists.essential.org", "from_address": "Joana Ramos <jdr@ramoslink.info>", "subject": "[Ip-health] State of the Clinical Trials Industry 2007 Sourcebook", "body": "URL: http://www.prnewswire.com\n\nHEADLINE: State of the Clinical Trials Industry 2007 Sourcebook Charts Drug\nPipeline Trends Affecting Healthcare Industry;\nThomson Healthcare Compendium Tracks Growth of Clinical Research\nOutsourcing,\nRates Top Clinical Trial Sponsors and Analyzes Industry-Wide Spending Data\n\nDATELINE: BOSTON May 2\ncopied as fair use\n\n\n   BOSTON, May 2  /PRNewswire/ -- Russia is on track to become the next big\nclinical research market; global pharma R&D spending is projected to top\n$100\nbillion in 2007; and convenience is the number one concern of patients\nparticipating in clinical trials. These are just three of the hundreds\nof data\npoints and research observations featured in State of the Clinical Trials\nIndustry 2007, an annual sourcebook produced by Thomson CenterWatch, a\nleading\nprovider of information and solutions to the clinical trials industry, and a\nbusiness within of The Thomson Corporation (NYSE: TOC; TSX: TOC).\n\n   State of the Clinical Trials Industry 2007 is a comprehensive\nresource that\nexamines all aspects of the clinical trials industry, providing original\nCenterWatch data gleaned from in-depth industry analyses, physician and\npatient\nsurveys and report-card-style ratings of pharmaceutical sponsors and\nclinical\nresearchers. Data highlights included in the 400-plus page book include:\n\n  *  Causes and costs associated with study delays;\n   *  Trial success based on company size;\n   *  Clinical Research Organization (CRO) market size, costs and\n      performance;\n   *  Investigative site perceptions of sponsors and CROs within the US,\n      Europe, and Latin America; and\n   *  Worldwide sales (within the pharmaceutical, medical device, and\nbiotech\n      sectors);\n   *  Overall R&D spending and cycle times;\n   *  Regulatory submissions and approvals within the US and\ninternationally.\n\n\n   \"The most compelling observations in this year's edition of State of the\nClinical Trials Industry focus on the significant challenges pharmaceutical\ncompanies have faced with clinical trial recruitment,\" notes Mary Jo\nLamberti,\nsenior manager of Market Research for Thomson CenterWatch. \"To manage these\nchallenges, companies are looking outside the U.S., particularly toward\nAsia,\nLatin America, and more recently, to Russia, to conduct clinical\ntrials,\" she\nsaid. \"State of the Clinical Trials Industry provides insights to these and\nother trends, and helps clinical researchers, biotech and pharmaceutical\nexecutives, CRO executives and investment analysts track and react to\nchanges in\nthe industry.\"\n\n   State of the Clinical Trials Industry 2007 contains over 500 charts,\ngraphs,\nand tables; a review of the top clinical research stories of 2006 as\nreported by\nthe editorial staff of The CenterWatch Monthly; as well as drug pipeline\ninformation and updates on specific disease areas. Much of the data is\nbased on\nCenterWatch's clinical research benchmarking surveys that have been\nconducted\nacross global segments and represents an analysis of current sponsor and CRO\npractices.  The 2007 edition features more than 100 completely new charts\nanalyzing the clinical research industry along with hundreds more\nupdated slides\nfrom our 2006 edition.\n\n   About Thomson Healthcare\n\n   Thomson Healthcare is the leading provider of decision support\nsolutions that\nhelp organizations across the healthcare industry improve clinical and\nbusiness\nperformance. Thomson Healthcare products and services help clinicians,\nhospitals, employers, health plans, government agencies, and pharmaceutical\ncompanies understand healthcare markets, access medical and drug\ninformation,\nmanage costs, and improve the quality of healthcare.\n\n   Thomson Healthcare is a part of The Thomson Corporation, a provider of\nvalue-added information, software tools and applications to\nprofessionals in the\nfields of healthcare, law, tax, accounting, scientific research, and\nfinancial\nservices. The Corporation's common shares are listed on the New York and\nToronto\nstock exchanges (NYSE: TOC; TSX: TOC). For more information, visit\nhttp://www.thomsonhealthcare.com/ .\n\n   CONTACT:  Dr. Mary Jo Lamberti of Thomson Healthcare, +1-671-856-5956,\n maryjo.lamberti@thomson.com ; or John Roderick of J. Roderick, Inc.,\n+1-631-656-9736,  john@jroderick.com , for Thomson Healthcare\n\n   Web site:   http://www.thomsonhealthcare.com/\n\n   SOURCE Thomson Healthcare\n\n\n\n\n\n--\nJoana Ramos, MSW\nCancer Resources & Advocacy\nSeattle WA USA\nTel. +1-206-229-2420\nhttp://ramoslink.info/\nwww.cancersurvivorsproject.org\nwww.healthyskepticism.org\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}