{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "FilePlanet <owner-cp_announce_list@news.ign.com>", "subject": "FilePlanet Worldwide Premiere: Dungeon Runners, a Free-to-Play Action MMO!", "body": "\n\nFilePlanet Dungeon Runners Worldwide Download Premiere\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDungeon Runners™\n\n\t     Worldwide Premiere!\n\t\t \n\t\t Delve into the depths of twisting dungeons or stifling jungles in this fast, \n\t\t funny, and free to play online roleplaying hack-and-slasher from NCsoft. Fight the \n\t\t hordes as a lone warrior or team up with your online buddies to carve a path of \n\t\t destruction and quench your deepest dungeon-crawling thirst!\n\t\t \nFor a limited time:Free Bonus Content for FilePlanet Readers!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t   © 2007 NCsoft Corporation. All Rights Reserved. NCsoft, the interlocking NC logo, PlayNC and \n\t   all associated logos and designs are trademarks or registered trademarks of NCsoft Corporation. All \n\t   other trademarks are the property of their respective owners.  NCsoft would like to acknowledge \n\t   MudMagic.com for their willingness and consent in allowing NCsoft to use the mark Dungeon Runners. \n\t   \"Dungeon Runners\" has been used by MudMagic.com as the name of a text computer game since 1998. It \n\t   can be found at http://www.mudmagic.com/.\n       *Player is responsible for all applicable internet fees. For full terms and conditions \n\t   click here. \n     \n\n\n\n\n\n\n\n\n\n\n\n\n    Having trouble viewing this e-mail? View the online version. TO UNSUBSCRIBE: Click Here!\n\n    You have received this e-mail because you are a registered user of IGN and have opted-in to receive IGN email updates concerning new products and services. If you believe you're receiving this e-mail in error or prefer not to receive promotions from IGN.com, reply to this message to opt out of future promotional mailings. Click here for our privacy policy. You may still receive other e-mails from IGN. To update your e-mail address or manage your account, visit GameSpyID.com. It may take up to 10 days for adjustments to your email preferences. If you have questions about this offer or your services, you can reach Customer Service here. \n    \n    You may mail inquiries to:IGN Entertainment, Inc., 8000 Marina Boulevard, 2nd Floor, Brisbane, CA 94005.\n    \n\n\n\n\n\n\n\n\n\n\n"}