{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Steve Dawes\" <sdawes@telus.net>", "subject": "RE: TTSynth Is Available Again", "body": "Is this an appropriate post for this list.\nI am reading that your company stands to profit from such a post.\nSimply put, this post is SPAM.\nI joined this list with the understanding that this list would not be the\nsource of SPAM.\nPlease stop SPAMMING me through this list.\n\n\n-----Original Message-----\nFrom: speakup-bounces@braille.uwo.ca\n[mailto:speakup-bounces@braille.uwo.ca]On Behalf Of Janina Sajka\nSent: Monday, June 18, 2007 6:10 PM\nTo: speakup@braille.uwo.ca\nSubject: TTSynth Is Available Again\n\n\nDear Friends:\n\nShortly after we launched TTSynth a few weeks ago, we discovered that\ncertain users were having problems downloading our software. We closed\nour doors tempporarily as a result, and spent the last week debugging\nthese problems. We believe we have them well solved. Consequently, it is\nonce again possible to purchase and download TTSynth.\n\nhttp://TTSynth.Com\n\nOf course we also provided packages through email to those few customers\nwho experienced problems with our initial release. We believe there are\nnow no outstanding issues.\n\nSpecifically, we had two problems to fix in our automated download process:\n\n1.)\tCustomers using Internet Explorer on Microsoft Windows were\nunable to complete transactions. This is now fixed.\n\n2.)\tSome customers using Debian or Ubuntu experienced failures due\nto a bug we uncovered in the earlier version of GNU TLS used on these\ntwo distributions. Of course it is very important that your Internet\ntransaction is properly protected by SSL. This is now also fixed.\n\nConsequently, the premier Text To Speech (TTS) software synthesizer for\nLinux is once again available for immediate secure on line purchase and\ndownload using a credit card!\n\nAvailable Modules Include:\n     * IBM's incomparable IBM TTS text to speech (formerly called\n       ViaVoice)\n     * Gnome-Speech patched for use with LSR and Orca\n     * The TTSynth Speakup Bridge for screen reading with Speakup\n     * ttsynth_say binary for the CLI or for use in scripts\n     * Also supported by Emacspeak KTTS, and Speech Dispatcher\n\nAvailable Languages For Linux\n     * Chinese\n     * English\n     * Finnish\n     * French\n     * German\n     * Italian\n     * Japanese\n     * Portuguese\n     * Spanish\n\n   The best is also very affordable. Your first language license is only $40\nUSD\nand each additional language license is only $20 USD, when obtained at the\nsame time.\n\n   Use your credit card to purchase and download TTSynth now, and start\nenjoying the best software speech available for Linux today.\n\nGo to http://TTSynth.Com.\n\nWe provide TTSynth in both .rpm and .deb packages to make it easy to\ninstall TTSynth on Fedora, Ubuntu, and most Linux distributions which\nutilize these package managers.\n\nTTSynth is a product of Capital Accessibility, LLC.\n\n--\n\nJanina Sajka,\tPhone:\t+1.202.595.7777;\tsip:janina@a11y.org\nPartner, Capital Accessibility LLC\thttp://CapitalAccessibility.Com\n\nMarketing the Owasys 22C talking screenless cell phone in the U.S. and\nCanada\nLearn more at http://ScreenlessPhone.Com\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}