{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Vicki Blair\" <powcksdesignsdeq@cksdesigns.com>", "subject": "Less weight - more pleasure and joy", "body": "\nEnd the annoying obesity now\n\n\n\n\n\n\nAnatrim – The newest and most delighting product for weighty people is now easily available – As were told on Oprah.\n\n\nDo you retain all the times when you plead to yourself to do anything to get rid of this quickly growing number of kilos? Happily, now no big sacrifice is required. Thanks to Anatrim, the ground-shaking weight-reducing combination of elements, you can get healthier life style and a really slender figure. Just look at what people write!\n\n\n\n\"It’s difficult to confess but I was an awful food addict. \n\n\nI greedily ate all this garbige \n\n\nand was unable to stop. \n\n\n\n\nThis suffering passed away after I started course of taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my craving for food abated, \n\n\nmood increased and I became the happiest person in the world 21 pounds in 2.1 months. \n\n\n\n\nI can tell you now I became the happiest person in the world!\"\n\n\n\n\n\nVictoria K., Bellevue WA\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nYou can't even fancy how I hated being mocked at school. \n\n\n\n\nI detested my plumpness and I detested myself. \n\n\nAfter trying this and that I heard about Anatrim. \n\n\n\n\nThis stuff literally took me out of this horror! The very sincere thanks to you, fellows.\"\n\n\n\n\n\nMikkey Fox, San Diego\n\n\n\n\n\n\"Do you know what? Thanks to Anatrim my marriage was luckily saved! I fell down into this circle, depression – eating more – just more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce my friend showed me site and I asked for pack of Anatrim immediately. \n\n\nThe result was splendid, my appetite became normal, I was in good spirits oftener, and, certainly, I became able to tighten my belt on some holes. And you see, the bedroom became cool, too!\"\n\n\n\n\n\nMikkey\n\n\n\n\n There many and many gratitudes happy people leave after trying Anatrim. Don’t you wanna add yourself to the tens of thousands of slim buyers and try this natural appetite reducing energy raising product now!\n\n\nDon’t decline your chance!\n\n\n\n\n"}