{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Michael Pobega <pobega@gmail.com>", "subject": "Re: The GPL and soundfonts", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nOn Mon, Jun 04, 2007 at 02:05:58PM -0300, cascardo@minaslivre.org wrote:\n> On Mon, Jun 04, 2007 at 09:51:11AM -0700, Walter Landry wrote:\n> > Terry Hancock  wrote:\n> > > IMHO, the license of the sequencing software you used is completely\n> > > irrelevant. You USE a toolchain when you create with it, you don't\n> > > DERIVE from it (the exception being things like libraries -- or\n> > > soundfonts -- that get incorporated into the resulting work).\n> > > \n> > > So, the soundfont license needs to be very permissive, but I don't think\n> > > there should be any concern about the tool used to create it.\n> > \n> > The license of the sequencing software does matter.  If the sequencing\n> > software is non-free, then the WAV files build-depend on a non-free\n> > component.  It is the same as if you used a non-free compiler to\n> > create an executable.  If the soundfonts are GPL compatible, that\n> > would put the WAV's in contrib.\n> > \n> > Cheers,\n> > Walter Landry\n> > wlandry@ucsd.edu\n> > \n> \n> Although I would agree with that, the main matter here is not whether\n> this WAV file would be appropriate for main or contrib, but whether it\n> is distributable at all, since the GPLv2 requires complete source code,\n> which includes \"the scripts used to control compilation and installation\n> of the executable\".\n> \n> Regards,\n> Thadeu Cascardo.\n> \n> \n\nIn that case then I believe that the WAV would be undistributable, since\nthe program used to create/compile it (Depending upon how you look at\nit) is undistributable under the GPL. So would that throw the WAV file\nin non-free?\n\n- -- \nhttp://digital-haze.net/~pobega/ - My Website\nIf programmers deserve to be rewarded for creating innovative\nprograms, by the same token they deserve to be punished if they\nrestrict the use of these programs. \n - Richard Stallman\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGZGrpg6qL2BGnx4QRApgZAKCWm45mP6TpbNSjINGPd6ILQGfOWQCeMi6D\nOhcA9WgZELU4/4Kr9FDD5SM=\n=r6St\n-----END PGP SIGNATURE-----\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}