{"category": "ham", "to_address": "\"Guillaume Desmottes\" <guillaume.desmottes@collabora.co.uk>,\n   \"Christian Marc Schmidt\" <schmidt@pentagram.com>,\n   \"Takaaki Okada\" <okada@pentagram.com>", "from_address": "\"Eben Eliason\" <eben.eliason@gmail.com>", "subject": "Re: [sugar] [PATCH] add invitation support", "body": "> The following patch implements activity invitations in Sugar.\n> You have to share the activity before be able to send invitations. This\n> restriction is because currently we create the muc associated with an\n> activity when we share it. That should be fixed in the futur.\n\nSounds good; getting that fixed will be very important.\n\n> There are 2 ways to invite someone to an activity:\n\nActually, there will be a 3rd way.  We should allow direct\nmanipulation, so that dragging an XO on the mesh to the People edge of\nthe frame invites them to the currently active activity.  A white\noutline XO should appear when this happens (and actually, anytime an\ninvite happens), acting as a placeholder until the invitee accepts or\nrejects the invitation.\n\n> - using the mesh view. You have to share your current activity then go\n> to the mesh view, roll the cursor over a buddy and choose \"invite\".\n\nFor clarity, it might be better if this label read \"invite to\n.\"  Alternatively, we could provide a secondary list of open\nactivities to select from.  I'm not sure which approach we'll take\nyet.  The first is clearly simpler.\n\n> - after sharing, click on the invite button in the toolbar and select a\n> contact. This widget is still very basic and probably needs some UI\n> love.\n\nMockups for this system are forthcoming.\n\n> I reused existing code to display invitations so currently each invite\n> is added in the activity toolbar. You can only accept an invite by\n> clicking on it.\n\nThat sounds fine for now.  Are the invitations rendered in color (as\nthey are in the mesh)?  Also, we may eventually want some kind of\naudio indication that an invitation has arrived.\n\n> The GUI should be able to reject invites and see informations about them\n> (sender of the invite, ...).\n\nThis is quite true.  The secondary rollover for invitations will\nprovide a way to accept or reject them, and perhaps even provide a way\nto send a reason for the rejection.  It will also, of course, include\nthe sender the name of the activity, and any other relevant info.\n\nI'm going to start working on some more specific visual mockups of\nthese 3 methods, as well as the accepting of an invitation.  That\nshould help guide the development.  I'll reply on this thread when\nthey are available.  Thanks!\n\n- Eben\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}