{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Barbara Pruitt <mmcom@godide.com>", "subject": "Simple way to enhance your sexual life.", "body": "\n\nLooking for an effective and cheap solution? Tired with your sexual problems? \nOrder now!\nUse licensed Viagra and Cialis pills from our drug store. Now you are the best, you have perfect sex in your life! That is Online Drug store with quality ED medications!\nClick here to be the best lover in the world!\nYou'll be a sexual giant all night long.\nWith best regards,\nBarbara Pruitt\n \n \nNe potrudilsia dazhe Kak sleduet zamaskirovatsia. Dal-rokty mogut reshit inache, ne soglasilsia Olsen zheltoglazyj. Tolstiak dovolno ulybnulsia veroiatno, tomu, chto predstavilas Vozmozhnost soobshchit chto-to, neizvestnoe drugomu. Naprimer, k takim, kak etot. \nIa ponimaiu, chto eto ne vhodit v tvoi obiazannosti, no ne mog by ty Podskazat. Skotina. Ia slushal ee predelno Vnimatelno, analiziruia kazhdoe slovo, intonaciiu, zhesty. Ty predpochitaesh nochevat pod otkrytym nebom? A u tebia chto, edinstvennyj traktir v etom gorode? Vot teper razgovor ej tochno ne nravilsia. Spohvativshis, Onni podobrala otvisshuiu ot izumleniia Cheliust i nahmurila brovi. Frajden dolozhil mne, chto Dos Plamia, ne bez vashej pomoshchi, pokinul etot Brennyj mir vmeste so svoim gromiloj, nakonec miagko zagovoril shefir, Prodolzhaia dobrodushno ulybatsia. Palcy nekotoroe vremia prodolzhali zhat na Gashetki energoblokov, i uchast shefira razdelili ego stol i terminal GT. Ia obognal tolstiaka i vstal pered nim, zastaviv Ostanovitsia. \nVskore vernulsia Bochonok, molcha zavozilsia riadom. Ona obiasnila, chto so mnoj proizoshlo, a ia, poniav, chto ona dlia Menia sdelala, v otvet razotkrovennichalsia sverh mery. Kto znaet, kuda Svalilsia ia sam, kogda zakonchilas bitva. Kogda ia eto ponial, to medlenno i ostorozhno prizhal ladon k grudi marna, Staraias chrezmernym usiliem ne razdavit emu grudnuiu kletku. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}