{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "Direct2Drive <owner-d2d_cp_announce_list@news.ign.com>", "subject": "Downlaod Great RPGs on Direct2Drive!", "body": "\n\n\nDirect2Drive\n\n\n\n\n\n\n\n\nJune 1st, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNeverwinter Nights 2 - $29.95\nIt takes the player from the tiniest of villages into a sweeping tale of danger and war, chronicling their rise from a peasant to a full-fledged hero of the Realms, defending it against one of the greatest threats of the age...\n \nOblivion + Shivering Isles Bundle - $69.95\nOblivion is the quintessential role-playing game for the next generation and another leap forward in gaming. et Oblivion + the Shivering Isles Expansion together and save $10! \n \nTitan Quest Bundle - $44.95\nDiscover the Courage that Turns Heroes Into Legends. Get Titan Quest and the Immortal Throne Expansion together and save $5!\n\n\n \n \n \n \n \n\n\nVampire: The Masquerade - Bloodlines - $19.95\nYou begin your journey this time in modern day Los Angeles as a newly embraced vampire. By creating you without the consent of your clan's Elders, your sire has violated one of vampire society's most hallowed laws...\n \nJade Empire: Special Edition - $39.95\nJade Empire: Special Edition delivers an incredible story-driven game play experience with stunning high-resolution graphics and controls optimized for the PC gaming experience. \n \nLEISURE SUIT LARRY: MCL-UNCUT AND UNCENSORED - $29.95\nWhen a reality TV dating show comes to campus, Larry decides he's going to revitalize his life by winning the contest and proving once and for all that he can live up to the shining example set by his Old Uncle Larry.\n\n\n \n \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\nArmA: Armed Assault\n$39.95\n6\n\n\nCivilization 4\n$39.95\n\n\n2\n\n\nCompany of Heroes2\n$39.95\n7\n\n\nThe Matrix Online\n$19.99\n\n\n3\n\n\nVampire: The Masquerade - Bloodlines\n$19.95\n8\n\n\nSTALKER: Shadow of Chernobyl\n$39.95\n\n\n4\n\n\nNeverwinter Nights 2\n$29.95\n9\n\n\nTitan Quest Bundle\n$44.95\n\n\n5\n\n\nSupreme Commander\n$39.95\n10\n\n\nTitan Quest\n$19.95\n\n\n\n\n\n\n\n\n\nTo Unsubscribe: Click Here.\n\t\t\t\nYou have received this e-mail because you are a registered user of GameSpy and have opted-in to receive GameSpy email updates concerning new products and services. If you believe you're receiving this e-mail in error or prefer not to receive promotions from GameSpy.com, reply to this message to opt out of future promotional mailings. Our privacy policy is viewable at http://corp.igngamespy.com/privacy.html. You may still receive other e-mails from GameSpy. To update your e-mail address or manage your account, visit GameSpyID.com. It may take up to 10 days for adjustments to your email preferences. If you have questions about this offer or your services, you can reach Customer Service here.\n\t\t\n\t\tYou may mail inquiries to: IGN Entertainment, Inc., 8000 Marina Boulevard, 2nd Floor, Brisbane, CA 94005\nCopyright © IGN Entertainment, Inc. All rights reserved.  \n\n\n\n\n\n\n\n\n\n\n\n\n"}