{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The Nation\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nOn the anniversary of\n  the Columbine school massacre, it is a day of complex mourning. Vigils and\n  moments of silence across the country remembered the lives of the 32 victims\n  of Monday’s tragedy at Virginia Tech – but the observances were\n  haunted by ghosts of what the similar tragedy eight years ago at Columbine\n  high School in Littleton,\n   Colorado. Sharyn Alfonsi will\n  have the story of this day of mourning. \n \nOur chief investigative\n  correspondent Armen Keteyian will continue coverage of how Seung-Hui Cho obtained\n  his weapons.\n \nOne day after embattled\n  Attorney General Alberto Gonzales attempted to explain the firings of eight\n  federal prosecutors to a Senate panel, the White House stepped up to back\n  him. Has he done a “fantastic job,” as a spokesperson said today,\n  or is he about to lose his job? Jim Axelrod will have the latest.\n \nAnd Nancy Cordes will report on the investigation\n  into the pet food contamination scare. The FDA suggests that much of the\n  recalled pet food may have been intentionally spiked with an industrial\n  chemical that would boost their protein content. We’ll take a closer\n  look.\n \nMeanwhile, the stock\n  market is racing toward a new milestone – thanks to strong earnings\n  reports from Internet superstar Google Inc. Anthony Mason will have more.\n \nFinally, Steve Hartman will\n  have a story about a warmhearted man who’s helping get homeless people\n  off the street. He’s drastically improved the lives of many people.\n  How? With massive quantities of hot dogs – really. Join us for his\n  story.\n \nI hope you have a\n  wonderful weekend.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}