{"category": "ham", "to_address": "Pete Cap <peteoutside@yahoo.com>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] RODBC connections w/o specific database", "body": "On Mon, 16 Apr 2007, Pete Cap wrote:\n\n> Folks,\n>\n> I'm writing a gui wrapper around RODBC (having abandoned RMySQL) and \n> some custom analysis scripts.  I'm hoping that I could get some advice.\n>\n> All of my users will have access to a database server.  I am going to \n> limit their access to certain databases--a sizeable warehouse in a SAN, \n> and then smaller storage that they can use for temp files and personal \n> tables.  I want to present these to the user using a tktree widget, \n> rather like you might see in Enterprise Guide, with the top level of \n> each tree being a specific database and branches being tables.\n>\n> Can I get some advice on a good way to accomplish this?\n>\n> Right now I can create and connect to a DSN that does not specify a \n> database.  I suppose that upon connection I could use sqlQuery to get \n> the names of databases and their tables, then use the result to populate \n> the tree.  However, once a table has been selected, would I need to \n> create a new connection (since the existing connection does not specify \n> a database) or could I use the existing one for everything and just \n> specify database and table in my queries?\n\nYou could, but then your tables would all need to accessed via db.table \nnames (assuming your DBMS supports that).  Opening a new connection is \ncheap (and will be cheaper in RODBC 1.2.z) so I would just do that.\n\n>\n> Also, any additional advice on would be appreciated if anyone has any.\n>\n> Thanks,\n>\n> Pete\n>\n>\n> ---------------------------------\n>\n>\n> \t[[alternative HTML version deleted]]\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}