{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"Karl Rosa\" <badging@allpointinspections.com>", "subject": "has currently secured $14 million in financing ", "body": "\n\n\n\n\n\n\n\nBreaking News Alerts!   We ask you to watch and enjoy the ride. \nStocks like this Do Not happen often....We expect big things Monday!\nEXT REME \nMOTORSPORTSSym: ETMO.PKCurrent $0.00065 Day   \n$0.03Just secured $14 million in financing\nEXTR EME Motorsports of California, Inc. Completes Acquisition of Southern \nOffroad Vehicle ServicesJune 27, 2:00 pm ET \nBAKERSFIELD, CA--(MARKET WIRE)--Jun 27, 2007 -- EX \nTREME Motorsports of California, \nInc. (Other OTC:ETMO.PK - News) (\"EXTR EME\" or the \"Company\"), has completed the \nacquisition of Southern Offroad Vehicle Services, LLC (\"SOVS\"), a company \ndedicated to providing financing for customers purchasing off-road vehicles \nThrough this acquisition, EXTR \nEME will not only be able to offer its customers direct \nfinancing of sandcar purchases, but will also be the first sandcar manufacturer \n As previously announced, in exchange for all of the capital stock \nof SOVS, EXTR EME has paid $10,000 in cash and 15 million shares of E \nXTREME common stock. Of \nthe 15 million share of common stock, 10 million will be restricted shares of \ncommon stock and 5 million will be free-trading shares.\nIn the past, EXTREM E required customer down-payments at contract signing and final \npayment upon acceptance of the final vehicle, which required EX TREME to finance the \n12-month or more build-out process through the operating cash flow of the \ncompany. Now, E XTREME will be able to achieve both greater throughput and profit margins \nby shifting its financing costs to the customer. SOVS has currently secured $14 \nmillion in financing for future customers of EXT \nREME, both for direct purchases and for \nleased vehicles. This will provide EXTR \nEME with immediate funding for the build-out of \ncustom sandcars for private customers and \"spec\" vehicles for its dealers.\n\"The acquisition of SOVS provides EX TREME with the capability to deliver direct \nfinancing to our customers at rates comparable to dealers of standard \nover-the-road vehicles,\" commented Alan McCaa, President and CEO of E XTREME Motorsports. \n\"Through this acquisition, we provide what no other sandcar manufacturer in the \nworld is able to claim: in-house financing to all customers. This not only \nensures consistent operating cash flows to EXT \nREME, but incentivizes buyers who might \notherwise defer a purchase to a later date to complete a purchase immediately \nthrough consumer financing.\"\nAbout EXTR EME Motorsports of California, Inc.\nEXTRE ME \nMotorsports of California, Inc., operating under the trade name \"Xtreme \nMotorsports,\" is a manufacturer of custom and production-line sandrails, desert \nand dual sport racecars. Founded in 1983, EXT \nREME's sandcars have been sold to customers \nin England, the United Arab Emirates, Australia, South America and the US. For \nmore information, visit the corporate web site\n \n \n\n"}