{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 15, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESIs \"Alli\" The Holy Grail For Dieters?\nThe first FDA-approved, over-the-counter weight loss pill has hit the shelves of American stores. Dieters are being drawn\n                        in by Alli's claims that it can block fat from being absorbed by the body. But the pill has some potentially messy drawbacks. More...\n• Gaza: War Of Bullets Now A War Of Words\n                     \t\t\t\t\t| Watch• NASA: \"We're In Good Shape\"\n                     \t\t\t\t\t| Watch• Gates Makes Surprise Iraq VisitU.S.1957 Plymouth Unearthed After 50 Years\nAs part of a time capsule sealed in 1957, Tulsa residents buried a Plymouth Belvedere in a vault (designed to withstand a\n                        nuclear attack) to be opened in 2007. They were also generous: they also buried 10 gallons of gas and a case of beer.  More...Watch: Time Capsule Car Unearthed\n• Cops Release Husband In SUV Killings Case\n                     \t\t\t\t\t| Watch• Arrest Made In Baseball Bat Beating Death• Duke DA: I Got \"Carried Away\"\n                     \t\t\t\t\t| Watch• More StoriesWorldPrincess Di's Sons Speak About Tribute\nPrince William and Prince Harry, right, parade in suits and bowler hats with the Combined Cavalry Old Comrades' Association\n                        in Hyde Park, London, on Sunday, May 13, 2007. More...Watch: Princes Remember Diana\n• Muggings Not Terror Worry Algerians• 5 U.S. Troops Killed In Iraq\n                     \t\t\t\t\t| Watch• Russia Probing Alleged U.K. Espionage\n                     \t\t\t\t\t| Watch• More StoriesPoliticsHouse Reaffirms Reforms On Earmarks\nDemocratic and Republican leaders cut a deal to raise the standards of transparency and accountability in the House. The deal\n                        restores a requirement to disclose all member-sponsored projects, including the right to challenge such earmarks.  More...Watch: Buried In The Fine Print\n• Schwarzenegger: Don't Watch Spanish TV• Pure Horserace: A Small Price To Pay\n                     \t\t\t\t\t| Watch• Red Nation, Blue Nation\n                     \t\t\t\t\t| Watch• More StoriesHealthAll About Alli, The Weight Loss Pill\nExperts explain the benefits and side effects of Alli, the over-the-counter diet pill. It's a lower dosage of Xenical, which\n                        requires a prescription. Even though it's not being billed as a magic bullet, many consumers may see it as one anyway. More...\n• Minnesota Sextuplets Struggle to Survive• Army To Beef Up Mental Health Help• Gastric Bypass? Bypass The Booze• More StoriesSciTechNASA: \"We're In Good Shape\"\nNASA says it has no plans to unstaff the international space station if a failed computer system operated by the agency's\n                        Russian partners can't be restored. Two astronauts from the space shuttle Atlantis began a spacewalk to fix a suspect connector. More...Watch: Fixing Space Station Glitch\n• New Drug Can Help Fat Fido Shed Pounds\n                     \t\t\t\t\t| Watch• Second Rare Shark Dies In Aquarium Mystery\n                     \t\t\t\t\t| Watch• Texas Nabs Predators On MySpace \n                     \t\t\t\t\t| Watch• More StoriesBusinessHow To Cut Your Health Care Costs\nPaying cash, shopping around for medical services and looking for prescription bargains can help you cut your health care\n                        costs. More...\n• Cheap Gas Gets The Job Done\n                     \t\t\t\t\t| Watch• Final Tribute For Cream Of Wheat Man• 27,000 Ford Workers Take Buyouts• More StoriesEntertainment50 Cent Not Testifying At Iverson Trial\nRapper 50 Cent will not testify at Allen Iverson's assault trial this month, as he only knows the security guards accused\n                        and was not involved in the altercation.\n                         More...Watch: 50 Cent On His Role In 'Brave'\n• Bob Barker Says \"Goodbye Everybody\"\n                     \t\t\t\t\t| Watch• This Week: Forgive And Forget\n                     \t\t\t\t\t| Watch• Princess Di's Sons Speak About Tribute\n                     \t\t\t\t\t| Watch• More StoriesOpinionRomney: Stem-Cell Solution Is In Reach\nRepublican presidential candidate Mitt Romney, writing in the National Review Online, says partisans should\n                        quit playing politics and support new ways of creating embryonic stem cells that avoid ethical hurdles. More...\n• Immigration Bill's Ugly Side\n                     \t\t\t\t\t| Watch• Bush And Democracy: Talk But Little Action\n                     \t\t\t\t\t| Watch• Sudan's Broken Promises• More StoriesCBS NEWS BROADCASTSThe Early Show: Princess Di's Sons Speak About Tribute\nPrince William and Prince Harry, right, parade in suits and bowler hats with the Combined Cavalry Old Comrades' Association\n                        in Hyde Park, London, on Sunday, May 13, 2007. More...Watch: Princes Remember Diana\n• EARLY SHOW: Cheap Gas Gets The Job Done\n                     \t\t\t\t\t| Watch• EARLY SHOW: New Drug Can Help Fat Fido Shed Pounds\n                     \t\t\t\t\t| Watch• EARLY SHOW: Simple Fixes For Everyday Annoyances\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nImmigration Bill Gains SupportThe once-stalled immigration reform bill will return to the Senate floor  after some tweaking and more pushing by its chief\n                                    supporter, President Bush. Susan Roberts reports.\nTOP VIDEOS\nPolar Bear A Cash Cow\nSeligmann Testifies Vs. Nifong\nBoat Versus Bridge\nPalestine Government Dissolved\nTime Capsule Car Unearthed\nDiana's Sons Defend Their Mom\nForeign Minister On Violence\nBob Barker Says Goodbye\nNifong: Politics Kept Out\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMorley Safer talks to long-driving, hard-drinking golfer John Daly. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMurder On Lockhart Road:A mother and two kids are murdered. There are bizarre clues, eyewitnesses, blood drops,\n                           and a killer with a foot fetish. Saturday, 9 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}