{"category": "ham", "to_address": "r-packages@stat.math.ethz.ch", "from_address": "\"hadley wickham\" <h.wickham@gmail.com>", "subject": "[R] [R-pkgs] Beta version of ggplot2", "body": "Dear all,\n\nI am pleased to announce the new beta release of ggplot2.  ggplot2 is\na plotting system for R, based on the grammar of graphics, which tries\nto take the good parts of base and lattice graphics and none of the\nbad parts.  It takes of many of the fiddly details that make plotting\na hassle (like drawing legends) as well as providing a powerful model\nof graphics that makes it easy to produce complex multi-layered\ngraphics.\n\nYou can install ggplot2 from CRAN with the following code:\ninstall.packages(\"ggplot2\", dep=TRUE)\n\nThere have been a lot of changes to the syntax since the last version\nof ggplot and I have renamed the package to ggplot2, so that you can\ncontinue to use your existing code while you transition to the new\nsystem.\n\nAs part of the release, I am working on a radically improved\ndocumentation system, currently available at\nhttp://had.co.nz/ggplot2/.  While I'm still working on the textual\nexplanations, I have mostly completed the examples, which are\ndisplayed with both code and output.  There are over 480 example\ngraphics, so I hope you should be able to find an example\ndemonstrating whatever you need.  Any comments on the content and\ndisplay would be gratefully received.\n\nIn the next few days I will be adding the first chapters of the ggplot\nbook, which will provide a more systematic introduction to ggplot, the\ntheory behind it and more examples of its use.  The ggplot book will\nbe published with Springer, hopefully in Summer 2008.\n\nThe latest version of ggplot now provides a complete implementation of\nthe grammar of graphics, including new support for coordinate systems,\nposition adjustment (dodging, stacking and jittering).\n\nThis is a beta release, so there are still bugs in the code, and many\nsmall aesthetic tweaks to be made.  If you encounter something that\ndoesn't work, doesn't make sense or you think could be improved,\nplease don't hesitate to contact me.\n\nAgain, you can find out more, and see hundreds of example graphics at\nhttp://had.co.nz/ggplot2/.\n\nHadley\n\nPS. If you are interested in learning more in person, have at look at\nthe courses available at http://lookingatdata.com.\n\n_______________________________________________\nR-packages mailing list\nR-packages@stat.math.ethz.ch\nhttps://stat.ethz.ch/mailman/listinfo/r-packages\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}