{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: DPL's view of debian-legal (was: Debian Trademarks Summary)", "body": "Anthony Towns  wrote: [...]\n> Gosh, what fun it is to trade pointless insults on a mailing list.\n\nI feared that was your view.  Roll on list-admins.\n\n[...]\n> This was, of course, more than you ever did to help define a trademark\n> policy, which consisted of complaining that nobody was doing anything,\n> then not providing any support when anyone was doing anything.\n\nTTBOMK, I've complained that it's taking a long time to progress, not\nthat nobody was doing anything.\n\nI offered support to at least two of the drafters, but drafters seem to go\nAWOL after the first public draft (or one even seems to have gone before).\nThere has been a succession of attempts to create a policy, in different\nforums and requested by different people - I now know of five unfinished\nattempts in the last three years and I suspect there were probably more\nbefore that.  Did the drafters know of those that went before?  Maybe they\ndidn't get the briefing or support they needed from the project leaders?\n\nSo I suggest the problem is not in defining or DD support, but in\nmanagement or communication.  Now I'm trying to connect the various\nlists that should be communicating about this (spi-board, spi-trademark,\ndebian-legal, debian-project among them) to help this complete, but I'm\nvery cautious about treading on toes, because I know I hold a minority\nview on this and I know how frustrating it is for an interested party\nto be mistakenly excluded from this sort of process.\n\nI'm well aware that my views on trademarks (available to all, harmable\nby none) are not the consensus view, so I probably shouldn't draft this\npolicy.  Another reason is my bloody terrible record on GR drafting in\ngeneral, although I think that's partly an artefact of something else.\n\nWhy no elected leader yet has led this thing that sorely needs leadership\nis beyond me.  Some leaders who should have been managing this drafting\nseemed keener on money than this irreplaceable asset.\n\nHope that explains,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}