{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Joana Ramos <jdr@ramoslink.info>", "subject": "[Ip-health] The future of the medical bill (re:: Novartis cases in India)", "body": "\nhttp://www.tmcnet.com/usubmit/2007/04/15/2509461.htm\n\nApril 15, 2007\n\n\n\nThe future of the medical bill\n(The Times of India Via Thomson Dialog NewsEdge)\n\nLaxman Bhaskar's face looks pale, as though an inner glow has been\nturned off. He is a grim man in his thirties who is right now in the\nalmost silent workshop of the Cancer Patients Aid Association (CPAA). He\nis printing a design on a cloth bag, a small favour to an organisation\nthat is keeping him alive.\n\n\nCost containment for communications vendors and their carrier customers\ncan be achieved on two fronts. Click here to find out what they are and\nhow to streamline the development and maintenance costs associated with\nbuilding the product.\nClick here to learn more about DSP modules and how they power multimedia\nmessaging services for mobile networks and how to decrease the\ndevelopment and maintenance costs associated with building the product.\nClick here to learn more about DSP modules and how they power multimedia\nmessaging services for mobile networks and how to decrease the\ndevelopment and maintenance costs associated with building the product.\n\n\nBhaskar has a rare cancer - chronic myeloid leukaemia (CML). About\n30,000 Indians are diagnosed with the disease every year. The drugs that\nCPAA gives him cost Rs 10,000 a month. And that's cheap. He takes the\ngeneric versions, the copies, made by Indian companies. The original,\nusually called Glivec, owned by Swiss pharma giant, Novartis, would have\ncost him over Rs 1,20,000 a month.\n\nNovartis is at the moment in a battle with the CPAA and, in a way, the\nIndian government, to win the exclusive marketing rights for Glivec\nwhich will result in local companies being ordered to stop making\ncheaper copies of the drug.\n\nNovartis says that it invented the base compound (imatinib) and deserves\nthe exclusive rights to market it. The appeal of Novartis, till recently\nheard by the Madras High Court, has now been transferred to the newly\ncreated Intellectual Property Appellate Board (IPAB) which is expected\nto pass a verdict soon.\n\nAt stake is a very complex issue, almost philosophical. That the poor\nhave a right to live is a truth that has no meaning if there are no\nlife-saving drugs in the first place. And it is not the goodness of\nactivists that cures diseases, but the commercial motives of big pharma\ncompanies like Novartis which spawn multi-million dollar research.\n\nIf Novartis wins the battle for Glivec, Indian generics, whom the Swiss\ncompany's CEO Daniel Vasella had once described as \"thieves\", will be\nwiped out and not only a cancer cure but also HIV, TB and other\ntreatments will become many times more expensive. The ramifications of\nthe Glivec battle is so important to the commerce of cure and the very\nmeaning of a poor person's life in a capitalistic world, that\njournalists from the first world, especially Europe, have been landing\nin the country in the last few weeks.\n\nAt the heart of the battle, as always, is a technicality. It is called,\nwithout affection by Novartis, 3d. It is a section in the Indian Patents\nAct. The base compound of Glivec was invented in 1993. It was only two\nyears later that India joined the World Trade Organisation.\n\nIndia said that over the next 10 years, as it moved towards a patents\nregime, it would consider fresh patent applications of inventions that\ndid not exist before 1995. So the original base compound of Glivec did\nnot qualify, but Novartis filed for patent for a slight variation, a\nbeta crystal form.\n\nIn 2003, Novartis was granted the exclusive marketing rights for that.\nBut when the Indian Patent Law came into effect in 2005, there was a\nclause in section 3d that implied that cosmetic variations, like the\nbeta crystal form of imatinib, cannot be considered. So, in 2006,\nNovartis lost its exclusive rights and the Indian generics who were\ndebarred from making copies rose again.\n\nNovartis claims that it is only fighting for its rights and not for\nmoney. A spokesperson of the company says that its Glivec International\nPatient Assistance program (GIPAP) has given the drug free to 8,000\npatients in India. \"Ninety-nine percent of the Indians who have been\ntaking Glivec, have been getting it free.\"\n\nIt is a claim that makes Y K Sapru, the gritty chief of CPAA, a former\npharma executive himself, laugh. \"What they don't tell you is that they\ngive the drug to patients free for one or two months, that's all.\nNovartis is not here for social service. It is here to make money. Last\nyear, Glivec made $2.6 billion worldwide. They want to make more money.\nAnd this argument that they deserve to earn because they invested in the\nresearch of the drug is not very good. Fifty percent of the funding came\nfrom the US government, 30% from a US NGO and 10% from the Oregon Health\nand Science Institute. Only 10% came from Novartis.\"(Novartis did not\nrespond when asked for a confirmation.)\n\nA few months ago, Novartis CEO Daniel Vasella is reported to have said\nthat Sapru was being financed by Indian pharma companies. Sapru filed a\ndefamation suit for half a million dollars. Vasella eventually claimed\nthat he never made the statements. It is also said that Sapru is angry\nbecause Novartis did not choose CPAA to run its free treatment programme\nbut instead chose an international cancer charity organisation called\nMax Foundation.\n\n\"It's true that we were in talks with Novartis and things didn't work\nout between us, but that's all there is to it,\"Sapru says. He accuses\nNovartis of using Max Foundation, \"to promote both Glivec and to collect\nclinical trial data. This has been confirmed by the founder of Max\nFoundation, Pedro Rivarola.\"Rivarola's son, Max had died of cancer and\nso he was emotionally involved in the charity.\n\nA letter written by Rivarola to Sapru is part of the legal documents in\nthe Glivec case. Rivarola says in the letter, \"I believed (being truly\nna?ve) in the good will of Novartis The relationship changed into a\ndaily struggle to keep my beloved foundation independent from Novartis'\ninsatiable pawsThe last drop in the goblet made me leave. It was the\nsituation in Thailand where Novartis demanded that patients had to buy\nthree months of supply before qualifying for the program; It's time to\nstop this as the name of my son is being trashed and abused just for\nmarketing reasons.\"\n\nThe battle beween CPAA and Novartis also has racial overtones. It is\nbeing unofficially viewed as MNC vs India. Anand Grover, a lawyer\nrepresenting CPAA against Novartis says, \"It's time the whites know that\nthey cannot walk into this country and expect us to be intimidated as\nbefore. We know how to fight.\"He is optimistic that the future of Indian\ngenerics is not in jeopardy. \"But don't forget, they too are in it for\nthe money.\"\n\nSapru says that the production cost of a Glivec generic is about Rs\n1,000. \"Indian companies are selling it at 10 times the price. So, they\nare making huge profits. But, at least, they are cheaper than Glivec.\"DG\nShah, secretary general of the Indian Pharmaceutical Alliance, says\nmatter-of-factly, \"It's true, we are not here for charity.\"Indian pharma\nis valued at over $ 5 billion, 65% of this coming from the export of\ngeneric drugs to developing.\n\n\"These revenues will help us invest in research,\"DG Shah says, \"and in\nthe coming years, India will be known as not just the maker of cheap\ncopies but as a research hub which makes its own blockbuster drugs.\"But\nthe future of generics and how the poor will buy their right to stay\nalive is still not clear.\n\nCopyright 2007 The Times of India. Bennett, Coleman & Co Ltd. Source :\nFinancial Times Information Limited\n\n--\nJoana Ramos, MSW\nCancer Resources & Advocacy\nSeattle WA USA\nTel. +1-206-229-2420\nhttp://ramoslink.info/\nwww.cancersurvivorsproject.org\nwww.healthyskepticism.org\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}