{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"CNN Political Ticker\" <politicalticker@cnn.com>", "subject": "CNN Political Ticker AM, Monday, May 14, 2007", "body": "For the latest, breaking political news, check for updates throughout the day on the CNN Political Ticker\nhttp://www.cnn.com/ticker. All politics, all the time.\n\nCompiled by Stephen Bach (stephen.bach@cnn.com)\nCNN Washington Bureau\n\nMaking news today...\n\n* President Bush \"approved direct U.S. talks with Iran, a country he denounced in 2002 as part of the 'axis of evil,'\nin an effort to quell the violence in Iraq.  The U.S. ambassador to Iraq, Ryan Crocker, will meet Iranian officials in\nBaghdad within a few weeks.\" (Bloomberg)\n\nThe talks \"would be the highest-level negotiations acknowledged between the two countries in recent years.\" (Los\nAngeles Times)\n\n* \"We didn't expect him to know the score so well... He was not shy about conducting at all. He conducted with a great\ndeal of panache.\" - Virginia Symphony Music Director JoAnn Falletta, on this:\nhttp://www.wral.com/news/political/image/1410397/?img_list=1410397%2C1410931%2C1410932&ref_id=1411386 (AP)\n\n* Sen. Chuck Hagel (R-NE) yesterday \"hinted at the possibility of running for the White House as an independent, saying\na credible third party ticket would be beneficial to the country.\" (The Hill)\n\n* A New York Daily News poll finds NYC voters prefer a President Bloomberg to a President Giuliani.  \"City voters\noverwhelmingly chose Mayor Mike over America's Mayor as their pick for President, 46% to 29%.\" (NYDN)\n\n* \"Tommy Thompson cited a dead hearing aid and an urgent need to use the bathroom in explaining on Saturday why he said\nat a GOP presidential debate that an employer should be allowed to fire a gay worker.\" (AP)\n\n* And the Clinton campaign is set to unveil a gr8 way 2 reach out 2 to the masses.  Find out how in Hot Topics below!\n\nPresident's Schedule:\n\n* No public events.\n\nAlso on the Political Radar:\n\n* First Lady Laura Bush participates in a 10:25 am ET roundtable on Women and Heart Disease with \"The Heart Truth\" at\nGeorge Washington University Hospital.\n\n* Sen. Barack Obama (D-IL) holds an 11:15 am ET presser with local officials in Teterboro, NJ. Later, Obama holds a\n3:30 pm ET AFL-CIO town hall meeting in Trenton, NJ.\n\n* NY Gov. Eliot Spitzer and other \"prominent NY leaders\" will endorse Hillary Clinton at the State Capitol in Albany at\n11:30 am ET.\n\n* CBS' Bob Schieffer and his band \"Honky Tonk Confidential\" face off against Tony Snow's \"Beats Workin'\" at the\nNational Press Club's \"Honky Tonk Meets the Wonk\" battle of the bands, 7 pm ET.\n\n* The SC Republican Party holds its annual Silver Elephant Dinner at the Columbia Metropolitan Convention Center.\n\n* The Senate Radio-Television Correspondents' Gallery Daybook: http://www.senate.gov/galleries/radiotv/list.htm\n\n* The House Radio-Television Correspondents' Gallery Daybook: http://radiotv.house.gov/news-events.aspx\n\n=================================================================\nPolitical Hot Topics\n(Today's top political stories from news organizations across the country)\n\nBUSH APPROVES DIRECT TALKS WITH IRAN: President George W. Bush approved direct U.S. talks with Iran, a country he\ndenounced in 2002 as part of the \"axis of evil,\" in an effort to quell the violence in Iraq. The U.S. ambassador to\nIraq, Ryan Crocker, will meet Iranian officials in Baghdad within a few weeks, Zombie Johndroe, spokesman for the White\nHouse National Security Council, said yesterday. Talks with Iran represent a shift for the administration, which until\nrecently resisted calls for direct discussions with Iraq's eastern neighbor. The announcement yesterday came as Barham\nSaleh, Iraq's deputy prime minister, told CNN television three U.S. soldiers missing since their eight-man patrol was\nambushed on May 12 may be held by the al-Qaeda terrorist network. Bloomberg: Bush, Aiming to Quell Iraq Violence, Plans\nIran Talks http://www.bloomberg.com/apps/news?pid=washingtonstory&sid=a4sqCUbwcwlM\n\nDOCS SUPPORT CHARGE WOLFOWITZ WAS \"AWARE OF ENGAGING IN FAVORITISM\": Documents circulating at the World Bank suggest\nthat Paul D. Wolfowitz, the bank president, understood that his role in ordering a pay increase and promotion for his\ncompanion in 2005 might be seen as a conflict of interest but insisted on proceeding anyway, bank officials who are\ncritics of Mr. Wolfowitz said Sunday. The officials, speaking on the eve of a fateful week for Mr. Wolfowitz's efforts\nto remain head of the bank, said testimony and notes that Xavier Coll, vice president of human resources, provided to a\nbank committee investigating the matter supported the charge that Mr. Wolfowitz was aware of engaging in favoritism.\nOne said the documents were \"devastating\" to Mr. Wolfowitz's case. New York Times: Bank Files May Undercut Wolfowitz,\nCritics Say http://www.nytimes.com/2007/05/14/washington/14wolfowitz.html\n\nAS ABRAMOFF OUTRAGE WANES, LAWMAKERS QUESTION LOBBYING REFORM: As House Democrats tackle a lobbying reform bill that\nthey pledged to adopt on the midterm campaign trail, reformers say that a number of the members are privately\nquestioning its necessity after all. Public outrage over the Jack Abramoff scandal has waned, and the public seems to\nhave lost interest now that it has turned Republicans out. In response, the great momentum the House had in January\nwhen it banned gifts and corporate travel from lobbyists seems to have waned as well. Cleaning the \"culture of\ncorruption\" lost priority to other issues, such as the war in Iraq. The Politico: Dems losing momentum on lobby reform\nhttp://www.politico.com/news/stories/0507/3966.html\n\n\"LAX\" PROSECUTION OF VOTER FRAUD \"DROVE DISMISSALS\" OF ATTORNEYS: Nearly half the U.S. attorneys slated for removal by\nthe administration last year were targets of Republican complaints that they were lax on voter fraud, including efforts\nby presidential adviser Karl Rove to encourage more prosecutions of election- law violations, according to new\ndocuments and interviews. Of the 12 U.S. attorneys known to have been dismissed or considered for removal last year,\nfive were identified by Rove or other administration officials as working in districts that were trouble spots for\nvoter fraud -- Kansas City, Mo.; Milwaukee; New Mexico; Nevada; and Washington state. Four of the five prosecutors in\nthose districts were dismissed. Washington Post: Voter-Fraud Complaints by GOP Drove Dismissals\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/05/13/AR2007051301106.html\n\nSOME SEE GIULIANI'S 9/11 LEADERSHIP \"AS HAVING COME WITH A HUMAN COST\": Anyone who watched Rudolph W. Giuliani preside\nover ground zero in the days after 9/11 glimpsed elements of his strength: decisiveness, determination,\nself-confidence. Those qualities were also on display over the months he directed the cleanup of the collapsed World\nTrade Center. But today, with evidence that thousands of people who worked at ground zero have become sick, many regard\nMr. Giuliani's triumph of leadership as having come with a human cost. An examination of Mr. Giuliani's handling of the\nextraordinary recovery operation during his last months in office shows that he seized control and largely limited the\ninfluence of experienced federal agencies. In doing that, according to some experts and many of those who worked in the\ntrade center's ruins, Mr. Giuliani might have allowed his sense of purpose to trump caution in the rush to prove that\nhis city was not crippled by the attack. New York Times: Ground Zero Illnesses Clouding Giuliani's Legacy\nhttp://www.nytimes.com/2007/05/14/nyregion/14giuliani.html\n\nGIULIANI EXPLAINS ABORTION POSITION: Former New York mayor Rudolph Giuliani, who leads the field of Republican\npresidential candidates in national polls, said that he supports a woman's right to an abortion, then added that he\n\"might be able\" to appoint antiabortion justices to the Supreme Court. Giuliani said he hates abortion and would advise\nagainst it. \"That's a principle I've held forever, and I'll hold it forever,\" he said on \"Fox News Sunday.\" But he\nadded that he does not think he should impose his view on women. The former U.S. attorney said his judicial priority is\nnot a \"litmus test\" on abortion, but rather appointing \"strict constructionist judges\" who would hew to the original\nmeaning of the language in the Constitution. Washington Post: A Roundup of the Buzz From the Sunday Talk Shows\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/05/13/AR2007051301083.html\n\nNYC'ERS PREFER BLOOMBERG: Michael Bloomberg is not only a better mayor of New York than Rudy Giuliani - he'd make a\nbetter President, too. That's the result of a Daily News poll released today that asked the voters who know best - New\nYorkers - which man belongs in the White House. City voters overwhelmingly chose Mayor Mike over America's Mayor as\ntheir pick for President, 46% to 29%. \"I feel in my heart Bloomberg is a better man,\" said Jaen Garcia, 53, of\nHighbridge, the Bronx. Bloomberg insists he's not running for President, even though he has dropped more than a few\ntantalizing clues, including traveling around the country, pushing national policy changes and reviving his Web site.\nNew York Daily News: Bloomy tops Rudy in battle of the titans\nhttp://www.nydailynews.com/news/2007/05/14/2007-05-14_bloomy_tops_rudy_in_battle_of_the_titans-2.html\n\nINDEPENDENT HAGEL? Nebraska Republican Sen. Chuck Hagel on Sunday hinted at the possibility of running for the White\nHouse as an independent, saying a credible third party ticket would be beneficial to the country. \"I am not happy with\nthe Republican Party today,\" Hagel said, adding that the party is not what it was when he joined. \"It's been hijacked\nby a group of single-minded, almost isolationist insulationists, power-projectors...\" The senator, who has most notably\nstrayed from his party and President Bush on the Iraq war, said he would make up his mind about whether to run by the\nend of the summer. Hagel met recently with New York mayor Michael Bloomberg, who some say is also weighing an\nindependent bid for the presidency. The senator said no deals were made at the meeting but, in an interview Sunday with\nCBS's \"Face the Nation,\" he expressed admiration for Bloomberg. The Hill: Hagel hints at independent White House bid\nhttp://thehill.com/leading-the-news/hagel-hints-at-independent-white-house-bid-2007-05-13.html\n\nFRED THOMPSON \"RIGHT ON THE ISSUES\" FOR CHRISTIAN CONSERVATIVES: Several leading Christian conservatives say they will\nrally to former Sen. Fred Thompson, who they expect to announce \"in a matter of weeks\" that he will seek the Republican\nnomination for president next year. \"It's not 'if' but 'when,' he will announce,\" one Protestant evangelical leader\nsays of the behind-the-scenes maneuvering for position in the 2008 race. A prominent Roman Catholic social conservative\nsays the three Republicans who have raised the most money and have led the polls -- former New York Mayor Rudolph W.\nGiuliani, Arizona Sen. John McCain and former Massachusetts Gov. Mitt Romney -- fall short of social conservatives'\nexpectations, but Mr. Thompson doesn't. \"He's right on the issues... He's better than all of the above.\" Both the\nProtestant and Catholic activist, like other Christian conservatives, spoke to The Times on the condition of anonymity.\nWashington Times: Christian conservatives pledge support for '08 Thompson bid\nhttp://www.washingtontimes.com/national/20070514-124527-5197r.htm\n\nTOMMY THOMPSON CONTINUES TO APOLOGIZE FOR GAY WORKER GAFFE: Tommy Thompson cited a dead hearing aid and an urgent need\nto use the bathroom in explaining on Saturday why he said at a GOP presidential debate that an employer should be\nallowed to fire a gay worker. Speaking to reporters after giving an address at the state GOP convention, Thompson also\nsaid he was suffering from the flu and bronchitis and had been admitted to a hospital emergency room three days prior\nto the May 3 debate. \"Nobody knows that,\" Thompson said. \"I've been very sick. ... I was very sick the day of the\ndebate. I had all of the problems with the flu and bronchitis that you have, including running to the bathroom. I was\njust hanging on. I could not wait until the debate got off so I could go to the bathroom.\" AP via Yahoo! News: Thompson\noffers apology on gay comment http://news.yahoo.com/s/ap/20070512/ap_on_el_pr/tommy_thompson2008\n\nOBAMA \"RELUCTANT\" TO ASK FOR USSS PROTECTION: Democrat Barack Obama said Sunday he was reluctant to ask for Secret\nService protection this early in the 2008 presidential race. \"I'm not an entourage guy. You know, up until recently, I\nwas still taking my wife Michelle's grocery list and going to the grocery store once in awhile,\" the Illinois senator\nsaid. Obama, who is black, acknowledged that some of the threats against him were racially motivated. \"You know, I\ndon't spend a lot of time thinking about it or considering the details of this, but just to broaden the issue, are\nthere people who would be troubled with an African-American president? Yes,\" he said. \"Are there folks who might not\nvote for me because I'm African-American? No doubt.\" AP via Yahoo! News: Obama downplays campaign's racial factor\nhttp://news.yahoo.com/s/ap/20070514/ap_on_el_pr/on_the2008_trail\n\nOBAMA WOULD REPEAL BUSH'S TAX CUTS FOR THE RICHEST: If elected president, Senator Barack Obama said Sunday, he would\nseek to repeal President Bush's tax cuts for the wealthiest Americans and use the money to pay for health care, but he\ndid not suggest he would raise other taxes to pay for expanded services. Mr. Obama, an Illinois Democrat seeking his\nparty's presidential nomination, said in a television interview broadcast Sunday that he supported \"rolling back the\nBush tax cuts on the top 1 percent of people who don't need it.\" He did not endorse a broader plan to raise taxes on\nthe affluent that has been proposed by John Edwards, one of Mr. Obama's rivals for the nomination. New York Times:\nObama Says He'd Roll Back Tax Cuts for the Wealthiest http://www.nytimes.com/2007/05/14/us/politics/14talk.html\n\nFOR CHICAGO'S PRITZKERS, A FAMILY DIVIDED: As sister and brother, Penny Pritzker and Jay Robert \"J.B.\" Pritzker have\nfought over everything from toys to how to divide a family fortune worth billions. Now they are going head-to-head in\npolitics, with the Democratic presidential nomination as their battleground. One is leading the fundraising for Sen.\nBarack Obama, while the other has a new alliance with Sen. Hillary Rodham Clinton. In an interview Sunday, J.B.\nPritzker said he would become the national chairman of Citizens for Hillary, a new campaign initiative that will be\ncharged with grass-roots outreach, fundraising and policy matters. Until now, the younger Pritzker had stood on the\nsidelines of the presidential campaign, not drawing attention from his older sister, who is Obama's national finance\nchairwoman. Chicago Tribune: Her money is on Obama. His? Clinton.\nhttp://www.chicagotribune.com/news/nationworld/chi-0705130653may14,1,540339.story\n\nCLINTON WILL TEXT-MESSAGE SUPPORTERS: Hillary Rodham Clinton is taking her campaign high-tech - sending text messages\nto her supporters starting today. Clinton will unveil her mobile-to-mobile text-messaging push on the steps of the\nstate Capitol during her noon endorsement rally with Gov. Spitzer, campaign aides told The Post. Clinton's\ntext-messaging initiative targets the 230 million American cellphone users - a sign the campaign is hunting for every\npossible vote in her bitter battle with rival Sen. Barack Obama. New York Post: HILL'S MESSAGE AIMED AT TEXTERS\nhttp://www.nypost.com/seven/05142007/news/nationalnews/hills_message_aimed_at_texters_nationalnews_ian_bishop.htm\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings go to\nhttp://audience.cnn.com/services/cnn/memberservices/member_auth.jsp?url=http%3A%2F%2Faudience.cnn.com%2Fservices%2Fcnn%2Fmemberservices%2Fregwall%2Fmember_profile.jsp%3Fsource%3Dcnn\n\nTo unsubscribe from the CNN Political Ticker list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=morninggrind\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n(c)2007 Cable News Network.\nA Time Warner Company.\nAll Rights Reserved.\n\n"}