{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "This weekend on BBC Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBORIS BECKER AT THE WIMBLEDON CHAMPIONSHIPS\nIt's great to be back commentating at Wimbledon after missing last year to work on the World Cup in my homeland, Germany.\n\n\nA lot has been made of the outfits that I've been wearing this week. \n\n\nI have been kitted out with some very fetching designs as I'm fronting a campaign for a well-known clothing manufacturer at Wimbledon.\n\n\nI've had no input into the design of them - I know my limitations and they are the experts!\n\n\nI wish a few of my former colleagues would go for a makeover.\n\n\nThey've got to realise that they are no longer 25 and their playing days are over. \n\n\nI'm not naming any names, but they know who they are!\n\n\nOne person exempt from this is Sue Barker. \n\n\nHer dress sense is excellent and she gets better every year - like a fine wine.\n\n\nOnto the tennis, and four-time champion Roger Federer is the clear-cut favourite. \n\n\nIt's not going to be a walk in the park for him as there are a couple of young players that are coming on now, headed of course by Rafael Nadal.\n\n\nThe women's singles is far more open than the men's. \n\n\nJustine Henin has just won the French Open and definitely has a strong chance of winning here.\n\n\nShe lost in the final to Ameile Mauresmo last year, but the defending champ hasn't been fully fit for the last couple of months so Henin could get her revenge. \n\n\nBut then there is Serena Williams and Maria Sharapova as well - it really is so open and anyone could win it.\n\n\nEnjoy the rest of the Championships,\n\n\nBoris\n\n\nBoris Becker and John McEnroe, who each won three Wimbledon men's singles titles, are BBC TV's main pundits at this year's championships.\n\n\n\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nWIMBLEDON\n bbc.co.uk/tennis\nSaturday\n0600-0700 BST, BBC ONE; 1200-1255, BBC TWO; 1235-1720, BBC ONE; 1400-2030 BBC TWO; 2230-2330, BBC TWO.\n Live action from up to five courts is available from 1150 BST on BBCi and the BBC Sport website, with uninterrupted coverage on Radio Five Live from 1200.\nSunday\nYesterday at Wimbledon: 0600-0700, BBC ONE.\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\tLive action from up to five courts is available from 1150 BST on BBCi and the BBC Sport website, with uninterrupted coverage on Radio Five Live from 1200.\n\t\t\t\t\t\n\n\n\n\n\nMOTOGP\n bbc.co.uk/motorbikes\nSaturday\nMotoGP (Assen): 1255-1400, BBC TWO and BBC Sport website; 125cc and 250cc races live, 0945, BBCi and BBC Sport website.\n\n\n\n\n\n\nMORE SPORT ON THE BBC\n bbc.co.uk/tvandradio\nSaturday\nFormula One: French Grand Prix qualifying (0955-1100 & 1255-1400, Radio Five Live Sports Extra/online).\nSunday\nCricket: England v West Indies (1030-1900, Radio Five Live Sports Extra/BBCi/online); Rugby League: Super League Show (1300-1300, BBC North and BBC Sport website); Formula One: French Grand Prix (1300, Radio Five Live/online); Rugby league commentary (1515, Radio Five Live/online); Show jumping from Hickstead (1400-1705, BBC TWO).\n\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tWimbledon coverage\n Our Executive Producer answers your feedback\n\t\t\t\t\t\n\t\t\t\t\t\tWin Wimbledon tickets\n Your chance to win two tickets to the men's final\n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}