{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@speedy.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "prepotency: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Wednesday, April 25, 2007\nprepotency \\pree-POTE-n-see\\, noun:\n1. The quality or condition of having superior power, influence, or force; predominance.\n2. (Biology) The capacity, on the part of one of the parents, as compared with the other, to transmit more than his or her own share of characteristics to their offspring.\nThe awesome prepotency of this smokescape is no illusion, for this is an epicentre of power, oil capital of the Western world and the most industrialised corner of the United States. -- \"Dark heart of the American dream\", The Observer, June 16, 2002\nThough Sir Tristram lost his record, his prepotency was reinforced at the Doomben races as three of the big race winners carry his blood. -- \"Sir Tristram loses record\", Evening Post (Wellington, New Zealand), May 29, 2001\nThese several remarks are apparently applicable to animals; but the subject is here much complicated, partly owing to the existence of secondary sexual characters; but more especially owing to prepotency in transmitting likeness running more strongly in one sex than in the other, both when one species is crossed with another, and when one variety is crossed with another variety. -- Charles Darwin, The Origin of Species\nPrepotency is from Latin praepotentia, from prae-, \"before\" + potentia, \"power,\" from potens, \"able, powerful,\" present participle of posse, \"to be able.\"\nDictionary.com Entry and Pronunciation for prepotency\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9420216-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}