{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Cody_Hamilton@Edwards.com", "subject": "Re: [R] \"R is not a validated software package..\"", "body": "\nAs I read 21 CFR 11, the regulation deals more with ensuring the security\nof the electronic health record itself. Thus, it seemed to me that so long\nas the software (SAS, R, Splus, etc.) could not alter the data base in any\nway then you're fine (this may be naive, but that's how I understood it).\nThe 'software validation' referred to in the document seems to be concerned\nwith software that is directly related to the device (i.e. software that is\npart of the functionality of the device). How on earth could you really\nvalidate every process that a stat software package is capable of anyway?\nIt seems to me that we would be better off focusing our attention on the\nquality of the programming/data manipulation rather than on the 'validation\nof the software' (which in terms of verifying its complete functionality\nisn't possible anyway). I'm also curious that the open source (i.e.\nnon-black-box) nature of R hasn't struck more of a chord with regulatory\nbodies.\n\nI tried to make the case above to our software quality people, but they\ninsisted on a full OQ/IQ/PQ plan (which I'm in the process of drafting -\npossibly my most boring task ever). In addition, my boss insisted on using\nSplus instead of R because I couldn't convince him that R would be\nacceptable (even though the OQ/IQ/PQ requirements would have been the same\nand R would have saved money). That said, I would have had to write new\nOQ/IQ/PQ plans every time there was a new version of R available (ouch). I\nhave no complaints with regards to Splus, but R would have been free.\n\nOne last thought to add to Bert's - I think one other thing that is holding\nup the spread of S to the pharma/device companies is the availability of S\nprogrammers (SAS programmers are plentiful). I tried to get 'has experience\nin S' added to our next job opening, but my boss insisted that we would\nnever find a person with experience in SAS and S. I countered by asking if\nwe could just ask for S experience (and drop the SAS requirement), but he\ngave me a dirty look. :)\n\nCody Hamilton, PhD\nEdwards Lifesciences\n\t[[alternative HTML version deleted]]\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}