{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "bioinfonews@pt.lu", "subject": "[R] How to add elements to a table", "body": "Hi,\n\nI've been using R for a few weeks now, but consider myself still a  \nnewbie, especially in what concerns the basics of data handling in R.\n\nMy situation is this:\nI read in data from a database using RODBC, and then use \"table\" to  \nproduce a table of \"counts per years\", table which I give to \"plot\".  \nAll is well, as long as there are no gaps in the years sequence, but  \nnow I have the following result (example):\n\n1990 20\n1991 15\n1995 17\n1997  9\n1998 10\n1999 11\n2000  5\n\nThe \"plot\" function is quite intelligent, in the sense that it draws  \nappropriate gaps in the x-axis between years, but not intelligent  \nenough to interrupt the data line during the gap. This gives the  \nimpression that, although no year is marked on the x-axis between 1991  \nand 1995, there has been data for this period, which is not correct.\n\nWhat I tried to do is convert the table to a matrix, insert zeros for  \nthe missing years using rbind and cbind, and convert the result back  \nto table. But the structure of this resulting table is not the same as  \nfor the originating table, so that I need to pass \"tab[1,]\" to \"plot\".  \nIt's no longer a contingency table in fact.\n\nI've seen in the mailing list archives that there is an issue on using  \n\"table\"s when matrixes or other structures would be more appropriate.\n\nI like the \"table\", because \"plot\" automatically plots the  \ncorresponding years on the x-axis, which I find less error-prone than  \nadding the tick labels later by hand, i.e. the association between  \nyears and counts is stronger.\n\nAlso, as I tabulate counts of cases per gender, or per age categories,  \nI think a contingency table is the right thing to use, isn't it?\n\nI'd be glad on any advice about what would be the best data structure  \nto handle my situation, and I'd also like to know how I could  \nautomagically check a list of \"year, cases\" rows against a fixed list  \nof years, insert zero or \"NA\" values for missing years, and get an  \neasily usable result that I can forward to \"plot\" or \"barplot\".\n\nThanks a lot in advance,\n\nAnne-Mudle\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}