{"category": "ham", "to_address": "<thaifta@lists.riseup.net>, aidsdrugs@lists.riseup.net,\n   HGAPALLIES@LISTSERV.CRITPATH.ORG, ip-health@lists.essential.org", "from_address": "B.Baker@neu.edu", "subject": "[Ip-health] Abbott's New Blackmail with a Smile", "body": "\nAbbott's New Blackmail with a Smile\nBrook K. Baker, Health GAP\nApril 21, 2007\n\nClaiming to have backed away from confrontation with Thailand over the Thai\ndecision to issue a compulsory license for Kaletra/Aluvia (WSJ April 23,\n2007), Abbott has instead resorted to \"blackmail with a smile\" by insisting\nthat it will make the new heat-stable form of lopinavir/ritonavir (Aluvia)\navailable for $1000 per patient per year, but only if Thailand drops its\ncompulsory license.  This announcement is unsatisfactory both because it\ncontinues to condition registration and access to Aluvia on Thailand's\nrelinquishment of its lawful government-use license for Kaletra/Aluvia and\nbecause it fails to address the six other new products that Abbott\nunilaterally removed from the registration pipeline in Thailand.\n\nLast week, under an intense barrage of international pressure from Thai\nactivists who organized a consumer boycott and from international allies\nwho are organizing protests by Abbott shareholders and U.S. doctors, Abbott\nannounced that it had slashed its previous low- and lower-middle income\nprice for Kaletra and Aluvia to only $1000 instead of the previous\nbenchmark of $2200 set at the International AIDS Conference in Toronto last\nAugust.  Abbott's decision followed shortly on the heels not only of\ngrowing global protests but also of announcements of heat-stable forms of\nKaletra being manufactured by India producers (Cipla and Emcure) at prices\nsubstantially lower than Abbott's announced \"access\" price.\n\nAbbott's insistence that Thailand drop its license for public,\nnon-commercial use in essence asks Thailand to disarm itself with respect\nto its ability to access cheaper generic forms of lopinavir/ritonavir once\ngeneric manufacturers receive WHO prequalification and begin large-scale\nproduction.  Abbott is temporarily undercutting the early-stage generic\nprice, but in the long run the generic producers will always be able to\nsell at a lower price given their lower manufacturing costs even when\nmeeting international quality standards.\n\nThailand needs to maintain its future flexibility to source\nlopinavir/ritonavir more cheaply even if it decides to temporarily buy\nAluvia from Abbott.  Although Thailand is likely initially to import\ngeneric lopinavir/ritonavir from India, under its license it will also\nretain flexibility to manufacture domestically in the new GMP-certified\nmanufacturing facility being built by the publicly owned Government\nPharmaceutical Organization.\n\nEven if GPO manufactures medicines at a profit (as the India generic\nproducers will also do) such production will still be for \"public,\nnon-commercial use\" under the definitions of the WTO TRIPS Agreement.  The\nkey term is \"use,\" not \"no-profit, non-public-sector production\" as some\nindustry apologists are arguing (Bangkok Post, Peerapan Tungsuwan and\nWilliam McKay, April 23, 2007).  The government of Thailand has indicated\nthat Abbott will still have exclusive access to private sector sales in\nThailand.  The government will only \"use\" the generic versions of\nKaletra/Aluvia within Thailand's robust publicly insured health sector that\nintends to provide medicines for 107,000 out of 580,000 Thai's living with\nHIV/AIDS this year.  An estimated 8,000 to 20,000 of those patients could\nbenefit from access to lopinavir/ritonavir according to recent reports.\n\nBlackmail is blackmail whether it is announced with a smile or not.\nActivists in the U.S. and Thailand have made clear that they will not be\ndissuaded by Abbott's desperate scramble for favorable publicity in advance\nof its annual shareholders' meeting in Chicago on April 27.  Instead, U.S.\nactivists will continue with their global day of action holding protests at\nAbbott facilities in Worcester, Massachusetts, New York City, Chicago,\nWashington, D.C., and Austin, Texas.  They will be joined with allies in\nthe U.K., Germany, France, and elsewhere who are demanding a full\nstand-down by Abbott.\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}