{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Gasification News<Gasification.News@calcium.netcontentinc.net>", "subject": "Get Timely IGCC and Carbon Management Updates", "body": "\n\nGasification News Promotional Letter\n\n\n\n\n\n\n\n\n\n\n\n\nDear Colleague,\n\n            Volatility in the global petroleum and natural gas supply... growing pressure \n            for more efficient power generation... governmental focus on carbon capture \n            without a turnkey technology... increasing corporate demand for added \n            value and bottom-line profitability...\n\n            These and other factors are focusing interest on gasification activity \n            and technologies as never before.\n\n            In the 1990s, gasification capacity increased worldwide by 50%... with \n            forty-three new plants coming online. In just the first five years of \n            the 21st century, capacity increased 58%... with forty-one new plant start-ups. \n            \n\n            The trend is clear. Gasification is the wave of the future and \n            GasificationNEWS \n            is THE publication covering it!\n\nLook what else is happening:\n\n\nThe emphasis on CO2 management and storage is \n              causing sleepless nights... The EU has put the regulatory cart ahead \n              of the process technology horse, and Washington may follow.\nElectric power producers are now openly discussing participation \n              in Fischer-Tropsch fuels and chemicals, using Integrated Gasification \n              Combined Cycle to launch...\nOil refiners are starting to make more moves into electric power \n              markets, via coke gasification/IGCC projects...\nChemical producers are now exploring the power and fuels business, \n              using gasification as the market enabler...\nTechnology providers including GE, Shell, ConocoPhillips and others \n              are forming engineering, procurement and construction (EPC) alliances \n              with major world-wide contractors to offer \"wrap\" guarantees \n              for gasification projects, cutting risk.\n\nThe Bottom Line: \n            The GTL/CTL/BTL/IGCC and chemicals markets are converging around the same \n            nexus... gasification. And this gasification-nexus business is growing \n            explosively, as you'll see in future issues of GasificationNEWS.\n\n\n\n\n\n\n\n\n\n\n\n\n            Reported by respected industry journalists and editors, GasificationNEWS \n            provides unbiased, in-depth coverage of the issues that matter to you \n            most. \n\n            From the latest advances in engineering and plant design... to the nuances \n            of tax incentives and penalties... and from operations and emerging trends... \n            to breaking environmental and regulatory news... \n\nGasificationNEWS delivers.\n\n            But don't just take my word for it . . . see \n              for yourself in a sample \n                issue.\n\n            In every issue of GasificationNEWS, \n            readers will discover how the major players see future progress in clean \n            energy... AND how they intend to finance projects that start with a ten-figure \n            price tag.\n\n            LATEST DEVELOPMENTS from around the globe...\n            Japan... South Africa... North America... China... the Netherlands...\n            EXECUTIVE MOVES...\n            Snapshots of key market benchmarks...\n            GLOBAL HOTSPOTS...\n\n            No other, single publication provides the breadth and depth of information \n            on the convergence technologies that GasificationNEWSdoes.\n\nWho Should Be Reading GasificationNEWS?\n\n            Key players, decision-makers and everyone tasked with achieving the most \n            efficient operation or finding the best path to profitability in CCS, \n            GTL, CTL, BTL, IGCC and Fischer-Tropsch.\n\n\n\n\n\n\n\n\nElectric Power Producers \nChemical Manufacturers \nEngineering Contractors \nPolicy Makers\nCatalyst Companies\n\n\n\n\nOil Refiners\nTechnology Providers\nEquipment Manufacturers\nResearchers\nRegulators\n\n\n\n\n\n\nGasificationNEWS is the monthly must-read \n            for anyone wanting to stake a winning claim in this newest energy frontier. \n            Published by Hart \n              Energy Publishing - the recognized authority in downstream motor fuels \n            - GasificationNEWS is the information \n            resource you can rely on for making intelligent, strategic decisions.\n\nDon't Miss the Trend . . . \n            Subscribe Today at https://secure.oilandgasinvestor.com/subland.php?PubCode=GN&TrackCode=5\n\n            Take advantage of our CHARTER SUBSCRIBER SAVINGS offer. One year, 24 issues \n            of GasificationNEWS - e-mailed to \n            your computer - for just $895. But this offer is limited.\n\n            Multiple-copy discounts can be obtained for your company. For information, \n            contact Hart's group publisher David Givens at 1-703-891-4811, or email \n            him at dgivens@hartenergy.com.\n\n            The future is now for gasification, subscribe \n              today.\n\n            Yours truly,\n\n            David Givens,\n            Publisher\n\n \n  \n\n To unsubscribe from Hart mailings, please click \n            here. Copyright 2007 by Hart Energy Publishing, LP. Unauthorized reproduction \n            or distribution of Gasification News is strictly prohibited and \n            subject to fine.\n\n\n\n\n1616 S Voss, Suite 1000, Houston, TX 77057 USA 1-713-260-6400\n\n\n\n\n\n\n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to gvwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}