{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nToday, the investigation continues into the tragedy\n  at Virginia Tech and, of course, our correspondents are on the scene covering\n  every angle.\n \nA picture of Cho Seung-Hui is slowly emerging: he was\n  a solitary young man with few friends. But his bizarre behavior had been\n  noticed – two women at Virginia Tech say they raised concerns in 2005\n  about Cho’s repeated attempts to contact them. When can a school take\n  steps against a student it suspects might someday cause harm? Cynthia Bowers will\n  have the details.\n \nThe paper trail Cho left behind helps fill in the\n  picture. Sharyn Alfonsi will report on Cho’s alarming creative writing\n  pieces, the ranting note he left behind and the latest on the investigation\n  into Monday’s massacre.\n \nA significant part of that investigation hinges on\n  forensic evidence, and some of that is locked inside the computer Cho owned\n  and used. Technology correspondent Daniel Sieberg will report on how\n  authorities are extracting information from the gunman’s hard drive.\n \nAlso, Thalia Assuras will have an emotional\n  interview with a young woman who lives near the site of the first shooting\n  Monday. It’s a dramatic account.\n \nIn other news, the Supreme Court upheld the\n  country’s ban on certain abortions this morning. The justices ruled 5-4\n  that the Partial Birth Abortion Ban Act that Congress passed and President\n  Bush signed four yeas ago is constitutionally sound. Wyatt Andrews will have\n  more on the decision. Our chief legal analyst, Andrew Cohen, will also weigh\n  in on the implications of the decision.\n \nFinally, it has been an extraordinarily deadly day\n  in Baghdad,\n  where more than 175 people were killed in a series of bombings – the\n  worst day of violence since the American troop surge began a few months ago.\n  Martin Seemungal will report.\n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}