{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nOn Capitol Hill today the FDA came under heavy criticism\n  for the way it handled Avandia, the diabetes drug linked to alleged heart\n  attack risk. The Government Reform Committee chairman called the FDA’s\n  monitoring of the drug’s safety “a major failure of our system.”\n  Wyatt Andrews will have more and Nancy Cordes will take a closer look at a\n  man who’s risked his career to blow the whistle on dangerous drugs,\n  including Avandia.\n \nLeaders of eight of the world’s most powerful\n  countries are meeting at the Baltic Sea resort town of Heiligendamm,\n  Germany,\n  for the G8 summit. Our chief White House correspondent Jim Axelrod is\n  traveling with President Bush and will brief us on the day’s events.\n \nOne of the hot topics at the G8 is carbon emissions.\n  The United States\n  emits the world’s most CO2 – pumping out 5.8 billion metric tons\n  of the stuff annually. Just behind the U.S.\n  is China.\n  Barry Petersen is in Beijing\n  and will report on the country’s overwhelming pollution problem and how\n  it could be creating a crisis for itself – and the rest of the world.\n \nToday marks the 63rd anniversary of D-Day,\n  and our Richard Schlesinger has the story of one man who was part of the\n  forces that stormed into France.\n  It’s unlike any war story you’ve heard before – a story of\n  a man, a village and a very memorable cow.\n \n It is also a landmark day for game-show fans.\n  After 35 years of Showcase Showdowns and Plinko games, Bob Barker taped his\n  last show of the legendary “The Price Is Right” today. Bill\n  Whitaker was there for the emotional making of Barker’s final show. \n \nI hope you’ll join us for these stories and\n  more,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}