{"category": "ham", "to_address": "debian-vote@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Nathanael Nerode <neroden@fastmail.fm>", "subject": "Re: Request for GR: clarifying the license text licensing / freeness issue", "body": "MJ Ray wrote:\n>There may be a few licences that are buggy about this and to which we\n>want to grant a limited-time exception, but that is not unusual.  Use\n>a GR for only that, not a permanent foundation document edit.\n\n>> Care to craft another solution? [...]\n\n>No, I've no interest\nYou just did craft another solution.  Thanks.\n\nAlternate suggested GR text:\n---------------------------\nThe Debian Project notes that many license texts are copyrighted works, licensed \nonly under meta-licenses which prohibit the creation of derivative license texts.\n\nWe consider this to be undesirable.  License texts are functional works; reusing \nlegal text from an earlier license makes a new license much easier to read and \ninterpret, while brand new legal text is likely to have unexpected results.  \nThis is true even of preambles, which can have an effect on the interpretation of\nthe license.  We encourage all authors of license texts to allow the creation of \nderivative license texts.\n\nCurrently several very important licenses for free software are licensed under \nsuch restrictive meta-licenses.  These include the LaTeX Project Public License\nand the GNU GPL version 2.  In addition, most license texts have no explicit\nmeta-licenses, which makes their legal situation unclear; the worst case \ninterpretation is that they have a restrictive meta-license.\n\nWe have promised that Debian will remain 100% free.  License texts which are \nunder restrictive meta-licenses are not 100% free.  While we could ship them \nalongside Debian rather than in Debian, we do in fact ship them in Debian as a \nmatter of convenience.\n\nWe wish to clearly inform our users of this temporary exception to the promise \nin our Social Contract.  We will do our best to resolve this issue.  Until this\nproblem no longer applies to major licenses, license texts applying to works in\nDebian may be present in Debian even if they are not DFSG-free.  We believe that\nthis is the best choice to serve our users and the free software community.\n-----------------------\nEnd alternate suggested GR\n\nFrankly I'd be happy with any honest solution.  Currently the promise made in the \nSocial Contract is very stark, very bold, and also untrue.  The DFSG are very \nstark and bold about this as well.  Lots of \"must\", \"never\" and \"100%\", which \nsimply isn't what's going on.\n\nIf the promise were, say, \"Debian will remain 99 44/100% free\", I wouldn't worry\nabout this stuff!\n\nHere's a much more radical proposal, which I don't really support, but would\nstill prefer over the present and ongoing situation.\n\nRadical proposed GR:\n--------------------\nAmend the Social Contract as follows:\n(1) Replace \"Debian will remain 100% free\" with \"We will strive to make Debian 100% free\"\n(2) Replace \"We promise that the Debian system and all its components will be \nfree according to these guidelines.\" with \"We promise to do our best to make the \nDebian system and all its components free according to these guidelines, without \ncrippling the system.\"\n(3) Replace \"We will never make the system require the use of a non-free \ncomponent.\" with \"We will try to avoid making the system require the use of a \nnon-free component, without crippling the system.\"\n(4) Replace 'We have created \"contrib\" and \"non-free\" areas in our archive for \nthese works.', the following: \"The most vital of these works are included in \nDebian, but we strive to replace all of them with free works.  For the remaining \nworks, we have created \"contrib\" and \"non-free\" areas in our archive.'\n----------\n\n-- \nNathanael Nerode  \n\n\"It's just a goddamned piece of paper.\"\n-- President Bush, referring to the US Constitution\nhttp://www.capitolhillblue.com/artman/publish/article_7779.shtml\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}