{"category": "ham", "to_address": "ip-health@lists.essential.org, e-drug@healthnet.org", "from_address": "Alexandra HEUMBER <Alexandra.HEUMBER@brussels.msf.org>", "subject": "[Ip-health] European Parliament's Vice president highly welcomes ASAQ solution- A\n solution  without the patent profit mechanism", "body": "This is a multipart message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nPlease below a letter from the Vice President of the European Parliament,\nLuisa Morgantini, to the DNDi, regarding to the launch of the new\nanti-malarial therapy ASAQ: A solution without the patent profit mechanism\nis possible.\n\n\"I also consider the innovative partnership between DNDi and\nSanofi/Aventis a\nconcrete answer to the Novartis case in India, in which I'm personally\nengaged in\nfavour of the lawfulness of the generic version of \"Gleevec\" distribution.\nThanks to ASAQ solution, it will be more difficult now for the big\npharmaceutical companies to defend the thesis according to which it is not\npossible to make progress in pharmaceutical innovation, without the patent\nprofit mechanism.\"\n\nhttp://www.actwithasaq.org/pdf/asaqeuro.pdf\n\nBrussels, 1 March 2007\n\nDear Bernard Pecoul,\n\nI sincerely regret not being present today at the launch of the new\nantimalarial therapy ASAQ by DNDi and Sanofi-Aventis, as I would have\nliked to. This is an event that I consider especially important. An event\nthat drives a decisive step forward in the fight against poverty and death\ncaused by \"neglected diseases\" in Africa and other impoverished countries.\n\nLet me say, first of all, that I very much welcome the fact that the new\nASAQ\nantimalarial fixed-dose combination is born without patent. This means\nthat, for the first time, the health of millions of people has been rated\nas more important than profits in the creation of a new life-saving drug.\nThe traits of the new therapy ASAQ lead to a remarkable degree of\nenthusiasm, both in terms of availability and accessibility of the drug.\n\nI therefore would like to offer my deepest congratulations to DNDi and\nSanofi/Aventis, as you finally give us the tangible evidence that patents\ncan be\nskipped in the interest of public health, especially for poor people with\nno purchasing power. As you know, this is a concern that all human rights\norganizations and the civil society worldwide have voiced for years,\nclaiming the fundamental people\\u2019s right of access to essential health\ntools. This battle is still on, and we are still working on it.\n\nI also consider the innovative partnership between DNDi and Sanofi/Aventis\na\nconcrete answer to the Novartis case in India, in which I'm personally\nengaged in\nfavour of the lawfulness of the generic version of \"Gleevec\" distribution.\nThanks to ASAQ solution, it will be more difficult now for the big\npharmaceutical companies to defend the thesis according to which it is not\npossible to make progress in pharmaceutical innovation, without the patent\nprofit mechanism.\n\nThe new global health public good approach pursued by DNDi and\nSanofi/Aventis and their results demonstrates that a new way is possible.\nThe largest possible access of population remains the goal and its\naccomplishment will depend on the cooperation among all actors involved\n(NGOs, civil society, academia, institutional bodies and enterprises) and\nfrom the support they will be able to give to this new approach.\n\nAs member and vice-president of the European Parliament I reaffirm my\ncommitment to make sure the European Union, which has given financial\nsupport to ASAQ, will continue its efforts in spreading the new treatment\nto the widest possible segment of the population in need.\n\nSincerely yours,\n\nLuisa Morgantini\nVice-President of the European Parliament\n\n\n\nAlexandra Heumber\nEU Advocacy Liaison Officer\nMédecins Sans Frontières\nAccess to Essential Medicines Campaign\nRue Dupré, 94. 1090 Brussels\n++32 (0) 2 474 75 09 (Dir off)\n++ 32 (0) 479 514 900 (Mob)\n++ 32 (0) 2 474 75 75 (Fax)\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}