{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Gregory Nowak <greg@romuald.net.eu.org>", "subject": "Re: command line option in speakup to change synthisizer options", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nI've thought myself more then once that this would be a nice feature to\nhave. The problem with adjusting speech parameters as soon as the synth\nis found while the system boots, is that you are doing so while\nspeakup is still sending text to the synth. So, if you're lucky,\nyou'll hear each and every change taking effect with quite a delay. If\nyou're not lucky, then you'll press a key combination too many times,\nand will wind up with something that you didn't mean to end up with,\nand that result may be worse then the default parameters.\n\nThen again, I've been meaning to look at the speakup code in detail\nfor a while now, along with reading up on how to program the kernel,\nbut haven't gotten to it so far, and don't know when I will. Of\ncourse, Kirk would be fully justified if he responded to this with \"so\ncode it, and submit a patch if you want it.\"\n\nGreg\n\n\nOn Sat, Apr 21, 2007 at 03:33:37PM -0500, Nick Gawronski wrote:\n> Hi, One thing I have found is it is not possible to type for example at\n> the boot prompt of a live CD or in lilo linux speakup_synth=dectlk\n> speakup_rate=0 and other such options even if speakup is built into the\n> kernel or as a module option.  The reason I bring this up is I like my\n> dectalk express at rate 0 as the default rate that is set in speakup is a\n> little faster then I can handle.  This is why it would be nice to be able\n> to set these at load time not after booting threw either proc or the\n> speakup review keys.  It could also be a configuration option in the\n> kernel configuration when building speakup.\n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n- -- \nweb site: http://www.romuald.net.eu.org\ngpg public key: http://www.romuald.net.eu.org/pubkey.asc\nskype: gregn1\n(authorization required, add me to your contacts list first)\n\n- --\nFree domains: http://www.eu.org/ or mail dns-manager@EU.org\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGKuaG7s9z/XlyUyARAqt+AJ0RFhtFm3yEA12TzJf32Y8BE8wpuQCdEutL\nwnyzGugjKeb1yCo6JHBC7ts=\n=WK0n\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}