{"category": "ham", "to_address": "<ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Automotive Newsletter April 10, 2007", "body": "\nhowstuffworks® | automotive  April 10, 2007\nRSS\n   2007 New York Auto Show\n-sponsored by- \nThe Auto Editors of Consumer Guide give you an inside peek at the 2008 and 2009 cars and trucks being unveiled at the 2007 New York Auto Show. Get hour-by-hour coverage as automakers from around the world unveil the cars and trucks you'll soon see in showrooms. Check out reviews, prices and specs on the 2008 Hummer H3 Alpha and other new vehicles.\n \nAlso at HowStuffWorks \nHow Kelley Blue Book Works - Kelley Blue Book is the most important resource you'll need\nwhen buying or selling a new or used car. Find out how the Kelley Blue Book\nworks, where it gets its pricing information and how to use its Web site.\n\n     How Odometers Work - \n\nThey're a dying breed, but mechanical odometers have been\nreliably counting the miles for centuries. Take a look inside a mechanical odometer,\nand see how it differs from a computerized odometer.\n\n     How Fuel Cells Work - \n\nFuel cells generate electrical power, and they do it\nquietly, efficiently and without pollution. Unlike power sources that use\nfossil fuels, the byproducts from an operating fuel cell are heat and water.\nFind out how fuel cells work. \n\n       \nThis Week's Video \nWe learned what it takes to build an all-terrain vehicle\nfrom start to finish when Sales Supervisor Alan Horne gave us a tour of the\nSuzuki Manufacturing of America Corporation ATV factory. Visit the ATV\nfactory in this HowStuffWorks video.\n\n   This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click here.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved\n"}