{"category": "spam", "to_address": "<the00@plg2.math.uwaterloo.ca>", "from_address": "\"Katharine\" <uplh@newmantechpartners.com>", "subject": "the lower you are the less of value you are to Orange, its all done by a system so can be wrong.", "body": "The cream of the crop for 2007 - GET IN EARLY! DSDI IS SET TO ROCK YOUR\nPORTFOLIO!\n\nDSI Direct Sales, Inc.\nSymbol: DSDI\nPrice: $0.04\n\nThere is a MASSIVE PROMOTION underway this weekend! This is hot, read\nthe news and get on DSDI first thing Monday!\n\nBut alas some of the functions do not seem to be as effective as the old\nD5. If not then you need to get writing! I have no doubt that their.\nThis will be sent automatically to anyone that wants it (members can\ndecide whether they want to get this update independently of getting the\nnewsletter!\nQuestionsAbout UsCommunity BlogContactJoin1 Nov 2006Sony PS3 hits the UK\n- well a couple have!\nthe problem is Orange now band customer from 1-5  .\nHe was in no doubt about the better product. It seems Sony have upgraded\nthe camera from 6Megapixels to 10 Megapixels and have added extra\nfunctions. What's your view on this? Even if it's just to say hi, we'd\nlove to hear from you! I hope to be back often. We have been waiting 6\nmonths for Orange to upgrade our handsets, and I have just found out\ntoday that due to some internal cock ups our free upgrades have been\nrejected.\n19 Jan 2006 18:18Various   suggest   is 'reacting to customer demand'\nand offering VoIP alongside it's traditional.\nFinally, many of you will be aware of our 5x5 smiley awards, the most\nrecent of which was awarded to the excellent Canon Ixus 800IS. They\ncould - and sticking with Orange.\nI hope to be back often.\nIt seems Sony have upgraded the camera from 6Megapixels to 10 Megapixels\nand have added extra functions. First statement arrives and I have 200\nany-network minuts, 100 landline minutes and 100 fixed line minutes -\nthat is a 12 month contract. You find the first through searching - what\nthen?\nuk and ill see what I can do for you and anyone else who is interested.\nBefore I go into my experience - I'd love to hear how you've faired.\n19 Jan 2006 18:18Various   suggest   is 'reacting to customer demand'\nand offering VoIP alongside it's traditional. I love Sony products, but\nthey win not because of proprietary formats but despite them, which can\nonly work for so long. Hmmm - they aren't sure what's happened but the\nperson that dealt with me will definitely call back. What a big mistake\nthis has turned out to be!\nWith my phone coming to the end of it's life I wanted to upgrade to the\nbest phone I could get and keep that for (hopefully! QuestionsAbout\nUsCommunity BlogContactJoin1 Aug 2006Editors Blog - busy July! This was\nthe first for a while, but we're hoping to make the newsletter a monthly\nregular from now on! Alternatively why not complete our simple on-line\nsurvey? QuestionsAbout UsCommunity BlogContactJoin1 Nov 2006Sony PS3\nhits the UK - well a couple have! Even if it's just to say hi, we'd love\nto hear from you! These emails will include a summary of the articles,\nblogs and discussions started in the previous seven days.\nA call to Car Phone Warehouse.\nThe rest of my family will follow in due time so that will be 3 lost\ncustomers.\nI've been an Orange customer for 13 years and on the strength of that\nwhen it came to setting up a business account at my work we decided to\ngo with Orange.\nSony PS3 hits the UK - well a couple have! I've been a loyal Orange\ncustomer for over 4 years,. Questions to ask:Do they give you the same\nchoice of phone at the same price as new customers? So - have you\nupgraded with an existing supplier recently? First statement arrives and\nI have 200 any-network minuts, 100 landline minutes and 100 fixed line\nminutes - that is a 12 month contract.\nQuestionsAbout UsCommunity BlogContactJoin19 Aug 2006Editors Blog - new\nfeatures - more fun!\n\n"}