{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\n\nHi, everyone, \nTens of thousands draped themselves in Iraqi flags \n      and marched through the streets of two Shiite holy cities today to mark \n      the fourth anniversary of Baghdad's fall  to \n      U.S. troops. The show of \n      force was orchestrated by the radical Shiite cleric Moqtada al Sadr, who \n      proved that he commands an enormous following among Iraq's largest \n      religious group. Martin Seemungal is \n      in Baghdad, and will have more on this story tonight. \nIran announced a dramatic expansion of uranium enrichment, saying \n      it has begun operating 3,000 centrifuges. That's nearly 10 times the \n      previously known number, and is in defiance of U.N. demands that it halt the program or face increased \n      sanctions. We will have a reality check on the real threat from \n      Iran. \nPresident Bush is making another push for \n      immigration reform. He visited the U.S.-Mexico border to tout a guest \n      worker program for immigrants. With up to 12 million illegal immigrants in \n      the U.S., lawmakers haven't agreed on how to uphold the law without \n      disrupting lives, eroding the work force and risking political upheaval. \n      Kelly Cobiella will report from the \n      desert stretch where Arizona and Mexico meet. \n      Border agents there say they are pelted with rocks and the victims of \n      assault from smugglers. In fact, there have been more assaults against \n      agents in the Yuma sector this year than all of last year.  \nAt any one time in this country, as many as 100,000 \n      people are suffering from heart failure, but only about 2,000 people a \n      year receive heart transplants. For a long time, doctors were focused on \n      developing a heart pump as a bridge to when a new heart becomes \n      available.  But a new device is showing it can be more than just a \n      bridge. Our contributing medical correspondent, CNN's Sanjay Gupta, will \n      tell you about this. \nThere's also a growing uproar over \n      radio host Don Imus' racially charged comments about the Rutgers \n      University women's basketball team.  Despite his \n      on-air apologies, the calls continue for him to be fired from his \n      syndicated morning program, after his racially charged comments. Imus \n      appeared on the Rev. Al Sharpton's radio program today and issued another \n      apology. Richard Schlesinger will have this report, and \n      will discuss the FCC's regulations as well.  \nFinally, for computer researcher Zombie Bell even \n      his morning walk to work is part of a grand experiment in digitizing and \n      remembering everything. The little camera around his neck takes a picture \n      every 30 seconds or so, and a sound recorder rolls non-stop. Bell is \n      saving his whole life on computer, from childhood certificates to all his \n      medical records. John Blackstone will have his story.\n I hope \n      to see you tonight.\n\nKatie CouricCouricandCo@cbs.com \n\n\n\n\nAdvertisement\n\n\n\nTo \nunsubscribe or change your subscription options, click here.Contact: \nEmail Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n10019Help | Advertise | Terms of Service | Privacy Statement©MMVI, CBS Worldwide Inc, All Rights \nReserved. \n"}