{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for July 5, 2007  \n\n\n\nFirst Enercast Featured Articles for July 5, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nJul 5, 2007 PowerMarketers Industry Publications\n\n\n\nTHIS WEEK AT EIA (Volume 9, Issue 27) (June 29 - July 5, 2007)\n\n\n\nEIA - Jul. 3, 2007 - THIS WEEK AT EIA is a list summarizing and providing URLs for every Energy Information Administration (EIA) product released during this week.\n\n\nJul 5, 2007 PowerMarketers Industry Publications\n\n\n\nLetters From Readers (EnergyBiz Insider - Jul. 5, 2007)\n\n\n\nEnergyBiz Insider - Jul. 5, 2007 - Below are a few letters we received on topics that appeared in the past few weeks. They capture the essence of how many readers say they feel. \n\n\nJul 5, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jul. 5, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jul. 5, 2007\n\n\nJul 5, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jul. 3, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jul. 3, 2007\n\n\nJul 5, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nBRIEF: Duke Energy seeks OK for two plants\n\n\n\nJul. 4--CHARLOTTE -- Duke Energy has asked state regulators for permission to build two power plants in the state.  The Charlotte-based electric utility wants to add a power plant at the existing Buck Steam Station in Rowan County and another at the existing Dan River site in Rockingham County. Both plants would have an output capacity of 600 megawatts to 800 megawatts.\n\n\nJul 4, 2007 Knight Ridder Tribune Business News\n\n\n\nGas-bill programs on hold: PUC suspends fixed-price plans as attorney general investigates\n\n\n\nJul. 4--The Minnesota Public Utilities Commission voted Tuesday to suspend the \"fixed price\" billing programs that the state attorney general said overcharged thousands of CenterPoint Energy and Xcel Energy customers.  The fixed-price plans allowed customers to lock in a set price on their natural gas bills, but Minnesota Attorney General Lori Swanson said they confused many customers, who ...\n\n\nJul 4, 2007 Knight Ridder Tribune Business News\n\n\n\nOPPD considers a third coal plant\n\n\n\nJul. 4--The Omaha Public Power District is mulling a third coal plant at Nebraska City as the least expensive way of expanding electrical capacity in the decade ahead.  A second plant already is under construction on the utility's Nebraska City campus next to its current plant. With room for two more coal plants there, the district is studying whether a third should be built as soon as 2016, when ...\n\n\nJul 4, 2007 Knight Ridder Tribune Business News\n\n\n\nSimple steps ease jump in BGE bills\n\n\n\nJul. 4--In preparation for his first electric bill after last month's 50 percent rate increase, Bolton Hill resident and landlord Greg Baranoski harked back to his childhood in the 1960s.  Despite an above-average number of 90-degree days last month, he turned on his air conditioning only twice. Instead, he slept under a ceiling fan and with the windows open.\n\n\nJul 4, 2007 Knight Ridder Tribune Business News\n\n\n\nFixed-price utility billing plans frozen\n\n\n\nJul. 4--The Public Utilities Commission on Tuesday put a freeze on controversial billing plans offered by CenterPoint Energy and Xcel Energy, shutting down both fixed-price programs for the 2007-2008 winter heating season while an investigation by the attorney general's office continues.  It remains to be seen whether the bulk of the 56,000 customers enrolled in the program, which allows ...\n\n\nJul 4, 2007 Knight Ridder Tribune Business News\n\n\n\nSwitch off: Coal-fired plant will not be built: Disney's energy grid would have benefited\n\n\n\nJul. 4--The plug has been pulled on a proposed coal-fired power plant that might have provided Walt Disney World with up to a quarter of its future electricity. The consortium that planned to build the 800-megawatt Taylor Energy Center in Taylor County in North Florida announced Tuesday that it was suspending its efforts and will join Gov. Charlie Crist's alternative-energy program.\n\n\nJul 4, 2007 Knight Ridder Tribune Business News\n\n\n\nMaking energy policy an issue: O'Malley works to electrify conservation efforts in Maryland\n\n\n\nJul. 4--With two announcements in two days and more on the way, Gov. Martin O'Malley has elevated state energy policy to the top tier of his administration's priorities -- a move that could help him blunt political criticism over the electric rate increases he failed to stop.  With the 50 percent BGE rate increase that took effect June 1, the governor faces the possibility of a hot and cranky ...\n\n\nJul 4, 2007 Knight Ridder Tribune Business News\n\n\n\nPlanned wind farm gets purchase contract\n\n\n\nJul. 5--JOPLIN, Mo. -- A Joplin, Mo.-based power company has announced plans to purchase energy from a yet-to-be-built wind farm in Cloud County.  Empire District Electric Co. has signed a 20-year purchase power agreement with Cloud County Wind Farm LLC, which is owned by Houston-based Horizon Wind Energy. According to a news release last week, Horizon Wind Energy plans to start building the ...\n\n\nJul 5, 2007 Knight Ridder Tribune Business News\n\n\n\nUtilities propose settlement with wind developers\n\n\n\nJul. 4--Idaho's three large regulated electric utilities have proposed a settlement with wind developers that they say could resolve cost issues that have slowed development of small wind projects in Idaho.  Idaho Power had asked the Public Utilities Commission to place a moratorium on rapidly increasing wind development projects within its territory while the company studied how much it would ...\n\n\nJul 4, 2007 Knight Ridder Tribune Business News\n\n\n\nSummer heat sizzles Southland\n\n\n\nJul. 4--Near-record-high temperatures are expected to put a strain on people and power lines through Thursday.  The National Weather Service forecasts a high of 112 today and 114 Thursday. Gov. Arnold Schwarzenegger has ordered the opening of state cooling centers at fairgrounds in 13 counties, including the San Bernardino County Fairgrounds in Victorville. At St.\n\n\nJul 4, 2007 Knight Ridder Tribune Business News\n\n\n\nEdison customers offered discount\n\n\n\nJul. 5--VICTORVILLE -- Southern California Edison is offering a discount plan that enables customers to receive credit on their summer energy bills. Depending on which plan they choose, customers can save up to $200 in exchange for permitting Edison to install a remote-controlled device in their central air conditioner. The device permits the energy company to turn off the air conditioner during ...\n\n\nJul 5, 2007 Knight Ridder Tribune Business News\n\n\n\nRecord high expected Thursday in Sacramento\n\n\n\nJul. 5--Even a hint of humidity can make the weather feel warmer than it is. In Arizona, they say it's a \"dry heat,\" as if that helps the onslaught of 110-degree days during the summer months in the desert.  But low humidity does bring some consolation with a record-high temperature of 106 expected in Sacramento on Thursday. This week's blast of heat is coming from a high-pressure zone over the ...\n\n\nJul 5, 2007 Knight Ridder Tribune Business News\n\n\n\nEnergy assistance applications available in Madison County\n\n\n\nJul. 5--The Madison County Community Development Department will accept applications for energy assistance from July 9 to July 20 as part of its Summer Energy Assistance Program.  The program helps low-income households pay for electric services. It is funded by the U.S. Department of Healthcare and Family Services' Office of Energy Assistance. Eligible households include seniors, the disabled, ...\n\n\nJul 5, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nDuke Carolinas proposes gas-fired units\n\n\n\n-- Duke Energy Carolinas wants to build a 600- to 800-MW gas-fired plant in Rockingham County that would begin producing power in 2011. The company also plans to expand an already-proposed gas plant in Rowan County, boosting it to as much as 800 MW from 600. The proposed gas units would be intermediate plants. In filings this week with N.C. regulators, Duke said it will seek state approval in the ...\n\n\nJul 5, 2007 Power Engineering\n\n\n\nNo blackouts expected if users careful\n\n\n\nElectricity grid managers on Tuesday asked Californians to use less energy during this week's heat wave after problems in the southern part of the state pinched supplies. With temperatures expected to hit triple digits from Redding to Palm Springs, homeowners were asked to shut off unneeded lights, set thermostats no lower than 78 degrees and hold off using washing machines until night.\n\n\nJul 4, 2007 San Francisco Chronicle\n\n\n\nOPPD considers a third coal plant\n\n\n\nThe Omaha Public Power District is mulling a third coal plant at Nebraska City as the least expensive way of expanding electrical capacity in the decade ahead. A second plant already is under construction on the utility's Nebraska City campus next to its current plant. Voice your opinion Send an e-mail to IRPinput@oppd.com Send regular mail to IRP Input, 10E/EP1, Omaha Public Power District, 444 ...\n\n\nJul 4, 2007 Omaha World-Herald\n\n\n\nTilting at windmills\n\n\n\nThe price tag is now at $697 million to build 40 massive turbines in the ocean off Jones Beach to provide only 140 megawatts of power, a fraction of what the area uses. Even though FPL Energy, the winning bidder for the project, would directly pay the construction costs, the company would recoup that money through the rates it charges the Long Island Power Authority.\n\n\nJul 5, 2007 Newsday\n\n\n\nTEP proposes rate hikes; time-of-use, tiered billing plans\n\n\n\nTucson Electric Power Co. formally filed a rate case Monday that would increase average electric rates by as much as 23 percent overall beginning in 2009 after a 10-year rate freeze. According to TEP, residential customers would see an average increase of between 8 percent and 13 percent - or about $98 to $129 annually over the current average bill - depending which of three rate plans the ...\n\n\nJul 4, 2007 Arizona Daily Star\n\n\n\nSCE Proposes Final Leg of California's Largest Renewable Transmission Project\n\n\n\nThe Digital Utility  Vegetation Management  Southern California Edison (SCE) has applied to the California Public Utilities Commission (CPUC) and the U.S. Forest Service for authorization to construct Segments 4 through 11 of the Tehachapi Renewable Transmission Project, a series of new and upgraded high-voltage electric transmission lines to deliver electricity from proposed new wind farms in ...\n\n\nJul 4, 2007 Transmission & Distribution World\n\n\n\nRegulators pursue AEP rate order\n\n\n\nThe Oklahoma Corporation Commission began drafting a final order Tuesday that will determine whether electricity rates will increase for more than half a million state utility customers. During deliberations, commissioners indicated their positions on several key issues in the pending American Electric Power-Public Service Company of Oklahoma rate case. No final determination was made about ...\n\n\nJul 4, 2007 Tulsa World\n\n\n\nRebuilding Our Aging Grid\n\n\n\nThe Digital Utility Vegetation Management In recent years, our industry has seen a significant increase in investment dollars. Serving as chairman of the Electric Power Apparatus Committee (EPAC) of the Association of Edison Illuminating Companies (AEIC) provides me the opportunity to network with AEIC member utilities. At the same time, EPAC maintains a close working relationship with 26 of the ...\n\n\nJul 5, 2007 Transmission & Distribution World\n\n\n\nWind energy plan may be delayed\n\n\n\nOLEAN  The Allegany Town Board will continue to consider written comments through July 18 on a proposed zoning amendment that would set standards for wind energy production facilities. About 30 people attended the Town Boards public hearing on the amendment Tuesday night, and only one of the eight who commented on the proposal supported it without asking for significant changes in wording or ...\n\n\nJul 4, 2007 Buffalo News\n\n\n\nPepco Completes New 230-kV Lines to Improve Reliability for DC\n\n\n\nThe Digital Utility  Vegetation Management  Pepco has placed into service two newly constructed high-voltage transmission lines that will enhance the reliability of electric service for downtown Washington and the federal government. The lines, each carrying 230,000 V, were constructed over an 18-month period with completion in time to meet this summer's peak demand period.\n\n\nJul 4, 2007 Transmission & Distribution World\n\n\n\nQ&A: American Power Conversion's Neil Rasmussen\n\n\n\n-- Neil Rasmussen is senior vice president and chief technology officer at  in Kingston, R.I. He founded the company in 1981 after graduating from MIT with an MSEE; his thesis was an analysis of a 200MW power supply for a Tokamak Fusion reactor. The company got its start in solar electricity before becoming a powerhouse in the UPS market in the mid-80s. Recently APC was acquired by Schneider ...\n\n\nJul 5, 2007 Computerworld\n\n\n\nEastport ship's pilot navigates proposed LNG route\n\n\n\nMembers of the crew aboard the cargo ship Star Ismene wait in the pilot port as the pilotboat gets close to the ship about 1.5 miles off Campabello Island. (Bangor Daily News/Gabor Degre) EASTPORT  He pilots ships through Head Harbour Passage, a controversial swath of Canadian waters that leads to this easternmost deep-water U.S. port. Capt. Robert J. Peacock knows better than most whats involved ...\n\n\nJul 4, 2007 Bangor Daily News\n\n\n\n\n\nDominion, Equitable Extend Sale Agreement for Natural Gas Utilities\n\n\n\nRICHMOND, Va., July 5 /PRNewswire-FirstCall/ -- Dominion (NYSE: D) announced today that an agreement to sell two natural gas utilities to Equitable Resources (NYSE: EQT) has been extended at least until September 1, 2007. Prior to this agreement, either party could have unilaterally ended the agreement after June 30, 2007. Dominion and Equitable also agreed to further extend the termination date ...\n\n\nJul 5, 2007 PR Newswire\n\n\n\nKings River Conservation District Announces Long Range, Zero Emission Solar Power Plan\n\n\n\nFRESNO, Calif.--(BUSINESS WIRE)--Kings River Conservation District (KRCD) and San Francisco, CA based Cleantech America, LLC, today announced that they have entered into a multi-year agreement for Cleantech America to provide up to 80 megawatts of utility scale, emission-free, peak solar power to the recently formed San Joaquin Valley Power Authority (SJVPA).\n\n\nJul 5, 2007 Business Wire\n\n\n\nEnergy Savings Announces Management Change\n\n\n\nEnergy Savings Income Fund (TSX: SIF.UN) announced today that Mary Meffe, Chief Financial Officer, will be leaving the Company to pursue other interests. Ken Hartwick, President of Energy Savings, will add the CFO role pending the completion of an executive search. Mr. Hartwick is a Chartered Accountant and was formerly CFO of Energy Savings and Hydro One.  Energy Savings Income Fund (TSX: ...\n\n\nJul 5, 2007 Internet Wire\n\n\n\nOncor, EPA Collaborate on Energy Efficiency Program\n\n\n\nOncor is one of only two utilities in the United States and the only electric utility in Texas to participate in a pilot program sponsored by the Environmental Protection Agency to test standards for heating and air conditioning installations. Through July 31, Oncor anticipates four participating contractors across the Metroplex will complete 40 approved installations under the EPA Energy Star(R) ...\n\n\nJul 5, 2007 PR Newswire\n\n\n\nWestern Wind Energy Corp. - Settlement Update and Re-Pricing of Private Placement\n\n\n\nToronto Stock Exchange (Venture) Symbol: 'WND' Issued and Outstanding: 25,743,080 COQUITLAM, BC, July 5 /PRNewswire-FirstCall/ - Western Wind Energy Corporation is pleased to announce that final settlement documentation between Western Wind Energy and Pacific Hydro is currently being finalized between the respective legal counsels of both parties. Although the exact details of the final ...\n\n\nJul 5, 2007 PR Newswire\n\n\n\nMirant to Host Q2 2007 Earnings Call\n\n\n\nATLANTA, July 5 /PRNewswire-FirstCall/ -- Mirant (NYSE: MIR) today announced it will host an earnings call to discuss its second quarter 2007 financial results. The call will be held from 10 to 11 a.m. EDT on Thursday, August 9, 2007. Analysts are invited to listen to the call by dialing 866.293.8970 (International 913.312.1230), and referencing confirmation code 4738382, or by logging ...\n\n\nJul 5, 2007 PR Newswire\n\n\n\nHydropower Currently Accounts for Approximately 20% of the World's Electricity Production\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c61655) has announced the addition of Alternative Fuel Vehicles Market Potential to their offering. The growing world-wide demand for renewable energy projects is being driven by ever increasing global energy consumption, and the availability of carbon and renewable energy credits.\n\n\nJul 5, 2007 Business Wire\n\n\n\nNew Report Discusses Various Aspects of Hydropower Including Harnessing Ocean Energy, Hydroelectric Dams and Microhydropower Systems\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c61852) has announced the addition of Hydropower Market Potential to their offering. The growing world-wide demand for renewable energy projects is being driven by ever increasing global energy consumption, and the availability of carbon and renewable energy credits.\n\n\nJul 5, 2007 Business Wire\n\n\n\nPhilips Calls for a Simple Switch to Reduce Energy Consumption\n\n\n\nAsimpleswitch.com consumer campaign aims to mobilize over two billion people to lead a more energy efficient life AMSTERDAM, The Netherlands, July 5 /PRNewswire-FirstCall/ -- (AEX, PHI, NYSE: PHG) -- Royal Philips Electronics today announced its global asimpleswitch.com consumer campaign showing that solutions for reducing energy consumption can be simple and actionable without compromising on ...\n\n\nJul 5, 2007 PR Newswire\n\n\n\nSprayCool(TM) Launches Sealed Transit Case for Military Use\n\n\n\nLIBERTY LAKE, Wash.--(BUSINESS WIRE)--SprayCool\", a leader in solving complex thermal problems produced by high-performance computing needs, today launched its new SprayCool Sealed Transit Case (STC), potentially saving the military millions of dollars by enabling the use of commercially available electronic equipment in the field. SprayCools new case is 30 percent smaller, 50 percent lighter and ...\n\n\nJul 5, 2007 Business Wire\n\n\n\n\n\nDuke Energy Carolinas proposes to build two gas-fired plants\n\n\n\nDuke Energy Carolinas Thursday said it plans to build two natural gas-fired combined-cycle plants in North Carolina, one at its Buck station in Rowan County and the other at its Dan River site in Rowan County. Each of the plants would have a capacity of between 600 and 800 MW. If approved by the North Carolina Utilities Commission, the Buck plant would begin commercial operation in 2010 and the ...\n\n\nJul 5, 2007 Platts\n\n\n\nLargest solar thermal plant to be built in 16 years now online\n\n\n\nAn update from the US Department of Energy's (DOE) Office of Energy Efficiency and Renewable Energy (EERE) reports on recent developments in parabolic solar thermal power plants in the US. Acciona Energy announced that Nevada Solar One, a 16-megawatt solar thermal power plant near Boulder City, Nevada, is now online. The new facility is the largest of its type to be built in the world since 1991, ...\n\n\nJul 4, 2007 FMLink\n\n\n\nTVA opens first \"new\" nuclear reactor in 11 years\n\n\n\nThe Tennessee Valley Authority (TVA) restarted Unit 1 at the  (PDF file) in Alabama on May 22, completing the first startup of an essentially new nuclear reactor in the United States in 11 years, according to the Department of Energy's (DOE) Office of Energy Efficiency and Renewable Energy (EERE). Originally started up in 1973, Browns Ferry was shut down in 1985, but in 2002 the TVA Board ...\n\n\nJul 4, 2007 FMLink\n\n\n\nNo new coal power for Disney World\n\n\n\nAs concern over greenhouse gas emissions grows, so does opposition to new coal plants in Florida. The Public Service Commission rejected a coal power plant that Florida Power & Light wanted to build near the Everglades and more recently a plant proposed near Tallahassee. While coal is still much cheaper than renewables, Gov. Charlie Crist said, it's good that Florida is rejecting new projects. ...\n\n\nJul 5, 2007 UPI\n\n\n\nAlaska Opens Application Process for Gas Pipeline\n\n\n\nJUNEAU, Alaska (AP) - Alaska Gov. Sarah Palin said Tuesday the state is ready to receive applications to build a natural gas pipeline that officials believe will ultimately deliver trillions of cubic feet of reserves to market. A potential multibillion dollar pipeline carries implications for North America's long-term energy supply and has been widely discussed by lawmakers, energy regulators and ...\n\n\nJul 4, 2007 Canadian Business Magazine\n\n\n\nAlliant Finance Chief Protsch Exercises Options on 11,063 Shares\n\n\n\nJuly 5, 2007 - 3:38 p.m. NEW YORK (AP) - The chief financial officer and senior executive vice president of utility company Alliant Energy Corp. exercised options to buy 11,063 shares of common stock, according to a document filed with the Securities and Exchange Commission. In a Form 4 filed with the SEC, Eliot Protsch reported he exercised options to buy 11,063 shares of common stock for $28.59 ...\n\n\nJul 5, 2007 Canadian Business Magazine\n\n\n\nDominion, Equitable extend gas utility sale agreement to Sept. 1\n\n\n\nDominion Thursday said it had extended its agreement to sell two natural gas utilities to Equitable Resources until at least September 1, adding that it and Equitable also agreed to further extend the termination date to November 1 if they are able to reach agreement to close the sale of Dominion Peoples earlier than the sale of Dominion Hope. Before the extension agreement was announced, either ...\n\n\nJul 5, 2007 Platts\n\n\n\nHeat wave bakes Southern California\n\n\n\nBy RAQUEL MARIA DILLON AND AMANDA BECKASSOCIATED PRESS WRITERS LOS ANGELES -- A small plane crashed into high-voltage transmission lines Tuesday, stressing California's power grid as inland areas sizzled in a heat wave. The private plane's crash into the San Diego-area electrical lines and an apparently unrelated loss of 1,900 megawatts of generation from several Southern California power plants ...\n\n\nJul 4, 2007 Seattle Post Intelligencer\n\n\n\nEthanol facilities in MO, IL win Energy Star awards\n\n\n\nThe US Environmental Protection Agency (EPA) has recognized two ethanol facilities in the Midwest for reducing energy consumption and greenhouse gas emissions equaling the amount of pollution from almost 6,000 cars annually. Energy Star awards will be given to these facilities at the 23rd Annual International Fuel Ethanol Workshop and Expo in St. Louis, MO. EPA will award ethanol facilities in ...\n\n\nJul 4, 2007 FMLink\n\n\n\nRecord high expected Thursday in Sacramento\n\n\n\nEven a hint of humidity can make the weather feel warmer than it is. In Arizona, they say it's a 'dry heat,' as if that helps the onslaught of 110-degree days during the summer months in the desert.But low humidity does bring some consolation with a record-high temperature of 106 expected in Sacramento on Thursday.This week's blast of heat is coming from a high-pressure zone over the Four Corners ...\n\n\nJul 5, 2007 Sacramento Bee\n\n\n\nA Pillar for Green Storage Temples\n\n\n\nPillar for Green  Temples SUBJECTS:     Applications  Mobile/   Network   FEATURES:  By Eric Spiegel - Published January 4, 2007 Using teamwork and incentives, the financial services firm averted serious problems within its support environment.   By Mike Elgan - Published May 30, 2007 Want your own personal computing Renaissance? The ...\n\n\nJul 5, 2007 Datamation\n\n\n\nCase study: Newcastle-under-Lyme Borough Council\n\n\n\nThe Apple iPhone - so what? Three years ago, Newcastle-under-Lyme Borough Council realised that its server requirements had doubled in a year from 20 to 40 servers. Whats more, it looked as though the trend would continue We have lots of departments running multiple services, and we had servers for every service, says Steve Clark, the councils senior server support assistant.\n\n\nJul 5, 2007 Computing.co.uk\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nRound table: The future for energy\n\n\n\nRound table participants Dr Kevin Anderson Research director, Tyndall Centre for Climate Change Research Aily Armour Biggs CEO, Global Energy Finance Alistair Buchanan Chief executive, Ofgem Ed Crooks Energy editor, FT Alistair Darling MP Secretary of State for Trade and Industry Nick Eyre Director of Strategy, Energy Saving Trust Ian Funnell General Manager, Power Systems UK, ABB Dr Paul Golby ...\n\n\nJul 4, 2007 New Statesman\n\n\n\nEDF Energies Nouvelles Arranges EUR 500 Million in Project Financing for Its Expansion in Portugal\n\n\n\nPARIS--(BUSINESS WIRE)-- Regulatory News: EDF Energies Nouvelles (Paris:EEN) has signed two project financing agreements worth a total amount of 500 million, i.e. one worth 325 million for the construction of the Alto Minho project, the largest wind farm in Europe (240 MW) and the other worth 175 million covering the construction of the Arada wind farm (112 MW).\n\n\nJul 5, 2007 Business Wire\n\n\n\nLatest turbine technology selected for Turkey's biggest wind project\n\n\n\n- A 130 MW wind power project in south eastern Turkey, which will more than double the country's installed wind capacity, represents GE Energy's largest installation of its 2.5xl wind turbine technology. GE Energy will provide 52 of the 2.5xl machines to Zorlu Enerji Elektrik Uretim A.S. for the wind park in Bahce, about 40 km from Osmaniye province. This will be the largest wind power project to ...\n\n\nJul 4, 2007 Power Engineering\n\n\n\nChile Energy Report Provides Updated Facts and Figures on the Evolution of the National Energy Market\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c61854) has announced the addition of Chile Energy Report to their offering. This report provides updated facts and figures on the evolution of the national energy market. For the oil, gas, coal and power markets, the report details the market organisation, institutions regulating the market, and ...\n\n\nJul 5, 2007 Business Wire\n\n\n\nE.ON backs expansion of European emissions trading to spur investment\n\n\n\n- A leading European utility has called for an expansion to the carbon trading market, as a route to tackling climate change. Wulf H. Bernotat, CEO of Germany's E.ON says that emission trading is the most effective way of giving companies incentives to invest in new low carbon technologies and says that his firm plans to invest 60bn over the next four years.\n\n\nJul 5, 2007 Power Engineering\n\n\n\nMerkel confronts energy industry with policy overhaul\n\n\n\nBERLIN: The German chancellor, Angela Merkel, Tuesday announced an ambitious plan to reduce greenhouse emissions by up to 40 percent by 2020, an initiative welcomed by environmentalists but harshly criticized by the energy industry, a powerful lobby. Merkel also ruled out any change to the government's nuclear policy before the next election, scheduled for 2009, that calls for the industry to be ...\n\n\nJul 4, 2007 International Herald Tribune\n\n\n\nThe Belgium Electricity Market Report Offers a Precise and Reliable Overview of the Electricity Market in the Country\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c61679) has announced the addition of Belgium Electricity Market Report to their offering. This report provides an incisive and reliable overview of the electricity market. It includes a national analysis of power supply and demand situation and trends, details electric utilities active in the ...\n\n\nJul 5, 2007 Business Wire\n\n\n\nGain Insight into Future Prospects for the UK Electricity Market\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c61630) has announced the addition of United Kingdom Electricity Market Report to their offering. This report provides an incisive and reliable overview of the electricity market. It includes a national analysis of power supply and demand situation and trends, details electric utilities active in the ...\n\n\nJul 4, 2007 Business Wire\n\n\n\nACE Provides Comprehensive Insurance Solutions for Renewable Energy Sector\n\n\n\nLONDON--(BUSINESS WIRE)--ACE European Group (ACE) (NYSE:ACE) has today launched ACE Renewable Energy, an innovative insurance solution for UK renewable energy producers and providers in a single policy. ACE Renewable Energy provides comprehensive cover across a broad scope of renewable energy risks. Alongside more established areas such as wind power, cover is provided for complex risks including ...\n\n\nJul 4, 2007 Business Wire\n\n\n\nAarhusKarlshamn: AAK And Lantmannen Intend to Form Joint Venture for Rapeseed Crushing, Investment of Some SEK 400 Million\n\n\n\nKARLSHAMN, Sweden--(BUSINESS WIRE)--Regulatory News: AAK (STO:AAK) and Lantmnnen Energi have signed an agreement of intent on the formation of a joint venture company (51/49) for investment in increased capacity for the production of rapeseed oil for foodstuffs and biodiesel in Karlshamn. The use of vegetable oils in the energy sector is increasing rapidly. This, combined with the competitive ...\n\n\nJul 4, 2007 Business Wire\n\n\n\nENDESA Starts up the Poggi Alti Wind Farm in Italy\n\n\n\nNEW YORK--(BUSINESS WIRE)--ENDESA (NYSE:ELE) announced yesterday that Endesa Italia started up the Poggi Alti wind farm, the largest in Tuscany, with installed capacity of 20MW. The Poggi Alti wind farm was built at a cost of Euro 25 million with minimal impact on the surrounding landscape respecting the environment. The facility has ten 2MW turbines with a total installed capacity of 20MW. ...\n\n\nJul 5, 2007 Business Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}