{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 103", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Cultural Heritage Law Student Writing Competition\n      (Museum Security Network Mailing list)\n   2. Top Del. court upholds dismissal of forged art lawsuit\n      (Museum Security Network Mailing list)\n   3. La Polic?a debe crear una oficina dedicada al patrimonio\n      (Museum Security Network Mailing list)\n   4. Law provides few protections for Indian mounds\n      (Museum Security Network Mailing list)\n   5. Petroglyphs vandalized, tagged with gang graffiti\n      (Museum Security Network Mailing list)\n   6. SoCal man indicted for transporting stolen violins to Europe\n      (Museum Security Network Mailing list)\n   7. Police find forged 'Kadishman sheep'\n      (Museum Security Network Mailing list)\n   8. Candelabri rubati a Bologna recuperati a Mantova\n      (Museum Security Network Mailing list)\n   9. Le pillage du ch?teau de Fontainebleau devant le tribunal\n      (Museum Security Network Mailing list)\n  10. Heimkehr der Teufelsbibel (Museum Security Network Mailing list)\n  11. Frank Collection: Questions arise over artwork?s ownership\n      (Museum Security Network Mailing list)\n  12. Namibia. Burglary At National Arts Gallery Thwarted\n      (Museum Security Network Mailing list)\n  13. The people of Monteleone Di Spoleto beg for the return of an\n      ancient Etruscan chariot on display at the Metropolitan\tMuseum of\n      Art in New York City. (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Fri, 27 Apr 2007 14:32:19 -0500\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Cultural Heritage Law Student Writing Competition\nTo: \nMessage-ID:\n\t\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nThe Lawyers' Committee for Cultural Heritage Preservation (LCCHP) announces its third annual law student writing competition and welcomes papers of publishable quality that develop or present new or different perspectives on the law with respect to cultural heritage.  The deadline for submissions is June 14, 2007.  The first-place winner will receive a prize of $300 and the second-place winner will receive a prize of $200. Both winners will also be given assistance in publishing their works.\n\nMore information about the competition may be found at http://www.culturalheritagelaw.org/writingcompetition.html.\n\n\nPatty Gerstenblith\nPresident\nThe Lawyers' Committee for Cultural Heritage Preservation\nwww.culturalheritagelaw.org\n\n\n------------------------------\n\nMessage: 2\nDate: Sat, 28 Apr 2007 08:15:36 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Top Del. court upholds dismissal of forged art lawsuit\nTo: Museum Security Network Mailinglist \nMessage-ID: <4632E688.8070706@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n  Top Del. court upholds dismissal of forged art lawsuit\n\nBy RANDALL CHASE, Associated Press\nPosted Friday, April 27, 2007 at 11:36 am\n\nDOVER ? The state Supreme Court has upheld the dismissal of lawsuit \nfiled by a Delaware couple who claimed they were defrauded when they \nbought a forged painting at a Christie?s auction.\n\nJohannes and Betty Krahmer appealed to the Supreme Court last year after \na Chancery Court judge dismissed their 2004 lawsuit against Christie?s, \nsaying the lawsuit was filed too late, and that there was no evidence to \ninfer that the famed auction house knew the painting was a fake.\n\nAfter hearing oral arguments last month, the Supreme Court issued a \ntwo-paragraph order Wednesday upholding the lower court decision.\n\nBetty Krahmer declined to comment on the ruling Friday. Wilmington \nattorney Victor Battaglia, who represented the couple, was not \nimmediately available for comment.\nCourt arguments centered on whether Delaware?s ?time of discovery? rule, \nwhich allows the filing period for a lawsuit to begin when a person \nfirst believes he has been injured, rather than the date of actual \ninjury, applied to the Krahmers.\n\nChristie?s argued that the rule typically applies to services provided \nby professionals such as doctors, lawyers and accountants, not to the \npurchase of goods.\n\nBattaglia argued that fine art was different from other consumer goods, \nand that the case involved both an ?inherently unknowable? injury and a \n?blamelessly ignorant? plaintiff, the two criteria required by the time \nof discovery rule.\n\nBattaglia said that, unlike art professionals, the Krahmers had no \nreason to suspect that the painting might be a fake, and that Christie?s \nrepresentatives were so enthralled with the painting?s purported lineage \nthat they failed to do their homework.\n\nThe dispute involved an oil portrait of a woman that the Krahmers bought \nin 1986, thinking it was the 1912 work ?Interior? by American \nimpressionist Frank Weston Benson. They paid $38,500 and received a \nsix-year limited warranty of authenticity.\n\nIn 1999, the Krahmers contacted a committee in Boston compiling a \ndefinitive list of Benson?s works. They subsequently learned of a \nsimilar painting at a Connecticut museum, which turned out to be the \nreal one. When the Krahmers tried to sell their painting on consignment \nin 2002 to Sotheby?s auction house, they were told by a Sotheby?s \nrestorer that it might be a forgery.\n\nThe committee in Boston theorized that the original was acquired from \nBenson by the famed Detroit Club in Michigan in 1914, but was sold in \nthe early 1970s and replaced with a copy, perhaps in the original frame.\n\nThe Krahmers asked Christie?s to rescind the 1986 sale, but the auction \nhouse refused, saying the six-year warranty of authenticity had expired.\n\nhttp://www.delawareonline.com/\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Sat, 28 Apr 2007 08:23:58 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] La Polic?a debe crear una oficina dedicada al\n\tpatrimonio\nTo: Museum Security Network Mailinglist \nMessage-ID: <4632E87E.5090202@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nLa Polic?a debe crear una oficina dedicada al patrimonio\n\nRedacci?n  Cultura\n\nDurante cinco d?as, el Instituto Nacional de Patrimonio Cultural de \nEcuador fue la sede de un seminario que dictaron varios especialistas \nitalianos sobre el cuidado y defensa del  patrimonio cultural. El \ncoronel Giovanni Pastore  ha trabajado  por m?s de 10 a?os en  la \nsecci?n de la  Polic?a italiana  dedicada a investigar estos delitos.\n\n?Desde cu?ndo hay en su pa?s una secci?n de la Polic?a dedicada al  \npatrimonio?\nDesde la d?cada de los setenta la Unesco recomend? que cada pa?s creara \nuna peque?a unidad especial de la Polic?a para defensa del patrimonio. \nNuestro comando est? compuesto por 300 hombres y   es parte de la \nPolic?a,  pero responde, funcionalmente, al  Ministerio de Cultura.\n\n?Siguen los casos tambi?n afuera de Italia?\nAl principio segu?amos las actividades  internas, pero cuando nos dimos \ncuenta de que las piezas sal?an de la frontera, buscamos  la forma de \nseguirlas tambi?n all?.\n\n?C?mo lo han hecho?\nCreando contactos con polic?as de  otros pa?ses, estudiando las rutas \ndel tr?fico de arte, viendo los coleccionistas m?s interesados.\n\n?C?mo se puede saber ese tipo de cosas?\nEs sencillo. Una persona que roba  una  pieza  cultural, naturalmente \ntiene referencias que  pueden ser otros  delincuentes o mediadores o, \nquiz?s, el comprador final de la obra robada.\n\n?Y ellos hablan de eso?\nTienes que  hacerte  buen amigo de los delincuentes  grandes, los que \nest?n relacionados  con el circuito  internacional del tr?fico de arte. \nEsto  te ayuda a entender su psicolog?a, c?mo se mueven, a d?nde van, \nqu? prefieren...\n\nUna amistad con inter?s.\n\nEn Italia  muchas cosas  funcionan as?. A los huaqueros, por ejemplo, el \nEstado los  ha contratado como ayudantes de los equipos de arqueolog?a. \nAs? se  puede controlar sus movimientos. Es una  posibilidad, no una \nregla.    \n\nO sea que la Polic?a tiene una  cosa menos que vigilar.\n\nComo digo, solo es una posibilidad. El departamento que comando tiene  \n12 n?cleos ubicados en las  regiones con m?s riesgos. Cada uno maneja \nunos 15 hombres  bajo el mando de un oficial.  \n\n?Cu?l es la relaci?n  con el Ministerio de  Cultura?\nTodos estos departamentos  trabajan junto a los funcionarios de las \noficinas del Ministerio de los cuales  recibe el soporte de conocimiento \ne informaci?n para saber si los  bienes de una requisa, por ejemplo, son \naut?nticos o si los que los ten?an eran los  due?os.  \n\n?C?mo llevan esos datos?\nTodos estos aspectos est?n concentrados en una base de datos que hemos \nacopiado desde hace m?s de 30 a?os sobre las obras que han sido robadas. \nPara empezar la investigaci?n necesitas saber las especificaciones de la \nobra, fotos, datos de  los ?ltimos  due?os. Si no tienes eso  no vas a  \npoder comprobar el hurto.\n\n?Existe una base con esos datos a escala mundial?\nNosotros  tenemos  la m?s grande del mundo. Hay otra en Lyon, Francia, \nen   la Secretar?a  General de la Interpol, pero es peque?a.\n\n?C?mo la han hecho?\nHay toda una estructura para manejar este tipo de delitos. Una  pieza \nclave  son los magistrados, pues en Italia   hay algunos especializados \nen este tipo de delitos con los cuales se establecen lazos para agilizar \nlos procedimientos.\n\n?C?mo  volver  viable esa  estructura en Ecuador?\nPrimero se necesita formar ?rganos que se ocupen solo de esta materia, \nen la Polic?a, en el Instituto, en el Gobierno... ante todo  hay que \nvolverse conscientes del patrimonio que tiene un pa?s y saber c?mo se lo \nda?a.\n\nSolo ah? se puede saber c?mo hay que protegerlo.\n\nHoja de vida\nGiovanni Pastore\nEs Vicecomandante  del Comando de Carabineros para la Tutela de \nPatrimonio Cultural de Italia, oficina a la que pertenece   hace 10 \na?os. Sus estudios  militares   los realiz? en la Academia Militar de \nModena y ha hecho carrera en  el Regimiento de Caballer?a de Carabineros.\n\nhttp://www.elcomercio.com\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Sat, 28 Apr 2007 08:24:09 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Law provides few protections for Indian mounds\nTo: Museum Security Network Mailinglist \nMessage-ID: <4632E889.3020406@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nLaw provides few protections for Indian mounds\nBy Quintin Ellison\n------------------------------------------------------------------------\n\nWhen it comes right down to it, the good will of private landowners is \noften what stands between saving Indian mounds and losing these pieces \nof ancient history.\n\n?There are no legal obligations regarding mounds on private property, as \nlong as the owners don?t disturb any burials that might be there,? said \nLinda Hall, a state archaeologist based in Asheville.\n\nIn the case of Cowee Mound, preservation efforts by the Hall family \nensured its survival. The family owned the mound for 175 years until the \ndeath of Katherine Hall Porter in 2002. The mound then passed to her \nhusband, James Porter. He and his heirs worked with the Land Trust for \nthe Little Tennessee and the Eastern Band of the Cherokee Indians to \nmake sure that it would be protected.\n\nThough there are other examples in Western North Carolina of private \nowners protecting mound sites, many have been lost. Hall said she?s \naware of 15 mound sites west of Asheville. Of those, at least two have \nbeen excavated or graded to obliteration.\n\n?Probably most mounds are on private property,? Hall said. ?(Cowee \nMound) is just so commendable, how the different organizations worked \ntogether. It is a great resource for the future.?\n\nThe law\n\nNorth Carolina?s Unmarked Human Burial and Human Skeletal Remains \nProtection Act requires that anybody ?knowing or having reasonable \ngrounds to believe? human skeletal remains are being disturbed notify \nthe county?s medical examiner. If the remains are discovered because of \nconstruction or plowing, those activities must cease immediately. Work \ncan?t resume without the state?s go-ahead.\n\nIf the remains are archaeologically significant ? not a modern skeleton, \nin other words ? the state archaeologist?s office is in charge. State \narchaeologists have 48 hours to make arrangements with the landowner to \neither protect or remove the remains. At the end of the 48-hour period, \nthe law states the chief archaeologist ?shall have no authority over the \nremains? and can?t stop the resumption of work on the property.\n\nIn this area, the Eastern Band gets notified if state archaeologists \ndetermine skeletal remains are Native American. The tribe and state \nreach an agreement on skeletal analysis and disposition.\n\nThat?s about all that governs private landowners. Otherwise, state law \nleaves it to an individual?s conscience, urging people ?to refrain from \nthe excavation or destruction thereof and to forbid such conduct by \nothers.?\n\nLost history\n\nNo one knows how many Indian mounds exist, or how many have been lost, \nnoted Russell Townsend, tribal historic preservation officer for the \nEastern Band.\n\nCyrus Thomas of the Bureau of American Ethnology attempted in the 1890s \nto catalogue mounds, but Townsend said many were never discovered and \nlisted.\n\n?I don?t know that an accurate count of mounds has ever been found,? he \nsaid.\n\nTownsend said the tribe is currently protecting four mounds, plus \nworking to help save more, including Spikebuck Town Mound and Village \nSite in Hayesville. Like Nikwasi Mound in Franklin, Spikebuck is \npublicly owned. And the Eastern Band owns and protects Kituwah Mound \nnear Bryson City.\n\nBoth Kituwah Mound and Peachtree Mound in Cherokee County were \nsignificantly reduced in size from years of plowing.\n\nWhat were they?\n\nMounds aren?t fully understood, but what is agreed is their service as \nfocal points for towns and communities.\n\n?They had religious as well as civil significance,? Townsend said. ?You \ncan see these purposes varying from region to region, culture to \nculture, and they evolved over time.?\n\nMounds weren?t necessarily used for burials, though they could be. And \nto further confuse things, platform mounds ? with straight sides and a \nstructure on top ? were sometimes built on top of the more humped burial \nmounds, Townsend said.\n\nThe tribal preservation officer pinpointed the primary mound-building \nperiod as taking place during the Mississippian culture from about 900 \nA.D. to 1650 A.D. They stopped being built shortly after contact with \nEuropeans occurred.\n\nCowee Mound was the center of a large Mississippian community that \nevolved into a large Cherokee town, he said. Cowee served as the \nbusiness capital of the Cherokee world.\n\nhttp://www.smokymountainnews.com/\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Sat, 28 Apr 2007 08:24:18 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Petroglyphs vandalized, tagged with gang graffiti\nTo: Museum Security Network Mailinglist \nMessage-ID: <4632E892.4090300@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n  Petroglyphs vandalized, tagged with gang graffiti\n\nBy Joline Gutierrez Krueger \n (Contact \n)\nWednesday, April 25, 2007\n\nPetroglyph National Monument is the latest target of an ongoing battle \nbetween Albuquerque gangs bent on proving dominance, this time by \nvandalizing the hallowed and historic park with graffiti.\n\nAt least eight large basalt boulders at the southern edge of the \nescarpment were marred with gang initials, or tags, written in silver \nmetallic spray paint.\n\nIt is unclear when the vandalism occurred, but monument Police Chief \nMatthew Fuller said residents in the nearby Parkwest subdivision off \nLava Bluff and Parkwest Roads Northwest began reporting the damage late \nlast week.\n\n\"Our neighbors of the park are very vigilant and very caring,\" Fuller \nsaid. \"They notify us as quickly as possible.\"\n\nBy Tuesday, tags had been removed from all but three boulders at the top \nof the ridge. Monument Superintendent Joseph Sanchez said his staff was \nhoping to complete the cleanup by late today or Thursday.\n\n\"We're sending a message that we're out there watching, and that such \nvandalism won't be tolerated and will be dealt with immediately,\" \nSanchez said.\n\nNo petroglyphs - ancient symbols carved in the rocks as far back as \n3,000 years ago - were damaged by the spray paint, and no other lasting \ninjury to the rocks was noted, Sanchez said.\n\nVandalism in the monument is rare but does happen on occasion, he said. \nBut one neighbor said it was the first time she could recall seeing such \nvandalism at the south end of the escarpment.\n\nTags on the rocks read \"TSK,\" short for Too Sick Krew, an offshoot of \nthe West Side Locos gang. Both have been embroiled in a deadly four-year \nwar with rival gang TCK, or Thugs Causing Kaos, that has claimed the \nlives of at least 11 people, including two children.\n\nTSK graffiti has multiplied across the West Side in the past three \nweeks, an apparent response to law enforcement efforts to dismantle \nrival TCK and thus put an end to the gang war.\n\nThe Bernalillo County Sheriff's Department launched a multiagency sweep \nApril 12, arresting two TCK suspects in two separate gang-related homicides.\n\nMayor Martin Chavez on Saturday announced the Albuquerque Police \nDepartment was also stepping up its anti-gang efforts. The initiative \nnetted 25 felony arrests, 110 citations, the recovery of two stolen \nvehicles and 59 grams of methamphetamine on Friday and Saturday.\n\nPetroglyph officials said it was too soon to estimate the cost of the \ndamage and cleanup. Sanchez said costs can add up quickly because the \nbiodegradable cleaning process must not harm lichens and other native \nvegetation.\n\nCare must be given, too, to the spiritual nature of the land. Some \nAmerican Indians, he said, believe the area is sacred.\n\nSanchez said park archaeologists, cultural and natural resource experts, \nlaw enforcement officers and park rangers were called in to handle the \ncleanup process.\n\n\"We do commend the city of Albuquerque and its graffiti abatement \nmeasures, but graffiti to the monument goes a little bit beyond that,\" \nSanchez said. \"We're charged with the preservation and protection of the \nsite for future generations.\"\n\nDamaging monument property is punishable by fines or incarceration; \nheftier penalties apply under the federal Archaeological Resources \nProtection Act if it can be proved that the suspect deliberately \nintended to damage the petroglyphs, Fuller said.\n\nThere are no leads so far, he said.\n\nhttp://www.abqtrib.com/\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Sat, 28 Apr 2007 08:24:24 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] SoCal man indicted for transporting stolen violins to\n\tEurope\nTo: Museum Security Network Mailinglist \nMessage-ID: <4632E898.602@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nSoCal man indicted for transporting stolen violins to Europe\n\nASSOCIATED PRESS\n6:22 p.m. April 25, 2007\nLOS ANGELES ? A man was indicted Wednesday on charges of transporting \ntwo rare, stolen violins worth more than $300,000 from Los Angeles to \nParis in an attempt to sell them.\n\nAnthony Eugene Notarstefano, 43, of Long Beach was charged with \npossession and foreign transportation of stolen goods. He faces up to 20 \nyears in federal prison if convicted.\n\nNotarstefano was arrested last month by French police after authorities \nsaid he approached the owner of a Paris violin shop with an offer to \nsell the two instruments for $65,000.\n\nIn a federal affidavit filed after his arrest, investigators said the \nviolins were stolen Dec. 23 from the home of Los Angeles Philharmonic \nviolinist Mark Kashper. One was crafted in the 18th century by Carlo \nTononi, and the other was made in the 19th century by Jean-Baptiste \nVuillaume.\n\nNotarstefano remains in French custody while awaiting trial there in \nconnection to the case, said Thom Mrozek, a U.S. Attorney's spokesman.\n\nHe will be extradited to face charges in the U.S. upon completion of the \nFrench case, Mrozek said.\n\nIt was not immediately known whether Notarstefano had hired an attorney \nto represent him in Los Angeles.\n\nhttp://www.signonsandiego.com/\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Sat, 28 Apr 2007 08:24:31 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Police find forged 'Kadishman sheep'\nTo: \"msn >> Museum Security Network Mailinglist\"\n\t\nMessage-ID: <4632E89F.2020805@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nPolice find forged 'Kadishman sheep'\n\n------------------------------------------------------------------------\nJonathan Beck, THE JERUSALEM POST \tApr. 26, 2007\n\n------------------------------------------------------------------------\n\nPolice have discovered multiple forgeries of Menashe Kadishman's \"sheep\" \npaintings after the artist himself alerted them that someone was faking \nhis works, Channel 2 reported on Thursday evening. He said the police \nhad made an arrest in the case.\n\nIn a televised interview, Kadishman said he was invited to exhibit his \nworks at a Ra'anana gallery, but when making a visit to check out the \ngallery was \"amazed and disgusted\" to find a painting on show there that \nwas supposedly by him and signed by him, but was actually a fake.\n\nKadishman recounted how he asked a friend of his to buy the picture, and \nthat the friend paid $900 for it. He said he sold his paintings for an \naverage of $3,000.\n\nThe artist said police had done a \"marvelous job\" in apprehending the \n\"thief,\" as Kadishman repeatedly termed him. It was unclear how many \nforgeries had already been sold by the gallery, and whether more of them \ncould still be found on the market elsewhere.\n\nKadishman, 76, a world-renowned Israeli artist, was schooled in Israel \nand London, and was Israel's representative in the 1968 4th \"Kassel \nDokumenta\" in Germany, one of the most important art festivals, held \nevery five years.\n\nHis early works were starkly abstract and often minimalist in concept. \nBut Kadishman's style became less abstract in the late 1970s when he \nbegan his long series of representational drawings revolving around the \nmotif of the sheep, a seemingly banal subject that in his work became \nladen with political and philosophical subtexts. He achieved \ninternational fame after 1985 when he expanded the sheep-theme to large \npaintings in full color.\n\nWhile his colorful sheep remain a staple of Israeli art around the \nworld, he no longer enjoys the critical acclaim he had enjoyed, \npartially because of the sheer quantity of sheep paintings.\n\nThe sheep's heads, in gay, bright colors, can be seen with their bemused \nexpressions from the display windows of many galleries in Israel, and in \nJerusalem one can even find several competing galleries on the same \nstreet displaying Kadishman works.\n\nThe forgeries recently discovered endanger the already saturated \n\"Kadishman sheep\" market because they call into question the market \nvalue of paintings already sold to collectors as authentic Kadishmans.\n\nAll forgeries found so far are said to be of the /pastiche /type, \nmeaning they are not accurate copies masquerading as existing works \n(such as a second \"Mona Lisa\"), but new pieces, created in a manner \ncarefully calculated to suggest the artist's own stylistic traits.\n\nAside from painstaking scrutiny by specialists, the only way to detect a \nforgery in such cases is to ask the artist himself to identify the pieces.\n\nIn a case like that of Kadishman, whose fame allows him both to avoid \nbeing represented exclusively by a single agent and to deal with many \ngalleries directly, the task of cataloguing becomes difficult unless the \nartist himself keeps a catalogue of his output.\n\nGalleries often buy his works secondhand, from collectors, and the \npaintings' provenance is based on certificates and testimonies.\n\nhttp://www.jpost.com\n\n\n\n\n------------------------------\n\nMessage: 8\nDate: Sat, 28 Apr 2007 08:24:37 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Candelabri rubati a Bologna recuperati a Mantova\nTo: Museum Security Network Mailinglist \nMessage-ID: <4632E8A5.1060502@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nCandelabri rubati a Bologna recuperati a Mantova\n\nCronaca Bologna -\nI Carabinieri della Stazione di Gonzaga, in provincia di Mantova, hanno \nrecuperato oggetti d'arte rubati per un valore compreso tra i 5 mila e i \n10 mila euro.\n\nI 'pezzi', alcuni angioletti e candelabri lignei particolarmente \ninteressanti per gli esperti di arte sacra del 7-800 italiano, facevano \nbella mostra di se' tra i banchi del mercatino del 'C'era una volta' ma \nai Carabinieri che, da sempre, sottopongono ad attento controllo tutta \nla merce in esposizione, non e' sfuggito che gran parte della bella \nmerce esposta sul banco condotto da M. A. 52enne, padovano d'origine e \nravennate d'adozione, era in realta' provento di un furto perpetrato a \nBologna nella notte del 23 scorso.\n\nGrazie alla collaborazione della polizia locale di Gonzaga - Pegognaga \ned alla disponibilita' della derubata, accorsa per riconoscere la \nrefurtiva, si e' proceduto quindi al sequestro della merce e, nella \nmattinata odierna, alla denuncia in stato di liberta' per ricettazione \ndel venditore che, affermava di aver regolarmente acquistato la merce in \ndata antecedente il furto.\nLa merce, tutta in legno dorato ed argentato del 7-800 italiano, e' ora \na disposizione della Procura della Repubblica di Mantova che dirige le \nindagini.\n\n(Data e ora pubblicazione: 26-04-2007 ~ 12:46)\n\nhttp://www.bologna2000.com/\n\n\n\n\n------------------------------\n\nMessage: 9\nDate: Sat, 28 Apr 2007 08:24:49 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Le pillage du ch?teau de Fontainebleau devant le\n\ttribunal\nTo: Museum Security Network Mailinglist \nMessage-ID: <4632E8B1.1020502@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nLe pillage du ch?teau de Fontainebleau devant le tribunal\n\nANG?LIQUE N?GRONI.\n Publi? le 27 avril 2007\nActualis? le 27 avril 2007 : 08h37\n\nTreize oeuvres d'art avaient disparu lors du cambriolage du domaine. Un \nantiquaire n?erlandais ?tait jug? hier pour recel en bande organis?e.\n \n? L'?POQUE directeur du Mus?e national du ch?teau de Fontainebleau, \nAmaury Lef?bure gardera longtemps en m?moire cette nuit du 15 au 16 \nnovembre 1995. En quelques minutes seulement, un fric-frac sans \npr?c?dent avait ?t? commis sur le domaine, qui abrite plusieurs belles \nsalles d'exposition consacr?es ? l'empereur Napol?on Ier. Treize \nsuperbes pi?ces - pendules, chars, vases et glaives d'apparat -, \nestim?es ? deux millions d'euros, avaient ?t? d?rob?es.\n \n? Un terrible ?pisode ?, selon ce directeur qui a d?, hier, se rem?morer \nce pillage men? selon lui par des professionnels. Sept ans apr?s les \nfaits, l'affaire ?tait port?e devant le tribunal correctionnel de \nFontainebleau. Une audience qui s'est d?roul?e avec des bancs de \npr?venus bien d?garnis.\n \nTrafic vers les ?tats-Unis\nAu lieu de pouvoir remonter tout un r?seau de trafiquants d'art, \nl'Office central de r?pression et de lutte contre le trafic des biens \nculturels (OCBC) n'a pu interpeller que les receleurs pr?sum?s, trois \nantiquaires n?erlandais, dont un seul ?tait pr?sent ? l'audience. Chez \neux, les policiers avaient retrouv? quelques objets, six au total ont \n?t? restitu?s au ch?teau. Parmi eux, deux vases de S?vres, des pendules \ndatant du premier Empire et un char en bronze.\n \n? la barre, les explications ont tourn? court. Ainsi, Franciscus Tanis, \nantiquaire extrad? en France dans le cadre de cette affaire, se dit \n?tranger ? tout trafic. ? Un marchand d'art a mis en d?p?t-vente chez \nlui une pendule recherch?e par les enqu?teurs. Il ignorait la provenance \nfrauduleuse de cette pi?ce ?, ass?ne son avocate, Me Laure Tric.\n \nPourtant en se chargeant de l'enqu?te, l'OCBC ?tait persuad? qu'il \nallait mettre au jour un vaste r?seau europ?en de trafic d'oeuvres d'art \napr?s une s?rie de pillages men?s dans les ann?es 1990 au pr?judice de \nch?teaux et mus?es. Parmi les sites visit?s, le Mus?e de la Renaissance \ndu ch?teau d'?couen, le ch?teau de Compi?gne, de Courances dans \nl'Essonne ou encore le Mus?e d'Ile-de-France ? Sceaux. Dans le m?me \ntemps, des vols d'oeuvres d'art avaient ?t? commis chez des particuliers \nen r?gion parisienne et dans le sud de la France.\n \nS'agissait-il d'une m?me ?quipe sp?cialis?e qui s?vissait sur tout le \nterritoire ? ? l'?poque, l'OCBC avait soup?onn? des gens du voyage. Sur \nla base d'?l?ments d'enqu?te, il avait par ailleurs estim? que les \nPays-Bas ?taient au coeur de l'affaire, ?rig?s en plate-forme d'un \njuteux trafic o? transitait la marchandise avant d'?tre exp?di?e aux \n?tats-Unis aupr?s de collectionneurs.\n \nDans ce coup de filet touchant le milieu des antiquaires, un nom s'est \nd?tach?. Celui de Petrus Schoofs, ?crou? dans son pays o? il purge une \npeine pour trafic d'ecstasy. Chez lui, plusieurs objets pr?cieux \nprovenant de diff?rents mus?es fran?ais avaient ?t? saisis. A-t-il jou? \nun r?le pr?pond?rant dans ce commerce illicite ? L'enqu?te n'a pas pu le \nd?montrer. Comme les deux autres antiquaires, il a ?t? mis en cause pour \ndes seuls faits de recel. Hier soir, le parquet a requis 30 mois de \nprison ferme - couverts par la d?tention provisoire - et 17 mois avec \nsursis contre Franciscus Tanis. Jugement le 28 juin.\n\nhttp://www.lefigaro.fr/\n\n\n\n\n------------------------------\n\nMessage: 10\nDate: Sat, 28 Apr 2007 08:24:43 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Heimkehr der Teufelsbibel\nTo: Museum Security Network Mailinglist \nMessage-ID: <4632E8AB.3080206@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n*Heimkehr der Teufelsbibel* \n26. 4. 2007\n\nDer wertvolle Kodex aus dem ?Kunstraub des Jahrtausends? wird wieder in \nPrag gezeigt\n\nEs war der wohl gr??te Kunstraub in der Geschichte der b?hmischen \nKronl?nder, eine tschechische Zeitung bezeichnete ihn dieser Tage sogar \nals den ?Kunstraub des vergangenen Jahrtausends?. Als im Juli 1648 ? \nwenige Monate vor Verk?ndung des Westf?lischen Friedens ? die Schweden \nPrag belagerten und die Kleinseite sowie die Prager Burg besetzt \nhielten, nahmen sie alles Wertvolle mit, dessen sie habhaft werden \nkonnten. Auf der Prager Burg stie?en sie auf die Kunstsammlung von \nKaiser Rudolf II., die dieser in vielen Jahren zusammentragen lie?. Die \ndamals weit ?ber die Grenzen des Habsburger Reiches bekannte \nRudolfinische Kunst- und Wunderkammer r?umten sie gr?ndlich aus und \nverschleppten einen Kunstschatz unermesslichen Wertes nach Stockholm in \ndie Schatzkammern der schwedischen K?nigin.\n\nDie Wunderkammer\n\nDie Rudolfinische Kunst- und Wunderkammer z?hlte zu den wichtigsten \nderartigen Sammlungen der ganzen Welt. 37 K?sten enthielten die \nkleineren Gegenst?nde, anderes lag auf Tischen oder war in Truhen \nuntergebracht. Rudolf II. ging, vor allem in seinen sp?teren \nLebensjahren, v?llig in seinen Sammlungen auf. Die politischen Gesch?fte \ndes Oberhauptes des R?mischen Reiches deutscher Nation mussten \nzur?ckstehen, wenn es galt, ein neues Sammlungsst?ck zu bewundern. Das \nfiel den Schweden nun alles in die H?nde.\nDer schwedische Historiker Peter Englund beschreibt den Umfang des \nRaubes, der an den Hof der schwedischen K?nigin Christina gebracht \nwurde: 69 Bronzestatuen, 29 Gegenst?nde aus Elfenbein, 660 Achatgef??e, \n16 Kunstuhren, 185 Gegenst?nde besetzt mit Edelsteinen, ganze Kisten mit \nDiamanten, tausende wertvolle Medaillen und etwa 500 Gem?lde, darunter \nBilder von Michelangelo, da Vinci, Rafael, Tizian, D?rer, Bosch und \nBruegel, sowie eine komplette Bibliothek mit tausenden B?chern und \nManuskripten.\n\nPrag hat diesen Verlust nie verwunden und immer wieder Versuche \nunternommen, wenigstens einen Teil der Kunstsammlung f?r Ausstellungen \nauszuleihen. Die Schweden trauten dem Frieden nicht, Leihgaben wurden \nimmer wieder abgelehnt. Man f?rchtete ? wohl zu Recht ? dass die Werke \nvon Prag beansprucht werden und nie wieder nach Stockholm zur?ckkehren. \nDer tschechische Staat machte seinerseits immer wieder seinen ? \nwenngleich nicht unumstrittenen ? Rechtsanspruch geltend. Auch nach der \nWende von 1989. Anfang der neunziger Jahre ?u?erte sich diesbez?glich \nsogar Pr?sident V?clav Havel. Stockholm zeigte ihm die kalte Schulter. \n?Ein solcher Anspruch ist zweifelhaft, weil so alle europ?ischen Museen \nleer ger?umt w?rden?, lautete die Antwort aus Schweden.\n\nParoubek erhielt einen Korb\n\n17 Jahre sp?ter lenkt Schweden wenigstens in einem Fall ein. Als \nTschechiens Premier Mirek Topol?nek vergangene Woche Stockholm besuchte, \ndurfte er die Teufelsbibel ansehen und die Nachricht verk?nden, dass der \nwertvolle mittelalterliche Kodex nach 357 Jahren wieder nach Prag kommen \nund auf einer Ausstellung des Nationalmuseums von September 2007 bis \nJanuar 2008 zu sehen sein wird. Wie sensibel die Leihgabe aber zu \nbehandeln ist, wei? der Politiker. ?ber R?ckgabeanspr?che wollte er \ngegen?ber einer tschechischen Tageszeitung ?nicht einmal im Fl?sterton? \nsprechen.\n\nSein Vorg?nger Ji?? Paroubek hatte sich noch vor zwei Jahren in \nStockholm einen Korb geholt. Auch er ersuchte bei seinem Schweden-Besuch \nim Herbst 2005 um die Ausleihung der kostbaren Handschrift und betonte, \ndass Tschechien keine Zweifel hege, dass die Bibel Eigentum der Schweden \nsei. ?Wir wollen sie nur ausleihen, selbstverst?ndlich ist dies keine \nRestitution von Eigentum?, hatte Paroubek gegen?ber seinen schwedischen \nGespr?chspartnern betont. Vergebens. Erst ? wie in Prag verlautbarte ? \nnach komplizierten Verhandlungen sind die Schweden nun bereit, die in \nder Fachwelt als ?Kodex gigas? bekannte Teufelsbibel an Prag auszuleihen\n\n/Von Uwe M?ller/\n\nhttp://www.pragerzeitung.cz\n\n\n\n\n------------------------------\n\nMessage: 11\nDate: Sat, 28 Apr 2007 08:24:56 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Frank Collection: Questions arise over artwork?s\n\townership\nTo: Museum Security Network Mailinglist \nMessage-ID: <4632E8B8.3000004@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nFrank Collection: Questions arise over artwork?s ownership\n\nBy ANNE CONSTABLE | The New Mexican\nApril 26, 2007\n\nCarvings allegedly disappeared from church after 1969\n\nAn Arroyo Hondo man has identified two Cristos in the collection of \nSpanish colonial religious art owned by Larry Frank as pieces that \ndisappeared from Our Lady of Sorrows church.\n\nThe state appropriated $3 million during the last legislative session to \nbuy the 263-piece collection and is currently assessing its contents.\n\nLarry Herrera said two large carvings by Juan Miguel Herrera vanished \nfrom the church north of Taos sometime after 1969. Many parishioners, \nlike Herrera, believed they were in the Frank collection.\n\nIn Holy Trinity Church in nearby Arroyo Seco there is a photograph of \nthe sacristy room of Our Lady of Sorrows. Herrera pointed out that on \nthe back of the framed picture an unidentified person has written, ?El \nSe?or Jesus Nazareno is missing ? either sold unlawfully or ? stolen!?\n\nLast week, Herrera met with Frank?s widow, Lycee, who directed him to \nthe two pieces, saying, ?These are the ones you want to look at.?\n\nOne is a crucified Christ in a loin cloth and the second is a standing \nChrist dressed in red. Both are about 5 feet tall.\n\nLycee Frank said the couple purchased both pieces from Marcos Ortiz and \nNarcisso Arellano, both now deceased, for an undisclosed amount. She \nalso confirmed that Marcos? brother, Manuel, 94, sold the Franks the \nmorada that became their home and where the collection is currently located.\n\nHerrera said Arellano was the last member of the Roman Catholic \nbrotherhood associated with the morada.\n\nThe carver, Juan Miguel Herrera, was born in Arroyo Hondo in 1835 and \ndied in 1903. He produced most of his work from the 1870s to the 1890s. \nThe Franks owned a number of his Cristos that were valued between $6,400 \nand $40,000 in a 2005 appraisal. That document estimated the entire \ncollection was worth $4.8 million.\n\nAccording to Herrera, the sellers did not have the authority to dispose \nof them. ?These were made for the churches; they were never intended for \nthe hermanos,? Herrera said, referring to the Brotherhood of the Penitentes.\n\nHe said he told Lycee Frank that both pieces should be returned to the \nchurch in Arroyo Hondo, but she said it was ?too late for that.?\n\nIn an interview Wednesday, Lycee Frank said there have been no \ndiscussions with the state about ?repatriating? the pieces. The sale of \nthe collection is ?all over? she said, and questioning the provenance of \npieces in it is a ?lot of nonsense.?\n\n?The less in paper about this the better I like it,? she added.\n\nBut Herrera wrote in a column in The New Mexican earlier this month that \nthe provenance of the pieces is ?relevant to those of us who are \ndescendants of the hermanos, creators of the santos and builders of the \nmoradas. A culture and its intrinsic parts do not belong in the market \nplace.?\n\nHerrera said Lycee Frank also showed him two retablos previously \nassociated with San Francisco de Asis in Ranchos de Taos.\n\nHerrera said he got interested in the missing pieces while working on a \nrestoration at Our Lady of Sorrows.\n\nThe state recently hired Joan Caballero to appraise the collection as \npart of its plan for assessing and purchasing the artworks. Various \ngroups of experts have recently visited the Frank morada, including \nrepresentatives from the Department of Cultural Affairs, santero and \nauthor Charles Carrillo, and Jos? Archuleta, the hermano mayor of the \nMorada de Chamita who has also been looking into missing devotionals.\n\nThe next scheduled visit is May 17, and that group includes the state \nhistorian, a Spanish Market artist and members of the Museum of New \nMexico Board of Regents.\n\nThe board is the group that must ultimately decide to accept the \ncollection, and its thinking is not clear. In private and in public \nmeetings, some members have expressed concerns about the purchase.\n\nOne worry in the museum world is that potential donors might in the \nfuture ask the state to buy their artworks in lieu of making a bequest.\n\nContact Anne Constable at 995-3845  \u0007or aconstable@sfnewmexican.com.\n\nhttp://www.santafenewmexican.com\n\n\n\n\n------------------------------\n\nMessage: 12\nDate: Sat, 28 Apr 2007 11:22:59 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Namibia. Burglary At National Arts Gallery Thwarted\nTo: \nMessage-ID: <007a01c78976$d07a4a10$716ede30$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nBurglary At National Arts Gallery Thwarted \n\nNew Era (Windhoek) \nNEWS\nApril 27, 2007 \nPosted to the web April 27, 2007 \n\nBy Frederick Philander\nWindhoek \n\nAn attempted burglary at the Namibia National Arts Gallery in the early\nhours of last Friday morning was thwarted in the nick of time, thanks to the\nalarm system and the quick response of a local security company. \n\nThe PRO of the NNAG, Paul Hamman, told Art/Life that nothing was stolen from\nthe premises. \n\n\"The attempted burglary occurred at 04h00 on Friday. The culprits tried to\nbreak down the front door. However, the would-be thieves ran away when the\nalarm system went off and security guards shortly thereafter rushed onto the\nscene. It could have been catastrophic, bearing in mind that the valuable\nnational art collection is stored in a vault in the building,\" a relieved\nHamman said. \n\nThe incident happened the same day on which the director of the gallery,\nartist Joseph Madisia, left on a week-long art management business trip to\nGermany, by courtesy of the American Cultural Centre. This was apparently\nthe first attempt by hooligans to try and break into the building since\nMadisia took over the management of the gallery. \n\n\"The audacious thugs abortively tried to gain forced entry through the front\ndoor,\" said Hamman, who confirmed that heavily armed security guards are now\nguarding and patrolling the government entity on a full time basis. \n\nDirector Joseph Madisia returned to the country yesterday. \n\nOther African galleries have in the past suffered tremendous damages due to\nsenseless burglaries in which irreplaceable artworks, considered to be the\npride of any nation, were stolen and never recovered. \n\n\"I suspect this was purely an ordinary burglary and not an organized and\nsophisticated attempt to steal artworks,\" a relieved Hamman said. \n\nSeveral art exhibitions are currently on display at the Namibia National Art\nGallery. \n\nhttp://allafrica.com/stories/200704270240.html\n\n\n\n------------------------------\n\nMessage: 13\nDate: Sat, 28 Apr 2007 11:22:59 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The people of Monteleone Di Spoleto beg for the return\n\tof an\tancient Etruscan chariot on display at the Metropolitan\tMuseum\n\tof Art in New York City.\nTo: \nMessage-ID: <007b01c78976$d29254a0$77b6fde0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nCarry the chariot home \nSaturday, April 28, 2007\nBY MICHAEL ROVELLO\n\nWhen Hamilton Township Mayor Glen Gilmore visited the village of Monteleone\nDi Spoleto, the people of the village at a public meeting pleaded for help\nin getting back an ancient Etruscan chariot, a priceless work of art found\nin their village (\"Relic sparks a family affair,\" April 11). The chariot is\non display at the Metropolitan Museum of Art in New York City, where\nofficials claim that they paid for it. They have since refused to make\nfurther comment. \n\nIt has been the custom over the years for wealthy patrons of the arts to go\naround the world and scoop up works of art for peanuts from destitute and\nunsophisticated people. Many times, the treasures are spoils of war;\nsometimes they have simply been appropriated. That is how art treasures left\nChina and Egypt and Peru and Mexico. \n\nOne of the most egregious examples of the plundering of another country's\nart is the story of the Elgin Marbles taken from the Parthenon 200 years ago\nin a deal with Turkey, the country that ruled Greece for a brief time. Not\nonly did bribes enter the picture, but Lord Elgin paid a pittance for the\npriceless Parthenon statuary and friezes he sent to England. Greece has been\ndemanding their return ever since. (See \"Imperial Spoils: The Curious Case\nof the Elgin Marbles\" by Christopher Hitchens.) \n\nSome very interesting points Hitchens makes concerning the Elgin Marbles\ndescribe the specious arguments that the British have used to justify their\nexpropriation: If all artifacts were returned, museums would have to close;\nmore people are able to see them in the British Museum; they are less prone\nto pollution damage; they are well cared for; they paid for them. The\nsuggestion was made by one of The Times' readers that he would prefer to see\nthe chariot remain in the Metropolitan Museum for some of the very same\nreasons -- reasons that I find arro gant, patronizing and unconvinc ing. \n\nThe King Tut exhibit, which is enjoying its second U.S. tour in 30 years, is\nonly one example that destroys all but the final argument. Museums draw\nenormous crowds with their traveling exhibits that, by visiting multiple\nsites, draw people from distances too far removed to see them in a single\nlocation. Even when traveling, exhibition items are meticulously preserved.\nAs for paying for the artifacts, ownership of expropriated property is\ndubious, even when efforts are made to legitimize it using the name of a\nhighly regarded museum. The net effect of such an action is to render\nquestionable the esteem felt for the institution. \n\nMore than three-quarters of the world's art treasures are located in Italy.\nThe Italians are the world's greatest restorers and preservers of art and\nancient artifacts, and they are perfectly capable of caring for their\nchariot as well. The Etruscan chariot does not belong in the Metropolitan\nMuseum of Art. It should be restored to its rightful owners, the people of\nMonteleone Di Spoleto, who beg for its return. \n\n\n\nMichael J. Rovello is a retired Hamilton Township school principal.\n\nhttp://www.nj.com/opinion/times/editorials/index.ssf?/base/news-0/1177733185\n211540.xml&coll=5\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 103\n****************************************\n\n"}