{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "Shun Wong <shunlee_w@yahoo.com.tw>", "subject": "YOUR ASSISTANCE PLEASE!", "body": "\nDEAR FRIEND,\n \nMY NAME IS MR.SHUN WONG, WORKING WITH THE FINANCE DEPT. WITH TAISHIN INTERNATIONAL BANK, TAIPEI TAIWAN\n \nWE HAD A FOREIGN CUSTOMER WHO DEPOSITED A HUGE SUM OF MONEY WITH OUR BANK, WHO LATER DIED AS A RESULT OF PLANE CRASH. BEFORE HIS DEATH, HE INSTUCTED  THAT THE AMOUNT SUM OF US$26.5M (TWENTY-SIX MILLION FIVE HUNDRED THOUSAND UNITED STATES DOLLARS) BE TRANSFERED TO A FINANCE HOUSE IN LONDON.\nSINCE THE DEATH OF THIS CUSTOMER, I PERSONALLY HAVE WATCHED WITH KEEN INTEREST TO SEE THE NEXT OF KIN BUT ALL HAS PROVED ABORTIVE AS NO ONE HAS COME TO CLAIM HIS FUNDS OF US$26.5M (TWENTY-SIX MILLION FIVE HUNDRED THOUSAND UNITED STATES DOLLARS) WHICH HAS BEEN WITH THE FINANCE HOUSE IN THE UK FOR A VERY LONG TIME. ON THIS NOTE I DECIDED TO SEEK FOR WHOSE NAME SHALL BE USED AS THE NEXT OF KIN AS NO ONE HAS COME UP TO BE THE NEXT OF  KIN.\n \nIN VIEW OF THIS I GOT YOUR CONTACT THROUGH MY COUNTRY`S FOREIGN TRADE MISSION AFTER I WAS CONVINCED BY PROVIDENCE THAT YOU COULD BE USED AS THE NEXT OF KIN.\n \nTHE REQUEST OF THE FOREIGNER AS A NEXT OF KIN IN THIS BUSINESS IS OCCASIONED BY THE FACT THAT THE CUSTOMER WAS A FOREIGNER AND SOMEBODY IN LONDON OR TAIWAN CANNOT STAND AS THE NEXT OF KIN TO OUR LATE CUSTOMER , I AGREED THAT US$5 MILLION OF THIS MONEY WILL BE FOR YOU AS A FOREIGN PARTNER FOR PROVIDING AN ACCOUNT, WHILE THE REST WILL BE FOR ME, THEREAFTER, I WILL VISIT YOUR COUNTRY FOR IS BURSEMENT AS I AM ALMOST DUE FOR RETIREMENT.\n \nTHEREFORE, TO FACILITATE THE IMMEDIATE TRANSFER OF THIS FUND TO YOUR ACCOUNT AS ARRANGED, YOU MUST APPLY FIRST TO THE FINANCE HOUSE AS A RELATION TO THE DECEASED INDICATING YOUR PRIVATE TELEPHONE NUMBER, AND FAX NUMBER FOR EASY COMMUNICATION AND LOCATION WHERE THE MONEY WILL BE REMITTED.\n \nUPON THE RECEIPT OF YOUR REPLY, I WILL SEND YOU BY FAX OR E-MAIL THE NEXT STEP TO TAKE. I WILL NOT FAIL TO BRING TO YOUR NOTICE THAT THIS BUSINESS IS HITCH-FREE AND THAT YOU SHOULD NOT ENTERTAIN ANY FEAR AS THE WHOLE REQUIRED ARRANGEMENT HAS BEEN MADE FOR THE TRANSFER.\n \nYOU SHOULD CONTACT ME IMMEDIATELY YOU RECEIVE THIS EMAIL\n \nTRUSTING TO HEAR FROM YOU.\n \nYOURS RESPECTFULLY,\n \nSHUN WONG.\n\n\n\n\n"}