{"category": "ham", "to_address": "\"Thomas L Jones\" <jones3745@verizon.net>", "from_address": "Martin Maechler <maechler@stat.math.ethz.ch>", "subject": "Re: [R] Getting and using a function", "body": ">>>>> \"Thomas\" == Thomas L Jones \n>>>>>     on Thu, 12 Apr 2007 22:28:33 -0500 writes:\n\n    Thomas> I am trying to do what is perhaps the most basic procedure which can be done \n    Thomas> with the R software.\n\n    Thomas> Under Windows XP Home Edition, I want to get a copy of the function \"gam,\" \n    Thomas> then put it in and use it. I intentionaly use informal terms, rather than \n    Thomas> technical terms whose exact meaning I might or might not know.\n\n\n    Thomas> I am finding this extremely frustrating. Every time\n    Thomas> I try to do anything, all I get is error\n    Thomas> messages.\n\nSo have you really read (and tried to understand) the \n\"Introduction to R\"  that's web- available and comes built \ninto R?\n\n    Thomas> only three or four or five steps involved. Well,\n    Thomas> what are they? There is all this opaque\n    Thomas> terminology. There are libraries, and packages, and\n    Thomas> one downloads them, loads them, and installs them,\n    Thomas> but just what all this means is unclear.\n\n    Thomas> One example among many: I tell it\n\n    Thomas> library (gam)  all I get is an error message.\n\n    Thomas> Error in library (gam)  : there is no package called 'gam'\n\n\n\n    Thomas> Well, does this mean what it says, or does it mean something different? For \n    Thomas> example, does it mean that such-and-such computer program has not yet been \n    Thomas> downloaded?\n\nWell it means that \"for your version of R\" there is no package\ncalled 'gam' available, i.e. \"what it says\"\n\nor do you expect software to tell you something about the world at\nlarge, namely that there is no R package named 'gam' on the\nwhole wide world ?  :-) \n\n\n[ BTW, for using a more modern version of gam(),\n  there's the recommended package 'mgcv' - which you don't have\n  to install :\n\n  library(mgcv)\n  help(gam)\n\n  ....\n]\n\n\n    Thomas> I did download and install the 2.4.1 flavor\n    Thomas> (version?) of the gui. I infer, reading between the\n    Thomas> lines a bit, that there may be a sort of standard\n    Thomas> procedure for setting things up, perhaps downloading\n    Thomas> and installing the utils package, or something.\n\n    Thomas> The R software has much gold in it, but, as far as\n    Thomas> learnability/usability is concerned, I give it poor marks.\n\nWell it is recommended that you learn it from a human rather\nthan from \"itself\".  One way to learn from humans is by reading\nbooks, manuals, ....\nand for R, there are quite a few, both freely available with R\nand on the web, and others \"in a bookstore near you\" ...\nA more comfortable way for some is to attend a course / class...\n\nI hope you can bear the somewhat flippy tone of my answer,...\nI'm just trying to counter your own humorous one ;-) :-)\n\nRegards,\nMartin\n\n    Thomas> Tom Jones\n    Thomas> DrJones at alum.MIT.edu\n\n    Thomas> ______________________________________________\n    Thomas> R-help@stat.math.ethz.ch mailing list\n    Thomas> https://stat.ethz.ch/mailman/listinfo/r-help\n\n    Thomas> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n\t    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\nthat also may be a quite useful resource to read ...\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}