{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@flax9.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "SatCon Technology to Report Quarterly Results for the Quarter Ended March 31, 2007", "body": "\n\n\n\n\n\n\n\n\nSatCon Technology to Report Quarterly Results for the Quarter Ended March 31, 2007\n\nBOSTON, May 10, 2007 (BUSINESS WIRE) --  SatCon Technology Corporation(R) (Nasdaq CM: SATC), a developer and supplier of power management and system architecture solutions for the alternative energy and distributed power markets, today announced that on Monday, May 14, 2007 at 10:00 AM Eastern Time, the Company will conduct a conference call to discuss its financial results for the quarter, ended on March 31, 2007. The Company will publish an earnings press release prior to the conference call. David Eisenhaure, Chief Executive Officer will host the call to review the company's results and operations. Interested parties should call 866-290-0916 (US and Canada) or 913-312-1226 (International) five minutes in advance to participate. The call will also be open to all interested investors through a live audio Web broadcast accessible at the SatCon corporate website, www.satcon.com. For those unable to listen to the live broadcast, the call will be archived on the above-mentioned site. About SatCon Technology Corporation SatCon Technology Corporation is a developer and manufacturer of electronics and motors for the Alternative Energy, Hybrid-Electric Vehicle, Grid Support, High Reliability Electronics and Advanced Power Technology markets. For further information, please visit the SatCon website at www.satcon.com. (SATC-E) Statements made in this document that are not historical facts or which apply prospectively are forward-looking statements that involve risks and uncertainties. These forward-looking statements are identified by the use of terms and phrases such as \"will,\" \"intends,\" \"believes,\" \"expects,\" \"plans,\" \"anticipates\" and similar expressions. Investors should not rely on forward looking statements because they are subject to a variety of risks and uncertainties and other factors that could cause actual results to differ materially from the Company's expectation. There can be no assurance that the company will continue to maintain this level of new orders or that it can successfully deliver the components and systems ordered. Additional information concerning risk factors is contained from time to time in the Company's SEC filings. The Company expressly disclaims any obligation to update the information contained in this release. SOURCE: SatCon Technology Corporation(R) SatCon Technology Corporation(R)\nDan Gladkowski, 617-897-2411\nVP, Administration\n\n\n\n\n\n\n\n\n\n\n You are subscribed to SatCon Technology Corporation Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n SatCon Technology Corporation \n 27 Drydock Ave. 6th Floor, South Boston, MA 02127\n Service provided by Shareholder.com \n\n\n\n\n\n"}