{"category": "spam", "to_address": "Gnitpick <gnitpick@flax24.uwaterloo.ca>", "from_address": "Barbara Sutton <extremegod@girbau-consulting.com>", "subject": "Tasty pills", "body": "\n\nCan you satisfy your girlfriend? Or you are afraid that she meets with someone who is better than you in bed?\nOur pharmacy\nWe have pills for any disease: ED, Weight loss, Antibiotics etc. Instant shipping, perfect support!\nOur pharmacy\nBuying at our pharmacy - the best choice you can make!\nWith best regards,\nBarbara Sutton\n \n \nKvin shmygnul nosom, chuvstvuia, kak k glazam Podstupaet predatelskaia vlaga, no vzial sebia v ruki. Etot tip byl opasen. On stoial v okruzhenii gveltov, i eti Serye tvari, pohozhe, pokorno vnimali kazhdomu ego slovu, slovno on byl ih Povelitelem. Tolko Celitel sovsem nichego ne vzial i, shagaia Nalegke, v dushe, veroiatno, prosto poteshalsia nad ostalnymi. \nOdin Nol v polzu Nori. Svet pered licom zaslonila vysokaia ten. Ia rezko vypriamilsia, chuvstvuia, kak po spine probezhal ledianoj oznob, Rasprostraniaia vnutri volny pravednogo gneva. Hot zdes v ego rabote Smotritelia kakoj-to prok v gorode, byvaet, po ulicam lysuny vsiu noch shastaiut, Do samogo utra, chtob posle v svoj poganyj les ubratsia, zhrut vsiakij musor da Raznyh zhivotnyh domashnih, za koimi hoziaeva nedogliadeli. On Pricoknul iazykom. Etogo trebuet chest nashej professii. Kozha potemnela. Ot etogo nam Uzhe bylo ne ubezhat. \nVot esli by chuzhak byl mestnym magikom, Proshedshim prisvoenie Ranga, to togda cvet ego odezhd znachil by nechto vesma Nepriiatnoe dlia ih obladatelia. Zhmurias ot sveta, Taj neponimaiushche ustavilas v sklonivsheesia nad nej Ozabochennoe tolstoshchekoe lico barmena Zametiv, chto ona ochnulas, Donik nemnogo Otodvinulsia i otvel ruku s mednym maslianym svetilnikom v storonu, predostaviv Vozmozhnost ee glazam smotret v seryj, nebelenyj potolok. Pochemu ty prosto ne Najmesh kogo-nibud iz mestnyh? Ty nichego ne esh. Namestnik v bezopasnosti, on Uzhe neskolko chasov kak v puti. ejisuminyon VVFcRlhQUVh0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}