{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "1245p 6/21 Update: Russian computers, in test, won't start without jumpers", "body": "\n\n\n\n\n1245p 6/21 Update: Russian computers, in test, won't start without jumpers\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 86\nPosted: 12:41 PM, 6/21/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-84 (06/21/07): Astronauts prepare for entry; Russian computer test on tap\n   SR-85 (06/21/07): Atlantis entry delayed at least one orbit due to weather\n   SR-86 (6/21/07): Two Russian computers fail to restart when jumpers removed for test; other four computers continue working normally; troubleshooting continues\n\n=================================\n\n12:41 PM, 6/21/07, Update: Two Russian computers fail to restart when jumpers removed for test; other four computers continue working normally\n\nSpace station commander Fyodor Yurchikhin today tried and failed to get two space station computers to boot up after jumper cables bypassing suspect power supply switches were removed.\n\nThe jumpers were installed last week to recover from a crippling failure that knocked all six of the station's main computers out of action. The electronic bypass surgery worked, and all six computers later were rebooted.\n\nEarly today, with four computers on line and working normally, Yurchikhin and flight engineer Oleg Kotov fired up the two computers held in reserve to make sure they were healthy, then shut them down and removed the bypass cables. They then attempted to restart the machines but they failed to reboot.\n\nThe test would seem to indicate that whatever problem affected the operation of secondary power supply switches last week was not a transient event. Engineers still don't know what caused the original problem and troubleshooting continues.\n\nIn the meantime, Yurchikhin plans to restart the station's Elektron oxygen generator later today, one of the last major systems to be reactivated in the wake of the computer trouble last week.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}