{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTHURSDAY 26 APRIL 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM KIRSTY WARK\n\t\t\t\t\t\n\t\t\t\t\tDear viewers\n\n\n\nLOCAL ELECTIONS\n\n\nTonight we cast ahead to The Big Vote a week today - the English local elections, Scottish Parliament and Welsh Assembly elections, and the possible outcome. How will the parties do? \n\n\nNewsnight has commissioned some exclusive research from the UK's leading election study centre in Plymouth which offers up some shocking news for the politicians. We have predictions of share of the vote, seats won and lost, and what it would mean if it was repeated in a general election. \n\n\nTARTANOMICS\n\n\nAhead of the Scottish parliament elections commentators have been writing reams about the possible break up of the Union - if the opinion polls are to be believed it is a serious prospect - and the impact would be felt throughout the UK. \n\n\nStephanie Flanders has been investigating tartanomics - that's tartan-omics not tart-anomics. How would an independent Scotland fare? Would it be better or worse off and are the SNP's economic plans credible?\n\n\nA LOAD OF RUBBISH?\n\n\nAnd The Great Bin Scandal is becoming one of the biggest issues in the English local elections. \"The alternative weekly collection\" is supposedly cheaper and greener, but the government's not to keen to tell you about it ahead of next Thursday's vote - so how do you feel about rubbish collection reduced to once a fortnight? \n\n\nTonight we are delighted that Talk Sport's shock jock James Wales will join us live from his own show to express his outrage at the plans and debate with the Green Party for whom this move represents environmental progress.  \n\n\nStand well back - but do watch. \n\n\nKirsty\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nSOMALIA GENOCIDE\n\n\t\t\t\t\t\t\tSomalia's leading female politician gives a rare interview about the \"genocide\" in her country\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}