{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Bobby Irvin\" <jowcoffmanfamilynos@coffmanfamily.com>", "subject": "Anatrim will change your life", "body": "\nYou'll love the new, non-obese you\n\n\n\n\n\n\nAnatrim – The very up-to-date and most exciting lose flesh product is made available now – As you could see on BBC.\n\n\nDo you retain all the situations when you said to yourself you would do anything for being delivered from this quickly growing pounds of fat? Fortunately, now no big price is to be paid. With Anatrim, the ground-breaking kilos-melting combination of elements, you can achieve naturally health mode of life and become really thinner. Have a look at what people say!\n\n\n\n\"I hate to admit it but I was a junk food addict. \n\n\nI greedily devoured all this garbige \n\n\nand just could not stop. \n\n\n\n\nThis misery stopped when I started taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite abated, \n\n\nmood increased and I’m the happiest person 18 pounds in 2.4 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nLinda F., Chicago\n\n\n\n\n\n\"I had problems with over-weight since I was a boy. \n\n\nIt’s difficult to imagine how I hated being mocked at school. \n\n\n\n\nI abhorred my stoutness and I abhorred myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nThis stuff literally took me out of this terrible nightmare! A lot of thanks to you, fellows.\"\n\n\n\n\n\nSerge Smith, San Diego\n\n\n\n\n\n\"Do you know what? My marriage was saved thanks to Anatrim! I went into this circle, depression – eating more – more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nMy friend pointed at your site and I ordered up my pack of Anatrim right away. \n\n\nThe result was splendid, my appetite became normal, I was in a good mood oftener, and, certainly, I became able to tighten my belt on some holes. And you know, the bed became cool also!\"\n\n\n\n\n\nTom\n\n\n\n\n There is a lot of sincere gratitudes left by happy people trying Anatrim. Why don't you add yourself to the tens of thousands of slim buyers and take this natural appetite-abating power raising product now!\n\n\nDon’t decline your chance!\n\n\n\n\n"}