{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"John Heim\" <jheim@math.wisc.edu>", "subject": "Re: the joy of procmail was Re: off-topic posts", "body": "Right, well, the clutter (if you can even call it that) isn't really my main \nproblem with the OT posts. My main problem is that I think this list has \nbecome the de-facto list for blind linux user questions and it has all but \nkilled off the blinux list. That's a shame because:\n1. That list is a lot more publicized\n2. It actually is for general linux questions for the blind\n\nIf you google \"blind linux user\"  the first couple of links are for the \nblinux list. I don't know how far you have to go down before you find a link \nto this list but it's more than a handful. I'm afraid that blind linux users \nare going to find the blinux list and conclude that there isn't much of an \nactive blind linux user community.  And even if they find this list, they \nwould conclude that it's about speakup. Not about orca or emacspeak.\n\nI don't know how many people on this list are also on the blinux list. Not \ntoo many I think.   But every once in a while you get someone asking how to \nget started with linux. I've  steered some people here saying speakup is \nprobably the best way to get started.\n\nI don't know... I just think that if this list is going to be about linux \nfor the blind, it should say so. Neatness counts. And the problem isn't \n*really* with my .procmailrc.\n\nlist----- Original Message ----- \nFrom: \"Gregory Nowak\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Tuesday, May 01, 2007 1:13 PM\nSubject: Re: the joy of procmail was Re: off-topic posts\n\n\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA1\n>\n> This is true, and, procmail isn't the only option in that\n> department. Maildrop/mailfilter is another tool that does the same\n> thing, and there are probably other such programs that I don't know\n> about.\n>\n> Greg\n>\n>\n>\n> On Tue, May 01, 2007 at 09:40:26AM -0500, C.M. Brannon wrote:\n>> We're Linux people, and we have powerful tools at our disposal...\n>> A well-crafted procmail rule or two can do wonders.\n>> Most of the Orca/Ubuntu/distro-of-the-day messages have a\n>> relevant subject line.\n>>\n>> Take care,\n>> -- Chris\n>>\n>>\n>> _______________________________________________\n>> Speakup mailing list\n>> Speakup@braille.uwo.ca\n>> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n> - -- \n> web site: http://www.romuald.net.eu.org\n> gpg public key: http://www.romuald.net.eu.org/pubkey.asc\n> skype: gregn1\n> (authorization required, add me to your contacts list first)\n>\n> - --\n> Free domains: http://www.eu.org/ or mail dns-manager@EU.org\n> -----BEGIN PGP SIGNATURE-----\n> Version: GnuPG v1.4.6 (GNU/Linux)\n>\n> iD8DBQFGN4NX7s9z/XlyUyARAhBhAJwNtmti7iU5fIfo+5tJ9Tgyx6RT1wCcC/L/\n> A1UQ01fxlFj9WwkZNa1Ktio=\n> =je+S\n> -----END PGP SIGNATURE-----\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}