{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CNN Alerts <cnnalerts@mail.cnn.com>", "subject": "CNN Alerts: bush", "body": "\n\n\nCNN Alerts: bush\n\n\n\n\n\n\n \n\n\n\nAlert Name: bush\nTonight's facts\n\n07/05/07 11:18 AM, EDT\nHere is the GAO report that is critical of US-VISIT    Here are the responses we got when we called DHS re US VISIT:     US-VISIT (and DHS) has been collecting biometrics at 115 airports, and 14 seaports since January 4, 2004. In 2005, we expanded this capability to 154 land ports of entry. As of today, we have successfully collected biometrics?fingerprints and a digital photograph? from over 90 million foreign travelers to the United States and have denied entry to thousands based on the biometrics and have prevented countless individuals from using a fraudulent document to gain entry into the United States and threaten the safety of our citizens and visitors.     We are in the process of transitioning from the collection of two to the collection of 10 fingerprints when foreign travelers enter the United States. By implementing this 10?fingerprint collection standard, we will improve the accuracy with which fingerprints are matched, making the entry process for travelers more efficient, more effective and more reliable. We will begin testing the ten-print collection at U.S. airports by the end of this year (2007). Airports that will test this capability include New York's JFK Airport and Washington Dulles International Airport.     We are moving forward with implementing US-VISIT biometric exit controls a at U.S. airports. Biometric exit control is a priority for securing our nation's borders. During the last three years, we have conducted significant testing on US?VISIT biometric exit requirements and based on our pilots that ended in May 2007 at 12 airports, we had learned that the technology works but that traveler compliance needs to be improved. As a result, we will be incorporating biometric exit controls into the airline check?in process. This option will minimize the impact on legitimate foreign travelers and dramatically improve compliance. DHS plans to implement biometric air exit controls by the end of 2008.     When I asked someone with the Secure Border Initiative to respond to criticism from Duncan Hunter regarding the Secure Fence Act that Bush signed into law, which requires \"interlocking camera's be installed from Calexico, CA, to Spielas, AZ by May 30, 2007. As the author of the fencing and surveillance provisions of the Secure Fence Act, Congressman Hunter specified May 30 because July is the hot season, where most deaths occur on the border. The purpose of the cameras, among other things, is to prevent the illegal entry and the death of border crossers. So far this year, 121 people have died trying to cross through this corridor. This is another example of DHS refusing to follow the mandates of the Secure Fence Act and put in place the border infrastructure required by law. The act calls for 854 miles of fencing - DHS announced it will only build 370 miles. (from Duncan Hunters office)    \"Customs and Border Protection is working with a sense of urgency in deploying additional technology and developing additional infrastructure at the border. For the first time in America's history, we have a comprehensive plan to secure our nation's borders. With the help of Congress, CBP is on track to doubling the size of the Border Patrol, completing 370 miles of fencing and 200 miles of vehicle barrier and deploying the technology that will equip agents with the tools they need to gain effective control of our borders.\"\nFULL STORY\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.                               \nTo alter your alter your alert criteria or frequency or to unsubscribe from receiving custom email alerts, click here.\nRefer a friend or colleague to CNN's FREE personalized alerting service!\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network, LP, LLLP.\nA Time Warner Company. All Rights Reserved.\nTerms  under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\n\n\n\n\n"}