{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: License concerns regarding package lft", "body": "Terry Hancock \n> MJ Ray wrote:\n> >>7.  no permission is granted to distribute, publicly display, or publicly\n> >>perform modifications to the Distribution made using proprietary materials\n> >>that cannot be released in source format under conditions of this license;\n> > \n> > Is this saying (amongst other things) that someone cannot use any\n> > incompatibly-licensed compiler to produce binaries of it?  \n> \n> IMHO, it does NOT mean that.\n> \n> I think that a compiler or other toolchain element is not a \"material\"\n> -- \"materials\" are things that go into a structure and become part of\n> it: lumber, paneling, roofing, etc. NOT circular saws, hammers, jigs,\n> etc. This would be as opposed to \"tools\": [...]\n\nSo, in your opinion, houses are not made using tools and binary packages\nare not made using compilers?\n\nI disagree.  I think that it might be debatable if it said 'made from'\nbut it doesn't.\n\nThe meaning of tools doesn't change the meaning of materials.  Overlapping\nmeanings and different meanings for similar words in different fields\nare not that unusual in English.\n\n[...]\n> perhaps requires a very good grasp of English usage, which may be\n> especially problematic internationally.\n\nReferencing a near-century-old US dictionary while suggesting that an\nEnglishman is wrong about English usage won't win my friendship.\n(FWIW, the dictionary seems accurate as written in this case, but\nbeside the point here and not supporting the claim above.)\n\n> So, if possible, I would encourage the original author to improve the\n> license text [...]\n\nProbably a good idea and a good idea for the improvement not to mention\n'materials' at all.\n\nI'm still worried by the current phrasing - can we tell how this is\ninterpreted by the licensor?  Can we claim binaries are GPL by clause 6\nor does the 'no permission is granted...' style of clause 7 overrule it?\n\nI see that Florian Weimer was also concerned by this phrasing in\nhttp://lists.debian.org/debian-legal/2005/07/msg00220.html\nalthough it wasn't mentioned what package was being discussed.\n\nAny more comments?\n\nRegards,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}