{"category": "spam", "to_address": "undisclosed-recipients:;", "from_address": "ALFRED <joyce@afdbenin.com>", "subject": "FROM ALFRED FIFAJI", "body": "FROM ALFRED FIFAJI\nTHE HEAD OF FILE DEPARTMENT, AFRICAN\nDEVELOPMENT BANK (ADB)\nCOTONOU, BENIN REPUBLIC, WEST AFRICA\nTELEPHONE: 00229 97071419\nSTRICTLY PERSONAL\nI am Alfred Fifaji, Head of Files/Records Department and Debt  \nRecovering Unit in the African Development Bank, Cotonou, Benin  \nRepublic in West Africa.\nFirstly, I must solicit your explicit confidence in this  \ntransaction.This is by virtue of  its nature as being utterly  \nconfidential and top secret. However, after series of petitions have  \nbeen received by this regime from Foreign Contractors regarding the  \ninability of the African Development Bank to settle all outstanding  \ndebts owed to Foreign Contractors, a committee (which I was the  \nhead)was set up to carefully review all overdue debts owed to foreign  \ncontractors and recommend for immediate release of such funds with  \nimmediate effect.\nDuring the investigation period, we discovered an abandoned sum of 35   \nMillion (Thirty five million United States Dollars) belonging to a  \nGerman business magnate and property consultant, Late Andreas  \nSchranner. The late Mr Schranner died in a plane crash on Monday, 31st  \nJuly, 2000 alongside his family members. The BBC website  \nrefers:http://news.bbc.co.uk/1/hi/world/europe/859479.stm\nSince we got information over his sudden death the bank has made  \nfrantic efforts to locate his reltions, but all attempts failed. The  \nbank cannot release this funds to anyone except it receives an  \napplication from anybody who would stand as the next of kin or  \nbusiness partner to the late customer.\nIt was based on this discovery that my collegues and I conceived the  \nidea of contacting you, based on the good recommendation given to me  \nby a friend who works with the chamber of commerce and industries  \nhere. We do not want the funds to be shared by the board of directors  \nof the bank who may wake up one day to declare it \"unclaimed funds\".  \nWe need your unflinching support and cooperation to have the funds  \ntransferred to your nominated bank account. Please, note that upon the  \nsuccessful transfer of the funds to your bank account, you shall be  \nentitled to 25% of the total funds as your share. I shall at a  \nsubsequent date come to your country to open an account where I will  \ndeposit our 75% of the funds.\nHaving done a thorough feasibility study on how to perfect the  \ntransfer of the funds to your bank account, your role shall be to send  \nan application for claim of the funds to the bank as a next of kin or  \nbusiness partner to the late Andreas Schranner. I also would require  \nyour contact address, telephone and fax numbers for easy  \ncommunication. Please, rest assured that the business is 100% risk free.\nUpon receiving your response to this proposal, I would be most obliged  \nto send to you a text of application for claim of the funds which you  \nwill send to the bank. Please, bear in mind that with your strong  \nobedience to my guidance in this transaction, the funds would be  \ntransferred to your account within 14 working days.\nI look forward to receiving your urgent response.\nBest wishes,\nAlfred Fifaji\n\n\n\n\n\n\n\n"}