{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"Health Week\" <mailings@mail.cnn.com>", "subject": "This Week in Health", "body": "\n\n\n\n\nCNN.com - Health Week\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFriday, June 22, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVolunteer dentists restore smiles to abuse survivors\nSusan Kauffman can't stop smiling. Not only does she have a perfect set of teeth, but after enduring physical abuse repeatedly in her life, she also has renewed self-esteem. \"I had a broken spirit,\" Kauffman said. \"I became very isolated ... and became a recluse.\"\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudy: Estrogen pills help some women's hearts\nFive years after a landmark study scared millions of women off hormones for menopause symptoms, new research suggests the pills may offer some heart benefits for certain younger women who start taking them in their 50s.\nFULL STORY\n\n\n\n\n\n\nGene therapy shows promise for Parkinson's \nAn experimental treatment for Parkinson's disease that involved slipping billions of copies of a gene into the brain to calm overactive brain circuitry seemed to improve symptoms without causing side effects in a small study.\nFULL STORY\n\n\n\n\n\n\nDocs: Sand holes kill more people than sharks do \nWaves and sharks aren't the only dangers at the beach. More than two dozen young people have been killed over the last decade when sand holes collapsed on them, report doctors who have made warning of the risk their personal campaign.\nFULL STORY\n\n\n\n\n\n\nFewer baby boys being circumcised in the U.S.\nIn a reflection of Americans' changing attitudes toward medicine and their bodies, growing number of American parents are refusing to submit their infant sons to circumcision, in which the foreskin is removed from the penis.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Health Week email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}