{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "ben.krohmal@keionline.org", "subject": "[Ip-health] Pro-CL OpEd in Herald Tribune", "body": "http://www.iht.com/articles/2007/05/29/business/sxview30.php?page=1\n\nViewpoint: Drug innovation and the public good\n\n Andy Mukherjee Bloomberg News\nPublished: May 29, 200\n\nThe United States is angry with Thailand for encouraging copycats to\nundercut American intellectual property. The Commerce Department in\nWashington wants Thai officials to reverse their controversial decision to\nbreak patents on several drugs used in treating AIDS, heart ailments and\ncancer.\n\nBristol-Myers Squibb, Merck and Abbott Laboratories, the three U.S. drug\nmakers that may be affected by the Thai decision on compulsory licensing,\ntogether had $14 billion in cash from operations last year.\n\nThat is a lot of money riding on intellectual property.\n\nIt's quite natural for these companies to detest compulsory licensing, in\nwhich a patented or copyrighted product is given to others to manufacture\nto bring down its cost.\n\nThailand's move to tap generic suppliers for key medicines - it says it\nhas imported the first batch of Merck's patented AIDS drug, Efavirenz,\nfrom India at half the price - is being decried as dangerous.\n\nLobbyists for pharmaceutical companies say that other countries may be\ninspired to follow suit, as Brazil already has, jeopardizing future\ninvestments in drug discovery.\n\nIn this debate between protecting knowledge and saving lives, what is\nimportant to remember is that neither Thailand nor Brazil has done\nanything illegal. Nor are they posing a credible threat to future drug\ndiscovery.\n\nCompulsory licensing of drugs is a legitimate right of any member of the\nWorld Trade Organization. A member government can take a patented medicine\nand give it to someone else to manufacture after efforts to negotiate a\nlower price with the patent-holder have failed. Even then, the owner of\nthe intellectual property must be given \"adequate remuneration.\"\n\nThailand exercised its right late last year and ended up on the U.S.\ngovernment's so-called priority watch list, which leaves it vulnerable to\ntrade reprisals.\n\nLeave aside the politics of international commerce and consider the\neconomics of developing a new drug.\n\nFinding a blockbuster means spending 10 years or more sifting through\nbetween 5,000 and 10,000 compounds. And even then, after sinking $800\nmillion in a project, success is not guaranteed.\n\nHave Thailand and Brazil put humanity at risk by threatening to pull the\nplug on supernormal profit, which is the drug industry's main incentive to\ninnovate?\n\nIntellectual property suffers from what S.J. Liebowitz, an economist and\nprofessor at the University of Texas at Dallas, calls the \"economic\nparadox of nonrivalrous goods pricing.\"\n\nA nonrivalrous product is one where there is no cost to the society of\nletting one more individual consume a product as long as he or she is\nwilling to pay the cost of manufacturing the product. In the case of\npatented drugs, this is the cost of copying a bunch of chemicals into a\nblank tablet or capsule.\n\nHowever, if an AIDS drug can be treated as a pure public good, why should\nprivate capital bother investing in the uncertain business of discovering\na newer, better one?\n\nA legally enforced product patent solves the problem, albeit\nunsatisfactorily. It has an inbuilt bias against poor people because at\nleast some of them must be excluded, via higher prices, as consumers in\norder to create an incentive for privately funded discovery of new drugs.\nGiving this unfair system an occasional jolt may not bring innovation to a\nhalt.\n\nA U.S. district court ordered a compulsory licensing of General Electric's\nlight-bulb patents in 1953; and at zero royalty. Today, we have more\nefficient, longer-lasting bulbs than we did 60 years ago.\n\nTwo economists, Michele Boldrin and David Levine, have made a compelling\ncase against patents and copyrights in their book, \"Against Intellectual\nMonopoly.\" The authors claim that cerebral assets are different from\nphysical ones: Legal defense of the ownership rights of a cow or a factory\nhelps everyone; the same protection, when applied to ideas, hampers\ninnovation.\n\nThe original Napster, the music-swapping service that shut down in 2002\namid copyright disputes with record companies, jumps to mind. But you\ncould as easily look at James Watt, Boldrin and Levine say. During the\nperiod when Watt had patents on steam engines, Britain added 750\nhorsepower every year. In the 30 years after the expiry of patents, more\nthan 4,000 horsepower of steam engines were produced every year.\n\nIt's time to stop the acrimonious blame game where governments - and\nnongovernment organizations like Doctors Without Borders - accuse drug\ncompanies of predatory pricing, while the latter cry themselves hoarse\nabout being robbed of the just rewards for their large risks.\n\nEfforts must now be directed at deriving an acceptable framework for\ncompulsory licensing with a certifiable, third-party process.\n\nThe idea of separating compensation from ownership, which is what\ncompulsory licensing does, does not appeal to those who dislike government\ninterference in markets. They rightly note that it is a halfway house: Bob\nDylan gets a cut every time someone releases a cover version of his songs\nthrough a mechanical licensing process; but he cannot stop anyone from\nhaving a go at \"Knockin' on Heaven's Door.\"\n\nYet, compulsory licensing has its positives. The very threat prompts\nbrand-name drug makers to start offering price discounts. In Thailand,\nAbbott, Novartis and Merck have offered price concessions. So as a\nbargaining tool, compulsory licensing achieves a better balance between\ninnovators' expectations and patients' rights.\n\nThe United States, which has used compulsory licensing to break down\nmonopolies and keep its economy competitive, should take a more lenient\nview of Thailand's move. It isn't all that odious.\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}