{"category": "ham", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "The Paceline <info@thepaceline.com>", "subject": "April Paceline Newsletter", "body": "\n\nThePaceline.com\n\nThis message contains graphics.  If you do not see the graphics, click here to view.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn an unusual and opportunistic turn of events, the Tour de Georgia saw Levi Leipheimer, Tom Danielson and George Hincapie do unexpected but brilliant domestique work for the overall winner, our own Slovenian, Jani!Get the Tour de Georgia recap\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFRS is a new antioxidant health drink that can help athletes train better, increase their mental focus and recover faster. It also provides a great healthy energy boost for fast-paced lifestyles. Lance has recently partnered with FRS by serving on the company’s board of directors and has become a regular FRS user. Find out more about FRS and get your free trial (+ shipping & handling) at www.FRS.com.\n\n\n\n\n\n\n\n\n\n\n\n\n\nQ&A with the Promising Third-Year Rider, 2007 Tour de Georgia Champ and Recent TT World Champ.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJoin Team Discovery Channel to help send cancer survivors to the annual Ride for the Roses in Austin!\n-Choose a rider & pledge the amount of your choice for every 2007 race mile your rider completes (top '06 individual total was approx. 7,000 miles)\n-With each '07 mile logged by the riders of Team Discovery, your contributions go to help send cancer survivors to the Ride for the Roses.\n\nEven a penny per mile helps (based on 7,000 miles, that comes to a total gift of approximately $70 to the Lance Armstrong Foundation). It’s fun, easy and supports a great cause!Cool prizes, too – for more info go to the site.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Discovery Channel Global Education Partnership is hosting a unique online auction that includes everything from AUTOGRAPHED DISCOVERY CHANNEL PRO CYCLING TEAM JERSEYS to ALL-INCLUSIVE PACKAGES TO THE 2007 TOUR DE FRANCE!\n\nHow can you help?  Visit the auction site at www.DiscoverysAuction.com, and bid on these items and more, including a set visit to Discovery Channel's hit show MYTHBUSTERS and a private movie screening!  All proceeds benefit the Partnership, a 501(c)(3) charitable organization that uses the power of television to increase educational opportunities for children and communities in underserved areas around the world.  To learn about the Partnership's 10 years of success educating children, visit www.discoveryglobaled.org.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nclick here to unsubscribe ¦ click here to subscribe\n\n\nCSE ¦ PO Box 42106 ¦ Austin, Texas 78704-0036\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}