{"category": "ham", "to_address": "\"Brown, Rodrick\" <rodrick.brown@lehman.com>", "from_address": "Nigel Peck <nigel@miswebdesign.com>", "subject": "Re: Charting Module", "body": "\nHi Robert,\n\nI use GD::Graph and have found it to be a good solution; easy to \nconfigure, plenty of options, intuitive. I'd recommend it.\n\nCheers,\nNigel\n\nManaging Director\nMIS Web Design\nhttp://www.miswebdesign.com/\n\nMIS Web Design Limited is registered in England and Wales with company \nnumber 04561623. Our VAT Registration Number is 803-939-126.\n\nBrown, Rodrick wrote:\n> I have a few data points I would like to graph not sure the best way to\n> go about this with Perl. A basic search on cpan points me to GD and\n> WriteExcel anyone using perl for charting/graphing with moderate\n> success? \n> \n> Thanks. \n> \n> ---\n> Rodrick R. Brown \n> Lehman Brothers Production Management \n> ITD - Equities Technology / Client Connectivity \n> Office: 212 320 0892\n> Loc: 1301/3/10L01\n> \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n> \n> This message is intended only for the personal and confidential use of the designated recipient(s) named above.  If you are not the intended recipient of this message you are hereby notified that any review, dissemination, distribution or copying of this message is strictly prohibited.  This communication is for information purposes only and should not be regarded as an offer to sell or as a solicitation of an offer to buy any financial product, an official confirmation of any transaction, or as an official statement of Lehman Brothers.  Email transmission cannot be guaranteed to be secure or error-free.  Therefore, we do not represent that this information is complete or accurate and it should not be relied upon as such.  All information is subject to change without notice.\n> \n> --------\n> IRS Circular 230 Disclosure:\n> Please be advised that any discussion of U.S. tax matters contained within this communication (including any attachments) is not intended or written to be used and cannot be used for the purpose of (i) avoiding U.S. tax related penalties or (ii) promoting, marketing or recommending to another party any transaction or matter addressed herein.\n> \n> \n> \n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}