{"category": "ham", "to_address": "John Goerzen <jgoerzen@complete.org>", "from_address": "Kern Sibbald <kern@sibbald.com>", "subject": "Re: Bacula: GPL and OpenSSL", "body": "On Thursday 07 June 2007 20:15, John Goerzen wrote:\n> On Thu, Jun 07, 2007 at 10:50:39AM -0700, Walter Landry wrote:\n> > John Goerzen  wrote:\n> > > Kern believes that he must remove the explicit OpenSSL exemption from\n> > > the license in order to be fully GPL-compliant, and it appears that FSFE\n> > > agrees.\n> > \n> > I just read the contents of \n> > \n> >   /usr/share/doc/bacula-director-sqlite/copyright\n> > \n> > I have reproduced it below for debian-legal.  The Linking section,\n> > which is needed for linking with OpenSSL, is not a problem for\n> > GPL-compatibility.  The other parts may or may not be a problem, and\n> > indeed seem superfluous, but all that is needed is the Linking\n> > section.\n> \n> But the problem is that parts of Bacula's code are copyrighted by third\n> parties, and licensed under plain GPL (or Kern's license before he added\n> this exception), and may be unreachable for obtaining permission to\n> relicense with this exception.  (Kern, have you tried contacting them?)\n\nWell, most of the other files are FSF copyrighted, and FSFE told me that FSF \nalways sticks to the letter of the license (logical) so I haven't tried to \ncontact the other users.\n\nI could have gone on with the current situation because no one has filed a \nformal complaint.  However, I *much* prefer to be in compliance and not to \nviolate anyone's copyright.\n\n> \n> So the question really is: how can we have Bacula in Debian, with SSL\n> support, but without that clause?  \n\nThis is apparently possible because GNUTLS seems to have an OpenSSL \ncompatiblity layer.  However, this is not something that I can personally \nlook at in the very near future.\n\nIn addition, over time, I will remove *all* code that is not copyrighted with \nthe \"Bacula\" license, but that will probably take even longer to fix.\n\n\n> And why does FSFE disagree with our  interpretation?\n\nI don't know.  One possibility is that I misunderstood them. My understanding \nis that it all has to do with distribution. If one does not distribute GPLed \nbinaries mixed with non-GPLed code and one's distributed binaries use only \nshared objects that are on the user's system, there is no problem. This is in \nfact what happens with glibc and many other libraries, which are not \n*required* to run a system, but are on the system. That is my understanding. \n\nIn any case, that is how I am going to interprete it until someone threatens \nme, and if that happens, which I doubt, the project will simply stop \nreleasing binaries that can run with OpenSSL, and hopefully by then everyone \nwill have switchted to GPL v3 where this stupid problem does not exist.  I \ndon't imagine that is a solution for Debian though.\n\n> \n> -- John\n> \n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}