{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 29, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESRare Tuberculosis Case Prompts Warning\nA man with a rare and very dangerous form of tuberculosis was placed in quarantine after possibly exposing passengers and\n                        crew on two trans-Atlantic flights. It's the first time since 1963 that the U.S. government has issued a quarantine order. More...\n• Bush Orders Tougher Sanctions On Sudan\n                     \t\t\t\t\t| Watch• 10 GIs Die In Iraq On Memorial Day \n                     \t\t\t\t\t| Watch• Mom And 4 Daughters Found Hanging In Home\n                     \t\t\t\t\t| WatchU.S.Mom And 4 Daughters Found Hanging In Home\nA 23-year-old and her four small daughters were found hanging in a closet in their mobile home, all of them dead except for\n                        an 8-month-old, the sheriff said. The woman's sister made the gruesome discovery about 25 miles from Fort Worth, Texas.  More...Watch: Mom, Kids Found Hanging\n• South Prays For Rain, End To Drought\n                     \t\t\t\t\t| Watch• Student Pleads Not Guilty In Terror Case• Fort Dix Terror Plot Stopper Not A \"Hero\"• More StoriesWorld10 GIs Die In Iraq On Memorial Day \nThe U.S. military has announced the deaths on Memorial Day of ten soldiers in Iraq, including two who died in a helicopter\n                        crash in Diyala province. Meanwhile, bomb blasts in Baghdad have left at least 40 people dead and scores more injured. More...Watch: U.S. And Iran Hold Talks\n• Russia: New Missiles Are Unstoppable• Fighting Resumes In Lebanon Refugee Camp• \"Iraq Is More Than Blood\" At Festival• More StoriesPoliticsBush Defends Immigration Deal\nPresident Bush tried to blunt widespread criticism of his immigration deal with Congress, charging that opponents of the plan\n                        \"don't want to do what's right for America.\" More...Watch: Bush: Act Now On Immigration\n• Obama Unveils Universal Health Care Plan• Clinton Emphasizes Shared Prosperity• Cindy Sheehan Calls It Quits• More StoriesHealthFour New Breast Cancer Genes ID'd\nSeveral recent studies reveal that scientists may have identified four new breast cancer genes and predict that more clues\n                        on the genetics of breast cancer await discovery. More...Watch: HealthWatch\n• Rare Tuberculosis Case Prompts Warning• Contact Lens Solution Recalled\n                     \t\t\t\t\t| Watch• Texas May Test For Steroids In High School\n                     \t\t\t\t\t| Watch• More StoriesSciTechWayward Whales Get Closer To Pacific\nThe two whales lost in the Sacramento River have made it past the Benicia and Martinez Bridge and moved towards the Pacific\n                        Ocean. Biologists say their wounds are healing and are more positive about their recovery.   More...Watch: Wayward Whales Make Progress\n• U.S. Rejects EU Targets On Climate Change• Sony On Board With HD Radio• Real Band, No Record Company• More StoriesBusinessBig 3 Ponder Pawning Health Care On Unions\nThe Big 3 automakers are considering a plan in which each agrees to pour billions of dollars into a trust fund to help provide\n                        for retirees health  insurance. But with that one-time payment, the carmakers would win a cap on their future liability. More...\n• High Court Limits Right To Sue Employers• Where Germs Lurk In Hotel Rooms\n                     \t\t\t\t\t| Watch• Create A Small Business Exit Strategy• More StoriesEntertainmentRosie, Elisabeth Try To Patch Things Up\nRosie O'Donnell's sparring partner Elisabeth Hasselbeck said on \"The View\" that she and her former cohost were in communication\n                        over the holiday weekend. Barbara Walters says O'Donnell is welcome back on the show at any time. More...\n• Brandy, Driver Sue Each Other Over Crash\n                     \t\t\t\t\t| Watch• Spears Says She Was \"So Lost\"• Miss Universe: Miss USA Slips, Japan Wins• More StoriesOpinionFailing Our Future Immigrants\nThe Senate immigration bill contains many helpful provisions for undocumented workers already in the country. But it's a raw\n                        deal for future immigrants and other low-wage workers, says the Nation. More...Watch: Reality Check On Immigration\n• No Alien Left Behind\n                     \t\t\t\t\t| Watch• Who's Pushing For Muslim Women's Rights?• Soldiers Put Politics Aside In Service• More StoriesCBS NEWS BROADCASTSThe Early Show: Lohan Going Back To Rehab, Magazine Says\nLindsay Lohan is heading back to rehab, just days after her DUI arrest. She recently completed a 30-day rehab stint. More...Watch: More Trouble For Lohan \n• EARLY SHOW: Fame Is \"Knocking\" For Seth Rogen\n                     \t\t\t\t\t| Watch• EARLY SHOW: Where Germs Lurk In Hotel Rooms\n                     \t\t\t\t\t| Watch• EARLY SHOW: Patricia Wells Celebrates Veggies\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nMcCann Search Turns SpiritualThe parents of missing 4-year-old Madelyn McCann hope that a trip to the Vatican might draw spiritual strength and lengthen\n                                    the reach of their search. Charlie D'Agata reports.\nTOP VIDEOS\nFirst Look: Dozier's Recovery\nBombs Kill 40 In Baghdad\nMom, Kids Found Hanging\nWayward Whales Make Progress\nBush: Act Now On Immigration\nFight Puts Leopard In Hospital\nMay: Deadliest Month Of '07\nADHD: In The Genes?\nSanctions Aim To Foil Genocide\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesScott Pelley follows a National Guard unit and their families for nearly two years. This Sunday, 7 p.m. ET/PT.48 Hou!\n rs Myste\nryDouble Feature:Beginning at 9 p.m., \"A Shot In The Dark,\" reported by Susan Spencer. Then at 10 p.m., Troy Roberts\n                           report is titled \"Secrets & Lies On Grapevine Lake.\"\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}