{"category": "spam", "to_address": "<faisalabad@speedy.uwaterloo.ca>", "from_address": "\"fearfully\" <kdjds@prodigy.net>", "subject": "There was no way to help the horse out.", "body": "\n\n\n\n\n\n\n\n9:45am Kidd Chris Stops In To Meet George Takei. \n6:55am Ted Nugent Visits.\nHoward played some audio of that performance and \nmentioned that CBS is probably upset that they fired Dave because he had higher \nratings than the current morning team over there. He said the girls are cheerleaders \nin high school but they also fight crime. 6:05am Star Jones Weight Loss And Other \nDiscussions. He told Howard that he's shooting another episode soon.\nThe urine tests have to be done within 48 hours. \n10:20am WednesdayThursday Howard TV Bubba's Wedding Special Discussed.\nCabbie said he thinks he's got issues but it's not \nhis place to say anything to him.\nJoey Boots called in and said that he knew that \nCabbie was doing the other thing when he saw the link in his posting.\n10:20am Van Halen Discussions.\nHoward said it sounds like it might be an \ninteresting movie. 6:30am King Of All Blacks Call And More Artie \nDiscussions.\nDuring that performance Howard points out that it \ndidn't sound like Dave did much acoustic stuff.\nHoward said the guy was a nice guy. 6:55am Ted \nNugent Visits. King Of All Blacks Call And More Artie Discussions.\n7:50am Will The Farter's New Fart \nStunts.\nShe just kept telling Howard how great his show is \nand how much her family loves it.\nHe sees Artie eating all of this food lately and he \nknows that eating that much crap can make a person sick. Howard said that's kind of \nfunny, they drug test a street sweeper.\n6:40am Sam Simon On 60 Minutes \nDiscussion.\nHe said that would be like Eric calling in to tell \nhim a story about something great that had happened to him and then telling him he \ncan't talk about it. Gary said that you have to throw up some road blocks for the \nkids to kind of throw them off of that stuff.\n8:00am Cabbie Causing Controversy Again. He started \nto talk about that but Howard cut him off and said he had to go.\nHoward said they really need to do that with Artie. \nCabbie came in and Howard said he had gotten really big.\n"}