{"category": "ham", "to_address": "Andrew Bartlett <abartlet@samba.org>", "from_address": "Jelmer Vernooij <jelmer@samba.org>", "subject": "Re: [SAMBA4] we should create just one test environment", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nAndrew Bartlett wrote:\n> On Mon, 2007-04-30 at 09:03 +0200, Jelmer Vernooij wrote:\n>> Andrew Bartlett wrote:\n>> Nothing prevents test environments for guaranteeing both a dc and two\n>> members will be up, for example. \n> I'm asking that that be the default, that we create exactly one test\n> environment for the vast majority of the tests we run.  \nI don't see what that would add. Why should we set up a domain member if\nwe just one need a dc to run against?\n\nIf we'd have one such \"sane default\", then there is no point in having\nmultiple environments at all.\n\n>> Also, the current code makes it very easy to add support for other\n>> targets (Samba3, for example) that don't support all test environments\n>> (yet).\n>>\n>> Perhaps you would simply like to make sure that all test environments\n>> are set up in 'make testenv' ? \n> No, then the tests will constantly differ from the environment in which\n> they are normally run, even worse than the current situation.\nIn that case, why not add an ENV= variable so you can run \"make testenv\nENV=member\" ? Or perhaps we can simply add \"make testenv-dc\" and \"make\ntestenv-member\"?\n\nWe can print out the environment name for failed tests, if that would help.\n\n> I'm afraid that the selftest setup is becoming too complex to reproduce\n> - I want to be able to easily reproduce any failure in 'make\n> testenv' (which you will recall is my primary work tool), without first\n> wondering 'oh, what environment did it declare, what environment did it\n> get, and what environment do I have now'.\nThat will make other things more complex. For example, we'd need to\nchange the environment variables to be $DC1_IP, $DC1_USERNAME,\n$DC2_PASSWORD, etc because the tests can be run against either of the\ndcs or domain member.\n\nIt also makes things like \"make test TESTS=SAMR\" slower as the\nprovisioning is two or three times as slow.\n\n> It doesn't seem too much of a price to always have a simple network\n> running, that contains the DC (or 2), and member servers.  Then we can\n> be very consistent in how our tests run, and are debugged. \nIt's not just the time it takes to set up the environment, also the fact\nthat it makes it harder to support other targets (because of the\ncomplexity of the environment they need to support) and the inability to\nmix environments.\n\nCheers,\n\nJelmer\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\nComment: Using GnuPG with Mozilla - http://enigmail.mozdev.org\n\niQCVAwUBRjWnMgy0JeEGD2blAQKd3AP8C4b1mEW0jcHaD8aO4m9oySWcY4+LEXiL\nHnRIW2XK4v0/6RhawKa8OHPe8OiLip7qP4wcYay6s+1jtA/ZjTOs+LYhtVggsFAN\nTz1SZzM3pchD0TOcM0IIaTlXfLMvaY6VoPwy8kxSulbGJLLY6GRTRV+qTPnocKoI\nRGDNOyVlGic=\n=0kwx\n-----END PGP SIGNATURE-----\n\n"}