{"category": "ham", "to_address": "\"Spielas Bates\" <bates@stat.wisc.edu>", "from_address": "\"Christophe Pallier\" <christophe@pallier.org>", "subject": "Re: [R] Tools For Preparing Data For Analysis", "body": "On 6/8/07, Spielas Bates  wrote:\n>\n>\n> Other responses in this thread have mentioned 'little language'\n> filters like awk, which is fine for those who were raised in the Bell\n> Labs tradition of programming (\"why type three characters when two\n> character names should suffice for anything one wants to do on a\n> PDP-11\") but the typical field scientist finds this a bit too terse to\n> understand and would rather write a filter as a paragraph of code that\n> they have a change of reading and understanding a week later.\n\n\nHum,\n\n\nConcerning awk, I think that this comment does not apply: because the\nlanguage is simple and and somewhat limited, awk scripts are typically quite\nclean and readable (of course, it is possible to write horrible code in any\nlanguages).\n\nI have introduced awk to dozens of people (mostly scientists in social\nsciences, and dos/windows users...) over the last 15 years  it is sometimes\nthe only programming language they know and they are very happy with what\nthey can do with it.\n\nThe philosophy of using it as a filter (that is, a converter) is also good\nbecause many problems are best solved in 2 or 3 steps (2/3 short scripts run\nsequentially) rather than in one single step,as people tend to do with\nlanguages that encourage to use more complex data structures than\nassociative arrays.\n\nIt could be argued that awk is the swiss army knife of simple text\nmanipulations. All in all, awk+R is very efficient combination for data\nmanipulation (at least for the cases I have encountered).\n\nIt would a pity if your remark led people to overlook awk as it would\nefficiently solve many of the input parsing problems that are posted on this\nlist (I am talking here about extracting information from text files, not\ndata entry).\n\nawk, like R, is not exempt of defects, yet both are tools that one gets\nattached to because they increase your productivity a lot.\n\n\n-- \nChristophe Pallier (http://www.pallier.org)\n\n\t[[alternative HTML version deleted]]\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}