{"category": "spam", "to_address": "\"franzen franzen\" <theorize@plg.uwaterloo.ca>", "from_address": "\"rosanne barby\" <cristiebartholomew@aol.com>", "subject": "Take it to The Bank Stock Report", "body": "\n\n\n\n\n\n\n*** SUPER SHORT SQUEEZE REPORT ***Paivis Corp (OTCBB: PAVC) IS SHORT\nAPPOX 10,500,000 SHARES.This is our first report to publish in 18\nmonths; it took us almost1 and a half years to find another HUGE opportunity\nfor ourinvestment community.Paivis Corp (OTCBB: PAVC) has a short\nposition of approximately 10million shares. The shorter sellers are expected\nto begin coveringduring the next 5 trading sessions very heavily. We expect\nthis oneto hit as high as 6.25 a share in the next 5 trading sessions,\nasthese short positions are being covered. We saw Paivis trading aslow\nas .18 last week as short sellers pounded the stock yet again.Now we are\nseeing it climb up to the .39 per share mark.Our first SQUEEZE trigger\nprice of 1.05 is expected to be reachedas soon as Thursday, and then Friday\nwe should pull through thenext two squeeze trigger prices of 1.41 and 1.63.\nWhen this happensit will cause the massive volume spike and price increases\nas shortsellers must cover their positions.PAVIS IS TRADING AT A\nHUGE DISCOUNT â\" GET IN NOW!DO NOT LET THIS ONCE IN A LIFETIME OPPORTUNITY\nPASS YOU BY - GET INBEFORE THE SQUEEZE TRIGGER PRICE IS HIT AND SENDS THIS\nONE THROUGHTHE ROOF!!!COMPANY SNAPSHOT--COMPANY NAME: Paivis\nCorpTICKER SYMBOL: PAVCEXCHANGE: OTCBBSHARES OUTSTANDING:\n30,558,352FLOAT: 18,970,000SHARES SHORT: 10,500,000 (APPROX)SQUEEZE\nTRIGGER PRICES: 1.05, 1.41, and 1.63RECENT PRICE: 0.344-DAY TARGET:\n6.25RECOMMENDATION: STRONG BUY UP TO 4.25We are expecting this stock\nto literally jump by 2,000% - 3000% inthe short term.DISCLAIMER:\nInformation within the Super Short Squeeze Reportcontains \"forward looking\nstatements\" within the meaning of Section27a of the Securities act of 1933\nand Section 21B of the Securitiesexchange act of 1934. Any statements that\nexpress or involvediscussions with respect to predictions, expectations,\nbeliefs,plans, projections, objectives, goals, assumptions or future\neventsor performance are not statements of historical fact and may\nbe\"forward looking statements.\" Forward looking statements are basedon\nexpectations, estimates and projections at the time thestatements are made\nthat involve a number of risks anduncertainties which could cause actual\nresults or events to differmaterially from those presently anticipated. The\npublisher of thisnewsletter does not represent that the information\ncontained inthis message states all material facts or does not omit a\nmaterialfact necessary to make the statements therein not misleading.\nAllinformation provided within this email pertaining to\ninvesting,stocks, securities must be understood as information provided\nandnot investment advice. The publisher of this newsletter advises\nallreaders and subscribers to seek advice from a registeredprofessional\nsecurities representative before deciding to trade instocks featured within\nthis email. None of the material within thisreport shall be construed as any\nkind of investment advice or offerto sell or solicitation of an offer to buy\nsecurities. Many ofthese companies are on the verge of bankruptcy. You can\nlose allyour money by investing in this stock. The publisher of\nthisnewsletter is not a registered investment advisor. Subscribersshould\nnot view information herein as legal, tax, accounting orinvestment advice.\nAny reference to past performance(s) ofcompanies is specially selected to be\nreferenced based on thefavorable performance of these companies. You would\nneed perfecttiming to achieve the results in the examples given. There can\nbeno assurance of that happening. Remember, as always, pastperformance\nis never indicative of future results and a thoroughdue diligence effort,\nincluding a review of a company's filingswhen available, should be completed\nprior to investing. Incompliance with the Securities act of 1933, Section\n17(b), thepublisher of this newsletter discloses they received payment\nfroman unaffiliated third party for the circulation of this report inthe\namount of sixty thousand dollars. Be aware of an inherentconflict of\ninterest resulting from such compensation due to thefact that this is a paid\nadvertisement and is not without bias. Allfactual information in this report\nwas gathered from publicsources, including but not limited to Company\nWebsites and CompanyPress Releases. The publisher of this newsletter\nbelieves thisinformation to be reliable but can make no guarantee as to\nitsaccuracy or completeness. Use of the material within this\nemailconstitutes your acceptance of these terms. "}