{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Isabelle Downing\" <maccasahomeaccessoriesdoc@casahomeaccessories.com>", "subject": "You'll love the new, non-obese you", "body": "\nPounds down, mood up\n\n\n\n\n\nAnatrim – The very up-to-date and most exciting product for over-weight people is now easily available – As were seen on CNN\n\n\n\nDo you realize superfluous body kilos kill a lot of people every year? We know that you hate the unsightly look of those people and the social prejudice against them. \n\nOr, maybe, you got no will to resist a pressure of ruinous eating habits of yours. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nHere comes Anatrim, the later product for the reduction of your body’s extra weight. The astounding thing about Anatrim is it improves the quality of your life by soothing your feeling of hunger and giving you better mood. Here’re some e-mails from our customers:\n\n\n\n\n\n\"It’s great! \n\n\nI stopped stuffing myself with food and watching TV \n\n\nI became rather more interested in doing sport.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I have a great shape now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nMaria H., Boston\n\n\n\n\n\n\n\"Passive weight burning was of no result to me. It was very hard for me to hold back and not to eat something just at hand. \n\n\nOne day I heard about Anatrim in the media and it brought a great influence on me.\n\n\n I had tried taking it, and my wife said I had changed for the better since then, 3 months later. \n\n\n34 pounds off and I continue to become slimmer! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nSteve Burbon, Texas\n\n\n\n\n\nAnatrim helps your brain to understand you doesn’t have such a great need for that much food. It raises your mood up, gives you energy, and attacks needless kilos. Great thanks to its mighty newly-elaborated formula!!\n\n\n\nPry out latest intelligence!\n\n\n\n"}