{"category": "ham", "to_address": "\"Marco Pesenti Gritti\" <mpg@redhat.com>", "from_address": "\"edward baafi\" <edwardbaafi@gmail.com>", "subject": "Re: [sugar] Pyxpcom", "body": "Marco,\n\nMy first build attempt failed with \"libpyxpcom.a: No such file or\ndirectory\" (I assume this is what stopped you also)\n\nI fixed this by forcing linking with libpyxpcom.so by changing\n\"$(DIST)/lib/$(LIB_PREFIX)pyxpcom.$(LIB_SUFFIX) \\\" to\n\"$(DIST)/lib/libpyxpcom.so \\\" in\nmozilla/extensions/python/dom/src/Makefile.in\n\nThen it builds just fine!\n\nI later found that the bug and patch you tried was for OSX:\nhttps://bugzilla.mozilla.org/show_bug.cgi?id=375318\n\nBut the OSX bug links to the linux bug:\nhttps://bugzilla.mozilla.org/show_bug.cgi?id=355608\n\nand there is a one line patch\n(https://bugzilla.mozilla.org/attachment.cgi?id=253079) which should\naccomplish the same thing I hardcoded above..\n\nFor consistency, my .mozconfig was:\n\nmk_add_options MOZ_CO_PROJECT=xulrunner\nmk_add_options MOZ_OBJDIR=@TOPSRCDIR@/../obj-xulrunner-debug\nac_add_options --enable-application=xulrunner\nac_add_options --enable-extensions=python,default\nac_add_options --enable-default-toolkit=cairo-gtk2\nac_add_options --enable-xft\nac_add_options --disable-javaxpcom\nac_add_options --disable-tests\nac_add_options --disable-optimize\nac_add_options --enable-debug\n\n\nTry that and you should build just fine..  I'm happy that you've\ndecided to do the right thing..  Remember that we can't judge Mark's\nextensions based on the platform that he develops on top of..  I may\nnot like Windows but all of Mark and Thomas Heller's extensions make\nit a breeze to work there (I'm just glad I don't have to build Vista)\n\nAnyway, now that we've gotten building the trunk out of the way, can\nyou describe what you're trying to do with gtkmozembed?  There are a\nlot of players involved (sugar services, xpcom, pyxpcom, gecko, gtk,\ngtkmozembed, pygtk, the python gtkmozembed wrappers, nsiWebBrowser,\netc) and I don't have a clear picture of what you're trying to do\n\n-Ed\n\nOn 5/10/07, edward baafi  wrote:\n> I'm giving it a try right now..\n>\n> If my builds fail, I probably won't get a chance to delve into the\n> patches until early next week..\n>\n> -Ed\n>\n> On 5/10/07, Marco Pesenti Gritti  wrote:\n> > Hello,\n> >\n> > so, Mark Hammond answer to the thread on the pyxpcom mailing list is\n> > *very* encouraging.\n> >\n> > http://aspn.activestate.com/ASPN/Mail/Message/pyxpcom/3474458\n> >\n> > I think we should really try it. The potential is big (being able to\n> > access the whole mozilla API directly from python open a tons of\n> > possibilities).\n> >\n> > Without having played with it a lot, my feeling is that the technology\n> > is mostly there. It just needs to be used and documented to get more\n> > mature and accessible.\n> >\n> > The first step is to get it building on the trunk. Bridging it to\n> > gtkmozembed looks trivial then.\n> >\n> > Anyone feels like giving this a try? I don't have a lot of time these\n> > days but I'd be glad to give some guidance. Getting this to work might\n> > provide an awesome piece of infrastructure to the project, without a lot\n> > effort!\n> >\n> > Marco\n> >\n> >\n>\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}