{"category": "spam", "to_address": "<elaastic@speedy.uwaterloo.ca>", "from_address": "\"Evelyn\" <rtdt@westernu.edu>", "subject": "scrutinize candlestick", "body": "\n\n\n\n\n\n\n\nI am younger (24) and was with 3 \nfriends.\nNot at all, not with a children's pool complex at \nthe back (aft) of the ship and the larger adult-scale Oasis pool complex midship. \nWiccans are most welcome.\nWhen we got to Acapulco, in fact, we never even got \noff the ship.\nI mentioned your blog on the Parent List. He can \nstate his opinion to wrong-doing.\nWe would do it again anytime even with our \nnocturnal serenades. I was disappointed, though the food itself was good and of good \nquality. But if there are two of you and one of him, you should be able to \nmanage!\nTo give them credit, NCL added mint scent and some \nhand softeners to the alcohol wash. ) Excursions, or Visiting Our Ports of Call So \nwhen I talk about our off-ship adventures, well, you can see that we were perhaps a \nbit less adventurous than some of the other passengers on the ship. Small being the \noperative word: we had about 200 passengers with us on the boat and when we were all \non the beach it was a pretty tight fit.\nNotice that what General Pace didn't say was \"I'm \ngoing to get rid of this policy\" or \"I'm going to ferret out all gays and throw them \nout of the military! Your story is not typical. The embarkation and disembarkation \nwere a shambles but remember there were 2,250 passengers to handle. You didn't \nmention the Freestyle Dining which is NCL's strongest attraction.\nWhat happens when people are afraid to express \ntheir beliefs in public?\nWe sailed 30 minutes late that \nafternoon.\n\" Great, another thing we had to worry about on the \nship!\ncom to submit your story. i did write a letter to \nCustomer Service, but have not heard back. I have heard this type of story many \ntimes before across the web, but your story, with photo, makes it all very real. \nPosted by: Bonny at April  7, 2007  1:55 PM Post a comment Name: Email Address: URL: \nRemember personal info? 00 shipboard credit - that you couldn't use for gratuities - \nbut had 43 very unhappy people in our group. When we got to Acapulco, in fact, we \nnever even got off the ship.\nI don't care what his personal opinion is of \ngays.\nYesNo Comments: Please note that you relinquish any \nsubsequent rights of ownership to your material by submitting it on this \nsite.\n"}