{"category": "spam", "to_address": "\"Elaastic\" <elaastic@flax9.uwaterloo.ca>", "from_address": "\"Celia Roper\" <wyndhamsayre@aveshealth.org>", "subject": "Fwd: PRIVATE", "body": "\n\nR\nO\nL                Full                           18K                                      Gold                              Daytona                            -       $269.00\nE\nX\n\nYes                      it's                                 our                              real       prices,                                       over                        1000               models                              just                                for                                         you!\nVisit                        our                                         shop:\nhttp://081.apsvtairyigsalive.com\n\"I kept expecting you to holler.                              \"He looked up, looked at his Misery, his darling.                                    There were lots of sardines in those flat rectangular cans with the key under the paper.         He thought Constant Reader would not swallow two unrelated women in neighboring townships being buried alive six months apart as a result of bee-stings.                                       \"He nodded, although the truth was that he could not feel anything — this medication on top of what he'd already given himself was rolling him toward unconsciousness at an alarming rate, and he was beginning to see the room through gauzy layers of gray.                                     The Lawnboy's engine suddenly lugged down and there was a series of fast, strangely liquid thudding sounds.                          I'm not drinking a seventy-five-dollar bottle of fizzy beer in the same room where you've been blowing that poison around.\"Annie screamed now.                       Except things no longer had been quite the same, had they?                                 \"And it's good, Annie.              Mr.                       He looked very discouraged.\nBecause the principle doesn't change if you were out seven times, or seventy, or seventy times seven. \"He hesitated, looked at the pile of typescript with the ragged stack of handwritten pages on top, then back at Annie.                  He wasn't sure he would have taken the chance even if the white powder inside the capsules had been almost or completely tasteless.                     But this was a different accident, and the reason for the similarity was simplicity itself: neither had really been an accident at all.              Given her mood this morning, that would almost surely have resulted in some unpleasant and painful punishment.                        \"Oh why in Christ's name are you doing this asshole Horatio-at-the-bridge act and who in Christ's name are you trying to impress?                          That poor woman who scraped the ends of her fingers off — \" She shook her head and repeated: \"It's not, like any of the other Misery books.                         It would be precious little consolation to him, however, if Annie were to be finally brought to bay for the murder of Paul Sheldon.                                         It looked like she really chowed down as well, and never mind cleaning up after.                              The neat handwriting below this clipping read Los Angeles Call, January 29th, 1962.                           He slid down a bit in the wheelchair — giving out a single barking groan — and looked through it.                               Oh, not that he had written particularly well the story was hot, but the characters as stereotyped and predictable as ever — but this time he had been able to at least generate some power; this time there was heat baking out from between the lines.                             While he was doing that, the galleys dropped out from under his arm and fell to the rug.                                    For the first time in weeks — it felt like years — he was able to look at a geography different from that of his room with its unchanging verities — blue wallpaper, picture of the Arc de Triomphe, the long, long month of February symbolized by the boy sliding downhill on his sled (he thought that his mind would turn to that boy's face and stocking cap each time January became February, even if he lived to see that change of months another fifty times). There was no Annie because Annie had not been a goddess at all, only a crazy lady who had hurt Paul for reasons of her own.                    What you're talking about is called a deus ex machina, the God from the machine, first used in Greek amphitheaters.       He turned, heart hammering, brains squeezing at his temples, and Annie was there, all right, the axe upraised, but only for a second         \"And I'll say, \"If Elvis Presley was still alive and you saw him last winter, would you remember seeing him?            He also saw gooey splatters of food on the housecoat, and she had only managed to get on one of her slippers.              Saw the blazing eyes suddenly widen even more, now with surprise and horror and fresh pain.                             My God, Annie, one of the first thing you find out in this business is that editors hate reading manuscripts typed on Corrasable Bond almost as much a they hate hand-written manuscripts.                                He seemed to have lost some vital ingredient, and the mix had become a lot less potent as a result.\n\n\n"}