{"category": "ham", "to_address": "IP-Health <ip-health@lists.essential.org>", "from_address": "Benjamin Krohmal <ben.krohmal@keionline.org>", "subject": "[Ip-health] Thai CL news update", "body": "Thailand CL news update: 2 stories follow\n\nHighlights:\n-Thai AIDS activists taking out ads in Thailand to counter\ndistortions from USA for Innovation\n-Thai Minister of Public Health considering CLs for cancer drugs\n-Matrix labs offering generic Aluvia for $695pppy\n- Brazil, Germany, India, Malaysia, and the Philippines express\nsupport for Thai CLs at WHA\n-Thai Minister of Public Health states that CLs will not be enforced\nif companies beat generic prices\n\nhttp://www.atimes.com/atimes/Southeast_Asia/IE17Ae02.html\nAsiaTimes\nHolding Big Pharma's feet to the fire\nBy Marwaan Macan-Markar\n  May 17, 2007\n\nBANGKOK - For nearly a week, the advertising pages of Thai- and\nEnglish-language dailies have been the stage for debates on\nThailand's decision to break patents on anti-AIDS drugs in the\ninterest of public health.\n\nA lobby championing the cause of the powerful pharmaceutical\ncompanies ran full-page spreads in the morning newspapers with an eye-\ncatching warning in large, bold text, which said: \"The Wrong\nPrescription for Thailand\".\n\nThe charge was supported by allegations that Bangkok's decision was\nfraught with errors, such as, \"Thailand is refusing American and\nEuropean medical technology at the expense of the poor and sick of\nThailand.\" Another leveled by \"USA for Innovation\", the organization\nleading this pro-pharmaceutical-company drive, declared: \"Most of\nThailand's AIDS patients will not have access to the world's best\nmedicines.\"\n\nBut if those warnings were meant to trouble men like Boripat Dornmon,\na 40-year-old who has been living with the human immunodeficiency\nvirus (HIV) for 11 years, they have made little headway. \"I disagree\nwith this group, USA for Innovation. It shows that the big drug\ncompanies do not care about people like me,\" he said.\n\nBoripat echoes the views of the group he belongs to, the Thai Network\nof People Living With HIV/AIDS, when he says Bangkok was correct in\nissuing compulsory licenses to secure cheaper generic drugs. \"We need\nthe new, cheap drugs to live longer.\"\n\nIt was a sentiment conveyed in the full-page advertisements taken out\nby a coalition of AIDS activists, humanitarian groups and a\nuniversity to hit back at the pro-pharmaceutical lobby's campaign.\nThe generic anti-retroviral (ARV) drug produced by the state's\npharmaceutical body has \"made a phenomenal contribution in reducing\nthe number of deaths among Thai AIDS patients from an average of\n7,282 per year between 2001 [and] 2004 to 3,862 in 2005 and to 1,613\nin 2006\", states the advertisement.\n\nAnd a meeting this week between officials from Abbott Laboratories\nand Thai officials from the Food and Drug Administration (FDA)\nconfirmed that Bangkok has not caved in to pressure from the\npharmaceutical lobby and the US government over a groundbreaking move\nto secure cheaper drugs.\n\nIn fact, a Health Ministry official was quoted in the local media\nhinting that Bangkok may not have finished issuing compulsory\nlicenses for ARVs produced by Abbott, given that a significantly\nlower-priced generic version of Aluvia, a second-line anti-AIDS drug,\nis being offered by an Indian company.\n\n\"If the Public Health Ministry chose to buy drugs at prices higher\nthan offered by other sources, it must be able to give the public a\ngood reason to justify its decision,\" Vichai Chokewiwat, head of the\nPublic Health Ministry's panel on compulsory licensing, said in\nTuesday's Bangkok Post newspaper.\n\nThailand's efforts have also received a boost at the ongoing World\nHealth Assembly in Geneva, where Health Minister Dr Mongkol Na\nSongkhla is defending his country's case. \"International supporters\nhave entered the debate, saying that they will support Thailand on\nthe issue in every way,\" he told the state-run Thai News Agency (TNA).\n\n\"International organizations belonging to the Third World Network, as\nwell as national groups from Brazil, Germany, India, Malaysia and the\nPhilippines, had met with him and praised Thailand on the issue,\"\nadded TNA.\n\nMongkol now is reported to be planning to enforce compulsory\nlicensing for cancer drugs. The pros and cons are being studied of\nissuing licenses for a group of cancer drugs that are still under\npatent in Thailand.\n\nThailand's determination to use available provisions in international\ntrade to break patents emerged late last year, when Bangkok broke the\npatent on the ARV Efavirenz, produced by the US pharmaceutical giant\nMerck Sharp and Dhome. That was followed by a compulsory license\nissued here for Kaletra, another ARV produced by the US pharma\nmultinational Abbott Laboratories. In January, the patent for Plavix,\na blood-thinner made by Sanofi-Aventis, was broken.\n\nBut it was only Abbott that hit back at Thailand's use of the special\nprovisions under the World Trade Organization (WTO) for developing\ncountries to break patents on drugs when faced with a public-health\nemergency. In March the US multinational refused to register seven\nnew drugs here, including Aluvia, a drug that can be easily stored in\ntropical climates.\n\nAbbott's hopes of steamrolling over Thailand were dealt a blow last\nweek from a quarter close to home - the foundation of former US\npresident Bill Clinton. At a ceremony in New York, with the Thai\nhealth minister Mongkol by his side, Clinton endorsed Bangkok's\ndecision to break the patents on the life-prolonging ARVs.\n\n\"No company will live or die because of high-price premiums for AIDS\ndrugs in middle-income countries, but patients may,\" Clinton said\nduring an event that announced the foundation's success at further\nslashing the price of second-line drugs, such as Abbott's Kaletra and\nAluvia.\n\nWhile last month Abbott announced that it had reduced the price of\nKaletra in Thailand to US$1,000 for an annual course per patient,\nfrom the $2,200 for the same course it had charged a month before,\nthe Clinton Foundation announced that it had an even cheaper offer.\nMatrix Laboratories, an Indian drug maker, was producing the generic\nversion of Aluvia for $695 for a one-year course.\n\nThailand's leadership in securing better care for its HIV and AIDS\npatients is in keeping with other pioneering efforts it has embraced\nto deal with the killer disease. The Southeast Asian country has more\nthan 600,000 people infected with HIV and has recorded 300,000 deaths\ndue to AIDS, the disease HIV causes.\n\n\"We have to stand up to the pressure from the pharmaceutical\ncompanies and the US,\" said Jiraporn Limpananont, associate professor\nin the pharmaceutical science faculty at Bangkok's Chulalongkorn\nUniversity. \"If more countries issue compulsory licenses, it will get\nthe point across that this is the right tool for developing countries.\"\n\n(Inter Press Service)\n\n\n\n\n\nhttp://www.alertnet.org/thenews/newsdesk/BKK50675.htm\nThai drug patent overrides depend on price cuts\n15 May 2007 11:46:12 GMT\nSource: Reuters\n\nBANGKOK, May 15 (Reuters) - Thailand will not override international\ndrug patents if big pharmaceutical companies offer prices below those\ncharged by generic drug producers, Health Minister Mongkol na\nSongkhla said on Tuesday.\n\n\"If companies agree to reduce the price of their drugs below generic\nones, we will not enforce compulsory licensing,\" Mongkol told\nreporters in a teleconference call from Geneva, where he attended a\nWorld Health Organisation meeting.\n\nPreviously, Mongkol had said Thailand's right to override patents\nthrough compulsory licences and import or make cheaper medicines was\nnon-negotiable.\n\nHis comments came a day after talks with foreign drug makers in\nBangkok failed to reach a deal on the price of two HIV/AIDS drugs and\na heart medicine targeted for licences.\n\nAbbott Laboratories, which makes the HIV/AIDS drug Kaletra, refused\nto budge on its offer of $1,000 per patient per year for a heat-\nstable version of the drug, Thai officials said.\n\nAluvia is badly needed in tropical Thailand because it does not\nrequire refrigeration like Kaletra, eliminating the need for costly\ncold storage.\n\nAbbott recently cut its price for Kaletra and Aluvia to $1,000 per\npatient per year in 40 low- and middle-income countries, but Thailand\nsays it is still too expensive.\n\nSiriwat Thiptharadol, head of the drug negotiating committee, said it\nwould continue to press for lower prices at the next meeting on June 1.\n\n\"I have asked Abbott twice if they could make the price even lower,\nbut they insisted that it was a very low price that they sell to\ndeveloping countries,\" Siriwat told reporters.\n\nAbbott has not commented on the negotiations.\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}