{"category": "spam", "to_address": null, "from_address": "Abdul Hakim Zamal <hakimzamal17@hotmail.co.uk>", "subject": "Assist Sincerely", "body": "\n\n\n\n\nGreetings to you,\nAs you read this, I don't want you to feel sorry for me, because, I believe everyone will pass on someday everyone eventually has appointment with death. My name is Abdul Hakim Zamal a merchant in Dubai, United Arab Emirate (U.A.E).\n \nI have been diagnosed with lung cancer.  It has defiled all forms of medical treatment, and right now I have only about a few months to live, according to medical experts (I am in a private ward in a private hospital here in the United Kingdom). I have not particularly lived my life so well, as I never really cared for anyone (not even myself) but my business. Though I am very rich, I was never generous, I was always hostile to people and only focused on my business as that was the only thing I cared for.\n \nBut now I regret all this, as I now know that there is more to life than just wanting to have or make all the money in the world.  I believe when God gives me a second chance to come to this world I would live my life a different way from how I have lived it. I have willed and given most of my property and assets to my immediate and extended family members as well as a few close friends. I want God to be merciful to me and accept my soul so, I have decided to give also to charity organizations, as I want this to be one of the last good deeds I do on earth. So far, I have distributed money to some charity organizations in the U.A.E, Algeria and Malaysia. Now that my health has deteriorated so badly, I cannot do this myself anymore.\n \nI once asked members of my family to close one of my accounts and distribute the money, which I have there to charity organization in Bulgaria and Pakistan; they refused and kept the money to themselves. Hence, I do not trust them anymore, as they seem not to be contented with what I have left for them.  The last of my money, which no one knows of, is the huge cash deposit of $18 Million Dollars that I have with a Security Company abroad. I will want you to help me collect/receive this deposit and dispatched it to charity organizations.\n \nI will like to inform you that for all your time, effort and sincere honesty you will be given 10% of the funds, this is from the depth of my heart.\n \nI'll be awaiting your quick response.\n \nWassallam.Abdul Hakim Zamal.\n Be one of the first to try Windows Live Mail. Windows Live Mail.\n"}