{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "As Iran moves ahead with their nuclear program,  the US is secretly working to sabotage it. Don't miss our Exclusive report tonight on the CBS Evening News with Katie Couric. ", "body": "\n\n\nCBSNews.com\n\n\n \n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nQUOTE OF THE DAY\"You cannot depend on your eyes \n      when your imagination is out of focus.\" - Mark Twain \n      \n\n\n\nDID YOU KNOW?Gunsmoke debuted on \n      CBS-TV in 1955, and went on to become the longest-running (20 years) \n      series on television. \n\n\n\nTONIGHT ON THE CBS EVENING NEWSHere is an early \n      preview of what we are planning for tonight's CBS EVENING NEWS from Anchor \n      and Managing Editor, Katie Couric... Hi everyone, \n      We'll begin tonight's broadcast with an exclusive report on secret \n      efforts to delay Iran's moves to acquire and develop nuclear technology. \n      Sheila MacVicar will have the story, and David Martin will \n      fill in more details about our country's volatile relationship with Iran. \n      In Iraq, the search for the three U.S. soldiers seized two weeks \n      ago continues. Today, the hunt yielded a body that Iraqi police believe to \n      be one of the missing soldiers. Mark Strassmann reports that the \n      military continues the search while investigators hurry to find more clues \n      and identify the body. At home, the summer travel season is \n      rapidly approaching, and the Federal Aviation Administration announced a \n      new program that is aimed to help better navigate the upcoming stormy \n      summer months. Could it work? Nancy Cordes will report. If \n      you're an individual in the United States seeking medical insurance \n      coverage, the odds are stacked wildly against you. Our investigative team \n      has been probing the sometimes questionable tactics used by insurance \n      companies, and tonight Armen Keteyian will have our report. \n      Finally, Sandra Hughes will report that concern is growing \n      for the safety of the wayward whale duo dubbed Delta and Dawn, as they \n      have been circling near a Sacramento River bridge. Scientists analyzing \n      photographs of the mother-and-calf pair say their appearance indicates \n      declining health. We'll have more details on these whales and what others \n      of their species to get themselves in situations like this. \n      I hope you'll join us. Katie For \n      more information on these stories, please click on the following \n      links: U.N.: Iran Enriching More, Closing Doors Click \n      Here Making A Raucous Noise Unto The Whales Click \n      Here And here's a look at one of the stories we're working \n      on for Thursday's broadcast: A CBS News Investigation... 16 \n      million Americans have what's called \"individual health coverage\"... or \n      THINK they do. This story and much more, Thursday, on the CBS \n      Evening News. If you would like more information on any of \n      these stories or the broadcast, please click on the following address and \n      e-mail us: evening@cbsnews.com \n      \n\n\nTONIGHT ON DAVID \n      LETTERMANJoin Dave tonight on The Late \n      Show with actress Rosie Perez... And don't miss seeing these \n      stupid pet tricks. Plus, musical guest Dr. Dog! \n\n\n\n \nTHURSDAY \n      MORNING ON THE EARLY SHOW\nHarry Smith, Hannah Storm, \n      Julie Chen and Russ Mitchell anchor THE EARLY \n      SHOW from New York. John Bolaris, of \n      our New York affiliate, WCBS, will bring us the weather. Dave Price \n      is on assignment. Along with the top news of the day, we will \n      also have the following stories: AMERICAN IDOL WINNER: \n      Wednesday night, Blake Lewis and Jordin Sparks learn their fate as one is \n      named the next American Idol. What did your votes decide? And did America \n      get it right? E! Entertainment anchor and EARLY \n      SHOW Special Correspondent Giuliana \n      DePandi will join us with America's choice for singing stardom... and \n      the runner-up too. HAPPILY EVER AFTER, PART 4: Twins Runda \n      and Randa Harris have rarely spent time apart. They went to prom together, \n      modeled together, and when it came time for their weddings, they had a \n      double ceremony. The two couples made homes for themselves next door to \n      one another, so they would never be far from each other's sides. When \n      Hurricane Isabel struck, a 70-ft tree fell on Runda's husband, resulting \n      in traumatic brain injury. The incident tested their relationship and \n      showed the twins the power of family and love. We'll have this incredible \n      story Thursday morning. WYNTON MARSALIS: Wynton Marsalis \n      will join us to talk about his reunion concert with most of the original \n      members of the Wynton Marsalis Septet, commemorating the fifteenth \n      anniversary of the debut of the critically acclaimed In This House, On \n      This Morning. CSI MUSEUM OPENS IN CHICAGO: This Friday, \n      the CSI Museum is set to open its doors in the Windy City. \n      EARLY SHOW National Correspondent \n      Tracy Smith will have a sneak peek at all the sights and sounds \n      live from Chicago. YOUNG AT HEART: THE GOOD SPOUSE: Getting \n      older isn't for sissies. 90% of all senior citizens have at least one \n      chronic illness. Understanding and assistance from a spouse are crucial in \n      making the life adjustments these diseases require. But how can you be a \n      good spouse without nagging or interfering? Gabi Redford, features editor \n      for AARP The Magazine, will join us with advice. \n      WILLIAMS SONOMA: MEMORIAL DAY PICNIC: It's that time of \n      year! Memorial Day weekend. And for many, that means firing up the \n      backyard barbeque and grilling up a feat for friends and family. But if \n      grilling under the hot sun doesn't strike your fancy, you can have just as \n      much fun with a festive holiday picnic. Instead of packing the usual \n      sandwiches and potato salad for a Memorial Day picnic, our friend and \n      cookbook author Tori Ritchie will join us with some delicious \n      alternatives for the weekend. If you would like more information \n      on any of these stories or the broadcast, please click on the following \n      address and e-mail us: earlyshow@cbs.com \n\n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}