{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Infocast<Infocast@calcium.netcontentinc.net>", "subject": "Carbon Finance and Investment Summit May 21-23 2007  NY NY", "body": "\n\n\nCarbon Markets\n\n\n 0 \n \n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n\t\t    Tuesday May 22 – 23, 2007\nClick Here To Download Brochure \n \n\n\n\n\n\n\nGold Sponsors\n\n\n\nSilver Sponsors\n\nLuncheon Sponsor\n\nBreakfast Sponsor\n\nSupporting Organization\n\nMedia Partners\n\n\n\n\n\n\n\n\n \nWhere Carbon Players Come \nTo Do Business\n\n\n\n\nCome together with investment banks, private equity funds, hedge funds, carbon funds, project developers and lenders, clean tech companies, energy companies, major corporations, and other active carbon players to establish relationships and take advantage of the growing opportunities in:\n\nThe global carbon market\nThe retail carbon market\nThe greenhouse gas reduction project and aggregator market\nClean technologies\nTrading and investing in carbon offsets and allowances\n\nAbout the Summit:\n\nThe integration of North America into the global carbon business arena is ushering in a wealth of new business opportunities for North American and European firms alike.  U.S. firms are quickly making their move to expand their activities in both North America and around the globe, while Europeans are setting up shop to do business in the U.S.  The environment for building new business relationships, taking advantage of new opportunities, and making deals is undeniably ripe! \n\nLeveraging off our highly successful Finance & Investment Summit series, Infocast is launching the new place to be for carbon players with its inaugural Carbon Finance & Investment Summit. This is sure to be the place for players in the carbon market-where carbon players will come year after year to do business and make deals. \nThe Summit will bring together leading investment banks, carbon funds, carbon companies, private equity funds, hedge funds, project developers, carbon aggregators, project lenders, energy companies, major corporations, clean tech companies and other players to facilitate the building of business relationships and to foster new market transactions.\n\nThe Summit will also offer the perfect venue to gain a deep understanding of how these players intend to play in the world markets, the retail markets, and the project market as well as their plans for technology plays and other investment strategies.  They will discuss\n\nThe type of opportunities they are pursuing\nThe strategies they are adopting\nThe type of relationships they are seeking to establish with third parties\nThe drivers that will determine which type of deals they are willing to make\nThe factors that will influence the level of their transactions in the coming year\n\nThe Summit is a highly productive environment where you can successfully network and conduct business with carbon players who are leading the way forward in developing the carbon markets of the future.\n\n\n\nPre-Summit Workshop:\n\nThe pre-Summit workshop Estimating Carbon Values and Assessing their Impact on Alternative Business Model will explore the approaches to developing a clear estimate of future carbon value and will look at how these carbon values impact the viability of four specific business models\n\n      \n\nClick Here To Download Brochure\n        Register by Phone at (201) 784-5389 \n\n\n\n\n \n\nKeynote Address\nOpportunities for North America in the World Carbon Market\n\n\n\nGovernor George E. Pataki,\n        NEW YORK.\n\n\n\n\n\n\n\nCarbon Players Speaking at the Summit:\n\n\n\nAES\nAgCert\nAmerican Electric Power\nAPX, Inc\nBaker McKenzie\nBarclay's Capital\nBluesource\nCamco International\nCitigroup\nChatham Environmental Group\nCredit Suisse\nDuke Energy Corporation\nEcoSecurities\nEEA Fund Management\nenXco\nEvolution Markets\nFirst Reserve Corp.\nFortis Merchant Banking\nICF International \nIETA\nJ.P. Morgan\nKinder Morgan CO2\nLazard\nLondon Climate Change Services Group\nMissionPoint Capital\nMorgan Stanley\nNatsource\nNGP Energy Technology Partners\nNRG Energy\nOneCarbon\nPace Global Energy Services\nPIRA\nPoint Carbon\nRabobank International\nSempra Energy\nShell\nStandard Bank\nStark Investments\n\n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to gvwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}