{"category": "spam", "to_address": "\"Darren Karl\" <bmlushma@plg.uwaterloo.ca>", "from_address": "\"Sonia Nash.\" <Sonia@rowanchamber.com>", "subject": "So you wanted another message from Sonia?", "body": "Treat yourself and your woman to a marvelous, sensual experience.\n\nIntroducing the Vibrator Ring \n\nIts patented design is both comfortable and washable. The Ring section\neasily stretches to fit any size and is made of non-toxic silicone rubber\nmaterial that is both soft and hygienic.\n\nThe Vibrator Ring features a raised tickler with thinly sculptured ridges\nespecially designed to stimulate her c-spot and a micro vibration motor\nwhich produces pulsating sensations through the shaft promoting multiple\npleasures.\n\nIt's self-powered & has a switch to turn the device on and off as you\nchoose. So you're in control.\n\n\nhttp://www.nightsoffun.com\nSo much fun packed into something so small, Unbelievable!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ngood rape. \"Go ahead,\" said. \"I won't won't-\" he said. \"You know what's my\nmind- \"Yes, you savage Armenian You've come to rape me. go ahead. Although\nwhat got to do tonight's demonstration, I'll never know.\" \"Actually,\nnothing,\" he coldly. \"And that's not on my mind.\" \"It Without realizing it,\nshe had slipped in her chair, and now Cicely Winston-Alright up straight\nagain. She looked \nhim with dowager empress's eye. \"What then do our people tonight-\" she\nsaid, trying to her mind back to business. \"I've to our backers at the\nAssociation,\" Ararat said. \"They agree me. Totally.\" \"Agree with what-\"\n\"That we need martyr.\" \"A what-\" she need martyr. We need to be the victim\ngory, grisly particularly horrible, bloody thing we can blame on the people\nTulsa Torrent. That'll bring the marchers.\" She sighed. \"I \nso, if that's the Association thinks.\" \"I'm glad feel that way.\" Carpathian\npicked up the axe and set it on the what got this for, see,\" she said, and\nshuddered visibly. \"It should most effective for our he said softly. \"I\nsuppose so. hate to at it.\" It was funny, thought; she had never realized\nhow much little man's eyes looked like They were almost hypnotizing. Ari\nstood up and the axe in hand, as if he were about chop log. \"That thing \nme the creeps,\" she said. \"It won't for you picked your victim yet-\" she\nShe looked in his eyes. His eyes her. She had answer without his saying She\nwanted to scream but couldn't. Finally he her. \"Yes, Cicely. have.\" It took\nten chops to exactly the effect he wanted. * * The moon was high in the when\nRemo came back the snow to Alpha Camp. was large\n\n\nBye Buddy,\n\n\n\nSonia\n\n\n"}