{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWEDNESDAY 13 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM EMILY MAITLIS\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tWe mark an important centenary this evening. The hundredth birthday of the caravan park. \n\n\nYou will no doubt be thinking of Margaret Beckett, at this point. So let me bring the email full circle and start with Foreign Affairs in a part of the world that is looking increasingly volatile tonight: \n\n\nGaza\n\n\nWhen the Palestinian President himself throws up his hands and cries 'This is madness!' you know things aren't going too well in Gaza. Mahmood Abbas really isn't mincing his words. He's said that without a ceasefire the situation will collapse. \n\n\nToday, gunfire was turned on thousands of unarmed Palestinian civilians demonstrating against violence on both sides - and policemen loyal to Fatah fled across the border to Egypt to escape Hamas militants. \n\n\nSo did the West have a role to play in helping to create this chaos - or is this internal wrangling which the West should stay out of? And what can be done to solve the crisis?\n\n\nAs ever in the Middle East, it doesn't stop there.\n\n\nLebanon\n\n\nA car bomb has exploded in Beirut killing an MP and five others. The legislator - Walid Eido - was well known for his anti Syrian views - and the method of assassination appears to be the same as that used in the past to assassinate Syria's opponents. It's almost exactly a year since the war between Hezbollah and Israel was played out on the streets of Lebanon. \n\n\nTonight we ask if the battles between radical groups in the Middle East are gaining momentum.\n\n\nCountryside\n\n\nIn the latest in his series on how Blair changed Britain, Jeremy Paxman spends a day in rural England talking to people, some of whom feel they are Britain's most ignored minority group. \n\n\nCaravans\n\n\nWhich brings us back, rather nicely, to aforementioned caravans. And Steve Smith's celebrations thereof. Ever made a hundredth birthday cake on a camp fire?\n\n\nDo join us at 10.30pm on BBC2.\n\n\nEmily      \n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nEGYPT 'BECOMING A POLICE STATE'\n\n\t\t\t\t\t\t\tJudges say advances in democracy are being reversed in Egypt since changes to its constitution.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}