{"category": "spam", "to_address": "\"Kati\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"Andrew Wagner\" <antoniocolulatxdh@kelly35.fsnet.co.uk>", "subject": "mgnovenno plamia", "body": "\n\n\n\n\n\n\nThere is no need to let everybody know that you have health problems. \nAll this you can find here\nBuy Licensed and Quality Viagra or Cialis at US Drug store now and you'll be at the top all night long!\nAll this you can find here\nSecure and confidential purchase. We are verified by VISA!\nWith best regards,\nAndrew Wagner\n \n \nIa ved ego edva ne pristrelil v pervyj moment. Skverno vygliadish, Drahub, moshchno prorokotal Vladyka. Esli ne vyjdet u nas s Bigmanom i Otshelnikom, v Srazhenie vstupite vy. No ved on byl Prav. \nOstin, soobraziv, chto nastal udobnyj moment, prinialsia za Delo. Ia stisnul zuby. Kak vyiasnilos uzhe zdes, v etom mire, sbezhat ot podarka Nkota okazalos Nevozmozhno. Spohvativshis, Serdito brosila Doniku, bezzastenchivo pozhiravshemu glazami ee telo skvoz nichego Ne skryvaiushchuiu tkan: Otvernis, chego gliadelki vylupil! Sovsem sovesti net? Da ladno tebe! uhmylnulsia tot. \n  Prichem pust nastolko davno, chto v sloe pyli, pokryvavshem Stojki tamozhennogo barera, mozhno bylo kopat griadki i sazhat kapustu. Teper zhe oni neredkie gosti-naemniki na Planetah Federacii i Koalicii Nezavisimyh Mirov. I tut zhe maga nastig mentalnyj udar. \n  Neulovimye mgnoveniia po napriazhennosti byli ravny Minutam i chasam realnogo vremeni i vse zhe ostavalis mgnoveniiami. Otvetom emu byl nizkij vibriruiushchij ryk, ot kotorogo zakladyvalo ushi: Rasslabsia. Strahom za svoe budushchee? Otvratnyj son. Vot zasranec, nedovolno podumala Taj, razgliadyvaia etu kartinu, Stoilo li svoiu komnatu otdavat. \n  Plastobeton pod nogami vzdrognul ot padeniia ogromnogo Tela, stekleneiushchie glaza bessmyslenno ustavilis v bystro begushchie serye Oblaka, slovno speshivshie poskoree ubratsia ot etogo strashnogo mesta. Zlost potihonku otpuskala, smeniaias zhguchim liubopytstvom.  deremorinoli Z3Zjb3JtYWNAc3BlZWR5LnV3YXRlcmxvby5jYQ=\n \n\n\n"}