{"category": "ham", "to_address": "\"Albrecht,\n\tDr. Stefan (AZ Private Equity Partner)\" <stefan.albrecht@apep.com>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] rbind() of factors in data.frame", "body": "On Thu, 19 Apr 2007, Albrecht, Dr. Stefan (AZ Private Equity Partner) wrote:\n\n> I would like to inquire, if it is a desired feature that the combination \n> with rbind() of two data frames with factors columns does not sort the \n> factors levels of the combined data frame.\n\nYes, and a documented one. To wit, the help file says\n\n      Factors have their levels expanded as necessary (in the order of\n      the levels of the levelsets of the factors encountered) and the\n      result is an ordered factor if and only if all the components were\n      ordered factors.  (The last point differs from S-PLUS.)\n\n>> str(rbind(data.frame(a = factor(c(4, 3))), data.frame(a = factor(c(2, 1)))))\n> 'data.frame':   4 obs. of  1 variable:\n> $ a: Factor w/ 4 levels \"3\",\"4\",\"1\",\"2\": 2 1 4 3\n>\n> I would expect the combined factor levels to be sorted, as long as both \n> factors are not ordered.\n\nI would find that very undesirable: if the order matters at all, it seems \nrare that alphabetic (which is highly locale dependent) is optimal. In any \ncase, if you rbind factors with the same levelset (perhaps the only really \nsensible usage), you do not want the result to have a different levelset.\n\n[And why would _you_ expect it to do something other than the help page \nsays?]\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}