{"category": "ham", "to_address": "sugar@laptop.org", "from_address": "Ian Bicking <ianb@colorstudy.com>", "subject": "[sugar] Web activity & ebook reading", "body": "So we've been talking about \"the\" ebook reader, and how it might work.\nFor reading HTML or things that would be converted into HTML (e.g.,\nCrossmark), the browser seems like an obvious basis for a reader.\nThere's not a huge number of basic features that aren't in the browser\ncurrently.  So we're thinking about how we might add these extra features.\n\nI've been reading the list of methods as described here:\n   http://www.pygtk.org/pygtkmozembed/class-gtkmozembed.html\nand there's not a lot of methods.  Changing buttons, maybe allowing you\nto switch modes, all seems pretty reasonable -- the code at least all\nlooks simple enough.  But some of what we want to do involves getting at\nthe document object.\n\nAs an example, if you get to the bottom of a document, and the document\nhas a  tag, then a page-down from there should take you\nto the linked page.  Then you can flow through a linear but multi-page\ndocument fairly seamlessly (assuming it's been marked up nicely).\nThere's a variety of things we'd like to do, including injecting the\nJavascript to implement the ubiquitous annotation.\n\nIs the current browser activity -- and more specifically pygtkmozembed\n-- the right basis for this kind of work?  In the short term, are there\nways we can start adding these features (even if the implementation may\nhave to be discarded later)?\n\n\nLooking at details, we were thinking that maybe browser.append_data()\ncould be used to inject at least a little Javascript.  I tried adding\nthis to WebActivity.__init__:\n\n   self._browser.connect('notify::net-stop', self._doc_loaded_cb)\n\nThen:\n\n   def self._doc_loaded_cb(self, embed, *args):\n       data = ''\n       embed.append_data(StringIO(data), len(data))\n\nBut I couldn't get the signal to fire at all; I couldn't get any signals\nto work except notify::title.  Maybe there's something magic that I\ndon't understand here.  Anyway, that might give me a crude way to hack\non stuff.\n\nCheers,\n   Ian\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}