{"category": "ham", "to_address": "cc-bizcom@lists.ibiblio.org", "from_address": "aryeh@miai-siw.org", "subject": "Re: [Cc-bizcom] an alternate licensing option where the\t'community'\n\tdetermines value-not the contributors", "body": "Tell me if I am wrong but isn't this just an other facet of  \nSustainable Intellectual Work (http://www.miai-siw.org)?\n\n--Aryeh\n\nQuoting Ryan Schultz :\n\n> Thanks Marshall for the feedback.  If at all interested, I rewrote and tried\n> to clarify my argument for finding this alternative, community-based CC\n> license.\n>\n> http://studiowikitecture.wordpress.com/2007/05/11/win-win-ip-rights/\n>\n>\n>\n> Here's a quote, from\n>  591841380/ref=pd_bbs_sr_1/002-6577930-9904042?ie=UTF8&s=books&qid=1175876811\n> &sr=8-1> 'Wikinomics: How Mass Collaboration Changes Everything' that I feel\n> really sums up this approach:\n>\n>\n>\n> \"The interesting model is the one that falls in the middle ground-a model\n> that says we're collaboratively building something that will be privately\n> owned by our consortia, or maybe your shares of ownership are apportioned in\n> proportion to how much you brought to the table.  One could envision a\n> 'digital-age co-op\" with peer rating systems that dynamically apportion\n> shares to contributors based on the community's assessment of the value\n> added by individual contributors.  Annual profits from sales and serves\n> could then be distributed across the community of contributors\"\n>\n>\n>\n> Ryan\n>\n>\n>\n>\n>\n>   _____\n>\n> From: Marshall Van Alstyne [mailto:marshall@MIT.EDU]\n> Sent: Tuesday, April 17, 2007 5:14 PM\n> To: cc-bizcom@lists.ibiblio.org\n> Cc: Ryan Schultz\n> Subject: Re: [Cc-bizcom] an alternate licensing option where the 'community'\n> determines value-not the contributors\n>\n>\n>\n> Ryan, here are several thoughts based on the questions you raised.\n> Apologies for a delay, I've been preparing a tenure package and that has\n> dominated all other tasks.    Your set of issues around NonCommercial and\n> Commercial licenses raise multiple follow up ideas!\n>\n> At 03:16 PM 4/17/2007, you wrote:\n>\n>\n>\n> Let's say I make a derivative work using someone else work that's under the\n> \"NonCommericial\" license option and I want to commercialize it to make\n> money.  Under this license I have to approach the original licensor to work\n> out a commercial licensing agreement to establish payout percentages.  I run\n> the risk, however, that the original licensor will not want to come to a\n> fair and balanced assessment of each other's contribution.  With this\n> potential risk loaming in the future, I am less likely to even start a\n> derivative work in the first place-there's less initial incentive.\n>\n>\n> I think you've nailed one of the biggest problems.  In fact, it seems there\n> are related two sub-problems.  One is hold-up from a single owner -- in this\n> case the (c) holder -- who will want to negotiate for a chunk of value.  The\n> other is the cleverness of the idea can be lost if you try to negotiate and\n> accidentally disclose it.\n>\n> Either way, I agree that these 2 kinds of risk discourage a person from\n> making any kind of investment beforehand.\n>\n>\n>\n>\n> What if, however, there was a New Licensing option-somewhere between\n> 'Attribution Non-commercial' and 'Attribution No Derivatives'-that stated\n> that you are free to pursue commercial gain without consent, but if the\n> derivative work marks money, the payout percentages are assessed by the\n> community and not left up to the individuals and their lawyers to determine?\n>\n>\n>\n> One possibility that I like a lot is to use a default menu.  That is,\n> suppose the license has an offer of the following form:\n>\n> If you make $x amount of money, then contribute y% of revenue to the\n> original work.\n> If you make $(x+d) amount of money, then contribute (y+n)% of revenue to the\n> original work.\n> etc.\n>\n> Alternatively,\n>\n> If you keep your piece closed for x years, then contribute y% of revenue to\n> the original work.\n> If you keep your piece closed for (x+d) years, then contribute (y+n)% of\n> revenue to the original work.\n> etc.\n>\n> This set of default options lets the person writing the derivative work\n> choose based on a fairly clear set of terms.\n>\n>\n>\n>\n> So in other words, under this agreement the assessment of value contribution\n> is determined by the community and not the individual parties.  In this case\n> I can have a little more confidence using someone else work initially,\n> knowing that if my derivative work does indeed make money, that the\n> community's assessment will mostly likely grant a fair evaluation.\n>\n>\n> This idea is pretty interesting.  I see at two possible concerns.  (1) Is\n> that there is still some uncertainty over what the final % will be.  I agree\n> it seems that the \"community,\" however defined, is likely to be more neutral\n> in assessing value but there is still some lack of clarity beforehand. (2)\n> Have you thought about how large a community you need?  If it's very small,\n> there may be too few voters to establish a meaningful baseline so there\n> might be a need to build the community first.\n>\n>\n>\n>\n>\n> What is the community in this case?  Well that could take many forms\n> depending on the media and/or mode of distribution.  In the music industry,\n> diehard fans could determine, through some type of ranking system, how each\n> artist should be paid out.  If, however, asking the public to audit\n> contribution becomes too overwhelming, there could be a pool of editors that\n> get paid to make these assessments.   This system of editors, however, would\n> have to be anonymous in a sense, to avoid the possibility of bribery or\n> kickbacks.  An additional safeguarding mechanism could be utilized were the\n> editors in turn rank each other.  Editors that show an unusual high level of\n> bias would be flagged by the community of editors and thus facilitate a\n> higher level of consistency.\n>\n>\n> Overall, this idea sounds quite useful.  A good reputation system can be\n> used to \"rate the rater\" and help ensure integrity in the review process.\n>\n> This \"information revelation\" mechanism looks like it should require a\n> subsidy i.e. some means of compensating the raters for their time and\n> effort.  If done well, it could be covered out of the revenues generated by\n> the pool of derivative works themselves.\n>\n> Another form of information disclosure mechanism could be to have people who\n> actually download the derivative work themselves state what % of value the\n> new piece adds.  This is harder to \"fake\" since someone must actually pay\n> for the good (so if you're going to stuff a ballot box it's going to be\n> costly).  It's also unbiased because the person doing the buying is not\n> independent of the person doing the rating.\n>\n>\n>\n>\n>\n> Although I'm sure there's ways to establish a fair assessment of value, this\n> licensing system would require a transparency in accounting as well-such\n> that contributors would be assured that all the revenue is accounted for.\n> Transparent accounting might be a tall order, but if artists demand it,\n> producers will find a way too oblige.\n>\n>\n> This is also an excellent point.  It has long been an established tenet of\n> economics that more complete information leads to greater efficiency in\n> production.  Such a system should be as transparent as possible.\n>\n> Note also that it should also align incentives the right way e.g. no one\n> should have a reason to misrepresent their rating, and the raters' votes\n> should correspond closely to the consumers' reasons for buying.\n>\n>\n>\n>\n>\n> Anyways, Just a little food for thought.  Let me know if there's any major\n> hurdles I'm not considering in implementing a system like this. just\n> thinking out loud here.\n>\n>\n> Personally, I think the questions you raise are very interesting.  Plenty of\n> thought munchies here! :-)\n>\n>\n>\n>\n>\n> Is there any current discussion out there that addresses this idea?  I could\n> not find any. If you could forward, I'd be much appreciative.\n>\n>\n> There is some good discussion on the Free Software Business (fsb) discussion\n> group but aside from that, I've found very little on this topic.  Thanks for\n> raising some interesting issues.\n>\n> MVA\n>\n>\n>\n>\n>\n>\n> Thanks\n>\n>\n>\n>\n>\n>\n>\n> _______________________________________________\n> Cc-bizcom mailing list\n> Cc-bizcom@lists.ibiblio.org\n> http://lists.ibiblio.org/mailman/listinfo/cc-bizcom\n>\n>\n\n\n_______________________________________________\nCc-bizcom mailing list\nCc-bizcom@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-bizcom\n\n"}