{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 147", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Italy. L'opera si trovava nell'abitazione di un collezionista\n      romano. Arrestati due ladri romani pluripregiudicati,\n      specializzati in furti nelle chiese\n      (Museum Security Network Mailing list)\n   2. Innsbrucker Kunstdiebstahl glimpflich verlaufen\n      (Museum Security Network Mailing list)\n   3. Nearly five years after Frederic Bednarz's violin was stolen\n      from a Harvard Square music school, police have found the $24,\n      000 instrument. But it's unclear if police ever plan to charge\n      the\tcrooks involved in the high-profile heist.\n      (Museum Security Network Mailing list)\n   4. FOREST PARK, Ill., June 19 (UPI) -- The Forest Park, Ill.,\n      owners of a missing 500-pound elephant sculpture say they won't\n      press charges if the item is returned.\n      (Museum Security Network Mailing list)\n   5. Is Art being Stolen to Order?\n      (Museum Security Network Mailing list)\n   6. AUSTIN - Two men have been charged with stealing music\n      memorabilia that once belonged to late blues guitarist Stevie\tRay\n      Vaughan from his brother's storage unit, police said.\n      (Museum Security Network Mailing list)\n   7. The J. Paul Getty Museum,\tunder fire by countries that\n      contend some of its priceless ancient\tart collection was stolen,\n      on Wednesday announced the appointment of a new curator of\n      antiquities. (Museum Security Network Mailing list)\n   8. The secretary-general of Interpol has criticized Norwegian\n      police for withholding information about the theft of the\tMunch\n      paintings. (Museum Security Network Mailing list)\n   9. Austria. Kunstdiebstaehle in Genf und Gaenserndorf\n      (Museum Security Network Mailing list)\n  10. Thieves take Beuys painting,\tAfrican art in $1.9 million\n      Swiss heist (Museum Security Network Mailing list)\n  11. Picasso drawing stolen in Austria\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Thu, 21 Jun 2007 06:39:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Italy. L'opera si trovava nell'abitazione di un\n\tcollezionista\tromano. Arrestati due ladri romani pluripregiudicati,\n\tspecializzati in furti nelle chiese\nTo: \nMessage-ID: <035c01c7b3be$1e3beb70$5ab3c250$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nArte: Roma, torna a Santa Barbara dei Librai la pala rubata nel 2006\n\nL'opera si trovava nell'abitazione di un collezionista romano. Arrestati due\nladri romani pluripregiudicati, specializzati in furti nelle chiese \n\nascolta la notizia Roma, 19 giu. - (Adnkronos Cultura) - La banda\nspecializzata in furti d'arte nelle chiese, che agiva sulla piazza di Roma ?\nstata sgominata. Il 26 settembre del 2006 aveva portato via dalla chiesa di\nSanta Barbara dei Librai la pala d'altare raffigurante il \"Paesaggio con\nMadonna e Bambino verso il cielo, Santa Barbara, San Tommaso D'Aquino e San\nGiovanni di Dio con frati o confratelli inginocchiati ai loro piedi\". Ora,\ngrazie all'azione della sezione antiquariato del Comando Carabinieri Tutela\nPatrimonio Culturale, la pala rinvenuta potr? tornare nella sua chiesa, per\nla gioia dei fedeli e dei visitatori.\n\nLa pala, della quale non esisteva un'immagine leggibile che aiutasse i\nCarabinieri nella ricerca, era accompagnata, sul retro, dalla lettera di\ncommittenza del 1682 a firma del \"Card. Fachenettus\" che, rinvenuta in casa\ndi un collezionista romano, ha fornito la prova dell'identit? del dipinto\nche si trovava, infatti, in una camera adiacente dell'abitazione. Il\nrinvenimento della pala e di altri oggetti d'antiquariato e opere d'arte,\nper un valore che sfiora mezzo milione di euro, rientra nello sviluppo e\nprosecuzione di indagini gi? portare a termine, tra cui l'operazione Piazza\nPulita (2004/2005) e l'operazione Paliotto, riguardante la serialit? di\nfurti nel centro di Roma con la sua batteria parallela di Siena (2006).\n\n\"Queste indagini hanno portato, cinque giorni fa, all'arresto con ordinanza\ndi custodia cautelare di due ladri romani pluripregiudicati, specializzati\nin furti d'arte nelle chiese: N.S. di quaranta anni, tossicodipendente e\nS.B., di 48 anni - ha spiegato il tenente colonnello Ferdinando Musella -\nritenuti responsabili di almeno dieci dei furti nelle chiese romane\ndell'ultimo periodo e di quello dei candelabri dal cimitero monumentale del\nVerano\". Individuati anche i truffatori che, presentandosi come una coppia\ndistinta, si conquistavano la fiducia degli antiquari dai quali prendevano\ndelle opere in prova, per vedere l'effetto che facevano nella loro lussuosa\ndimora, salvo poi scomparire con la refurtiva. \n\nI truffatori, gi? pronti a mettere in atto un piano ai danni delle\ntelevendite d'arte, sono stati trovati in una nuova casa all'estrema\nperiferia romana, verso i Castelli. La banda farebbe capo a una famiglia\nromana nota nell'ambito delinquenziale. Tra le opere che mancavano\nall'appello al termine delle operazioni Piazza Pultia e Paliotto, e che ora\nsono state rinvenute, anche due veri e propri capolavori: l'olio su tela \"La\ncaduta della manna\" di Pierfrancesco Cittadini detto Il Milanese e la \"Dama\na mezzobusto con rosa nei capelli\" attribuito a Pompeo Batoni, entrambi\nrubati dall'abitazione privata di un antiquario nei pressi di piazza di\nSpagna. Tra le varie opere trafugate dalla dimora dell'antiquario, ora\nmancano all'appello due preziose nature morte di Munari.\n\nTra le altre opere recuperate nell'ambito dello sviluppo delle indagini,\nl'olio su tela \"Il martirio di San Sebastiano\", copia del tardo 1700 tratta\ndall'originale di Guido Reni; una copia di pistole a pietra focaia e\navancarica firmate \"Cassargnad\"; una natura morta con frutta e garofano di\nscuola fiamminga (XVII secolo); un crocefisso in avorio; un orologio da\ntavolo con scultura raffigurante una fenice alata, del tardo 1700; il\ndipinto \"Visitazione della Madonna ad Elisabetta\" (XVIII secolo) rubato\ndalla Chiesa di Maria Santissima Immacolata di Siena e una serie di argenti\nd'epoca.\n\n\nhttp://www.adnkronos.com/\n\n\n\n------------------------------\n\nMessage: 2\nDate: Thu, 21 Jun 2007 06:39:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Innsbrucker Kunstdiebstahl glimpflich verlaufen\nTo: \nMessage-ID: <035d01c7b3be$1f6bdff0$5e439fd0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nInnsbrucker Kunstdiebstahl glimpflich verlaufen\n\nDrei Gem?lde im Wert von rund 200.000 Euro sind einer Innsbrucker Familie am\nvergangenen Freitag gestohlen worden. Zwei Bilder des ?sterreichers Alfons\nWalde und eines des Schweizers Wilhelm Gimmi hatte ein Mitglied der Familie\nentwendet. Es handelt sich um Waldes ?Prozession? im Wert von 120.000 Euro\nund ?Zwei Bauern vor Schloss Tirol? im Wert von 60.000 Euro. Die ?Spanierin?\nvon Gimmi wird auf 15.000 Euro gesch?tzt. Der T?ter, der zus?tzlich zu den\nGem?lden 50 Goldm?nzen mitnahm, versuchte, die Objekte zu Geld zu machen.\nInzwischen tauchten die Bilder bei einem Innsbrucker H?ndler wieder auf und\nwurden von der dortigen Polizei sichergestellt. Da die Tat im Kreise der\nFamilie geschehen sei, werde sie nicht als Verbrechen gewertet, erkl?rten\ndie Beh?rden in Innsbruck. Bereits im Herbst letzten Jahres wurde ein\n?lgem?lde Alfons Waldes aus einer alarmgesicherten Lagerhalle in Innsbruck\ngestohlen. Das Bild ?Aufstieg der Skifahrer?, mit einem Sch?tzwert von\n500.000 Euro, wurde ebenfalls kurz nach dem Diebstahl wieder aufgefunden.\n\nhttp://www.kunstmarkt.com/\n\n\n\n------------------------------\n\nMessage: 3\nDate: Thu, 21 Jun 2007 06:39:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Nearly five years after Frederic Bednarz's violin was\n\tstolen\tfrom a Harvard Square music school, police have found the $24,\n\t000 instrument. But it's unclear if police ever plan to charge the\n\tcrooks involved in the high-profile heist.\nTo: \nMessage-ID: <035e01c7b3be$20cf4080$626dc180$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nWeston Police help in search for violin\n\n----------------------------------------------------------------------------\n----\n Photo by Mark Thomson: http://www.townonline.com/weston/homepage/x398631723\nViolinist Frederic Bednarz, a former student at the Longy School of Music,\nhad his antique violin worth $24,000 stolen from a locker in 2002. Police\nrecently recovered the instrument.By Erin Smith\nGateHouse News Service\nTue Jun 19, 2007, 07:25 PM EDT \n\n----------------------------------------------------------------------------\n----\n\n\nWeston - Nearly five years after Frederic Bednarz's violin was stolen from a\nHarvard Square music school, police have found the $24,000 instrument. But\nit's unclear if police ever plan to charge the crooks involved in the\nhigh-profile heist.\nFor Bednarz, a Montreal-born violinist, the return of the pricey\n19th-century violin is a case of too little, too late.\n\"Well, you know, it's been such a long time that I've dealt with it and\nbought another violin,\" said Bednarz.\nIn 2002, Bednarz's violin was stolen from his locker in the basement of the\nLongy School of Music while he was at lunch. At the time, Bednarz had just\narrived in Boston for a two-year stint as a professional studies student at\nschool working toward his artist diploma in chamber music performance. Staff\nand musicians searched the school for days, but couldn't find the violin,\nwhich Bednarz had borrowed from his Montreal sponsor.\nThen, last November, Weston Police received a tip about the violin and\nCambridge Police recovered the stolen instrument, according to Weston Police\nChief Steven Shaw. \nInvestigators in Weston and Cambridge began working together on the case\nwhen the violin was first stolen five years ago and revived the partnership\nwhen Weston Police received the tip last year.\n\"It never really fell off the radar screen,\" said Shaw.\nPolice at both departments are keeping the details about the violin's\nrecovery under wraps. Cambridge Police are refusing to discuss the case or\nsay how the rare instrument was found. No one has been charged with the\ntheft, and it's unclear whether Cambridge Police ever plan to make an arrest\nin the case. \n\"That's all we're going to give out,\" said police spokesman Frank\nPasquarello, who refused to give a reason for withholding the information.\nThe violin was earlier rumored to be from the 1700s, one of the rare violins\nstill in existence today crafted by Italian Santo Serafin. More recently,\nhowever, experts estimated the instrument was made in Venice, Italy, around\n1800.\nAt the time of the theft, musicians suspected the violin was stolen by teens\nwho didn't know the value of the instrument. Police and instrument dealers\nhad said the rare violin would be hard to sell on the open market without\ndrawing attention.\nThe insurance company has since refunded the money for the instrument, and\nBednarz bought and tried playing several instruments in past years, finally\nsettling on another older instrument.\n\"It's not exactly what I had, but I like it,\" said Bednarz.\nThe insurance company sold Bednarz's stolen violin at Tarisio auction house\nlast month, according to Chris Reuning, owner of Reuning & Son Violins in\nBoston.\nThe violin sold at auction for $24,150, said Reuning, one of the founding\npartners of Tarisio.\nTarisio is the world's largest auction house for stringed instruments and\nsells more than 2,000 violins, violas, cellos and bows each year.\nAs for Bednarz, he moved back to Montreal this week to play with the\nMolinari Quartet and doesn't mind that his former violin has a new owner.\nSaid Bednarz, \"That's OK. I'm sure someone's happy.\"\n\nhttp://www.townonline.com/\n\n\n\n------------------------------\n\nMessage: 4\nDate: Thu, 21 Jun 2007 06:39:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] FOREST PARK, Ill., June 19 (UPI) -- The Forest Park,\n\tIll.,\towners of a missing 500-pound elephant sculpture say they won't\n\tpress charges if the item is returned.\nTo: \nMessage-ID: <037301c7b3be$223b0580$66b11080$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\n'No questions' if sculpture is returned\n\nFOREST PARK, Ill., June 19 (UPI) -- The Forest Park, Ill., owners of a\nmissing 500-pound elephant sculpture say they won't press charges if the\nitem is returned. \nThe 3-by-4 foot pachyderm is believed to have been taken last week from\noutside an art studio and gallery, the Chicago Sun-Times reported Tuesday. \n\n\"The owners say that if they get it back, there would be no questions\nasked,\" Forest Park police Deputy Chief Tom Aftanas told the Sun-Times. \n\nThe sculpture, which was decorated with thousands of brightly colored and\nmirrored glass squares as part of the city's \"Elephants on Parade\" exhibit,\nis believed to have been stolen Wednesday night or Thursday morning, the\nnewspaper said. \n\n\"It would have taken some effort to move this thing,\" he said. \"You could\nsee drag marks on the sidewalk.\" \n\nhttp://www.upi.com/\n\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Thu, 21 Jun 2007 06:39:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Is Art being Stolen to Order?\nTo: \nMessage-ID: <037a01c7b3be$24210390$6c630ab0$@org>\nContent-Type: text/plain;\tcharset=\"windows-1251\"\n\nIs Art being Stolen to Order?        \nWritten by Sandra Hodgson and Mark Brassingto     \nWednesday, 20 June 2007 \n \nNow we know that art is becoming mainstream, as theft is becoming the order\nof the day, as thieves in hoodies target prints by Banksy the anonymous and\nfaceless graffiti artist. Then a few days later; the conviction of the\nboyfriend of the Olympian Myriam B?dard, for theft of paintings of the late\nGhitta Caiserman-Roth. Nima Mazhari was convicted on the 5th of June of\nstealing the paintings worth $100,000. And in Milwaukee a Delacroix drawing\nhas\n\nArt theft can hardly ever have seemed more fashionable than in this last\ntraumatic week. Nima Mazhari has been convicted of stealing work by Ghitta\nCaiserman-Roth worth $100,000. A gang of youths called \"hoodies\" has made\noff with Banksy prints from a theft in Brighton. And in Milwaukee a work by\nDelacroix stolen some two years ago from a gallery in Milwauke has been\nreturned, by a man who says he found it in the trash!\n\nAs works become more popular and expensive thieves who previously would have\nthought a Mondrian was a new alco-pop are unfortunately starting to take an\ninterest in some of the more popular works of art available today. The hype\nof the anonymous Banksy have clearly increased visibility of his works to\nsuch an extent that an exhibition of his work has been closed. Stuart\nHobday, Director said \"It's a real shame that this exhibition is not going\nahead, but the risk of the art being stolen was fairly high and we\nunderstand the concern raised by the owner of the works.\"\n\nBecause Banksy's works are graffiti they are often easier to steal than\ntraditional works, because of their public nature. Last year a work was cut\nfrom a section of wall in Paddington and later auctioned on eBay for\n?20,000. Murals were also ruined in Whitechapel last month when thieves\ntried to chisel the works from the wall.\n\nMary Jane Ansell a figurative painter based a few doors away on the North\nLaines has said; \"Yes, the Artrepublic is very close to my studio, but I\ndon't know anyone involved: - honest!\" She then continues to say that.\nBanksy is a hugely popular artist locally and obviously his work is becoming\never more attractive to investors and the public alike so no doubt there\nwill be a way to move them on easily, certainly I wouldn't be surprised if\nthey were stolen to order.\n\nAs there can never be doubt as to the authenticity of these works the issues\nraised that there is a ready market for such works are huge. Whilst the\nworks may not actually be being sold on eBay there is clearly a market for\nsale and even more importantly re-sale of such \"known to be stolen\" works.\nThis is important because if such a market did not exist works would not be\nstolen in the first place.\n\nNow that the Banksy show has been canceled at Norwich the question is now\nbeing asked as to whether the publics' access to such works will now be\ncompromised. Of course these works will be seen again in public but the\nnecessary security barriers will surely damage the viewers' experience.\nFurther problems will also arise as city underwriters re-assess the already\npunitive insurance premiums for such shows.\n\nThe conclusion though Mary Jane states is that in a perverse way it actually\nillustrates how much more mainstream art is becoming these days and could\nactually be encouraging for young artists wishing to make their name. The\nfashionable cache of Banksy's work has been increased by the purchase of his\nworks by such celebrities as Angelina Jolie, Brad Pitt and Jude Law.\n\nAbout the Author\nRepresented by: http://www.fairfaxgallery.com The article can be seen at:\nhttp://www.art4aid.org.uk The authors are: Sandra Hodgson and Mark\nBrassingto at http://www.gofour.co.uk (Email at: Admin@gofour.co.ukThis\ne-mail address is being protected from spam bots, you need JavaScript\nenabled to view it ) \n\n\nfrom \nhttp://www.articlesfactory.com/articles/entertainment/is-art-being-stolen-to\n-order.html \n \n  \n\n\n\n------------------------------\n\nMessage: 6\nDate: Thu, 21 Jun 2007 06:39:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] AUSTIN - Two men have been charged with stealing music\n\tmemorabilia that once belonged to late blues guitarist Stevie\tRay\n\tVaughan from his brother's storage unit, police said.\nTo: \nMessage-ID: <037401c7b3be$2333bd60$699b3820$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nJune 19, 2007, 2:29PM\nMen charged in theft of Stevie Ray Vaughan memorabilia \n\nAUSTIN - Two men have been charged with stealing music memorabilia that once\nbelonged to late blues guitarist Stevie Ray Vaughan from his brother's\nstorage unit, police said.\n\nPolice have recovered several items they believe were Vaughan's, including\nmovie screenplays, handwritten song lyrics, photographs of Vaughan with\nother musicians, guitar pick guards, unused concert tickets and backstage\npasses, according to a probable cause affidavit.\n\nPolice said several hundred thousand dollars worth of items are still\nmissing, including six guitars and other items.\n\nJimmie Vaughan's manager, Cory Moore, said the missing guitars belong to\nJimmie.\n\n\"I can assure you that all of Stevie's guitars are in safekeeping,\" Moore\nsaid.\n\nPolice have charged Michael Shane Winders, 37, and James Matthew Malone, 29,\nwith theft, a second-degree felony. Both have warrants for their arrest but\nhaven't been picked up as of Tuesday afternoon, Austin police spokesman Toni\nChovonetz said. Bail had been set at $100,000 for Winders and $132,000 for\nMalone. Information on the men's attorneys was not available early Tuesday.\n\nAccording to the affidavit, police arrested Malone at a hotel in April on\nsuspicion of possession of a controlled substance. Police found items in the\nroom they believed to belong to Stevie Ray Vaughan.\n\nJimmie Vaughan reported several days later that his storage unit had been\nransacked twice in the preceding weeks. Jimmie Vaughan identified the stolen\nmerchandise at a police warehouse, the affidavit said.\n\nIn the affidavit, police said Malone and Winders tried to sell some of the\nmaterial to an auction house in Dallas.\n\nSpie Norwine, director of music memorabilia for Heritage Auction Galleries\nin Dallas, said he was approached by two men in May about selling some\nVaughan memorabilia, including the handwritten lyrics to the song \"Pride and\nJoy.\"\n\n\"When the items were in our possession, using due diligence, we contacted\nCraig Hopkins of the Stevie Ray Vaughan Museum, who said the items were\nauthentic,\" Norwine said.\n\nNorwine said Hopkins notified Jimmie Vaughan, and the auction house learned\nabout the Austin break-in. Norwine contacted Austin police, and the auction\nhouse turned the items over to police earlier this month.\n\n___\n\nInformation from: Austin American-Statesman, http://www.statesman.com\n\nhttp://www.chron.com/\n\n\n\n------------------------------\n\nMessage: 7\nDate: Thu, 21 Jun 2007 06:39:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The J. Paul Getty Museum,\tunder fire by countries that\n\tcontend some of its priceless ancient\tart collection was stolen,\ton\n\tWednesday announced the appointment of a new curator of\tantiquities.\nTo: \nMessage-ID: <039201c7b3be$27c33090$774991b0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nLA's Getty Gets New Chief of Antiquities\nBy Associated Press\n7:55 PM PDT, June 20, 2007 \n\n\nLOS ANGELES -- The J. Paul Getty Museum, under fire by countries that\ncontend some of its priceless ancient art collection was stolen, on\nWednesday announced the appointment of a new curator of antiquities.\n\nKarol Wight, an expert in ancient Roman glass, will be in charge of a staff\nof eight and about 2,500 sculptures, pottery, jewelry and other ancient\nartworks.\n\nMost of the artwork is housed at the Getty Villa at Malibu.\n\nWight's appointment fills the last of several key vacancies in the museum.\nEarlier this year, former Art Institute of Chicago president James N. Wood\ntook over as chief of the J. Paul Getty Trust, which operates the museum.\n\n\"Her passion for the job and long experience in the field of antiquities,\ncombined with a deep understanding of the Getty's collection, make her the\nideal choice for this important position,\" museum director Michael Brand\nsaid in a statement.\n\nWight becomes curator next month. She has been acting curator since Marion\nTrue retired from the post in October 2005. She began her career at the\nGetty in 1985 as a graduate intern in the Department of Antiquities.\n\nTrue and art dealer Robert Hecht have been placed on trial in Rome, charged\nwith knowingly receiving dozens of archaeological treasures stolen from\nprivate collections or dug up illicitly. They deny any wrongdoing.\n\nLast December, the museum settled a decade-old dispute with Greece, agreeing\nto hand over an ancient gold wreath and marble bust that Athens claims were\nillegally spirited out of the country. It earlier returned two sculptures.\n\nThe museum also agreed last year to return 26 antiquities to Italy, but that\ncountry is demanding the return of many more and negotiations have stalled. \n\nhttp://www.latimes.com/\n\n\n\n------------------------------\n\nMessage: 8\nDate: Thu, 21 Jun 2007 06:39:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The secretary-general of Interpol has criticized\n\tNorwegian\tpolice for withholding information about the theft of the\n\tMunch paintings.\nTo: \nMessage-ID: <038401c7b3be$251a57b0$6f4f0710$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nOslo police angered Interpol\nThe secretary-general of Interpol has criticized Norwegian police for\nwithholding information about the theft of the Munch paintings.\nPolice director Ingelin Killengreen rejected Interpol criticism.\n\nThe criticism has come in writing from Interpol secretary-general Ronald K.\nNoble. In a two-page long letter he refers to repeated written and verbal\nenquiries to Norwegian police about information about who was responsible\nfor the theft of the Munch masterpieces \"The Scream\" and \"Madonna\", without\nreceiving an answer.\n\n\"As a result of this, violent criminals who were responsible for one of the\nmajor art thefts of recent decades are still not registered in Interpol's\ndatabase,\" Noble wrote according to newspaper VG.\n\nNoble claims that the reticence of Norwegian police can have major\nconsequences, including an inability to hinder similar types of crimes in\nthe future.\n\nPolice Director Ingelin Killengreen rejected the criticism and told VG that\nshe had spoken with Noble two weeks ago.\n\n\"We said that we should have been better at informing them that we could not\nsupply this information. Due to considerations concerning the investigation\nthe Oslo police do not wish to supply the information Interpol has\nrequested,\" Killengreen said.\n\nhttp://www.aftenposten.no/\n\n\n\n------------------------------\n\nMessage: 9\nDate: Thu, 21 Jun 2007 06:39:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Austria. Kunstdiebstaehle in Genf und Gaenserndorf\nTo: \nMessage-ID: <039401c7b3be$29250a80$7b6f1f80$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nKunstdiebst?hle in Genf und G?nserndorf\nBetroffen: Kautschukplastik von Beuys und Stierkampfzeichnung von Picasso \n\nGenf/G?nserndorf - Einem Privatmann sind in der N?he von Genf ein Werk von\nJoseph Beuys sowie eine bedeutende Sammlung afrikanischer Kunst gestohlen\nworden. Wie die Genfer Kantonspolizei am Mittwoch mitteilte, bel?uft sich\nder Wert der Beute auf 2,4 Millionen Franken (knapp 1,5 Millionen Euro).\nDemnach stiegen die T?ter bereits w?hrend der Osterferien in das Haus ein\nund lie?en sich auch von den Alarmsystemen nicht davon abhalten, eine T?r\ndes Haupteingangs aufzuwuchten.\n\nBeim Diebesgut handelt es sich den Angaben zufolge um das Werk von Beuys aus\nKautschuk ohne Titel aus dem Jahre 1977. Au?erdem wurden rund 140\nKunstgegenst?nde aus Afrika entwendet, darunter Masken, rituelle Ger?te und\nStatuen. Sie stammen unter anderem vom Dogon-Volk aus Mali. Die Polizei geht\ndavon aus, dass es sich bei den T?tern um Kunstkenner handelt. \n\nUmfassender Diebeszug\n\nEine Picasso-Zeichnung im Wert von mehr als 250.000 US-Dollar ist am\nDienstag aus einem Einfamilienhaus im Bezirk G?nserndorf gestohlen worden.\nWie das Landeskriminalamt Nieder?sterreich am Mittwoch mitteilte, d?rften\ndie unbekannten T?ter auch eine Lithographie des K?nstlers erbeutet haben.\nOb es sich allerdings tats?chlich um Originale handelt, werde nun gepr?ft. \n\nDie gestohlene Zeichnung \"Corrida\" zeigt eine Stierkampfszene. Die\nKriminellen lie?en neben teuren Anz?gen, Uhren sowie Handys auch eine\nwom?glich echte Lithographie von Picasso, \"Lysistrata\", mitgehen. Diese war\nmit der Unterschrift des K?nstlers versehen. Ein von Picasso signiertes\nTaschenbuch fiel den Kriminellen ebenfalls in die H?nde. Die erbeuteten\nGegenst?nde - die Zeichnung \"Corrida\" ausgenommen - haben laut N?\nSicherheitsdirektion einen Wert von 41.700 Euro.\n\nDie Ermittler m?ssen nun die Herkunft der gestohlenen Gegenst?nde kl?ren.\nWann Gewissheit herrscht, ob es sich bei den gestohlenen Kunstwerken\ntats?chlich um Werke von Pablo Picasso handelt, stand laut Landeskriminalamt\nvorerst noch nicht fest. \n\nDie Diebe waren durch ein Kellerfenster in das Haus der russischen Besitzer\ngelangt. Die R?umlichkeiten seien zum Zeitpunkt der Tat leer gestanden.\nNicht gekl?rt sei vorerst, ob die Kriminellen die Zeichnung \"Corrida\"\ngezielt ausgew?hlt oder lediglich zuf?llig mitgenommen hatten. (APA/AP) \n\nhttp://derstandard.at/\n\n\n\n------------------------------\n\nMessage: 10\nDate: Thu, 21 Jun 2007 06:39:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Thieves take Beuys painting,\tAfrican art in $1.9\n\tmillion Swiss heist\nTo: \nCc: africom-l@list.africom.museum\nMessage-ID: <039301c7b3be$290e7540$7b2b5fc0$@org>\nContent-Type: text/plain;\tcharset=\"UTF-8\"\n\nThieves take Beuys painting, African art in $1.9 million Swiss heist \n\nThe Associated Press \nWednesday, June 20, 2007 \n\nGENEVA: A painting of Joseph Beuys and a collection of African art worth around 2.4 million Swiss francs (US$1.9 million, ?1.42 million) were stolen from a house near Geneva, police said Wednesday.\n\nThe thieves broke into the house and carried away the art on April 12, said Patrick Pulh of the police for the canton of Geneva.\n\nThey stole 140 objects from the private collection, including masks and statues from West Africa, he said.\n\nNo arrests have been made, Pulh said.\n\nThe artworks, which came from countries like Mali, Cameroon, Ghana and Ivory Coast, included several tall masques, including a wooden mask with a crest measuring 1.89 meters (6.2 feet), according to the insurance company which registered the collection.\n\n\"Some of the objects have a value of over 100,000 francs, but most of them are worth around 10,000 francs,\" said Barbara Koenig, spokeswoman for Allianz insurance.\n\nThe haul also includes an untitled 1977 painting made of natural rubber by German avant-garde artist Beuys. The painting has an estimated value of 198,000 francs (US$159,500; ?119,000), Koenig said.\n\nPolice said they assume that the thieves were art experts.\n\nhttp://www.iht.com/\n\n\n\n------------------------------\n\nMessage: 11\nDate: Thu, 21 Jun 2007 06:39:13 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Picasso drawing stolen in Austria\nTo: \nMessage-ID: <039501c7b3be$29525c10$7bf71430$@org>\nContent-Type: text/plain;\tcharset=\"UTF-8\"\n\nPicasso drawing stolen in Austria\nBy h.b.\nJun 20, 2007 - 4:03 PM\n \nThe stolen Picasso drawing - Photo EFE: http://www.typicallyspanish.com/news/publish/article_11066.shtml \n\nThe pencil drawing 'Corrida' dates from 1920 and is valued at 180,000 Euro\n\nA Picasso drawing, valued at 180,000 ? has been stolen from the house of a Russian diplomat, a few kilometres from Vienna in Austria. In addition to the artwork the thieves also took several watches and expensive suits.\n\nThe drawing, called ?Corrida? is a bullfighting scene and shows a bull charging a horse in the bullring. It dates from 1920 and is pencil on paper some 30 by 20 cms in size.\n\nPolice say they are looking for a gang of professional thieves, who knew exactly what they were after. Police also note that there were no security measures in place in the diplomat?s house, apart from a dog who welcomed anyone who called.\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 147\n****************************************\n\n"}