{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"All-Access\" <q24fxogbv@sinistrclinker.com>", "subject": "No Credit Is Necessary to Get this Visa Card ", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNow you can get your All-Access Visa Prepaid Card\nwith all these great features:\n\n\n\n\n\n\n\n\n\nSAFER THAN CARRYING CASH\n\t\n100% APPROVED**\n\t\nNO UPFRONT PAYMENT\n\t\nNO CREDIT CHECK\n\n\n\nClick here to get your card now!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n*NetSpend All-Access Visa Prepaid Cards are issued by MetaBank, member FDIC. NetSpend is an authorized Independent Sales Organization (\"ISO\") of MetaBank. Subject to funds availability. Transaction fees, terms and conditions apply. All trademarks, service marks and registered marks are the properties of their respective owners. Â© 2001-2007 NetSpend Corporation.\n\n\n**100% approval of card requests is based on our ability to verify personal information provided. This does not involve a credit check.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIf you wish to unsubscribe from this mailing list please click here \nor write to Netspend Corporation, 701 Brazos St., Austin, TX 78701.\n\n \nNo Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card No Credit Is Necessary to Get this Visa Card \ntrmediaR120070905\n\n\n\n\n\n\n______________________________________________________\n\nNo More Mail\nor write to:\nCrispyTooth\n\n2309 Bel Air Rd.,Suite 311\nFallston, MD 21047\n"}