{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "525a 6/15 Update: Mixed results in latest computer restart attempts", "body": "\n\n\n\n\n525a 6/15 Update: Mixed results in latest computer restart attempts\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 59\nPosted: 5:21 AM, 6/15/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-55 (06/14/07): Russian engineers troubleshoot computer problem; telemetry restored; false fire alarm sounds\n   SR-56 (06/14/07): Computer system partially revived; troubleshooting continues\n   SR-57 (06/14/07): Shuttle astronauts gear up for more solar array retraction work\n   SR-58 (06/14/07): NASA spaceflight chief, former station astronaut optimistic Russians will resolve computer snafu\n   SR-59 (06/15/07): Mixed results in initial attempts to restart Russian computers\n\n=================================\n\n5:21 AM, 6/15/07, 6/15/07, Update: Mixed results in computer restart attempts\n\nRussian guidance and control computers aboard the international space station were disconnected from U.S. solar array power and ordered to restart early today during a pass above Russian ground stations. Engineers reported mixed initial results, with no \"eureka moment\" as troubleshooting continues.\n\nThe three redundant \"lanes,\" or channels of the station's command and control computer, known collectively as the central computer, along with all three lanes of its guidance and navigation system, known as the terminal computer, were switched to Russian power for the restart attempts.\n\n\"Within the last 19 minutes or so, we have had some space-to-ground conversation between the Russian mission control center (near Moscow) and space station commander Fyodor Yurchikhin, along with flight engineer Oleg Kotov,\" said NASA commentator Pat Ryan in mission control at the Johnson Space Center in Houston.\n\n\"Mission control called Kotov at 3:12 a.m. Houston time to alert him that they were going to retry another computer restart now that they were fully disconnected from the U.S. power supply. Commanding began at 3:24 Central Time this morning with Moscow sending the command to deactivate the power controllers and the response was up and down. There were some initial indications that power was available to both the central computer and the terminal computer, initially to all three lanes of both computers, and then indications that one or more lanes would drop off, the same sort of on-again, off-again responses seen earlier, and it was anticipated as the trouble shooting continues.\"\n\nIt was not initially clear whether the computers were having trouble getting power, were trying and failing to reboot or both. A few minutes later, however, Ryan reported that one lane of the central computer was, in fact, operating.\n\n\"Space station flight director Holly Ridings just receiving a report from the Houston support group at mission control in Moscow summarizing the attempted Russian navigation computer restart this morning,\" Ryan reported. \"The current situation appears to be that all three lanes of both the central computer and terminal computer do have power. However, only lane No. 1 of the central computer is currently working. Lane No. 2 on the terminal computer has started, but then stopped, has gone in and out.\n\n\"Again, this is the situation that was expected as the procedures to restart these computers are worked through, that there would not be a 'eureka' moment when they would all start up at the same time. This effort made this morning, the Russians reported, when they were totally disconnected from U.S. power. The computers have not been commanded off, so they are very likely continuing to try to restart themselves and the situation could change any time.\"\n\nThe computer system has been acting up ever since the Atlantis astronauts attached a new set of solar arrays to the right side of the station's main power truss Monday. The terminal computer lanes initially crashed. Then, during a programmed reboot of both the terminal and central computer lanes, the entire system hung up.\n\nThe navigation system computers are required to fire Russian maneuvering jets to make major changes in the station's orientation. Minor adjustments are made with U.S. control moment gyroscopes, but that cannot make major changes and the system periodically has to be reset using rocket control. The station cannot safely operate without full orientation control to ensure its solar arrays stay face-on to the sun and to prevent sensitive systems from getting too hot or too cold.\n\nThe problem is not serious as long as the shuttle Atlantis remains docked because the orbiter's thrusters can be used, when needed, to make adjustments that are beyond the ability of the gyros or when the gyro system needs to be reset. But the shuttle will undock and return to Earth next week and the Russians have been working around the clock to get the computer glitches resolved before the orbiter departs.\n\nEngineers theorized that the new S4 solar array, or components in the circuitry delivering that power to the Russian segment of the station, triggered some subtle change in the lab's electrical grid. The central and terminal computers, built in Germany by Daimler-Benz in Germany, are known to be sensitive to \"noisy\" power.\n\nLate Thursday, outgoing station flier Sunita Williams, her replacement Clay Anderson and Kotov used a signal analyzer to characterize the power flowing from the U.S. to the Russian segment. After that data was shared with the ground, the system was physically disconnected to make sure no ground path could be causing problems even with power shut down.\n\nThe space station will make repeated passes over Russian ground stations this morning and additional troubleshooting efforts are expected.\n\nThe Atlantis astronauts are scheduled to wake up at 8:38 a.m. While the Russians are pressing ahead with computer troubleshooting, Jim Reilly and Danny Olivas plan to begin a spacewalk at 1:38 p.m. to repair a pulled-up insulation blanket on the shuttle's left-side rocket pod and complete the retraction, if possible, of the P6-2B solar array wing. A fourth spacewalk by Pat Forrester and Steven Swanson is planned Sunday.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}