{"category": "spam", "to_address": "smiles@flax9.uwaterloo.ca", "from_address": "United kingdom International Lottery <bintlottery@rediffmail.com>", "subject": "UK LOTTERY WINNINGS NOTIFICATION..", "body": "\nUK NATIONAL LOTTERY\n                                           \n\n(Customer Services)\n3b Olympic Way, \nSexton Business Park, \nAintree, Liverpool, L30 1RD\nUNITED KINGDOM\n\nBatch: 12/25/0340\nRef: BIL/101OXI/02  \n                                                    \n   \n\nWe happily announce to you the draw (#989) of the BRITISH INTERNATIONAL LOTTERY, online Sweepstakes International program held on 18th January 2007.\nYour e-mail address attached to ticket number:  56475600545188 with  Serial number 5368/02 drew the lucky numbers: (13)-(43)-(06)-(15)-(02)-(40)bonus # (09).Which subsequently won you the lottery in the 2nd category i.e match 5 plus bonus.\nYou have therefore been approved to claim a total sum of£500,000 (Five hundred thousand pounds sterling) in cash credited to file no KTU/9023118308/03.\nThis is from a total cash prize of £2,000,000.00 shared amongst the first four lucky winners in this category i.e Match 5 plus bonus.\nAll participants for the online version were selected randomly from World Wide Web through computer draw system and extracted from over 100,000 unions, associations, and corporate bodies that are listed online. This promotion takes place bianually.\nPlease note that your lucky winning number falls within our European booklet representative office in Europe as indicated in your play coupon.In view of this, your £500,000 (five hundred thousand poundssterling)  would be released to you by any of our Affiliate courier department.Our agent will immediately commence the process to facilitate the release of your funds as soon as you contact him/her.\nFor security reasons, you are advised to keep your winning information confidential till your claim is processed and your money remitted to you in whatever manner you deem fit to claim your prize.This is part of our precautionary measure to avoid double claiming and unwarranted abuse of this program. Please be warned !!!\nTo file for your claim, please contact our fiduciary agent :\nMR JAMES ANDERSON\nE MAIL:bintlottery@rediffmail.com\nGoodluck from me and members of staff of the BRITISH INTERNATIONAL LOTTERY.\nYours faithfully,\nELIZABETH HANKS(Mrs.)\nDirector.International Promotions Unit,\n\n\nJAMES ANDERSON\nCLAIM FIDUCIARY AGENT\nEMAIL:bintlottery@rediffmail.com\n\n\n\n"}