{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Ben Finney <bignose+hates-spam@benfinney.id.au>", "subject": "Re: CC Sampling Plus 1.0", "body": "Terry, please follow\n. In\nparticular, don't send a copy of messages to my email address; I have\nnot asked you to do so.\n\nTerry Hancock  writes:\n\n> Ben Finney wrote:\n> >>  [CC Sampling Plus 1.0 license clause re. derivative works]\n> > \n> > Trivially non-free. The DFSG freedom to create a derived work is\n> > the freedom to create *any* derived work, not some limited subset\n> > as defined in this license.\n>\n> I agree.\n>\n> However, I do have a question about this ...\n>\n> If I myself have sampled from a CC sampling plus work in producing a\n> new work, I am under the impression that I'm pretty free to\n> re-license as I please.\n\nI don't see anything in the license that grants that freedom. The only\npart that allows redistribution is quite explicit that it must be\nunder the terms of this license, and not \"sublicense\":\n\n=====\n3. License Grant & Restrictions. Subject to the terms and conditions\n   of this License, Licensor hereby grants You a worldwide,\n   royalty-free, non-exclusive, perpetual (for the duration of the\n   applicable copyright) license to exercise the rights in the Work as\n   stated below on the conditions as stated below:\n\n   [...]\n   e. Attribution and Notice.\n\n      [...]\n         ii. You may distribute, publicly display, publicly perform or\n         publicly digitally perform the Work only under the terms of\n                                             ^^^^^^^^^^^^^^^^^^^^^^^\n         this License, and You must include a copy of, or the Uniform\n         ^^^^^^^^^^^^\n         Resource Identifier for, this License with every copy or\n         phonorecord of the Work or Derivative Work You distribute,\n         publicly display, publicly perform, or publicly digitally\n         perform. You may not offer or impose any terms on the Work\n         that alter or restrict the terms of this License or the\n         recipients' exercise of the rights granted hereunder. You may\n                                                               ^^^^^^^\n         not sublicense the Work. You must keep intact all notices\n         ^^^^^^^^^^^^^^^^^^^^^^^^\n         that refer to this License and to the disclaimer of\n         warranties. You may not distribute, publicly display,\n         publicly perform, or publicly digitally perform the Work with\n         any technological measures that control access of use of the\n         Work in a manner inconsistent with the terms of this\n         License. The above applies to the Work as incorporated in a\n         Collective Work, but this does not require the Collective\n         Work apart from the Work itself to be made subject to the\n         terms of this License. Upon notice from any Licensor You\n         must, to the extent practicable, remove from the Derivative\n         Work or Collective Work any reference to such Licensor or the\n         Original Author, as requested.\n=====\n\n-- \n \\        \"The World is not dangerous because of those who do harm but |\n  `\\      because of those who look at it without doing anything.\"  -- |\n_o__)                                                  Albert Einstein |\nBen Finney\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}