{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Amanda Stout <kaufman@goldzonepartners.com>", "subject": "Hymen destroyer", "body": "\n\nOnline pharmacy presents top products that will make you healthy! You do not need to go to your local drug store, you can buy here any pill that you need.\nClick to visit us\nYou can spend thousands and buy pills at your local drug store. But you can spend less by ordering the same quality Viagra and Cialis at Online pharmaceuticals.\nOrder now!\nYou don't need to look for a drug store in your area. We deliver high-quality pills worldwide.\nWith best regards,\nAmanda Stout\n \n \nOtcu prishlos razoritsia, chtoby smiagchit Ego, i mne implantirovali pamiat posylnogo Pochtovoj Korporacii Novy-2 s Proshlym bezrodnogo fermera, grobivshego svoiu zhizn na zhalkom klochke zemli do Postupleniia na sluzhbu v PK. Ia ne znal, pochemu ia eto vizhu. Chtoby otvlechsia ot narastaiushchego Vozbuzhdeniia, ona prinialas govorit dalshe: Pokinuv Dom, ia so vremenem Unasledovala traktir svoih roditelej, a Onni, moia sestra, reshila stat Erserkerom i podalas na sluzhbu k samomu Namestniku Haaskana. I skazat uzhe nichego nelzia. \nEgo by na moe mesto, pod dula treh blasterov. No Ia gotov byl otdat Dosu vse, chto u menia bylo, lish by vybratsia otsiuda. Eshche by! Sero-stalnye glaza Kengsha vspyhnuli zhestokoj radostiu, Tolstye guby razdvinulis v torzhestvuiushchej ulybke. Vspomni i Nazovi. Za schitannye sekundy prevratit kabinet v Morozilnik o takoj sposobnosti ia dazhe ne slyshal, hotia i sledovalo by Dogadatsia. Korotko kivnuv mne, slovno staromu priiateliu, on ukazal rukoj na kreslo, Raspolozhennoe sprava ot ego pismennogo stola. No esli Eto dejstvitelno tak, to on ubet ee tut zhe, kak tolko ona stanet dlia nego Bespoleznoj. Negusto. \nEsli by ty Byl tak liubezen i pokazal mne obrazec vashej platy, to mozhet byt. Da, eto bylo chto-to. Telo rastvorilos bessledno, ostalsia Lish obnazhennyj, bespomoshchnyj mozg, terzaemyj demonami Zla v kromeshnom mrake. No sejchas Altares byl slishkom zaniat svoimi mysliami, chtoby obrashchat Vnimanie na stol oskorbitelnoe i neumestnoe povedenie plemiannika v prisutstvii Ego samogo Verhovnogo maga. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}