{"category": "ham", "to_address": "sugar@lists.laptop.org", "from_address": "Simon Schamijer <simon@schampijer.de>", "subject": "Re: [sugar] olpc-games osc protocol", "body": "Simon McVittie wrote:\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA1\n> \n> On Mon, 11 Jun 2007 at 13:06:16 +0200, Simon Schamijer wrote:\n>> memosono is using the osc protocol \n>> (http://opensoundcontrol.org/spec-1_0) to communicate with the game \n>> server and to talk to the csound server. I think it is an easy to use \n>> protocol and maybe some other games or activities want to use it as well.\n> \n> This protocol seems to be rather like D-Bus, but different. We're using\n> D-Bus as the basis for most OLPC things - is there a compelling reason\n> not to here?\n\nProbably not. I am used to the osc protocol and successfully used it in \nanother project. So it was easy for me to use it in memosono as well. I \nwill read through the telepathy specs which probably has features I \nhaven't thought of yet.\n\n> In the Telepathy-based collaboration framework Collabora are developing for\n> the OLPC (including the Presence Service), activities are shared over\n> \"tubes\". These can currently transport a distributed D-Bus over reliable\n> streams, with work in progress to do TCP-like reliable streams between\n> peers too. Transporting UDP-like datagrams over tubes, using ICE or\n> Jingle for NAT traversal, is a future enhancement.\n> \n> The advantage of using Tubes is that we're already thinking about issues\n> which prevent peer-to-peer networks from working in practice, mainly NAT\n> traversal. Tubes provide a consistent API which will remain consistent\n> and transparent as we add additional NAT traversal methods and transport\n> mechanisms; the API is also consistent between the server-based and\n> link-local collaboration, and any future collaboration mechanisms. We will\n> also transport instant messages related to an activity, and the necessary\n> metadata to support the Buddy- and Activity-centric programming model used\n> in Sugar.\n\ncool. I have seen that this is used in the connect activity. I will read \nthrough this code then.\n\n> I've only looked at the OSC spec briefly, but you seem to be assuming\n> synchronized real-time clocks. Is this a requirement we can impose on XOs?\n> If it *is*, we could use it for the link-local communication to provide\n> additional ordering guarantees; but I suspect it isn't something we can\n> assume.\n\nI am not sure I get you right here - do you mean the deviation of \ndistributed audio clocks? osc is only about control messages so this \nshould not impose any problems here.\n\nThanks for the insights,\n\nRegards,\n    Simon\n_______________________________________________\nSugar mailing list\nSugar@lists.laptop.org\nhttp://lists.laptop.org/listinfo/sugar\n\n"}