{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nThursday, 03 May, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nWhelan may sue West Ham & League\nWigan's Dave Whelan may sue the Premier League and West Ham after the saga of the transfers of Javier Mascherano and Carlos Tevez.\n\n\n\n \nShevchenko to have groin surgery\nChelsea striker Andriy Shevchenko is to have surgery on a groin injury at the end of the season.\n\n\n\n \nWenger fined and censured by FA\nArsene Wenger is fined and severely censured by the Football Association for comments he made after the Carling Cup final.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nWachovia Ch'ship leaderboard\nLeading scores from the first round in North Carolina.\n\n\n\n \nIn-form Backstrom sets Milan pace\nSwede Joakim Backstrom fires a stunning 10-under-par 62 in the first round of the Italian Open.\n\n\n\n \nItalian Open leaderboard\nLatest updates from the European Tour event in Milan.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nSecond crash at Spanish GP track\nWilliams' Nico Rosberg is unhurt in the second high-speed crash at the Circuit de Catalunya this week.\n\n\n\n \nFogarty team confirms 2008 return\nCarl Fogarty's team will return to the World Superbikes championship in 2008 using Agusta bikes.\n\n\n\n \nF1 races still boring - Briatore\nRenault team boss Flavio Briatore says changes aimed at livening up Formula One have not worked.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nSecond crash at Spanish GP track\nWilliams' Nico Rosberg is unhurt in the second high-speed crash at the Circuit de Catalunya this week.\n\n\n\n \nF1 races still boring - Briatore\nRenault team boss Flavio Briatore says changes aimed at livening up Formula One have not worked.\n\n\n\n \nButton 'wants to stay at Honda'\nJenson Button has no plans to leave struggling F1 team Honda, according to his manager.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nBack injury frustrates Radcliffe\nPaula Radcliffe is unlikely to defend her World Athletics Championships marathon title because of a back problem.\n\n\n\n \nBack injury for Aikines-Aryeetey\nWorld Junior 100m champion Harry Aikines-Aryeetey returns to London after suffering a back injury during training in the United States.\n\n\n\n \nMason jumps to shock win in Dakar\nGermaine Mason wins the high jump at the IAAF World Athletics Tour event in Senegal.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nGB is top cycling nation - King\nBritish Cycling boss Peter King says this country's riders are the best in the world and will be GB's best hopes of Olympic gold.\n\n\n\n \nUnder-fire Basso parts with team\nIvan Basso quits the Discovery Channel team after an investigation into his role in a Spanish doping scandal is reopened.\n\n\n\n \nDi Luca up for Giro after big win\nDanilo Di Luca is looking forward to challenging for glory in May's Giro d'Italia after victory in the Liege-Bastogne-Liege race.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nComment: Don't blame the fixtures\nRobbo says the lack of a Keane-type player cost Man Utd in Milan\n\n\n\n \nLawrence Dallaglio talks to Chris Evans\nWasps star Lawrence Dallaglio talks to Chris Evans about the Heineken Cup final, his shed and his dog attempting to eat his children's friends! Evans and sidekick Jonny Saunders have a different sporting guest every evening on their Radio 2 show.\n\n\n\n \nFA Cup competition\nVote for your favourite video re-creation\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}