{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "What's on Inside Sport tonight", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nINSIDE SPORT PRESENTER GABBY LOGAN\nHello, Gabby here.\n\n\nThis week - is the relegation battle over or is the Premier League about to be taken to court?  \n\n\nA growing number of clubs are unhappy about the way the Premier League dealt with the controversial transfer of Javier Mascherano and Carlos Tevez. \n\n\nThey believe West Ham should have been docked points and want proof that Tevez was eligible to play.  \n\n\nWe'll be asking a top sports lawyer if results on the pitch could be overturned by verdicts in court.\n\n\nAnd let me introduce you to the world of top England batsman, Kevin Pietersen.  \n\n\nGone are the blonde highlights and late nights.  \n\n\nHe is, as they say, a changed man.  \n\n\nMy interview with him is a fascinating watch. \n\n\nAnd we visit Los Angeles - the city is in a state of fevered expectation as the weeks tick away to the arrival of David Beckham.  \n\n\nLA Galaxy say they've already made a lot of their money back - given Becks got a £125m deal, they need to really - but we found he might have a pretty hard time winning over the baseball and basketball fans.\n\n\nAll that AND the results of our competition to win a pair of tickets to Saturday's FA Cup final.\n\n\nDon't miss it - tonight , BBC ONE, five past eleven.\n\n\nGabby hosts Inside Sport on Monday 14 May, 2305 BST on BBC ONE, and second edition, Sunday 20 May, 1130 BST on BBC TWO. \n\n\n\n\n\n\n\n\nTHIS WEEK ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nINSIDE SPORT\n bbc.co.uk/insidesport\nMonday\n\nGabby Logan hosts the big names and stories (2305, BBC ONE) \n(There's another chance to see the show, Sunday, 1130, BBC TWO)\n\t\t\t\t\t\n\n\n\n\n\n\nFOOTBALL ON THE BBC\n bbc.co.uk/football\nTuesday \nChampionship play-off semi-final commentary, Derby v Southampton (1945, Radio Five Live/online) \n\nWednesday\nChampionship play-off semi-final commentary, West Bromich Albion v Wolverhampton Wanderers (1945, Radio Five Live/online) \nThursday\n\nLeague Two play-off semi-final commentary, Lincoln City v Bristol Rovers (1945, Radio Five Live Sports Extra/online)\nFriday\n\nLeague One play-off semi-final commentary, Nottingham Forest v Yeovil Town (1945, Radio Five Live/online)\n\nLeague Two play-off semi-final commentary, MK Dons v Shrewsbury Town (1945, Radio Five Live Sports Extra/online)\nSaturday\nFA Cup final (1300, BBC ONE; 1500 Radio Five Live/online); FA Cup final highlights (2330, BBC ONE)\nSunday\nFA Cup final highlights(BBCi)\n\t\t\t\t\t\n\n\n\n\n\n\nMORE SPORT ON THE BBC\n bbc.co.uk/tvandradio\nThursday\n\nTest cricket: England v West Indies, 1st Test, Lord's (Test Match Special, 1045-1800, Radio 4 LW; 1045-1900, Radio Five Live Sports Extra/online)\nFriday\nTest cricket: England v West Indies, 1st Test, Lord's (Test Match Special, 1045-1800, Radio 4 LW; 1045-1900, Radio Five Live Sports Extra/online)\nScrum V (BBCi)\nSaturday\nMoto GP France qualifying (1245-1400, BBCi)\nTest cricket: England v West Indies, 1st Test, Lord's (Test Match Special, 1045-1800, Radio 4 LW; 1045-1900, Radio Five Live Sports Extra/online)\nSunday\n\nTest cricket: England v West Indies, 1st Test, Lord's (Test Match Special, 1045-1800, Radio 4 LW; 1045-1900, Radio Five Live Sports Extra/online)\n\nMoto GP France (1230 - 1430, BBC TWO; 1350 ? 1430, BBCi)\nMotorcycling NW 200 (1430, BBC TWO)\nGreat Manchester Run (1600, BBC TWO)\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tWatch Inside Sport\n Download the best bits of the show\n\t\t\t\t\t\n\t\t\t\t\t\tBe a sports book reviewer\n We want your thoughts on the latest publications\n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}