{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Aimee Cody\" <jowcodytrolleynos@codytrolley.com>", "subject": "Pounds down, mood up", "body": "\nStop being obese and unhappy\n\n\n\n\n\n\nAnatrim – The latest and most fascinating product for corpulent people is now readily available – As seen on BBC.\n\n\nDo you hold in your memory all the times when you told yourself you would do any thing to get rid of this fastly growing pounds of fat? Luckily, now no great offering is expected. With Anatrim, the ground-breaking kilos-melting blend, you can achieve naturally health mode of life and become really thinner. Just look at what our customers state!\n\n\n\n\"It’s rather difficult to admit it but I was an awful food addict. \n\n\nI greedily ate all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis fatal passion finished after I started course with Anatrim! \n\n\nHoly God,\n\n\n\n\n my craving for food disappeared, \n\n\nspirits improved and I turned to the happiest person 23 pounds in 2.4 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person!\"\n\n\n\n\n\nMaria H., Las Vegas\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nIt’s difficult to imagine how I detested being ridiculed at school. \n\n\n\n\nI hated the weight and I abhorred even myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nIt literally took me out of this nightmare! A plenty of thanks to you, guys.\"\n\n\n\n\n\nMikkey Fox, Boston\n\n\n\n\n\n\"Know what? My marriage was saved thanks to Anatrim! I fell down into this circle, depression – eating more – more depression. My wife was about to leave me as I was turning in overweight psycho. \n\n\nMy friend pointed at your web site and I ordered up my pack of Anatrim at the time. \n\n\nThe results were splendid, my appetite came to admissible level, I was often in good spirits, and, be sure, I tightened my belt with no regrets. And you know, the sex became fantastic also!\"\n\n\n\n\n\nFrancis\n\n\n\n\n There is a great number of gratitudes left by happy people taking Anatrim. Don’t you wanna add yourself to the thousands and thousands of slender people and take this all-natural appetite-suppressing energy increasing product now!\n\n\nDon’t miss the opportunity!\n\n\n\n\n"}