{"category": "ham", "to_address": "ip-health <ip-health@lists.essential.org>, e-drug@healthnet.org,\n   aidsdrugs@lists.riseup.net, thaifta lists <thaifta@lists.riseup.net>", "from_address": "Kannikar KIJTIWATCHAKUL <kakablue@yahoo.com>", "subject": "[Ip-health] Second-line drugs only hope for many 12,000 resistant to first-line Aids drugs", "body": "Second-line drugs only hope for many 12,000 resistant\nto first-line Aids drugs\n\nAPIRADEE TREERUTKUARKUL, Bangkok Post, 14 May 07\n\nIt's six o'clock in the morning and Supan Pankaew is\nready to go to the provincial hospital, about 20km\nfrom her farmhouse in Si Sa Ket's Wang Hin district.\nOnce a month, the 39-year-old widow has to drive her\nold motorbike to the hospital, where she has to wait\nin a long queue to meet a doctor and receive anti-Aids\ndrugs.\n\n\n''No one except people living with HIV/Aids knows how\nhard it is to get access to medical treatment, whether\nfirst-line or second-line drugs,'' said Pan, as she is\nknown to her family.\n\n\nHer recent viral load test and CD4 count, which are\nused to measure the level of HIV in the blood to\ndetermine the stage of the disease, showed that her\ncondition has worsened and she needs to take\nanti-retroviral medicine.\n\n\nShe contracted HIV/Aids from her husband nine years\nago. She is resistant to first-line drugs such as\nGPO-VIR and the second-line drug Kaletra seems to be\nthe only hope for her.\n\n\nFortunately, last March she was listed as eligible to\nreceive Kaletra free of charge via the healthcare\nscheme for employees of private firms supervised by\nthe Social Security Office.\n\n\nDespite getting diarrhoea as a side-effect from the\nnew medication, she feels it is still better than\nsuffering from limp legs and arms, a side-effect of\nGPO-VIR, which her body began to resist.\n\n\nPan is among a small group of 500 HIV-positive people\nwho can obtain the free Kaletra under the National\nAccess to Anti-retroviral Programme for People Living\nwith HIV/Aids.\n\n\nThe majority of the approximately 12,000 infected\npeople who have developed resistance to first-line\nanti-retroviral treatment do not have such\nopportunities.\n\n\nHIV-positive people dependent on first-line medication\nusually find themselves resistant to the drugs within\na few years.\n\n\n''The state cannot afford the cost of treatment for\nall people living with HIV/Aids who are resistant to\ndrugs as long as the prices of second-line drugs are\nstill too high,'' said Sombat Tanprasertsuk, director\nof the Aids, Tuberculosis and Sexually-Transmitted\nDiseases Bureau.\n\n\nThe market price of imported Kaletra is currently\nabout $2,200 (73,000 baht) per person per year.\n\n\nHowever, the drug producer, Abbott Laboratories, has\noffered to cut the price of Kaletra to $1,000 (32,500\nbaht) per patient per year if the government revokes\nits compulsory licensing to bypass the drug's patent.\n\n\nBut the government said it would not make any decision\nuntil its stockpile of Kaletra runs out, probably in\nAugust.\n\n\nDr Sombat believes compulsory licensing, which\nempowers the government to manufacture or import\ngeneric versions of medicine, will help many more\npeople living with HIV/Aids who have developed\nresistance to drugs prolong their lives.\n\n\nThe government spent about 3.8 billion baht in the\nlast fiscal year on HIV/Aids treatment for half a\nmillion people living with the disease.\n\n\nThe compulsory licences issued on Jan 29 covered three\ndrugs used for treating Aids and heart disease _\nEfavirenz, Kaletra and Plavix.\n\n\nTo seek more options in expanding access to such\ndrugs, Public Health Minister Mongkol na Songkhla went\nto New York last week to sign an agreement with the\nClinton Foundation to buy a generic version of Aluvia,\nan improved version of Kaletra, from the Indian\ngeneric drug maker Matrix Laboratories for $695 per\nperson per year.\n\n\nHowever, the government's efforts to acquire cheap\ngeneric drugs for Aids patients in the country has\nupset pharmaceutical giants and is believed to have\nled to Thailand's downgrading in the US government's\nPriority Watch List of countries with low protection\nof intellectual property rights.\n\n\nA US lobby group, reportedly supported by drug firms\naffected by the compulsory licensing, has also\nlaunched an advertising campaign against the policy\nand the locally-made drug GPO-VIR.\n\n\nMany Thai patients, including Pan, see this as the\ncompany's way of taking revenge for the government's\ndecision to override the patents on the three drugs.\n\n\n''What they are doing is cold-blooded. They know that\nmillions of people will die because they can't afford\nexpensive drugs. But these firms care more about\nprofits than anything else,'' she said.\n\n\n\nKannikar KIJTIWATCHAKUL (Kar)\nMobile 66-85-0708954\nkakablue@yahoo.com\n\n\n\n____________________________________________________________________________________Sick sense of humor? Visit Yahoo! TV's\nComedy with an Edge to see what's on, when.\nhttp://tv.yahoo.com/collections/222\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}