{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBS News Early Show <cbsnews___early_show_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Julie Chen: In Deepest Sympathy", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nApril 24, \n      2007\n \nHi, \n      everybody,\n \nMy heart goes out \n      to the families of the nine U.S. soldiers killed in \n      Baghdad today after a \n      suicide bomber struck. An \n      al Qaeda-linked group claims responsibility for the \n      attack on the patrol base north of Baghdad. Check CBSNews.com \n      for the latest on that story. \n \nAlso, \n      my condolences go out to the wife of journalist-turned-historian \n      David Halberstam. He was a true gentleman \n      and such a great writer. I remember reading his book \"The Powers that Be\" \n      in my freshman year of journalism school. It was one of the many books on \n      our required reading list. It gave me a firm understanding of what a \n      powerful medium television is and how the media truly do help shape both \n      public policy and public opinion. Years later and not too long ago (within \n      the last three years), I got to meet him, and hesitated to tell him the \n      influence his book had on me as a teenager. I now regret not telling him \n      when the opportunity presented itself.\n \nOn a lighter note, \n      we are enjoying another great spring day here in \n      New York \n      City, perfect weather \n      for tonight's sixth annual Tribeca \n      Film Festival. Over the years it has grown from a small event trying \n      to revitalize the Tribeca neighborhood following the tragic events of \n      Sept. 11, to a highly-regarded annual celebration of wonderful works in \n      the film industry. Then again, with the talents of Robert De Niro supporting such a cause, how could \n      it miss?\n \nIt was \n      also the perfect weather to spend time on the Plaza with our friend Kris \n      Connell from Real Simple magazine, who showed us some practical double uses for ordinary household items. \n      My favorite of the day is using a flat iron, normally sold for use on your \n      hair, to press those hard-to-reach spots between buttons on a collared \n      shirt.\n \nWe \n      also continued our \"Wedding in a Week\" series, and today, we \n      saw bridal party fashions. It'll be tough for our bride Lisa to pick \n      her wedding gown for the big day. She looked beautiful in all of \n      them. We wish the happy couple the best in their life together as one. \n      Tomorrow, Lisa and her fiancé Stephen will look at wedding flowers. \n      \n \nTomorrow on the show, are you a \"fan\"jaya? American Idol finalist \n      Sanjaya Malakar will be here to talk about \n      what really went on behind the scenes, and we'll see who People magazine's \n      most beautiful people are.\n \nTake \n      care,\n\nJulie \n      ChenEarlyShow@cbs.com \n\n\n\n\nAdvertisement\n\n\n\nTo \nunsubscribe or change your subscription options, click here.Contact: \nEmail Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All \nRights Reserved. \n"}