{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nIt’s the first official day of summer and the\n  Environmental Protection Agency has its eyes on the skies. Is the air\n  you’re breathing clean enough? Research has shown that high ozone\n  levels can have lethal consequences, so the EPA is proposing tightening smog\n  standards. Wyatt Andrews will have the story tonight.\n \nSome of those most affected by high ozone levels are\n  the country's children — especially those who live close to major\n  highways. John Blackstone will take us inside a children's hospital in San Francisco to look at the impact of living in one of America's\n  smoggiest cities.\n \nTurning our attention to Iraq,\n  the U.S.\n  military announced the deaths of 14 soldiers and Marines over the past two\n  days. Five soldiers were killed in one roadside bomb attack in northeastern Baghdad. David Martin\n  will have the latest on what the Pentagon says about how the surge is\n  progressing.\n \nThere’s a new experimental treatment for\n  Parkinson’s that shows promise for some patients. Michelle Miller will\n  have the details.\n \nLike Michael Moore’s other controversial\n  films, “Sicko” drew a huge crowd at its premiere and is getting\n  lots of attention from the entertainment media, the health care industry and\n  even from Capitol Hill. Will the film’s box-office draw also have some\n  affect on the 2008 ballot box? Jeff Greenfield will take a look.\n \nTo wrap up our broadcast, Cynthia Bowers will take a\n  look at the receding shorelines of the largest freshwater lake in the world\n  – Lake Superior. Over the past decade\n  the lake’s water level has dropped 2 ½ feet – that’s 16\n  trillion gallons of water. Where has it gone? We’ll tell you tonight.\n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}