{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Spie Sutherland <spie@proficio.ca>", "subject": "Re: linux, windows and vmware", "body": "It's not very difficult to get vmware working, I just did\nan install a short while ago. Install the free vmware\nserver then install a client and the management tool.\nThey are all installed by script. This is a bit of a bear\nto get working on slackware though, for this distro\nyou need to set up a fake system v init dir tree or the\nsetup won't run (totally lame install script!), install\npam because vmware wants it and slack doesn't have\nit, and I had to change one of the config files related\nto pam, but oh well it's slack, I still love my slack lol\n\nOne thing I wanted to mention though, I used to run\nthe old vmware workstation 5 on windows and install\nlinux on vmware, it worked excellent, performance\nwas good, even with only 512mb ram in the system.\n\nHowever, this time I used the new free vmware\nserver and client setup installed on linux and put\nwindows on the vmware, it was horribly slow, it\nwas not usable for my needs. I really don't know\nif it's because windows is on vmware (instead of\nlinux on vmware) or if the new free product just\ndoesn't perform as well as workstation 5 did.\n\nI just upgraded to 1GB ram so I'll try vmware\nagain and see if it performs better. The audio\nsupport is horrible on vmware server/client, in\nfact its not really supported, and there is only\nONE audio driver, hopefully it works for you, on\nmy system it works, sort of, sometimes I get\npauses in audio. If I'm not mistaken I think the\nvmware server sends audio over a local network\nto client, and it's not doing that very well.\n\nIf you're going to play with vmware and linux,\nset aside lots of time for it, and expect that you\nwill do some head scratching. It's not difficult\nbut some things are strange, like it has SCSI\ndrivers that emulate IDE and there are many\ndifferent ways to configure vmware.\n\nThe excellent way is setting it up so that you\ncan either boot directly into each operating\nsystem or run inside a vm. There is a way to\ninstall it this way, by giving the VM access to\nthe entire disk. There are documents on the\nvmware site on how to do this. This way you\nhave the convenience of booting the guest OS\nin a window, or if you need better performance\nor true hardware, boot directly into the guest\nOS without the VM. I've done it before and\nit worked very well.\n\nI may actually buy a newer version of vmware\nworkstation because I like it much better. It\nis one peice of software than I believe is\nworth the money.\n\n  -- Spie\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}