{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "Tonight on CNN <mailings@mail.cnn.com>", "subject": "McCain's In, But Can He Win?", "body": "\n\n\n\nTonight On CNN Email\n\n\n\n\n\n\n\nApril 25, 2007\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n9 p.m. ET\n\n\n \n\nLarry King Live:   McCain's In, But Can He Win?\n\n\nU.S. Sen. John McCain's first interview since officially entering the presidential race. Plus, Donald Trump reacts to Rosie O'Donnell's decision to exit \"The View.\" Tune in tonight at 9 p.m. ET.\n\n\n\n\n\n\n\n\n\nRelated:• Can McCain campaign get traction?• McCain off to poor start\n\n\n\n\n\n\n\n \n \n\n\n\n\n\n \n\n\n\n\n6:00 a.m. ET\n\n\n \n\nAmerican Morning\n\n\nJohn McCain, back in the race for 2008. His stance on Iran and the war... John Roberts asks him the tough questions you want answered.\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n6:00 p.m. ET\n\n\n \n\nLou Dobbs Tonight\n\n\nU.S. engineer Chi Mak: On trail for allegedly spying for the Chinese government. We'll have a live report from Santa Ana.\n\n\n\n\n\n\n\n7:00 p.m. ET\n\n\n \n\nThe Situation Room\n\n\n>From chaos to carnage: do Iraqis have the political will to make peace?  Join Wolf in the Situation Room.\n\n\n\n\n\n\n\n8:00 p.m. ET\n\n\n \n\nPaula Zahn NOW\n\n\nThe controversial Rosie O'Donnell is leaving \"The View\".  Why now? Inside her exit plans.\n\n\n\n\n\n\n\n\n\n9:00 p.m. ET\n\n\n \n\nLarry King Live\n\n\nU.S. Sen. John McCain's first interview since officially entering the presidential race.  Plus, Donald Trump reacts to Rosie O'Donnell's decision to leave \"The View.\"\n\n\n\n\n\n\n\n10:00 p.m. ET\n\n\n \n\nAnderson Cooper 360\n\n\nA rapper's bodyguard killed. Police say as many as 25 people saw it happen. Why isn't anyone talking?\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n\nSend us your feedback >  |  CNN's full program schedule >  |  E–mail sign up >\n\n\n\n\n \n \n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network LP, LLLP.\nA Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us. \n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the Tonight on CNN list, click here. \n\n\n\n\n\n\n\n"}