{"category": "ham", "to_address": "Doxastic <connect.chris@gmail.com>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] Log-likelihood function", "body": "I think you need to learn about deviances, which R does print.\n\nLog-likelihoods are only defined up to additive constants.  In this case \nthe conventional constant differs if you view this as a Poisson or as a \nproduct-multinomial log-linear model, and R gives you the log-likelihood \nfor a Poisson log-linear model (assuming you specified family=poisson). \nHowever, deviances and differences in log-likelihoods do not depend on \nwhich.\n\nMore details and worked examples can be found in MASS (the book, see the \nFAQ), including other ways to fit log-linear models in R.\n\n\nOn Tue, 1 May 2007, someone ashamed of his real name wrote:\n\n> I've computed a loglinear model on a categorical dataset.  I would like to\n> test whether an interaction can be dropped by comparing the log-likelihoods\n> from two models(the model with the interaction vs. the model without).\n> Since R does not immediately print the log-likelihood when I use the \"glm\"\n> function, I used SAS initially.  After searching for an extracting function,\n> I found one in R.  But, the log-likelihood given by SAS is different from\n> the one given by R.  I'm not sure if the \"logLik\" function in R is giving me\n> something I don't want.  Or if I'm misinterpreting the SAS output.  Can\n> anyone help?\n>\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}