{"category": "ham", "to_address": "sugar@laptop.org", "from_address": "Dafydd Harries <dafydd.harries@collabora.co.uk>", "subject": "Re: [sugar] Obtaining Buddy objects as contacts are encountered", "body": "Ar 10/05/2007 am 16:32, ysgrifennodd Simon McVittie:\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA1\n> \n> At the moment the Presence Service API assumes we're subscribed to the\n> presence of every contact we'll ever encounter, which obviously can't scale to\n> a school.\n\nTo elaborate on this a bit:\n\nWhen thinking about scalability of the networking code, we've been using 1,500\nas the biggest number of children we might see in a deployment.\n\nIf you are subscribed to everybody on the server, and there are 1,500 children\nsigned in, then you will receive 1,500  stanzas when you sign in to\nthe server. A Jabber scalability analysis[0] assumed 200 bytes per presence\nstanza, which gives us a figure of 292KiB for initial presence download.\n\nFurthermore, this entails getting a message whenever anybody in the school:\n\n - signs on\n - signs off\n - shares an activity\n - joins an activity\n - leaves an activity\n - changes their current activity\n\nSince each child has a TCP connection to the server, these messages are not\nbroadcast/multicast, but rather each message is sent over 1,500 connections.\n\nAlso, if there are 1,500 contacts, it makes the mesh view's job of deciding\nwhich children to show more difficult.\n\nWe don't think this will work, which is why we're planning to move to a\nsolution where laptops query the server for specific subsets of the\npresence/activity information. We haven't designed in detail yet, but we think\nthat:\n\n - you'll always be subscribed to your friends\n - you'll always be subscribed to people in your groups\n - you'll subscribe oppportunistically to people in activities you're in\n - you'll unsubscribe from people who aren't friends/in your groups if you\n   haven't interacted with them for a while\n - the server will respond to questions like \"is there anybody doing a\n   painting activity?\", \"give me a list of some people to put in my mesh view\"\n - the server-side extensions will be implemented via a Python XMPP\n   \"component\" that talks to ejabberd using XML\n\n[0] http://www.xmpp.org/internet-drafts/draft-saintandre-xmpp-presence-analysis-00.html\n\n-- \nDafydd\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}