{"category": "ham", "to_address": "<ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Science & Technology Newsletter April 23, 2007", "body": "\nhowstuffworks® | science & technology April 23, 2007\nRSS\n   How Zombies Work\n  They're relentless and oblivious to pain. They continue to attack even after losing limbs. Anyone they kill returns as a zombie. Learn about \nzombies and whether we should fear this undead menace. \nAlso at HowStuffWorks\n\n\nHow Cloning Works - Animal cloning has been the subject of scientific\nexperiments for years, but garnered little attention until the birth of the\nfirst cloned mammal in 1997, a sheep named Dolly. Since Dolly, several scientists have cloned other animals,\nincluding cows and mice. Discover the fascinating, controversial world of\ncloning.\n \n\nHow Carbon-14 Dating Works - You probably have seen or read news stories about recently unearthed\nancient artifacts. A child mummy is found high in the Andes,\nand the archaeologist says the child lived more than 2,000 years ago. How do\nscientists know how old the remains are? Find out how scientists use carbon-14\ndating to determine the ages of people, objects and artifacts.\n \nHow Bluetooth Works - Have you seen someone walking by you lately, seemingly\ntalking to himself, only to notice a small, flashing electronic device around\nhis ear? Learn how that earpiece uses Bluetooth to communicate with a cell\nphone. \n   \nThis Week's Video \nGas Prices Explained - Do you ever wonder why prices at the pump can fluctuate\ndramatically in the space of a week? In this video from HowStuffWorks and\nPetroCanada, learn what goes into determining the price at the pump.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click here.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved\n"}