{"category": "ham", "to_address": "avcooper@speedy.uwaterloo.ca", "from_address": "Cheapflights Travel Deals <cheapflights@list.cheapflights.com>", "subject": "Cheap Flights to Cancun; Hotels at Bargain Rates; Great European Destinations", "body": "\n\nCheap Flights to Cancun; Hotels at Bargain Rates; Great European Destinations\n\n\n\n\n\n\n\nYou are receiving this custom newsletter because you signed up to receive the\n                    Travel Deals Alert newsletter from Cheapflights.com.\n\n\n\n\nApril 17, 2007   \n\n\n\n\n\n\n\n\n\n\n\nESCAPE TO CANCUN, MEXICO, THIS SPRING with rock-bottom airfares from SPIRIT AIRLINES\nFIND HOTEL BARGAINS GALORE \u0097 New York, San Diego, Las Vegas and More \u0097 with HOTELS.COM\nTHE BEST OF EUROPE \u0097 Italy, England, Spain and more \u0097 with EUROPEAN DESTINATIONS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBook Now and Save on These and Other Red Hot Deals*\n\n\n\n\n\n\n\n \nDallas Clarion Park Central Hotel\nfrom $77/nt\n\n\n\n\n\n\n\n\n\n \nNew York Belnord Hotel\nfrom $119/nt\n\n\n\n\n\n\n\n\n\n\n\n \nCancun Hyatt Regency\nfrom $159/nt\n\n\n\n\n\n\n\n\n\n \nDaytona Beach Plaza \n                                                                                            Ocean Club\nfrom $119/nt\n\n\n\n\n\n\n\n\n\n\n\n \nSahara Las Vegas Hotel and Casino: \n                                                                                            Air + 2 nights\nfrom $262 pp\n\n\n\n\n\n\n\n\n\n \nSan Diego California Suites Hotel\nfrom $55/nt\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n*Rooms and prices subject to availability at the time of booking. Prices do not include taxes and fees and are subject to change without notice.\n\n\n\n\n\n\n\n\n\n\n\nExperience the Best of Europe - Your Way\n\n\n\n\n\n\n\n\n\n\n\nBook air-inclusive, multi-city itineraries to Europe from $110/nt*\n\n\n\n\nMake the most of your European vacation. Combine train travel, cars, hotels, transfers and tours to create your perfect vacation. \n\n\n\n\n\nBest of Greece from $875 pp\n \nBest of Ireland from $685 pp\n\n\nBest of Italy from $855 pp\n \nBest of France from $759 pp\n\n\nBest of Spain from $729 pp\n \nBest of Portugal from $869 pp\n\n\nBest of Switzerland from $719 pp\n \nBest of England from $719 pp\n\n\n\nBook your dream trip now!\nFREEDOM for travelers! For first-time adventurers and Europe experts alike, traveling with European Destinations is the only way to plan your vacation. Combine up to 12 cities; choose from hundreds of hotels; travel through Europe by train, car or even plane. Select an expertly crafted itinerary or build your vacation to suit your own travel tastes.\n\n                                                        With European Destinations, it's all about what YOU want.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n*European Destinations Terms & Conditions: Prices are per person, based on double occupancy, and are dynamic in nature. Prices do not include air taxes, insurance, or delivery charges. Airfare based on economy class, midweek departure. Prices will change according to your options and dates. Air taxes range from $88 to $275+. Air taxes and surcharges vary by airports used and destination. Some airlines add fuel surcharges as a tax and do not add them to the fare. All prices were accurate at the time of publishing, but are subject to change. All itineraries were priced for arrival date in Europe on 24 May, 2007. EuropeanDestinations recommends spring and fall travel for better prices. \n\n\n\n\n\n\n\n\n\n\n\n\n\nFlights | Privacy Policy | Contact Us | Unsubscribe from the Cheapflights.com newsletter\n\n\n\n"}