{"category": "ham", "to_address": "ted.harding@manchester.ac.uk, r-help@stat.math.ethz.ch", "from_address": "\"Greg Snow\" <Greg.Snow@intermountainmail.org>", "subject": "Re: [R] to draw a smooth arc", "body": "There is the grid.xspline function in the grid package that allows for\nthings like this (the control points, though more general than what you\nstate).  I don't know if it uses the postscript curveto, or approximates\nusing line segments.\n\nYou can also use the xfig device, then use xfig, winfig, or jfig to\nexplicitly convert any polylines to xslpines, adjust any parameters of\nthe spline that you want, then export to other formats.\n\nHope this helps,\n\n-- \nGregory (Greg) L. Snow Ph.D.\nStatistical Data Center\nIntermountain Healthcare\ngreg.snow@intermountainmail.org\n(801) 408-8111\n \n \n\n> -----Original Message-----\n> From: r-help-bounces@stat.math.ethz.ch \n> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of \n> ted.harding@nessie.mcc.ac.uk\n> Sent: Tuesday, May 01, 2007 7:51 AM\n> To: r-help@stat.math.ethz.ch\n> Subject: Re: [R] to draw a smooth arc\n> \n> This thread prompts me to ask about something I've been \n> pondering for a while, as to whether there's an \n> implementation somewhere ticked away in the R resources.\n> \n> So far, people have been responding to the original query in \n> terms of increasing the numbers of points, and joining these by lines.\n> \n> However, if you're using PostScript output, you can draw \n> really smooth curves by exploiting PS's \"curveto\" operator.\n> This draws a cubic-curve segment in the following way:\n> \n> The two points you want to join with a curve will be denoted \n> by (X0,Y0) and (X3,Y3) in the following (for reasons which \n> will appear). The PS command is of the form\n> \n>   x1 y1  x2 y2  X3 Y3  curevto\n> \n> At (X0,Y0) the tangent to the curve (as it departs from \n> (X0,Y0) is in the direction of the directed line from (X0,Y0) \n> to (x1,y1), and at (X3,Y3) (as it arrives) the tangent to the \n> curve is in the direction of the directed line from (x2,y3) \n> to (X3,Y3).\n> \n> The location of (X0,Y0) is not part of the command, since it \n> is implicit in the PS \"currentpoint\" which is the starting \n> point of the curve.\n> \n> The result is (in theory, and in practice to within the \n> resolution of the output device) a perfectly smooth curve, \n> provided the consecutive cubic segments have the same tangent \n> at each of the points being joined. This can be achieved by \n> appropriate choice of the \"intermediate\" points -- (x1,y2), \n> (x2,y2) above.\n> \n> So far, when I've done this myself (including when using the \n> output from R to give the points being joined), I've done the \n> computation of the \"intermediate\" points \"by hand\". This \n> basically involves deciding, at each of the points being \n> joined, what the tangent to the smooth curve shouold be.\n> \n> Of course, there is an element of arbitrariness in this, \n> unless there is an analytic representation of the curve on \n> which the points lie (e.g. you're plotting sin(x)/x every \n> pi/8, and want to join them smoothly), when all you need is \n> the derivatives at the points.\n> \n> Crudely, you might evaluate the direction at a point in terms \n> os a weighted average of the directions to its two immediate \n> neighbours (the nearer meghbour ges the greater weight); less \n> crudely, you might fit a quadratic through the point and its\n> 2 neighbours and use the gradient at the middle point; and so on.\n> \n> Once you've decided on the tangent at each point, it's then \n> straightforward to compute suitable \"intermediate points\"\n> to serve as (x1,y2) and (x2,y2).\n> \n> (One application where this sort of approach is needed is in \n> joining computed points on iso-contours, where the individual \n> points have been determined by interpolation of \n> spot-measurements at nearby measuring stations).\n> \n> Anyway. The Question: is there a general function for the \n> above kind of smooth curve-drawing?\n> \n> With thanks,\n> Ted.\n> \n> --------------------------------------------------------------------\n> E-Mail: (Ted Harding) \n> Fax-to-email: +44 (0)870 094 0861\n> Date: 01-May-07                                       Time: 14:50:38\n> ------------------------------ XFMail ------------------------------\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide \n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}