{"category": "ham", "to_address": "avcooper@speedy.uwaterloo.ca", "from_address": "Cheapflights Travel Deals <cheapflights@list.cheapflights.com>", "subject": "American, jetBlue; $78 U.S. Airfares, More", "body": "\n\nAmerican, jetBlue; $78 U.S. Airfares, More\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApril 26, 2007\n\n\n\n\n\n\n\n\n\n\nFrom: \nTo: \n\n  \n\n\n\n\n\n\n\n\n\n\n\n \n\nIN THIS ISSUE: U.S., CARIBBEAN & EUROPE DEALS\n\n\n\n\n\nCheap Flights From Your Local AirportBest airfares from your hometownAustin, TX Baton Rouge, LA Chicago, IL Cincinnati, OH Cleveland, OH Columbus, OH Corpus Christi, TX Dallas/Ft. Worth, TX Detroit, MI El Paso, TX Fort Wayne, IN Houston, TX Indianapolis, IN Kansas City, MO Lexington, KY Lincoln, NE Louisville, KY Madison, WI Memphis, TN Milwaukee, WI Minneapolis, MN Nashville, TN New Orleans, LA Oklahoma City, OK Omaha, NE St. Louis, MO San Antonio, TX Toledo, OH Tulsa, OK Wichita, KS Click here \nfor more city airfare deals.\n\n\n\n\n\n\n\nfrom $93 RTOrbitz\n\nFlights Under $200, Including Taxes! U.S. Flights for Under $200 Roundtrip Major airlines, nationwide flights and super airfare savings\n\n\n\n\n\n\n\n\nClick-and-Compare FaresFrom Cheapflights\n\nLas Vegas Airfare Deals Back by Popular Demand! Compare low airfares to Vegas from your local airport.\n\n\n\n\n\n\n\nCheapCaribbean From $469/person\nBahamas All-Inclusive Vacation\n  Multi-night air/hotel package at Paradise Island Harbour Resort; includes beverages, meals, kids club, taxes, gratuities and trip insurance.\n\n\n\n\n\n\n\n\nfrom $83 RTOrbitz\n\nAirTran: Deep Discount Deals \nAirTran Spring Airfare Sale \nDozens of top U.S. cities; travel thru Nov 7.\n\n\n\n\n\n\n\n\nClick-and-Compare FaresFrom Cheapflights\n\nAirfare Deals to New York City! New York City Spring Airfare Savings Compare low airfares to the Big Apple from your local airport.\n\n\n\n\n\n\n\n\nfrom $558 RTBritish Airways\n\nLondon Airfare Sale \u0097 Final Day!\nLondon for Less: Summer Airfare Sale Travel May 28\u0096Sept 5; includes fuel surcharge. Purchase by April 26.\n\n\n\n\n\n\n\n\nfrom $78 RTAmerican Airlines\n\nAmerican: Unadvertised Sale Fares\nAmerican Airlines' Spring Airfares\nNationwide savings on top routes; continental U.S. and Hawaii\n\n\n\n\n\n\n\n\nfrom $13.95 /dayHotwire\n\nCar Rental Deals: Drive-Away Savings Hotwire's U.S. Rental Car Bargains With these low rates, you can sightsee and drive all over your favorite cities (and beyond) without a big hit on your wallet.\n\n\n\n\n\n\n\n\nSurprise Mom on Her Day\nMother's Day Getaway Gift Ideas Jump-start your gift planning with our smorgasbord of suggestions for your \nMom or spouse. We've got hotel/resort packages all over the country for solo adventures, girlfriends' getaways, mother-daughter trips and romantic escapes.\n\n\n\n\n\n\n\n\n\nfrom $98 RTMajor U.S. Airlines\n\nCheap Flights From Minneapolis Minneapolis to Your Favorite U.S. Destinations Cheapflights' Click-and-Compare fares to your favorite destinations from Minneapolis\n\n\n\n\n\n\n\n\n$204\u0096$250 RTExpedia\n\nMexico Airfare Specials Spring Fare Discounts to Mexico City and Guadalajara Nationwide departures on AeroMexico\n\n\n\n\n\n\n\n\nfrom $103 RTPriceline\n\nDelta: Unadvertised Sale FaresDelta Air Lines U.S. Airfare Bargains Choose from hundreds of cities; includes taxes, fees.\n\n\n\n\n\n\n\n\nfrom $465 /personBeach Destinations\n\nDominican Republic \u0097 Air & Hotel Deal4-Night Dominican Republic All-Inclusive Resort Package Enjoy 4-star luxury at the Grand Paradise Bavaro in Punta Cana. Includes round-trip airfare; accommodations; all meals, drinks and entertainment.\n\n\n\n\n\n\n\n\nfrom $219 /person\nPriceline\n\nVegas Getaways \u0097 Save Up to $325!Las Vegas Air/Hotel Packages Your choice of multi-star hotel/casinos, including Ballys, MGM Grand, Planet Hollywood, more.\n\n\n\n\n\n\n\n\nfrom $99 RTKayak\n\nSave on U.S. National Parks VisitsCheap Flights to Nearby Airports Enjoy a National Park this summer. Start your planning now with a low airfare.\n\n\n\n\n\n\n\n\nfrom $88 RTCheapoair.com\n\nAirfare Deals Across the U.S.U.S. Airfare Discounts Nationwide departures and destinations, including Hawaii, Las Vegas, NYC, Orlando and more.\n\n\n\n\n\n\n\n\n\n\n\n\n\nMore Europe Deals\n\n\n\n\n\nfrom $795 /personEuropeanDestinations\n\nEurope Package Deal of the Week Big Savings on 6-Night Paris and Budapest Getaway Enjoy two of Europe's most intriguing cities at exceptionally low package prices. Includes international roundtrip airfare; 3 nights hotel in each city; airfare between Paris and Budapest; hotel and airfare taxes.\n\n\n\n\n\n\n\n\nfrom $429 RT1800FlyEurope\n\nEurope This Fall: Book Ahead to Save Big $$$Europe Fall Airfare Bargains Lock in savings for fall travel to your favorite cities; includes fuel surcharge. \n\n\n\n\n\n\n\n\n\n\n\n\n Tell a friend   Change \nyour profile  |  Unsubscribe\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nTRAVEL NEWS\n\n\n\nIn the Headlines\u0085 From Cheapflights.com's daily travel news and other sources: \u0095 go!Express beefs up Hawaii inter-island flights \u0095 New coach seat design aims to end middle-seat problems \u0095 'Getaway Map' feature lets travelers quickly compare airfares \u0095 Sleep-deprived airline cabin and flight crews refuse to fly \u0095 Minneapolis/St. Paul International Airport offers real-time parking information \u0095 Chicago O'Hare Airport adds five Barbara's Bookstores \u0095 Food pricing for same items varies among terminals within airports \u0095 Carnival drops three-week-old carry-on beverage ban The Lighter Side of Travel\u0095 Iowa Town Markets Itself As Capt. Kirk's Birthplace to Lure Tourists \u0095 Expert Debunks Hotel Myths and Urban Legends \u0095 Vegas' Mirage Hotel Launches European-Style Sunbathing Pool Trip Planning & Destinations \u0095 Florida Tourism: 100 Things to Do Before You Die \u0095 Wendy Perrin's Tips for Maximum Comfort When Flying Coach \u0095 The Entourage Guide to Los Angeles \u0095 Going 'On Safari' With the Kids at Disney World \u0095 In Vegas, Machine Still Beats Man When It Comes to the Slots \u0095 Hotel Cancellations: Read the Fine Print to Avoid Penalties \u0095 Loyalty Programs Reward Frequent Cruisers \u0095 America's Most Family-Friendly Beaches \u0095 Ship, Don't Schlep, Your Bags to Streamline Travel \u0095 Pre-Derby Events and Historic Distilleries Add to Kentucky Derby's Appeal \u0095 Cost-Cutting Strategies for Europe's Top Cities\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nGETAWAY CALENDAR\n\n\n\nAsheville (NC), thru May 20: Festival of Flowers at the Biltmore Estate Atlanta (GA), May 1\u009631: The Atlanta Jazz Festival, said to be the nation's largest free jazz festival Las Vegas (NV), thru May 3: Las Vegas Helldorado Days 2007 New York City, May 6: Five-Boro Bike Tour, the largest recreational cycling event in the U.S. Portland (OR), May 5\u00966: Indie Wine Festival San Diego (CA), May 11\u009613: Gator by the Bay Crawfish, Zydeco & Blues Festival Washington (D.C.), May 10\u009612: Heart's Delight Spring Wine Festival Coming Soon: Chadds Ford (PA), May 26\u009628: Brandywine River Museum Antiques Show Charleston (SC), May 17\u009620: Charleston Maritime Festival and Tall Ships Chicago (IL), May 27: Bike the Drive, one of America's largest bike-riding events Denver (CO), May 25\u009628: Downtown Denver Arts Festival New Orleans (LA), May 23\u009627: New Orleans Food and Wine ExperienceOrlando (FL), May 25\u009627: Orlando Carnival, a Caribbean-inspired Mardi Gras-like event Seattle (WA), May 24\u0096June 17: Seattle Film Festival San Francisco (CA), May 26\u009627: Carnaval San Francisco showcases the best of Latin American and Caribbean cultures and traditions.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   Want the \nlatest airline and related news? Visit Cheapflights.com Flights News\n\n\nFind the best airfare deals on Cheapflights.com\n\n\n\n\n\n  From: \nTo: \n\n\n\n\n\n\n\n\n\nFlights | \nPrivacy Policy | \nContact us\n\n\n\n\nWould you like to \nUnsubscribe? \n\n\n\nTerms and Conditions:\n\nCheapflights.com does not sell tickets, but publishes deals and displays \ninformation only. Prices do not include taxes and other fees unless \nstated.   We list deals that are correct when \npublished, but cannot guarantee accuracy or completeness. \n\nThe information provided in this e-mail may include inaccuracies and \ntypographical errors. Terms and Conditions apply to the above deals and \nthese deals may expire or be subject to change. Cheapflights.com (USA) \nInc., its subsidiaries & affiliates are not liable for any claims of \ndamages, loss or injury to persons or property arising out of this \nnewsletter. For more details on a specific deal, check with the agent or \n\ncompany selling the tickets.\n\nFor written correspondence please contact Cheapflights (USA) Inc. at 24 School \nStreet, Boston 02108.\n\n\n\n\n\n"}