{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nCarbon Trading Heats up Capitol Hill (EnergyBiz Insider - Apr. 6,2007)\n\n\n\nEnergyBiz Insider - Apr. 6,2007 - Carbon emission constraints are creating quite a stir in Washington. Convinced that the country must act, lawmakers on Capitol Hill are seeking direction from members of the European Union on how to establish an emissions trading scheme. \n\n\nApr 6, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Apr. 5, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 5, 2007\n\n\nApr 6, 2007 PowerMarketers Industry Publications\n\n\n\nTHIS WEEK AT EIA (Volume 9, Issue 14) (March 30 - April 5, 2007 \n\n\n\nEIA - Apr. 6, 2007 - THIS WEEK AT EIA is a list summarizing and providing URLs for every Energy Information Administration (EIA) product released during this week.\n\n\nApr 6, 2007 PowerMarketers Industry Publications\n\n\n\nLetters From Readers (EnergyBiz Insider - Apr 5, 2007)\n\n\n\nEnergyBiz Insider - Apr 5, 2007 - Below are a few letters we received on topics that appeared in the past few weeks. They capture the essence of how many readers say they feel. \n\n\nApr 6, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nGreat Plains Energy and Aquila File Acquisition Approval Applications in Missouri and Kansas\n\n\n\nKANSAS CITY, Mo.-(Business Wire)-April 4, 2007 - Great Plains Energy Incorporated (NYSE: GXP), its public utility subsidiary Kansas City Power &amp; Light Company (KCP&amp;L) and Aquila, Inc. (NYSE: ILA) today filed applications with the Missouri Public Service Commission and the Kansas Corporation Commission seeking approval of the proposed acquisition by Great Plains Energy of Aquila.\n\n\nApr 5, 2007 DiGiTAL50\n\n\n\nWestar Energy to Provide Energy Management Services to\n\n\n\nTOPEKA, Kan., April 5 /PRNewswire-FirstCall/ -- Westar Energy, Inc. WR announced today that it has entered into an agreement with the Arkansas/Missouri Energy Pool to provide energy management services. The ArkMo Pool is a group of five cities located in northeast Arkansas and southeast Missouri. Westar will provide energy scheduling and power marketing services.\n\n\nApr 5, 2007 PR Newswire via MSN Money\n\n\n\nCompensation for Duke Energy's Rogers nearly $27.5M in 2006\n\n\n\nCHARLOTTE, N.C. - Duke Energy Corp. President and Chief Executive James E. Rogers received compensation the company valued at nearly $27.5 million in 2006, according to a regulatory filing made Wednesday. Rogers, the 59-year-old former chief executive of Cinergy Corp., took over as Duke's top executive after the company acquired the Cincinnati-based utility last April.\n\n\nApr 5, 2007 Statesvile Record & Landmark\n\n\n\nGreen Groups Win Supreme Court Ruling in Clean Air Act Case\n\n\n\nGreen Groups Win Supreme Court Ruling in Clean Air Act Case By RITA CICERO, Andrews Publications Staff Writer In a win for environmentalists, a unanimous U.S. Supreme Court has found that Duke Energy Corp. violated the Clean Air Act when it modified its aging coal-fired power plants without installing new emission controls.The high court said the U.S. Court of Appeals for the 4th Circuit ...\n\n\nApr 5, 2007 Findlaw Corporate Counsel\n\n\n\nFour firms settle natural gas suit: Ratepayers will get $159.5 million total in refunds if accord is approved.\n\n\n\nApr. 5--In a case left over from the California energy crisis, four companies have agreed to pay ratepayers a combined $67.4 million over allegations of manipulating natural gas prices.  The settlement stems from a class-action lawsuit over allegations that the four companies boosted gas prices by reporting false data to trade publications and engaging in \"wash trades.\" In wash trades, the same ...\n\n\nApr 5, 2007 Knight Ridder Tribune Business News\n\n\n\nCoalition's goal: No power lines\n\n\n\nApr. 6--There's a little grass roots movement brewing in the Gainesville District. Its members are vocal and becoming organized.  The group, the Prince William Energy Coalition, hopes to defeat the proposed power lines Dominion Virginia Power wants to build across 40 to 50 miles of Fauquier, Prince William and Loudoun counties. Members of the group believe that if they can get Virginians to save ...\n\n\nApr 6, 2007 Knight Ridder Tribune Business News\n\n\n\nStrong-arm Tactics: TXU's response an unfortunate step backward\n\n\n\nIt's one of the most despicable things we've heard in some time. Facing a $210 million penalty for allegedly manipulating the power market in Texas, TXU said it would be compelled to shut power plants. TXU may insist that this is simply a statement of financial reality. But, forgive us, this smacks of blackmail. We can read between the lines: Unless you want sky-high energy prices, back off the ...\n\n\nApr 6, 2007 Dallas Morning News\n\n\n\nCompensation for Duke Energy's Rogers more than $27.3M\n\n\n\nDuke Energy Corp. President and Chief Executive James E. Rogers received compensation the company valued at nearly $27.5 million in 2006, according to a regulatory filing made Wednesday.  Rogers, the 59-year-old former chief executive of Cinergy Corp., took over as Duke's top executive after the company acquired the Cincinnati-based utility last April. He added the chairman's duties in January.\n\n\nApr 5, 2007 WCNC\n\n\n\nAlgonquin Gas Transmission Sees Strong Market Interest from\n\n\n\nBOSTON, April 5 /PRNewswire-FirstCall/ -- Algonquin Gas Transmission received more than 1.3 billion cubic feet per day (Bcf/d) of interest from shippers during its binding open season for the proposed 'East-to-West Expansion' Project. (Logo: http://www.newscom.com/cgi-bin/prnh/20061030/CLM051LOGO ) The open season, which closed March 20, was held in response to significant interest from customers ...\n\n\nApr 5, 2007 PR Newswire via MSN Money\n\n\n\nEnergy CEOs rewarded well: Duke paid more than $12.9 million for 2006 effort; Progress, $9.9 million\n\n\n\nApr. 5--Duke Energy president and chief executive James E. Rogers received a pay package worth $12.9 million for nine months' work in 2006, the Charlotte-based utility disclosed Wednesday.  Though reported as last year's compensation, most of that pay will be deferred for two years under Rogers' employment contract. Rogers did not receive a salary or bonus from Duke last year because his contract ...\n\n\nApr 5, 2007 Knight Ridder Tribune Business News\n\n\n\nNulear Plant License Transfer Gets OK\n\n\n\nCMS Energy Corporation (CMS) Stock Quote, Chart, News Exelon Corporation (EXC) Stock Quote, Chart, News WASHINGTON (AP) - The Nuclear Regulatory Commission said Friday it approved the transfer of a license to run a nuclear power plant in Michigan to New Orleans-based Entergy Corp. Entergy agreed last summer to buy the 798-megawatt Palisades Nuclear Plant from Jackson, Mich.-based CMS Energy Corp. ...\n\n\nApr 6, 2007 AP via MSN Money\n\n\n\n\n\nBuyers: TXU Should Settle Dispute\n\n\n\nthey strongly disagreed with the utility's threat to shut down some of its power plants if it can't settle accusations of price manipulation. Kohlberg Kravis Roberts & Co. and Texas Pacific Group said they have no intention of closing plants if they succeed in buying TXU, the largest power generator in Texas. A letter this week from a TXU executive to state regulators mentioning potential power ...\n\n\nApr 6, 2007 San Francisco Chronicle\n\n\n\n\n\nTXU Issues Apology On Plant Closing Issue\n\n\n\nDALLAS, April 6 /PRNewswire-FirstCall/-- Today, TXU Corp. (NYSE: TXU) issued the following statements from TXU Corp. CEO John Wilder and Michael McCall, CEO of TXU Wholesale. McCall: 'TXU apologizes for creating any perception of threatening to shut down power plants in Texas. TXU is not permitted to unilaterally shut down power plants. Such a step can only be done after a review by ERCOT.\n\n\nApr 6, 2007 PR Newswire\n\n\n\nPower Efficiency Corporation's Technology Qualifies for Energy Efficiency Incentives from Nevada Power Company and Sierra Pacific Power Company\n\n\n\nLAS VEGAS--(BUSINESS WIRE)--Power Efficiency Corporation (OTCBB: PEFF), a developer and manufacturer of advanced energy savings technologies for electric motors, today announced that Nevada Power and Sierra Pacific Power have qualified Power Efficiency Corporations technology for a prescriptive rebate on escalators throughout the state of Nevada with no further testing of the technology ...\n\n\nApr 5, 2007 Business Wire\n\n\n\nSC Johnson Shares Environmental Leadership Legacy with Consumers\n\n\n\nSC Johnson Chairman and CEO H. Fisk Johnson makes a second appearance in SC Johnson's new family advertising campaign focused on the environment that the company launched last fall. The campaign further communicates to consumers SC Johnson's long-standing commitment to the environment and to the health of the families who use the company's products. Trusted brands like Shout(R), Windex(R) and ...\n\n\nApr 6, 2007 PR Newswire\n\n\n\n\n\nFour firms settle natural gas suit\n\n\n\nIn a case left over from the California energy crisis, four companies have agreed to pay ratepayers a combined $67.4 million over allegations of manipulating natural gas prices. The settlement stems from a class-action lawsuit over allegations that the four companies boosted gas prices by reporting false data to trade publications and engaging in 'wash trades.' In wash trades, the same volume of ...\n\n\nApr 5, 2007 Sacramento Bee\n\n\n\nHot commodity: PG&amp;amp;E solar cash\n\n\n\nThe rush is on to get rebates on solar installations, with Pacific Gas & Electric Co. receiving applications for nearly half the cash available under a 10-year state program within its first four months. Passed in January, the California Solar Initiative provides $2.8 billion in rebates with the goal of creating a self-supporting solar industry in California by 2017.\n\n\nApr 6, 2007 San Francisco Business Times\n\n\n\nProspective Buyers of TXU Say Utility Should Try to Settle With Regulators\n\n\n\nDavid Koenig DALLAS (AP) - The private investors trying to buy TXU Corp. said Friday they strongly disagreed with the utility's threat to shut down some of its power plants if it can't settle accusations of price manipulation. Kohlberg Kravis Roberts &amp; Co. and Texas Pacific Group said they have no intention of closing plants if they succeed in buying TXU, the largest power generator in Texas. ...\n\n\nApr 6, 2007 Canadian Business Magazine\n\n\n\nFire in transformer yard closes nuclear power plant in New York\n\n\n\nCaused by electrical fault and fire in a transformer yard the automatic shutdown closed the Indian Point 3 nuclear power plant. The fire, which was quickly extinguished, was outside the nuclear area of the plant and there was no release of radiation, said Diane Screnci of the Nuclear Regulatory Commission. 'The plant is stable and reacted normally,' she said.\n\n\nApr 6, 2007 Pravda\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nAustralia looks to develop geothermal\n\n\n\nThe Australian government is working on a long-term development plan for the geothermal industry. At last week's first geothermal industry round table in Canberra, government representatives estimated geothermal power could supply 10 percent of the country's energy demand, The Age reported. 'The success of the sector will depend on the readiness of industry, research and government to work ...\n\n\nApr 5, 2007 Washington Times\n\n\n\nBlueberries may be key to cheaper solar power\n\n\n\n- Bangor Daily News By Peter J. BrownBangor Daily News Professor Aldo Di Carlo in the Department of Electronic Engineering at the University of Rome Tor Vergata in Italy is a big fan of blueberries. He likes them, but not only to eat. When Di Carlo sees a blueberry, what he really sees is a potential energy source. He is leading a research team that is exploring the use of several dyes, including ...\n\n\nApr 5, 2007 Bangor Daily News\n\n\n\nFaced with a lack of energy options, Thailand looks to coal\n\n\n\nFaced with a lack of energy options, Thailand looks to coal The world's dirtiest fuel may be the country's best hope to ensure future energy security. By Daniel Ten Kate | Correspondent of The Christian Science Monitorand To do that, planners say, Thailand must nearly double its electricity production to about 55,000 megawatts each year. But as Thailand is learning and Malaysia has already ...\n\n\nApr 5, 2007 Christian Science Monitor\n\n\n\nIndia, Pakistan talk on IPI pipeline\n\n\n\ndiscussed the proposed gas pipeline from Iran that has been stalled over pricing issues. Indian Prime Minister Manmohan Singh and his Pakistani counterpart, Shaukat Aziz, said they were serious about pursuing talks on the pipeline issue until its successful completion. 'We agreed that both Pakistan and India will pursue the Iran-Pakistan-India gas pipeline, because this is in the interest of all ...\n\n\nApr 5, 2007 Washington Times\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}