{"category": "ham", "to_address": "\"SJ Klein\" <sj@laptop.org>", "from_address": "\"Aneto Okonkwo\" <oaneto@gmail.com>", "subject": "[sugar] OLPC Typewriter", "body": "CC sugar@laptop.orgSJ and OLPC,We have begun design and development of a 'Typewriter' activity to teach typing and language learning through phonics and vocabulary (English for the first version).  We would appreciate your feedback on any aspects of the effort so far - primarily on consistency with OLPC guidelines and constraints.  Yeong Haur and I at the Stanford School of Education have also recruited three Stanford Computer Science students to help with the project and they will begin experimental development on one of the modules this week.  Some hard numbers on max storage constraints for images, animation and sound files for the activity would also be helpful \ne.g. 10MB?OLPC Typewriter Wiki - http://code.google.com/p/typewriter/Draft Proposal - \nhttp://typewriter.googlecode.com/files/project%20proposal%20aneto_yh.docDraft Functional Specs - http://typewriter.googlecode.com/files/Typewriter%20functional%20specs%2015april2007.doc\nDraft HTML Interaction Flow - http://www.stanford.edu/~oaneto/mock/ (final app is being developed in Python)Thanks~ Aneto\nOn 2/4/07, SJ Klein <sj@laptop.org> wrote:\nAneto,It is good to hear from you.  Thank you for the introduction and kindwishes.  Yeong Haur, it is a pleasure to meet you.  I am glad the abilityto add custom texts/ curricula to the tutor is one of your basic goals;\nthe easier this is, the more interesting the result will be to manychildren.Your draft scope looks good.  I would recommend adding it and yourreferences to the OLPC wiki:  \nhttp://wiki.laptop.org/go/Typing_tutorA pygame port remains a priority -- mceesay, how is this coming?I am certain that your help would be appreciated there when you havethe time.Best wishes,\n     SJ--<sj@laptop.org>                                    w +1 617 452-5664On Sun, 4 Feb 2007, Aneto Okonkwo wrote:> SJ,>> Hope all is well.  Congratulations on all the progress that the OLPC team is\n> making. I apologize that I have been unable to contribute to the pygame and> childsplay porting project so far due to other commitments but I hope to set> aside time in the near future.>> On another note, I would like to introduce you to Yeong Haur Kok, who has\n> recently joined the effort to develop the typing tutor.  I am extremely> excited and grateful to be working with Yeong Haur, he brings extensive> experience in education and teaching from Singapore and is a member of my\n> Education masters program at Stanford. We have recently completed> preliminary research and defined the goals and scope of the project.  In the> coming weeks we will be drafting the complete project proposal which should\n> include the design ideas and preliminary mock-ups.  Your feedback on the> scope below is welcome as well as any comments/questions/suggestions.>> *Learning problems*>>  - Higher order computer use \ne.g. creative writing or programming,  is>  slow / limited until sufficient typing skill is developed>  - Sufficient familiarity in learning to type takes significant time>  investment and practice\n>  - Existing typing curriculum are boring, repetitive and time consuming>  for students>> The project idea is to develop a typing and writing learning application for> the target users of the \"Children's Machine\" ($100 laptop). The One Laptop\n> Per Child (OLPC) Typewriter application delivers an interactive keyboard> typing and writing curriculum.  To increase the speed, efficiency, and> effectiveness of typed documents, messages and communication on the laptop,\n> it emphasizes simultaneous motor-tactual and creative writing skill> development, utilizing a customizable, collaborative and adaptive rhythm> video game to maximize fun and engagement.  The Typewriter application can\n> also be delivered to all Internet users with the capability to use custom> curriculum.  Our initial language curricula will be focused on English and> Mandarin Chinese.>> *> *\n>> *References*>> Bernstein, R., *A Nontraditional Approach to ESL Instruction: Typewriting. *> 1982.  National Association for Foreign Student Affairs.>> Book, W, F., *The Psychology of Skill, with Special Reference to Its\n> Acquisition in Typewriting *. 1908.  University of Montana.> http://books.google.com/books?vid=OCLC03969917&id=XakCAAAAMAAJ&pg=PA9&lpg=PA9&dq=typewriting#PPP6,M1\n>>> Cooper, W., *Cognitive Aspects of Skilled Typewriting.*  1983.> Springer-Verlag>> Darragh., J., Witten, I, H., *The Reactive Keyboard.*  1992.  Cambridge> University\n>> Press.> http://books.google.com/books?vid=ISBN0521403758&id=obxCY0wcaTgC&pg=PP1&lpg=PP1&ots=xNgk0YOGUu&dq=The+Reactive+Keyboard&sig=Q5hOxtKEzQHQVqQ74DNrhXMxxY8\n>>> Donovan, T, R., McClelland, B, W., *Eight Approaches to Teaching> Composition.*  1980.  National Council of Teachers of English.> \nhttp://eric.ed.gov/ERICWebPortal/Home.portal?_nfpb=true&_pageLabel=RecordDetails&ERICExtSearch_SearchValue_0=ED191042&ERICExtSearch_SearchType_0=eric_accno&objectId=0900000b800fab07>>\n> Flynn, N., Stainthorp.  *The Learning and Teaching of Reading and Writing.*> 2006.  Wiley Publishers.> http://www.wiley.com/WileyCDA/WileyTitle/productCd-0470029102.html\n>>> Hall, J, K., *Evaluating and Improving Written Expression: A Practical Guide> for Teachers. *  1981.  Allyn & Bacon.>>> Reagan, S, D., *Increasing Touch-Keyboarding Skills in the Middle School\n> Student: \"KeyWords\" vs. \"Type To Learn,\" Hand Covers vs. No Hand Covers.*> 2000.>> \nhttp://eric.ed.gov/ERICWebPortal/contentdelivery/servlet/ERICServlet?accno=ED443386>>> On 1/2/07, SJ Klein <sj@laptop.org > wrote:>>>>\n>> Dear Aneto,>>>> You should coordinate with Mamading; pygame & childsplay is a doubly>> useful starter project because it will help others learn python so they>> can start understanding their environment and contributing on their own.\n>> Mamading, meet Aneto; see below for a brief introduction to his>> background.>>>> A typing tutor would be a good second project; we could start specifying>> what that will look like now if you have design ideas.  A framework that\n>> lets one choose what source text to use would be most useful.  Teachers>> could feed it the stories or workbooks students were working on.>>>> Discussions about specific interfaces should take place on the sugar list\n>> -- you should both subscribe yourselves to sugar@laptop.org and>> devel@laptop.org.>>>> As for Flash : we will have support for basic Flash 7 material via Gnash;\n>> how much support remains to be seen.  Python software is still preferable,>>>> at least until we have a good toolchain for children to edit flash.>>>> SJ>>\n>> NB: We would need SDL support to support pygame / childsplay -- also>> to support TuxPaint and the default gnash interface.  One issue to work>> out is how much disk space the extra libraries will add to the core OLPC\n>> system, something we are trying to keep extremely small.>>>> -->> SJ Klein  <sj@laptop.org>                          w +1 617 529 4266\n>>>>>> On Tue, 2 Jan 2007, Aneto Okonkwo wrote:>>>> > SJ,>> >>> > Happy new year and hope all is well.  Sorry for the delay in my>> response.  I\n>> > have recently been reading up on Sugar, the Sugar tutorial and>> Childsplay>> > and I am also quite interested in the typing tutor idea and have some>> > preliminary ideas on designs for that project.  Also, I recently read in\n>> the>> > OLPC Weekly that Mamading Ceesay is also looking at porting Childsplay>> to>> > Sugar.  Do you want me to continue looking at this, try and coordinate>> with\n>> > him/her or do you have another starter project in mind?>> >>> > Also, I read that there is now potential for FLASH support on the>> laptop.  I>> > am very comfortable developing FLASH apps as well and would be\n>> interested in>> > developing the typing tutor or whatever other app you suggest for my>> > research project in FLASH or Python.  Thanks>> >>> > ~ Aneto>> >\n>> > On 11/13/06, SJ Klein <sj@laptop.org> wrote:>> >>>> >>>> >> Aneto -->> >>>> >> It sounds as though you have an excellent background for coordinating a\n>>>> >> useful and multilingual effort.  It might make sense to find something>> >> worth emulating, and either port it or rewrite it from scratch for the>> >> laptops.  Something simple like a good typing tutor, or a language-\n>> >> flashcard tutor.>> >>>> >>>> >> As a first project:>> >>>> >> Take a look at childsplay, and see if you can make a sugar activity\n>> >> out of it:>> >>       http://childsplay.sourceforge.net/>> >>      http://wiki.laptop.org/go/Sugar\n>> >>      http://wiki.laptop.org/go/Sugar_Activity_Tutorial>> >>>> >> Doublecheck how much space the activity takes, including any components\n>> >> it pulls in that aren't in the latest build.  Hang out in #sugar on>> >> irc.freenode.net to help with development.>> >>>> >> To cap off the project, start a [[Childsplay]] page on the olpc wiki\n>> about>> >> the activity, and make sure the childplay devs know what you've done.>> >>>> >> SJ>> >>>> >> -->> >> SJ Klein  <\nsj@laptop.org>                          w +1 617 452-5664>> >>                                                     c +1 617 529-4266>> >>>> >> On Sun, 12 Nov 2006, Aneto Okonkwo wrote:\n>> >>>> >> > SJ,>> >> >>> >> > Thanks for your message.  I am more open to designing and building>> >> software>> >> > from scratch, or taking an existing program and improving its design.\n>> >> >>> >> > For my masters project, the focus is on researching and using>> >> educational>> >> > and learning theories and also going through a thorough research and\n>> >> design>> >> > process including user testing, etc and documenting this process.>> >> >>> >> > My goal and reason for wanting to implement something for OLPC is\n>> that I>> >> am>> >> > really passionate about the work that you are doing and instead of>> doing>> >> a>> >> > purely academic masters project I want to help create something that\n>> can>> >> > actually be used.>> >> >>> >> > My experience includes a current role at Google as a Product Manager,>> (I>> >> may\n>> >> > even be able to promote this project internally as 20% time) as well>> as>> >> past>> >> > experiences at a startup - Presto, Microsoft, Goldman Sachs, etc  I\n>> have>> >> > experience mainly in web design, and scripting technologies such as>> >> Perl,>> >> > Python, Javascript, as well as a C, C++ background.  I also have\n>> >> experience>> >> > in languages, English, Igbo (Nigeria), French, Mandarin, Arabic.>> >> >>> >> > Other members of my masters programs have software backgrounds and\n>> some>> >> have>> >> > teaching backgrounds in early learning, e-learning, and kids media,>> etc>> >> >>> >> > My plan is to find a specific OLPC project and then start to garner\n>> >> interest>> >> > among other students and potentially at Google as well.  The masters>> >> project>> >> > has a rolling start from now until January and lasts until\n>> August.  This>> >> > time frame should give us a significant amount of time to have a>> >> thorough>> >> > implementation through design, testing and development.\n>> >> >>> >> > The useful first project of taking a small existing game or program>> and>> >> > altering it for the conditions of the OLPC sounds great, do you have\n>> any>> >> > suggestions or ideas for existing games or programs?  Thanks>> >> >>> >> > ~ Aneto>> >> >>> >> > On 11/7/06, SJ Klein <\nsj@laptop.org> wrote:>> >> >>>> >> >>>> >> >> Hello Aneto; thank you for your interest.>> >> >>\n>> >> >> Are you hoping to design and build software from scratch, to take an>> >> >> existing program and improve its design, or to design new software>> >> >> that others build with your help?  What kind of teaching and\n>> software>> >> >> background does your team have?>> >> >>>> >> >> A useful first project might be to take a small existing game or>> >> >> program, and alter it so that it can be used within the OLPC\n>> >> environment.>> >> >>>> >> >> Regards,>> >> >>    SJ>> >> >>>> >> >> -->> >> >> SJ Klein                     \nsj@laptop.org               +1 617>> >> 529.4266>> >> >>>> >> >>>> >> >> On Tue, 7 Nov 2006, Aneto Okonkwo wrote:\n>> >> >>>> >> >> > Great thanks, I am looking forward to hearing from Chris and>> >> SJ.  Thanks>> >> >>>> >> >> >\n>> >> >> > ~ Aneto>> >> >> >>> >> >> > On 11/7/06, Jim Gettys <jg@laptop.org > wrote:>> >> >> >>\n>> >> >> >> Greetings.>> >> >> >>>> >> >> >> >From the one sentence description of what you are about, I'm>> >> >> forwarding\n>> >> >> >> your mail to Chris Blizzard, who is leading the efforts around>> user>> >> >> >> interface educational software, and SJ Klein, who is worrying\n>> about>> >> >> >> content.>> >> >> >>>> >> >> >> Best Regards,>> >> >> >>          - Jim>> >> >> >>\n>> >> >> >>>> >> >> >> On Mon, 2006-11-06 at 22:01 -0800, Aneto Okonkwo wrote:>> >> >> >> > Jim Gettys,>> >> >> >> >\n>> >> >> >> > My name is Aneto Okonkwo and I am a Masters student at Stanford>> >> >> >> > University in Learning Design and Technology.  Myself and my>> >> >> >> > classmates are interested in creating learning software and\n>> >> >> >> > content for the olpc as part of 6 month masters project.  I>> have>> >> >> >> > been reading the olpc wiki and wanted to connect with you\n>> >> >> >> > directly for direction on where me and my team can add the most>> >> >> >> > value on a particular peice of>> >> >> >> > software.  I look forward to hearing from you.  Thanks\n>> >> >> >> >>> >> >> >> > ~ Aneto>> >> >> >> >>> >> >> >> > -->> >> >> >> > Aneto Okonkwo\n>> >> >> >> > BS Management Science & Engineering>> >> >> >> > MA Education: Learning, Design & Technology>> >> >> >> > Stanford University\n>> >> >> >> > oaneto@stanford.edu>> >> >> >> > 650.906.3961 (M)>>>>>> --> Aneto Okonkwo\n> BS Management Science & Engineering> MA Education: Learning, Design & Technology> Stanford University> oaneto@stanford.edu> 650.906.3961\n (M)>-- Aneto OkonkwoBS Management Science & EngineeringMA Education: Learning, Design & TechnologyStanford University\noaneto@stanford.edu650.906.3961 (M)\n"}