{"category": "spam", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Steamy BUKKAKE <SteamyBukakke@litedeams.com>", "subject": "SEXUALLY-EXPLICIT: Steamy Bukkake on HOT Models ktwarwic!", "body": "\n\nUnderstanding Bukkake - A closer look at Bukkake fetish ktwarwic\n\n\n\n\n\n\n\n\n\nWarning:This email contains  Graphic Sexual Explicit Material.\nIf you do not wish to view Sexual Explicit Material \nPlease follow this link to exit. \nOnly 21+ years of age can  Move Down To See Ad. If you cannot see images on this page, please \nrefresh here. \n\n \n\nLive Bukkake Demonstration on Hot Models 4/5 OFF Today ktwarwic\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nPictures Speak Thousands Words 05/16/2007 22:12:09\n \nHistory of Bukkake:\nFetish \"forced bukkake\" movies are popular in Japan. The typical plot features a young woman acting as a naive, uniformed student or a demure pantyhosed office lady somehow finding herself in the predicament of being tied up and drenched with semen against her will. Bukkake was popularized in Japanese adult media. It is to be assumed that a significant factor in the development of bukkake was the mandatory censorship of porn (porn mosaic) in Japan. Since the directors could not show penetration they had to invent new, visually-appealing ways to approach sex acts that would satisfy the audience without violating Japanese law. One urban myth purports that the practice originated in feudal Japan as a method of punishing women who had committed adultery. However, this is not true as the source is the imagination of the writer of a certain adult website who concocted the story to entice readers to subscribe. \n\nTypes of Bukkake: \nForced Bukkake: This is where a willing participant acts or seems unwilling to get a facial shower from several men.\nSnowball or Trade Bukkake: This style of bukkake has two or more targets, which when receive facials swap the semen from mouth to mouth or lick it off of each others faces. \nSemen Play Bukkake: Here is where many men ejaculate on the woman's face, after which she plays with the semen. Also the men may ejaculate on the woman's food and she proceeds to eat the food with the ejaculate. \nBukkake Summit: Where a woman receives a bukkake shower but tilts her head back and opens her mouth, trying to catch it all. At the end of all the facials the semen is collected and drunk by the target of the bukkake shower. Il Ung-Ko Bukkake: In this style of Bukkake, a man lies face up on the floor (sometimes strapped down) and women ejaculate on either his face or whole body. Usually more than one woman masturbates at a time. \n\n\n\n\n\n\n \n\n\n\n\n"}