{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"Guardian Technologies\"<john.matthews@convertsolutionz.com>", "subject": "GDTI: One Breakthrough Technology; Two Huge Markets", "body": "\n\n\nGDTI: One Breakthrough Technology; Two Huge Markets\n\n\n\n\n\nGDTI: One Breakthrough Technology; Two Huge Markets\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFor additional information, please visit\nGuardian Technologies' Online Investor Center \n\nGreetings,\n\nWhen an emerging public company develops a single technology that both identifies previously undetectable early-stage cancers as well as explosives at airport security checkpoints, investors see the upside of two multibillion markets. While these two settings seem totally unrelated, they have something very important in common: both rely on images produced from x-ray scanners or other imaging hardware platforms. While imaging technology is more advanced than ever, and radiologists and airport screeners are trained to identify objects of interest, some objects are simply too small or too difficult to identify with just the human eye.\n\nEnter Guardian Technology International (OTCBB: GDTI), developer of an industry-first technology that is significantly improving the way healthcare and homeland security professionals detect disease states in the human body and deadly threats in baggage to save lives.\n\nAt market close on Friday, we announced a key patent filing for our premier Signature Mapping product. The exciting science behind Signature Mapping is truly remarkable because it can be seamlessly installed into commonly used imaging hardware platforms. But before I get into that I think its important for you to understand the products real world applications.\n\n\n\nQuickly and easily identifies tumors, cancers and other diseases that were previously not visible by radiologists\nDetecting diseases earlier means that patients receive treatments preemptively, a proven factor for saving lives and effectively fighting diseases\nEliminating human error means reducing unnecessary and sometimes painful and emotionally distressing medical procedures\nProven to identify even difficult to distinguish cancers, such as in dense breast tissue and intracranial hemorrhagic associated with brain trauma\n\n \n\n\nAirport security agents can quickly and easily tell the difference between everyday liquid products like hair gel and liquid explosives, drugs and other contraband\nEliminating false alarms means that long lines at airport security baggage scanners and checkpoints are immediately shortened\nIdentifying actual threats in real-time means that security personnel can react more quickly and potentially save hundreds of lives\n\nAs an investor you can understand the powerful advantages of being the first company in the world to offer this uniquely disruptive technology. You are probably wondering exactly how this technology actually works. Signature Mapping analyzes images and identifies subtle energy differences in various tissues, liquids or solids and provides the viewer with additional image information not discernible with the human eye.  It provides a bolded call-out on the viewing screen that clearly identifies the material in question, whether C4 explosive or a minute cancer cell. You can learn more about the science behind our technology by visiting our website at www.guardiantechintl.com.\n\nRarely will you find a company that has technology with this type of market interchangeabilityas appropriate and vital to Homeland Security as it is to the Healthcare sector. This diversification of markets should give investors confidence that a myriad of revenue streams are both available and waiting for our technology.\n\nI thank you for your support and interest in Guardian Technologies. We have set up a state-of-the-art Investor Center to help you get better acquainted with our company. We look forward to welcoming you as a shareholder.\n\n\nBest regards,\n\n\n\nBill Donovan\nPresident & Chief Operating Officer\n\nGuardian Technologies International, Inc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCautionary Statement\nAny statements in this summary about GDTIs expectations, beliefs, plans, objectives, assumptions or future events or performance are not historical facts and are forward-looking statements for purposes of the Private Securities Litigation Reform Act of 1995 (the Act).  These statements are often, but not always, made through the use of words or phrases such as believe, will, expect, anticipate, estimate, intend, plan, forecast, could, and would.  GDTI bases these forward-looking statements on current expectations about future events. They involve known and unknown risks, uncertainties and assumptions that may cause actual results, levels of activity, performance or achievements to differ materially from those expressed or implied by any forward-looking statement. Some of the risks, uncertainties and assumptions that could cause actual results to differ materially from estimates or projections in the forward-looking statement include, but are not limited to, the risk that we might not achieve our anticipated development milestones, the market for our products will not grow as expected, and the risk that our products will not achieve expectations.  For additional information about risks and uncertainties GDTI faces, see documents GDTI files with the SEC.  GDTI claims the protection of the safe harbor for forward-looking statements under the Act and each assume no obligation and expressly disclaim any duty to update any forward-looking statement to reflect events or circumstances after the date of this news release or to reflect the occurrence of subsequent events.\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}