{"category": "ham", "to_address": "walter@laptop.org, OLPC Devel <devel@laptop.org>, sugar@laptop.org", "from_address": "Michael Rueger <michael@sophieproject.org>", "subject": "Re: [sugar] OLPC software: our first release and beyond.", "body": "Walter Bender wrote:\n\n> It is important now to set expectations for the software that ships on\n> the XOs in September. The tremendous amount of work to date does not\n> change the fact that our first-release software is very much a work in\n> progress. The software at ship time will not have all the richness of\n> the Mesh view as described in our User Interface Guide, but we are on\n> track to have an extensible framework in place. The Journal, another\n> important component of Sugar, recently appeared in our builds and\n> currently offers bare-bones functionality; however, the first\n> iteration of the data store is near completion and includes support\n> for removable media and network file systems. The Journal is on track\n> to include more features, such as a rich system to tag, search, and\n> sort in the coming months, and an API for developers. The ability to\n> open files, read, write, etc., are being transitioned to mediation by\n> both the Journal and, at a lower level, Bitfrost, our security system.\n> These transitions will be completed before we ship.\n\nHow long a time frame is planned to give application developers time to \nport/adjust/extend their applications to work with the APIs, security \nsystem etc?\n\nIs there time allocated for regression testing?\n\nWe (the Squeakers) already have a hard time keeping up with changing \nAPIs, launch sequences etc. And to make life even more interesting \nthings like the need to extract the DBus Activity Protocol from the \nsource code.\n\nIs there a plan for central/country specific server locations where \ncontent can be hosted? Or do activity providers like etoys or Sophie \nalso need to provide content hosting?\n\nSo many questions :-)\n\nMichael\n_______________________________________________\nSugar mailing list\nSugar@lists.laptop.org\nhttp://lists.laptop.org/listinfo/sugar\n\n"}