{"category": "spam", "to_address": "<elaastic@speedy.uwaterloo.ca>", "from_address": "\"Gertrude K. Russell\" <igzqe@jscpa.com>", "subject": "approachable patrol", "body": "\n\n\n\n\n\n\n\nIt is aimed at low-cost printers. 1999-08-04  En \nVogue is a (non-WYSIWYG) editor running on the Atari ST. CSS2 will come \nlater.\n2000-08-02 Lunatech Research has released beta \nversion 7 of the Morphon XML editor, which includes a CSS editor.\nCSS Browsers (skip to next section) The easiest way \nto start experimenting with style sheets is to download one of the browsers that \nsupport CSS.\n(Mac, free trial) 2006-07-13 Westciv released Style \nMaster 4. (Windows, free) 2004-11-04 eLeDo published Eledicss 0.\n2006-07-13 Web Directions 2006 (WD06) is a 2-day \nconference followed by 2 days of workshops, on standards-based Web development \n(HTML, CSS, AJAX, accessibility, mobile Web, etc.\n76, a CSS editor that can also convert existing \npages to CSS, help avoid browser bugs, and more. CSS level 1 (1996, 1999) contains \nproperties for fonts, margins, colors, etc. It supports SAC and CSSOM, can apply \nselectors to XML elements and has the beginnings of a renderer. The application can \ndownload a website to your hard drive completely or partially, which you can then \nbrowse off-line.\n0 of WebExpert 2000, an HTML editor with support \nfor CSS2, in French. (Mac OS X, free trial) 2005-03-25 Evrsoft offers 1st Page 2000, \nan HTML editor with multiple previews, CSS reference, wizards, etc.\nIt uses the Gecko rendering engine from Mozilla \ninternally.\n1997-06-23: Astrobyte has announced BeyondPress \n3.\nOther software (skip to next section) 2007-03-07 \nJulian Graham is developing SCSS and libRUIN.\n5 (\"Oulu\") of the X-Smiles XML browser, which \nsupports, among other things, XHTML, SMIL, XForms and the CSS Mobile \nProfile.\n2003-07-09 Apple has released version 1. \n(Shareware) 2001-11-28 Galeon 1.\n(Windows, free) 2006-01-16 Oregan Networks offers \nthe Oregan TV Browser, with support for CSS2, XHTML, XML, etc. com has released \nStyle Studio v3.\n2006-11-24 Microsoft released the  Internet \nExplorer version 7 Web browser, with support for CSS 2, transparent PNG, and \nmore.\n1999-10-24 SAC (W3C's Simple API for CSS) is in \nbeta.\n1999-04-12 Do you have fear of style \nsheets?\nCSS level 1 (1996, 1999) contains properties for \nfonts, margins, colors, etc.\n(Windows, Mac, Linux, free), 2003-04-21 InDelv XF \nFramework, see under authoring tools.\n(Windows, shareware) 2004-01-16 CreaText \n1.\nBad to strip all CSS from an HTML file. Supports \nremote editing and annotations (Open Source, Solaris, Linux, Mac, Windows) \n2003-04-21 InDelv Software announced the release of its XF Framework 0.\n70 (free for non-commercial use).\n1999-09-24 ICE Soft released v. 2001-01-23 The \nArachne WWW browser for DOS and Linux supports CSS1 since version \n1.\n"}