{"category": "ham", "to_address": "<cc-community@lists.ibiblio.org>", "from_address": "\"Kevin Phillips (home)\" <tacet@qmpublishing.com>", "subject": "Re: [cc-community] on the radio", "body": "\n\n\n\n\n\n\nHey Tim,\n \nYeah, BY & SA allow use and \nwaivers a compulsory collection when the jurisdiction allows, thanks for \nclarifying that.  Also, I've personally tripped over the NC license \nand internet radio play.  A friend of mine runs an internet radio station \nand wanted to support CC music, unfortunately the stuff he'd earmarked \noriginated from ccMixter and was for the most part NC licensed.  The \nnightmare of gaining permission from each artist, then having to pay compulsory \nroyalty anyway, and having to allow for attribution etc rendered the whole thing \na non-starter.\n \nI'll hopefully persuade him to take \nup some BY & SA alternative tunes, then he can justify the additional time \nand investment (trading off free play against catering for CC attribution \nand licensing stipulations).\n \nKev  \n \n \n----- Original Message ----- \nFrom: Tim \nCowlishaw \nTo: tacet@qmpublishing.com ; cc-community@lists.ibiblio.org\n\nSent: Tuesday, May 01, 2007 11:04 AM\nSubject: Re: [cc-community] on the radio\n\nOn 5/1/07, Kevin Phillips \n(home) <tacet@qmpublishing.com> \nwrote:\nI don't think there's any license which doesn't offer ASCAP \n  orSoundExchange collection.  If you choose an NC license you'll \n  need to keepin mind the nature of that license, and that you're basically \n  saying \"no\" to radio stations who earn money from \n  advertising.  This is particularly astumbling block for \n  podcasters and webcasters.\nWell, if you licence the musical work with BY or BY-SA, \nthen the radio stations have the right to play your track *without* any \nobligation to pay royalties through ASCAP, as the CC licence grants them \npermission to use the work commercially anyway. If you licence BY-NC-SA, then \ncommercial uses are reserved from use under the terms of cc, and can therefore \nbe licenced through ASCAP, and renumerated. Bear in mind that NC doesn't \nmean that third parties can *never* use your work commercially, simply that they \nhave to seek permission (or obtain another licence, such as an ASCAP public \nperformance licence) before doing so. IANAL, \nATINLA.Cheers,Tim\n"}