{"category": "ham", "to_address": "Andrew <ktwarwic@flax9.UWATERLOO.CA>", "from_address": "\"Organic Consumers Association\" <ronniecummins@organicconsumers.org>", "subject": "Organic Bytes: Another Sneak Attack on Organic Standards", "body": "\n\nOrganic Bytes #109: Another Sneak Attack on Organic Standards\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHello Andrew,\nORGANIC \n                          BYTES #109\n                          Health, Justice and Sustainability News Tidbits with \n                          an Edge!\n\n5/17/2007\n\nWritten \n                        and edited by Craig Minowa and Ronnie Cummins\n\nSafe \n                        Unsubscribe: \n                   http://alerts.organicconsumershttp://alerts.organicconsumers.org/trk/chttp://alerts.organicconsumers.org/trk/click?ref=zqtbkk3um_1-afx317x3340774&\" >http://organicconsumers.org/unsuborganicbytes.cfm \n                        \n                        You are subscribed as: ktwarwic@SPEEDY.UWATERLOO.CA\n\n \n\n\n\n\n\n\n\nIN \n                        THIS ISSUE\n\nALERT: \n                          ANOTHER SNEAK ATTACK ON ORGANIC STANDARDS\nALERT: \n                          STOP CONGRESS FROM CUTTING SUSTAINABLE AGRICULTURE PROGRAMS\nUPDATE: \n                          CATASTROPHIC BEE COLONY COLLAPSE IS NOT AFFECTING ORGANIC \n                          HIVES \nSUSTAINABILITY \n                          TIP OF THE WEEK: MORE WAYS TO PREPARE FOR PEAK \n                          OIL \nQUOTE \n                          OF THE WEEK:  WHEN THE ENTIRE PLANET SHOPS AT \n                          WAL-MART\nHEALTH \n                          TIP OF THE WEEK: 100% PURE FRUIT JUICE IS NO \n                          LONGER LINKED TO OBESITY\nPRODUCT \n                          PLUNDER OF THE WEEK:  AVOIDING FRUIT JUICE SCAMS\nORGANIC \n                          BYTES READERS TALK BACK ALERT:  USDA SAYS ALMONDS \n                          LABELED AS 'RAW' CAN ACTUALLY BE PASTEURIZED \nWEB \n                          VIDEO OF THE WEEK: SOAP, DRUGS, AND ROCK & \n                          ROLL\nWEBSITE \n                          OF THE WEEK: TOOLS FOR CHANGING THE WORLD\nANOTHER \n                          WEB VIDEO OF THE WEEK: ORGANIC CONSUMERS ASSOCIATION \n                          ON MTV\n\n\n\n\n\n\n\n\n\n___________________________________\n\n\n\n\nimage parody\n\nORGANIC \n              ALERT:\n              ANOTHER SNEAK ATTACK ON ORGANIC STANDARDS\n              USDA & INDUSTRY TRY TO SNEAK BANNED CONVENTIONAL INGREDIENTS \n              INTO ORGANIC BEER, SAUSAGE, & PROCESSED FOODS \n              The USDA has announced a controversial proposal, with absolutely \n              no input from consumers, to allow 38 new non-organic ingredients \n              in products bearing the \"USDA Organic\" seal. Most of the \n              ingredients are food colorings derived from plants that are supposedly \n              not \"commercially available\" in organic form. But at least \n              three of the proposed ingredients, backed by beer giant Anheuser-Busch \n              and pork and food processors, represent a serious threat to organic \n              standards, and have raised the concerns of the Organic Consumers \n              Association (OCA), as well as a number of smaller organic companies \n              and organic certifiers. Specifically, the OCA disagrees with the \n              \"Budweiser exemption,\" allowing conventionally grown hops, \n              produced with pesticides and chemical fertilizers, to be used in \n              beers labeled as \"USDA Organic\". Also, OCA strenuously \n              objects to the USDA's proposal to allow the use of conventionally \n              raised factory-farmed animals' intestines (we'll spare you the \n              gory details of what thes animals have been fed) as casing for \n              sausages labeled as \"organic.\" Adding salt to the wound, \n              the USDA has indicated the public comment period will not be the \n              standard 30-60 days. Although the USDA has been working closely \n              with industry on these proposed changes as far back as 2002, the \n              agency will only be accepting public comments for seven days. Take \n              action now and forward this alert to interested friends and colleagues. \n              \nLearn more and sign the OCA petition to the USDA: \n              http://www.organicconsumers.org/articles/article_5225.cfm\n\n\n___________________________________\nWe \n          rely on your donations to continue policing organic standards. Please \n          donate now!\n\nhttp://www.organicconsumers.org/donations.htm\n\n___________________________________\n\n\n\n\nSUSTAINABILITY \n              ALERT:\n              STOP CONGRESS FROM CUTTING SUSTAINABLE AGRICULTURE PROGRAMS\n\n              Congress is currently putting together the 2007-2012 Farm Bill, \n              a massive bill of taxpayer subsidies and incentives that will have \n              a major impact on food and farming in the U.S. over the next five \n              years. Next week (May 21), the House Agriculture Subcommittee on \n              Conservation will decide whether to make cuts in the Conservation \n              Security Program, an innovative program that helps sustainable and \n              organic farmers protect the environment and preserve wetlands. Congress \n              has already cut this program by $4.3 billion and is considering \n              making further cuts. We need to send a strong message to Washington \n              that it's time to move our food and farming system away from chemical \n              and energy-intensive industrial agriculture towards conservation, \n              organic practices, and less dependence on petroleum-based inputs. \n              Contact your Congressional Representative now and tell them to please \n              use taxpayers' money wisely by restoring full funding to the Conservation \n              Security Program.\n              Take action: http://www.organicconsumers.org/articles/article_5226.cfm\n\n\n\n\n___________________________________\n\n\n\n\nUPDATE:\n\n              CATASTROPHIC BEE COLONY COLLAPSE IS NOT AFFECTING ORGANIC HIVES\n\n              As previously reported in Organic Bytes (Issue #104), beekeepers \n              in 24 states are experiencing record losses of honeybees. Some states \n              have reported up to 70% disappearances of commercial bee populations. \n              Researchers are struggling to find the causes of this mysterious \n              collapse. A crucial element of this story, missing from reports \n              in the mainstream media, is the fact that organic beekeepers across \n              North America are not experiencing colony collapses. The millions \n              of dying bees are hyper-bred varieties whose hives are regularly \n              fumigated with toxic pesticides by conventional beekeepers attempting \n              to ward off mites. In contrast, organic beekeepers avoid pesticides \n              and toxic chemicals and strive to use techniques that closely emulate \n              the ecology of bees in the wild. Researchers are beginning to link \n              the mass deaths of non-organic bees to pesticide exposure, genetically \n              modified organisms (GMOs), and the common practice of moving conventional \n              bee hives over long distances.\nLearn more: http://www.organicconsumers.org/bees.cfm\n\n\n\n\n\n__________________________________\n\n\n\n\n\nphoto \n                parody\n\nSUSTAINABILITY \n              TIP OF THE WEEK: \n              MORE WAYS TO PREPARE FOR PEAK OIL \nWe \n                began posting Sharon Astyk's insightful tips in our Organic Bytes \n                issue #104, which highlighted her first 50 peak oil tips. Here \n                are some excerpts from her most recent posting of tips #50 through \n                #100:\n52. \n                If your community doesn't have a food coop, start one now. This \n                can be a powerful tool for creating local food economies. Here \n                is a downloadable guide to starting your own co-op.\n66. \n                Learn basic first aid, herbalism, and any other useful medical \n                information you can come by.\n94. \n                If others don't seem to be responding to your message or sharing \n                your concerns, remember that the evidence was there before you \n                saw things too, and that everyone is ready to hear things at a \n                different time.\n99. \n                Think of peak oil and the other challenges that face us as an \n                optimization exercise - how do I get the most fun, the best life, \n                the most happiness, the most love, with the fewest inputs - the \n                least money, the least energy, the least waste. Get excited about \n                making it work.\nRead \n                all 100 tips here: http://www.organicconsumers.org/articles/article_5209.cfm\n\n\n\n\n___________________________________\n\n\n\n\nQUOTE \n              OF THE WEEK: \n              WHEN THE ENTIRE PLANET SHOPS AT WAL-MART\n              \"Worldwide, so many people shop at Wal-Mart that this year \n              7.2 billion visits will be made to Wal-Mart stores. Earth's population \n              is only 6.5 billion, so this year the equivalent of every person \n              on the plant will visit a Wal-Mart, with more than half a billion \n              visits left over.\" Charles Fishman, \"The Wal-Mart Effect,\" \n              2006\n\n\n\n___________________________________\n\n\n\n\nHEALTH \n              TIP OF THE WEEK: \n              100% PURE FRUIT JUICE IS NO LONGER LINKED TO OBESITY\n              New research presented at the Pediatric Academic Societies' annual \n              convention in Toronto last week indicates that 100% pure fruit juice \n              does not add to childhood obesity and may actually help children \n              maintain healthy weight. In the their study, researchers analyzed \n              the juice consumption of 3,618 children ages 2 to 11 using data \n              from the National Health and Nutrition Examination Survey. Increased \n              risk for obesity was linked to beverages that contained artificial \n              sweeteners like high fructose corn syrup, which makes up the vast \n              majority of beverages on the market (note: most high fructose \n              corn syrup is made from genetically engineered corn). \"The \n              bottom line is that 100 percent juice consumption is a valuable \n              contributor of nutrients in children's diet and it does not have \n              an association with being overweight,\" said study chief Dr. \n              Theresa Nicklas.\n\nLearn more: http://www.organicconsumers.org/articles/article_5108.cfm\n\n\n\n___________________________________\n\n\n\n\n\nPRODUCT \n                PLUNDER OF THE WEEK: \n                AVOIDING FRUIT JUICE SCAMS\n                Large beverage manufacturers are notorious for putting labels \n                on their products that mislead consumers into believing that these \n                junk-food drinks are pure fruit or else contain more juice than \n                they really have. If you are shopping for 100% pure fruit juice, \n                here's how to avoid getting scammed:\n\nAlways \n                  read the ingredient label on the back of the product. If there's \n                  anything other than fruit juice in the product, it must be listed \n                  there. \n\"Made \n                  with REAL Fruit Juice\" could mean it really only has a \n                  small percentage of fruit juice. \nAll \n                  beverages that imply they contain juice must declare the percentage \n                  of juice on the information label near the top of the Nutrition \n                  Facts panel. \nIf \n                  a product is labeled as Fruit drink, juice beverage, juice cocktail \n                  or \"ade\" -- the product is likely full of artificial \n                  sweeteners and contains very little juice. \nOftentimes \n                  a \"100% juice\" product contains juice fillers. Read \n                  the ingredient label, and you'll frequently find your cranberry \n                  juice, for example, is mostly apple juice. \nKeep \n                  in mind that conventional fruits and juices contain pesticide \n                  residues, and that industrial scale fruit production is an environmental \n                  disaster. Protect your health and the health of the planet by \n                  consuming organic fruits and fruit juices.\n\n\n\n\n\n___________________________________\n\n\n\n\nORGANIC \n              BYTES READERS TALK BACK ALERT: \n              USDA SAYS ALMONDS LABELED AS 'RAW' CAN ACTUALLY BE PASTEURIZED \nREADER'S \n                QUESTION: In Organic Bytes #107 you wrote about the USDA passing \n                a new regulation that will require almonds to be pasteurized even \n                though they may be labeled \"raw\". I understand the public \n                comment period is over, but I'd still like to let the USDA know \n                how I feel about this. Can you help?\nOCA'S \n                RESPONSE: We've received a lot of emails and phone calls from \n                our readers on this issue. The USDA approved this regulation with \n                little public notification. As a result, the only comments the \n                agency received were from the industrial agriculture lobbyists. \n                One of the FDA-recommended pasteurization methods requires the \n                use of propylene oxide, which is classified as a \"possible \n                human carcinogen\". Organic and family-scale almond farmers \n                are protesting the proposed rule, saying it will effectively put \n                them out of business, since the minimum price for the pasteurization \n                equipment is $500,000. We feel this issue is too important to \n                let rest. \nLearn more and take action: http://www.organicconsumers.org/articles/article_5227.cfm\n\n\n\n\n___________________________________\n\n\n\n\nWEB \n              VIDEO OF THE WEEK: \n              SOAP, DRUGS, AND ROCK & ROLL\n              In a recent bizarre encounter between the punk rock band, The Germs, \n              and law enforcement officials in California, it was discovered that \n              standard field drug testing kits could distinguish the difference \n              between soap products that are made from natural and organic ingredients \n              and products that may claim to be organic but really contain synthetic \n              detergents made in part or entirely from petroleum. Watch this humorous \n              short clip to see if some of your favorite so-called natural or \n              organic \"soaps\" may actually be synthetic. \n              Watch: http://www.youtube.com/watch?v=-6E19OUBNhM\n\n\n\n\n___________________________________\n\n\n\n\nWEBSITE \n              OF THE WEEK: \n              TOOLS FOR CHANGING THE WORLD\n              Everyday we are flooded with depressing news about what's happening \n              to our planet. Not enough attention is given to those positive solutions \n              that are emerging across the globe. WorldChanging.com is a new public \n              interest website providing examples of sustainable and positive \n              change. According to the Worldchanging.com founders \"We pay \n              special attention to tools, ideas and models that may have been \n              overlooked in the mass media. We make a point of showing ways in \n              which seemingly unconnected resources link together to form a toolkit \n              for changing the world.\" \nLearn \n              more: http://www.worldchanging.com\n\n\n\n___________________________________\n\n\n\n\n ANOTHER \n              WEB VIDEO OF THE WEEK:\n              ORGANIC CONSUMERS ASSOCIATION ON MTV\n              OCA's Environmental Scientist, Craig Minowa, and his band Cloud \n              Cult were featured on MTV this week in a piece highlighting efforts \n              to link the environmental movement with the music industry. Take \n              a peek at this MTV video to see how one of OCA's offices shares \n              space with the world's only environmental nonprofit record label, \n              located on an organic farm. OCA's educational materials are also \n              distributed to audiences nationally via this touring band.\nWatch web video here: http://www.mtv.com/overdrive/?name=news&id=1559417&vid=148618\n\n\n\n__________________________________\nWe \n          rely on your donations to continue our work on these important issues!\n\n\nhttp://www.organicconsumers.org/donations.htm\n \n******** messages from \n          our supporters*********\n\n\n\n\n\n\n\n\nIf \n                  you’re eating pure foods, shouldn’t your vitamins \n                  and supplements be completely plant or food-based, and free \n                  of synthetic chemicals? \nBotani \n                  Vitamins & Supplements invites you to experience the difference \n                  between a synthetic based vitamin and a vitamin made of ingredients \n                  you can only find in nature. Botani supplement category represents \n                  a truly pure, food inherent, supplement with assayed vitamin, \n                  mineral and nutrient potencies derived only and directly from \n                  food and botanical extract sources. No synthetic vitamins (USP), \n                  minerals or nutrients have been added to these supplements (either \n                  directly or indirectly). BOTANI \n                  Multi Vitamins is a multiple vitamin and mineral supplement \n                  that is derived directly from NATURALLY OCCURRING, full-spectrum \n                  fruit, botanical, and grain sources. Try Botani Vitamins & \n                  Supplements!\n\n_______________________________\n\n\n\n\n \n\n\n\n\nPlease \n                  forward this publication to family and friends, place it on \n                  websites, print it, duplicate it and post it freely. Knowledge \n                  is power!\n__________________________________\nNOTE \n                  TO CO-OP AND NATURAL FOOD STORE SUBSCRIBERS:\n                  Organic Bytes is a great tool for keeping your staff and customers \n                  up to date on the latest issues. Feel free to forward this email \n                  to your staff and print for posting on bulletin boards and staff \n                  break tables. You are also welcome to use this material for \n                  your newsletters. There's an attractive print-friendly PDF version \n                  of this available for free download at http://www.organicconsumers.org/organicbytes.cfm\n\n_________________________________\nORGANIC \n                  BYTES is a publication of:\n                  ORGANIC CONSUMERS ASSOCIATION \n                  6771 South Silver Hill Drive\n                  Finland, Minnesota 55603\n                  Phone: (218)- 226-4164 Fax: (218) 353-7652\n__________________________________\nSubscribe: \n                  Safe \n                  Unsubscribe: \n                  http://organicconsumers.org/unsuborganicbytes.cfm \n                  \n                  You are subscribed as: ktwarwic@SPEEDY.UWATERLOO.CA \nChange \n                  your subscription settings to receive Organic Bytes as plain \n                  text here:\n__________________________________\n  \nxaxa1014138\n\n\n\n\n\n \n \n\n\n\n\n\n \n\n\n\n\n\n"}