{"category": "ham", "to_address": "debian-desktop@lists.debian.org", "from_address": "\"=?ISO-8859-1?Q?Andr=E9_Luiz_Rodrigues_Ferreira?=\" <andrelrf@gmail.com>", "subject": "Desktop firewall", "body": "Hi all,\n\nI'm using the Sid desktop and would like to suggest the inclusion of a\nfirewall in Desktop task on tasksel.\nA firewall does not guarantee security but it is in most environments\nthe first line of defense against network based attacks.\n\nWhich firewall can we use?\nI suggest Firestarter[1].\nFirestarter is an Open Source visual firewall program. The software\naims to combine ease of use with powerful features, therefore serving\nboth Linux desktop users and system administrators.\nI use this for 4 years and think very easy for novice users.\n\nFirestarter features:\n\n    * Package stable on Debian[2]\n    * Open Source software, available free of charge\n    * User friendly, easy to use, graphical interface\n    * A wizard walks you through setting up your firewall on your first time\n    * Suitable for use on desktops, servers and gateways\n    * Real-time firewall event monitor shows intrusion attempts as they happen\n    * Enables Internet connection sharing, optionally with DHCP\nservice for the clients\n    * Allows you to define both inbound and outbound access policy\n    * Open or stealth ports, shaping your firewalling with just a few\nmouse clicks\n    * Enable port forwarding for your local network in just seconds\n    * Option to whitelist or blacklist traffic\n    * Real time firewall events view\n    * View active network connections, including any traffic routed\nthrough the firewall\n    * Advanced Linux kernel tuning features provide protection from\nflooding, broadcasting and spoofing\n    * Support for tuning ICMP parameters to stop Denial of Service (DoS) attacks\n    * Support for tuning ToS parameters to improve services for\nconnected client computers\n    * Ability to hook up user defined scripts or rulesets before or\nafter firewall activation\n    * Supports Linux Kernels 2.4 and 2.6\n    * Translations available for many languages (38 languages)\n\nThanks!\n\nLinks:\n[1] http://www.fs-security.com/\n[2] http://packages.debian.org/stable/admin/firestarter\n\n\n-- \nAndre Luiz Rodrigues Ferreira (si0ux) \n *******************************************************************\nOrlandia - SP - Brazil\n\n\"Unix is user friendly... It's just selective about who its friends are.\"\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}