{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"dellunleashed\" <dellunleashed@mx01.ultra-mx.com>", "subject": "Celebrate Summer with $200 off select Dell notebooks with coupon", "body": "\n\n\nUntitled Document\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nSAVE NOW\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n            $200 \n\nGet\n$200 off with coupon* for a limited time on InspironT Notebooks priced\n$999 and above (before taxes, fees, EPP discount, Shipping &\nhandling). The all-new Inspiron notebooks feature eight color options\nto suit your style. \n\n\n\n\n\n\n\nSAVE LATER\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n            $100 \n\nBuild\nyour perfect PC and ask family and friends to chip-in for its purchase\nthrough the Unleash MyDell online gift registry. Dell will chip in the\nfirst $100 with coupon** until Aug. 3rd on Inspiron, XPST and LatitudeT\nsystems.\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChoose one of these offers and couple it with your \n\t\t\t\t\t\t\t\t\t\n      Dell Student Discount for maximum savings!\n(coupons not combinable)\n\n\n\n\n\n\t\t\t\t\t\t\t\t\nALL ORDERS ARE SUBJECT TO APPROVAL AND ACCEPTANCE BY DELL.Offer subject\nto your school's continuing participation in the Dell Education\nPersonal Purchase Program. Prices, specifications, availability and\nterms of offers may change without notice. Taxes, fees, shipping,\nhandling and any applicable restocking charges are extra, and vary.\nOffers may be combined with other select offers or discounts. Valid for\nU.S. Dell Education Personal Purchase Program new purchases only. Dell\ncannot be responsible for pricing or other errors, and reserves the\nright to cancel orders arising from such errors. \n\n\t\t\t\t\t\t\t\t\n*Coupon offer valid 06/26/07 10am CT - 07/26/07 11:59pm CT. Coupon not\ncombinable with other coupons. Coupon is not combinable with Dell Home\nand Home Office instant dollars off, percent off, or mail-in rebates.\nOne coupon per customer. Coupon is for one-time use only.\n\n\t\t\t\t\t\t\t\t\n**Coupon offer valid 06/04/07 10am CT - 08/03/07 11:59pm CT. Coupon not\ncombinable with other coupons. Coupon is not combinable with Dell Home\nand Home Office instant dollars off, percent off, or mail-in rebates.\nOne coupon per customer. Coupon is for one-time use only.\n\n\t\t\t\t\t\t\t\t\nDell, the Dell Logo, Inspiron, Latitude, and XPS are trademarks of Dell\nInc. Intel and the Intel inside logo are trademarks or registered\ntrademarks of Intel Corporation or its subsidiaries in the United\nStates and other countries. Microsoft and Windows Vista are registered\ntrademarks of Microsoft Corporation. Other trademarks and trade names\nmay be used in this document to refer to either the entities claiming\nthe marks and names or their products. Dell disclaims proprietary\ninterest in the marks and names of others. © 2007 Dell Inc. All\nrights reserved. Reproduction or translation of any part of this work\nbeyond that permitted by U.S. copyright laws without the expressed\nwritten permission of Dell is strictly forbidden.\n\n\t\t\t\t\t\t\t\t\nThis email was sent to inform you about products or services we think\nwill interest you. If you do not wish to receive this type of\ncommercial e-mail, please opt out through Dell Subscription Center by clicking here.\nWhile we are processing your request, you may continue to receive this\ntype of commercial email from us. Your opt-out only covers unsolicited\ncommercial emails; we may continue to send information as you request\nor as permitted by law, such as information about your transactions\nwith us. Dell Inc., One Dell Way, RR3-54, Round Rock, TX 78682. Please\ndirect privacy matters to >\n\t\t\t\t\t\t\t\t\n    the Office of Privacy.\n\n\n\n\n \n\n\n\n\nThis \n  message was sent to you as an opt-in subscriber to The Speed Network or one of \n  its affiliates. \n  We will continue to bring you valuable offers on the products and services \n  that interest you most. If you wish to unsubscribe, please \n\n\n\n\n  Click Here\n\n\n\n\n\n    Postal opt-out - 1300 NW 17th avenue Ste 218 Delray Beach FL 33445\n\n \n \n\n"}