{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "epistle <iktfh@stanford.edu>", "subject": "Now the US have \"eggs in a basket,\" which is fried bread with a fried egg in a hole in the middle.", "body": "ERMX Continues To Expand As Stock Climbs Up 16.6%!\n\nEntreMetrix Inc. (ERMX)\n$0.21 UP 16.6%\n\nERMX announced further expansion with K-9 Genetics. Healthy and Premium\ndog foods grossed $3.6 Billion in 2006, up from $1.9 billion in previous\nyears. Read up on ERMX over the holiday, we think you will see even more\nfireworks on Thursday morning!\n\nIt couldn't have been my accent, which is flawless. A mad world, my\nmasters. At last I found a bus that seemed to be going to \"Rockavirr\",\nas the driver said.\nYou heard it here first. Just another tragic example of American\ncultural imperialism.\n\nI admit that it's a sobering thought that this site may be influencing\nBig Media. A mad world, my masters.\n\nI promise not to use it as a force for good. Also in squid news, the\nvarious squid classifications mentioned here earlier - Porchiteuthis,\nArborteuthis - have inspired a couple of not-yet-discovered species of\ngiant squid. Further developments will be reported as they occur, if not\nbefore.\n\nI guess they thought we must eat that as well, and thought \"eggy in a\nbasket\" was a quaint and Olde Worlde version.\n\nFor example, I came up with a new variety of Very Angry Squid -\nSoreteuthis.\n\nThe convenience, the price, and the novelty of the thing are what sold\nme. One lady tried to bully me onto her bus, which was not going to DC -\nshe was actually trying to shove my considerable bulk up the bus steps.\n\nThe Museum Cats have hunkered down for the duration, and after I put the\npork roast into go in the oven, I'm going to take a nap.\n\nGuess what we had for breakfast this morning?\nI promise not to use it as a force for good.\nI've never heard of anyone taming a Gray Dire Cat before, but if I do it\nand survive, I shall name him Leroy. According to Museum files, Allan\nJanus would drink just about anything he could cadge, rum included if it\nwas on offer; but his favorite tipple seems to have been the local apple\njack.\nAbove, Jessica Biel as Sophie, Edward Norton as Eisenheim, and Paul\nGiamatti as Uhl with a skirmish line of pickelhaubed Viennese peelers.\n\nWhen we rolled out, I ate my buns, fired up my laptop, and read my email\nby hitching on to unsecured wifi as we passed through town, which made\nme feel very high-tech and all.\n\nI also bought a bag of pork buns at a carryout on East Broadway - very\nnice.\n\nStud locators are cheap and easy to use. Cat Peake hangs out on a\nneighbor's porch on the Historic Circle.\nI confess that I don't attempt the elegant flip that V performs, above.\nOh, it's the finest thing! \"Eggy in a basket\" apparently.\nOne lady tried to bully me onto her bus, which was not going to DC - she\nwas actually trying to shove my considerable bulk up the bus steps.\n\nRight - didn't have the opportunity to fight oppression today, though;\nwill do it tomorrow.\n\n"}