{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Mara Worley\" <wufesemtiapab@esemtia.com>", "subject": "You'll love the new, non-obese you", "body": "\nObesity is dangerous, stop it\n\n\n\n\n\nAnatrim – The latest and most enchanting product for over-weight people available – As you could see on BBC\n\n\n\nDo you see superfluous body kilos kill a plenty of people for every new year? We believe you hate the unattractive look of those people and the low status they have in modern society. \n\nOr, maybe, you can not resist a pressure of your baneful eating habits. Does it all sound familiar? Then we have something for you!\n\n\n\n\n\nHere Anatrim comes, the new product for the elimination of your body’s extra weight. The most astounding thing is that Anatrim raises the quality of your life by soothing your feeling of hunger and giving you better spirit. Here’re some notes from our customers:\n\n\n\n\n\n\"It’s outstanding! \n\n\nInstead of eating any food close at hand and watching TV continually \n\n\nI became rather more interested in doing sport.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I have a great shape now and lots of men stare hard at me!\"\n\n\n\n\n\n\nSilvia D., New York\n\n\n\n\n\n\n\"Passive weight losing was of little help to me. It was very hard for me to hold back and not to eat something just at hand. \n\n\nOne day I heard on Anatrim in the media advertisement and I was really effected by the information.\n\n\n I had tried taking it, and my wife said that I'm a different person now, 3 months later. \n\n\n27 pounds have gone away and this is still far to an end! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nSteve Burbon, Colorado\n\n\n\n\n\nAnatrim gives you an opportunity to understand that you doesn’t have such a great need for the constant eating. It lifts your mood up, supplies you with energy, and attacks unnecessary kilos. Great thanks to its mighty original formula!!\n\n\n\nFind out more information on this great product now!\n\n\n\n"}