{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "fiat: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Friday, May 25, 2007\nfiat \\FEE-uht; -at; -aht; FY-uht; -at\\, noun:\n1. An arbitrary or authoritative command or order.\n2. Formal or official authorization or sanction.\nHe found a provision in the college constitution that said there were to be no executive committees, and arguing that those stodgy impediments to serious change had grown up only by convention and tradition; he abolished them and ruled these faculty meetings by fiat, using each as an occasion to announce what he was going to do next that was sure to stir up even more resentment. -- Philip Roth, The Human Stain\nAmericans tend to squirm about the messiness of their two best-known trade agreements with Japan: the \"voluntary limitations\" that have restricted exports of Japanese cars to the United States since 1981, and the semiconductor agreement of 1986, which declared by fiat that foreign manufacturers should get 20 percent of semiconductor sales in Japan. -- James Fallows, \"Containing Japan\", The Atlantic, May 1989\nFiat derives from Latin fiat, \"let it be done,\" from fieri, \"to be done.\"\nDictionary.com Entry and Pronunciation for fiat\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9715539-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}