{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 8, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESParis Ordered Back To Jail\nParis Hilton was taken from a courtroom screaming and crying, seconds after a Los Angeles judge ordered her returned to jail. More...Watch: Paris Hilton Flies The Coop\n• Wife Sentenced For Killing Preacher• Pace Out As Joint Chiefs Chair\n                     \t\t\t\t\t| Watch• U.S. Relaxes Passport Rules For N. America\n                     \t\t\t\t\t| WatchU.S.Immigration Collapse A Blow To Bush\nThe Senate's failure to pass a broad immigration bill was a major political blow to President Bush. Also in the loser column\n                        was the Senate's Democratic leadership and perhaps GOP presidential hopeful John McCain.   More...Watch: Immigration Reform Debate\n• Slaying Suspect May Have Had MySpace Page\n                     \t\t\t\t\t| Watch• Parents Dispute Claims About Missing Girl\n                     \t\t\t\t\t| Watch• U.S. Relaxes Passport Rules For N. America\n                     \t\t\t\t\t| Watch• More StoriesWorldSpain Arrests U.S. Terror Suspect\nSpanish law enforcement officers have arrested a Syrian man wanted in the U.S. on suspicion of supplying arms to Colombian\n                        rebel groups. Monzer al-Kassar faces extradition to New York, where he will face terrorism charges. More...\n• Report: CIA Ran Secret Prisons In Europe• G-8 Leaders Back U.N. On Iran Sanctions\n                     \t\t\t\t\t| Watch• Gunmen Raid Iraq Cop's House, Kill 14\n                     \t\t\t\t\t| Watch• More StoriesPoliticsRep. William Jefferson Pleads Not Guilty\nThe Louisiana Democrat indicted this week on 16 counts in relation to a bribery case pleaded not guilty to charges of racketeering,\n                        money-laundering and soliciting. Congress is launching investigations into his possible explusion. More...Watch: Rep. Jefferson: I'm Innocent\n• Immigration Collapse A Blow To Bush\n                     \t\t\t\t\t| Watch• Lawyers Want Libby Sentence Delayed\n                     \t\t\t\t\t| Watch• Pure Horserace: John McCain's Bad Day\n                     \t\t\t\t\t| Watch• More StoriesHealthPot Chemical May Curb Inflammation\nThe active ingredient in marijuana may curb inflammation and help treat skin allergies, researchers report in Science. More...\n• Movie Headaches Vex Real-Life Doctors• New Migraine Drug Promising• Hormonal Fix for Unwanted Hair?• More StoriesSciTechNASA Hopes For Change With Shuttle Launch\nSince the beginning of the year, NASA has endured an astronaut's arrest in a bizarre love triangle, a workplace murder-suicide\n                        and a freak hail storm at the launch pad. What it hasn't had is a space shuttle launch. More...Watch: Another Setback For NASA\n• MIT Shows How To Cut The (Power) Cord• G-8 Leaders Reach Climate Deal\n                     \t\t\t\t\t| Watch• More DC Panda-monium Possible This Summer• More StoriesBusinessStocks Take Another Hit\nStocks fell for a third straight day as rising bond yields deflated hopes that the Federal Reserve might cut interest rates\n                        later this year. The Dow industrials fell nearly 200 points. More...\n• Mortgage Reform Unlikely This Year• Buying A New Car? Don't Despair• What's Your Policy On Insurance?• More StoriesEntertainment\"The Sopranos\" Reaches The End\nOn the premiere of \"The Sopranos\" eight long years ago, Tony was asked by his psychiatrist, Dr. Melfi, if he had any qualms\n                        about how he made his living. More...Watch: The End Of Tony Soprano?\n• Isaiah Washington Out Of \"Grey's Anatomy\"• Sambora Enters L.A. Treatment Facility• Sarah Jessica Parker Debuts Clothing Line• More StoriesOpinionOn The Fringe, But Also On Point\nPresidential candidates like Dennis Kucinich, Mike Gravel and Ron Paul have no chance of winning anything, but their presence\n                        on the debate stage is vital to the health of their parties, the Nation says. More...Watch: GOP Debate Focuses On Iraq\n• Not-So-Terrifying Terrorists\n                     \t\t\t\t\t| Watch• The Press At The Polls• Republicans Should Quit Playing Nice\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Travel: Summer Travelers Face Turbulence\nSummer vacationers may face some tough travel issues this year, ranging from new passport regulations to flight delays. Terry\n                        Trippler, an aviation expert from cheapseats.com, offered some advice on The Early Show.   More...Watch: U.S. To Relax Passport Rules\n• EARLY SHOW: Accidental Deaths Up After 20-Year Decline\n                     \t\t\t\t\t| Watch• EARLY SHOW: Book Excerpt: \"Grace Will Lead Me Home\"• EARLY SHOW: Time-Savers For Your Family Reunion\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nG-8 Pledges AIDS Aid To AfricaPresident Bush was absent from morning G-8 talks, but joined other world leaders later in the day to reach a landmark agreement\n                                    to fight AIDS and other diseases in Africa. Gwen Belton reports.\nTOP VIDEOS\nWinkler Family Testifies\nCelebrity Justice For Paris?\nTonys' 'Spring Awakening' \nCrying At Work\nSpring Cleaning Tips\nTyson's Ex-Wife Tells All\nAlabama Legislature Brawl\nThe End Of Tony Soprano?\nPreventing Fatal Accidents\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesLesley Stahl profiles Internet tycoon Barry Diller. This Sunday, 7 p.m. ET/PT.48 Hours MysteryDark Voyage:An aspiring actress dies under mysterious circumstances. Bill Lagattuta reports Saturday at\n                           8 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}