{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Glenn Ervin\" <GlennErvin@cableone.net>", "subject": "Re: Software speech opinions", "body": "That sounds like the utility called PcDisk that Blazie put out for use with \nthe Braille & Speaks.\nGlenn\n\n----- Original Message ----- \nFrom: \"Travis Siegel\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Sunday, June 24, 2007 1:42 PM\nSubject: Re: Software speech opinions\n\n\nThis is exactly how I worked out the Artic Technologies serial disk\ntransfer mode.  They sold a software pack you could buy for their\nnotetakers that would give you some additional capabilities.\nThe problem was, they wanted several hundred dollars for the floppy\ndrive their system used.\n(although you could turn your pc into a floppy for the note taker if\nso desired) This is the program I wrote my own driver for (though I\nnever finished it, so it's not really distributable)\nBut, it's easy enough to pretend to be the drive, and watch what the\ndevice sends back.\nLots of drivers are written using this approach.\nAnd, I see no reason why usb devices should be any different.\n\n\nOn Jun 24, 2007, at 1:04 PM, C.M. Brannon wrote:\n\n> \"Spie Sutherland\"  writes:\n>\n>> What I meant was, if PCs don't have serial ports then synths will be\n>> made for USB, and then its a software issue. They will not become\n>> obsolete because of USB, in fact USB is arguably much better.\n>\n> The problem with the current offerings is that the manufacturers\n> are unwilling to give out programming docs.  Hence, no speakup\n> support.  I won't do business with those kind of people, even though\n> the Triple Talk is well within my budget.  I would suggest that others\n> do the same.\n>\n> I wonder about the possibility of reverse-engineering one\n> of these synths using a Windows system.  For example, usbsnoop is a\n> win32 program that can monitor traffic to and from USB devices\n> (see http://benoit.papillault.free.fr/usbsnoop/).\n>\n>\n> -- Chris\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}