{"category": "ham", "to_address": "<cc-community@lists.ibiblio.org>", "from_address": "\"Kevin Phillips (home)\" <tacet@qmpublishing.com>", "subject": "Re: [cc-community] Strayform - where artists and fans connecttofund\n\tand distribute new creative works", "body": "\n----- Original Message -----\nFrom: \"drew Roberts\" \nTo: \nSent: Sunday, May 20, 2007 1:28 AM\nSubject: Re: [cc-community] Strayform - where artists and fans connecttofund\nand distribute new creative works\n\n\n[snip]\n\n> >\n> > I've looked into several possibilities here in the UK.  There's a number\nof\n> > projects which gain government funding for \"charitable work\", or\n\"community\n> > work\" which benefits others at reduced or no cost.  We have a community\n> > studio locally for instance, I could record stuff there cheaply, or\n> > continue to do as I do now and record stuff in my own home setup.  I'm\nnot\n> > sure if a band could run as a registered charity, though it's an\n> > interesting concept ;)\n>\n> That is an idea. Pay expenses of band, including band members, roadies,\netc.\n> salaries. Release the music under a Free (and in my book, copyleft)\nlicense.\n> This is certainly a benefit to the public.\n\nYes.  The only drawback I can see is that it's no longer \"charitable\" when\nthey are fed back into the commercial ticketing system, you'd have to create\nsome kind of not-for-profit deriv.  Renders the whole thing a bit of a\nnon-starter.  Though having said that they could do \"free\" concerts and\nbring along the t-shirts and the merch......who knows.\n\n> >\n> > > > Historically, bundled into the\n> > > > cost of each CD or book is the cost of production and\n> > > > distribution.  But now with the internet distribution is\n> > > > nearly costless.  Let\n> > > > \u001b$B!G\u001b(Bs move the payment forward to the point of creation.\n> > >\n> > > That is one option. Worth an experiment in my book.\n> >\n> > There's a band called The Crimea who are doing something like this\nalready,\n> > they offer the CD for those folks who want something tangible (or high\n> > quality), but also offer their latest album for download completely free\nof\n> > charge.\n>\n> I am more concerned with a Free license myself, rather than free of\ncharge.\n\nYeah, that's a shame.  To be honest I'm not entirely convinced they're aware\nof the options, otherwise they may have opted for something more open.\nReading their occasional interviews and posts they seem keen to duck out of\nthe traditional systems.  I was also encouraged recently by something Thom\nYork said about wanting to do something similar in Time Magazine.\n\nShould CC have some kind of lobbying group to stalk these artists? lol :)\n\n> >\n> > http://www.thecrimea.net/\n> >\n> > They're smart enough to realise it'll benefit them in the longrun, as\nfar\n> > as gigs and promotion goes.  Much like the Chinese situation.\n>\n> Even with a Free license, you could charge for gigs and merchandise, etc.\n> >\n> > > > Recording companies pay artists upfront to create\n> > > > something new and then charge the consumers per copy; let\n> > > > \u001b$B!G\u001b(Bs have fans pay the artists directly and give them the\n> > > > freedom to use and share.  They will use this freedom to\n> > > > distribute and promote, providing a valuable service to\n> > > > artists.  The end result would be lower total costs, more\n> > > > freedom and control for artists and consumers, and new\n> > > > communities with strong ties between artists and fans.\n> >\n> > Fans do pay the artists directly, every time they turn up to a gig or\nbuy a\n> > t-shirt, or a high-def DVD surround sound limited edition recording.\n> > There's no reason for the fans to pay for recordings anymore, as The\nCrimea\n> > point out.\n>\n> The thing is, if the music came with a Free license and I liked, I would\n> happily pay the band for a CD. (Actually, I have been thinking recently\nthat\n> it might be a nice twist to go back to the \"album format\" for delivery of\n> CDs. Basically, album size, materials, posters, lyrics, etc. with a CD\ninside\n> instead of vinyl. Is it clear what I mean here?)\n\nYes.  That's exactly the kind of thing I'd love to see, and I agree, I'd\nhappily pay good money for something like that.  I think one of the issues\nwith CDs is that the price remained fixed whilst the \"costs\" bottomed out.\nMost music lovers and consumers are well aware of the costs now, especially\nas daily newspapers include \"free\" CDs and DVDs whilst still paying dues to\nthe artists and creators.  It's difficult to convince people to pay for data\nI guess.\n\nSo it's the additional and exclusive things people expect to pay more for,\nthe physical things they can touch, wear or play with.  I kept my old vinyl\nbecause some of the artwork is simply iconic, awesome stuff from the 70s and\n80s.  I was thinking of framing some of those old album covers.\n\nIt'd be great to bring back that sense of ownership, the internet is a great\nplace for things like fanclubs and fan-feedback, though we're not seeing so\nmuch of that just yet - beyond myspace..\n\n> > The costs associated with writing and recording are a fraction\n> > of what they used to be, and the opportunities for the band to claw back\n> > the investment with merchandising and in the commercial space are\nmassive.\n> >\n> > > > – The Site –\n> > > >\n> > > > With actualizing this vision in mind, I created\n> > > > www.strayform.com.  It works like a social network for\n> > > > artist and fans with specialized features to promote,\n> > > > fund, and distribute new media.  A library of CC licensed\n> > > > media leads to you to discover new artists.  Becoming fans\n> > > > of these artists and selecting media as one of your\n> > > > favorites allows us to rank and provide recommendations,\n> > > > while giving you specialized privileges and notifications.\n> > > >  People with similar interests surfing your pages use\n> > > > these connections and find new favorites and artists as\n> > > > well.  These massive connectivity provides a network that\n> > > > funnels interest into Proposals.  Proposals are artists\n> > > > \u001b$B!G\u001b(B offers to create new CC licensed media funded by fans.\n> > >\n> > > Unless htis is for BY and BY-SA works, I am not too interested. To me\nthe\n> > > works are still mostly gonna be useless and pollution.\n> >\n> > There was another website in the news recently which looked a lot like\n> > yours in concept, I forget the name.  This other website was making a\nsong\n> > and dance (almost literally) about their first artist making a CD from\n> > monies pledged by myspace fans.  I say great, whatever works.  Though\nwhen\n> > they finally make their recording it wasn't clear if they'd then give\nthe\n> > recording away for free or start to charge for it.\n>\n> Again, for me, the crux of the matter is not whether they give it away or\n> charge for it, it is whether it comes with a Free License.\n\nAgreed.\n\n> >\n> > I've also heard of other schemes where funders are effectively\ninvestors.\n> > So the whole thing becomes like the stock market with share values for\n> > artists etc.\n>\n> This is effectively no more than a twist on the corporate or partnership\n> model. Unless there is a Free license involved, what is to stop a sell out\nin\n> a few years to the majors? (Leaving the majority of fans no better off\nthan\n> they are now.)\n\nAgain, very much agreed.  I don't like the idea for that reason, it's more\nof the same thing but with the convenience of lower risk by burdoning the\nfans with the setup/recording costs.  A lot of the news repotage talks of\n$50,000+ for recording fees, sounds to me like a studio somewhere is making\na good living out of it!\n\n> >\n> > I would suggest building into your plan somehow the \"beyond music\"\nstrategy\n> > of the Chinese, so artists using your site don't expect to make money\nfrom\n> > the fans for the music directly.  There should be something else,\n> > merchandising or signed pictures or whatever.\n>\n> That is one option, but I think setting a price at which you will release\na\n> track with a Free license (say CC BY-SA for the sake of argument) is worth\nan\n> experiment. If I can get some people together willing to record this way,\nI\n> will run some experiments along these lines.\n\nYeah, what's kinda happening is the music industry in China is accepting\ntheir fate of every release being BY-ND :)  I agree, removing the ND and\nreplacing it with an SA would be an interesting experiment.\n\nIf you ever start this, count me in ;)\n\nKev\n\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}