{"category": "spam", "to_address": "mathewkuruneri3@aim.com", "from_address": "mathewkuruneri3@aim.com", "subject": "Mr Mathew PEACEFUL AGREEMENT !! ", "body": "\n\n\n#28 Union Building\nArcadia Street\nPretoria\nEmail:mathewkuruneri00@aim.com\n \nDear Sir,\nI am Mr. Mathew Kuruneri, the son of Dr. Christopher Kuruneri, who until recently the Zimbabwean Minister for finance in the present Robert Mugabe’s government in Zimbabwe.\n \nFirst and foremost, I apologized using this medium  to reach you for a transaction / business of this magnitude, but this is due to confidentiality and prompt access reposed on this medium. In unfolding this proposal, I want to count on you, as a respected and honest person to handle this transaction with sincerity, trust and confidentiality. I have decided to seek a confidential co-operation with you in the execution of the transaction described hereunder for the benefit of all parties involved and hope you will keep it as a top secret because of the nature of this transaction.\n \nBecause of what is happening in the world today and to verify my predicaments as well as my sincerity, I would like you to visit the site below to read more about my father.\nhttp://www.news24.com/News24/Africa/Zimbabwe/0,,2-11-259_1518150,00.html\nhttp://www.zimbabwesituation.com/mar24a_2004.html#link2\n \nPrecisely, on The 24th of April 2004, the security goons of President Robert Mugabe in what was an excessive and unprecedented use of force arrested my father while still a Government Minister at our family house in Harare. He was arrested on the allegation that his building of a Thirty Million Rand (i.e. US$ 8 Million) beach front mansion in Llandudno, Cape Town, South Africa was in contravention of Zimbabwe’s regulation on Foreign exchange control. Though, my father has repeatedly made it clear that he did not in anyway contravene this regulation, maintaining, that he was funding the housing project from funds he made through his business ventures and consultancies work outside Zimbabwe prior to his becoming a minister, and that the funds were never held nor transferred from Zimbabwean banks, charges, are yet to be laid against him in a court of law. My father has been held in solitary confinement and under severe inhuman conditions in the gulag of Mugabe despite several efforts and calls for him to be charged before a competent court or be released.\n \nHowever, my family is undoubtedly aware of the underlying political intrigue and vendetta that is involved in this case than meets the eyes. It simply has to do with my fathers uncompromising stance against the oppressive polices and unwholesome activities of President Robert Mugabe, besides, my father’s recent rising popularity within the ruling ZANU-PF party, and around the country and his touting as a possible successor to President Robert Mugabe. My family was aware, that Mugabe was very uncomfortable with this situation and knew, that it was matter of time before he moved against him, but, unfortunately, lest did we anticipated it in this most bizarre and barbaric manner. Being aware of Robert Mugabe’s antecedents, to say, that my father and the entire family entertain great concern and apprehension about his life and that of the other members of our family, is to state the obvious. It is obvious from his actions; President Robert Mugabe is out to destroy the family politically, financially and otherwise.\n \nPresently, I have moved with the rest of my family into South Africa, where we have managed to gain asylum. However, the tactic support for President Mugabe from the present South African Government, coupled with the proximity of both countries makes our continued stay and hope for a future in South Africa most risky and uncomfortable. In the meantime, I have been mandated by my father, to explore avenues and make every necessary arrangements immediately to move our only left fund, since  others has been seized, out of this country and also make arrangements to resettle the rest  of my family in any of such country. At present, I am desperately seeking your assistance in helping me transfer the sum of Twenty million, five hundred thousand United States dollars (Us$20.5m)  being the total sum deposited with a security and finance company here in Johannesburg South Africa to your country for viable investment. \nUnfortunately, under the recent South African Financial intelligence center Act (FICA) and the Exchange Control Regulations as a refugee I am highly constrained from personally transferring this money out of South Africa. However, this could easily be effected with the representation / assistance by a nationals of a different country apart from nationals of the Southern African Development Countries, SADC, hence my writing.\n \nThe original document that shows the Deed of lodge, Proof of Deposit, and Depository Agreement between my late father and the Management of the Security Company are with my mother.\n \nI have the authority of my family to propose that should you be willing to assist us in this transaction your share of compensation will be US$5.125m (25%), while my family takes US$13.325m (65%) and the balance of US$2.5m (10%) for miscellaneous expenses that may be incurred by either party during the transfer.\n \nI want to let you know that this transaction is 100% risk free provided you treat it with utmost confidentiality because the Zimbabwean Government are bent on collecting all assets / properties belonging to my father. Please endeavor to contact me via my Email address as given above.\n \nFinally, I do hope of establishing a good relationship with you and your family after this transaction. I wait to hear from you.\n \nYours faithfully,\n \nMr. Mathew Kuruneri\n\n\n\n\nCheck Out the new free AIM(R) Mail -- 2 GB of storage and industry-leading spam and email virus protection.\n\n\n"}