{"category": "ham", "to_address": "debian-desktop@lists.debian.org", "from_address": "Sebastian Heinlein <sebi@glatzor.de>", "subject": "GNOME App Install", "body": "Dear desktopers,\n\nJulian Andres Klode, the ITP holder of gnome-app-install, wants to get\ngnome-app-install into Debian soon, since apt 0.7 finally landed in\nUnstable.\n\nBut there are still some open question that are worth a discussion. On\nof the main concepts of g-a-i is to make enabling additional and third\nparty repositories as easy as possible. But do we want this in Debian?\n\nFurthermore g-a-i allows to filter the list of shown packages. Ubuntu\nuses the following filters: all applications, Open Source applications\n(main + universe), supported applications (main + commercial), third\nparty applications (commercial) and installed applications. I added the\ncapability to gnome-app-install to show different filters for the\ncorresponding distribution.\n\nThe application data will be separated into three packages:\napp-install-data-debian-main, app-install-data-debian-contrib and\napp-install-data-non-free.\n\n1. The Ubuntu way: Shipping the data for all applications of main,\ncontrib and non-free by default, excluding the icons, using filters to\nselect the level of freedom and defaulting to only show applications of\nmain. The filters could be the following:\n\nall applications (main, contrib, non-free), only Free Debian\napplications (main), only installed applications\n\n(we don't need to promote third party applications and we do not support\nnon-free applications)\n\n2. The 'unfriendly' way: we could ship different app-data packages for\neach component (main + contrib + non-free) and only the main package by\ndefault and just use two filters:\n\nall applications, installed applications\n\nSo we would not make any use of the enabling of additional components,\nby default but would not promote non-free software too. The user would\nhave to install app-data-debian-contrib or app-data-debian-non-free to\ninstall the corresponding applications.\n\n\nWe use emblems and text messages in the application description to mark\npackages that are non-free or part of Debian in both cases.\n\nFinally there is still one open dependency: sexy-python. Since the ITP\nholder does not respond to mails it would be nice if anybody else could\nupload it.\n\nCheers,\n\nSebastian\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}