{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Genesearch <enews@genesearch.com.au>", "subject": "Special Prices Ending Soon", "body": "\nYou are receiving this email from Genesearch because you have purchased or expressed interest in our products. To ensure that you continue to receive emails from us, add enews@genesearch.com.au to your address book today. If you haven't done so already, click to confirm your interest in receiving email campaigns from us. You can choose whcih of our product categories you will receive information on. You may unsubscribe if you no longer wish to receive our emails.\n\n\n\n\n\n\n\n\n\n\n\n\nGenesearch eNewsSpecial Prices Expiring End of April\t\n\t\tApril 2007\n\n\n\n\n\n\n\n\n\nIn This Issue\n\n\ncDNA Kit\n\nqPCR Kit\n\nMutagenesis Kit\n\nQuick Blunting Kit\n\n\n\n\n\n\n\n\n\nQuick Links\n\n\n\nGenesearch\nFinnzymes\nNew England Biolabs\n\n\n\n\n\n\n\n\n\nDear zombie gyogi\n\n\n\n\nTime is running out on our introductory and special offers!Buy before the end of April 2007 and save 15%-30% on Finnzymes' DyNAmo cDNA Synthesis Kit, DyNAmo Flash SYBR Green qPCR Kit and Phusion Site Directed Mutagenesis Kit!And you can also save 15% when purchasing bundled Quick Blunting and Quick Ligation Kits from New England Biolabs.\n\t\t\n\n\n \n\nDyNAmo cDNA Synthesis Kit\n\n\nIntended for cDNA synthesis for two-step quantitative reverse transcription-PCR (qRT-PCR) where amplicons are usually around 100 bp in length, the DyNAmo cDNA Synthesis Kit from Finnzymes can be used in conjunction with our DyNAmo qPCR Kits or with any other qPCR kit suitable for the application.The kit includes all necessary reagents for cDNA synthesis for qPCR and works with total RNA, mRNA, viral RNA or in vitro transcripts. It includes both random primers and oligo(dT) primers and can also be used with your own gene-specific primers. It includes M-MuLV RNase H+ reverse transcriptase, which provides higher sensitivity than RNase H- reverse transcriptases.Advantages include broad dynamic range up to 1 ug RNA, reliable results with different RNA sources, flexible priming options, convenient short protocol, and optimised 2x mix for cDNA synthesis.Until April 30th 2007, save 15% on this kit:Prices before GST:F-470S: 20 reactions:  $137F-470L: 100 reactions: $575More information\n\n\n\n\n\n\n\n\n\n\n \n\nDyNAmo Flash SYBR Green qPCR Kit\n\n\n\nFinnzymes' novel DyNAmo™ Flash SYBR® Green qPCR Kit is developed for fast real-time qPCR. It provides qPCR results faster than other SYBR Green kits without compromising the qPCR performance.A DNA-binding domain attached to the polymerase in this kit improves the physical stability of the polymerase-DNA complex, thus enhancing the processivity and robustness of the amplification.The high amplification efficiency of DyNAmo Flash SYBR Green qPCR Kit gives reliable quantitation and early C(t) values. Due to the high signal intensity, DyNAmo Flash SYBR Green qPCR provides an excellent signal-to-noise ratio.AdvantagesqPCR results faster without compromising performanceReliable and robust amplificationHigh specificity and sensitivityHigh signal intensityUntil April 30th 2007, save 30% on this kit:Prices before GST:F-415S:         40 reactions:     $131F-415L:        200 reactions:     $479F-415L-10: 2,000 reactions:  $4,433More information\n\n\n\n \n\nPhusion Site-Directed Mutagenesis Kit\n\n\n\nIf you want a fast and reliable system for generating mutations, this is the kit you need.The Phusion™ Site-Directed Mutagenesis Kit is a versatile and efficient tool for introducing point mutations, insertions or deletions in any type of plasmid DNA.With this kit, the entire plasmid is amplified using phosphorylated primers that introduce the desired changes. The amplified, linear PCR product, containing the desired mutation, is circularized in a 5-minute ligation reaction with Quick T4 DNA Ligase. The resulting plasmid can be then transformed into any competent E. coli cells.AdvantagesRobust and reliable exponential amplification methodNo requirements such as special vectors, restriction sites or methylation status for the target plasmidNo need to destroy the starting template in a separate stepDue to the high fidelity of Phusion™ Hot Start DNA Polymerase unwanted secondary mutations are minimizedAmplification of large plasmids up to 10 kbThe hot start modification in the polymerase prevents the amplification of non-specific products and unwanted degradation of primers prior to first cycle of PCRQuick T4 DNA Ligase included in the kit; no purification steps before or after the ligationCompatible with all strains of competent E. coli cellsUntil April 30th 3007, save 15% on this kit:Prices before GST:F-541: 20 reactions (including 10 control reactions): $230More information\n\n\n\n \n\nQuick Blunting Kit\n\n\nThe Quick Blunting Kit from New England Biolabs is used to convert DNA with incompatible 5' or 3' overhangs to 5'-phosphorylated, blunt-ended DNA, for efficient blunt-end ligation into DNA cloning vectors.This kit contains the Blunting Enzyme Mix, an optimized formulation of two enzymes: T4 DNA Polymerase, which has both 3' - 5' exonuclease activity and 5' - 3' polymerase activity, and T4 Polynucleotide Kinase for phosphorylation of the 5' ends of the blunt-ended DNA. The Quick Blunting Kit  is optimized for blunting up to 5 µg of DNA in a single reaction.AdvantagesFast - Restriction enzyme-digested DNA is blunted in less than 30 minutes Flexible - Suitable for restriction enzyme-digested DNA, sheared or nebulized DNA or PCR product Convenient - Reactions are perfotemperature in a ready-to-use mixThe Quick Blunting Kit also comes bundled with the Quick Ligation Kit for fast ligation (5 minutes for cohesive or blunt ends) at room temperature - save 15%:Prices before GST:Quick Blunting Kit:E1201S:   20 reactions:    $134E1201L: 100 reactions:    $536Quick Blunting & Quick Ligation Kit Bundle:E0542S:   20 reactions:    $268\nE0542L: 100 reactions: $1,073More information\n\n\n\n\n\n\n\n\n\n\n\nGenesearch is the Australian distributor for New England Biolabs molecular biology reagents, Cell Signaling Technology antibodies for cell signaling research, Finnzymes for PCR reagents and instruments, Eurogentec synthetic oligonucleotides, and bioinformatics software from Gene Codes (Sequencher) and CLC bio.\nSincerely, \n\n\n\n\n\nLisa Saxby\n\t\tGenesearch\n\t\t\n\n\n\n\n\n\n\n\n\n\nForward email\n\n\n\n\nThis email was sent to ktwarwic@speedy.uwaterloo.ca, by enews@genesearch.com.au\nUpdate Profile/Email Address | Instant removal with SafeUnsubscribe™ | Privacy Policy.\n\n\nEmail Marketing by\n\n\n\nGenesearch | 14 Technology Dr | Arundel | 4214 | Australia\n\n\n\n\n"}