{"category": "spam", "to_address": "<IPLACEREPORTS@flax9.UWATERLOO.CA>", "from_address": "\"LouisNavellier@InvestorPlace.com\" <LouisNavellier@InvestorPlace.com>", "subject": "24 Red Hot Stocks Under 24 Bucks", "body": "\n\n24 Red Hot Stocks Under 24 Bucks\n\n\n\n\nWe love giving our InvestorPlace.com members benefits like access to this timely message.  \n In order to ensure you keep receiving special alerts and offers like this one, please take a moment to click on any of the links in this message to reconfirm that this is the email address where you want to receive emails from InvestorPlace.com   \n                 \n\n\n\n\n\n\n\n\n\n\n\n\nFellow colleague,\nThe average price of an S&P 500 stock today is over $70.\nObviously, building a portfolio of just 100 shares of 50 S&P stocks at $70 per share takes considerable resources! (If you’re into math: $350,000!)\nThat’s why one question I get asked a lot is: Louis do you EVER recommend CHEAPER stocks?\n\n\n\n\n\nLeft Behind\n\n\nIf\nthe Dow had kept up with the S&P Small-Cap Index over the last 8\nyears, the Dow would stand today, not at 13,000, but at 27,000! And\nlots of conservative investors would have twice the wealth! \nIt isn’t too late to catch up, as you’ll learn in this report. \n\n\n\n\nThe\nanswer is yes absolutely! Indeed, this is an especially good time to\nbuy lower-priced stocks. You see, as the blue chips rise, their\ncheaper, smaller brethren soar.\n\nIndeed,\nsince January, smaller-cap, lower-priced stocks are outpacing the Dow\nstocks by 50%. And for the last decade, lower priced stocks have out\nperformed the Dow by 7-to-1.\nWhy?\nSmaller lower priced stocks have been able to grow earnings at warp speed!\nUnencumbered\nby legacy concerns such as pension liabilities and a unionized labor\nforce, management can focus on responding to market demands.\nThat’s why the stocks I recommend in Emerging Growth have just posted 150% annual earnings growth on average this quarter!\nJust\ncompare that to the 9% average growth of the S&P 500 and you’ll see\nwhy the smaller, lower-priced guys are zooming ahead!\nI recommend a portfolio of lower priced (not low-priced, as I’ll explain in a moment) stocks today especially because:\n\nthe Fed is likely to cut rates this year, igniting a big boom in smaller stocks generally\nmerger mania is sweeping the market, and smaller companies are being snapped up at big premiums\nAnd\nthe digitization of the exchanges has shrunk the bid/ask spread to a\npoint where lower-priced stocks are hyper-responsive to buying pressure.\n\nThe Case AGAINST\n\t\t\t\t\t\t\t\t\t\t\tThese Stocks\n\n\n\n\nEmerging Growth\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBAGS DOUBLERS,\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTRIPLERS AND QUADRUPLERS\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tUNDER $24\nJust in the past year, our system has correctly identified these low-priced winners:\n\n\nCompany\nStock Price\nSold for\n\n\nXTO Energy\n$11.25\n287.29% PROFIT\n\n\nEnterra Energy\n$5.56\n273.56% PROFIT\n\n\nNoble Energy\n$13.60\n160.74% PROFIT\n\n\nUrban Outfitters\n$10.48\n158.71% PROFIT\n\n\nTesoro Corp\n$23.32\n150.30% PROFIT\n\n\nSun Hydraulic\n$9.71\n130.07% PROFIT\n\n\nAutodesk Inc\n$17.93\n103.74% PROFIT\n\n\nFrontline\n$21.20\n96.23% PROFIT\n\n\n\n\n\n\nYou are already familiar with my research, so you know: I hate uncontrollable risk. And stocks under $5 or $10, listed on the Pink Sheets or the Vancouver Exchanges, are my definition of out-of-control risk!\nMost of the time, I’d rather juggle chainsaws at a baby shower.\nLet me show you the four keys to success with lower priced stocks.\nKEY #1: Nothing under $4, nothing over $24. Stocks under $4 are hockey pucks for the traders and we’re not traders here at Emerging Growth.\nOver $24 and these companies are just a little beyond the inflection\npoint in their growth. But in between, you’ve probably found a company\nthat’s out of the garage—but still under the radar.\n\nThink: Dell at $11 in September, 1990, which is when Emerging Growth subscribers snapped it up. Then think about the $22,000,000 that a $100,000 grub stake in Dell would have become. Got the idea? Ok, let’s look at…\n\nKEY #2. Extremely strong sales growth.\nNothing less than 50% will do here—and 100% is better. Why? This rate\nof sales growth signifies market acceptance. By their nature, these are\ninnovative companies, but we don’t want the RISKS of innovation\n(especially the waiting!).\n\nExample:\nApple spent $500 million on the ill-fated Newton PDA before it was\npulled off the shelves. That made Apple a dangerously expensive stock\nat $9, which is where it languished for most of the decade before the\niPod era.\nBut when the iPod sales kicked in, we bought—and rode the stock up to $85.\n\nKEY #3. Exploding margins. The stocks I’ve uncovered in Emerging Growth\nare currently improving operating margin at a 200% clip—or close. This\nmeans that the strong sales are not being bought at too high a price.\n\nExample:\nWe were impressed with Hansen Natural soft drinks business when it was\na $4 stock, posting sales that were doubling. But the clincher was the\nrate at which Hansen was growing its margins in 2004-—Emerging Growth subscribers have multiplied their money 10 TIMES since then.\n\nKEY #4. The Holy Grail: earnings growth. Expanding operating earnings generally lead to earnings growth going at warp-speed.\nA\ngood clue here is to track how analysts are revising their consumers\nearnings estimates. The more they do this, and the bigger their\nadjustments, the more you can be certain that the stock will pop on\nearnings surprise at the end of the quarter—and hand you windfall\nprofits.\n\nExample:\nHolly, the refinery, was a $12 stock with 105% sales growth and profit\nmargins doubling when we bought it. Analysts were so befuddled, they\ncouldn’t revise their earnings growth numbers fast enough. That’s when\nwe knew we had to step in. The stock’s up over 400% since.\n\nThese are our 4 keys to success with lower-priced stocks.\nWhen you join us here at Emerging Growth I will send you a just-completed report on the lower-priced stocks that are now ready for their big run. The report is called 24 Lower-Priced Doublers for 2007. And what’s more—it’s FREE. Just click the button here:\nLet me tell you about a few of these gems right now (complete details in your report, of course):\nInvest With\n\t\t\t\t\t\t\t\t\t\t\tThe Masters\nPentagon\ncode-breaker and math wizard Jim Simons earned $1.7 billion last year\nin fees. That works out at about $680,000 an hour.\n\n\n\n\nHow Are We Doing?\nHow have Emerging Growth subscribers done recently in lower-priced stocks?\n\n\nHansen Natural\nWAS \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t$3.29\nIS UP\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t1,095%\n\n\nHolly Corp\nWAS\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t $11.90\nIS UP\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t 430%\n\n\nAmerica Movil\nWAS\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t $11.77\nIS UP\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t 366%\n\n\nNutriSystem\nWAS\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t $20.12\nIS UP\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t 217%\n\n\nBolt Technology\nWAS\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t $14.14\nIS UP\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t 203%\n\n\nU.S. Global\nWAS\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t $11.73\nIS UP\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t 138%\n\n\nGuess Inc.\nWAS\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t $18.43\nIS UP\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t 116%\n\n\nAcergy\nWAS\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t $11.66\nIS UP \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t85%\n\n\nGiga Media\nWAS \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t$8.21\nIS UP\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t 77%\n\n\nSimulations Plus\nWAS \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t$6.14\nIS UP\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t 62%\n\n\nThis\nlist is taken from our current buy list. If I listed all the Under-$24\nstocks we’ve made at least a double in, using these same 4 simple criteria,\nit could take up the next 3 pages—and exhaust your patience. Take it\nfrom me: Emerging Growth became the #1 advisory for 20 years on stocks\nunder $24 that matched my 4 exclusive keys.\n\n\n\n\nWant to know how he did it?\nHis hedge fund locked up an 84% gain in 2006.\nWhich makes you wonder: What’s Jim buying now?\nAnswer: A lot of one tiny company stock that Emerging Growth subscribers were snapping up before him, at around $12. (It’s still at $14.)\nWhat is attracting the attention of a super-quant, crypto-analyst genius?\nFat\nIn particular, the fat on your hips and especially the fat on your stomach, where it is most liable to cause a heart attack.\nA\ntiny company (144 employees) in St. Paul, Minnesota has made a\nbreakthrough in diagnosing and managing heart attack risks. The\ndiagnostic piece of the business opens a big opportunity, but it is the\nrisk-management piece that is genuinely thrilling.\nIt’s\nno secret that heart problems are linked to weight, but until now no\none has been able to really help ordinary people get the weight off—and\nkeep it off.\nThis is a quest that has ALREADY made scores of Emerging Growth\nsubscribers, all over the country, very rich. You see, NutriSystem,\nwhich delivers every meal to your home, is a fantastic idea. The stock\nwas $20 when we bought it and it just flew through our filters. Emerging Growth subscribers are up 217% in short order in NutriSystem.\nBut this new weight-loss system should do even better—because the solution is based on personalized feedback as you go through your exercise routine.\nHow Does It\n\t\t\t\t\t\t\t\t\t\t\tWork?\nThree\nweeks ago and, I’d guess, with Jim Simons’ billions, this tiny\ndiagnostics company hooked up with Garmin, the GPS people. Now Garmin\nis a company that is likely to do for GPS what Apple did for MP3s, make\nno mistake.\nGarmin\nhas a fitness device for a niche group of running enthusiasts, but by\nhooking it up to our company’s metabolic training program, it gives you\nvoice-guided instructions to encourage you through a personalized\nroutine.\nWell, even I’d give THAT a try (and I’m allergic to exercise!).\nAnd when it hits the market, I bet millions of people will say the same!\nLet’s Look At\n\t\t\t\t\t\t\t\t\t\t\tThe Numbers\n\n\nSales growth: 53%\nEarnings growth: 550% in the past 4 quarters\nOperating margins: tripled\nSelling at: 19 times forecasted earnings\nPEG Ratio: a microscopic 0.04\nPotential: $25 in 6 – 9 months—a double\n\n You don’t have to be a math genius like Jim Simons to figure—this is a screaming buy.\n Details in your FREE report.\n Want More?\n In your FREE report, 24 Lower-Priced Doublers for 2007, I also give you the skinny on:\n\nthe seismic surveyor that specializes in “gentle” exploration in\nenvironmentally sensitive areas. Sales growth: up 135%. Earnings\ngrowth: up 900%, thanks to rapidly expanding operating margins.\nAnalysts are scrambling to revise estimates higher, so look for a big\nsurprise when earnings are released. This is a $9 stock, with a\nPrice-to-Earning ratio of 9, packing a 900% earnings growth. They just\ndon’t make a lot of these!\n\nThe laboratory that cuts down on one of the leading causes of death—the\nmedicines themselves. Over 120,000 deaths a year are the result of\ndrugs’ unique effect on women, children and the elderly. Now this lab\nhas a way of predicting the effect on different patient-groups. Sales\ngrowth: up 78%. Earnings growth: up 140%. Snap it up under $11 if you\ncan (be careful—follow instructions so you don’t chase it away!). The\nstock’s up over 400% since September, but earnings growth has kept pace\nsufficiently to make this STILL a bargain.\n\n \n\n\n\n\n\n“Just think: you could command a portfolio of doublers like this—for under $5,000!”\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t—Louis Navellier\n\n\n\nThis pocket rocket develops hacker-proof security systems for big clients. It only has 184 employees and most of the stock is locked up in institutional portfolios but this is the best\ncompany in a fantastic growth area. Sales growth: 93%. Earnings growth:\nmore than quadrupled—up 333%. Analysts were embarrassingly wide of the\nmark. Amazingly, this is still a $22 stock—but it’s on its way to being\n$40 this year.\n\n I Know Where Of\n\t\t\t\t\t\t\t\t\t\t\tI Speak\n\n\n\n\nLOOK AT THIS!\nEmerging Growth is where you would have made\n\n\n786% in 18 months in 4 Kids Entertainment\n\n\n1,579% in 14 months in Optical Coating\n\n\n794% in 21 months in Best Buy\n\n\n1,704% in 45 months in Environdyne\n\n\n820% in 24 months in LA Gear\n\n\n1,229% in 15 months in CMGI\n\n\n963% in 15 months in Go2Net\n\n\nand scores more, all up over 500%\n\n\n\n\n\n\nThe\n24 stocks under $24 I recommend in your report all have a similar\npotential to Hansen Natural, which we bought—STOLE, I should say—at\n$3.29. That one could have made you 8,000% richer.\nJust ask my Emerging Growth subscribers.\n And while you’re at it ask them, please, about Iris International (up 3,248%) and Amedysis (up 3,181%).\n Ask them about Chico’s FAS (up 2,367%), Quality Systems (up 2,142%) and Holly (up 1,752%).\n And\ndon’t forget to ask my Emerging Growth subscribers about NutriSystem\n(bought at $20.12), which is, as we speak, a TRIPLE for us.\n As\nyou can see, lower priced stocks give you easy access to big gains.\nGains that could amount to 42,000%—which is what our Buy List has\nachieved over the last 27 years!\n Join us at Emerging Growth now and receive, FREE, 24 Lower Priced Doublers for 2007.\nToday, investors want more. They’re finding it in low-priced stocks. The best ones are in Emerging Growth.\n \nLouis Navellier, Editor\nEmerging Growth\n“#1 for 20 years, 1985 - 2005”\n P.S.\nIT’S A SECRET. I don’t know of ANY analyst on Wall Street who’s figured\nout that quant genius Jim Simons and his billions are behind our weight\nmanagement stock. It’s a stunning move—and it makes this $14 stock\nworth double, overnight.\n\t\t\t\t\t\t\t\t\t\t\tP.P.S. YOURS TODAY ONLY. You get 24 Lower-Priced Doublers for 2007 FREE when you join us today. This offer is available TODAY. Just click on the button here.\n \n \n\n\n\n\n\n\n\n---------------------------------------------------------\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you.\n\t\t\t\t    Please tell us if your email has changed by visiting here:\nhttp://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice from\n\t\t\t\t    InvestorPlace advisors, you can let us know by visiting\nhttp://www.investorplace.com/u/?p=8BP291-1&e=IPLACEREPORTS@SPEEDY.UWATERLOO.CA\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,\n\t\t\t\t    2420A Gehman Lane\n\t\t\t\t    Lancaster, PA 17602\nCopyright (c) 2007 ACP Phillips Investment Resources, LLC.\n\t\t\t\t    All rights reserved.\n05/30/2007 2:57PM\n--------------------------------------------------------------------\n\t\t\t\t    Thank you for subscribing to InvestorPlace.com. Please note that \n\t\t\t\t    we cannot be liable for any missed bulletins caused by overzealous \n\t\t\t\t    spam filters. To ensure that you continue to receive this valuable \n\t\t\t\t    part of your service please take a moment to add (LouisNavellier@NavellierEmerging.com)\n\t\t\t\t    to your address book. Click here for instructions: \nhttp://www.investorplace.com/whitelist.php?eml=LouisNavellier@NavellierEmerging.com \n\t\t\t\t    --------------------------------------------------------------------\n\t\t\t    ee==8BP291\n\n\n\n\n\n"}