{"category": "ham", "to_address": "Bert Gunter <gunter.berton@gene.com>", "from_address": "Spielas Grove <dgrove@scharp.org>", "subject": "Re: [R] fitting mixed models to censored data?", "body": "Hi Bert,\n\nYes, I am always wary when one software offers something that\nother do not.\n\nThe censoring I'm faced with (at present) isn't as complicated\nas with much 'survival' data.  I'm trying to analyze assay data\nand have a lower limit of detection (LLD) to contend with. \nOnce the level of the analyte gets low enough it can't be \naccurately quantitated, hence all that is reported is that \nthe level is less than some value (the LLD).\n\nSo I'm not worried about all the complex assumptions that go along\nwith censoring in clinical trials, etc.\n\nThanks,\nSpie\n\n\nOn Mon, 23 Apr 2007, Bert Gunter wrote:\n\n> Spielas:\n>\n> AFAIK, this is subject area of active current research. Diggle, Heagerty,\n> Liang, and Zeger , 2002, (ANALYSIS OF LONGITUDINAL DATA) say on p.316: \"An\n> emerging consensus is that analysis of data with potentially informative\n> dropouts necessarily involves assumptions which are difficult, or even\n> impossible, to check from the observed data.\"  This was ca 1994, I believe,\n> so I don't know whether this view is still held among experts (which I am\n> not). But if it is, you may do well to be careful of whatever SAS does even\n> if you do have to go running off to it.\n>\n> Cheers,\n>\n> Bert Gunter\n> Genentech Nonclinical Statistics\n>\n>\n> -----Original Message-----\n> From: r-help-bounces@stat.math.ethz.ch\n> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Spielas Grove\n> Sent: Monday, April 23, 2007 10:58 AM\n> To: r-help@stat.math.ethz.ch\n> Subject: [R] fitting mixed models to censored data?\n>\n> Hi,\n>\n> I'm trying to figure out if there are any packages allowing\n> one to fit mixed models (or non-linear mixed models) to data\n> that includes censoring.\n>\n> I've done some searching already on CRAN and through the mailing\n> list archives, but haven't discovered anything.  Since I may well\n> have done a poor job searching I thought I'd ask here prior to\n> giving up.\n>\n> I understand that SAS's proc nlmixed can accomodate censoring\n> (though proc mixed apparently can't), so if I can't find\n> something available in R, I'll have to break down and use\n> that.  Please, save me from having to use SAS!\n>\n> Thanks much,\n> Spie\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}