{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "James ARKINSTALL <James.ARKINSTALL@paris.msf.org>", "subject": "[Ip-health] Economist: Drugs firms are rethinking their business model", "body": "\nhttp://www.economist.com/business/displaystory.cfm?story_id=9409230\n\nBeyond the blockbuster\nDrugs firms are rethinking their business model\n\n\nLIPITOR is a drugs company's dream. The cholesterol pill made by Pfizer, an\nAmerican pharmaceuticals giant, is the world's best-selling drug. Last year\nit earned over $13 billion in revenues. Other hugely successful drugs\ninclude GlaxoSmithKline's Advair, an asthma remedy, and Plavix, a blood\nthinner, which is sold by Bristol-Myers Squibb and Sanofi-Aventis. Both\nenjoy billions of dollars in annual sales. Despite such rewards, however,\npharmaceutical companies are reconsidering their pursuit of blockbuster\ndrugs, as new technology permits the creation of niche remedies that target\nrare ailments or sub-populations of people suffering from common diseases.\n\nThat explains the $3 billion hostile takeover bid announced this week by\nRoche, a Swiss pharmaceutical firm, for Ventana Medical Systems, an\nAmerican diagnostics firm. This year, Roche has gobbled up several\ndiagnostics and genetic-testing firms making technologies that enhance the\nvalue of its targeted cancer therapies. The firm recently completed a $155m\ntakeover of 454 Life Sciences, which makes gene-sequencing technology and\nlast week spent some $273m on NimbleGen, which makes technologies used in\nidentifying the genetic causes of disease.\n\nRoche is being drawn away from conventional one-size-fits-all drugs partly\nby the allure of the lucrative new markets being created by the development\nof \\u201cpersonalised medicine\\u201d. But drugs giants are also victims of their own\nsuccess. Blockbusters like Lipitor are already so effective, argues Tom\nNagle of Monitor, a management consultancy, that it is difficult to come up\nwith alternatives that are good enough to command a higher price.\n\nWorse, many blockbusters are going off patent soon and pharmaceutical\ngiants are finding it increasingly difficult to come up with new drugs to\nreplace them\\u2014despite throwing pots of money at the problem (see chart).\nMakers of generic drugs are also growing more assertive in attacking\npatents. As a result of all this, reckons IMS, an industry consultancy, the\nindustry saw a record $18 billion in branded sales collapse in 2006.\n\nThere are signs that long-term investors are growing concerned. A coalition\nof institutional investors representing over $1.1 trillion in assets,\nissued a report this month demanding a \\u201crethink of core business\nassumptions\\u201d. Martin Eijgenhuijsen of ABP, a Dutch pension fund that is\npart of the coalition, says, \\u201cWe have serious doubts that the current\nbusiness model can deliver targeted drugs. This requires radical change.\\u201d\n\nSo is the industry ready to follow Roche's lead toward specialty products,\ntargeted therapies and the like? The answer seems to be yes. Ray Hill of\nIMS calculates that although the vast mainstream market for chronic\ndiseases like high blood pressure or diabetes is still important, specialty\ndrugs accounted for nearly two thirds of total revenue growth last year, up\nfrom just a third in 2000. And only a quarter of drugs launched last year\ntackled chronic diseases, suggesting the pipeline is shifting toward\ntargeted therapies.\n\nFor that trend, thank both technology and regulation. Anthony Farino of the\nconsultancy arm of PricewaterhouseCoopers argues that such technologies as\nhigh-throughput sequencing, genomics and personal phenotyping, which were\nnot available five years ago, are now transforming how drugs are discovered\nand tested. Ron Krall, GSK's chief medical officer, thinks the trick is\nidentifying which patients will benefit most from new treatments\\u2014or,\nequally usefully, which ones will have adverse reactions. To determine\nthat, his firm has just opened a new facility in London run jointly with\nImperial College and Hammersmith Hospital, where experimental drugs are\ntested. The \\u201cmicro-doses\\u201d they administer to patients are analysed in real\ntime by molecular scanners.\n\nRegulators could play a decisive role in the large drugs companies'\nshifting strategies. The risk-averse stance they have taken since safety\nproblems led Merck to recall its painkiller, Vioxx, may help propel the\nindustry more rapidly away from blockbusters. Viren Mehta, an industry\nexpert, speculates that although new drugs will always carry unknown risks,\nthe regulatory burden might prove lighter for those aimed at specific,\nacute conditions (as opposed to ongoing maladies like diabetes). After all,\nhe says, \\u201cFewer people are at risk for a shorter time.\\u201d\n\nAnother regulatory boost may come from cost-benefit analysis that considers\nthe long-term benefits, and not just the high price tags, of innovative new\ndrugs. Britain's National Institute for Health and Clinical Excellence\n(NICE) has approved Herceptin, a targeted cancer drug, despite an annual\ncost per patient of nearly $50,000 because, in the words of Sir Michael\nRawlins, NICE's chairman, \\u201cit provides long-term value\\u201d. NICE has also\nagreed to buy a cancer treatment made by Johnson & Johnson that has little\neffect on a third of patients, on the condition that it pay only when the\ndrug works. And with an expensive Alzheimer's drug, the agency ruled that\nit would not pay for patients with the mildest form of dementia to take\nit\\u2014a ruling that was challenged in a London court this week.\n\nSuch lawsuits are a sign that the transition to a new way of doing business\ncarries risks. But as Graham Higson, head of regulatory affairs at\nAstraZeneca, a British drugs firm, notes: \\u201cThere's no such thing as no\nrisk. The industry simply cannot continue developing drugs exactly the same\nway it has for 40 years.\\u201d\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}