{"category": "ham", "to_address": "marc_schwartz@comcast.net", "from_address": "John Kane <jrkrideau@yahoo.ca>", "subject": "Re: [R] sas.get problem", "body": "\n--- Marc Schwartz  wrote:\n\n> On Wed, 2007-04-11 at 14:38 -0400, John Kane wrote:\n> > --- Cody_Hamilton@Edwards.com wrote:\n> > \n> > > \n> > > John,\n> > > \n> > > Do you not have sas on your machine? (That would\n> > > definitely keep sas.get\n> > > from executing.)\n> > > \n> > > Regards,\n> > >    -Cody\n> > \n> > No I don't have SAS on my machine. Nobody in my\n> group\n> > uses it and we seldom use SPSS. I think one person\n> has\n> > STATA. Most of the work is more policy than data\n> work\n> > and the occasional spreadsheet (shudder) does for\n> > basic work. \n> > \n> > I am too cheap to have us spend a huge amount\n> (well,\n> > large amount anyway) for something that  I am\n> likely\n> > to use for 5-10 minutes a year. The last time I\n> wanted\n> > a SPSS file exported to \"delimited\" I just asked\n> > someone in another department whom I knew has it\n> on\n> > his labtop to do it. \n> > \n> > I just hike across campus to the nearest lab with\n> SAS,\n> > SPSS etc installed. Done occasionally and in\n> decent\n> > weather it is not a problem. Today it is turning\n> into\n> > a marathon but I need to lose some weight.\n> \n> \n> \n> John, I believe that this has been mentioned on the\n> list previously, but\n> if you don't have convenient access to SAS, they do\n> offer a free\n> download called the SAS System Viewer. It can read\n> the proprietary SAS\n> datasets and then enable you to save them as ASCII\n> delimited files.\n\nThanks Marc. \n\nI had seen a reference to that and lost it.  I'll get\na copy. However the major purpose of using sas.get\nis/was to keep the value labels and variable labels.  \n\nFor the number of times in a year that I need SAS ,\nthe 5 minute walk to the nearest lab with SAS etc is\nnot a problem. \n\nAt the moment I will probably have to resort to the \nSAS > SPSS > R route. A pain but not that bad. At the\nmoment I am finding it easier to import the SAS file\ninto SPSS than to load it in SAS.  \n\n  \n\n> \n> It is available at the SAS web site here:\n> \n>\nhttp://www.sas.com/apps/demosdownloads/sassystemviewer_PROD_9.1.3_sysdep.jsp?packageID=000313\n> \n> There is also DBMS/Copy, which is by DataFlux (now a\n> SAS subsidiary).\n> More information is here:\n> \n> http://www.dataflux.com/Technology/Products/DBMS/\n> \n> HTH,\n> \n> Marc Schwartz\n> \n> \n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}