{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Glenn Ervin\" <GlennErvin@cableone.net>", "subject": "Re: Software speech opinions", "body": "It is a free country, and in the name of good capitalism, people have the \nright to create anything legal and sell it.\nIt is just a shame that the poorest group of individuals have to be kept \ndown by having to pay 5 to 10 times for a product that the sighted  have \naccess to.\nWe are an \"easy target\" for a developer out there, and they pat themselves \non the back telling themselves that they have done such a good thing, by \ncreating a product that allows us access, and indeed, they may not be making \nany more than if they had created a slightly popular product for the \nsighted, but they could contribute more to society by contributing in an \nopen-source environment, and not try to see themselves as altruistic, or \notherwise great slayers to the so called plight of the Blind.\nGlenn\n\n----- Original Message ----- \nFrom: \"Shane\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Monday, June 25, 2007 11:24 PM\nSubject: Re: Software speech opinions\n\n\nOn Mon, Jun 25, 2007 at 10:15:58PM -0500, Glenn Ervin wrote:\n> I don't like to see profit made on the backs of the disabled.\n> I believe in capitalism, I would have to, as I have a Bachelor's degree in\n> Business management, but profit should be made on things like lawn mowers,\n> not on products which allow the disabled to use off-the-shelf products.\n> Indeed, greed is at play here, and I look forward to the future of\n> \"Open-Source\".\n\nI really don't have a problem paying for software I use be\nit to make otherwise usable software accessible or simply\nto get a job done.  As far as I'm concerned, the makers of\naccess tech can charge any amount they'd like.  If it's too\nexpensive, people will either not use it or more likely\ndevelope their own solutions which doesn't hurt opensource\nin the slightest.\n\nNot trying to justify closed source software at all as the\nkey advantage of open source for me anyway isn't its free\nof charge nature but rather for the ability to modify it to\nsuit my needs.\n\nFor those who think prices are inflated by the greedy\ncorporation, if that were the case and so much profit was\nbeing made in the area, why haven't other firms entered the\nmarket, driving prices down as a result?\n\nS\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}