{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"CNN Political Ticker\" <politicalticker@cnn.com>", "subject": "The CNN Political Ticker PM, Tuesday, May 15, 2007", "body": "\n\n\nCNN.com - CNN Political Ticker\n\n\n\n\n\n\n\n\n\n\nFor the latest, breaking political news, check for updates\nthroughout the day on the CNN Political Ticker\nhttp://www.cnn.com/ticker All politics, all the\ntime.\n\nThe Ticker's got the GOP debate\ncovered\n\nTen Republican presidential\ncandidates -- Sam Brownback, Jim Gilmore, Rudy Giuliani, Mike\nHuckabee, Duncan Hunter, John McCain, Mitt Romney, Ron Paul,\nTom Tancredo and Tommy Thompson -- debate in Columbia, South\nCarolina at 9 p.m. ET tonight.\n\nCNN's Political Ticker\nis the place for constant real-time updates, campaign spin,\nreaction and expert analysis as the GOP candidates square off.\n\nToday on the Ticker\n\nRev. Jerry Falwell dies at age 73\n\nWASHINGTON (CNN) -- The Rev. Jerry Falwell, the television\nminister whose 1979 founding of the Moral Majority galvanized\nAmerican religious conservatives into a political force, died\nTuesday at age 73.\n\nFull story:\nhttp://www.cnn.com/2007/US/05/15/jerry.falwell/index.html<\n/url>\n\n***\n\nFormer deputy attorney\ngeneral: I contemplated resigning\n\nWASHINGTON\n(CNN) -- In dramatic detail former Deputy Attorney General\nJames Comey disclosed new information Tuesday concerning\nattempts by the White House in 2004 to get Justice Department\napproval for the National Security Agency's domestic\nsurveillance program and disclosed he had considered resigning\nafter disagreements about it.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/former-deputy-attorney-general-i.html\n\n***\n\nGonzales sends mixed signals on role of his\ndeparting deputy\n\nWASHINGTON (CNN) -- Attorney\nGeneral Alberto Gonzales Tuesday repeatedly placed his outgoing\ndeputy Paul McNulty near the center of the controversy over the\nfired U.S. attorneys, saying he relied heavily on his approval.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/gonzales-sends-mixed-signals-on-role-of.html\n\n***\n\nGonzales heckled during speech\n\nWASHINGTON (CNN) -- Attorney General Alberto Gonzales was\ninterrupted by a heckler Tuesday morning while giving a speech\nat the National Press Club on how to make communities safer\nfrom violent crimes.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/gonzales-heckled-during-speech.html\n\n***\n\nThompson and Moore mix it up online\n\nWASHINGTON (CNN) -- Former Tennessee Sen. Fred Thompson and\nfilmmaker Michael Moore are going at it online over Moore's\nrecent trip to Cuba for his health-care documentary \"Sicko.\"\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/thompson-and-moore-mix-it-up-online.html\n\n***\n\nCongressman fights to protect legislative\nmaterial from search warrant\n\nWASHINGTON (CNN)\n-- Government attorneys say members of Congress should not be\n\"given keys to the evidence locker\" when investigators search\ntheir offices for criminal wrongdoing. But a lawyer defending a\nLouisiana congressman argues there's a Constitutional \"sphere\nof protection\" against interference by the executive branch.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/congressman-fights-to-protect.html\n\n***\n\nSenate Dems seeking White House face tough\nvote\n\nWASHINGTON (CNN) -- As the Senate\nprepares to vote on a measure that would cut off funding in\nIraq, a fascinating 2008 political subplot is emerging.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/senate-dems-seeking-white-house-face.html\n\n***\n\n'Make or break' session Tuesday on immigration\nreform bill, senator says\n\nWASHINGTON (CNN) --\nA bipartisan group of senators and administration officials,\nracing to meet a Wednesday deadline to agree to comprehensive\nimmigration reform bill, will meet Tuesday afternoon in what\nSen. Trent Lott, R-Mississippi, called a \"make or break\"\nsession to see if they can reach a deal.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/make-or-break-session-tuesday-on.html\n\n***\n\nGiuliani makes personal apology to 'poor\nfarmers'\n\nDES MOINES, Iowa (AP) -- The\nVonSpreckens are back on the Giuliani bandwagon.\n\nThe\nVonSpreckens, self-described poor farmers from the tiny eastern\nIowa community of Olin, became big critics of presidential\ncandidate Rudy Giuliani after his campaign snubbed them because\nthey weren't millionaires.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/giuliani-makes-personal-apology-to-poor.html\n\n***\n\nHotel heirs divided over Clinton and\nObama\n\nWASHINGTON (CNN) -- As Sen. Hillary\nClinton, D-New York, and Sen. Barack Obama, D-Illinois,\ncontinue to battle it out for money and support in the Windy\nCity, a prominent billionaire Chicago family has split between\nthe two campaigns.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/hotel-heirs-divided-over-clinton-and.html\n\n***\n\nDodd launches ad attacking challengers on\nIraq\n\nWASHINGTON (CNN) -- Connecticut Sen.\nChris Dodd launched his first campaign ad Tuesday, sharply\ncriticizing the other Democratic presidential candidates for\nnot supporting a bill that would require all troops to redeploy\nfrom Iraq by March 31, 2008.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/dodd-launches-ad-attacking-challengers.html\n\n\n\n\n\n\n\nFor the latest breaking political news click here.\nBookmark the CNN Political Ticker here.\nFor news tips, political nuggets, feedback and suggestions, please drop us a line at politicalticker@cnn.com\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the CNN Political Ticker list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=morninggrind\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}