{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Meredith Keenan\" <nexcapitalcrossingswod@capitalcrossings.com>", "subject": "Melt away fat easily", "body": "\nSay goodbye to extra pounds\n\n\n\n\n\n\nAnatrim – The latest and most delighting product for over-weight people is now readily available – As told on BBC.\n\n\nDo you count up all the situations when you plead to yourself to do any thing for being rescued from this desperately growing pounds of fat? Fortunately, now no big price is to be paid. Thanks to Anatrim, the ground-breaking pound-melting medley, you can get naturally health life style and become really slimmer. Have a look at what people write!\n\n\n\n\"I hate to admit it but I was extremely addicted to food. \n\n\nI greedily ate all this garbige \n\n\nand was unable to stop. \n\n\n\n\nThis suffering left off when I started course of taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my inclination to eat constantly abated, \n\n\nspirits improved and I turned to the happiest person in the world 18 pounds in 2.8 months. \n\n\n\n\nI can tell you now I turned to the happiest person on the planet!\"\n\n\n\n\n\nAmelia B., Las Vegas\n\n\n\n\n\n\"Since my early childhood I was a weighty boy. \n\n\nIt’s pretty hard to imagine how I abhorred being ridiculed at school. \n\n\n\n\nI abhorred the weight and I abhorred even myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nThis stuff literally took me out of this fearful nightmare! Lots of thanks to you, fellows.\"\n\n\n\n\n\nMikkey Fox, Bellevue WA\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was saved! I got into the circle, depression – more eating – even more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOnce my friend showed me web page and I ordered up Anatrim at the same time. \n\n\nThe result was excellent, my appetite came to acceptable level, I was in a good mood oftener, and, of course, I went some belt holes back. And you know, the sex became fantastic also!\"\n\n\n\n\n\nFrancis\n\n\n\n\n There are lots of gratitudes left by delighted people trying Anatrim. Don’t you gonna join the tens of thousands of slim clients and try this all-natural appetite-suppressing power lifting product now!\n\n\nDo not decline the chance!\n\n\n\n\n"}