{"category": "ham", "to_address": "<efg@stowers-institute.org>, <r-help@stat.math.ethz.ch>", "from_address": "<ngottlieb@marinercapital.com>", "subject": "Re: [R] Read Windows-like .INI files into R data structure?", "body": "Earl:\n\n.Ini files are, for lack of a better description, ancient.\n\nThere are old windows functions such as GetProfileString.\nHowever you will have to make reference to load these from the windows\nKernel.dll.\nProbably not worth the effort to code really old things as .ini files.\n\n>From what I see of packages, better to change these files to XML format\nsee if the XML package on CRAN will solve your requirement.\n\nThe section names would be top nodes with\nXML tags containing the data at the sub level. XML is really\nThe best way to go; get away from .ini files.\n\nLook at the XML package, reading nodes, parsing DOM.\n\nNeil \n\n-----Original Message-----\nFrom: r-help-bounces@stat.math.ethz.ch\n[mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Earl F. Glynn\nSent: Tuesday, June 12, 2007 12:48 PM\nTo: r-help@stat.math.ethz.ch\nSubject: [R] Read Windows-like .INI files into R data structure?\n\nI need to process some datasets where the configuration information was\nstored in .INI-like files, i.e., text files with sections like this:\n\n[Section1]\nvar1=value1\nvar2=value2\n[Section2]\nA=value3\nB=value4\n\n...\n\n>From Google and other searches I haven't found any package, or function\nwithin a package, that reads .INI files into an R list, or other data\nstructure.\n\n\n\nAny suggestions, or do I need to write my own?\n\nefg\n\nEarl F. Glynn\nStowers Institute for Medical Research\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide\nhttp://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n--------------------------------------------------------\n\n \n \nThis information is being sent at the recipient's request or with their specific understanding. The recipient acknowledges that by sending this information via electronic means, there is no absolute assurance that the information will be free from third party access, use, or further dissemination. This e-mail contains information that is privileged and/or confidential and may be subject to legal restrictions and penalties regarding its unauthorized disclosure or other use. You are prohibited from copying, distributing or otherwise using this information if you are not the intended recipient. Past performance is not necessarily indicative of future results. This is not an offer of or the solicitation for any security which will be made only by private placement memorandum that may be obtained from the applicable hedge fund. If you have received this e-mail in error, please notify us immediately by return e-mail and delete this e-mail and all attachments from your system. Than!\n k You.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}