{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Frieda Robles\" <menedallaspef@edallas.org>", "subject": "Watch the pounds disappear", "body": "\nA simple and safe way to weigh less\n\n\n\n\n\nAnatrim – The up-to-the-moment and most exciting product for corpulent people is now readily available – As you could see on ABC\n\n\n\nDid you realize that excessive body kilograms kill a plenty of people around the planet? We believe that you hate the ugly look of people like those and the low status they obviously have in society. \n\nOr, maybe, you’ve not the will to resist a siege of your ruinous eating habits. If it sounds familiar, then we have something for you!\n\n\n\n\n\nWe are proudly introduce you Anatrim, the later product for the elimination of your body’s extra weight. The greatest thing is that Anatrim improves the quality of your life by making you crave less food and giving you gay spirit. Here you may see some e-mails from our customers:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of watching TV continually and stuffing myself with food \n\n\nI became keen on exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I have a great form now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nLusia R., San Diego\n\n\n\n\n\n\n\"Passive weight reducing was of little help to me. It was difficult for me to hold back and not to eat something just at hand. \n\n\nOne day I heard about Anatrim in the media and I rather liked the information.\n\n\n I had tried to take it, and my wife said I’m not more a weighty man now, 5 months later. \n\n\n27 pounds off and it is still far to an end! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nSteve Burbon, Bellevue WA\n\n\n\n\n\nAnatrim gives you an opportunity to understand you got no such great need for the constant eating. It raises your spirit, supplies you with extra energy, and attacks unnecessary kilos. All thanks to its powerful comprehensive formula!!\n\n\n\nWorm out latest intelligence!\n\n\n\n"}