{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Infocast<Infocast@calcium.netcontentinc.net>", "subject": "FERC Compliance Webinar  June 28 1-2:30 EST", "body": "\n\nDesigning and Maintaining An Effective FERC Compliance Program\n\n\n\n\n\n\n\n\n\nINTERACTIVE WEB CONFERENCEDesigning and Maintaining An Effective FERC Compliance Program \n\n\n\n\n\n\n\nThursday, June 28, 2007: 1:00 - 2:30 pm EST\n\n\n\n\n\n\n\n\n\nSPONSORED BY:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYour course instructors:\n\nPerry D. Robinson, Partner, Ballard Spahr \nJohn C. Grugan, Partner, Ballard Spahr \nE. Carolan Berkley, Partner, Ballard Spahr\n\n\n\n\nWEBINAR OVERVIEW\n\n\n\n\n\nWith FERC's expanded enforcement scope and civil penalty authority under EPAct 2005 and the addition of mandatory reliability requirements developed by the ERO, energy industry companies are anxious about how the new enforcement regime will affect them.  \n\nOne thing is certain though. Under FERC's October 2005 Enforcement Policy, companies with formalized and effective compliance programs will not only be more likely to avoid violations, but if one occurs, will be in a position to potentially receive a reduced or even fully-mitigated civil penalty.\n \n\nRegistration - Single Site: $245.00\n\n\nRegistration - Additional Site: $150.00\n\n\nThis webinar will address the elements of an effective FERC compliance program, useful tools for implementing such a program, and how the compliance program successfully interfaces with other compliance processes already in place.  In addition, because a potential violation might even result in criminal charges, the speakers will focus on the special considerations of handling these matters.  To provide a broader perspective, the speakers will also address important lessons learned from designing analogous compliance programs in other highly regulated industries.  Finally, whether your company already has a compliance program or needs one, the webinar will conclude with strategies on how to assess the effectiveness of your current compliance capabilities.\n\nJoin the experts at Ballard Spahr for a 90-minute, comprehensive and practical discussion of how to develop and maintain an effective FERC compliance program\n\n\n \n\n\n\n\n\n\n\n\n\nCOURSE OUTLINE\n\n\n\n\n\n\n\nThursday, June 28, 2007: 1:00 - 2:30 pm EST\n\n\n\n\n\n\n\n\n\nBackground -- What Are The \"Drivers\" To Have An Effective Compliance Program In Place?\n \nEnergy Policy Act of 2005 - How FERC's Scope Of Authority And monetary Penalty Authority Increased\n FERC's Enforcement Policy  - The Costs & Benefits\n Civil Penalty Actions Since Energy Policy Act of 2005 -- What They Suggest\n Mandatory Reliability Standards Regime\n \n\tCompliance Program Basics\n \nSeven (7) Keys To An \"Effective Compliance Program\"\n Overview Of Typical Program Tools\n Ensuring Effective Interface With Other Compliance Processes\n \n\tCriminal/Department of Justice Implications\n \nDepartment of Justice Sentencing Guidelines\n Investigations\n \n\tLessons Learned From Designing Compliance Programs For Other Highly Regulated Industries\n\n\tGetting Started -- Performing A \"Gap\" Assessment Of Current Compliance Capabilities\n\n\tWrap Up\n\n\n\n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}