{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Damian Knutson\" <besfastgrouppod@fastgroup.kz>", "subject": "Melt away fat easily", "body": "\nControl your weight and appetite\n\n\n\n\n\nAnatrim – The latest and most enchanting flesh loss product is now readily available – As told on BBC\n\n\n\nDid you understand that redundant body kilos kill a plenty of people for every new year? We believe you hate the unsightly appearance of those people and the low status they obviously have in society. \n\nMoreover, you have not the will to resist an assault of your fatal eating habits. If it all sounds familiar, then we got something for your consideration!\n\n\n\n\n\nHere there is Anatrim, the recent product for the reduction of your body’s extra weight. The greatest thing is that Anatrim raises the quality of your life, repressing your feeling of hunger and giving you better cheer. Here’re some notes from our customers:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of gorging everything close at hand and watching TV continually \n\n\nI became rather more interested in doing exercise.\n\n\n\n\n\n\n Anatrim placed me back on the right path.\n\n\n I am in a great shape now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nLusia R., Texas\n\n\n\n\n\n\n\"I tried some passive weight reducing, but all came in vain. This terrible hunger would just kick in and spoil everything. \n\n\nOne day I was told about Anatrim my very best friend by and it brought a great influence on me.\n\n\n I had attempted using it, and my wife said I'm a different person now, 4 months later. \n\n\n26 pounds off and I keep losing them! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nSteve Burbon, Chicago\n\n\n\n\n\nAnatrim helps your mind to realize you got no such great need for the constant eating. It raises your spirit, gives you energy, and attacks needless kilos. Great thanks to its powerful distinguished formula!!\n\n\n\nPry out latest news!\n\n\n\nhttp://www.kinnert.net/?g3667235756C7A666A71746868354571337C7977743366w7wqjorl\n"}