{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "nonpareil: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n101 Questions Answered!\n\nWhat is Hezbollah? What are stem cells?\nHow'd those swimsuits get so skimpy?\n\nClick here for the KnowledgeNews answers\nADVERTISEMENT\nWord of the Day for Saturday, May 12, 2007\nnonpareil \\non-puh-REL\\, adjective:\n1. Having no equal; peerless.\n2. Something of unequaled excellence; a peerless thing or person.\n3. A flat disk of chocolate covered with beads of colored sugar.\nIt's not often that Mike Emrick, the nonpareil hockey voice, errs. His play by play is peerless. -- Richard Sandomir, \"Later Post Ensures That Derby Is Alone for Hammond's Dream Call\", New York Times, May 4, 2001\nSome birds make and use tools and show evidence of culture, and many are vocalists nonpareil. -- Bernd Heinrich, \"So, This Parrot Comes Into a Bar and Says . . .\", New York Times, January 30, 2000\nBut when it comes to his profession, he is a nonpareil. -- Peter Andrews, \"A Jazzy Murder Case\", New York Times, October 30, 1983\nSteve Redgrave won his third gold medal at his third successive Olympic Games and we hymned the man as if he were the greatest athlete we had ever seen: a superman, a nonpareil, a demigod walking the earth. -- Simon Barnes, \"Honour and praise to three athletes who graced the sporting arena\", Times (London), December 27, 2000\nNonpareil comes from Old French, from non, \"not\" + pareil, \"equal,\" from (assumed) Vulgar Latin pariculus, diminutive of Latin par, \"equal.\"\nDictionary.com Entry and Pronunciation for nonpareil\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9578622-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}