{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Percy Connors\" <lexexekutorvub@exekutor.org>", "subject": "Be leaner and slimmer by next week", "body": "\nGet out of the obese crowd\n\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting flesh loss product is now available – As told on BBC.\n\n\nDo you recall all the times when you appeal to yourself to do anything to get rid of this desperately growing number of kilos? Fortunately, now no major sacrifice is required. Thanks to Anatrim, the ground-shaking weight-reducing mixture, you can get healthier life style and a really slender figure. Have a look at what our customers write!\n\n\n\n\"I hate to confess but I was a junk food addict. \n\n\nI devoured all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis ruinous passion finished after I started course with Anatrim! \n\n\nOh, God,\n\n\n\n\n my inclination to eat constantly decreased, \n\n\nspirits improved and I’m the happiest person 20 pounds in 2.6 months. \n\n\n\n\nI can tell you now I’m the happiest person on the planet!\"\n\n\n\n\n\nSilvia D., San Diego\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nYou can't fancy how I abhorred being mocked at school. \n\n\n\n\nI hated my stoutness and I abhorred myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nThis stuff literally took me out of this horror! The greatest respect to you, fellows.\"\n\n\n\n\n\nCharley Mock, Bellevue WA\n\n\n\n\n\n\"Do you know what? Anatrim kept my marriage intact! I got into the circle, depression – eating more – more depression. My wife was about to leave me as I was turning in overweight psycho. \n\n\nOnce my friend pointed at your web page and I asked for pack of Anatrim at the same time. \n\n\nThe results I achieved were magnficent, my appetite became normal, I was in good spirits oftener, and, of course, I became able to tighten my belt on some holes. And you see, the sex became fantastic, too!\"\n\n\n\n\n\nKarl\n\n\n\n\n There is a great number of gratitudes delighted people leave after taking Anatrim. Don’t you wanna add yourself to the thousands and thousands of slim people and try this natural appetite-suppressing power boosting product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}