{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Steve Langasek <vorlon@debian.org>", "subject": "Re: Logo trademark license vs. copyright license", "body": "On Wed, Apr 18, 2007 at 11:26:11AM +0100, MJ Ray wrote:\n> Steve Langasek  wrote:\n> > Hrm, there is a difference between *referencing* a trademark when\n> > criticizing the holder, and *using* the mark, in trade, in a way that\n> > reflects badly on Debian.  [...]\n\n> Two data points:\n\n> SJVN's use of the debian trademark when criticising the distribution is\n> fine (unlike the actual criticism, which is buggy).\n\nHeh, yes, exactly.\n\n> Businesses selling probably-sweatshop-sewn T-shirts (maybe made from\n> subsidised US cotton) reflect badly on debian, but are also permitted.\n\n> However, both are currently permitted.\n\nEr, businesses selling t-shirts using the official debian logo is *not*\npermitted.  Currently, the manner in which this is being disallowed is\nsuboptimal, but it's still not something that we *permit*.  (Perhaps what\nyou're suggesting is that t-shirt manufacturers don't have to get permission\nbecause we have a mark in the field of computers/software, not in the field\nof clothing; but if what's being sold is Debian-related clothing, it's still\nthe Debian mark that's being used, and it is infringement that we have\nstanding to prevent.)\n\nFurther, it's up to *Debian* to decide what uses of the logo reflect badly\non it and consequently should be disallowed because we don't wish to be\nassociated with them.  Your above statement includes an implicit value\njudgement about which sorts of activities Debian will or will not wish to be\nassociated with, which may not be at all representative of the views of the\nproject members at large.\n\n-- \nSteve Langasek                   Give me a lever long enough and a Free OS\nDebian Developer                   to set it on, and I can move the world.\nvorlon@debian.org                                   http://www.debian.org/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}