{"category": "ham", "to_address": "sugar@laptop.org", "from_address": "Marco Pesenti Gritti <mpg@redhat.com>", "subject": "[sugar] Graphics API", "body": "Hello,\n\nin the last couple of days we started moving Sugar to the new UI\nframework. I posted about the reasons of the direction change already.\nHere are more concrete information for activity authors.\n\nWhat is changed\n---------------\n\n* The toolbar is being moved to use gtk widgets.\n\n* The activity API has been changed a bit to make it easy to setup a\nlayout which is HIG compliant.\n\n* The activity menu (the one in the top-left of the frame) has been\ndropped and replaced by an Activity toolbar.\n\nHow to switch to the new system\n------------------------------------\n\n* Activities which follow the HIG layout (ex. Web, Write, Read)\n\nThis is a good overview of the overall layout and controls:\n\nhttp://wiki.laptop.org/go/Write\n\nRework your toolbar implementation to use the new controls. There is an\nexample here:\n\nhttp://wiki.laptop.org/go/Graphics_API#Activity\n\nWeb has been already ported, Tomeu is working on Read and Write.\n\n* Activities which run full screen or use a GtkSocket (ex. TamTam,\nEtoys)\n\nUse the set_canvas() method of the Activity to set the toplevel widget\nof your view. This is what I had to do in Etoys, for example:\n\n- self.add(socket)\n+ self.set_canvas(socket)\n\nWhich control should I use for... ?\n-----------------------------------\n\nThis is tricky and suffer for the parallel nature of Sugar development,\nbut we are trying to alleviate the problems (using gtk clearly helps a\nlot in this respect).\n\nThe HIG has a section on the controls. Unfortunately it's not complete\nand so not particularly useful, other than for getting an high level\nidea of the look of the control and on the high level layout and colors\nsystem.\n\nhttp://wiki.laptop.org/go/OLPC_Human_Interface_Guidelines/The_Sugar_Interface/Controls\n\nI put on the wiki some notes about the Graphics API features and\nimplementation:\n\nhttp://wiki.laptop.org/go/Graphics_API\n\nIt isn't really a reference yet but you can use it to figure which\nwidgets you should use, while implementation and documentation is in\nprogress. Just after the section name you can see the class of each\ncontrol:\n\n* For gtk.* you can just use the gtk control. If we decide to subclass\none of these, they will be compatible with the gtk ones. (Hence porting\nover will be trivial).\n\n* For sugar.*. A few of them are already (partially) implemented, others\nwill be implemented soon. We will generally implement those on demand\nand especially for the low priority ones, we would welcome\ncontributions. If you need any of them in your activity let us know\nabout it.\n\nLet me know if you have any question, doubt or complaint!\n\nMarco\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}