{"category": "spam", "to_address": null, "from_address": "maskrh maskrh <maskrh91@hotmail.fr>", "subject": "From Willam Kone", "body": "\n\n\n\n\n \nFrom Willam Kone\nAbidjan , Cote D I'voire West -Africa Dear Respected one , By brief introduction , we are Willam and Joelle Kone, From Cote d'ivoire and the children of late Mr. and Mrs. David Kone. Our late parents was killed by the rebels in our residence town of Bouake the second Economic Capital of Cote d'ivoire during the recent political Crisis /war of 19th september 2002. Our father was a wealthy Cocoa Merchant and president of BCC(bourse de cafe and cacao bouake chapter) before he was killed together with our mother by the rebels. Our parents death was due to the BCC.CI's financial support to the government to fight rebels who attacked our country on this fate of 19 sept 2002.as what the govt. called here (éffort de paix). Our parents was kidnapped and took away but we only met our father in a terrible condition with the red cross officials to whom he was handed half alive. Talking of our mother, our dad confirmed that she could not bear her bulletsfor only 15 minutes and she gave up. Our father, was hospitalized for some days before his death in a private hospital in yammoussokro , But before his death,he secretly disclosed to me as his son, US$5.5 million dollars which he deposited in a bank here on behalf of Willam Kone Jr as next of kin. Our father also disclose to me before he gave the ghost that he wanted to invest his fortune abroad. This is why we are honourably seeking your assistance to help us and stand as the beneficiary and foreign partner of our late father and help us in investing the money for us in your country immediately the money transfer to your account abroad. WE ARE HONOURABLY SEEKING YOUR ASSISTANCE IN THE FOLLOWING WAYS. \n1)TO PROVIDE A BANK ACCOUNT WHERE THIS MONEY WOULD BETRANSFERRED TO. 2)TO SERVE AS OUR GUARDIAN OF THIS FUND SINCE I AM 19YEARS AND MY SISTER IS 17YEARS. 3)TO MAKE ARRANGEMENT FOR US TO COME OVER TO YOUR COUNTRY AFTER THE MONEY HAS BEEN TRANSFERRED. We agreed to offer you 20% of the total money as your compensation For your effort / input after the successful transfer of this money to your account overseas .We are in distress here in a Hidden place because of our wicked uncle who matreated us very bad after the death of our parents and we need your urgent help as at now, we have no other hope of surviving except when this money is transfer overseas for investments. Please keep this very confidential and private for our willamkone@yahoo.frsafety. Expecting to hear from you, Best Regards, Willam /joelle Kone,Besoin d'un e-mail ? Créez gratuitement un compte Windows Live Hotmail et bénéficiez de 2 Go de stockage ! Windows Live Hotmail\n"}