{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "ben.krohmal@keionline.org", "subject": "[Ip-health] Thai FDA to require disclosure of production costs", "body": "http://www.bangkokpost.com/News/17Apr2007_news04.php\n\nBangkok Post\nApril 17, 2007\n\nCost of new drugs must be stated\n\nFDA: Law will protect rights of consumers\n\nAPIRADEE TREERUTKUARKUL\n\nPharmaceutical firms will be required to declare the cost of each new drug\nlisted for introduction in the country in a bid to protect consumer\nrights, Food and Drug Administration (FDA) secretary-general Siriwat\nThiptaradol said. The declaration of production costs will be stipulated\nin a new drugs bill now being scrutinised by the Council of State.\n\nThe move, which is aimed at seeking a balance between the interests of\npatent holders and the public, might affect sales to some level, he said.\n\nHowever, he did not think it would mean a double standard for the makers\nof existing drugs.\n\n''Drugs are a special product and the FDA has a duty to ease the problems\nof drugs access while protecting consumers' rights. In the meantime, we\nalso have to ensure the move will not severely hurt the benefits of drug\ncompanies,'' he said.\n\nIn February, the government announced a decision to adopt compulsory\nlicensing for importing or producing copycat versions of costly Aids and\nheart drugs Efavirenz, Kaletra and Plavix.\n\nAbbott Laboratories, the patent holder of Kaletra, rejected the move by\nwithholding a plan to introduce new drugs _ including Aluvia, which is an\nupgraded formulation of Kaletra _ in Thailand.\n\nHowever, the company earlier this month decided to cut the Kaletra price\nto 3,488 baht per month, down 40% from its previous proposal. The new\nprice could be cheaper than the generic version of the anti-Aids drug.\n\nBut the Public Health Ministry has yet to make a final decision on whether\nto accept the company's offer or maintain its previous plan to import\ngeneric versions of the drug.\n\nDr Siriwat said he believed the new law would not cause other drug firms\nto withhold the introduction of new drugs in Thailand as Abbott did.\n\n''The drug price should be affordable for people in each country, but that\nis not always the case. For example, leukaemia drugs cost a patient nearly\n100,000 baht a month, whereas the average monthly income of Thai people is\nonly 10,000 baht. As a result, some patients were almost bankrupted by the\noverpriced drugs necessary for treatment,'' he said.\n\nApart from the issue of overpriced drugs, pharmaceutical officials will\nkeep a close watch on the marketing and promotional tactics of drug firms,\nparticularly the way they sponsor trips for health professionals to attend\nseminars and conferences abroad.\n\nJiraporn Limpananont, an academic at Chulalongkorn University's faculty of\npharmaceutical sciences, said drug companies have invested heavily in\nmarketing and promotional campaigns, and that made drugs too costly.\n\nThis is unfair to consumers, she said.\n\n''It's necessary to seek a balance between the patent holders and the\npublic. Live-saving drugs should not be products that only the well-to-do\ncan afford,'' she said.\n\nMs Jiraporn also questioned the proposed revision of the patent law by the\nDepartment of Intellectual Property, which would allow opponents of\npatents to contest the process only after approval is given.\n\nWithout ''pre-grant'' opposition, local drug firms would not be able to\nproduce generic versions of patented drugs until disputes were over, and\nthat would mean Thai consumers would be stripped of fair access to cheap\ndrugs, she said.\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}