{"category": "spam", "to_address": "smiles@speedy.uwaterloo.ca", "from_address": "Tai Textile Industry <joboffer@taitextile.org>", "subject": "PART TIME JOB OFFER", "body": "Dear Sir/Ma,\n\nI am Mr Tai Lee Yeung, I own a company Based on Chinese and African\ntextile and fabric material in Australia, I'm in search for a \ntrustworthy representative in USA that can help as a link between me \nand my \nclients over there.I would like to know if your are interested to work \nfrom \nhome for us at Tai Textile MFG.\n\nUrgently i need a representative in the states,that will work online \nfrom home and get paid weekly without leaving or affecting your present \njob? My Company produces various clothing materials, batiks, assorted \nfabrics and traditional costumes.We have clients we supply weekly in \nthe \nstates and my clients make payments for our supplies every week\nin form of money orders,cashiers check and bank To Bank transfer. which \nare not readily cashable outside the US or Canada,so I need a honest \nand sincere individual in the States to work as my representative and \nassist me in processing the payments from our clients and I will pay \nhim/her 10% per each payment recieved on my behalf,you are likely to \nrecieve \npayments once per week.\n\nAN IDEA OF WHAT YOU ARE EXPECTED TO TAKE CARE OFF\n\nReceive payments from my patronizing customers in the States on my \nbehalf and get it cashed at your bank, then deduct 10% from the total \nfunds \nrecieved as your workmanship and forward the balance to me Via Western \nUnion Money Transfer.(the transfer charges should also be deducted from \nthe total amount your sending to me).\n\nSheryl Shavers (my former representative has moved to Germany with her \nfamily)\nOur payments will be issued out in your name and sent to your contact\naddress.  So all I need is to forward your information to my numerous \ncustomers\nin the states and they will contact you before they issue payment in\nform of money order to you.\n\n\nHope to get a favourable reply ,accepted to be my rep and get back to\nme with the following informations in this format.\n\nFirst name:\nLast name :\nFull Address :\nTel numbers:\nSex :\nDate of birth :\nAre you employed/self employed?\nDo you have a checking account?\nBest means of communication?email/phone\n\nI will need this informations from you for my record,also if you \nrequire more information and photo of me, do not hesitate to contact \nme,i \nwill give you a call asap.\n\nplease send your Mail to: taitextile09@aol.com\n\nThanks and God bless.\nTai Lee. \n\n\n\n"}