{"category": "ham", "to_address": "\"Benjamin Krohmal\" <ben.krohmal@keionline.org>,\n   \"IP-Health\" <ip-health@lists.essential.org>, <a2k@lists.essential.org>", "from_address": "\"Josh Sarnoff\" <jsarnoff@wcl.american.edu>", "subject": "[Ip-health] RE: [A2k] Microsoft's Brief on KSR vs. Teleflex", "body": "Two of the most significant sentences in the Court's KSR decision are:\n\n\"For over a half century, the Court has held that a 'patent for a\ncombination which only unites old elements with no change in their\nrespective functions . . . obviously withdraws what is already known\ninto the field of its monopoly and diminishes the resources available to\nskillful men.' Great Atlantic & Pacific Tea Co. v. Supermarket Equipment\nCorp., 340 U. S. 147, 152 (1950). This is a principal reason for\ndeclining to allow patents for what is obvious.\"  Slip op. at 11-12.\n\nThe amicus brief on the merits of various Economists and Legal\nHistorians (disclosure alert -- I was Counsel of Record) not only\nrecited this language (see page 10) but also cited to earlier precedents\nsuch as Atlantic Works v. Brady, 107 U.S. 192, 200 (1883), which\ndiscussed inventions that \"would naturally and spontaneously occur.\"\nThe brief also encouraged the Court to be more explicit about the level\nof creativity required for a patent.  Although the Court largely\ndeclined to do so in this case, the Court's decision (and particularly\nits approval of the \"combination\" precedents) makes an invaluable\ncontribution to protecting the public domain and should result in\ndramatic changes to the obviousness standards being applied.  For those\ninterested, the brief is at http://www.wcl.american.edu/pijip/ksr.cfm.\n\nJosh\n\nJoshua D. Sarnoff\nAssistant Director\nGlushko-Samuelson Intellectual Property Law Clinic\nWashington College of Law\nAmerican University\nRoom 446A\n4801 Massachusetts Avenue, NW\nWashington, DC 20016, U.S.A.\n011.202.274.4165 phone\n011.202.274.0659 fax\njsarnoff@wcl.american.edu email\n\nThis message may contain information that may be confidential and\nsubject to the attorney-client privilege, work-product doctrine, or\nother applicable protection.  If you have received this message in\nerror, please advise the sender by reply e-mail and delete the message.\nIf you are not the intended addressee, you should not use, copy,\ntransfer, or disclose to anyone else this message, attached documents,\nor any information relating to this message.  Thank you very much.\n\n-----Original Message-----\nFrom: a2k-admin@lists.essential.org\n[mailto:a2k-admin@lists.essential.org] On Behalf Of Benjamin Krohmal\nSent: Wednesday, May 02, 2007 12:01 PM\nTo: IP-Health; a2k@lists.essential.org\nSubject: [A2k] Microsoft's Brief on KSR vs. Teleflex\n\nIn making its decision this week in the KSR v. Teleflex case, the U.S.\nSupreme Court considered an amicus brief filed jointly Microsoft, Cisco,\nand three other companies.\n\nReaders of this list may be especially interested in the following\nexcerpt which highlights the reasons these companies support higher\nstandards of patentability.\n\n[snip]\n\nThomas Jefferson expressed\nhis concern for this bargain between the inventor and the\npublic when he wrote:\n[I]f a new application of our old machines be a ground\nof monopoly, the patent law will take from us much\nmore good than it will give. Perhaps it may mean\nanother thing, that while every one has a right to the\ndistinct and separate use of the buckets, the screw, the\nhopper-boy, in their old forms, the patent gives you the\nexclusive right to combine their uses on the same object.\n9 But if we have a right to use three things separately, I\nsee nothing in reason, or in the patent law, which forbids\nour using them all together. A man has a right to use a\nsaw, an axe, a plane, separately; may he not combine\ntheir uses on the same piece of wood? He has a right to\nuse his knife to cut his meat, a fork to hold it; may a\npatentee take from him the right to combine their use on\nthe same subject? Such a law, instead of enlarging our\nconveniences, as was intended, would most fearfully\nabridge them, and crowd us by monopolies out of the\nuse of the things we have.\n\nThomas Jefferson, Letter to Oliver Evans (Jan 16, 1814), in\n14 Writings of Thomas Jefferson 66 (Andrew A. Lipscomb &\nAlbert E. Bergh eds., 1903).\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}