{"category": "spam", "to_address": "<theorize@plg.uwaterloo.ca>", "from_address": "\"Sam D. Banks\" <wind@durham.edu.on.ca>", "subject": "Although I should've posted pictures when I moved here back in February of this year, I couldn't wait to post until I finished furnishing my apartment!", "body": "\n\n\n\n\n\n\n\nI gave you my heartBut the very next day,You gave \nit away.\nI woke up this morning and decided to buy myself a \ndigital camera (as my sister cobbed the last one I received as a graduation gift two \nyears ago, the Kodak EasyShare CX7300). in Accounting through Upper Iowa University, \nsubsequently earning my MBA with an emphasis in Accounting in order to sit for the \nCPA exam in the State of Wisconsin. This yearTo save me from tearsI'll give it to \nsomeone special.\nI've also found and purchased all five of the Nokia \nOEM Xpress-on faceplates, which I found dirt cheap, so now I have a color for every \nday of the week (Monday through Friday, that is. Details have been leaked on the \ncompany's first four-core CPU, dubbed the Phenom X4.\n(Although I am scheduled for an interview in the \nmiddle of next month here.\nAlthough the graphics were pretty impressive, I'm \nnot so sure about this. Although I should've posted pictures when I moved here back \nin February of this year, I couldn't wait to post until I finished furnishing my \napartment! no more cover letters at least for a little while! As my friend Melissa \nhas recently received her high school diploma (finally! And I'm not so sure that I \nwill find it in the area of accounting anymore, unless I do it on my own. I guess I \nwas a shoulder to cry on. I've also found and purchased all five of the Nokia OEM \nXpress-on faceplates, which I found dirt cheap, so now I have a color for every day \nof the week (Monday through Friday, that is. I've also found and purchased all five \nof the Nokia OEM Xpress-on faceplates, which I found dirt cheap, so now I have a \ncolor for every day of the week (Monday through Friday, that is. - Oh wow, just what \nI've always wanted for Christmas!\nEither way, wish me luck in my job \nsearch!\n"}