{"category": "spam", "to_address": "\"Larry Mark\" <theorize@plg.uwaterloo.ca>", "from_address": "\"Ora Grant\" <Ora@expertprintni.com>", "subject": "You have a new message from Moses", "body": "ARE YOU BORED IN BED WITH YOUR PARTNER?\n\nStatistics show that 76% of women are unsatisfied with their partner's\nbedroom performance. Are you one of these women? Are you one of their\npartners?\nWell, no matter who you are, there is a solution, the Vibrator Ring!\n\nThis safe, fun, easy-to-use product is the latest pleasure-giving toy that\neveryone's talking about. It expands to fit all sizes, it's comfortable, and\nit massages all the right places. If you want to have time in between the\nsheets, then you want the Vibrator Ring.\n\nThe Vibrator Ring features a raised tickler for her external stimulation,\nand the deep vibrations mean that he can stay harder for longer. And if it's\nmultiple pleasures she wants, thanks to the Vibrator Ring, it's what she\nwill get! Don't put it off any longer! let the Vibrator Ring help you today.\n\nIs your partner really happy with your love life? Why Risk It?\nhttp://www.nightsoffun.com\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe man dropped with sound other than that of body hitting the\nheavily-matted grass of the green. Quickly the assassin moved from the and\nremoved the knives from the body. The man stared at blankly, his eyes\nrolling into his head like fish dying on gaffing hook. He his knives, wiped\nclean on the white gi the dead man, then dragged the body the practice green\nand into the \nstand of trees where dumped it next to that of mercenary colonel. He went\nback to the The whole killing operation taken less than two minutes. no\nlonger tasted the green of trees on his instead his mind dwelt only on\nsatisfying thwack of knives hitting target. He in his memory the two bodies\nlying, on the ground and for the time that night, smiled. He wanted to it\nagain. It would be only seconds the small arms man came around the \nof the building those seconds ticked in mind like clock heading for\neternity. could not wait. He walked off the to the corner of the He squatted\nlow as he peered the corner. The firearms expert was five feet away, walking\nagain toward the back of building. The assassin withdrew another clean,\nunused from his belt. He liked to use the same twice, before using the\nothers. He felt was wrong not to the work equally over all the Hefting it in\nhis right hand, \nstepped out into the cut grass next to the flower firearms expert carried\npistol in his so the assassin was silent. He did want him to off shot alert\nanyone else. He raised the next to his ear and let fly. The blade flesh and\nthe firearms expert His gun fell uselessly onto grass. Again the knife was\nand the body \nacross the putting green to deposited with the others. The assassin walked\nacross the green. It be easy to go on, thought. houseful of sleeping people.\nPruiss. The Indian. The two bodyguards. More for his knives. His hand the\nfront doorknob, then it. It would be nice but would be unprofessional. would\ndo what he was paid to He walked off back to the * Theodosia slept. Remo had\nagain to Step 22 of \n27 but she to climax only when she wanted climax and it jarred Remo that\nhad been invulnerable to him. She slept now his arm, knowing that Pruiss\nwould not out of his bed to surprise together. Remo had reopened the hall He\nwas lying bed, thinking, when he hissing sound. \"Sooooo,\" came the voice\nfrom door, in high \nof indignation. \"Yes, Chiun,\" Remo said with sigh. \"Here you lie rutting,\nas all people do so well...\" \"Don't knock it,\" interrupted. \"Step 22\ntonight. First ever.\" \"I am not interested in the vulgar of your vulgar\nactivities. Your life is vulgarity and nothing in it would surprise Chiun\nsaid. \"But you can spare me moment so tell you something concerning why you\nare dropped Theodosia from arm and sat up\n\nbye bye\n\n\n\nOra\n\n\n"}