{"category": "ham", "to_address": "debian-devel@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Don Armstrong <don@debian.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "On Mon, 04 Jun 2007, Anthony Towns wrote:\n> On Sun, Jun 03, 2007 at 12:28:04AM -0700, Don Armstrong wrote:\n> > If the author of Star decides that the Debian maintainer has\n> > incorrectly removed a \"copyright notice\",[1] he could terminate the\n> > license under 6.1, \n\n[...]\n\n> Should someone be willing to do that, and a court is willing to go\n> through all those steps with a choice of venue clause, what makes\n> you think they'd not do so in the absence of one?\n\nThe difference is in the cost of defending against such an action; in\nthe normal case you have the ability to make the entire claim go away\nby notifying the court that the venue is improper. In the case of a\nchoice of venue clause, you first have to invalidate the choice of\nvenue, which increases the cost.\n\nIf you're going to ignore the court case, it doesn't matter to you,\nbut if you ever plan on travelling to germany or doing business with\npeople in germany (or live in some part of germany that isn't close\nenough to berlin to defend yourself there) it can be a significant\ncost.\n\n> > we only gain ones in specific circumstances. In the case of the\n> > CDDL, we lose rights even in the case where we're only using the\n> > work.\n> \n> What makes you think the latter is true? I don't endorse the claim\n> that copyright licenses can take away usage rights if you're not\n> making use of the ability to modify or distribute that they offer\n> you.\n\nUnlike the GPL, the CDDL doesn't separate use from modification. Since\nuse (or at least performance of a work) is a right that is reserved to\nthe copyright holder, you need some level of permission to do so.\n\n> But even so, when you say things like \"I'm personally more concerned\n> about licensing than the average developer\" and \"I [...] expect\n> people who disagree with my analysis to actually engage the analysis\n> with counter arguments, come to a complete understanding of the\n> problem, and then make a determination\" you are saying your\n> understanding is more important than other people's.\n\nNo, I'm saying that people who disagree should engage my analysis\ninstead of remaining silent or discarding them with offhand comments.\n\n> Holding people who agree with you to that standard might be a way to\n> start?\n\nIf I had time to do so, I'd consider it. Since I don't, I content\nmyself with trying to make sure my messages approach this standard,\nsetting an example instead.\n\n> > What else can we do? We take input, we examine it, we respond with\n> > our understanding of how the input meshes together. I don't\n> > believe we're capable of presenting absolute truth.\n> \n> Who is \"we\" in the above? For someone who's not a regular on -legal,\n> it doesn't sound like it includes me.\n\nI'd like to believe it includes every rational being.\n\n> In any event, the important thing (afaics) isn't to have a forum\n> where regulars can post their understanding of issues, it's to help\n> the people you're communicating with have a better appreciation for\n> the complexities involved in their issue and how they might choose\n> to approach them. That can mean pointing out possible drawbacks in\n> existing licenses, explaining tradeoffs between licenses, or\n> suggesting alternative ways of drafting licenses that avoid having\n> to make some tradeoffs, but it doesn't mean making the tradeoffs for\n> other people.\n\nAlmost all this happens on -legal, actually. Some of it happens more\nfrequently on other lists, since drafting licenses is not something\nthat -legal does, but many of the contributors to -legal are involved\nin making sure that new versions of licences that are drafted are\nobviously DFSG Free.\n\nI've personally been involved in trying to resolve the GFDL issue,\nmaking sure that the GPLv3 is DFSG free, and have been working along\nwith Simon and a few others to try to fix the RFC issue. [In the case\nof the CDDL, it's interesting to note that this very issue was\nsupposedly going to be fixed or at least looked at in an upcomming\nrevision of the CDDL.]\n\n> No, punting to a GR is not a good solution -- it's slow to come to a\n> resolution, it annoys developers who have to inform themselves about\n> something they'd rather not worry about, and it ends up with -legal\n> folks complaining that the resolution doesn't make sense.\n\nIf it's the case that a signficant proportion of contributors to\n-legal and Debian Developers feel that an improper decision has been\nmade, there's little else that can be done besides bringing it to a\nGR.\n\n> > What would make it more welcoming? A large part of the problem is\n> > the need to continuously point out counter arguments, [...]\n> \n> What makes it unwelcoming is the appearance of a consensus that\n> doesn't brook argument, even when that consensus differs\n> significantly from that of other sections of the free software (or\n> open source) community.\n\nThe problem is that it's very difficult to know if the consensus\ndifferens from the \"silent majority\" because the \"silent majority\" is\nnearly silent.\n\n> > there are some things that are widely agreed to be free, some\n> > things that are widely agreed to be non-free, and some things\n> > which are much more contentious. Someone who is capable of talking\n> > about the official policy is going to necessarily have their own\n> > opinions and will express it.\n> \n> I don't think that actually makes sense -- Debian's policy on this\n> is expressed by what will actually get accepted into the archive (or\n> what will get removed for license reasons). That's decided by\n> consensus (where it's obvious), by ftpmaster (where it's not\n> entirely clear or somewhat controversial) or by general resolution\n> (where it's significantly controversial).\n\nAll of these, save the latter are subject to being overruled by GR;\nthey are not necessarily the official position of Debian, but general\nconsensus, or the consensus of ftpmaster. Even though ftpmaster is\nlikely in a priveledged position if they are currently delegated by\nthe DPL to make such determinations, they still should be careful in\nadvocating their opinion as the official position of Debian.\n\n> Debian does accept the CDDL as a free license (at least when the\n> choice of venue is Berlin).\n\nIndeed; I wasn't aware of the CDDL ever being accepted in main; had I\npaid more attention to it, I would have brought this issue up sooner.\n\n> > Not at all; it's quite possible to publicly state that a ruling\n> > was incorrect and still adjudicate under the ruling.\n> \n> If you want to be trusted to make similar rulings on behalf of the\n> people who intentionally made the decision you're calling\n> \"incorrect\", then no, it's not possible.\n\nWhy not? It's not like it's impossible to hold convictions and still\nmake decisions under a separate set. I can't imagine that there will\never be someone who is versed enough in an area who will agree with\nall of the decisions made by other people. What you appear to be\nasking for is \"yes men\" which pretty much obviates anyone with\npublicly expressed convictions.\n\nIt's not like I'm personally campaigning for the ability to make these\ndecisions myself, and -legal hasn't ever been in a position to make\nthem either. When -legal (or I, for that matter) say that something is\nDFSG Free, it tends to be non-controversially so. The converse is\nwhere the issue lies.\n\n> No, the reaction of saying things like:\n> \n> ] From: Anthony DeRobertis \n> ] Subject: Re: Results for Debian's Position on the GFDL\n> ] Date: Sun, 12 Mar 2006 17:15:40 -0500\n> ]\n> ] [...] \n> ] I agree wholeheartedly, but I'm not exactly sure how else to proceed. I\n> ] don't think /anyone/ who is part of the consensus here is too happy with\n> ] the outcome of this GR.\n> ] \n> ] Alas, now that pi != 4*atan(1), how shall we proceed? Interpreting\n> ] licenses and the DFSG is nowhere near as clear as mathematics and,\n> ] unfortunately, just ignoring the GR would, I think, make us look like\n> ] sore losers.\n> \n> because clearly everyone who voted for the winning option is the\n> sort of person who would think pi can be redefined willy-nilly, or\n> that the only reason to respect the GR is to avoid looking like sore\n> losers...\n\nIt's interesting that you see this message this way; to me it seems\nthat he's getting at precisely what you appear to want. -legal in\ngeneral felt that GFDL had serious issues, and under no circumstances\ncould it be acceptable for main. When the GR decision was made,\nfiguring how how to reconcile the previous stance with the outcome of\nthe GR was something that had to be determined. The use of hyperbole\nis in bad taste, but skipping over such things is required to avoid\ndevolving into meaningless flamewars.\n\n\nDon Armstrong\n\n-- \nOne day I put instant coffee in my microwave oven and almost went back\nin time.\n -- Steven Wright\n\nhttp://www.donarmstrong.com              http://rzlab.ucr.edu\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}