{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nFriday, 08 June, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nSweden given win after ref attack\nSweden are awarded a 3-0 victory after their Euro 2008 qualifier in Denmark was abandoned.\n\n\n\n \nBeckham warned over flight risks\nDavid Beckham's commute from Los Angeles to London could have career-threatening effects on his health, according to experts.\n\n\n\n \nRobben close to new Chelsea deal\nArjen Robben's father brushes off reports that he is close to signing for Real Madrid and says the winger is set to sign a new Chelsea deal.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nClarke and Monty in Austria exit\nRyder Cup stars Darren Clarke and Colin Montgomerie miss the cut at the Austrian Open on Friday.\n\n\n\n \nRamsay to join Woods in US Open\nScotland's US Amateur champion Richie Ramsay will partner Tiger Woods and holder Geoff Ogilvy in next week's US Open.\n\n\n\n \nGreen surges into lead in Austria\nAustralia's Richard Green leads the Austrian Open by one shot at the halfway stage after a second-round 65.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nMcLaren set early Canada GP pace\nMcLaren drivers Fernando Alonso and Lewis Hamilton head their Ferrari title rivals in first practice at the Canadian Grand Prix.\n\n\n\n \nHamilton issues warning on 'bias'\nLewis Hamilton says he would leave McLaren if he ever felt the team were favouring team-mate Fernando Alonso.\n\n\n\n \nTragedy mars McGuinness victory\nA rider and two spectators die following a crash in the Senior race at the Isle of man TT, in which winner John McGuinness set a new lap record.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nMcLaren set early Canada GP pace\nMcLaren drivers Fernando Alonso and Lewis Hamilton head their Ferrari title rivals in first practice at the Canadian Grand Prix.\n\n\n\n \nHamilton issues warning on 'bias'\nLewis Hamilton says he would leave McLaren if he ever felt the team were favouring team-mate Fernando Alonso.\n\n\n\n \nMcLaren boss feels for Raikkonen\nMcLaren boss Ron Dennis says he takes no pleasure in former driver Kimi Raikkonen's struggles at Ferrari.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nBan 'almost destroyed' Ohuruogu\nChristine Ohuruogu's coach Lloyd Cowan says it has been a difficult job to get his charge back on track after her suspension.\n\n\n\n \nTomlinson looking for Osaka boost\nBritish long jumper Chris Tomlinson says he hopes to put his injury problems behind him at this year's World Championships in Osaka.\n\n\n\n \nGebrselassie targets hour mark\nEthiopian distance-running great Haile Gebrselassie will attempt to break the world one-hour record this year.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nTour takes Riis off winners list\nTour de France organisers say they no longer consider Bjarne Riis the 1996 race winner after his drugs confession.\n\n\n\n \nBelgian police make doping raids\nAn assistant from Belgian cycling team Quick-Step is questioned after a series of drugs raids.\n\n\n\n \nThomas toasts 'dream' Tour place\nWales's Geraint Thomas is celebrating a \"dream come true\" with his ride in next month's Tour de France confirmed.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nComment: Becks for good\nRobbo on Beckham's return for England\n\n\n\n \nRamprakash goes dancing again\nStrictly Come Dancing star Mark Ramprakash breaks out a few of his best moves ahead of Surrey's Twenty20 campaign this summer.\n\n\n\n \nHatton gets new nickname\nBoxer changing his name to the 'Manchester Mexican'\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}