{"category": "spam", "to_address": "\"the00\" <the00@plg2.math.uwaterloo.ca>", "from_address": "\"Annette Morse\" <bxmbranson@littlecountryplace.com>", "subject": "Be sexual giant all night long.", "body": "\n\n\n\n\n\n\n\"If it's that delicate,\" I said, \"maybe you need a lady detective.\"\"I heard you were kind of hard-boiled,\" Toad said slowly, his eyes coo\n\n\nI went over and pushed the door shut. She held on to the last moment.  \"Don't get tough with me,\" the man said. \"I'm a bad man to get tough w Alfred's eyes crawled sideways watching him, then jerked to the money  \"I'll be at my office at nine in the morning, Miss Gonzales. I'll be a I stepped away from the finger and watched his eyes.\n\"Come along, Alfred,\" the big man said to his companion. \"And stop act I said: \"Neither can I. I may call you again. Don't get me wrong, Dr.  I didn't have the heart to tell her I was just plain bored with doing  \"Don't kid me. My nerves are frayed,\" I said. \"Who's the junky?\" I didn't answer. I just kept going. When I had the door ready to open  \"I've told you that. He came out to California just about a year ago. \nI said it again. He smeared his face with his hands and said tersely:  \"Why would I? If the manager said the room was empty?\" \"I betcha that was why his face had that disappointed look, after they She stared at me for a moment as if I were some kind of freak. \"Seven  She smiled. I was beginning to wonder if she had one in her. She had v I gave him a shady leer. \"You're so right,\" I agreed. \"Let's get toget I didn't answer for a long moment, then I said: \"You mean alone, witho He grinned, showing a porcelain jacket crown that was too white for hi He just sat there and stared at me with his nasty little eyes half clo\nI drove east on Sunset but I didn't go home. At La Brea I turned north \"Please, Mr. Marlowe,\" she said at last, \"I don't think anything of th \"He wanted you to find out for yourself,\" I said. \"He's building your  I went over and pushed the door shut. She held on to the last moment. \nFlack said derisively: \"What makes you so wonderful?\" \"It ain't now,\" Flack said, and unshipped a key on a long chain. He un The man didn't answer. I went past the bathroom door towards him. A wh Christy French gave him a brief glance which had a kind of wonder in i \"Nothing. Oh, she might have called you a Tijuana hooker in riding pan \"I'd just rather not. I'm terribly afraid of Orrin's temper. And, well \"Uh-huh. Well that depends. I told you what my rates were.\"\nI grinned suddenly, bent over and quickly and with the grin still on m \"All I see is a guy without no hair,\" Beifus answered. \"Evidently something that could be there,\" French said. \"I didn't expe \"What about his habits? What does he do for funвЂ” besides not smoking o \"In Bay City?\" I asked. \"Why would he bother? Well, thanks a lot, Mr.  \"IвЂ”I'm afraid I can't tell you exactly the date. But it was like I sai\nI put the telephone receiver back on its hook, glanced out in the kitc \"I don't know,\" I said. \"I haven't read your fan mail.\" \"You know something,\" Hicks said politely, \"you're a Goddamn liar.\" \"I didn't answer it,\" I said. \"Like this.\" I reached over and pressed  The man on the bed looked old and hard and shrunken without his toupee\n\"Working the way you do,\" I said, \"you must be. You have to keep your  He smiled mirthlessly. \"Ain't been in town long, have you?\" I ducked. A few drops splattered me. The glass splintered on the wall  I grinned suddenly, bent over and quickly and with the grin still on m \"I wasn't going to eat it,\" I said. \"I'm not that hungry.\" He took a sShe reached a quick arm around my neck and started to pull. So I kisse\n\"Never the time and place and the loved one all together,\" I said. \"And with that,\" she said, completely calm, \"I believe I must have use \"What happens to people that get tough with you?\" I asked him. \"You ma She gave me a level, suddenly cool stare. \"Then why?\" Then when I didn \"Supposing I cared,\" he said, \"you figure you're that important?\" \"What happens to people that get tough with you?\" I asked him. \"You ma You could know Bay City a long time without knowing Idaho Street. And  I knocked the two longs and two shorts as instructed. Nothing happened\n\n"}