{"category": "ham", "to_address": "\"Matthew Johnson\" <debian@matthew.ath.cx>, debian-legal@lists.debian.org", "from_address": "\"Jason Spiro\" <jasonspiro4@gmail.com>", "subject": "Re: Could you please forward this proposed license to Teosto? (was: Re: Choosing a license for Frets on Fire songs)", "body": "2007/4/27, Matthew Johnson  wrote:\n> On Thu Apr 26 21:16, Jason Spiro wrote:\n>\n> > I don't know much about how to write licenses, and this is the first\n> > one I have ever written.  I figured that everything after the \"subject\n> > to the following conditions:\" would automatically override the initial\n> > permissions I gave.  I guess I was wrong?\n>\n> This is a very very good reason not to write your own. debian-legal\n> always advises against doing so. How about using:\n> http://creativecommons.org/licenses/by-nd-nc/1.0/legalcode with 4. d.\n> added saying:\n>\n>   You may not distribute, publicly display, publicly perform, or\n>   publicly digitally perform the Work except as part of the game.\n>\n> and 1. g.:\n>\n>   \"The Game\" means the game Frets on Fire or a derivative work of\n>   Frets on Fire.\n\nSounds like a better idea than using the license I wrote :)\n\nThough if we want to distribute the game in main and the music in\nnon-free shouldn't we write the 4. d. clause more liberally?  How\nabout \"You may not distribute the Work except in a form meant to be\nused with The Game.\"  (That'd mean \"except e.g. with frets data\nincluded alongside the music\"; can anyone suggest a better phrasing?)\n\nOr, how about this phrasing instead?  \"You may only distribute the\nWork if You intend that the work be used with game software.\"  This\nallows for the possibility of the Work to be used in other computer\ngames.\n\nWhat do you all think?\n\n> This would, of course, have to be renamed something else...\n\nHow does \"Frets On Fire\nAttribution-NoDerivs-NonCommercial-ForFretsOnly 1.0\" license sound?\n\nCheers,\nJason\n\n-- \nJason Spiro: computer consulting with a smile.\nI provide software development and training services to clients worldwide.\nContact me for a FREE consultation. Satisfaction guaranteed.\n+1 (416) 781-5938 / Email: info@jspiro.com / MSN: jasonspiro@hotmail.com\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}