{"category": "spam", "to_address": "Smiles <smiles@flax9.uwaterloo.ca>", "from_address": "Barbara Wilkerson <mmcom@gregbreck.com>", "subject": "Can you imagine that you are healthy?", "body": "\n\nCan you satisfy your girlfriend? Or you are afraid that she meets with someone who is better than you in bed?\nOur shop\nWe have only high-quality national medications at low prices. There is no need for someone to know about your sexual problems. \nBuy medications at RX online drug store!\nYou can find all medications at our online drugs store.\nWith best regards,\nBarbara Wilkerson\n \n \nDa ty ne stesniajsia, Esh, pej. Sprava nahodilos Shirokoe okno s zolotistymi poloskami zhaliuzi, riadom s nim miagkie kozhanye Kresla, bolshoe dvuhmetrovoe zerkalo, v kotorom ia uvidel sebia Rastrepannogo, vzvolnovannogo i vse eshche zhutko nebritogo. Zhenshchina iarostno zakrichala i Obrushila na nego kosoj rubiashchij udar, vkladyvaia v nego vsiu silu obeih ruk. Slabym potomu chto ono poseshchalo menia v samye Kriticheskie momenty moej zhizni i kasalos tolko menia samogo. \nTam net lichnosti, kotoruiu ty kogda-to Znal. No edva stupil na ulicu, kak tri vysokih silueta vyrosli peredo mnoj Slovno iz niotkuda. No nichego ne uvidel, krome sebia, polnostiu obnazhennogo, Podveshennogo sredi pustoty na nevidimyh nitiah boli, lipkoj pautinoj Oputavshih vse telo. Sotnica neistrebimyh zhivo vyshla iz zala, prihvativ po puti Leksa, s Nedovolnoj minoj otstavivshego nedopityj bokal, i oba snova kanuli v noch, pod Holodnyj neuiutnyj dozhd. Golubye mochalki dlinnouhoe, dominiruiushchie v lesah Kordosa, zdes Pochti polnostiu ischezli, snova smenivshis redko stoiashchimi kamneliubami i obshirnymi Piatnami lapnika, iz kotoryh, slovno miniatiurnye gory, izredka torchali Temno-zelenye piramidy miaguna. Kross po Gorodu izmotal menia, zastaviv vylozhitsia bez ostatka, Zapalennye legkie vse eshche hripeli pri kazhdom vzdohe, ia hvatal vozduh rtom Kak ryba, vybroshennaia na bereg, samochuvstvie bylo iskliuchitelno Toshnotvornym, i v dushe ia besilsia ot togo, chto nichego ne mogu podelat. Kogda on Snova popytalsia vstat, to smog sdelat eto uzhe samostoiatelno. Na vsiakij sluchaj ia myslenno shuganul chertej kuda podalshe, chtoby ne Sshivalis vozle nas so svoimi predpolagaemymi kaverzami. \nPostoiannaia boltanka ot planety k planete Nabila oskominu, vpechatleniia potuskneli ot izbytka, vypendrezh bolshinstva Ras nadoel do smerti, innost uzhe vyzyvala toshnotu, a ne liubopytstvo. Ia ne sovsem ponial naschet togo imeni, kotoroe iakoby moe nastoiashchee. Ej ostavalos vsego poltora metra, chtoby Shvatit menia poperek tulovishcha. Drugoj, pytaias vcepitsia sotnice v nogu, zarabotal Stol moshchnyj pinok sapogom pod briuho, chto s voem uletel v storonu Leksa, i voin Tut zhe oproboval na nem ostrotu svoego mecha. ejisuminyon Ql9aWFBCckBEUFRWShpARlNHUUddXVwaVlA=\n \n\n\n"}