{"category": "ham", "to_address": "<ip-health@lists.essential.org>", "from_address": "\"Josh Sarnoff\" <jsarnoff@wcl.american.edu>", "subject": "[Ip-health] Important US Supreme Court decision on obviousness (inventive step)", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nI have reproduced below some comments I made earlier on the ScotusBlog\nin regard to today's US Supreme Court decision in KSR v. Teleflex.  Of\nparticular relevance to this list, the Court reaffirmed its 1970\nholdings on combinations of prior art elements, which required the\ninvention to have an unexpected new function in order to be patentable;\nhowever, the Supreme Court did not apply those precedents when it\nnevertheless upheld the District Court decision that the claim at issue\nwas obvious.  The implications for combination medical products should\nbe obvious, and US law thus should be understood as more stringent in\nthis regard even than India's new rules (although India's rules may be\ncouched as subject matter rather than inventive step restrictions).\n\n\n\nIn its unanimous decision in KSR Int'l. Co v. Teleflex Inc., No. 04-1350\n(April 30, 2007), the Supreme Court expressly overruled the Court of\nAppeals for the Federal Circuit's \"teaching-suggestion-motivation\"\n(\"TSM\") test for finding a claimed invention obvious and reaffirmed the\nCourt's precedents (in light of the 1952 enactment of Section 103 and\nits holding in Graham v. John Deere Co. of Kansas City, 383 U.S. 1\n(1966)) regarding the obviousness of patents \"based on the combination\nof elements found in the prior art\" where there the combination \"does no\nmore than yield predictable results.\"  Slip op. at 11-12.  The Court's\ndecision has therefore called into question the validity of hundreds of\nthousands of claims in issued patents, and will likely lead to a\ndramatic change to the method by which the Patent Office, the courts,\nand the bar conduct their obviousness analyses.\n\n\n\nNevertheless, the Supreme Court's opinion appears self-consciously\nnarrow and provides little additional guidance for how to apply the\nGraham approach.  The Court's decision leaves unclear whether the party\nwith the burden of proving obviousness must demonstrate that \"there was\nan apparent reason to combine the known elements in the fashion claimed\nby the patent at issue,\" or only that the claim at issue if patented\nwould reflect an \"advance[] that would occur in the ordinary course\nwithout real innovation[, which] retards progress and may, in the case\nof patents combining previously known elements, deprive inventions of\ntheir value or utility.\"  Slip op. at 14, 15.  As the Court noted, \"as\nprogress beginning from higher levels of achievement is expected in the\nnormal course, the results of ordinary innovation are not the subject of\nexclusive rights under the patent laws.  Were it otherwise patents might\nstifle, rather than promote, the progress of useful arts.\"  Slip op. at\n24. Although the Court recited the Constitutional language, it did not\nexpressly hold that obviousness is a constitutional requirement.\nFurther, the Court left to later case law any consideration of the\nextent to which the Court of Appeals' more recent statements regarding\nthe flexibility of its TSM test is consistent with Graham and the\nSupreme Court's earlier precedents.  Slip op. at 18.\n\n\n\nIn discussing the proper legal standard to be applied to determine\nobviousness, the Supreme Court concluded that the Court of Appeals erred\ngenerally by adopting a \"rigid rule\" in its TSM test, by failing to\nacknowledge that a \"person of ordinary skill in the art is also a person\nof ordinary creativity, not an automaton,\" and by adopting \"[r]igid\npreventative rules that deny factfinders recourse to common sense\" in\nits efforts to avoid \"hindsight bias.\"  Slip op. at 15, 17.  The Court\nnoted that \"[w]hat matters is the objective reach of the claim,\" and\nwhether there was at the time of the invention \"an obvious solution\" for\na \"known problem.\"  Slip op. at 16.\n\n\n\nSpecifically, in this case the \"first error\" of the Court of Appeals was\nto look \"only to the problem the patentee was trying to solve.\"  Rather,\n\"any need or problem known in the field or endeavor at the time of\ninvention and addressed by the patent can provide a reason for combining\nthe elements in the manner claimed.\"  Slip op. at 16 (emphasis added).\nThus, any advantage that the combination may provide may also suggest an\n\"'implicit[]'\" motivation to make the combination, Slip op. at 18\n(quoting Alza Corp. v. Mylan Labs, Inc., 464 F.3d 1286, 1291 (2006)),\neven if the advantage was not one that the inventor contemplated or that\nthe patent itself disclosed.\n\n\n\nThe \"second error\" of the Court of Appeals was to assume that a person\nhaving ordinary skill in the art \"will be led only to those elements of\nprior art designed to solve the same problem.... Common sense teaches,\nhowever, that familiar items may have obvious uses beyond their primary\npurposes, and in many cases a person having ordinary skill will be able\nto fit the teachings of multiple patents together like pieces of a\npuzzle.\"  Slip op. at 16.  The Court thus implicitly rejected a\nlong-standing line of Federal Circuit cases that required some explicit\ndisclosure in the prior art of a motivation to combine to avoid using\nhindsight when combining multiple disclosures.  See, e.g., Ecolochem,\nInc. v. Southern California Edison Company, 227 F.3d 1361, 1371 (Fed.\nCir. 2000) ((\"[One] 'cannot use hindsight reconstruction to pick and\nchoose among isolated disclosures in the prior art to deprecate the\nclaimed invention.'\") (quoting In re Fine, 837 F.2d 1071, 1075 (Fed.\nCir. 1988)).\n\n\n\nApplying the law to the facts, the Supreme Court upheld the District\nCourt's conclusion that it was obvious \"to combine Asano [the fixed\npivot pedal assembly] with a pivot-mounted pedal position sensor.\"  Slip\nop. at 20.  The Court rephrased the question as \"whether a pedal\ndesigner of ordinary skill, facing the wide range of needs created by\ndevelopments in the field of endeavor, would have seen a benefit to\nupgrading Asano with a sensor.\"  Slip op. at 20.  The Court thus focused\non evidence regarding the state of the automotive design art.  Further,\nthe Court noted that \"[f]or a designer starting with Asano, the question\nwas where to attach the sensor.  The consequent legal question, then, is\nwhether a pedal designer of ordinary skill starting with Asano would\nhave found it obvious to put the sensor on a fixed pivot point.  The\nprior art discussed above leads us to the conclusion that attaching the\nsensor where both KSR and Engelgau [the inventor] put it would have been\nobvious to a person or ordinary skill.\"  Slip op. at 21.  Further, the\nCourt rejected argument that the prior art \"taught away\" from combining\nAsano with an electronic sensor, arguing that to judge the possibility\nof the combination based on its inferior function to a preferred\nembodiment of the claimed invention \"would be to engage in the very\nhindsight bias Teleflex rightly urges must be avoided.\"  Slip op. at 22.\nFinally, the Court rejected the argument that Teleflex had proved any\nsecondary consideration evidence (which the Court refers to as\n\"secondary factors\") that called the initial determination into\nquestion.  Slip op. at 22.  Although the Court remanded the cases, it\nrejected the argument that the existence of Teleflex's expert affidavit\nnecessarily precluded summary judgment for KSR, noting that the ultimate\njudgment of obviousness is a legal one.  Slip op. at 23, 24.  The Court\nthus apparently affirmed the District Court's summary judgment of\ninvalidity of Claim 4.  Slip op. at 22, 23.\n\n\n\nIn summary, the Court's test focuses on predictability and expected\nfunctions of combinations, rather than the inventive skill required to\nachieve them, and the Court's holding relied on evidence regarding the\nmotivations in the marketplace at the time of invention (but not\nregarding subsequent commercial success and other secondary factors).\nThe Court's focus thus will likely lead to greater Patent Office and\nlower court reliance on evidence regarding the nature of the person\nhaving ordinary skill in the art, the general state of the art and\nproblems in it, and (possibly) secondary considerations that would tend\nto show the (un)predictability of the result or the lack of motivation\nto solve problems that would lead to the claimed combination.  Thus, the\nCourt stated that \"[w]hen a work is available in one field of endeavor,\ndesign incentives and other market forces can prompt variations of it,\neither in the same field or a different one.... [and] if a technique has\nbeen used to improve one device, and a person of ordinary skill in the\nart would recognize that it would improve similar devices in the same\nway, using the technique is obvious unless its actual application is\nbeyond his or her skill.\"  Slip op. at 13.  However, the Court's opinion\ndoes not provide guidance regarding how to define who the person of\nordinary skill in the art is, which will then determine (through\nevidence) his or her level of knowledge, creativity, and ability to\nrecognize benefits of combinations.  We can thus expect that obviousness\ndeterminations will be more complex and more subject to dispute\nregarding the nature of the relevant evidence (and particularly\nregarding whether and when secondary consideration evidence is\nrelevant), which will make it harder to resolve obviousness issues in\nthe Patent Office or the courts or to determine the outcomes in advance.\nWe can also expect significant short-term litigation (and an increase in\npatent validity opinion work) as the validity of issued patents has been\ncalled dramatically into question, at least until the Congress, the\nPatent Office, or the courts develop more predictable rules for making\nobviousness determinations.\n\n\n\nFor those who are interested, I filed an amicus brief in support of\nPetitioner KSR Int'l. Co. in the Supreme Court on behalf of a group of\neconomists and legal historians, urging the Supreme Court to repudiate\nthe Court of Appeals for the Federal Circuit's TSM test, to reaffirm its\nprecedents, and to provide additional guidance on determining when\ninventions would routinely occur and the nature of technological\ninnovation required for nonobvious subject matter.  The brief is\navailable at http://www.patentlyo.com/patent/Sarnoff.pdf.\n\n\n\n\n\nJoshua D. Sarnoff\n\nAssistant Director\n\nGlushko-Samuelson Intellectual Property Law Clinic\n\nWashington College of Law\n\nAmerican University\n\nRoom 446A\n\n4801 Massachusetts Avenue, NW\n\nWashington, DC 20016, U.S.A.\n\n011.202.274.4165 phone\n\n011.202.274.0659 fax\n\njsarnoff@wcl.american.edu email\n\n\n\nThis message may contain information that may be confidential and\nsubject to the attorney-client privilege, work-product doctrine, or\nother applicable protection.  If you have received this message in\nerror, please advise the sender by reply e-mail and delete the message.\nIf you are not the intended addressee, you should not use, copy,\ntransfer, or disclose to anyone else this message, attached documents,\nor any information relating to this message.  Thank you very much.\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}