{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Krista Reaves\" <laxcristokenvew@cristoken.com>", "subject": "Say goodbye to extra pounds", "body": "\nBurn pounds off with Anatrim\n\n\n\n\n\nAnatrim – The latest and most delighting product for corpulent people is made available now – As you could see on ABC\n\n\n\nDid you realize excessive body kilos kill a plenty of people for every new year? We believe you hate the ugly look of those people and the low status they obviously have in society. \n\nMoreover, you can’t resist an assault of fatal eating habits of yours. If you think it sounds familiar, then we have something for you!\n\n\n\n\n\nHere Anatrim comes, the recent product for the reduction of your body’s extra weight. The most astounding thing is that Anatrim improves the quality of your life, making you crave less food and giving you better spirit. Look at what people write about this product:\n\n\n\n\n\n\"It’s great! \n\n\nI stopped watching TV continually and gorging everything close at hand \n\n\nI became more interested in doing sport.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I have a great form now and there are lots of men in my way!\"\n\n\n\n\n\n\nLusia R., New York\n\n\n\n\n\n\n\"Passive weight losing was of little help to me. This terrible hunger would just rush in and spoil everything. \n\n\nOne day I heard about Anatrim in the media advertisement and I was really effected by the information.\n\n\n I had attempted using it, and my wife said to me I look very good now, 5 months later. \n\n\n27 pounds have gone away and it is still far to an end! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nSteve Burbon, New York\n\n\n\n\n\nAnatrim helps you to realize that your body doesn’t need that much food. It raises your spirit, gives you extra energy, and attacks unnecessary kilos. All thanks to its mighty comprehensive formula!!\n\n\n\nPry out more useful information!\n\n\n\n"}