{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Automotive Newletter June 26, 2007", "body": "June 26, 2007 \nRSS | \nautomotiveThis Week's Highlights:\nHow to Drive EconomicallyGas Prices Explained\nHow MapQuest WorksHow GPS Receivers Work\nHow Interstate Highways are Numbered \nSummer Getaway Edition - Planning a summer road trip? Heading to relatives' for the July 4th holiday? In this edition of the HowStuffWorks Automotive newsletter, we help you get your car in shape for that road trip and plan your summer getaway. For inspiration, check out our \nimage gallery of\nscenic drives.   This week's trivia question:Suppose you are stopped at a railroad crossing for one minute. Which consumes more gas: keeping the engine running, or turning off and restarting your car? \nFind out here   \n \nHow to Drive Economically - With gas prices soaring, the cost of a summer road trip is on the rise. But there are a few things you can do -- before and during your trip -- to save money. Learn how tire inflation and regular vehicle maintenance affect your gas mileage and get tips for fuel-efficient driving. \n    This week's video:\nGas Prices Explained - Why are gas prices higher than they have been in the past? Learn about the factors that affect the price at the pump and find out what causes fluctuations in crude oil prices in this video from HowStuffWorks and Petro Canada. \n     Also at HowStuffWorks:\n \n\nHow MapQuest Works - If you're planning\na driving trip, chances are you'll use an online mapping service such as\nMapQuest to chart your route. Learn how MapQuest works and why errors sometimes\nhappen.\n \nHow GPS Receivers Work - Having a GPS receiver in your car can make you feel a lot more confident when traveling. Learn about the amazing technology behind GPS and read reviews of GPS devices. \n \nIs there any rhyme or reason to how U.S. interstate highways are numbered? When I-95 hits metropolitan Washington, D.C., it becomes the famous Beltway, signed I-495. North of the metro area, it becomes I-95 again. Find out how U.S. interstates are numbered. \n\n \n   Coming Soon:- Future Cars- Speedometers\n   \n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved"}