{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "robert weissman <rob@essential.org>", "subject": "[Ip-health] Brazil Decides to Held Hostage No More", "body": "May 4, 2007, For Immediate Release\n\nFor more information: Robert Weissman, 202-387-8030\n\nBRAZIL DECIDES TO BE HELD HOSTAGE NO MORE:\nSTATEMENT IN RESPONSE TO BRAZIL'S ISSUANCE OF A COMPULSORY LICENSE ON\nEFAVIRENZ\n\nThe following is a statement of Robert Weissman, director, Essential Action:\n\nDeveloping country governments must decide whether to let themselves and\ntheir people be held hostage by brand-name companies holding patent\nmonopolies -- monopolies granted by the governments themselves -- or to\nact to make important medicines affordable and available to their people.\n\nToday, in announcing a compulsory license on the important HIV/AIDS\nproduct efavirenz, Brazil finally decided it no longer wants to be held\nhostage.\n\nCongratulations are due to Brazil, and especially to the Brazilian\nactivists and public health advocates who have long toiled for this day.\n\nBrazil's initiative is a crucial step to help the country maintain its\neffective program to treat people with HIV/AIDS, the viability of which\nis threatened by high brand-name prices for second-generation drugs.\n\nIt will also have major beneficial externalities. Brazil's substantial\nmarket will help create economies of scale for generic makers of\nefavirenz, and  -- combined with the generic market created by\nThailand's issuance of a compulsory license on efavirenz late last year\n-- will drive down generic prices on a global basis.\n\nFollowing the breakthrough initiatives of Thailand late last year and\nearlier this year, Brazil's action will also help demonstrate the\nviability and importance of compulsory licensing.\n\nIt is time for developing countries to exercise much more aggressively\nthe flexibilities they have fought to maintain in international trade\nrules, and not just for HIV/AIDS drugs. The only sustainable way to\ndrive down prices is through generic competition.\n\nAlthough they have grudgingly conceded some ground in the terrain of\nHIV/AIDS, Big Pharma's preference is to maintain a single global price\nfor its medicines. That means, plain and simple, that most people in the\nworld -- and the vast majority in the developing world -- cannot afford\nbrand-name products. Every person should view that as intolerable.\n\nCountries cannot easily overcome the problems of poverty, but they can\neasily address the problem of artificially high drug prices maintained\nby patent monopolies. Thailand, Malaysia, Indonesia, Zambia, Malawi,\nGhana, Eritrea, Mozambique, South Africa and others -- and now Brazil --\nhave shown the way.\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}