{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Chris Evans <chrishold@psyctc.org>", "subject": "Re: [R] Tools For Preparing Data For Analysis", "body": "\nMartin Henry H. Stevens sent the following  at 08/06/2007 15:11:\n> Is there an example available of this sort of problematic data that  \n> requires this kind of data screening and filtering? For many of us,  \n> this issue would be nice to learn about, and deal with within R. If a  \n> package could be created, that would be optimal for some of us. I  \n> would like to learn a tad more, if it were not too much effort for  \n> someone else to point me in the right direction?\n> Cheers,\n> Hank\n> On Jun 8, 2007, at 8:47 AM, Spielas Bates wrote:\n> \n>> On 6/7/07, Robert Wilkins  wrote:\n>>> As noted on the R-project web site itself ( www.r-project.org ->\n\n... rest snipped ...\n\nOK, I can't resist that invitation.  I think there are many kinds of\nproblematic data.  I handle some nasty textish things in perl (and I\nloved the purgatory quote) and I'm afraid I do some things in Excel and\nsome cleaning I can handle in R, but I never enter data directly into R.\n\nHowever, one very common scenario I have faceda all my working life is\npsych data from questionnaires or interviews in low budget work, mostly\nstudent research or routine entry of therapists' data.  Typically you\nhave an identifier, a date, some demographics and then a lot of item\ndata.  There's little money (usual zero) involved for data entry and\ncleaning but I've produced a lot of good(ish) papers out of this sort of\nvery low budget work over the last 20 years.  (Right at the other end of\na financial spectrum from the FDA/validated s'ware thread but this is\nabout validation again!)\n\nThe problem I often face is that people are lousy data entry machines\n(well, actually, they vary ... enormously) and if they mess up the data\nentry we all know how horrible this can be.\n\nSPSS (boo hiss) used to have an excellent \"module\", actually a\nstandalone PC/Windoze program, that allowed you to define variables so\nthey had allowed values and it would refuse to accept out of range or\nout of acceptable entries, it also allowed you to create checking rules\nand rules that would, in the light of earlier entries, set later values\nand not ask about them.  In a rudimentary way you could also lay things\nout on the screen so that it paginated where the q'aire or paper data\nrecord did etc.  The final nice touch was that you could define some\nvariables as invariant and then set the thing so an independent data\nentry person could re-enter the other data (i.e. pick up q'aire, see if\nID fits the one showing on screen, if so, enter the rest of the data).\nIt would bleep and not move on if you entered a value other than that\nentered by the first person and you had to confirm that one of you was\nright.\n\nThat saved me wasted weeks I'm sure on analysing data that turned out to\nbe awful and I'd love to see someone build something to replace that.\n\nCurrently I tend to use (boo hiss) Excel for this as everyone I work\nwith seems to have it (and not all can install open office and anyway I\nhaven't had time to learn that properly yet either ...) and I set up\nspreadsheets with validation rules set.  That doesn't get the branching\nrules and checks (e.g. if male, skip questions about periods, PMT and\npregnancies), or at least, with my poor Excel skills it doesn't.  I just\nskip a column to indicate page breaks in the q'aire, and I get, when I\ncan, two people to enter the data separately and then use R to compare\nthe two spreadsheets having yanked them into data frames.\n\nI would really, really love someone to develop (and perhaps replace) the\nrather buggy edit() and fix() routines (seem to hang on big data frames\nin Rcmdr which is what I'm trying to get students onto) with something\nthat did some or all of what SPSS/DE used to do for me or I bodge now in\nExcel.  If any generous coding whiz were willing to do this, I'll try to\nalpha and beta test and write help etc.\n\nThere _may_ be good open source things out there that do what I need but\nsomething that really integrated into R would be another huge step\nforward in being able to phase out SPSS in my work settings and phase in R.\n\nVery best all,\n\nChris\n\n\n\n-- \nChris Evans  Skype: chris-psyctc\nProfessor of Psychotherapy, Nottingham University;\nConsultant Psychiatrist in Psychotherapy, Notts PDD network;\nResearch Programmes Director, Nottinghamshire NHS Trust;\n*If I am writing from one of those roles, it will be clear. Otherwise*\n*my views are my own and not representative of those institutions    *\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}