{"category": "spam", "to_address": "", "from_address": "Alexander Makelele <alexmak10@myway.com>", "subject": "", "body": "\n\n>From :The Desk of: Alexander Makelele \nContract Review Penal (CRP) \nFederal Ministry of Environment \nSouth Africa. \n\nDear Partner,\n\nRe: Urgent Funds for Investment. \n\nI am Alexander Makelele, a member of the Contract Review Panel of the \nFederal Ministry of Environment (FMESA), South Africa. I am contacting \nyou to be our reliable partner/agent to assist us to receive and \ninvestment of Three Million, One hundred Thousand United States Dollars only \ninto your designated bank account in subsequent investments in \neducation, properties, agriculture, construction, software design and supply, or any business of your choice, to initiate a proper and structured \nrelationship in your country. \n\nYou will be required to; \n\n(1). Assist in the transfer/receive of the above amountin your \ndesignated bank account (virgin or existing account). \n(2). Advised on lucrative areas for investment with a large yearly \nturn-over profit \n(3). Assist us in the purchase of properties \n(4). The fund is intended to be invested through you/your agency in the \npurchase of facilities and assets in your country. \n(5). This transaction will result in you being paid a commission of 30% \noff the investment capital. \n(6). The transaction desire absolute confidentiality and \nprofessionalism in the handling of this matter. \n\nPlease let me know what your response will be to an offer to receive \ninvestment funds in cash and if the above investment proposals interest \nyou and you sincerely wish to advice and assist, I urgently want you to \nme the information as stated below so that we can commence the mutual \nbeneficial transaction without delay and onward transfer of the funds \ninto your designated bank account; \n\n(1). Your Full Names and Address \n(2).Your Telephone and Fax Numbers and if available your cell phone \nNumber. \n\nYou shall be given 30% of the total sum of US$3.1M for the services \nrendered as soon as the funds are confirmed in your bank account within or \nless than 14 days of the final commencement/take-off of the \ntransaction/project. Moreover, our investment shall also be under your sole \nsupervision since you know what to invest in making profits in your country. \nYour swift copy of your email will be appreciated. \n\nYours faithfully, \n\nMr.Alexander Makelele.\n\n\n\n___________________________________________________________________________\nMail sent from WebMail service at - http://www.meik-edel.net\n\n"}