{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "drew Roberts <zotz@100jamz.com>", "subject": "Re: [cc-community] A Swarm of Angels media release form template", "body": "On Friday 27 April 2007 02:49 pm, Matt Hanson ^ V.I.A. wrote:\n> I am commencing a gather of video footage for the user-generated\n> documentary to accompany the A Swarm of Angels open movie project (\n> http://www.aswarmofangels.com/ ).\n\nSo, has A Swarm of Angels decided to go with a CC license that would be the \nart equivalent of the OSD? (less any source code requirements) If so, I think \nI would like to contribute.\n>\n> I am finalising a release form for members to include as part of their\n> uploaded media to the project. This is not a public submission so I\n> don't foresee any problems regarding permissions with the media, but I\n> would like it covered legally for the project, and to also to reassure,\n> and ensure the rights of, uploaders.\n>\n> I'd welcome comment on this text to its adequacy etc, and any\n> suggestions for modification.\n\nI thinkthe license might be a bit confusing. The confusion might arise due to \nnames for the two (one?) projects.\n\nIf there are indeed two projects:\n\nASWAM: A Swarm of Angels Movie\nASWAD: A Swarm of Angels Documentary\n\nThen I think you could clear up the possible confusion by beaing clear which \nis which in the text.\n\nI hope that is clear and helpful.\n>\n> \"A Swarm of Angels media release form\n>\n> Date:\n>\n> Name:\n> Forum name:\n>\n> I wish to be credited as:\n>\n> By uploading this file I hereby give permission irrevocably and\n> unconditionally for this media to be used as part of the A Swarm of\n> Angels project without condition other than to receive correct\n> attribution under the Creative Commons license set out below.\n>\n> The uploaded media contains no other copyrighted materials, including\n> music and images, that I am not entitled to give permission for use. I\n> assign permission for my likeness to be used in A Swarm of Angels\n> project materials, including, but not limited to, documentary video,\n> DVD, video podcast, printed & promotional materials.\n>\n> I understand this is a non-exclusive license and my fair dealing and\n> other rights are in no way affected.\n>\n> This work is licensed under the Creative Commons Attribution 3.0\n> License. To view a copy of this license, visit\n> http://creativecommons.org/licenses/by/3.0/ or send a letter to\n> Creative Commons, 171 Second Street, Suite 300, San Francisco,\n> California, 94105, USA.\"\n>\n> For those unfamiliar with the project, a quick note to reiterate that\n> all media associated with this feature film project will be released\n> under a CC license.\n>\n> Thanks,\n>\n> Matt\n>\n> //  Matt Hanson / Director\n> //  A Swarm of Angels. Remixing cinema\n> //  http://www.aswarmofangels.com\n\nall the best,\n\ndrew\n\n-- \n(da idea man)\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}