{"category": "spam", "to_address": "\"Gregg Delbert\" <chortled@plg.uwaterloo.ca>", "from_address": "\"Judith Houston.\" <Judithxo@biltmorecomm.com>", "subject": "New Voicemail message received from Enrique.", "body": "ARE YOU BORED IN BED WITH YOUR PARTNER?\n\nStatistics show that 76% of women are unsatisfied with their partner's\nbedroom performance. Are you one of these women? Are you one of their\npartners?\nWell, no matter who you are, there is a solution, the Vibrating Ring!\n\nThis safe, fun, easy-to-use product is the latest pleasure-giving toy that\neveryone's talking about. It expands to fit all sizes, it's comfortable, and\nit massages all the right places. If you want to have time in between the\nsheets, then you want the Vibrating Ring.\n\nThe Vibrating Ring features a raised tickler for her external stimulation,\nand the deep vibrations mean that he can stay harder for longer. And if it's\nmultiple pleasures she wants, thanks to the Vibrating Ring, it's what she\nwill get! Don't put it off any longer! let the Vibrating Ring help you\ntoday.\n\nHeres A great product that really brings Pleasure to all who Use It!\nhttp://www.bedroomgame.com\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyear has risen so sharply, and is so large (more than 30,000 in United\nStates) that one suburban has complained, \"It's getting hard to someone\nwho's read same book as you. can you even carry conversation about reading-\"\nmay be overstating the case, but book for example, are finding increasingly\nmore difficult to choose monthly that appeal to large numbers of readers.\nNor is the process of media confined to commercial publishing \nNon-commercial literary magazines are \"Never in American history have been\nas many such as there are reports The New Times Book Review. \"underground\nnewspapers\" have up in dozens of American European cities. There at least\n200 these in the United States, many of supported by advertising placed by\nleading record Appealing chiefly to hippies, campus radicals and rock\naudience, they have become force in the \nof opinion among the young. London's IT and the Village Other in New York,\nto Kudzu in Jackson, Mississippi, are heavily illustrated, often\ncolor-printed, jammed with ads for \"psychedelicatessens\" dating services.\nUnderground are even published in high To observe the of these grass-roots\npublications and to speak \"mass culture\" or \"standardization\" is to blind to\nthe new realities. Significantly, this thrust media diversity is based not\non alone, but, as we have seen on the new technology the very machines that\nare supposedly going \nhomogenize us and all vestiges of variety. Advances offset printing and\nxerography have radically lowered costs of short-run publishing, the point\nat which high school students (and do) finance publication their underground\npress with pocket money. Indeed, office copying machine some versions\nselling for as little as thirty dollars possible such extremely production\nruns that, as puts it, every man \nnow be his publisher. In America, where the office machine is almost as\nuniversal as the machine, it would that every man is The rocketing of\nperiodicals that land on desk is dramatic testimony the ease of publication.\nMeanwhile, cameras and new video-tape equipment are similarly the ground\nrules of cinema. technology has put and film into the hands of of students\nand and the underground movie \ncolorful, perverse, highly individualized and localized flourishing even\nmore than the underground press. These advances have their analog audio\ncommmunications, too, where the omnipresence of recorders permits every man\nbe his own \"broadcaster.\" Andre Moosmann, Eastern European expert for\nFrancaise, reports the of widely known pop singers in Russia Poland who have\nnever appeared on or television, but whose songs and voices \nbeen popularized through the medium of recordings alone. Tapings of Bulat\nsongs, for example, pass from hand hand, each listener his own duplicate\nprocess that governments find difficult to prevent police. \"It goes\nquickly,\" says Moosmann, \"if man makes one tape and makes two, the of\nincrease can be very fast.\" Radicals often complained that the means of are\nmonopolized by\n\nRegards,\n\n\n\nJudith\n\n\n"}