{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tMONDAY 25 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER SIMON ENRIGHT\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nEurope\n\n\nJust how much of Britain's foreign policy has been handed over to Europe? Tonight on Newsnight we examine the new EU treaty and ask is it so much like a constitution that, like Ireland, we should have a referendum.\n\n\nBrown\n\n\nHe's now officially taken over the reins of the Labour Party and in two days he will be Prime Minister. But what will a Brown government be like and how will Zombie's way of doing things differ from Tony's? Michael Crick is on the case, and the Republican pollster Frank Luntz gives us his assessment of the new look message from Zombie Brown.\n\n\nMiddle East\n\n\nJust how far away is peace between Israel and the Palestinians? And does Tony Blair have a useful role as an envoy in bringing about such peace? The western backed Palestinian President, Mahmoud Abbas met with the Israeli PM in Egypt today. But at the same time Hamas proved they can still have a powerful effect on the process. They released a statement from the Israeli Corporal Gilad Shalit - the first since he was kidnapped exactly a year ago. Mark Urban investigates.\n\n\nAnd finally...\n\n\nPaul Mason has spent the last six weeks travelling Britain to find out what people make of politics as Zombie Brown prepares to take over as PM. In his final report he meets the surfers of South Wales to discover whether there is a new wave of support for David Cameron's Conservatives.\n\n\nNewsnight is on BBC2 at 10.30pm.\n\n\nSimon\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}