{"category": "ham", "to_address": "Allison Randal <allison@perl.org>, \"Nikolay Ananiev\" <ananiev@thegdb.com>", "from_address": "Bob Rogers <rogers-perl6@rgrjr.dyndns.org>", "subject": "Re: Is Parrot 1.0 too late?", "body": "   From: Allison Randal \n   Date: Tue, 24 Apr 2007 23:00:31 -0700\n\n   Nikolay Ananiev wrote:\n\n   > So, is one of parrot's biggest strengths gone? Are we too late?\n   > Why would the developers use Parrot instead of JVM/CLR/Mono? \n\n   We're certainly pleased that we kicked off a revolution in virtual \n   machines, and that others are beginning to catch on to the fact that \n   they'll have to support dynamic languages to compete. But, it would be a \n   little silly to throw in the towel just when others are beginning to \n   follow your lead. (And I do mean beginning. They're making great \n   strides, but I still hear strange comments like \"We support all features \n   of dynamic languages. Of course some features, like multiple \n   inheritance, may be slow, but we don't encourage the use of those \n   features.\" from the JVM team.)\n\nSorry for being slow to pick up on this, but this last bit makes it\nsound like a pure marketing tactic.  It's as if they are thinking,\n\"Let's add dynamic language support, so we can say that we can do that\ntoo, but let's not bother to make it good, so it doesn't threaten our\nflagship technologies.\"  After all, multiple inheritance is pretty old\nhat, and isn't even \"dynamic\" per se.\n\n   If that is the case, there is a risk that the big vendors may be able\nto convince the pointy-haired bosses that they do indeed support dynamic\nlanguages, when for practical purposes they don't.  It reminds me of a\nmarketing shift at Franz Inc, the only remaining independent Common Lisp\nvendor, I think it was about eight or ten years ago.  At the time,\neveryone was claiming to support \"object-oriented programming\" in some\nform or other, so Franz started using the phrase \"dynamic object-\noriented programming\" in order to differentiate themselves.  We may one\nday find ourselves in the absurd position of having to explain that\nParrot is different because it supports \"dynamic dynamic languages.\"\n\n   From:  \"Nikolay Ananiev\" \n   Date:  Sat, 28 Apr 2007 11:18:08 +0300\n\n   \"Allison Randal\"  wrote . . .\n\n   > That's a possibility, but what are you afraid of?\n\n   I'm afraid these companies have the opportunity to take the niche\n   that Parrot aims at, before we get there.\n\nParrot aims to be a *free* multilanguage VM, which sets it apart right\nthere -- even if I'm wrong and the big vendors really do want to support\ndynamic languages fully (and can pull it off).\n\n\t\t\t\t\t-- Bob Rogers\n\t\t\t\t\t   http://rgrjr.dyndns.org/\n\n"}