{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Henrik Nilsen Omma <henrik@ubuntu.com>", "subject": "Re: Speakup kernel patch dropped from Ububtu Gutsy", "body": "\nI've appealed several times on this list for help to improve speakup \nsupport in Ubuntu, including server CD support. It's generated a bit of \ndebate, but no real contributions have been made towards that from the \nspeakup list.\n\nThat is a shame because this is probably the largest community anywhere \nof technically skilled visually impaired Linux users. The list is \npotentially a huge resource for helping less technical users have a \nbetter computing experience.\n\nWe have certain procedures for taking projects forward, which include \nwriting a spec and then finding people to do coding. When there are \nuseful code contributions from the community our dev team is happy to \nhelp accommodate and integrate that work. The same is true for the \nmainline kernel process.\n\nI am told that at the moment we have about 20 modules that are not in \nthe main kernel trees. This is generally to support new hardware or \nfeatures that will eventually find their way into the main kernel. That \nway we don't have to indefinitely maintain external patches. We \ngenerally don't maintain patches perpetually that are not on track to \nmove into mainline.\n\nUbuntu offered a channel by which the speakup module into the mainline \nkernel. But that requires a close collaboration with upstream (speakup) \nto help strengthen the code. Version control is also an issue; has \nspeakup moved to git yet?\n\nFor gutsy we are seeking to  actively reduce the number of external \nmodules and alternative configurations in the stock kernels. We will be \npreparing a few secondary kernels for special uses such as real-time. In \neach case there is an active community that uses those features who \nsupports it.\n\nThe fact that Gnome or X can crash is a problem for most people, not \njust the visually impaired. The average user who is faces with the \ncommand line will generally do a fresh install to fix it (possibly of \nWindows). The point is that the real answer is to make Gnome and X \nunbreakable, which we are working on.\n\nHenrik\n\nGene Collins wrote:\n> To put it in language you'll understand, that stinks.  Not everyone\n> wants to use a gui interface.  There are still functions under the gui\n> that are not accessible.  As for the argument that Speakup is not\n> popular, you have only to look at the number of Speakup users on this\n> list.  As for the maintenance issue, speakup is no more difficult to\n> maintain than any other of the hundreds of modules that habitually are \n> included.  The thing that makes building your own kernel more difficult\n> is Ubuntu's insistence on using an initrd for a standard system.  All\n> the extra hardware discovery stuff isn't necessary once a system is\n> installed.  Besides which, without speakup, there is no way to do a\n> server install, and Speakup has never been included in a manner that\n> would allow a blind person to do an install from a server cd.  Mot to\n> mention the times when Orca or Gnome crashes in some fashion, and the\n> only way to recover things is by using Speakup from a text console.  If\n> you really have maintenence issues, talk to Kirk and find a way to\n> resolve them.  I think the decission to drop Speakup from Ubuntu is\n> extreemly short sighted.\n>\n> Gene Collins\n>\n>   \n>> Hi,\n>>\n>> As part of an ongoing effort to bring our kernel tree closer with the \n>> mainline kernel (ideally identical) we have opted to drop the speakup \n>> patch from our tree.\n>>\n>> We have found it fairly difficult to maintain and it has not seen the \n>> kind of usage that the graphical systems (Orca, etc) have.\n>>\n>> It seems that many speakup users traditionally prefer to compile their \n>> own kernel, which will of course still be an option, and as Ubuntu \n>> approaches a fairly standard kernel this should be fairly easy.\n>>\n>> This does by no means mean that we are reducing our focus on \n>> accessibility. We have a range of new projects in the works both for the \n>> visually impaired and other groups. See: \n>> https://wiki.ubuntu.com/Accessibility/Specs\n>>\n>> Henrik\n>>\n>>\n>> ps. I originally sent this on 30/04, but as was not subscribed it must \n>> have bounced\n>>\n>> _______________________________________________\n>> Speakup mailing list\n>> Speakup@braille.uwo.ca\n>> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>>     \n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>   \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}