{"category": "ham", "to_address": "langa3@flax9.uwaterloo.ca", "from_address": "\"Windows Secrets\" <Editor@WindowsSecrets.com>", "subject": "Microsoft evades promise of Vista Ultimate Extras [Newsletter Comp Version]", "body": "\n\nMicrosoft evades promise of Vista Ultimate Extras\n\n\n\n\n\n\nIf your software garbles this newsletter, read \nthis issue \nat WindowsSecrets.com.\n\n\n\n   \n\n\n\n\n\n\n \n\n\n\n\nYOUR NEWSLETTER PREFERENCES\n Change\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nLocale: United States 90210\nReader number: 83107-13329\n\n\n   \n\n\n\n\n\n   \n\n\n\n\n Home \n Newsletter \n WinFind \n Reviews \n Polls \n Contact \n \n\n\n\n\n This issue \n Past issues \n Upgrade \n Prefs \n Unsubscribe \n \n\n\n\n\n   \n\n\n\n\n\n   \n\n\nWindows Secrets Newsletter • \nIssue 113 • \n2007-06-28 • \nCirculation: over 270,000\n\n   \n\n\n\n\n\n\n   \n\n\n\n \nContents\n\n\nTOP STORY: Microsoft evades promise of Vista Ultimate Extras\nKNOWN ISSUES: Questions linger on the Svchost.exe bug\nWACKY WEB WEEK: Gamer takes a different look at MS Surface\nPC TUNE-UP: How to supercharge your wireless router\nOVER THE HORIZON: Firefox needs NoScript to close vulnerability\nPATCH WATCH: WGA's tricky install is no advantage\nYOUR SUBSCRIPTION: How to change your address or unsubscribe\n\n   \n\n\n\n\n\n\n\n   \n\n\nFor links to every topic in this issue, scroll down to the \nIndex\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nRemotely monitor your PC from anywhere\nSnoopStick is a USB device that allows you to securely monitor activity on your PC from any Windows-based computer, anywhere. Monitor IM, browser activity, e-mail, and control access to Internet services. Great for parents and employers.\nwww.snoopstick.com\n\n\n\n\n\n\n\n\n\n \n\nForget Vista, make your XP system faster\nPC Pitstop's Optimize Scan 1.5 is easy-to-use software  that will automatically diagnose problems with your PC and give you a custom report detailing issues that are hurting your PC's performance. Run this free scan now!\nwww.pcpitstop.com\n\n\n\n\n\n\n\n\n\n \n\nDeep Six anti-spam appliance for SMBs\nPatented technology stops spam at the network edge. Designed for SMBs: the DS200 is the lowest cost, most accurate solution available. Easy to install and maintain. Recent firmware release features new Management GUI and enhanced tools. Try it risk-free.\nwww.tyrnstone.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\n\nTOP STORY\n\n\nMicrosoft evades promise of Vista Ultimate Extras\n\n\n\n\n\n\n\n\n\nBy \nScott Dunn\n\nThe Microsoft Corp. in January released Vista Ultimate, the priciest \nversion of the company's new operating system, with the promise of additional downloadable \"Extras,\" available only for the top-of-the-line product.\n\n\nMonths later, buyers of Vista Ultimate have seen no new Extras since the mere \nhandful that were offered around the initial Vista \nrollout.\n\n\n\n\n\n\n\n\nExtras were to enhance expensive Vista edition\n\n\n\nWhen Windows Vista was released to consumers on Jan. 30, the operating system \ndebuted in a number of different \"editions\" — versions with different \nfeatures and price ranges for different customers.\n\nThe so-called Ultimate \nedition combines the features of Vista Home Premium and Vista \nEnterprise. Vista Ultimate includes Media Center, DVD Maker, and Movie \nMaker — multimedia features of Home Premium that aren't in Vista \nEnterprise.  Also, Ultimate offers BitLocker drive encryption, support \nfor Unix-based apps, and Virtual PC Express, which Home Premium does \nnot.\n\nBut third-party multimedia and encryption features can easily be added to \nVista Home Premium and Vista Enterprise via downloads. The real allure of \nVista Ultimate was something that none of the other editions \nwould ever have: Ultimate Extras. Some of Microsoft's promises for \nthese Extras are shown in a Help screen in Vista's Windows Update control \npanel (see Figure 1).\n\nFigure 1: In the task pane of Vista's Windows Update control panel, \nyou can click Learn about Windows Ultimate Extras to display \nthe things Microsoft promised.\n\nSummarizing this feature, the \nmarketing site \nfor Windows Vista Ultimate states, \"These cutting-edge programs, \ninnovative services, and unique publications provide a richer \ncomputing experience for Windows Vista Ultimate users.\"\n\nAs indicated on the Vista Ultimate \nsite, \nthree Extras were released in connection with the launch of the product \nitself in January of this year. These were:\n\n• Language packs for the Multilingual User Interface (MUI).\n\n• Enhancements for Vista Enterprise's BitLocker and its \nEncrypting File System (EFS). Some sources, including the Microsoft \nmarketing site \nfor Ultimate, count these as two separate Extras.\n\n• A poker game in which you play \"Hold 'Em\" against the \ncomputer.\n\nSince January, no completed Extras have been released. A pre-release \nversion of Windows DreamScene — which lets you display videos \nas screen savers on your desktop, something that was possible with previous Windows versions using HTML — has been available for download \nsince March, but no finished version has yet been offered.\n\n\n\n\nUltimate users start to notice — and complain\n\n\n\nThe absence of new Extras has not been lost on the online community, \nsome of whom are beginning to complain vociferously in their blogs. \nFor example, a commenter named Larry on \nJosh's Windows Connected \nblog opines, \"It's high time someone brought this scam to light. \n$400 for Vista Ultimate, and nothing about it has been ultimate so \nfar.\"\n\nKeith Carey, another poster on the same site, echoes the sentiments \nof many that even the few existing Extras are nothing special. \n\"Ultimate has been a three trick pony with 1 trick few use (BitLocker), \none that is so-so (Texas Hold'em) , and the other more of a preview \n(DreamScene),\" he writes. \"If this was a standalone product and not \na version [of an operating system], we would be calling it vaporware.\"\n\nWindows Secrets contributing editor Woody Leonhard goes further, saying, \n\"The BitLocker Drive Preparation Tool really is a prerequisite for \nusing BitLocker, unless you perform a clean install.\" \nEven then, he points out, \"You have to go through some extraordinary machinations, from the command prompt, prior to installation.\" (The steps \nare explained in a forum posting by developer \nMark Minasi.) \nLeonhard concludes that the Drive Preparation Tool should have been part \nof Vista Enterprise in the first place and is hardly an Extra.\n\nIn addition, the MUI language packs are not unique to the Ultimate Extra \nprogram. They're available to all Vista Enterprise purchasers who used \nMicrosoft's Volume Licensing Program (as large enterprises typically would), \naccording to infrastructure design consultant  \nRaymond Comvalius.\n\nAdding mystery to the mix, one blogger, \nLong Zheng, \nclaims that a confidential source has revealed to him the real reason \nwhy Microsoft's video screen saver has been released in final form. \nDreamscene Extra, he writes, has such serious code problems that the \ncompany may have to keep it in perpetual beta. Dreamscene, for example, \nis reportedly unable to work properly on systems configured to use \nright-to-left languages, such as Arabic and Hebrew — an unbelievable \narchitectural flaw for a product that Microsoft would like to \nmarket as finished.\n\nWhy is Microsoft not following through on its Ultimate Extra promises? \nBlogger Zheng has his own theory:\n\n\n\n\"Another reliable source suggested there is not even an Ultimate team \nin existence anymore. Some suggest there were never a team to begin \nwith, more of a collection of people all over Microsoft who worked with \nmarketing on Ultimate Extras. This would explain the lack of direction, \ninsight and progress on Ultimate Extras if no one's responsible for \nit anymore.\"\n\nFor its part, Microsoft officially maintains the position that nothing is \nwrong. Asked about the lack of Extras or whether the responsible \nteam has been disbanded, a Microsoft spokesman responded only \nthat:\n\n\n\"We've released four Windows Vista Ultimate Extras this year \n— Windows Hold 'Em, Language Packs for the Windows \nmulti-language user interface, Secure Online Key Backup, and \nBitLocker Drive Preparation Tool. We plan to release more in \nthe future. We have no additional updates at this time.\"\n\n\nMore than 30% of Windows Vista buyers choose the Ultimate version, \naccording to March 2007 figures quoted by the \niTechNote \nblog. Many of these purchasers selected Ultimate on the promise of its Extras \nalone.\n\nIn my opinion, Microsoft has an ethical obligation to honor \nits own marketing hype and follow through with useful tools in a \ntimely way.\n\n\n\t\t\t\tReader, please rate the above article:\n1: Poor \n\t\t\t\t2: Fair \n\t\t\t\t3: Good \n\t\t\t\t4: Great  5: Superb\n\n\n\nScott Dunn is associate editor of the Windows Secrets Newsletter. He is \nalso a contributing editor of PC World Magazine, where he has written a \nmonthly column since 1992, and co-author of \n 101 Windows Tips & Tricks (Peachpit) with Jesse Berst and Charles Bermant.\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nBackup your data with ZipBackup\nFinally, a backup program that is easy to use.  ZipBackup's Wizard makes backups a snap for beginners. Filtering,  scheduling, and disk spanning make it a powerful tool for experts. For a limited time, Windows Secrets readers receive 25% off.\nwww.zipbackup.com\n\n\n\n\n\n\n\n\n\n \n\nGet your product seen by 270,000 readers\nDoes your company offer a product or service? Now you can place an ad in the Windows Secrets Newsletter and be seen by more than 270,000 active buyers of PC hardware and software. Bid as much or as little as you like to get the ideal ad placement.\nwww.WindowsSecrets.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\n\nKNOWN ISSUES\n\n\nQuestions linger on the Svchost.exe bug\n\n\n\nBy \nScott Dunn\nThe problems discussed in our June 21 issue surrounding svchost.exe, \na component of Microsoft Update that periodically consumes 100% \nof CPU time, raised questions about the related files that \nit touches.\n\nYou can get more info on these files — if you know \nwhere to look.\n\n\n\n\nMultiple instances of Svchost.exe are normal\n\n\n\nFollowing my \nJune 21 \nstory on the Svchost.exe problems, many readers, including David \nWard, wrote in with a question like this one:\n\n\n\n\"I took a look at my Task Manager to find that I have six \nSvchost.exe processes running. Is this right? Three are \nfor System, two are for Network Service, and one is for Local \nService. The highest memory usage is not more than 32,124 K, \nwhich is in System. I don't know if I should be \nconcerned.\"\n\nYes, this is very normal. Svchost.exe is a component of Windows \nthat runs services (processes like audio, fax, network functions, and \nmuch more). Multiple instances of Svchost.exe \ntypically run at the same time, each instance loading one or more \nservices. Unfortunately, Task Manager doesn't show which service(s) \neach instance is running.\n\nYou can find more information on Svchost.exe in Microsoft's \nKnowledge Base article \n314056. \nTo see what services normally run on your system, click Start, Run, \ntype Services.msc, and press Enter.\n\n\n\nHow to check Windows Update's version number\n\n\n\nThe \nsame story \ndiscussed the need to update the Windows Update client. But reader \nSuzanne Lutkoff had this question:\n\n\n\n\"I cannot find the information on which version of Windows Update \nI am running. Have looked in all the logical places. My laptop is \nset for Automatic Updates, and I don't always get to see what's \nbeing updated.\"\n\nTo learn whether you have the latest version of Windows Update, \nuse Windows Explorer to go to the Windows\\System32 folder and look \nfor a file called Wuaueng.dll (if your configured language is English). \nRight-click that file and choose Properties. Click the Version tab and \nthen select File Version under Item name. If the \"value\" (version) \ndisplayed is 7.0.6000.374 or above, then you have the needed fix.\n\n\n\nDownload pages posted for ZoneAlarm's Vista versions\n\n\n\nA few readers were confused about how to find \nthe new Vista versions of ZoneAlarm software that I discussed in the \nJune 21 issue.  Fortunately, Daniel Mitchell found a solution:\n\n\n\n\"The only way I could figure out to get the software is to download \na 'trial version' with a 15-day limit, and then enter the unique \nproduct code identifier when the software asked me to 'purchase the \nsoftware.' \"\n\nFor those who still need to get \ntheir Vista upgrade, Jaan Warnhoff of Sweden sent us a link to the \ndownload page \nhe received from Check Point Software customer service. \nRecently, Zone Labs has also added a \npage \nthat discusses its ZoneAlarm Vista products.\n\nReaders Mitchell and Warhoff will receive gift certificates for \na book, CD, or DVD of their choice for being the first to send \nus tips that we printed.\n\n\nContents\n Index\n\n\n\n   \n\n\n\n\n   \n\n\n\nTELL A FRIEND\n\nHow you can share this information\nWe love it when you send your friends links to our articles. But please don't \nforward your copy of our e-mail newsletter to people, which subjects us to spam \ncomplaints. Instead, simply suggest that your friends visit this issue's permanent \nWeb address, shown below. A complete index at the bottom of the \nWeb page provides you with hyperlinks to any article you'd like to recommend.\n\nThe address of this issue is http://WindowsSecrets.com/comp/070628\n\n   \n\n\n\n\n   \n\n\n\n\n\nEDITOR'S BOOKSHELF\n\n\n\n \n\n\n\nGet the tips you need about Windows Vista\n\n\n\nThe all-new Windows Vista Secrets helps novices \nand experts alike understand Microsoft's latest operating system. \n\"To really appreciate what is in Vista, you almost \nneed to read through the leading book on the product, Windows Vista \nSecrets, by Brian Livingston and Paul Thurrott,\" writes Rob Enderle, \nprincipal analyst of the Enderle Group, in TechNewsWorld. \"It's 595 \npages of things you can do with this product — most of which \nyou probably wouldn't have discovered for some time, let alone right \nat first.\" Check the book out now for tips you can use.\nMore information:\n United States / \n Canada / \n Elsewhere\n\n \n\n\n\nSpam-Proof Your E-Mail Address, 2nd Ed.\n\n\n\nThis 32-page e-book by Brian Livingston gives you step-by-step instructions that \ncan prevent 97% of the spam that would otherwise clog an e-mail\naccount. You could call it \"Livingston's Spam Secrets.\" The PDF e-book\nis the result of months of experiments and tests we conducted. We now\nreceive little or no spam to the addresses we used as guinea pigs. These tests\nshow that you can make your e-mail addresses invisible to spammers,\nnot just battle an ever-growing flood. The methods we describe\nwork with Windows, Apple, and Linux and don't require any filters or block\nlists — but you can use those in addition to the book's techniques,\nif you wish. \n\nMore info\n\n   \n\n\n\n\n\n   \n\n\n\nContents  \nIndex\n\n   \n\n\n\n\n   \n\n\n\n\nWACKY WEB WEEK\n\n\n\nGamer takes a different look at MS Surface\n\n\n\n\n\n\n\n\n\n\nThe big buzz in sexy new technology lately is \nMicrosoft Surface. \nThe concept is to embed a fancy, highly graphical computer into \na table top. \n\nBut not everyone is so excited by the possibilities. \nAmong the skeptics are the folks at \nThe Sarcastic Gamer. \nCheck out their twisted trailer extolling the virtues \n(or at least the vexations) of tabletop computing.\n\nWatch the video\n\n\n\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n\n   \n\n\n\n\nINDEX\n\n\n\nThe following topics appear in the free version\n\n\n\n\n\nTOP STORY  \nMicrosoft evades promise of Vista Ultimate Extras\n\n \nExtras were to enhance expensive Vista edition\n\n \nUltimate users start to notice — and complain\n\n \n \n\n\nKNOWN ISSUES  \nQuestions linger on the Svchost.exe bug\n\n \nMultiple instances of Svchost.exe are normal\n\n \nHow to check Windows Update's version number\n\n \nDownload pages posted for  ZoneAlarm's Vista versions\n\n \n \n\n\nWACKY WEB WEEK  \nGamer takes a different look at MS Surface\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou get all of the following in the paid version\n\n\nPC TUNE-UP  \nHow to supercharge your wireless router\n\n \nTalisman turns Wi-Fi into a super-router\n\n \nMS releases Media Player plug-in for Firefox\n\n \nHow to get really private browsing in Firefox\n\n \nSimple tweaks improve Firefox performance\n\n \n \n\n\nOVER THE HORIZON  \nFirefox needs NoScript to close vulnerability\n\n \nFirefox allows sites to piggyback on others\n\n \nGoogle Desktop lets hackers run programs\n\n \n \n\n\nPATCH WATCH  \nWGA's tricky install is no advantage\n\n \nMicrosoft is installing WGA by subterfuge\n\n \nServer 2003 service pack missing in action\n\n \nServers have a hidden 100-patch limit\n\n \nForget any Microsoft patching this week\n\n \nNo new OE/Windows Mail patch issues found\n\n \nMay 2007 IE rollup is fouled up — but fixable\n\n \nApple's new Safari browser needs patching\n\n \nMS releases tool to fix Windows OneCare\n\n \nMy thanks to all of you\n\n \n \n\n\n\nPaid subscribers can access all old and new paid newsletter content\nMake a contribution to support our research into Windows and you'll immediately\nbe able to read and search through scores of valuable articles. In addition,\npaid subscribers are entitled to download valuable content that we license for\nyou at least once every calendar quarter.\nTo upgrade, simply make a contribution of any amount you choose.\nIf you do this by July 4, 2007, \nyou'll instantly be sent the full, paid version of today's newsletter.\n\nTo upgrade to the paid version of the Windows Secrets Newsletter, please visit our \n upgrade page.\n\nThanks in advance.\n\n\n   \n\n\n\n\n\n   \n\n\n\nContents\n Index\n\n\n   \n\n\n\n\n\n   \n\n\n\nYOUR SUBSCRIPTION\n\n\nThe Windows Secrets Newsletter is published weekly on \nthe 1st through 4th Thursdays of each month, plus occasional news updates. \nWe skip an issue on any 5th Thursday that occurs, plus Thanksgiving \nWeek and the last two weeks of August and December.\nPublisher: WindowsSecrets.com LLC, Attn.: #120 Editor, 1700 7th Ave., \nSuite 116, Seattle, WA 98101-1323 USA. Vendors, please send no unsolicited \npackages to this address (readers' letters are fine).\nEditorial Director: Brian Livingston. Editor-at-Large: Fred Langa. \nAssociate Editor: Scott Dunn. Contributing Editors: Susan Bradley, Mark Edwards, \nWoody Leonhard, Chris Mosby, Ryan Russell. Research Director: Vickie Stevens. \nProgram Director: Brent Scheffler.\nTrademarks: Microsoft and Windows are registered trademarks of Microsoft \nCorporation. The Windows Secrets series of books is published by\n Wiley Publishing Inc. The Windows Secrets Newsletter,  \nWindowsSecrets.com, LangaList, LangaList Plus, WinFind, Security Baseline, \nPatch Watch, Perimeter Scan, Wacky Web Week, the Logo Design (W, S or road, \nand Star), and the slogan Everything Microsoft Forgot to Mention all are \ntrademarks and service marks of WindowsSecrets.com LLC. All other marks \nare the trademarks or service marks of their respective owners.\n\n\nYOUR SUBSCRIPTION PREFERENCES\n(change \nyour preferences):\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nCountry: United States\nZIP or postal code: 90210\nReader number: 83107-13329\nBounce count: 0\n\nYour bounce count is the number of times your server has bounced a \nnewsletter back to us since the last time you visited your preferences page. \nWe cannot send newsletters to you after your bounce count reaches 3, due to ISP \npolicies. If your bounce count is higher than 0 or blank, please visit your\n preferences page. This automatically resets your bounce count to 0.\nTo change your preferences: Please visit your \n preferences page.\nTo access all past issues: Please visit our\n past issues page.\nTo upgrade your free subscription to paid: Please visit our \n upgrade page.\nTo resend a missed newsletter to yourself: \nIf your mail server filtered out a newsletter, you can \nresend the current issue to yourself. To do so, visit your\n preferences page and use the Resend link.\nTo get subscription help by e-mail (fastest method): Visit our \n contact page. Subscription help by facsimile:\n206-282-6312 (fax). Emergency subscription help by phone: \n206-282-2536 (24 hours).\n\nHOW TO SUBSCRIBE: Anyone may subscribe to this newsletter by visiting our \n free signup page.\nWE GUARANTEE YOUR PRIVACY:\n\n1. We will never sell, rent, or give away your address to any outside \nparty, ever.\n2. We will never send you any unrequested e-mail, besides \nnewsletter updates.\n3. All unsubscribe requests are honored immediately, period.  \n Privacy policy\nHOW TO UNSUBSCRIBE: To unsubscribe\nlanga3@speedy.uwaterloo.ca\nfrom the Windows Secrets Newsletter,\n\nUse\nthis 2-click\n Unsubscribe link; or\nSend\na blank e-mail to\nunsub@WindowsSecrets.net with leave langa3@speedy.uwaterloo.ca\nas the Subject line; or\nVisit our \nUnsubscribe page.\n\n\nCopyright © 2007 by WindowsSecrets.com LLC. All rights reserved.\n\n\nContents\n Index\n\n\n\n\n\n\n   \n\n\n\n\n\n"}