{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Guilherme Veiga da Rocha <gvrocha@stat.berkeley.edu>", "subject": "[R] Information on objects of \"class by\"", "body": "\tHi all,\n\t\n\tDoes anyone know where to find more information on the \"by\" class?\n\t\n\tOR\n\t\n\tDoes anyone know how to coerce an object of the \"by\" class into a  \ndata.frame containing the results of FUN and the values of the  \ngrouping variables?\n\t\n\tOR\n\t\n\tDoes anyone know how to do the following:\n\t\n\tI have a big table with the results of many replications of an  \nexperiment and I want to summarize the medians according to the  \nexperimental parameters used.\n\tColumns 1-6 index the parameters used in that particular replication.\n\tColumn 7 is just an index to the replication number.\n\tColumn 8 is the variable I want to summarize\n\t\n\tI did:\n\tx=by(model.errors[, 8], model.errors[, 1:6], median)\n\t\n\tI now have an object of class \"by\" that seems to contain everything  \nI need.\n\tIf I just output \"x\" to the screen, I see all I need: the median for  \neach unique combination of values in model.errors[, 1:6].\n\tHowever, I only know how to access the information on the medians  \nthemselves by getting x[i] where i is the index of the median I want.\n\t\n\tThe problem is:\n\t- How do I retrieve the combination of values in model.errors[, 1:6]  \nfor a given index \"i\".\n\tOR\n\t- How do I determine the correct index \"i\" for a particular  \ncombination of the values in model.errors[, 1:6]?\n\t\n\tJust to help the thinking: I bypassed this problem for the mean by  \nusing lm and predict.\n\tI could in principle do the same using the L1 loss instead of the L2  \nloss in lm by I do not know how to do that...\n\tThis seems a rather convoluted solution for a problem \"by\" is meant  \nto solve easily...\n\t\n\tAny help is appreciated.\n\t\n\tThanks a lot,\n\t\n\tGuilherme Rocha\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}