{"category": "ham", "to_address": "\"\" <ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"The Internet Patrol\" <info@theinternetpatrol.com>", "subject": "The Internet Patrol -  Beware Fake Email from BBB (Better Business Bureau)\n  or IRS - They Look Real and Pack a Powerfu...", "body": "\n\n\nThe Internet Patrol\n\n\n The Internet Patrol\nhttp://www.theinternetpatrol.com\n\nBeware Fake Email from BBB (Better Business Bureau) or IRS - They Look Real and Pack a Powerful, Evil Punch\n Amazingly real looking phishing emails supposedly from the Better Business Bureau (BBB), and also \"from\" the IRS, are making the rounds. In the case of the BBB email, it claims that someone has lodged a complaint with the BBB against your business. This latest batch is particularly sinister because when you click on the link to look at the \"complaint\", it downloads a particularly malicious keylogger on to your computer.  \n Read more here: Beware Fake Email from BBB (Better Business Bureau) or IRS - They Look Real and Pack a Powerful, Evil Punch \n Here are some amazing deals we've found on the Internet for ourselves recently: \n Get gadget insurance for your cell phone, PDA and all your electronic gadgets, to protect against los or theft!  http://www.theinternetpatrol.com/get-your-stuff-back-with-stuffbak-pdas-laptops-cell-phones-protect-them-all  Send Unlimited Newsletters to Your Customers, Friends, Family, and Others:  http://www.theinternetpatrol.com/the-perfect-way-to-send-email-newsletters\n Unlimited Calls to Any Phone in the U.S.:  http://www.theinternetpatrol.com/make-unlimited-phone-calls\n Check out our online audio show, \"Three Things You Should Know\"!  http://www.ThreeThingsYouShouldKnow.com\n And check out the best collection of how to videos at http://www.LearnHowTo.TV ! \n Know somebody who would like to receive these alerts?  Forward this one to them and let them know that they can sign up for free by sending email to \"internetpatrol@aweber.com\" with the  word 'Subscribe' in the subject! \n  \n\n The Internet Patrol, \n302 W. El Camino Real, #411, \nSunnyvale, CA 94087, USA \n\n\n\nTo unsubscribe or change subscriber options visit:\nhttp://clients.suretymailings.com/z/r/?TBwMLMwctMzsTCxMTJzs\n\n\n"}