{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"ace\" <ace@talkingirc.net>", "subject": "Re: Speakup in mainline was: Gentoo dropping Speakup", "body": "I am certainly for this idea.  I feel that taking Speakup out of the kernel \nand putting it in userspace would be stripping it of its most valuable \nfeature--speaking from bootup to shutdown.  If the code can be updated and \nfixed properly, then it should be included in the mainline kernel.  Does \nanyone know what Linus's opinion of this is?\n\n----- Original Message ----- \nFrom: \"Igor Gueths\" \nTo: \nSent: Wednesday, June 20, 2007 6:52 PM\nSubject: Speakup in mainline was: Gentoo dropping Speakup\n\n\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA512\n>\n> Hi all. I have been observing this thread for quite some time, and one \n> question keeps jumping out at me, every time I see another message \n> regarding moving Speakup into userspace. Why is it\n> that instead of discussing ways to get Speakup into mainline, we are \n> contemplating rewriting Speakup as a userspace/hybrid program, thereby \n> introducing entirely new bugs/problems? Imo the only\n> thing we are doing by contemplating this possible rewrite, is shifting the \n> focus away from the underlying problem that afaik, has been with us since \n> the Linux-2.4 days. As has probably been\n> outlined here various times in the past, having Speakup in the mainline \n> kernel tree has several advantages; first, breakage/building problems \n> would be pretty nonexistent, since\n> the rest of the kernel community would at least have to acknowledge the \n> existence of Speakup in the tree. Also, Kirk's job of constantly rewriting \n> new code/fixing existing code as a result of\n> some change in a later kernel version would probably become significantly \n> easier, since the console/etc code that Speakup relies on for its \n> underlying operation, would have to be written and\n> or modified with Speakup in mind, not the other way around. What I am \n> trying to say by all this, is that the advantages to having Speakup in the \n> mainline kernel tree are numerous; however, the\n> problem is and has been getting to that point.\n>\n> Afaik there is still progress attempting to be made on this front, such as \n> a Git repository being made for Speakup and the driver patches. However, \n> as I understand it, Speakup's code needs\n> quite a bit of cleaning up befor it can be considered for inclusion into \n> mainline. Unfortunately, I am not nearly familiar enough with the kernel \n> code to be able to aid in this task; however,\n> I believe that if we all work together to achieve this goal, that it in \n> fact can be done. With regard to Gentoo dropping Speakup as of later \n> releases, while it is a setback as far as getting\n> Speakup into as many distros as possible goes, I don't see why it can't be \n> re-included in Gentoo at some later date, once build and possibly other \n> issues are resolved with Speakup patched into\n> Linux-2.6.22.\n>\n> In summary, imo userspace Speakup is not the only answer, nor is it the \n> correct one. Speakup should remain in the kernel, so as to provide the \n> best screen reading experience possible. However,\n> in order to achieve this end, we first need to get Speakup into mainline. \n> This may take quite a bit of time and hacking; however, in time, I think \n> it can be done. Feel free to add any comments\n> as necessary, I am curious as to what everyone has to say on this.\n> - -- \n> Igor\n> -----BEGIN PGP SIGNATURE-----\n> Version: GnuPG v1.4.7 (GNU/Linux)\n>\n> iQIVAwUBRnmvmae2pgKIdGq4AQrO4BAAgucAkYTewJ76iwtIriNh6gPvZ3dhVWyB\n> lKgeryDAjR2W64A+bHiU4eMQifo/5j9TBLYqVqJQYA/CznndMcHPmOnx9vYEt1bz\n> mFeMqD6JWOqPnqdY/6GMyqPcFR93jom4555FPzr0Be65XeBHCuUzOphFHb7K+j70\n> cgc/jfs0gg7Xa7YX0r3jZaC2tt3XAbXEZX6nylduV0PgrKDu+POs64dEYOh0z0QA\n> yumt72iIf8JQDoYLvRu/3zviRC2yTuIM1fkyzyJ5nq6hAOkw/bxM8gkKQT1itWpx\n> zzKP9UAkjDeT9Vun+lFz2ylT7I5gIk+Ox4FT1UV3SPUQT4Nh313OWPhxpQoWuImF\n> +Kxggj0XvuW8/91xYq8Zj2wiz4joNjRMVHC0XyAwl6x7q+G/0Avu6xdvAwT06wO+\n> xFeZ+ujX/UDYdENVSGEUNI47tWGtJNkvgKYlwYi+zcuQ/sxZweSgmDiCOd4ri//A\n> ezOezo16dV9xekykFzLRR5qHmQDnNGg7NMlGZ5rmKdQoOAJioQyIsa0hdu0q1VDe\n> LGJkU12Zai2FzG55Rteq94wgK/XDK/P7xjJdv1IPyoMIrdGe3QCyHLp81rf/CNuK\n> QltwWdhZlwGe+K0xUlF7YBtG9zp0ZtRsrTP5YRYZwBZhmLKFrGsa92iWfp77vMXs\n> 2VoKSJFYXrQ=\n> =HhvU\n> -----END PGP SIGNATURE-----\n>\n> -- \n> This message has been scanned for viruses and\n> dangerous content by MailScanner, and is\n> believed to be clean.\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n> __________ NOD32 2343 (20070621) Information __________\n>\n> This message was checked by NOD32 antivirus system.\n> http://www.eset.com\n>\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}