{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nEU Full Market Opening: The End of the Beginning (UtiliPoint.com - Jul. 2, 2007) \n\n\n\nUtiliPoint.com - Jul. 2, 2007 - It is now July and the deadline for full energy retail market opening in the European Union (EU) has passed, yet the European Commission's desired goal of a single, efficiently functioning European energy market remains a distant possibility rather than an imminent actuality.\n\n\nJul 2, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jul. 2, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jul. 2, 2007\n\n\nJul 2, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for July 2, 2007  \n\n\n\nFirst Enercast Featured Articles for July 2, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nJul 2, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nFollow procedure to restore natural gas, electric service\n\n\n\nJul. 1--NorthWestern Energy natural gas and electric customers in Aberdeen must take specific precautions and repairs before services can be restored after the flood.  NorthWestern Energy spokesman Tom Glanzer said that as of Thursday, 90 natural gas and 24 electric customers were without services. According to a press release from NorthWestern Energy, customers need to replace all natural gas ...\n\n\nJul 1, 2007 Knight Ridder Tribune Business News\n\n\n\nOntelaunee Energy Center feeding need for power: Dynegy Inc.'s five-year-old plant generates up to 580 megawatts.\n\n\n\nJul. 1--It's Berks County's newest power plant and, at 580 megawatts, the county's largest in terms of electrical generating capacity.  \"To put that into perspective, that's about 500,000 homes that we can power,\" said Joseph C. Lloyd, plant manager of Ontelaunee Energy Center, which went online in 2002. Located at 5115 Pottsville Pike, or Route 61, in Ontelaunee Township, the plant is fueled by ...\n\n\nJul 1, 2007 Knight Ridder Tribune Business News\n\n\n\nNEW: Brief power outage affects 5,500\n\n\n\nJul. 2--The 5,500 Howard County residents who lost power Monday morning have a squirrel to thank.  \"Believe it or not, that's not that uncommon,\" said Duke Energy spokeswoman Angeline Protogere. \"A squirrel interfered with some of the equipment,\" she said. The squirrel caused a power shortage at one of the substations located at 401 S. Main St., Protogere said.\n\n\nJul 2, 2007 Knight Ridder Tribune Business News\n\n\n\nWeek in review: Syntroleum, Tyson to build fuels plant: Tulsa-area apartment market tightens\n\n\n\nJul. 1--Occupancies are  up across the board at Tulsa-area apartments. A midyear survey by CB Richard Ellis/Oklahoma shows that the average complex is 92.5 percent full, which erased a dip to 91.5 at the start of the year. And that's driving up rent at a rapid pace, as the average monthly bill has increased $10 to $14 per month over the last six months and reached record highs for the area, said ...\n\n\nJul 1, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nAgency: Power Plant Contracts Should Be Rejected\n\n\n\nA state agency that represents electric ratepayers says a series of contracts to help pay for new power plant construction should be rejected because the contracts could cost ratepayers nearly $2 billion, and are not cost effective. The four power projects selected by state regulators in April are designed to save ratepayers money over the next 15 years by helping to create new generation ...\n\n\nJul 2, 2007 Hartford Courant\n\n\n\nA Very Good Year for Wind Energy\n\n\n\nThe American Wind Energy Association is predicting a  record-breaking year in 2005. The association says there is 2,500 megawatt (MW) of capacity planned for installation, far more than the industry's record of 1,696 MW in 2001. One MW of wind capacity generates as much electricity as that used by about 300 households. The association's prediction means as many as 750,000 homes could be served by ...\n\n\nJul 1, 2007 Mother Earth News\n\n\n\n\n\nAvista Energy Sale to Coral Energy Finalized\n\n\n\nSPOKANE, Wash., July 2 /PRNewswire-FirstCall/ -- Avista Corp. (NYSE: AVA) today announced the closing of the sale of substantially all of the contracts and ongoing operations of Avista Energy, Inc., a subsidiary of Avista Corp., to Coral Energy Holding, L.P., and certain of its subsidiaries (Coral Energy), a subsidiary of Shell.\n\n\nJul 2, 2007 PR Newswire\n\n\n\nNorcia Named MichCon President and COO\n\n\n\nDTE Energy announced today that Jerry Norcia has been named president and chief operating officer of Michigan Consolidated Gas Co. (MichCon), a subsidiary of DTE Energy, a Detroit-based diversified energy company involved in the development and management of energy-related businesses and services nationwide. MichCon serves 1.3 million customers with natural gas service in 550 Michigan ...\n\n\nJul 2, 2007 PR Newswire\n\n\n\nGolden Triangle Storage Files for FERC Certificate\n\n\n\nGolden Triangle Storage, Inc., a subsidiary of AGL Resources (NYSE: ATG), filed an application with the Federal Energy Regulatory Commission (FERC) on June 29, 2007, requesting a Certificate of Public Convenience and Necessity to construct and operate a proposed underground natural gas storage project with market-based rates. The project is located on the southern edge of Beaumont in Jefferson ...\n\n\nJul 2, 2007 PR Newswire\n\n\n\nFitch Comments on DTE Sale of Interest in Power & Industrial Projects\n\n\n\nCHICAGO--(BUSINESS WIRE)--Today's announcement by DTE Energy Co. (DTE) that it had reached an agreement to sell a 50 percent interest in a portfolio of select Power & Industrial projects to GE Corporate Lending will not have a near-term effect on DTE's ratings. The company expects to realize gross proceeds of $805 million (approximately $650 million after-tax) from the sale and a refinancing of ...\n\n\nJul 2, 2007 Business Wire\n\n\n\nSpectra Energy Honors Employee Achievement With First Summit Awards Recognition\n\n\n\nHOUSTON, July 2 /PRNewswire-FirstCall/ -- Spectra Energy has selected 26 employees as winners of the company's first Summit Award recognition program. The honorees were recognized for their outstanding actions and visionary thinking in the areas of Safety, Stewardship, Integrity, Respect, Initiative, Performance and Relationships.\n\n\nJul 2, 2007 PR Newswire\n\n\n\nDominion Completes Merger of CNG Subsidiary Into Holding Company\n\n\n\nRICHMOND, Va., July 2 /PRNewswire-FirstCall/ -- Dominion (NYSE: D) announced today that it has completed the merger of its wholly owned subsidiary, Consolidated Natural Gas Company, into the parent holding company, Dominion Resources, Inc., as part of a move to streamline its corporate structure. The merger was effective at 12:01 a.m. on Saturday, June 30.\n\n\nJul 2, 2007 PR Newswire\n\n\n\nPerry Enters Outage for Maintenance Work\n\n\n\nNORTH PERRY, Ohio, July 2 /PRNewswire-FirstCall/ -- FirstEnergy Nuclear Operating Company (FENOC) announced today that work began over the weekend at the Perry Nuclear Power Plant to replace a motor in the Reactor Recirculation System. The 20-ton motor is one of two motors in the system that controls the flow of water to the reactor vessel, allowing plant operators to raise and lower reactor ...\n\n\nJul 2, 2007 PR Newswire\n\n\n\nAMP-Ohio Joins Prairie State Energy Campus Partner Group With Commitment to 300 Megawatts of the Project\n\n\n\nST. LOUIS, July 2 /PRNewswire-FirstCall/ -- The Prairie State Energy Campus today announced that it has entered into an agreement with American Municipal Power-Ohio (AMP-Ohio) with a commitment to 300 megawatts of the project. 'We've provided reliable, affordable electric power to our customers for more than three decades,' said AMP-Ohio President and CEO Marc S. Gerken, PE.\n\n\nJul 2, 2007 PR Newswire\n\n\n\nOpen Energy Receives $4.21 Million Order From SolarPro\n\n\n\nOpen Energy Corp. (OTCBB: OEGY), a  Open Energy Corp. (OTCBB: OEGY), a renewable energy company focused on providing solar solutions to its residential and commercial customers, today announced a $4.21 million dollar purchase order for SolarSave&#174; PV Tiles from SolarPro International,  a solar integrator based in Sacramento, California. Open Energy's building integrated PV tiles will be ...\n\n\nJul 2, 2007 Internet Wire\n\n\n\nLocus Technologies to Promote Seminar on Carbon Trading and Finance in San Francisco\n\n\n\nLocus Technologies (Locus), the industry  Locus Technologies (Locus), the industry leader in Web-based environmental data and information management services, will join Global Change Associates and Pillsbury Winthrop Shaw Pittman LLP to promote a seminar on carbon trading and finance.  The seminar will be held on July 17, 2007, at Pillsbury's San Francisco office at 50 Fremont Street.\n\n\nJul 2, 2007 Internet Wire\n\n\n\nOPT's PowerBuoy Grid Connection Compliant with International Standards\n\n\n\nPENNINGTON, N.J.--(BUSINESS WIRE)--Ocean Power Technologies, Inc. (Nasdaq: OPTT and London Stock Exchange AIM: OPT) (OPT or the Company) announced that its PowerBuoy interface with the electrical utility power grid has been certified as compliant with international standards. An independent laboratory, Intertek Testing Services, provided testing and evaluation services to certify that the OPT ...\n\n\nJul 2, 2007 Business Wire\n\n\n\nIncreased Use of Solar Power Could Add 123,000 New Jobs by 2030\n\n\n\nAUSTIN, Texas--(BUSINESS WIRE)--Development of the solar energy industry in Texas would have a significant economic impact for consumers, the environment and workers, according to a new white paper released by the IC Institute at the University of Texas at Austin. Opportunity on the Horizon: Photovoltaics in Texas finds that the near-term benefits of nurturing the solar energy industry in Texas ...\n\n\nJul 2, 2007 Business Wire\n\n\n\nBrett White Elected to Edison International and Southern California Edison Boards of Directors\n\n\n\nROSEMEAD, Calif.--(BUSINESS WIRE)--Edison International (NYSE:EIX) and Southern California Edison today announced that Brett White, president and chief executive officer of CB Richard Ellis, Los Angeles, has been elected to the companies boards. We are delighted to welcome Brett, said John Bryson, chairman of Edison International. He is an astute business leader with a record of demonstrated ...\n\n\nJul 2, 2007 Business Wire\n\n\n\nRange Fuels Awarded Permit to Construct the Nation's First Commercial Cellulosic Ethanol Plant - Groundbreaking to Happen This Summer\n\n\n\nRange Fuels announced today that the company was awarded a construction permit from the state of Georgia to build the first commercial-scale cellulosic ethanol plant in the United States. Ground breaking will take place this summer in Treutlen County, Georgia for a 100-million-gallon-per-year cellulosic ethanol plant that will use wood waste from Georgia's forests as its feedstock.\n\n\nJul 2, 2007 PR Newswire\n\n\n\nPenn Virginia Resource Partners, L.P. Announces Two Acquisitions of Coal Reserves and Other Assets in the Illinois Basin\n\n\n\nRADNOR, Pa.--(BUSINESS WIRE)--Penn Virginia Resource Partners, L.P. (NYSE:PVR) today announced the acquisition of fee or lease rights to approximately 51 million tons of coal reserves, along with a preparation plant and coal handling facilities, in western Kentucky from a private seller for $42.0 million in cash. In addition, PVR announced the acquisition of approximately 9 million tons of coal ...\n\n\nJul 2, 2007 Business Wire\n\n\n\n\n\nCPS Energy agrees to buy natural gas at a discount\n\n\n\nCPS Energy has entered into a long-term natural gas supply agreement that is projected to save gas customers in excess of $100 million on their utility bills over the next 20 years. On June 14, the newly established, nonprofit SA Energy Acquisition Public Facility Corp. sold tax-exempt revenue bonds to prepay for a 20-year supply of natural gas. The corporation, in turn, has agreed to sell ...\n\n\nJul 2, 2007 San Antonio Business Journal\n\n\n\nAvista Completes Sale of Avista Energy Trading Subsidiary to Shell Subsidiary\n\n\n\n- 3:07 p.m. SPOKANE, Wash. (AP) - Avista Corp. said Monday it closed the sale of its energy trading subsidiary to Shell subsidiary Coral Energy Holding LP. Avista said it plans to use most of the $175 million generated from the deal and the pending liquidation of some other assets to invest in its utility business. The sale included most of the contracts and operations of the Avista Energy ...\n\n\nJul 2, 2007 Canadian Business Magazine\n\n\n\nNuclear Energy Using New Momentum to Take on Old Obstacles\n\n\n\nJay Lindsay BOSTON (AP) - Thanks to global warming, nuclear energy is hot again. Its promise of abundant, carbon emissions-free power is being pushed by the president and newly considered by environmentalists. But any expansion won't come cheap or easy. The enormous obstacles facing nuclear power are the same as they were in 1996, when the nation's last new nuclear plant opened near the Watts Bar ...\n\n\nJul 1, 2007 Canadian Business Magazine\n\n\n\nKinder Sells Natural Gas Pipeline to Oneok for $300 Million\n\n\n\nHOUSTON (AP) - Kinder Morgan Energy Partners LP on Monday agreed to sell a gas pipeline system from Kansas to Chicago to Oneok Partners LP for $300 million. Kinder said it the system is no longer a strategic asset. The company plans to use the money for other parts of its energy business. Oneok confirmed the terms of the deal in a separate release. The company also is acquiring Kinder's ...\n\n\nJul 2, 2007 Canadian Business Magazine\n\n\n\nRange Fuels' ethanol plant to break ground\n\n\n\nRange Fuels announced it's received a construction permit from the state of Georgia to build the first U.S. commercial-scale cellulosic ethanol plant. Ground breaking in Soperton, Ga., is set to take place this summer for a 100-million-gallon-per-year cellulosic ethanol plant, with completion of the first phase expected in 2008. The plant will use wood waste from Georgia's forests as its ...\n\n\nJul 2, 2007 UPI\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nYingli Green Energy Wins Significant Sales Contract In Spain\n\n\n\nBAODING, China--(BUSINESS WIRE)--Yingli Green Energy Holding Company Limited (NYSE: YGE), a leading vertically integrated photovoltaic, or PV, product manufacturer in China, announces today that it has entered into a sales contract with Control y Montages Industriales CYMI S.A. (CYMI) to supply 9.55 megawatts of PV modules to CYMI in 2007. Mr. Liansheng Miao, the chairman and CEO of Yingli Green ...\n\n\nJul 2, 2007 Business Wire\n\n\n\nNew Report Gives the Vital Details on Indonesia's Energy Market at a Glance\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c61180) has announced the addition of Indonesia Energy Market Supply and Demand Outlook Report to their offering. The Indonesia Energy Market Supply and Demand Outlook Report allows a quick understanding of the key factors in the countrys energy market. This report provides an historical perspective ...\n\n\nJul 2, 2007 Business Wire\n\n\n\nPressure mounts on Merkel to drop plans to close nuclear plants\n\n\n\nBERLIN: One day before an important government strategy session on energy, Chancellor Angela Merkel faced increased pressure Monday from her own camp to reverse course on closing Germany's nuclear power plants, despite public opposition, as a way to help fight global warming. Roland Koch, the conservative state premier of Hesse, said it was time the government reconsidered the coalition agreement ...\n\n\nJul 2, 2007 International Herald Tribune\n\n\n\nIBM Establishes Global Center of Excellence for Nuclear Power\n\n\n\nIBM (NYSE: IBM) today announced that it is  IBM (NYSE: IBM) today announced that it is establishing a Global Center of Excellence for Nuclear Power in La Gaude, France, to support safe, reliable and efficient electricity generation by energy companies worldwide.  The new Center extends IBM's on-going work with leading nuclear power companies to support improved design, construction, safety and ...\n\n\nJul 2, 2007 Internet Wire\n\n\n\nResearch and Markets : Country Energy Profile -- United Kingdom\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c61430) has announced the addition of Country Energy Profile -- United Kingdom to their offering. Over the last century, energy has become the fundamental to the quality of our lives. The worldwide energy consumption has been growing steadily since the industrial revolution; however, the twentieth ...\n\n\nJul 2, 2007 Business Wire\n\n\n\nAdvisor on first western-funded wind project in China appointed\n\n\n\n- SgurrEnergy, a UK-based independent renewable energy consultancy, has been appointed to advise on a multi-million pound wind farm development in China. The company will provide technical advice on the first-phase of the Bailingmiao project on behalf of Honiton Energy, a company emerging as China's fastest-growing alternative energy provider. The project is the first Chinese wind farm to be ...\n\n\nJul 2, 2007 Power Engineering\n\n\n\nAn Overall Picture of Japan's Energy Markets\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c61399) has announced the addition of Country Energy Profile  Japan to their offering. Over the last century, energy has become the fundamental to the quality of our lives. The worldwide energy consumption has been growing steadily since the industrial revolution; however, the twentieth century saw a ...\n\n\nJul 2, 2007 Business Wire\n\n\n\nSpanish breaker power project to use Wavegen model\n\n\n\n- The worldwide first commercial breakwater wave energy plant will be built at the Spanish Atlantic coast based on Voith Siemens Hydro Power Generation's wave technology. The customer is the Basque Energy Board, Ente Vasco de Energia and the new plant in Mutriku in Northern Spain will work with the Oscillating Water Column (OWC) technology first demonstrated at Voith Siemens Hydro's Scottish ...\n\n\nJul 2, 2007 Power Engineering\n\n\n\nOil back above $71\n\n\n\nNEW YORK (Reuters) -- Oil prices rose to 10-month highs above $71 on Monday on expectations that recovering refinery operations in the United States and ongoing supply restrictions will cut into global oil inventories. Analysts expect weekly U.S. oil data on Thursday to show a decline in crude oil inventories as more U.S. refineries resume operations after an unusually long and extensive spring ...\n\n\nJul 2, 2007 Fortune\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}