{"category": "ham", "to_address": "Andrea Glorioso <andrea@digitalpolicy.it>", "from_address": "Jeff Williams <jwkckid1@ix.netcom.com>", "subject": "[Ip-health] Re: [A2k] Huffington Post: U.S. government opposition to term \"access to knowledge\" in key WIPO negotiation", "body": "Andrea and all,\n\n  \"Access ccess to knowledge\" means exactly what it says.  Nothing more\nand nothing less.  Any other meaning is contrived and therefore not\naccurate regardless of context.\n\nAndrea Glorioso wrote:\n\n> --\n> >>>>> \"Judit\" == Judit Rius Sanjuan  writes:\n>\n>     > Here \"access to knowledge\" is referred to by many simply as A2K,\n>     > a term that is apparently terrorizing the many lobbyists for\n>     > publishers. I'm hoping the U.S. will come around, and agree that\n>     > yes, the U.N. can actually \"discuss possible new initiatives\" to\n>     > facilitate \"access to knowledge.\" It is rather amazing that this\n>     > is even controversial.\n>\n> If I may..  when we scratch  the surface, I  think lots of people give\n> different meaning to the term \"access to knowledge\". Although I do not\n> share  nor condone the reasons   why  various countries  at WIPO  (and\n> elsewhere) do not want to use the term, I think we  might want to make\n> sure that even the proponents of A2K  have a true common understanding\n> of what the term ought to mean, and not just one that shifts according\n> to  the tactical opportunities  they are faced with  -  which is a bad\n> thing in and by itself, but might be  counter-productive in the remote\n> case we are ever in a position to plan in the *real* long term.\n>\n> Or does this mean I am the only one that has some doubts on the actual\n> meaning of A2K?\n>\n> Ciao,\n>\n> --\n>       Andrea Glorioso || http://people.digitalpolicy.it/sama/cv/\n>           M: +39 348 921 4379        F: +39 051 930 31 133\n>        \"Truth is a relationship between a theory and the world;\n>        beauty is a relationship between a theory and the mind.\"\n> --\n> [ Content of type application/pgp-signature deleted ]\n> _______________________________________________\n> A2k mailing list\n> A2k@lists.essential.org\n> http://lists.essential.org/mailman/listinfo/a2k\n\nRegards,\n\n--\nJeffrey A. Williams\nSpokesman for INEGroup LLA. - (Over 134k members/stakeholders strong!)\n\"Obedience of the law is the greatest freedom\" -\n   Abraham Lincoln\n\n\"Credit should go with the performance of duty and not with what is\nvery often the accident of glory\" - Theodore Roosevelt\n\n\"If the probability be called P; the injury, L; and the burden, B;\nliability depends upon whether B is less than L multiplied by\nP: i.e., whether B is less than PL.\"\nUnited States v. Carroll Towing  (159 F.2d 169 [2d Cir. 1947]\n===============================================================\nUpdated 1/26/04\nCSO/DIR. Internet Network Eng. SR. Eng. Network data security\nIDNS. div. of Information Network Eng.  INEG. INC.\nABA member in good standing member ID 01257402\nE-Mail jwkckid1@ix.netcom.com\n Registered Email addr with the USPS\nContact Number: 214-244-4827\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}