{"category": "spam", "to_address": null, "from_address": "interest amount <interestamount45@hotmail.com>", "subject": "ATTN:  BENEFICIARY", "body": "\n\n\n\n\n\nHEAD OFFICE STALLION PLAZA 36 MARINA, P.M.B 2027 LAGOS, NIGERIAPHONE:234-80-2455-7040 FAX.234-1-7743535 \nATTN:  BENEFICIARY,\n \nDEAR  CUSTOMER, \n \nNOTIFICATION OF YOUR CONTRACT / INHERITANCE INTEREST PAYMENT VIA ATM CARD. \nThis is to officially inform you that new elected President who was sworn in on the 29th of May 2007, Alhaji UMARU MUSA YAR'ADUA,the President Federal Republic of Nigeria,Is hereby signed into law with Union Bank of Nigeria Plc,for the settlement of  your contract interest funds.   \nToday being 26th June 2007, we hereby arranged for your approved inheritance interest payment of US$2.182.Million Dollars only via ATM CARD directed to us by the Federal Government of Nigeria Authorities.  \nNow, you are among the seven (7) beneficiaries who will receive his/her approved payment via (ATM CARD), for the immediate withdrawal of your funds.  \nOn contrary, arrangement will be made with Courier Services accredited to this bank to book for delivery of your (ATM CARD), which will be delivered to your office address. Note that this payment instrument (ATM CARD) on a reason cannot be delivered to P.O Box for your information. \n \nIn furtherance to the above mentioned, you are hereby advice to furnish us with the bellow listed information to enable us carry out the payment procedures. In which upon the receipt of (ATM CARD), you will insert it with ATM Instrument  and make withrawal of your funds as programmed.  \n(1) YOUR CONTACT ADDRESS\n(2) YOUR DIRECT TELEPHONE NUMBER\n(3) YOUR INTERNATIONAL PASSPORT COPY \nUrgent response to this mail will enable us dispatch your Atm Payment prepared Card for onward claim. \nAccept our congratulation in advance  \nYours faithfully\n\n\n\nREV. TUNDE BAKARIDIRECTOR FOREIGN OPERATIONS UNION BANK OF NIG PLCPlay free games, earn tickets, get cool prizes! Join Live Search Club.   Join Live Search Club!\n"}