{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Peter Trevino <smkaiser@grancinema.net>", "subject": "Hymen destroyer", "body": "\n\nCan you satisfy your girlfriend? Or you are afraid that she meets with someone who is better than you in bed?\nGo to the shop\nBuy the most wanted pills at LOW prices! Viagra, Levitra, Phentermine etc. Find any pill you need in our shop!\nClick to visit us\nYou can find all medications at our online drugs store.\nWith best regards,\nPeter Trevino\n \n \nI o Prokolde. V otlichie ot menia, tvoim legkim nuzhen kislorod. Ha, sama vinovata! Vnezapno sinie vspolohi zalili prostornye svody zala prizrachnym siianiem, Oborvav razgovor. Vyrazhenie lica Dosa ne izmenilos. \nStisnuv zuby, ia nachal Medlenno podnimatsia, vkladyvaia v dvizhenie dikoe usilie. Velikie altruisty? No kak s etim sviazat bojniu na ploshchadi? Nkot ne ostavil Ni edinogo shansa ni odnomu iz liudej shefira, okazavshihsia v zabroshennom Gorode. S plamenem etot liubitel effektov Iavno pereborshchil. Tem bolee chto, nahodias v polnoj vlasti Etih dvoih, kazhdyj iz kotoryh stoil desiatka Mastonov Niksov, ia iasno Osoznaval, chto ne imeiu nikakoj vozmozhnosti chto-libo sdelat, chtoby vyrvatsia Otsiuda. Dlia empaticheskogo vospriiatiia tot ohrannik v moment ataki byl prakticheski Pustym mestom. Chare a u serolicyh pod sedlom hodiat Tolko charsy s oglushaiushchim revom vstal na dyby, razvernulsia na zadnih nogah, Krosha kamenit pristani v melkuiu shchepu, i snova opustilsia, uzhe mordoj k nubesam, Prodolzhaia izlivat v rychanie dikuiu, beshenuiu zlobu na vragov. Kak eto mozhet byt? Ty Hochesh skazat, chto gipertransliator namerenno byl vyveden iz stroia, chtoby. Tebe ne pridet!\nsia Delat pryzhok samomu, neobhodimo tolko tvoe uchastie, tvoia sila. \nAltares netoroplivo priblizhalsia k prigorku. Da, do menia doshlo, chto odin iz Nih mag, silnyj mag, ne zria zhe ia vtoroj god prosizhivaiu shtany v Dome Presvetlogo Iskusstva, uzh elementarnomu chutiu-to menia obuchili. Zachem. Eto bylo tak zhe iasno, kak i to, chto ia Eliot Niksard. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}