{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "toby909@gmail.com", "subject": "Re: [R] covariance question which has nothing to do with R", "body": "while my other program is running.....\n\nThe reference I mentioned previously addresses exactly this. Snijders and \nBosker's Multilevel Analysis book on page 31 and 33, section 3.6.2 and 363 \ndiscuss this.\n\nWhen you say that the Xs are correlated then you would need to say according to \nwhich structure they are correlated:\n\n\n(1,X1,Y1)\n(1,X2,Y2)\n(1,X3,Y3)\n.\n.\n.\n(1,X55,Y55)\n(2,X56,Y56)\n(2,X57,Y57)\n.\n.\n.\n(2,...................\n\nTo pick some real world examples one row represents a person, or a stock. And \nthe first column indicates to which organization or to which country that \nperson/stock belongs to. Then Xs are correlated within the organization/country.\nYou will have two covariances, one within-county and one between country \ncovariance of stocks.\nThis can be implemented in R manually providing method of moments estimates, or \nthe gls function providing ML or REML estimates can be used for that.\n\nI am not a post doc, just a pre master :-)\n\nToby\n\n\nLeeds, Mark (IED) wrote:\n> This is a covariance calculation question so nothing to do with R but\n> maybe someone could help me anyway.\n> \n> Suppose, I have two random variables X and Y whose means are both known\n> to be zero and I want to get an estimate of their covariance.\n> \n> I have n sample pairs \n> \n> (X1,Y1)\n> (X2,Y2)\n> .\n> .\n> .\n> .\n> .\n> (Xn,Yn)\n> \n> , so that the covariance estimate is clearly 1/n *(sum from i = 1 to n\n> of ( X_i*Y_i) ) \n> \n> But, suppose that it is know that the X_i are positively correlated with\n> each other and that the Y_i are independent\n> of each other.\n> \n> Then, does this change the formula for the covariance estimate at all ?\n> Intuitively, I would think that, if the X_i's are positively\n> correlated , then something should change because there is less info\n> there than if they were independent but i'm not sure what should change\n> and I couldn't find it in a book.  \n> \n> I can assume that the correlation between the X_i's is rho if this makes\n> things easier ? Thanks.\n> \n> References are appreciated also.\n> --------------------------------------------------------\n> \n> This is not an offer (or solicitation of an offer) to buy/se...{{dropped}}\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}