{"category": "spam", "to_address": "<ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"Leo Morris\" <suebonar.com@lottozubotto.com>", "subject": "Official Lottery tickets from around the world", "body": "\n\n\n\n\n\n\nLotteryagent (TM) is the only online service that enables you to actively and immediately \nparticipate in the biggest lottery games from around the world, providing you the opportunity to\nwin millions of dollars !Lotteryagent (TM) provides a wide variety of unique benefits:\nGlobal Service: buy lotto tickets from over 80 lotteries from all over the world\nFast and Easy: Buy the tickets and Lotteryagent (TM) will check the results for you and notify you of\nyour winnings, which are directly transferred to the payment option of your choice.\nCredibility: Lotteryagent (TM) has been providing the unique service for over 10 years, supervised by\none of the top international firms, and world-renown for its accurate and user-friendly service.\nSpecial Services: save your lucky numbers to make the purchasing process much easier and faster.\nIncludes all Leading Lotteries:\nPowerballMegaMillionsEuroMillions\n           \nUK National LotteryLotto 6/49And more...\nLotteryagent (TM) is the leading lottery service online, combining all the advantages and comfort \nof the internet with the exciting worldwide lottery opportunities.\nWelcome to Lotteryagent and good luck !\nEnnis Del Mar wakes before fiv\nThe stale coffee is boiling up\nThey were raised on small, poo\nIn 1963 when he met Jack Twist\nThey shook hands in the choky \nForest Service got designated \nTOMORROW MORNIN well truck you\nEnnis, high arched nose and na\nThe sheep trucks and horse tra\nThey got the big tent up on th\nDuring the day Ennis looked ac\nJack came lagging in late one \nIm commutin four hours a day, \nYou want a switch? said Ennis.\nThat aint the point. Point is,\nWouldnt mind bein out there. T\nCant be no worse than me, then\n\n\n"}