{"category": "ham", "to_address": "edward baafi <edwardbaafi@gmail.com>", "from_address": "Don Hopkins <dhopkins@DonHopkins.com>", "subject": "Re: [sugar] Pyxpcom", "body": "\n> Then it builds just fine!\n>   \nRight on!!!\n> Try that and you should build just fine..  I'm happy that you've\n> decided to do the right thing..  Remember that we can't judge Mark's\n> extensions based on the platform that he develops on top of..  I may\n> not like Windows but all of Mark and Thomas Heller's extensions make\n> it a breeze to work there (I'm just glad I don't have to build Vista)\n>   \nMark Hammond's win32com Python OLE/ActiveX integration stuff is top \nnotch quality, excellent hard core code -- an industrial strength tour \nde force! Its deep scope and the wide range of complex Windows COM \ninterfaces that it covers is truly amazing. You can actually use it to \nimplement ActiveX controls (OLE/COM servers) in Python, embed JScript \ninterpreters via IScriptingEngine, and other tricky stuff like that. \nI've used it to integrate Python with Internet Explorer on Windows, so \nPython can reach in and mess around with the DOM tree via OLE \nAutomation. Much easier and more powerful than trying to do everything \nby remote control via http/xml/ajax/etc. It works quite well, and is \nextremely magical, but of course it's a sausage factory inside. (That \ncomes with the territory.)\n\nThe fact that Mark Hammond is the person behind pyxpcom is why I can \ntrust that pyxpcom is good solid technology, because he knows what he's \ndoing and has been down that road before. (There aren't a lot of other \npeople in the world with his experience and track record.) I think it \nwould be a great idea and an excellent investment to use and develop \npyxpcom for the OLPC project.\n> Anyway, now that we've gotten building the trunk out of the way, can\n> you describe what you're trying to do with gtkmozembed?  There are a\n> lot of players involved (sugar services, xpcom, pyxpcom, gecko, gtk,\n> gtkmozembed, pygtk, the python gtkmozembed wrappers, nsiWebBrowser,\n> etc) and I don't have a clear picture of what you're trying to do\n>\n> -Ed\n>   \nJust to be able to go browser.document.body.innerHTML = 'Hello \nWorld!' would be a great start! Even better would be a way for \nPython to handle unsolicited events from JavaScript.\n\n    -Don\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}