{"category": "spam", "to_address": "Gnitpick <gnitpick@flax9.uwaterloo.ca>", "from_address": "Hank Nielsen <istinakerr@godspeednetworks.com>", "subject": "Say \"YES\" to perfect sex!", "body": "\n\nOnline pharmacy presents top products that will make you healthy! You do not need to go to your local drug store, you can buy here any pill that you need.\nClick to visit us\nU can restore your health right now. Doesn't matter what the problem is - we pills to cure everything. Erection Dysfunction, Weight loss, Anti-Depressant, Antibiotics and even more! Fantastic low prices! \nGo to the shop\nLicensed medications! Confidential and secure purchase\nWith best regards,\nHank Nielsen\n \n \nV sluchae uspeha ne prishlos By bezhat etot marafon, tem bolee chto v Gorode, vopreki predpolozheniiam Chuzhogo, vse-taki mog okazatsia transport. Zhenskoe obaianie velikaia sila, esli zhenshchina umeet im polzovatsia s umom. S Ego gibeliu v etoj Galaktike podobnye sushchestva prekratiat svoe sushchestvovanie. Nuzhno vremia, Niks, chtoby semia, Popav na planetu s razumnymi, nachalo razvivatsia vo vzrosloe sushchestvo. \nV obshchem, ia videl ne Tolko vymoshchennuiu serymi priamougolnymi bruskami dorogu, no i shcheli mezhdu etimi Bruskami. Tebe chto, snova muzhskogo vnimaniia ne hvataet? Onni, v chem delo? Ulybka Taj uviala. My tozhe ne vechnye, Hot i Mastera. No ia ved ih s soboj ne zval. Slishkom pozdno. Mysli lihoradochno zavertelis. V ego vzgliade posle perezhitogo im Neshutochnogo straha iavno chitalos eshche i neuemnoe liubopytstvo, otbit kotoroe ne Sposobny byli nikakie obstoiatelstva. Da, tot samyj incident. \nPo Sravneniiu s etim krovozhadnym monstrom v chelovecheskom obliche dazhe Dos Vygliadel bezobidnoj kosharoj. Ia oshchutil energeticheskie prostranstvennye linii, protianuvshiesia Nad zemlej, i potianul Klinok vverh, ispolzuia ih kanaly sily. Skazano bylo tak holodno i nepreklonno, chto parenek momentalno umolk, ne Ispytyvaia zhelaniia perechit samomu masteru mechej, no ot nego ne otstal, tverdo Reshiv, chto Bochonka odnogo v bede ne brosit. Bylo ot chego oshchutit sebia oshelomlennym. ejisuminyon VVFcRlhQUVh0RkFXVlBMH0dEVUFUQF9bWh9RUg==\n \n\n\n"}