{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Border security scrutinized after TB patient slips in", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJun  1, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nBorder security scrutinized after TB patient slips in\n\n\n\n\n\nA senior House member wants to know how a dangerously infected man managed to\nget through U.S. Customs and Border Protection even though his passport had\nbeen flagged in their computer system.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCaptors issue BBC reporter video\n\n\n\n\n\nSaying he was being treated well, BBC reporter Alan Johnston appeared for the\nfirst time since his abduction in March in a video tape issued by his captors\nthat was delivered to a Palestinian news agency in Gaza on Friday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nPacific storm weakens off Mexico\n\n\n\n\n\nTropical Storm Barbara, which had threatened to become the first Pacific\nhurricane this year, weakened off Mexico on Thursday and may die out\ncompletely in the next few hours, forecasters said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\n'Operation Humpback' taught lessons on rare whales\n\n\n\n\n\nScientists observing the wayward wanderings of two humpback whales in a\nCalifornia river have more to celebrate than their return to the Pacific\nOcean.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToddlers drown in pond while babysitter naps \n\n\n\n\n\nTwo toddlers who wandered away from home while their teenage baby sitter slept\naccidentally drowned in a nearby pond in northwestern Pennsylvania, officials\nsaid.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDJ collapses on air; listener saves the day\n\n\n\n\n\nA radio listener helped save a disc jockey who suffered an on-air seizure and\npleaded for help before passing out in his studio.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRelease of 'Dr. Death' brings painful memories\n\n\n\n\n\nSome relatives of people who died with Dr. Jack Kevorkian's help say his\nrelease from prison stirs up grief over the deaths of their loved ones. \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nFriction intensifies between U.S. and Russia \n\n\n\n\n\nTensions between the United States and Russia ratcheted up another notch\nThursday, with accusations flying over ballistic missiles and human rights.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLebanon launches attack on militants in refugee camp\n\n\n\n\n\nLebanon's military on Friday launched a new artillery attack on a Palestinian\nrefugee camp north of Tripoli where Islamic militants have been holed up.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSilenced Venezuelan TV station moves to YouTube\n\n\n\n\n\nRadio Caracas Television, the station silenced by Venezuelan President Hugo\nChavez, has found a way to continue its daily broadcasts -- on YouTube, the\npopular video Web site.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCoalition: Taliban have Iran arms\n\n\n\n\n\nWeapons crossing the border from Iran to Afghanistan may be winding up in the\nhands of the Taliban, the hard-line Islamic militia that is battling U.S.- and\nNATO-led forces in Afghanistan, U.S. and British officials said.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nWhy you still can't find a builder\n\n\n\n\n\nThere's no doubt the bottom has fallen out of the home-building market in the\nlast year. But if you're trying to find an out-of-work carpenter or skilled\ncraftsman today, you'd think the nation was still in the middle of a building\nboom.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n5 ways to fix Wal-Mart\n\n\n\n\n\nAs Wal-Mart prepares for its annual meeting, the world's biggest retailer - in\ntypical fashion - has lined up big-name performers to entertain the crowd,\nincluding a concert by The Eagles.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nKelly Dwyer: Some advice for Billy Donovan\n\n\n\n\n\nFor Florida Gator fans, Billy Donovan's departure means losing a head coach\nwho delivered nine 20-win seasons and two national championships in his\n11-year reign. For those on the NBA side, his arrival means the usual shrug of\nthe shoulders and an eye roll at another team that thinks it can turn one of\nthe NCAA's finest leaders of young men into anything approaching a capable pro\ncoach.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProsecutor says Vick involved in dogfighting\n\n\n\n\n\nSURRY, Va. (AP) -- Informants have come forward saying they can link Atlanta\nFalcons quarterback Michael Vick to dog fighting, the prosecutor in the case\nsaid Thursday, and he has turned their accounts and contact information over\nto investigators.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nStudy spots gaps in Americans' diet, health IQ\n\n\n\n\n\nNinety percent of Americans say breakfast is an important part of a healthy\ndiet, but just 49 percent manage to eat breakfast every day, a new survey\nshows.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStressed-out moms at risk of poor mental health\n\n\n\n\n\nMothers of young children who feel they lack emotional support or help in\ncaring for their children have more than three times the risk of mental health\nproblems compared with their peers who feel adequately supported, a new study\nshows.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nRobot grooves to its own beat\n\n\n\n\n\nA Japanese robot twists and rolls to music from an iPod in an intricate dance\nbased on complex mathematics, a technology developers say will enable robots\nto move about spontaneously instead of following preprogrammed motions.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFeds say top spammer arrested\n\n\n\n\n\nA 27-year-old man described as one of the world's most prolific spammers was\narrested Wednesday, and federal authorities said computer users across the Web\ncould notice a decrease in the amount of junk e-mail.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nMan builds a living out of LEGO\n\n\n\n\n\nNathan Sawaya's workspace is an explosion of color.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n'Idol' Jordin Sparks: I'm a big Sanjaya fan\n\n\n\n\n\nUntil now, when asked her favorite male singers, Jordin Sparks topped the list\nwith John Mayer and Justin Timberlake. But, the effervescent new \"American\nIdol\" champ said Wednesday, she's got another name to add: Sanjaya Malakar.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}