{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTHURSDAY 17 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM EMILY MAITLIS\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nPRIME MINISTER ELECT\n\n\nJust how many Prime Ministers does a country need at any one time? And who, exactly, is in charge as we speak? As Zombie Brown formally sees off his challengers to become Prime Minister Elect for the next six weeks, Tony Blair has started the long goodbye in Washington - a place where he often joked he was more warmly received than at home.  \n\n\nSo if a critical decision has to be made over the next six weeks, who does the cabinet listen to? At Newsnight, we've risen to the challenge and appointed one political correspondent to each PM, each side of the pond. Zombie Brown says his conversation with the country is just beginning, but how will he cope with arguably the most controversial relationship of them all - his dealings with George Bush over Iraq? Michael Crick and David Grossman will give their assessments.\n\n\nGAZA\n\n\nAs I write, the troubles in Gaza are increasing. We've had a report of an Israeli air strike and Hamas has threatened to retaliate with suicide attacks. We'll give you the latest on the fighting there, as tensions between Hamas, Fatah and the Israelis heighten.   \n\n\nTHE IRAQI GOVERNMENT\n\n\nAnd in our final film in this week's series of exclusive reports from inside Iraq, Mark Urban turns his attention to an assessment of the effectiveness of the Iraqi Government.\n\n\nIt is crucial to the viability of a future state without the coalition forces, but its record is distinctly patchy. Corruption is a serious problem, and it seems they've significantly under-spent the money allocated to them to reconstruct their own country. So is the government capable of delivering?\n\n\nIf you'd like to watch the other films in the series, they are available by clicking here.\n\n\nAll this and more at 10.30pm.\n\n\nEmily\n\n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nLABOUR DEPUTY\n\n\t\t\t\t\t\t\tNewsnight conducted its own Labour deputy leader poll at a London party gathering\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}