{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Lowell Poe\" <tugdhflfaw@dhfl.com>", "subject": "Control your weight and appetite", "body": "\nControl your weight and appetite\n\n\n\n\n\nAnatrim – The very up-to-date and most exciting flesh loss product is now available – As were seen on BBC\n\n\n\nDo you know redundant body kilos kill more and more people around the world? We believe you hate the unattractive look of those people and the low status they have in modern society. \n\nOr, maybe, you can’t withstand a siege of terrible eating habits of yours. If this all sounds familiar, then we got something to propose to you!\n\n\n\n\n\nIntroducing Anatrim, the ultimate product for the reduction of your body’s extra weight. The amazing thing about Anatrim is it raises the quality of your life, making you feel no hungry and giving you better mood. Pay you attention to some e-mails from our customers:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of always glutting myself with food and watching TV continually \n\n\nI became rather more interested in exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I have a great shape now and lots of men stare hard at me!\"\n\n\n\n\n\n\nMaria H., Chicago\n\n\n\n\n\n\n\"I tried some passive weight burning, you know, but to no purpose. I could not restrain my ravenous hunger. \n\n\nOne day I was told on Anatrim my very best friend by and I rather liked the information.\n\n\n I had attempted taking it, and my wife told me that I had changed for the better since then, 5 months later. \n\n\n32 pounds off and I keep still losing them! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nDave Klark, San Diego\n\n\n\n\n\nAnatrim gives you an opportunity to realize you doesn’t have such a great need for the constant eating. It raises your spirit up, provides you with additional energy, and attacks needless kilos. All thanks to its mighty newly-elaborated formula!!\n\n\n\nWorm out more information!\n\n\n\n"}