{"category": "spam", "to_address": "\"Subscriber\" <cruiseca@flax9.uwaterloo.ca>", "from_address": "\"David\" <q0ke84ezw@understintleft.com>", "subject": "Your pending account has been approved ", "body": "Congratulations, you have Pre-Certified* to receive the following: \na F R E E* Finium Pre-Paid MasterCard Card.This card can be used wherever MasterCard is accepted.Your Pre-Certification* has also been expanded to allow you to receive an instant Cash Advance in the amount of up to $1,500 and/or receive a new line of Credit in the amount of $10,000.00.You Pre-Certification* comes to you regardless of your current or past credit history.Due to contractual obligations, we may only be allowed to hold your Pre-Certification* status for a period of (7) seven of days from the receipt of this notice. \nOn or after that date we may be forced to revoke your Pre-Certification* status and offer these financing options to another party.Don't delay - the financing you need is just one click of the mouse away!\n\n\nClick here:\n\nhttp://castledives.com/t/q0ke84ezw/542086\n\t\t\n\n*Patriot Act Disclaimer: The USA PATRIOT ACT is a Federal law that requires all financial institutions to obtain, verify, and record information that identifies each person who opens an account.You will be asked to provide your name, address, date of birth, and other information that will allow us to identify you.You may also be asked to provide documentation as proof of identification. \n\"No Turndowns\" and \"Everyone is Approved\" is contingent upon successfully passing this mandatory identification confirmation.This offer is void where prohibited and available to those 18 years and older. Please see website for full details and terms and conditions of this special offer.\n \nIf you have any questions in regards to this offer \nplease write to us at: \nJBR Media Ventures, \nLLC 2 Wisconsin Circle Suite \n700 Chevy Chase Md 20815.\n\nTo unsubcribes link please click here:\n\nhttp://castledives.com/t/q0ke84ezw/542087 \n\n\n\nHi Subscriber! You are receiving this solicitation because cruiseca@speedy.uwaterloo.ca previously agreed to receive correspondence from Splash Tree. If this service should fail to meet your expectations, feel free to disassociate yourself from our service.\nhttp://castledives.com/u/1826/cruiseca%40speedy.uwaterloo.ca/2\n\nShould you want to contact us via the United States Postal Service, our address is as follows: 333 Mamaroneck Avenue Suite 193 White Plains, NY 10605\n\n\n"}