{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\nPerformance \n\t\t\tBenchmarking For Energy Utilities\nSeattle, WA\n            May 23-24, 2007\n\nPandemic \n\t\t\tPreparedness For Utilities\nSeattle, WA\n            May 23-24, 2007\n\n\nCapacity \n\t\t\tMarkets\n\n\t\t\tWashington, DC\n\nJune \n4-6, 2007\n\nCoal-to-Liquids \n\t\t\tFinance and Development Summit\n\n\t\t\tNew York, NY\n\nJune \n4-6, 2007\n\n\nStrategies for \n\t\t\tBidding Ancillary Services in LMP Markets\n\nIndianapolis, IN\n\nJune 6-7, 2007\n\n\nIntro to Electric \n\t\t\tUtility Systems for Non Engineers\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nDistributed \n\t\t\tEnergy Resources-Emerging Business Models for Utilities\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (May 14, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 14, 2007\n\n\nMay 14, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for May 14, 2007  \n\n\n\nFirst Enercast Featured Articles for May 14, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 14, 2007 PowerMarketers Industry Publications\n\n\n\nFuel Adjustment Clauses and Good Public Policy (UtiliPoint.com - May 14, 2007)\n\n\n\nUtiliPoint.com - May 14, 2007 - Even though the roots of electric fuel adjustment clauses (FAC) go back to World War I, they became prominent again in the 1970s with the OPEC oil price shock.\n\n\nMay 14, 2007 PowerMarketers Industry Publications\n\n\n\nThe Greening of Corporate America (EnergyBiz Insider - May 14, 2007)\n\n\n\nEnergyBiz Insider - May 14, 2007 - Exelon Corp.'s environmental positions are paying off. The Chicago-based utility has retrofitted its headquarters so as to comply with green standards for commercial office buildings -- a move that is winning accolades from all corners. \n\n\nMay 14, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nWateree Dam crisis plan gets an update: Officials nail down specifics in case it fails after natural disaster or terrorist\n\n\n\nMay 14--Kershaw County is updating an emergency preparedness plan that it will use if the Wateree Dam breaks.  The new plan, to be completed in two to three months, will provide detailed job descriptions for each official, update shelter locations and evacuation routes and prepare for the worst-case scenario -- a total failure of the dam. The Wateree Dam impounds the 13,864-acre Lake Wateree. ...\n\n\nMay 14, 2007 Knight Ridder Tribune Business News\n\n\n\nLowcost power going up for grabs while officials sit back: WNY representatives fail to push for cheap electricity\n\n\n\nMay 13--About 15 percent of the electricity produced by the Niagara Power Project is up for grabs this summer, the first time in years, perhaps decades, that so much has been in play.  But local officials, starting with the delegation that represents Western New York in the State Legislature, are doing little to seize the opportunity. \"We ought to be at work on this stuff,\" Rep.\n\n\nMay 13, 2007 Knight Ridder Tribune Business News\n\n\n\nA good old thumping for fuel bills\n\n\n\nMay 13--Going green can save your company money as well as help the planet.  The Carbon Trust believes that most firms can slash 20 per cent off their energy bills without dipping into their pockets. The Government-backed body provides free advice and will visit premises to offer tips. It also provides interest-free loans for investing in eco-friendly work solutions.\n\n\nMay 13, 2007 Knight Ridder Tribune Business News\n\n\n\nCompanies announce pact with FutureGen\n\n\n\nMay 13--TXU Corp. and Texas Energy Future Holdings recently announced a $1 million commitment to support the state's bid for the FutureGen power plant. Leon County and Odessa are among four sites under consideration for the plant. The other two are in Illinois. The FutureGen Alliance is a non-profit consortium of companies supporting FutureGen, the U.S. Department of Energy project intended to ...\n\n\nMay 13, 2007 Knight Ridder Tribune Business News\n\n\n\nProgress Energy investing $2.5 million in upgrades for siren system\n\n\n\nMay 13--Hartsville residents have begun hearing the sounds of Progress -- Energy, that is.  Progress Energy is investing $2.5 million in upgrades to the siren system in the Emergency Planning Zone (EPZ) surrounding the H.B. Robinson Nuclear Plant. Andy Cole, communications specialist at the Robinson plant, said the changes are simply an upgrade to the current siren system being used by the plant. ...\n\n\nMay 13, 2007 Knight Ridder Tribune Business News\n\n\n\nA first look at flood devastation\n\n\n\nMay 14--MISSOURI VALLEY, Iowa -- Rachel and Ryan Rempel spotted their little red porch just after 2 p.m. Sunday.  It had broken off their house and floated into a field across the street. Inside their Missouri Valley home, floodwater left behind soggy carpet, moldy furniture and a foul, dank smell. The water had been a foot deep. The Rempels, along with many other residents of the Willow Creek ...\n\n\nMay 14, 2007 Knight Ridder Tribune Business News\n\n\n\nExperts: Evidence of climate change can be found in southern Wisconsin\n\n\n\nMay 13--ROCK COUNTY  Farmer David Arndt knows the value of rain. Some of his corn crop shriveled and died during a searing drought in the summer of 1976. Almost 30 years ago, Arndt started installing irrigation as insurance against dry spells on his 2,500 acres. Last fall, his fertile fields in La Prairie Township produced a record average of 211 bushels of corn per acre.\n\n\nMay 13, 2007 Knight Ridder Tribune Business News\n\n\n\nAkron utility to hold annual meeting: FirstEnergy has 3 items up for vote, opposes 3 shareholder proposals\n\n\n\nMay 13--FirstEnergy Corp. will hold its annual shareholders meeting Tuesday at the John S. Knight Center.  Shareholders are to vote on six proposals at the meeting, which will start at 10:30 a.m. The Akron-based utility recommends that shareholders approve three company-sponsored proposals and reject three shareholder proposals. The three company-sponsored proposals are: --Elect 11 members to the ...\n\n\nMay 13, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nNews you can use: Options trading signals moves in share prices\n\n\n\nNEW YORK: Illegal or not, trading in options may be the most prescient news you can use. The number of options to buy shares of Valero Energy and American Express doubled in the week before the companies reported better-than-estimated earnings. Trading in contracts tied to TXU and Dow Jones climbed at least sevenfold a day ahead of takeover announcements that pushed the stocks up as much as 55 ...\n\n\nMay 14, 2007 International Herald Tribune\n\n\n\n\n\nUranerz Acquires Additional Uranium Property Adjoining Nichols Ranch\n\n\n\nUranerz Energy Corporation (AMEX: URZ)(FRANKFURT: U9E) is pleased to announce the successful leasing of the fee mineral lands adjacent to and west of the Company's Nichols Ranch ISR uranium project. This adjoining property appears to host the \"nose\" of the oxidation-reduction geochemical (roll) front and has the potential for increasing the known uranium mineralization at the Nichols Ranch ...\n\n\nMay 14, 2007 Internet Wire\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nWind Power Increased 19% In 2006\n\n\n\n-- As the high-flying sector keeps enjoying powerful Chinese and U.S. demand, the wind energy market will grow by 19% per year through the end of the decade the Global Wind Energy Council said May 11. Even though that would mark a slowdown from the annual 24% growth registered in 2002-2006, the market would still double by the end of the decade, the Global Wind Energy Council said.\n\n\nMay 14, 2007 Industry Week\n\n\n\nCigma Metals Corporation (Cigma, the Company) Is Very Pleased to Announce That Drilling Has Begun on the Company's Central Berezki Target Area Within the Company's 14,000 km2 Dostyk Project in Kazakhstan\n\n\n\nCigma Metals Corporation  Cigma Metals Corporation (PINKSHEETS: CGMX) (FRANKFURT: C9K) (XETRA: C9K) is very pleased to announce that all the infrastructure requirements for this season's exploration program are now in place and that drilling has commenced on the Central Berezki (Berezki) target area.  Berezki is part of a large (6km x 2km) gold-copper-porphyry system consisting of three major ...\n\n\nMay 14, 2007 Internet Wire\n\n\n\nChina Approves Largest Nuclear Power Plant\n\n\n\nResearched by Industrial Info Resources (Sugar  Researched by Industrial Info Resources (Sugar Land, Texas). China's National Development and Reform Commission announced earlier this month that it has approved construction of China's largest nuclear power plant in its eastern Shandong Province, with a first phase investment of $3.25 billion in building two one-million-kilowatt nuclear generator ...\n\n\nMay 14, 2007 Internet Wire\n\n\n\nFirst Quantum Minerals Reports Operational and Financial Results for the Three Months Ended March 31, 2007\n\n\n\n(All figures expressed in US dollars)  (All figures expressed in US dollars) First Quantum Minerals Ltd. (the \"Company\") (TSE: FM)(LSE: FQM) is pleased to announce its results for the three months ended March 31, 2007. The complete financial statements and management discussion and analysis are available for review at www.first-quantum.com and should be read in conjunction with this news ...\n\n\nMay 14, 2007 Internet Wire\n\n\n\nRussia wins new natural gas deal, undermining rival U.S. plan\n\n\n\nMOSCOW: Russia agreed to build a new pipeline to import more natural gas from Turkmenistan, bolstering its dominant hold on supplies to Europe and heading off a rival U.S.-backed plan that would bypass Russian territory. President Vladimir Putin of Russia met his counterparts from Turkmenistan and Kazakhstan on Saturday and reached a preliminary agreement on the pipeline, with a final accord ...\n\n\nMay 14, 2007 International Herald Tribune\n\n\n\nEnergy needs 'hobbled' by slow consents\n\n\n\nThe Government's call for more renewable energy is being hobbled by slow consent processes for wind farms, prompting Environment Minister David Benson-Pope to call in chief environment judge John Bollard to discuss the delays. The meeting comes as a row simmers between the Government and state generator Meridian over its planned 630-megawatt Project Hayes wind farm in Otago.\n\n\nMay 13, 2007 Dominion Post\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}