{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 142", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. The US has handed over more than 400 Incan and pre-Columbian\n      artefacts to the government of Peru.\n      (Museum Security Network Mailing list)\n   2. Michael Brand,\tdirector of the J. Paul Getty Museum in Los\n      Angeles,\thas a problem that won't go away: a dispute with the\n      Italian\tgovernment over ancient artworks in the museum's\n      collection.\tOnce-promising negotiations have completely broken\n      down. (Museum Security Network Mailing list)\n   3. NSW gallery defends security system after theft of 17th\n      century artwork. It has taken five days for the theft to\tbecome\n      public. The gallery director states it was not inside\tjob. He may\n      be right, but how would he know?\n      (Museum Security Network Mailing list)\n   4. Group identifies most endangered US historic sites\n      (Museum Security Network Mailing list)\n   5. Switzerland has returned an ancient Greek statue stolen 16\n      years ago and recently discovered in the collection of an\n      antiquities dealer. (Museum Security Network Mailing list)\n   6. El Salvador. Cinco pinturas de artistas nacionales fueron\n      sustra?das entre 2004 y 2007 La polic?a no ha recibido denuncias\n      ni Concultura conoce lo ocurrido\n      (Museum Security Network Mailing list)\n   7. USA. Nine felony charges against a former art gallery accused\n      of stealing art and fraudulently using credit cards were\n      dismissed last week,\tauthorities said. Settlement says Gypsum\n      woman will pay former\temployer $20, 000\n      (Museum Security Network Mailing list)\n   8. Nearly five years after Frederic Bednarz's violin was stolen\n      from a Harvard Square music school, police have found the $24,\n      000 instrument. But it's unclear if police ever plan to charge\n      the\tcrooks involved in the high-profile heist.\n      (Museum Security Network Mailing list)\n   9. Van Mieris theft. FBI experience,\tis that approximately 80\n      per cent of museum theft cases of art are\tinside jobs\n      (Museum Security Network Mailing list)\n  10. Van Mieris theft. Freedom in frame after theft.\n      (Museum Security Network Mailing list)\n  11. In den Archiven lauern viele Gefahren.\n      (Museum Security Network Mailing list)\n  12. Van Mieris theft. According to the Gallery their security\n      system is next to nothing but it took too long to report this\n      theft because gallery staff believed it had been returned to\n      storage. (Museum Security Network Mailing list)\n  13. Italian construction crew investigated after ancient\n      artifacts looted. Some items now decorate a hotel complex nearby.\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Thu, 14 Jun 2007 19:19:03 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The US has handed over more than 400 Incan and\n\tpre-Columbian\tartefacts to the government of Peru.\nTo: \nMessage-ID: <061701c7aea8$1afa79b0$50ef6d10$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nUS hands back artefacts to Peru  \nBy Will Grant \nBBC News, Miami  \n\n \nThe items are thought to be worth millions of dollars \n\nThe US has handed over more than 400 Incan and pre-Columbian artefacts to\nthe government of Peru. \nPhoto:\nhttp://news.bbc.co.uk/2/hi/americas/6751167.stm\n\nThe items, which are believed to be worth millions of dollars, had been\nstolen from several Andean nations. \n\nThey include a cape made from macaw and parrot feathers, gold and silver\njewellery and a clay vessel believed to be more than 3,500 years old. \n\nThe artefacts had been stolen from South America by grave robbers and came\ninto the US via the black market. \n\nAccounting system \n\nThe Peruvian consul general in Miami, Jorge Roman, described some of the\nmost important items. \n\n\"The pieces of greatest historical value were perhaps the two quipus. \n\n\"The ancient civilisations of Peru used these cords as an accounting system\n- to keep a record of the size of their harvests, of their potato crops,\nperhaps of the number of men and women in a town. \n\n\"But when the Spaniards arrived, they viewed it as a pagan system and most\nquipus were destroyed or burned. So, it's very rare to see them in a\nmuseum.\" \n\nAn Italian man was arrested two years ago for bringing the artefacts into\nthe United States. \n\nAfter serving 17 months in a federal prison, he is now due to be deported. \n\nMr Roman says that as well as returning the artefacts to their countries of\norigin, this move sends an important message to other tomb raiders and\narchaeological thieves that there is an international agreement in place to\ntackle their crimes. \n\n\n\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Thu, 14 Jun 2007 19:19:03 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Michael Brand,\tdirector of the J. Paul Getty Museum in\n\tLos Angeles,\thas a problem that won't go away: a dispute with the\n\tItalian\tgovernment over ancient artworks in the museum's collection.\n\tOnce-promising negotiations have completely broken down.\nTo: \nMessage-ID: <061f01c7aea8$1caa9ab0$55ffd010$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nGetty Museum's Brand Faces Impasse in Italian Artifacts Dispute \n\nBy Stephen West\n\nJune 14 (Bloomberg) -- Michael Brand, director of the J. Paul Getty Museum\nin Los Angeles, has a problem that won't go away: a dispute with the Italian\ngovernment over ancient artworks in the museum's collection. Once-promising\nnegotiations have completely broken down. \n\nIn the 18 months that Brand has led the museum, he's strengthened its\nacquisition policy, hired several key staff members and helped organize new\nshows. He also helped repair the museum's reputation and that of the parent\nGetty Trust, the world's richest art institution with a $5.6 billion\nendowment. \n\nThe trust last year settled an investigation by the California attorney\ngeneral into the Getty's governance. Brand struck an agreement with the\nGreek government over disputed antiquities, returning four objects this\nyear, and was making progress in talks with Italy's Ministry of Culture over\n52 disputed works. \n\n``Everything was going along fine -- which isn't to say it was easy, but we\nknew what we agreed on and what we had yet to reach agreement on,'' Brand\nrecalled in an interview. ``And then last November they placed a new\ncondition on the table, that without the Getty Bronze there would be no\nagreement at all.'' \n\nThe Getty Bronze, or ``Statue of a Victorious Youth,'' is a life-size Greek\nsculpture of a muscular nude athlete made between 300 B.C. and 100 B.C. that\nthe museum acquired in 1977 for $3.95 million. It's a highlight of the\ncollection, displayed in a special room of its own at the Getty Villa in\nMalibu. \n\nInternational Waters \n\nThe museum's position is that the statue was made in Greece, looted by the\nRomans about 2,000 years ago and lost at sea. It was then discovered in\n1964, in international waters of the Aegean Sea, by Italian fishermen who\nbrought it ashore and quickly sold the heavily encrusted work to a local art\ndealer. After it was sold a second time the next year, the sculpture was\nshipped out of the country and eventually ended up with a Munich art dealer\nwho sold the piece to the Getty. \n\nIn 1965, Italian authorities charged the first dealer and three others with\ntheft and illegal sale of state property, claiming the work was part of\nItaly's cultural heritage. A court in Perugia ruled the next year that the\nprosecution didn't prove its case, especially that the statue was found in\nItalian waters and thus was state property. The decision was upheld on\nappeal. \n\n``We acquired the object after those two cases,'' Brand said. ``At the time,\nthe Italian Ministry of Culture made no claim on the object and made no\nclaim on it after we acquired it.'' More investigations by the Italians in\nthe 1970s and '80s failed to come up with clear proof that the statue was\nstate property. \n\n`Domestic Politics' \n\nYet the controversy wouldn't die. In 1995, Italian authorities approached\nMarion True, then the Getty's curator of antiquities, seeking the return of\nthe ``Victorious Youth.'' The museum maintained its position that Italy had\nno valid claim. Still, Italian newspapers continued to report on the case. \n\n``It's fair to say that the status of that object has entered the realm of\ndomestic politics, for whatever reasons,'' Brand said. ``Which, of course,\nmakes it harder for us, because that's nothing we can deal with.'' \n\nThe Italian position is that the Getty has completely missed the point:\nMuseums shouldn't buy and display smuggled art. The bronze should be\nconsidered illicitly trafficked because none of the people who bought and\nsold it ever declared the statue's export from Italy, as required by law,\nMinister of Culture Francesco Rutelli said. \n\n``We're not talking about legal issues; we're talking about moral issues,''\nRutelli said at a Nov. 23 news conference in Rome, where he outlined the\ngovernment's decision to hold out for the bronze. ``Can a great\ninternational museum exhibit to the public objects that are undoubtedly\ntrafficked?'' \n\nNarrow Issue \n\nHe said the Getty should know better than to base its claim on court cases\nthat addressed only the narrow issue of whether the statue had been found in\nItalian waters -- and not other potential crimes, such as illegal export.\nWhile the rulings said there wasn't enough proof to show the bronze was\ndiscovered in Italian waters, that's a far cry from saying it was certainly\nfound in international waters, Rutelli said. \n\n``The athlete was found by fishermen off the coast of Italy, and then taken\nto Italy, then hidden in Italy and then trafficked from Italy,'' Rutelli\nsaid. \n\n``There are two possibilities, that it was sold legally or not,'' he said.\n``It was clandestinely exported from this country.'' \n\nAfter the U.S. and Italy signed a cultural treaty in 2001 that required the\nU.S. to return artifacts illegally exported after that year, the Italian\ngovernment targeted antiquities in several U.S. collections, including the\nGetty, New York's Metropolitan Museum of Art and Boston's Museum of Fine\nArts. \n\nCurator on Trial \n\nItaly also charged two art dealers and former curator True with buying\nlooted artifacts. One dealer has been convicted and the other remains on\ntrial in Rome with True, who denies the charges. True resigned her position\nat the museum in 2005 after an unrelated ethics scandal related to a\npersonal loan. The Getty continues to pay her legal bills for the Rome\ntrial. \n\nWhen the Australian-born, Harvard-educated Brand arrived at the Getty in\nlate 2005, after serving as director of the Virginia Museum of Fine Arts, he\nquickly sought to resolve the disputes with both the Greek and Italian\ngovernments. Among the 52 objects sought by Italy was another of the\nmuseum's most important works, a marble and limestone sculpture of a goddess\nin flowing robes popularly known as the Aphrodite, which the Getty bought in\n1988 from a London dealer for $18 million. \n\nPartial Deal \n\nBy last October, before talks broke down, the Getty had agreed in principle\nto return 26 objects and Italy had agreed to drop its claim to six others.\nOwnership of the remaining artworks, including the Aphrodite, was still to\nbe resolved. \n\nSince then the Getty has dropped its resistance to returning the Aphrodite,\nand last month it conducted a scholarly workshop on the origins of the\nsculpture. While the study yielded no definitive answers, it reinforced the\nmuseum's view that the statue came from southern Italy or Sicily. \n\n``We acknowledge that the Italian claim is a serious claim,'' Brand said in\nan interview after the workshop. ``We have doubts about what we've been told\nabout the provenance.'' \n\nBrand repeated an earlier offer to transfer title to the Aphrodite\nimmediately and physically return the object to Italy within a year, after\ncompleting study of it. Yet Italy's Ministry of Culture declined to\nparticipate in the workshop and hasn't responded to Brand's offer to\ntransfer title. (The Sicilian Ministry of Culture sent a representative to\nthe workshop.) \n\n``We've seen some reports that imply that this is a delaying tactic,'' Brand\nsaid. ``This is absolutely not a delaying tactic. The object could already\nhave a label saying `Property of the republic of Italy, on loan to the\nGetty.''' \n\nImpasse \n\nAt this point, the dispute all comes back to the Getty Bronze, an issue that\nBrand says is beyond his control. \n\n``This is really something, in the end, that the Italian side has to\nresolve, because I can't recommend to our board of trustees to return that\nobject because we don't believe there is any reason to do so. We have\npresented that information to the Italians. It is up to them to find some\nway through that impasse.'' \n\nItaly still insists that any agreement include the Getty Bronze, said\nMaurizio Fiorilli, a government lawyer who represents the Ministry of\nCulture in negotiations with museums. \n\n``No matter what location it was fished from, it was a work that entered\nItaly and should have been declared to customs. This piece should be\nconfiscated,'' Fiorilli said last month. ``The Getty knows this very well.''\n\n\nPossible Boycott \n\nBrand says an agreement with the minister of culture is still possible, and\nso far the disagreement hasn't broadened into an outright cultural boycott. \n\n``The good news is that we've had confirmation from Minister Rutelli's\noffice that, for the moment, it should be business as usual,'' Brand said.\n``They ask for loans from us, we ask for loans from them. It remains to be\nseen whether the loans actually take place. We are hoping they will; we've\nbeen told they will go ahead. Our foundation is still working on projects in\nItaly. The Getty Conservation Institute is still planning projects with\nItalian colleagues.'' \n\nYet he's concerned that business as usual ``might not last forever. I'm just\nhoping that reason will prevail. I just hope that, in this day and age, the\ntalk of cultural embargoes really hasn't any place. What would a boycott\nmean? That Italians aren't able to access Getty databases? That Getty books\ncan't be sold in Italy? It harms exhibitions. There must be better ways of\ndealing with this,'' he said, shaking his head. \n\n``We remain absolutely ready to talk anytime if there's something\nconstructive to talk about. There are other objects that we haven't reached\nagreement on yet, and we're perfectly happy to talk about them.'' \n\nTo contact the reporter on this story: Stephen West in San Francisco at\nsmwest@bloomberg.net . \n\nLast Updated: June 14, 2007 00:02 EDT\n\nhttp://www.bloomberg.com/\n\n\n\n------------------------------\n\nMessage: 3\nDate: Fri, 15 Jun 2007 07:15:17 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] NSW gallery defends security system after theft of 17th\n\tcentury artwork. It has taken five days for the theft to\tbecome\n\tpublic. The gallery director states it was not inside\tjob. He may be\n\tright, but how would he know?\nTo: \nMessage-ID: <067501c7af0c$29dff540$7d9fdfc0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nNSW gallery defends security system after theft of 17th century artwork\n\n++++++++++++++++++\n\nModerator's comment:\n\nHow can one defend security when a million dollar painting has been stolen\nduring opening hours? There was no CCTV in the gallery, and no guard\npresent. There was no detection system attached to the painting, and it has\ntaken five days for the theft to become public. Still the director is\nconvinced his security system is second to none. What this director should\nsay is that the security system apparently has shortcomings and that\nimprovements will be considered. The gallery director also 'knows' it was\nnot inside job. He may be right, but how would he know.\nAccording to the police it was an expert job, but a Bonham's specialist is\nconvinced the theft was performed by someone with mental problems.\n\nTon Cremers\n\n+++++++++++++++++++++++=\n\n \nThe World Today - Thursday, 14 June , 2007  12:35:00\nReporter: Karen Barlow\nELEANOR HALL: A $1.4-million painting was lifted from the walls of a major\nSydney art gallery on the weekend and police have around 6,000 possible\nsuspects.\n\nThe self-portrait by 17th century Dutch master, Frans van Mieris, was taken\nfrom a room in the Art Gallery of New South Wales on Sunday. \n\nPolice say the theft happened within a two-and-a-half hour window and that\nany one of the people attending the gallery that day may have seen something\nsuspicious.\n\nThe Gallery's Director Edmund Capon is adamant the theft is not an inside\njob but police say they are pursuing all lines of inquiry. \n\nIn Sydney, Karen Barlow reports.\n\nKAREN BARLOW: Police believe the painting, called A Cavalier - Self\nPortrait, was stolen sometime between 10am and 12:30pm on Sunday. \n\nActing Superintendent Simon Hardman says the small 16 by 20 centimetre\nartwork had to be unscrewed from the wall. \n\nSIMON HARDMAN: We believe that it was removed expertly from the gallery and\nwe're currently reviewing CCTV footage.\n\nKAREN BARLOW: Trouble is there was no camera in the painting's room and\naccording to the Art Gallery of NSW Director, Edmund Capon, no security\nguard. \n\nEDMUND CAPON: The 5-6,000 people who came to the gallery on Sunday might\njust have a glimpse of something that might lead to the recovery of the\npicture, that would be wonderful.\n\nKAREN BARLOW: Mr Capon has defended the gallery's security system.\n\nEDMUND CAPON: That any public art institution like this, with hundreds and\nhundreds of works of art, vulnerable works of art on the wall every day,\none-and-a-quarter, one-and-a-half million people a year coming through\nrelies on public goodwill to an extraordinary extent. \n\nThe other thing is that we are, we have a record of security, management,\norganisation that is second to none. And an incident such as this is\nextraordinarily rare. \n\nKAREN BARLOW: He is also not concerned that it has taken five days for the\ntheft to become public. \n\nEDMUND CAPON: That's not to say that nothing's been done. Monday was the\npolice; secondly, I was away; thirdly I had to speak to the donor; and\nfourthly there's a lot of work been done in the last two days, believe me. \n\nKAREN BARLOW: The van Mieris artwork was a given to the gallery in 1993 by\nphilanthropist and former publisher, James Fairfax. \n\nIt is one of the smallest paintings in the gallery, which may or may not\nhave made it a target. \n\nEdmund Capon is unimpressed.\n\nEDMUND CAPON: How would you feel? It's like the loss of, if you walk home\nand find a gap on your wall, that's how I feel. And I don't like gaps on the\nwall. \n\nKAREN BARLOW: Art experts say the distinctiveness of the painting and the\npublicity surrounding the theft will make it virtually impossible to resell.\n\nTim Goodman is the Chief Executive of the auction house, Bonhams and\nGoodman.\n\nTIM GOODMAN: It's a unique painting, it's highly specialised, it's an old\nmaster, it's not hugely valuable in terms of major works of this period or\ngenre. So it is very unlikely that it's going to be offered for sale.\n\nKAREN BARLOW: Mr Goodman says monetary gain is a most unlikely motive.\n\nTIM GOODMAN: I suspect that it's the work of somebody who's possibly has\nmental problems. Perhaps they have a vendetta against the gallery or perhaps\neven the donor. Who knows? It could be any number of reasons. It might have\nbeen the way the gentleman sitter in the picture looked at the thief.\n\nKAREN BARLOW: The gallery's Director, Edmund Capon rejects any assertion\nthat any staff member could be the thief but police say they are pursuing\nall lines of inquiry. \n\nThe space where the van Mieris went missing has been rehung so there is no\ngap on the gallery wall.\n\nELEANOR HALL: Karen Barlow reporting.\n\nhttp://www.abc.net.au/worldtoday/content/2007/s1951612.htm \n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Fri, 15 Jun 2007 07:15:17 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Group identifies most endangered US historic sites\nTo: \nMessage-ID: <067601c7af0c$2bc13860$8343a920$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nGroup identifies most endangered US historic sites\n(Reuters)\n\n14 June 2007 \n\n\n\nCAROLINA - A 1925 race track that drew the rich and famous to Florida and\nthe studio of a 95-year-old blacksmith whose ornamental ironwork gave\nCharleston, South Carolina, its distinctive look are among the most\nendangered US landmarks, a preservation group said on Thursday.\n\n\nThe National Trust for Historic Preservation listed the following sites in\nthe 20th edition of its annual report on America's most endangered historic\nplaces.\n\n -- Historic Brooklyn waterfront - Dockyards and factories are being\ndemolished by developers seeking to cash in on the area's hip status.\n\n -- El Camino Real de Tierra Adentro National Historic Trail, New Mexico -\nThe earliest Euro-American trade route in the United States is threatened by\na $225 million commercial spaceport planned near one of its most pristine\nsegments.\n\n -- H.H. Richardson House, Brookline, Massachusetts - The home and studio of\n19th century American architect Henry Hobson Richardson, who created\nBoston's Trinity Church, may be demolished unless a buyer willing to\npreserve it is found.\n\n -- Hialeah Park Race Course, Hialeah, Florida - A 1925 racetrack known for\nits Mediterranean architecture and pink flamingos. It drew the likes of\nHarry Truman, Winston Churchill and Seabiscuit to Florida. A planned\ncondominium, retail and office complex would destroy much of the park.\n\n -- Historic sites in seven states from Virginia to New York are threatened\nby a plan to build new high-voltage electric transmission lines through the\nregion.\n\n -- Historic structures in Mark Twain National Forest, Missouri - Frontier\nfarms and New DeAl era fire lookouts and ranger stations in the park are\ndeteriorating due to Forest Service budget limitations and are threatened\nwith demolition.\n\n -- Motels on Route 66 - Motels from Illinois to California - With the road\nbypassed by interstate highways, many of the mom-and-pop motels along the\nso-called 'mother road' are being torn down for new construction or are\nfalling victim to the elements.\n\n -- Minidoka Internment National Monument, Jerome County, Idaho - The camp\nwhere thousands of Japanese-American citizens and immigrants were interned\nduring the Second World War is routinely looted of artifacts and is\nthreatened by local land usage, including a huge animal feed operation\nnearby.\n\n -- Philip Simmons' Workshop and Home, Charleston, South Carolina - The\nlegacy of the 95-year-old master blacksmith, who has spent nearly 80 years\nadorning his hometown with intricate iron gates, fences, stair rails and\nwindow grills, is in jeopardy because of a lack of plans to preserve his\nhome and studio.\n\n -- Pinon Canyon, Colorado - The Pinon Canyon area of southeastern Colorado\nincludes scenic buttes, river valleys, family ranches and historic and\narcheological sites that span 11,500 years. It is threatened by plans to\nexpand a neighboring US Army facility.\n\n -- Stewart's Point Rancheria, Sonoma County, California - The Kashia Pomo\npeople of northern California are losing their sacred and historic sites to\nlooters, vandals and the elements because of the federal government's\nprogram to protect tribal historic resources is under-funded.\n\nhttp://www.khaleejtimes.com/\n\n\n\n------------------------------\n\nMessage: 5\nDate: Fri, 15 Jun 2007 07:15:17 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Switzerland has returned an ancient Greek statue stolen\n\t16\tyears ago and recently discovered in the collection of an\n\tantiquities dealer.\nTo: \nMessage-ID: <068401c7af0c$2e5a59d0$8b0f0d70$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nJune 14, 2007 - 5:02 PM \nSwiss hand back stolen statue from Crete\n \nImage caption: The 1.3-metre statue is of great value for Greece's cultural\nheritage (Keystone):\nPhoto: http://tinyurl.com/2lshdy\n \nSwitzerland has returned an ancient Greek statue stolen 16 years ago and\nrecently discovered in the collection of an antiquities dealer.\nThe recovery of the 1,900-year-old headless marble sculpture comes as Greece\ncampaigns for the repatriation of illegally exported antiquities.\nThe Federal Culture Office said the 1.3-metre torso of a young man was\nloaded on a plane in Zurich bound for Athens, where it arrived on Thursday.\nThe Culture Office added that Switzerland was implementing measures to\ncombat the illegal transfer of cultural goods.\nSwitzerland has concluded several agreements on the import and repatriation\nof cultural heritage with countries including Greece, Italy and Peru.\nThe Greek culture minister, Giorgos Voulgarakis, said the statue returned\nhad been stolen from the town of Gortyn on the island of Crete. It was\ntraced in March to the Swiss city of Basel.\n\n\"Today's event is a result of international cooperation to protect our\ncultural heritage. More results will be announced soon,\" Voulgarakis said\nafter the statue was delivered to the National Archaeological Museum in\nAthens.\n\nHe said the statue would be returned to Crete at a later date.\n\n \nElgin marbles\n \nThe returned statue, possibly the Greek god Apollo, had been registered as\nstolen on an international police database. Its location was reported to\nInterpol in March by an unknown individual, Yves Fischer of the Swiss\nFederal Culture Office told the Associated Press.\nVoulgarakis said the Swiss-based antiquities dealer was persuaded by\nauthorities to surrender the statue and voluntarily drop all claims to it.\nVoulgarakis formerly headed a ministry in charge of law enforcement and has\nstepped up efforts against the rogue antiquities trade since becoming\nculture minister last year.\nRecently returned antiquities include sculptures from the J. Paul Getty\nMuseum in Los Angeles.\n\nVoulgarakis' campaign coincides with the construction of a museum at the\nfoot of the ancient Acropolis which is due open in early 2008.\n\nThe site will be purpose-built to house the Elgin marbles, the Parthenon\nsculptures on display at the British Museum in London, if returned.\n\n\"The new museum will soon be a reality,\" Voulgarakis said. \"We are striving\nfor the marbles to be reunited. It would be a shame for such a museum at\nsuch a special site to remain half-empty.\"\n\n \nCONTEXT\n \nIn 2005 new legislation came into force bringing Switzerland into line with\nthe 1970 Unesco Convention against cultural goods trafficking.\n\nThe law obliges art dealers and auction houses to identify customers and\nforeign owners of stolen artwork now have 30 years to claim it back.\n\nThe Federal Culture Office says Switzerland is among the five biggest art\ntrade hubs, with a market worth SFr1.5 billion ($1.2 billion).\n \n \nRELATED SITES\n \nFederal Culture Office (German, French, Italian)\n(http://www.bak.admin.ch/bak/index.html?lang=de) \nUnesco Convention against cultural goods trafficking\n(http://www.unesco.org/culture/laws/1970/html_eng/page1.shtml) \nInterpol - Stolen works of art\n(http://www.interpol.int/Public/WorkOfArt/Default.asp) \n\n----------------------------------------------------------------------------\n----\n\n\nURL of this\nstory:http://www.swissinfo.org/eng/swissinfo.html?siteSect=105&sid=7926788\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Fri, 15 Jun 2007 07:30:33 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] El Salvador. Cinco pinturas de artistas nacionales\n\tfueron sustra?das entre 2004 y 2007 La polic?a no ha recibido\n\tdenuncias ni Concultura conoce lo ocurrido\nTo: \nMessage-ID: <0bc601c7af0e$4b72b4c0$e2581e40$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nRoban en pinacoteca  \nJES?S CORVERA \n\nMi?rcoles, 13 de Junio de 2007  \nLA PAZ  Cinco pinturas de artistas nacionales fueron sustra?das entre 2004 y\n2007 La polic?a no ha recibido denuncias ni Concultura conoce lo ocurrido \n\n\n Cinco pinturas fueron robadas de la pinacoteca Camilo Minero y de la\nBiblioteca Sa?l Flores de Zacatecoluca, entre 2004 y 2007. Ni la polic?a ni\nlas autoridades de la Direcci?n Nacional de Espacios de Desarrollo Cultural\ndel Consejo Nacional para la Cultura y el Arte (Concultura) conocen del\nhecho. \nManuel Bonilla, Director Nacional de Espacios de Desarrollo Cultural,\nexpres? que desconoce los robos y que se deben investigar. \n\nMarcos Palacios, promotor cultural de la Casa de la Cultura de Zacatecoluca,\ndijo que tres de estas pinturas fueron sustra?das en 2004 durante la\nreconstrucci?n de la biblioteca local que hoy se denomina Biblioteca P?blica\nProfesor Sa?l Flores, ubicada en la calle Doctor Nicol?s Pe?a, del Barrio\nCandelaria. \n\nPalacios explic? que Ra?l Bonilla coordinador departamental de las casas de\nla cultura de La Paz, luego de la p?rdida de las pinturas inici? un informe\nque qued? en el tintero porque enferm? y falleci? en 2006. \n\nA?adi? que las tres primeras obras hurtadas se denominan \"Paisaje de la\nciudad\", \"Sue?o\" y \"Las Vegas\". \n\nLas otras dos pinturas, sustra?das de la pinacoteca Camilo Minero entre\nmarzo y abril de este a?o, se titulan \"Paisaje volc?nico\" y \"Balneario de\nIchanmichen\". \n\nA?adi? que estas obras fueron las ganadoras de los cert?menes de pintura y\ndibujo realizados entre 1985 y 1990 en Zacatecoluca. Se desconoce el nombre\nde los artistas salvadore?os, porque se perdieron los archivos\ncorrespondientes. \n\nWendy Carolina Alonso, como sucesora de Ra?l Bonilla, empez? a elaborar un\nreporte del caso, pero se retir? el mes anterior. Tampoco se hizo la\ndenuncia a la polic?a ni a Concultura. \n\nSospechas \n\nHern?n Acevedo encargado interino de la Casa de la Cultura de Zacatecoluca\nmanifest? que posiblemente una misma persona sea la culpable de los robos,\nya que se realizaron de la misma forma. \n\nEl Comit? de Apoyo de la casa de la cultura local sugiere a las autoridades\nde Concultura instalar vigilancia privada para evitar detener este abuso. \n\nAlfredo Herrera expresidente de dicho comit? dijo: \"espero que Concultura\ndenuncie la p?rdida de las pinturas para que las autoridades respectivas\ninvestiguen pronto\". \n\nhttp://www.elsalvador.com/ \n\n\n\n------------------------------\n\nMessage: 7\nDate: Fri, 15 Jun 2007 07:30:33 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] USA. Nine felony charges against a former art gallery\n\taccused\tof stealing art and fraudulently using credit cards were\n\tdismissed last week,\tauthorities said. Settlement says Gypsum woman\n\twill pay former\temployer $20, 000\nTo: \nMessage-ID: <0bc701c7af0e$4c0c0e90$e4242bb0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nAllegations of art gallery fraud dropped\n\n\nSettlement says Gypsum woman will pay former employer $20,000\n\n\n  \nSteve Lynn\nVail, CO Colorado\nJune 14, 2007\n\nEAGLE - Nine felony charges against a former art gallery accused of stealing\nart and fraudulently using credit cards were dismissed last week,\nauthorities said. \n\nDiane Stockmar, of Gypsum, would pay $20,000 to her former employer though\nprosecutors dropped nine felony charges - a count of theft, four counts of\nunauthorized use of a transaction device and four counts of criminal\nimpersonation, said District Attorney Mark Hurlbert. \n\n\"Cases are very fluid - sometimes the evidence gets worse and sometimes the\nevidence gets better,\" Hurlbert said. \"The evidence got so bad that we\ncouldn't prove the case beyond a reasonable doubt.\" \n\nStockmar was accused of failing to pay gallery artists for more than\n$100,000 of artwork and impersonating gallery co-owner Adele Arrowsmith to\napply for credit cards for her own use, police said. \n\nPolice began investigating Stockmar in 2002, when the Dragonfly Art Gallery\nin Avon went out of business.\n\nThe restitution Stockmar agreed to pay was not an admission of guilt, said\nher defense attorney Jim Fahrenholtz. \n\nStockmar was confident to go to trial because a jury would have found her\nnot guilty, he said. \n\n\"I think that this whole ordeal has worn on my client and she's glad it over\nwith,\"\n Fahrenholtz said. \"She never would have pled guilty to anything.\" \n\nFahrenholtz had evidence that former gallery owner Adele Arrowsmith gave\nStockmar permission to start credit card accounts. Police searched\nStockmar's home and never found any stolen art and Arrowsmith failed to\ncorrectly take inventory, he said. \n\nArrowsmith was \"very shaken and very upset\" by prosecutors' decision. \n\n\"I deserved a great deal more,\" Arrowsmith said. \"With $20,000 how am I\ngoing to pay the artists who were also deceived and robbed?\"\n\nProsecutors called Arrowsmith, of Burbank, Calif., several times to try to\nfill in gaps in the evidence, but that didn't work, Hurlbert said. \n\n\"That doesn't mean I didn't believe that there aren't victims in this case,\"\nHurlbert said. \"I just can't prove it, given the state of the evidence.\" \n\n\nStaff Writer Steve Lynn can be reached at 748-2931 or slynn@vaildaily.com.\n\nhttp://www.vaildaily.com/\n\n\n\n\n------------------------------\n\nMessage: 8\nDate: Fri, 15 Jun 2007 07:30:33 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Nearly five years after Frederic Bednarz's violin was\n\tstolen\tfrom a Harvard Square music school, police have found the $24,\n\t000 instrument. But it's unclear if police ever plan to charge the\n\tcrooks involved in the high-profile heist.\nTo: \nMessage-ID: <0bc801c7af0e$4c87a730$e596f590$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nFive years later, stolen violin found\nBy Erin Smith/ CambridgeChronicle.com\nThursday, June 14, 2007 - Updated: 12:50 PM EST\n\nNearly five years after Frederic Bednarz's violin was stolen from a Harvard\nSquare music school, police have found the $24,000 instrument. But it's\nunclear if police ever plan to charge the crooks involved in the\nhigh-profile heist. \n \n    For Bednarz, a Montreal-born violinist, the return of the pricey\n19th-century violin is a case of too little, too late. \n \n    \"Well, you know, it's been such a long time that I've dealt with it and\nbought another violin,\" said Bednarz. \n \n    In 2002, Bednarz's violin was stolen from his locker in the basement of\nthe Longy School of Music while he was at lunch. At the time, Bednarz had\njust arrived in Boston for a two-year stint as a professional studies\nstudent at school working toward his artist diploma in chamber music\nperformance. Staff and musicians searched the school for days, but couldn't\nfind the violin, which Bednarz had borrowed from his Montreal sponsor. \n \n    Then, last November, Weston Police received a tip about the violin and\nCambridge Police recovered the stolen instrument, according to Weston Police\nChief Steven Shaw. \n \n    Investigators in Weston and Cambridge began working together on the case\nwhen the violin was first stolen five years ago and revived the partnership\nwhen Weston Police received the tip last year. \n \n    \"It never really fell off the radar screen,\" said Shaw. \n \n    Police at both departments are keeping the details about the violin's\nrecovery under wraps. Cambridge Police are refusing to discuss the case or\nsay how the rare instrument was found. No one had been charged with the\ntheft as of this week, and it's unclear whether Cambridge Police ever plan\nto make an arrest in the case. \n \n    \"That's all we're going to give out,\" said police spokesman Frank\nPasquarello, who refused to give a reason for withholding the information. \n \n    The violin was earlier rumored to be from the 1700s, one of the rare\nviolins still in existence today crafted by Italian Santo Serafin. More\nrecently, however, experts estimated the instrument was made in Venice,\nItaly, around 1800. \n \n    At the time of the theft, musicians suspected that the violin was stolen\nby teens who didn't know the value of the instrument. Police and instrument\ndealers had said the rare violin would be hard to sell on the open market\nwithout drawing attention. \n \n    The insurance company has since refunded the money for the instrument,\nand Bednarz bought and tried playing several instruments in past years,\nfinally settling on another older instrument. \n \n    \"It's not exactly what I had, but I like it,\" said Bednarz. \n \n    The insurance company sold Bednarz's stolen violin at Tarisio auction\nhouse last month, according to Chris Reuning, owner of Reuning & Son Violins\nin Boston. \n \n    The violin sold at auction for $24,150, said Reuning, one of the\nfounding partners of Tarisio. \n \n    Tarisio is the world's largest auction house for stringed instruments\nand sells more than 2,000 violins, violas, cellos and bows each year. \n \n    As for Bednarz, he moved back to Montreal this week to play with the\nMolinari Quartet and doesn't mind that his former violin has a new owner. \n \n    Said Bednarz, \"That's OK. I'm sure someone's happy.\" \n\nhttp://news.bostonherald.com/\n\n\n\n------------------------------\n\nMessage: 9\nDate: Fri, 15 Jun 2007 08:09:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Van Mieris theft. FBI experience,\tis that approximately\n\t80 per cent of museum theft cases of art are\tinside jobs\nTo: \nMessage-ID: <0bd701c7af13$c35e6010$4a1b2030$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nPainting 'could have fitted under clothes'\n\n\n+++++++++++++++\n\nComment:\n\n\"FBI experience, is that approximately 80 per cent of museum theft cases of\nart are inside jobs\". This calls for some clarification. It should read 80%\nof all cases 'that have been solved' appear to be inside jobs.\n\nTC\n\n+++++++++++++++++\n\n\nBy Katherine Danks\nJune 14, 2007 03:06pm\n\nTHE thief who stole a $1.4 million masterpiece from Sydney's Art Gallery of\nNSW may have slipped it under a coat after unscrewing the painting from a\nwall, the gallery's head admits.\n\nThe 17th century work by Dutch master Frans van Mieris, titled A Cavalier\n(Self Portrait), was stolen from the busy gallery between 10am and 12.30pm\non Sunday, under the noses of security guards. \n\nThe painting was swiftly and expertly removed from the wall on a day 6000\npeople passed through the building, said police Acting Superintendent Simon\nHarding. \n\nPolice have yet to rule out an inside job and authorities fear the\n\"extremely valuable and important\" painting may already be out of the\ncountry. \n\nArt Gallery of NSW director Edmund Capon said the theft was not reported to\npolice until Monday because staff had looked for the missing artwork in the\ngallery's storage facilities. \n\nSecurity at the gallery was now being reviewed, Mr Capon said. \n\nBut he said: \"We have a record of security management and organisation that\nis second to none, and an incident such as this is extraordinarily rare and\nwe have barely had an occasion like this in the past.\" \n\nSecurity footage is being reviewed but police say there were no cameras in\nthe small room where the painting was hung. \n\nPatrons do not pass through security screens when entering the building, and\nno alarm was activated. \n\nWhile security guards were patrolling the gallery on Sunday, none were\nstationed in the room where the theft occurred, police said. \n\nA Cavalier has been on exhibition at the gallery since it was donated by art\npatron and philanthropist James Fairfax in 1993. \n\nPainted between 1657 and 1659, the work is one of the smallest paintings in\nthe gallery, measuring 30.7 cm by 26.7 cm, including the frame. \n\nMr Capon said it was small enough to have been hidden under a person's\nclothing. \n\n\"To be honest, I could slip it under your coat ... it could have happened\nthat way,\" he told a reporter. \n\nMr Capon appealed to members of the public at the gallery on Sunday to pass\non any relevant information. \n\nPolice have interviewed gallery staff.\n\nRobert E Goldman, special investigator with the FBI's art crime team, said\nit was likely the heist was an inside job. \n\n\"Our experience, the FBI experience, is that approximately 80 per cent of\nmuseum theft cases of art are inside jobs - either people who work there -\npeople who we say 'have the keys to the kingdom',\" Mr Goldman said on ABC\nradio. \n\nMr Goldman said the artwork would be extremely difficult to sell because\nnews of its theft would spread around the world very quickly. \n\nHe said it was unlikely a ransom demand would be made by the art thieves. \n\nMr Capon said the timber-framed artwork would likely be sold overseas if the\nthieves were to offload it. \n\n\"It's a fairly sort of discreet and esoteric audience I would say. One of\nthe things that occurs to me is this picture is pretty unsaleable,\" he said.\n\n\"Anybody who knows anything about van Mieris or Dutch painters, 17th century\npainting, will know that painting and know it belongs in this building.\" \n\nThe painting is on an oak panel and could crack if it is not kept in a\nclimate-controlled environment, he warned. \n\nMr Capon said he felt a personal sense of loss following the theft. \n\n\"If you walk home and find a gap on your wall, that's how I feel, and I\ndon't like gaps on the wall,\" he said. \n\nCustoms and Interpol have been notified. \n\nhttp://www.news.com.au/\n\n\n\n------------------------------\n\nMessage: 10\nDate: Fri, 15 Jun 2007 08:09:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Van Mieris theft. Freedom in frame after theft.\nTo: \nMessage-ID: <0bd801c7af13$c4c51c00$4e4f5400$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nFreedom in frame after theft\nMatthew Westwood, Deputy arts editor \nJune 15, 2007 \n\nIT'S a tiny thing, measuring just 30cm by 26cm with frame, that could easily\nbe tucked inside a jacket or bag.\nYou could call it a Cavalier take-away. \n\nNow the painting by Frans van Mieris I, called A Cavalier (self portrait),\nhas become one of Australia's most wanted, after it was stolen from the Art\nGallery of NSW on Sunday. \n\nWhether the person who \"expertly\" unscrewed it from the gallery wall was a\nprofessional art thief or a brazen amateur, we do not know. \n\nThe heist breaches the unspoken contract between gallery and public: that\nvaluable and important works of art are there for all to enjoy. \n\nVisitors to the handsome sandstone edifice of the AGNSW, in Sydney's Domain,\nenjoy its collection for free - there is no admission charge, unlike many\ngalleries overseas - and are generally unmolested by security staff. \n\nWe should cherish that. \n\nBut it's also easy to see how such a small and valuable painting became an\nobject of greed. \n\nThere is no closed-circuit television in the small antechamber, part of the\nJames Fairfax Galleries, where the painting usually hangs. \n\nOn Wednesday evening, when news of the theft became public, security patrols\nin the area were still intermittent. \n\nThe little gallery was roped off - a sign said \"Area Closed: No Entry\" - and\nyet I was able to step over the rope and inspect the holes in the walls from\nwhere the Cavalier had been removed. \n\nThe Dutch Cavalier, insured for $1.4 million, does not have the national\nresonance for Australians that, for example, Munch's The Scream has for\nNorwegians. In 2004, The Scream was stolen from the Munch Museum in Oslo. \n\nThe AGNSW's director, Edmund Capon, yesterday indicated that security could\nbe improved at the gallery. \n\nThat may be necessary. But heightened security should not spoil our freedom\nto enjoy the art collection that belongs to us all.\n\nhttp://www.theaustralian.news.com.au/\n\n\n\n------------------------------\n\nMessage: 11\nDate: Fri, 15 Jun 2007 08:09:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] In den Archiven lauern viele Gefahren.\nTo: \nCc: bihanne.wassink@nationaalarchief.nl\nMessage-ID: <0bd901c7af13$c6203f30$5260bd90$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nIn den Archiven lauern viele Gefahren \n \nDr. Anna Haberditzl referierte ?ber Konservierung und Restaurierung von\nKulturg?tern \n\n\nBronnbach. Papier zerf?llt, der Holzwurm nagt, Tinte verblasst, digitale\nAufzeichnungen sind schon nach wenigen Jahrzehnten nicht mehr les- und damit\nnutzbar. Droht \"Alzheimer im Archiv?\" Gibt es \"Gefahren f?r das Ged?chtnis\nder Region\"? Plakative Fragen, die Dr. Anna Haberditzl vom Ludwigsburger\nInstitut f?r Erhaltung von Archiv- und Bibliotheksgut am Mittwochabend zur\nEr?ffnung der Ausstellung \"Heute gerettet - gesichert f?r die Zukunft.\nKonservierung und Restaurierung von Kulturgut im Landesarchiv\nBaden-W?rttemberg\" stellte.\n\nTrotz des eher sperrigen Titels sollte sich niemand vom Besuch der\nPr?sentation im Vortragssaal des Staatsarchivs Wertheim in Kloster Bronnbach\nabhalten lassen. Hinter einem vermeintlich trockenen Thema verbergen sich\ninteressante Geschichten. Spannend, sehr anschaulich, vor allem aber auch\nnicht nur f?r ein Fachpublikum verst?ndlich, waren die Ausf?hrungen von Dr.\nHaberditzl. Unumwunden r?umte sie ein, der Titel ihres Vortrages solle\n\"Unruhe stiften\" und dar?ber \"Interesse und Verst?ndnis wecken\" f?r die\nArbeit der Restauratoren.\n\nMan stelle sich die Archive, auch als \"kollektive Ged?chtnisse\" bezeichnet,\nimmer als besonders sichere Orte vor. Aber auch Papier und Pergament sei\nschadensanf?llig, k?nnten gegebenenfalls nicht mehr verwendet, insbesondere\nwenn die Unterlagen nicht sachgerecht aufbewahrt w?rden. Feuer und Wasser\nbezeichnete die Referentin daneben als die gr??ten Feinde wertvoller alter\nExponate. Sie verwies auf den Brand in der Herzogin-Anna-Amalia-Bibliothek\nin Weimar im September 2004, wobei zigtausende Kostbarkeiten verloren gingen\noder schwer besch?digt wurden. Die Kosten f?r die Wiederbeschaffung oder die\nRestaurierung, soweit dies jeweils ?berhaupt m?glich sei, bezifferte sie auf\n67 Millionen Euro.\n\nFeuchtigkeit und W?rme f?rderten den Schimmelpilz, der zerst?re die Substanz\nder Archivalie, Bl?tter w?rden m?rbe und br?chig. Holzwurm und M?use liebten\nStaub und stickige Atmosph?re, so Haberditzl weiter in einem wahren\n\"Horrorszenario\". Deshalb seien Sauberkeit und frische Luft bei der\nAufbewahrung so wichtig. Als \"besonders heimt?ckisch\" bezeichnete sie den\nTintenfra?, zerst?re dieser doch Schrift und Papier m?glicherweise nahezu\nunbemerkt von innen.\n\nDie Referentin warnte aber auch eindringlich davor, Reparaturversuche\nmittels Selbstklebefolien und -b?ndern zu unternehmen und bedauerte, dass\n\"in der Plastikeuphorie\" vergangener Jahrzehnte viele Unterlagen fest in\nFolie eingeschwei?t worden seien. F?r einen dauerhaften Erhalt sei dies kaum\ngeeignet.\n\n\"Der gr??te Sch?dling f?r die Archivalien sind die Archivare selbst\", kam\ndie Vortragende schmunzelnd auf ein gro?es Dilemma zu sprechen. Einerseits\nsollten alte Unterlagen durchaus genutzt werden, andererseits schade dies\ngerade den Materialien bei unsachgem??er Handhabung. \"Jeder Nutzer hat die\nVerantwortung, dass auch nachfolgende Generationen noch auf das Wissen der\nVergangenheit zugreifen k?nnen.\"\n\nMit Erstaunen mag mancher im Publikum zur Kenntnis genommen haben, dass\ngerade Unterlagen j?ngeren Datums von einem fr?heren Verfall bedroht sind.\nHaberditzl nannte das Stichwort \"endogener Papierzerfall\". Die Herstellung\nvon Papier zwischen etwa 1850 bis 1970 trage, auch durch die verwendeten\nMaterialien, \"den Keim der Zerst?rung bereits in sich. Nichts da mit einer\nHaltbarkeit von etwa 150 Jahren. Es ist viel schlimmer\".\n\nDie Referentin nutzte die Gelegenheit, in einem weiteren Teil ihres\nVortrags, der mit Bildern anschaulich illustriert war, auf das\nLandesrestaurierungsprogramm in Baden-W?rttemberg und auf die T?tigkeit des\nInstituts einzugehen, wo etwa 30 Mitarbeiter mit Restaurierung und Sanierung\nbesch?ftigt sind. Sie schilderte kurz auch einige Methoden der Reparatur,\nging auf die Mikroverfilmung als ein sicherer Langzeitspeicher ein und\nnannte es eine besondere Herausforderung, sich der Sicherung digitalisierter\nInformationen der heutigen Zeit zu widmen. ek\n \n\n? Fr?nkische Nachrichten - 15.06.2007  \n\nhttp://www.fnweb.de/\n\n\n\n------------------------------\n\nMessage: 12\nDate: Fri, 15 Jun 2007 08:09:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Van Mieris theft. According to the Gallery their\n\tsecurity\tsystem is next to nothing but it took too long to report this\n\ttheft because gallery staff believed it had been returned to\tstorage.\nTo: \nMessage-ID: <0bda01c7af13$c64860a0$52d921e0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nJune 15, 2007\n\nOff-the-wall theft sparks global search for ?600,000 masterpieceBernard\nLagan in Sydney\n \nPolice believe that a A$1.4 million (?600,000) painting, deftly unscrewed\nfrom a wall while Sydney?s most distinguished art gallery was filled with\nvisitors, may have already been transported overseas. \n\nThey said that the canvas by Frans van Mieris, the 17th-century Dutch\nmaster, stolen from the Art Gallery of New South Wales, was taken by an\nexpert. The painting went missing during the busiest day of the week at the\ngallery, which attracted 6,000 visitors, and despite the constant presence\nof security guards. \n\nThe disappearance of the work, A Cavalier (Self Portrait), painted 1657-59,\nwas not reported to police until Monday because gallery staff believed\ninitially that it had been returned to storage. \n\nEdmund Capon, the gallery?s long-serving director, cut short a visit to\nLondon after learning of the theft. He said that the work, which is roughly\nthe size of an A3 sheet of paper, could have been smuggled from the gallery\nwrapped inside a coat. \n\nJames Fairfax, a patriarch of the Australian newspaper publishing dynasty,\nwho donated the painting, has been told of its theft. The painting had been\nexhibited at the gallery continuously since 1993. \n\nMr Capon said that it would be difficult to find a buyer for the stolen\npainting. He said: ?It?s rare painting. Van Mieris is a rare artist. One of\nthe things that occurs to me is that this picture is pretty much unsaleable.\nFirstly, because it is a small audience and it is a very specialised\ninterest, and secondly, because it is well known. \n\n?Anyone who knows anything about Van Mieris or Dutch 17th-century painting\nwill know that painting and know that it belongs in this building.? \n\nThe National Gallery in London and The Getty Museum in Los Angeles are among\nthe world?s leading institutions to hold work by Van Mieris in their\ncollections. \n\nRegarded as among the most influential of the Leiden ?fine painters?, his\nwork is noted for minutely proportioned subjects, a precise attention to\ndetail and the use of bright colours with a shiny finish. \n\nVan Mieris earned a great deal of money through his paintings. However, he\nis known to have wasted his fortune funding a lavish lifestyle and through\npoor management of his finances. \n\n\nhttp://entertainment.timesonline.co.uk/\n\n\n\n------------------------------\n\nMessage: 13\nDate: Fri, 15 Jun 2007 08:53:37 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Italian construction crew investigated after ancient\n\tartifacts looted. Some items now decorate a hotel complex nearby.\nTo: \nMessage-ID: <0c5201c7af19$e669e010$b33da030$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nJune 15, 2007\n\nItalian construction crew investigated after ancient artifacts looted \n\nSome items now decorate a hotel complex nearby \n\nROME \n\nItalian police have recovered an ancient Greek temple dug up in southern\nItaly by a construction crew who had dumped or looted the prized artifacts\nand begun to pour cement over the ruins, authorities said. \n\nAfter receiving information about the discovery during construction work on\na tourist resort on the coast of southern Calabria, police used helicopters\nto locate the site near the town of Crotone, said art squad officials from\nthe Carabinieri paramilitary police. \n\nMore than 50 artifacts, including columns and mosaics, had been excavated\nfrom the site and used to decorate another hotel complex nearby, while other\npieces had been placed in a dump to be reused as construction material. \n\nWhen police located the site last week, workers were preparing to lay the\nfoundations of the resort hotel on the remaining ruins, said Gen. Giovanni\nNistri, the head of the art squad. \n\n\"It would have been the final tombstone for this temple,\" Nistri told a news\nconference in Rome. \n\nPolice identified two suspects for possible prosecution for failing to alert\nauthorities about the find, damaging the site and for illegal possession of\narchaeological artifacts, Nistri said. The two were not arrested. \n\nItaly is full of archaeological treasures, many undiscovered, and developers\nare required to report any finds. Countless public and private works have\nbeen scrapped or delayed over the years as state archaeologists descended on\nbuilding sites, and it is not uncommon for developers to fail to report a\ndiscovery and plow through ancient treasures. \n\nIn Rome, plans to build a third subway line have been delayed for decades,\nand in 1999, the construction of a parking garage caused outrage after\nworkers sliced through a Roman villa during hurried preparations for the\nHoly Year celebrations and mosaics and ceramics from the ruins turned up in\na garbage dump on Rome's outskirts. \n\nThe discovery of the Greek temple is of \"extraordinary historic and artistic\nvalue\" and experts believe it may be part of a larger ancient settlement,\nthe Carabinieri said in a statement. \n\nThe ruins are \"one big puzzle\" for scholars, as the area was previously\nthought to be devoid of such important public buildings, said archaeological\nsuperintendent Giovanni Guzzo. \n\nThe temple mixes two styles of Greek architecture, combining the austere\nDoric with the more graceful decorations of Ionic. It was probably built\nbetween the fourth and third centuries BC by the Bruzii, an Italic\npopulation that lived under Hellenistic influence, which at the time\nextended across southern Italy, Guzzo said. \n\nHe said that over the next months archaeologists will work to enlarge the\n50-by-20-metre dig. They will also try to reconstruct how the original\ntemple must have looked by piecing together the remains scattered and\ndamaged by the developers. \n\nASSOCIATED PRESS \n\nhttp://dcnonl.com/article/id23007\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 142\n****************************************\n\n"}