{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"HUD Agent\" <km93xqldt@veryflakes.com>", "subject": "Government Foreclosures from =?UTF8?Q?=24?=10,000", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nYou could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government. You could find a beautiful home that has been seized by the government.\ntrmedia220070106\n\n\n\n\n______________________________________________________\n\n\nTo stop receiving emails, click here\n"}