{"category": "ham", "to_address": "\"\" <ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"The Internet Patrol\" <info@theinternetpatrol.com>", "subject": "The Internet Patrol -  Yahoo Greetings from the Yahoo Roof Party", "body": "\n\n\nThe Internet Patrol\n\n\n The Internet Patrol\nhttp://www.theinternetpatrol.com\n\nYahoo Greetings from the Yahoo Roof Party\n If a picture is worth a thousand words, this one must be saying \"party x 1000\".    If the Yahoo images that come to mind generally are of harried system administrators or pocket-protected geeks, think again. Because that's a roof party on Yahoo real estate, about to happen.   We hope that our friends at Yahoo enjoy, because we know that they work hard fighting spam and dealing with other email and Internet maladies, so they deserve it.  Of course, with temperatures in the 90s as it has been this week, they may prefer a Yahoo pool party to a Yahoo roof party.  \n Read more here: Yahoo Greetings from the Yahoo Roof Party \nYou Can Backup Your Computer Now for Free!  Use the Same Online Backup Service that We Do!\n Here are some amazing deals we've found on the Internet for ourselves recently: \n You Can Backup Your Computer Now for Free!  Use the Same Online Backup Service that We Do! \n Get gadget insurance for your cell phone, PDA and all your electronic gadgets, to protect against los or theft!  http://www.theinternetpatrol.com/get-your-stuff-back-with-stuffbak-pdas-laptops-cell-phones-protect-them-all \n Send Unlimited Newsletters to Your Customers, Friends, Family, and Others:  http://www.theinternetpatrol.com/the-perfect-way-to-send-email-newsletters\n  Unlimited Calls to Any Phone in the U.S.:  http://www.theinternetpatrol.com/make-unlimited-phone-calls\n Check out our online audio show, \"Three Things You Should Know\"!  http://www.ThreeThingsYouShouldKnow.com\n And check out the best collection of how to videos at http://www.LearnHowTo.TV ! \n Know somebody who would like to receive these alerts?  Forward this one to them and let them know that they can sign up for free by sending email to internetpatrol@aweber.com with the  word 'Subscribe' in the subject! \n\n\n The Internet Patrol, \n302 W. El Camino Real, #411, \nSunnyvale, CA 94087, USA  \n\n\nTo unsubscribe or change subscriber options visit:\nhttp://clients.suretymailings.com/z/r/?TBwMLMwctMzsTCxMTJzs\n\n\n"}