{"category": "spam", "to_address": "<1@yahoo.com>", "from_address": "\"BRITISH TOBACCO COMPANY\" <infocenter_2007@yahoo.co.uk>", "subject": "PERSONAL !!!", "body": "\nBRITISH TOBACCO\nMEGA JACKPOT PROMOTION\nOld Bond Street,\nWhitefield, Manchester M457SX U.K.\nRegistered Charity No.QE77BT\n\n\n\nLucky Winner;\nREF NO: MELI-T/17-F044262312\nTICKET NUMBER 9901-0148-790-691\nSERIAL NUMBER 6109-17\n\n\nELECTRONIC MAIL AWARD PROMOTION;\nWe are pleased to inform you that you are one of the\nselected winners of the BRITISH TOBACCO MEGA JACKPOT\nPROMOTION held on the second quarter of 2007. Your\nemail address attached to ticket number 9901-0148-790-\n691, with serial number 6109-17 drew the lucky numbers\n990-11-815-37-10-83; the lottery was categorized into\nseven zonal stages (Africa,North America,South\nAmerica,Central America, Europe, Oceania and Asia).\nConsequently, you have won the lottery in the 2nd\ncategory. You have therefore been approved for a lump\nsum pay out of (ONE MILLION,FIVE HUNDRED)US dollars\nCredited to file REF NO:MELI-T/17-F044262312 Batch No.\n13/FFP/LDL/037.\n\n\n\nAll participants were selected through a computer\nballot system drawn from 25,000 names from the Middle\nEast, Asia, Africa,Oceania,Central America,South\nAmerica, Europe and North America. All participants in\nthis Lottery Program have been selected randomly\nthrough a computer Ballot System drawn from over\n200,000 Companies and 30,000,000 individual emails\naddress from all search engines and web sites. This\npromotional program will take place every year until\nthe Olympics games begin in Beijing China in 2008.\nHowever,winners are only eligible for claims once.\n\n\n\nDue to the mix up of some numbers and names, we ask\nthat you keep this award strictly from public notice\nuntil your claims have been processed and your money\nremitted to your nominal bank account. This is part of\nour security protocol to avoid double claiming or\nunscrupulous acts by participants of this program.\n\n\nELIGIBILITY:\n\n\nThis promotion is offered only electronically via the\nInternet and is open to all persons from age 18 years\nand above with a valid email address and who live in\nany of the aforementioned countries. This promotion is\nvoid in all other countries and is also void where\nprohibited.\n\n\nPrincipals and employees of the BRITISH AMERICAN\nTOBACCO and its respective Parent subsidiaries and\ntheir immediate families are not eligible.\n\n\nCLAIMS PROCEDURES:\n\n\nIt is our norm to allocate accredited agents for the\nprocessing of claims application. It is even more\nimperative for overseas winners.\n\n\nTo begin your claims therefore, you are advised as a\nmatter of urgency, to contact the under listed\nlicensed and accredited claims agent for the\nprocessing of your prize award winning.\n\n\nPlease contact the clearing and forwarding house\n(through your claims agent only) the body assigned\nwith the verification of all emergent winner.\nTherefore all protocols laid down by them must be\nfollowed to facilitate your claims;\n\n\nCONTACT Details:\nMr. ALBERT GREGORY,\n20 Lausanne Road London, SW2 3JB ENGLAND.U.K\nEmail: forwarding_office@yahoo.co.uk\n\n\n\nYou are to provide the claims agent with the under\nlisted information as\nsoon as possible:\n\n1. NAMES IN FULL:................................\n\n2. ADDRESS:.....................................\n\n3. NATIONALITY:.................................\n\n4. AGE:.........................................\n\n5. OCCUPATION:..................................\n\n6. PHONE/FACSIMILE:...................................\n\n7.COUNTRY OF RESIDENCE..........................\n\n\nIMPORTANT NOTICE:\n\n(a) Note that there exists a periodic condition on all\nclaims process, failing so  would lead to\ndisqualification and winnings Forfeiture. Winners are\ntherefore advised to expedite their claims process.\n\n\n(b) Being one of the lucky winners, you constitute\nentrant's full and unconditional agreement to an\nacceptance of our terms and conditions of claims to\navoid any discrepancy in the cause of payment of your\nprize awards winning.\n\n\n(c) To avoid double claims, you are advised to keep\nyour winning details very confidential,as any\ndiscrepancies resulting from a breach of this\nconfidentiality on the part of the winners will be\ncovered solely by such winner as our staffs are bound\nby the oath of secrecy taken on employment.\n\n\nFor processing and remittance of your prize money to a\ndesignated bank account of your choice.Remember, all\nprize money must be claimed not later two weeks from\nyour notification.All funds not claimed on or before\ntwo weeks will be returned as unclaimed.\n\n\nNOTE: In order to avoid unnecessary delays and\ncomplications,please remember to quote your reference\nand batch numbers in all correspondences with this\noffice. Furthermore, should there be any change of\nyour address, do inform us as soon as possible.\nCongratulations again from all our staffs and thank\nyou for being part of our Promotions program.\n\n\n\nSincerely,\nBARONESS KAREN PETERSON.\nCo-ordinator.\n\n\nNB\nDo not reply to this promotional email account.\nContact your claims agent, immediately.\n\n\n\n"}