{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] New Scientist: Making Poor Nations Pay for Drugs", "body": "http://www.newscientist.com/channel/health/mg19325972.800-making-poor-nations-pay-for-drugs.html\n\nMaking poor nations pay for drugs\n\nAngela Saini\nNew Scientist\nMarch 31, 2007\n\nBIG, wealthy pharmaceutical companies get a lot of bad press because of\nthe aggressive ways they market and lobby for their products. It is more\ndifficult to hate them, however, once you know how much effort they put\ninto making new drugs. It takes more than six years to get a discovery\nto clinical trials, and 99 per cent of new compounds never make it to\nthat stage.\n\nDrug companies have been quick to remind everyone of this in the light\nof the latest controversy to beset the industry: the legal battle\nbetween the Swiss pharmaceutical giant Novartis and the Indian\ngovernment over India's refusal to grant the company a patent for its\nleukaemia drug Glivec. \"Patents save lives by stimulating research that\nleads to innovative medicines,\" a Novartis spokesman told me. \"Only with\neffective patent laws can companies make the massive investments that\nare vital to medical progress.\"\n\nThe Glivec case has attracted global attention because it could set an\nimportant precedent for drug patents in India and throughout the\ndeveloping world. Up to now Indian law has protected only truly novel\nmedicines, leaving the country's manufacturers free to copy and sell all\nother drugs with impunity, often more cheaply than their western\ncounterparts. They have been so successful in this that India is now a\nvital source of generic medicines for millions of poor patients in the\ndeveloping world. If Novartis wins, many more drugs could win patent\nprotection in India, threatening the generic industry's survival.\n\nThe key to this case - and to the drug industry in general - is\ninnovation. The Indian government insists that since Glivec is only a\nsmall improvement on existing leukaemia treatments, it is undeserving of\na patent. Novartis argues that without protection for incremental\ninnovations like Glivec, it will unfairly lose out on the profits from\nits own hard work.\n\nWestern pharmaceutical companies have always cited the need to reward\ninnovation as a justification for stronger patent laws, but in reality\nthey are not the altruistic hotbeds of innovation they would like to\nappear. True, global R&D spending has doubled in less than a decade, yet\nthe investment has not resulted in many novel cures and treatments. Over\nthe last decade, the industry appears to have spent more of its energies\nand funding on rejigging existing products than on creating new medicines.\n\nIn many ways this makes commercial sense. By slightly altering a\nchemical compound or varying a drug's delivery system, companies have\nhelped to build a profitable bank of \"me-too\" medicines that extend the\npatent life of existing ones. This is less risky and expensive than\nconducting original research. At the same time, pharmaceutical giants\nare spending millions on lawsuits to protect the patents they already own.\n\nAs a result, real innovation has been declining for almost a decade. In\n2003 the US Food and Drug Administration, which approves new drugs for\nthe American market, acknowledged that the number of applications from\npharmaceutical companies for \"truly innovative products\" was on a\ndownward trend; in 2006, fewer than a quarter were for \"new molecular\nentities\" - novel medicines that had not previously been marketed in the\nUS. In November last year, the US Government Accountability Office\nwarned that the drug industry had become \"stagnant\".\n\nNone of this has discouraged European and US pharmaceutical companies\nfrom insisting on tougher patent rules in the developing world - as\nexemplified by the Glivec case. India's drug industry has been under\npressure to innovate since the government passed a law in 2005 to\nenforce India's obligations under the World Trade Organization's TRIPS\nagreement. TRIPS, which stands for Trade-Related Aspects of Intellectual\nProperty Rights, is designed to encourage innovation by forcing\ndeveloping countries to adopt similar patent protection to wealthier ones.\n\nThis is a huge challenge for India's drug industry, given its dependence\non generics. Some people see the attempts by western companies to\nenforce the legislation as hypocritical and unfair. \"They see more\nreason to litigate and change laws in their favour than innovate,\" says\nTahir Amin, an intellectual-property lawyer and director of the\nIndia-based Initiative for Medicines, Access and Knowledge.\n\nIt is understandable that the likes of Novartis wish to protect their\nintellectual property rights, but there is more at stake. Tighter patent\nenforcement in poor countries such as India could derail the generic\ndrugs industry, leaving millions without the cheap medicines they\ndesperately need, all in the name of innovation. Is this cost really\njustified, especially when the big pharmaceutical companies seeking to\nexact it have themselves been innovating less and less?\n\nIf companies like Novartis want to encourage R&D in poorer countries,\nthey should start by setting a better example: litigate less, innovate more.\n\n From issue 2597 of New Scientist magazine, 31 March 2007, page 20\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}