{"category": "ham", "to_address": "<a2k@lists.essential.org>, <ip-health@lists.essential.org>", "from_address": "Sangeeta <ssangeeta@myjaring.net>", "subject": "[Ip-health] Proposals on \"norm-setting\" informally agreed to", "body": "Please find below the second SUNS report on the WIPO Development Agenda\nmeeting held last week in WIPO and reproduced here with permission.\n\nBest Wishes\nSangeeta Shashikant\n\n-----------------------------------------------------------------------\nProposals on \"norm-setting\" informally agreed to\n\nSUNS #6272 Friday 15 June 2007\n\nGeneva, 14 June (Sangeeta Shashikant) -- An informal meeting at the session\non the WIPO Development Agenda has agreed on seven draft proposals on\nperhaps the most sensitive of its clusters of issues - Norm-setting,\nFlexibilities, Public Policy and Public Domain (Cluster B).\n\nAgreement on the proposals was reached in an informal small group chaired by\nAmbassador Trevor Clarke of Barbados, who is also chair of the formal WIPO\nsession. It will come before the formal plenary for further discussion and\nadoption.\n\nCountries in the informal group include Bangladesh, India, Pakistan, Korea,\nSingapore, Algeria, Morocco, Tunisia, Egypt, Barbados, Mexico, Chile,\nColombia, Argentina, Brazil, South Africa, US, Switzerland, Germany and\nAustralia.\n\nAccording to a diplomat, negotiations on this cluster were expected to be\nthe \"most controversial\" which is why this item took a whole day of\ndiscussion. However, the delegate added that despite the controversy and\ndifficulties in negotiating Cluster B, there was no \"animosity\" in the room.\n\nThe group on Thursday discussed proposals on Assessments, Evaluation and\nImpact Studies (Cluster D), and difficulties also arose during negotiations\non this item.\n\nAccording to diplomats, developed countries in Group B were especially\nopposed to a proposal to establish an independent development impact\nassessment capability within WIPO with respect to technical assistance,\ntechnology transfer and norm-setting.\n\nThe proposal added that this could evolve towards an independent WIPO\nEvaluation and Research Office (WERO) that would be responsible for, inter\nalia, evaluation of all WIPO's programs and activities and carrying out of\nDevelopment Impact Assessments in norm-setting activities, and technical\ncooperation.\n\nThe draft proposals agreed to in Cluster B on norm setting, flexibilities,\npublic policy and public domain are:\n\n1. In its activities, including norm-setting, WIPO should take into account\nthe flexibilities in international IP agreements, especially those which are\nof interest to developing countries and LDCs.\n\n2. To urge the IGC to accelerate the process on the protection of genetic\nresources, traditional knowledge and folklore, without prejudice to any\noutcome, including the possible development of an international instrument\nor instruments.\n\n3. To initiate discussions on how, within WIPO's mandate, to further\nfacilitate access to knowledge and technology for developing countries and\nLDCs to foster creativity and innovation and to strengthen such existing\nactivities within WIPO.\n\n4. To promote norm-setting activities related to IP that support a robust\npublic domain in WIPO's Member States, including the possibility of\npreparing guidelines which could assist interested Member States in\nidentifying subject matters that have fallen into the public domain within\ntheir respective jurisdictions.\n\n5. WIPO shall conduct informal, open and balanced consultations, as\nappropriate, prior to any new norm-setting activities, through a\nmember-driven process, promoting the participation of experts from Member\nStates, particularly developing countries and LDCs.\n\n6. WIPO's norm-setting activities should be supportive of the development\ngoals agreed within the UN system, including those contained in the\nMillennium Declaration.\n\nThe WIPO Secretariat, without prejudice to the outcome of Member States'\nconsiderations, should address in its working documents for norm-setting\nactivities, as appropriate and as directed by Member States, issues such as:\n(a) safeguarding national implementation of intellectual property rules; (b)\nlinks between IP and competition; (c) IP-related transfer of technology; (d)\npotential flexibilities, exceptions and limitations for Member States; and\n(e) the possibility of additional special provisions for developing\ncountries and LDCs.\n\n7. To consider how to better promote pro-competitive IP licensing practices,\nparticularly with a view to fostering creativity, innovation and the\ntransfer and dissemination of technology to interested countries, in\nparticular developing countries and LDCs.\n\nA hotly contested issue in the Cluster B discussion was \"access to\nknowledge\". The initial proposals on this were to elaborate a mechanism to\nfacilitate access to knowledge and technology for developing and least\ndeveloped countries and to establish a Treaty on Access to Knowledge and\nTechnology.\n\nThese proposals had already been diluted when it reached the informal group\nthis week. However, the developed countries (Group B) still objected to the\nuse of the phrase \"access to knowledge.\" The US proposed to replace\n\"knowledge\" with \"information\".\n\nJames Love, director of the US-based Knowledge Ecology International,\nreported in a blog-site that Canada said that it didn't understand what\n\"access to knowledge\" meant.\n\nAccording to Love, \"the UK indicated that there was a sentiment by many\ncountries that while WIPO could discuss measures that would make access to\nknowledge hard, such as tough new digital copyright laws, it shouldn't\ndiscuss proposals, like a treaty to provide minimum access to works by\nlibraries, teachers and the blind, which would expand access.\"\n\nHowever, the phrase \"access to knowledge\" received unanimous support from\ndeveloping countries in the room, making it difficult for Group B to\nmaintain its position.\n\nAccording to a diplomat, Group B finally gave way and agreed to that term\n(used in proposal 3 above) especially as developing countries highlighted\nthat they were already very flexible and had significantly moved away from\ntheir earlier position.\n\nAnother contested issue concerned the principles for setting norms. The\nfinal text is much diluted from the original proposal of the Group of\nFriends of Development.\n\nThe original proposal was: \"To include in treaties and norms provisions on,\ninter alia (a) objectives and principles; (b) safeguard of national\nimplementation of IP rules; ( c) against anti-competitive practices and\nabuse of monopoly rights; (d) promotion of transfer of technology; (e)\nlonger compliance periods; (f) flexibilities and \"policy space\" for the\npursuit of public policies; (g) exceptions and limitations.\"\n\nThe initial reaction by Group B was to propose the total deletion of this\ntext. Eventually, a much diluted version of the original was agreed to. The\nnew draft text moves away from the mandatory requirement of \"to include in\ntreaties and norms\" to the directive that the WIPO Secretariat \"should\naddress in its working documents for norm-setting activities, as appropriate\nand as directed by Member States\", \"without prejudice to the outcome of\nMember States considerations\".\n\nSome of the substantive elements have also been diluted, for example, the\nphrase \"policy space for the pursuit of public policies\" has been removed.\n\nWhile Group B has moved on from its initial position of not wanting to\ndiscuss at all the proposals in Annex B of the main document as they\ncomprise many of the proposals of the Group of Friends of Development, it is\nnow engaging in the discussion, but still working in the negotiating room to\nsignificantly dilute the many proposals put forward by developing countries.\n+\n\n------ End of Forwarded Message\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}