{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Sheila.SHETTLE@geneva.msf.org", "subject": "[Ip-health] Letter to G4 heads of trade delegation at Delhi WTO trade talks", "body": "Below is a letter sent by MSF to the heads of trade delegations from India,\nBrazil, the US and EU attending WTO trade talks in New Delhi 11-12 April\n\n+++++++++++++\n\n\nTo the Heads of the Trade Delegations of G4 countries:\n\nMr. Kamal Nath, Hon\\u2019ble Minister of Trade & Commerce, Government of India\nMs. Susan Schwab, United States Trade Representative\nMr. Peter Mandelson, European Union Trade Commissioner\nMr. Celso Amorim, Hon\\u2019ble Foreign Minister, Government of Brazil\n\nNew Delhi, April 10, 2007\n\nRe: WTO trade talks in New Delhi, 11th & 12th of April\n\nDear Excellencies,\n\nWe  are  writing  to you on behalf of Medecins Sans Frontieres (MSF) on the\neve of the G4 trade talks in New Delhi.\n\nWe   understand  that  this  round  of  trade  discussions  will  focus  on\nagriculture  and  that  the  trade  delegations  from  the United States of\nAmerica,  Brazil, the European Union and India are firmly committed to find\nsolutions to reinvigorate the Doha Round.\n\nWe would like to draw your attention to another crucial aspect of the trade\nnegotiations,  notably  the  2001  Doha  Declaration\\u2019s commitment to public\nhealth, and urge you to sustain your support for the measures undertaken by\nthe governments of India and Thailand to safeguard public health interests.\n\nPublic  health  interests  in  these  countries have been threatened by the\nactions of Novartis, Abbott Laboratories and other actors.\n\nThe  2001  WTO Doha Declaration on TRIPS and Public Health was a vital step\nin  increasing  access to medicines. It provided unambiguous support to any\ngovernment  that  needs to protect the health of their people and therefore\nuse TRIPS flexibilities to overcome the barriers posed by patents.\n\nThe  AIDS  epidemic  has  most  starkly highlighted the need to ensure that\nessential medicines are available at affordable prices. Today a majority of\npeople  in  the  developing  world who receive antiretroviral drugs rely on\ngeneric production in India.\n\nThe  fixed-dose  drug combinations, produced in India, greatly simplify the\nadministration  of antiretroviral therapy and have been critical to scaling\nup HIV/AIDS treatment in resource-poor settings.\n\nIndia  in  March 2005 introduced a product patent regime in full compliance\nwith  the  TRIPS agreement. The impact of patent protection in India on HIV\nprogrammes  is  increasingly apparent now as large numbers of people living\nwith  HIV/AIDS  on treatment in developing countries will need to switch to\nnewer, second line medicines.\n\nThese  newer  drugs  are  at  least 4-10 times as expensive as the existing\ntreatments,  as  almost all are patented or are likely to be patented. This\nis  notwithstanding the fact that countries like India, Brazil and Thailand\nhave the capacity to produce generic version of these drugs.\n\nMSF  would like to express its concerns that the interpretation of TRIPS in\nkeeping  with  the  2001  Doha  Declaration\\u2019s  commitment  to public health\nconcerns  is  now  being  unjustly  challenged  in  India  and  Thailand as\ndemonstrated  by  the  actions  of  companies  such  as Novartis and Abbott\nLaboratories.\n\nMSF feels that measures being undertaken by India and Thailand to implement\nTRIPS flexibilities to protect public health should receive crucial support\nfrom  the  G4  countries as a reaffirmation of their commitment to the Doha\nDeclaration on TRIPS and Public Health.\n\nToday  MSF  is  treating 80,000 people living with HIV/AIDS in 30 different\ncountries.   Obviously,  medical  needs  of  MSF\\u2019s  patients  are  only  an\nindication of the problems governments throughout the developing world will\nface.\n\nWithout  the  implementation of public health safeguards agreed upon in the\n2001  Doha  Declaration,  treatment  costs may increase dramatically in the\nnext  few  years as significant number of patients will require second-line\nmedicines.  It  should  also  be  noted  that  the impact of patents is not\nlimited  to  antiretroviral drugs, but will increasingly be felt across all\ndiseases with all medicines brought to market from now on.\n\nIn view of the above, we request the G4 countries to increase their efforts\nto  support  access  to medicines and specifically request you to raise the\npublic  health  concerns  at the discussions in New Delhi and reaffirm your\ncommitment to the 2001 Doha Declaration.\n\nA  statement  on your behalf,  that will support India and Thailand\\u2019s right\nto  implement public health safeguards in TRIPS to address essential health\nneeds  by  increasing  access  to affordable medicines, will be welcomed by\nmillions of patients in the developing world.\n\nWe  would  be  very  happy to meet with you to discuss the issues mentioned\nabove in more detail.\n\nSincerely yours,\n\n\n\n\n                                     |\n Johannes van de Weerd               |Dr. Tido von Schoen-Angerer\n Head of Mission                     |Director, Campaign for Access to\n Medecins Sans Frontieres Holland (in|Essential Medicines\n India)                              |Médecins Sans Frontières\n C 106 Defence Colony                |Rue Lausanne 78 CP 116 CH-1211\n New Delhi 110 024, India            |Geneva 21\n Tel: 91 11 24332419, 91 9810114884  |Tel: +41 79 701 9989\n msfh-india-hom@field.amsterdam.msf.o|Tido.von.SCHOENANGERER@geneva.msf.or\n rg                                  |g\n                                     |\n\n\n\n\nThailand issues compulsory licenses for essential drugs\nIn the case where governments are directly involved in providing treatment\nto their citizens, issuing a compulsory license for generic importation or\nlocal production is often the only solution to solve procurement problems\nand access drugs of public health importance at an affordable price. The\nThai government was confronted with similar problems and had to make the\ndecision on issuing compulsory licenses to solve the problem of accessing\naffordable drugs for the health schemes under which their citizens,\nincluding people living with HIV/AIDS access treatment. The licenses issued\nby the Thai government authorize the procurement of affordable generic\ndrugs for government use overriding the patent rights of pharmaceutical\ncompanies. The use of compulsory licenses to improve access to essential\nmedicines is consistent with the 2001 Doha Declaration. Notwithstanding\nThailand\\u2019s legal rights, Abbott Laboratories the Chicago-based\nmultinational pharmaceutical company has cited Thailand\\u2019s use of compulsory\nlicenses as a reason for not marketing its new medicines in Thailand.\n\nIndia includes public health safeguards in its patent law\nRules of the World Trade Organization\\u2019s Agreement on Trade-related Aspects\nof Intellectual Property Rights (TRIPS) obliged India to begin reviewing\npharmaceutical patents in 2005. The TRIPS agreement, however, includes\npro-public health safeguards that countries can implement, and India has\nincluded some of these in its patent law. India\\u2019s patent law restricts\npatenting of medicines to innovations only. A crucial part of the Indian\nlaw protects patients from the patenting of trivial improvements of known\nmolecules. The Doha Declaration on TRIPS and Public Health, signed by\ngovernments in 2001, reinforced the right of countries like India to use\nsuch safeguards. Novartis, a Swiss pharmaceutical company has legally\nchallenged the specific provision in India\\u2019s patent law that restricts\npatenting of medicines to innovations only. If these provisions were\noverturned, patents would be granted far more widely in India, heavily\nrestricting the production of affordable medicines that has become crucial\nto the treatment of diseases across the developing world.\n\n\n\n+++++++++++++++++++++\nSheila Shettle\nSenior Communications Officer\nMédecins Sans Frontières\nCampaign for Access to Essential Medicines\nRue de Lausanne 78\n1211 Geneva, Switzerland\n+ 41.22.849.8403\n+ 41.79.293.0270 (m.)\nwww.accessmed-msf.org\n+++++++++++++++++++++++\nSIGN MSF'S 'DROP THE CASE' PETITION\n\nMillions of people around the world today rely on affordable medicines\nproduced in India.  Pharmaceutical company Novartis is taking the Indian\ngovernment to court to force a change in the country's patent law.  If\nNovartis wins, a major source of affordable medicines for millions of\npeople across the globe could dry up.\n\nMSF is urging Novartis to DROP THE CASE.\n\nFind out more and sign up to our petition:\nhttp://www.msf.org/petition_india/international.html\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}