{"category": "spam", "to_address": "<elaastic@speedy.uwaterloo.ca>", "from_address": "\"Hoffman P. Peggy\" <ttgn@skynet.be>", "subject": "Competition with other regions is one of the few things likely to slow the sad decline of Western medical research and development of commercial therapies into an over-regulated, motionless morass.", "body": "\n\n\n\n\n\n\n\nIt needs to connect electrically so that it syncs \nup with signals coming from the cells, so everything works together. You have a \nchance today to make a difference in that rate of progress, to make the future of \nhealthy life extension medicine arrive that much faster; wouldn't it be a good idea \nto take that chance? Humans with genetic loss of PAK3 have severe mental \nretardation. A molecule that would sit in that groove - even though it's far away \nfrom the active site - looks like it would completely abolish the ability of \ntelomerase to work. phpNow that funding is coming into calorie restriction studies, \nmore detailed examinations of the health and longevity benefits have been \nforthcoming.\n500The New Scientist takes a look at mitochondria \nand their role in degenerative aging: \"Pinning down the molecular changes that \nunderlie the ageing process is not easy. efforts in Missouri and Kansas that would \ndo nothing more that write explicit language into state  constitutions allowing \nprivate companies to conduct stem cell research. In 30-year-olds, that number rose \nas high as 20 percent.\nThe findings hold promise for the future of cell \nreplacement therapy for the debilitating and incurable disease \nAlso known as somatic cell nuclear transfer, \ntherapeutic cloning is a promising approach to create individually customized \ncellular therapies for treating certain disorders. Remember - if you like this \nnewsletter, the chances are that your friends will find it useful too. There's \ncertainly something to be said for the era in which governments didn't tax to the \nhilt and so more wealth could go to philanthropy rather than waste. 200A most \ninteresting New Scientist article looks at hints of an existing mechanism by which \nage-damaged mitochondria could be repaired.\nOn to the second question: what will be the \nprinciple age-related causes of death 30 years from now? \" A number of groups are \nmaking progress in the development of biotechnologies capable of either repairing, \nmoving or replacing damaged mitochondrial DNA. But it's possible in animals, and now \nwe have drug candidates that may do the same thing in humans.\nEpigenetic abnormalities have been found to be \ncausative factors in cancer, genetic disorders and pediatric syndromes as well as \ncontributing factors in autoimmune diseases and aging. Right now, we have strict \nlimitations on what we can do from the FDA, because this is the first such study in \nthe United States.\nIt is an extraordinary and controversial \nclaim.\nThere's much more to be mined in the source \nmaterial, however.\nPsychologically it's terribly difficult for people \nto take on board that this is something worth fighting for . If you've wanted to \nlend a hand to supporting the future of healthy life extension medicine, science and \nresearch, then now is a great time to volunteer with the Methuselah Foundation. \nphpPick a major cause of age-related death today - I think you'll find that in each \ncase there's a large, well-funded research community that is plausibly within 10-20 \nyears of a cure. This makes it nearly impossible for researchers to multiply them in \nthe laboratory.\n\" A number of organs are very complex at these \nscales - this is a promising piece of groundwork.\n"}