{"category": "ham", "to_address": "Ip-health@lists.essential.org", "from_address": "Sarah Rimmington <srimmington@essentialinformation.org>", "subject": "[Ip-health] Pharmalot: Did the USTR retaliate against Thailand?", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nDid the USTR retaliate against Thailand?\nPharmalot\nJune 21, 2007\nby Ed Silverman\n\nhttp://www.pharmalot.com/2007/06/congress-says-ustr-retailiated-against-thailand/\n\n\nIn a rather pointed letter\n,\nHenry Waxman and 34 other members of Congress tell US Trade Rep Sue\nSchwab that her office has \"penalized\" Thailand by placing the Asian\nnation on its Priority Watch list\n.\n\nThis is a dubious distinction reserved for countries that don't \"provide\nan adequate level of intellectual property rights protection or\nenforcement.\" The move came after Thailand issued compulsory licenses\nfor three drugs, including Abbott Lab's Kaletra, to which the drugmaker\nresponded by refusing to sell a new heat-sensitive version to the country.\n\n\"It is difficult to interpret this decision as anything other than\nretaliation for Thailand's recent actions. It sends a troubling message\nnot only to Thailand, but the whole world, that the exercise of\nrecognized public health flexibilities in trade obligations is frowned\nupon by the United States...The move is being viewed as a warning and\nthreat to other countries that might consider similar action,\" they write.\n\nThey conclude, of course, by asking Schwab to remove Thailand from the\nPriority Watch list. Whether Schwab heeds their call remains to be seen,\nbut this is the largest such group of Congressional reps to go on record\nin support of Thailand since the controversy broke out several months\nago. And their letter, which cites Schwab's willingness to act on\ncomplaints from Abbott and others, suggests the row could get still more\ninteresting.\n\n\n--\nSarah Rimmington\nProject Attorney\nEssential Action, Access to Medicines Project\nWashington, DC\nOffice: (202) 387-8030 x34\nMobile: (202) 422-2687\nwww.essentialaction.org/access\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}