{"category": "spam", "to_address": "<elaastic@speedy.uwaterloo.ca>", "from_address": "\"Payton P. Roderick\" <plu@roubique.com>", "subject": "unlikely", "body": "\n\n\n\n\n\n\n\n7:55am Howard's Secret Gift To Richard. King told \nRobin that she was going to wake up and speak fluent Chinese.\nHe got back to 'Gina Girl and said he was going to \nplay her song so she could strip down and do her 'Gina Dance. 6:10am More Christmas \nParty Discussions.\nHe said that they had the gay men's choir there and \nthey were practicing in the women's bathroom.\nHoward said they told him he couldn't come in but \nhe showed up anyway.\nJackie said that he was in on Robin's gift as well. \nHoward asked where everyone was.\n6:10am More Christmas Party Discussions. 7:15am \nRich Willing To Do Anything To Sit In On The Show. Howard said he got all of the \nguys the same gift but he doesn't know about it now that Fred got him that chess \nset. 10:05am Staff Stunts For A 50 Inch TV. Merry Friggin Christmas everybody! \n7:55am The Baba Booey Roast Continues.\nShe wasn't going to take her clothes off though so \nHoward told Gary to get her away from the microphone.\nThere were still a bunch of women who hadn't come \nin yet.\nHe told Robin that eating insects isn't much \ndifferent than eating plants.\n6:40am Howard asked Robin if she wanted to open \npresents or get into the news. Howard said he couldn't get over robin's reaction and \nasked her to give back her gifts. 8:20am Wendy The Retard Calls In. Today's replay \nwas from December 16, 1988.\nRobin said she got some candle holders from Gary \nand Jackie and they were very nice.\nHe also spoke to the Gay Choir who were going to be \nperforming for them. Howard said he wanted to get home to see this Neil Diamond \nconcert that was going to be on. He read through the letter that his building hands \nout so everyone knows who to tip. He thought they were kind of nice but Gary said he \nalready had one. The Gay Choir came in and Howard pointed them in the other \ndirection so they wouldn't be where he wanted the girls. 8:35am Howard's Self \nHealing Thanks To Dr. More Christmas Party Discussions.\nHoward started off the show talking about the big \nChristmas party they had coming up today.\nHoward said that was embarrassing. 8:05am Howard \nwent to Dr. He said he's doing the Woody Allen thing and next week he'll have an \nAsian chick. They sang a medley of gay Christmas song parodies. Fred the Elephant \nBoy was there so Howard said hi to him.\nHe thinks that the woman will eventually show up \nthough. Howard asked where everyone was. Fred let them know that he got a Daffy Duck \nNeon Clock from Robin.\n"}