{"category": "spam", "to_address": "<theorize@plg.uwaterloo.ca>", "from_address": "\"Davis Sibylla\" <bbc@cytanet.com.cy>", "subject": "He played some audio from her YouTube video where she talks about coming off the hunger strike and tells people that it could end badly for them if others continued.", "body": "GPSI Announces Market Attack Into $1 Trillion Market!\n\nGlobal Payment Solutions\nSymbol: GPSI\nPrice: $0.03\n\nGPSI announced its plans to address the huge influx of immigrant workers\ninto the US that need banking solutions that they otherwise would not\nqualify for. This market is expected to represent over $1 Trillion\ndollars to be managed by 2008. GPSI provides viable solutions to this\nmarket. This is hot, read the news and watch for more Monday! Get on\nGPSI first thing Monday!\n\nEric played the clip from the phone call and Howard told him they didn't\nhave much to talk to him about now that he's no longer against them.\nHe told Artie that KC looked like a winner while Artie looks like a\nloser whether he's winning or losing. She wondered if they hate her or\nsomething. Artie was wearing his sun glasses this morning so Howard\ngoofed on him about that and asked him if he did any heroin over\nvacation.\nHoward told her she's welcome anytime.\nArtie said he met her at a gig a few years ago and gave her a call to go\nout on this date.\nEric The Midget In Wrestling Trivia. Howard said that last week the fans\nvoted for Sanjaya and kept him in for another week.\nHe said KC had a lot of problems and didn't know just how messed up he\nwas.\nHoward and the guys were talking about how big this Sanjaya kid has\nbecome and how he's got to be the biggest star ever on there.\nHoward told Gary to get this lawyer chick on the phone as well as the\ntwo people who were fasting so he can talk to them. Howard was also\nsaying that he got a call from Melissa Gilbert who asked him what he was\ndoing about this Sanjaya thing because she hates him.\nArtie said that Bill should have just ended the segment at that point\nwhen he heard her stupid comments.\nGary said that Charlie, Miss Black Howard Stern, was joking in her tape\nand said that she wouldn't have a black baby if she got pregnant and had\na kid like Andrea did.\nRobin thought that was amazing but Howard said that wasn't the end of\nthe story.\nEric The Midget In Wrestling Trivia.\nShe didn't cry or anything. Artie said that this new chick is also from\nPhilly and he'd love to get her on the show because she's got this\nPhilly accent that's great. Robin reminded the guys that KC had gone out\nand gotten an apartment when he won the money. He said that it was very\namicable and they're not really seeing each other now. He blew it all\nwithin a week. He decided to put ten grand on the game and won so now\nhe's put his bookie out of business which is something he's never done\nbefore. He said Ralph came up with the whole show idea and was doing an\nEric the Midget impression.\nEric shot back with ''That's something you hear a lot fatso. Gary gave\nHoward a letter that Jon Hein's daughter sent to him asking him to stop\nwith the Sanjaya thing. '' Howard said that Bill O'Reilly found some\nlawyer who claims that what he's doing to American Idol is illegal.\nEric The Midget In Wrestling Trivia. Howard and the guys watched her\nvideo from when she was evaluated back in June of last year. Artie said\nhe had a good time but the relationship with the chick from Philly has\nkind of had it's last hurrah. Artie said once he won that money he\nstopped thinking about dieting.\nHoward told the story of KC's gambling and how he had hit a royal flush\non goldenpalace.\nHe said he really didn't want to be committed to anyone at this point\nand she kind of got it. Artie said that Bill should have just ended the\nsegment at that point when he heard her stupid comments.\nRobin said that Akira is still serious about Artie and wondered if he\ngot her. Eric was talking about how he'd still like to go on a date with\nDiana Degarmo.\nArtie said that this new chick is also from Philly and he'd love to get\nher on the show because she's got this Philly accent that's great. '' \nArtie's Dating Discussed.\nArtie said that Bill should have just ended the segment at that point\nwhen he heard her stupid comments.\nMiss Howard Stern Depressed.\nEric played the clip from the phone call and Howard told him they didn't\nhave much to talk to him about now that he's no longer against them.\nHoward said that was the worst story he ever heard.\nHe went to the doctor and he's been taking vitamins.\n\n"}