{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "(Ted Harding) <ted.harding@nessie.mcc.ac.uk>", "subject": "Re: [R] power 2x3 exact test", "body": "On 09-May-07 22:00:27, Duncan Murdoch wrote:\n> On 09/05/2007 5:11 PM, Bingshan Li wrote:\n>  > Hi, all,\n>  >\n>  > I am wondering if there is an algorithm for calculating power of 2x3\n>  > table using Fisher exact test. There is one (algorithm 280) for 2x2\n>  > Fisher exact test but I couldn't find one for 2x3 table. If we are\n>  > not lucky enough to have one, is there any other way to calculate\n>  > exact power of 2x3 table? The reason why I want exact power is\n>  > because some cells are assumed to be very small and chi square\n>  > approximation is not valid.\n> \n> I think there are lots of possible alternatives to the null in a 2x3 \n> table, so you may have trouble finding a single answer to this\n> question. \n>   But assuming you have one in mind, I'd suggest doing a Monte Carlo \n> power calculation:  simulate a few thousand tables from the alternative\n> distribution, and see what the distribution of p-values looks like.\n> \n> Duncan Murdoch\n\nI'd back Duncan on that point!\n\nMore specifically, for the 2x2 table, the table, conditional on the\nmarginals, is a function of one element (say top left-hand corner),\nand the probability of any table depends on the single parameter\nwhich is the odds-ratio of the 4 cell probabilities.\n\nso this case is relatively easy and straightforward and, indeed,\nfor the 2x2 table R'a fisher.test() allows you to specify the\nodds-ratio as a \"null\" parameter.\n\nThis is not the case with fisher.test() for a larger (say 2x3\ntable), so to investigate that case you cannot use fisher.test().\n\nIn all cases, however (according to the FORTRAN code on which\nitis based -- see the reference in \"?fisher.table\"), the rejection\nregion for the exact fisher.test() consists of those table with\nthe smallest probabilities.\n\nFor the 2x3 table, say (cell counts with margins, and probabilities):\n\n\n   a1  b1  c1 | d1          p1  q1  r1\n              |\n   a2  b2  c2 | d2          p2  q2  r2\n   ---------------\n   a   b   c  |  n\n\nso that\n\n   a1+b1+c1 = d1, a2+b2+c2 = d2,\n   a1+a2 = a, b1+b2 = b, c1+c2 = c\n\nthe table is a function of any two functionally independent cells\n(say a1 and b1), and its probability is a function of some two\nodds-ratios, say\n\n   (p1*r2)/(r1*p2)\n\n   (q1*r2)/(r1*q2)\n\nwhich, for the standard null hypothesis, are both equal to 1.\nHowever, as Duncan says, alternatives are 2-dimensional and\nso there is not a unique natural form for an alternative (as\nopposed  to the 2x2 case, where it boils down to (p1*q2)/(p2*q1)\nbeing not equal to 1, therefore greater than 1, or less than 1,\nor 2-sidedly either >1 or <1).\n\nThe probability of the 2x3 table is proportional to\n\n  ((p1*r2)/(r1*p2))^a1 * ((q1*r2)/(r1*q2))^b1\n\n(or equivalent), divided by the product of the factorials of\na1, b1, c1, a2, b2, c2, subject to summing to 1 over all\ncombinations of (a1,b1) giving rise to a table compatible\nwith the marginal constraints.\n\nGiven that you expect some cells to be small, it should not\nbe a severe task to draw up a list of (a1,b1) values which\ncorrespond to rejection of the null hypothesis (that both\nORs equal 1), and then the simulation using different values\nof the two odds-ratios will give you the power for each such\npair of odds-ratios.\n\nThe main technical difficulty will be simulation of random\ntables, conditional on the marginals, with the probabilities\nas given above.\n\nI don't know of a good suggestion for this. The fisher.test()\nfunction will not help (see above). In the case of the 2x2\ntable, is is a straightforward hypergeometric distribution,\nbut 2x3 is not straightforward. Maybe someone has written\na function for this kind of application, and can point it\nout to us???\n\nA quick R-site search did not help!\n\nBest wishes,\nted.\n\n\n--------------------------------------------------------------------\nE-Mail: (Ted Harding) \nFax-to-email: +44 (0)870 094 0861\nDate: 10-May-07                                       Time: 00:12:29\n------------------------------ XFMail ------------------------------\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}