{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Can We See Some I.D.?", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat \n      Exactly Did McCain Say?On Friday, \"60 Minutes\" put out a \n      press release suggesting that McCain would reveal in his interview with \n      Scott Pelley that he \"REGRETS HIS REMARKS ON SECURITY IN BAGHDAD, SAYING \n      HE MISSPOKE.\" But does the \n      interview itself really bear \n      out that interpretation? [+ Read More]\n\n\n\nShould \n      Underage Suspects Be Identified?\nOne of \n      the top stories on CBSNews.com today concerns a teenager \"accused of \n      running an escort service out of her suburban Chicago home using the \n      popular Web site Craigslist.\" The teenager in question is 17 years \n      old, and she is identified by name in the story. A \n      number of other media outlets have also identified the teen by name, and a \n      local CBS station in Chicago ran a picture of \n      her. [+ Read More]\n\n\n\nPizzey On \n      Reporters Criticizing PolsSo, Allen Pizzey, is it the role of \n      a journalist to say that a senator and presidential candidate is full of \n      it? \"Yes, I think that a lot of politicians have, let's say, a nodding \n      acquaintance with reality, and some of them have barely nodding \n      acquaintance with the truth. So if we can provide a more formal \n      introduction, I think that's part of our job.\"[+ Read More]\n\n\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nKatie \n      Couric's Interview With John and Elizabeth Edwards\nWhy \n      Aren't We Hearing More About Brownback and Huckabee?A \n      Minor Mitt \n  Misstep\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}