{"category": "spam", "to_address": null, "from_address": "ddeitric@tampabay.rr.com", "subject": "Hello", "body": "\n\nMrs. Mary Obaseki,\nFlat 8 Block 12 NNPC Quarters,\nVictoria Island,\nLagos, Nigeria.\n\nMy Dear Friend,\n\nI presume this letter will come to you as a surprise, but as things \nunfold, we will know each other better. I will start by introducing \nmyself to you; I am Mrs. Mary Obaseki, the wife of Late Chief Jackson \nGaius Obaseki, the Formal Group Managing Director and Chief Executive \nof Nigeria National Petroleum Corporation (NNPC).\n\nI am very sure that you will be of a good assistance after carefully \nreading my letter. For many years of marriage now between me and my \nlate husband, I have not given birth, and this had really troubled my \nhusband before his death.\n\nThis is as a result of so much respect attached to local Tradition \nCulture and Custom in there community, so my in-laws has decided \nmaltreat me. In short to be sincere and honest with you, with the \npresent situation of things now, my home look broken. I am being \nthreaten daily by my supposed in laws to get me out from the home. \nThis situation has really affected me psychologically, most of the \ntime I am in the church to pray and rest myself, because there is no \nroom for rest in my own home again.\n\nAs I am writing to you now, I am no longer assured of a home, hence I \nseek your urgent assistance and help me out, which I Know will go a \nlong way in getting me settled down finally. I want to use this \nopportunity, since my late husband family has abandoned me because of \nchildlessness, to move a huge sum of $6 million US Dollars into your \ncustody for safe keeping, pending my arrival in your country. Be \ninformed that this said amount was given to my husband before is death \nas gratification from some foreign oil companies he helped in securing \nAllocation for the Drilling of Crude Oil in Nigeria.\n\nAs a widow, i do not want to be exposed this to my in laws, so he gave \nme this money to deposit in a security company, this was when the \ngoing was okay between us, so that he can exonerate himself from the \neyes of Government security operatives and the Civil Service \nCommission (CSC) which is the body that scrutinizes the activities of \nall civil servants in Nigeria as checks and balances for official \nmisconduct.\n\nTo be sincere and honest with you, this money is never connected with \ndrugs, money laundry, firearms and looting, which I believe might put \nfears in you and consequently withdrawing your help for security \nreasons. Hence the source of this said money is clean and clear. This \nmoney has been deposited as family treasures in a security company all \ni needed from you is that, you will stand and claim this fund from the \nsecurity company.\n\nBe rest assured that this transaction is 100% risk free. As soon as I \nreceive your response and your willingness to help as regards to this, \nI will furnish you on the next line of action to take immediately.\n\nI will start coming to meet you in your country. I promise to \ncompensate you very well at the successful end, this is the guarantee \nI am giving you from my heart of heart that this transaction will not \nbe more than 14 working days and it will be concluded because every \nnecessary/vital arrangements has been put in place, take note. Your \nnegative or positive response will be highly appreciated by me Thanks \nand God bless you and your family.\n\nYours Sincerely,\nMrs. Mary Obaseki \n\n"}