{"category": "ham", "to_address": "perl6-language@perl.org", "from_address": "cdumont <cdumont@comquest.co.jp>", "subject": "Re: Perl6 new features", "body": "Thank you for your kind reply !\n\nPerl 6 is not yet finished, so the the list of core modules is not yet\nspecified.\n\n\nI know that it is somehow not the subject,\nbut I think the actual 5.8 doc should be changed to some extents.\nIt could be nice if we could browse each core functions,\nhaving the function parameters, flags (not that much used right?), and\nthe return value of the function, followed by exampleS\nAND so that it could be a lot richer, allow people to \"comment\"...\nI know this is not the point but it could be nice to do so for perl6 !\n(I was thinking to create a kind of site like that for the actual perl,\nbut my programming competences are,well... )\n\nPerl 6 does. See for example ext/Set/ in the pugs repository.\n\n\nGlad to hear that !\n\n\nYou could help by contributing some suggestions to what the new \"Web\"\nmodule should be able to do, and how so. Web is hopefully \"CGI done\nright\", and still in its early planning stage.\n\n\nWeb module is a good name.\n\nIs there a place where we can add suggestions ? apart from the first one in...\n2003 ? 4 years ago ?\n\n\nMoritz Lenz wrote:\n\n>cdumont wrote:\n>  \n>\n>>I know that perl doesn't only focus on web apps and my question might \n>>seem irrelevant\n>>but I've been searching the web in order to find the new features of \n>>perl6 regarding\n>>new functions, core module lists (not perl grammar itself) but couldn't \n>>find any thing...\n>>    \n>>\n>\n>Perl 6 is not yet finished, so the the list of core modules is not yet\n>specified.\n>\n>  \n>\n>>I would like to develop web apps with perl too but having to download \n>>modules from CPAN\n>>every time makes me feel these apps will never be able to evoluate in \n>>different environments.\n>>(environments you don't have control of)\n>>    \n>>\n>\n>That's a general problem with libraries, not only Perl ones. And you\n>can't solve this by putting everything into core - it just blows up the\n>distribution.\n>\n>  \n>\n>>I am a bit amazing to see that perl doesn't include a bunch a set theory \n>>functions too.\n>>    \n>>\n>\n>Perl 6 does. See for example ext/Set/ in the pugs repository.\n>And so does Perl 5:\n>http://search.cpan.org/~samv/Set-Object-1.21/lib/Set/Object.pm\n>\n>\n>  \n>\n>>I am not blaming perl but only hopes that perl6 will allow to make \n>>things easy for the programmer.\n>>    \n>>\n>\n>That's one of the most important design goals ;-)\n>\n>  \n>\n>>as for the web, maintaining state thru server side cookies and DBI are \n>>the very minimum I would recommend.\n>>more hash and array functions a minimum too.\n>>if there are such things in perl6, I'll be very happy to work with this \n>>language !\n>>    \n>>\n>\n>You could help by contributing some suggestions to what the new \"Web\"\n>module should be able to do, and how so. Web is hopefully \"CGI done\n>right\", and still in its early planning stage.\n>\n>Cheers,\n>Moritz\n>\n>  \n>\n\n\n-- \n\\u30b7\\u30ea\\u30eb\\u30fb\\u30c7\\u30e5\\u30e2\\u30f3\\uff08Cyrille Dumont\\uff09\ncdumont@comquest.co.jp\nour work is the portrait of ourselves\ntel: 03-5690-0230 fax: 03-5690-7366\nhttp://www.comquest.co.j\n\n\n"}