{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 89", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. American Bar Association International Cultural Property\n      Committee Examines Collecting Chinese Art and Antiquities:\tHot\n      Trade Heats Up (Museum Security Network Mailing list)\n   2. Nathan Hale statue recovered in Chaplin\n      (Museum Security Network Mailing list)\n   3. SA's treasures worth millions going missing\n      (Museum Security Network Mailing list)\n   4. Gone in 50 seconds (Museum Security Network Mailing list)\n   5. Polic?a retira cargos contra sospechoso adquirir arte\n      precolombino robado (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Fri, 13 Apr 2007 22:28:36 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] American Bar Association International Cultural\n\tProperty\tCommittee Examines Collecting Chinese Art and Antiquities:\n\tHot Trade Heats Up\nTo: \nMessage-ID: <01d001c77e0a$502a4a30$f07ede90$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nVan: emily dippo [mailto:emodippo@hotmail.com] \nVerzonden: vrijdag 13 april 2007 20:08\nOnderwerp: Collecting Chinese Art and Antiquities: Hot Trade Heats Up\n\n\nPRESS RELEASE\nAmerican Bar Association International Cultural Property Committee Examines\nCollecting Chinese Art and Antiquities: Hot Trade Heats Up\nFor Immediate Release\nA panel discussion sponsored by the International Cultural Property\nCommittee of the Section of International Law & Practice of the American Bar\nAssociation and co-sponsored by the Lawyers? Committee for Cultural Heritage\nPreservation. The program will be held Friday, May 4, 4:30-6:00 pm, at the\nFairmont Hotel, Washington, DC. \n?\nCOLLECTING CHINESE ART AND ANTIQUITIES: HOT TRADE HEATS UP\nCollecting Chinese antiquities is back in fashion today. This program seeks\nto investigate some of the legal and ethical dilemmas of contemporary\ncollecting in this field. China is one of the largest source countries for\nantiquities in the world and has requested a bilateral agreement with the\nUnited States to help curb some of the illicit trafficking of cultural\nproperty currently taking place. Although CPAC (the Cultural Property\nAdvisory Committee) in Washington has met to discuss this request for a new\nbilateral agreement with China in conjunction with a public session, a\ndecision on whether there should be an agreement is still pending. The\nissues to be examined in this program include looting of archeological\nsites; unprovenanced cultural property; and the problem of fakes, forgeries\nand authenticity -- discussed from various points of view and ideologies.\n\n\nSpeakers:\n\nMr. Reid Dunavant, ?? ??????????? Doyle New York, Washington, DC? \n\nMr. Jerome L. Hanifin,??????????? Serko Simon Gluck & Kane LLP, New York, NY\n?\nDr. Anne Underhill, ??????????????? Field Museum of Natural History,\nChicago. IL\n\nProf. Patty Gerstenblith, ??????? DePaul University College of Law, Chicago,\nIL\n\nProgram Moderator: ????????????? Bonnie Czegledi, International Art &\nCultural Heritage Law, Barrister & Solicitor, and Director of the Institute\nof Art and Cultural Heritage, Toronto, Canada \n\nFor information: Bonnie Czegledi 416-929-8209; czegledi@artlaw.com\n\nMore information on the program:\nhttp://www.abanet.org/intlaw/spring07/home.html; \nMore information on the Lawyer?s Committee for Cultural Heritage\nPreservation (LCCHP): http://www.culturalheritagelaw.org.\nBonnie Czegledi\nbarrister & solicitor\ninternational art & cultural heritage law\n35 Prince Arthur Avenue\nTOR ON Canada M5R 1B2\ndirect 416.929.8209\nfax???? 416.929.8751 \nwww.czeglediartlaw.ca\nczegledi@artlaw.ca\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Sat, 14 Apr 2007 10:23:03 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Nathan Hale statue recovered in Chaplin\nTo: Museum Security Network Mailinglist \nMessage-ID: <46208F67.5010600@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n Nathan Hale statue recovered in Chaplin\nBy: Lee Sawyer , Journal Inquirer\n\nCOVENTRY - Nathan Hale's statue is in police custody today, recovered \nfrom the town of Chaplin with the help of an anonymous tipster.\n\nHe is in good condition, except for being broken at his base, police said.\nThe bronze likeness of the national hero was taken sometime before April \n5 from the Nathan Hale Homestead. The homestead was closed for the \nseason, and police aren't exactly sure when the statue was taken.\nPolice Chief Mark A. Palmer said the department received a tip Thursday \nthat the statue was in Chaplin near a fishing area next to the Natchaug \nRiver.\nPolice located the statue there, and are arranging to return it to the \nHomestead, which is operated by the Antiquarian and Landmarks Society of \nHartford.\nNo one has been arrested, and police still are looking for the culprit, \nthey said.\nRochelle Simon, a society spokeswoman, said that no one had tried to \nclaim the $1,000 reward that had been offered by an anonymous benefactor \nfor the statue's return.\nShe said the group is grateful to the police for their work, and thanked \nnews organizations for publicizing the theft, perhaps resulting in the tip.\nAs for the statue, \"It's in good shape, except that it's missing its \nfeet. We're obviously going to have a restoration process,\" she said.\nNathan Hale was born June 6, 1755, and was a captain in the Army during \nthe American Revolution.\nConsidered America's first spy, Hale went on an intelligence-gathering \nmission before being caught by the British and hanged.\nHe is widely remembered as saying, \"I only regret that I have but one \nlife to lose for my country.\"\nRenowned New England sculptor Bela Lyon Pratt created the 3-foot, \napproximately 100-pound statue.\nPratt, born Dec. 11, 1867 in Norwich, studied at the Yale School of Fine \nArts and became an instructor at the Boston Museum School of Fine Arts.\nPresident Theodore Roosevelt commissioned him to redesign two gold \ncoins, the Indian-head half-dollar and the eagle quarter.\nPratt also has pieces in the Library of Congress, Museum of Fine Arts in \nBoston, Harvard University, and the state Capitol.\nThe homestead will open for the season May 12.\n\nhttp://www.journalinquirer.com/\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Sat, 14 Apr 2007 10:24:02 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] SA's treasures worth millions going missing\nTo: Museum Security Network Mailinglist \nMessage-ID: <46208FA2.7090206@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nSA's treasures worth millions going missing\n\nBy Anel Powell\n\nMillions and millions of rands worth of heritage resources have been \nstolen from state institutions.\n\nThis was stated on Thursday by Phakamani Buthelezi, chief executive of \nthe SA Heritage Resources Agency (Sahra).\n\nThis is why a R28,5-million national audit of heritage resources under \nstate custodianship was started in 2004. Although still in the early \nstages, the initial count of heritage assets has revealed there is much \nthat cannot be accounted for.\n\n'Massive black market in stolen goods'\nButhelezi said without a reliable database of heritage items, it was \ndifficult to say how many items had been lost or stolen, or what the \nvalue of these items was. But he said it would amount to many millions \nof rands.\n\nHe said many items had been \"inappropriately\" removed from the country.\n\nRoger Layton, of service provider Ciber, said the thefts of valuable \nresources meant there was a \"massive black market in stolen goods\".\n\nAfter the high-profile thefts of state resources, including the \nMendelssohn diamond ring from parliament and a R3-million gold tea set \nfrom Tuynhuys, the national government approved the development of a \nnational heritage database in 2004.\n\nThe five pilot sites of the audit were Tuynhuys, Groote Schuur and \nparliament in Cape Town, and the Union Buildings and Bryntirion Estate \nin Pretoria. More than 5 600 assets were audited at the first five sites.\n\nUnlike traditional audits that count furniture and other movable items, \nthe heritage audit included only rare, significant or valuable items.\n\nOne of the collections was valued at between R100-million and \nR500-million, while several others were worth more than R10-million each.\n\nDavid Hart, manager of the national audit unit, said these sites were \nchosen for the first phase because they were not managed by a museum.\n\n\"We were therefore concerned that these items would be more vulnerable.\"\n\nHe added: \"To know what is lost, we first have to know what we have.\"\n\nSahra is working with Interpol and the South African Police Service on \nthe listing of heritage items to make it easier for them to be \nidentified if stolen. It includes the taking of high-quality photographs \nof all the items.\n\nLayton said the national audit was the biggest of its kind ever done in \nSouth Africa. It would allow the agency to identify how many collections \nexist and how their items were being managed.\n\nThe audit would result in a national database of information about the \ncountry's valuable movable and immovable heritage resources.\n\nBecause of their vulnerability, movable assets were being prioritised by \nthe pilot audit.\n\nLayton said the audit was not a one-off count, but could be done regularly.\n\nThe initial heritage survey revealed the treatment of many assets was \nnot suitable. There was little documentation and often no photographs.\n\nSome sites, especially government sites, were difficult to access. He \nsaid that at many government departments there was no central management \nof the heritage resources.\n\nButhelezi made an appeal for more funds to continue with the national \naudit, saying \"R28,5-million is just not enough\".\n\nThe centralisation of information on heritage resources would make it \npossible to create virtual museums on the Internet and make it easier to \ntrack other institutions' items.\n\n* This article was originally published on page 3 of The Star on April \n13, 2007\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Sat, 14 Apr 2007 10:24:37 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Gone in 50 seconds\nTo: Museum Security Network Mailinglist \nMessage-ID: <46208FC5.3030101@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n*Gone in 50 seconds*\n\nEdward Dolnick's Stealing the Scream follows the trail of a missing \nMunch from Norway to Scotland Yard and back, says Ian Pindar\n\n*Ian Pindar*\n*Saturday April 14, 2007*\n\n*Guardian*\n\n*Stealing The Scream: The Hunt for a Missing Masterpiece *\nby Edward Dolnick\n272pp, Icon, ?12.99\n\nIt took about 50 seconds to steal The Scream. Early one February morning \nin 1994, a man climbed a ladder, smashed a first-floor window of the \nNational Gallery in Oslo, clambered inside and slid the famous painting \ndown the ladder to an accomplice. He left behind a postcard depicting \nthree red-faced men laughing. On the back were the words: \"Thanks for \nthe poor security.\" Inadequate security was the least of the gallery's \nproblems. The Scream had been stolen on the very day that the Winter \nOlympics began in Lillehammer, so it was guaranteed maximum press \ncoverage. \"The theft was a jeering insult,\" explains Edward Dolnick in \nthis gripping account of how The Scream was stolen, \"a raised middle \nfinger directed at Norway's cultural and political elite.\"\n\nWhen Edvard Munch first exhibited The Scream in 1893, he was accused of \ndipping his finger in excrement and smearing it around. By 1994 it had \nbecome a much-loved icon of modernity and was valued at $72m. Its loss \nshocked the nation and rocked the art world. Norway wanted its \nmasterpiece back, but every trail went cold. Enter Christopher Charles \nRoberts, a fast-talking representative of California's Getty Museum, who \noffered to negotiate with the thieves on behalf of the Norwegians. The \ndeal was that if the Getty bought The Scream from whoever had taken it, \nthen in return Norway would loan it the painting to hang alongside \nanother work in the Getty collection, James Ensor's Christ's Entry into \nBrussels in 1889 (1888), a proto-expressionist masterpiece.\n\nIt was a good plan, and before long Roberts was meeting two of the \nthieves in the lobby of an Oslo hotel. A deal was struck, although \nunbeknown to the thieves there was one detail they had overlooked. \nRoberts didn't exist. He was in fact Charley Hill, a detective from \nScotland Yard's art and antiques unit. As Dolnick reveals how this \nelaborate undercover operation came into being, he perfectly captures \nthe thrill of planning a sting. \"You're a bit like a scriptwriter,\" says \none art squad detective. \"It's a challenge to come up with something \nthat has a genuine feel to it.\" Roberts certainly felt genuine. The \nGetty even falsified payroll files going back several years in case \nanyone investigated their imaginary employee.\n\nCharley Hill is the hero of this book; a gruff, no-nonsense Gene Hunt \nfigure with a love of fine art. As Dolnick observes admiringly, Hill can \nbe studying the brushstrokes in an Old Master one minute and kicking \ndown doors the next. As a young man he actually volunteered to fight in \nVietnam (his father was American, his mother English) out of \n\"intellectual curiosity\". He has an impressive rapport with criminals, \nespecially the most violent ones, and he also conforms to a familiar \ntrope of all TV detectives: he trusts his instincts. He knows how to \n\"read crooks\" and how to lie. (\"When you lie, lie big,\" he advises any \nwannabe undercover agents. \"What gets you in trouble is lying about the \nlittle things; that's when things get hard to remember and when you trip \nyourself up.\") He also knows when the time is right to do a deal and \nwhen to say \"Go fuck yourself!\" - a gamble that pays off in this \ninstance as Hill successfully recovers The Scream\n\nHill regards art crime as a \"serious farce\", and that's just how Dolnick \nplays it, with journalistic verve, in this enjoyable book. A recurring \ntheme is lack of funding. Scotland Yard's \"Scream team\" is so strapped \nfor cash that Hill can't afford the books he needs to swot up on the \npainting. And if security is poor in the world's public art galleries \nit's because the galleries are poor. Yet art crime is a thriving \nindustry. As much as $6bn a year could be changing hands in the art \nunderworld.\n\nThe phenomenal rise in the price of art in recent decades has not been \nmatched by any extra security in galleries, so they are sitting targets \nfor opportunistic thieves. \"Art theft is such an easy game and the \npenalties for getting caught are so low,\" says Dolnick, \"that the most \nhopeless sap can play.\" Unfortunately this sometimes means great art \ngets destroyed. When Cranach the Elder's Sybille of Cleves was stolen by \na French waiter, the thief's mother tried to hide the evidence by \ncutting it up and throwing it out with the trash. We can only hope that \nthe 551 Picassos, 209 Renoirs, 174 Rembrandts and 43 Van Goghs currently \nstill missing have not suffered a similar fate.\n\nhttp://books.guardian.co.uk/\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Sat, 14 Apr 2007 10:25:56 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Polic?a retira cargos contra sospechoso adquirir arte\n\tprecolombino robado\nTo: Museum Security Network Mailinglist \nMessage-ID: <46209014.9090902@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nPolic?a retira cargos contra sospechoso adquirir arte precolombino robado\n\nCopenhague\n\nLa polic?a danesa inform? hoy de que ha retirado por falta de pruebas la \nacusaci?n de encubrimiento contra un coleccionista dan?s que pose?a m?s \nde mil objetos de arte precolombino procedentes de Colombia, Per? y Ecuador.\n\nLas autoridades de estos tres pa?ses informaron de que los objetos \nfueron exportados violando sus legislaciones, pero no han probado que \nprocedan de un robo u otro delito punible en Dinamarca, de acuerdo con \nla fuente.\n\nAgentes de la polic?a encontraron el pasado verano en el s?tano de la \ncasa del coleccionista, al norte de Copenhague, m?s de mil vasijas, \nfiguras de piedra y cuencos procedentes adem?s de otros pa?ses como \nM?xico, Costa Rica y China, que le fueron requisados.\n\nLa esposa del coleccionista y un intermediario fueron tambi?n acusados \ninicialmente por la polic?a, aunque les fueron retirados los cargos.\n    \nLos pa?ses afectados enviaron a expertos en arte a Dinamarca para \ndeterminar el valor de las piezas.\n\nDe acuerdo con el sistema legal dan?s, es la polic?a la que decide si \nhay pruebas para trasladar un caso a los tribunales o si, como considera \nen esta ocasi?n, no son suficientes y la probabilidad de que no se \nllegue a producir una condena es elevada.\n\nLa Fiscal?a General del Estado es la que tiene la ?ltima palabra en el caso.\n\nEl coleccionista, Jan Erik Pelle, que asegur? haber comprado las obras \nde buena fe en subastas, ha anunciado que pedir? una indemnizaci?n de 10 \nmillones de coronas danesas (1,8 millones de d?lares) al Estado por las \nobras confiscadas, que no cuenta con recuperar.\n\nLa Organizaci?n de las Naciones Unidas para la Educaci?n y la Ciencia y \nla Cultura (UNESCO) ha criticado con anterioridad la legislaci?n danesa \npor no dar la cobertura jur?dica necesaria a la convenci?n contra el \ntr?fico ilegal de obras de arte, a la que Dinamarca se adhiri? hace a?os.\n\nhttp://www.lahora.com.ec\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 89\n***************************************\n\n"}