{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (Apr. 27, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 27, 2007\n\n\nApr 27, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for April 27, 2007  \n\n\n\nFirst Enercast Featured Articles for April 27, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories  \n\n\nApr 27, 2007 PowerMarketers Industry Publications\n\n\n\nOracle Makes the Move into Meter Data Management (UtiliPoint.com - Apr. 27, 2007)\n\n\n\nUtiliPoint.com - Apr. 27, 2007 - Tuesday, April 24, 2007 marks the date that Oracle formally announced its decision to move into meter data management market, a utility sector that has seen explosive growth in the last few years and has a promising future.\n\n\nApr 27, 2007 PowerMarketers Industry Publications\n\n\n\nShedding Light on PUC Decisions (EnergyBiz Insider - Apr. 27, 2007)\n\n\n\nEnergyBiz Insider - Apr. 27, 2007 - The line to distinguish lobbying for legislative purposes and judicial purposes is about to get a lot brighter.\n\n\nApr 27, 2007 PowerMarketers Industry Publications\n\n\n\nRECENT STATE INITIATIVES FURTHER THE DEVELOPMENT OF WIND ENERGY (Stateline - April, 2007) \n\n\n\nStateline - April, 2007 - While Maryland and Pennsylvania attempt to make development of wind generation projects easier, Texas is trying to ensure that at least some of its renewable energy comes from sources other than wind. \n\n\nApr 27, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nVote on Texas power market limits postponed: TXU deal is still on, investors say, despite move to limit firms' generation capacity\n\n\n\nApr. 26--AUSTIN -- As politics delayed a House vote on legislation meant to force the state's largest power generation companies to shrink, the investors that wish to buy TXU Corp. said they still expect their deal to close.  The House was scheduled to vote on a bill Wednesday that would limit the amount of power generation capacity each company may own. The bill's sponsor, Rep.\n\n\nApr 26, 2007 Knight Ridder Tribune Business News\n\n\n\nEPA proposal adds air pollution, environmentalists say: How output from coal-fired plants measured at issue\n\n\n\nApr. 27--Environmentalists who sued Duke Energy Corp. over upgrades at its coal-fired plants say a proposed EPA rule undermines their U.S. Supreme Court victory and would give utilities a free hand to pollute.  At issue is how the government measures air pollution from the smokestacks of coal-fired power plants and other sources. Environmentalists say the pollution should be counted as tons per ...\n\n\nApr 27, 2007 Knight Ridder Tribune Business News\n\n\n\nWestar Energy CEO announces retirement\n\n\n\nApr. 26--Jim Haines, a rural Lawrence resident who helped lead Westar Energy Inc. out of debt, is retiring in June as the utility's chief executive officer, the company announced Wednesday.  Haines will be replaced by William Moore, Westar's president and chief operating officer, who has worked at the company during all but two of the past 29 years. \"We are confident that the company will ...\n\n\nApr 26, 2007 Knight Ridder Tribune Business News\n\n\n\nPaying to save energy: LIPA considers investing $924 million to reduce LI's power usage, but ratepayers could see an increase on their bills as a result\n\n\n\nApr. 26--The Long Island Power Authority wants to conserve energy -- but it's going to cost you.  Months into planning and still under development, a new LIPA program called Efficiency Long Island initially set a target of eliminating 500 megawatts of energy use from the system by 2018. That goal is something environmentalists and, more recently, Gov. Eliot Spitzer said is a necessary first step ...\n\n\nApr 26, 2007 Knight Ridder Tribune Business News\n\n\n\nWPL not happy with wind decision\n\n\n\nApr. 26--Wisconsin Power & Light says it still plans to build its first wind farm in Wisconsin, but it may not do so under the terms first proposed to the state Public Service Commission.  WPL wants to build the Cedar Ridge Wind Farm in Fond du Lac County. That's a 40-turbine project with an estimated cost of $180 million that could generate up to 99 megawatts of electricity.\n\n\nApr 26, 2007 Knight Ridder Tribune Business News\n\n\n\nHarbor island LNG plan dead, foe says\n\n\n\nApr. 26--Efforts to build a liquefied natural gas terminal on Outer Brewster Island in Boston Harbor appear to be dead, according to a leading opponent. State Senator Robert L . Hedlund, Republican of Weymouth, said in an interview yesterday that he has received the commitments of enough members of the Senate to effectively block the terminal. Hedlund said that AES Corp., the Virginia-based ...\n\n\nApr 26, 2007 Knight Ridder Tribune Business News\n\n\n\nWestar CEO to step down: In troubled times, he helped return the company to its roots as an electric utility. William Moore is named to succeed him.\n\n\n\nApr. 26--James Haines, who helped Westar Energy out of its struggles with unregulated businesses and back to its electric-utility roots, has decided to retire from the Topeka company.  Haines will retire as chief executive officer and a director of Westar on June 30. Westar's board on Wednesday announced that William Moore, president and chief operating office at Westar, would succeed Haines. ...\n\n\nApr 26, 2007 Knight Ridder Tribune Business News\n\n\n\nWindmill's excess energy will power others in North Carolina\n\n\n\nApr. 26--Your electricity could be coming from the wind.  And not just any wind. These breezes are blowing right off the northern end of Cape Hatteras National Seashore and twirling a rather unassuming 70-foot-high wind turbine. For two years it has powered the Coquina Beach bathhouse. Now it has the potential to power places farther away. Dominion North Carolina Power has installed a second ...\n\n\nApr 26, 2007 Knight Ridder Tribune Business News\n\n\n\nLIPA delays National Grid vote: Agency allows time for lawmakers to get answers about cleanup of toxic sites where gas was manufactured\n\n\n\nApr. 26--As Suffolk legislators plan today to raise new concerns about toxic former gas plant sites, the Long Island Power Authority has agreed to delay a board vote on its lucrative contracts with National Grid Plc, the company merging with KeySpan Corp.  LIPA confirmed yesterday that it delayed the vote, scheduled for today, by its trustees on the National Grid contracts -- reached in principle ...\n\n\nApr 26, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nEnergy company shelves proposal for Boston Harbor LNG\n\n\n\nBOSTON - A company that proposed building a liquefied natural gas terminal on a state-owned island in Boston Harbor is shelving the plan, according to a published report. AES managing director Aaron Samson, managing director of energy company AES Corp. of Arlington, Va., told The Patriot Ledger of Quincy that opposition to placing the terminal on Outer Brewster Island led to the companys ...\n\n\nApr 26, 2007 Boston Herald\n\n\n\nWisconsin Power & Light dealt wind farm setback\n\n\n\nAlliant Energy still plans to build a large wind farm in Fond du Lac County even though it is 'disappointed' by a Public Service Commission of Wisconsin ruling regarding its financing. Wisconsin Power & Light Co., Alliant's state utility unit, had applied for a permanent 12.9 percent rate of return for the Cedar Ridge Wind Farm under Act 7, a 2005 state law that provides for setting permanent ...\n\n\nApr 27, 2007 Capital Times\n\n\n\nCompanies partner to develop new PRB coal mine\n\n\n\n25-April-2007 -- Affiliates of CONSOL Energy Inc. and The Pittsburg and Midway Coal Mining Co. have entered into a joint venture agreement to develop the proposed Youngs Creek Mine north of Sheridan, Wyo. CONSOL of Wyoming LLC, and Chevron NPRB LLC, have formed a new company, Youngs Creek Mining Company LLC., to develop and operate the mine. Youngs Creek Mining Company received coal reserves and ...\n\n\nApr 26, 2007 Power Engineering\n\n\n\n\n\nAvista Files for Electric and Natural Gas Rate Adjustments in Washington\n\n\n\nSPOKANE, Wash., April 26 /PRNewswire-FirstCall/ -- Avista (NYSE: AVA) today filed a request with the Washington Utilities and Transportation Commission (WUTC) to increase rates by an average 15.85 percent for electric customers and 2.27 percent for natural gas customers in Washington. The requested rate changes are driven primarily by increased costs associated with investment in facilities ...\n\n\nApr 26, 2007 PR Newswire\n\n\n\nValero Board Approves Election of Eric Fisher to Corporate Officer\n\n\n\nSAN ANTONIO--(BUSINESS WIRE)--The Valero Energy Corporation (NYSE:VLO) Board of Directors has approved the election of Eric Fisher, currently Valeros Vice President of Investor Relations, to the position of Corporate Vice President-Investor and Corporate Communications. Fisher will report directly to Valero Chairman and CEO Bill Klesse. The promotion became effective upon the boards approval ...\n\n\nApr 26, 2007 Business Wire\n\n\n\nMichCon Announces Jamestown Pipeline Plan\n\n\n\nMichigan Consolidated Gas Co. (MichCon) today announced a two-year project to install a new natural gas pipeline in West Michigan that will increase gas supplies and help meet future market demand spurred by residential and business growth.     Construction of the 16.3-mile Jamestown Pipeline will begin in June and be completed in the 2008 construction season.\n\n\nApr 26, 2007 PR Newswire\n\n\n\nSustainable Power Corp. Engages Auditor and Commences Initial Steps Toward Becoming a Fully Reporting Company\n\n\n\nSustainable Power Corp. (PINKSHEETS: SSTP), a  Sustainable Power Corp. (PINKSHEETS: SSTP), a single-source provider of renewable energy solutions and green power plant facilities, announced today that the company has engaged Gruber &amp; Company, LLC as its Public Company Accounting Oversight Board (PCAOB) auditors to examine the company's books and records and render an opinion on its financial ...\n\n\nApr 26, 2007 Internet Wire\n\n\n\nAlcan to invest US$130 million in Saguenay power facility - New high-efficiency turbine adds more clean renewable capacity to Shipshaw power station\n\n\n\nMONTREAL, April 26 /PRNewswire-FirstCall/ - Alcan announced today that it is beginning the engineering for the construction of a new high-efficiency turbine at its Shipshaw power generating station in the Saguenay region of Quebec. The new turbine will eventually replace an older, less-efficient machine. This project represents an investment of approximately US$130 million and is part of the ...\n\n\nApr 26, 2007 PR Newswire\n\n\n\nEnerNex Corporation Wins GridWeek Recognition for Innovation in Grid Modernization\n\n\n\nWASHINGTON--(BUSINESS WIRE)--EnerNex Corporation was honored by GridWeek and the U.S. Department of Energy for Innovation in Implementation and Deployment in grid modernization on Wednesday, April 25 at the recognition reception and dinner held during GridWeek 2007. EnerNex, an electric power research, engineering and consulting company, received this recognition for its industry wide involvement ...\n\n\nApr 26, 2007 Business Wire\n\n\n\nBOMA San Francisco Announces Winners of 2007 Earth Awards\n\n\n\nThe Building Owners and Managers Association of San Francisco today recognized nine San Francisco companies for their demonstrated leadership in developing innovative practices that promote sustainable 'green' working environments at the 2007 Earth Awards Luncheon. The Earth Awards, formerly known as the Commercial Office Recycler of the Year (CoRY) Awards, acknowledge efforts by local commercial ...\n\n\nApr 26, 2007 PR Newswire\n\n\n\nState Reduces Energy Consumption 10 Percent, Saving Taxpayers $1.6 Million\n\n\n\nCiting the state's aggressive work to conserve and reduce energy consumption in all state-owned office buildings, Department of General Services Secretary James P. Creedon today said the commonwealth has achieved a 10-percent reduction in energy consumption or $1.6 million in savings for taxpayers.     Creedon made the announcement with PUC Chairman Wendell F.\n\n\nApr 26, 2007 PR Newswire\n\n\n\nExxonMobil Chemical Boosts Capacity to Produce Spectrasyn Ultra(TM) High VI Polyalphaolefins\n\n\n\nSpectrasyn Ultra High VI Polyalphaolefins HOUSTON--(BUSINESS WIRE)--ExxonMobil Chemical (NYSE:XOM) today announced the completion of a debottleneck project at the Beaumont Synthetics plant that increases by 40 percent the capacity to produce SpectraSyn Ultra High VI high viscosity polyalphaolefins (PAO). The expansion will help meet increasing market demand for the advanced high viscosity PAO, ...\n\n\nApr 26, 2007 Business Wire\n\n\n\n\n\nOntario plans to bring dozens of clean-energy megawatts online by 2010\n\n\n\nTORONTO (CP) - with the construction of North America's largest solar farm and 13 other renewable energy projects. Energy Minister Dwight Duncan says the solar farm in Sarnia, Ont., will be built by OptiSolar Farms and consist of over one million ground-mounted solar panels. The company will produce 40 megawatts of energy starting in 2010, enough to power about 6,000 homes.\n\n\nApr 26, 2007 National Post\n\n\n\nEPA proposes controversial energy rule\n\n\n\nWASHINGTON - The government proposed a pollution standard for power plants Wednesday that critics said flouts the spirit of a Supreme Court ruling on clean air enforcement.The proposal would make it easier for utilities to expand plant operations or make other changes to produce more electricity without installing new pollution controls.Critics said the Environmental Protection Agency was ...\n\n\nApr 26, 2007 MSNBC\n\n\n\nETT Partners With The Wind Coalition To Analyze New Transmission Needed To Support Texas Wind Generation\n\n\n\nAustin, TX - Every dollar spent for construction of new transmission lines to support the development of wind resources in Texas will result in a $5 to $7 reduction in energy costs, according to testimony filed recently with the Public Utility Commission of Texas (PUCT) by Electric Transmission Texas LLC (ETT), a proposed joint venture between subsidiaries of American Electric Power and ...\n\n\nApr 26, 2007 Power Online\n\n\n\nCalifornia ISO Board Approves Five-Year Business Plan\n\n\n\nSharpens Strategic Focus of Independent Grid Operator Through Year 2011 Folsom, CA - The California Independent System Operator Corporation (California ISO) Board of Governors recently approved a comprehensive Five-Year Business Plan that follows a thorough process of assessing the needs of the electricity industry and the consumers it serves. The business roadmap charts the course for the ...\n\n\nApr 26, 2007 Power Online\n\n\n\nPSC Approves Plans To Further Strengthen The State's Electric Infrastructure\n\n\n\nTallahassee - The Florida Public Service Commission (PSC) recently approved a proposal by Florida Power & Light (FPL) intended to provide an incentive for local governments to move overhead power lines underground. FPL requested the change to its operating tariff in order to improve reliability of service and reduce vulnerability to storm damage. \"The approved tariff provides local governments ...\n\n\nApr 26, 2007 Power Online\n\n\n\nValero reports record earnings for first quarter\n\n\n\nValero Energy Corp. earned the highest first-quarter profits in company history posting net income of $1.1 billion, or $1.86 per share, for the period ending March 31, 2007. That compares to net income of $849 million, or $1.32 per share, for the first quarter of 2006. First-quarter operating income was $1.8 billion, compared to $1.3 billion for the year-ago period.\n\n\nApr 26, 2007 San Antonio Business Journal\n\n\n\nAggreko shares power ahead after string of new deals\n\n\n\nAGGREKO, the Glasgow-basd temporary power supply company, has predicted profits in 2007 will be well ahead of analysts' estimates, buoyed by a strong first quarter and a string of new contracts. Shares in the firm, which helped restore power after Hurricane Katrina ravaged the southern US in 2005, surged by 8.9 per cent - or 45.5p - to a record high of 559p on the news.\n\n\nApr 26, 2007 The Scotsman\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nEuropeans look to U.S. for wind-power growth\n\n\n\nBusiness Europeans look to U.S. for wind-power growth By Alan Zibel the associated press | advertisement  WASHINGTON - New worries about the environment, technology advances and tax-break extensions are empowering European wind energy companies to try their luck in the United States. The U.S. has led the world in installing new wind turbines for the past two years, but it still ranks behind ...\n\n\nApr 27, 2007 Arizona Daily Star\n\n\n\nAcciona to Install Wind Turbine Production Plant in Iowa\n\n\n\nIncreasing demand for wind power prompts renewable energy leader to develop its first wind turbine manufacturing facility in U.S. CHICAGO--(BUSINESS WIRE)--Acciona, the worlds largest wind power developer, announced it will develop its first wind turbine production plant in the United States, in the state of Iowa. Expected to provide more than 100 new jobs to the West Branch, Iowa workforce, the ...\n\n\nApr 26, 2007 Business Wire\n\n\n\nChevron Reports First Quarter Net Income of $4.7 Billion, Up 18 Percent From First Quarter 2006\n\n\n\n- Downstream profits increase $1 billion, due mainly to $700 million gain on sale of refining assets in Europe - Upstream earnings decline $550 million on lower average prices for crude oil and natural gas SAN RAMON, Calif., April 27 /PRNewswire-FirstCall/ -- Chevron Corporation (NYSE: CVX) today reported net income of $4.7 billion ($2.18 per share - diluted) for the first quarter 2007, compared ...\n\n\nApr 27, 2007 PR Newswire\n\n\n\nAir Liquide: New developments in China with Dongbei Special Steel Group in Dalian\n\n\n\nAir Liquide (Paris:AI) has entered a new long-term agreement with Dongbei Special Steel Group in Dalian, Liaoning Province, China. Under the terms of this agreement, Air Liquide will install a new Air Separation Unit (ASU) with a production capacity of 550 tonnes per day of oxygen in Dalian to supply gaseous oxygen, nitrogen and argon by pipeline to the new Dongbei Special Steel Group steelworks. ...\n\n\nApr 26, 2007 Business Wire\n\n\n\nBelgium to get 3 MW biomass CHP in 2008\n\n\n\n- Belgium is to have a new biomass-fired combined heat and power plant with a net power output of 3.29 MW due online in July 2008, contractor Wartsila Corporation has announced. Belgian independent power producer Renogen has contracted Wartsila to build the plant in Amel, in the Ardennes region of southern Belgium. The new plant will have a thermal output of up to 10 MW for district heating, said ...\n\n\nApr 26, 2007 Power Engineering\n\n\n\nEuropean Commission: EU Electricity Market Not Functioning Properly\n\n\n\nVegetation Management  Innovations in City and Rural UtilitiesT&D World's special supplement to the August issue. More Katrina-Reflections from the Gulf The European Commission has published a detailed study, carried out by an external consultant, that finds that fuel costs have contributed to the increase of EU electricity prices since 2003, but that wholesale electricity prices are ...\n\n\nApr 26, 2007 Transmission & Distribution World\n\n\n\nStora Enso Interim Review January-March 2007\n\n\n\nStora Enso (NYSE: SEO) today announced its  Stora Enso (NYSE: SEO) today announced its first quarter results for 2007.  Summary of First Quarter Results (compared with Q1/2006) Sales were EUR 3 855.4 (EUR 3 607.7) million. Operating profit was EUR 307.3 (EUR 247.0) million excluding non-recurring items. Operating profit was EUR 339.3 (EUR 223.8) million including non- recurring items.\n\n\nApr 26, 2007 Internet Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}