{"category": "ham", "to_address": "a2k@lists.essential.org, ip-health@lists.essential.org", "from_address": "james.love@keionline.org", "subject": "[Ip-health] KEI Statement on conclusion of WIPO Development Agenda negotiations", "body": "http://www.keionline.org/index.php?option=com_content&task=view&id=88\n\nKEI Statement on conclusion of WIPO Development Agenda negotiations\n\nFriday, 15 June 2007\nStatement by James Love, Director of KEI\n\n\"After three years, WIPO has produced a meaningful and welcome new vision\nfor WIPO. The governments who participated in the negotiations agreed that\nWIPO is no longer only to pursue mindless expansions of intellectual\nproperty rights, but now is a place to discuss a broad range of topics,\nincluding measures to protect or promote access to knowledge, the\nimplications and benefits of a rich and accessible public domain, and\nstrategies for dealing with abuses of rights, or other measures to protect\nthe public interest. None of this would have happened if Argentina and\nBrazil had not proposed, in 2004, that WIPO adopt a development agenda.\nNone of this would have moved ahead without the many contributions by\ncivil society and academic experts, and without the support of several\nphilanthropic and development organizations. Once the debate began, the\nparticipation of and leadership by developing countries grew, on all three\ncontinents. In the beginning, the WIPO secretariat was defensive and\nhostile, and so too were nearly all members of Group B, the rich country\nnegotiating block. But by 2007, under the leadership of a new and\neffective PCDA Chair, a great deal had changed, and the outcome\nrepresented a true consensus that WIPO would change, and that this was a\ngood thing. Having concluded a difficult and quite meaty negotiation over\nWIPO's purpose and direction, there will be an effort to implement the new\nDevelopment Agenda. The next two to three years will be critical. One has\nto prudently wonder how sustainable is the interest in this reform effort.\nThe institutional juggernaut behind stronger IPR is well financed and\npermanent, and the opposition is often poorly resourced and episodic. But\nfor this June, it is appropriate to appreciate the enormous progress, and\nthank all of the negotiators for bringing forth such a worthwhile outcome,\nand everyone else for their important role in making this happen.\"\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}