{"category": "spam", "to_address": "Myrtless <myrtless@flax24.uwaterloo.ca>", "from_address": "Richard Stewart <downs@globond.com>", "subject": "The best medications for the best price", "body": "\n\nCan you satisfy your girlfriend? Or you are afraid that she meets with someone who is better than you in bed?\nClick here to be the best lover in the world!\nU can restore your health right now. Doesn't matter what the problem is - we have pills to cure everything. Erection Dysfunction, Weight loss, Anti-Depressants, Antibiotics and even more! \nOur shop\nThe highest quality, cheap prices, instant shipping worldwide, friendly support!\nWith best regards,\nRichard Stewart\n \n \nSvetochtimyj v sinem s pozolotoj plashche i vpriam polez pod iubku, shepcha ej chto-to Na ushko, poka ona, sklonivshis, nalivala emu iz kuvshina v bokal, i nelzia bylo Skazat, chto ej ne ponravilos skazannoe. Kvin do krovi zakusil nizhniuiu gubu, ne zamechaia Boli. Do Velikogo ozera rovno cherez sutki, k nochi Sleduiushchej, esli ne vozniknet kakih-nibud nepredvidennyh prepiatstvij. Moia odezhda menia vpolne ustraivala. \nPri vide etoj vysokoj, hudoj kak Zherd goluboj figury, vyplyvshej iz-pod arki, mne pochemu-to vdrug stalo Zharko, hotia sekundu nazad ia ezhilsia ot skvozniaka, tianuvshego iz proezda. Chto zhe eto Poluchaetsia? Groznaia zhivaia legenda byla pohodia prikonchena zasfernikom? Da uzh. Vzgliad Nkota potuh, on sunul Klinok za pazuhu i sgorbilsia, vsem svoim Vidom pokazyvaia, chto zakonchil. Sam znaiu, bolvan. Ia vzdrognul. Slishkom bystro. Horoshij na etoj planetke nabor parasposobnostej u liudej, Probormotal ia, gliadia na pustoe mesto, gde ona tolko chto stoiala. No ia vse eshche byl zhiv. \nGovorili emu pogod, ne sujsia, poka topory ne vozmem, tak net, Udal reshil pokazat, bolshe vseh dobychi zahotelos. On ved ne poveril Mne ni na sekundu, chto ia vse zabyl o sebe. Pribyl reshit ia vopros s golubym bankosom. Sveta za vorotnik, Onni, davnenko tebia ne videl! I nado skazat, chto Neskazanno rad nashej sluchajnoj vstreche! Ia ved ne obolshchaius kto ia takoj, Chtoby ty reshila otorvatsia ot vypolneniia svoih, nesomnenno, vazhnyh sluzhebnyh Obiazannostej i navestit imenno menia, verno? Kstati, ne predstavish li menia Svoemu svetochtimomu sputniku? Ia s otstranennym interesom glianul na nezhdannogo i vesma slovoohotlivogo Gostia, kotoryj, potrevozhiv nas zvonkim malchisheskim golosom, besceremonno Pliuhnulsia na skamiu riadom s Onni. ejisuminyon XF5FVVtTW1Z0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}