{"category": "spam", "to_address": "Theorize <theorize@plg.uwaterloo.ca>", "from_address": "Alexander Wall <istankim@gospelmall.com>", "subject": "Your dick is not only for pissing", "body": "\n\nDo you want to save your money and get high-quality pills?\nClick here to become a sex giant\nUse licensed Viagra and Cialis pills from our drug store. You will be the best, you will have perfect sex in your life!\nClick here\nAbsolutely confidential and secure purchase.\nWith best regards,\nAlexander Wall\n \n \nKotoryj Stilen. Pusti, dobryj chelovek, ne Zastavliaj moknut pod dozhdem. Mne ochen redko Sniatsia sny. Vykladyvaj. \nPochemu ty ne kriknula, Nori, ia zhe byl sovsem riadom, za dvermi Kosmoporta? Ia byl vooruzhen. Ia dolzhen byl otomstit za stol grubo poprannoe chuvstvo sobstvennogo Dostoinstva. Kvin sbilsia, pojmav Nasmeshlivo-sochuvstvuiushchij vzgliad neistrebimoj, i, reshiv ne zaviratsia, smushchenno Kivnul: Ne vopros. Vot mne i prihoditsia inogda vse zhe polzovatsia kryliami, kak sejchas. Postaviv polupustuiu emkost s napitkom na sidene, Ia obespokoeno pokrutil golovoj i obnaruzhil Nkota nepodaleku, vsego v desiati Shagah ot mashiny. S hrustom skomkal opustevshuiu emkost v kulake, nemnogo pomial, Prevrashchaia ee v plastikovyj shar, a zatem zapustil v dalnij konec ploshchadi. Esli Chelovek govorit, chto ponimaet tebia, ne ispytav pri etom chto-libo podobnoe na Sobstvennoj shkure, to eto lish illiuziia ego ponimaniia. Ia kivnul. \nZa sosednimi Stolikami stalo tishe Gront zdes iavno byl figuroj zametnoj, vot liudi i Prislushivalis k razgovoru, predvkushaia razvlechenie, i ih trudno bylo za eto Vinit takova zdes zhizn. Ponevole mysli snova vernulis k moemu nedavnemu snu. Ladno, teper vot chto. Kak on Ni otvlekalsia na svoih mnogochislennyh gostej, sostav kotoryh menialsia kak vid Ruchia, begushchego po gornomu sklonu: to lenivo kamushek podnimet i poneset-pokatit, To gorst raznocvetnyh proshlogodnih listev prihvatit i vnov vybrosit na bereg, A to vdrug upadet s neozhidannoj kruchi vniz i uzhe ne zhurchit, a revet i bryzzhet Penoj na kamennyh izlomah poroga, sovsem i ne ruchej vovse, a vzbesivshijsia zhgut Perekruchennoj vody. ejisuminyon UkFHXFBeQEp0RV1VHUFCUEZWRlleXR1XVA==\n \n\n\n"}