{"category": "ham", "to_address": "\"Shriramana Sharma\" <samjnaa@gmail.com>", "from_address": "\"Andrew Donnellan\" <ajdlinux@gmail.com>", "subject": "Re: question about gpl-commercial dual licencing", "body": "On 4/21/07, Shriramana Sharma  wrote:\n> Hello all.\n>\n> Say someone creates a library libfoo in the C language. The library is\n> dual-licenced -- under the GPL and under a commercial licence. GPL is\n> for open-source consumers and commercial licence is for closed-source\n> consumers.\n>\n> Now I create Python binding to that library - pyfoo. Now I would like to\n> dual-licence it myself, under the same terms -- GPL and a commercial\n> licence.\n>\n> Now to get the right of dual-licensing, do I have to obtain a commercial\n> licence from the author of libfoo?\n>\n> If yes, why? If no, why not? Please elucidate. Thanks.\n\nIf you created the bindings using ctypes or similar, where there's no\nactual linking taking place, I think it's all OK.\n\nOtherwise, I think you still need a license - you would be linking\nagainst the library to create the bindings, therefore creating a\nderivative work, and as you have received the library under the GPL\nthe terms of the GPL must apply. Of course, it still depends on\nwhether the commercial license gives permission to do stuff like that\nanyway.\n\nHowever, I think a nice email to the author can clear it all up anyway\n- your Python bindings would simply drive more sales of the commercial\nlicense anyway.\n\n-- \nAndrew Donnellan\najdlinuxATgmailDOTcom (primary)    ajdlinuxATexemailDOTcomDOTau (secure)\nhttp://andrewdonnellan.com         http://ajdlinux.wordpress.com\najdlinux@jabber.org.au             hkp://subkeys.pgp.net 0x5D4C0C58\n            http://linux.org.au    http://debian.org\n        Get free rewards - http://ezyrewards.com/?id=23484\n        Spammers only === ajdspambucket@exemail.com.au ===\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}