{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Alex Snow <alex_snow@gmx.net>", "subject": "Re: A VmWare alternative", "body": "You might also want to give virtualbox a try under windows.\nOn Thu, Jun \n21, 2007 at 11:20:51AM -0700, Gregory Nowak wrote:\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA1\n> \n> Mind describing how you're running qemu under windows? I just tried it\n> last week, and my attempts were a total failure.\n> \n> I created an image called c.img with the qemu-img command, or whatever\n> it is. I stuck a floppy into the a drive. Then, in the folder where I\n> had c.img, from within cmd, the xp command prompt, I did:\n> \n> qemu -L c:\\progra~1\\qemu\\pcbios -serial com2 -fda a: -boot a c.img\n> \n> I also did\n> \n> qemu -L c:\\progra~1\\qemu\\pcbios -serial com2 -fda a: -boot a -hda c.img\n> \n> and neither of those worked. No floppy spin, no hd activity,\n> nothing. I was just still in the cmd window, and the only things on\n> the screen were the command-line I typed, which seemed to be repeated\n> for the second time when I read the screen with wineyes, but the\n> second time had pauses between the words in the reading (I.E. qemu\n> ... -fda ... a: ...) and so on.\n> \n> When I tried just:\n> \n> qemu -L c:\\progra~1\\qemu\\pcbios c.img\n> \n> It worked, but qemu told me that c.img was not bootable. That's fine,\n> but how am I supposed to install an os in the first place? Any other\n> options besides that, even just adding -fda a: to the command-line\n> made it not work. Before you ask, yes, I did make an image of the\n> floppy under gnu/linux, and tried using the file, instead of the a:\n> drive, and yes, I did try leaving out the serial port, as well as the\n> - -boot a option. No luck. The only thing that worked is just to specify\n> the path to the bios files, and c.img at the end, which I can't\n> obviously boot from. If I left out the bios path and the -L flag, and\n> just did qemu c.img, qemu complained that it couldn't find the bios,\n> no surprise there.\n> \n> Greg\n> \n> \n> On Thu, Jun 21, 2007 at 09:11:01AM -0700, Zachary Kline wrote:\n> > Hiya,\n> >     Just thought I'd throw this out there.  For those of you who are comfortable in command lines--most Speakup users, I'd say--I'v'e found an alternative to VMWare.  This is the open source and free software Qemu.  It is quite fast, and is able to emulate several types of CPU as well as different types of sound card, network card, etc.  Running under Windows I can create .bat files, and run different systems from each.  I'm currently trying to get LFS working--I know, it's a lot of waiting and compiling, but I've got time.  If anybody's interested, the Qemu home page is:\n> > http://fabrice.bellard.free.fr/qemu\n> > Yours,\n> > Zack.\n> > _______________________________________________\n> > Speakup mailing list\n> > Speakup@braille.uwo.ca\n> > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n> - -- \n> web site: http://www.romuald.net.eu.org\n> gpg public key: http://www.romuald.net.eu.org/pubkey.asc\n> skype: gregn1\n> (authorization required, add me to your contacts list first)\n> \n> - --\n> Free domains: http://www.eu.org/ or mail dns-manager@EU.org\n> -----BEGIN PGP SIGNATURE-----\n> Version: GnuPG v1.4.6 (GNU/Linux)\n> \n> iD8DBQFGesGD7s9z/XlyUyARAtq8AJ4j4aIkrRmFs9oOkiS/UQsC7XjzVwCfWaHP\n> Ih/oCo6womHuEsKX65bL5MA=\n> =pPIZ\n> -----END PGP SIGNATURE-----\n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n-- \nSome people have told me they don't think a fat penguin really embodies the \ngrace of Linux, which just tells me they have never seen a angry penguin \ncharging at them in excess of 100mph.  They'd be a lot more careful about what \nthey say if they had. \n\t-- Linus Torvalds, announcing Linux v2.0\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}