{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\nPerformance \n\t\t\tBenchmarking For Energy Utilities\nSeattle, WA\n            May 23-24, 2007\n\nPandemic \n\t\t\tPreparedness For Utilities\nSeattle, WA\n            May 23-24, 2007\n\n\nCapacity \n\t\t\tMarkets\n\n\t\t\tWashington, DC\n\nJune \n4-6, 2007\n\nCoal-to-Liquids \n\t\t\tFinance and Development Summit\n\n\t\t\tNew York, NY\n\nJune \n4-6, 2007\n\n\nStrategies for \n\t\t\tBidding Ancillary Services in LMP Markets\n\nIndianapolis, IN\n\nJune 6-7, 2007\n\n\nIntro to Electric \n\t\t\tUtility Systems for Non Engineers\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nDistributed \n\t\t\tEnergy Resources-Emerging Business Models for Utilities\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (May 22, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 22, 2007\n\n\nMay 24, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for May 24, 2007  \n\n\n\nFirst Enercast Featured Articles for May 24, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 24, 2007 PowerMarketers Industry Publications\n\n\n\nInsights From the CIS Executive Summit (UtiliPoint.com - May 23, 2007) \n\n\n\nUtiliPoint.com - May 23, 2007 - Utility executives are tasked with continually finding ways to deliver better service to consumers while lowering operating costs.\n\n\nMay 24, 2007 PowerMarketers Industry Publications\n\n\n\nLetters From Readers (EnergyBiz Insider - May 24, 2007)\n\n\n\nEnergyBiz Insider - May 24, 2007 - Below are a few letters we received on topics that appeared in the past few weeks. They capture the essence of how many readers say they feel.\n\n\nMay 24, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 24, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 24, 2007\n\n\nMay 24, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 23, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 23, 2007\n\n\nMay 24, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nPacifiCorp generated power for energy bill\n\n\n\nMay 23--Pacific Power and Portland General Electric lie directly in the sights of a landmark renewable energy bill expected to squeak through the Senate today. As Oregon's largest utilities -- together they account for 75 percent of the electricity consumed in the state -- they will bear almost the entire burden of meeting the bill's mandates. Yet, in a striking twist on political expectations, ...\n\n\nMay 23, 2007 Knight Ridder Tribune Business News\n\n\n\nLet nuclear plant workers vote on union, group asks\n\n\n\nMay 24--About 700 workers at three Progress Energy nuclear plants could become the utility's first employees in the Carolinas to join a labor union.  The International Brotherhood of Electrical Workers on Wednesday asked the National Labor Relations Board for a secret ballot election, representing a year-long drive that began at the Brunswick nuclear plant near Wilmington last year and spread to ...\n\n\nMay 24, 2007 Knight Ridder Tribune Business News\n\n\n\nPSE faces $2 million fine over records: Utility can't recover cost by charging higher rates\n\n\n\nMay 24--OLYMPIA -- Puget Sound Energy faces a $2 million penalty for allegedly falsifying records of suspected natural-gas pipeline leaks.  Washington Utilities and Transportation Commission staff recommended the fine, which the utility can't recover by raising rates, after identifying 209 violations during an audit of about 1,000 company pipeline-safety records from January 2002 to December ...\n\n\nMay 24, 2007 Knight Ridder Tribune Business News\n\n\n\nNew power plant might compete with Palm Beach County for water\n\n\n\nMay 23--A new power plant, billed as a way to meet Florida's growing energy needs, also creates an added drain on western Palm Beach County's water supply. Water worries were a rallying cry for residents who last week fended off plans for 10,000 new homes on Callery-Judge Grove, yet Florida Power & Light Co.'s plant under construction west of Royal Palm Beach would use as much water as 50,000 ...\n\n\nMay 23, 2007 Knight Ridder Tribune Business News\n\n\n\nUnit 1 up and running: Browns Ferry reactor splitting atoms again after 22-year shutdown\n\n\n\nMay 23--For the first time since 1985, uranium atoms are splitting at Browns Ferry Nuclear Plant Unit 1. The restart began Tuesday at 12:28 a.m.  \"This is the newest old plant in the nation,\" said Browns Ferry spokesman Craig Beasley. Unit 1 may begin generating electricity as early as this week on a temporary basis as testing continues. The Tennessee Valley Authority does not expect a permanent ...\n\n\nMay 23, 2007 Knight Ridder Tribune Business News\n\n\n\nWind power bills just hot air, environmentalists say\n\n\n\nMay 23--TOPEKA -- For years, environmentalists have asked Kansas lawmakers to require power companies to use wind-generated energy.  Lawmakers again balked in the legislative session that ended this month, though they took small steps toward encouraging renewable energy and energy efficiency. But as long as the wind blows, environmental groups vow to keep trying.\n\n\nMay 23, 2007 Knight Ridder Tribune Business News\n\n\n\n50% rise in BGE rates OK'd by PSC: Panel criticizes utility, past regulatory rulings\n\n\n\nMay 24--The state utility commission approved yesterday a 50 percent electricity rate increase for customers of Baltimore Gas and Electric Co. in a sweeping order that also takes the company and past regulators to task for decisions made in the run-up to electricity deregulation.  The five-member Public Service Commission said it had arrived at its conclusion \"reluctantly,\" arguing that its hands ...\n\n\nMay 24, 2007 Knight Ridder Tribune Business News\n\n\n\nPuget Sound Energy could face fines for faulty records\n\n\n\nMay 23--Puget Sound Energy could face a $2 million fine for failing to keep accurate and complete records of suspected natural gas pipeline leaks.  The recommendation from staff members of the Washington Utilities and Transportation Commission stems from an audit of the company's pipeline safety records from January 2002--to December 2005. The three-member utilities commission is expected to ...\n\n\nMay 23, 2007 Knight Ridder Tribune Business News\n\n\n\nUtilities spent big on lawmakers\n\n\n\nMay 23--AUSTIN -- The possible conclusion of the legislative session without meaningful changes to Texas' electric market will stand as an example of the power of money in politics, critics say.  Whether any measure addressing spiraling electric rates is crafted before the session ends Monday rests largely in the hands of 10 lawmakers picked to steer the negotiations.\n\n\nMay 23, 2007 Knight Ridder Tribune Business News\n\n\n\nState scraps dual tiers for natural gas\n\n\n\nMay 23--RALEIGH -- State regulators abolished a two-tiered rate system once used by PSNC Energy.  Last year, the utilities commission approved PSNC's plans to charge $1.18 per therm for year-round users, and $1.30 per therm for seasonal users. To qualify for the lower rate, customers had to meet a minimum usage threshold in the summer, prompting complaints that the utility was penalizing ...\n\n\nMay 23, 2007 Knight Ridder Tribune Business News\n\n\n\nCoal plant fuels call for ouster\n\n\n\nMay 23--WASILLA -- A disgruntled ratepayer and member of the Matanuska Electric Association is circulating a petition to recall two board members for withholding information from MEA members.  The two board members, board president Lee Jordan and David Dahms, questioned why Bill Erickson targeted only them. Erickson holds Dahms and Jordan responsible for failing to provide the MEA cooperative ...\n\n\nMay 23, 2007 Knight Ridder Tribune Business News\n\n\n\nWeather system's rain continues today\n\n\n\nMay 24--Settle in for a wet afternoon, with thunderstorms likely across southeastern Minnesota this afternoon.  A slow-moving front has been sauntering through the area, dropping significant -- and welcome -- rain, along with occasional lighting and thunder. It should move on to the east by Friday, said meteorologist Todd Shea of the National Weather Service in La Crosse, Wis.\n\n\nMay 24, 2007 Knight Ridder Tribune Business News\n\n\n\nVisalia's trash-collection fees to rise incrementally over 5 years\n\n\n\nMay 24--Rising fuel costs and new water-treatment requirements will push up rates residents and businesses pay in trash and sewage fees during the next five years.  Visalia City Council members approved rate hikes this week that will take effect July 1. For residents, the combined fees -- which include a street-sweeping charge -- will go up from the current level of $31.94 per month to $34.05. ...\n\n\nMay 24, 2007 Knight Ridder Tribune Business News\n\n\n\nPlans for alternative-fuel plants multiply as third firm eyes region\n\n\n\nMay 24--A Texas company plans to build as many as five biodiesel plants in Hampton Roads over the next five years -- an investment of roughly $200 million -- to capitalize on surging demand for clean-burning fuels.  Endicott Biofuels LLC hopes to accomplish a critical step toward that goal by June 1, signing a long-term lease on land for the first plant. The 4 1/2-acre waterfront parcel with rail ...\n\n\nMay 24, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nHome explosion, fire in Clinton Twp. caused by gas, investigators say\n\n\n\nCLINTON TOWNSHIP -- Fire investigators are confirming the house explosion and subsequent fire that seriously injured a mother and her two children was an accident and caused by natural gas escaping into the home. 'We found an open line in the house that somehow or another was turned on,' said Bill Smith, Clinton Township fire marshal. Marcy Hill, 34; her daughter, Patricia, 19; and son, ...\n\n\nMay 24, 2007 Detroit News\n\n\n\nNYRI to Comment at DOE Public Meetings on Proposed National Interest Electric Transmission Corridors\n\n\n\nThe Digital Utility  Vegetation Management  T&D World's special supplement to the August issue. More Katrina-Reflections from the Gulf The New York Regional Interconnect, Inc. (NYRI) will provide testimony during a public meeting being hosted by the U.S. Department of Energy (DOE) in New York City today. The meeting is part of a series of public meetings being held during the 60-day public ...\n\n\nMay 23, 2007 Transmission & Distribution World\n\n\n\nTVA restarts nuclear reactor after shutdown of 22 years\n\n\n\nBIRMINGHAM -- The Tennessee Valley Authority restarted the third and final reactor at its Browns Ferry Nuclear Plant early Tuesday, ending a 22-year shutdown prompted by safety concerns at what was once America's largest nuclear plant.TVA, the nation's largest public utility, said the restart capped an exhaustive program that brought the reactor up to modern standards.\n\n\nMay 23, 2007 Montgomery Advertiser\n\n\n\nRockwood contracts with Salt River Project for two COSR systems\n\n\n\n-- The Salt River Project of Phoenix, AZ has awarded Rockwood Materials Handling the contract to supply two Circular Overpile Stacker/Reclaimers (COSR) handling PRB Coal for the Springerville Unit 4 Plant in Springerville, AZ, which began construction in February. The Springerville Generating Station is a coal-fired power plant that supplies power to Tucson Electric Power, Tri-State Generation & ...\n\n\nMay 24, 2007 Power Engineering\n\n\n\n\n\nXcel Energy Inc. Board Increases Common Dividend 3.4 Percent, Declares Dividend on All Outstanding Preferred Stock\n\n\n\nMINNEAPOLIS--(BUSINESS WIRE)--The Xcel Energy Inc. (NYSE:XEL) board of directors today raised the quarterly dividend on the companys common stock from 22.25 cents per share to 23 cents per share, which is equivalent to an annual rate of 92 cents per share. Based on Xcel Energys closing price on May 22, this would result in a dividend yield of 3.8 percent. The board declared the second quarter ...\n\n\nMay 23, 2007 Business Wire\n\n\n\nEnergy Savings Income Fund Announces June Distribution\n\n\n\nEnergy Savings Income Fund (TSX: SIF.UN) filed notice with the Toronto Stock Exchange today announcing its June distribution. A distribution of $0.09292/unit will be paid on June 30, 2007 to Unitholders of record at the close of business on June15th, 2007. The Units trade on the Toronto Stock Exchange under the symbol \"SIF.UN\".  Energy Savings Income Fund (TSX: SIF.UN) filed notice with the ...\n\n\nMay 24, 2007 Internet Wire\n\n\n\nSpectra Energy Plans Annual Shareholders Meeting in October\n\n\n\nHOUSTON, May 23 /PRNewswire-FirstCall/ -- Spectra Energy Corp expects to hold its first annual shareholders meeting in October in Houston. The place, date and time of the meeting will be announced later. (Logo: http://www.newscom.com/cgi-bin/prnh/20061030/CLM051LOGO ) Spectra Energy Corp has established a June 25, 2007, deadline for receipt of shareholder proposals to be included in the company's ...\n\n\nMay 23, 2007 PR Newswire\n\n\n\nBaltimore Gas and Electric Company to Begin Communicating Customer Options Related to Today's Public Service Commission-Approved Plan for Transitioning to Market-Based Pricing\n\n\n\nBaltimore Gas and Electric Company (BGE), a subsidiary of Constellation Energy (NYSE: CEG), today announced that residential customers can expect to receive information through the mail within a week to 10 days regarding the details of its next Rate Stabilization Plan, approved today by the Maryland Public Service Commission (PSC). The information will also be available through BGE.com, the ...\n\n\nMay 23, 2007 PR Newswire\n\n\n\nGE Unit Expands Renewable Energy Holdings with Investment in Airtricity's Roscoe, Texas, Wind Farm\n\n\n\nUNIVERSAL CITY, Calif. & ROSCOE, Texas--(BUSINESS WIRE)--GE Energy Financial Services, a unit of General Electric (NYSE: GE), is expanding its wind energy portfolio by agreeing to invest in a 209-megawatt project under construction by Airtricity, Inc. in West Texas. The announcement was made today at Universal Studios California at GEs Green is Universal exhibition, a celebration of GE customers ...\n\n\nMay 24, 2007 Business Wire\n\n\n\nAir Products' Hydrogen Technology Now Operating in Chevron Hydrogen Company's Orlando, Florida Demonstration Fueling Station\n\n\n\nLEHIGH VALLEY, Pa., May 24 /PRNewswire-FirstCall/ -- Air Products' (NYSE: APD) hydrogen technology was officially put into operation this week in Orlando, Florida. Designed and constructed by Chevron Hydrogen Company, a division of Chevron U.S.A. Inc., the hydrogen fueling station is located near the Orlando Airport and will fuel a fleet of shuttle buses powered by modified internal combustion ...\n\n\nMay 24, 2007 PR Newswire\n\n\n\nAllegheny Announces West Virginia Rate Case Decision\n\n\n\nGREENSBURG, Pa.--(BUSINESS WIRE)--Allegheny Energy, Inc. (NYSE:AYE) today announced that the Public Service Commission of West Virginia issued an order regarding the companys July 2006 rate request. In its July 2006 filing with the Commission, Allegheny had requested, for its Monongahela Power and Potomac Edison subsidiaries: a $100 million revenue increase, consisting of a $126 million increase ...\n\n\nMay 23, 2007 Business Wire\n\n\n\nUSG Corporation Registers New Headquarters Office as LEED for Commercial Interiors Space\n\n\n\nCHICAGO--(BUSINESS WIRE)--USG Corporation (NYSE:USG) today announced that it has registered its new headquarters, 550 W. Adams St., as LEED for Commercials Interiors (CI) registered space, the U.S. Green Building Councils voluntary rating standard for green design and construction of tenant improvements. USG is seeking LEED-CI Gold certification, joining a select group of environmentally-friendly ...\n\n\nMay 23, 2007 Business Wire\n\n\n\n\n\nFERC Acts On Long-Term Transmission Rights In Midwest ISO And PJM Territories\n\n\n\nThe Federal Energy Regulatory Commission largely approved two orders on long-term transmission rights (LTTRs) in two broad regions that will help set the stage for planning and expansion of the transmission grid. Long-term transmission rights are also critical to utilities' wholesale customers for planning purposes and in providing price certainty. \"Today's action approving the establishment of ...\n\n\nMay 23, 2007 Power Online\n\n\n\nReliant Energy to restructure finances to cut interest, debt\n\n\n\nReliant Energy said it is undertaking a broad refinancing program designed to cut interest expenses and lower debt levels. The Houston-based company late Wednesday also said the plan will boost it ability to 'reinvest in the business and return cash to shareholders.' Reliant, which owns 16,000 MW of generating capacity across the US, and which serves 1.9 million retail customers--said that as ...\n\n\nMay 24, 2007 Platts\n\n\n\nWUTC staff recommends $2 mil penalty against Puget Sound Energy\n\n\n\nWashington (Platts)--24May2007  The Washington Utilities and Transportation Commission staff has recommended the agency fine Puget Sound Energy $2 million for failing to keep accurate and complete records of suspected gas leaks. After reviewing PSE's natural-gas pipeline inspection records over a five-year period, the agency on Wednesday said its staff alleged PSE's contractor, Pilchuck ...\n\n\nMay 24, 2007 Platts\n\n\n\nVerve Energy considers south coast wind farm options\n\n\n\nA representative of power generator Verve Energy visited the south coast last week to investigate the possibility of establishing a new wind farm. With the agreement of mining company Grange Resources, Verve Energy is looking at the option of building a wind farm between Albany and Wellstead. Grange Resources is considering power supply options for its proposed mining operation at Wellstead.\n\n\nMay 23, 2007 ABC Online\n\n\n\nNorthWestern says Montana PSC may reject Babcock & Brown deal\n\n\n\nThe Montana Public Service Commission has directed its staff to prepare a draft order denying Babcock &amp; Brown Infrastructure's planned $2.2 billion purchase of natural gas and electric utility NorthWestern, the utility said late Tuesday. The draft order could be presented to the PSC for a vote in late June, said NorthWestern, which is based in Sioux Falls, South Dakota.\n\n\nMay 24, 2007 Platts\n\n\n\nJPMorgan in alternative energy push\n\n\n\nJPMorgan, seeking to capitalise on the boom in environmentally friendly technologies, has established an alternative energy investment banking unit and hired a former executive from General Electric to run it.In an internal memo sent to staff this week, JPMorgan said it had hired Vandana Gupta from General Electric to head the new effort. At GE, Ms Gupta managed $1bn in equity investments in the ...\n\n\nMay 23, 2007 MSNBC\n\n\n\nCNX Gas says property rights upheld\n\n\n\nCNX Gas Corp. said a Virginia court ruled in its favor in a lawsuit filed by GeoMet Inc. The Circuit Court for Buchanan County, Virginia ordered that South Park-based CNX Gas (NYSE:CXG) has the exclusive right to construct pipelines and transport gas across the leased premises in southwest Virginia and that GeoMet does not have the right to construct pipelines or transport gas on the property, ...\n\n\nMay 24, 2007 Pittsburgh Business Times\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nSparton's Secondary Uranium Recovery Program Expands Into Central Europe\n\n\n\nSparton Resources Inc. (TSX VENTURE: SRI) (the \"Company\") reported today that has signed a Memorandum of Understanding (\"MOU\") with WildHorse Energy Limited (ASX: WHE) (\"WHE\") of Perth Australia to evaluate the possibility of extracting commercial quantities of uranium from radioactive waste ash generated by many large central European power stations which burn high uranium content lignitic or ...\n\n\nMay 24, 2007 Internet Wire\n\n\n\nSpectacular Growth of the Green Energy Market\n\n\n\nThe Green Energy sector is growing at breathtaking speed, driven by the challenges of climate change, surely unprecedented in our time. Globally, it has already become a multi-billion dollar industry, with very high growth potential which is attracting record investment. Over the last few years, eco-industries in the European Union have grown to such an extent that they have now become a ...\n\n\nMay 23, 2007 PR Newswire\n\n\n\nEnergy market at critical juncture, Ben-Eliezer says\n\n\n\nIsrael will focus on alternative energy as a major power source as it faces a critical point in the market, National Infrastructures Minister Binyamin Ben-Eliezer said at a meeting of the country's energy council in Ramat Gan this week. 'We are standing at a critical juncture for the energy market of the country and now is the time to take the necessary steps to ensure that we have sufficient ...\n\n\nMay 24, 2007 Jerusalem Post\n\n\n\nCORRECTED: UK to bury old nuclear plants\n\n\n\n(Corrects plants capacity to 435 megawatts from 340 megawatts) OLDBURY POWER STATION (Reuters) - Warm pipes in the reactor building and the quiet hum of a turbine are signs of the powerful chain reaction taking place at Oldbury nuclear power station, but it will not be operating much longer. All but one of Britain's nuclear power stations will be shut by 2023, and the government insists it must ...\n\n\nMay 23, 2007 Scientific American\n\n\n\nAnalysis: India to buy wind technology\n\n\n\nNEW DELHI, May 23 (UPI) --  An Indian parliamentary standing committee has asked the government to explore the possibility of buying wind technology from abroad to tap wind energy potential in the country. The government-backed committee on energy criticized the Ministry of New and Renewable Energy for poor use of funds allocated to it during the 10th five-year plan, which led the Finance ...\n\n\nMay 23, 2007 Washington Times\n\n\n\nFrost & Sullivan Reports Dramatic Green Energy Growth\n\n\n\n-- In a release issued today, global analyst firm Frost & Sullivan reports that the worldwide green energy sector is growing at breathtaking speed, driven by the unprecedented challenges such as climate change. As might be expected with economic development of this stature, Frost & Sullivan experts are analyzing all the key segments of this market, both in Europe and globally.\n\n\nMay 23, 2007 Industry Week\n\n\n\nBritain sets out plans to secure energy and fight warming\n\n\n\nLONDON: Britain on Wednesday set out plans to secure energy supplies and fight global warming, calling for new nuclear power plants, more renewable energy and greater efficiency. The nuclear call was met with cheers from utility companies but jeers from environmentalists, although some welcomed the emphasis on renewable energy. Britain's oil and gas reserves from the North Sea are dwindling, the ...\n\n\nMay 23, 2007 International Herald Tribune\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}