{"category": "ham", "to_address": "Christopher Blizzard <blizzard@redhat.com>", "from_address": "Marco Pesenti Gritti <mpg@redhat.com>", "subject": "Re: [sugar] upcoming goals for sugar for april and may", "body": "On Tue, 2007-04-03 at 15:05 -0400, Christopher Blizzard wrote:\n> Hi, folks!  Yesterday most of the sugar team and I sat down and tried to\n> hash out what we thought were reasonable goals for the upcoming month.\n> In attendance were myself, Eben, Dan, Daf, Robert McQueen, Tomeu and\n> Marco.  Highlights are included here:\n> \n> SCHEDULE\n> ========\n> \n> We talked a bit about schedule.  Everyone thought that sticking to a one\n> month development cycle seemed to work out pretty well.  That is, spend\n> about 3 weeks doing development and about a week of stabilizing coming\n> to a stable release at the end of a calendar month.  So based on that\n> our \"April Goals\" are goals that we hope to include in a build available\n> at the end of April.\n> \n> HIGHLIGHTS\n> ==========\n> \n> Here are the list of items that we decided were important for April:\n> \n> 1. Mime types as activity attributes.  Right now there's a hard coded\n> list in sugar of mime types -> activities.  These include pdf, html,\n> images, etc.  We need to make sure that that's part of the attributes\n> for an activity bundle so that we don't have to have that static list.\n> For example, this should let the helix guys install their app without\n> having to ask us first.\n> \n> 2. Person to person chat.  This will use an XMPP server as the\n> transport.  Should be simple enough to hook up to any chat server,\n> including the school server, google or some other server out there.\n> Collabora has a server set up for us to test against.\n> \n> 3. Group chat.  Based on the discussion in the room it's pretty clear\n> that there's a decent amount of design work that needs to go on here.\n> Might be chat rooms on a server, might be based around activities (as\n> per the original design) might be something else.  Eben and others will\n> work on this during the month.  Not sure how far we'll get but it would\n> be great if we can get something like this working.\n> \n> 4. Working Journal and app integration.  This is the most important\n> thing that we'll be doing during the month of April.  It's also the\n> highest risk.  Our data store story is weak and Marco didn't think that\n> April was going to be enough time to get everything done.  So the\n> strategy is to get as much working as possible and maybe we'll end up\n> with some apps in the Journal and some apps out of it.  Eben pointed out\n> that if we hooked it up in such a way as it would work with the current\n> save/open buttons/arch it might make things smoother.\n> \n> In any case, we need to get this going again as it's a huge part of our\n> story and is required to make the project a success.  So we're going to\n> be spending a lot of our time on it.\n> \n> 5. Video chat app.  This is a killer app for us.  The Collabora guys\n> will be handling a lot of the work here.  We have all the pieces that we\n> need, but we're lacking a design.  Eben will work on a simple design so\n> we can at least get a point to point connection (i.e. entering an IP\n> address/hostname) going or using XMPP as the startup mechanism, ala\n> gtalk.  We hope it will be useful, more than just demo-ware.\n> \n> 6. Simple sample tubes apps.  The Collabora guys have just gotten app\n> communication over XMPP working which is the first step to setting up\n> some a very easy mechanism for activity writers to be able to\n> communicate between activities.  We'll need to do a couple of sample\n> apps that show how this will work.  The two activities that we\n> identified as good examples are Erik's camera app and the block party\n> app.  The camera app is great because it's about sharing things that\n> kids are creating and the block party app has gone through a few\n> revisions and will be the basis for a \"howto\" on how to write a full\n> fledged mesh-aware activity.\n> \n> 7. Be able to download and install an activity from the web.  Eventually\n> we'll have a safer mechanism for doing this, but for now it would be\n> great if we had the ability to unzip an archive, drop it in the right\n> directory and ask the sugar-shell to reload the list of activities.\n> Marco says that a lot of this is in place today, but it will still need\n> some work.\n> \n> 8. Grab scrolling.  That hand key is on the keyboard and we should be\n> using it.\n> \n> 9. XO in the middle of the mesh view.  This is pretty minor but\n> completes the zoom experience.\n> \n> 10. Some kind of mesh search.\n\nI've been working a lot on the object types system and started the\nimplementation.\n\nI figured out it's strongly dependent on the Journal though, so we need\nfirst to get that in place and then we can rework clipboard, downloads\nand integrate them with the new object type system.\n\nMarco\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}