{"category": "spam", "to_address": "Mail <mail@flax9.uwaterloo.ca>", "from_address": "Amy Gould <istim@goodstar.com>", "subject": "Master Penis", "body": "\n\nDo you have problems with prescriptions?\nClick here to have a nice dick\nThere is no need to parade your problems. There is no need to visit your local drug store. Cheapest Viagra and Cialis you can find! \nClick here to be the best lover in the world!\nMake the right choice!\nWith best regards,\nAmy Gould\n \n \nOstalnye Vygliadeli ne luchshe. Est chto-to v nem nehoroshee, trevozhnoe. chuzhoj, my v gorode, hriplo progovoril prygun, narushiv obshchee Molchanie. Legche mne ot etogo soobshcheniia ne stalo. \nVsia ego malenkaia puhlaia figura vdrug Nalilas strannoj, nebyvaloj moshchiu. Pytaias okonchatelno razobratsia v svoih oshchushcheniia, ia prishel k vyvodu, chto Vziarilsia ne stolko na etogo neschastnogo s narezki menia zastavil sojti Vzryv podsoznatelnogo, idushchego iz glubin estestva straha. S kakim naslazhdeniem ia by sejchas smyl s tela Dvuhdnevnuiu griaz, perekusil i vyspalsia po-chelovecheski. Edinstvennoe, chto mozhet peshij Protivopostavit takomu vsadniku, estestvenno, v zavisimosti ot podgotovki, Bolshuiu manevrennost. Padalyciki vse-taki. Glaza Svetlo-golubye, otsvechivaiushchie iznutri staliu, ochen holodnye, vzgliad lishen Emocionalnoj okraski, verhniaia cheliust nemnogo vystupaet vpered. I lish izriadnym usiliem Voli sohranil na lice prezhnee nedoumevaiushchee vyrazhenie, svidetelstvuiushchee o moej Nevinovnosti. Korotkij zloveshchij svist Proshivshego ego plecho stalnogo bolta razvernul ego vokrug osi i shvyrnul na Koleni. \nNogi nizhe kolen skrylis v sheveliashchemsia Kondensate, kazalos, sleduiushchij shag okazhetsia shagom v bezdnu. Pozdnee llery, vkusivshie Leshu, sozdali Iz nego religioznyj kult i vozdvigli vokrug ostankov Frajdy hram pokloneniia Masteru, a sebia narekli posledovateliami Frajda frajdenami. Poetomu zhenshchiny, krome sluzhanok, ili krasnyh iubok, kak nazyvali ih za Formennuiu odezhdu, pridumannuiu Bilokom ne bez podachi Namestnika, siuda ne Dopuskalis. Nado mnoj raskinulsia prostornyj silovoj kolpak diametrom metrov v dvadcat i Vysotoj v piat. ejisuminyon XFNaWHVCQlZRUUgcRkNURVdBWFpeHFBV\n \n\n\n"}