{"category": "ham", "to_address": "Jeff Layton <jlayton@redhat.com>", "from_address": "\"Steve French (smfltc)\" <smfltc@us.ibm.com>", "subject": "Re: [PATCH] CIFS: make sec=none force an anonymous mount", "body": "Jeff Layton wrote:\n\n>On Fri, May 04, 2007 at 10:26:29AM -0500, Steve French (smfltc) wrote:\n>  \n>\n>>Jeff Layton wrote:\n>>    \n>>\n>>>We had a customer report that attempting to make CIFS mount with a null\n>>>username (i.e. doing an anonymous mount) doesn't work. Looking through the\n>>>code, it looks like CIFS expects a NULL username from userspace in order\n>>>to trigger an anonymous mount. The mount.cifs code doesn't seem to ever\n>>>pass a null username to the kernel, however.\n>>>      \n>>>\n>>Yes - cifs kernel code expects a NULL username (e.g. \"username=\") if \n>>you really don't want to pass the default username of the uid of \n>>the current process and you don't set the username explicitly\n>>(e.g. in a credential file or mount parameter).\n>>\n>>Samba userspace tools (and smbfs) handled this by first trying to\n>>setup the SMB session using the default user, and if that fails \n>>with access denied then retrying sessionsetup with a null username \n>>string.  This would be easy to change in mount.cifs (ie as long \n>>as username was not explicitly passed on mount then if mount fails\n>>with access denied simply add a retry with \"username=\").  This was\n>>discussed at SambaXP.\n>>\n>>    \n>>\n>\n>Does this mean you're NAK'ing this patch in favor of a userspace fix? My\n>perspective is that if someone explicitly requests sec=none, then we ought\n>to do an anonymous mount regardless of how the username is set. Would\n>you agree that that behavior is what you would want?\n>\n>\n>  \n>\nYour patch is probably ok to add, although I would like to see if any of \nthe other Samba team\nhad thoughts on this, as \"null user\" sessions are a fairly obscure part \nof the protocol.  But\neven with the kernel change, mount.cifs also should change for a loosely \nrelated case that of\n    1) sec=none is not specified by the user\n    2) but username also is not specified explicitly\nFor that case we need to retry on access denied as if it were a request \nfor a \"null user\" mount\nie send sec=none (or equivalently username=) the 2nd time.  This gets \nmore complicated\nsince mount.cifs also has to retry on a couple of other cases (e.g. when \nthe server does\nnot support port 445 but does not take the standard server string \n\"*SMBSERVER\"\non the RFC1001 called name).\n\nIf there are no objections from any of the other Samba guys I will take \nyour patch which has\nthe effect of treating \"sec=none\" as meaning \"ingore any userid if \nspecified, and set the username to null\non the session setup\").   That is consistent with what we documented.\n\nI had though for a while that a user who mounts passing both \"sec=none\" \nand a username might\nalso expect to get a null password (they could have done this with \n\"guest\" or with \"password=\") or\nmight want to try to send the password in plaintext - but I doubt that \nwe want to support\na user who wants to send the password plaintext without the server \nrequiring it (and in that\ncase cifs can be built and configured to allow plaintext if absolutely \nnecessary to support\nthose ancient servers).\n\n\nBasically if we set username to null in kernel when (sec=none)\n\n>Thanks,\n>Jeff\n>\n>  \n>\n\n"}