{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "bifurcate: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Friday, June 29, 2007\nbifurcate \\BY-fur-kayt; by-FUR-kayt\\, transitive verb:\n1. To divide into two branches or parts.\n2. To branch or separate into two parts.\n3. Divided into two branches or parts; forked.\nThere it was, a sliver of a million-dollar view: the red towers of the Golden Gate Bridge that bifurcated the waters, marking bay from ocean. -- Amy Tan, The Bonesetter's Daughter\nThey were strolling up the paved walk which bifurcated the rolling front lawn of her house. -- Erik Tarloff, The Man Who Wrote the Book\nIncreasingly, Canadian teachers are a bifurcated group -- either relative newcomers to the profession or experienced veterans. -- Heather-Jane Robertson, \"The Devil's in the Demographics.\", Phi Delta Kappan, January 1999\nPeed Onk is bravura writing -- the narrative bifurcates, offering exterior realism and the interior torment of the Mother. -- Jon Saari, \"Books\", Antioch Review, Spring 1999\nRiven continually confronts us with . . . visual echoes of its name, such as the giant dagger thrust into the landscape at one point, or the plate-tectonic fracturing of islands out of an implied unity, or even the bifurcate wing cases of the aptly named Riven beetles. -- Stuart Moulthrop, \"Misadventure: Future Fiction and the New Networks\", Style, Summer 1999\nBifurcate comes from the past participle of Medieval Latin bifurcare, \"to divide,\" from Latin bifurcus, \"two-pronged,\" from bi- + furca, \"fork.\"\nDictionary.com Entry and Pronunciation for bifurcate\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-10109576-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}