{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nA prescription drug that’s been taken by more\n  than 6 million people has been linked to a significantly higher risk of heart\n  attack – and even death. Wyatt Andrews will report on the new analysis\n  of Avandia and our medical correspondent Dr. Jon LaPook will explain what this\n  news means to families who deal with type 2 diabetes.\n \nIn other medical news, a new pill is promising birth\n  control with a boost. It could be relief for women from the pains and\n  inconveniences of their menstrual cycles. It is due to debut tomorrow but as\n  Michelle Miller will report, but its long-term safety isn’t clear.\n \nGas prices have broken the record for high prices\n  set during the energy crisis of the early 1980s – when they are\n  adjusted for inflation – until now. Anthony Mason will report on how\n  tight refinery capacity is the latest cause of high prices at the pump and\n  Byron Pitts will have the story of how gasoline costs are affecting\n  consumers.\n \nTension in the Middle East can be another factor in\n  high gas prices and over the past two days violent urban warfare has erupted\n  in Lebanon.\n  Intense fighting between Lebanese troops and Islamic militants suspected of\n  having ties to al Qaeda has killed dozens of people. Mark Phillips will have\n  the story.\n \nSome great citizens of the country are being lauded\n  for their valor in the wake of Hurricane Katrina. Today one relatively\n  unknown name is being added to the list of John F. Kennedy “Profile in\n  Courage Award” recipients, which includes the likes of Kofi Annan and\n  Gerald Ford. Her name is Doris Voitier. Haven’t heard of her? Correspondent\n  Kelly Cobiella will introduce you to this special woman tonight.\n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}