{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Charlie Gibson = Al Gore", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nABC's \n      Math: Comfort and Familiarity = SuccessFamiliarity and traditional appeal are important concepts when it comes to \n      talking about the older audience that watches network evening newscasts. \n      As with Micheal Kinsley’s famous quip about Al Gore – he called the former \n      Veep “an old person’s idea of a young person” —\nCharlie Gibson is an old person’s idea of a network anchor. [+ Read More]\n\nThere's \n      Still a “Too Far” in Satellite RadioFor years the FCC has had the role of \n      school principal, scolding and punishing unruly behavior on-air – as \n      listeners (and advertisers) enjoyed seeing just how far radio \n      personalities could push the envelope from day to day. But what the Opie \n      and Anthony suspension teaches us is that even though the FCC can’t reel \n      in \"shock jocks\" when they are on satellite radio, there are still \n      boundaries. [+ Read More]\n\nIn \n      Defense of EditorialsI’ve always known I have an old soul. \n      Watching old Chaplin flicks, hanging on to those vinyl records, calling \n      cars ‘tin lizzies.’ (Okay, maybe not that last one.) But this week’s PR \n      Week piece suggesting that editorials were \n      going the way of the dinosaur had me grumbling like Grampa Simpson. [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nA \n      World Without Chris Matthews\n \nThe \n      Real Internet Menace\n \nDon't \n      Wake Up, Congressman. You're Not On TV Yet.\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}