{"category": "ham", "to_address": "Greg Snow <Greg.Snow@intermountainmail.org>", "from_address": "Mike Lawrence <Mike.Lawrence@dal.ca>", "subject": "Re: [R] opinions please: text editors and reporting/Sweave?", "body": "One minor warning regarding LaTeX: I have encountered journals in the  \npsychological field (specifically, journals of the psychonomic  \nsociety) that refuse to accept articles prepared in LaTeX, even if  \nthey are submitted as PDF. I'm a big LaTeX fan myself, so I really  \ncan't comprehend this.\n\nOn 30-May-07, at 6:07 PM, Greg Snow wrote:\n\n> Tim,\n>\n> First, I personnally am a big fan of LaTeX, Emacs, and ESS and I think\n> that in the long run you would benefit from learning all of them\n> (probably start with Emacs, then ESS, then LaTeX once you already  \n> have a\n> knowledge of Emacs and how it can help).\n>\n> Since you asked about the simplest way to go, you may want to look at\n> the odfWeave package.  This gives you the power of Sweave, but without\n> having to learn LaTeX.  It works with documents in openoffice (a free\n> office suite similar to and mostly compatible with microsoft office\n> (word)).  Using this you can create your template using openoffice\n> writer (or MS word, then convert using openoffice), run it through\n> R/odfWeave, and have the result as another openoffice document that  \n> can\n> then be converted to MS word or pdf.\n>\n> Personally, if I am doing something for myself, or in which the output\n> format does not matter, then I use Sweave with LaTeX (using Emacs and\n> ESS).  But, often my results need to be sent to a client that will cut\n> and past my results into an MS word document or power point\n> presentation.  Then I find it easier to use openoffice and odfWeave  \n> and\n> have the end result be an MS word document that can be e-mailed to the\n> client for them to mangle in ways they feel the need to.\n>\n> (there is also an HTML driver for Sweave I nthe the R2HTML package  \n> where\n> you can have the template file resemble html and the final output  \n> is in\n> html)\n>\n> Hope this helps,\n>\n> -- \n> Gregory (Greg) L. Snow Ph.D.\n> Statistical Data Center\n> Intermountain Healthcare\n> greg.snow@intermountainmail.org\n> (801) 408-8111\n>\n>\n>\n>> -----Original Message-----\n>> From: r-help-bounces@stat.math.ethz.ch\n>> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Tim Howard\n>> Sent: Wednesday, May 30, 2007 2:43 PM\n>> To: r-help@stat.math.ethz.ch\n>> Subject: [R] opinions please: text editors and reporting/Sweave?\n>>\n>> dear all -\n>>\n>> I currently use Tinn-R as my text editor to work with code\n>> that I submit to R, with some output dumped to text files,\n>> some images dumped to pdf. (system: Windows 2K and XP, R\n>> 2.4.1 and R 2.5). We are using R for overnight runs to create\n>> large output data files for GIS, but then I need simple\n>> output reports for analysis results for each separate data\n>> set. Thus, I create many reports of the same style, but just\n>> based on different input data.\n>>\n>> I am recognizing that I need a better reporting system, so\n>> that I can create clean reports for each separate R run. This\n>> obviously means using Sweave and some implementation of\n>> LaTex, both of which are new to me. I've installed MikTex and\n>> successfully completed a demo or two for creating pdfs from raw  \n>> LaTeX.\n>>\n>> It appears that if I want to ease my entry into the world of\n>> LaTeX, I might need to switch editors to something like Emacs\n>> (I read somewhere that Emacs helps with the TeX markup?).\n>> After quite a while wallowing at the Emacs site, I am finding\n>> that ESS is well integrated with R and might be the way to\n>> go. Aaaagh... I'm in way over my head!\n>>\n>> My questions:\n>>\n>> What, in your opinion, is the simplest way to integrate text\n>> and graphics reports into a single report such as a pdf file.\n>>\n>> If the answer to this is LaTeX and Sweave, is it difficult to\n>> use a text editor such as Tinn-R or would you strongly\n>> recommend I leave behind Tinn and move over to an editor that\n>> has more LaTeX help?\n>>\n>> In reading over Friedrich Leisch's \"Sweave User Manual\" (v\n>> 1.6.0) I am beginning to think I can do everything I need\n>> with my simple editor. Before spending many hours going down\n>> that path, I thought it prudent to ask the R community.\n>>\n>> It is likely I am misunderstanding some of the process here\n>> and any clarifications are welcome.\n>>\n>> Thank you in advance for any thoughts.\n>> Tim Howard\n>>\n>> ______________________________________________\n>> R-help@stat.math.ethz.ch mailing list\n>> https://stat.ethz.ch/mailman/listinfo/r-help\n>> PLEASE do read the posting guide\n>> http://www.R-project.org/posting-guide.html\n>> and provide commented, minimal, self-contained, reproducible code.\n>>\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting- \n> guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n\n--\nMike Lawrence\nGraduate Student, Department of Psychology, Dalhousie University\n\nWebsite: http://myweb.dal.ca/mc973993\nPublic calendar: http://icalx.com/public/informavore/Public\n\n\"The road to wisdom? Well, it's plain and simple to express:\nErr and err and err again, but less and less and less.\"\n\t- Piet Hein\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}