{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "920p 6/11 Update: Mission extended, EVA added; blanket repair ordered", "body": "\n\n\n\n\n920p 6/11 Update: Mission extended, EVA added; blanket repair ordered\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 41\nPosted: 9:12 PM, 6/11/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-38 (06/11/07): Astronauts gear up for spacewalk, solar array install\n   SR-39 (06/11/07): S3/S4 bolted to station power truss\n   SR-40 (06/11/07): Spacewalk begins\n   SR-41 (06/11/07): Shuttle mission extended two days; fourth spacewalk added; blanket repair ordered\n\n=================================\n\n9:12 PM, 6/11/07, Update: Shuttle mission extended two days; fourth spacewalk added; blanket repair ordered\n\nNASA's Mission Management Team decided today to extend the shuttle Atlantis' mission by two days and to add a fourth spacewalk Sunday. That will give the astronauts enough time to complete their space station assembly tasks and fix a pulled-up insulation blanket on one of the ship's aft rocket pods. Flight controllers plan to make a decision Tuesday on whether to add the blanket repair to the third or fourth spacewalk.\n\n\"Based on our analysis today, we have upped our desire to fix this,\" said John Shannon, chairman of NASA's Mission Management Team. \"We were looking at flight history, saying this doesn't look like a big deal. Then you go look at your analysis tools and say hey, I could really damage the top surface of my structure and I sure don't want to do that. So let's go have a good effort to repair it before we come home.\"\n\nLanding at the Kennedy Space Center now is targeted for around 1:54 p.m. on June 21.\n\nThe protruding insulation was spotted by the shuttle astronauts during a routine post-launch payload bay survey using the shuttle's robot arm. A camera on the arm spotted a triangular 4-inch by 6-inch corner of a two-inch-thick insulation blanket that was sticking up and bent back. Engineers later concluded air rushing over the rocket pod during the shuttle 's climb out of the lower atmosphere worked its way into a corner or seam and peeled the blanket back.\n\nThe concern is that hot air during re-entry could damage the underlying graphite epoxy structure of the left-side Orbital Maneuvering System rocket pod. During the 15 minutes or so of peak heating, the temperatures on the OMS pods reach 700 to 1,000 degree Fahrenheit. While engineers do not view this as a life-or-death sort of problem - shuttles have safely returned to Earth with much more serious OMS pod damage - there are enough unknowns to prompt caution.\n\n\"We have limitations in our ability to analyze this,\" Shannon said. \"You're going to have a temperature that exceeds that top face coat capability. How long it would take to completely erode is very questionable, no one could give me that answer. So the right answer here, the better part of valor, was to go and put it down and secure it.\"\n\nAt the extreme altitude of peak heating, there is little aerodynamic pressure, Shannon said, and simply folding the corner back down and tucking it in might be sufficient. Engineers are still assessing techniques for securing the blanket if necessary.\n\nEngineers used post-Columbia software to model what might happen if the blanket ripped away during the later stages of the descent, when the airflow is stronger, and concluded it would not hit the shuttle.\n\nAs it turns out the material used in the blanket will make the fix relatively straight forward.\n\n\"If you take this blanket and you pull it up like the wind is hitting it, it'll stay up like that,\" Shannon said. \"It's got some memory. But when you push it back down, it stays down. That's something we're kind of counting on. We think the astronauts will be able to go out there and just push this right back down. They're working right now different ways to attach it to the blanket that's laying beside it or maybe to attach it to the tile face that's in front of it.\"\n\nThe repair work is expected to take 90 minutes to two hours to complete. An astronaut, his feet anchored to an extension on the end of the shuttle's robot arm, will be maneuvered back to the left-side OMS pod and push the flap down.\n\nIt may be possible to attempt the repair during the crew's third spacewalk Friday, but that would require a major push to complete the procedures in time.\n\nBy adding a fourth spacewalk, mission managers can preserve their options for dealing with the blanket and any problems that might develop later this week when flight controllers attempt to retract the P6-2B solar array.\n\nThe P6 arrays provided the initial power to U.S. modules during the early phases of construction. Now, P6 needs to be retracted, moved out to its permanent location on the left end of the station's main solar power truss and re-extended.\n\nShuttle astronauts ran into major problems retracting the P6-4B solar blanket last December and the Atlantis astronauts may have similar problems with the P6-2B wing that is still extended. Flight controllers will begin retraction procedures Wednesday and astronauts Steve Swanson and Patrick Forrester will be standing by to assist if necessary.\n\nAdditional P6-2B retraction time is built into a third spacewalk Friday. With the decision to fix the pulled-up blanket, NASA managers opted to add a fourth spacewalk to ensure enough EVA time is available to handle the repair and any problems that might crop up during the P6 retraction.\n\n\"It was a very easy decision,\" Shannon said.\n\nHe added that engineers have completed their initial assessment of Atlantis' nose cap, wing leading edge panels and heat shield tiles and found no other issues that require any attention.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}