{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Google Alerts <googlealerts-noreply@google.com>", "subject": "Google Alert - bush", "body": "\nGoogle News Alert for: bush\n\n\nPresident Bush Pushes Overhaul of Immigration Law\nNewsHour Extra - USA\nPresident Bush traveled to Yuma, Ariz., Monday to inspect border\nsecurity measures and outline his new plan for immigration reform.\n...\n\nSee all stories on this topic\n\n\nPolitico falsely reported Bush invited Dems to \"negotiate\" war ...\nMedia Matters for America - Washington,DC,USA\nAn April 10 Politico article regarding the standoff between President\nBush and Congress over war funding reported that Bush\n\"call[ed] on Senate Majority ...\n\nSee all stories on this topic\n\n\nStrickland urges Bush to ensure proper training for Guard\nCoshocton Tribune - Coshocton,OH,USA\nIn a Tuesday letter to President Bush, Strickland said the unit\nwasn't in line for its next mobilization until 2009. \"This is a\nsignificant departure from ...\n\nSee all stories on this topic\n\n\nMcCain, his campaign ailing, backs Bush Iraq plan\nReuters AlertNet - London,England,UK\nMcCain has staked his campaign on the success of Bush's strategy\nof building up forces in Baghdad to restore security in the city and\neventually allow an ...\n\nSee all stories on this topic\n\n\nGovernors Blast Bush over National Guard Deployments: Bad for ...\nBuzzFlash - Chicago,IL,USA\nGovernors across the nation are lambasting President Bush for\nordering over 12000 National Guard soldiers to Iraq later this year. The\ndeployments will not ...\n\nSee all stories on this topic\n\n\nBush opponents mull Iran trip\nRaw Story - Cambridge,MA,USA\nPresident George W. Bush found himself battling another diplomatic\nchallenge from congressional opponents Wednesday as top Democratic\nlawmakers mulled a ...\n\nSee all stories on this topic\n\n\nUS Senate set to defy Bush on stem-cell research\nRaw Story - Cambridge,MA,USA\nThe US Senate was Wednesday set to adopt a bill to fund controversial\nembryonic stem-cell research, braving a new battle with President George W.\nBush who ...\n\nSee all stories on this topic\n\n\nAndy Borowitz: Bush Fires Senate Judiciary Committee\nYubaNet (satire) - Nevada City,CA,USA\nIn a move that seems guaranteed to create more controversy for his\nembattled administration, President George W. Bush today fired the\nentire Senate ...\n\nSee all stories on this topic\n\n\nCastro Blasts Bush Decision To Release Convicted Terrorist, Luis ...\nAll Headline News - USA\nHavana, Cuba (AHN) - On Tuesday Cuba's ailing leader Fidel Castro\naccused the Bush Administration of having ordered the release of a\nconvicted terrorist. ...\n\nSee all stories on this topic\n\n\nBush struggles to find war tsar to oversee Iraq and Afghanistan\nGuardian Unlimited - UK\nThe deputy White House spokeswoman, Dana Perino, confirmed today that\nGeorge Bush was considering restructuring the administration to\ncreate a new post, ...\n\nSee all stories on this topic\nGoogle Blogs Alert for: bush\n\n\nChieftain uncritically reported President Bush's criticisms of ...\n\nAn April 7 Pueblo Chieftain article uncritically quoted President Bush's criticism of congressional Democrats \"for not sending him the emergency funding measure he asked for nearly two months ago.\" Yet the Chieftain failed to mention, ...\n\n\nColorado Media Matters - http://colorado.mediamatters.org/\n\n\n\nBush to Congress on Emergency Spending Bill: It's My Way or the ...\n\nBy Mudle Therese\n\nIt was during the second interview that Varney elicited from Portman the somewhat surprising possibility that George Bush might veto the bill even if the Democrats remove the so-called \"timetable\" for withdrawal of troops from Iraq. ...\n\n\nNews Hounds - http://www.newshounds.us/\n\n\n\nAbove the Law: How Bush Became the Torture President\n\nBy Len Hart(Len Hart)\n\nBush pokes fun at the concept of international law in those instances in which he is in clear violation of it but it supports it when it suits his malevolent, imperial purposes. Bush was outraged recently when Iran took British sailors ...\n\n\nThe Existentialist Cowboy - http://existentialistcowboy.blogspot.com/index.html\n\n\n\nYou’ll honor Jeb Bush — whether you want to or not\n\nBy Carpetbagger\n\nUpset by this lack of Jeb Bush adoration, the conservative-controlled House Schools & Learning Council voted yesterday to force the university to rename its education school the “Jeb Bush College of Education.” ...\n\n\nThe Carpetbagger Report - http://www.thecarpetbaggerreport.com\n\n\n\nPrint outlets reported Bush claim that decrease in border arrests ...\n\nSimilarly, reporting that Bush attributed the decrease in apprehensions to the efficacy of his administration's policies, The New York Times noted criticism of the link but also ignored the apparent inconsistency in the two claims. ...\n\n\nMedia Matters for America - http://mediamatters.org/\n\n\n This as-it-happens Google Alert is brought to you by Google.\n \nRemove this alert.\n  Create another alert.\nManage your alerts.\n\n"}