{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "drew Roberts <zotz@100jamz.com>", "subject": "Re: [cc-community] Does BY-SA extend to a newspaper?", "body": "On Monday 23 April 2007 03:29 pm, Rob Myers wrote:\n> drew Roberts wrote:\n> > Ah, nope, I don't think that fully covers the situation. While a\n> > derivative work is a work that would attract its own copyright, it is not\n> > the only works that might incorporate or contain a BY-SA work and not be\n> > a derivative.\n> >\n> > Have you missed the talk on collections? (Collective works or whatever\n> > the correct terminology is.)\n> >\n> > A collective work canget a copyright on the collection. Right? Wrong?\n>\n> I think so but people don't seem to always assert it. \n\nAs far as I know, it doesn't matter whether they assert it or not. If a \ncopyright can be had on a work these days, you get it automatically whether \nyou want it or not.\n\n> Does the work get \n> this automatically? \n\nI think so. Copyright is automatic, right? Or do only certain works or certain \nworks get copyright protection automatically while others need to be marked \nor even registered?\n\n> How does it interact with the underlying copyright? \n\nDoes anyone know the answer to questions like this who would be willing to \nshare them?\n>\n> I can see the case that the collective work couldn't exist without the\n> underlying CC-licensed work so the condition for being allowed to claim\n> a collective copyright that covers the CC-licensed work is that the\n> collective work must be CC-licensed. I'm just very wary of it.\n\nThat would not be necessary, it might conflict with other free licensed works \nthat make similar requirements. What you could do is specify acceptable \nlicenses for siblings in a collective work and another set of acceptable \nlicenses for the collective work itself. In the case of say BY-SA, neither \nthe siblings nor the collective would necessarily have to be BY-SA. (Where \nBY-SA is some amended BY-SA and not the one we have now obviously.)\n>\n> > Is a newspaper on the whole copyrighted? Or only the individual articles?\n> > Is a magazine copyrighted?\n>\n> As a whole it is copyrighted by the publisher, there is usually a notice\n> on the contents page. Writers and illustrators and editors get\n> attribution. I must admit I haven't thought about what kind of copyright\n> this is. Photos from agencies must have their own copyright originally\n> and be licensed.\n\nRight, if so, hence my wording along the lines of where a copyright arises or \nwhere a copyright obtains.\n>\n> > The problem is that we only seek to control derivatives and we could also\n> > control copying and distribution where needed.\n>\n> Stallman explicitly excluded collective works when drafting the GPL.\n\nI do not think this is correct, the GPL uses the term mere aggregation.\n\n\"In addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\"\n\nUnless you refer to some other clause in the GPL. Mere aggregation suggests \nmore to me something along the lines of you having a random mixture of songs \nof various licenses and you sort them alphabetically and copy them off to CD \nor DVD with as many as can fit on each disk going on that disk. No \ncreativity, hence no copyright arising, mere aggregation.\n\n> This was a tactical measure at least in part I believe, as no\n> Freeware/Shareware CD would have accepted those terms.\n>\n> It is also important to avoid anything that could be regarded as coercion.\n\nFor Share Alike, what is wanted is share alike. Not coercion. I'm willing to \nshare with you if you are willing to share with me under these terms. \nVoluntary. Now, you may not fully like having to meet the share alike terms, \nbut that hardly goes to coercion.\n>\n> > Or am I totally off base.\n>\n> No, I'm just very wary of collective copyright. Part of this is ethical,\n> part of this is due to my not having the best understanding of it.  :-/\n\n\nTo my mind, being wary is very reasonable. I am constantly running upon quirks \nas to how things work.\n>\n> > I agree with that, but if we can do it using copyright law itself, might\n> > not that be better? Looking at this last paragraph, I think you might not\n> > fully get what  Iam trying to say.\n>\n> I understand the collective copyright argument but I think unless it is\n> used very precisely to enforce a particular part of a \"social contract\"\n> it could be seen as coercive and harm distribution without increasing or\n> protecting copyleft works.\n\nCould be, I think we would need to have a better understanding of which sorts \nof things get copyrights and which don't in order to better think about these \nissues.\n>\n> I would be interested to see a study of how collective work copyrights\n> could interact with alternative copyright licenses though.\n\nAny experts care to give some lessons? Write a primer?\n>\n> - Rob.\n\nall the best,\n\ndrew\n-- \n(da idea man)\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}