{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\"\n\t<speakup@braille.uwo.ca>", "from_address": "Lukas Loehrer <listaddr1@gmx.net>", "subject": "Re: ttsynth and speakup connector.", "body": "Luke Yelavich writes (\"ttsynth and speakup connector.\"):\n> speech does not shut up very quickly when one presses a key, or the \n> control key. Speech also overlaps when quickly skimming over text, \n> either by line, word, or character. I'd say this has something to do \n> with ALSA being used, but is probably not too hard to work around in the \n> code. The utility also randomly crashes sometimes, and I hope to see if \n> I can debug that.\n\nThe overlapping speech problem could be related to the use of a too\nlarge hardware buffer size in conjuction with software mixing (dmix).\nI suppose that when software mixing is used, the snd_pcm_drop()\nfunction called by one process cannot cancel waveform data that is\nalready written to the buffer shared by all processes, otherwise it\nwould also cancel data written by other processes. Anyway, the\nsolution is to use a relatively small hardware buffer. You can use\nsnd_pcm_hw_params_set_buffer_size_near (), however, this can fail if\nother processes have already set a larger buffer size. In my\nexperience, the best way to force a consistently small buffer is to\nuse a ~/.asoundrc file and force the buffer and period size there. I\npasted mine at the end of this mail. The emacspeak svn repository\ncontains another a bit more sophisticated example:\n\nhttp://emacspeak.googlecode.com/svn/trunk/servers/linux-outloud/asoundrc \n\nBest regards, Lukas\n\nExample follows:\n\npcm.!default {\n    type plug\n    slave.pcm \"dmixer\"\n}\n\npcm.dmixer  {\n    type dmix\n    ipc_key 1024\n\tipc_perm 0660\n\tipc_key_add_uid false  \n\tipc_gid audio\n    slave {\n        pcm \"hw:0,0\"\n        format s16_LE\n        period_time 0\n        period_size 1024\n        buffer_size 4096\n        rate 44100\n    }\n    bindings {\n        0 0\n        1 1\n    }\n}\n\nctl.!default {\n    type hw\n    card 0\n}\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}