{"category": "ham", "to_address": "<ip-health@lists.essential.org>,\n   \"Healthgap List\" <HEALTHGAP@LISTSERV.CRITPATH.ORG>", "from_address": "\"Sean Flynn\" <sflynn@wcl.american.edu>", "subject": "[Ip-health] Dems on data exclusivity", "body": "\n\n-----Original Message-----\nFrom: Michael Palmedo\nCongress Daily story on House plan for IP in FTAs\n\n[snip]\n\n     Democrats are proposing that the five-year period of exclusivity\nfor trading partners be allowed to run concurrently with the exclusivity\n\nperiod in the United States, so that generic availability in the other\ncountry is not delayed beyond the U.S. period.\n\n     That demand is significantly less than some House Democrats and\nhealth activists would have asked, who have sought that any specific\nminimum period for data exclusivity be removed from trade agreements.\n\n[snip]\n\n------------------------------------------------------------------------\n-\nNational Review Congress Daily\nBy Martin Vaughan\nApril 6, 2007\n\n          Drug Companies Look To Head Off House Dem/Bush Deal\n\n     Pharmaceutical companies are working to head off a deal between\nHouse Democrats and the Bush administration that would weaken\nintellectual property protections that affect drug sales overseas.\n\n     The issue of intellectual property rights and access to medicines\nis one of six broad areas Democrats are seeking to renegotiate in\nagreements with Peru and Colombia, and create a new standard for other\ntrade agreements going forward.\n\n     The call by House Ways and Means Chairman Rangel to alter IPR\nprovisions has already generated some pushback from within the\nDemocratic Caucus, in particular from New Democrats concerned that an\nagreement not undercut the drug industry's ability to bring innovative\ndrugs to the market.\n\n     In separate interviews, Reps. Adam Smith, D-Wash., and James Moran,\n\nD-Va., identified the issue of access to medicines as one part of the\nDemocratic proposal that might need to be fine-tuned.\n\n     Brand-name pharmaceutical firms met Thursday with staff for New\nDemocrats and lodged their concerns with the Rangel agenda, according to\n\na senior New Democrat staffer.\n\n     The staffer stressed that New Democrats support the broad outline\nthat Rangel offered this week, while details still have to be\nnegotiated.\n\n     Rangel and Ways and Means Trade Subcommittee Chairman Sander Levin,\n\nD-Mich., laid out their proposal Tuesday to the House Democratic Caucus,\n\nwhich they hoped would serve as a blueprint for passing free trade deals\n\nand extending presidential trade negotiating authority.\n\n     According to a statement from New Democrats, \"The leadership of the\n\nNew Democrat coalition supports the trade principles outlined by\nChairman Rangel and applauds his effort to negotiate a bipartisan\ncompromise that would allow forward-thinking trade policies to move\nahead.\"\n\n     But the inclusion of language opposed by the pharmaceutical\nindustry is likely to have a heavier impact on the Republican side,\nwhere votes for any eventual trade deals will be every bit as crucial as\n\nDemocratic votes.\n\n     Industry lobbyists also raised the issue of intellectual property\nprotections at a meeting hosted by House Minority Whip Blunt and Chief\nDeputy Minority Whip Eric Cantor, R-Va., according to a source who\nattended the meeting.\n\n     The pharmaceutical issue is not as high-profile as Democratic\ndemands on labor, and might ultimately be easier to solve, according to\nsources close to discussions.\n\n     The labor issue remains intractable because Democrats have not\naltered their demand that trade agreements obligate all parties to abide\n\nby core International Labor Organization standards, and neither the Bush\n\nadministration nor Republicans are likely to agree to any plan that\nwould subject the United States to legal challenge over whether its\nlabor laws conform to the ILO.\n\n     \"Without a safe harbor for U.S. labor law, it's a non-starter,\"\nRep. Kevin Brady, R-Texas, a member of the Ways and Means panel, said\nThursday.\n\n     The intellectual property provisions in question affect how quickly\n\ngeneric drug-makers are able to bring generic versions of patented drugs\n\nto market in developing countries.\n\n     According to sources familiar with the proposals, which are not yet\n\npublic, House Democrats are seeking more flexibility in a requirement\nthat protects clinical test data for brand-named drugs from being used\nto bring generic drugs to market for five years after the patented drug\nhas been registered in a country.\n\n     Critics have charged that the five-year requirement effectively\ncould delay approval of generics past patent expiration.\n\n     Brand-name manufacturers typically will register a new drug in the\nUnited States and European Union first, which starts a period of test\ndata exclusivity in those markets. Registration in smaller markets might\n\nnot come for months or years.\n\n     That sets up a situation where generic drugs are already available\nin the United States, but not in poorer countries because the five-year\ndata exclusivity provision has not yet expired.\n\n     Democrats are proposing that the five-year period of exclusivity\nfor trading partners be allowed to run concurrently with the exclusivity\n\nperiod in the United States, so that generic availability in the other\ncountry is not delayed beyond the U.S. period.\n\n     That demand is significantly less than some House Democrats and\nhealth activists would have asked, who have sought that any specific\nminimum period for data exclusivity be removed from trade agreements.\n\n     One industry observer said in some cases data protection is at\nleast as important as patent protection, because patent infringements\nmust be challenged in courts that might be corrupt or unsympathetic to\nthe industry's arguments.\n\n     It is unclear how willing the Bush administration might be to\naccept Democratic terms in the area of medicines.\n\n     The Office of the U.S. Trade Representative has criticized\ncountries such as Israel and Chile, in its annual Special 301 report on\nintellectual property, for domestic laws aimed at limiting drug\ncompanies' flexibility to take advantage of data exclusivity\nprotections.\n\n     But several sources in the business community said they doubted the\n\nadministration would let the drug industry's concerns stand in the way\nof an agreement that will pave the way for large parts of its trade\nagenda to move forward.\n\n\n\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}