{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Adam Borowski <kilobyte@angband.pl>", "subject": "Re: Bug#423683: msttcorefonts: Windows Vista Fonts available legally for free", "body": "On Mon, May 14, 2007 at 05:24:04PM +0200, Fabian Greffrath wrote:\n> Am Montag, den 14.05.2007, 13:25 +0200 schrieb Thijs Kinkhorst:\n> > I've reviewed the licence, and I'm afraid it's a bit more bothered than that \n> > of the ms core fonts for the web:  \"You may use the software only to view and \n> > print files created with Microsoft Office software.  You may not use the \n> > software for any other purpose.\". If I would include this into the \n> > msttcorefonts package this would severely limit the possibilities with these \n> > core fonts, that are currently free to be used for whatever purpose.\n\nThere's a similar thing, except without the usage restrictions: their\n\"Consolas\" font.  And while the other Vista fonts are only so-so even\ncompared to ttf-dejavu, I have to admit that Consolas is an awesome terminal\nfont.  A whole deal better than DejaVu Mono Sans.  And in an ironic turn,\nwhile on M$ it _needs_ ClearType (and thus LCD) to be usable, with FreeType\nit's very good even on CRT.\n\nThere is a string attached, though -- but one of a different kind.  You need\nto be a \"licensed user of Microsoft Visual Studio 2005\".  It does have a\ngratis edition, but that's a 35MB download just to satisfy the license.\n \n> Well, I see this point. How about a separate package, maybe\n> 'ttf-vistafonts' or 'msvistacorefonts' which is in no way connected to\n> the 'msttcorefonts' package and shows a debconf warning about the\n> restrictions these fonts are subject to?\n\nYeah, viewing MS Office files is a tiny portion of what we do, so the\nusability of that package would be really limited.  On the other hand,\ncoding using a monospaced font...\n\n-- \n1KB\t\t// Microsoft corollary to Hanlon's razor:\n\t\t//\tNever attribute to stupidity what can be\n\t\t//\tadequately explained by malice.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}