{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Tammy Church <healy@gotbuttons.com>", "subject": "Penis Launcher", "body": "\n\nCan't have sex like you had 10 years ago? Tired with your sexual problems?\nEverything for your health\nBuy Licensed and Quality Viagra or Cialis at US Drug store now and you'll be at the top all night long!\nOrder now!\nYou don't need to look for a drug store in your area. We deliver high-quality pills worldwide.\nWith best regards,\nTammy Church\n \n \nKazalos, on Chto-to iskal vo mne. V takom Sluchae ia gotov otpravitsia v put. Solnechnaia aktivnost prevysila Dopustimuiu normu pochti v tri raza, i moia dragocennaia medit prosto-naprosto Sdohla, vsia i bespovorotno. A mne nabilo oskominu tvoe upriamstvo, Niks. \nChuzhie nadezhdy Spustia minutu my vse uzhe stoiali vokrug zolotistogo kruga, osveshchavshego nashu Odezhdu i lica svoim zheltovatym svetom. Potom ia uslyshal etot golos, pozhelavshij mne chto-to obiasnit, i prilozhil Ogromnoe usilie, chtoby podniat veki. Po Davnemu dogovoru, Altares besprepiatstvenno propuskal teh, kto imel poruchitelej Ot Gilsveri, i delal, chto emu zablagorassuditsia, s temi, kto takovyh ne imel, I zdes on byval vesma izobretatelen. Da nu! Tak chasto? ia pripodnial brov, vprochem, ne slishkom-to Udivlennyj. On stoial v centre, pogruziv stopy i kraj vycvetshego sinego balahona v Zolotistyj studen, ia zhe sredi sten uzkoj pasti skalnogo koridora. Ved na Fermu ona vernulas ne tolko potomu, chto eto bylo Edinstvennoe mesto, sposobnoe ee zashchitit ot shefira. Sobstvenno, i napitsia ia Mog tolko po sobstvennomu zhelaniiu liuboj spirtosoderzhashchij produkt vsego za Neskolko minut rasshcheplialsia organizmom na bezobidnye sostavliaiushchie, osnovoj Kotoryh !\niavlialas gliukoza. iasno. \nI nikakogo nameka na ostanki, kak i ot Ostalnyh parnej. Ugovor dorozhe deneg esli tovar propadet, zakazov mne Bolshe ne vidat, da i ne rasplachus ia za sam tovar-to. Strashnoe slovo. Poka on odin, on podvergaetsia ogromnomu Risku. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}