{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nThis morning, the Rutgers\n  women’s basketball team spoke up about controversial comments made\n  about them by radio host Don Imus. Their coach slammed what she called\n  “racist and sexist remarks that are deplorable, despicable and\n  unconscionable.”  The team captain said Imus had stolen “a moment\n  of pure grace” from the athletes. Nancy Cordes will have the story and\n  Richard Schlesinger will put the Imus controversy in perspective with a\n  report on racism in America.\n \nOn Capitol Hill, momentum is building up to a likely\n  clash over stem-cell research. As dual bills that would provide public\n  funding for research using human embryos move through Congress, the White\n  House says that President Bush’s veto pen is ready for whatever form of\n  the legislation hits his desk. Sharyl Attkisson will have that story.\n \nAnd Dr. Jon LaPook will look at one of the potential\n  uses for stem cells: to help cure type 1 diabetes. The Journal of the\n  American Medical Association reported that stem cells taken from the blood of\n  a small sample of diabetes patients have helped the patients’ immune\n  systems go months, and even years, without insulin. Fourteen out of the 15\n  patients studied saw marked improvement in their diabetes, showing a glimmer\n  of hope for a cure.\n \nIn other health news, researchers reported last\n  night that the fastest-growing group of obese people in the United States are\n  those 100 pounds or more overweight. These people are known as\n  “severely obese.” The proportion of Americans fitting that\n  description grew by an astonishing 50 percent between 2000 and 2005.  \n \nFor two years Army Specialist Mario Lozano has\n  agonized about taking the life of an Italian secret agent while manning a\n  roadblock on Iraq’s\n  most dangerous highway.  Now, as he awaits trial in Italy for the death of Nicola\n  Calipari, Lozano shares details of the shooting with our chief foreign\n  correspondent Lara Logan. \n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}