{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Cheapflights Travel Deals <cheapflights@list.cheapflights.com>", "subject": "Delta, jetBlue; $81 U.S. Airfares, More", "body": "\n\nDelta, jetBlue; $81 U.S. Airfares, More\n\n\n\n\n\n\n\n\n\n\n\n\n\nJune 21, 2007\n\n\n\n\n\n\n\n\n\n\nFrom: \nTo: \n\n  \n\n\n\n\n\n\n\n\n\n\n\n \nIN THIS ISSUE: SUMMER TRAVEL BARGAINS\n\n\n\n\n\n\n\n\n\nCheap Flights From Your Local AirportBest airfares from your hometownAtlanta, GA Austin, TX Baltimore, MD Boston, MA Charlotte, NC Chicago, IL Cleveland, OH Columbus, OH Dallas/Ft. Worth, TX Detroit, MI Fort Lauderdale, FL Hartford, CT Houston, TX Kansas City, MO Las Vegas, NV Los Angeles, CA Minneapolis, MN Nashville, TN New York, NY Newark, NJ Oakland, CA Orlando, FL Philadelphia, PA Phoenix, AZ Portland, OR Seattle, WA St. Louis, MO Tampa, FL Washington, DC Click herefor more city airfare deals. \n\n\n\n\n\n\nfrom $82 RTPriceline\n\nU.S. Summer Airfare Deals Airfare Bargains: Top Summer Destinations Book now for savings \u0097 and seats; includes taxes, fees.\n\n\n\n\n\n\n\n\nfrom $99 RTKayak\n\nDelta Air Lines: Unadvertised Sale Fares Delta's Summer Airfare Savings Our deal hunters found these low fares on popular routes; includes taxes, fees.\n\n\n\n\n\n \n\nClick-and-Compare Fares\nFrom Cheapflights\n\nDestination Spotlights \nTop Picks: Popular City Destinations \nCompare the best airfare bargains to:\n\n\nLas Vegas\nSan Francisco\nDenver\nMiami\n\nOrlando\nDallas \nLondon\nBoston \nHonolulu \nNYC\nL.A.\n\n\t    Chicago\n\n\n\n\n\n\n\n\n\nCaribbean Vacation Deals of the Week 5-Night St. Lucia All Inclusive: From $699/pp \n  Relax at the new Almond Smugglers Cove resort. Includes air/hotel, meals, beverages, taxes, more. CheapCaribbean.com\n\n\n\n\n\n\n\n\nfrom $117 RTKayak\n\njetBlue Bargains\njetBlue Airfare Roundup We've found this week's top bargain airfares; includes taxes, fees.\n\n\n\n\n\n\n\n\nVegas Air/Hotel Deals of the Week Las Vegas 2-Night Packages From $159/pp \n  Top hotels including the Luxor, MGM Grand \n  and Caesar's Palace. Don't need an air ticket? Multi-star hotels from just $36/night.\n\n\n\n\n\n\n\n\nAtlanta \u0097 City Spotlight The Best of Atlanta: Summer '07 Free concert tickets and events\u0085 sightseeing discounts\u0085 sunset safaris\u0085 and much more\n\n\n\n\n\n\n\n\nfrom $81 RTCheapTickets\n\nAirline Matches AirTran's Low Fares U.S. Summer-Thru-Fall Airfare Savings A major U.S. airline is matching AirTran's low fares on flights to popular destinations.\n\n\n\n\n\n\n\n\nfrom $103 RTTravelocity\n\nU.S. Summer Airfares Under $200 Summer Flight Savings Nationwide departures and destinations; includes taxes, fees.\n\n\n\n\n\n\n\n\nUniversal Orlando® Resort Limited Time Offer: Unlimited Admission to Two Parks for $85.99/person! Explore two amazing theme parks for an entire week for less than the price of a Disney® 1-day ticket (with Park Hopper Option).\n\n\n\n\n\n\n\n\nSave Up to 60%Hotwire\n\nThis Week's Top Hotel Specials 4-Star Hotels at 2-Star Prices! Pick your favorite city: Get up to 60% off retail rates on hotels all over the U.S.\n\n\n\n\n\n\n\n\nfrom $85 RTCheapTickets\n\nJuly 4th Airfare Deals of the Week U.S. Holiday Flight Savings Dozens of nationwide departures and destinations; includes taxes, fees.\n\n\n\n\n\n\n\n\nSave Up to 75%Vacations To Go\n\nCruise Deals of the Week Last-Minute Cruises: Up to 75% Discounts Cruise away your cares: Caribbean, Mexico and Hawaii sailings on top lines.\n\n\n\n\n\n\n\n\nfrom $599 /personLatin Destinations\n\nCosta Rica Vacation Deals of the Week 6-Night Costa Rica Beach & Rainforest Packages Includes airfare; hotels (2 nights each in San Jose, Arenal and Monteverde); ground transfers between destinations; breakfast and hotel taxes. \n\n\n\n\nEurope Deals\n\n\n\n\n\nfrom $579 /personEuropean Destinations\n\nThanksgiving in Europe Getaway Deals \n6-Night Paris & Rome Air/Hotel Packages \nIncludes international airfare; flights between Paris and Rome; hotels (3 nights each in Paris and Rome) and more\n\n\n\n\n\n\n\n\nfrom $477 /person1800FlyEurope\n\nEurope Air & Car Deals of the Week Europe Fall Fly/Drive Packages Choose your favorite Europe hotspot. Includes airfare, fuel surcharge and 3-day car rental.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Tell a friend   Change \nyour profile  |  Unsubscribe\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nTRAVEL NEWS\n\n\n\nIn the Headlines\u0085 From Cheapflights.com's daily travel news and other sources: \u0095 Government to issue refunds to travelers for late expedited passports \u0095 American Airlines' Latin America, Caribbean fare sale ends June 20 \u0095 House votes to delay passport rules by 17 months \u0095 United Airlines adds routes in five key U.S. cities \u0095 Fly Los Angeles to Bali for just $735 roundtrip \u0095 ATA adds three mainland to Hawaii routes \u0095 Angry flyers demand better airline serviceThe Lighter Side of Travel \u0095 US News & World Report Issues 'Airport Misery' Index \u0095 Harrah's and Jimmy Buffet to Open Margaritaville Casino & Resort \u0095 Hotels' New Breed 'Do Not Disturb' Signs Signal More Than ZZZs and Privacy Trip Planning & Destinations \u0095 New Rollercoaster Rides Are Big, Bad & Thrilling \u0095 Free and Fun in Las Vegas \u0095 How to Enjoy Street Food Without Getting Sick \u0095 Sip Vino at L.A.'s Trendy Wine Bars \u0095 Follow These Tourist Dos and Don'ts to Be Welcomed Anywhere \u0095 Cheap Travel: $1 Drinks in San Francisco \u0095 Airport Eateries Serve Up \u0097 and Deliver \u0097 Local Food Favorites \u0095 Scenery & Adventure Star in Legendary Motorcycle Road Trips\n\n\n\n\n\n\n \n\n\n\n\n\n \nGETAWAY CALENDAR\n\n\n\n\n\n\n\nThe summer solstice (June 21) is celebrated around the country this week with events and parades such as those held in Santa Barbara. Aspen (CO), June 21\u0096August 19: Aspen Music Festival Boston (MA), June 22 thru August 31: Free Movies by Moonlight at the Boston Harbor Hotel Chicago (IL), June 23\u009624: Summerfest in Lincoln Park; thru August 26: Summerdance Miami (FL), thru June 30: Florida Dance Festival; thru July 8: City Theater Summer Shorts FestivalNew York City, thru July 21: Midsummer Night Swing; June 27\u0096August 15: Summer in the Square includes live music and dance performances in Union Square. Norfolk (VA), June 22\u009624: Bayoo Boogaloo and Cajun Food Festival Greeley (CO), June 22\u0096July 4: The Greeley Independence Stampede includes a rodeo, concerts, parades, fireworks and more. Coming Soon: Chicago (IL), July 13\u009615: Magnificent Mile Art Festival San Francisco (CA), July 14: Bastille Day Celebration Big Pine Key (FL), July 14: Underwater Music Festival\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \nWant the \nlatest airline and related news? Visit Cheapflights.com Flights News\n\nFind \nthe best airfare deals on Cheapflights.com\n\n\n\n\n\n  From: \nTo: \n\n\n\n\n\n\n\nFlights\n| \nPrivacy Policy | \nContact us\n\n\n\nWould \nyou like to Unsubscribe? \n\n\nTerms \nand Conditions:\n\nCheapflights.com does not sell tickets, but publishes deals and displays \ninformation only. Prices do not include taxes and other fees unless \nstated.   We list deals that are correct when \npublished, but cannot guarantee accuracy or completeness. \n\nThe information provided in this e-mail may include inaccuracies and \ntypographical errors. Terms and Conditions apply to the above deals and \nthese deals may expire or be subject to change. Cheapflights.com (USA) \nInc., its subsidiaries & affiliates are not liable for any claims of \ndamages, loss or injury to persons or property arising out of this \nnewsletter. For more details on a specific deal, check with the agent or \ncompany selling the tickets.\n\n* \nTaxes, fees, and restrictions apply\n\n\nFor written correspondence please contact Cheapflights (USA) Inc. at 24 School \nStreet, Boston 02108.\n\n\n\n\n\n"}