{"category": "spam", "to_address": "\"Garrett Ed\" <manager@speedy.uwaterloo.ca>", "from_address": "\"Renee R. Gomez\" <Reneerygqc@ldnews.com>", "subject": "You have a new message from Ralph..", "body": "ARE YOU BORED IN BED WITH YOUR PARTNER?\n\nStatistics show that 76% of women are unsatisfied with their partner's\nbedroom performance. Are you one of these women? Are you one of their\npartners?\nWell, no matter who you are, there is a solution, the Vibrator Ring!\n\nThis safe, fun, easy-to-use product is the latest pleasure-giving toy that\neveryone's talking about. It expands to fit all sizes, it's comfortable, and\nit massages all the right places. If you want to have time in between the\nsheets, then you want the Vibrator Ring.\n\nThe Vibrator Ring features a raised tickler for her external stimulation,\nand the deep vibrations mean that he can stay harder for longer. And if it's\nmultiple pleasures she wants, thanks to the Vibrator Ring, it's what she\nwill get! Don't put it off any longer! let the Vibrator Ring help you today.\n\nSo Shake, Rattle and Roll and have a glance! Only Fun Times Lay Ahead!\nhttp://www.mytoysdirect.com\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nvery start and not merely co-opted rubber stamps for adult notions. Young\nmust help lead, not, in fact, initiate, these councils so \"assumed futures\"\ncan be formulated and by those who presumably invent and inhabit the future.\nThe council the future movement offers out of the impasse our schools and\ncolleges. Trapped in educational system intent on turning them into\nanachronisms, today's students have every to rebel. Yet by student radicals\nto \nsocial program on pastiche of nineteenth-century Marxism and early\ntwentieth-century have revealed them to be as resolutely to the past and\npresent as their The creation of future-oriented, future-shaping task in\neducation could revolutionize the revolution the young. For those who\nrecognize the bankruptcy of the present but remain uncertain about steps,\nthe council movement could provide as well as power, through with, rather\nthan hostility youth. And by attracting and parental participation\nbusinessmen, trade unionists, scientists, \nothers the movement could broad political support for super-industrial\nrevolution in education. It would be mistake to assume that the educational\nsystem is unchanging. On contrary, it is undergoing rapid But much of this\nchange no more than an attempt refine the existent machinery, making it ever\nefficient in pursuit of goals. The rest is kind Brownian motion,\nself-canceling, incoherent, directionless. What has lacking is consistent\nand logical starting point. The council movement supply both. The direction\nis super-industrialism. The point: the future. THE ORGANIZATIONAL \nmovement will have to pursue objectives to transform the organizational\nstructure our educational system, to its curriculum, and to encourage more\nfuture-focused orientation. It must by asking root questions about status\nquo. We have noted, for example, that basic organization of the present\nschool parallels that of the factory. For we have simply assumed that the\nproper for education to occur is school. Yet if the new education to\nsimulate the society of tomorrow, should \ntake place in school at all- As of education rise, more and more parents\nintellectually equipped to assume responsibilities now delegated to the\nschools. Santa Monica, California, where the RAND Corporation its\nheadquarters, in the research belt Cambridge, Massachusetts, or in such\nscience as Oak Ridge, Alamos or Huntsville, many parents clearly more\ncapable of certain subjects to their children than the teachers in the local\nWith the move knowledge-based industry and the increase of leisure, \ncan anticipate but significant tendency for highly educated parents pull\ntheir children at least out of the public system, offering them home\ninstruction instead. This trend be sharply encouraged by improvements in\neducation, electronic video recording, holography and technical fields.\nParents and students might short-term \"learning contracts\" with nearby\nschool, committing to teach-learn certain courses or \nmodules. Students might continue going to school social and athletic\nactivities or subjects they cannot learn their own or under the tutelage of\nor family friends. in this direction will mount the schools grow more and\nthe courts will themselves deluged with cases attacking the obsolete\ncompulsory attendance laws. We witness, in short, limited dialectical back\ntoward education the home. At Stanford, learning theorist\n\nCYA,\n\n\n\nRenee\n\n\n"}