{"category": "spam", "to_address": "<ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"Henry Burris\" <lxg@eazylink.com>", "subject": "asthma", "body": "\n\n\n\n\n\n\n\nI thought we didn't have to be separate anymore, \nthat you were processing and accepting your emotions, albeit with \nalcohol.\nShe looked like some obscure saint, Sister Shane of \nGalilee. There are swings, some of which are rusted or missing. Nor would the \naccused have been granted the sacrament of a proper internment in the good Christian \nearth. Behind where Samantha Stevens now sit is Gallows Hill, where eighteen of the \naccused were hanged.\nEach of her long, fit limbs had been decorated in a \ndelicate filigree of scars rippling out from larger anonymous, pink scars like deep \npuncture wounds or third degree cigar burns.\nPerhaps there is a vestigial shame in what \nhappened.\nA dozen yards from the flagpole is a \ngazebo.\nThis bubbling cauldron was the real selling point \nof this hotel for Emily and she is, as always, our travel agent. Even as Shane tried \nto think of a spell or trick to destroy her, she knew she would mourn having killed \nsomething so much better than she could ever be.\nWhile she still resembled Shane, she was a version \nof Shane who spent five additional years in charm schools and ballet classes, \nsandblasting and airbrushing faults to oblivion. You are tiny and irrelevant. I \nwould be suspicious of the politics or arts that were keen on average, naked, \nhirsutulous men, though I suppose they must exist. Deep razor cuts rushed as \ncapillaries and veins remembered the slices.\nOur weather ranges from below freezing (but not \nthis year) to over 100 degrees.\nGallows Hill is a playground. \"You're right, I'm \nnot sorry at all.\nWe can see without struggle once we are away from \nstreetlights, once we walk past the community garden placed idiotically downwind of \nthe sewage treatment plant. I just think they could have placed the statue somewhere \na little less whimsical,\" she spits this final word with all the venom she could \nmuster. Shane estimated that she was a foot higher than when her double began to \nbury her. I needed to keep my Hawaiian clarion call, my tinkling theme music to \nnocturnal frolics, or my companions may disappear to the haze of night and I would \nbe left to the fairies' snare. It was my body, after all.\nWorse, such honest light had never seen this place \nand never would; her double thus was every bit that beautiful even as she continued \nto try to bury Shane in a grave Shane had dug on her own.\nGina leaves us to our grim task.\nThis bubbling cauldron was the real selling point \nof this hotel for Emily and she is, as always, our travel agent.\n\"  She pulled her dress up, exposing her unmarked \nstomach. She just wants to immediately get us thinking about fanatical Puritans, as \nthough this would be a new thought in a town that sells mass produced facsimiles of \ntheir dour costume. \"  Even the double's sneer appeared serene and confident like \nthat of a contemptuous swan princess.\nInstead, he runs his business selling rare books \nthrough the building. \"You didn't feel more than a moment's discomfort then so I \nfelt even less. I cannot relate the objective facts of her life - her affiliations, \nexperiences, and skills - without sounding boastful.\nIt stays crunchy in milk and can be used as a \nsuppository.\nNor would the accused have been granted the \nsacrament of a proper internment in the good Christian earth.\nI am not one of those heck forsaken \ngothics.\nShane grabbed for a hank of her lovely hair to drag \nher inside, but the double was too fast on her feet and out of reach, amusement \nreplacing the sadness in her eyes.\nWhile I appreciate Emily's initiative, I worry that \nthis place is sacred to the residents of Salem as it was to our tour guide. \"No, \nthat would be silly,\" she answered.\n"}