{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "\"Rochelle and Bethea\" <rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, here's your forecast for May 14th - May 20th", "body": "\n\n\n\n\n\n\n\n\nMemo, to ensure that your weekly forecasts are delivered correctly to your inbox, please add our email address Rochelle@myhealthwealthandhappiness.com to your address book.\n \n\nNew Moon, May 16, 3:28 AM EST\n\n\n\n\n\n\n               \n\n\n\n\nDear Memo,\n\n    Over the past few weeks I've talked about how success-minded thinking requires a willingness to view life with a positive perspective.  It also calls for persistence and determination.\n    As Calvin Coolidge wrote: \"Press on. Nothing can take the place of persistence. Talent will not; the world is full of unsuccessful people with talent.  Genius will not; unrewarded genius is almost a proverb.  Education alone will not; the world is full of educated derelicts.  Persistence and determination alone are omnipotent.\"\n    To help you stay persistent and embrace success-minded thinking, commit yourself to building and maintaining friendships and contacts that enrich and enhance your life, and your dreams.  I like to call these people \"true fans and supporters.\"  They are the ones who believe in you and want you to achieve your desires.  They cheer you on, celebrate your accomplishments, and lift you up when you are feeling down.\n    The saying, \"misery loves company\" is all too true, so limit time and set clear boundaries with those who are constantly negative, unsupportive and drain your precious energy.  They are on a different path than you.  Perhaps your positive ways and abundant life will influence them to make a change in their own life, perhaps not.  Remember you can't make anyone change who is not ready.\n    Keep the focus on yourself.  Surround yourself with positive like-minded people. Press on, Memo.  Great success will come if you are persistent.\n    We are here to help you every step of the way.\n\n                      Until next week,                          \nP.S.  Memo, Bethea has decided to prepare a Tarot Card Reading for you in next week's forecast.  So, be on the look out for this special message!\n\n\n\n\n\n                 \n\n\n    Mars connects with Pluto on the 14th so be prepared for some powerful egos to be pitted against each other.  Maybe you could make your excuses early on!  Mars moves into Aries where it operates most comfortably so you can get a lot of practical stuff done.  On the 16th there is a lovely New Moon in Taurus.  Make the most of this healing, earthy energy to smooth over any misunderstandings.  Oh, and this is a perfect day to indulge yourself with a massage or a delicious meal that you didn't prepare!\n\n\n\n\n\nMemo               May 14 - May 20               \n\n\n\n\n \n\n\n\n    Memo, I want you to take maximum advantage of the luck coming your way this week. From my calculations, Tuesday is going to be your lucky day for this period.  And your Lucky Numbers are 12, 16, 25, 20, 38, 50.  I hope you'll make the best of them.\n\n\n\n\n\n\n\n\n\n\n\nMay 14th for Memo\n\n\n\n\n\n\n\n\n\n    You could seek some training or information about how to work with your intuition.  There are classes and books available.  Shop around until you find one that feels right for you.\n\n\n\n\n\n\n\n    Learning all you can about a different culture can be very enlightening.  It's amazing how certain universal principles can apply to your own situation, no matter what your background.\n\n\n\n\n\n\n\n    Today, my dear, you need nothing more than to be at home, serenely enjoying your environment. If possible, make loving contact with family or people from the past who you have loved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMay 15th for Memo\n \n \n \n \n \n\n \n \n    Now's a time when you'll let your fantasies play themselves out.  You know the difference between imagination and reality so you understand how important it is to have them balanced in your life.\n\n\n  \n \n \n    A short trip may be on the agenda today.  Avoid making snap decisions and take your time when it comes to shelling out money.  Make it worth your while and plan to get a lot done.\n\n \n \n\n \n \n\n\n\n\n    Try to get a head start on chores.  Your ability to tackle jobs in an organized fashion can win favor with others.  Don't be surprised if you're given recognition of some sort.\n \n \n\n \n \n\n\n    This is an excellent time for expanding your job base, asking for promotions or raises and for making a real difference in the outcome of certain work projects.  Enjoy the company of older relatives today.\n \n  \n\n\n\n\n\n\n\n\nMay 16th for Memo\n\n \n \n \n\n\n \n \n    This is a good time to plan to do some exercise.  Get out and stretch your legs.  Visit your favorite store and see what sort of items are on sale.  Keep your eye out for bargains.\n\n\n \n\n \n \n    Political debates really turn you on today.  Very understandable as the intellect is quick, keen and aggressive and the mood is combative. Your opponents don't stand a chance.\n\n \n \n \n \n\n\n\n\n    You are likely to feel warm and comforted by the company of others today.  My dear, friends and family will matter equally, and your day will probably revolve around some social event or a special gathering.   \n\n \n\n\n\n    You may find yourself feeling quite intense — very serious about almost everything.  If it’s important, speak your mind sincerely.  If not, try to lighten up and see the humor in the situation.\n \n\n \n \n\n\n    If you'd like a little more support to follow your dreams, join an organization that is devoted to your favorite interest.  You can meet lots of sympathetic friends this way.\n \n\n\n\n\n\n\n\nMay 17th for Memo\n  \n \n\n \n \n \n    You may feel the need to connect with your inner-self today. Meditation to soothing music can help, or you might want to try a long walk in the park.  Some inspiring music can help.\n\n\n\n\n\n \n \n    A neighbor could tell you something that you may be better off keeping to yourself today.  If you give in to the temptation to gossip, you'll regret it.  Keep it a secret, my friend.\n\n\n \n\n \n \n    Try to spend some time with a group of like-minded people today, because the energy that you share together can be simply inspirational.  It can spur you on to some great creativity.\n\n \n\n \n \n\n\n\n\n    Helping out a friend feels so good.  Don't be surprised if random strokes of luck start to grace your life.  The universe has a way of rewarding folks who spread sunshine.\n  \n \n\n\n\n\n\n\n\n\nMay 18th for Memo\n  \n \n \n \n \n \n    This is a great time to visit your local library and see what new materials they have.  You might be surprised at who you meet there, as well.  Make an effort to look extra nice.\n\n\n \n\n \n \n    Friends are an important part of your day and are likely to involve you in physical activities or improvement projects of some sort.  My dear, your money schemes have merit and those in power could aid.\n\n\n \n\n\n \n \n    Joining a social group that is different from the ones you've associated with in the past can be a breath of fresh air for you. Unusual people have the power to teach you powerful lessons.\n\n \n\n\n \n\n\n\n\n\n    Where an important friendship is concerned, remember that today's denial could bring tomorrow's acceptance.  Nothing is lost, but rather you could be in the middle of a transformation.  Ride the tide, dear.    \n\n \n \n\n\n    An organization or club may not be all that it's cracked up to be.  If you don't feel comfortable associating yourself with this clan, move on.  You can find a more compatible fit.\n  \n\n\n\n\n\n\n\n\nMay 19th for Memo\n  \n \n \n \n\n \n \n    Have some friends over later today.  For treats you should stick to healthy foods and your companions will appreciate it.  Nothing is better than good food and good conversation.\n\n\n \n \n\n \n \n    An event that you may have hoped for concerning a good friend could happen today.  Keep track of events and pay attention.  Remain flexible in case you need to dash out to the store.\n\n \n\n\n \n \n\n\n\n\n    Domestic products and services can bring luck today.  Bargain hunting promises to uncover some interesting items.  You may call, write to or visit a loved one or friend who is ill or confined somehow, my friend.   \n \n\n\n\n\n\n\n\nMay 20th for Memo\n \n \n \n \n \n \n \n    A surprise call or visit from friends can be so much fun.  That's why you should consider paying a call on someone that you haven't seen for some time.  Bring a small gift or a treat.\n\n\n  \n\n \n \n    You may feel that your inner mind is working overtime today.  My friend, your dreams probably indicate a need for some rest and relaxation on your part.  Those who are ill may also be ill-tempered.\n\n\n  \n\n \n \n    It's not a good idea to hide things from a loved one.  Sit down and have a heart-to-heart chat about anything you've been keeping private. Your relationship may grow as a result.\n\n \n\n\n \n \n \n\n \n \n\n\n    Your inner strength keeps increasing, so you can accomplish things that you weren't ready for before.  Now is the right time to take action on a matter that means much to you.   \n\n \n \n\n\n    Your approach to religion and spirituality is usually intellectually based.  Deep or intense emotions are difficult for you to fathom. Today is one of those days when faith and trust must rule.\n \n\n\n\n\n\n\n\n    It looks like a busy week coming up, but with communication rather than action involved.  More later.\n\n                       Best Regards, \n                        \n\n\n\n\n    If at any time you no longer wish to receive your weekly forecast, you can simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400, and I will stop emailing them to you. It's as simple as that. My only desire is to help you, Memo.\n\n"}