{"category": "spam", "to_address": "Myrtless <myrtless@flax24.uwaterloo.ca>", "from_address": "Larry Erickson <steele@gforcepb.com>", "subject": "U won't believe!", "body": "\n\nLooking for an effective and cheap solution to have sex like you had 10 years ago?\nAll this you can find here\nLicensed Viagra and Cialis we are offering would improve your sexual life in few moments.\nGo to the site\nThere is no need to visit your local drug store at all.\nWith best regards,\nLarry Erickson\n \n \nPoluchilos! Vse-taki poluchilos! Novyj obraz srabotal nepreodolimym Mentalnym barerom dlia serosti. A pochemu tak pozdno? Ved proshlo chetyrnadcat let? Neuzheli ne bylo Vozmozhnosti poiavitsia ranshe? Ne bylo, s sozhaleniem podumal ia pro sebia. Ona dolzhna byla ehat so mnoj, i vse tut, i ne pozhelala Obiasnit, pochemu eto tak vazhno. On naverniaka i podbiral vas po Sebe, chtoby bez pomeh tvorit liubye temnye delishki Ladno, ne moe delo. \nPoezhivshis, Ia sunul ruki v karmany i podoshel k Celiteliu, rasslablenno prisevshemu na Kortochkah vozle steny. Sam ponimaesh, net smysla derzhat Restoran v kosmoporte radi passazhirov, pribyvaiushchih ne chashche odnogo-dvuh raz v Nedeliu. Zashchitnichek hrenov. Olsen zheltoglazyj muzhikovatyj, kriazhistyj na vid mag, chem-to smahivaiushchij Na komel stoletnego kamneliuba, kotoromu na pervyj vzgliad bolshe pristalo by Hodit za plugom po pashne, chem vozitsia so slozhnymi zaklinaniiami i upravliat Gorodom, zalozhiv ruki za spinu, netoroplivo rashazhival vzad-vpered po zalu Biblioteki, voinstvenno vystaviv korotkuiu borodu. I ia ponial, chto etot merzavec obmanul menia, poniatie chesti okazalos Dlia nego pustym zvukom. Luchshe uzh srazu umeret. Vozmozhno, eshche nikomu ona ne govorila takih Slov. Teper v samyj raz. \nTy ved ponimaesh, o chem ia govoriu? Otvet leshuka ne zamedlil sebia zhdat: Eto tvoe budushchee, Niks. Kvin chut ne podprygnul ot Neozhidannosti: Mozhet, mne mashar zazhech? Ia mogu, ty zhe znaesh. Ni svideteli. Oni dvigalis v napravlenii reki, mestnost edva zametno ponizhalas. ejisuminyon XF5FVVtTW1Z0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}