{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"ace\" <ace@talkingirc.net>", "subject": "Re: Hello...", "body": "Orca and Gnome are both great products and I would encourage their use but, \nif your budget allows, you should probably purchase a DoubleTalk LT which is \nan external hardware synthesizer.  The desktop environment still has its \nquirks and if it unexpectedly dies you will be dumped into a shell, so best \nto have hardware speech if at all possible.  Insure that you have a serial \nport, though.\n\n----- Original Message ----- \nFrom: \"Gaijin\" \nTo: \nSent: Thursday, June 14, 2007 5:54 AM\nSubject: Hello...\n\n\n>     Hello all,\n>\n>     Just joined the list and thought I's say \"hello\" to everyone.\n> Really nice to find a place like this.  I'm a rabid Linux fanatic who\n> went blind from diabetic retinopathy in August of '02, and I've been\n> pretty much offline ever since.  Finally broke down and upgraded my\n> system to support WinXP and quickly heard about SpeakUp for Linux.  I'm\n> in the process of looking for a supported speech synth for SpeakUp, so\n> I'm still stuck in Windows on a 30 minute Win-Eyes time limit.  I hope\n> to soon get Slackware up and running, and soon be able to contribute to\n> the SpeakUp effort right along-side everyone.  I'm presently playing\n> around with a copy of Oralux and learning the features.  Just need that\n> speech synthesizer, and I should be off and running.  Thank you for all\n> your efforts.  It is well appreciated.\n>\n>     Best regards,\n>         Michael \"Foreign White Devil\" Ferranti\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n> __________ NOD32 2329 (20070614) Information __________\n>\n> This message was checked by NOD32 antivirus system.\n> http://www.eset.com\n>\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}