{"category": "ham", "to_address": "mgleahy@alumni.uwaterloo.ca", "from_address": "\"Tim Keitt\" <tkeitt@gmail.com>", "subject": "Re: [R] [R-sig-Geo] Connecting to PostgreSQL/PostGIS from R (rgdal?)", "body": "I would also recommend you take a look at RODBC for general purpose\ndatabase access. My impression is that it has received a lot more\nmaintenance attention lately.\n\nI can't comment on the windows gdal binaries as I'm not too familiar\nwith that platform.\n\nTHK\n\nOn 5/30/07, Mike Leahy  wrote:\n> Hello,\n>\n> I've been trying every now and then to find a cross operating system\n> solution that would let me access PostgreSQL (and PostGIS) from R, or to\n> access R from PostgreSQL.  I know of pl/r, which accomplishes the\n> latter, but has yet to be successfully ported to Windows.  Similarly,\n> I've tried to use Rdbi and DBI, but I haven't had luck with those on\n> Windows either for connecting to PostgreSQL from R.  Can anyone suggest\n> a solution for this?\n>\n> It would seem that rgdal could also help me in this case. Unfortunately,\n> the version of the GDAL library that is included in the rdgal binary\n> available on CRAN (for windows) doesn't include the PostgreSQL driver\n> for OGR (i.e., it's not listed by the ogrDrivers() function).\n>\n> I compiled rgdal on Windows myself using the GDAL library from\n> FWTools-1.3.1, but I was unsuccessful at creating a proper binary\n> package for R.  I was only able to get it to work by substituting the\n> rgdal.dll that was installed by CRAN with the one that I compiled that\n> links against the GDAL library from FWTools.  Even though it works (at\n> first glance with ogrInfo(), and readOGR()), I still get a warning\n> message when I load the libary: \"DLL attempted to change FPU control\n> word from 8001f to 9001f\".\n>\n> So my question with respect to rgdal is a) is it likely that an rgdal\n> package is going to be released in the future with the PostgreSQL driver\n> included in GDAL/OGR, or b) are there any suggestions/instructions that\n> might get me through the compilation and packaging process for rgdal\n> with better success?\n>\n> Thanks in advance for any help,\n> Mike\n>\n> _______________________________________________\n> R-sig-Geo mailing list\n> R-sig-Geo@stat.math.ethz.ch\n> https://stat.ethz.ch/mailman/listinfo/r-sig-geo\n>\n\n\n-- \nTimothy H. Keitt, University of Texas at Austin\nContact info and schedule at http://www.keittlab.org/tkeitt/\nReprints at http://www.keittlab.org/tkeitt/papers/\nODF attachment? See http://www.openoffice.org/\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}