{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Albert E. Sten-Clanton\" <albert.e.sten_clanton@verizon.net>", "subject": "Re: heretical thoughts was Re: Speakup dropped from Ubuntu", "body": "If you're right about the trend, then once again we will have second-rate access, as we do with Windblows.  I'll keep hardware speech around as long as I can.\n\nAl\n----- Original Message ----- \nFrom: \"C.M. Brannon\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Tuesday, May 15, 2007 4:01 PM\nSubject: Re: heretical thoughts was Re: Speakup dropped from Ubuntu\n\n\n> Gregory Nowak  writes:\n> \n> > I'm in full agreement with you there. I will personally not buy a usb\n> > synth, until I know that the manufacturer has released the specs for\n> > it without requiring an NDA to be signed.\n> \n> This isn't going to happen.  IIRC, the Tripple Talk USB came out 5 or\n> 6 years ago.\n> \n> > Yes, gentoo, fedora, can be\n> > installed over ssh. Grml, ubuntu can be installed with software\n> > speech. However, what if someone wants to install and use a distro\n> > like debian or slackware, that support neither option as far as I\n> > know?\n> \n> If you have a laptop made in the last couple of years, you won't be\n> able to do a talking install of Slackware, Debian, etc.\n> This trend will become more pronounced; it's only a matter of time\n> before hardware speech is nonviable.\n> So we need to start thinking about long-term solutions.\n> -- Chris\n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n> \n> -- \n> No virus found in this incoming message.\n> Checked by AVG Free Edition. \n> Version: 7.5.467 / Virus Database: 269.7.1/805 - Release Date: 5/15/2007 10:47 AM\n> \n> \n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}