{"category": "spam", "to_address": "kht@speedy.uwaterloo.ca", "from_address": "Groupe Desjardins / AccesD <services.de.cartes@scd.desjardins.com>", "subject": "Avis Important et Personnel", "body": "\n\nMouvement Desjardins\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n Cher(e) membre \n                Desjardins/ AccèsD\n\nDesjardins tient à vous signaler que votre dernière transaction n'a pas été automatiquement enregistré dû à un nombre elevé de transaction simultanée. Le département de vérification comptable du Groupe Desjardins à corriger le problème dans les comptes concernés. Si toutefois vous notez une différence, nous vous prions de nous en aviser. Si vous constatez une autre erreur, communiquez avec votre institution durant les heures de votre caisse.\nPour accéder à \n                votre compte et vérifier que tout soit normal, cliquez sur ce lien sécurisé si dessus :\nhttps://accesd.desjardins.com/\nSoyez assuré que Desjardins met tout en oeuvre pour protéger les utilisateurs de ses services Internet \nLe Groupe \n              Desjardins vous remercie de votre clientèle et apprécie votre compréhension.\nDesjardins / AccèsD\nConjuguer avoirs et \n                    êtres \n                \n\n\n\n\n\n\n\nDear Desjardins Member\nThe Group Desjardins would like to inform you that your last transaction was not automatically recorded due to a high number of simultaneous transactions. Desjardins audit department corrected the problem in the accounts concerned. However if you notice a difference in your folio, we ask you to advise us by communicating with your institution during opening hours\nWe encourage you to    connect to your account and verify your transactions, by clicking the secured url below :\n\nhttps://accesd.desjardins.com/ \nBe assured that Desjardins makes every effort to protect our internet users \nThe Group Desjardins  thanks you for your business and appreciates your comprehension\n\n\n              Desjardins / AccèsD\nMoney working for people \nSvp ne répondez pas à ce courriel car c'est seulement un avis. Le courrier envoyé à cette adresse ne peut pas être répondu. \n              \n\n\n\n\nCopyright © 2006 Mouvement des caisses Desjardins. Tous droits \n                      réservés.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}