{"category": "ham", "to_address": "\"Charles C. Berry\" <cberry@tajo.ucsd.edu>", "from_address": "\"Strickland, Matthew (CDC/CCHP/NCBDDD) (CTR)\" <cro6@CDC.GOV>", "subject": "Re: [R] Conditional logistic regression for \"events/trials\" format", "body": "Thanks for your reply Charles. I do indeed have other variables. I\napologize for being vague, here is my study in more detail:\n\nI have a cohort of births. My outcome is a dichotomous variable for\npresence/absence of a birth defect. For each cohort member I estimate\nthe date of conception, and assign a pollution level during the relevant\nperiod of gestation. All cohort members conceived on the same day are\nassigned the same pollution level. These cohort members also have a\ncovariate, t, which indicates the day of follow-up. For example, if the\nfirst day of my study is Jan 1, 1987, the data would look like:\n\nDate\t\t\tt\tConceptions\t\tCases\nPollution\tStratum\nJan 1, 1987\t\t1\t100\t\t\t1\n10\t\t1\nJan 2, 1987\t\t2\t105\t\t\t0\n8\t\t2\nJan 3, 1987\t\t3\t101\t\t\t1\n11\t\t3\n.\n.\nJan 1, 1988\t\t366\t109\t\t\t1\n13\t\t1\nJan 2, 1988\t\t367\t111\t\t\t2\n19\t\t2\nJan 3, 1988\t\t368\t103\t\t\t0\n14\t\t3\n.\n.\n.\n\nI make matched pairs of days (Strata) to control for the influence of\nseason. I also want to account for long-term trends, eg increasing birth\ndefects ascertainment and decreasing pollution levels over time, so I\nwant to fit a cubic spline using the variable t. \n\nI have already analyzed this data as a time series (I don't use the\nStratum variable in the time-series analyses), but now I am exploring\nsome alternatives. My full dataset has 3,115 strata.\n\nSo my final model would look like: clogit(Cases/Conceptions ~ Pollution\n+ f(t) + strata(Stratum)). \n\nSo, just to reiterate, my goal is to make this model without having to\nbring in the individual-level data. I would be just as happy to do a\nconditional Poisson as I would be to do a conditional logistic\nregression - either would seem to be appropriate here - if that opens up\nsome other options.\n\nThanks very much for your time and interest,\nMatt Strickland\nEpidemiologist\nBirth Defects Branch\nU.S. Centers for Disease Control and Prevention\n\n \n\n-----Original Message-----\nFrom: Charles C. Berry [mailto:cberry@tajo.ucsd.edu] \nSent: Thursday, May 31, 2007 1:12 PM\nTo: Strickland, Matthew (CDC/CCHP/NCBDDD) (CTR)\nCc: r-help@stat.math.ethz.ch; tlumley@u.washington.edu\nSubject: Re: [R] Conditional logistic regression for \"events/trials\"\nformat\n\nOn Thu, 31 May 2007, Strickland, Matthew (CDC/CCHP/NCBDDD) (CTR) wrote:\n\n> Dear R users,\n>\n> I have a large individual-level dataset (~700,000 records) which I am \n> performing a conditional logistic regression on. Key variables include\n\n> the dichotomous outcome, dichotomous exposure, and the stratum to \n> which each person belongs.\n>\n> Using this individual-level dataset I can successfully use clogit to \n> create the model I want. However reading this large .csv file into R \n> and running the models takes a fair amount of time.\n>\n> Alternatively, I could choose to \"collapse\" the dataset so that each \n> row has the number of events, number of individuals, and the exposure \n> and stratum. In SAS they call this the \"events/trials\" format. This \n> would make my dataset much smaller and presumably speed things up.\n>\n\nI think you have described the data for forming a 2 by 2 by K table of\ncounts.\n\nIn which case, loglin(), loglm(), mantelhaen.test(), and - if K is not\ntoo large - glm(... , family=poisson)  would be suitable.\n\nBut you say 'models' above suggesting that there are some other\nvariables. If so, you need to be a bit more specific in describing your\nsetup.\n\n\n> So my question is: can I use clogit (or possibly another function) to \n> perform a conditional logistic regression when the data is in this \n> \"events/trials\" format? I am using R version 2.5.0.\n>\n> Thank you very much,\n> Matt Strickland\n> Birth Defects Branch\n> U.S. Centers for Disease Control\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide \n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\nCharles C. Berry                        (858) 534-2098\n                                          Dept of Family/Preventive\nMedicine\nE mailto:cberry@tajo.ucsd.edu\t         UC San Diego\nhttp://biostat.ucsd.edu/~cberry/         La Jolla, San Diego 92093-0901\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}