{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "1150a 6/18 Update: Critical computer test appears to go well", "body": "\n\n\n\n\n1150a 6/18 Update: Critical computer test appears to go well\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 74\nPosted: 11:38 AM, 6/18/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-71 (06/17/07): Flight director pleased with mission\n   SR-72 (06/18/07): Critical SARJ, attitude control tests on tap\n   SR-73 (06/18/07): Suni Williams bids tearful farewell to space station\n   SR-74 (06/18/07): Critical computer test goes smoothly; station controlled by Russian thrusters\n\n=================================\n\n11:38 AM, 6/18/07, Update: Critical orientation control test appears to go smoothly\n\nControl of the international space station's orientation was turned over to Russian computers and rocket thrusters today in a critical test to confirm the attitude control system is working properly in the wake of crippling computer crashes last week. As of this writing, the test was still underway but NASA officials said it appeared the system was functioning smoothly, a requirement before the shuttle Atlantis undocks on Tuesday.\n\nThe test began after the shuttle's rocket thrusters were used to re-orient the station for a shuttle waste water dump. When the excess water had been dumped overboard, flight controllers maneuvered the station back to its original orientation, or \"attitude,\" and switched control over to the revived Russian guidance, navigation and control computers. The computers then commanded Russian thrusters to maintain the proper attitude for about an hour.\n\nControl of the Russian thruster system then was switched to U.S. computers and again, the hardware and software worked together as required during the latter stages of the test to keep the station stable and pointed in the right direction. The results of the checkout operation will be reviewed by NASA's Mission Management Team later today. Barring additional problems, the Atlantis astronauts are expected to be cleared to seal hatches between the spacecraft this evening to set the stage for undocking on Tuesday.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}