{"category": "spam", "to_address": "<theorize@plg.uwaterloo.ca>", "from_address": "\"Kemp Tristan\" <uobq@twcny.rr.com>", "subject": "fertile insubordinate", "body": "\n\n\n\n\n\n\n\nThis build marks the correction of some \nlong-standing bugs as well as some bugs which were reported by the community. Well, \none could consider that it's more like a game of rugby where some full-contact or \nkick-boxing skills are appreciated.\nnet now features the release of a new auto-update \nfor Warcraft III, also updating Blizzard's RTS game to version 1. \"It contains many \nbug fixes and balance changes, but also adds a few new features and two new neutral \nHeroes!\n\"Beta 5 has many important bug fixes which will \nhelp facilitate new features coming in future builds. Check out the paper about it \nand if you lose a match you can always state the obvious about your opponent \"You \nCheated! Also we have the beretta m12 (you may reconize the render from a older \nupdate) in-game\". A well deserved win for our opponents and a Silver Medal ( \nOlympics year :P ) for our team. Also we have the beretta m12 (you may reconize the \nrender from a older update) in-game\".\n0 beta 5 is out, and it will sure help to increase \nNatural Selection's on growing popularity.\nAnd to finish the round-up, Operation MarketGarden \nhas some great renders of British weapons models:Piat an anti-tank weapon and \nVickers MG a wa Check out the paper about it and if you lose a match you can always \nstate the obvious about your opponent \"You Cheated!\n\"It contains many bug fixes and balance changes, \nbut also adds a few new features and two new neutral Heroes!\nActually, they can play a zero-time match, as well \nas have complete control over the game.\nLooking for the top places, as usual, we all wish \nthem luck.\n\"Beta 5 has many important bug fixes which will \nhelp facilitate new features coming in future builds. Modern Warfare released \nanother update, always on the move. Also we have the beretta m12 (you may reconize \nthe render from a older update) in-game\". The crew at Gang-Life on the other hand, \nfinished off their Glock Model.\nThis build marks the correction of some \nlong-standing bugs as well as some bugs which were reported by the \ncommunity.\n17 is now available for The Reign of Chaos and \nFrozen Throne. Actually, they can play a zero-time match, as well as have complete \ncontrol over the game.\nLooking for the top places, as usual, we all wish \nthem luck. More info in the K1ck Halo members section and in the press \nrelease.\n"}