{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Reuters: Court reserves order in Novartis patent case", "body": "16-30 April 2007\n\nCourt reserves order in Novartis patent case\n\nChennai\n\nA court in India reserved its verdict on a challenge by Novartis AG\nagainst an Indian law that blocks patenting of minor improvements in\nknown molecules. India is a vital source of cheap generic medicines and\ncampaign groups are worried that the poor in the developing world could\nlose access to vital drugs if the Novartis challenge succeeds.\n\nThe giant Swiss drugmaker has argued that tightening of intellectual\nproperty laws would boost investment in developing more medicines, and\nsays that the Indian patent system stifles innovation. The Madras High\nCourt did not fix a date when it would hand down its ruling on the\nNovartis challenge.\n\nThe affair has become a test-case in a long-running war between \"big\npharma\" and humanitarian cam-paigners who say drug makers are putting\npatents ahead of poor patients. The two-judge court also ordered that\nanother challenge by Novartis to a January decision that rejected its\npatent application for cancer drug, Glivec, be referred to an appellate\nboard, consisting of experts and headed by a former judge. \"We do not\nwant to express any opinion,\" the bench said on the Glivec case.\n\nLast month, Novartis chief executive Daniel Vasella said that the\ncompany did not seek \"popularity awards\" and would continue with its\nlegal action over the Indian patent system to \"serve our patients and\nremain competitive\". In sub-Saharan Africa, home to two thirds of the\nworld's HIV-positive people, the concern is more acute, as some fear\nthe case if it goes in favour of Novartis could undermine India's role\nas a source of cheap generic medicines, especially AIDS drugs.\n\nHumanitarian agency Medecins Sans Frontieres has said tens of thousands\nof people being treated for AIDS will suffer if the Swiss company\nsucceeds in changing India's patent law.\n\nReuters\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}