{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Blue Angels jet crashes during air show, killing aviator", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApr 22, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nBlue Angels jet crashes during air show, killing aviator\n\n\n\n\n\nThe family of the pilot killed Saturday watched as his F/A-18 Hornet crashed\nin a neighborhood during a U.S. Navy Blue Angels precision-flying team air\nshow, Lt. Commander Anthony Walley said Saturday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPolice seek clues from eBay account, Tech victim's laptop\n\n\n\n\n\nInvestigators are examining the computer and cell phone of the woman believed\nto have been the first victim of the Virginia Tech massacre, as well as an\neBay account the gunman may have used.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nWinds push Georgia fire closer to wildlife refuge\n\n\n\n\n\nGusting winds fueled the spread of wildfires Friday in southeast Georgia,\nwhere about 58 square miles of forest were burning and flames swept closer to\nthe Okefenokee National Wildlife Refuge. \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nVirginia Tech killer's family: We are 'living a nightmare'\n\n\n\n\n\nThe family of Virginia Tech killer Seung-Hui Cho feels \"hopeless, helpless and\nlost\" and is \"deeply sorry\" for his \"unspeakable actions,\" according to a\nwritten statement released Friday by his sister.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPerformance review may have sparked NASA shooting\n\n\n\n\n\nPolice said Saturday that a bad performance review may have led a NASA\ncontractor to fatally shoot his supervisor and take another employee hostage\nbefore killing himself.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n13 people indicted in $3 million credit card fraud\n\n\n\n\n\nThe diners didn't know it, but their credit cards were going to pay for more\nthan their meals, prosecutors said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPhony fax gives prisoner almost 2 weeks of freedom\n\n\n\n\n\nOfficials released a prisoner from a state facility after receiving a phony\nfax that ordered the man be freed, and didn't catch the mistake for nearly two\nweeks.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nNigerians vote despite disarray at polls, bombing attempt\n\n\n\n\n\nNigerians hoping for an honest leader to fight endemic corruption voted in\npresidential elections Saturday, but disarray at the polls and a failed truck\nbombing caused unease in a country trying to solidify democratic rule.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUncertainty grips France amid vote\n\n\n\n\n\nFrance began voting for a new president Sunday with the outcome far from\ncertain following one of the country's most closely fought campaigns.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfghan suicide attack kills three\n\n\n\n\n\nA suicide bomber blew himself up Sunday in an east Afghan city, killing three\ncivilians and wounding two police officers, an official said. The attack came\non the heels of a blast at a nearby market that killed a shopkeeper.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n'Active' Castro meets China envoy\n\n\n\n\n\nPhotographs of Fidel Castro meeting with the head of a visiting Chinese\nCommunist Party delegation were published Saturday in Cuba's party newspaper\nin the latest sign the Cuban leader is becoming increasingly active more than\neight months after undergoing emergency intestinal surgery.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nMust I play golf to get ahead?\n\n\n\n\n\nDear Annie: Please settle an argument. I recently started a new job at a\ncompany where all the top executives (and everyone else who wants to be one of\nthem someday) plays golf. I am not athletic at all, a major klutz in fact, and\nI want to try to get ahead here without learning this dumb game. My husband\nsays I am kidding myself and that I had better learn how to play and if\npossible, learn to like it. Is he right? - Junebug\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnother big week on Wall Street coming\n\n\n\n\n\nWith the Dow in uncharted territory and the early wave of earnings reports\ntopping anemic forecasts, things are looking pretty good for the stock market.\nFor now.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nMarty Burns: Shaq, Heat in familiar spot against Bulls\n\n\n\n\n\nCHICAGO -- A 2006 NBA championship ring, flanked by giant matching cuff links,\nwas on display in the locker stall of Heat forward Antoine Walker before Game\n1 of Miami's playoff meeting with the Bulls.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBehind another Turco shutout, Stars force Game 7\n\n\n\n\n\nDALLAS (AP) -- Mike Modano finally scored and Marty Turco had another shutout,\nlifting the Dallas Stars to a 2-0 victory Saturday night and sending their\nseries against the Canucks back to Vancouver for a deciding Game 7.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nCDC helping TV show writers keep the medicine real\n\n\n\n\n\nTwo AIDS doctors made a house call last month to the set of TV's \"Law & Order:\nSpecial Victims Unit.\"\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFruity cocktails count as health food, study finds\n\n\n\n\n\nA fruity cocktail may not only be fun to drink but may count as health food,\nU.S. and Thai researchers say.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nInventors turn creations into cash\n\n\n\n\n\nWhat do the automatic fish catcher, the easy sushi-maker, and the body-shaping\npetticoat all have in common? They're creations of some of the world's most\ninnovative minds for the world's laziest bodies.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReview: 'Ms. Pac-Man,' 'Sudoku' join iPod games lineup\n\n\n\n\n\nApple's popular iPod mobile media device, with 100 million units sold since\n2001, has evolved from a music machine to a digital photo album, video player\nand podcast platform.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nReview: 'Fracture' smoothly entertaining\n\n\n\n\n\n\"Does it bother you that I call you 'Willy'?\" Ted Crawford (Anthony Hopkins)\ninquires of prosecuting attorney Willy Beachum (Ryan Gosling). \"Very well\nthen: Willy ...\" Hopkins teases out every ounce of absurdity he can find in\nthe name. A boy's name, surely, not a name for a high-powered attorney?\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAlec Baldwin explains tirade\n\n\n\n\n\nAs Alec Baldwin's angry words to his daughter were being broadcast around the\nworld, the 49-year-old actor explained himself Friday on his Web site.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}