{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Shannon Lindsay\" <powcknierimdeq@cknierim.de>", "subject": "Pounds down, mood up", "body": "\nMelt away fat easily\n\n\n\n\n\nAnatrim – The latest and most delighting product for corpulent people is now readily available – As you could see on ABC\n\n\n\nDid you realize that excessive body kilos kill more and more people around the planet? We believe you hate the ugly appearance of those people and the social bias against them. \n\nMoreover, you got no will to withstand a siege of your baneful eating habits. Does it all sound familiar? Then we have something for you!\n\n\n\n\n\nHere there is Anatrim, the ultimate product for the reduction of your body’s extra weight. The most amazing thing is that Anatrim raises the quality of your life by making you eat less and giving you better spirit. Read what people write to us about this product:\n\n\n\n\n\n\"It’s great! \n\n\nI stopped watching TV constantly and stuffing myself with food \n\n\nI became more interested in doing exercise.\n\n\n\n\n\n\n Anatrim brought me back on the right path.\n\n\n I have a great figure now and lots of men fix their eyes on me!\"\n\n\n\n\n\n\nSilvia D., Washington\n\n\n\n\n\n\n\"I tried some passive weight burning, you know, but with no result. I was difficult for me to restrain my ravenous appetite. \n\n\nOnce I was told on Anatrim my very best friend by and I was really effected by the information.\n\n\n I had tried taking it, and my wife said I’m not more a weighty man now, 4 months later. \n\n\n25 pounds off and it’s not a limit! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nSteve Burbon, Bellevue WA\n\n\n\n\n\nAnatrim gives you an opportunity to realize you doesn’t have such a great need for the constant eating. It raises your spirit up, provides you with energy, and attacks useless kilos. Great thanks to its powerful distinguished formula!!\n\n\n\nPry out more!\n\n\n\n"}