{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Olin Riley\" <lazclubbersparadisebow@clubbersparadise.de>", "subject": "End the annoying obesity now", "body": "\nStop the painful craving for more food\n\n\n\n\n\n\nAnatrim – The very up-to-date and most fascinating lose flesh product is made available now – As you could see on ABC.\n\n\nDo you retain all the cases when you asked yourself to do anything for being delivered from this fastly growing pounds of fat? Luckily, now no great sacrifice is expected. With Anatrim, the ground-breaking weight-reducing mixture, you can get healthier life style and become really thinner. Have a look at what people say!\n\n\n\n\"It’s unbearably difficult to admit it but I was awfully addicted to food. \n\n\nI ate all this rubbish \n\n\nand was unable to stop. \n\n\n\n\nThis torment stopped when I started taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my craving for food vanished, \n\n\nspirits improved and I turned to the happiest person on the planet 17 pounds in 2.5 months. \n\n\n\n\nSo, I can tell you now I became the happiest person!\"\n\n\n\n\n\nRita R., New York\n\n\n\n\n\n\"Since the very childhood I was a weighty boy. \n\n\nIt’s difficult to imagine how I detested being mocked at school. \n\n\n\n\nI detested my plumpness and I hated myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nThis stuff literally took me out of this terrible nightmare! A lot of thanks to you, guys.\"\n\n\n\n\n\nMike Brown, New York\n\n\n\n\n\n\"You know what? Anatrim preserved my marriage! I went into this circle, depression – eating more – more depression. My wife had thought to leave the overweight psycho I was turning in. \n\n\nMy best friend pointed at your web page and I ordered pack of Anatrim at the same time. \n\n\nThe result was excellent, my appetite became normal, I was in a good mood oftener, and, certainly, I became able to tighten my belt on some holes. And you see, the bedroom became cool also!\"\n\n\n\n\n\nRikky\n\n\n\n\n There are lots of gratitudes happy people leave after trying Anatrim. Don’t you wanna join the thousands and thousands of slim clients and try this original appetite suppressing energy raising product now!\n\n\nDo not lose your opportunity!\n\n\n\n\n"}