{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nDefense Secretary Robert Gates announced today that\n  General Peter Pace is being replaced as chairman of the Joint Chiefs of Staff.\n  Secretary Gates said the move would avoid re-nomination hearings that\n  promised to be “contentious” and “divisive” for the\n  military. David Martin will tell you about the surprising announcement and give\n  you details about the new nominee for the senior-ranking officer in the U.S.\n  military. And I’ll chat with Sharyl Attkisson about the influence\n  lawmakers on Capitol Hill have had on the decision.\n \nFrom Iraq,\n  we’ll bring you a story no one else in the Western media has been able\n  to cover. But our Lara Logan did – she interviewed Sunni insurgents who\n  are now fighting al Qaeda alongside U.S. forces. We’ll show you\n  her story tonight.\n \nPresident Bush said auf\n  wiedersehen today to the members of the G-8 today before stopping\n  in Poland and heading on\n  to Rome. There,\n  the president is scheduled to meet with officials as well as with Pope Benedict\n  XVI, but the timing of his visit could not be worse, as Richard Roth will\n  report.\n \nFinally, for this week’s Assignment America,\n  Steve Hartman will take you to a ranch that’s given some very special young\n  people the summer vacation of a lifetime.\n \nThanks and I hope you have a great weekend!\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}