{"category": "ham", "to_address": "\"Eglin, Jason\" <jason_eglin@merck.com>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] Building package on Windows", "body": "On Tue, 15 May 2007, Eglin, Jason wrote:\n\n> Hello,\n>\n> I have been trying to build a package for R to use on windows.  I have\n> been able to build it with out problems except for one thing.  I am\n> creating a zip file to be installed by the R gui.\n>\n> I have four directories under the main dir.  I have data, man, R, and\n> src.  The problem that I have been having, is that the data directory is\n> being zipped up, then when I  install the package the data directory\n> isn't being unzipped when using the gui (This is the main way many of\n> the users that I work with use R).  When I make my call to build the zip\n> fill it looks like the following:\n>\n>>> R CMD build --binary  --use-zip-help --docs=normal batdebug\n>\n> I have taken out the --use-zip-help flag and I still created the zipped\n> data directory.  I have three items in the data directory, a config file\n> and two java files that are invoked by a dll that is in the src\n> directory.  The three files in the data directory is about 1,200 KB in\n> total size.\n>\n> I have R 1.9.1 installed to build with because it doesn't zip up the\n> data directory like the current version of R.\n\nPackages installed under 1.9.1 will be unusable under current R.\n\n> I have looked into the R documentation to find if I am not using a flag \n> or something.  I have tried the --auto-zip and --use-zip-data flags and \n> neither of these flags did anything different.\n>\n> I have been experiencing this problem with R 2.4.1 ( I have tried with\n> several other versions of R and they all do the same thing since 2.0.0.)\n>\n> Can anyone point me in the correct direction of a flag to include or how\n> to fix this problem.\n\nNot use the data directory for non-R data?  R is perfectly capable of \nunzipping the data for its own use.  As 'Writing R Extensions' says\n\n  The @file{data} subdirectory is for additional data files the package\n  makes available for loading using @code{data()}.  Currently, data files\n  can have one of three types as indicated by their extension: plain R\n  code (@file{.R} or @file{.r}), tables (@file{.tab}, @file{.txt}, or\n  @file{.csv}), or @code{save()} images (@file{.RData} or @file{.rda}).\n\nYou could for example install via the inst directory.\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}