{"category": "ham", "to_address": "\"Sean Flynn\" <sflynn@wcl.american.edu>", "from_address": "\"heeseob nam\" <hurips@gmail.com>", "subject": "Re: [Ip-health] Korea Delay On Pharma FTA", "body": "The waiver is incomplete. Only the application of Article 22.4 (Scope\nof Application of Dispute Settlement Proceedings) is delayed for the\nfirst 18 months.\n\nI mean that an individual drug company holding a patent right on\npharmaceutical product can raise a suit against a generic company to\nblock the marketing approval by relying on FTA text (Article\n18.9:5(b)). The drug company may also take an action against Korean\ndrug approving authority. Further, the drug company can rely on ISD\n(Investor-State Dispute) provision in Chapter 11 (Investment). These\nactions are possible because the waiver regarding the implementation\nobligation of \"linkage\" is only applied to the dispute under Chapter\n22.\n\n--\nHeeSeob Nam\nIPLeft (www.ipleft.or.kr)\nhurips@gmail.com\nTel +49 89 500 280 86\nFax +49 89 6606 2756\nGeitauerstr. 4/1 OG 81379\nMunich Germany\n\n\nOn 02/07/07, Sean Flynn  wrote:\n> This is a multi-part message in MIME format.\n> --\n> [ Picked text/plain from multipart/alternative ]\n> From Inside US Trade:\n>\n>\n>\n> Korea Gets Delay On Pharmaceuticals; Accepts Labor, Environment Text\n>\n>\n>\n> In exchange for fully accepting additional commitments on labor and\n> environment in its bilateral free trade agreement with the United\n> States, the U.S. has accepted Korea*s demand for a delay in implementing\n> the obligation for a patent linkage system.\n>\n>\n>\n> The U.S. has agreed that Korea will not have to implement such a system\n> until the FTA has been in force for 18 months, according to a spokesman\n> for the Office of the U.S. Trade Representative. Instead, the U.S. will\n> only consult with Korea, and refrain from launching dispute settlement,\n> for any patent linkage noncompliance during this grace period, he said.\n>\n>\n>\n> Under a patent linkage system, the Korean Food and Drug Administration\n> would not grant marketing approval for a drug unless it can certify that\n> it does not infringe on a patent.\n>\n>\n>\n> Korea had sought this grace period to help its drug companies, which are\n> not sufficiently developed to take on the obligation more quickly\n> (Inside U.S. Trade, June 29).\n>\n>\n>\n> Korean Trade Minister Kim Hyun-chong this week also demanded that two\n> labor provisions be changed in the new FTA text that the Bush\n> Administration worked out with House Ways and Means Committee Chairman\n> Charles Rangel (D-NY). The USTR spokesman said the U.S. rejected the\n> Korean demands for changes to the labor provisions.\n>\n>\n>\n> Remarking on Korea*s decision to accept the provisions, Korean Prime\n> Minister Han Duck-soo today (June 29) said the new trade policy *is not\n> too burdensome to Korea,* and that its guidelines *coincide with the\n> direction of our domestic labor and environment policies,* as\n> interpreted by a Korean official.\n>\n>\n>\n> The USTR spokesman said the U.S. made *no commitment* on professional\n> visas, as Korea had sought. *That*s something that the administration\n> can always look at with Congress, but there were no commitments made on\n> that,* he said.\n>\n>\n>\n> _______________________________________________\n> Ip-health mailing list\n> Ip-health@lists.essential.org\n> http://lists.essential.org/mailman/listinfo/ip-health\n>\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}