{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Storm System", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nThe \n      Public Eye Chat With...Hannah Storm\"But I never feel like – \n      sometimes what the news is, the news of the day, is let's say Paris Hilton \n      or Lindsay Lohan. Sometimes that can feel, to everybody, \"why are we \n      talking about this?\" But you have to cover the topics that everyone is \n      interested in. You just do it smarter, and more intelligent. And I think \n      we do a really good job of that.\"[+ Read More]\n\nDebate \n      of the Future!Hyperbole Alert! Today’s New York Times \n      discusses an upcoming Democratic debate being co-sponsored by CNN and \n      YouTube. Listen, I’ve said repeatedly here that YouTube is the bull in the \n      political china shop. But let’s not oversell this upcoming debate, \n      either.[+ Read More]\n\nParis \n      In The LightThe press corps hasn't exactly deigned to \n      contextualize the celeb's sentence, even though analysts were pointing out \n      the relative injustice of it back on June 7. Instead of clear-headed and \n      informed reports about Hilton's jailtime, we' ve mostly seen antagonistic \n      stories that feed into our class resentment and angst-ridden relationship \n      with celebrity culture. [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\n'The \n      Early Show' Offers Up The Most Depressing Office Party Tips In \n      History\n \nTigger \n      Vs. Teen\n \nThe \n      Political \n  Playbook\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}