{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Blanche Shepherd\" <pofchirosourcetyd@chirosource.com>", "subject": "Summer is coming, time to tone up", "body": "\nDoctors and Celebrities endorse Anatrim\n\n\n\n\n\nAnatrim – The newest and most delighting product for weighty people is now readily available – As were told on ABC\n\n\n\nDid you understand that excessive body kilos kill a plenty of people around the whole world? We know you hate the unsightly appearance of people like those and the social stigmata attached to them. \n\nOr, maybe, you can’t withstand pressure of your terrible eating habits. If it sounds familiar, then we got something for your consideration!\n\n\n\n\n\nHere Anatrim comes, the later product for the elimination of your body’s extra weight. The greatest thing is that Anatrim improves the quality of your life by repressing your feeling of hunger and giving you joyful spirit. Look at some notes from our customers:\n\n\n\n\n\n\"It is outstanding! \n\n\nInstead of always glutting myself with food and watching TV continually \n\n\nI became more interested in taking exercise.\n\n\n\n\n\n\n Anatrim put me on the right track.\n\n\n I am more fit now and there are lots of men in my way!\"\n\n\n\n\n\n\nVictoria K., Colorado\n\n\n\n\n\n\n\"I tried some passive weight burning, you know, but all came in vain. I could not restrain my ravenous hunger. \n\n\nOnce I heard on Anatrim in the media advertisement and it brought a great influence on me.\n\n\n I had attempted using it, and my wife said I had changed for the better since then, 4 months later. \n\n\n34 pounds off and it’s still far to an end! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nCharley Mock, Boston\n\n\n\n\n\nAnatrim helps you to understand that you don't need that much food. It raises your spirit, provides you with additional energy, and attacks unnecessary kilos. Especial thanks to its powerful distinguished formula!!\n\n\n\nElicit more useful information!\n\n\n\n"}