{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CNN Student News <CNNStudentNews@cnn.com>", "subject": "April 27, 2007", "body": "CNN.com Student News Newsletter\n\n\n\n\n\n\n \nFriday, April 27, 2007 \n\n\n\n Watch and Learn\nThe stage is set for a political showdown in our first report today. Then, we check out a nationwide blackout in Colombia and a famous physicist's experience with weightlessness. And we meet a student who has wrapped up college in just one year.\n\n MIT dean resigns over credentials\nMarilee Jones, a prominent crusader against the pressure on students to build their resumes for elite colleges, resigned Thursday as dean of admissions at the Massachusetts Institute of Technology after acknowledging she had misrepresented her own academic credentials. \n\n April 30, 2007 - MLK Papers\nThrough rare access to the Morehouse College Martin Luther King Jr. Collection, CNN's Soledad O'Brien examines the personal determination and private courage and concerns of the preacher and civil rights leader.Record the commercial-free CNN Classroom Edition every Monday between 4:00 am and 5:00 am ET. Educational materials for the episodes are available at CNN.com/EDUCATION. Please note that CNN Classroom Edition may be pre-empted at any time for coverage of breaking news.\n\n Week of April 23\n1. kryptonite2. Boris Yeltsin3. The Blue Angels4. The Green Grid5. Jessica Lynch6. Russell Simmons7. coconuts8. Dow Jones9. Rio Grande10. Iraq\n\n\n\n\n \nCNN Student News is a 10-minute, commercial-free news program that airs on CNN Headline News at 3:12 a.m. EST as well as on CNN.com/EDUCATION. Created by a team of journalists and educators, the program provides the top stories of the day, segments that encourage student participation, and in-depth special reports. In addition, CNN Student News provides free curriculum at CNN.com/EDUCATION to accompany each program's content. CNN Student News, along with CNN Presents: Classroom Edition, is Turner Broadcasting's contribution to Cable in the Classroom.\n Forward this to a friend\nYou have received this email because you have signed up to receive the CNNStudent News newsletter. Click here to unsubscribeEdit your profile here  \n"}