{"category": "spam", "to_address": "Myrtless <myrtless@flax24.uwaterloo.ca>", "from_address": "Christopher Montoya <darcy@glenoit.com>", "subject": "Report", "body": "\n\nTired with your sexual problems? Can't have sex like you had 10 years ago? \nGo to the site\nYou can spend thousands and buy pills at your local drug store. But you can spend less by ordering the same quality Viagra and Cialis at Online pharmaceuticals.\nAll this you can find here\nInstant shipping worldwide! Confidential purchase!\nWith best regards,\nChristopher Montoya\n \n \nBelyj ili Chernyj? Serdce rvalos iz grudi, v viskah besheno stuchala krov. I kak ego obojti, eto nezhelanie. I ia pozabochus o tom, chtoby Zabrat vse tvoi poslezhizni, kogda prikonchu tebia, Ocenol nebrezhno vzmahnul Zatianutoj v krasnoe rukoj, otdavaia prikaz svoim pancirnikam. A eshche kakaia-to strannaia toska glodala ee dushu. \nIa eshche nemnogo pobudu s Toboj, podozhdu, poka tvoi druzia ochnutsia, chtoby ty ne prikonchil ih, Vospolzovavshis ih sostoianiem. Sily Zla, nu i koshmar zhe mne prividelsia. Ona zametila, chto on chem-to vstrevozhen, i sochuvstvenno podumala o tom, chto, Bud ona v ego shkure, ona byla by vstrevozhena postoianno. On vskinul ruki, zametiv, chto odnovremenno S nim tot zhe zhest prodelal mag adalaev, no ne pridal etomu osobogo znacheniia. Ne raspuskal by sopli. Ia nepodvizhno sidel na kortochkah, i associacii, vyzvannye razmyshleniiami po Povodu ustrojstva etogo bredovogo mira, byli u menia takimi zhe mrachnymi, kak i Sami mysli. Vyronit ia ego ne mog, krome moih Palcev pribor cepko uderzhivalo i biopole, nu a esli ego vyronit druzhinnica, to Na etot sluchaj ostavalos Leshu. Poka ia szhato obrisovyval svoe poseshchenie rezidencii eks-osevogo, vperedi Pokazalos otvetvlenie, othodiashchee ot trassy vpravo. \nSam ty meloch magicheskaia. Onni Belt nikak ne mogla Zabyt volshebnyj mir siglajzera, k kotoromu ej dovelos prikosnutsia. Kak i vsegda. Libo ty stanesh tem, kogo my zhdem, libo net. ejisuminyon XF5FVVtTW1Z0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}