{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Larry Hancock <dave-food@golov.kw.ukrtel.net>", "subject": "Can't find must-have meds at your local drug store?", "body": "\n\nYou need to buy lots of meds, but you don't want to pay huge sums of money? \nClick here to have a nice dick\nBuy Licensed and Quality Viagra or Cialis at US Drug store now and you'll be at the top all night long!\nClick here to have a nice dick\nCompletely conidential and secure purchase.\nWith best regards,\nLarry Hancock\n \n \nGlobula dlia glubokoj meditacii. No krome Dosa v mashine byla i Nori! Stoit emu promahnutsia, I. Etih sushchestv do sih por Schitaiut samymi silnymi magami, kogda-libo obitavshimi v nashej Vselennoj. Krug vgryzalsia v nego, poka telo ne ischezlo polnostiu, ostaviv posle sebia Lish rovnoe zolotistoe siianie, no i na etom ne ostanovilsia. \nSmutnye, skvoz prizmu koshmarnyh videnij, vospominaniia o nochnom holode, Probiraiushchem do kostej nepodvizhnoe telo, zastilali smysl proiznesennyh slov Tiaguchej pelenoj neponimaniia. Da i Nikto ne znal. Golova bezzvuchno shlepnulas na zemliu i bessledno Rastvorilas, nogi bojca tut zhe podognulis, i on ruhnul vniz kuchej Metalloloma. Ty prosto pozhaleesh Posle. Da na tebia. Dorvalsia, nado dumat, do Besplatnyh prikliuchenij. Itak, chem bystree ia prikonchu svoih ptashek, tem Ranshe vzdohnu svobodnee. Zombi ne imeiut Zhelanij. \nOtriad vsadnikov na drakhah slovno plyl po seromu moriu, zahlestnuvshemu Stvoly derevev i kamenistuiu pochvu, pochti sredi polnoj tishiny. Iz portala tem vremenem tekla sploshnaia lavina chzherov elitnyh voinov Dal-roktov, vystraivaias na kamenitovom polotne Tornoj dorogi kolonnoj po chetyre V riad. Serdce szhalos i upalo v temnyj kolodec bezyshodnogo otchaianiia, Ne imeiushchego ni nachala, ni konca. V tom ili Inom vide na etoj planete dolzhna sushchestvovat razumnaia zhizn, nadelennaia Voobrazheniem, prichem poslednee uslovie strogo obiazatelno! Chto za skuka spat Neskolko tysiacheletij i smotret lish svoi sobstvennye sny! Net, Zveriu podavaj Sny chuzhie. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}