{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Computer TV \" <qt2de_2lp@faceturtle.com>", "subject": "Uncensored Internet Television Now Available ", "body": "Hello Subscriber,\n\nsorry to bother you today, but we think you would want to be informed of this information right away.....\n\nWe wanted to inform you today that you can now download a program online that will allow you to watch unlimited television from around the world right on your PC!\n\nJust think about...from the privacy of your laptop or Pc you can watch news from England, or Spain, or the United States. Watch soccer and other sports programming from Mexico, Ireland, France, and sexy programming from Europe. You won't believe how much variety is out there that you are missing! Let us bring the world of entertainment to you 24 hours a day, 7 days a week WITHOUT A MONTHLY FEE!\n\nPress Here For More Information and To Download Now:\n\nhttp://leftgarden.com/t/qt2de_2lp/642590\n\nHere is some more information about this new way to watch television:\n\n1) All of the programming is uncensored!\n\n2) There are hundreds of channels from around the world to watch! And new channels are added every day!\n\n3) Hundreds of Radio stations to listen to anytime, all of the time! And new stations are added daily!\n   \n4) All of these channels are available 24 hours per day right from your PC and laptop!\n\n5) No additional hardware is needed!\n\n6) You won't have to pay a cable or satellite bill any longer!\n \n \nPress Here For More Information and To Download Now:\n\nhttp://leftgarden.com/t/qt2de_2lp/642590\n\n\nOnce you download the software get ready to watch sports, news, sitcoms, music videos, dramas, and other programming from around the world!\n\nTestimonial:\n\n\"It's great to be able to watch the news from my home town. \nI live in San Diego, but I'm able to catch channels from my home town of Tucson. I can't do that with cable, and that's why I'm impressed with PCTV4ME\"! - Sean M.\n\nPress Here For More Information and To Download Now:\n\nhttp://leftgarden.com/t/qt2de_2lp/642590\n \n--------------------------------------------------------------------------------\n \nIf you wish to no longer receive marketing promotions for PCTV4ME just visit the page below and you can easily remove yourself from future electronic mail messages:\n\nhttp://leftgarden.com/t/qt2de_2lp/642591\n\nOr \nsend a letter to us at the address below:\n100 E. San marcos Blvd.\nSuite 370\nSan Marcos, CA 92069\n\n\n\nHi Subscriber! You are receiving this solicitation because producttestpanel@speedy.uwaterloo.ca previously agreed to receive correspondence from ELongView. If this service should fail to meet your expectations, feel free to disassociate yourself from our service.\nhttp://leftgarden.com/u/1527/producttestpanel%40speedy.uwaterloo.ca/2\n\nShould you want to contact us via the United States Postal Service, our address is as follows:\n370 W. Pleasantview Ave Suite 206 Hackensack, NJ 7061\n\n\n"}