{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Scott Berry\" <sberry@northlc.com>", "subject": "Re: help with a bash script", "body": "Hi Travis,\n\nCan you please be just a little bit more specific please.  Okay so are you \ntelling me that I would put in my script apt-get update\nthen /usr/bin/more\napt-get dist-upgrade\n/usr/bin/more\naptget clean\nEnd of Script?\n\nJust not quite clear what you are trying to get me to do.\n\nScott\n\n\n----- Original Message ----- \nFrom: \"Travis Siegel\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Tuesday, May 22, 2007 10:06 PM\nSubject: Re: help with a bash script\n\n\n> You can just about anything you like in a cron job.  if it can run in\n> a script, it can run as a job.\n> Secondly, just run the program (use the whole path and don't rely on\n> the parcer of the interpreter to find it for you.  I.E. /usr/bin/more\n> instead of just more.\n> This prevents hackers from overriding the programs being executed.\n> Also, when you put it in a cron job, the output of the job will be\n> emailed to root (unless you specify otherwise) so you'll know if it\n> worked or not.\n> But, most programs (and I'm sure appget is amoung them) have an error\n> code to determine if they exited successfully or not.\n> Simply test for the code after the program ends if you really need to\n> know, but it shouldn't matter, since you can view the output of the\n> job if so desired.\n>\n>\n> On May 22, 2007, at 8:53 PM, Scott Berry wrote:\n>\n>> Hello guys and gals,\n>>\n>> One more question here.  I want to create a bas script for my Dad\n>> which does the following:\n>> 1 Does apt-get update and when apt-get update gets done it knows\n>> that it has been completed successfully.\n>> 2.  Do apt-get dist-upgrade and knows when it gets done.\n>> 3.  Do an apt-get clean.\n>> Also for those who have more experience than me I have a question\n>> too.  Is it wiser for me to run that in a shell console of it's own\n>> or just have him run that under gnome terminal.  My goal at the\n>> very end is to cron this so this can run at night for him.\n>>\n>> Scottat updates can be\n>> _______________________________________________\n>> Speakup mailing list\n>> Speakup@braille.uwo.ca\n>> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>>\n>>\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n>\n> -- \n> No virus found in this incoming message.\n> Checked by AVG Free Edition.\n> Version: 7.5.467 / Virus Database: 269.7.6/814 - Release Date: 5/21/2007 \n> 2:01 PM\n>\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}