{"category": "ham", "to_address": "Roland Rau <roland.rproject@gmail.com>", "from_address": "Peter Dalgaard <P.Dalgaard@biostat.ku.dk>", "subject": "Re: [R] R Book Advice Needed", "body": "Roland Rau wrote:> Hi,>> ngottlieb@marinercapital.com wrote:>   >> I am new to using R and would appreciate some advice on>> which books to start with to get up to speed on using R.>>>> My Background:>> 1-C# programmer.>> 2-Programmed directly using IMSL (Now Visual Numerics).>> 3- Used in past SPSS and Statistica.>>>> I put together a list but would like to pick the \"best of\" >> and avoid redundancy.>>>> Any suggestions on these books would be helpful (i.e. too much overlap,>> porly written etc?)>>>> Books:>> 1-Analysis of Integrated and Co-integrated Time Series with R (Use R) ->> Bernhard Pfaff>> 2-An Introduction to R - W. N. Venables>> 3-Statistics: An Introduction using R - Michael J. Crawley>> 4-R Graphics (Computer Science and Data Analysis) - Paul Murrell>> 5-A Handbook of Statistical Analyses Using R - Brian S. Everitt>> 6-Introductory Statistics with R - Peter Dalgaard>> 7-Using R for Introductory Statistics - John Verzani>> 8-Data Analysis and Graphics Using R - John Maindonald;>> 9-Linear Models with R (Texts in Statistical Science) - Julian J.>> Faraway>> 10-Analysis of Financial Time Series (Wiley Series in Probability and>> Statistics)2nd edition - Ruey S. Tsay>>     >> as one other message says, it depends a lot on your ideas what you want > to do with R. And, I'd like to add, how familiar you are with statistics.> One book I am missing in your list is Venables / Ripley: Modern Applied > Statistics with S. I can highly recommend it.> If you are going to buy yourself only one book, then I would say: buy > Venables/Ripley>>>   And given the programming background, also check out the other V&R book,\"S Programming\". (This is about R too).\n\n--    O__  ---- Peter Dalgaard             Øster Farimagsgade 5, Entr.B  c/ /'_ --- Dept. of Biostatistics     PO Box 2099, 1014 Cph. K (*) \\(*) -- University of Copenhagen   Denmark          Ph:  (+45) 35327918~~~~~~~~~~ - (p.dalgaard@biostat.ku.dk)                  FAX: (+45) 35327907\n______________________________________________R-help@stat.math.ethz.ch mailing listhttps://stat.ethz.ch/mailman/listinfo/r-helpPLEASE do read the posting guide http://www.R-project.org/posting-guide.htmland provide commented, minimal, self-contained, reproducible code.\n\n"}