{"category": "spam", "to_address": "<the00@plg.uwaterloo.ca>", "from_address": "\"0ferta!!! Mp4 Player 2 GB \" <tbuampmtvk@msn.com>", "subject": "Nuevo! con Videos Mp3 FM Grabadora de Voz Pen Drive", "body": "\n\nDocumento sin título\n\n\n\n\n\nREPRODUCTOR MP4 DE 2 GB \nOFERTA! $299 Pesos! Envio GRATIS \nDISPONIBLE EN 5 COLORES!!!\n \nPlateado,Negro,Rosa,Azul,Verde \n \nFUNCIONES PRINCIPALES \nAlmacena aproximadamente 500 temas en MP3.\n    Menú Interactivo (MÚSICA, VIDEO, GRABADOR DE VOZ, VOZ, RADIO FM, FOTOGRAFÍAS, CONFIGURACIÓN, E-BOOK)\n    Formato de música: MP3, AMV, MTV, WAV, WMA, WMV, MP1, MP2, AFS, Etc.\n  Soft Conversor de VIDEO: AVI, DAT, MPG, MPEG, WMA, WMV, RM, RAM a AMV\n  Imágenes: JPG, GIF, JPEG, JPE, BMP, etc\n  PEN DRIVE, almacena cualquier tipo de archivos sin importar la extensión\n  Radio - FM Incorporado (Grabación de 20 estaciones). 87.5 ~ 108 Mhz\n  Grabación de FM - Graba tus programas preferidos mientras los escuchás\n  Grabación - Grabación de voz con MIC incorporado\n  Alta Calidad de Grabación: en WAV a 32kbps (Más de 100 HS)\n  14 Idiomas: Español, Inglés, Portugués, Alemán, Italiano, Francés, Chino, Japonés, Coreano, Etc.\n  Reloj Interno\n  Navegación - Carpetas (para ordenar películas, videos, música, datos, programas y archivos de todo tipo)\n  Lyrics: Muestra la letra de los temas y Reproducción de texto sincronizada con la música\n  Drivers - Compatible con Windows98 / SE / Me / 2K / XP, Mac OS y Linux\n  Ahorro de Energía: Apagado de luz de pantalla configurable entre 3-30 segundos\n  Memory Flash Samsung\n  USB - Full Speed, USB 2.0 / 1.1\n  LCD display 1.5 INCH 65K color display\n  Ecualizador: Normal / Rock / Pop / Classic / Soft / Jazz\n  Batería recargable incorporada (recarga con cargador o con la PC por usb)\n  Peso: 38gr\n  Dimensiones: 7,5 cm x 3,9 cm x 09mm\nEQUIPOS NUEVOS EN CAJA!!!\n3 MESES DE GARANTIA ESCRITA  \nIMAGENES REALES!!\n \n(si no puede ver la imagen haga click aqui)\n\nINCLUYE LOS SIGUIENTES ACCESORIOS: \n(Cargador 220v, 1 Juego de auriculares,Cable USB,CD,Manual, funda de silicona)\n\n \nENVIOS GRATIS A TODO EL PAIS!!\n\nCapital Federal y Gran Buenos Aires entrega en 24 HS\n  Por moto mensajeria, usted lo paga cuando recibe.\nInterior del Pais entregamos en 24 a 72 HS por Correo Argentino\n  Envio contra reembolso, con seguimiento del envio por internet\n  Usted paga al cartero cuando recibe el reproductor. \n\nENVIOS GRATIS A TODO EL PAIS!!\nMP4 DE 2 GB\n $299 PESOS, ENVIO GRATIS\n   ///COMPRAR CLICK ACA/// \n\n \nQUITAR de la lista de novedades para no recibir mas ofertas Click aqui  \n\n\n\n"}