{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nHamas has taken almost complete control over the\n  Gaza Strip and is claiming its \"liberation\" as government fighters\n  retreat. President Mahmoud Abbas dissolved the Palestinian government today\n  and declared a state of emergency and at least 20 Palestinians have died in\n  the latest battles. Richard Roth will have the latest from Israel and Bill Plante will report from the\n  White House on what the U.S.\n  government’s next move may be. \n \nIn Washington,\n  a judge ruled that \"Scooter\" Libby, Vice President Cheney’s\n  former chief of staff, cannot remain free while appealing his sentence\n  — he must spend the time in jail. Bob Orr will report on the more immediate\n  pressure the ruling puts on President Bush to make a decision about whether\n  to pardon Libby.\n \nSome known sex offenders have been nabbed in Texas for violating\n  their parole — thanks to MySpace. Hari Sreenivasan will report on how\n  the social-networking site is helping police track predators. \n \nWatching Saturday morning cartoons might soon be a\n  little less sweet. Kellogg's says it will no longer advertise its sugary\n  cereals and snacks to kids. That’s due to a lawsuit, but child-health\n  advocates hope the move influences other marketers, Nancy Cordes will report.\n \nThere’s a mystery at the Georgia Aquarium in Atlanta:\n  Something’s killing the whale sharks, Mark Strassmann will report.\n \nFinally, Kelly Wallace met a pair of doctors who are\n  among the country’s top prostate cancer researchers. But they’re\n  not just in the same field — they’re siblings. Both got their\n  love of science from their dad — and their life-long mission as well.\n \nI hope you'll join us for these stories and more,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}