{"category": "ham", "to_address": "debian-devel@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Steve Langasek <vorlon@debian.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "On Mon, Jun 04, 2007 at 08:01:24PM +1000, Anthony Towns wrote:\n> On Mon, Jun 04, 2007 at 02:42:24AM -0700, Steve Langasek wrote:\n> > On Mon, Jun 04, 2007 at 06:49:54PM +1000, Anthony Towns wrote:\n> > > If you're claiming \"you don't get to exercise your right to argue\n> > > about jurisdiction\" is equivalent to \"you must pet a cat\", then, IMO,\n> > > you need to argue the same thing about \"you don't get to exercise your\n> > > patent rights\".\n> > You're aware that most of the people arguing that choice of venue clauses\n> > are non-free also hold the opinion that patent non-enforcement as a\n> > condition of the copyright license is also non-free?\n\n> No, not at all. It's been years since I've followed -legal, and I\n> certainly don't keep track of who thinks what. I fundamentally don't\n> think it *matters* what individual subscribers to -legal think.\n\nI'm just saying that \"you need to argue the same thing\" isn't much of a\nbarrier, since AFAIK the people arguing against choice-of-venue clauses on\nthis theory have already done so in the past and are likely to do so again\nif given cause ;)\n\n> What I care about is having a reasonable, widely understood definition\n> of free software that meshes with the rest of the free software and open\n> source community, that Debian can use to work out what software we'll\n> distribute in main.\n\nThat's a good goal; but Debian has disagreed with other folks in the past\nbecause we believed their interpretations were irrational and contrary to\nthe long-term interests of Free Software, and it's my own opinion that\nvarious folks in the wider community are in this position today, so I hope\nthat such meshing is the result of a sustained dialogue and not just Debian\ngiving in to whatever the folks with the cool technology of the day that\neveryone wants to use have are peddling as a license.\n\n-- \nSteve Langasek                   Give me a lever long enough and a Free OS\nDebian Developer                   to set it on, and I can move the world.\nvorlon@debian.org                                   http://www.debian.org/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}