{"category": "ham", "to_address": "\"General Copyright Discussions \\(questions, organizing,\n\tetc\\)\" <discuss@list.digital-copyright.ca>", "from_address": "Russell McOrmond <russell@flora.ca>", "subject": "Re: [d@DCC] MS censors UN document", "body": "Scott Elcomb wrote:\n> There are many areas in which I could use schooling - politics first\n> among them.  =)\n\n  MS had such extreme input into WSIS process, via specific country\nrepresentatives, for the same reason why CRIA's Graham Henderson has the\near of the Heritage Minister(s) (Conservative or Liberal) and Heritage\nCommittee.  Henderson is able to set up meetings trivially.  These\npoliticians actually trust these special interests as being a source of\nuseful information.  They mistakenly believe these special interests are\nsomehow the public interest.\n\n  It is our job to try to help educate politicians as to the difference\nbetween these special interests and the public interest, especially when\nthe two are in such extreme conflict.\n\nIE: I really wonder why providers of historically expensive equipment\nfor recording, editing and distributing/broadcasting content are still\noffered copyright at all now that these technologies are cheap enough to\nbe in the hands of everyone.   The sections of the Canadian copyright\nact that grant rights to \"makers\" of recordings and broadcasters should\nbe repealed.\n\n\n  See the latest in the USA where the redundant recording labels now\nwant the regime that makes radio work (compulsory licensing for\ncomposers, no royalty for makers or performers) repealed so that they\n(the redundant \"makers\" of recordings) can take the lions share of the\nmoney away from composers and performers (the only parties that should\nhave copyright at all).  The falsely claim is that this is about getting\nmoney for performers, when it is really about \"makers\" taking it away\nfrom songwriters, and there are uninformed politicians that believe them.\n\n\n\n\n-- \n Russell McOrmond, Internet Consultant: \n Please help us tell the Canadian Parliament to protect our property\n rights as owners of Information Technology. Sign the petition!\n http://www.digital-copyright.ca/petition/ict/\n\n \"The government, lobbied by legacy copyright holders and hardware\n  manufacturers, can pry my camcorder, computer, home theatre, or\n  portable media player from my cold dead hands!\"\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}