{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nTuesday, 24 April, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nLive - Man Utd v AC Milan\nMan Utd host AC Milan in the first leg of their Champions League semi-final.\n\n\n\n \nRanson bids to take over Man City\nFormer Manchester City player Ray Ranson confirms his interest in buying the club.\n\n\n\n \nWe do not fear Milan - Ferguson\nMan Utd boss Sir Alex Ferguson is confident ahead of Tuesday's Champions League match with AC Milan.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nMickelson signs up coach Harmon\nPhil Mickelson turns to swing coach Butch Harmon in a bid to improve the accuracy of his long game.\n\n\n\n \nMuirfield seniors bow for Faldo\nNick Faldo will return to the scene of his 1987 and 1992 Open wins for his Seniors Tour debut in July.\n\n\n\n \nSorenstam loses number one status\nLorena Ochoa takes over as world number one from Annika Sorenstam.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nRaikkonen urged to get technical\nKimi Raikkonen's former team boss hints the Finn could be even better if he paid more attention to his role outside the car.\n\n\n\n \nPedrosa should be ready for China\nHonda's Dani Pedrosa should be able to ride in the Chinese MotoGP despite crashing out in Turkey last weekend.\n\n\n\n \nTurkey to keep F1 race until 2021\nFormula One supremo Bernie Ecclestone guarantees the future of the Turkish Grand Prix for at least the next 15 years.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nRaikkonen urged to get technical\nKimi Raikkonen's former team boss hints the Finn could be even better if he paid more attention to his role outside the car.\n\n\n\n \nTurkey to keep F1 race until 2021\nFormula One supremo Bernie Ecclestone guarantees the future of the Turkish Grand Prix for at least the next 15 years.\n\n\n\n \nBMW may offer Heidfeld new deal\nNick Heidfeld's impressive start to the season could go a long way to landing a new deal with BMW Sauber.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nRadcliffe not in GB marathon team\nGB's marathon team for the World Athletics Championships is named but does not include Paula Radcliffe at this stage.\n\n\n\n \nYamauchi voices Osaka heat fears\nMara Yamauchi warns conditions in Osaka at the World Athletics Championships will be even tougher than during the London Marathon.\n\n\n\n \nRunner dies after London Marathon\nA 22-year-old runner who was taken ill after completing the London Marathon dies in hospital.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nBasso suspended after new charges\nIvan Basso is suspended by his Discovery Channel team after being summoned to an Italian Olympic Committee doping hearing.\n\n\n\n \nLandis anger at 'malicious' tests\nFloyd Landis is 'infuriated' with US  anti-doping officials after his representative is excluded from the French laboratory testing his B samples.\n\n\n\n \nTour will snub dope-probe riders\nTour de France chief Christian Prudhomme says riders implicated in the Spanish doping scandal will not be welcome at this year's race.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nQuotes of the Week\nRafa Benitez on his Scouse daughter, plus Mick McCarthy and St Albans chant\n\n\n\n \nTuesday's gossip column\nReal Madrid eye William Gallas, plus other rumours\n\n\n\n \nComment: Spot of bother for Jose\nRobbo on Mourinho's claims of referees favouring Man Utd\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}