{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Spie Sutherland\" <spie@proficio.ca>", "subject": "Re: Jeez, what hassle.", "body": "Michael,\n\n> Well, I get half-way through the Slackware install and then try to \n> install to the root partition and that's as far as I can go. \n\nAre you talking about installing lilo, where it gives you the option\nof installing it to either the master boot record (MBR) or the \nsuperblock of the root partition?\n\nI always use the MBR not the superblock, but if you are \ntalking about lilo install failing, you actually have not lost your\nwhole install, just the bootloader install. Sometimes the lilo \ninstall will fail, and if so you keep going to the end of the \nslackware install, then you can do what I've been saying \nabout booting any drive that won't boot:\n\nBoot from floppy or CD-ROM with the generic kernel,\nI think even a disk with the speakup kernel will work, \nbut you need to do this at the boot prompt:\n\nboot: \nbare.i root=/dev/hda1 noinitrd ro\n\nThat would be using the slackware bare.i kernel, \nbut I think you could do the same with speakup \nkernel like this:\n\nboot:\nspeakup.s speakup_synth=ltlk root=/dev/hda1 noinitrd ro\n\nYou're loading the kernel from removable media but \nbooting to the root filesystem on hard drive. Even if \nlilo failed to install, once you have booted the new system\nthis way, check the lilo.conf to make sure it look correct\nthen just run lilo to install the bootloader\n\nlilo -v\n\n>  Is there a way to install slackware that bypasses all the \n> stupid menus? \n\nNo because it launches all of the various scripts that \ncreate all the directories and unpack all the tar files,\ncreate config files etc.\n\n\n> The docs say just to type in the kernal's name: speakup.s\n\nspeakup.s\n\nThis is like the bare.i (standard IDE) disk, but has support for Speakup \n(and since there was space, support for Adaptec's AIC7xxx SCSI \ncontrollers is also included) Speakup provides access to Linux for the \nvisually impaired community. It does this by sending console output to \na number of different hardware speech synthesizers. It provides access \nto Linux by making screen review functions available. For more \ninformation about speakup and its drivers check out: \nhttp://www.linux-speakup.org. To use this, you'll need to specify one \nof the supported synthesizers on the bootdisk's boot prompt:\n\nramdisk speakup_synth=synth\n\nwhere 'synth' is one of the supported speech synthesizers: acntpc, \nacntsa, apolo, audptr, bns, decext, dectlk, dtlk, ltlk, spkout, txprt\n\nThis is from here:\nhttp://www.slackware.com/install/bootdisk.php\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}