{"category": "spam", "to_address": null, "from_address": "\"Jackpot@microsoft.com\" <Jackpot@microsoft.com>", "subject": "MICROSOFT MEGA JACKPOT LOTTERY PROMOTIONS", "body": "\n\n\nMICROSOFT MEGA JACKPOT LOTTERY PROMOTIONS, EMAIL AWARD PROMO:UNITED KINGDOM\n\nFinally today, we announce the winners of the MICROSOFT MEGA JACKPOT\nLOTTO WINNINGS PROGRAMS held on the 5th of April  2007. Your company or\nyour personal e-mail address, attached to winning,with serial number\n647489,consequently won in the Tenth lottery category.\n\nYou have therefore been approved to claim a total sum of 500,000,00\n(FiveHundred Thousand Britain Pounds Sterlings) in cash Credited to\nfile REFNO:MSW-L/200-26937,BATCH NO:2005MJL-01 and winning number (23) (76)\n(06) (54)(42)(100) this is from a total prize money of 12,500,000.00\nGBP,shared among the Twenty five(25)international winners in this category.\n\nAll participants were selected through our Microsoft computer ballot\nsystem drawn form 42,000 Names, 6,000 names from each continent, as\npart ofInternational \\\"E-MAIL\\\" Promotions Program, for our prominent\nMS-WORD user all over the world, and for the Continuous use of Email.\n\nYour fund (certified Cashiers cheque) has been insured with your REFNO:\nMSW-L/200-26937 and winning number (23) (76) (06) (54) (42) (100). To\nclaim your winning prize, you must first contact the claims department\nby email for Processing and remittance of your prize money to you.Our\nClaims Processor will immediately commence the process to facilitate\nthe release of your funds as soon as you contact him.\n\nFor security reasons, you are advised to keep your winning information\nconfidential till your claim is processed and your money remitted to\nyou in whatever manner you deem fit to claim your prize. This is part\nof our precautionary measure to avoid double claiming and unwarranted\nabuse of\nthis program. Please be warned.\n\nThe claims processor is:\nName: Mike Woods\nEmail:mikewoods2007@yahoo.gr\n\nDo email the above email addresses, at once. In order to avoid\nunnecessary delays and complications, please remember to quote your\nreference and winning numbers in all correspondences with your claims\nofficer.\n\nPLEASE NOTE THAT YOU ARE TO SEND THE BELOW INFORMATIONS REQUIRED TO\nCLAIM YOUR WINNING PRIZE:\n\n1. Full Name: ......................................\n2. Address:.........................................\n3. Nationality: ......................................\n4. Age: ...................................................\n5. Occupation: .....................................\n6. Phone:............... Fax:........................\n7. Country:............................................\n8. Sex......................................................\nCONGRATULATIONS!!! ONCE AGAIN FROM THE MEMBERS OF STAFF OF MICROSOFT\nLOTTERY\nPROMOTIONS.\n\n\nYOURS SINCERELY\n\nMRS ELINA POWELLS.\n\n"}