{"category": "ham", "to_address": "Zombie <ktwarwic@flax9.uwaterloo.ca>", "from_address": "CNN <CNN@access.cnn.com>", "subject": "CNN.com June Update", "body": "\n\nCNN.com June Update\n\n\n\n\n\nMember Center\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee the latest evolution of CNN.com\n\n\n\n\n\nStarting July 1st, you'll be watching news in a whole new way at CNN.com. Until then, you're invited to preview the site and let us know what you think. Take a video tour of some new features and functions or simply explore the site. \n\nLook for the +Feedback links and make sure you get your opinion in before the preview ends.\n\nTake the tour\nGo to CNN.com beta\n\n\n\n\n\n\nIs that for real?\n\n\n\n\n\t\t\t\tNaked cyclists protesting. Dogs employed by a Japanese nursing home. In the midst of covering essential breaking news, international stories and political coverage, occasionally CNN uncovers news that even journalists find hard to believe. Check out some of the head-scratching stories that you have to see to believe.\nLightening shreds man's pants\nGolfer saves drowning dog\nNude cyclists pedal away\n\nMore offbeat stories and video\n\n\n\n\n\n\n\n\nAngelina Jolie: fame, family and \"A Might Heart\"\n\n\n\n\n\t\t\t\tTonight Angelina Jolie speaks with Larry King on playing Mariane Pearl, a real-life pregnant wife caught in a tragic tale of terror, in her new film, \"A Might Heart.\"\nWatch Larry King Live tonight at 9 p.m. ET\n\n\nFor highlights, watch Larry King's New weekly podcast, debuting tomorrow, Friday June 15.\nWatch podcast\n*load time may vary\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat's Hot on CNN.com?\n\n\n\nLast Week's Top Stories\n\n\n•Paris Hilton ordered back to jail\n•Paris Hilton out of jail\n•Bond set at $5 million in Kelsey Smith slaying\n\n\nLast Week's Top Videos\n\n\nTeen kidnapping video released\nHundreds of jumbo squid on California coast\nBono takes off his glasses\n\n\nSign up to receive The Daily Top 10 e-mail, CNN.com's most popular stories and videos of the day.\n\n\n\n\nHe said what?\n\n\n\n\nAsk Headline News' Glenn Beck anything and chances are he'll either know the answer or lie so convincingly that you won't ever know the difference. His weekly podcast, Sick Twisted Freak, gives him yet another platform to give his own unique take on everything from world events and politics to pop culture and everyday hassles.\n\nSubscribe\nWatch podcast\n*load time may vary\n\n\n\n\n\nMember Center\n\nWant to update your preferences or add services?\nLog in to Member Center\n\n\n\n\n\n\n\n\n\nMake sure you receive our e-mails. Please add \n \nCNN@access.cnn.com to your address book.\nYou are receiving this e-mail because you have agreed to receive notice of new features and special offers from CNN.com.\nTo unsubscribe from CNN Member Center e-mails, click \n \nhere.\nCNN.com Privacy Policy\nOne CNN Center Atlanta, GA 30303\n2007 © & ® 2007 Cable News Network\n\n\n\n\n"}