{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "Reliable Sources <reliablesrc@mail.cnn.com>", "subject": "This Week on Reliable Sources", "body": "\n\n\nCNN.com\n\n\n\n\n\n\n\n\n\n\nComing up this Sunday on Reliable Sources: \n\nDan Rather vs. CBS\n\nDan Rather's comments\nthis week that CBS had been \"dumbing down and tarting up\" the\nnews set off a war of words between Rather, CBS Chief\nExecutive, Les Moonves, and CBS Evening News' Executive\nProducer, Rick Kaplan.\tAre Rather's comments simply sexist\nsour grapes towards the network who let him go, or does he have\nsome legitimate criticism of CBS?\n\nToo Much Iraq\nCoverage?\n\nAfter a report by the Project for\nExcellence in Journalism showed that Fox News was devoting far\nless time to the Iraq war than rivals MSNBC or CNN, Bill\nO'Reilly charged CNN and MSNBC with showing violence in Iraq\nsimply to make President Bush look bad.  He also took aim at\nthe authors of the report.  Is there such a thing as too much\nIraq coverage?\tWe'll analyze the charges.\n\nCNN/YouTube Debates\n\nWith the Internet\nbecoming an integral part of the Presidential Campaign, CNN is\njoining forces with YouTube to host the next Presidential\ndebates. We'll tell you how that will work. Also, \"Obama Girl,\"\nis the latest sensation affecting the campaigns, in the new age\nof viral video are candidates losing control of their images?\n\nPlus, Democratic Strategist Bob Shrum has been\nspinning the media for decades.  He opens up about why he may\nnot have always been honest with the press.  And Paris Hilton\nclaims she will start using her media spotlight for good\ncauses, should we believe her?\n\nJoin us this Sunday\nand every Sunday at 10am ET / 7am PT for our critical look at\nthe media! \n\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the Reliable Sources list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=reliablesrc\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}