{"category": "spam", "to_address": "\"Gregory Anthony\" <theorize@plg.uwaterloo.ca>", "from_address": "\"Ruby G. Leonard\" <Ruby@theburbs.plus.com>", "subject": "Just another email from Ms. Leonard", "body": "Treat yourself and your woman to a marvelous, sensual experience.\n\nIntroducing the Vibration Ring \n\nIts patented design is both comfortable and washable. The Ring section\neasily stretches to fit any size and is made of non-toxic silicone rubber\nmaterial that is both soft and hygienic.\n\nThe Vibration Ring features a raised tickler with thinly sculptured ridges\nespecially designed to stimulate her c-spot and a micro vibration motor\nwhich produces pulsating sensations through the shaft promoting multiple\npleasures.\n\nIt's self-powered & has a switch to turn the device on and off as you\nchoose. So you're in control.\n\n\nhttp://internet18.allyourstonight.net\nToo much fun in such a small package! Good times lay ahead!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nManage your email preferences -\nhttp://internet18.allyourstonight.net/index.asp\n\n\n\nwho had taken to writing lot of letters after article about the gun\ndesigner appeared in national magazine. letters had quoted Shakespeare lot\npraised Gregory's inventions and forsooth, that the would only be used on\nscum of the world which deserved kind of end. Gregory liked the literary\nstyle it was the fanciest he had ever seen and had started \ncorrespond with him. The actor's name was Lizzard. He was an emaciated\nsix-foot-five. carried doctor's leather bag him, in which carried makeup for\ndisguises. His skill was that, fully made up, he mask his height look barely\nsix-feet-four. All four men now sat poolside at Sam Elberon estate. Gregory\nwas drawing chart. He himself as the commander big pencil-drawn box. Below\nhe had three other smaller pencil-drawn boxes. them he put army's names:\nMark \nAl Baker, Nicholas He drew ones all the boxes. \"This is our of\norganization,\" he He looked around the table. Nicholas was pouring refill of\nVodka into water glass. Mark Tolan was down the barrel of unloaded Gregory\nSur-Shot at duck on the far side of the pool. Only Al Baker looking at the\nchart. was rubbing his together nervously. \"Nice table of organization,\" he\n\"Like we had in the \nwhen was soldier, managed to with my life. me to tell you about it-\" \"Not\nright Gregory said. He toward Mark Tolan. \"Stop that,\" he Tolan was staring\ndown sights of the Gregory Sur-Shot at point halfway between Gregory's eyes,\nsqueezing the Behind the butt of the gun and hand, his face was impassive,\ndarkly He gave no sign that he had\n\n\nCiao\n\n\n\nRuby\n\n\n"}