{"category": "ham", "to_address": "Todd Stecher <todd.stecher@isilon.com>", "from_address": "=?ISO-8859-1?Q?Love_H=F6rnquist_=C5strand?= <lha@kth.se>", "subject": "Re: SPNEGO in Samba - Longhorn Server interop issues...", "body": "4 jul 2007 kl. 01.10 skrev Todd Stecher:\n\n> When Windows shipped, there were no other SPNEGO implementations to  \n> test against, and so Windows really didn't match SPNEGO RFC 2478  \n> 100%.  Eventually, Larry, Paul \"Mr. CIFS\" Leach, & company at  \n> Microsoft made an effort to clean this mess up, and revisit the  \n> standard so that everyone could play well together.  The end result  \n> is RFC 4178, which supersedes 2478.\n>\n> As such, in early versions of Windows SPNEGO, there were some  \n> \"extra\" fields added to the negTokenInit message which are being  \n> deprecated in Vista, Longhorn Server, and eventually service packs  \n> for older platforms.  The most significant of these fields is the  \n> principal name - there is really no place in either standard which  \n> allows the return of a principal in negTokenInit messages.  This is  \n> being corrected for in Vista and Longhorn server by continuing to  \n> add the field, but instead of a \"real\" principal, it now contains  \n> \"not_defined_in_RFC4178 at please_ignore\".\n>\n> From a security standpoint, allowing the server to specify its  \n> service principal is a \"bad idea\" - I'm OK with this change, but it  \n> means we'll need to fix up some Samba code, and we'll need to start  \n> using / generating real service principal names in order to get  \n> Kerberos authentication.  Currently, we try to get a service ticket  \n> to the @please_ignore realm!!!\n>\n> Volker made a fix in cliconnect.c (http://lists.samba.org/archive/ \n> samba-cvs/2006-October/071344.html) to partially address this.   \n> However, this does not address issues when operating against  \n> Longhorn Server (Windows 2008 server?).  I'm sorting through the  \n> issues, but the first error occurs when trying to join a Samba  \n> server to the domain - the code in ads_sasl_spnego_bind() uses this  \n> principal to attempt to get a Kerberos ticket to the ldap head.\n>\n> I'm sure this is the first layer of the onion (there are encoding  \n> issues in the old Microsoft implementation as well), but there'll  \n> be more - before I get too deep, is this work already being done  \n> elsewhere???  If not, I should be able to get fairly solid Longhorn  \n> Server interop moving forward in the next week, and will submit a  \n> patch.\n\nWe have an implementation RFC4178 in Heimdal, its farly easy to test  \nit with LH with gssmaggot/gssmaster (or using heimdal's gssmask/ \ngssmaestro).\n\nLove\n\n\n"}