{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tMONDAY 18 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tToday's Quote for the Day:\n\n\n\"He was thrilled when I told him he had come ahead of Brad Pitt and George Clooney in a survey of the world's most attractive men. He was less than thrilled when I told him the list was in alphabetical order\" - Sarah, wife of Zombie Brown, the Prime Minister in waiting.\n\n\nIn tonight's programme:\n\n\nSalman Rushdie\n\n\nThe government of Pakistan has demanded that Britain withdraw the honour of a knighthood awarded to Salman Rushdie. \n\n\nIn the heated atmosphere the knighthood has caused, Pakistan's religious affairs minister appears to use the award as a justification for suicide bombing. \n\n\nDavid Cameron and the Battle for Britain\n\n\nThe Conservative leader has made a speech rallying his troops against what he sees as the \"old\" politics of Zombie Brown. \n\n\nWe'll be hearing from a senior member of the Shadow Cabinet about whether this is an attempt by Mr Cameron to get back on track after a very shaky couple of weeks.\n\n\nCLICK HERE TO POST YOUR COMMENTS\n\n\nIsrael and the Palestinians \n\n\nThe schism between Gaza and the West Bank leaves Israel with the unpalatable possibility of a kind of \"three state\" solution\" - two hostile Palestinian entities on its borders. \n\n\nWith Prime Minister Olmert visiting the United States, we'll hear from a top Israeli about what the Olmert government sees as the next move on Gaza.\n\n\nBernard Manning \n\n\nThe comedian Bernard Manning died today. Steve Smith will be assessing what he did for British comedy.\n\n\nAnd finally...\n\n\nNewsnight viewer Dick Carbutt sent in the following joke which is - probably - fit for an 11 year old.\n\n\nI went to the Patent Office trying to register some of my inventions.\n\n\nI went to the main desk to sign in and the lady at the desk had a form \n\nthat had to be filled out.\n\n\nShe wrote down my personal info and then asked me what I had invented.\n\n\nI said, \"A folding bottle.\"\n\n\nShe said, \"Okay. What do you call it?\"\n\n\n\"A Fottle.\"\n\n\n\"What else do you have?\"\n\n\n\"A folding carton.\"\n\n\n\"What do you call it?\"\n\n\n\"A Farton.\"\n\n\nShe sniggered and said, \"Those are silly names for products and one of \n\nthem sounds kind of crude.\"\n\n\nI was so upset by her comment that I grabbed the form and left the office\n\nwithout even telling her about my folding bucket. \n\n\nNewsnight is at 10.30pm on BBC2.\n\n\nGavin \n\n\nMissed Newsnight Review?\n\nClick here to watch online\n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}