{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "Direct2Drive <owner-d2d_cp_announce_list@news.ign.com>", "subject": "Download Silent Hunter 4 on Direct2Drive today!", "body": "\n\n\nDirect2Drive\n\n\n\n\n\n\n\n\nApril 13th, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRome: Total War Gold Edition - $29.95\nOnce the Roman Empire is under your command, don't lay down your sword just yet - the Barbarians are coming...\n \nCivilization 4 + Warlords Bundle - $59.95\nCivilization IV comes to life like never before in a beautifully detailed, living 3D world that elevates the gameplay experience to a whole new level... \n \nMedieval 2: Total War - $49.95\nThe Golden Age of railroading is back with Sid Meier's Railroads! Combining the best of real-world and model railroads, Sid Meier's Railroads! puts you in charge of building your own railroad empire...\n\n\n \n \n \n \n \n\n\nWorld of Warcraft - $19.95\nStill haven't played World of Warcraft yet? Why not start today and discover what 8 Million other people are enjoying right now?\n \n24 Season 6 Episode 17 - $1.99\nAs the Administration resumes an offensive approach, they prepare for the unthinkable.\n \nGhost in the Shell: Stand Alone Complex - Volume 1 - $14.95\nFemale cyborg Major Motoko Kusanagi and her fellow police officers of Section 9 hunt down a host of criminals in both the real and online worlds. \n\n\n \n \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\nSTALKER: Shadow of Chernobyl\n$39.95\n6\n\n\nSilent Hunter: Wolves of the Pacific\n$49.95\n\n\n2\n\n\nThe Elder Scrolls IV: Oblivion - Shivering Isles Expansion\n$29.95\n7\n\n\nThe Matrix Online\n$19.99\n\n\n3\n\n\nVanguard: Saga of Heroes\n$39.99\n8\n\n\nSid Meier's Railroads!\n$19.95\n\n\n4\n\n\n24 Latest Episode\n$1.99\n9\n\n\nTitan Quest\n$19.95\n\n\n5\n\n\nSupreme Commander\n$49.95\n10\n\n\nThe Shield Season 6 Episode 1\n$1.99\n\n\n\n\n\n\n\n\n\nTo Unsubscribe: Click Here.\n\t\t\t\nYou have received this e-mail because you are a registered user of GameSpy and have opted-in to receive GameSpy email updates concerning new products and services. If you believe you're receiving this e-mail in error or prefer not to receive promotions from GameSpy.com, reply to this message to opt out of future promotional mailings. Our privacy policy is viewable at http://corp.igngamespy.com/privacy.html. You may still receive other e-mails from GameSpy. To update your e-mail address or manage your account, visit GameSpyID.com. It may take up to 10 days for adjustments to your email preferences. If you have questions about this offer or your services, you can reach Customer Service here.\n\t\t\n\t\tYou may mail inquiries to: IGN Entertainment, Inc., 8000 Marina Boulevard, 2nd Floor, Brisbane, CA 94005\nCopyright © IGN Entertainment, Inc. All rights reserved.  \n\n\n\n\n\n\n\n\n\n\n\n\n"}