{"category": "ham", "to_address": "Ip-health@lists.essential.org", "from_address": "Judit Rius Sanjuan <judit.rius@keionline.org>", "subject": "[Ip-health] Bridges: WHO Members Adopt Resolution On Pharmaceutical Innovation", "body": "BRIDGES Weekly Trade News Digest - Vol. 11, Number 18 23 May 2007\n\nWHO MEMBERS ADOPT RESOLUTION ON PHARMACEUTICAL INNOVATION\n\nIntellectual property issues were prominent at the World Health\nOrganization's annual summit in Geneva from 14-23 May. After extensive\nnegotiations, member states adopted a last-minute resolution based on a\nBrazilian proposal calling for the global health body to take on an\nexpanded role in encouraging health research and access.\n\nThe resolution on \"Public Health, Innovation and Intellectual Property\"\nwas adopted at the closing plenary of the 60th World Health Assembly,\nwhich is the supreme decision-making body of the WHO's 193 member\nstates. However, the US made a statement to disassociate itself from the\ndecision.\n\nThe resolution largely refers to the role of the WHO secretariat in\nsupporting the work of a working group charged with developing a\nframework for supporting sustainable, needs-driven, essential medical\nresearch and development (R&D). Brazil said its proposal was designed to\ngive better \"stewardship\" to the Intergovernmental Working Group on\nPublic Health, Innovation, and Intellectual Property (IGWG) process,\nwhich some see as an opportunity to explore alternatives to drug patents\nas a means of encouraging innovation and the development of new and\naffordable drugs for diseases that disproportionately affect developing\ncountries. The IGWG was set up last year to negotiate a global strategy\non essential health research based on the recommendations of the WHO\nCommission on Intellectual Property, Innovation, and Public Health\n(CIPIH) (see BRIDGES Weekly, 31 May 2006,\nhttp://www.ictsd.org/weekly/06-05-31/story4.htm).\n\nChilean delegate Maximiliano Santa Cruz said the resolution will\n\"provide new impetus to push the process forward.\" It was valuable to\nreiterate prior commitments, and \"to have the secretariat on board,\" he\nsaid.\n\nNotably, the resolution requests the WHO secretariat to help develop\nproposals on \"a range of incentive mechanisms for addressing the linkage\nbetween paying for the cost of R&D and the prices of medicines,\nvaccines, diagnostic kits, and other health care products.\" Sources\nreport that Brazil and others had originally put forward language\nreferring to the explicit separation of R&D costs from drug prices,\nwhich was supported by Canada, Chile, and Norway, But objections from\nthe US, Japan, and the EU eventually led to this compromise, suggested\nby Switzerland. Chile's Santa Cruz said it was a \"good resolution\"\nbecause initial negotiating positions had been \"worlds apart.\"\n\nIn addition, the resolution requests the WHO secretariat to provide\n\"technical and policy support to countries that intend to make use of\nthe flexibilities contained in the [WTO] Agreement on Trade-Related\nAspects of Intellectual Property Rights [TRIPS] and other international\nagreements.\" In theory, this would see the WHO taking a greater role in\nthe interpretation of TRIPS flexibilities, such as compulsory licenses\nto temporarily override drug patents, to promote health.\n\nThe resolution also asks for further WHO support for \"regional\nconsultative meetings in order to set regional priorities that will\ninform the work of the IGWG.\" At a technical briefing on the IGWG at the\nAssembly on 17 May, concerns were raised about the level of\nparticipation of African and Latin American countries in these\nconsultations, which IGWG Chair Peter Oldham of Canada described as\n\"absolutely critical\". IGWG Vice-Chair Ahmed Ogwell, head of\ninternational health relations at the Kenyan health ministry, said \"the\nprocess is not running well in our part of the world,\" and appealed for\nsupport for consultations in Africa.\n\nAt the briefing, WHO Director-General Margaret Chan said she had been\nstruck by the complexities involved in the IGWG but that she was\nincreasingly aware of the importance of intellectual property rights to\nmember states. Sources said her comments were greeted by delegates\nfollowing doubts about the WHO secretariat's commitment to the IGWG\nprocess.\n\nAssistant Director-General Howard Zucker also clarified that the IGWG\ncould be extended beyond its current timeframe, which calls for the\ngroup to prepare a strategy and plan of action in time for next year's\nWorld Health Assembly in May 2008 following a final meeting this\nNovember. \"We take our cues from member states on these items,\" he said,\nin response to members' concern that divergence among their submissions\nmade agreement unrealistic by then (see BRIDGES Weekly, 25 April 2007,\nhttp://www.ictsd.org/weekly/07-04-25/story3.htm).\n\nAt the summit's closing session, Chan added, \"I am fully committed to\n[the IGWG] process and have noted your desire to move forward faster ...\nWe must make a tremendous effort. We know our incentive: the prevention\nof large numbers of needless deaths and suffering.\"\n\nResolutions on Malaria, Avian Flu and Children's Medicines\n\nThe World Health Assembly also dealt with the relationship between\nintellectual property and public health in resolutions negotiated on\navian flu, malaria, and medicines for children.\n\nA last-minute resolution was agreed on the 'Sharing of Influenza viruses\nand access to vaccines and other benefits', proposed by Indonesia for a\n\"transparent, fair and equitable sharing of benefits\" from vaccines\ndeveloped from virus samples. The country's Health Minister, Siti\nFadillah Supari, explained its decision to suspend sample-sharing of the\nH5N1 bird flu virus with the WHO last December, saying that the\ngovernment had been concerned that the WHO had passed some samples on\nwithout consent, which could have in turn resulted in intellectual\nproperty rights that denied developing countries \"equitable access\" to\nfuture vaccines.\n\nA draft resolution on malaria was agreed after small group consultations\nmainly between Kenya and the US. Each had submitted a proposal in\nJanuary, differing primarily in terms of their references to TRIPS\nflexibilities. Kenya and other developing countries wanted to urge\nmembers to provide for full use of flexibilities in their legislation\n\"to increase access to anti-malarial medicines, diagnostics and\npreventive technologies.\" In contrast, the US, along with Switzerland\nand Japan among others, did not want TRIPS flexibilities to be mentioned\nin connection with access to the products. The compromise, reached on 21\nMay, inserted a definition of \"pharmaceutical products\" into an\nexplanatory footnote that referenced the 2001 WTO Doha Declaration on\nTRIPS and Public Health. A similar footnote had been part of the\ncompromise on the Brazil IGWG resolution as well, sources said.\n\nBrazil and Thailand were active in inserting language on TRIPS\nflexibilities, the IGWG and access to essential medicines in a\nresolution on \"Better Medicines for Children\".\n\nOn a related note, a source told Bridges that Brazil and Thailand's\nrecent decisions to issue compulsory licences for patented AIDS drugs\nwere not discussed in any detail during the World Health Assembly,\ncontrary to some expectations (see BRIDGES Weekly, 9 May 2007,\nhttp://www.ictsd.org/weekly/07-05-09/story4.htm). Meanwhile, Thai\nMinister of Public Health Mongkol Na Songkhla announced that Brazil and\nThailand would sign a \"cooperation agreement\" on health development,\nincluding research into flu vaccines, in August.\n\nICTSD reporting; \"Indonesia Lifts Bird Flu Sample Ban\", FINANCIAL TIMES,\n15 May 2007; \"WHO Head Expresses Commitment to Strengthen IP Working\nGroup\", INTELLECTUAL PROPERTY WATCH, 20 May 2007; \"Thailand, Brazil to\nSign Health Cooperation Agreement,\" THAI NEW AGENCY, 20 May 2007; \"WHO\nMembers Reach Preliminary Agreement on Malaria\", IP-Watch, 21 May 2007;\n\"World Health Assembly Closes,\" WORLD HEALTH ORGANIZATION, 23 May 2007.\n\n\n\n--\nJudit Rius Sanjuan\nAttorney\njudit.rius@keionline.org\n\nKnowledge Ecology International (KEI)\nwww.keionline.org / www.cptech.org\n1621 Connecticut Ave, NW, Suite 500 Washington, DC 20009 USA\nTel.: +1.202.332.2670, Ext 18  Fax: +1.202.332.2673\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}