{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Computers & Electronics Newsleterr June 21, 2007", "body": "June 21, 2007 \nRSS | \ncomputers & electronicsThis Week's Highlights:\nHow MP3 Players WorkHow Computer Viruses Work\nHow the Nike + iPod WorksHow Night Vision Works\nHow Circuit Breakers Work iPod Tech Pics\n - With all the buzz about Apple's new iPhone set to debut on June 29th, \nlet's look at some of the cool iPod technology Apple has brought to us over the \nyears.   This week's trivia question:How can a Windows virus end up on an iPod? \nFind out   \n \nHow MP3 Players Work - \nThe MP3 player is the convergence of many technologies. Alone, none of its components are revolutionary, but together they create an unprecedented consumer product. Find out about the technology inside MP3 players and the different types of players out there. Learn all about how MP3 players work.  \n   This week's video:\nHow Computer Viruses Work - If you've had a computer for any long period of time, you've probably encountered a computer virus. Find out exactly what they are and how they work in this HowStuffWorks video.\n   \n   Also at HowStuffWorks:\n How the Nike + iPod Works - \nThe Nike + iPod combines a portable music player with a pedometer -- two devices that runners have used for years. Find out how the Nike + iPod is considerably more advanced than an ordinary pedometer. \n How Night Vision Works -\n Most of us instinctively think of darkness as a \"cloak,\" a way to hide. So, how can you see someone standing over 200 yards away on a pitch-black night? Learn all about how night vision works. \n How Circuit Breakers Work - \nThe circuit breaker is one of the most important safety mechanisms in your home. Without it, the risk of fire would skyrocket. Learn how circuit breakers and fuses monitor electrical current and how they cut off the power when current levels get too high. \n  \n  Coming Soon:- How Geocaching Works- This Month in History - July- How the iPhone Works\n   \n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA \nYou received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please unsubscribe here or change your preferences using our \nprofile manager.To view this email as a web page, click here.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved\n"}