{"category": "ham", "to_address": "perl6-language@perl.org", "from_address": "Paul Hodges <ydbxmhc@yahoo.com>", "subject": "Re: Is Perl 6 too late? (an aside)", "body": "\nIt's a valid aside to note that, while people know what singular and\nplural are, few people use or even refer much to the Greek use of a\nspecial intermediary (the dual) when there were exectly two of\nsomething...but the basic mindest of dichotomy is a fundament of the\nlanguage. (c.f. the men/de construct so basic to the language).\n\nPerl is like that. There are a lot of little corner cases that are\ndistinctly Perl, things unlikely to be seen elsewhere, and sometimes\nhardly ever even used in Perl.... but the mindset that is Perl is a\nbeautiful thing, and that's still there. \n\nBesides, if you don't get the aesthetics of the Schwartzian Transform,\nthen you should probably be using python or java anyway, hm?\n\nLet's let Perl be Perl. It's a new Perl, but it's still a pearl. =o)\n\n*Paul\n\n--- Larry Wall  wrote:\n\n> On Mon, May 14, 2007 at 02:21:47PM -0400, Ryan Richter wrote:\n> : In Perl 6, the & sigil is used to distinguish between\n> : \n> : foo bar\n> : \n> : which calls bar and passes the return value to foo, and\n> : \n> : foo &bar\n> : \n> : which passes bar as a Code object to foo.\n> \n> In other words, the sigil is consistently a noun marker in Perl 6,\n> even when a sigil is used on a verb.  In Perl 6, where sigils\n> distinguish nouns not only from verbs, but also from adjectives (if\n> you count types as adjectival).  With a glance you can tell which\n> are the nouns and which are the types here:\n> \n>     multi CatDog sub make_catdog (Cat $cat, Dog $dog) {...}\n>     multi CatDog sub make_catdog (Cat Dog $catdog) {...}\n> \n> While Gabor is correct that in Perl 5 removing the sigils from verbs\n> made some verbal collisions happen that otherwise wouldn't have, in\n> Perl 6 we've mostly fixed that by essentially getting rid of most\n> reserved words, and making even the builtin functions participate\n> as normal multis and methods.  For that reason, and because verbs\n> linguistically tend to be disambiguated by the nouns fed to them as\n> argements, verbs don't need to be conjugated nearly as badly as nouns\n> need to be declined.  A lot of nouns typically don't have arguments\n> to disambiguate them with, at least until you start subscripting\n> them,\n> and we don't do multiple dispatch on subscripts.\n> \n> As for the original complaint, we long ago decided to ignore people\n> who\n> are prejudiced against languages that mark nouns.  Greek wouldn't be\n> Greek if you couldn't decline your nouns.  (In my estimation, it's\n> the conjugated verbs that make Greek so difficult to learn, really.\n> On the other hand, once you learn them they're very expressive in\n> tense and aspect.  It's all tradeoffs.)\n> \n> Larry\n> \n\n\n\n \n____________________________________________________________________________________\nThe fish are biting. \nGet more visitors on your site using Yahoo! Search Marketing.\nhttp://searchmarketing.yahoo.com/arp/sponsoredsearch_v2.php\n\n"}