{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\nPerformance \n\t\t\tBenchmarking For Energy Utilities\nSeattle, WA\n            May 23-24, 2007\n\nPandemic \n\t\t\tPreparedness For Utilities\nSeattle, WA\n            May 23-24, 2007\n\n\nCapacity \n\t\t\tMarkets\n\n\t\t\tWashington, DC\n\nJune \n4-6, 2007\n\nCoal-to-Liquids \n\t\t\tFinance and Development Summit\n\n\t\t\tNew York, NY\n\nJune \n4-6, 2007\n\n\nStrategies for \n\t\t\tBidding Ancillary Services in LMP Markets\n\nIndianapolis, IN\n\nJune 6-7, 2007\n\n\nIntro to Electric \n\t\t\tUtility Systems for Non Engineers\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nDistributed \n\t\t\tEnergy Resources-Emerging Business Models for Utilities\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for May 15, 2007  \n\n\n\nFirst Enercast Featured Articles for May 15, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 15, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 15, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 15, 2007\n\n\nMay 15, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nNatural gas bills may rise\n\n\n\nMay 15--The Owensboro City Commission is considering doubling the city's natural gas franchise fee, a pass-through charge to customers that could generate an additional $250,000 that city leaders hope to devote to economic development. The city has negotiated a tentative franchise agreement with Atmos Energy, which serves more than 22,000 customers in Owensboro, to raise the fee to 2 percent for ...\n\n\nMay 15, 2007 Knight Ridder Tribune Business News\n\n\n\nSDG&E selects two 'peaker' plant bids\n\n\n\nMay 15--San Diego Gas & Electric Co. announced Monday that it has signed agreements with two companies that will build small \"peaker\" electricity plants to kick on only during periods of high energy demand.  The proposed plants, scheduled to be on-line by 2008, would be built at the utility's Pala substation in North County and next to an SDG&E substation in southern Orange County, according to a ...\n\n\nMay 15, 2007 Knight Ridder Tribune Business News\n\n\n\nNuke plant guards cheated: Federal probe says security bosses at Shearon Harris gave answers to tests\n\n\n\nMay 15--Federal investigators have concluded that three contract security supervisors handed out answers to guards taking annual recertification tests at Shearon Harris Nuclear Plant in southern Wake County.  As a result, numerous guards were not tested or properly qualified in 2005 to protect the Progress Energy-owned nuclear plant, Nuclear Regulatory Commission inspectors said.\n\n\nMay 15, 2007 Knight Ridder Tribune Business News\n\n\n\nWind-power skeptics shift direction\n\n\n\nMay 15--A pair of wind-energy skeptics on the board of the state's largest utility have backed down from their recent push for the company to drop support for a proposed Fire Island wind farm.  Instead, the skeptics -- board vice-chair Uwe Kalenka and newly elected board member Alex Gimarc -- said they will support an \"appropriate and prudent\" investigation of wind power at Fire Island, as well ...\n\n\nMay 15, 2007 Knight Ridder Tribune Business News\n\n\n\nSnafu puts power plant zoning back on council table\n\n\n\nMay 15--WATERLOO -- A procedural blunder will force Waterloo City Council members once again to vote on the Elk Run Energy Station coal-fired power plant. Council members had voted unanimously last week following a five-hour public hearing to approve annexing land and zoning it for the controversial $1.3 million power plant on the northeast side of the city.\n\n\nMay 15, 2007 Knight Ridder Tribune Business News\n\n\n\nEquitable - Dominion deal clears hurdle\n\n\n\nMay 15--U.S. District Court Judge Arthur J. Schwab on Monday tossed out the Federal Trade Commission's lawsuit to halt Equitable Resources Inc.'s planned acquisition of Dominion Peoples Gas, saying the state Public Utility Commission's recent approval of the deal holds precedence.  In a 19-page opinion, Schwab noted that the PUC determined the acquisition would allow the natural-gas distribution ...\n\n\nMay 15, 2007 Knight Ridder Tribune Business News\n\n\n\nCompany applies to build electric plant in Wendell\n\n\n\nMay 15--WENDELL -- A company that announced in 2005 that it would build a renewable-energy plant that could convert animal waste into electricity has applied for a permit to build.  But it won't be a renewable-energy plant. EnviroDyne Corp. plans to build a natural gas-based plant on 156 acres of what's now agricultural land southwest of Wendell. According to the 98-page application with the ...\n\n\nMay 15, 2007 Knight Ridder Tribune Business News\n\n\n\nCopper stolen from utility poles\n\n\n\nMay 15--MASARYKTOWN -- She almost didn't see it.  Joy Weld stepped outside to retrieve her paper last Saturday morning and noticed something odd about the utility pole standing beside her chain link fence. Six feet of the ground wire running up the pole had been snipped off. \"I just happened to look over and saw it was missing a piece,\" said Weld, 73, who lives on Monroe Avenue.\n\n\nMay 15, 2007 Knight Ridder Tribune Business News\n\n\n\nEverything's coming up green\n\n\n\nMay 15--Fayette County Community Action Agency has opened the first green building in Uniontown.  \"People have been asking me, 'What the heck is a green building?',\" said James Stark, the CEO of Fayette County Community Action Agency. It's another name for an environmentally friendly building designed to cut operation costs and reduce carbon emissions and other waste that could be hazardous to ...\n\n\nMay 15, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nA first look at flood devastation\n\n\n\nMISSOURI VALLEY, IOWA - Rachel and Ryan Rempel spotted their little red porch just after 2 p.m. Sunday. Alice Wede saves what she can Sunday from her house in Missouri Valley, Iowa. Today, residents will be let in again, and the city will start cleaning streets and assessing road damage. It had broken off their house and floated into a field across the street.\n\n\nMay 14, 2007 Omaha World-Herald\n\n\n\n\n\nONEOK to Hold Its 2007 Annual Meeting of Shareholders\n\n\n\nTULSA, Okla., May 14 /PRNewswire-FirstCall/ -- ONEOK, Inc. (NYSE: OKE) will hold its annual meeting of shareholders on May 17, 2007, at 10 a.m., Central Daylight Time. The meeting will be webcast live on ONEOK's Web site, http://www.oneok.com.     What:  ONEOK, Inc. 2007 Annual Meeting of Shareholders When:  10 a.m. CDT, May 17, 2007     Where: Company headquarters, 100 West 5th Street, ...\n\n\nMay 14, 2007 PR Newswire\n\n\n\nEnterprise Informatics Announces Second Quarter 2007 Results\n\n\n\nEnterprise Informatics Inc. (OTCBB: SPCO), a  Enterprise Informatics Inc. (OTCBB: SPCO), a leading provider of enterprise information management solutions, today reported results of operations for its second quarter of fiscal 2007 ended March 31, 2007.  Revenues for the second quarter of FY2007 were $3.78 million versus $1.73 million reported in the previous quarter and $2.06 million in the same ...\n\n\nMay 15, 2007 Internet Wire\n\n\n\nEnergy Fuels Comment on Recent Share Price Activity\n\n\n\nEnergy Fuels Inc. (TSX: EFR) (\"Energy Fuels\" or the \"Company\") wishes to comment on recent heavy volume and the decline in the value of its shares. The Company is not aware of any fundamental change to explain this share activity. George Glasier, President and CEO stated, \"I wish to confirm my personal commitment to the Energy Fuels stakeholders, Energy Fuels management, our technical team, and ...\n\n\nMay 15, 2007 Internet Wire\n\n\n\nWide Eye LLC Announces Pre-Production of Its Upcoming Film \"SWOLL\" in Early 2008\n\n\n\nWide  Wide Eye LLC -- Entertainment with a whole new view.  Wide Eye Entertainment, an innovative people friendly Company, is a people's base entertainment venue, not Hollywood driven; no big egos or overrated movie stars needed. Real People sharing the spotlight for a change!  Our first project, titled \"SWOLL,\" is a feature film that is scheduled for pre-production 1st quarter of 2008, and even ...\n\n\nMay 15, 2007 Internet Wire\n\n\n\nMine-1-1 Product Offering Successfully Demonstrated at One of Brooks Run's Coal Mines in West Virginia\n\n\n\niPackets International, Inc. (\"iPackets\" or  iPackets International, Inc. (\"iPackets\" or \"Company\") (PINKSHEETS: IPKL), a developer and provider of wireless communications software and equipment for the mine-safety industry, is pleased to announce that the Company along with its two partners, AFL Network Services' Enterprise Division (\"AFL\"), and Mainline Communications (\"Mainline\"), have ...\n\n\nMay 15, 2007 Internet Wire\n\n\n\nBird Watching is Just a Click Away on Great River Energy's Website\n\n\n\nELK RIVER, Minn.--(BUSINESS WIRE)--A pair of peregrine falcons has made its home in a man-made nesting box atop Great River Energys Elk River Station. Bird watchers can view the pair by visiting the Great River Energy bird cam at www.greatriverenergy.com. The falcons and their soon-to-be-hatched chicks are expected to remain in the nesting box until mid-summer.\n\n\nMay 14, 2007 Business Wire\n\n\n\n\n\nDuke Energy CFO Hauser Exercises Options for 103,600 Shares\n\n\n\nNEW YORK (AP) - The chief financial officer of Duke Energy Corp. exercised options for 103,600 shares of common stock, according to a Securities and Exchange Commission filing Friday. In a Form 4 filed with the SEC, David Hauser reported he exercised options for the shares Thursday for $7.85 to $16.90 apiece and then sold all of them Thursday for $20.30 to $20.38 apiece.\n\n\nMay 14, 2007 Canadian Business Magazine\n\n\n\nCPS Energy gains addition 240 megawatts of wind energy\n\n\n\nSan Antonio businesses and consumers now have access to an additional source of renewable energy. CPS Energy is tapping into a new 240-megawatt source of wind-generated electricity. Some 180 new wind turbines at the Cottonwood Creek Wind Farm that were under construction since last year have come online. The wind farm is located just southwest of Sweetwater, Texas.\n\n\nMay 14, 2007 San Antonio Business Journal\n\n\n\nConsumer inertia leads to high gas prices\n\n\n\nHalf the population are paying up to 250 a year more for their gas and electricity because the power companies know they will never switch supplier, it was claimed yesterday.A report by the Centre for Competition Policy at the University of East Anglia concluded that a lack of competition in the market is effectively allowing the six big power firms to keep bills artificially high for the 50% of ...\n\n\nMay 15, 2007 Guardian Unlimited\n\n\n\nGreen group questions WA Govt's climate change spending\n\n\n\nGreen group Environs Kimberley says the Western Australian Government's climate change package is 'inadequate' and reveals a serious gap in efforts to address the threat. The Government has announced it will spend more than $100 million over the next five years implementing the package. The package includes a range of measures aimed at boosting the state's renewable energy sector and encouraging ...\n\n\nMay 14, 2007 ABC Online\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nNuclear Power Generation Is an Established Part of the World's Electricity Mix Providing Over 16% of World Electricity\n\n\n\nAM Eastern Daylight Time DUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c56722) has announced the addition of Global Nuclear Power Industry to their offering. Nuclear power is generated using Uranium, which is a metal mined in various parts of the world. Presently, nuclear power produces around 15% of the world's energy needs, and produces huge ...\n\n\nMay 14, 2007 Business Wire\n\n\n\nFinavera Renewables Submits 366 Megawatts of Wind Projects into the British Columbia Environmental Assessment Process\n\n\n\nVANCOUVER, Canada--(BUSINESS WIRE)--Finavera Renewables Inc. (the Company or Finavera Renewables) (TSX VENTURE:FVR) is pleased to announce it has entered four wind power projects into the British Columbia Environmental Assessment (EA) process. The four projects are located in the provinces Peace Region and have a nominal nameplate capacity of 366 megawatts (MW).\n\n\nMay 15, 2007 Business Wire\n\n\n\nTom Jackson: Great American Gas-Out Running On Fumes\n\n\n\nThis feature requires the Macromedia Flash Plugin. Please visit http://www.macromedia.com/go/getflashplayer to download this plugin. Search for more information: TBO.com Site Search| Tribune archive from 1990 With chain e-mail spreading the message like a wind-whipped Okefenokee wildfire, you can bet that gasoline retailers around Pasco County are bracing for the latest annual holiday at the ...\n\n\nMay 15, 2007 Tampa Tribune\n\n\n\nCity Capital's Goshen Energy Pumping Gas on West Delta Well Number One -- First Full Flow Since Katrina\n\n\n\nCity Capital Corporation's (OTCBB: CCCN)  City Capital Corporation's (OTCBB: CCCN) wholly owned subsidiary, Goshen Energy Resources, has initiated production with the first of four wells in the West Delta 25 gas producing offshore platform. Well Number One is currently averaging 400 thousand cubic feet (mcf) per day, running at approximately 20% capacity while all systems are being brought on ...\n\n\nMay 15, 2007 Internet Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}