{"category": "ham", "to_address": "Ip-health <ip-health@lists.essential.org>", "from_address": "James Love <james.love@keionline.org>", "subject": "[Ip-health] Amgen CEO to Critics of Prices: 'Give Me a Break'", "body": "\nhttp://online.wsj.com/article/SB118100806142024548-search.html\n\nBOSS TALK\n\nHow Genentech Wins At Blockbuster Drugs\nCEO to Critics of Prices: 'Give Me a Break'\nBy MARILYN CHASE\nJune 5, 2007; Page B1\n\nThe founding of Genentech Inc. in 1976 launched the biotechnology\nindustry, which engineers drugs from living cells instead of test\ntubes. Headquartered in South San Francisco, Calif., Genentech just\nfinished its best year ever, with a 72% surge in profit to $2.39\nbillion, driven by Avastin for colon and lung cancer, Rituxan for non-\nHodgkin's lymphoma, Herceptin for breast cancer and Lucentis for\nblindness.\n\n[Arthur D. Levinson]\n\nMore than 300 studies presented at the American Society of Clinical\nOncology this week will involve the use of the company's drugs\nagainst more than 15 tumor types, a spokeswoman said. (Another\npromising use for Avastin; see related article.)\n\nGenentech's philosophy is to create medicines to fill unmet needs and\nto recoup its big research-and-development investment -- $1.8 billion\nin 2006 -- by charging premium prices. A year's supply of Avastin,\nfor example, costs $55,000. But the company is feeling mounting\npressure from Congress and Medicare to curb prices and from\ncompetitors seeking to produce rival generic products.\n\nChief Executive Officer Arthur D. Levinson, who has a doctorate in\nbiochemistry, joined Genentech as a senior scientist in 1980 and did\npioneering work on the cancer gene HER2/neu that led to the\nblockbuster Herceptin. He recently spoke with Wall Street Journal\neditors about the challenges facing his company and the health-care\nindustry. Excerpts:\n\nWSJ: You have multiple blockbuster biotech drugs on the market and\nmore on the way. In such an uncertain business, how do you manage\nscientists to achieve that kind of success?\n\nDr. Levinson: We are first and foremost committed to doing great\nscience. If a drug can't be the first in class or the best in class,\nwe're just not interested. We're not looking to achieve incremental\nadvances or extend patents or do X, Y, Z unless it is going to really\nmatter for patients. That allows us to bring in phenomenal scientists\nand encourage them to do the basic and translational research.\n\nWe decided 15 years ago that we would be committing to oncology,\nwhich at the time for us was new. We are now the leading producer of\nanticancer drugs in the United States. We took a lot of risks. In\nmany cases, those risks paid off. We are now also in immunology.\nAgain, the role of management here is to set the broad direction and\nthen hire absolutely the best scientists and bring them in and say,\n'Do your stuff.'\n\nThere are always trade-offs -- in the short term, between the cancer\npatient, or the immunology patient. You can't do everything for\neverybody. Last year, we spent $1.8 billion in research and\ndevelopment. It's a serious job to prioritize everything that's in\nthe pipeline and decide where we are going to spend those precious\nresources.\n\nThe third thing is we place a huge emphasis on making Genentech a\ngreat place to work. Eight or nine years ago, we didn't appear on\nmany lists of the best places. We started doing employee surveys,\nasking, people 'What do you like; and more importantly, what do you\nnot like about the company? What bothers you?' We've been pleased by\nthe validation. We made it to Fortune's Top 20 List four years in a\nrow. Last year we were No. 1. [This year, Genentech slipped slightly,\nto the No. 2 spot, behind Google Inc.]\n\nWSJ: How do you balance the high cost of innovation with the pressure\nto cut cancer-drug prices?\n\nDr. Levinson: Since 1976, when our company was founded, the biotech\nindustry has lost $90 billion in aggregate. I think it's the biggest\nmoney-losing industry of all time. It is hemorrhaging. There are some\nexceptions: We are doing well, and Amgen is doing well. But for most\nof the 1,300 to 1,400 companies -- 300 or 400 of them public -- this\nis a money-losing enterprise.\n\nYou don't just crank these drugs out. My lab cloned a portion of the\nbreast-cancer gene in 1982. And we started making antibodies to it in\nthe mid-'80s. Then we got cell-culture results in the late '80s and\nby the early '90s we were getting animal results. And then approval\nwas in December '98. So this goes back a long, long time. Unless\nthese companies can get a return, we are not going to get the new\nmedicines that are making such a difference to patients' lives right\nnow.\n\nThere's another way to look at it -- look at how much society is\ninvesting in cancer. In the absence of better care, 42% of everybody\nout there is going to get cancer. And half of those 42% are going to\ndie of cancer. It's the leading cause of death among Americans under\nage 85. So how much are we spending on drugs for cancer? We have a\n$12 trillion GDP [gross domestic product]. And we're spending $15\nbillion. If I do that math, 1/800th of GDP for the leading cause of\ndeath. And people say cancer drugs are bankrupting America! Give me a\nbreak.\n\nWSJ: So what led you to cap the price of Avastin at $55,000 a year?\n\nDr. Levinson: That came out of a lot of feedback from payers and\npatients. We have patients on Avastin for a very long time. We have\nhealthy margins on the drug. We have to have healthy margins because\nso few of the drugs make it....But at that point, we can afford to\ngive the drug free. That was part of it.\n\nOnce or twice a year we will bring in payers...patients, people who\nare complaining strongly and understandably about the high price of\ndrugs. We bring them in for a two-day symposium, and you can audit\nour books. Our margins are respectable, but not off the chart. They\nare not Microsoft margins; they are not Oracle's margins, even. At\nthe end of the day, it's not that everybody applauds and says we're\nhappy paying the price of your drug. But they understand what goes\ninto the equation. And the vast majority of them say this was a\nrevelation, now we understand it.\n\nWSJ: What's your reaction to the Democrats in Congress who are trying\nto pave the way for generic versions of biotech drugs?\n\nDr. Levinson: There's a lot of impetus to allow the FDA [Food and\nDrug Administration] to approve generics. Our position is we don't\nmind that. Nobody is looking for free handouts here. But what's\nmissing from the Waxman-Schumer-Clinton Bill is an appreciation for\nthe complexity of the science involved in producing a generic\nbiologic in a pill.\n\nMakers of pharmaceutical pills can show chemical equivalence easily.\nBut if you are producing a biological, it is not made by chemical\nsynthesis. It is made by a Chinese hamster's ovary cell or an E. coli\nbacterium -- a very complex route. We do not yet have analytical\ntechniques to tell you that a copy is clinically identical to the\ninnovator's drug. Our recommendation to the FDA would be to simply\nrequire a clinical trial to make sure that the drug is behaving in\nthe clinic as expected.\n\nWSJ: You recently said that the factor limiting R&D isn't money but\nthe ability to find the best people. Aren't we producing enough people?\n\nDr. Levinson: I think Bill Gates made a comment about immigration and\nthe fact that we make it most difficult for the smartest people to\ncome into this country. We're tightly constrained in terms of\nbringing great scientists from Great Britain, France or Germany. We\nstruggle to bring in these incredible people who are going to help\nthe economy, help patients and help our business grow. At the end of\nthe day, it will only be good. But we are making it tough on ourselves.\n[Good Genes]\n\nWSJ: You have an unusual situation in which some doctors are treating\nmacular degeneration with your cancer drug Avastin, even though it\nhasn't been approved for that use, rather than your pricey eye drug\nLucentis, which has been. And now the government wants to set up a\nbake-off comparing them, but you made the decision not to supply\ndrugs for the trials. Why?\n\nDr. Levinson: To give everybody perspective, I have to go back in\ntime: Fifteen years ago, one of our scientists, Napoleone Ferrara,\nhad purified a protein, VEGF [vascular endothelial growth factor],\nthat induces blood vessels to form. It's been a theory for probably\n100 years that [cancers] have some weird way of bringing in blood\nvessels that nurse the tumor and allow the cancer to grow. Ferrara\nshowed that, lo and behold, 90% of cancers overexpress this protein.\nIt was a semirational leap of faith that if you interfered with this\nprotein, you could block the nourishment of the tumors from blood\nvessels. That led to the development of Avastin, a monoclonal\nantibody that blocks VEGF and is now used in colorectal and lung cancer.\n\nAbout 10 or 12 years ago, Ferrara showed that in patients with\nmacular degeneration, there's also a very high level of VEGF. There's\ntoo much [vessel formation] at the back of the eye, near the retina.\nSo he thought, maybe an antibody to VEGF might also help AMD, the\nleading cause of blindness over age 55.\n\nSo we spent two years doing protein engineering. We made it bind more\ntightly, smaller to reach the back of the eye and noninflammatory. We\nmade three important changes and ended up with Lucentis.\n\nWe did a Phase I study and showed that this drug doesn't cause any\nproblems. We did a Phase II study, and we started seeing some\nincredible, near-miraculous results. We did the Phase III trial, and\nit confirmed absolutely the Phase II results. And we published the\ndata, and people saw that an antibody to VEGF can potentially save\nvision. But the drug [Lucentis] wasn't approved. [That was in\nmid-2005; Lucentis won approval for eye use on June 30, 2006.]\n\nThis is a disease that over the course of days you can go from 20/20\nvision to losing your eyesight. It's very, very quick, and once you\nlose your vision, it's gone and you will probably never get it back.\nThe FDA takes a very, very long time to approve the drug. But there\nwas Avastin out there and it was already approved. So you could if\nyou wanted to make a leap of faith that the Avastin molecule would\nalso work in macular degeneration. But Avastin is not approved for that.\n\nWSJ: There's a big difference in cost -- $2,000 a shot for the\napproved eye drug Lucentis, versus $50 a shot if a doctor splits off\na small fractional dose of the cancer drug Avastin -- which was\npriced to be given in a large IV infusion -- into tiny opthalmic\nsyringes so it is cheaper as an eye shot.\n\nDr. Levinson: There's a big difference in cost, right. We did Phase\nIII clinical trials of Lucentis that cost $40,000 to $45,000 per\npatient [the most expensive clinical-development program Genentech\never undertook]. We spent two years to do all kinds of protein\nengineering to make Lucentis.\n\nIt is a very expensive enterprise. What would you suggest we do? We\nhave $1.86 billion to spend on R&D. There are people dying of all\nkinds of cancers and immunological diseases and everything. We have\nwhat we believe are other potential absolutely breakthrough\ntherapies. Would you take your money and do a two-year\nextraordinarily expensive equivalence trial? [Researchers say such a\ntrial of Lucentis vs. Avastin would cost $50 million.]\n\nFurthermore, access is not a problem with Lucentis. It's very, very\ndifficult to come across a patient who at the end of the day won't\nhave access to Lucentis, either by insurance or by co-pay assistance\nprograms or by our free drug programs.\n\nI have a philosophy -- I invite criticism. But don't ever come to me\nwith a complaint without saying, here is what we might do to make it\nbetter. I am happy to hear Part A if I hear Part B.\n\nWrite to Marilyn Chase at marilyn.chase@wsj.com\n\n------------------------------------\nJames Packard Love\nKnowledge Ecology International\njames.love@keionline.org\nWk +1.202.332.2670, US cell +1.202.361.3040, Geneva Cell +41.76.413.6584\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}