{"category": "ham", "to_address": "\"General Copyright Discussions \\(questions, organizing,\n\tetc\\)\" <discuss@list.digital-copyright.ca>", "from_address": "mgurst@vcn.bc.ca", "subject": "Re: [d@DCC] MS censors UN document", "body": "Its a bit of a long story and I don't off-hand recall it all, but it\nappears that MS was part of a panel at a pre-World Summit on the\nInformation Society  (WSIS) associated conference in Vienna.\n\nThe Chair of the Conference (an Austrian) was evidently slightly ahem\n\"over-accommodating\" (another long story I think) to MS and edited out of\nthe proceedings apparently at the request of MS some pro-Open Source\ncomments by another presenter who objected quite vigorously and publicly\n(think RLS).\n\nIt got a fair amount of play among the OS and Civil Society crowd mostly\nin Europe at the time but somehow disappeared, not sure exactly why or\nhow... There hasn't been any follow-up that I have heard of...\n\nA tempest in a teacup is a good characterization I think...\n\nMG\n\n> On 5/29/07, mgurst@vcn.bc.ca  wrote:\n>> This is certainly true but very very old news (2005) and widely noted,\n>> discussed and assimilated into on-going (and more up to date)\n>> discourse...\n>>\n>> MG\n>\n> Hrmm.  I don't recall this one.  If you have additional (newer)\n> references, they'd be most appreciated.  TIA.  =)\n>\n> --\n> Scott Elcomb\n>\n> \"Our Founders' faith in the viability of representative democracy\n> rested on their trust in the wisdom of a well-informed citizenry,\n> their ingenious design for checks and balances, and their belief that\n> the rule of reason is the natural sovereign of a free people.\" - Al\n> Gore (The Assault on Reason, 2008)\n>\n> \"They that can give up essential liberty to obtain a little temporary\n> safety deserve neither liberty nor safety.\"  - Benjamin Franklin\n>\n> '\"A lie can travel halfway around the world while the truth is putting\n> on its shoes.\"  - Mark Twain\n> _______________________________________________\n> Discuss mailing list\n> Discuss@list.digital-copyright.ca\n> http://list.digital-copyright.ca/mailman/listinfo/discuss\n>\n>\n> !DSPAM:2676,465c862415222073620010!\n>\n\n\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}