{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "Terry Hancock <hancock@anansispaceworks.com>", "subject": "Re: [cc-community] [Clipart] In the interim...", "body": "Jon Phillips wrote:\n> On Tue, 2007-05-08 at 13:12 -0700, Greg Bulmash wrote:\n>>As an experiment, I had some artists draw some caricatures:\n>>   Paris Hilton\n>>   Rachel Ray\n>>   Lenin\n>>   Che\n>>   Whoopi Goldberg\n>>   George Clooney\n>>\n>>Decided not to use them commercially and since they were works for hire, \n>>I own the copyright.  I was going to dedicate them to the public domain \n>>and upload them to OCL (about 10 in all) when I found it offline.\n> \n> That is a good question. I'm cc'ing the cc-community list on this too\n> see thoughts. If you are interested, please hop over to that list.\n> \n> cc-community people, this fellow is asking if it is ok to contribute\n> characters of famous people to the public domain. Any good sources for\n> this?\n\nIANAL, but ISTM that it must be. Clipart collections have been published\nthat include such caricatures (e.g. in the last Corel Draw release that\nI looked at -- that was some years ago, but I assume the law hasn't\nchanged that much since then).\n\nNormally, there would still be some issues for the end user with using\n\"likenesses\" of these people, however since these are \"celebrities\"\nthere are also a number of exemptions. It's possible to get into a\ndefamation lawsuit when using something that is clearly meant to depict\nan individual, when it is used to make libelous representions about\nsomeone. However, if you are in certain classes of public life, you\ncan't make this kind of lawsuit (e.g. you can say that George Bush eats\nbabies, and that's pretty much protected speech -- you're allowed to get\npretty nasty in political commentary).\n\nGenerally, you are on safer ground spoofing people with strongly\ndeveloped public personas. I don't know the actual reasoning or exactly\nhow the line is drawn between \"public figures\" and \"ordinary people\",\nbut I think the argument is basically that these are people who've\nentered \"public life\" so they are subject to public criticism (or\npraise). You'll see lots of examples of political cartoons involving\npolitical leaders and/or entertainers. This is pretty much all\n\"protected speech\" AFAIK.\n\nOTOH, you'd probably be baiting a lawsuit if you used a caricature of\nParis Hilton in an advertisement to suggest that she uses your product.\nBut I think that's pretty obvious to most people. This type of thing is\nprobably stronger for \"public figures\" since they derive their income\nfrom the use of their image (no one cares if *I* use your product, so\nsaying that I do when I don't does me less material damage -- though\nit'd still be \"false advertising\").\n\nSo, I believe that 1) public domain is absolutely okay (as would be any\nlicense you choose -- you own the art), 2) there are very few legal\nrisks for the end user with using such caricatures, but there are of\ncourse a few. None of which would be your responsibility, AFAIK.\n\nBTW, sounds fun! Where I can I download them?! :-D\n\nCheers,\nTerry\n\n-- \nTerry Hancock (hancock@AnansiSpaceworks.com)\nAnansi Spaceworks http://www.AnansiSpaceworks.com\n\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}