{"category": "ham", "to_address": "Martin Maechler <maechler@stat.math.ethz.ch>", "from_address": "Thomas Lumley <tlumley@u.washington.edu>", "subject": "Re: [R] normality tests  [Broadcast]", "body": "On Mon, 28 May 2007, Martin Maechler wrote:\n\n>>>>>> \"LuckeJF\" == Lucke, Joseph F \n>>>>>>     on Fri, 25 May 2007 12:29:49 -0500 writes:\n>\n>    LuckeJF>  Most standard tests, such as t-tests and ANOVA,\n>    LuckeJF> are fairly resistant to non-normalilty for\n>    LuckeJF> significance testing. It's the sample means that\n>    LuckeJF> have to be normal, not the data.  The CLT kicks in\n>    LuckeJF> fairly quickly.\n>\n> Even though such statements appear in too many (text)books,\n> that's just plain wrong practically:\n>\n> Even though *level* of the t-test is resistant to non-normality,\n> the power is not at all!!  And that makes the t-test NON-robust!\n\nWhile it is true that this makes the t-test non-robust, it doesn't mean \nthat the statement is just plain wrong practically.\n\nThe issue really is more complicated than a lot of people claim (not you \nspecifically, Martin, but upthread and previous threads).\n\nStarting with the demonstrable mathematical facts:\n  - lots of rank tests are robust in the sense of Huber\n  - rank tests are optimal for specific location-shift testing problems.\n  - lots of rank tests have excellent power for location shift alternatives\n     over a wide range of underlying distributions.\n  - rank tests fail to be transitive when stochastic ordering is not\n    assumed (they are not consistent with any ordering on all distributions)\n  - rank tests do not lead to confidence intervals unless a location shift\n    or similar one-dimensional family is assumed\n  - No rank test is uniformly more powerful than any parametric test or\n    vice versa (if we rule out pathological cases)\n  - there is no rank test that is consistent precisely against a difference\n    in means\n  - the t-test (and essentially all tests) can be made distribution-free in\n    large samples (for small values of 'large', usually)\n  - being distribution-free does not guarantee robustness of power (for the\n    t-test or for any other test)\n\n\nNow, if we assume stochastic ordering is the Wilcoxon rank-sum test more \nor less powerful than the t-test?  Everyone knows that this depends on the \nnull hypothesis distribution.  Fewer people seem to know that it also \ndepends on the alternative, especially in large samples.\n\nSuppose the alternative of interest is not that the values are uniformly \nlarger by 1 unit, but that 5% of them are about 20 units larger.  The \nWilcoxon test -- precisely because it gives less weight to outliers -- \nwill have lower power.  For example (ObR)\n\none.sim<-function(n, pct, delta){\n \t x<-rnorm(n)\n \t y<-rnorm(n)+delta*rbinom(n,1,pct)\n \t list(x=x,y=y)\n \t }\n\nmean(replicate(100, {d<-one.sim(100,.05,20); t.test(d$x,d$y)$p.value})<0.05)\nmean(replicate(100, {d<-one.sim(100,.05,20); wilcox.test(d$x,d$y)$p.value})<0.05)\n\nmean(replicate(100, {d<-one.sim(100,.5,1); t.test(d$x,d$y)$p.value})<0.05)\nmean(replicate(100, {d<-one.sim(100,.5,1); wilcox.test(d$x,d$y)$p.value})<0.05)\n\n\nSince both relatively uniform shifts and large shifts of small fractions \nare genuinely important alternatives in real problems it is true in \npractice as well as in theory that neither the Wilcoxon nor the t-test is \nuniformly superior.\n\nThis is without even considering violations of stochastic ordering -- \nwhich are not just esoteric pathologies, since it is quite plausible for a \ntreatment to benefit some people and harm others. For example, I've seen \none paper in which a Wilcoxon test on medical cost data was statistically \nsignificant in the *opposite direction* to the difference in means.\n\nThis has been a long rant, but I keep encountering statisticians who think \nanyone who ever recommends a t-test just needs to have the number 0.955 \nquoted to them.\n\n\n>\n>    LuckeJF> Testing for normality prior to choosing a test\n>    LuckeJF> statistic is generally not a good idea.\n>\n> Definitely. Or even: It's a very bad idea ...\n>\n\nI think that's something we can all agree on.\n\n \t-thomas\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}