{"category": "ham", "to_address": "sj <ssj1364@gmail.com>", "from_address": "Frank E Harrell Jr <f.harrell@vanderbilt.edu>", "subject": "Re: [R] psm/survreg coefficient values ?", "body": "sj wrote:\n> I am using psm to model some parametric survival data, the data is for\n> length of stay in an emergency department. There are several ways a\n> patient's stay in the emergency department can end (discharge, admit, etc..)\n> so I am looking at modeling the effects of several covariates on the various\n> outcomes. Initially I am trying to fit a  survival model for each type of\n> outcome using the psm function in the design package,  i.e., all  patients\n> who's visits  come to an end  due to  any event other than the event of\n> interest are considered to be censored.  Being new to the psm and  survreg\n> packages (and to parametric survival modeling) I am not entirely sure how to\n> interpret the coefficient values that psm returns. I have included the\n> following code to illustrate code similar to what I am using on my data. I\n> suppose that the coefficients are somehow rescaled , but I am not sure how\n> to return them to the original scale and make sense out of the coefficients,\n> e.g., estimate the the effect of higher acuity on time to event in minutes.\n> Any explanation or direction on how to interpret the  coefficient values\n> would be greatly appreciated.\n> \n> this is from the documentation for survreg.object.\n> coefficientsthe coefficients of the linear.predictors, which multiply the\n> columns of the model matrix. It does not include the estimate of error\n> (sigma). The names of the coefficients are the names of the\n> single-degree-of-freedom effects (the columns of the model matrix). If the\n> model is over-determined there will be missing values in the coefficients\n> corresponding to non-estimable coefficients.\n> \n> code:\n> LOS <- sort(rweibull(1000,1.4,108))\n> AGE <- sort(rnorm(1000,41,12))\n> ACUITY <- sort(rep(1:5,200))\n> EVENT <-  sample(x=c(0,1),replace=TRUE,1000)\n> psm(Surv(LOS,EVENT)~AGE+as.factor(ACUITY),dist='weibull')\n> \n> output:\n> \n> psm(formula = Surv(LOS, CENS) ~ AGE + as.factor(ACUITY), dist = \"weibull\")\n> \n>        Obs     Events Model L.R.       d.f.          P         R2\n>       1000        513    2387.62          5          0       0.91\n> \n>               Value          Std. Error      z         p\n> (Intercept)     1.1055    0.04425  24.98 8.92e-138\n> AGE             0.0772    0.00152  50.93  0.00e+00\n> ACUITY=2     0.0944    0.01357   6.96  3.39e-12\n> ACUITY=3     0.1752    0.02111   8.30  1.03e-16\n> ACUITY=4     0.1391    0.02722   5.11  3.18e-07\n> ACUITY=5    -0.0544    0.03789  -1.43  1.51e-01\n> Log(scale)    -2.7287    0.03780 -72.18  0.00e+00\n> \n> Scale= 0.0653\n> \n> best,\n> \n> Spencer\n\nI have a case study using psm (survreg wrapper) in my book.  Briefly, \ncoefficients are on the log median survival time scale.\n\nFrank\n\n\n-- \nFrank E Harrell Jr   Professor and Chair           School of Medicine\n                      Department of Biostatistics   Vanderbilt University\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}