{"category": "ham", "to_address": "Ip-health <ip-health@lists.essential.org>,\n   a2k discuss list <a2k@lists.essential.org>", "from_address": "James Packard Love <james.love@keionline.org>", "subject": "[Ip-health] Gotham prize to encourage openness and collaboration in cancer research", "body": "*In spite of the billions of dollars that have been invested in\ncancer research, many promising research ideas do not receive support\n- either because they go against the mainstream, because of a lack of\nfunding to test ideas, or because preliminary research isn't shared\nfor competitive reasons.\n\n* The Gotham Prize provides a real incentive by rewarding collaboration,\n\nhttp://www.prweb.com/releases/2007/5/prweb528415.htm\n\n2007-05-23\n\n$1 Million Gotham Prize Launched by Leading Scientists, Hedge Fund\nManagers to Encourage Innovation in Cancer Research\n\nProvides incentive to accelerate progress in the prevention,\ndiagnosis and treatment of cancer by encouraging collaboration among\nleading medical researchers\n\nNew York, NY (PRWEB) May 23, 2007 -- A group of leading scientists\nand hedge fund managers today announced the creation of the \"Gotham\nPrize for Cancer Research\" (Gotham Prize), an annual award designed\nto encourage new and innovative approaches to cancer research by\nfostering collaboration among top thinkers in the field. The Prize\nwas announced at the annual Ira Sohn Investment Research Conference,\na charity event that brings together a group of nationally recognized\ninvestors who share their investment insights to raise money for\ncancer research. The winner of the $1 million Gotham Prize, as well\nas an additional prize - the $250,000 Ira Sohn Conference Foundation\nPrize in Pediatric Oncology - will be selected by a distinguished\npanel of leading scientists from institutions including Harvard,\nJohns Hopkins and New York University. Details on the Prize can be\nfound at www.gothamprize.org.\n\nIn spite of the billions of dollars that have been invested in cancer\nresearch, many promising research ideas do not receive support -\neither because they go against the mainstream, because of a lack of\nfunding to test ideas, or because preliminary research isn't shared\nfor competitive reasons. The Gotham Prize will address these gaps by\nbringing together the top minds in the field to encourage accelerated\nprogress in the prevention, etiology, diagnosis and treatment of\ncancer. The winner of the Prize will receive $1 million for personal\nuse, while the Gotham Prize website will serve as an ongoing forum\nfor cancer researchers to test and exchange ideas. The website will\nalso provide a mechanism to connect scientists with other potential\nsources of funding from foundations and individuals.\n\nThe Gotham Prize was founded by hedge fund managers Joel Greenblatt\nand Robert Goldstein of private investment firm Gotham Capital, and\nrespected medical researcher Dr. Gary Curhan of Harvard Medical\nSchool, with support from the Ira Sohn Conference Foundation and Ephi\nGildor of Axiom Investment Advisors. Inspired by the memory of\nGoldstein's mother, Hope Goldstein, who passed away recently from\novarian cancer, the founders sought a new way to make progress in\ncancer research. The Gotham Prize website is modeled on the Value\nInvestors Club, an online investment club founded by the partners of\nGotham Capital where top investors share their best ideas.\n\n\"I have seen firsthand how many ideas with incredible potential never\nreach fruition,\" said Dr. Curhan. \"We will only make significant\nprogress in cancer research by learning from each other's successes\nand mistakes, and by building on each other's knowledge. Through the\nGotham Prize website, we will bring together the best and brightest\nminds in the field to share ideas and inspire new approaches.\"\n\n\"The Gotham Prize provides a real incentive by rewarding\ncollaboration,\" said Greenblatt. \"We hope that encouraging this\nmarketplace of ideas will lead to breakthrough innovations in cancer\nresearch.\"\n\nThe Gotham Prize Advisory Board, which will select the winners of the\nprizes, includes such distinguished scientists as Dr. Bert Vogelstein\nof Johns Hopkins School of Medicine, who was the first to elucidate\nthe molecular basis of a common human cancer and is currently the\nmost highly cited scientist in the world, and Dr. Meir Stampfer of\nHarvard Medical School, the most highly cited scientist in clinical\nmedicine over the past two decades.\n\nThe Ira Sohn Research Conference Foundation, founded in 1995 in honor\nof Ira Sohn, a successful Wall Street trader who died of cancer at\nthe age of 29, is providing support for the Gotham Prize website, as\nwell as for both of the prizes. The annual Ira Sohn Research\nConference raises funds for the care and treatment of children with\npediatric cancer and other life-threatening illnesses.\n\n\"We are honored to continue Ira Sohn's legacy by supporting pediatric\ncancer research through the Ira Sohn Conference Foundation Prize in\nPediatric Oncology,\" said Dan Nir, head of the Ira Sohn Conference\nFoundation. \"Ira was passionate about helping children affected by\ncancer, and I know he would be pleased that we are contributing to\nthis effort to encourage and support groundbreaking research.\"\n\nThe $1 million annual prize will be open to a group of pre-qualified\nmembers who will share their ideas and concepts by posting a short\nthesis and/or proposal and answering questions on the Gotham Prize\nwebsite. The Advisory Board will select the members from applications\nsubmitted through the website. Member postings will be anonymous\n(except to the Board) and will only be made known through voluntary\ndisclosure. Each year, the member that submits the best idea in the\narea of cancer research, as judged by the Advisory Board, will\nreceive $1 million for personal use. The Ira Sohn Conference\nFoundation Prize will also be awarded annually for the best idea\nrelated to pediatric cancer.\n\nApplicants will be judged on the importance and description of the\nidea, as well as the feasibility of studying it. Furthermore, to be\neligible to win the Prize, members must post and answer questions on\nthe website and will be judged on the message string that starts\namong members of the site after an idea is posted.\n\nThe Gotham Prize website will also serve as an ongoing forum for\ncancer researchers to exchange ideas, as well as to connect with\npotential sources of funding. All member ideas submitted for the\nPrize will also be made available to all foundations, individuals and\ngroups that fund cancer research. With prior permission, members will\nalso be matched with other scientists who may be able to assist or\ncollaborate on individual projects.\n\nThe Prize was founded as a new way to encourage new innovations in\ncancer research by addressing some of the obstacles that currently\nexist. Apart from funding constraints, research that is not in the\nmainstream or that flies in the face of currently accepted theories\nmay not be supported or accepted for publication, while - for\ncompetitive reasons - preliminary research and ideas are often not\nwidely shared. Furthermore, scientists and researchers who do not fit\na specialized profile are unlikely to be funded to pursue new\ntheories or innovative avenues. In addition, many grants from\nfoundations or individuals support general research, rather than\nspecific projects.\n\nThe Advisory Board members are: Dr. Curhan, an Associate Professor of\nMedicine at Harvard Medical School and Associate Professor of\nEpidemiology at Harvard School of Public Health; Dr. Vogelstein, a\nProfessor at Johns Hopkins School of Medicine; Dr. Stampfer, a\nProfessor of Medicine at Harvard Medical School and Professor of\nEpidemiology at Harvard School of Public Health, where he served as\ndepartment chair; Dr. George Teebor, a Professor at New York\nUniversity School of Medicine; Dr. Joseph R. Bertino, Interim\nDirector of the New Jersey Cancer Center and University Professor of\nMedicine and Pharmacology at UMDNJ-Robert Wood Johnson; Dr. Michael\nKastan, Director of the Cancer Center at St. Jude Children's Research\nHospital in Memphis, Tenessee, and Director of the Molecular\nTherapeutics Division and Co-Director of the Molecular Oncology Program.\n\nAbout the Gotham Prize:\nThe annual $1 million Gotham Prize for Cancer Research is being\nestablished to encourage new and innovative approaches to cancer\nresearch by fostering collaboration among top thinkers in the field.\nAn additional prize of $250,000, the Ira Sohn Conference Foundation\nPrize in Pediatric Oncology, will also be awarded. In addition to\nproviding these annual prizes, the Gotham Prize website will provide\na forum to match cancer researchers with each other, as well as with\npotential sources of funding. The 2007 Gotham Prizes will be\nannounced in February 2008.\n\nFor more information, please visit www.gothamprize.org\n\nAbout The Ira Sohn Research Conference Foundation:\nThe Ira Sohn Research Conference was founded in 1995 after the\nuntimely passing of Ira Sohn, a successful trader on Wall Street.\nAfter a valiant battle with cancer, Ira passed away at the age of 29.\nHis passion inspired his colleagues to launch the annual Ira Sohn\nResearch Conference to raise funds for the care and treatment of\nchildren with pediatric cancer and other life-threatening illnesses.\nThe organizations served include the Tomorrows Children's Fund at\nHackensack University Medical Center, New York Presbyterian\nHospital / Weill Cornell Medical Center, and ArtWorks.\n\nGotham Prize Advisory Board Members:\nJoseph R. Bertino, MD, Robert Wood Johnson Medical School. Dr.\nBertino is the Interim Director of the Cancer Institute of New Jersey\nand University Professor of Medicine and Pharmacology at UMDNJ-Robert\nWood Johnson. Prior to his current position Dr. Bertino was Chairman\nof the Program of Molecular Pharmacology and Therapeutics at Memorial\nSloan-Kettering Cancer Center and Professor of Medicine and\nPharmacology at Cornell University Medical College. He spent many\nyears at Yale University both as a Professor, Chief of Oncology and\nChemotherapy and as the first Director of the Yale Comprehensive\nCancer Center. Dr. Bertino is the past President of AACR and ASCO.\n\nGary Curhan, MD, ScD, Harvard Medical School. Dr. Gary Curhan is an\nAssociate Professor of Medicine at Harvard Medical School and\nAssociate Professor of Epidemiology at Harvard School of Public\nHealth. He is a practicing nephrologist at Brigham and Women's\nHospital and an active investigator with multiple NIH grants. Dr.\nCurhan's research has focused on metabolic conditions (e.g.\nnephrolithiasis, gout), cardiovascular disease and cancer. He has\nauthored over 150 articles and book chapters.\n\nMichael B. Kastan, MD, PhD, St. Jude Children's Research Hospital.\nDr. Kastan is the Director of the Cancer Center at St. Jude\nChildren's Research Hospital in Memphis, Tennessee, Director of the\nMolecular Therapeutics Division and Co-Director of the Molecular\nOncology Program.\n\nMeir Stampfer, MD, DrPH, Harvard Medical School. Dr. Stampfer is a\nProfessor of Medicine at Harvard Medical School and Professor of\nEpidemiology at Harvard School of Public Health, where he served as\ndepartment chair. He has authored over 800 articles and book\nchapters, and was identified as the most highly cited scientist in\nclinical medicine over the past two decades. He is an active\ninvestigator with multiple NIH grants, and his research has focused\non cardiovascular disease and cancer.\n\nGeorge W. Teebor, MD, New York University School of Medicine. Dr.\nTeebor is Professor of Pathology and Environmental Medicine at the\nNew York University School of Medicine where he has also served as\nVice Dean for Research and Interim Chairperson of the Department of\nPathology. He is a board certified pathologist and has been an NIH\nfunded investigator for over 30 years including receipt of a MERIT\nAward. His research interest has been the etiology of cancer-\ninitiating and/or promoting mutations and their prevention by the DNA\nrepair machinery of the cell.\n\nBert Vogelstein, MD, Johns Hopkins School of Medicine. Dr. Vogelstein\nwas the first to elucidate the molecular basis of a common human\ncancer. His work on colorectal cancers forms the paradigm for much of\nmodern cancer research, with profound implications for diagnostic and\ntherapeutic strategies in the future. According to the Institute for\nScientific Information, Dr. Vogelstein is currently the most highly\ncited scientist in the world.\n\n###\n\nCONTACT INFORMATION\nGROUP ZOMBIE - Clara Perez\nGotham Prize for Cancer Research\nVisit Our Site\n212-780-0200\nEmail us Here\nATTACHED FILES\n\n\n----------------------------------------------\nJames Packard Love\nKnowledge Ecology International\nmailto:james.love@keionline.org\ntel. +1.202.332.2670 / U.S. mobile+1.202.361.3040, Geneva mobile\n+41.76.413.6584\n\n\"If everyone thinks the same: No one thinks.\" Bill Walton\"\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}