{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "1205a 6/14 Update: ADVISORY", "body": "\n\n\n\n\n1205a 6/14 Update: ADVISORY\n\n\n\n=================================\n\nCBS NEWS STS-117 ADVISORY\nPosted: 11:40 PM, 6/13/07\n\nBy William Harwood\nCBS News Space Analyst\n\n=================================\n\nA major computer shutdown in the Russian segment of the international space station has triggered around-the-clock troubleshooting to resolve the problem before the shuttle Atlantis departs next week. Russian engineers believe the computer glitch may have been related to the addition of a new set of U.S. solar arrays Monday and subtle changes in the station's electrical power grid, mass distribution or other properties. Engineers are assessing a variety of possibilities.\n\nWithout the guidance and control computers, Russian maneuvering rockets cannot be fired to make changes in the station's orientation that are beyond the capability of the lab's control moment gyroscopes. NASA managers said tonight they are confident Russian engineers will get to the bottom of the problem but in the meantime, shuttle planners are looking into power conservation measures to permit an additional docked day if required. While the shuttle is docked, its own thrusters can be used to maintain the station's orientation as required. But the Russian computers must be functioning before the shuttle departs. A detailed story will be posted here shortly.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}