{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 113", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Antiquities Authority manhandled Leviticus scroll,\tsays\n      archaeologist (Museum Security Network Mailing list)\n   2. France, Paris. Thief steals 80 works of art from the\n      Institute of the Arab World (Museum Security Network Mailing list)\n   3. US. The case of the stolen statues: Bronze artwork returned,\n      one man in jail (Museum Security Network Mailing list)\n   4. Spanish museum said to be exhibiting stolen Egyptian\n      antiquity (Museum Security Network Mailing list)\n   5. Munch painting stolen by Nazis is returned to Mahler heir\n      (Museum Security Network Mailing list)\n   6. UK. Lowry robbery couple tell of knife raid ordeal\n      (Museum Security Network Mailing list)\n   7. China. Recupera China barco con porcelanas de hace 800 a?os\n      (Museum Security Network Mailing list)\n   8. At the Bruce, the Art of Deception\n      (Museum Security Network Mailing list)\n   9. UK. Prized Zimbabwean sculpture stolen from gallery\n      (Museum Security Network Mailing list)\n  10. Tutela dell'arte: il bilancio dei Carabinieri\n      (Museum Security Network Mailing list)\n  11. Canada. Police probing link between blaze, theft; Replica\n      Indian village broken into the night before costly fire\n      (Museum Security Network Mailing list)\n  12. US. Mariners' Museum sues to get items returned\n      (Museum Security Network Mailing list)\n  13. US. Warhol found in Aspen after 17 years\n      (Museum Security Network Mailing list)\n  14. Artifacts pit American Indians against museums\n      (Museum Security Network Mailing list)\n  15. CORNWALL- A series of tall, graceful statues have traveled a\n      long way to make their debut at the Insiders/Outsiders Art\n      Gallery in the new \"All About Africa\" exhibition, but soon they\n      will return home. (Museum Security Network Mailing list)\n  16. Germany. Kunstraub in Rheinbach\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Fri, 11 May 2007 09:59:33 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Antiquities Authority manhandled Leviticus scroll,\tsays\n\tarchaeologist\nTo: Museum Security Network Mailinglist \nMessage-ID: <46442265.1010109@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n    Antiquities Authority manhandled Leviticus scroll, says archaeologist\nBy Yair Sheleg \n\nProfessor Hanan Eshel, the archaeologist who two years ago uncovered \nscroll fragments of the Book of Leviticus, says the Israel Antiquities \nAuthority, which now has the finds, has cut out large chunks of the \nscroll on the pretext that its dating needed to be examined.\n\nThis was not a necessary procedure, says Eshel, since \"experts say it \nwas possible to test the dating without an intrusive examination and in \nthe worst case scenario by cutting a tiny, peripheral portion of the \nscroll.\"\n\n\nRelying on internal sources in the Antiquities Authority, Eshel says \n\"there had even been plans to cut letters from the scroll but the \nemployees that were asked to do so refused.\"\n\nEshel ties the behavior of the Authority to a dispute that emerged \nbetween him and officials there and \"their desire to prove that the \nscroll is a forgery.\"\n\nAmir Ganor, director of the unit for the prevention of theft in the \nAntiquities Authority, said in response that \"in order to carry out the \nexamination we could not avoid making certain cuts in the scroll itself. \nThis is acceptable in every examination of this sort. We cut only two \nsmall parts, one-half centimeter each, from the end of the scroll. At no \nstage was there any thought of cutting letters, only to scrape off some \nink in order to examine it. The minute it became clear to us that we \ncould not have unequivocal results from such an examination, we did not \ndo it.\"\n\nHowever, the photographs published here suggest the scroll cuts are \nsignificantly more extensive than what Ganor acknowledges and encompass \nnearly all the part of the scroll that has no writing on it.\n\nGanor said examinations of the scroll have undermined Eshel's claim that \nthe finding is authentic.\n\n\"I can not give any details because the topic is part of an ongoing \ninvestigation of this matter, but the examinations show that different \nportions of the scroll were written in different periods, which is a \nblow to the claim that the scroll is homogeneous.\"\n\nEshel, on the other hand, is eager to offer more information on the \nsubject. He says: \"The information that I have is that the examination \nthat was carried out at the Weizmann Institute did indeed show that the \ntwo portions that were sent for examination belong to different periods \n- one about 2,000 years ago, and the other about 1,200 years ago. On the \nother hand, another examination carried out at Oxford [University] \nattributed both to a period 2,000 years ago.\"\n\nEshel says the Weizmann test results were flawed because of \"the use of \ncleaning and preservation materials. I am not an expert on such exams, \nbut the experts told me that such treatment may certainly result in a \nflawed examination. In any case, the writing on both segments clearly \nbelongs to the Second Temple period and definitely does not conform to \nthe Mameluk period, which is what the Weizmann Institute examination \npoints to. Moreover, during the search in the cave where we found the \nscroll, we uncovered other archaeological finds for the period of the \nBar-Kokhba revolt, proving the dating.\"\n\nhttp://www.haaretz.com\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Fri, 11 May 2007 09:59:42 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] France, Paris. Thief steals 80 works of art from the\n\tInstitute of the Arab World\nTo: Museum Security Network Mailinglist \nMessage-ID: <4644226E.2030406@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n    Thief steals 80 works of art from the Institute of the Arab World\n\nBy  france24.com\n\nSome 80 Islamic works of art and contemporary pieces have disappeared \nfrom the reserves of the Institute of the Arab World. Its president \nDominique Baudis confirmed that they had lodged a complaint for theft.\n \n?39 works of art belonging to the permanent collections and 38 pieces \nbelonging to the Islamic art collection have disappeared from the \nreserves of the Institute,? said Mr. Baudis, adding that the thefts were \ndiscovered last week during stocktaking. \n \nAccording to Mr. Baudis, contemporary engravings and prints and cloths, \nmosaics, aquarelles and vases from the Islamic art collection have been \nstolen. \n \nThe Institut of the Arab World is a foundation, based in Paris, which \naims at introducing Europeans to Arab culture. It houses some 850 works \nof art.\n\nhttp://www.france24.com\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Fri, 11 May 2007 09:59:49 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. The case of the stolen statues: Bronze artwork\n\treturned, one man in jail\nTo: Museum Security Network Mailinglist \nMessage-ID: <46442275.9000302@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n      The case of the stolen statues: Bronze artwork returned, one man\n      in jail\n\nBy BEN CRITES\nbcrites@islandpacket.com \n843-706-8138\nPublished Wednesday, May 9, 2007\n\nAt the end of a high-speed chase on Hilton Head Island in March, the \ndriver that deputies were pursuing abandoned his vehicle and his passengers.\n\nThose passengers weren't in any position to flee.\n\nThey were bronze statues created by renowned professional sculptor W. \nStanley \"Sandy\" Proctor -- the same statues stolen from the Red Piano \nArt Gallery on Hilton Head earlier that night.\n\nAfter a lengthy investigation, the Beaufort County Sheriff's Office says \nit can't prove Jonathan David Limbert stole the statues, valued at \n$60,000-$80,000, from the studio March 23.\n\nInstead, deputies arrested Limbert, 25, of Bluffton, on a felony charge \nof receiving stolen goods. He turned himself in around 6:45 a.m. \nSaturday at the Beaufort County Detention Center.\n\nThe \"goods\" were the statues depicting two boys, a girl and a dog \nplaying follow the leader, similar to those Proctor created for the \nFlorida Governor's Mansion in 1998.\n\nLimbert told investigators the statues were given to a friend to sell as \nscrap metal, according to sheriff's Capt. Toby McSwain. Limbert also \nsaid that friend was in the car with him at the time of the chase. \nDeputies have been unable to confirm that.\n\nHere's how things unfolded:\n\nAt around 1 a.m. March 23, a Chevrolet Blazer that Limbert was thought \nto be driving sped past a deputy on William Hilton Parkway near Park \nLane, according to McSwain.\n\nThe deputy made a U-turn and followed the SUV, which quickly pulled into \nthe Hargray parking lot. The SUV then drove over shrubs, through a ditch \nand back onto the parkway.\n\nThe chase ended after the Blazer pulled into the back of Fresh Market \nShoppes and the driver fled. At first, the deputy thought others might \nhave been inside the SUV.\n\nThere were, sort of.\n\nThe silhouettes he saw likely were those of the stolen statues, McSwain \nsaid.\n\nMcSwain said Limbert's mother brought her son back to the site of the \nabandoned vehicle. A Bluffton police officer had told her deputies were \nlooking for him.\n\nThe Sheriff's Office stowed the statues in a conference room at its \nHilton Head office. The next day they got a call from Ben Whiteside, \nowner of Red Piano Art Gallery on Cordillo Parkway.\n\nSomeone had stolen the statues from outside the gallery.\n\nWhiteside said the theft could not have been easy.\n\nThe roughly 200-pound statues were fastened to concrete slabs with \n4-inch thick steel bars. To free them, one would have to saw through the \nsteel bars and lug the heavy art away, he said.\n\n\"It takes at least three guys and a hacksaw to move one of (the \nstatues),\" Whiteside said. \"They had to be there for an hour at least. \nYou can't do it quickly.\"\n\nThe statues were returned to the gallery the next day with about $3,000 \nworth of damage. The art is in the process of being restored and will \nlikely be displayed again, Whiteside said.\n\nLimbert was being held at the Beaufort County jail Tuesday night, \naccording to the jail's online log.\n\nRed Piano is one of several private galleries who sell Proctor's work.\n\nAmong the many commissioned pieces he has created are a statue of \nFlorida State University football coach Bobby Bowden, \"Father Kelly\" for \nBishop England High School in Charleston and \"The Sunday Paper\" for the \nTallahassee Democrat newspaper in Florida.\n\n\"(Proctor) was thrilled we got them right back,\" Whiteside said.\n\nhttp://www.islandpacket.com/\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Fri, 11 May 2007 09:59:54 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Spanish museum said to be exhibiting stolen Egyptian\n\tantiquity\nTo: Museum Security Network Mailinglist \nMessage-ID: <4644227A.7020403@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n  Spanish museum said to be exhibiting stolen Egyptian antiquity\n\n\n*MADRID, Spain:* A Barcelona museum of Egyptian artifacts on Wednesday \ndenied charges that one of its statues may have been stolen from Egypt, \na dispute that has prompted the Cairo government to dispatch experts to \nexamine the piece as a possible step toward claiming it.\n\nThe limestone artwork ? a 43-centimeter-tall (17-inch) depiction of a \nprincess named Nefert ? is on display at the Egypt Museum of Barcelona, \nwhich says it will return the piece if it turns out to have been stolen.\n\nThe charges come from a Spanish Egyptologist who used to work at the \nmuseum but left about two years ago, Ildefonso Falcones, the museum's \nlawyer, said in an interview from Barcelona.\n\nWhen the archaeologist stopped working at the museum, she demanded \npayment of damages for alleged psychological abuse on the job. When the \nmuseum refused, she went to Egyptian authorities with her suspicions \nthat the statuette was removed from Egypt illegally.\n\n\"She did it in revenge,\" said Falcones, who would not release her name \nand did not know the exact reason why she left the museum.\n\nFalcones said the museum bought the statue legally from an art gallery \nin Switzerland about eight years ago. It was later brought to Spain, \nwhere it was declared to Spanish customs authorities.\n\nZahi Hawass, general secretary of the Superior Council of Antiquities of \nthe Egyptian government, told The Associated Press in Cairo on Wednesday \nthat he is sending a delegation of three experts to Barcelona next week \nto examine the statuette.\n\nBut he said the issue is whether the piece is authentic, not whether it \nwas stolen, and that if it is real, Egypt will claim it.\n\nFalcones insisted the statuette is real. \"If not, why all the fuss?\" he \nsaid, adding that the museum had not been contacted by the Egyptian \nauthorities.\n\n\"At this point, we don't have any evidence of what the motives are \nbehind these suspicions that it left Egypt illegally,\" said Falcones.\n\nHe said the museum has two signed documents from Barcelona judges \naffirming that all statues in the museum were acquired legally.\n\nFalcones said that if it is shown the statuette left Egypt illegally \nbefore being purchased by the museum, the museum will give the piece \nback to the Egyptians.\n\nhttp://www.iht.com/\n\n\n\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Fri, 11 May 2007 09:59:59 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Munch painting stolen by Nazis is returned to Mahler\n\their\nTo: Museum Security Network Mailinglist \nMessage-ID: <4644227F.1080605@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nMunch painting stolen by Nazis is returned to Mahler heir\n \nVienna (dpa) - Austria Wednesday returned Edvard Munch's \"Summer Night \nat the Beach\" to Marina Fistoulari-Mahler, granddaughter and sole heir \nof Alma Mahler, wife of Austrian composer Gustav Mahler.\n \nAfter more than five decades of legal disputes a panel had ruled in \nNovember 2006 that the painting, on display at Vienna's Belvedere \nGallery, was to be returned.\n\nFistoulari-Mahler, Claudia Schmid, Austria's minister in charge of art \nand culture and Belvedere director Agnes Husslein signed the restitution \ndocuments in the palace's main hall on Wednesday morning.\n\n\"I am deeply moved,\" Fistoulari-Mahler said when the painting was handed \nover. \"I thank Austria for the courage to accept that the painting had \nto be returned.\"\n\nMinister Schmid stressed her support for the decision, already made \nunder the previous conservative government, and said she would continue \nto look into other cases.\n\n\"We will investigate all cases, where there is suspicion of illegal \nactivities and want to help Nazi victims to get their rights.\"\n\nIn 1937 Alma Mahler-Werfel, by then married to writer Franz Werfel, \nagreed to loan the painting to the Belvedere Gallery for two years.\n\nIn March 1938, after Hitler's annexation of Austria, she was forced to \nflee the country with her Jewish husband.\n\nMeanwhile the gallery attempted to buy the painting from her. She \nrefused, but in 1940 Alma's step father, Nazi supporter Carl Moll, sold \nthe painting to the Belvedere in the name of Alma's half-sister.\n\nAfter the end of World War II in 1945, Alma demanded the painting's \nreturn, and in 1953 a commission ruled that her demands were justified.\n\nSeveral Austrian authorities however challenged the ruling, and as late \nas 1999 a restitution panel rejected claims by the Mahler family.\n\nExperts estimate the painting's worth to be between 8 and 10 million \ndollars.\n\nIn 2006 Austria returned five paintings by Gustav Klimt, also from the \nBelvedere, to the heirs of Adele Bloch-Bauer.\n\nhttp://www.eux.tv/\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Fri, 11 May 2007 10:00:05 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] UK. Lowry robbery couple tell of knife raid ordeal\nTo: Museum Security Network Mailinglist \nMessage-ID: <46442285.2010605@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nLowry robbery couple tell of knife raid ordeal\n\nHelen Carter\nThursday May 10, 2007\nThe Guardian\n\nAn art collector and his wife who were tied up at knifepoint and robbed \nof almost ?2m worth of Lowry paintings have spoken of the ordeal they \nendured, in front of their two-year-old daughter, at the hands of three \nmasked robbers.\n\nThe raiders burst into Ivan and Louise Aird's home in Cheadle Hulme, \nCheshire, early last Thursday morning, after Mrs Aird answered the front \ndoor to a man dressed as a postman. Three men threatened to kill their \ndaughter Sabrina unless they handed over their collection of LS Lowry's \nworks, including the artist's palette and paintbrushes.\n\nArticle continues\nOne of the stolen works, The Viaduct, worth ?700,000, once belonged to \nthe actor Alec Guinness.\n\nMr Aird said yesterday: \"These paintings were my own personal collection \n-they're something I've been collecting all my life. It was like a \npension - something to pass on to my daughter. I think this was well \nplanned. I am not interested in the money - I just want the pictures back.\"\n\nHe said the robbers would not be able to sell the pictures, because they \nwere so famous. Lowry was a friend of his family and his father, an art \ndealer, used to buy Lowry's works.\n\nMr Aird said the family now felt very uncomfortable in their own home.\n\n\"The people who've done this need to be caught,\" he said. \"They held a \nknife to a two-year-old girl. They shouldn't be out there on the streets.\"\n\nhttp://www.guardian.co.uk/\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Fri, 11 May 2007 10:00:10 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] China. Recupera China barco con porcelanas de hace 800\n\ta?os\nTo: Museum Security Network Mailinglist \nMessage-ID: <4644228A.5060303@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nRecupera China barco con porcelanas de hace 800 a?os\n\nPEK?N, CHINA, MAYO 9, 2007 (EFE).- Equipos de arque?logos han terminado, \ntras 55 d?as de trabajo, las labores de recuperaci?n de un barco de la \ndinast?a Song del Sur (1127-1279), hundido cerca de las islas Spratly, \nal sur de China, mientras contin?an las de otro barco de la ?poca en ese \nmismo mar, inform? hoy la prensa estatal.\n\nEl \"Huaguangjiao I\", como han denominado los arque?logos al nav?o, ten?a \n20 metros de eslora, seis de manga, capacidad para transportar 60 \ntoneladas, y un?a los puertos chinos con los del sureste de Asia y la \nIndia, lo que los historiadores llamaron \"la Ruta de la Seda mar?tima\".\n\nSe han recuperado del pecio m?s de 10.000 antig?edades, sobre todo \nporcelanas de color blanco y verde.\n\nEntre ellas hay piezas fabricadas en los que tanto hace ocho siglos como \nahora son considerados los mejores talleres de porcelana de China: los \nde la localidad de Jingdezhen, en la provincia suroriental china de Jiangxi.\n\nLas piezas ya han sido mostradas en una exposici?n en la isla sure?a de \nHainan, que fue inaugurada ayer por Zhang Wei, director del Centro \nEstatal de Investigaciones Submarinas del Museo Estatal de China.\n\nZhang explic? que el barco fue descubierto en los a?os 90 y que seg?n \nlos expertos es el m?s antiguo nav?o chino hundido en alta mar que se \nconoce.\n\nLa zona donde se descubrieron los restos, el archipi?lago Spratly \n(llamado Xisha por los chinos) es disputada por todos los pa?ses ba?ados \npor el Mar de la China Meridional, incluyendo China, Vietnam, Filipinas, \nMalasia, Brunei e Indonesia.\n\nTambi?n en ese mar, aunque m?s cerca de las costas chinas, los \narque?logos trabajan desde hace a?os en la recuperaci?n de uno de los \nbarcos m?s preciados para los historiadores chinos, el \"Nanhai I\", \nhundido hace unos 800 a?os, con unas 70.000 reliquias hist?ricas en su \ninterior.\n\nEsta semana, los expertos chinos que trabajan en su recuperaci?n junto a \ncolegas brit?nicos se?alaron que han empezado a izar el pecio.\n\nZhang indic? que el rescate del \"Huaguangjiao I\" todav?a ha sido m?s \ncomplicado que en el caso del \"Nanhai I\", por estar a mayor profundidad \ny en alta mar.\n\nLas autoridades chinas de protecci?n del patrimonio hist?rico se \nquejaron el mes pasado de que \"piratas\" extranjeros, con avanzadas \ntecnolog?as, est?n peinando los lechos marinos de China para buscar \nbarcos como ?stos, en busca de tesoros, actividad que Pek?n considera un \nrobo. EFE\n\nhttp://srv2.vanguardia.com.mx\n\n\n\n\n------------------------------\n\nMessage: 8\nDate: Fri, 11 May 2007 10:00:20 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] At the Bruce, the Art of Deception\nTo: Museum Security Network Mailinglist \nMessage-ID: <46442294.4000107@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nAt the Bruce, the Art of Deception\n\nBY MAUREEN MULLARKEY - Special to the Sun\nMay 10, 2007\nURL: http://www.nysun.com/article/54196\n\nFaking it is as old as the recorded history of art. The fifth-century \nB.C.E. sculptor Phidias is said to have signed the work of talented \nstudents. Young Michelangelo purportedly added a false patina to a \nstatue sold to Cardinal Riario, an astute collector of antiquities, as a \ngenuine antique.\n\nFast-forward to 1999, when 28 Georgia O'Keeffe watercolors were removed \nfrom the canon. The suite had previously sold for $5 million after \nreported endorsement by the O'Keeffe Foundation and the National Gallery \nof Art. In 2000, Sotheby's and Christie's were embarrassed to learn they \neach held the one and only \"Vase de Fleurs\" by Gauguin. And consider \nthose legions of small, unsigned works still beckoning scholars whose \nenthusiasm outweighs their discernment. The sheer scale of falsity \nprompted Newsweek's celebrated quip that of the 2,500 paintings Corot \nmade in his lifetime, 7,800 were in America.\n\nThe Bruce Museum's \"Fakes and Forgeries: The Art of Deception,\" opening \nSaturday, surveys the history of deceit in Western art with uncommon \ncandor and lively scholarship. It is a rousing tour through intrigue, \nmisattributions, copying, and creative acts of identity theft. It covers \nsleights of hand from forged documents and false provenance to technical \nprocedures used to fabricate historical works.\n\nTreating sculpture, manuscripts, Gothic ivories, decorative arts, \npainting, prints, and photographs, this feast of malfeasance holds as \nmuch for scholars and collectors as for the general public. The show is \nauthoritative, instructive ? and wicked fun. The earliest forged styles \non view are Egyptian, Greek, and Assyrian, from which the show moves \nchronologically through historical periods to the modern era. The \ncaliber and scope of counterfeits exhibited, most from prestigious \ncollections, is startling.\n\n >From Piero to Pollock, brand names of every period are widely faked. \nBut the forgery market also keeps pace with contemporary trends. Forgers \nare driven, like collectors, by high auction prices. Forgery extends \neven to artists such as Jean-Michel Basquiat, who are not traditional \nblue chips.\n\nHans van Meegeren's \"Christ and His Disciples at Emmaus\" (c.1936), \npainted in the style of Vermeer, is likely the most renowned forgery in \nthe world. It is thrilling to have it here. Vermeer's output was so \nsmall that this \"hitherto unknown painting,\" created a sensation when \nits discovery was announced in 1937 by art historian Abraham Bredius. \nVan Meegeren's saga, his disdain for the art market and his postwar \ntrial for collaboration (selling a \"Vermeer\" to Hermann G?ring) is a \nmodern legend. His canon of forgeries ? the works Vermeer should have \npainted ? is not yet settled. Suddenly, Cynthia Ozick's phrase \"the \nimplausibility of originality\" takes on real meaning.\n\nA quasi folk hero among forgers, Eric Hebborn (1934?96), sometime \nprot?g? of scholar and spy Anthony Blunt, is represented by a faux \nMantegna drawing owned by the Morgan Library. He inscribed \"Andrea \nMantegna\" on the sheet and manufactured a provenance that included \nownership by Sir Joshua Reynolds.\n\nA convincing still life in the manner of ?douard Manet was exhibited in \nthe 1913 Armory Show as an example of his contribution to the \ndevelopment of modern art. A deft \"Giacometti\" painting of a seated nude \nis by the versatile John Myatt (b. 1945), who gave up illegal forgery \nfor the legitimate kind. Although he still signs each forgery on the \nfront with the artist's signature, the back is now inscribed \"Genuine Fake.\"\n\nWhat van Meegeren was to Dutch Masters, Br?gido Lara (b. 1940) is to \npre-Columbian pottery, of which he claims to have created 40,000 \nforgeries. He continues to sculpt in ancient styles but, chastened by \narrest in 1974, now signs his work.\n\nThe Rospigliosi Cup from the Benjamin Altman collection, once attributed \nto Benvenuto Cellini, has been proven either a 19th-century copy or an \noutright fraud. Nevertheless, the Metropolitan Museum of Art still \nexhibits it, discreetly labeled, on grounds that it is beautiful.\n\nMuseums are reluctant to concede errors or embarrass donors. When large \ninvestments and reputations are on the line, open admission that someone \nhas been misled risks suit for libel or product disparagement. Besides, \nif a museum is courting a certain collector to donate his C?zanne, \nshould it bypass his dubious Cassatt being pressed on it for an upcoming \nexhibition?\n\nMore people are responsive to signatures ? trademarks ? and the cachet \nof possession than to art itself. Forgeries, then, will be with us \nforever. That is why this comprehensive, imaginative exhibition is \ncompulsory for anyone who would understand the cultural politics and \ngamesmanship of authentication.\n\nThe issues involved have profound cultural implications that go beyond \nthe monetary stakes to the credibility of experts and matters of public \ntrust. Bruce director Peter Sutton summarizes the show's purpose: \"[It] \nchallenges museumgoers to ask fundamental questions about what \nconstitutes authenticity and originality in a cynical and occasionally \nmendacious art world.\" Both the exhibition and its detailed catalog \nserve warning to the inexperienced and the credulous and invite extended \ndiscussion.\n\nA scholar in his own right, Mr. Sutton contributed a major essay on \nconnoisseurship to Robert Spencer's \"The Expert Versus the Object\" \n(2004), a book which cautioned that \"truth in labeling does not always \npertain to what changes hands in the present day art world.\" (A \nvariation of that essay appears in the catalog.) Senior curator Nancy \nHall-Duncan is frank: \"In the late twentieth century, forgery, like art \nitself, became big business. . . . [and] the temptation to misrepresent \nart has become stronger and more lucrative.\"\n\nThoughtful viewers will come away more attentive to conflicts of \ninterest among appraisers. The Art Dealers Association of America, for \nexample, maintains a prominent appraisal service, contending that \ndealers are best equipped to establish value precisely because they make \ntheir living from the market. Viewers may have their own thoughts on \nwhether this is a species of poacher-turned-gamekeeper.\n\nWith art the new bullion, the culture cannot afford to have its currency \ndebased.\n\nHats off to the Bruce for a confident tutorial on why fakes matter.\n\nUntil September 9 (One Museum Drive, Greenwich, Conn., 203-869-6786).\n\nURL: http://www.nysun.com/article/54196\n\n\n\n\n------------------------------\n\nMessage: 9\nDate: Fri, 11 May 2007 10:00:25 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] UK. Prized Zimbabwean sculpture stolen from gallery\nTo: Museum Security Network Mailinglist \nMessage-ID: <46442299.8040308@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nPrized sculpture stolen from gallery\nPublished:  11 May, 2007\n\nA TRUSTING Black Isle gallery owner is now reviewing security \narrangements at her facility following the theft of a prized African \nsculpture.\n\nThe abstract piece of work, entitled Bathing Man, by Zimbabwean artist \nRemos Chiuware, was taken from the entrance of Tore Art Gallery.\n\nAt 20 inches tall and made from white opalite, it is one of a range of \ntraditional pieces from Zimbabwe currently on sale at the gallery.\n\nThe missing sculpture was noticed on Sunday morning. Gallery proprietor \nClare Blois said, \"We were delighted to have found the work of these \nsculptors and went to a great deal of trouble to get the pieces here.\n\n\"It is very upsetting that somebody should have just helped themselves. \nThe sculptures are quite heavy and designed to be displayed outside, but \nsadly we shall have to reconsider this. I had hoped that in this area \nthey would be safe, but I guess I was just too trusting.\"\n\nThe stone sculpture was brought from Zimbabwe by Jon Eaton from \nGloucestershire, who has also set up a safe workshop environment near \nHarare so that artists can continue to work in the strife-ridden \ncountry. As well as promoting the artists' work, Mr Eaton organises \nprojects in Zimbabwe to provide running water to villages and schools.\n\nThe traditional stone sculptors use a variety of stone types and behind \nevery piece is a human story. Every sculptor works on their creation by \nhand, with no power tools used at any stage in the process.\n\nStaff at Tore Art Gallery, who would be very pleased to hear if anyone \nhas noticed the sculpture anywhere, can be contacted on 01463 871444.\n\nhttp://www.ross-shirejournal.co.uk/\n\n\n\n\n------------------------------\n\nMessage: 10\nDate: Fri, 11 May 2007 10:00:31 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Tutela dell'arte: il bilancio dei Carabinieri\nTo: Museum Security Network Mailinglist \nMessage-ID: <4644229F.3090506@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nTutela dell'arte: il bilancio dei Carabinieri\nNel 2007 (ad aprile) in Toscana: 379 tesori trafugati, 381 oggetti \ncontrollati, 31 i furti. Alcuni dei numeri resi noti in una lezione \nsulla legalit? tenuta in Consiglio dal generale Ugo Zottin\n\nFirenze - In Toscana nei primi quattro mesi del 2007 sono stati 379 gli \noggetti di valore artistico e storico trafugati fra libri, opere di \nebanisteria, oggetti sacri, stampe, quadri, sculture, strumenti musicali \n(1.032 nell?intero 2006); 381 quelli controllati (6.888 nel 2006) e 323 \n(191 nel 2006) quelli restituiti ai proprietari; 31 (110 nel 2006), \ninoltre, i furti consumati a danno di musei, enti pubblici e chiese. \nQuesti alcuni numeri che riguardano l?attivit? del Comando Carabinieri \nTutela Patrimonio Culturale, resi noti nel corso della lezione ?L?Arma \ndei Carabinieri e la tutela del patrimonio culturale? che il generale di \nbrigata, comandante della Regione Carabinieri Toscana, Ugo Zottin ha \ntenuto agli studenti dell?Istituto d?Arte di Porta Romana, dell?Istituto \nper l'Arte e il Restauro Palazzo Spinelli e del liceo artistico di \nFirenze. ?Avere consapevolezza delle norme che proteggono il nostro \npatrimonio artistico, avvicinare i giovani al concetto di legalit? e \nspiegare loro in cosa consiste e come si svolge il lavoro dell?Arma dei \nCarabinieri, in particolare quello del Nucleo Tutela Patrimonio \nCulturale?, ha spiegato Ugo Zottin ai numerosi studenti studenti \nintervenuti alla lezione. Il presidente del Consiglio regionale ha \nricordato l?importanza del lavoro dei militari in un Paese, ricco di \nopere d?arte. Il presidente ha parlato anche della facilit? con la quale \nspesso i nostri tesori vengono trafugati o ?asportati? non solo dai \nmusei ma anche da piccole chiese di campagna e abitazioni private. (bb)\n\nhttp://www.parlamento.toscana.it\n\n\n\n\n------------------------------\n\nMessage: 11\nDate: Fri, 11 May 2007 10:00:36 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Canada. Police probing link between blaze, theft;\n\tReplica Indian village broken into the night before costly fire\nTo: Museum Security Network Mailinglist \nMessage-ID: <464422A4.1010508@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nPolice probing link between blaze, theft; Replica Indian village broken \ninto the night before costly fire\n\nJulie Rudd  /  OSPREY news network\nLocal News - Thursday, May 10, 2007 @ 07:00\n\nThieves broke into the Huron Ouendat Indian Village the night before the \ntourist attraction was engulfed in flames, leaving police to investigate \na possible link.\n\n\"I think there's certainly a possibility that there's a connection \nbetween the two incidents,\" said Det. Sgt. Jim Rettinger of the Midland \nPolice Service. \"We can't rule that out, but we can't give that \nparticular investigation a link yet.\"\n\nFirefighters from Midland, Penetanguishene and Tiny Township were called \nto the scene after fire was reported Tuesday at about 8 p.\nm. Police say it took several hours before the blaze was finally out.\n\nAccording to Jamie Hunter, curator of the Huronia Museum, the fire \nappears to have started at the front of the replica village and worked \nits way back. Destroyed was one of the two longhouses, maintenance \ntools, exhibit materials and a classroom used for children's programming.\n\nHunter says the fire caused at least $250,000 damage.\n\n\"It's hard to say, but the loss of six buildings and its contents plus \nthe palisades was a pretty severe setback,\" he said\n\nThis is not the first fire at the village. About two years ago, Hunter \nsays youths set fire to the far side of the village during the day. But \nit was caught by staff before significant damage could be done.\n\nThe issue of more concern for the museum staff is its vulnerability to \nbreak-ins.\n\nHunter says the village has been broken into many times. The most recent \nof which took place Monday night.\n\n\"We did receive a report of a break-in into the foyer area of the indian \nvillage,\" Rettinger said. \"Some artifacts were damaged, and a couple \nitems were stolen.\"\n\nThe break-in was discovered by the museum staff Tuesday morning.\n\nThe Ontario Fire Marshal's office is investigating Tuesday's blaze.\n\nhttp://www.thebarrieexaminer.com/\n\n\n\n\n------------------------------\n\nMessage: 12\nDate: Fri, 11 May 2007 10:00:42 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. Mariners' Museum sues to get items returned\nTo: Museum Security Network Mailinglist \nMessage-ID: <464422AA.6050600@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n  Mariners' Museum sues to get items returned.\n\nBY SHAWN DAY\nsday@dailypress.com  | 247-4816\nMay 9, 2007, 10:08 PM EDT\n\nNEWPORT NEWS -- The former chief archivist for the Mariners' Museum \nlibrary is facing a civil suit filed by the museum claiming he stole -- \nand then sold -- archived items.\n\nLester Weber was fired Sept. 25 for \"policy violations which include, in \npart, the theft of archival items from the Museum's collections for \nsubsequent sale on the internet and eBay,\" according to a statement from \nAlan Diamonstein, chairman of the Mariners' Museum Board of Trustees.\n\nNewport News Police Officer Harold Eley, a department spokesman, \nconfirmed police are looking into allegations against Weber but declined \nto elaborate, citing the ongoing investigation.\n\nWeber and his wife, Lori Childs, are named as defendants in a civil suit \nfiled April 16 in Newport News Circuit Court. Diamonstein, reached late \nWednesday, said the museum is seeking the return of stolen merchandise \nand money for merchandise that was sold.\n\n\"They were archival items that people had given?,\" Diamonstein said. \n\"They weren't on display yet.\"\n\nLester Weber couldn't be reached for comment. His wife, who answered a \nphone call late Wednesday, said she couldn't talk about the case and \nhung up.\n\nhttp://www.dailypress.com/\n\n\n\n\n------------------------------\n\nMessage: 13\nDate: Fri, 11 May 2007 10:00:47 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. Warhol found in Aspen after 17 years\nTo: Museum Security Network Mailinglist \nMessage-ID: <464422AF.8030709@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nWarhol found in Aspen after 17 years\n\nAuthorities recover artist?s Ali painting from owner?s ex-wife\n\n\t\n\nJoel Stonington\nVail, CO Colorado\nMay 10, 2007\n\nASPEN ?The journey of an Andy Warhol painting presumed stolen between \n1989 and 1990 ended last week when Aspen police and FBI art-theft \ninvestigators tracked it down.\n\nThe painting, a 3-by-4-foot depiction of heavyweight boxing icon \nMuhammad Ali, is valued at $100,000 to $120,000, according to records \npolice released Wednesday.\n\nThe records, from Aspen detective Eric Ross, state that Alan Finkelstein \nof New York reported the painting stolen to New York police in 1990.\n\nThe grand larceny case went dry until local art dealer Christy Lee Pope \nlisted the Warhol on www.artnet.com  on April 7, \npolice records show.\n\nRoss quickly enlisted the help of the FBI and its art theft unit. On \nApril 16, Ross met with an FBI agent and looked through Pope?s house \nwith permission of a property manager.\n\nThey did not find the painting in the house but later contacted her by \nphone. She told them that Jeff Liddington, the owner of the CTS \nlimousine service in Aspen, had asked her to list the painting for some \nfriends, documents state.\n\nShortly after Pope listed the painting, however, Liddington had called \nher and asked to take the painting off, she said, according to police \ndocuments.\n\nOn April 26, the FBI agent and Ross interviewed Liddington about the \nWarhol. Though Liddington originally told them he didn?t think the \npainting was stolen, he eventually admitted it might be the case and \ntold them to go talk to the owner, Alan Finkelstein, records said.\n\nAccording to the documents, Liddington said he was told the painting \nactually belonged to Finkelstein?s ex-wife, Janice (last name not in \ndocuments). He said he had not ever met Janice and that a friend had \nasked him to sell the painting for a commission of $6,000 on the sale.\n\nHowever, he said he got suspicious that the painting might have been \nstolen when his friend, acting for the ex-wife, asked him to take the \npainting off the Internet.\n\nThe 17-year saga ended with a single phone call, documents state. \nFinkelstein got a call from his ex-wife on May 1 in which she said the \npainting was part of a divorce settlement, he disagreed and she said she \nwould return the Warhol to him.\n\nOn May 2, Finkelstein?s son picked the painting up from Janice in order \nto bring it back to his father. At that point, Finkelstein dropped \ncriminal charges and said he did not want to pursue any further \ninvestigation.\n\nThe case was closed the same day.\n\nhttp://www.vaildaily.com\n\n\n\n\n------------------------------\n\nMessage: 14\nDate: Fri, 11 May 2007 10:00:54 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Artifacts pit American Indians against museums\nTo: Museum Security Network Mailinglist \nMessage-ID: <464422B6.1010106@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nArtifacts pit American Indians against museums\nBut a new rule might help tribes recover their culturally significant \nobjects.\n\nKevin Livelli | Columbia News Service\nPosted May 10, 2007\n\nIt was a hot and arid day in Pecos, N.M., when the elders and leaders of \nthe Jemez Pueblo tribe welcomed an outsider into the fold: archaeologist \nWilliam Whatley.\n\nWearing colorful headbands, the old men sat down on the ground with \nWhatley. Then they began drawing images in the dust -- images of bones, \nmasks and pottery that were missing or had been looted from the tribe. \nThe elders implored Whatley to use his scientific knowledge to find the \nobjects and help return them to the tribe. Not an easy task.\n\nThat was about 20 years ago. Now, for other tribes searching for lost or \nstolen items, the process may grow a lot easier.\n\nIn mid-March, the Department of the Interior's National NAGPRA program, \nwhich helps carry out the Native American Graves Protection and \nRepatriation Act, announced a regulation requiring museums, universities \nand federal agencies in possession of American Indian art and artifacts \nto provide new lists of their inventories and to share them with all \nfederally recognized tribes within six months.\n\nThe rule, which took effect last month, marks the first time in a dozen \nyears that museums and federal agencies have had to share with tribes \nwhat's in their collections. This process may uncover many items missing \nfor years, and it may encourage tribes to start making repatriation \nclaims to recover their artifacts.\n\nRepatriation is frequently fraught with tension between museums and \ntribes. Curators and scholars have an interest in preserving items for \ntheir educational and research value. For the tribes, reclaiming their \nobjects can have a spiritual and cultural significance. But for some, it \ncan lead to big business. A reclaimed object can establish a tribe's \nright to land, which it might want to develop.\n\n\"This promises to have a big impact for many tribes, especially those \nrecently recognized by the federal government,\" says Dr. Rayna Green, a \nCherokee and the curator and director of the American Indian program at \nthe Smithsonian Institution. \"And it's not just about cultural heritage. \nIt's about money and land and property. This is America, after all.\"\n\nYet even if the new rule helps tribes find many sacred objects, it won't \nnecessarily help them overcome the many obstacles inherent in the \nrepatriation process.\n\n\"Tribes and museums approach decisions about sacred objects carefully,\" \nsays Dr. Timothy McKeown, the senior program coordinator at the NAGPRA \noffice and the man responsible for overseeing the entire repatriation \nprocess. \"Repatriation is not just something you can do overnight.\"\n\nTo begin with, tribes can struggle with issues of confidentiality when \nfiling a claim. Many tribes, especially the Pueblo groups in the \nSouthwest, have strict customs and rules about sharing tribal \ninformation with outsiders. Yet the law requires a tribe to reasonably \nestablish its historical connection to a particular object.\n\nThe Pueblo Indians of San Eldefanso made a claim in the mid-1990s but \nbacked away when a dispute over the claim led to litigation in federal \ncourt. They didn't want to have to testify and reveal tribal secrets.\n\nEven putting together the claim can be a challenge. In many instances, a \ntribe's spoken language -- like that of the Jemez Pueblo -- isn't \nwritten down and can't be easily transferred into the legalese necessary \nto file a claim. And hiring lawyers costs money, something many smaller \ntribes lack.\n\nWhen claims are readied for filing, McKeown says tribes sometimes argue \namong themselves and with neighboring tribes over who has the right to \nproceed with that claim, who should act as spokesman and who will be \nresponsible for the objects once they return.\n\nOne such case now under review by McKeown's office involves funerary \nobjects and human remains that were recently found in Chaco Canyon \nNational Park in New Mexico. Representatives from Pueblo, Navajo and \nHopi tribes have all made competing claims for the same objects.\n\nThe tribes' competing claims can stir feuds that go back hundreds of \nyears. \"It has to do with very old notions of clan and kinship and \nphilosophical and religious ideas about death and the afterlife,\" Green \nsays.\n\n\"The issue is important because what you and I call artifacts are in \ntheir worlds living tribal members with the same rights as people,\" \nWhatley says.\n\nOnce objects are returned to tribes, one serious issue frequently \nremains. Many items belonging to tribes in the Iroquois Six Nations and \nthe Hopi Nation are perishable -- cornhusk masks or headdresses with \nfeathers. When these items come into a museum's collection, they are \noften sprayed with arsenic or another pesticide for preservation.\n\nBut upon return, the masks and headdresses are often worn in ceremonies, \nendangering the lives of tribal members and leaving the museum \npotentially liable for any resulting injury or illness.\n\n\"That's something we in the museum world are trying to remedy,\" Green \nsaid. \"We're looking now into alternative means of preservation, like \nflash freezing objects.\"\n\nThough the path to repatriation may take many years, Whatley says the \nend result will be worth the trouble for tribes. During nine years, he \nhas helped return thousands of objects to the Jemez Pueblo from museums \naround the country.\n\nhttp://www.orlandosentinel.com/\n\n\n\n\n------------------------------\n\nMessage: 15\nDate: Fri, 11 May 2007 10:01:05 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] CORNWALL- A series of tall, graceful statues have\n\ttraveled a long way to make their debut at the Insiders/Outsiders Art\n\tGallery in the new \"All About Africa\" exhibition, but soon they will\n\treturn home.\nTo: Museum Security Network Mailinglist \nMessage-ID: <464422C1.3070707@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n  CORNWALL-A series of tall, graceful statues have traveled a long way \nto make their debut at the Insiders/Outsiders Art Gallery in the new \n\"All About Africa\" exhibition, but soon they will return home.\n\n\nThe show, a celebration of African art and art inspired by \"the dark \ncontinent,\" as it is sometimes called, prominently features nine Vigango \nburial totems that have recently been involved in a scandal.\nThe obelisk-shaped items are from the estate of art collectors and \nproducer/screenwriters Lewis M. Allen and his wife, Jay Presson Allen. \nThe two purchased the totems for just a few dollars each on the street \nin Kenya in the 1960s while living in Africa. It seems they did not know \nthey were purchasing sacred burial totems that had been stolen from \ntheir rightful villages by those out to make a few dollars off the \ntourists.\nThe totems were displayed in the couple's Park Avenue apartment for \ndecades. It was only when the daughter of the late couple, Brooke Allen, \noffered to show them in gallery owner Kelly Gingras' latest show that \nMrs. Gingras began her research and realized the totems were ill-gotten.\n\"Last year I went to New York City and saw the totems and said I'd love \nto show them,\" she recalled. She brought them home in her car, went \ninside her Cornwall home and Googled \"Vigango.\" The search returned more \nthan 30 pages of sites asking for the return of the totems to the \nMijikenda people of the Kenyan coast. It seems that hundreds of them \nhave been stolen over the years.\nThe gallery owner recalled the moment she found out the states were \nill-gotten property. \"My heart just sunk. I went in and looked at them \nand thought, 'Some way or another you guys are going home.\" When she \ncalled Ms. Allen, the young woman was shocked at the totems' true origin \nand readily agreed to return the artifacts but implored the gallery \nowner to show them anyway and teach local children about them while the \ntwo women worked to return them to Kenya. Mrs. Gingras raced back over \nto where the statues were and shouted, \"'You're going home.' They looked \nmuch happier from that moment,\" she said.\nThe two women and the estate manager, Peter Jung, set out to find \nsomeone who could facilitate the statues' safe return. They eventually \nreached Tanzanian Ambassador Charles Stith and Kenyan Ambassador Peter \nNicholas Rateng'Oginga Ogego. These men, thrilled to be getting the \ntotems back, agreed to let Mrs. Gingras display the artifacts through \nthe end of June, when they will visit the area for a formal hand-over \nceremony on a yet to be announced date.\nThe totems, which can fetch between $7,000 and $10,000 on the open \nmarket, have been robbed from graveyards for years. The chipped-wood \ncarvings are long skinny figures, most with ornate faces and delicately \npatterned and carved robes. They are between four and six feet high and \nabout six inches wide, and some tilt to the right or left from years of \nbeing exposed to the elements. The Vigango are erected for high-ranking \nmembers of a secret society, called the gohu. The height can be \ndependent on the status of the society member. Otherworldly, they look \nlike they are in mourning.\nIt is considered bad luck to remove the statues from their homes in the \nMijikenda graveyards, and the people of that region believe bad luck can \nbefall both the offender and the family members.\nIt doesn't seem that the Allen family met this fate, however. In his \nstoried career, Mr. Allen had writing or producing credits on the movies \n\"Lord of the Flies\" and \"Fahrenheit 451\" and on the Broadway productions \nof \"Annie,\" \"My One and Only\" and \"A Few Good Men.\" Mrs. Allen logged \ncredits in the movie versions of Alfred Hitchcock's \"Marnie,\" \"The Prime \nof Miss Jean Brodie,\" \"Cabaret,\" \"Funny Lady\" and the remake of \"The \nThomas Crown Affair.\"\nAlso in the show are more pieces from the Allen collection and from the \ncollection of John Clayton, a documentarian for National Geographic and \nan admirer of 1960s art from the Congo. He will donate the proceeds from \nany sales to the Africare charity.\nCornwall photographic artist and entrepreneur (he co-owns Kent's \nNorthern Exposure photography gallery) Lazlo Gyorsok was on hand to view \nthe African art. He particularly enjoyed Mrs. Gingras' curatorial \ndecision to hang a painting of a woman in a compromising position with \nthe Marquis de Sade next to one depicting \"The Last Supper\" through the \neyes of a 1960s African artist.\nThere are also works from five American artists that reference Africa: \noils by Bernard Hoyes, found sculpture by Lucy Krupenye, watercolors by \nJoan Palmer, creatures and totems by Stewart Clayton and Michael \nTheise's bull elephant and modern trompe l'oeil paintings.\nAt the exhibit's opening last weekend, Mr. Theise's heavy pieces on \nmasonite were being admired by Vance Jaffers, an actor of \"One Life To \nLive\" fame. The Brookfield-dwelling thespian is a longtime friend of the \npainting's owner, famed acting coach Phillip Tavonatti, and Mr. Jaffers \nwas there on his behalf. If his painting sells, Mr. Tavonatti will \ndonate the proceeds to African charity \"School of Dreams.\"\nMs. Krupenye was on hand to discuss her found object, wall-hanging \nsculptures. The surprising discrepancy between her petite, blond, \ngirlish appearance and the totemic sculptures she creates from found \nobjects, including car parts such as catalytic converters and flattened \ntailpipes, and even deer bones she finds in the woods, is charming.\nThe Wilton-based sculptor's pieces have an African sensibility that is \nnot entirely unlike the Vigango totems. \"I grew up in a house surrounded \nby African art, my parents were collectors,\" she said of her frame of \nreference.\nHer pieces, which all have a sort of warm, protective and motherly feel \nand shape, bear names such as \"AuTotem,\" for one made of car parts, \n\"Guardian\" and \"Le Reine Rouge,\" or \"the red queen,\" for one made of \nrusted parts that have taken on a rusty red patina.\nMs. Krupenye was especially moved by the story of the Vigango. \"When I \nfirst saw them, I was immediately drawn to them. They looked like \nsomething that could have been in the house I grew up in. When I heard \nthe story my first thoughts were that the same thing could have happened \nto my parents without their realizing it. They bought art in the same \nway. It's extraordinary that they are going to be retuned,\" she said.\nThe more far-reaching message of the Vigango's journey will be delivered \nto younger people who visit the gallery with their school classes, Mrs. \nGingras hopes. \"If we hit young minds they'll absorb this story and in \nthe future when they travel to Africa, or any area where artifacts are \nblack marketed, they won't buy them, they'll think twice and do their \nhomework,\" she said.\nThe gallery is at 131 Kent Rd. at the intersection of Routes 7 and 45. \nThe show is up through June 24. Call 860-672-6631 for more information.\n\nhttp://www.zwire.com\n\n\n\n\n------------------------------\n\nMessage: 16\nDate: Fri, 11 May 2007 10:01:00 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Germany. Kunstraub in Rheinbach\nTo: Museum Security Network Mailinglist \nMessage-ID: <464422BC.2080404@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n  Kunstraub in Rheinbach\n\n*Diebe entwendeten zwei gro?formatige Gem?lde aus der Glasfachschule.*\n\n\nBislang unbekannte T?ter haben w?hrend einer Ausstellung im Rheinbacher \nGlaspavillon an der Glasfachschule zwei gro?formatige Gem?lde der K?lner \nK?nstlerin Dagmar Dost-Nolden entwendet. Wie die Polizei Bonn heute \nmitteilt, hat sich der Diebstahl zwischen dem vergangenen Sonntag, \n6.Mai, 20:00 Uhr, und dem gestrigen Mittwoch, 9. Mai, 08:00 Uhr, ereignet.\n\nDie beiden Gem?lde mit dem Titel \"Flucht aus dem Paradies\" haben jeweils \nein Format von 250 cm mal 145 cm. W?hrend der Ausstellung befanden sie \nsich in einer gl?sernen Vitrine. Nach dem bisherigen Ermittlungsstand \nstahlen die T?ter zun?chst die Schl?ssel f?r den Pavillon aus einem \nB?roraum der Glasfachschule. Damit ?ffneten sie die Vitrine und \nentwendeten die beiden Kunstwerke.\n\nDie Polizei geht davon, dass vor allem der Abtransport der gro?fl?chigen \nBilder aufgefallen sein k?nnte. Hinweise nehmen die Ermittler unter der \nRufnummer 0228/156211 entgegen.\n\nhttp://www.kultur-in-bonn.de/\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 113\n****************************************\n\n"}