{"category": "ham", "to_address": "\"Karlaganis Corinne\" <corinne.karlaganis@wti.org>", "from_address": "\"Corinne Karlaganis\" <c.karlaganis@rw.unibe.ch>", "subject": "[Ip-health] World Trade Institute Course Programme: Summer Programme 2007", "body": "This is a multi-part message in MIME format.\n--\n--\n[ Picked text/plain from multipart/alternative ]\nDear Sir / Madam,\n\n\n\nThe WTI is among the leading institutions offering education and\ntraining on international trade regulation. As in previous years, we\nhave been able to organize a number of exciting programmes for the\nacademic year 2006/2007. Our courses stand out because of their in-depth\ntreatment of international trade issues, our faculty of globally\nrenowned experts and our ability to match the needs of professionals\nfrom all over the world. In addition, we are able to offer courses that\ntake into account the diverse needs of our students: those who wish and\nare able to spend a full year in Switzerland to obtain a Master degree,\nthose who have very little time and can only leave their jobs for a few\nweeks and those who have a special interest in particular fields of\ninternational trade regulation.\n\n\n\nWe therefore would like to draw your attention to the following three\nprogramme options:\n\n*\tOur five-week summer school: We have selected six topical areas\non international trade regulation for those who wish to join us for one\nor several weeks in July and August 2007. Applications are currently\naccepted.\n*\tOur Master on International Law and Economics (MILE): MILE is an\nintensive one-year programme, which will start again in October 2007.\nApplications are accepted until 31 May 2007.\n*\tThe possibility to select weekly course modules within that\nMaster Programme. While this selective way of participating in our\ncourses will not allow you to complete the Master Programme, you will\ngain in-depth insight in particular fields of international trade\nregulation. All weekly courses are self-contained units and therefore\naccessible to visitors.\n\n\n\nPlease find more detailed information attached to this email and feel\nfree to distribute this information to interested individuals. We would\nbe glad to give you more details about the World Trade Institute and its\nprogrammes. Please contact our Director of Studies, Dr. Nicole Pohl (\nnicole.pohl@wti.org) for questions.\n\n\n\nWe hope to be able to welcome you in Berne for one of our programmes.\n\n\n\n\n\nKind regards,\n\n\n\nCorinne Karlaganis\n\n\n\nfor the World Trade Institute\n\n\n\n\n\n\n\n\n\nCorinne Karlaganis\n\nMILE Fellow\n\nWorld Trade Institute\n\nHallerstrasse 6\n\n3012 Bern\n\nSwitzerland\n\nPhone: +41 31 631 3628\n\nFax: +41 31 631 3630\n\nEmail: corinne.karlaganis@wti.org\n\n\n\n\n\n--\nContent-Description: Summer Programme Nutshell.pdf\n\n[ Summer Programme Nutshell.pdf of type application/pdf deleted ]\n--\nContent-Description: MILE Programme Nutshell.pdf\n\n[ MILE Programme Nutshell.pdf of type application/pdf deleted ]\n--\nContent-Description: Weekly Courses Summer Programme.pdf\n\n[ Weekly Courses Summer Programme.pdf of type application/pdf deleted ]\n--\nContent-Description: Weekly Courses MILE Programme.pdf\n\n[ Weekly Courses MILE Programme.pdf of type application/pdf deleted ]\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}