{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Guy Schlosser <guyster@buckeye-express.com>", "subject": "Re: Unable to use espeak with orca", "body": "Zack, how did you get your Orca running with Espeak?  Did you use the \nbackend for speech-dispatcher?  If so, where did you put the .py file \nthat you have to download?  I got ubuntu installed, and Orca is \nrunning, but doesn't seem as responsive as it should be.  If you or \nanyone know how to get the experimental backend running, please let \nme know.  There might even be an update to it now, the docs on it are \nstill from last summer some time.  Thanks much in advance for the help.\n\nLater,\n\n\nGuy\nP.S.  If I have to go through gnomespeech, how can I play system \nsounds and music files at the same time?\n\nAt 06:33 PM 4/29/2007, you wrote:\n>Hello,\n>     Orca doesn't have an 'espeak' module for speech synthesis, as I recall.\n>What it does have is a Gnome Speech module.  Gnome Speech in turn hooks into\n>Speech Dispatcher, which hooks into Espeak.\n>Now, I have had no difficulties with Orca forgetting any preferences of\n>mine--it uses Espeak just fine.\n>Hope this is helpful,\n>Zack.\n>\n>----- Original Message -----\n>From: \"Garrett Klein\" \n>To: \n>Sent: Sunday, April 29, 2007 3:22 PM\n>Subject: Unable to use espeak with orca\n>\n>\n> > Hello all,\n> >\n> > I got orca working yesterday. And I had it using espeak.\n> > However, sometimes Orca seems to \"forget\" that it's supposed to\n> > use espeak, but keeps my speech rate/key echo settings in tact.\n> > I upgraded to svn orca this morning, and it was working fine,\n> > until it forgot my preferences again. I should note, at this\n> > point, that espeak isn't available in the GUI preferences,\n> > regardless of version. And in the newest orca, I get a python\n> > traceback at the end of running orca --text-setup.\n> >\n> > Anyone else have this problem?\n> >\n> > Garrett\n> >\n> > _______________________________________________\n> > Speakup mailing list\n> > Speakup@braille.uwo.ca\n> > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> >\n>\n>\n>_______________________________________________\n>Speakup mailing list\n>Speakup@braille.uwo.ca\n>http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}