{"category": "spam", "to_address": "undisclosed-recipients:;", "from_address": "pweball101@aol.co.uk", "subject": "NOTICE...CONGRATULATIONS!!!! ", "body": "\nNOTICE...CONGRATULATIONS!!!! \nLucky Winner, \nFROM THE OFFICE OF THE VICE PRESIDENT \nPOWERBALL EURO E-MAIL INTERNATIONAL \nPROMOTIONS/PRIZE AWARD DEPT \nBATCH NO: PBL/67189098011/245679/1109 \nREF. NO: PBL/11278998789/908796//1109 \nDear Winner, \nThis is to inform you of the release of the E-MAIL LOTTERY BALLOT \nINTERNATIONAL/WORLD GAMING BOARD. Your name attached to ticket number \n219028657434 with Serial number \n918735625 drew the lucky numbers of 21-70-81-82-99, which consequently \nwon the lottery in the 1st category. \nYou have just won yourself the sum of 'ONE MILLION EUROS the satellite \nsoftware email lottery conducted by POWERBALL EURO E-MAIL INTERNATIONAL \nIn which e-mail addresses are picked randomly by software powered by \nthe Internet. Your email address was amongst those chosen in this \nquarter and you are to contact our CLAIMS OFFICER with the informations \nbelow for Clearance. \nCONTACT NAME: PETER RAYMUND \nCITY/ COUNTRY: LONDON, ENGLAND. \nEMAIL: powerballagent5@yahoo.gr \n TELEPHONE: +447045713104\n                  \n(1) Being one of the lucky winners, you constitute entrant's full and \nunconditional agreement to and acceptance of our terms and conditions \nof claims to avoid any discrepancy in the cause of payment of your \nprize \nawards winning.\n(2) To avoid double claims, you are advised to keep your winning\ndetails very confidential, as any discrepancies resulting from a breach \nof this confidentiality on the part of the winners will be covered \nsolely by such winner as our staffs are bound by the oath of secrecy \ntaken on employment.\nSincerely, \nMargaret Ferguson\n ©2007\n \n \n\n\nCheck Out the new free AIM(R) Mail -- 2 GB of storage and industry-leading spam and email virus protection.\n\n\n"}