{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "\"Robert Duval\" <rduval@gmail.com>", "subject": "Re: [R] Reasons to Use R", "body": "So I guess my question is...\n\nIs there any hope of R being modified on its core in order to handle\nmore graciously large datasets? (You've mentioned SAS and SPSS, I'd\nadd Stata to the list).\n\nOr should we (the users of large datasets) expect to keep on working\nwith the present tools for the time to come?\n\nrobert\n\nOn 4/11/07, Marc Schwartz  wrote:\n> On Wed, 2007-04-11 at 11:26 -0500, Marc Schwartz wrote:\n> > On Wed, 2007-04-11 at 17:56 +0200, Bi-Info\n> > (http://members.home.nl/bi-info) wrote:\n> > > I certainly have that idea too. SPSS functions in a way the same,\n> > > although it specialises in PC applications. Memory addition to a PC is\n> > > not a very expensive thing these days. On my first AT some extra memory\n> > > cost 300 dollars or more. These days you get extra memory with a package\n> > > of marshmellows or chocolate bars if you need it.\n> > > All computations on a computer are discrete steps in a way, but I've\n> > > heard that SAS computations are split up in strictly divided steps. That\n> > > also makes procedures \"attachable\" I've been told, and interchangable.\n> > > Different procedures can use the same code which alternatively is\n> > > cheaper in memory usages or disk usage (the old days...). That makes SAS\n> > > by the way a complicated machine to build because procedures who are\n> > > split up into numerous fragments which make complicated bookkeeping. If\n> > > you do it that way, I've been told, you can do a lot of computations\n> > > with very little memory. One guy actually computed quite complicated\n> > > models with \"only 32MB or less\", which wasn't very much for \"his type of\n> > > calculations\". Which means that SAS is efficient in memory handling I\n> > > think. It's not very efficient in dollar handling... I estimate.\n> > >\n> > > Wilfred\n> >\n> > \n> >\n> > Oh....SAS is quite efficient in dollar handling, at least when it comes\n> > to the annual commercial licenses...along the same lines as the\n> > purported efficiency of the U.S. income tax system:\n> >\n> >   \"How much money do you have?  Send it in...\"\n> >\n> > There is a reason why SAS is the largest privately held software company\n> > in the world and it is not due to the academic licensing structure,\n> > which constitutes only about 12% of their revenue, based upon their\n> > public figures.\n>\n> Hmmm......here is a classic example of the problems of reading pie\n> charts.\n>\n> The figure I quoted above, which is from reading the 2005 SAS Annual\n> Report on their web site (such as it is for a private company) comes\n> from a 3D exploded pie chart (ick...).\n>\n> The pie chart uses 3 shades of grey and 5 shades of blue to\n> differentiate 8 market segments and their percentages of total worldwide\n> revenue.\n>\n> I mis-read the 'shade of grey' allocated to Education as being 12%\n> (actually 11.7%).\n>\n> A re-read of the chart, zooming in close on the pie in a PDF reader,\n> appears to actually show that Education is but 1.8% of their annual\n> worldwide revenue.\n>\n> Government based installations, which are presumably the other notable\n> market segment in which substantially discounted licenses are provided,\n> is 14.6%.\n>\n> The report is available here for anyone else curious:\n>\n>   http://www.sas.com/corporate/report05/annualreport05.pdf\n>\n> Somebody needs to send SAS a copy of Tufte or Cleveland.\n>\n> I have to go and rest my eyes now...  ;-)\n>\n> Regards,\n>\n> Marc\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}