{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Jordi Gutierrez Hermoso\" <jordigh@gmail.com>", "subject": "Re: Request for suggestions of DFSG-free documentation licences", "body": "On 03/06/07, Don Armstrong  wrote:\n> On Sun, 03 Jun 2007, Jordi Gutierrez Hermoso wrote:\n> > Debian decided to make it a problem for itself and for its users.\n>\n> the maintainer (and the developers) recognized that\n> users may need or want such documentation, even though it does not\n> meet the DFSG, so the documentation was made available in non-free.\n\nThat's a rather unsatisfactory fix. Although it does work for most\npractical purposes, the inability to ship Debian CDs with the\nnecessary docs is quite a hindrance. There's also the PR image of\nDebian to consider, I think.\n\n> If you disagree with the determination of the Developers, you can\n> easily install the work from non-free, or cease supporting Debian in\n> its entirety. The choice is yours, really.\n\nThat's unfair. I have been exclusively a Debian user since 2001.\nInstalling GFDLed stuff from non-free is what I do, but it's\ninconvenient to track down those packages that aren't installed by\ndefault anymore. The moralistic tone of the installation is also\nproblematic for me, since I'm very proud to say that all of my work is\ndone exclusively with free software (practically the BIOS is the only\nnon-free software I have to use anymore). This an important\ndistinction for the mathematical and scientific work that I do\n(proprietary software is unscientific, etc).\n\n\"Our way or the highway\" isn't a nice thought either. Do you really\nthink that the DDs that voted against putting the GFDL in non-free\nshould fork off too? Debian is the best distro out there, and I'm very\nloyal to it, but I'malso  very unhappy with its treatement of the\nGFDL, and I think this horrible mess should be fixed.\n\n- Jordi G. H.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}