{"category": "ham", "to_address": "Chabot Denis <chabotd@globetrotter.net>", "from_address": "=?UTF-8?B?U3TDqXBoYW5lIERyYXk=?= <dray@biomserv.univ-lyon1.fr>", "subject": "Re: [R] MAFA and DFA for short time series", "body": "Not sure about mafa and brodgar but ade4 has multispati. This performs a multivariate analysis which maximizes the product of autocorrelation by variance. I have a manuscript submitted to JVS (in revision) where the method is presented that I could send;\n\n\nChabot Denis wrote:> Hi,>> recently I heard a talk where MAFA (min/max autocorrelation factor  > analysis) and DFA (dynamic factor analyses) were used to analyse  > short time series typical of fisheries data.>> I searched on internet to learn more about these techniques and  > (hopefully) to learn how to perform them in R.>> The articles I found actually all used a commercial software called  > Brodgar (www.brodgar.com). Interestingly, the later can link to R for  > graphical output and some analyses (like GAM) (i.e. Brodgar produces  > R scripts from choices users make in their GUI and sends them to R).>> I would prefer to do the time series analysis in R. As there is no  > Mac version of Brodgar, I have even more incentive to do MAFA and DFA  > in R.>> Does anyone know of a package to do such analyses? Maybe other names  > are used for these techniques, which would explain why I always end  > up at Brodgar when searching for MAFA?>> Or maybe someone has written his/her own functions for such analyses  > and would agree to share them?>> Sincerely,>> Denis Chabot>> ______________________________________________> R-help@stat.math.ethz.ch mailing list> https://stat.ethz.ch/mailman/listinfo/r-help> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html> and provide commented, minimal, self-contained, reproducible code.>>>   \n\n-- Stéphane DRAY (dray@biomserv.univ-lyon1.fr )Laboratoire BBE-CNRS-UMR-5558, Univ. C. Bernard - Lyon I43, Bd du 11 Novembre 1918, 69622 Villeurbanne Cedex, FranceTel: 33 4 72 43 27 57       Fax: 33 4 72 43 13 88http://biomserv.univ-lyon1.fr/~dray/\n______________________________________________R-help@stat.math.ethz.ch mailing listhttps://stat.ethz.ch/mailman/listinfo/r-helpPLEASE do read the posting guide http://www.R-project.org/posting-guide.htmland provide commented, minimal, self-contained, reproducible code.\n\n"}