{"category": "spam", "to_address": null, "from_address": "\"Chongqing metals Co Ltd.\" <chonggingmetalscompany@adelphia.net>", "subject": "PAYMENT RECEIVING OFFICER REQUIRED", "body": "\nChongqing metals Co.Ltd.\n30 Gangtie Rd.,Dadukuo District\nChongqing 400081,China.\n\nDear Sir/Madam,\n             PAYMENT RECEIVING OFFICER REQUIRED\nChongqing metals Co Ltd.is based in China.We produce and\nexports steel and other products for world trade.Our company\nremains one of the most successful in the distribution of \nsteel,recently our profit has increased so much,that we \ndecided to expand globally.\n\nIn view of this,We are searching for representatives who\ncan help usestablish a medium of getting to our customers\nin Europe and America as well as making payments through\nyou as our payment officer.\n\nThe reason we seek your urgent asisstance is that most of\nour customers make payment in cheques and  American and\nEurope check takes a longer time to clear here in China\nthereby holding business down for us and our business associates.\nIt is upon this note that we seek your assistance to stand in as\nour representative in your country.Note that Details of \nyour account is not needed in this transaction,Also,as our \nrepresentative,your remuneration (Benefit) is on a percentage\nbasis of 15% of the total amount you receive from our customers\nat any time on our behalf.\n\nPlease note that your areas of specialization or occupation\nis of no relevant to resolve in assisting us and there is no\nfinancial obligation at your end.All we need from you is total\nhonesty and your committiment to work with us.There are no assles\nas this is a work at home opportunity.Should you have a present job,\nyou can still be part of our business as your service to us would\nnot interfer with your working hours at all.\n\nIf you are interested in this transaction please forward to us the\nfollowing information:\n\n1) Your Full names:\n2) Contact address:\n3) Home/office phone number:\n4) Occupation\n5) Age:\n6) Sex:\n\nPlease note that your areas of specialization or occupation is of no\nrelevant to resolve in assisting us.You have to be an honest and \ntrusted person,as more payments will be made through you in the\ncourse of this transaction.\n\nNote:You are to forward the above information to my private email \naddress:yokomotoliue@walla.com\n\nYours Sincerely,\nMr.Yokomoto Liue.\nChairman  & CEO,\nChongqing metals Co Ltd.\n\n"}