{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Ben Finney <bignose+hates-spam@benfinney.id.au>", "subject": "Re: Opinions on \"Paul Hsieh derivative license\"", "body": "Paul Cager  writes:\n\n> > Copyright (C) 2005, 2006 The MyServer Team\n> > This program is free software; you can redistribute it and/or modify\n> > it under the terms of the GNU General Public License as published by\n> > the Free Software Foundation; either version 2 of the License, or\n> > (at your option) any later version.\n\nSo, with this, the terms require that the redistributor must license\nunder the terms of the GPL, with no further restrictions.\n\n> > The superFastHash hash function [is] released under the Paul Hsieh\n> > derivative license [...]\n\nIf this license requires restrictions additional to those in the GPL,\nthen it is GPL-incompatible and cannot be redistributed under either\nlicense.\n\n> > Paul Hsieh derivative license\n> >\n> > [...] Use and redistribution is limited to the following\n> > conditions:\n> >\n> >     * One may not create a derivative work which, in any way,\n> >     violates the Paul Hsieh exposition license described above on\n> >     the original content.\n> >\n> > [...]\n> > Paul Hsieh exposition license\n> > [...]\n> >\n> >     * The redistributor must fully attribute the content's\n> >     authorship and make a good faith effort to cite the original\n> >     location of the original content.\n\nThis restriction is additional to the GPL. The result is\nGPL-incompatible and cannot be redistributed under either license.\n\n> >     * The content may not be modified via excerpt or otherwise\n> >     with the exception of additional citations such as described\n> >     above without prior consent of Paul Hsieh.\n\nThis restriction is additional to the GPL. The result is\nGPL-incompatible and cannot be redistributed under either license.\n\n> >     * The content may not be subject to a change in license\n> >     without prior consent of Paul Hsieh.\n\nThis quite clearly is not compatible with the GPL: both licenses\nrequire that the work be distributed only under their terms, thus both\ncannot be simultaneously satisfied.\n\n> Is this DFSG-free?\n\nWorse, I don't think the work can be legally redistributed at all.\n\nAny of the problems noted above in the text of the Paul Hsieh\nExposition License make the combined work unredistributable, since one\ncannot satisfy both of GPL and the Paul Hsieh Exposition License\nsimultaneously.\n\n-- \n \\         \"What you have become is the price you paid to get what you |\n  `\\                              used to want.\"  -- Mignon McLaughlin |\n_o__)                                                                  |\nBen Finney\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}