{"category": "spam", "to_address": "smiles@flax9.uwaterloo.ca", "from_address": "Mission Houses Museum <infos@missionhouses.org>", "subject": "Work from Home - Job Offer !!", "body": "Mission Houses Museum Work Opportunity........\n\n........Are you currently looking for an opportunity to work from home or direct from your computer. There is an sensational opportunity for you to work with Mission Houses Museum.\n\nThis is a fantastic opportunity to build an extremely rewarding career and these opportunities would suit people who need flexible working arrangements and  Located anywhere in New Zealand, Canada and USA. We have got several opportunities available for customer service/ consultants/Accounting/management sectors with a negotiable good salary starting from $5,000.00 - $65,000.00 and discount of 10% on every donations processed.\n\nThe successful candidate will need to have customer service experience and a computer with internet connnetion. Also you need to like working in a team environment and have good communication skills.\n\n**No prior experience required \n**Work from home --- No daily commute!\n**Spend more time with your family!\n*we are assuring you that at no time will you be required to make any upfront payments of your personal funds to us for whatever reason.\n**Computer at home with access to broadband and checking your email messages at least twice everyday!\n*Donations will be made direct to you if you are accepted to be our agent,. All donation payment will be required to forward to our branch office in UK after candiate/agent receive it in his/her account.\n\n\nYou can fill the application form below, so that you can start working with Mission Houses Museum as our doantion agent in your area: \n\n> - FULL NAME:\n> - ADDRESS:\n> - CITY:\n> - STATE:\n> - COUNTRY:\n> - TEL NUMBERS:\n> - FAX NUMBERS:\n> - Mobile NUMBERS:\n> - COMPANY NAME(if any):\n> - AGE:\n> - STATUS(MARRIED/SINGLE):\n> - Direct Mobile Number: \n> - Send your resume letter attached with all this information for Mission Houses Museum phone verification and interview if required.\n\nPLEASE SUMMIT THE DETAILS & RESUME LETTER DIRECTLY TO THIS E-MAIL ADDRESS:   missionhouse@rexian.com \n\nMission Houses Museum Advertment.\nTel: +44-7024067187\nE-mail: missionhouse@alice.it\nwebsite: http://www.missionhouses.org/\n\n\n\n"}