{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Terry Hancock <hancock@anansispaceworks.com>", "subject": "Re: The GPL and soundfonts", "body": "cascardo@minaslivre.org wrote:\n> On Mon, Jun 04, 2007 at 09:51:11AM -0700, Walter Landry wrote:\n>>Terry Hancock  wrote:\n>>>So, the soundfont license needs to be very permissive, but I don't think\n>>>there should be any concern about the tool used to create it.\n>>\n>>The license of the sequencing software does matter.  If the sequencing\n>>software is non-free, then the WAV files build-depend on a non-free\n>>component.  It is the same as if you used a non-free compiler to\n>>create an executable.  If the soundfonts are GPL compatible, that\n>>would put the WAV's in contrib.\n\nOkay, I can see that that's a practical issue for Debian, since you want\neverything to be buildable from the source dist on a free tool chain.\n\nWhile it would make sense, I notice that there does not seem to be a\nDFSG guideline stating this requirement. Is there a \"free tool chain\"\nrequirement for Debian?\n\nEven if there is, though, that's NOT the same as a GPL conflict (which\ndoesn't occur here unless there's a problem with the license on the\nsoundfonts).\n\n> Although I would agree with that, the main matter here is not whether\n> this WAV file would be appropriate for main or contrib, but whether it\n> is distributable at all, since the GPLv2 requires complete source code,\n> which includes \"the scripts used to control compilation and installation\n> of the executable\".\n\nThis is incorrect. There are many examples of GPL software compiled with\nnon-free compilers, and it is perfectly legal to do so. The \"scripts\"\nyou refer to do not include the compiler itself (what is intended by the\ntext you quote are things like makefiles).\n\nThe FSF's claim is that the tool used to create a work is not covered by\nthe copyleft on the work, nor does the copyleft of the tool affect the\nwork. Thus, you may compile free software on a non-free compiler or you\nmay create non-free software using a free compiler without invoking\ncopyleft requirements.\n\nA useful analogy is word processing -- wouldn't you be very, very\nsurprised if the GPL on a word processor forced you to use the GPL on\nevery document you create with it (this would fail DFSG as a \"use\nrestriction\", BTW, if it were true)? Likewise, wouldn't you be pretty\nsurprised if you couldn't release a .doc file created in MS Word under\nthe GPL if you wrote it yourself?\n\nAlso, if the compiler were considered part of the \"source\" for programs\ncompiled with it, you'd have to include the entire gcc package with\nevery C program intended to be compiled with it, which would also be\npretty surprising.\n\nIn any case, this is made clear by the GPL FAQ.\nSee http://www.fsf.org/licensing/licenses/gpl-faq.html:\n\nhttp://www.fsf.org/licensing/licenses/gpl-faq.html#GPLOutput\n\n> Is there some way that I can GPL the output people get from use of my\n> program? \n\n> For example, if my program is used to develop hardware\n> designs, can I require that these designs must be free?\n\n> In general\n> this is legally impossible; copyright law does not give you any say\n> in the use of the output people make from their data using your\n> program. If the user uses your program to enter or convert his own\n> data, the copyright on the output belongs to him, not you. More\n> generally, when a program translates its input into some other form,\n> the copyright status of the output inherits that of the input it was\n> generated from.\n> \n> [...]\n\nAND\n\nhttp://www.fsf.org/licensing/licenses/gpl-faq.html#CanIUseGPLToolsForNF\n\n> Can I use GPL-covered editors such as GNU Emacs to develop non-free\n> programs? Can I use GPL-covered tools such as GCC to compile them?\n\n> Yes, because the copyright on the editors and tools does not cover\n> the code you write. Using them does not place any restrictions,\n> legally, on the license you use for your code.\n>\n> [...]\n\nAND\n\n> In what cases is the output of a GPL program covered by the GPL too?\n>     Only when the program copies part of itself into the output.\n\nAND\n\n> I'm writing a Windows application with Microsoft Visual C++ (or\n> Visual Basic) and I will be releasing it under the GPL. Is\n> dynamically linking my program with the Visual C++ (or Visual Basic)\n> run-time library permitted under the GPL?\n\n> Yes, because that run-time library normally accompanies the\n> compiler or interpreter you are using.\n\nAll of these pretty firmly establish that the license on the output of\nthe sequencer that renders the MIDI is *not* affected by the license of\nthe sequencer, regardless of copyleft.\n\nHowever, input material incorporated into the end result (i.e.\nsoundfonts) does affect it.\n\nActually, if the soundfonts are bundled with the sequencer, the last FAQ\nmay apply. This is the \"system library\" exception -- perhaps interpreted\na little broadly. If so, then even non-free soundfonts would be\naccepted. (Personally, I wouldn't want to rely on this, though).\n\nCheers,\nTerry\n\n-- \nTerry Hancock (hancock@AnansiSpaceworks.com)\nAnansi Spaceworks http://www.AnansiSpaceworks.com\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}