{"category": "ham", "to_address": "sugar@laptop.org", "from_address": "Simon McVittie <simon.mcvittie@collabora.co.uk>", "subject": "Re: [sugar] Obtaining Buddy objects as contacts are encountered", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nOn Fri, 11 May 2007 at 17:24:49 -0400, Dan Williams wrote:\n> On Fri, 2007-05-11 at 19:25 +0100, Simon McVittie wrote:\n> > The code only seems to have 'nick', which is set to the name you enter\n> > when you first switch on a new OLPC. Is your position that there should\n> > be separate attributes, 'nick' which you can change, and 'name' which\n> > you can't? Is there any design in which this is documented? In the\n> > absence of any particular reference, I'd been assuming the code\n> > implements the design.\n> \n> Yeah, we should do this.  I assume that Vcard supports First/Last name?\n> Note that we also get into issues then with ordering/localization,\n> because some locales (Hungary, for example) use family name _first_.\n> But that's a problem for sugar, really.\n\nvCard supports both FN (Formatted Name = display name, e.g. \"Dan\nWilliams\" and N (structured Name fields, e.g. \"Williams;Dan;;Mr.;\"). The\nfields of N include family and given name, rather than first and last\nname; there appears to be no way to indicate which comes first in the\nlocale of the subject of the vCard.\n\nTelepathy's full Contact Info interface is under revision - the one\ncurrently in the spec is far from ideal, but the replacement needs\nfurther discussion - so I'd suggest we add \"full-name\" to the OLPC buddy\nproperties interface. We could always replicate one to the other\nautomatically, at some point.\n\nFor Salut, I think we should also add \"jid\" to the OLPC buddy properties\n(it ought to be in contact info, but again, we don't have a good\ninterface for that), to make it easier to link mesh and server\nidentities. In my proposed implementation (which I'm still writing!) we\nneed to use the JID to link identities, because retrieving the public\nkey takes network round-trips, and it's problematic to have people turn\nup and start interacting in a tube before we actually know who they are.\n\nI'll add full-name support as part of my current round of API changes,\nif there are no objections.\n\nAre we happy for the child's full name to be public (to anyone who knows\ntheir JID), from a privacy point of view? I realise the answer is\nprobably \"yes\", but I feel I should ask...\n\nWhat's the intended UI for this? I assume we should use the name entered on\nfirst boot to populate both the full name and the nickname, then let the child\nchange their nickname to something else later?\n\nOnce again, if there's any design documentation I should be consulting\non this, please let me know. Otherwise I'll just carry on trying to make\nreasonable decisions so we can get something implemented.\n\n\tSimon\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\nComment: OpenPGP key: http://www.pseudorandom.co.uk/2003/contact/ or pgp.net\n\niD8DBQFGSDjPWSc8zVUw7HYRAp28AKCILl7ZNrskQp+pLZErIkcPpG4N7gCghBZu\nL1B9aic+hx5v45zpY+wTCJk=\n=Wj2o\n-----END PGP SIGNATURE-----\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}