{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "robert weissman <rob@essential.org>", "subject": "[Ip-health] US Chamber: Brazil Takes Major Step Backward on Intellectual Property\n Rights", "body": "\nU.S. Chamber of Commerce Press Statement\n\n===================================================\n\nBrazil Takes Major Step Backward on Intellectual Property\nRights, Says U.S. Chamber\n\nWASHINGTON, DC--Lt. Gen. Daniel W. Christman (ret.), U.S.\nChamber senior vice president for international affairs, issued\nthe following statement on Brazil's decision to issue a\ncompulsory license for Merck & Co.'s HIV/AIDS medicine Efavirenz\nafter the health ministry ended negotiations with the firm:\n\n\"Just days after Brazil was recognized for improving its\nenforcement of intellectual property (IP) rights, its government\nhas made a major step backward.\n\n\"Breaking off discussions with Merck and seizing its\nintellectual property sends a dangerous signal to the investment\ncommunity. Merck researchers invested hundreds of millions of\ndollars to develop this ground-breaking medicine. Clearly, there\nwas room to negotiate a solution acceptable to both parties.\n\n\"Ironically, the Brazilian decision comes on the heels of real\nprogress. Last Monday, the Office of the U.S. Trade\nRepresentative recognized Brazil's successful crackdown on\ncounterfeiting and piracy, moving the country from the Priority\nWatch List to the Watch List in its annual 'Special 301' report.\nThis progress was the critical factor in making last December's\nextension of Generalized System of Preferences tariff benefits\npossible.\n\n\"The bottom line is this: Brazil is working to attract\ninvestment in innovative industries that rely on IP, and this\nmove will likely cause investments to go elsewhere.\"\n\nThe U.S Chamber is the world's largest business federation\nrepresenting more than 3 million businesses and organizations of\nevery size, sector, and region.\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}