{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Imus is out at CBS...we'll have all the late breaking details tonight on the CBS Evening News with Katie Couric. ", "body": "\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nQUOTE OF THE DAY\"There is only one thing a \n      philosopher can be relied upon to do, and that is to contradict other \n      philosophers.\" - William James \n\n\n\nDID YOU KNOW?An albatross can sleep \n      while it flies. It apparently dozes while cruising at 25 mph. \n      \n\n\n\nTONIGHT ON THE CBS EVENING NEWS\nHere is an early preview \n      of what we are planning for tonight's CBS EVENING NEWS from Anchor and \n      Managing Editor, Katie Couric... Hi everyone, \n      Tonight we'll begin our broadcast with the news that embattled \n      radio host Don Imus has been fired from CBS. The announcement came late \n      this afternoon from CBS President and Chief Executive Officer, Leslie \n      Moonves. We'll have extensive coverage of this story, beginning with \n      Nancy Cordes with all the late breaking details of the decision. \n      Then we'll turn to CBS News' Jeff Greenfield and Washington \n      Post columnist Eugene Robinson for analysis. Also tonight, \n      we'll have the story of a deadly attack directed at the Iraqi government. \n      A suicide bomb exploded inside what is supposed to be the most protected \n      area of Baghdad - the heavily fortified Green Zone. A bomber blew himself \n      up in the cafeteria of the Iraqi parliament, killing at least eight \n      people, including several lawmakers. Martin Seemungal will have the \n      story. Today in Afghanistan, U.S.-led forces bombed weapon-filled \n      caves killing an estimated 35 militants. The strikes happened as the war \n      in Afghanistan is reaching a critical point: The Taliban are expected to \n      launch a spring offensive. Chief Foreign Correspondent Lara Logan \n      reports from the frontlines on how NATO plans to strike first. \n      Another career hanging in the balance is that of Durham County \n      district attorney Mike Nifong. Yesterday's announcement that charges \n      against the Duke lacrosse players were dropped also brought increased \n      scrutiny against Nifong, whose investigation into the sexual assault \n      accusation was called a \"tragic rush to accuse.\" Kelly Wallace will \n      have an update. And finally, a legend in American writing died \n      today. Known for countercultural novels such as Cat's Cradle and \n      Slaughterhouse-Five, Kurt Vonnegut was a legendary social critic \n      who also wrote dozens of short stories, essays and plays. Richard \n      Schlesinger will take a look at the life of this writer and his \n      influence on 20th Century literature. I hope you'll join \n      us. Katie For more information on these stories, \n      please click on the following links: Iraq Parliament Blast \n      Kills 8 Click Here With Case Closed, All \n      Eyes On Duke D.A. Click Here And here's a look at \n      one of the stories we're working on for Friday's broadcast: In \n      a CBS News EXCLUSIVE, Lara Logan asks Pakistan's president whether \n      he's doing enough to contain the Taliban and Al Qaeda. That story and much \n      more, Friday, on the CBS Evening News. \n      If you would like more information on any of these stories or the \n      broadcast, please click on the following address and e-mail us: \n      evening@cbsnews.com \n\n\nTONIGHT \n      ON DAVID LETTERMANJoin Dave tonight on \n      The Late Show with actor Bruce Willis AND magician Jason \n      Randal! \n\n\n\nFRIDAY MORNING ON THE EARLY SHOW\n \n\nHarry Smith, Hannah Storm, Julie \n      Chen and Russ Mitchell anchor THE EARLY \n      SHOW from New York. Dave Price will \n      bring us the weather. Along with the top news of the day, we \n      will also have the following stories: THE SCARY TRUTH ABOUT \n      OFFICE FIRES: If a fire broke out in your office, would you know what \n      to do? Two weeks ago - flames ripped through a building in Houston. Three \n      people died and many of the survivors said they had trouble getting out. \n      EARLY SHOW Consumer Correspondent \n      Susan Koeppen will join us with some life-saving tips. \n      CHEWING THE FAT: TRANSFATS: Friday morning, we'll take a \n      look at the importance of keeping track of the harmful fats in our diets. \n      Lately, the trans fats in many foods we eat have gotten a lot of attention \n      as being especially bad for us. But as you reduce the transfats in your \n      diet, you don't want to make the mistake of replacing them with other fats \n      that may be just as bad. So how can you cut out the fat and get to the \n      bottom of good versus bad? Our Dr. Emily Senay will join us with \n      details. HALLE BERRY ON PERFECT STRANGERS: From her award winning roles in Introducing Dorothy \n      Dandridge and Monster's Ball to playing a Bond Girl and one of \n      the X-Men, Halle Berry is one of the few actresses that moves \n      seamlessly from heavy dramas to commercial blockbusters. In the new \n      thriller Perfect Stranger, Berry plays a journalist who goes \n      undercover at an advertising agency to investigate a friend's murder. She \n      will join us to talk about her latest film and her sizzling career. \n      GARDENING: VICTORY GARDEN BULBS: Spring has just sprung, \n      but for gardeners, it's already time to start thinking about summer. \n      Summer bulbs, that is. Summer bulbs, which bloom in the summer, are a \n      great, and easy, way to add a punch of color to your garden. And, they \n      should be planted in the spring. Michael Weishan, host of PBS's The \n      Victory Garden, will join us for a primer on these seasonal bulbs. \n      HOW TO BE A REALITY STAR... ON BIG BROTHER: With a \n      new season of Big Brother beginning in June, a lot of you out there \n      may be wondering, \"How do you become a houseguest?\" If so, we have good \n      news. Producers are looking for contestants right now. You can either \n      submit an audition tape or attend an open casting call. So what's the \n      secret to landing a spot on this reality show? All you need to do is \n      impress the producers with a first impression that speaks volumes. We'll \n      have more Friday morning. SURVIVOR CASTOFF: Stranded \n      in Fiji, the competition grows fierce for the remaining Survivors \n      competing against one another for the million-dollar prize. Thursday \n      night, Mookie makes a big find, discovering the second Immunity Idol with \n      the help of his tribemates. But Moto continues to dominate the challenges, \n      sending Ravu to Tribal Council yet again. Which tribemate will be voted \n      off the island this week? Friday morning, we'll have a recap of the new \n      episode and speak to the next castoff about what really went wrong. \n      WEDDING IN A WEEK: MEET THE COUPLE: All next week, we will \n      be bringing you our special Wedding in a Week series. Stylist \n      extraordinaire Colin Cowie will serve as master of ceremonies as we \n      prepare for one lucky couple to get married live on our plaza. The \n      ceremony itself will take place next Friday, but before then, we're \n      preparing for a spectacular affair! We're taking care of the details: \n      everything from the flowers, to the rings, to the attire, we'll be \n      choosing it all! Friday morning, we'll meet the pair who we will groom all \n      week in anticipation of their \"I do's\". If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: earlyshow@cbs.com \n      \n\n\n \nSATURDAY \n      ON 48 HOURSHere's a \n      note from Troy Roberts on Saturday's 48 Hours Mystery, \n      THE PUPPET MASTER: \"It was an attack so brazen that people in \n      Boca Raton, Florida still talk about it ten years after the fact. In \n      October 1997, 31-year-old Heather Grossman and her husband, John, were \n      fired on in their car at an intersection in broad daylight. It was clearly \n      an attempted execution of a wealthy and socially prominent couple. The \n      bullet that struck John only grazed him, but another bullet severed \n      Heather' spinal cord, leaving her a quadriplegic. Today, she is still \n      confined to a wheelchair. And there is no chance of rehabilitation. Of \n      course, the question on everyone's mind was who would want to kill this \n      attractive mother of three and her second husband? Who would orchestrate \n      and then carry out this drive-by shooting... and why? In quick order \n      investigators found the shooter and three other men who confessed about \n      their roles in the scheme. They were drug addicts and petty thieves. \n      Surprisingly, they didn't know Heather Grossman or her husband. And they \n      weren't looking to rob the couple. During interrogation all four men told \n      the same story. They were given orders to kill Heather Grossman. As \n      investigators kept digging, the murder for hire plot began unraveling and \n      all the evidence seemed to lead to one conclusion. It would take nearly a \n      decade for this mystery to be resolved... and for the architect behind \n      this devastating shooting to be brought to justice. You will hear from \n      everyone involved in this explosive case... the victim, the shooter and \n      the person who was convicted for pulling the strings... in the next \n      48 Hours Mystery.\" - Troy Roberts\n(48 Hours Mystery airs Saturday at 10pmET/9CT)\nIf you would like more information on any of these stories or the \n      broadcast, please click on the following address and e-mail us at: 48hours@cbsnews.com \n\n\n\n \nSUNDAY \n      ON 60 MINUTES\nINNOCENT: In their first \n      interviews since all charges against them were dropped, the three former \n      Duke lacrosse players once charged with rape tell Lesley Stahl how \n      they feel about being exonerated. MAXIMUM SECURITY EDUCATION: \n      Bob Simon visits a prison where inmates serving long sentences have \n      found a way to free their minds through college education provided by \n      elite Bard College.  \n\n\n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}