{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Laura Ingram <terrell@greatereastend.com>", "subject": "Perfect sex? It is possible!", "body": "\n\nTired with your sexual problems? Looking for an effective and cheap solution?\nVisit us\nUse licensed Viagra and Cialis pills from our drug store. You will be the best, you will have perfect sex in your life!\nEverything for your sexual health\nYou will have unbelievable sex 24/7!\nWith best regards,\nLaura Ingram\n \n \nI gromko, izdevatelski rashohotalsia, gliadia, kak vytianulos i bez togo Slishkom dlinnoe lico mechnika. Stoj! opomnivshis, pervoj zakrichala Onni i, rvanuvshis, popytalas Shvatit ego za ruku, no promahnulas Niksard neulovimo smestilsia v storonu. Zhratva tozhe budet v luchshem vide. I Postoianno pytaeshsia spriatatsia za maskoj polnejshego bezrazlichiia k Proishodiashchemu, polagaia, chto nichego ne zametno. \nOdomashnennyj vid krupnyh rogatyh zhivotnyh, v otlichie ot drakhov travoiadnyh. Pochuvstvovav moe vnimanie, on podnial golovu i voprositelno Posmotrel v moiu storonu shiroko raspahnutymi glazami. Ne Skroiu, ia sam gotovilsia pojti na takuiu meru, no shefir okazalsia reshitelnee Menia. Ia otnosilsia poka k samoj Nizkooplachivaemoj i perevozil ne osobo cennye gruzy, no ploh tot posylnyj, Kto ne mechtaet popast v elitnyj razriad. Eto psevdorazum, razum Naiznanku, otlichaiushchijsia ot nashego kak svet ot tmy. Iadovitaia polosa sverhu okazalas neozhidanno shirokoj metrov sto, ne Menshe, i tianulas do gorizonta v obe storony ne po priamoj, a zagibaias Shirokoj dugoj, kak by ocherchivaia nekij neohvatnyj vzgliadom krug. Starik zakryl glaza. Bolshoj oshibkoj bylo by schitat ego glupcom, no ego um ogranichen Fanatizmom, neterpimostiu ko vsem, kto myslit otlichnymi ot ego predstavlenii Kategoriiami. \nNe vopros! otmahnulsia paren, usazhivaias obratno, Eto detskaia Klichka. I bolshe Ne bylo nichego. Ia kak raz otkryl rot, chtoby izvinitsia eshche raz, no on perebil: Nichego ty ne ponial. Nervnaia noch Kvin pritormozil pozadi Onni Belt, kogda ta ostanovilas vozle torchavshih Iz steny koridora oblomkov mechej, vnimatelno ih razgliadyval. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}