{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Michael Whapples\" <mikster4@msn.com>", "subject": "Re: Speakup kernel patch dropped from Ububtu Gutsy", "body": "Couldn't agree more. With the simplicity of speakup, its always there. Also \neven though orca supports gnome-terminal which can be used for command line \nstuff, for some reason I seem to prefer to switch to a text console and use \nspeakup, and there are plenty of cases where I do use speakup rather than \norca. Then there are those cases where orca doesn't work, what happens if my \nX configuration is messed up and gnome just doesn't start, etc.\n\nAs for compiling a kernel, yes I have done it, but having now used ubuntu \nwhere I had no great need to compile my own kernel, I probably would prefer \nnot to go back to compiling my own.\n\nFrom\nMichael Whapples\n----- Original Message ----- \nFrom: \"Gene Collins\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Tuesday, May 15, 2007 4:18 PM\nSubject: Re: Speakup kernel patch dropped from Ububtu Gutsy\n\n\n>\n> To put it in language you'll understand, that stinks.  Not everyone\n> wants to use a gui interface.  There are still functions under the gui\n> that are not accessible.  As for the argument that Speakup is not\n> popular, you have only to look at the number of Speakup users on this\n> list.  As for the maintenance issue, speakup is no more difficult to\n> maintain than any other of the hundreds of modules that habitually are\n> included.  The thing that makes building your own kernel more difficult\n> is Ubuntu's insistence on using an initrd for a standard system.  All\n> the extra hardware discovery stuff isn't necessary once a system is\n> installed.  Besides which, without speakup, there is no way to do a\n> server install, and Speakup has never been included in a manner that\n> would allow a blind person to do an install from a server cd.  Mot to\n> mention the times when Orca or Gnome crashes in some fashion, and the\n> only way to recover things is by using Speakup from a text console.  If\n> you really have maintenence issues, talk to Kirk and find a way to\n> resolve them.  I think the decission to drop Speakup from Ubuntu is\n> extreemly short sighted.\n>\n> Gene Collins\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}