{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "adschai@optonline.net", "subject": "[R] Fitting multinomial response in structural equation", "body": "Hi - I am confronting a situation where I have a set of structural equation and one or two of my responses are multinomial. I understand that sem would not deal with the unordered response. So I am thinking of the following two ways:\n\n1. Expanding my response to a new set of binary variables corresponding to each label of my multinomial response. Then use each of these as a separate response in my model. However, since I have about 24 labels in this single variable, it will be very expensive to do this way.\n2. I am thinking of transforming this variable into a continous-valued variable. I am thinking of using the observed count to transform this variable using the probit function. Then my new variable is just a step-wise function. The trouble that I am struggling with is that this response variable will also serve as a predictor in another equation in my structural model. The interpretation of this equation is not so straightforward for me. The coefficient of this variable is no longer reading 'a unit change in this variable holding everything else fixed corresponds to the x unit change of the response'. All I can read from this method is that when I change from one label to another, it means p amount change in my step-wise-function predictor variable and it corresponds to x unit change of the response holding everything fixed.\n\nThe main purpose here for myself to post my question here is to obtain your insight especially with respect to using sem with the two approaches above. I would like to ensure that my approaches make sense within the context of sem. Any comments/opinions would be really appreciated. Thank you so much in advance.\n\n- adschai\n\n\t[[alternative HTML version deleted]]\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}