{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "invective: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n101 Questions Answered!\n\nWhat is Hezbollah? What are stem cells?\nHow'd those swimsuits get so skimpy?\n\nClick here for the KnowledgeNews answers\nADVERTISEMENT\nWord of the Day for Saturday, June 16, 2007\ninvective \\in-VEK-tiv\\, noun:\n1. An abusive expression or speech; a vehement verbal attack.\n2. Insulting or abusive language.\n3. Of, relating to, or characterized by insult, abuse, or denunciatory language.\nBut one can also note that he chose a fitting image for himself, going out in a duel of honor, armed all over with spikes of witty invective and a specialised knowledge of insult. -- Adrian Frazier, George Moore, 1852-1933\nThey all seemed to be in their usual mood of precarious good humour which could splinter at any moment into invective and menacing gesture. -- Alice Thomas Ellis, Pillars of Gold\nOne evening John Mitchell, slightly in his cups, let loose at Whalen with a mess of invective about writers, their inflated notion of their importance to political campaigns, and the need to keep them in their place. -- Leonard Garment, In Search of Deep Throat\nPolitical satire at the expense of governments or institutions is one thing. Personal invective is another. -- Victoria Glendinning, Jonathan Swift: A Portrait\nInvective comes from Late Latin invectivus, \"reproachful, abusive,\" from Latin invectus, past participle of invehi, \"to inveigh against.\"\nDictionary.com Entry and Pronunciation for invective\nYesterday's Word - Previous Words - Help\n\n101 Questions Answered!\n\nWhat is Hezbollah? What are stem cells?\nHow'd those swimsuits get so skimpy?\n\nClick here for the KnowledgeNews answers\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9932877-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}