{"category": "ham", "to_address": "r-packages@stat.math.ethz.ch", "from_address": "\"hadley wickham\" <h.wickham@gmail.com>", "subject": "[R] [R-pkgs] Updated reshape and ggplot", "body": "Hi everyone,\n\nThis is a short announcement for the users of ggplot and reshape.  I\nhave just released new versions of each that fix bugs when used with R\n2.5.0:\n\n * reshape was having problems with missing combinations of variables\n * errorbars in ggplot weren't working.\n\nI've you've been having problems with either of these, please upgrade.\n\nAbout ggplot\n=====================\n\nAn implementation of the grammar of graphics in R.\n\nggplot is an implementation of the grammar of graphics in R. It\ncombines the advantages of both base and lattice graphics:\nconditioning and shared axes are handled automatically, while\nmaintaining the ability to build up a plot step by step from multiple\ndata sources. It also implements a more sophisticated multidimensional\nconditioning system and a consistent interface to map data to\naesthetic attributes.\n\nFind out more at http://had.co.nz/ggplot\n\nAbout reshape\n=====================\n\nReshape is an R package for flexibly restructuring and aggregating\ndata. It is available on all platforms supported by R (Linux, OS X,\nWindows, ...).  Reshape (hopefully) makes it easy to do what you have\nbeen struggling to do with tapply, by, aggregate, xtabs, apply and\nsummarise. It is also useful for getting your data into the correct\nstructure for lattice or ggplot plots.\n\nYou can find out more at http://had.co.nz/reshape\n\n\nRegards,\n\nHadley\n\n_______________________________________________\nR-packages mailing list\nR-packages@stat.math.ethz.ch\nhttps://stat.ethz.ch/mailman/listinfo/r-packages\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}