{"category": "ham", "to_address": "Zombie <ktwarwic@flax9.uwaterloo.ca>", "from_address": "CNN <CNN@access.cnn.com>", "subject": "Beat rising fuel costs during summer travel", "body": "\n\nCNN.com May Update\n\n\n\n\n\nMember Center\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHow to beat rising fuel costs\n\n\n\n\n\nDespite record fuel prices above $3 per gallon, more Americans will travel by car over the Memorial Day holiday weekend than a year ago. But in an effort to reduce costs, travel agency AAA says travelers are planning to stay closer to home and take shorter trips. Find out what you can do to cut costs for your vacation road trip or for your everyday travel.\n\n\nHoliday travel likely to rise despite fuel concerns\nDebunking gas mileage myths \nGas budget calculator \n\n\n\n\n\nDo you know a hero?\n\n\n\n\n\t\t\t\tIn a world where the news seems dominated by crime, violence and injustice, CNN honors everyday heroes. CNN Heroes are ordinary people making an extraordinary impact. Do you know someone who has shown selflessness, determination, and courage in the service of others?\nNominate your hero\n\nSee other heroes and be inspired by their stories.\n\t\t\t\t\n\n\n\n\n\n\n\nBono speaks out on world events\n\n\n\n\n\t\t\t\tDr. Sanjay Gupta talks with Bono about everything from the upcoming G8 summit and the Red campaign, to how he balances his love of music with his passion to \"save the world.\" Watch the interview in its entirety, exclusively, on the \"Paging Dr. Gupta\" podcast.\nSubscribe\nWatch podcast\n*load time may vary\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat's Hot on CNN.com?\n\n\n\nLast Week's Top Stories\n\n\n•Inmate's last request -- pizza for homeless\n•Ski star's cousin kills cop, then shot dead\n•Boy, 10, guilty of beating homeless vet\n\n\nLast Week's Top Videos\n\n\nRecord-breaking 14-lb baby\nCelebrity plastic surgery\nVet beaten as onlookers watch\n\n\nSign up to receive The Daily Top 10 e-mail, CNN.com's most popular stories and videos of the day.\n\n\n\n\nDanger: Poisoned food\n\n\n\n\nDr. Sanjay Gupta and the CNN Special Investigations Unit examine current threats to the nation's food supply that can occur from the fields and farms to the packaging plants and grocery store shelves.\n\nWatch preview\nMore on contamination in our food supply\n\nWatch \"CNN: Special Investigations Unit - Danger: Poisoned Food\" on Saturday and Sunday at 8 p.m. ET.\n\n\n\n\n\nMember Center\n\nWant to update your preferences or add services?\nLog in to Member Center\n\n\n\n\n\n\n\n\n\nMake sure you receive our e-mails. Please add \n \nCNN@access.cnn.com to your address book.\nYou are receiving this e-mail because you have agreed to receive notice of new features and special offers from CNN.com.\nTo unsubscribe from CNN Member Center e-mails, click \n \nhere.\nCNN.com Privacy Policy\nOne CNN Center Atlanta, GA 30303\n2007 © & ® 2007 Cable News Network\n\n\n\n \n\n"}