{"category": "spam", "to_address": "Mail <mail@flax9.uwaterloo.ca>", "from_address": "Arnold Brennan <shanisi.t@gloc.net>", "subject": "Straining yourself when you are with a woman?", "body": "\n\nAre you afraid that she will meet someone who is better than you in bed? \nOur pharmacy\nViagra, Cialis, Valium, Levitra and more medications\nOur shop\nWe have cheapest prices and best quality drugs. We ship instantly worldwide!\nWith best regards,\nArnold Brennan\n \n \nSobratsia? v polnejshem nedoumenii povtoril ia, ne svodia s nego Nastorozhennyh glaz. Na chem ia tam ostanovilas? Ty rasskazyvala o svoej sestre. Kvin videl, kak ogromnaia tusha, peremahnuv cherez razdeliavshee pristan i Kormu ploskodona rasstoianie, opuskaetsia priamo na nego, zasloniaia nebo, i ne mog Sdvinutsia s mesta. Eto budet dusha drugogo tela, eto budesh Ne ty. \nEtot Krug byl skroen ne dlia menia. Otkuda znaesh? Znaiu. Kazhetsia, predosterezhenie prozvuchalo vserez, no Sevrena eto tolko Razozlilo. No Esli moi predshestvenniki takim obrazom pytalis razbudit Zveria, to ia prezhde Vsego stremilsia popast v hkasi-teleport. So storony sila transa po-prezhnemu vpechatliala Bigman Byl chut li ne vdvoe vyshe ego i raza v dva tiazhelee, a Celitel volok ego bez Vidimyh usilij. Osobenno silnoe slovoizverzhenie sluchalos togda, kogda krugom carila tma, Razgoniaemaia lish fakelami, i gde-to riadom brodili raznye strahi. Predstavlenie tolko nachinaetsia. Spasitelnoe, ubaiukivaiushchee bezmolvie. \nSchitalos, chto dobrovolno nikto iz nih ne sposoben Pozhertvovat soboj radi schastia i blagopoluchiia zhitelej Tenevogo Mira, to bish, Po-mestnomu Habusa. Vprochem, vidal ia i bolee strannyh rodstvennichkov. Po moim podschetam, dve Treti puti v tridcat kilometrov my uzhe odoleli, i minut desiat eshche mozhno Bylo vzdremnut. Mne stalo iasno, chto takoe Eta karuna, iavliaiushchaiasia istochnikom marnov, liudej, zombirovannyh dlia vypolneniia Opredelennoj celi. ejisuminyon XFNaWHVCQlZRUUgcRkNURVdBWFpeHFBV\n \n\n\n"}