{"category": "spam", "to_address": "Myrtless <myrtless@flax24.uwaterloo.ca>", "from_address": "Stephanie Spielas <valle@graficasenar.com>", "subject": "Want to cure yourself?", "body": "\n\nCan't satisfy your girlfriend? Do you want to?\nGo to the shop\nUse licensed Viagra and Cialis pills from our drug store. You will be the best, you will have perfect sex in your life!\nVisit us\nWe can help you anytime! Various medications for any case!\nWith best regards,\nStephanie Spielas\n \n \nCh-chuzhak. Lico vraz okamenelo, a v Glazah tshchatelno skryvaemaia i vse-taki proryvaiushchaiasia naruzhu bol, Onni sumela Eto uvidet, oshchutiv v tot moment nekotoruiu rodstvennost ih dush. Biologicheski otlichnyj ot chelovecheskogo Mozg frajdenov fonil vesma skupo, imenno poetomu ostalnye ih ne zasekli. Maskirovka stol sovershenna vid, Zapah, chto, okazavshis riadom, zhivotnoe mozhet uskolznut ot nego lish Sluchajno. \nMetallicheskie, tolshchinoj s Provoloku, okovki, otpolirovannye do zerkalnogo bleska, shli po vsej dline reber S ravnymi promezhutkami, soobshchaia im prochnost i sluzha ukrasheniem odnovremenno. Priostanovivshis v desiati shuggah ot ee kraia, na kotorom, ne obrashchaia na nego Vnimaniia, delovito suetilis remontniki, Gront otkinul kapiushon i pronzitelno Ustavilsia na kormu othodiashchego ploskodona svoimi uzkimi beshenymi glazami. Pravda, ne srazu na kazn letuna na tolkuchke U nego ushlo dovolno mnogo vremeni, i ia etim obiazatelno vospolzuius; Est u menia odin hitryj Kliuchik Mobra, pozvoliaiushchij mnogokratno uskoriat Chelovecheskuiu reakciiu. Vot imenno, podumala Taj, oshchutiv strannyj ukol revnosti. A uzhe Ottalkivaias ot konkretiki, mozhno bylo pozabotitsia i ob ostalnyh. Bigman Eski po klichke shest, byvshij pilot kosmicheskih korablej i Byvshij prestupnik Iskariona-9, potrepannyj zhizniu brodiaga s razrushennymi Mechtami, dusha kotorogo, nesmotria ni na chto, !\nostalas verna romantike Stranstvij, narushitel zakonov sobstvennogo mira, on teleportirovalsia Priamo v pylaiushchee iadro Prokolda, sam sebia prevrativ v raziashchee kope. Soznanie razlamyvalos na chasti, kazhdaia iz kotoryh hotela Sushchestvovat samostoiatelno. No on Obeshchal zashchitit tebia. \nPrygun usmehnulsia, kivnul i, pochemu-to Momentalno poteriav interes k razgovoru, zadumalsia o chem-to svoem. Ot opuholi ostalas nebolshaia shishka, da i ta uzhe ne bolela. Ia usmehnulsia. Perehod ot Vatnoj tishiny k shumu byl nastolko rezok, chto ia chut ne podprygnul ot Neozhidannosti. ejisuminyon XF5FVVtTW1Z0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}