{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "6p 530 Update: Spacewalk on track", "body": "\n\n\n\n\n6p 530 Update: Spacewalk on track\n\n\n\n=================================\n\nCBS NEWS Coverage of Breaking Space News\nPosted: 5:58 PM, 5/30/07\n\nBy William Harwood\nCBS News Space Consultant\n\nChanges and additions:\n\n   05/03/07 (01:00 PM): Schirra dies\n   05/25/07 (01:15 PM): Oefelein leaving NASA, agency confirms\n   05/30/07 (03:10 PM): Spacewalk begins\n   05/30/07 (05:58 PM): Debris panels moved; antenna work on tap\n\n=================================\n\n5:58 PM, 5/30/07, Update: Debris panels moved; antenna work on tap\n\nSpace station commander Fyodor Yurchikhin and flight engineer Oleg Kotov are midway through a spacewalk to install micrometeoroid debris shields and re-route a Global Positioning System antenna cable. While the spacewalk began about 45 minutes late because of communications problems, the cosmonauts have made up lost time and flight controllers expect the excursion to end roughly on schedule, around 8:20 p.m.\n\nThe cosmonauts have retrieved the debris panels from their storage point on the Unity module and moved them to the front section of the Zvezda command module using a telescoping boom. Before installing the shields, however, the spacewalkers made their way to the back of the command module to reposition the GPS cable, part of a system that will provide navigation data to approaching unmanned European Space Agency cargo craft.\n\nOnce the cable work is complete, Yurchikhin and Kotov will install five of 17 debris panels before calling it a day and returning to the Pirs airlock module. The remaining 12 panels will be installed next week.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}