{"category": "spam", "to_address": "Myrtless <myrtless@flax24.uwaterloo.ca>", "from_address": "Natalie Long <aardvark@greenvilleprinting.com>", "subject": "Penis power", "body": "\n\nLooking for an effective and cheap solution to have sex like you had 10 years ago?\nEverything for your health\nWe have only high-quality national medications at low prices. There is no need for someone to know about your sexual problems. \nClick here to be the best lover in the world!\nLowest prices on the web, only licensed and quality pills.\nWith best regards,\nNatalie Long\n \n \nPust zvuchit Banalno, no kak zavodit dlia horoshej draki! Boius, chto poniatie zadnica k etoj shtuke neprimenimo. Pogodi nemnogo, ia podgotovliu siglajzer dlia raboty s toboj. Pervaia charka za schet zavedeniia, burknul kostliavyj Bilok, delovito Razlivaia svetlyj peniashchijsia napitok iz kuvshina. Istoriia povtorialas. \nPrismotris vnimatelnee. A zatem skvoz rastopyrennye palcy ugliadel kakuiu-to vozvyshavshuiusia Nad zemlej i lesom temnuiu massu, medlenno vyrastavshuiu vperedi, v kotoroj, Prishchurivshis, daleko ne srazu raspoznal to, chem ona iavlialas. Krome togo, hvataet i perestrahovshchikov, ispoveduiushchih put Passivnoj very, chi klevetnicheskie izmyshleniia nanosiat ogromnyj vred vsemu Delu. A nado budet, tak eshche iz nashih Gorodov cherez portaly mozhno budet podtianut. Ia by dazhe ne stal ih kalechit, prosto vyrubil by vseh, odnogo za drugim, I nikto by za vremia etogo dejstviia chihnut ne uspel. Strannoe oshchushchenie vozniklo gde-to v Nogah bystro poteklo vverh po telu holodnymi koliuchimi iglami. Dvigaj na Fermu. Net, ne to. \nchem Bolshe povrezhdenie zhivoj tkani, tem bolshee udovolstvie ia ispytyvaiu pri ego Ustranenii. Eliot Niksard Vygliadel etot mir prosto parshivo. Vmesto beskonechnogo mertvogo lesa obrazovalas pokrytaia Chernym prahom, ne menee beskonechnaia ravnina. Ot Mgnovennoj i razitelnoj peremeny, chto proizoshla s ego licom, u menia priamo Moroz po kozhe podral. ejisuminyon XF5FVVtTW1Z0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}