{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In defence of YouTube", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tIN DEFENCE OF YOUTUBE\n\n\n\n\n\n\n\n\t\t\t\t\t\tWebsites such as YouTube have come under fire today for not doing enough to discourage cyber-bullies.\n\n\nMeanwhile, web pioneer Tim O'Reilly has drawn up a draft code of conduct on blogging that suggests readers should be warned if they are about to be exposed to \"crude language\". \n\n\nIn tonight's programme, we'll attempt to redress some of the negative press new technology has been getting.  We'll look at some of the creative efforts the technology has been unleashing, and the increasing craze on sites such as YouTube for posting re-enactments of famous scenes from films.\n\n\nTo whet your appetite, below is a YouTube link to one man's one-man Goodfellas cyber-homage.  Here's your opportunity to get into a spot of afternoon wilfing, and we'd like to point out that the clip contains strong language from the outset.\n\n\nhttp://www.youtube.com/watch?v=yLje9McwxvA&NR\n\nNewsnight, presented by Gavin Esler, returns from its Easter slumber tonight at 10.30pm on BBC TWO.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}