{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Lifestyle Newsletter June 7, 2007", "body": "\nhowstuffworksÂ® | lifestyle June 7, 2007\nRSS\n \n  How Sign Language Works\n  There are hundreds of sign languages, each with a rich vocabulary and grammar that exists independently of any spoken language. Learn about American Sign Language, the attempt to establish a universal sign language and other applications of \nsign language. \n Also at HowStuffWorks\n \n\nHow Machinima\nWorks - In 2003,\nproduction company Rooster Teeth helped expand audiences' awareness of\nmachinima when they unveiled \"Red vs. Blue,\" a series of humorous\nshort films using the \"Halo\" game engine. Learn about machinima and how\nto make your own machinima film.\n \n\nHow can\nsomeone stay awake for 11 days? - Have you\never pulled an all-nighter to study or finish a project? How about doing it 11\ndays in a row? A man in Cornwall,\n England,\nactually went 11 consecutive days without a wink of sleep. Learn how he did it\nand why you shouldn't attempt it.\n \n\nFather's\nDay Gifts: Camping Equipment for Dad - Father's\nDay comes during the perfect season for camping, and what better way to show\nyour father how much you care than with a family camping trip? Check out our\ncamping-themed gift guide.Want more from HowStuffWorks? We've recently added 12 new \nRSS feeds. Besides the Daily Feature you can now enjoy feeds from Entertainment, Health, Auto, Home and Garden, Science and more. \n   \nThis Week's Video\n \n\nHow Karate Works - Karate is not only about strength and speed -- the technique\ninvolves as much thought and focus as physical power. Watch this video from\nHowStuffWorks to see how karate experts can break cinder blocks with their\nfeet.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. Â© 2007, HowStuffWorks, Inc. All Rights Reserved "}