{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "drew Roberts <zotz@100jamz.com>", "subject": "Re: [cc-community] Does BY-SA extend to a newspaper?", "body": "On Friday 20 April 2007 03:15 am, Rob Myers wrote:\n> Terry Hancock wrote:\n> > Although I understand the motivation to extend the copyleft to\n> > containing works, it presents a number of nasty consequences which I\n> > believe have to be avoided if you want it to work (here's a few I can\n> > think of right off):\n>\n> Certainly the side effects would need thinking through very thoroughly\n> and may be worse than just accepting the loss.\n>\n> Fair Use would also need to be strongly defined for images, for example\n> works of criticism should be able to use images as illustrations under\n> Fair Use without having to be copylefted themselves. This is important\n> for free speech.\n>\n> > 1) \"License the Universe\"\n> >\n> > Any reasonable use of a work means it is \"contained\" in something else\n> > whose license you are not able to, or should not attempt, to control.\n>\n> \"Contained\" is not a legal term AFAIK and as you are using it here seems\n> to cover both use and distribution (in GPL-2 terms).\n>\n> > For example, an HTML page \"contains\" an image.\n>\n> The code for an HTML page does not contain an image. The rendering of an\n> HTML page will create an image that combines the text of the html with\n> the pixels of the image in a single unit. This is use.\n>\n> > A website \"contains\" an HTML page.\n>\n> This is borderline. There is nothing in the site that causes a single\n> unit to be rendered incorporating all of its \"contained\" units, but some\n> sites that is a single work (eg an encyclopaedia).\n>\n> CDs of music are an interesting case. People sometimes don't seem to\n> expect BY-SA music to be distributable alongside non-free work.\n>\n> > The Internet \"contains\" the website.\n>\n> Again no single usable unit is ever created that includes all the\n> \"contained\" units. This is distribution.\n>\n> > Given that this can clearly be taken\n> > to unreasonable extremes, where should the line be drawn?  I think it's\n> > a very good idea for the line to be drawn by license stewards like CC\n> > instead of leaving it up to lawsuits.\n>\n> The line should be drawn where the existing social contract of use\n> determines that it should be drawn, and/or where it is unreasonable.\n>\n> > We are saved to a degree by the limited scope of existing copyleft\n> > terms. They allow any license (including other free licenses) to be\n> > applied to \"mere containers\" and to siblings within the same container,\n> > so they prevent lock-ups due to license incompatibility.\n>\n> This does not ensure that the users of the \"mere container\" have the\n> same freedom as the creator of the \"mere container\". Where its creator\n> has used free work to achieve the sum effect of a single rendered unit\n> this is a loss of freedom.\n>\n> > Thus, if I have an HTML page with GFDL, GPL, By, and By-SA images in it\n> > (not to mention \"verbatim use only\", \"By-NC-ND\", or \"fair use\" images),\n> > then -- if a container-binding copyleft is applied to any of the above\n> > \"free\" licenses -- the licensing is locked up and I cannot publish.\n>\n> Does the page \"use\" the images? If so the freedom that the creator of\n> the page enjoys should not be a privilege that they can deny others.\n>\n> > As things stand we have a situation with some admitted faults -- it may\n> > be a little *too* free. But trying to sew up the loopholes is going to\n> > cause problems, and I'm not convinced that the cure wouldn't be worse\n> > than the disease.\n>\n> At the moment we have a situation where what some people regard as an\n> obvious case of use (the creation of a single image consisting of text\n> and photo in the memory partition of a web browser or a RIP ) is not\n> tackled.\n>\n> There is a precedent within the licenses for for tackling this as an\n> exception rather than trying to create a general principle from it: the\n> musical synchronization clause for using music in films. So using\n> photographs as illustrations could be added as another similar clause.\n>\n> Or we could recognize that the existence of two such exceptions\n> indicates a more general principle and try to codify it, using them as\n> examples.\n>\n> Or we could accept that this is more problematic than the musical case\n> and simply explain the licenses better to photographers.\n\nFor all of this contains, mere aggregation, use and the like, what is wrong \nwith the concept I put forth which is \"if a copyright arises\" - that is, \ncopyright law may already have the answer. If the work under the CC SA \nlicense is used in a work where a new copyright comes into being, that is \nwhat we should concern ourselves with. If no new copyright comes into \nexistence, it is not a problem.\n\nIs this not a reasonable way to look at it? Strenghts? Weaknesses?\n>\n> - Rob.\n\nall the best,\n\ndrew\n\n-- \n(da idea man)\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}