{"category": "spam", "to_address": "<faisalabad@speedy.uwaterloo.ca>", "from_address": "\"Acevedo\" <ebo@shentel.net>", "subject": "Over, under, around; we'll get past it one way or the other.", "body": "\n\n\n\n\n\n\n\nWe're killing ourselves. Who could have ever \nimagined the military's intended development of a widely distributed and healable \nnational network would have led to.\nWhere did he get the guns?\nWe have all drifted away from the motivating \nconcepts of \"the greater good,\" the value of community and need for moral \nconduct.\nYour lust for a warm body next to yours may be less \nof a threat to our society than your possible violent action or misused \npower.\nI'm not sure we have the luxury of time while \nsociologists, psychologists, psychoanalysts and paid consultants to the media \ndiscuss this. We (and trust me, that's the royal \"we\") elected Gray Whatshisname not \nonce but twice. But, somebody has got to reign in the RIAA. Can't we get the \nmessage?\n\" What could drive a fourteen year old to such \nhorrific action? I generally don't intentionally travel downwind of fermenting \ngarbage dumps. What works in business is not directly transferable to government but \nstill, this is encouraging. The three were allegedly armed with fully-loaded rifles, \nhandguns, swords and 2,000 rounds of ammunition.\n\"Thank you,\" I'd say and then sheepishly put down \nthe handset for having had a conversation with a recording.\nBut, I am diametrically opposed to the recall \nelection. In a complaint filed late Wednesday in U. One way or another we're doing \nit with more and more ferocity.\nThe most likely answer is they saw nothing unusual \nuntil it was too late.\nWe never did want to break the law. For the full \nstory: InfoWorld News Posted by Ron at 09:24 AM March 23, 2003 Oscar winner slates \nBush and war Remind me to never, ever, ever see any movie that has anything to do \nwith Michael Moore.\nWhat if we miscalculate and split Ol' Mother Earth \nin half. The recall is an affront to all of us.\nWe expect these seeds to mature in another 2 to 3 \nweeks.\nOf course, the Redmond monolith has taken a lot of \nhits recently about their widely vulnerable software, including Win2K Server which \nwas supposed to be pretty tight. Ten years in prison will put him in contact with an \nelement that will only further his criminal education and make him more of a threat \nwhen he gets out. for the economy as a whole and for each individual. Moore; you are \nnot deserving of such sacrifice. 3 Racy Men's Magazines Banned by Wal-Mart Wal-Mart \nStores halted sales of three men's magazines that feature scantily-clad starlets and \nbawdy humor.\nGiven sufficient incentive, we can overcome \nanything, even our own rules. Is it too late to stop what's beginning to look like a \nplague? He may discover the RIAA has figured out it can gain added profits from law \nsuits.\nHell, you either bought what was sold or you did \nwithout. We've been spared 'till now.\n[via Headlines From The NY Times] Posted by Ron at \n12:34 PM March 10, 2003 I read Blix's report to the UN Well, I guess I'm beginning \nto waffle on this one. At this moment I'm being hung out to dry on the Horns of a \nDilemma. A bunch of bottom-feeders create an industry that breaks into my privacy, \ninterrupts my meals, insults my intelligence and just generally intrudes upon my \nlife.\n"}