{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTUESDAY 1 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER ROBBIE GIBB\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nBlair: the final countdown\n\n\nTen years down - how many days to go? This morning, perched on a breakfast TV sofa, Tony Blair promised to \"say something definitive\" about his plans for stepping down as Prime Minister. \n\n\nA few hours later he was in Edinburgh where he gave his most explicit endorsement to Zombie Brown, telling the assembled throng \"In all probability, a Scot will become prime minister of the United Kingdom.\" So far so good for Zombie Brown.  \n\n\nUnfortunately, a Newsnight poll will make uncomfortable reading for the man who would be PM. Almost three quarters of respondents think there should be a General Election soon after Blair steps down - more disturbing still, this was true of even the majority of those who describe themselves as Labour voters.  \n\n\nClick here to view the poll results\n\n\nSo, what lies ahead for Brown and the party he wants so desperately to lead? Michael Crick will be reporting from Scotland and we'll be talking live to Hazel Blears and the SNP leader, Alex Salmond.\n\n\nOperation Crevice\n\n\nPressure is growing for a public inquiry into MI5's handling of intelligence before the July 7 bombings - despite yesterday's verdict, there are many questions yet to be answered. \n\n\nOur correspondent Richard Watson, who first broke the story that Mohammed Sidique Khan was under surveillance a year before 7/7, has new detail on who knew what and when? We'll be speaking to the former Chairman of the Intelligence and Security Committee, Lord Tom King.\n\n\nIraq\n\n\nAmidst disputed reports that the leader of al-Qaeda in Iraq has been killed, our diplomatic editor, Mark Urban, who is in Baghdad, has been talking to the Defence Secretary, Des Browne - and asking him whether the continued British presence in Iraq hasn't served merely to aggravate matters there.  \n\n\nChinese maths puzzle\n\n\nHis encounter with A-level physics might not have been an unqualified success - but this hasn't stopped Steve Smith going where other science students may fear to tread. \n\n\nHe's taken his protractor and calculator to spend the afternoon with a software engineer from Shoreham who successfully solved a maths problem, taken from a Chinese university entry test, set by the Royal Society of Chemistry to illustrate how much Chinese science students are outstripping their UK counterparts.\n\n\nClick here to view the test and answers\n\n\nNewsnight is on BBC2 at 10.30pm.\n\n\nRobbie\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nTERROR NETWORK LINKS PROBED\n\n\t\t\t\t\t\t\tRichard Watson reports on the terror networks in the UK and Pakistan, after five men were jailed for life over a bomb plot.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}