{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Greenfield Gets Personal", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe \n      Public Eye Chat With…Jeff Greenfield\"Most members of the \n      so-called mainstream media undoubtedly, in the voting booth, vote \n      Democratic. There's no way out of that, you can't ignore it. There are \n      certain cultural, personal reasons – when I say personal I mean reasons of \n      personality. Reasons of background. Why you go into journalism in the \n      first place. You tend to have attitudes that tend to mark you more as a \n      Democrat than a Republican. You tend to be more secular, you tend to be \n      more skeptical, you tend to be disrespectful of authority. And those \n      things tend – tend – to push to the left of the spectrum.\"[+ Read More]\n\n\nWolfowitz's \n      Political Capital Runs Out at World Bank\nIt wasn’t merely about Wolfowitz and Riza dating – the World \n      Bank certainly could have accepted their relationship. One of the key \n      aspects of the controversy was the climate within the World Bank. It was, \n      as Sheryl Atkisson said in an exchange with Public Eye, \n      “a culture clash.” This was an uneasy pairing: An architect of the Iraq \n      war being appointed the head of the World Bank, which, Atkisson observed, \n      “by definition often deals in liberal causes, with liberal clients.” \n      [+ Read More]\n\n\n\nFrom The Vault: \"Let's Go To The \n      Fair\"This week's installment of \"From The Vault\" features \n      Walter Cronkite's visit to the 1962 World's Fair in Seattle. Click on the \n      video box to watch. And if that's not enough Cronkite for you, be sure to \n      check out tonight's primetime special.[+ Read More]\n\n\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nBats \n      and Balls and ... Boosting the Brand?\n \nThe \n      Jason McElwain Story Comes To CBS News – And \n      YouTube\n \nBush, \n      Blair, And The British Press\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}