{"category": "spam", "to_address": "<theorize@plg.uwaterloo.ca>", "from_address": "\"Carey\" <bwl@johngweber.com>", "subject": "SOUTHEAST WIND TO 15 MPH THROUGH THE EARLY MORNING HOURS.", "body": "Our pick of the Month is Flying!!!\n\nCARBON RACE (WKN 15Q105)\nNDGB.F.\nLast price: 0,95\n52 Weekrange : 0,50 - 1,16\n\nWatch for Monday May 14th 2007. Our Best Pick of the Week. This is our\nbest yet!!!\n\nFOR THE FOLLOWING FORECAST LOCATIONS:. FIRE WEATHER WATCH IN EFFECT\nTUESDAY AFTERNOON.\nSOUTH WINDS OF 20 TO 30 MPH WITH GUSTS TO 35 MPH WILL DEVELOP MONDAY\nAFTERNOON AND CONTINUE THROUGH MONDAY EVENING.\nTHE NEAR FREEZING CONDITION WITH DEVELOPING FROST IS EXPECTED TO\nOVERSPREAD LARGER SECTIONS OF SOUTHERN NEW ENGLAND EARLY THIS MORNING.\nKAKE 845 PM ADT SUN MAY 13 2007 . HAINES 845 PM ADT SUN MAY 13 2007 .\nWHILE WINDS IN THE PASS WILL BE EASTERLY AT 15 TO 20 MPH.\nNORTHERN CONNECTICUT AND EXTREME NORTHWEST RHODE ISLAND.\nFROST ADVISORY REMAINS IN EFFECT UNTIL 6 AM EDT EARLY THIS MORNING.\nAND LEAVE PLENTY OF DISTANCE AHEAD OF YOU IN CASE A SUDDEN STOP IS\nNEEDED.\nMOSTLY CLOUDY WITH RAIN. ST GEORGE 105 AM ADT MON MAY 14 2007 .\nCONTINUED MOSTLY CLOUDY ACROSS THE VALLEY WITH A FEW RAIN SHOWERS.\nARC067-147-141309- 809 PM CDT SUN MAY 13 2007 THE FLOOD WARNING\nCONTINUES FOR THE CACHE RIVER NEAR PATTERSON. WESTERLY 442 AM EDT MON\nMAY 14 2007 . HYDER 9 PM ADT SUN MAY 13 2007 .\nTHE NATIONAL WEATHER SERVICE IN LITTLE ROCK HAS ISSUED A FLOOD STATEMENT\nFOR THE FOLLOWING RIVER IN ARKANSAS. PLEASE ADVISE THE APPROPRIATE\nOFFICIALS OR FIRE CREWS IN THE FIELD OF THIS FIRE WEATHER WATCH.\nWESTERLY 442 AM EDT MON MAY 14 2007 . STRONG WESTERLY WIND GUSTS OF 35\nTO 45 MPH COMBINED WITH LOW HUMIDITY TUESDAY AFTERNOON SETS THE STAGE\nFOR POTENTIAL DANGEROUS FIRE SPREAD CONDITIONS.\nJUNEAU 845 PM ADT SUN MAY 13 2007 .\nNORTHERN CONNECTICUT AND EXTREME NORTHWEST RHODE ISLAND.\nLISTEN FOR LATER FORECASTS AND POSSIBLE RED FLAG WARNINGS.\nMOTORISTS TRAVELING ACROSS SOUTHWESTERN ESCAMBIA COUNTY FLORIDA AND\nEXTREME SOUTHEASTERN BALDWIN COUNTY ALABAMA.\nTHE DENSE SMOKE ADVISORY CONTINUES UNTIL 7 AM MONDAY FOR SOUTHERN\nESCAMBIA COUNTY FLORIDA AND EXTREME SOUTHEASTERN BALDWIN COUNTY ALABAMA.\n07 - Mon - 05:21:15 AM (EDT) Warnings, Watches and Advisories in Effect\nfor the United States This page contains watches, warnings and\nadvisories that are in effect for the United States.\nHIGH TERRAIN WILL BE PARTICULARLY VULNERABLE TO THE HIGHER WIND GUSTS.\nTHOSE WITH AGRICULTURAL INTERESTS ARE ADVISED TO CONTINUE PROTECTING\nTENDER VEGETATION EARLY TODAY. MOSTLY CLOUDY WITH RAIN. MOSTLY CLOUDY\nWITH RAIN.\nSOUTHEAST WIND TO 10 MPH INCREASING TO 10 TO 20 MPH BY 3 AM.\nCLOUDY SKIES WILL CONTINUE TO CLOAK THE NORTHEAST PRINCE WILLIAM FROM\nVIEW ON THE SATELLITE PICTURE.\nSOUTHEAST WIND TO 15 MPH THROUGH THE EARLY MORNING HOURS. CORRECTED TYPO\nPGH 4 FROST ADVY THE NATIONAL WEATHER SERVICE IN LITTLE ROCK HAS ISSUED\nA FLOOD STATEMENT FOR THE FOLLOWING RIVER IN ARKANSAS.\nSOUTHEAST WIND 10 TO 15 MPH GUSTING TO 20 MPH IN EXPOSED AREAS.\nA FIRE WEATHER WATCH MEANS THAT WEATHER CONDITIONS COULD LEAD TO THE\nPOTENTIAL FOR A RED FLAG EVENT IN THE NEAR FUTURE.\nTEMPERATURES LOWERING INTO THE 30S TO NEAR 40. THROUGH EARLY MORNING. ST\nGEORGE 105 AM ADT MON MAY 14 2007 .\n\n"}