{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 6/2/07 - Low Risk - High Returns", "body": "Dear Cabot Wealth Advisory Reader,\n\nIf you've been aggressively invested over the past three months you've\nenjoyed the fruits of a marvelous buying stampede, and I congratulate you.\nIt takes courage and discipline to be an early buyer in a bull market.\n\nBut if you haven't been aggressively invested over that time, I have an\nimportant message for you today, and it's this.  Perhaps you should\nconsider a low-risk method of investing that succeeds regardless of the\nmarket's ups and downs.\n\nMy logic goes like this.\n\nOver the years I've seen that the biggest market losses are suffered by\ninvestors who buy too late in the market cycle.  Sometimes it's not their\nfault; they've just had a windfall and they want to put it to work.\n\nBut more frequently it comes down to fear and greed.  These people fail to\ninvest early in the bull market for one simple reason - they're afraid. \nAnd by the time that fear is overcome by greed - when the stories of\nprofits that have been made by others overcome the fear of losing money -\nit's late in the cycle.  And next thing you know, their stocks are going\ndown.\n\nNow, market cycles are here to stay, and many of our Cabot publications\nwork with those cycles.  But if you've deferred aggressive investment\nuntil now, and if fear is one of the reasons, I suggest you take a look at\nCabot Benjamin Graham Value Letter.\n\nBenjamin Graham, of course, is the father of value investing.  One of his\nstudents was Warren Buffet, who's done pretty well for himself.   \nAnother was Dr. Wilson Payne, who later worked with Roy Ward at Babson\nCollege to computerize the formulas behind the great system.   \nAnd Roy Ward is the editor of Cabot Benjamin Graham Value Letter!\n\nWhat this means to you is simple.  You follow Roy's advice, confident that\nyou're buying at a deep discount, regardless of the market cycle.  You\nhold on for a year, or two, or three, until the stock reaches Roy's target\nprice, and then you sell.\n\nRecent winners:\n\nTotal System Services (a processor of credit cards) up 56.4% in 17\nmonths.\n\nReliance Steel (a metals wholesaler) up 32% in 12 months\n\nExxonMobil (you know who they are!) up 22% in 8 months\n\nIt's not exciting, but it works.  In fact, since its inception at the end\nof 1995, Roy's Wise Owl Model has racked up a compound annual return of\n16.5% compared to 7.4% for the S&P 500.\n\nAnd the Classic Model is up 26.2% compounded since 2002, compared to a\ngain of 8.4% by the Dow!\n\nSo if you've delayed investing until now because of fear of losing money,\nor even if you're just looking for a low-risk investing method that works,\ngive it a try.\n\nI've arranged a special offer for readers of Cabot Wealth Advisory, and\nyou can access it by clicking the link below.\n\nhttp://cabotmail.net/t/192021/13148861/94/0/\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n\nP.S.  There's no time like the present . . . especially when you're\ndealing with investments.  The June issue of Cabot Benjamin Graham Value\nReport comes out next week.  Please sign up today.\nhttp://cabotmail.net/t/192021/13148861/94/0/\n\n-----\n\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=192021&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}