{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Lana Root\" <hoqdastmalchimac@dastmalchi.net>", "subject": "Doctors and Celebrities endorse Anatrim", "body": "\nEnd the annoying obesity now\n\n\n\n\n\n\r\nAnatrim – The very up-to-date and most delighting flesh loss product is made available now – As shown on ABC.\r\n\n\r\nDo you count up all the times when you asked yourself to do anything for being delivered from this fastly growing number of kilos? Happily, now no great price is to be paid. Thanks to Anatrim, the earth-shaking kilos-melting mixture, you can achieve naturally health mode of life and a really slender figure. Just look at what people state!\r\n\n\n\r\n\"I hate to confess but I was an awful food addict. \r\n\n\r\nI swallowed up all this garbige \r\n\n\r\nand could not stop. \r\n\n\n\n\r\nThis suffering stopped when I started course with Anatrim! \r\n\n\r\nGod,\r\n\n\n\n\r\n my appetite abated, \r\n\n\r\nspirits improved and I turned to the happiest person 25 pounds in 2.1 months. \r\n\n\n\n\r\nI can tell you now I turned to the happiest person!\"\r\n\n\n\n\n\r\nAmelia B., New York\r\n\n\n\n\n\r\n\"Since the very childhood I was a weighty boy. \r\n\n\r\nYou can't fancy how I abhorred being derided at school. \r\n\n\n\n\r\nI detested my plumpness and I abhorred myself. \r\n\n\r\nAfter trying this and that I learned about Anatrim. \r\n\n\n\n\r\nIt literally took me out of this nightmare! The very sincere thanks to you, guys.\"\r\n\n\n\n\n\r\nSteve Burbon, Colorado\r\n\n\n\n\n\r\n\"Do you know what? Thanks to Anatrim my marriage was luckily saved! I fell down into the circle, depression – eating more – just more depression. My wife was going to leave the overweight psycho I was turning in. \r\n\n\r\nMy friend pointed at your site and I asked for Anatrim at once. \r\n\n\r\nThe result was excellent, my appetite came to admissible level, I was often in good spirits, and, of course, I tightened my belt with no regrets. And the bed became cool, too!\"\r\n\n\n\n\n\r\nFrank\r\n\n\n\n\r\n There is a great number of gratitudes happy people leave after taking Anatrim. Don’t you wanna add yourself to the thousands and thousands of slim women and men and take this all-natural appetite-abating energy raising product now!\r\n\n\r\nDon’t lose the chance!\r\n\n\n\n\nList przeskanowano programem ArcaMail, ArcaVir 2006przeskanowano 2007-04-27 23:19:11, silnik: 2005.12.01 12:00:00, bazy: 2007.04.24 10:38:10This message has been scanned by ArcaMail, ArcaVir 2006scanned 2007-04-27 23:19:11, engine: 2005.12.01 12:00:00, base: 2007.04.24 10:38:10"}