{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "A massive terror plot foiled in Saudi Arabia...we'll have all the late breaking details tonight on the CBS Evening News with Katie Couric, anchoring tonight from Chicago. ", "body": "\n\n\nCBSNews.com\n\n\n \n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\nQUOTE OF THE DAY\"In films murders are always \n      very clean. I show how difficult it is and what a messy thing it is to \n      kill a man.\" - Alfred Hitchcock \n\nDID YOU KNOW?The dollar was established as the official \n      currency of the US in 1785. \n\nSATURDAY\nON 48 HOURSHere's a note from Bill Lagattuta on Saturday's 48 \n      Hours Mystery, Murder in the Fast Lane: \n      \"The story of Mickey Thompson is the story of a genuine American \n      hero--the man who at one time was the fastest man on earth. He was a \n      down-to-earth racing icon, a tough businessman, an innovator and he was \n      married to the love of his life, Trudy. It all came to a horrible end \n      almost twenty years ago when Mickey and Trudy were gunned down, execution \n      style, in the driveway of their Los Angeles area home. I remember covering \n      this story as a young news reporter, and it's fitting for me to be present \n      at the final chapter. From the beginning, the focus of the \n      investigation was Mickey Thompson's colorful business partner, Mike \n      Goodwin. But there was no physical evidence to tie him to the crimes. For \n      the past two decades, through a series of fascinating twists and turns, \n      detectives and Thompson's hard-driving sister Colleen have been pursuing \n      Goodwin, hoping his flamboyant personality and his big mouth would be his \n      undoing. In our program this week, we will take you step by step through \n      this fascinating case... and you'll be able to watch what many considered \n      the surprise ending in court. Murder in the Fast Lane was an \n      amazing story for me to live, and to report. I hope you will join us on \n      Saturday night.\" - Bill Lagattuta (48 Hours \n      Mystery airs Saturday at 10pmET/9CT) If you would like \n      more information on any of these stories or the broadcast, please click on \n      the following address and e-mail us at: 48hours@cbsnews.com \n      \n\nTONIGHT ON THE CBS EVENING NEWSHere is \n      an early preview of what Awe are planning for tonight's CBS EVENING NEWS \n      from Anchor and Managing Editor, Katie Couric... Hi \n      everyone, I'll be anchoring our broadcast tonight from \n      Chicago, the unofficial capital of the Midwest - known for its deep-dish \n      pizza, vibrant sports teams and rich political history. We'll \n      bring you up to date on the political significance of the Windy City to \n      the presidential race, and I'll be taking a look at the life of one \n      of the favorite sons of Illinois politics today: Senator Barack Obama. \n      Overseas, Saudi police have arrested more than 170 militants who \n      planned to carry out suicide attacks against oil facilities and public \n      figures, according to the Interior Ministry. Richard Roth will have \n      more on this massive bust of terror suspects. Former CIA director \n      George Tenet's memoir will be released next week, and it's already making \n      a stir in Washington. Jim Axelrod will give us a preview of what \n      Tenet is likely to reveal in At the Center of the Storm. \n      And Senior Political Correspondent Jeff Greenfield will \n      give you an overview of last night's debate of Democratic presidential \n      hopefuls. There's a new gold rush in the Midwest. But this time, \n      the prized loot is not a mineral - it's a vegetable. As Cynthia \n      Bowers will report, farmers are planting record crops of corn this \n      season to keep up with the growing demand for the corn-derived fuel \n      additive ethanol. Finally, I'll give you a look at the \n      political character of the Windy City, from its earliest days right up to \n      the 2008 election. I hope you'll join me. Have a great \n      weekend! Katie For more information on these \n      stories, please click on the following links: Saudis Nab \n      172 Suspected Militants Click Here Steady Clinton \n      Handles A Lively Debate Click Here And here's an early \n      look at one of the stories we are working on for Monday's broadcast:\nThis week, we look at a real and growing addiction - to the \n      Internet. We'll show you the toll it's taking on millions of families. \n      Caught in the Web... A special series beginning Monday on the \n      CBS Evening News. THIS \n      WEEKEND ON THE CBS EVENING NEWS: SATURDAY ON THE CBS \n      EVENING NEWS... Sharyn Alfonsi anchors the Saturday \n      Edition of the CBS Evening News from New \n      York. Along with the top news of the day, \n      we will also have the following stories: IRAQ OFFENSIVE: \n      President Bush will be on the offensive this weekend, arguing his case \n      against Congressional plans for a withdrawal timetable from Iraq. Joie \n      Chen will have the latest. FIRE FORECAST: Drought has \n      created extremely dangerous conditions for wild fires in many states. \n      John Blackstone looks at predictions for this summer's fire season. \n      TEMPORARY VISAS: Businesses in the nation's busiest \n      vacation spots are worried they won't have enough workers this year. \n      Michelle Miller reports how new laws and procedures for approving \n      visas for temporary foreign workers could make your summer break a lot \n      less relaxing. NFL HEAD INJURIES: The NFL holds its draft \n      Saturday. Some league veterans wonder if the new crop of players will be \n      treated better than past players struggling with severe head injuries \n      suffered on the gridiron. Thalia Assuras reports. SUNDAY \n      ON THE CBS EVENING NEWS... Anthony Mason anchors the \n      Sunday Edition of the CBS Evening News \n      from New York. Along with the top news of \n      the day, we will also have the following stories: EXECUTIVE \n      PAY: Investors may be pleased that the Dow has charged past 13,000, \n      but many are raising objections to the tens of millions some CEOs are \n      getting in salary and bonuses. Mark Strassman reports on efforts to \n      give stockholders more say in executive pay. ZOO ELEPHANTS: \n      The oldest zoo in America is removing its elephant exhibit. The \n      Philadelphia Zoo's decision is part of a trend among big city zoos to \n      close their elephant houses. Anthony Mason explains why. If \n      you would like more information on any of these stories or the broadcast, \n      please click on the following address and e-mail us: evening@cbsnews.com \n      \n\nTONIGHT ON DAVID \n      LETTERMANDave chats with actor/comedian \n      Andy Dick AND Frank Caliendo as President George W. Bush... Plus, musical \n      guest Jarvis Cocker! \n\nTOMORROW ON THE SATURDAY EARLY SHOWTracy \n      Smith and Kelly Wallace anchor THE SATURDAY EARLY \n      SHOW from New York. Ira Joe Fisher will \n      bring us the weather. Along with the top \n      news of the day, we will also have the following stories: ROAD TO \n      THE WHITE HOUSE: In this Saturday's Road to the White House, we \n      will take a look at Senator John McCain's presidential campaign as he \n      officially entered the 2008 race earlier this week. Also, we'll discuss \n      the first presidential debate among the Democrats in South Carolina. Plus, \n      the GOP is now gearing up for their first debate next week! \n      HEALTHWATCH - WEIGHT LOSS DRINKS: You may have seen the ads \n      for a new category of drinks that promise to help you burn calories. But \n      is this a case of something sounding too good to be true? Health \n      magazine dietician Samantha Heller will take a critical look. \n      DEBIT CARD DANGERS: Bank debit cards are hugely popular -- \n      more people now use them than use credit cards. But they also have hidden \n      dangers, including unexpected charges that can pile up quickly and cost \n      you plenty. Greg McBride, senior financial analyst for Bankrate.com, joins \n      us from West Palm Beach, FL with tips on avoiding such charges. \n      PARENTING - SUMMER JOBS: Saturday morning, we'll have \n      advice on how to encourage your teenager to find a summer job. Executive \n      editor of Family Circle magazine Betty Wong will join us with not \n      only how to help your teen find a good summer job but a safe one as well. \n      LOOK FAB IN 5: Summer is almost here... Are you looking and \n      feeling fab? If not, we have some easy ways to look and feel better from \n      head to toe, in just 5 minutes. Fitness Magazine Editor-in-Chief \n      Denise Brody will show us how. CHEF ON A SHOESTRING: \n      Looking to give your classic American meals a twist? We will turn to chef \n      Ivy Stark of Amalia restaurant in New York to show us how to make an \n      American meal with Mediterranean flair on our shoestring budget of $40. \n      SECOND CUP CAFE: Up-and-coming rock/pop balladeer & \n      pianist Jon McLaughlin will perform songs from his new upcoming album \n      Indiana in our Second Cup Café. To look for our \n      fabulous recipes... Click Here If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: sat@cbsnews.com \n      \n\nHERE'S WHAT WE HAVE PLANNED FOR SUNDAY \n      MORNINGCHARLES OSGOOD ANCHORS FROM NEW \n      YORK ROYAL VISIT: With Queen Elizabeth II arriving \n      in the United States next week to celebrate the 400th anniversary of \n      Jamestown, Mark Phillips takes a closer look at the woman who has \n      been leading Britain's monarchy for more than 50 years. \n      CHANGING TIMES: Tennis legend Renee Richards, born Richard \n      Raskind, underwent a sex change operation in 1975 -- long before most \n      Americans were aware of transgender issues. Richards sits down with \n      Sunday Morning's Serena Altschul \n      to reflect on her double life. THE MOVIES: David Edelstein \n      gives us his take on Spiderman 3. IN THE MAIL: \n      Correspondent Daniel Sieberg has pointers on proper on-line \n      etiquette. BACK FROM BLINDNESS: Mike May was blinded at age \n      3 by a freak chemical explosion in his garage, but that has never stood in \n      his way. He's been an explorer and adventurer all his life, learning first \n      to ride a bike, then a horse, then to ski downhill...fast...winning 3 gold \n      medals in the 1982 Paralympics, and setting a new world record for the \n      blind. Married to a beautiful woman, with two lively boys and his own \n      business, his life was as full an exciting as any sighted person. Then, in \n      1999, he learned that through a revolutionary new stem cell surgery, he \n      might be able to see. John Blackstone brings us the story of Mike \n      May's odyssey into the sighted world, perhaps the greatest and riskiest \n      adventure he ever undertook. MO ROCCA: Sunday \n      Morning Commentator Mo Rocca reflects \n      on his role in the Broadway hit The 25th Annual Putnam County Spelling \n      Bee. BAGHDAD ZOO: Back in 2003, Lawrence Anthony was \n      watching coverage of the Iraq War on TV, when he realized he had to do \n      something to help. He knew people were dying, but as a wildlife \n      conservationist, he was also concerned about the animals in the Baghdad \n      Zoo-the biggest in the Middle East-and he felt compelled to help them. \n      More often than not the news out of Baghdad is bad news- but correspondent \n      Randall Pinkston's uplifting report on one man's efforts to rescue \n      the Baghdad Zoo is an exception. If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: sundays@cbsnews.com \n      \n\nSUNDAY ON FACE THE \n      NATION Bob Schieffer moderates...This week Face the \n      Nation with Bob Schieffer is going to \n      look at the battle over Iraq war funding. The House and Senate have passed \n      bills that call for a troop withdrawal -- President Bush says he's going \n      to veto that bill next week. Then what's going to happen? We'll ask \n      Secretary of State Condoleezza Rice and then, one of the war's biggest \n      critics, Congressman John Murtha, Democrat of Illinois. We'll also talk \n      about some of the explosive elements in the new book by former CIA head \n      George Tenet. We'll talk about the political events of the week with Roger \n      Simon of Politico.com. There will be, as always, a final word. That's all \n      on Face the Nation, this Sunday. \n\nSUNDAY ON 60 MINUTESAT THE CENTER OF \n      THE STORM: Ex-CIA Director George Tenet appears in his first \n      network television interview to talk about what it was like as the head of \n      the security agency during 9/11, the war on terror and the hunt for Osama \n      bin Laden. He also says that the Bush Administration acted dishonorably \n      when it used his famous \"slam dunk\" remark about WMD in Iraq to ruin his \n      reputation and his career. ARMED AND DANGEROUS: Should \n      someone who has been deemed an imminent danger to himself, like Virginia \n      Tech shooter Seung Hui Cho, be allowed to own a gun? The law says no, but \n      advocates for the mentally ill say yes. Steve Kroft reports. \n\nMONDAY MORNING ON THE \n      EARLY SHOWHarry Smith, Hannah \n      Storm, and Russ Mitchell anchor THE EARLY \n      SHOW from New York. Julie Chen anchors \n      from Los Angeles. Dave Price will bring us the weather. \n      Along with the top news of the day, we will also have the \n      following stories: ARE YOU AT RISK?: UNDERINFLATED \n      TIRES: Car crashes are responsible for countless deaths and injuries. \n      One of the reasons for crashes is actually something that you can prevent \n      at your nearest gas station or at home. Underinflated tires. Low tire \n      pressure may be making your morning commute more treacherous than you \n      think. So how can you prevent deflated wheels and keep dangerous accidents \n      from occurring? EARLY SHOW Consumer \n      Correspondent Susan Koeppen will join us to demonstrate the things \n      you can do to protect yourself in your automobile. PERFECT \n      PARENTING: ENDING THE FOOD FIGHT: Dr. David Ludwig was one of the \n      first to use the glycemic index to combat obesity. His approach and \n      research provided the framework for some of the more popular diets today. \n      Now, Dr. Ludwig is bringing the low-glycemic program he developed at \n      Children's Hospital Boston and tailored to children nearly ten years ago \n      to the masses. His book, Ending the Food Fight, is a guide for \n      parents and children that provides a plan to combat obesity and offers \n      hope in today's fast food/fake food world. WITHOUT A TRACE: \n      If you watched Without A Trace on CBS Sunday night, you saw that \n      Deysi Marleen Benitez was named this week's missing person. Benitez was \n      last seen outside of her residence in Frederick, Maryland, on the evening \n      of March 18. A week and a half later, her four children and husband were \n      all found deceased in their home. What happened to Deysi Benitez? Monday \n      morning, CBS News Correspondent Thalia Assuras will take a look at \n      the story behind her bizarre disappearance. SUMMER MOVIE \n      PREVIEW: Summer is Hollywood's busiest time of year, with close to 130 \n      films being released by Labor Day alone. EARLY \n      SHOW Entertainment Contributor and \n      People Magazine Assistant Managing Editor Jess Cagle will \n      join us with a preview of the some of the biggest blockbusters that you \n      won't want to miss! AMAZING RACE: ALL STARS CASTOFFS: The \n      race heats up! Monday morning, we will talk to the latest Amazing \n      Race team castoff to be voted off the Amazing Race: All Stars \n      season. We'll have a recap of Sunday's episode and talk to the castoffs \n      about what really went wrong. HARLAN COBEN'S THE WOODS: \n      Author Harlan Coben has captivated readers and catapulted to the top of \n      best-seller lists with his tales of ordinary people trying to overcome \n      extraordinary circumstances. His latest book, The Woods, centers on \n      a man struggling to balance family life and a busy career when his \n      complicated past suddenly comes back to haunt him. Monday morning, the \n      author will join us to discuss his latest and the inspiration for his \n      prolific stories. WEDDING RECAP: We recap our week-long \n      Wedding in a Week preparations for our now married couple Lisa and \n      Stephen! See more of what went into pulling off the beautiful ceremony. \n      And, a special surprise for the newlyweds! CSI MIAMI \n      PREVIEW: Monday morning we kick off CSI week with a look at the \n      most popular show in the world. It may be called CSI: Miami, but \n      thanks to Hollywood magic the show normally shoots in California. Several \n      times a year they go on location to it's namesake city. And in Miami is \n      where EARLY SHOW National Correspondent \n      Tracy Smith caught up with the show's cast. We'll have a preview of \n      Monday night's episode. If you would like more information on any \n      of these stories or the broadcast, please click on the following address \n      and e-mail us: earlyshow@cbs.com \n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}