{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Ombudsman Jujitsu", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nAn Ombudsman \n      Find A Balance In the roughly two years that I've written \n      and edited Public Eye, I've gained some insight into the thought process \n      of an ombudsman. Sure, sure, we're \"nonbudsman,\" more or less, here at PE. \n      But this job involves the same kinds of concerns that a traditional \n      ombudsman faces. You've got to be critical enough to maintain your \n      legitimacy in the eyes of readers, but not so critical that you \n      alienate your colleagues. It's a balancing act, and, unfortunately, it can \n      lead one to think twice before writing anything that might be considered \n      either (1) too complimentary or (2) too critical, even when the situation \n      calls for it.[+ Read More]\n\nFrom \n      The Vault: \"Black Power, White Backlash\"In this week's \n      edition of \"From The Vault,\" we bring you \"Black Power, White Backlash,\" \n      an episode of CBS Reports hosted by a young Mike Wallace that aired on \n      September 27, 1966.[+ Read More]\n\nThe \n      Eyes Of NewtThe between-the-lines charge in this AP piece is that Gingrich is \n      essentially getting paid off to promote certain views. More than most \n      politicians, Gingrich has a reputation in Washington as a thinker, a man \n      bursting with ideas about how better to govern the country. That's why \n      this piece hits close to home: It charges that Gingrich's greatest asset – \n      his intellectual seriousness – is a sham. [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nScared \n      Yet?\n \nA \n      Matrix of Metrics\n \nRise \n      Of The Religious Left?\n       \n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}