{"category": "ham", "to_address": "seatec <seatec-astronomy@gmx.de>", "from_address": "\"Christopher R. Hertel\" <crh@ubiqx.mn.org>", "subject": "Re: win2k3 to win98", "body": "seatec wrote:\n> Hi Chris,\n> \n> thanks for your reply. When I first read it I thought \"he wants me to\n> rtfm. great reply\". I have (and also read) your book and done my fare\n> share of basic cifs auth coding. I know the davenport site, but I didnt\n> know the ms link. That one was nice, and finally helped me find the\n> solution.\n\nWell...  From your message I didn't see that you were clear on the\ndistinctions between the hash types and I thought you might want/need to\nread that material.  I'm glad the ms link was useful.\n\n> Where winxp(and earlier) uses the plaintext --(DES)--> LM hash\n> --(DES)--> Ntlm hash scheme, Win2k3 uses the passwords md4 hash\n> --(DES)--> Ntlm hash. So the first step is different, the second is not.\n\nI'd like to get a clearer explanation here.  The NTLM hash is never created\nusing DES.  It is always done using MD4.  Above, you have the NTLM has being\nderived from the LM hash.  Do you mean the NTLM response?  What you have\nthere doesn't describe any scheme I know.\n\n> What really confused me is that winxp and win2k3 sent exactly the same\n> packet, but a different password hash, and both actually worked.\n\nThe password hash is *never* sent.  The information sent to the server is\nthe encryption of the challenge (called the \"response\").  On older systems,\nthe first field is typically the LM response (the challenge encrypted using\nthe LM hash) and the second field is typically the NTLM response (the\nchallenge encrypted using the NTLM hash).\n\nIn some cases (if the client has been configured to not send the LM\nresponse) the first and second field will both contain the NTLM response.\n\nIf more advanced authorization is required, then the client will send the\nLMv2 response in the first field and the (very large) NTLMv2 response in the\nsecond field.\n\nBeyond that we get into \"Extended Security\" which is probably beyond what\nyou are trying to work on.\n\n> Thanks for pointing that ms link out to me. It's sunday night and I\n> spent many hours on this problem this weekend. Seeing it solved before\n> the time ran out(too busy during the week) made my day(well, night).\n\nHope it helps.\n\nChris -)-----\n\n-- \n\"Implementing CIFS - the Common Internet FileSystem\" ISBN: 013047116X\nSamba Team -- http://www.samba.org/     -)-----   Christopher R. Hertel\njCIFS Team -- http://jcifs.samba.org/   -)-----   ubiqx development, uninq.\nubiqx Team -- http://www.ubiqx.org/     -)-----   crh@ubiqx.mn.org\nOnLineBook -- http://ubiqx.org/cifs/    -)-----   crh@ubiqx.org\n\n"}