{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Computers & Electronics Newsletter June 28, 2007", "body": "June 28, 2007 \nRSS | \ncomputers & electronicsThis Week's Highlights: \nHow Geocaching WorksHow GPS Works\nHow Wireless Power Works\nHow Municipal WiFi WorksHow Electric Motors Work\n\n \nIs it better to turn my computer off when I am not using it or leave it on all \nthe time?  This is one of those questions where there is no single right answer. In other \nwords, it depends on how you use your computer. Read why shutting it off when not being used could save you money.    This week's trivia question:How many GPS satellites are in the Earth's orbit? \nFind out   \n \nHow Geocaching Works - Thousands of people around the world use their GPS receivers to geocache, or seek out treasures hidden by other players while checking out interesting locations. Explore the history of geocaching and learn how to find and place geocaches of your own.   \n   This week's video:How GPS Works\n - Have you ever wondered how a global positioning system receiver can pinpoint your location? As long as you have a GPS receiver and a clear view of the sky, you'll never be lost again.  See how GPS works in this HowStuffWorks video. \n     Also at HowStuffWorks:\n \nHow Municipal WiFi Works - Learn about the amazing things that these networks can do -- besides potentially providing free or cheap Internet access, about the technology behind them and why \"Municipal WiFi\" can be a misnomer. \n \nHow Wireless Power Works - Unless you are particularly organized and good with tie wrap, you probably have a few dusty power cord tangles around your home. Find out how methods of wireless power transmission could cut the clutter or lead to clean sources of electricity. \n \nHow Electric Motors Work - You might be surprised to find out just how much work is done by electric motors. You'll find them in your kitchen, bathroom and office...and that's just the beginning. Learn all about makes electric motors tick. \n  \n  Coming Soon: -Virtual Reality Content-recognition Software \n  \n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved"}