{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "robert weissman <rob@essential.org>", "subject": "[Ip-health] Abbott Fund Increases Commitment to Fight Against HIV/AIDS in Tanzania,\n Opening Country's First Corporate Foundation Office]", "body": "Abbott Fund Increases Commitment to Fight Against HIV/AIDS in Tanzania,\nOpening Country's First Corporate Foundation Office\n\nDAR ES SALAAM, Tanzania, May 29 /PRNewswire/ -- Further deepening its commitment to the fight against HIV/AIDS in Africa, Abbott Fund announced today that it is opening a new program office in Tanzania to manage its extensive HIV/AIDS philanthropic efforts and partnerships there.  Abbott Fund also recently awarded several new HIV grants totaling $9 million, bringing the Fund's total HIV investment in the country to more than $50 million by the end of 2007.\n\nThe new Abbott Fund office, located in the capital city of Dar es Salaam, is the first and only corporate foundation office in Tanzania and Abbott Fund's first office outside of the foundation's Chicago-area headquarters. Under the leadership of Christy Wistar, vice president, Abbott Fund, this new office will work to identify and fund innovative approaches to respond to the AIDS pandemic.\n\n\"Being part of the community provides a fuller appreciation of the overwhelming burden HIV/AIDS puts on the healthcare system,\" said Wistar. \"This firsthand and personal understanding enables us to develop practical solutions that are grounded in the realities of daily life in Tanzania, where transportation, food, and electricity can be significant barriers to treating patients,\" said Wistar.\n\nHaving a presence in the country will enable Abbott and Abbott Fund to further expand their long-standing partnership with the Government of Tanzania to help manage and treat the 2 million people currently living with HIV throughout Tanzania. In one of the most comprehensive efforts in Africa, Abbott Fund has been working in partnership with the Government of Tanzania for more than seven years to strengthen the country's health care system to meet the lifelong treatment needs of people with HIV.  These programs have served more than 150,000 patients and families, and have trained more than 10,000 health care workers.\n\nThrough this partnership, Abbott Fund and the Government have strengthened and expanded HIV services at more than half of the country's regional hospitals and at many district hospitals, health centers and dispensaries -- covering more than 90 sites across the country.  At the nation's largest hospital and referral center, Muhimbili National Hospital, Abbott Fund built a state-of-the-art outpatient treatment center and a full-service clinical laboratory.  This hospital serves nearly 1,000 patients suffering from HIV/AIDS and other chronic diseases each day.  Abbott Fund Tanzania implements these and other HIV/AIDS programs through partnerships with Axios Foundation, and new grantees, Elizabeth Glaser Pediatric AIDS Foundation and Family Health International.\n\n\"On behalf of the Government and people of Tanzania, we're delighted that Abbott Fund is establishing a strong in-country presence,\" said David Mwakyusa, Tanzania's Minister of Health and Social Welfare.  \"Our partnership has been instrumental in expanding access to HIV testing, treatment and care for thousands of Tanzanians.  By investing in our medical and laboratory facilities, training health workers, and building our hospital management capacity, Abbott Fund is helping the government strengthen our core health care system.  Together, we're making a significant difference in the lives of thousands of patients.\"\n\nGlobally, Abbott Fund's HIV programs have served more than 600,000 people. More than 250,000 patients have been tested through Abbott Fund-supported voluntary counseling and testing programs, with thousands being referred to HIV treatment programs.  Abbott has also distributed more than five million free rapid HIV tests and sponsored events to train more than 20,000 health care workers, increasing the capacity of health care workers to diagnose, treat and support HIV/AIDS patients.\n\nAbout Abbott and Abbott Fund\n\nAbbott (NYSE:ABT) has a long history of supporting programs dedicated to expanding access to health care, including the care and treatment of children with HIV/AIDS around the world.  Abbott and Abbott Fund have invested more than $100 million to address critical HIV/AIDS issues throughout Africa and the developing world.  Programs focus on expanding access to testing and treatment; preventing mother-to-child transmission of HIV; modernizing health care systems and infrastructure; and providing care and support for children affected by HIV/AIDS.\n\nAbbott Fund is a philanthropic foundation established by Abbott, the global health care company, in 1951.  The Fund's vision is to create healthier global communities by investing in creative ideas that promote science, expand health care and strengthen communities worldwide.\n\nAbbott is a global, broad-based health care company devoted to the discovery, development, manufacture and marketing of pharmaceuticals and medical products, including nutritionals, devices and diagnostics.  The company employs 65,000 people and markets its products in more than 130 countries.\n\nFor more information about Abbott, visit http://www.abbott.com/.  For more information on Abbott Fund's HIV/AIDS programs, please visit http://abbottglobalcare.org/.\n\nFirst Call Analyst:\nFCMN Contact:\n\n\nSource: Abbott\n\n\nCONTACT:  Ann Fahey-Widman of Abbott, +1-847-938-6388\n\nWeb site:  http://www.abbott.com/\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}