{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "Sir Boner <SirBoner@bigenginemen.com>", "subject": "SEXUALLY-EXPLICIT: Sir Boner Drill Tight Black HOLES gnitpick!", "body": "\n\nHuge Meat in Tiny Hole gnitpick 06/08/2007 00:27:04\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMassive Man Meat in Action for $1, gnitpick!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHow Deep Can Petite Sized Ladies Take It in?\n\nShort Profession Jokes\nWhat is the difference between Mechanical Engineers and Civil Engineers?\nMechanical Engineers build weapons, Civil Engineers build targets.\nWhat's an insolvency practitioner?\nSomeone who arrives after the battle and bayonets all the wounded.\nWhy did the auditor cross the road?\nBecause he looked in the file and that's what they did last year.\nWhat do accountants suffer from that ordinary people don't?\nDepreciation.\nWhat does it mean when the Post Office flies the American Flag half mast?\nThey're hiring!\nWhat is the definition of an engineer?\nSomeone who solves a problem you didn't know you had, in a way you don't understand.\nWhen does a person decide to become an engineer?\nWhen he realizes he doesn't have the charisma to be an undertaker.\nHow do you drive an engineer completely insane?\nTie him to a chair, stand in front of him, and fold up a road map the wrong way.\nWhat's an extroverted accountant?\nOne who looks at your shoes while he's talking to you instead of his own.\nDid you hear the one about the man who opened a dry-cleaning business next door to the convent? \nHe knocked on the door and asked the Mother Superior if she had any dirty habits.\nWhat does an accountant do for birth control?\nHe talks about his business.\nWhat do engineers use for birth control?\nTheir personalities.\nHow can you tell an extroverted engineer?\nWhen he talks to you, he looks at your shoes instead of his own.\nWhy did the engineers cross the road?\nBecause they looked in the file and that's what they did last year.\nWhat do you call an Amish guy with his hand up a horses ass? \nMechanic.\nWhy did the furniture salesman take six backless chairs to the doctor's office?\nBecause the doctor wanted to get a stool sample.\nA woman walked up to the manager of a department store. \"Are you hiring any help?\" she asked.\n\"No,\" he said. \"We already have all the staff we need.\"\n\"Then would you mind getting someone to wait on me?\" she asked.\n\n\n\n\n\n \n\n\n\n\n\n"}