{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Morning HTML\" <cbsnews_weekday_morning_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 13, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESKey Iraqi Shiite Shrine Bombed Again\nThe holy Golden Dome shrine has again been seriously damaged by suspected Sunni bombers, prompting Iraq's leader to enact\n                        a curfew in Baghdad over fears of a new wave of sectarian killing. A 2006 bombing of the same shrine sparked enduring violence. More...Watch: Troops Surge Despite Loss\n• Missing Soldier In Texas Found Dead• Indonesia Nabs Top Terror Leader• Hamas Appears To Be Winning Civil War\n                     \t\t\t\t\t| WatchU.S.Missing Soldier In Texas Found Dead\nArmy investigators at Fort Hood were trying to piece together how an experienced soldier died after disappearing during a\n                        training exercise and remaining missing for four days. Sgt. Lawrence G. Sprader, 25, returned from Iraq in September. More...\n• Illegal Worker Probe Spurs Raid In Oregon• Duke Lacrosse DA Ethics Trial Begins\n                     \t\t\t\t\t| Watch• O.J.'s Daughter Ordered To Testify\n                     \t\t\t\t\t| Watch• More StoriesWorldIndonesia Nabs Top Terror Leader\nIndonesian police have captured the alleged leader of the most feared terror group operating in the country, shooting him\n                        in the leg and arresting him during a weekend raid. Abu Dujana is thought to have close ties to al Qaeda and Osama bin Laden. More...\n• Key Iraqi Shiite Shrine Bombed Again\n                     \t\t\t\t\t| Watch• Hamas Appears To Be Winning Civil War\n                     \t\t\t\t\t| Watch• US: \"Irrefutable\" Proof Iran Arms Taliban• More StoriesPoliticsDoes Thompson Want To Be President? \"Yes\"\nAsked by Jay Leno on \"The Tonight Show\" if he'd like the nation's top job, former Republican Sen. Fred Thompson of Tennessee\n                        said, \"I've never craved the job of president, but I want to do some things that only a president can do.\" More...\n• Bush Presses GOP On Immigration\n                     \t\t\t\t\t| Watch• Clinton Gets Campaign Link To Latinos\n                     \t\t\t\t\t| Watch• Poll: Most Republicans Reject Evolution• More StoriesHealthFDA: Diet Drug May Spur Suicidal Behavior\nRegulators say Sanofi-Aventis' obesity treatment Acomplia may trigger suicidal behavior and other psychological side effects\n                        in some patients. More...Watch: Rimonabant: New Diet Drug\n• Patients School Doctors In Manners• E-Mails Imply TB Patient's Dad Unhelpful• The Art Of Aging Gracefully• More StoriesSciTechHurricane Satellite Worrying Forecasters\nHow long can it keep up the good work?  A satellite crucial to predictions on the intensity and path of hurricanes, scientists\n                        say, is already past its designed expiration date.  A replacement's not expected for years. More...\n• House Panel Probes \"Poisoned Patriots\"\n                     \t\t\t\t\t| Watch• The Space Station Gets Its (Solar) Wings\n                     \t\t\t\t\t| Watch• Deaf Dolphin Gives Birth In Florida\n                     \t\t\t\t\t| Watch• More StoriesBusinessFederal Deficit Continues To Drop\nThe federal deficit has dropped by a third from last year, leading the Congressional Budget Office to predict that the budget\n                        year could close with the lowest deficit in four years.  More...\n• Many Baby Boomers Plan To Retire Late\n                     \t\t\t\t\t| Watch• Auto Industry Plays The Safety Card\n                     \t\t\t\t\t| Watch• Four Inexpensive, Easy Home Improvements• More StoriesEntertainmentTV's \"Mr. Wizard\" Dies At 89\nDon Herbert, whose television shows introduced generations of kids to science, died Tuesday after battling bone cancer. \n                         More...\n• Mom And Dad Visit Paris In Jail\n                     \t\t\t\t\t| Watch• O.J.'s Daughter Ordered To Testify\n                     \t\t\t\t\t| Watch• CBS Chief: Rather Comments Were \"Sexist\"• More StoriesOpinionPardon Libby? Pardon Me!\nIf the rich and famous get special treatment, wonders Special Contributor Lloyd Garver, does that mean all the\n                        rich and famous get it? If Scooter Libby gets a break, why not Paris Hilton? More...\n• Garbage In, Garbage Out• Baghdad Security Plan A Success\n                     \t\t\t\t\t| Watch• A Hidden Assault On Liberties\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Books: Diana: The Untold Story\nAuthor Tina Brown's \"Diana Chronicles\" reveals unknowns about the princess, putting her life in perspective from childhood\n                        through her tragic death. Brown discussed details on The Early Show. More...\n• EARLY SHOW: Miracle Surgery Mends Cambodian Orphan• EARLY SHOW: Make Your Green Thumb Greener• 48 Hours: Caught In The Crossfire\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nIs Bush A Lame Duck?CBS News senior political correspondent Jeff Greenfield speaks with Russ Mitchell about President Bush's recent failed attempt\n                                    to push his immigration reform bill on Capitol Hill.\nTOP VIDEOS\nDivided On Immigration Bill\nShiite Shrine Bombed In Iraq\nMoneyWatch\nHealthWatch\nSelling Immigration Reform\nBattle For Gaza\nNifong's Day In Court\nEye To Eye: Litvinenko Murder\nRacism Cited In Health Care\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesLesley Stahl profiles Internet tycoon Barry Diller. This Sunday, 7 p.m. ET/PT.48 Hours MysteryDark Voyage:An aspiring actress dies under mysterious circumstances. Bill Lagattuta reports Saturday at\n                           8 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}