{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "jamesrh <jamesrh@gmail.com>", "subject": "Re: [R] heatmap and phylogram / dendogram ploting problem,\n\tape package", "body": "Emmanuel Paradis, the maintainer of the ape package was very helpful\nin solving this problem.  It seems that it heatmap does not reorder\nthe rows, so you must reorder them or change the heatmap code to do\nso.  The heatmap maintainers will document this, but not change the\nbehavior.  The following fix works for me:\n\n> On 4/30/07,  Emmanuel wrote:\n> . . . Thanks for your interesting case study. I found out that, apparently,\n> your problem comes from a bug in heatmap: it assumes that the row names\n> of the matrix are in the same order than the labels of the dendrogram.\n> In your case, the following fix seems to work. You have to edit heatmap\n> with fix(heatmap), find the line:\n>\n>     x <- x[rowInd, colInd]\n>\n> and change it for:\n>\n>     x <- x[labels(ddr)[rowInd], colInd]\n>\n> I think this will not solve the problem in all cases. . .\n\n\n> On 4/24/07, jamesrh  wrote:\n> > I am having trouble displaying a dendrogram of evolutionary\n> > relationships (a phylogram imported from the ape package) as the\n> > vertical component of a heatmap, but keeping the hierarchical\n> > clustering of the horizontal component.  The relationships of the\n> > vertical component in the generated heatmap are not that of the\n> > dendrogram, although the ordering is.\n> >\n> > In more detail, I am attempting to generate a heatmap from a table\n> > that contains the abundance of different bacteria at different\n> > locations, with a dendrogram that groups the\n> > environments by the pattern of bacterial abundance.  This is easy, thanks\n> > to a nice code snippet at the R Graph Gallery\n> > (http://addictedtor.free.fr/graphiques/RGraphGallery.php?graph=66):\n> >\n> > env <- read.table(\"env.dat\")\n> > x  <- as.matrix(env)\n> > hv <- heatmap(x, col = cm.colors(256), scale=\"none\",\n> >               xlab = \"Environments\", ylab= \"Species\",\n> >               main = \"heatmap of species present in environments\")\n> >\n> > However, instead of a dendrogram that groups the rows (vertical axis)\n> > by the abundance pattern (as above), I would like to force it to order\n> > and display a dendrogram\n> > indicating their evolutionary relatedness.  I am using the excellent ape\n> > package (http://cran.r-project.org/src/contrib/Descriptions/ape.html) to\n> > import the evolutionary dendrograms.  I have already manipulated the\n> > dendrogram to be ultrameric, with branches all the same length, to\n> > prevent an error, although I would prefer not to have to do so:\n> >\n> > library(ape)\n> > mytree <- read.tree(file = \"ultra.newick\", text = NULL, tree.names =\n> > NULL, skip = 0, comment.char = \"#\")\n> > #I then change them into a hclust:\n> > tree <- as.hclust(mytree)\n> > #and make this into a dendrogram\n> > dend <- as.dendrogram(tree)\n> >\n> > However, when I use this dendrogram as part of the heatmap, the\n> > relationships in the dendrogram that I'm loading are not preserved,\n> > although the order of bacteria in the heatmap changes:\n> >\n> > hv <- heatmap(x, col = cm.colors(256), scale=\"none\",\n> >         Rowv=dend, keep.dendro=TRUE,\n> >         xlab = \"Environments\", ylab= \"Species\",\n> >         main = \"heatmap of species present in environments\")\n> >\n> > Is there something obvious I am missing?  When I plot the hclust and\n> > dendrogram, they seem to preserve the relationships that I am attempting\n> > to show, but not when the dendrogram is used in the heatmap.  I'm not\n> > sure I really understand the datatype of R dendrogram objects, and this\n> > may be the source of my\n> > problems.  The heatmap documentation\n> > (http://addictedtor.free.fr/graphiques/help/index.html?pack=stats&alias=h\n> >eatmap&fun=heatmap.html) is somewhat opaque to someone with my programing\n> > skills.  Would it be better to reorder the heatmap and then somehow add\n> > in the dendrogram with add.expr command?\n> >\n> > If anyone could suggest something, or point me in the right direction I\n> > would greatly appreciate it.\n> >\n> >\n> >    jamesh\n> >\n> > Here are the contents of the two files used as examples above:\n> >\n> > env.dat:\n> > soil1 soil2 soil3 marine1 marine2 marine3\n> > One 23 24 26 0 0 0\n> > Two 43 43 43 3 6 8\n> > Three 56 78 45 23 45 56\n> > Four 6 6 3 34 56 34\n> > Five 2 17 12 76 45 65\n> >\n> >\n> >\n> >\n> > ultra.newick:\n> > (((One:1,Four:1):1,(Three:1,Two:1):1):1,Five:3):0.0;\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}