{"category": "ham", "to_address": "Yuchen Luo <realityrandom@gmail.com>", "from_address": "Duncan Murdoch <murdoch@stats.uwo.ca>", "subject": "Re: [R] Setting up a blank table with column names in the hard drive", "body": "On 23/06/2007 7:51 PM, Yuchen Luo wrote:\n> Dear Professor Murdoch.\n> Thank you so much! Your help is highly appreciated!\n\nPlease send replies to the mailing list.\n> \n> When I use the following commands, there is a blank cell before title \"name\"\n> in the resulting csv (excel) file. I am wondering how to get rid of it? I\n> want to get rid of it because when I write subsequent rows to the file, the\n> \"name\" part start from the beginning which is not aligned with the first\n> line of the column titles.\n\nThat's a place holder for the row names.  If you don't want it, specify \nrow.names=FALSE (and do the same when you write subsequent lines).\n\nDuncan Murdoch\n\n> \n> \" blank <- data.frame(name=character(0), wife=character(0),\n> no.children=numeric(0))\n> write.csv(blank, 'file.csv')\"\n> \n> Thank you for your help again and your time is highly appreciated!\n> \n> Best Wishes\n> Yuchen Luo\n> I\n> \n> \n> On 6/23/07, Duncan Murdoch  wrote:\n>> Yuchen Luo wrote:\n>>> Dear Friends.\n>>> Greetings!\n>>>\n>>> This should be a very common operation and I believe there should be a\n>> nice\n>>> way in R to handle it.  I couldn't find it in the manual or by searching\n>> on\n>>> line. I am wondering if I could ask for some help in this community.\n>>>\n>>>\n>>>\n>>> I am trying to record the results of my program to a csv file in the\n>> hard\n>>> drive so as to save memory space and also to read the results in excel\n>> after\n>>> running the program.  Every loop of my program will result in a list\n>> with\n>>> element belonging to different class. For example, things like\n>>>\n>>>\n>>>\n>>> a1 <- list(name=\"Fred\", wife=\"Mary\", no.children=3)\n>>> a2 <- list(name=\"Tom\", wife=\"Joy\", no.children=9)\n>>> a3 <- list(name=\"Paul\", wife=\"Alic\", no.children=5)\n>>>\n>>>\n>>>\n>>> I want the columns to have titles, in the example above, I want to see\n>> the\n>>> title \"name\", \"wife\" and \"no.children\" in the excel file.\n>>>\n>>>\n>>>\n>>> To set up the table in the csv file, I need to add at least one row in\n>> the\n>>> table up front. How ever, I do not have the first loop of the program\n>>> completed yet at that time. If I add a row that is meaningless, how may\n>> I\n>>> delete it after all the loops are completed and all the meaningful rows\n>> are\n>>> added to the table?\n>>>\n>>>\n>> I'd use data frames rather than plain lists for the results, so\n>> write.csv will work.\n>>\n>> Create a data frame with 0 rows, and write it out:  this will give you\n>> your header line.\n>>\n>> e.g.\n>>\n>>\n>>\n>> Now you can rbind new lines onto the data frame as you calculate new\n>> records and rewrite the whole thing, or just append them to the file\n>> with append=TRUE and writing with col.names=FALSE.\n>>\n>> Duncan Murdoch\n>>\n>>\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}