{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "Direct2Drive <owner-d2d_cp_announce_list@news.ign.com>", "subject": "Download Armed Assault from Direct2Drive Now!", "body": "\n\n\nDirect2Drive\n\n\n\n\n\n\n\n\nApril 20th, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCompany of Heroes - $39.95\nExperience the cinematic intensity and the courage and bravery of the heroes that defined a generation, set against the backdrop of the most dynamic battlefield ever seen in a game...\n \nCall of Duty Warchest - $39.95\nGet Call of Duty, Call of Duty: United Offensive, and Call of Duty 2 for one great price!... \n \nValue Zone Games\nGames for Less than $20 such as: Far Cry, Titan Quest, Sid Meiers Railroads! and many more!\n\n\n \n \n \n \n \n\n\nSupreme Commander - $39.95\nSet in the 37th century, Supreme Commander signals the next evolution in the RTS genre by being the first strategy game to deliver a truly strategic and tactical experience...\n \nHellboy Animated: Sword of Storms - $19.95\nEven if he can survive the perilous journey, how much crap does a guy have to put up with from the two most vengeful and ferocious spirits of Japanese legend?\n \nTest Drive Unlimited - $39.95\nThe ultimate automotive and lifestyle gaming experience, Test Drive Unlimited lets gamers race over more than 1000 miles of diverse, photo-realistic Hawaiian terrain with 90 licensed cars and bikes from the world?s most exclusive manufacturers.   \n\n\n \n \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\nCompany of Heroes\n$39.95\n6\n\n\nTitan Quest\n$19.95\n\n\n2\n\n\nSTALKER: Shadow of Chernobyl\n$39.95\n7\n\n\nThe Matrix Online\n$19.99\n\n\n3\n\n\nVanguard: Saga of Heroes\n$39.99\n8\n\n\n24 Season 6 Episode 20\n$1.99\n\n\n4\n\n\nSupreme Commander\n$39.95\n9\n\n\nTitan Quest Bundle\n$44.95\n\n\n5\n\n\nFar Cry\n$9.95\n10\n\n\nNeverwinter Nights 2\n$49.95\n\n\n\n\n\n\n\n\n\nTo Unsubscribe: Click Here.\n\t\t\t\nYou have received this e-mail because you are a registered user of GameSpy and have opted-in to receive GameSpy email updates concerning new products and services. If you believe you're receiving this e-mail in error or prefer not to receive promotions from GameSpy.com, reply to this message to opt out of future promotional mailings. Our privacy policy is viewable at http://corp.igngamespy.com/privacy.html. You may still receive other e-mails from GameSpy. To update your e-mail address or manage your account, visit GameSpyID.com. It may take up to 10 days for adjustments to your email preferences. If you have questions about this offer or your services, you can reach Customer Service here.\n\t\t\n\t\tYou may mail inquiries to: IGN Entertainment, Inc., 8000 Marina Boulevard, 2nd Floor, Brisbane, CA 94005\nCopyright © IGN Entertainment, Inc. All rights reserved.  \n\n\n\n\n\n\n\n\n\n\n\n\n"}