{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Report: U.S. investment in Iraqi reconstruction at risk", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApr 30, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nReport: U.S. investment in Iraqi reconstruction at risk\n\n\n\n\n\nPoor construction, improper design, substandard materials and lack of\nmaintenance have caused the failure of seven of eight U.S.-funded Iraq\nreconstruction projects that were recently reviewed by the special inspector\ngeneral for Iraq reconstruction, according to an inspector general report.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOfficials: Three shot dead at Missouri shopping center\n\n\n\n\n\nA gunman already suspected of wounding a police officer shot and killed two\npeople and wounded at least two others at a shopping center in Kansas City,\nMissouri, before being gunned down by police, authorities said Sunday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nStorm system crawls through Southwest\n\n\n\n\n\nForecasters predicted thunderstorms in the Southwest and a cold front in the\nPlains, while conditions in the Southeast were expected to remain dry on\nSunday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nMonday commute problems ahead after highway collapse\n\n\n\n\n\nA gasoline tanker crashed and burst into flames near the San Francisco-Oakland\nBay Bridge on Sunday, creating such intense heat that a stretch of highway\nmelted and collapsed. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudy: Minorities fare worse in traffic stops\n\n\n\n\n\nBlack, Hispanic and white drivers are equally likely to be pulled over by\npolice, but blacks and Hispanics are much more likely to be searched and\narrested, a federal study found.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDriver rescued from pond 2 days after SUV crash\n\n\n\n\n\nA badly hurt woman spent two days inside her partially submerged sport utility\nvehicle before a passing motorist spotted the wreck in a pond, authorities\nsaid.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe cost of educating border-crossing children\n\n\n\n\n\nThousands of Mexican children are flocking across the U.S. border to attend\nschool, sparking a debate in towns along the border over whether U.S.\ntaxpayers should have to bear the costs of educating them.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nLebanon war probe sparks cries for Israeli PM's resignation\n\n\n\n\n\nIsraeli Prime Minister Ehud Olmert faced strident calls for his resignation in\nthe wake of harsh findings of an official inquiry into his leadership during\nlast summer's costly but inconclusive war in Lebanon.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChavez: Cuban leader Fidel Castro is 'in charge'\n\n\n\n\n\nCuban President Fidel Castro is back \"in charge\" after undergoing intestinal\nsurgery in July, his friend and protege Venezuelan President Hugo Chavez said\non Sunday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRice: 'Slam dunk' comment didn't lead to war \n\n\n\n\n\nSecretary of State Condoleezza Rice on Sunday said the administration did not\nuse former CIA Director George Tenet's \"slam dunk\" comment as the reason to\ninvade Iraq, disputing his complaints.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOxfam urges World Bank's Wolfowitz to resign\n\n\n\n\n\nInternational development group Oxfam urged World Bank President Paul\nWolfowitz to step down in a letter on Sunday, saying his leadership had\n\"become untenable\" and the bank's poverty-fighting mission was already damaged\nby the crisis surrounding him.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nReaching for new highs\n\n\n\n\n\nInvestors took last week's surprisingly weak GDP report in stride, pushing the\nDow Jones industrial average to an all-time high regardless. But the week\nahead could test the market's mettle with a barrage of critical reads on the\neconomy.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFed's Yellen: Economy likely to 'pick up steam'\n\n\n\n\n\nThe U.S. economy grew modestly in the first quarter but should accelerate in\nthe second half of the year, though a downturn would have ripple effects\naround the world, San Francisco Federal Reserve President Janet Yellen said\nSaturday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nDon Banks: Second-day steals, controversial picks and more\n\n\n\n\n\nNEW YORK -- Musings, observations and the occasional insights from the two-day\npick-fest still taking place in Radio City Music Hall:\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCards pitcher Hancock killed in car wreck\n\n\n\n\n\nST. LOUIS (AP) -- The St. Louis Cardinals are mourning a teammate for the\nsecond time in five years, and it isn't any easier this time.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nBreak your kid's whining habit\n\n\n\n\n\nWhen it comes to torture, we could all learn a thing or two from kids. Who\nknows better than they how to extract most anything they want within minutes\nof applying the technique? I'm talking about whining, of course -- that\ngrating mewling that causes us to do anything (anything!) just to make it go\naway. But you can break the habit. And the rewards of victory can be rich for\nboth of you.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAddictive drugs harm brain's natural brake\n\n\n\n\n\nA single dose of morphine was found to lower the inhibitions of rats, even\nafter the drug had left their systems, a finding that may help scientists\nbetter understand addiction in humans, U.S. researchers say.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nSocial-networking sites link Hispanic youth\n\n\n\n\n\nIndie rocker Eric Monterrosa checks his ElHood.com Web page at least three\ntimes a day, answering fans, surfing for other new Latin artists and keeping\nin touch with friends from his native Colombia.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSchools say iPods becoming tool for cheaters\n\n\n\n\n\nBanning baseball caps during tests was obvious -- students were writing the\nanswers under the brim. Then, schools started banning cell phones, realizing\nstudents could text message the answers to each other.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nReview: 'Next'? Go to the back of the line\n\n\n\n\n\nEven when we haven't seen an action movie before, we've seen it before.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPeeping Tom film avoids Spidey's web\n\n\n\n\n\nMovie-goers continued to keep their eyes on the Peeping Tom thriller\n\"Disturbia,\" which fended off a weak batch of newcomers to remain No. 1 for\nthe third straight weekend with $9.1 million.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}