{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "Tonight on CNN <mailings@mail.cnn.com>", "subject": "Joey Buttafuoco & Amy Fisher Together Again?", "body": "\n\n\n\nTonight On CNN Email\n\n\n\n\n\n\n\nMay 23, 2007\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n9 p.m. ET\n\n\n \n\nLarry King Live:  Buttafuoco Saga Continues\n\n\nJoey Buttafuoco and Amy Fisher back together? Now Joey's ex-wife responds. More than 15 years after Amy shot her in the face -- Mary Jo speaks out. Watch tonight, 9 ET.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRelated:• E-Mail your questions to Mary Jo Buttafuoco\n\n\n\n\n\n\n\n \n \n\n\n\n\n\n \n\n\n\n\n6:00 a.m. ET\n\n\n \n\nAmerican Morning\n\n\nRising gas prices, extreme weather, even the price of corn are inflating your grocery bills. Find out why the high cost of living just got higher.\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n7:00 p.m. ET\n\n\n \n\nThe Situation Room\n\n\nPolitical pressure: The Democrats drop a troop withdraw deadline from the Iraq funding bill. Will they pay a political price in '08?\n\n\n\n\n\n\n\n8:00 p.m. ET\n\n\n \n\nPaula Zahn NOW\n\n\nIs the Pentagon turning our troops into gambling addicts? See the shocking truth about overseas military casinos in a special report.\n\n\n\n\n\n\n\n9:00 p.m. ET\n\n\n \n\nLarry King Live\n\n\nJoey Buttafuoco and Amy Fisher back together? Now Joey's ex wife responds. Nearly fifteen years to the day after Amy shot her in the face, Mary Jo speaks out.\n\n\n\n\n\n\n\n10:00 p.m. ET\n\n\n \n\nAnderson Cooper 360\n\n\nSee first-hand the devastating effects of climate change on our environment and wildlife. Exclusive access to billionaire Richard Branson's tour of the Canadian Arctic in a special report, \"Planet in Peril.\"\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n\nSend us your feedback >  |  CNN's full program schedule >  |  E–mail sign up >\n\n\n\n\n \n \n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network LP, LLLP.\nA Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us. \n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the Tonight on CNN list, click here. \n\n\n\n\n\n\n\n"}