{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "6p 5/11 Update: Tank repairs complete; shuttle cleared for rollout", "body": "\n\n\n\n\n6p 5/11 Update: Tank repairs complete; shuttle cleared for rollout\n\n\n\n=================================\n\nCBS NEWS Coverage of STS-117\n\nCBS NEWS STS-117 STATUS REPORT: 12\nPosted: 05:45 p.m. EDT, 05/11/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-10 (04/17/07): NASA managers reassess Williams' status, mission duration\n   SR-11 (04/26/07): Williams to return on Atlantis; Anderson moved up one flight\n   SR-12 (05/11/07): Hail damage repairs virtually complete; Atlantis, external tank cleared for rollout\n\n=================================\n\n05:45 p.m., 05/11/07, Update: Hail damage repair work virtually complete; Atlantis, external tank cleared for rollout\n\nThe shuttle Atlantis' hail-damaged external fuel tank has been repaired, NASA officials said today, clearing the shuttle for rollout to launch pad 39A next week. Blastoff on a long-delayed space station assembly mission is targeted for June 8.\n\n\"I'm really pleased to say we have effectively completed the repairs on the external tank,\" shuttle Program Manager Wayne Hale told reporters during a teleconference today. \"I think the team that worked on the external tank across the country, we're really proud of what they have done. ... It's just an outstanding effort on the parts of hundreds and hundreds of people.\"\n\nRollout to the launch pad is scheduled to begin at 4 a.m. on Wednesday, May 16. But launch Director Mike Leinbach said if work to tear down external tank scaffolding and other preparations go well, the trip to the pad could move up one day to Tuesday.\n\nNASA managers had hoped to launch Atlantis on mission STS-117, the first of five planned 2007 shuttle flights, March 15. But during a freak storm that thundered over the launch pad on Feb. 26, the shuttle's external tank was blasted by hail, suffering thousands of pits and gouges in its foam insulation. Wind gusts reached 62 knots and hail up to 1.5 inches in diameter was found at the pad.\n\nMost of the damage was restricted to the upper liquid oxygen section of Atlantis' tank. Only a handful of dings were found lower down on the hydrogen section and while two dozen heat shield tiles on the orbiter were scraped by hail that worked its way behind weather protection panels, detailed inspections show the ship's critical carbon composite wing leading edge panels and nose cap were undamaged.\n\nBut the hail damage to the foam on the top of the tank was severe and Atlantis had to be hauled off the pad and moved back to the Vehicle Assembly Building for repairs.\n\n\"I'll never forget the day of the hail storm itself and then the first time I saw the external tank in the VAB,\" Leinbach reflected today. \"I was really wondering if we were going to be able to fix this tank or not.\"\n\nJohn Chapman, external tank program manager at NASA's Marshall Space Flight Center in Huntsville, Ala., said today the hail storm caused more than 4,200 individual dings, dents, pits and gouges to the foam insulation.\n\nOf that total, between 1,400 and 1,500 were tightly clustered at the very tip of the tank near its carbon composite nose cap. Rather than make individual repairs in that area, a broad area of foam was sanded down to eliminate the pits and then filled in with sprayed-on insulation. That fresh insulation was then milled to the proper slope and to an acceptable thickness by a cleverly engineered \"pencil sharpener\" device that rotated about the top of the tank.\n\nOf the remaining damage sites, 449 were clustered together on the side of the oxygen tank and repaired with a second large-area spray. Another 1,038 pits and gouges were fixed using a pourable foam known as \"PDL\" and 889 dents were fixed by simply sanding them down using a \"sand-and-blend\" technique. Another 412 sites were so minor no repairs were required.\n\nTo make sure the required repairs could stand up to the aerodynamic and thermal rigors of launch, engineers re-assessed the flight performance of past PDL repairs, simulated damage sites using steel balls to impart hail-like crush forces and then subjected repairs to a hot-gas wind tunnel at Marshall.\n\n\"We were able to place simulated repairs in close proximity to each other to study the effect of multiple repairs, both side by side and downstream from each other,\" Chapman said. \"In fact, we even developed a drop test capability to be able to drop steel balls that would represent the amount of kinetic energy the hail stones would have ... and then put that into the hot-gas facility and see how it performs.\"\n\nThe goal, Hale said, was assurance no dangerous debris would fall off the tank during ascent.\n\n\"We have gone through an extensive set of tests and analyses with the repairs that have been done in these test facilities to ensure they won't release debris and all our testing today indicates that will not happen,\" he said.\n\nDuring the first 110 seconds of ascent, atmospheric friction raises the tank's temperature to some 650 degrees in some places and heating continues throughout the climb to space. Along with thermal concerns, foam debris falling off the tank could threaten a Columbia-type impact to Atlantis' heat shield.\n\n\"As you accelerate this vehicle supersonically in the lower atmosphere, you build up quite a bit of heat, several hundred degrees,\" Hale said. \"But you increase in temperature all the way up and even in second stage, when you are almost at orbital altitudes, you continue to put heat in.\n\n\"The point is, we have to protect both the thermal environment, in other words you cannot allow those temperatures to get to the aluminum-lithium substrate, which would weaken the metal, nor can you allow a significant amount of foam to come off,\" he said. \"The foam up in the forward part of the tank, because it does get that warm, does have an ablation process, so you lose at the molecular level small pieces of foam, but when we're talking about debris that can cause damage, again, the goal is not to have any of that. That's the kind of testing that was done at the hot-gas facility at Marshall to ensure these repairs don't liberate any significant amount of foam, even at the elevated temperatures.\"\n\nNo previous PDL repairs have ever failed in flight. While there is some slight additional risk flying the repaired tank, Hale said, it is not considered significant.\n\nThe hail storm, Chapman said, \"left the external tank team with a tremendous amount of work to do. This team has been essentially working 24/7 since the storm, doing engineering analysis, testing and repair of the tank. In my estimation, they have done a fantastic job. This has truly been unique. We've had hail damage before, but never to this magnitude.\"\n\nSaid Leinbach: \"The team has come through with flying colors and gotten a completely flight worthy tank put together. ... We are essentially done with all the repairs on the tank now.\"\n\nBut Chapman cautioned that shuttle watchers should be prepared for a somewhat strange-looking tank when Atlantis heads for the pad next week. The foam used for the large-area sprays and the PDL-type repairs is a much lighter color than the insulation sprayed on at the factory.\n\n\"Your mind will have a hard time convincing your eyes there are no surface discontinuities where you see changes in color,\" he said. \"It's very much like a car that has had body and fender work but hasn't had the primer sprayed on it yet. No matter how much you look at it and feel it after you've had that work done on a car, your eye has trouble recognizing the fact that it's going to be nice and smooth. And that's the situation we have with this tank. But I promise you, it's absolutely ready to go.\"\n\nLaunch is targeted for 7:37:56 p.m. on June 8. NASA plans to hold a two-day flight readiness review May 30 and 31 to assess the status of launch preparations and to set an official launch date. Assuming a rollout to the pad on May 16, engineers will only have three contingency days between then and June 8 to deal with unexpected problems.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}