{"category": "spam", "to_address": "\"mycah matthias\" <theorize@plg.uwaterloo.ca>", "from_address": "\"kara alexia\" <merrywestleigh@cox.net>", "subject": "ONCE IN A LIFETIME OPPORTUNITY", "body": "\n\n\n\n\n\n*** SUPER SHORT SQUEEZE REPORT ***Paivis \nCorp (OTCBB: PAVC) IS SHORT APPOX 10,500,000 SHARES.This is our first \nreport to publish in 18 months; it took us almost1 and a half years to find \nanother HUGE opportunity for our investment community.Paivis Corp \n(OTCBB: PAVC) has a short position of approximately 10million shares. The \nshorter sellers are expected to begin coveringduring the next 5 trading \nsessions very heavily. We expect this one to hit as high as 6.25 a share in \nthe next 5 trading sessions, asthese short positions are being covered. We \nsaw Paivis trading aslow as .18 last week as short sellers pounded the stock \nyet again.Now we are seeing it climb up to the .39 per share mark. \nOur first SQUEEZE trigger price of 1.05 is expected to be reachedas \nsoon as Thursday, and then Friday we should pull through thenext two squeeze \ntrigger prices of 1.41 and 1.63. When this happensit will cause the massive \nvolume spike and price increases as short sellers must cover their \npositions.PAVIS IS TRADING AT A HUGE DISCOUNT \\u2013 GET IN NOW!DO NOT \nLET THIS ONCE IN A LIFETIME OPPORTUNITY PASS YOU BY - GET INBEFORE THE \nSQUEEZE TRIGGER PRICE IS HIT AND SENDS THIS ONE THROUGH THE \nROOF!!!COMPANY SNAPSHOT--COMPANY NAME: Paivis CorpTICKER SYMBOL: \nPAVCEXCHANGE: OTCBBSHARES OUTSTANDING: 30,558,352FLOAT: \n18,970,000SHARES SHORT: 10,500,000 (APPROX)SQUEEZE TRIGGER PRICES: 1.05, \n1.41, and 1.63RECENT PRICE: 0.344-DAY TARGET: 6.25RECOMMENDATION: \nSTRONG BUY UP TO 4.25We are expecting this stock to literally jump by \n2,000% - 3000% inthe short term.DISCLAIMER: Information within the \nSuper Short Squeeze Report contains \"forward looking statements\" within the \nmeaning of Section27a of the Securities act of 1933 and Section 21B of the \nSecuritiesexchange act of 1934. Any statements that express or \ninvolvediscussions with respect to predictions, expectations, beliefs, \nplans, projections, objectives, goals, assumptions or future eventsor \nperformance are not statements of historical fact and may be\"forward looking \nstatements.\" Forward looking statements are basedon expectations, estimates \nand projections at the time thestatements are made that involve a number of \nrisks anduncertainties which could cause actual results or events to \ndiffermaterially from those presently anticipated. The publisher of this \nnewsletter does not represent that the information contained inthis \nmessage states all material facts or does not omit a materialfact necessary \nto make the statements therein not misleading. Allinformation provided \nwithin this email pertaining to investing, stocks, securities must be \nunderstood as information provided andnot investment advice. The publisher \nof this newsletter advises allreaders and subscribers to seek advice from a \nregisteredprofessional securities representative before deciding to trade in \nstocks featured within this email. None of the material within \nthisreport shall be construed as any kind of investment advice or \nofferto sell or solicitation of an offer to buy securities. Many ofthese \ncompanies are on the verge of bankruptcy. You can lose all your money by \ninvesting in this stock. The publisher of thisnewsletter is not a registered \ninvestment advisor. Subscribersshould not view information herein as legal, \ntax, accounting orinvestment advice. Any reference to past performance(s) of \ncompanies is specially selected to be referenced based on thefavorable \nperformance of these companies. You would need perfecttiming to achieve the \nresults in the examples given. There can beno assurance of that happening. \nRemember, as always, past performance is never indicative of future results \nand a thoroughdue diligence effort, including a review of a company's \nfilingswhen available, should be completed prior to investing. \nIncompliance with the Securities act of 1933, Section 17(b), the \npublisher of this newsletter discloses they received payment froman \nunaffiliated third party for the circulation of this report inthe amount of \nsixty thousand dollars. Be aware of an inherentconflict of interest \nresulting from such compensation due to the fact that this is a paid \nadvertisement and is not without bias. Allfactual information in this report \nwas gathered from publicsources, including but not limited to Company \nWebsites and CompanyPress Releases. The publisher of this newsletter \nbelieves this information to be reliable but can make no guarantee as to \nitsaccuracy or completeness. Use of the material within this \nemailconstitutes your acceptance of these terms. \n "}