{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Emma Whitaker\" <macccfmcdoc@ccfmc.net>", "subject": "You'll love the new, non-obese you", "body": "\nMake yourself more attractive to others\n\n\n\n\n\nAnatrim – The very up-to-date and most enchanting flesh loss product is now readily available – As told on BBC\n\n\n\nDid you understand that redundant body kilos kill a plenty of people around the whole world? We believe you hate the ugly look of people like those and the low status they have in modern society. \n\nMoreover, you’ve not the will to resist a pressure of ruinous eating habits of yours. If this all sounds familiar, then we got something for your consideration!\n\n\n\n\n\nHere there is Anatrim, the ultimate product for the elimination of your body’s extra weight. The most astounding thing is that Anatrim improves the quality of your life, repressing your feeling of hunger and giving you better cheer. Pay you attention to some e-mails from our customers:\n\n\n\n\n\n\"This is great! \n\n\nI stopped watching TV constantly and gorging any food close at hand \n\n\nI became more interested in doing exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I am in a great form now and there are lots of men around me!\"\n\n\n\n\n\n\nRita R., New York\n\n\n\n\n\n\n\"Passive weight losing was of little result to me. I was rather difficult for me to hold in my ravenous appetite. \n\n\nOne day I was told on Anatrim the media by and it brought a great influence on me.\n\n\n I had attempted taking it, and my wife told me I'm a different person now, 3 months later. \n\n\n27 pounds off and I keep still losing them! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nCharley Mock, San Diego\n\n\n\n\n\nAnatrim helps you to realize you got no such great need for the constant eating. It improves your spirit, supplies you with energy, and attacks needless kilos. Great thanks to its powerful distinguished formula!!\n\n\n\nPry out latest intelligence!\n\n\n\n"}