{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Mathew Morrison\" <hoqdartyluzmac@dartyluz.com>", "subject": "Join the thousands of people who got slim", "body": "\nSummer is coming, time to tone up\n\n\n\n\n\nAnatrim – The up-to-the-moment and most attracting flesh loss product is now available – As seen on ABC\n\n\n\nDid you understand that superfluous body kilos kill more and more people around the world? We know that you hate the unsightly look of people like those and the low status they have in society. \n\nMoreover, you can’t resist a pressure of fatal eating habits of yours. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nHere comes Anatrim, the ultimate product for the reduction of your body’s extra weight. The amazing thing about Anatrim is it raises the quality of your life, repressing the feeling of hunger and always cheering you up. Here you may read some notes received from our customers:\n\n\n\n\n\n\"This is amazing! \n\n\nI stopped gorging anything easy to reach and watching TV continually \n\n\nI became keen on doing exercise.\n\n\n\n\n\n\n Anatrim placed me back on the right path.\n\n\n I have a great shape now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nLinda F., Bellevue WA\n\n\n\n\n\n\n\"I tried some passive weight losing, you know, but almost with no result. I could not restrain my ravenous hunger. \n\n\nOne day I was told about Anatrim my very best friend by and I was really effected at the information.\n\n\n I had tried using it, and my wife said I'm a different person now, 5 months later. \n\n\n28 pounds have gone away and I continue to become slimmer! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nRikky Martin, Las Vegas\n\n\n\n\n\nAnatrim helps you to understand that your body doesn’t need that much food. It improves your mood, supplies you with additional energy, and attacks unnecessary kilos. All thanks to its mighty original formula!!\n\n\n\nFind out more about this great product now!\n\n\n\n"}