{"category": "spam", "to_address": null, "from_address": "\"AnYang Iron & Steel Incorporated\" <online603646@telkomsa.net>", "subject": "ACCOUNT KEEPER  NEEDED", "body": "\n\n\nAnYang Iron & Steel Incorporated\n1202 Huatong Mansion, Yong Ding Lane,\nWuxi, Jiangsu 214001\nChina\nDear Sir/Madam,\n\n                       ACCOUNT KEEPER  NEEDED\n\n\nAnYang Iron & Steel Incorporated principal activities are manufacturing\nand selling of steel, iron and steel/iron extended products. Other\nactivities include manufacturing and marketing of metallurgy products\nand byproducts, raw materials of metallurgy and chemical products. The\nCompany also undertakes the technological development, cooperation and\nadvisory.Major products include construction materials, moldings, board\nmaterials and pipe materials. The Company sells its products in the\nPeople's Republic of China, Europe, Southeast Asia, America,Hong Kong\nand Macau.\n\nNow our company has taken about one-sixth market share in China since\nits establishment in 1996. Today our products are widely used in the\nindustries such as electric power, petrochemical, coal, papermaking,\nrefinary, mining, cement, agriculture & husbandry, medical and\nscientific research, education, etc.\n\nNow we are looking for ACCOUNT RECEIVING OFFICER in America and\nEurope.The reason we seek your urgent asisstance is that most of our\ncustomers make payment in  cheques and  American and  Europe check\ntakes a longer time to clear here in China  thereby holding business\ndown for us and our business associates.\n\nSalary is based on percentage level.For every payment you receive from\nour customers on our behalf is 15% commission.You will also be\nreceiving 2.5% bonus annually for all payment receive through you to\nus.\n\nIf you are interested in this part time job offer please forward to us\nthe following information;\n1) Your Full names:\n2) Contact address:\n3) Home/office phone number:\n4) Occupation\n5) Age:\n6) Sex:\nNote:Forward your contact information to me through my private mail:\n anyangsteel1@yahoo.com.cn\nAlso note that you don't need to make any upfront payment for this Job\noffer and your bank account information is not needed too.\n\nYours Sincerely\nMr.Li Wenshan\nCEO AnYang Iron & Steel Incorporated\n\n"}