{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "\"Ujjwal Grover\" <ujj@tempostand.com>", "subject": "Re: [cc-community] Strayform - where artists and fans connect\n\ttofund and distribute new creative works", "body": "Hi Guys,\nWe are involved in a similar experiment in India. Its called\nTempoStand www.tempostand.com where we are using CC BY-SA. We had a\ntough time explaining people the importance of free music but we\nmanaged to impress over 30 bands. We will be soon releasing our first\nalbum, the first CC album in India. It will cover 8 artists and over\n1.5 hours of music. classical, sufi, ghazals and some instrumentals. We\nare recording music for free for these bands and they seem to be\nunderstanding the philosophy behind CC. \nTempoStand is also into merchandise, organising shows, selling music. I am sure strayform will do great. \n\nCheers,\nUjjwal Grover\n\nOn 5/20/07, drew Roberts <zotz@100jamz.com\n> wrote:\nOn Saturday 19 May 2007 09:52 pm, Christopher Budnick wrote:> > Thank you so much for the info. Do you know if they have any funding> > ideas / experiments going on? I would be happy to throw ideas around\n> > along those lines.>> Essentially the way we're handling it now is with allowing the bands> to handle a lot of the monetizing themselves. We release the music> ourselves through multitude venues (local stores which play the music\n> and give away or sell CDs, priority radio time set aside for free> music by college stations, distributed through our website and on> other review sites) and promote and hold shows for the bands under our\n> label. We have a small amount of seed money from successful shows> we've had and initial funding that I and a few others have provided.> With that we're pressing limited runs of vinyl and cd-rs to give to\n> the band for free. in turn, the band sells them at their shows and on> their website and keeps all of the money from any sales with no> obligation to pay us back. If they'd like more materials, we're happy\n> to order them, and this is just the first sort of experiment in how to> fund the creation of free music.>> The studio time is donated to us by college radio stations (they> obviously have a vested interest, both in charter and\n> self-preservation, in 'funding' free content) and the production is> taken care of by the recording artist, a tech at the station, or an> independent producer/company that has donated us time.\n>> We've been able to involve /a lot/ of larger named bands, partially as> we're curating music to be distributed with the first shipments of> OLPCs as part of their free content packages.\nThank you for this information. I will give it further thought.>> best> Christopher (typically a lurker)all the best,drew--(da idea man)_______________________________________________\ncc-community mailing listcc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}