{"category": "spam", "to_address": "<iplacereports@flax9.uwaterloo.ca>", "from_address": "\"JohnLansing@Investorplace.com\" <JohnLansing@Investorplace.com>", "subject": "Trade Talk Weekly June 5: Risky Business", "body": "\n\nTrade Talk Weekly Update\n\n\n\n\n\n\n\n\nJune 5, 2007\n“Risky Business”\nUntil now we have floated merrily along through a pretty placid market.   There have been minor fluctuations here and there but nothing truly significant.\nBut as summertime approaches and hurricane season gets closer, you can expect volatility to shoot up.\nIt is during this news-driven time that people’s fears will spike and our opportunities to profit will increase as well.   You see, any volatile downtrend that approaches gives us opportunities to invest — in the RIGHT stocks.\nI’m talking about the stocks that can buck the trend.   The ones that are set to profit no matter the market.\n\n\n\n\n\nKeep These Winners in Your Back Pocket\nI’ve carefully chosen a handful of stocks that I believe could be our next great buys.   Now isn’t the time to pounce.   I’ll repeat it for those of you in the back, not paying attention: Do NOT buy these stocks now.   Just keep them in your mind so that when the correction comes—and I still have the utmost confidence that it will—you and I can scoop them up for potential profits.\n\n\n\n\n\nI am concentrating on the energy sector because that is where we are seeing a very interesting story play out.\nYou see, back in 2006, the OIH (Oil Services Holders ETF) made new all-time highs—and my Trending123 subscribers and I called the top of the oil sector, shorted a slew of oil stocks, rode them down and covered at the lows.   Then we went long when every newsletter writer out there said to run for the hills in the energy sector, and we made even more money riding the stocks back up.\nNow, in 2007, the OIH has yet again made new all-time highs (as expected).   But something has changed from last year to this year.   What is different this time around?\n\nWell, last year, my most frequently updated index charts of the oil patch—the OIH, $EPX and $OOG—had the support of the underlying commodities when making new all time highs.   But this year, except for the XRB (unleaded gasoline futures index), they are making new highs without the commodities!\nDid you know that it significantly changes the risk when the very things these indexes track are not going up?   Last year, when they made new highs and put in an intermediate-term top, they at least had some pretty good reasons to go up:\n\nThey had the support of the actual underlying commodities making new highs.\nThe media had everyone convinced that 11 hurricanes in the gulf were coming.\nHedge fund managers were so long and strong the commodity that they also contributed to the push higher.\n\nSo again, I ask, what has changed from then to now?\nThe difference is that this time, they moved up on unleaded gas alone—and that just isn’t enough to make this dog want to hunt.   Just take a look:\n\nCommodityLast YearThis Year\nHO #F (Heating Oil)\nAt new highs, supporting the move in the OIHDown 70% from the highs\nCL #F (Crude Oil)\nAt new highs, supporting the move in the OIHDown $20 from the highs\nNG #F (Natural Gas)\nAt new highs, supporting the move in the OIHDown 80% from the highs\nXRB #F (Unleaded Gas)\nAt new highs, supporting the move in the OIHThe only commodity that made new highs\n\nAs you can see, unleaded gas is the only commodity that made new highs—in a stealth rally (as expected) that just happened to lift the entire sector (also as expected).\nBut that move is nearly over, and the lemmings who follow it are fixing to get smoked.\nI don’t want you to get caught up in this mess.   There are many stocks out there that are poisonous — they are losers — and will only serve to muck up your portfolio and your wallet!\nStay away for now.   When I give you the GO, then you can turn to the stocks that I mentioned above and together we can be on a smooth road to profits—when everyone else is stuck in the potholes!\nGet an even closer look at what the energy sector is serving up to us now — click here to try my Trending123 service at $50 off the regular price!\n\nSincerely,\n\nJohn LansingTrending123\n\nP.S. As soon as the correction hits, you’ll want to be on-board with Trending123!   I’ll be peppering my subscribers with updates and buy alerts.   If you’re ready to try an experienced trading service—one that can show you how to earn sudden profits—10%–30% gains (and sometimes higher) in a matter of weeks or even days, then I invite you to try Trending123 now.    You’ll get it for $50 OFF!\n\n\n\n\n\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you.   Please tell us if your email has changed by visiting here: http://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice from InvestorPlace advisors, you can let us know by visiting \nhttp://www.investorplace.com/u/?p=8FP127-1&e=iplacereports@speedy.uwaterloo.ca\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,2420A Gehman LaneLancaster, PA 17602\nCopyright © 2007 ACP Phillips Investment Resources, LLC.\nAll rights reserved.\n06/05/2007 8:05PM\n\nThank you for subscribing to InvestorPlace.com.   Please note that we cannot be liable for any missed bulletins caused by overzealous spam filters.   To ensure that you continue to receive this valuable part of your service please take a moment to add (JohnLansing@InvestorPlace.com) to your address book.   Click here for instructions:\nhttp://www.investorplace.com/whitelist.php?eml=JohnLansing@InvestorPlace.com\n\nee==8FP127\n\n\n\n\n\n\n"}