{"category": "ham", "to_address": "<adschai@optonline.net>", "from_address": "\"John Fox\" <jfox@mcmaster.ca>", "subject": "Re: [R] Fit sem model with intercept", "body": "Dear adschai,\n\nYou needn't look too far, since the last example in ?sem is for a model with\nan intercept. One would use the raw-moment matrix as input to sem(), either\nentered directly or calculated with the raw.moments() function in the sem\npackage. The row/column of the raw-moment matrix is given a name just like\nthe other columns. You could use the name \"1\"; in the example, the name is\n\"UNIT\".\n\nAs you say, however, you're using polychoric and polyserial correlations as\ninput. Since the origin and scale of the latent continuous variables\nunderlying the ordinal variables are entirely arbitrary, I can't imagine\nwhat the purpose of a model with an intercept would be, but it's possible\nthat I'm missing something. If you think that this makes some sense, then\nyou could convert the correlations to raw moments by using the means and\nstandard deviations of the observed variables along with the means and\nstandard deviations that you assign to the latent variables derived from the\nordinal variables (the latter on what basis I can't imagine, but I suppose\nyou could fix them to 0s and 1s).\n\nFinally, if the sem model that you show is meant to be a complete\nspecification, I notice that it includes no covariance components; moreover,\nif this is the complete structural part of the model, then I think it is\nunderidentified, and the two parts of the model (those involving eta1 and\neta2) appear entirely separate.\n\nI hope this helps,\n John\n\n--------------------------------\nJohn Fox\nDepartment of Sociology\nMcMaster University\nHamilton, Ontario\nCanada L8S 4M4\n905-525-9140x23604\nhttp://socserv.mcmaster.ca/jfox \n-------------------------------- \n\n> -----Original Message-----\n> From: r-help-bounces@stat.math.ethz.ch \n> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of \n> adschai@optonline.net\n> Sent: Sunday, April 15, 2007 4:28 AM\n> To: r-help@stat.math.ethz.ch\n> Subject: [R] Fit sem model with intercept\n> \n> Hi - I am trying to fit sem model with intercepts. Here is \n> what I have in my model.\n> \n> Exogeneous vars: x1 (continous), x2 (ordinal), x3 (ordinal), \n> x4(continuous) Endogeneous vars: y1 (continuous), y2 \n> (ordinal), y3 (ordinal)\n> \n> SEM model:\n>     x1 -> eta1; x2 -> eta1; x3 -> eta2; x4 -> eta2; eta1 -> \n> y1, eta1 -> y2, eta2 -> y2, eta2 -> y3 \n> \n> However, in these arrow models, I don't know how to add \n> intercept onto it. I am trying to find an example code using \n> sem package on how to incorporate intercept but cannot find \n> any documents on the web. Or we can simply add something like \n> this? '1 ->  eta1'? This is my first question. \n> \n> Also, note that since my y2 and y3 are ordinal, I used the \n> 'hetcor' to calculate correlation of observed variables. \n> However, from the document, I would need to use the \n> covariance matrix rather then the correlation. And I need \n> additional column for 1. I am not sure how this matrix should \n> look like and how I can obtain this? If there is any example \n> you could point me to, I would really appreciate. Thank you.\n> \n> - adschai\n> \n> \t[[alternative HTML version deleted]]\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide \n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}