{"category": "ham", "to_address": "Ellen Shaffer <ershaffer@cpath.org>", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "Re: [Ip-health] oh, please: Fwd: Stop the Outsourcing of US Jobs\n to Thailand", "body": "In the past, USA for Innovation has been one of the louder voices\nattacking Brazil.\n\nAlso, Ken Adelman's wife, Carol works at the Hudson Institute, where she\nhas authored a number of industry-friendly pieces.  She is perhaps best\nknown for her paper which concluded generics ARVs cost more than brand\nname ARVs.\n(http://spp.hudson.org/files/publications/AdelmanARVWhitePaper.pdf)  She\nhas also attacked generic ARVs as being unsafe.\n\n\nEllen Shaffer wrote:\n> --\n> [ Picked text/plain from multipart/alternative ]\n> Fyi: It seems that Ken Adelman, Donald Rumsfeld's former right-hand\n> man, is now keeping the wolf from the door by lending his name to\n> usaforinnovation.org.  The note distributed below to a Democratic\n> listserv aims to undermine support for Thailand's historic compulsory\n> licences by wrapping pharma's monopolistic practices in the call to\n> save \"American\" jobs! As this list knows, drug companies are\n> transnational, many not even headquartered in the US; and outsourcing\n> is already their middle name. - Ellen Shaffer\n>\n>\n>\n>> []\n>>\n>>\n>> Thailand has been taken over by a military regime hostile to good\n>> American jobs in our science industries. The government is now\n>> stealing the inventions of American workers to pay for inflated\n>> salaries and new toys for the military.\n>>\n>> Worse, the Thai military is now trying to convince other nations to\n>> follow its lead. The Minister of Health will be in the U.S. this\n>> week to convince policymakers, academics and the press that these\n>> new spending priorities are more important than the jobs of the\n>> American innovators who are working to save lives.\n>>\n>> Take action today to let your\n>> representative officials know that theft of American property by the\n>> Thai government and threats to American jobs must be stopped!\n>>\n>> Bob Fertik\n>>\n>> []\n>>\n>>\n>>\n>> The Outsourcing of American Jobs to Thailand\n>>\n>> A military dictatorship took control of Thailand by coup last\n>> September and has since been leading the latest attack on American jobs.\n>>\n>> The military has stolen money from Americans through the imposition\n>> of capital controls, has passed new discriminatory business laws\n>> against Americans working in Thailand, and is now stealing American\n>> medical innovations - a direct attack on hundreds of thousands of\n>> American scientists, doctors, teachers and researchers.\n>>\n>> The new Ministry of Health has been particularly fixated on harming\n>> Americans. The military-appointed representative at the World Health\n>> Organization, Dr. Suwit Wibulpolprasert, proposed in January holding\n>> Western tourists hostage to bargain for flu vaccines.\n>>\n>> But the junta's ire is not solely directed at America - they are\n>> proving themselves to be dangerous to Thailand as well.\n>>\n>> The new military regime overtly displayed its corruption by awarding\n>> themselves pay increases of nearly $10 million and going on a\n>> military spending spree surpassing the $1 billion mark.\n>>\n>> And just last month, Human Rights Watch issued a report critical of\n>> the Thai government, accusing them in the mass \"disappearances\" of\n>> Malay Muslims including the use of \"paramilitary Army rangers and\n>> village defense volunteers\", putting innocent civilians at risk.\n>>\n>> CLICK HERE TO TAKE ACTION\n>>\n>> Unfortunately, President Bush and his incompetent Administration\n>> have done nothing to respond.\n>>\n>> The Democrats must take the lead on fighting corrupt and hostile\n>> trading partners. Since when did not protecting Americans become our\n>> trade policy?\n>>\n>> Our new Chairman of the House Ways and Means Committee Charles\n>> Rangel (D-NY) said it best when he said that American innovators are\n>> \"paying for the research and development that we have in\n>> intellectual property. And [if] you steal from them, you are\n>> stealing from Americans.\"\n>>\n>> CLICK HERE TO TAKE ACTION\n>>\n>> This week, the Thai Minister of Health is holding court with\n>> Administration officials, Members of Congress, academics and the\n>> media in an attempt to convince these Americans that theft of\n>> American products is justified in poor countries.\n>>\n>> While there are many issues around the world surrounding delivery of\n>> medications to impoverished peoples who can't afford them, the\n>> recent actions by Thailand cannot be tolerated as a viable solution.\n>> Since coming to power the military has lined its pockets, kicked out\n>> foreign investors, and is now stealing from American workers. Hardly\n>> a poster child for the HIV/AIDS movement.\n>>\n>> CLICK HERE TO TAKE ACTION\n>>\n>> For more information about other ways you can take action, please\n>> visit www.usaforinnovation.org\n>>\n>>\n>>\n>>\n>>\n>> ----------\n>> You are subscribed to Democrats.com Activist Alerts.\n>> If you do not want to receive messages from any Democrats.com\n>> partners,\n>> click\n>> here\n>> To permanently unsubscribe from all Democrats.com lists,\n>> click\n>> here .\n>>\n>\n> Ellen R. Shaffer, PhD, MPH, Co-Director\n> Center for Policy Analysis on Trade and Health (CPATH)\n> 98 Seal Rock Drive\n> San Francisco, CA 94121-1437\n>\n> phone: 415-933-6204\n> email: ershaffer@cpath.org\n> mobile: 415-680-4603\n> www.cpath.org\n> fax: 415-831-4091\n> --\n>\n> _______________________________________________\n> Ip-health mailing list\n> Ip-health@lists.essential.org\n> http://lists.essential.org/mailman/listinfo/ip-health\n>\n>\n\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}