{"category": "ham", "to_address": "ip-health@lists.essential.org, healthgap@critpath.org,\n   aidsdrugs@lists.riseup.net, thaiFTA@lists.riseup.net, e-drug@healthnet.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] PIJIP Releases Report on Thai Compulsory Licenses and Abbott's Subsequent\n Refusal to Register New Medicines", "body": "PIJIP Releases Report on Thai Compulsory Licenses and Abbott's\nSubsequent Refusal to Register New Medicines\n\nPress release (see below):\nhttp://www.wcl.american.edu/pijip/documents/pressrelease04262007.doc\nFull Report:\nhttp://www.wcl.american.edu/pijip/documents/pijip04262007.doc\n\n-------------------------------------------------------------\n\nFOR IMMEDIATE RELEASE\nApril 26, 2007\n\nContact: Sean Flynn\n202-274-4442\n202-294-5749 (c)\nsflynn@wcl.american.edu\n\nPIJIP Releases Report on Thai Compulsory Licenses and Abbott's\nSubsequent Refusal to Register New Medicines\n\nThailand's issuance of compulsory licenses for three patented medicines\nis legal under domestic laws and complies with WTO rules, and Abbott's\ndecision to withhold its new products from the Thai population violates\nThai antitrust laws, according to a new report released today by the\nAssociate Director of Washington College of Law's Program on Information\nJustice and Intellectual Property (PIJIP).  The release of PIJIP's\nreport coincides with the filing of a compliant by Thai activists to\ntheir country's Competition Commission, and an international Day of\nAction called by treatment activists around the world.  The full report\ncan be found at www.pijip.org.\n\n\"The analysis we are releasing today demonstrates that Thailand's law\nincorporates the most important TRIPS flexibilities for issuing public\nuse licenses, and that Thailand's action in licensing several medicines,\nincluding Abbott's Kaletra, was carefully tailored to comply with both\nits own law and the TRIPS agreement.  Arguments to the contrary, which\nhave not been brought in any competent tribunal, should be dismissed as\npolitical posturing.  In addition, Abbott's response to the license -\nwithholding a new version of its Kaletra product from the Thai market,\nappears to directly contravene the Thai Competition Act which prohibits\n'suspending, reducing or restricting services, production, purchase,\ndistribution, deliveries, or importation without justifiable reasons.'\nAn unwillingness to comply with a legal and justifiable government order\ncannot be a 'justifiable reason' for suspending the supply of life\nsaving medicines to Thai citizens.\"\n\nThe report released today explains that Article 51 of the Thai Patent\nAct, and article 31 of the World Trade Organization Agreement on Trade\nRelated Aspects of Intellectual Property Rights, allows governments to\nlicense patents for any public non-commercial use.  The compulsory\nlicense has been issued to the Government Pharmaceutical Organization,\nwhich will distribute generic versions of the drug through the public\nhealth sector. These attributes of the license make it clearly a public\nuse license under Thai and WTO law.\n\nBackground:  Last January, Thailand issued a compulsory license for\nKaletra, allowing health authorities to import lower-cost generics from\nIndia. Kaletra is patented by Abbott, which then priced the drug at\n$2200 per patient per year.  Thailand's per capita income is $2800.   In\nresponse, Abbott has announced that it will no longer offer any new\nproducts for sale in Thailand.\n\nThe Program on Information Justice and Intellectual Property at the\nWashington College of Law promotes public interest approaches to\ndomestic and international intellectual property law through advocacy,\nevents and the provision of legal and consulting services.\n\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}