{"category": "spam", "to_address": "ks8j@goodnet.com", "from_address": "williamshanj@aol.co.uk", "subject": "Labour in the Lords Vineyard", "body": "\n\n\nDear Beloved,\nIt is by the grace of God that I have received Christ, having known the\ntruth; I had nochoice than to do what is righteous and just in the sight of God for\neternal life and in the  sight of man for witness of God & His Mercies \nand glory upon my life.\nI am Mrs. Hannah Jack Williams, the widow of Mr. Sam Gilbert. My \nhusband worked with the Chevron/Texaco for twenty years in Russia,\nAfrica and the Middle East before he died in the year 2003. We were \nmarried for ten years without a child. My Husband died after a brief \nillness that lasted for only four days. Before his death we both got\nborn-again as dedicated Christians. Since his death I decided not\nto re-marry or bother to get a child outside my matrimonial home which\n the Bible is strongly against.\nPresently, I'm in a hospital in Germany where I have been undergoing\ntreatment for esophageal cancer. I am scheduled to undergo a major\noperation in a few days time even though my doctors have told me that I \nhave only a few weeks to live.\nAfter the death of my husband, i deposited the sum of $3.5 Million \n(Three Million Five Hundred Thousand Dollars) with an investment firm in \nEurope.It is my last wish to see this money distributed to charity \norganizations and NGO anywhere in the World in helping human race.\nBecause relatives and friends have plundered so much of my wealth since \nmy illness, I cannot live with the agony of entrusting this huge\nresponsibility to any of them. Please, I beg you in the name of God to \nhelp me complete my work in the Lord's Vineyard. I need you to \nStand-in as my beneficiary and administer to the funds, doing the work of the lord.\nI want a person that is God-fearing who will use this money to fund \nchurches, orphanages and widows propagating the word of God and to \nensure that the house of God is maintained. The Bible made us to understand \nthat blessed is the hand that giveth.\nI know that I am going to be in the bosom of the Lord. Exodus 14 VS 14: \nsays that the Lord will fight my case and I shall hold my peace.\nIf you can do this, i shall communicate with my attorney immediately \nand have him place you as the beneficiary of the funds.\nI await your quick response to this mail as this is my last wish to see \nthese funds transferred before my Death.\nPlease my beloved for further communication on how we are going to\nconclude this, reach me on my private mail: williamshanj@gmail.com \nRemain Blessed\nYour Sister in Christ,\nMrs. Hannah J. Williams.\n\n\n\nCheck out the new free AOL Email -- 2GB of storage and industry-leading spam and email virus protection.\n\n\n\n\n"}