{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Lifestyle Newsletter July 5, 2007", "body": "July 7, 2007 \nRSS | lifestyle\nThis Week's Highlights:\nHow Men WorkHow Newsrooms Work\nHow the Amish WorkHow Baby Boomers Work\nHow Pet Psychics Work \nThis Month in History - July - Just about everyone in the United \nStates has heard of the little town known as Roswell, N.M. Most people know that there is some connection \nbetween Roswell\nand UFOs. But not many people know the real details. Read more about\nthis and other major events that happened in the month of July.   This week's trivia question:How many baby boomers are there in the United States? \nFind out here   \n \nHow Men Work - As hormones go, testosterone doesn't always have the best reputation. Some women hold it accountable for just about any stereotypically masculine behavior, from a love of sports to a reluctance to ask for directions. But without testosterone, there would be no men. In this article, learn how men work, including how men develop and whether some common stereotypes about men are in fact true. \n    This week's video:\nHow Newsrooms Work - Live news broadcasts generally seem like smooth, well-run events, but it takes a highly trained crew of at least 20 to 30 people behind the scenes to keep things running smoothly. In this video from HowStuffWorks, watch as we explore how newsrooms work. \n     Also at HowStuffWorks:\n \nHow the Amish Work - There is a large group of people in this country, as many as 100,000, who deliberately live an 18th century lifestyle. Learning about the origins of this fascinating group, known as the Amish, and how they live today. \n \nHow Baby Boomers Work - The baby boomer generation has defined the development of American society for much of the last 50-plus years. With the baby boomers approaching retirement age, now is a good time to look at what the term baby boomer really means. Find out who baby boomers are, what this group means to America and how the retirement of baby boomers will affect the country. \n \nHow Pet Psychics Work - Have you ever wondered what your dog was thinking, or if he could actually make some sense of your words or body language? According to pet psychics, we actually communicate telepathically with our pets all the time. Learn how pet psychics work and what scientific research shows us about pets' emotions and personalities.\n  \n   Coming Next Week:How Women Work\nHow Sports Betting Works   \n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved"}