{"category": "ham", "to_address": "\"Alan Zaslavsky\" <zaslavsk@hcp.med.harvard.edu>, R-help@stat.math.ethz.ch", "from_address": "\"Greg Snow\" <Greg.Snow@intermountainmail.org>", "subject": "Re: [R] Reasons to Use R", "body": "> -----Original Message-----\n> From: r-help-bounces@stat.math.ethz.ch \n> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Alan Zaslavsky\n> Sent: Wednesday, April 11, 2007 9:07 AM\n> To: R-help@stat.math.ethz.ch\n> Subject: [R] Reasons to Use R\n\n[snip]\n \n> I have thought for a long time that a facility for efficient \n> rowwise calculations might be a valuable enhancement to S/R.  \n> The storage of the object would be handled by a database and \n> there would have to be an efficient interface for pulling a \n> row (or small chunk of rows) out of the database repeatedly; \n> alternatively the operatons could be conducted inside the \n> database.  Basic operations of rowwise calculation and \n> cumulation (such as forming a column sum or a sum of \n> outer-products) would be written in an R-like syntax and \n> translated into an efficient set of operations that work \n> through the database.  (Would be happy to share some jejeune \n> notes on this.)\n\nThe biglm and SQLiteDF packages have made a start in this direction\n(unless I am missunderstanding you), adding functionality to either of\nthose seems the best use of effort.\n\n>  However the main answer to thie problem in \n> the R world seems to have been Moore's Law.  Perhaps somebody \n> could tell us more about the S-Plus large objects library, or \n> the work that Spie Bates is doing on efficient calculations \n> with large datasets.\n\nThis link gives an overview and some detail of the S-PLUS big data\nlibrary\nhttp://www.insightful.com/support/splus70win/eduguide.pdf\n\n\n>  \tAlan Zaslavsky\n>  \tzaslavsk@hcp.med.harvard.edu\n\n\n\n-- \nGregory (Greg) L. Snow Ph.D.\nStatistical Data Center\nIntermountain Healthcare\ngreg.snow@intermountainmail.org\n(801) 408-8111\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}