{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Thomas Compton\" <tyccelinternationalsal@celinternational.org>", "subject": "Watch your body change with Anatrim", "body": "\nYou'll love the new, non-obese you\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting product for over-weight people is made available now – As told on BBC\n\n\n\nDo you understand that redundant body kilos kill a plenty of people around the whole world? We believe that you hate the unattractive look of people like those and the low status they obviously have in modern society. \n\nOr, maybe, you can not withstand a siege of baneful eating habits of yours. This all sounds familiar? Then we have something for you!\n\n\n\n\n\nIntroducing Anatrim, the new product for the elimination of your body’s extra weight. The most astounding thing is that Anatrim raises the quality of your life by soothing your feeling of hunger and giving you better spirit. Note what people write on this product:\n\n\n\n\n\n\"It’s outstanding! \n\n\nInstead of always glutting myself with food and watching TV \n\n\nI became more interested in doing sport.\n\n\n\n\n\n\n Anatrim placed me back on the right track.\n\n\n I have a great shape now and there are lots of men around me!\"\n\n\n\n\n\n\nVictoria K., Boston\n\n\n\n\n\n\n\"I tried some passive weight losing, you know, but with little result. I was very hard for me to restrain my ravenous hunger. \n\n\nOne day I heard about Anatrim in the media advertisement and I was really effected by the information.\n\n\n I had tried to use it, and my wife said to me I look very good now, 4 months later. \n\n\n25 pounds have gone away and I keep losing them! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nRikky Martin, Chicago\n\n\n\n\n\nAnatrim gives you an opportunity to realize that your body doesn’t need that much food. It raises your spirit, gives you extra energy, and attacks useless kilos. Especial thanks to its powerful distinguished formula!!\n\n\n\nElicit more!\n\n\n\n"}