{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Ira Glazer <ira@yanua.com>", "subject": "[Ip-health] Lancet Study: WHO neglects evidence when developing 'evidence-based\n guidelines'", "body": "http://www.miamiherald.com/852/story/99331.html\n\nWHO criticized for neglecting evidence\nBy MARIA CHENG\nAP Medical Writer\n\nLONDON --\nWhen developing \"evidence-based\" guidelines, the World Health Organization\nroutinely forgets one key ingredient: evidence. That is the verdict from a\nstudy published in The Lancet online Tuesday.\n\nThe medical journal's criticism of WHO could shock many in the global health\ncommunity, as one of WHO's main jobs is to produce guidelines on everything\nfrom fighting the spread of bird flu and malaria control to enacting\nanti-tobacco legislation.\n\n\"This is a pretty seismic event,\" Lancet editor Dr. Richard Horton, who was\nnot involved in the research for the article. \"It undermines the very purpose of WHO.\"\n\nThe study was conducted by Dr. Andrew Oxman and Dr. Atle Fretheim, of the\nNorwegian Knowledge Centre for Health Services, and Dr. John Lavis at\nMcMaster University in Canada. They interviewed senior WHO officials and\nanalyzed various guidelines to determine how they were produced. What they found\nwas a distinctly non-transparent process.\n\n\"It's difficult to judge how much confidence you can have in WHO guidelines if\nyou're not told how they were developed,\" Oxman said. \"In that case, you're left\nwith blind trust.\"\n\nWHO issues about 200 sets of recommendations every year, acting as a public\nhealth arbiter to the global community by sifting through competing scientific\ntheories and studies to put forth the best policies.\n\nWHO's Director of Research Policy Dr. Tikki Pang said that some of his WHO\ncolleagues were shocked by The Lancet's study, but he acknowledged the criticism\nhad merit, and explained that time pressures and a lack of both information and\nmoney sometimes compromised WHO work.\n\n\"We know our credibility is at stake,\" Pang said, \"and we are now going to get\nour act together.\"\n\nWHO officials also noted that, in many cases, evidence simply did not exist.\nData from developing countries are patchy at best, and in an outbreak,\ninformation changes as the crisis unfolds.\n\nTo address the problem, they said, WHO is trying to develop new ways to\ncollect information in poor regions, and has proposed establishing a committee\nto oversee the issuance of all health guidelines.\n\nThe Lancet study - conducted in 2003-04 through analyzing WHO guidelines and\nquestioning WHO officials - also found that the officials themselves were concerned\nabout the agency's methods.\n\nOne unnamed WHO director was quoted in the study as saying: \"I would have\nliked to have had more evidence to base recommendations on.\" Another said: \"We never\nhad the evidence base well-documented.\"\n\nPang said that, while some guidelines might be suspect and based on just a few\nexpert opinions, others were developed under rigorous study and so were more reliable.\n\nFor example, WHO's recent advice on treating bird flu patients was developed\nunder tight scrutiny.\n\nOxman also noted that WHO had its own quality-control process. When its 1999\nguidelines for treating high blood pressure were criticized for, among other things, recommending expensive drugs over cheaper options without proven benefit,\nthe agency issued its \"guidelines for writing guidelines,\" which led to a revision\nof its advice on hypertension.\n\n\"People are well-intended at WHO,\" Oxman said. \"The problem is that good\nintentions and plausible theories aren't sufficient.\"\n\nIt remains to be seen how WHO's 193 member countries will react to The Lancet\nstudy, released just before WHO's governing body - the World Health Assembly -\nmeets next week at U.N. headquarters in Geneva to decide future health strategies.\n\n\"If countries do not have confidence in the technical competence of WHO, then\nits very existence is called into question,\" said Horton, the journal's editor.\n\"This study shows that there is a systemic problem within the organization,\nthat it refuses to put science first.\"\n\nWHO Director-General Dr. Margaret Chan, who took over the position this year,\nwill be under pressure to respond to the study's criticism.\n\n\"We need a strong WHO,\" which in recent years \"has seen its independence\neroded and its trust diminished,\" Horton said. \"Now is a fabulous opportunity\nfor WHO to reinvent itself as the technical agency it was always meant to be.\"\n\n\n\n< original article: The Lancet DOI:10.1016/S0140-6736(07)60675-8,\n'Use of Evidence in WHO recommendations'>\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}