{"category": "ham", "to_address": "tchur@optusnet.com.au", "from_address": "Simon Blomberg <s.blomberg1@uq.edu.au>", "subject": "Re: [R] Reduced Error Logistic Regression, and R?", "body": ">From what I've read (which isn't much), the idea is to estimate a\nutility (preference) function for discrete categories, using logistic\nregression, under the assumption that the residuals of the linear\npredictor of the utilities are ~ Type I Gumbel. This implies the\n\"independence of irrelevant alternatives\" in economic jargon. ie the\nutility of choice a versus choice b is independent of the introduction\nof a third choice c. It also implies homoscedasticity of the errors. The\nmodel can be generalized in various ways. If you are willing to\nintroduce extra parameters into the model, such as the parameters of the\nGumbel distribution, you may get more precision in the estimates of the\nutility function. An alternative (without the independence of irrelevant\nalternatives assumption) is to model the errors as multivariate normal\n(ie use probit regression), which is computationally much more\ndifficult.\n\nWhether it makes substantive sense to use these models outside of\n\"discrete choice\" experiments is another question.\n\n Patenting these methods is worrying. There have been a lot of people\nworking on discrete choice experiments over the years. It's hard to\nbelieve that a single company could have ownership over an idea that is\nthe result of a collaborative effort such as this.\n\nCheers,\n\nSimon.\n\n On Thu, 2007-04-26 at 12:29 +1000, Tim Churches wrote:\n> This news item in a data mining newsletter makes various claims for a technique called \"Reduced Error Logistic Regression\": http://www.kdnuggets.com/news/2007/n08/12i.html\n> \n> In brief, are these (ambitious) claims justified and if so, has this technique been implemented in R (or does anyone have any plans to do so)? \n> \n> Tim C\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n-- \nSimon Blomberg, BSc (Hons), PhD, MAppStat. \nLecturer and Consultant Statistician \nFaculty of Biological and Chemical Sciences \nThe University of Queensland \nSt. Lucia Queensland 4072 \nAustralia\n\nRoom 320, Goddard Building (8)\nT: +61 7 3365 2506 \nemail: S.Blomberg1_at_uq.edu.au \n\nThe combination of some data and an aching desire for \nan answer does not ensure that a reasonable answer can \nbe extracted from a given body of data. - John Tukey.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}