{"category": "ham", "to_address": "R-help <r-help@stat.math.ethz.ch>", "from_address": "\"John C Frain\" <frainj@gmail.com>", "subject": "[R] Fwd:  importing excel-file", "body": "---------- Forwarded message ----------\nFrom: John C Frain \nDate: 18-Apr-2007 22:35\nSubject: Re: [R] importing excel-file\nTo: Alberto Monteiro \n\n\nOne additional suggestion would be to use gretl.  Gretl will read\nexcel files with an option to possibly ignore the first few rows and\ncolumns and then the data can be exported to an R session started from\nwithin Gretl.  This will also work in both Windows and Linux.  I find\nit hard to imagine an excel file that can not be read in  Open Office\nor Gnumeric or even Excel and then output to a delimited file in a\nmatter of seconds.  In my previous employment I conducted several\ncampaigns against the use of excel formats in favour of a delimited\nfile which can be opened in almost any program.  I think that we wouls\nall be better off if this practice was more widespread.\n\nJohn Frain\n\nOn 18/04/07, Alberto Monteiro  wrote:\n> John C Frain wrote:\n> >\n> > To avoid complications, save your file as comma separated and use one\n> > of the instructions for reading delimited files.  If you are using a\n> > comma as a decimal point you are probably using ; as a separator.  If\n> > this is so use read.csv2.  Please see the help files for read.table.\n> >\n> I think the problem is that we _can't_ alter or write the excel\n> file, or it would be unpractical to do it (say, this xls file\n> is generated by someone else once a day, and we must use it).\n>\n> I usually save the excel file to plain text, and then read it - but\n> this is not the best solution when the file keeps changing.\n>\n> Alberto Monteiro\n>\n>\n\n\n--\nJohn C Frain\nTrinity College Dublin\nDublin 2\nIreland\nwww.tcd.ie/Economics/staff/frainj/home.html\nmailto:frainj@tcd.ie\nmailto:frainj@gmail.com\n\n\n-- \nJohn C Frain\nTrinity College Dublin\nDublin 2\nIreland\nwww.tcd.ie/Economics/staff/frainj/home.html\nmailto:frainj@tcd.ie\nmailto:frainj@gmail.com\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}