{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Namanh Vu Hoang <hoangnv@uci.edu>", "subject": "[R] correlation between multiple adjacency matrix graphs", "body": "I'm looking for a way to do (product moment) graph correlation  \nbetween multiple unlabeled graphs G to Gn. Basically I have 900  \nindividual samples of a 48x48 adjacency matrix which I've listed as a  \n3rd dimension of a single array. So it looks something like [48,48,i]  \nwhere i is each individual subject's adjacency matrix.\n\nIf i run the gcor function on any two graphs for example [,,1] & [,, \n2] it returns a single graph correlation value however if I run it  \nacross the entire 3 dimensional array i get a 48x48 graph correlation  \nmatrix.\n\nFor example it sort of looks like this with the exception that it  \nwould be 48x48\n[ , ,1]\n       A     B     C     D     E\nA    0     0     0     0     0\nB    1     0     0     0     0\nC    0     0     0     0     0\nD    1     1     0     0     0\nE     0     1     0     1     0\n\n[ , ,1]\n       A     B     C     D     E\nA    0     0     0     0     0\nB    1     0     0     0     0\nC    0     1     0     0     0\nD    1     0     0     0     0\nE     0     1     0     0     0\n\nall the way to\n\n[ , ,900]\n       A     B     C     D     E\nA    0     0     0     0     0\nB    1     0     0     0     0\nC    0     1     0     0     0\nD    1     0     0     0     0\nE     0     1     0     0     0\n\n\n\nIs there a way to generate a single Pearson's product-moment  \ncorrelation coefficient across all 900 individual adjacency matrices?  \nThe only way i can think of so far is to create my own function that  \nkeeps looping graphs pairs using gcor but I am hopeful there is  \nsomething known way to do this in a simpler manner.\n\nI'm also unclear about what the standard nomenclature for this is.  \nSometimes I hear multidimensional Array other times i hear people  \nrefer to it as a multiple array list. This might help as maybe I'm  \njust looking up the wrong thing.\n\nThanks.\n\n-------------------------------------------------------\nNamanh Vu Hoang\n\nDepartment of Sociology: Undergraduate\nhoangnv@uci.edu\n\n\n\n\t[[alternative HTML version deleted]]\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}