{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@speedy.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "gregarious: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Monday, April 23, 2007\ngregarious \\grih-GAIR-ee-us\\, adjective:\n1. Tending to form a group with others of the same kind.\n2. Seeking and enjoying the company of others.\nTrue locusts, which are actually certain kinds of grasshoppers, are usually solitary and rather sluggish, but when they are crowded they enter a gregarious and highly active migratory phase. -- Gilbert Waldbauer, Millions of Monarchs, Bunches of Beetles\nIn the newly discovered gene, the change of a single unit of DNA converts the worm from a solitary forager into a gregarious diner. -- \"Can Social Behavior of Man Be Glimpsed in a Lowly Worm?\", New York Times, September 7, 1998\nMy efforts to cultivate an identity as a strong silent type have consistently been undermined by my gregarious nature and my delight in conversation. -- Marty Jezer, Stuttering: A Life Bound Up in Words\nAlthough social and gregarious when he wants to be, Phil learned, during our early years together, not only to savor but also to require long periods of hermitlike solitude. -- Frances K. Conley, Walking Out on the Boys\nGregarious is from Latin gregarius, \"belonging to a herd or flock,\" from grex, greg-, \"herd, flock.\"\nDictionary.com Entry and Pronunciation for gregarious\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9392562-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}