{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@speedy.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "CORRECTING and REPLACING SatCon Announces Certification of Its Photovoltaic PowerGate(R) Inverters for Commercial Photovoltaic Applications", "body": "\n\n\n\n\n\n\n\n\nCORRECTING and REPLACING SatCon Announces Certification of Its Photovoltaic PowerGate(R) Inverters for Commercial Photovoltaic Applications\nAlternative Energy Subsidiary's Backlog Exceeds $21 Million \nBOSTON, Apr 25, 2007 (BUSINESS WIRE) --  Second graph, first sentence should read: With SatCon's continued industry leadership, its wholly owned subsidiary, SatCon Power Systems Canada is pleased to report that as of the date of this press release its backlog has grown from the $16 million reported in December of 2006 to over $21 million today. (sted With SatCon's continued industry leadership, its wholly owned subsidiary, SatCon Power Systems Canada is pleased to report that as of the date of this press release it's backlog has grown from the $16 million reported in September of 2006 to over $21 million today.) The corrected release reads: SATCON ANNOUNCES CERTIFICATION OF ITS PHOTOVOLTAIC POWERGATE(R) INVERTERS FOR COMMERCIAL PHOTOVOLTAIC APPLICATIONS Alternative Energy Subsidiary's Backlog Exceeds $21 Million SatCon Technology Corporation(R) (Nasdaq CM: SATC), a developer of power management and system architecture solutions for the alternative energy and distributed power markets today announced that it has obtained certification of its PowerGate(R) Inverter product-line for commercial photovoltaic applications to the new UL standard coming into effect May 7, 2007. In January of 2006, SatCon announced certification under the new UL1741 of its innovative ground fault detection interrupter (patent pending) resulting in significant savings for installers of photovoltaic systems. This new certification for the entire product-line is a follow on to that approval. With SatCon's continued industry leadership, its wholly owned subsidiary, SatCon Power Systems Canada is pleased to report that as of the date of this press release its backlog has grown from the $16 million reported in December of 2006 to over $21 million today. This backlog has grown while revenues have increased over 200% to $8.6 million in the last six months of 2006 as compared to the same period of 2005. \"Our strategy to focus our alternative energy business and complementary power distribution products continues to drive our backlog and revenue growth\", said Clemens van Zeyl, President of SatCon's Power Systems subsidiary. \"With approval of our existing product-line to the new UL standard in hand, our focus will now be on the introduction of our next generation PowerGate(R) Inverter designed for increased capacity while offering additional value added features to our customers\". About SatCon Technology Corporation SatCon Technology Corporation is a developer and manufacturer of electronics and generators/motors for the Renewable Energy, Hybrid-Electric Vehicle, Grid Support, High Reliability Electronics and Advanced Power Technology markets. For further information, please visit the SatCon website at www.satcon.com. (SATC-G) Statements made in this document that are not historical facts or which apply prospectively are forward-looking statements that involve risks and uncertainties. These forward-looking statements are identified by the use of terms and phrases such as \"will,\" \"intends,\" \"believes,\" \"expects,\" \"plans,\" \"anticipates\" and similar expressions. Investors should not rely on forward looking statements because they are subject to a variety of risks and uncertainties and other factors that could cause actual results to differ materially from the Company's expectation. Additional information concerning risk factors is contained from time to time in the Company's SEC filings. The Company expressly disclaims any obligation to update the information contained in this release. SOURCE: SatCon Technology Corporation SatCon Technology Corporation(R)\nDan Gladkowski, 617-897-2411\nVP, Administration\n\n\n\n\n\n\n\n\n\n\n You are subscribed to SatCon Technology Corporation Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n SatCon Technology Corporation \n 27 Drydock Ave. 6th Floor, South Boston, MA 02127\n Service provided by Shareholder.com \n\n\n\n\n\n"}