{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "This Weekend on BBC Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKEN BROWN ON THE PGA CHAMPIONSHIP\nThe European Tour's flagship event, the PGA Championship, has attracted seven out of the world's top 15 golfers to play at the beautiful West Course at Wentworth.\n\n\nOne of those, world number five Ernie Els, lives on the Wentworth estate and he has been the mastermind behind the redesign of the West Course over the past two years.\n\n\nThe changes he has made have been widespread and the bunkers he has built for this year's tournament brings the total added to 36.\n\n\nWith the weather being so good, and the course so firm and fast, many players have fallen foul of Els's tweaks and the enlargement of the ditch on the 12th fairway has attracted its fair share of controversy.\n\n\nThere's a noticeable absence of players from the American Tour here, but their circuit is so strong that it's difficult to prise people away.\n\n\nEnglishman Justin Rose, though, is one that has returned from the States to play in Britain for the first time since 2004 and his first-round performance oozed class. \n\n\nA back injury has stopped him playing since his fifth place finish at the Masters in April, yet he has showed no ill effects or rustiness on the West Course so far.\n\n\nKeep an eye on Ryder Cup hero Padraig Harrington, as the Irishman could be leaving the course a very happy man on Sunday.\n\n\nHis win at last week's Irish Open has given him the chance of scooping a one million Euro bonus if he can become the first player to win back-to-back in Ireland and then here at the PGA Championship.   \n\n\nHe wasn't at his best during his first round, but that often happens after you've just won as you can get fatigued with all the press conferences and attention.\n\n\nBut he battled through it and the signs seem good as his short game looked as world class as ever.\n\n\nEnjoy the action,\n\nKen\n\n\nKen Brown is commentating for the BBC at Wentworth this weekend. During his playing career he competed in five Ryder Cups and won four times on the European Tour.\n\n\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nGOLF\n bbc.co.uk/golf\nFriday 1100-1300, BBCi; 1330-1800, BBC TWO Saturday 1300-1725, BBC ONE Sunday 1300-1730, BBC TWO\n\t\t\t\t\t\n\n\n\n\n\nFOOTBALL ON THE BBC\n bbc.co.uk/football\nSaturday\nFootball Focus (1210, BBC ONE); Scottish Cup final: Celtic v Dunfermline (1300, BBC ONE Scotland; 1600 Radio Five Live/online).\nSunday\nLeague One play-off final commentary: Yeovil v Blackpool (1500, Radio Five Live/online).\nMonday Championship play-off final commentary: Derby v West Brom (1500, Radio Five Live/online).\n\t\t\t\t\t\n\n\n\n\n\nMORE SPORT ON THE BBC\n bbc.co.uk/tvandradio\nFriday Test Cricket: England v West Indies (1045-1845, Radio Five Live Sports Extra, BBCi & BBC Sport website). Saturday Rugby Sevens (0900-1830, BBCi and BBC Sport website; 1725-1825, BBC TWO); Test Cricket: England v West Indies (1045-1845, Radio Five Live Sports Extra, BBCi & BBC Sport website); Rugby union: South Africa v England (1400, Radio Five Live/online); Rugby league: Wigan v Hull (1800, Radio Five Live Sports Extra/online). Sunday Tennis: French Open (1000-1900, BBCi); Test Cricket: England v West Indies (1045-1845, Radio Five Live Sports Extra, BBCi & BBC Sport website); Rugby Sevens (1100-2000, BBCi and BBC Sport website; 1730-1930, BBC TWO); Inside Sport (1130-1215, BBC TWO); Rugby league: Super League Show (1235-1305, BBC North and website); Motorsport: Monaco Grand Prix (1300, Radio Five Live/online). Monday Tennis: French Open (1000-1900, BBCi); Test Cricket: England v West Indies (1045-1845, Radio Five Live Sports Extra, BBCi & BBC Sport website); Inside Sport (2305-2345, BBC ONE).\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tThe French Open on the BBC\n When you can watch action from Roland Garros\n\t\t\t\t\t\n\t\t\t\t\t\tWatch Inside Sport\n Download the best bits of the show\n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}