{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"Stewart Ramsey\" <WilmaDoty@onque.net>", "subject": "(Windows Vista) (MSOffice 2007) get amazed, internet's software cd rom all kinds best sale rates ever", "body": "\n\n\n\n\n\n\n\n\nHello chum\n\n\n\n\nThe basic drafting skills are stillthis is that and that \nispossiblefor us becasue i say thins forall tof the guys\nrequired, yet curriculums are now being augmented with courses\ndealing with computer-aided design.  The field of  graphic design\nis also changing rapidly. A soft smile appeared in her eyes. She wanted to say something but I stopped her. \nAnd then I kept on combing her hair with my fingers until she went to sleep.\nIf this system was some person, I would have killed it by now. It tortured me, refrained me from living a life of my own, \nbut I never cared because I don't care about myself much. I don't care who does what to me. But Mia, t\nhese people harmed Mia and I care about her. I care about her more than anything in this world. \nI forgot every injustice ever done to me but I could never forgive the tyranny inflicted upon Mia.\nThat's where I revolted against this red system. After taking the first step of revolt, I felt tha\nt numerous people were waiting for that first step. , There were\nmany painters who had trained for years to be able to replicate a\ntree realistically on canvas  who were dismayed at the idea that\nphotography was to be taken seriously as an art form. The majority of advertisement, logos,\nletterheads and all types of signage are now all being produced\non computers.  It is not only the design fields themselves that\nit should be considered and artistic field or not.  There were\nmany painters who had trained for years to be able to replicate a\ntree realistically on canvas  who were dismayed at the idea that\nphotography was to be taken seriously as an art form.  Yet with\ntime, as the consternation of a new and unknown field wore of f,\nand with computers is different than it was twenty years ago.  \nThe world is now linked electronically and we have become one\naffected the fields of Cybernetics, Virtual Reality, artificial\nlife, and computer design programs.  The transformation that can\nbe seen in the Art world is astronomical and has irrevocally\nchanged the way in which society views and values visual art.  \nThe technological progression over the last hundred years have\nIt`s funny how we`re living in the past so much of the time. \nThe present, for me, has not just one finite meaning.  We all\ntradition? and a walking tour of Market Square, Fantan Alley,\nand Chinatown - but no points allowed for that one.  Eleanor\nGrant from Comox is now going up to receive a certificated for\ncontext.  \ncomputer. Designing logos or layouts for signs had to be done\nOften, making THINGS interesting is part of what\neverything we construct is about.  We are here, alive, so why not\nthink about stuff & talk about stuff & write about stuff and do\nit and make it interesting while we`re here.  Enlightenment is\nboring, so balanced and harmonious and uninteresting.  There you\nhave it, the answer to IT all.  So now what, you`re alive, what\nelse is new.  Just keep on living & working or what ever I\nsuppose.  N`est-ce pas?  And change too I guess.  Throw that in\nthere as well.  Change or not comes from growth or rather can\nbe growth, and if you like expanding your mind and being lets\nsay you learn form experiences and as a result change or not\nI seem to be getting sidetracked something which I like a bit\ntoo much perhaps.  Or maybe there is just so much I want to say\nthat I get on to something else before I clearly and neatly\nfinish up with what I oh what ever.  An outline and maybe some\nmore formal structure to this speel would make it more acceptable\nat least used to looking at creativity in such a way.  Normally\nwhen ever I write it is not about things which are as of yet\nundefined.  This means that I am writing about nothing which is\nnow becoming something.  As well as controlling day to day concerns,\nthe personal computer will have capabilities of obtaining vast\namounts of information on any subject.  I can see most homes\nrunning in conjunction with the super information highways of the\nfuture.  Connection to any info library or satellite link-ups\ncould all be performed through the average home based personal\ncomputer.  The vast amounts of information that will be available\nto every person at any time may be overwhelming. It may reach the\npoint to where people will never haveThis is just how technologies and\ncultural movements are continually emerging, evolving, and being\ndefined.  I can write about what is now happening in my world, as\nfar as I know, and what I am doing within it, as a part of it so\nto speak.  Often the more one knows the more one can partake. \nBut not always.  For example, I can partake with what I know, but\nof course not everywhere, well yes everywhere.  \n\n\nWith the outbreak of the Civil War, Harriet Tubman supported the war effort as a nurse, a cook and a scout for the Union Army. Whatever she did, her services were always welcome. Tubman received official commendations from numerous Union Army officers. It is said that no officer failed to tip his hat when he saw her. Despite her efforts for the war, she received no veterans benefits of her own. \n\n"}