{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Ben Bolker <bolker@ufl.edu>", "subject": "Re: [R] How to use \"mix\" to estimate the parameters for mixture\n\tgamma distribution?", "body": "Wang, Yun  med.wayne.edu> writes:\n\n> \n> \n> Dear R users,\n> \n> Please help me on using \"mix\" function under package \"mixdist\".\n> \n> My data distribution shows there are two components for the mixture\ndistribution: left part is an\n> exponential and right part is a normal. So I plan to use \"gamma\" mixture\ndistribution to estimate the\n> parameters. Here is what I am using for the \"mix\" function.\n> \n> Test<-mix(x, mixparam(mu=c(1,125),sigma=c(1,11.18)),\"gamma\") \n> \n> However, one error message shows up as:\n> \"Error in nlm(function(x) f(x, ...), p, hessian, typsize, fscale, msg,  :\nmissing value in parameter\"\n> \n> Does anybody know what that means and how to fix it to get the estimation?\nYour help will be much appreciated.\n> \n> Yun\n> \n\n  You haven't given us enough to go on.  First of all,\nmixdist is a contributed package -- not part of base R, and\nnot even on CRAN (but not too hard to find:\nhttp://www.math.mcmaster.ca/peter/mix/mix.html ).  You might\nconsider asking the author/maintainer: see help(package=\"mixdist\").\n\nSecond, please do as the posting guide suggests and give us\na simple, reproducible example.  If your data are small enough,\nyou can just post them, or post them to a web site and send\nthe URL -- or make up a small data set that also displays the\nproblem (you will often discover the answer for yourself in the\nprocess of doing this!)\n\n  Staring at the C code for nlm (in src/main/optimize.c) suggests\nthat nlm is being passed an NA in a parameter set somewhere -- you\nmight try options(error=recover) to start diagnosing, or change\nprint.level in your mix() call.\n\n  But your best bet is to find a reproducible example for\nus to look at.\n\n  cheers\n    Ben Bolker\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}