{"category": "ham", "to_address": "debian-desktop@lists.debian.org", "from_address": "\"Gustavo Franco\" <stratus@debian.org>", "subject": "Re: Debian GNU/Linux (kfreebsd anyone?) Lenny Desktop wishlist thread", "body": "On 4/14/07, Daniel Baumann  wrote:\n> Gustavo Franco wrote:\n> > Would you like to join us at debian-desktop alioth group?\n>\n> same answer as the last time you have asked me. what would it be good\n> for? i'm only remotly a desktop user, and certainly not a desktop developer.\n\nIt's good to make sure that Debian Live desktop images matches the\nDebian Desktop users needs. I think that in the group you will be able\nto:\n\n* More than have voice on the mailing list, rw access our svn being\nable to prepare 'live flavored artwork' based on our debian-moreblue\nupdate\n\n* Make sure that the set of desktop related packages fit a live user need\n\nand more. ;)\n\n> > I heard from Sledge that after Etch\n> > release (in place) he (or we) could work on add some established Live\n> > images to cdimage.d.o and announce it through DWN, -news and\n> > times.debian.net (The idea was proposed in -publicity). Thoughts?\n>\n> i know. as soon as we consider live-helper (which is rotting in NEW) as\n> ready, i'll coordinate this. ETA is about 2 to 4 weeks from now.\n\nsounds great.\n\n> > Btw, what's the needed work to integrate d-i gtk and/or ubiquity in\n> > the live desktop images for Lenny ?\n>\n> d-i and g-i on the same images, in terms of seperate boot option are\n> ready soon. in terms of 'launch d-i/g-i from a booted live-system as an\n> application', this requires, as far as i'm told, that the d-i people\n> provides special builds for that purpose.\n\nYeah, and I thought g-i was on track. Do you think that it will be\nmore like \"win32 loader\" or \"ubiquity\" in terms of usability ?\n\n> for the 'live-to-hdd' installation, we will most likely write something\n> on your own. plan is to have it done until mid of july.\n\n'live-to-hdd' as in 'the same thing you're running here live on your\nhd', ubiquity-like, right?\n\n> and well, lenny is far, far away...\n\n:)\n\n> > In other words\n> > they can boot the live desktop image and install a dns server through\n> > its task.\n>\n> i don't understand what you mean here.\n\nThis is like 'debian as you want it -to-hdd' and not simple\n'live-to-hdd'. In other words the live cd would work simple as a g-i\nbootstrap and not only as a live cd + ubiquity, but both options would\nbe way better.\n\nregards,\n-- stratus\nhttp://stratusandtheswirl.blogspot.com\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}