{"category": "ham", "to_address": "<ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Computers & Electronics Newsletter April 26, 2007", "body": "\nhowstuffworks® | computers & electronics April 26, 2007\nRSS\n   Graduation Gift Guide: Electronics For Grads\n \nGraduation gifts should be cool, and nothing says \"cool\" like electronics. Need help sending that hard-working graduate out into the world in style? Consumer Guide has done some of the homework for you. This cheat sheet gift guide will give you some great ideas for a pretty cool electronic gift that says, \"Congratulations, graduate!\"\n \nAlso at HowStuffWorks \n\nHow ASIMO Works - ASIMO, which stands for Advanced Step in Innovative Mobility, is the most advanced\nhumanoid robot in the world. Find out how ASIMO was developed and what it can\ndo.\n \nCan I use my cell phone as a credit card? - In the near future, your cell phone could automatically act\na credit card or debit card wherever you go, thanks to a technology called NFC. Learn how NFC phones and payment\nstations work.\n \n\nHow Wireless Power Works - You probably have a few spaghetti-like power-cord tangles\naround your home. Find out how methods of wireless power transmission could cut\nthe clutter or lead to clean sources of electricity.\n   \nThis Week's Video \n\nHow Xavix Works - Want a video game that gets your kids off the couch? Xavix\nlets you play all kinds of sports, from baseball to boxing, on your television\nscreen. See how Xavix technology works in this HowStuffWorks video.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click here.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved\n "}