{"category": "ham", "to_address": "R-help <r-help@stat.math.ethz.ch>", "from_address": "Patrick Connolly <p_connolly@ihug.co.nz>", "subject": "[R] Dealing with data frame column names beginning with a numeric", "body": "I wish to set up a simple function using boxplot so that it will be\navailable to someone using R for Windows.  (I myself use Linux.)\n\nThe way the data is organised makes it convenient to use the boxplot\nfunction in a manner similar to this example given in the help.\n\n\n>      mat <- cbind(Uni05 = (1:100)/21, Norm = rnorm(100),\n+                   T5 = rt(100, df = 5), Gam2 = rgamma(100, shape = 2))\n>      boxplot(data.frame(mat), main = \"boxplot(data.frame(mat), main = ...)\")\n\nIf one of those columns had a numeric beginning to its name, such as:\n\n> colnames(mat)[3] <- \"5T\"\n\nand then using boxplot the same way, it will prepend an \"X\" to the\ncolumn name \"5T\" in the changing to a dataframe.\n\nI know I could use boxplot with a formula with the dataframe reshaped\nwhich would get round the problem, but I wanted to introduce as few\nnew concepts as possible for someone new to using R.  So the question\nis: Is there a way to get such a name without anything prepended into\nboxplot when used this way?\n\nI've been led to understand that some Windows' plotting devices lend\nthemselves to simpler editing than in Linux, so perhaps there is a\nsimple way to remove the \"X\" from the plot afterwards.  I know it\ncould be done with a postscript device by editing the file with a text\neditor but that's not simple with Windows.\n\nIdeas?\n\n-- \n~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.   \n   ___    Patrick Connolly   \n {~._.~}          \t\t Great minds discuss ideas    \n _( Y )_  \t  \t        Middle minds discuss events \n(:_~*~_:) \t       \t\t Small minds discuss people  \n (_)-(_)  \t                           ..... Anon\n\t  \n~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}