{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "Massive Meat <MassiveMeat@ourdick.com>", "subject": "SEXUALLY-EXPLICIT: $1 Massive Meat Action Movies gnitpick", "body": "\n\nmassive actions gnitpick 05/03/2007 03:43:13\n\n\n\n\n\n\n\n\n\nWarning: This email contains Sexual Explicit Material only suitable for 21+ years of age.\nIf you do not wish to view Sexual Explicit Material \nplease follow This Link to exit. \nMove Down To See Ad. If you cannot see images on this page, please follow\nThis Link.\n\n \n\n\n\n\n\n\n gnitpick... OMG It's HUGE! How could she handle that? \n\nMonster Sized Men Attack 05/03/2007 03:43:13 \n\nJokes of the day\nDiary of a computer lamer\nJuly 18\nI just tried to connect to America online, which I've heard is the best online service I can get. I can't connect, I don't know what is wrong.\nJuly 19\nSome guy at the tech support center says my computer needs a modem. I don't see why. He's just trying to cheat me. How dumb does he think I am?\nJuly 20\nI bought the modem, I couldn't figure out where it goes though, it wouldn't fit in the monitor or the printer. I'm confused.\nJuly 21\nI finally got the modem in and hooked up. A three year old next door did it for me.\nJuly 22\nThe three year old kid next door hooked me up to America online for me. He's so smart.\nJuly 23\nWhat the heck is the internet? I thought I was on America Online, not this internet thingy. I'm confused.\nJuly 24\nThe three year old kid next door showed me how to use this America Online stuff. He must be a genius at least compared to me.\nJuly 25\nI tried to use chat today. I tried to talk into my computer but nothing happened. Maybe I need to buy a microphone.\nJuly 26\nI found this thingy called Usenet. I got out of it because I'm connected to America Online, not Usenet. I went to the doctor today for my regular checkup. He says that since I connected, My brain has mysteriously shrunk to half its normal size.\nJuly 27\nThese people in this Usenet thingy keep using capital letters. How do they do that? i never figured out how to type capital letters. Maybe they have a different type of keyboard.\nJuly 28\nI found this thingy called the Usenet oracle. It says that it can answer any questions I ask it. I asked it 44 separate questions about the internet. I hope it responds soon.\nJuly 29\nI found a group called rec.humor. I decided to post this joke about why the chicken crossed the road. To get to the other side! ha ha! I wasn't sure if i posted it right so I posted it 56 more times.\nJuly 30\nI keep hearing about the World Wide Web. I didn't know spiders grew that large.\nJuly 31\nThe oracle responded to my questions today. Geez, it was rude. I was so angry that I posted an angry message about it to rec.humor.oracle.d. I wasn't sure if it posted right so I posted it 22 more times.\nAugust 1\nSomeone told me to read the FAQ. Geez, they didn't have to use profanity.\nAugust 2\nI just read this post called make money fast. I'm so exited, I'm going to make lots of money. I followed his instructions and posted it to every newsgroup i could find.\nAugust 3\nI just made my signature file. It's only 6 pages long, So I will have to work on it some more.\nAugust 4\nI just looked at a group called alt.aol.sucks. I read a few posts and I really believe that aol should be wiped off the face of the Earth. I wonder what an \"aol\" is, however.\nAugust 5\nI was asking where to find some information about something. Some guy told me to check out ftp.netcom.com. I've looked and looked, but I cant find that group.\nAugust 6\nSome guy suspended my account because of what i was doing. I told him I don't have an account at his bank. He's so dumb.\n \n\n\n\n\n\n\n\n"}