{"category": "ham", "to_address": "Ip-health <ip-health@lists.essential.org>", "from_address": "James Packard Love <james.love@keionline.org>", "subject": "[Ip-health] Vonage Wins 5.5% royalty compulsory license on Verizon Patents", "body": "Today  U.S. Court of Appeals for the Federal Circuit in Washington\nD.C. issued a permanent stay of an injunction involving the\ninfringement of patents owned by Verizon, the phone company.   The\nCourt allowed Vonage, a company that competes directly with Verizon\nto offer Internet based telephone services, to use the Verizon\npatents, in return for placing a 5.5 percent royalty into an escrow\nfund, while Vonage contests the validity and scope of the Verizon\npatents.   Jamie\n\nhttp://pr.vonage.com/releasedetail.cfm?ReleaseID=239259\n\nVonage Wins Permanent Stay in Verizon Patent Litigation\n\nCompany Will Conduct Business As Usual; Continues Adding New\nCustomers and Serving Existing Ones\n\nHOLMDEL, N.J., April 24, 2007 /PRNewswire-FirstCall via COMTEX News\nNetwork/ -- The U.S. Court of Appeals for the Federal Circuit in\nWashington D.C. today issued Vonage a permanent stay of a previous\ncourt's injunction that would have barred it from signing up new\ncustomers. Vonage sought the stay following an April 6th decision by\nthe U.S. District Court in Alexandria, Va. enjoining the company from\nusing certain VoIP technology to add new customers. The permanent\nstay enables Vonage to add new customers as we pursue our appeal.\nExisting customers remain unaffected by the company's ongoing patent\nlitigation.\n\n\"We thank the appellate court for its thoughtful consideration of the\nmerits of our case,\" said Jeffrey Citron, Vonage chairman and interim\nchief executive officer. \"It's business as usual for us. We will\ncontinue providing reliable, quality digital phone service at the\nbest value in the market and connecting thousands of phone calls\nevery day. We remain focused on growing and strengthening our\nbusiness and driving toward profitability.\"\n\nCitron added, \"We continue to believe we have not infringed on any of\nVerizon's technology and remain optimistic that we will ultimately\nprevail in this litigation.\"\n\nVonage will continue to serve existing customers by paying into\nescrow a quarterly royalty of 5.5 percent throughout the appeals\nprocess and by posting a $66 million bond as required by the court.\nThe company's current cash position allows it to pay these fees to\nsecure the stay as it continues to make progress on and pursues its\nlegal appeal over the coming months.\n\nAppeal\n\nVonage remains highly confident in the strength of its legal appeal.\n\n\"We believe the original verdict was based on an erroneous claim\nconstruction -- meaning the patents in this case were defined in an\noverly broad and legally unprecedented way,\" said Sharon O'Leary,\nVonage's executive vice president, chief legal officer and secretary.\n\"We believe the district court's decisions repeatedly neglected well-\nestablished law on claim construction and, as a result, artificially\nexpanded the coverage of Verizon's patents well beyond what was\nintended by the patent trademark process.\"\n\nO'Leary continued: \"We are confident this error will be rectified by\nthe appeals court, which hears intellectual property cases\nexclusively. As a result, we remain highly confident Vonage will\nprevail on appeal.\"\n\nAbout Vonage\n\nVonage (NYSE: VG) is a leading provider of broadband telephone\nservices with 2.4 million subscriber lines. Our award-winning\ntechnology enables anyone to make and receive phone calls with a\ntouch tone telephone almost anywhere a broadband Internet connection\nis available. We offer feature-rich and cost- effective communication\nservices that offer users an experience similar to traditional\ntelephone services.\n\nOur Residential Premium Unlimited and Small Business Unlimited\ncalling plans offer consumers unlimited local and long distance\ncalling, and popular features like call waiting, call forwarding and\nvoicemail -- for one low, flat monthly rate. Vonage's service is sold\non the web and through national retailers including Best Buy, Circuit\nCity, Wal-Mart Stores Inc. and Target and is available to customers\nin the U.S., Canada and the United Kingdom. For more information\nabout Vonage's products and services, please visit http://\nwww.vonage.com.\n\nVonage Holdings Corp. is headquartered in Holmdel, New Jersey. Vonage\n(R) is a registered trademark of Vonage Marketing Inc., a subsidiary\nof Vonage Holdings Corp.\n\nVg-f\n\nSafe Harbor Statement\n\nThis press release contains forward-looking statements regarding\nVonage's development of workaround solutions, its financial position\nand the likelihood of success on appeal. In addition, statements in\nthis press release that are not historical facts or information may\nbe forward-looking statements. The forward-looking statements in this\nrelease are based on information available at the time the statements\nare made and/or management's belief as of that time with respect to\nfuture events and involve risks and uncertainties that could cause\nactual results and outcomes to be materially different. Important\nfactors that could cause such differences include, but are not\nlimited to, our inability to implement an effective workaround,\npotential claims by creditors, our history of net operating losses\nand our need for cash to finance our growth; the competition we face;\nour dependence on our customers' existing broadband connections;\ndifferences between our service and traditional phone services,\nincluding our 911 service; uncertainties relating to regulation of\nVoIP services; system disruptions or flaws in our technology; our\nability to manage our growth; the risk that VoIP does not gain\nbroader acceptance; and other factors described in the \"Risk Factors\"\nsection of our Annual Report on Form 10-K for the year ended\n12/31/06, and in our subsequent periodic reports filed with the SEC.\nWhile we may elect to update forward-looking statements at some point\nin the future, we specifically disclaim any obligation to do so, and\ntherefore, you should not rely on these forward-looking statements as\nrepresenting our views as of any date subsequent to today.\n\nSOURCE Vonage\n\nBrooke Schulz of Vonage, +1-732-528-2627, brooke.schulz@vonage.com;\nor Nick Kalm of\nReputation Partners, +1-312-222-9888, nick@reputationpartners.com\n\nhttp://www.vonage.com\n\n----------------------------------------------\nJames Packard Love\nKnowledge Ecology International\nhttp://www.keionline.org\njames.love@keionline.org\nWashington, DC +1.202.332.2670\n\n\"If everyone thinks the same: No one thinks.\" Bill Walton\"\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}