{"category": "ham", "to_address": "Pedro Mardones <mardones.p@gmail.com>", "from_address": "Roger Bivand <Roger.Bivand@nhh.no>", "subject": "Re: [R] intersect filled.contour and polygon", "body": "On Mon, 30 Apr 2007, Pedro Mardones wrote:\n\n> Dear R users;\n> \n> Is there any way to intersect a filled contour image and a polygon? My\n> problem is that I want to create a kriging map and the boundaries of\n> my map are given by the coordinates of the polygon.\n> \n> So far I can superompose the polygon in the filled.contour image but I\n> don't know how to get rid of the contour image outside of the polygon\n> boundaries.\n\nTwo possibilities seem to be present: define your polygon as a hole inside \nthe bounding box of the image, with a link between the polygon and the \nbounding box, and fill it; or, perhaps better, only make kriging \npredictions for the polygon. Since you haven't given a code example, it \nisn't obvious how you are making the kriging predictions, but the choice \nof the newdata locations ought to decide - and they do not need to be a \nfull grid, or even a regular grid at all.\n\nIf you need to follow this up, please consider using the R-sig-geo list.\n\n> \n> Any hint will be appreciated\n> PM\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n> \n\n-- \nRoger Bivand\nEconomic Geography Section, Department of Economics, Norwegian School of\nEconomics and Business Administration, Helleveien 30, N-5045 Bergen,\nNorway. voice: +47 55 95 93 55; fax +47 55 95 95 43\ne-mail: Roger.Bivand@nhh.no\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}