{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "Allison <nxyr@masters.edu>", "subject": "It's not actual slavery, but the term \"wage slave\" is also prevalent in English.", "body": "ERMX Continues To Expand As Stock Climbs Up 16.6%!\n\nEntreMetrix Inc. (ERMX)\n$0.21 UP 16.6%\n\nERMX announced further expansion with K-9 Genetics. Healthy and Premium\ndog foods grossed $3.6 Billion in 2006, up from $1.9 billion in previous\nyears. Read up on ERMX over the holiday, we think you will see even more\nfireworks on Thursday morning!\n\nI'd like comment about your view of IT slavery in the sense that you\nseem to imply there is slavery in IT, or it is just a metaphor or simile\nthat you're using as way of embelishing your article. Anyway, seriously\nthis time. They are quite welcome to leave said situation; at anytime.\n\nfocussing on the problem.\n\nsome very very simple predicates. Make sure you're only waking up when\nyou need to.\nmostly for its simplicity and genericity.\nlinux the kernel got WELL beyond one person's control YEARS ago. mostly,\ni suppose, because i am expecting the readers of the article to do that,\nfor themselves, rather than me doing it for them. The kernel keeps track\nof DMA state in order to avoid that from happening. My apologies, I was\nworking and just came in for my daily visit. it still happens - just not\nas much.\n\nHowever, in the case of I.\nIf there's no route to the internet, don't bother. as free software\ndevelopers, many of whom own the intellectual property on our work, we\ntend to grate badly against the ethos you describe. That's not the first\ntime I saved the day at workplaces, or in other contexts. those people\nwould be paid well for their commission.\nand the user applications can remain simple. and \"The System\" is\n\"slavery\".\nthere exists the possibility to GIVE PEOPLE THE CHOICE AT COMPILE TIME.\npreferably by repeating it in your own words.\nBlog aggregation: Moved your blog away from Advogato? many slaves who\nserved their masters were, or are, in fact HAPPY to be \"owned\", which\nsays more about their view on life than it does about slavery.\n\ni will repeat that again in a different way.\n\nthe hardware design was restricted especially context switching due to\nthe slow speed at which registers etc. if you check the degrees of\nseparation between you and the nearest other 'Master' and upwards,\nyou'll probably find that it's quite a long way between you and the\ntop-level seeds.\n\nLicence is the Creative Commons Attribution Licence. Additional or\ndifferent terms, conditions, and notices may apply to specific\nmaterials, information, products, software, and services offered through\nthis Web site.\ndo you understand this?\n\nI don't want a computer with a mere CD player, or a very small hard\ndisk. Or do you mean something else?\nAlso wonderful to see good high quality on Advogato.\n\nMake sure you're only waking up when you need to. SOME JURISDICTIONS DO\nNOT ALLOW THE EXCLUSION OF WARRANTIES, SO THE ABOVE EXCLUSIONS MAY NOT\nAPPLY TO YOU. Additional or different terms, conditions, and notices may\napply to specific materials, information, products, software, and\nservices offered through this Web site.\n\n"}