{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 25, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESRosie's Gone From \"The View\" \nRosie O'Donnell and Elisabeth Hasselbeck have had their last heated argument on \"The View.\" ABC says O'Donnell is taking an\n                        early leave; her contract was up on June 22. More...\n• Americans Head For The Hills, And More\n                     \t\t\t\t\t| Watch• U.S. Military Aid Reaches Lebanese Army\n                     \t\t\t\t\t| Watch• Democrats: Drive To End War Isn't Over\n                     \t\t\t\t\t| WatchU.S.Americans Head For The Hills, And More\nGas and lodging prices are up, airfares are down, and while Americans may make some adjustments in their plans, they're still\n                        traveling millions of miles over the Memorial Day weekend. More...Watch: Summer Travel Begins\n• United Jet Makes Emergency Landing• Ex-NHL Star Pleads Guilty In Gambling Case• Teen Charged With Hate Crime Over Haircut• More StoriesWorldU.S. Military Aid Reaches Lebanese Army\nU.S. military aid has been rushed into Lebanon, to help the army in its fight against an Islamic militant group holed up in\n                        a Palestinian refugee camp. Sporadic gunfire is still taking place near the camp's entrance, keeping the situation tense.\n                         More...Watch: Lebanon Cease-Fire Collapses\n• Al-Sadr Reappears In Iraq At Rally\n                     \t\t\t\t\t| Watch• Suspect Eyed In Missing British Girl Case\n                     \t\t\t\t\t| Watch• Tensions Rise In Ukraine • More StoriesPoliticsDemocrats: Drive To End War Isn't Over\nDespite a bruising loss in their bid to tie funding for the Iraq war to a deadline for U.S. troop withdrawals, Democrats insist\n                        their drive to end the war has just begun. President Bush will sign the Iraq spending bill later today. More...Watch: Bush Embraces Benchmarks\n• 2008 Primary Shuffle Causes Uproar• CBS Poll: Most Support Immigration Reform• Fred Thompson Fuels Speculation In Ct.• More StoriesHealthStudy: Too Much TV Worsens Kids' Diabetes\nDiabetic children who spent a lot of time glued to the TV had a tougher time controlling their blood sugar, according to a\n                        Norwegian study that illustrates yet another downside of too much television. More...Watch: Dr. Senay On Avandia    \n• Calm Urged For Avandia Patients• When Health Coverage Doesn't Hold Up\n                     \t\t\t\t\t| Watch• Tooth Whiteners: Something For Everyone\n                     \t\t\t\t\t| Watch• More StoriesSciTechWhale Rescuers Try New Tactic: Fire Hoses\nUnfazed by the sounds of other whales and clanging pipes, two wayward humpback whales will next encounter the spray of fire\n                        hoses, which scientists hope will herd them back toward the ocean. More...Watch: New Plan To Rescue Whales\n• Reply To E-mail Overload: \"Enough!\"• Facebook Aspires To Be The Next Microsoft• Being Here, Working There\n                     \t\t\t\t\t| Watch• More StoriesBusinessFacebook Aspires To Be The Next Microsoft\nFacebook Inc. is encouraging other companies to sell products and create software for use on the popular social networking\n                        site, hoping to expand into a universal destination on the Web.\n                         More...\n• Coke To Buy Water Maker For $4.1B• Minimum Wage Hike Approved• Can Your Finances Survive A Hurricane?• More StoriesEntertainmentProsecutors: No Charges In O'Neal Brawl\nLos Angeles prosecutors say actor Ryan O'Neal won't face charges for firing a gun during a dust-up with his eldest son earlier\n                        this year. More...Watch: O'Neal Family Feud\n• This Week: Winners & Losers\n                     \t\t\t\t\t| Watch• \"Grey's\" Star Urges Tolerance In TV Spot• \"Jericho\" Fans Go Nuts• More StoriesOpinionGo Easy On McCain\nJohn McCain's recent remark about Mitt Romney has been portrayed in the media as a sign that the Arizona senator's temper\n                        is out of control. But The New Republic asks it be seen for what it was: a pretty good joke.  More...Watch: McCain On Iraq & Campaign '08\n• What Does \"Reagan Republican\" Mean In '07?• CBS Poll: Most Support Immigration Reform• Barry Bonds: Cheater• More StoriesCBS NEWS BROADCASTSThe Early Show: Celeb Spot: Depp: Tough To Say \"So Long\" To Capt. Jack\nHe says he's \"emotional\" over the likely end of his run as the character in the \"Pirates\" series. Depp also reflects on his\n                        huge popularity, and tells how Keith Richards reacted to Capt. Jack having been based on him, on The Early Show. More...Watch: Depp On Captain Jack\n• EARLY SHOW: The Secrets Of Cupcake Perfection\n                     \t\t\t\t\t| Watch• EARLY SHOW: Find Your Way To Latest GPS Devices• EARLY SHOW: Gardening To Make Small Spaces Beautiful\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nOn The Road Despite Gas PricesTravelers should be ready to pay record-breaking gas prices over the Memorial Day weekend. But the soaring prices don't appear\n                                    to be keeping Americans off the roads. Tracie Strahan reports.\nTOP VIDEOS\nBush To Sign War Bill\nFirst Look: Assignment America\nItaly's 1st Female Gondolier?\nDepp On Captain Jack\nNotebook: The Feminine Mistake\nSony Unveils Flexible Screen\nBush: Tough Summer Ahead\nBoy Destroys Sacred Art \nU.N. Chief On Iran, Iraq\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesScott Pelley follows a National Guard unit and their families for nearly two years. This Sunday, 7 p.m. ET/PT.48 Hou!\n rs Myste\nryDouble Feature:Beginning at 9 p.m., \"A Shot In The Dark,\" reported by Susan Spencer. Then at 10 p.m., Troy Roberts\n                           report is titled \"Secrets & Lies On Grapevine Lake.\"\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}