{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "ROWLAND MOORE <mooremoorerowland@yahoo.it>", "subject": "URGENT INHERITANCE CLAIM", "body": "FROM THE DESK OF \nPRIVATE EMAIL:(mooremoorerowland@yahoo.it)\n \nURGENT INHERITANCE CLAIM\n \nGOOD DAY,\nI KNOW THIS PROPOSAL WILL COME TO YOU  AS A SURPRISE EXPECIALLY WHEN YOU DO NOT KNOW THE  WRITER, CONDSIDERING THE HUGE SUM  \nOF MONEY INVOLVED WHICH  COULD MAKE ANY APPREHENSIVE. LET ME START BY INTRODUCING MYSELF TO YOU,I AM STEVEN LEE, THE HEAD OF \nACCOUNTING DEPARTMENT OF MY BANK,WHERE AM PRESENTLY WORKING.I SAW YOUR CONTACT DURING MY PRIVATE  SEARCH AT THE INFORMATION CENTRE HERE IN MY COUNTRY CHAMBER OF COMMENCE AND INDUSTRY AND I WANT TO BELIEVE THAT YOU  WILL BE VERY HONEST, COMMITTED AND CAPABLE OF  ASSISTING IN THIS BUSINESS VENTURE.\n\nFIRSTLY, LET ME EXPLAIN THE SOURCE OF  THIS FUNDS AND WHAT YOU ARE EXPECTED TO DO. A FORIGNER LATE  MOHAMED KAMAL YASSER, OIL \nMERCHANT/CONTRACTOR, UNTIL HIS DEATH, OVER THE PAST  YEARS AGO, WAS A VICTIM OF AN EGYPTIAN AIRLINE FLIGHT 990  PLANE CRASH.\nHERE IS DETAILS ABOUT THE PLANE CRASH.(http://news.bbc.co.uk/1/world/americas/502503.stm) THE DECEASED, \nMOHAMED KAMAL YASSER,  BANKED WITH US AND HAS A CLOSING BALANCE AS A JULY 2000 WORTH  $45M (FOURTY FIVE MILLION USD). WHICH MY BANK, NOW  EXPECTES A NEXT-OF-KIN TO CLAIM AS THE BENEFICIARY OF THE FUNDS, EFFORTS HAS BEEN MADE BY MY BANK   DIRECTORS TO GET IN TOUCH WITH THE MR MOHAMED KAMAL YASSER'S FAMILY OR RELATIVE BUT TO NO SUCCESS BASED ON THE PERCEIVED POSSIBILITY OF \nNOT BEING ABLE TO LOCATE MOHAMED KAMAL'S NEXT-OF-KIN, THE MANAGEMENT  UNDER THE INFLUENCE OF OUR CHAIRMAN AND THE  BOARD OF \nDIRECTORS ARE MAKING ARRANGEMENTS FOR THE FUNDS TO  BE DECLARED UNCLAIMED AND CHANNELED TO AN UNKNOWN ACCOUNT.\nIT IS BASED ON THIS THAT WE HAVE  CONTACTED YOU TO STAND AS THE NEXT-OF-KIN OF LATE MOHAMED KAMAL  YASSER SO THAT THE FUNDS WILL BE RELEASED AND PAID INTO  YOUR ACCOUNT AS THE BENEFICIARY AND THE NEXT-OF-KIN TO THE  DECEASED.\nALL DOCUMENTS, AND PROOF TO ENABLE YOU  GET THE FUNDS HAVE BEEN CAREFULLY WORKED OUT AS WE HAVE  SECURED FROM THE\nDIFFERENT OFFICES CONCERNED FOR THE  SMOOTH TRANSFER OF THE FUND TO YOUR NOMINATED ACCOUNT.IT HAS  BEEN AGREED THAT THE\nOWNER OF THE ACCOUNT WILL BE  COMPENSATED WITH 30% OF THE REMITTED FUNDS, WHILE WE KEEP 65% AND  5% WILL BE SET ASIDE\nTO OFFSET EXPENSES BOTH LOCALLY AND  INTERNATIONAL.\nIF THIS PROPOSAL SATISFIES YOU, PLEASE  REACH ME THROUGH MY DIRECT EMAIL ADDRESS FOR MORE  INFORMATION AND ALSO SEND ME\nYOUR CONTACT TELEPHONE AND FAX NUMBER INCLUDING YOUR CELL PHONE NUMBER FOR QUICK AND EASY COMMUNICATION.\nI AWAIT YOUR URGENT RESPONSE, ALL THE BEST AND GOD  BLESS YOU. PLEASE EMAIL ME ON THIS MY PRIVATE EMAIL ADDRESS FOR\nSECURITY REASON ADDRESS:(mooremoorerowland@yahoo.it)\nYOURS FAITHFULLY\nROWLAND MOORE\n\n\n\n\n"}