{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Alex Snow <alex_snow@gmx.net>", "subject": "Re: Wireless Router", "body": "personally I don't want to use a full-fledged computer as a \nrouter...in a router I want something that's just going to run without \nany issues, and anyway a computer is overkill.  I like something thats \na small imbedded system with just enough flash/ram to be a router.\nOn \nSat, Jun 09, 2007 at 01:48:26PM -0400, ace wrote:\n> How come people don't just use their Linux box as the router and a wireless\n> switch to provide the wireless?  I don't have a lot of experience in this\n> area so let me know if I am completely off.\n> \n> \n> --\n> ace\n> Network Administrator of\n> irc.talkingirc.net\n> http://www.talkingirc.net\n> \n> \n> -----Original Message-----\n> From: speakup-bounces@braille.uwo.ca [mailto:speakup-bounces@braille.uwo.ca]\n> On Behalf Of Alex Snow\n> Sent: Friday, June 08, 2007 11:48 AM\n> To: Speakup is a screen review system for Linux.\n> Subject: Re: Wireless Router\n> \n> I like the wrt54gl (I think that's what it's called, the current one \n> that runs linux not the current one that runs vxworks)\n> \n> personally quite happy with my Cisco 2514 though...\n> On Fri, Jun 08, \n> 2007 at 08:05:14AM -0600, Dawes, Stephen wrote:\n> > This is slightly off topic, but I am looking for opinions on which\n> > wireless router to purchase.\n> > \n> > \n> > Steve Dawes\n> > Phone: (403) 268-5527\n> > Email: SDawes@calgary.ca\n> >  \n> >  \n> > \n> > \n> > NOTICE -\n> > This communication is intended ONLY for the use of the person or entity\n> named above and may contain information that is confidential or legally\n> privileged. If you are not the intended recipient named above or a person\n> responsible for delivering messages or communications to the intended\n> recipient, YOU ARE HEREBY NOTIFIED that any use, distribution, or copying of\n> this communication or any of the information contained in it is strictly\n> prohibited. If you have received this communication in error, please notify\n> us immediately by telephone and then destroy or delete this communication,\n> or return it to us by mail if requested by us. The City of Calgary thanks\n> you for your attention and co-operation.\n> > \n> > \n> > _______________________________________________\n> > Speakup mailing list\n> > Speakup@braille.uwo.ca\n> > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n> -- \n> I don't know why, but first C programs tend to look a lot worse than\n> first programs in any other language (maybe except for fortran, but then\n> I suspect all fortran programs look like `firsts')\n> \t-- Olaf Kirch\n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n> \n> __________ NOD32 2320 (20070609) Information __________\n> \n> This message was checked by NOD32 antivirus system.\n> http://www.eset.com\n> \n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n-- \n> > Other than the fact Linux has a cool name, could someone explain why I\n> > should use Linux over BSD?\n>\n> No.  That's it.  The cool name, that is.  We worked very hard on\n> creating a name that would appeal to the majority of people, and it\n> certainly paid off: thousands of people are using linux just to be able\n> to say \"OS/2? Hah.  I've got Linux.  What a cool name\".  386BSD made the\n> mistake of putting a lot of numbers and weird abbreviations into the\n> name, and is scaring away a lot of people just because it sounds too\n> technical.\n\t-- Linus Torvalds' follow-up to a question about Linux\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}