{"category": "ham", "to_address": "\"'Speakup is a screen review system for Linux.'\" <speakup@braille.uwo.ca>", "from_address": "\"Georgina Joyce\" <gena-j@bulldoghome.com>", "subject": "RE: Regarding running Linux with Speakup under a virtual machine\n\twithWindows XP", "body": "Hi\n\nI can't help precisely with your question but wondered if you had considered all your options?\n\nHad you considered making a dual boot machine and having the boot loader load windows by default?  By having a timeout of 10 seconds it increases the boot up time by ten seconds but you can hit enter to start the boot.  I like good old lilo, it's easy to have it beep at the prompt and you can use single key, i.e. you just a single letter to choose the boot option.\n\nBut having said which, why not teach your father to use Linux?  If he only wants to browse the web you could have it boot directly into a web browser.  Put Firefox on Windows and when's used to it move him over to Linux.  As for your VOIP, I'm sure that there are Linux solutions for you.  As a side issue, Chess has been discussing the best option in his recent Linux Reality pod casts.\n\n\n\nGena\n\nAmateur Call: M 0 E B P\n\nVOIP / IM: gena1959uk\n\n\n\n-----Original Message-----\nFrom: speakup-bounces@braille.uwo.ca [mailto:speakup-bounces@braille.uwo.ca] On Behalf Of Keith Hinton\nSent: Thursday, June 07, 2007 7:41 PM\nTo: speakup@braille.uwo.ca\nSubject: Regarding running Linux with Speakup under a virtual machine withWindows XP\n\n\nHi all on the list,\nHere is an interesting situation I am in.\nI have a Windows XP Media Center Edition box that I mainly use for Skype \nreasons and other voice over IP things that Linux sadly does not seem to \nhelp me with.\nNow, I still want to run Linux, but can not do so by whiping out Windows, \nbecause the last time I did that my father unknown to me tryed to look up \nsomething online. As you may expect, he only knows Microsoft Windblows, so \nwhen he saw a Linux login terminal, he shut the system down the hard way \nbecause he could not figure out how to get back into it.\nSo, I reinstalled a clone of my working Gateway computer, and because of the \nhardware, Windows XP is actually stable, most of the time believe it or \nnot.Now, would it be possible to use VMWare worksation and run Linux and \nisntall it, and use software speech with Speakup? Any considerations that I \nshould take into account first? Will this work? Let me know. Regards,--Keith \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n__________ NOD32 2317 (20070607) Information __________\n\nThis message was checked by NOD32 antivirus system.\nhttp://www.eset.com\n\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}