{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nRisk Management 101: Managing Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nEPRI's Value \n\t\t\tand Risk in Energy Markets - Introduction & Principles\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (Jun. 4, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 4, 2007\n\n\nJun 4, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for June 4, 2007  \n\n\n\nFirst Enercast Featured Articles for June 4, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nJun 4, 2007 PowerMarketers Industry Publications\n\n\n\nBiofuels: A Sustainable Momentum for Europe? (UtiliPoint.com - Jun. 4, 2007) \n\n\n\nUtiliPoint.com - Jun. 4, 2007 - Earlier this year the European Commission unveiled a target of increasing the share of biofuels used in transport to 10 percent by 2020.\n\n\nJun 4, 2007 PowerMarketers Industry Publications\n\n\n\nEnergy Trading and Risk Management Software Implementation Study (UtiliPoint.com - Jun. 4, 2007)\n\n\n\nUtiliPoint.com - Jun. 4, 2007 - UtiliPoint International is conducting an examination of the implementation of energy trading and risk management software in the North American energy sector.  \n\n\nJun 4, 2007 PowerMarketers Industry Publications\n\n\n\nCarrying Out Public Policy (EnergyBiz Insider - Jun. 4, 2007)\n\n\n\nEnergyBiz Insider - Jun. 4, 2007 - Angry citizens have been giving the U.S. Department of Energy an earful, saying that they don't want high voltage power lines built near their properties.\n\n\nJun 4, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nCity studying gas rate increase\n\n\n\nJun. 3--DANVILLE -- Ryan Hatch paid a $112.34 natural gas bill in January. His natural gas bill for next January could go up $8.30 if Danville City Council adopts a proposed natural gas rate increase set to go into effect July 1. Council held a special work session May 15 devoted to the proposed 6 percent natural gas rate hike and an 18 percent increase in the city's wastewater rate.\n\n\nJun 3, 2007 Knight Ridder Tribune Business News\n\n\n\nGet paid for making shade: Solar panels generate profits, ward off heat\n\n\n\nJun. 3--Aquila is looking for a few good solar panels, and will pay you a little if you have one.  The electrical utility company has started a rebate program for people in the Aquila service area who can supply solar power or the energy credit created by having a renewable energy source. Kenny Romero, Aquila manager of renewable energy, said the program stems from a legislative measure, ...\n\n\nJun 3, 2007 Knight Ridder Tribune Business News\n\n\n\nJoining power grid no easy switch: 3 with own turbines face hassles as PUCO figures pay formula\n\n\n\nJun. 4--ELMORE -- It sounds so simple.  You make a big investment in wind power, solar power, or some other form of renewable energy that can put a dent in your electric bill. During peak months, you actually generate more power than what you use. So, you sit back and wait with glee for your next bill to arrive in the mail, knowing you're supposed to get reimbursed by FirstEnergy Corp.\n\n\nJun 4, 2007 Knight Ridder Tribune Business News\n\n\n\nFederal officials want pipeline project details\n\n\n\nJun. 4--Developers of a natural gas pipeline that would run through Indiana are feeling pressure from federal officials that could delay construction of the $4.5 billion project.  Critical environmental information is missing from the federal application for Rockies Express-East -- the easternmost leg of a 1,663-mile pipeline that would run from Colorado to Ohio.\n\n\nJun 4, 2007 Knight Ridder Tribune Business News\n\n\n\nMeeting to discuss gas storage plans\n\n\n\nJun. 4--An open house Tuesday at Lamar University will share information on an underground natural gas storage facility proposed for the Beaumont area.  AGL Resources Facility expects construction work on the $180 million project to begin next year, with it going into operation in 2010. Company personnel will meet with community leaders and residents Tuesday from 5 to 7 p.m.\n\n\nJun 4, 2007 Knight Ridder Tribune Business News\n\n\n\nBad weather leaves 10,000 without power in metro Detroit\n\n\n\nJun. 3--About 10,000 metro Detroiters still are without power -- though they're not necessarily the same customers who were in the dark as a few hours ago. That's because the wave of bad weather that's been affecting Detroit Edison customers is prompting a game of musical chairs, knocking power out from one area just as DTE restores power to another. \"We've had no significant additional ...\n\n\nJun 3, 2007 Knight Ridder Tribune Business News\n\n\n\nDAN WALLACH: Senate sees us as good for what ails ERCOT\n\n\n\nJun. 3--It's amazing that anything gets through a Texas legislative session, given the combat among its members, the open hostilities and the mutinies. Sausage and laws, they say. You don't want to see either one made. One casualty of this year's session was a bill that got through the state House and disappeared in the state Senate. If more strenuous support had accompanied it, then Entergy ...\n\n\nJun 3, 2007 Knight Ridder Tribune Business News\n\n\n\nFairacres man energized by wind turbine\n\n\n\nJun. 4--LAS CRUCES -- Ben Sloter wasn't looking to save money, be green or show off to his neighbors.  He wasn't looking to be first either. Sloter, 86, just likes to stay active. In his latest project, he shunned solar panels for aesthetic reasons and instead installed a 40-foot tall power-generating wind turbine just outside his garage almost two weeks ago.\n\n\nJun 4, 2007 Knight Ridder Tribune Business News\n\n\n\nFTC gets order to delay Equitable-Dominion merger\n\n\n\nJun. 4--The Federal Trade Commission has won an order from a federal appeals court to prevent Equitable Resources Inc. from acquiring local competitor Dominion Peoples Gas, until the court can consider an appeal on the full case. The U.S. Court of Appeals for the Third Circuit granted the FTC's emergency request for an injunction to stop North Shore-based Equitable from paying $970 million for ...\n\n\nJun 4, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\n1,000th GE 1.5-MW wind turbine shipped for FPL Energy project\n\n\n\n-- GE Energy and FPL Energy have announced the shipment of the 1,000th GE 1.5-MW wind turbine for an FPL Energy project. The unit will be among the 267 machines GE is supplying for FPL Energy's Peetz Table Wind Energy Center in Colorado. By year-end 2007, the number of GE wind turbines used in FPL Energy projects will be 1,426--going back to the Montfort, Wisc.\n\n\nJun 4, 2007 Power Engineering\n\n\n\nUtility's rates still tops in region\n\n\n\nBy MIKE DENNISON of the Missoulian State Bureau HELENA - If you think your electric bill has been defying gravity lately, you're right: NorthWestern Energy, which serves 320,000 customers in Montana, still has the highest rates of any major utility in the region.As of Friday, rates for NorthWestern's residential customers stood at 9.59 cents per kilowatt-hour - a full penny higher than the ...\n\n\nJun 3, 2007 Missoulian\n\n\n\nBuckeye tosses wrench at pipe plan\n\n\n\nThe thought of a massive natural gas pipeline only a few feet underground and running through a masterplanned community in Buckeye has town officials cringing. Transwestern Pipeline Co. wants to build the natural-gas pipeline through Buckeye's planned development boom along Sun Valley Parkway. The 259-mile underground pipeline would run from Ash Fork in Coconino County, south through Yavapai and ...\n\n\nJun 4, 2007 Tucson Citizen\n\n\n\nNevada solar plant to power 15,000 homes\n\n\n\nThe Nevada Solar One parabolic trough power plant located in Boulder City, near Las Vegas, will begin supplying power to the grid. The  64 megawatt power plant is the first large solar thermal power plant to be built in 15 years and will generate approximately 129 million kilowatt hours of solar electricity annually, Glass on Web reported. ...\n\n\nJun 4, 2007 Washington Times\n\n\n\nThe SEC reportedly supports Enron shareholders in high court case\n\n\n\nWASHINGTON: The U.S. Securities and Exchange Commission has decided to support shareholders suing Wall Street banks for damages over Enron's collapse in a seminal case before the Supreme Court, according to a newspaper report. The Enron shareholders' $40 billion lawsuit contends that Merrill Lynch, Barclays and Credit Suisse Group should be held equally liable as Enron as participants in the ...\n\n\nJun 3, 2007 International Herald Tribune\n\n\n\nKansas' reliance on coal for power shows in emissions\n\n\n\nThree-fourths of the electricity Kansans use comes from coal-fired generating plants, and that heavier-than-average reliance on coal helps explain why the state is among the top 10 in carbon dioxide emissions per person. Because most scientists link CO2 to global warming, such a heavy reliance on coal worries environmentalists. Two Lawrence environmentalists are suing the Kansas Department of ...\n\n\nJun 3, 2007 Kansas City Star\n\n\n\nReport: SEC is supporting Enron shareholders in high court case\n\n\n\n[ Top ] By MARCY ZOMBIE AP Business Writer WASHINGTON (AP) -- The Securities and Exchange Commission has decided to support shareholders suing Wall Street banks for damages over Enron's collapse in a significant case before the Supreme Court, according to a newspaper report Saturday. The Enron shareholders' $40 billion lawsuit contends that Merrill Lynch & Co., Barclays PLC and Credit Suisse ...\n\n\nJun 3, 2007 Charleston Gazette\n\n\n\n\n\nDTE Energy To Open Two Customer Offices in Detroit\n\n\n\nDETROIT, June 4 /PRNewswire-FirstCall/ -- DTE Energy will open two new customer offices in Detroit in an effort to better serve its customers. The new offices - at 2835 Bagley in MexicanTown and at 3000 Gratiot - will replace customer offices in Royal Oak, Hamtramck and Dearborn. The MexicanTown office will open June 11, while the Gratiot office will open July 23.\n\n\nJun 4, 2007 PR Newswire\n\n\n\nTenaska Power Fund, eCORP Announce Major Gas Storage Development\n\n\n\nTenaska Power Fund, L P. (TPF) of Omaha and eCORP, LLC of Houston, Texas today announced plans to develop a major new high-performance natural gas storage facility near Uniontown in southwestern Pennsylvania.     The facility will be developed by a jointly-owned entity, Chestnut Ridge Storage, LLC.     In the first phase of development, the facility is expected to provide about 17.5 billion cubic ...\n\n\nJun 4, 2007 PR Newswire\n\n\n\nTransCanada's Five-Year Settlement for Canadian Mainline Approved by NEB\n\n\n\nTransCanada Corporation's (TSX: TRP)(NYSE: TRP) (TransCanada) wholly owned subsidiary, TransCanada PipeLines Limited, announced today it has received approval from the National Energy Board (NEB) for a five-year settlement with stakeholders regarding 2007 tolls and costs for years 2008 to 2011 on its Canadian Mainline natural gas transmission system. The terms of this settlement are effective ...\n\n\nJun 4, 2007 Internet Wire\n\n\n\nAverage U.S. Electricity Prices Jump 4.7 Percent\n\n\n\nFollowing a stunning increase of nearly 11 percent in the year ending in April 2006, the average price of electricity for industrial or large commercial entities in the United States jumped another 4.7 percent over the past year. The annual survey by an independent consulting company, NUS Consulting Group of Park Ridge, N.J., found that the average price of electricity in the United States ...\n\n\nJun 4, 2007 PR Newswire\n\n\n\nOctillion Achieves Breakthrough in Development of Transparent Windows Capable of Generating Electricity\n\n\n\nVANCOUVER, British Columbia--(BUSINESS WIRE)--Octillion Corp. (Pink Sheets:OCTL) today announced that in early models of Octillions transparent photovoltaic NanoPower Windows, scientists have successfully engineered and assembled a mechanically stable, see-through developmental prototype, which achieves optically active down-conversion and displays good electrical properties with no electrical ...\n\n\nJun 4, 2007 Business Wire\n\n\n\nBioCentric Energy and Core Ventures (BCEI/Core) Announce Joint Venture Agreement With Sustainable Power Corp. (SSTP)\n\n\n\nBCEI/Core announces today the signing  BCEI/Core announces today the signing of a Joint Venture Agreement with Sustainable Power Corp. (PINKSHEETS: SSTP) to capitalize on their unique Rivera Process of Hydrolysis/Pyrolysis which delivers Cellulosic Ethanol. The first negotiated facilities to deliver this revolutionary solution are in Mason City, Iowa with a projected completion date of first ...\n\n\nJun 4, 2007 Internet Wire\n\n\n\nFitch Global Power Quarterly: U.S. Transmission Investment Moves Forward\n\n\n\n02:45 PM Eastern Daylight Time Fitch Global Power Quarterly: U.S. Transmission Investment Moves Forward NEW YORK--(BUSINESS WIRE)--In Fitch Ratings' opinion, recent changes to final Federal Energy Regulatory Commission (FERC) incentive transmission rules are unlikely to derail the anticipated acceleration of transmission projects by utilities over the next several years, as discussed in Fitch's ...\n\n\nJun 4, 2007 Business Wire\n\n\n\nTransglobal Mining Announces Surprise Lake Uranium Project\n\n\n\nTransglobal Mining Corp., (\"The Company\") (OTCBB: TMNC)(FRANKFURT: KWE) Transglobal Mining has purchased the mineral rights to 2,865 hectares of land for the purpose of Uranium exploration in the Surprise Lake area of British Columbia in the hopes of accessing uranium deposits that are believed to exist in this area.  Transglobal Mining Corp., (\"The Company\") (OTCBB: TMNC)(FRANKFURT: KWE) ...\n\n\nJun 4, 2007 Internet Wire\n\n\n\n\n\nFortum launches EIA for Loviisa power plant area\n\n\n\nFortum launches EIA for Loviisa power plant areaFinnish energy provider Fortum has launched an environmental impact assessment process to evaluate the possibility of building a new 1,000MW to 1,800MW nuclear power plant at the company's Loviisa nuclear power site at Hastholmen, Sweden.Fortum said that the Loviisa 3 project is intended to increase the production of environmentally-benign, ...\n\n\nJun 4, 2007 Datamonitor\n\n\n\nPublic comment sought on wind energy plan\n\n\n\nThe Latrobe City Council is seeking public comment on its draft strategy for wind energy developments. The city's manager of planning and development, Carol Jeffs, says the plan looks at current uses of land in the municipality, and local industry potential. Ms Jeffs says although Latrobe is not as windy as other areas in Victoria, existing energy infrastructure may assist in future projects ...\n\n\nJun 4, 2007 ABC Online\n\n\n\nPhysicists turn 'waste' into electricity\n\n\n\nPhysicists have developed a way to turn heat into sound and then electricity, suggesting a new way to effectively recycle waste energy. \"We are converting waste  in an efficient, simple way by using sound,\" said the scientist who led the effort, Orest Symko of the University of Utah. \"It is a new source of renewable energy from waste heat.\" Symko's recycling devices are cylinder-shaped ...\n\n\nJun 4, 2007 MSNBC\n\n\n\nNew Fuel Cell Twice As Efficient As Generators\n\n\n\nHank Green writes 'A new kind of Solid Oxide  Fuel Cell has been developed that can consume any kind of fuel, from hydrogen to bio-diesel; it is over two times more efficient than traditional generators. Acumentrics is attempting to market the technology to off-grid applications (like National Parks) and also for home use as personal Combined Heat and Power plants that are extremely efficient ...\n\n\nJun 4, 2007 Slashdot\n\n\n\nTrigon Completes Agreement to Acquire White Canyon Uranium Mines\n\n\n\nTrigon Uranium Corp. ('Trigon' or 'the Company') (TSX-V:TEL - News) today announced that it has completed a definitive agreement to acquire the mining rights to six Utah uranium mines ('the Properties') by way of a Lease and Option Agreement with Shumway Brothers Mining LLC and other owners of the properties ('the Lessors'). This acquisition is the first step in Trigon's plan to establish a ...\n\n\nJun 4, 2007 Yahoo!\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nEnergy companies make wind power a top investment\n\n\n\nLONDON: From Mitsubishi Heavy Industries to E.ON, the world's largest companies are investing in wind power, the best-performing energy in the past year. Led by Vestas Wind Systems and Iberdrola of Spain, utilities and governments in the United States, China and Europe will spend as much as $150 billion on wind projects in the next five years, according to CLSA Research.\n\n\nJun 4, 2007 International Herald Tribune\n\n\n\nAlstom to Construct the Largest Combined Heat and Power Plant in the UK\n\n\n\nLEVALLOIS PERRET, France--(BUSINESS WIRE)-- Regulatory News : Alstom (Paris:ALO) has signed a contract worth 580 million euro with the European utility E.ON for the construction of a 1,275 MW turnkey combined heat and power plant (CHP)* at the Isle of Grain in Kent, United Kingdom. In addition, Alstom has signed a long-term service agreement with E.ON for a twelve year period.\n\n\nJun 4, 2007 Business Wire\n\n\n\nMWH Awarded Three Ohio Hydroelectric Projects\n\n\n\nMWH, a global provider of environmental engineering, construction and strategic consulting services, announced today that it has been selected by American Municipal Power-Ohio (AMP-Ohio) to serve as  the Owner's Engineer for the design and construction of three new hydroelectric projects on the Ohio River. All three facilities will be located at existing locks and dams and will have a combined ...\n\n\nJun 4, 2007 PR Newswire\n\n\n\nCB&I Awarded LNG Project in Chile\n\n\n\nTHE WOODLANDS, Texas--(BUSINESS WIRE)--CB&I (NYSE:CBI) has been awarded a contract by GNL Quintero S.A. of Chile to build a liquefied natural gas (LNG) regasification terminal at Quintero Bay, Chile. The contract is valued at approximately $775 million. GNL Quintero S.A. is a joint venture between Endesa Chile, ENAP, Metrogas Chile and BG Group plc (NYSE:BRG).\n\n\nJun 4, 2007 Business Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}