{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Computers & Electronics Newsletter July 5, 2007", "body": "July 5, 2007 \nRSS | \ncomputers & electronicsThis Week's Highlights:\nHow Computer Keyboards WorkHow to Buy a Laptop\nHow Inkjet Printers WorkHow Motes Work\nHow Google Earth Works \nThis Month in History - July - Just about everyone in the United \nStates has heard of the little town known as Roswell, N.M. Most people know that there is some connection \nbetween Roswell\nand UFOs. But not many people know the real details. Read more about\nthis and other major events that happened in the month of July.    This week's trivia question:How many keys are on a computer keyboard? \nFind out\n   \nHow Computer Keyboards Work\n- With all the extras and options that are available for new computer\nkeyboards, it's hard to believe that their original design came from\nmechanical typewriters that didn't even use electricity. Learn about\nkeyboard technology.     This week's video:\nHow to Buy a Laptop - Laptops are now almost as popular as desktop computers. This video\n from HowStuffWorks will show you the key factors to consider when buying a laptop.  \n    Also at HowStuffWorks:\n How Inkjet Printers Work\n - An inkjet printer is any printer that places extremely small droplets of ink onto paper to create an image.  Learn about the various parts of an inkjet printer and how these parts work together to create an image.  \n How Motes Work\n - Smart dust sounds like something out of a Disney movie, but it's not. Also called a mote or a wireless sensing network, this new technology is intriguing everyone from military personnel to vineyard owners. Find out what the big deal is and explore the many possible applications of this tiny device. \n How Google Earth Works \n- Online mapping programs are great for those of us who get lost easily, and they're just plain fun. Google Earth is available for download as a desktop application, although you need to be connected to the Internet to use it.  Learn why Google Earth is no ordinary mapping application.   \n   \nComing Soon: How the iPhone WorksHow Virtual Reality Works   \n\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please unsubscribe here\n or change your preferences using our profile manager.To view this email as a web page, click here.\nHowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved"}