{"category": "ham", "to_address": "<Ip-health@lists.essential.org>", "from_address": "<msfh-india-medco-assist@field.amsterdam.msf.org>", "subject": "[Ip-health] INDIANS WECOME MOVE TO OVERCOME PATENTS ON ESSENTIAL DRUGS IN THAILAND", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\n\nINDIANS WECOME MOVE TO OVERCOME PATENTS ON ESSENTIAL DRUGS IN THAILAND\n\n\n\nCOMPULSORY LICENSES NEEDED TO REDUCE PRICES OF ESSENTIAL DRUGS\n\n\n\nNew Delhi, 26 April 2007 - The Delhi Network of Positive People (DNP+) and the Lawyers Collective HIV/AIDS Unit (LCHAU) today joined  public interest and health groups around the world to demonstrate their support for the actions of the Thai Government to increase access to essential medicines for their citizens.\n\n\n\nSince November 2006, Thailand has issued compulsory licenses for three patented medicines, including the AIDS drugs efavirenz and lopinavir/ritonavir. This procedure authorises the Thai health authorities to begin producing or importing affordable generic versions of the drugs, which are patented in Thailand.\n\n\n\nCompulsory licenses are a legally recognised means to overcome barriers in accessing affordable medicines. 'The use of compulsory licenses to improve access to essential medicines is fully consistent with the World Trade Organization TRIPS Agreement, which sets out the international rules on patents', says Kajal Bhardwaj of the Lawyers Collective.\n\nIn reaction to the Thai health authorities' decision, Abbott, the US-based multinational pharmaceutical company, has decided not to bring to the Thai market any of its new medicines, including a crucially important HIV/AIDS drug (heat-stable lopinavir/ritonavir).\n\nIndian organizations are strongly condemning Abbott's decision to pressurize the Thai government to withdraw the compulsory licenses. Loon Gangte from DNP+, speaking at a rally held in Delhi said, 'Abbott's action of holding the lives of Thai patients to ransom is unethical, immoral and criminal'. He added, 'compulsory licenses on medicines are necessary when essential medicines, which are patented, are unavailable or unaffordable.'\n\nSince the issuance of a compulsory license on the AIDS drug Efavirenz in November 2006, the Thai Government has been able to buy generic versions of the drug at much lower prices and will be able to provide it to an additional 20,000 people in need.\n\nAt the rally in New Delhi, the medical humanitarian organization MSF once again expressed its support for the Thai government and urged it to continue with its policy of issuing such licenses for the production of other essential medicines. 'In our HIV treatment programmes, high prices and a lack of availability of newer AIDS drugs severely restrict access to treatment. Where patents pose a barrier to access, countries need to issue compulsory licenses to procure essential drugs at affordable prices', says Leena Menghaney, MSF's Access Campaigner in India.\n\nIndian organisations are also calling on their government to show support for the Thai government's decision. 'The silence of our government on what is happening with our Thai colleagues is unacceptable. If the Indian government is serious about promoting access to medicines for all, they must support the decision to issue compulsory licenses on AIDS drugs', says Mike Tonsing from DNP+.\n\n\n\nDeveloping countries that are under a product patent regime, are increasingly feeling the need to issue licenses to procure drugs from an alternative producer of the essential drug. This can lead to greater local availability of the medicine and also significant savings on costs for patients and the national health budget.\n\n\n\n******************\n\nLeena Menghaney\nProject Manager - India\nCampaign for Access to Essential Medicines\nMedecins Sans Frontieres\nC 106 Defence Colony\nNew Delhi 110 014\nTel: +91 9811365412, +91 1124332419\n\n\n\n\n\n\n\n--\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}