{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Berwin A Turlach <berwin@maths.uwa.edu.au>", "subject": "Re: [R] ED50 from logistic model with interactions", "body": "\n\nOn Wed, 02 May 2007 11:37:22 +1000\nKate Stark  wrote:\n\n> [...] My model is:\n> \n> fit <- glm(Mature ~ Season * Size - 1, family = binomial, data=dat)\n> \n> where Mature is a binary response, 0 for immature, 1 for mature. There\n> are 3 Seasons.\n\nI would use:\n\t\n    fit <- glm(Mature ~ Season/Size - 1, family=binomial, data=dat)\n\nWith this parameterisation you get the three intercepts and the three\nslopes directly (together with there standard errors from summary()).\nMakes life simpler for your calculations.\n\n> In Faraway(2006) he has an example using the delta method to calculate\n> the StdErr, but again without any interactions. I can apply this for\n> the first Season, as there is just one intercept and one slope\n> coefficient, but for the other 2 Seasons, the slope is a combination\n> of the Size coefficient and the Size*Season coefficient, [...]\n\nNot with the above parameterisation, so life is easier.  I don't have\nmy copy of Faraway (2006) handy at the moment, so I cannot vouch that\nyou can use the method the describes now directly.  But I expect you\ncan. :)\n\n> I could divide the data and do 3 different logistic regressions, one\n> for each season, but while the Mat50 (i.e. mean Size at 50% maturity)\n> is the same as that calculated by the separate lines regression, Im\n> not sure how this may change the StdErr?\n\nAs far as I can tell, there should be no difference.  Compare the\nestimates and their standard errors that you obtain from the 3\ndifferent logistic fits with the estimates and standard errors from the\nparameterisation that I suggested.  They should be the same. \n\nHope this helps.\n\nCheers,\n\n\tBerwin\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}