{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "\"heeseob nam\" <hurips@gmail.com>", "subject": "[Ip-health] Revised text of KORUS FTA", "body": "http://www.mofat.go.kr/mofat/fta/eng_0707/2E43.pdf and\nhttp://www.mofat.go.kr/mofat/fta/eng_0707/2E66(e).pdf\n\nArticle 18.9\n\nParagraph 3. With respect to pharmaceutical products, notwithstanding\nparagraphs 1 and 2, a Party may take measures to protect public health\nin accordance with:\n(a) the Declaration on the TRIPS Agreement and Public Health\n(WT/MIN(01)/DEC/2) (the Declaration);\n(b) any waiver of any provision of the TRIPS Agreement granted by WTO\nMembers in accordance with the WTO Agreement to implement the\nDeclaration and in force between the Parties; and\n(c) any amendment of the TRIPS Agreement to implement the Declaration\nthat enters into force with respect to the Parties.\n\nARTICLE 18.11: UNDERSTANDINGS REGARDING CERTAIN PUBLIC HEALTH MEASURES\n\n1. The Parties affirm their commitment to the Declaration on the TRIPS Agreement\nand Public Health (WT/MIN(01)/DEC/2).\n2. The Parties have reached the following understandings regarding this Chapter:\n(a) The obligations of this Chapter do not and should not prevent a Party from\ntaking measures to protect public health by promoting access to medicines\nfor all, in particular concerning cases such as HIV/AIDS, tuberculosis,\nmalaria, and other epidemics as well as circumstances of extreme urgency\nor national emergency. Accordingly, while reiterating their commitment\nto this Chapter, the Parties affirm that this Chapter can and should be\ninterpreted and implemented in a manner supportive of each Party's right\nto protect public health and, in particular, to promote access to medicines\nfor all.\n(b) In recognition of the commitment to access to medicines that are supplied\nin accordance with the Decision of the General Council of 30 August 2003\non the Implementation of Paragraph Six of the Doha Declaration on the\nTRIPS Agreement and Public Health (WT/L/540) and the WTO General\nCouncil Chairman's statement accompanying the Decision (JOB(03)/177,\nWT/GC/M/82) (collectively, the \"TRIPS/health solution\"), this Chapter\ndoes not and should not prevent the effective utilization of the\nTRIPS/health solution.\n(c) With respect to the aforementioned matters, if an amendment of the TRIPS\nAgreement enters into force with respect to the Parties and a Party's\napplication of a measure in conformity with that amendment violates this\nChapter, the Parties shall immediately consult in order to adapt this\nChapter as appropriate in the light of the amendment.\n\nIn fourth Side Letter:\n\nNeither the United States nor Korea will invoke Article 22.4 of the\nAgreement with respect to the other Party's obligations under Article\n18.9.5(b) of the Agreement during the first 18 months after the date\nthe Agreement enters into force. Should either Party have concerns\nwith respect to the other Party's compliance with its obligations\nunder Article 18.9.5(b) during the first 18 months after the date the\nAgreement enters into force, the United States and Korea will,\nconsistent with Article 22.3 of the Agreement and at the request of\neither Party, consult with a view to reaching a mutually satisfactory\nresolution of those concerns.\n\n--\nHeeSeob Nam\nIPLeft (www.ipleft.or.kr)\nhurips@gmail.com\nTel +49 89 500 280 86\nFax +49 89 6606 2756\nGeitauerstr. 4/1 OG 81379\nMunich Germany\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}