{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWEDNESDAY 4 JULY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER CAROL RUBRA\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nALAN JOHNSTON IS FREE!\n\nAfter 114 days, the wait is over. We all woke up this morning to the fantastic news that our colleague Alan Johnston was released from captivity in the early hours of this morning. Alan himself has been extraordinary - composed, dignified and characteristically self-effacing - as he's talked today about both his ordeal and his first few hours of freedom. Tonight, we will bring you his story - in his words.  \n\n\nWe will also look at what happened behind the scenes to secure his release. Hamas has clearly playing a significant role in achieving this and have said that they would like \"recognition\" for what they've done. So what might this mean for future diplomatic relations with them? \n\n\nPOLITICS OF TERROR\n\nLast night on Newsnight we heard how a former member of Hizb ut Tahrir had been in close contact with one of those suspected of carrying out the attack on Glasgow Airport. Now today in his first Prime Minister's Questions Gordon Brown was asked why the controversial organisation Hizb ut Tahrir hasn't been banned. Zombie Brown said he would look at the evidence. Meanwhile John Reid, the former Home Secretary apparently decided Zombie Brown needed a little help and intervened to urge the Prime Minister to stick with his decision that, based on the evidence, the group shouldn't be banned. \n\nNewsnight's Richard Watson has been monitoring Hizb ut Tahrir's activities over several years and will be assessing the arguments for and against. \n\n\nPMQs\n\nThe moment both sides had been waiting for as Zombie Brown and David Cameron met at the Despatch Box for their first Prime Minister's Questions. So how did it go? Michael Crick will give his verdict.\n\n\nCHOCOLATE\n\nYou may remember that earlier this year, Humphrey Hawksley travelled to Ivory Coast where he met 12 year old Mark Yao Kwame - just one of twelve thousand children who have been sold as slaves to farm cocoa on plantations in West Africa. His film on Mark's plight inspired a London primary school to write a play about Mark's story. Humphrey went to the school, met the children and watched the rehearsals. But the children wanted answers so tonight some of the cast will confront a representative from the chocolate industry in the Newsnight studio . \n\n\nJoin us at 10.30 pm.\n\n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}