{"category": "spam", "to_address": "<IPLACEREPORTS@flax9.UWATERLOO.CA>", "from_address": "\"JohnLansing@InvestorPlace.com\" <JohnLansing@InvestorPlace.com>", "subject": "Get the story behind the headlines", "body": "===============================================================\n   We love giving our InvestorPlace.com members benefits like \n               access to this timely message.  \n\n    In order to ensure you keep receiving special alerts \n   and offers like this one, please take a moment to click \n         the link in this message to reconfirm that \n     this is the email address where you want to receive \n               emails from InvestorPlace.com.\n===============================================================\n\nJune 6, 2007\n\n              \"NASDAQ Hits 6 Year High\"\n                \"Dow Sets New Record\"\n\nThose are the leads on the evening news lately.  Everyone is \nmaking a big deal out of the markets going up, up, up.  But \nwhat they're not telling you is the real story behind those \nheadlines...and the real story ain't pretty.  Yes, the markets \nare moving up, but they forgot to take most stocks along for \nthe ride.  Chip stocks aren't participating.  Financial stocks \naren't participating.  Unleaded gas has been moving higher, \nbut the rest of the energy patch - heating oil, natural gas, and \ncrude oil are down from their highs.  \n\nMeanwhile, I've been studying the big picture, and all of the \nfactors are lining up and pointing in one direction, and one \ndirection only: Down.\n\nIt has been a month since I got my Trending123 subscribers \nout of the market. But we're not in hiding.  We're just \nwaiting.  Waiting for the correction I know is coming.  \nWaiting to jump back in to the market and profit while \nunprepared investors panic.  \n\nWhen we do start trading again, it will be in a select few \nstocks.  Sign up for Trending123 today, and be the first to \nknow when (and where) it's safe to go back in the water. \nhttp://confirm.investorplace.com/c/conf?CRRHCSJUSP-3317975-8FP141-8FP141-IPLACEREPORTS@SPEEDY.UWATERLOO.CA\n\n===============================\nIt's hard out here for a trader\n===============================\n\nI sent a message to my subscribers just the other day, \nreminding them, \"This is what you pay me for.\"  My job is to \nfind great trades for sudden profits, but it is also to save my \nsubscribers from losses.  And trust me, that IS what I am \ndoing for them right now.  Every time the market takes a \nlittle dip, I get the emails: \"Is this it?  Is the party finally \ngetting started? How about shorting this stock?\"  Every time \nthe market goes up, people start hinting around that maybe, \njust maybe, there are some stocks out there that are going to \ngo up...and we could buy some of them...\n\nThat's when I crack the whip and yell \"No!\" in the trading \nroom and on the message boards.  Knowing which stocks to \nbuy is only half the battle.  You also have to know when \nNOT to buy, and to have the discipline to not make bad \ntrades.  At Trending123, we make trades based on what I see \nin the charts, and right now the charts are telling me, \"Stay \non the sidelines.\"  The only way to lose money when you're \nin cash is if there's a hole in your pocket.  \n\n===========================\nDid I just see a snowflake?\n===========================\n\nJoin me at Trending123 LINK and I will work tirelessly for \nyou...chasing down the pieces of the puzzle that tell us the \ntrue macroeconomic picture, like the carry trade, what's \nreally going on in the OIH and how chip stocks are a good \nindicator of what's to come...watching the charts for the \nright buying opportunity...and keeping you up to date on \nwhat's happening, so your money is safe.  \n\nListen, I know it's 80 degrees outside and I'm calling for a \nblizzard.  But believe me, when the blizzard hits, I'm going \nto be doing the \"I told you so\" dance.  I called the correction \nback in February.  I'm calling this one too, and I want you to \nbe doing that dance right along with me.  Sign up for \nTrending123 today, and then get ready to put on your \ndancing shoes.  http://confirm.investorplace.com/c/conf?CRRHCSJUSP-3317975-8FP141-8FP141-IPLACEREPORTS@SPEEDY.UWATERLOO.CA\n\n\nSincerely,\nJohn Lansing\n\nP.S. This is all playing out exactly the way I said it would. I \nam not backing down from my call of a correction. I am still \n110% sure that it will happen.  I can't tell you what day and \nwhat time - I'm a technician, not a fortune teller.  But I can \nmake sure you are absolutely prepared when the correction \nhappens...I can help prevent you from losing money...I can \nmake sure you get to make money in a down market.  All you \nhave to do is sign up for Trending123 today.  \nhttp://confirm.investorplace.com/c/conf?CRRHCSJUSP-3317975-8FP141-8FP141-IPLACEREPORTS@SPEEDY.UWATERLOO.CA\n\n\n---------------------------------------------------------\nMANAGE YOUR INVESTORPLACE ACCOUNT:\n\nWe hope this timely investing advice is valuable to you.\nPlease tell us if your email has changed by visiting here:\nhttp://investorplace.com/ipi/e/\n\nIf you would rather not receive actionable investing advice from\nInvestorPlace advisors, you can let us know by visiting\n\nhttp://www.investorplace.com/u/?p=8FP141-1&e=IPLACEREPORTS%40SPEEDY.UWATERLOO.CA\n\nWe will honor your request within 7-10 days.\n\nACP Phillips Investment Resources, LLC,\n2420A Gehman Lane\nLancaster, PA 17602\n\nCopyright (c) 2007 ACP Phillips Investment Resources, LLC.\nAll rights reserved.\n\n\n\n06/06/2007 6:33PM\n\n--------------------------------------------------------------------\nThank you for subscribing to InvestorPlace.com. Please note that \nwe cannot be liable for any missed bulletins caused by overzealous \nspam filters. To ensure that you continue to receive this valuable \npart of your service please take a moment to add (JohnLansing@InvestorPlace.com)\nto your address book. Click here for instructions: \nhttp://www.investorplace.com/whitelist.php?eml=JohnLansing%40InvestorPlace.com\n--------------------------------------------------------------------\n\nee==8FP141\n\n\n"}