{"category": "ham", "to_address": "Joerg Jaspert <ftpmaster@debian.org>", "from_address": "\"Francesco P. Lovergine\" <frankie@debian.org>", "subject": "EPSG data reviewing in progress [was Re: libgeotiff_1.2.3-1_i386.changes REJECTED]", "body": "On Mon, May 07, 2007 at 10:14:35AM +0000, Joerg Jaspert wrote:\n> Hi Maintainer,\n> \n> i dont think the EPSG tables license is free, so the dataset cant go into\n> Debian main. Its a \"dont modify, non-commercial only\" license and a simple\n> conversion into a different format doesnt change the license of the dataset\n> used.\n> \n\nThanks to Frank Warmerdam and OSGEO, EPSG folks is now available \nto revise the licensing terms of their data. A preview of a new \nlicense is currently available on\n\nhttp://trac.osgeo.org/gdal/wiki/RevisedEPSGLicense\n\nand a discussion about the terms of the license in order to have\nthose data if possible embedded in a program for main is viable.\n\n\nCONTEXT: EPSG data are geodetic parameters, largerly used for GIS apps.\n\nCurrent terms are\n\nhttp://www.epsg.org/CurrentDB.html#use\n\nlibgeotiff copyright file is as follows:\n\n------------------------------------------------------------------------------\nLicense:\n\nAll the source code in this toolkit are either in the public domain, or under \nan X style license.  In any event it is all considered to be free to use\nfor any purpose (including commercial software).  No credit is required \nthough some of the code requires that the specific source code modules \nretain their existing copyright statements.  The CSV files, and other tables\nderived from the EPSG coordinate system database are also free to use.  In \nparticular, no part of this code is \"copyleft\", nor does it imply any \nrequirement for users to disclose this or their own source code.\n\nAll components not carrying their own copyright message, but distributed\nwith libgeotiff should be considered to be under the same license as\nNiles' code.\n\n---------\n\nCode by Frank Warmerdam has this copyright notice (directly copied from\nX Consortium licence):\n\n * Copyright (c) 1999, Frank Warmerdam\n *\n * Permission is hereby granted, free of charge, to any person obtaining a\n * copy of this software and associated documentation files (the \"Software\"),\n * to deal in the Software without restriction, including without limitation\n * the rights to use, copy, modify, merge, publish, distribute, sublicense,\n * and/or sell copies of the Software, and to permit persons to whom the\n * Software is furnished to do so, subject to the following conditions:\n *\n * The above copyright notice and this permission notice shall be included\n * in all copies or substantial portions of the Software.\n *\n * THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\n * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL\n * THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\n * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\n * DEALINGS IN THE SOFTWARE.\n\n-----------\n\nCode by Niles Ritter is under this licence:\n\n *    Written By: Niles D. Ritter.\n *\n *  copyright (c) 1995   Niles D. Ritter\n *\n *  Permission granted to use this software, so long as this copyright\n *  notice accompanies any products derived therefrom.\n\n-----------\n\nThe EPSG Tables (from which the CSV files, and .inc files are derived)\ncarried this statement on use of the data (from the EPSG web \nsite at url http://www.epsg.org/):\n\nUse of the Data\n\n   1. All data pertinent to  a specific coordinate reference system must\n   be copied without modification and  all related pages/records must be\n   included;\n\n   2. All components of this data  set pertinent to any given coordinate\n   reference system must be  distributed together (complete distribution\n   of  all  components  of  the  data set  is  preferred,  but  the  OGP\n   recognises the need for a more limited distribution);\n\n   3. The data may not be distributed for profit by any third party; and\n   4. The original source [OGP] must be acknowledged.\n\nThe user assumes the entire risk as  to the accuracy and the use of this\ndata. The  data may be copied  and distributed subject to  the following\nconditions:\n\nINFORMATION  PROVIDED  IN THIS  DOCUMENT  IS  PROVIDED \"AS  IS\"  WITHOUT\nWARRANTY OF  ANY KIND,  EITHER EXPRESSED OR  IMPLIED, INCLUDING  BUT NOT\nLIMITED TO THE IMPLIED WARRANTIES  OF MERCHANTABILITY AND/OR FITNESS FOR\nA PARTICULAR PURPOSE.\n\nWith regard  to (3) above, the  data may be included  within proprietary\napplications distributed on a commercial basis when the commerciality is\nbased on  application functionality and not  on a value ascribed  to the\nfreely-distributed EPSG dataset.\n\nThese conditions are currently under review.\n\n-----------\n\n\n\n-- \nFrancesco P. Lovergine\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}