{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "erik <erik@not-on.tv>", "subject": "Re: [cc-community] introducing myself and an idea", "body": "Thank you all for the quick responses.\nI have to look into all the new information and will definitely tell  \nyou of the progress and choices I have to make, to know your opinion  \nand act upon it.\nGoing to reflect it on the vlogger community as well to get the full  \npicture.\nI'm even more exited now. Thank you again.\n\ngreetings Erik\n\n\n----------\nOn May 2, 2007, at 6:44 PM, Jon Phillips wrote:\n\n> On Wed, 2007-05-02 at 10:18 -0400, Asheesh Laroia wrote:\n>> I know that Jon Philips was interested in doing something similar,  \n>> with\n>> particular focus on footage that documents the Free Culture  \n>> movement.  He\n>> made a page on the freeculture.org wiki about his idea -\n>> http://wiki.freeculture.org/Spread_Free_Culture .  freeculture.org  \n>> is the\n>> student arm of the Free Culture movement, for those who don't know  \n>> it.\n>> I've been very busy lately and dropped the ball on helping him,  \n>> which I'm\n>> a little sad about.\n>\n> All is well Asheesh, since you'll be starting at CC in July...no more\n> escaping me then! :)\n>\n> To others, I'm working on five projects now to try and get a massive\n> open free repository that is third-party controlled (not Creative\n> Commons), in the interest of open content and building the community.\n>\n> 1. Spread Free Culture is about collecting media of, around and about\n> free culture, including video, interviews, posters, etc, which others\n> might use in evangelism, etc.\n>\n> 2.) Spread Open Media is a project that xiph.org is working to launch.\n> I'm helping with a logo contest for that project\n> http://openclipart.org/xiph That project intends to be a massive\n> repository for open media (xiph formats, svg, etc).\n>\n> 3.) http://opencontentlibrary.org/ is a project to try and document  \n> this\n> type of content based collection/library. The main two projects I've\n> helped seed are part of this, and it should be noted that these are  \n> not\n> just remix communities, but communities focused around specific  \n> content,\n> with the idea to encourage other more generalized libraries for other\n> media: video, 3d models, text, etc\n>\n> 4.) http://openclipart.org is still going strong\n>\n> 5.) http://openfontlibrary.org is live and kicking, and now with a  \n> logo!\n>\n>\n> On this, note, I would be more than happy to help advise and/or  \n> seed an\n> open video-type project if others would like to get on board with\n> this...ccHost is a great piece of software which alleviates the  \n> pain of\n> a content management system, is extensible and is developed  \n> actively by\n> Creative Commons and others in the community.\n>\n>> I wanted to take this time to make sure people have had a chance  \n>> to look\n>> at his idea as written on our wiki and discuss any appropriate  \n>> sharing of\n>> work. (-:\n>>\n>> On the software end, as I understand things, Jon was probably  \n>> going to use\n>> ccHost.\n>>\n>> -- Asheesh.\n>\n> Yes, I'd like to rev these projects back up...sustainability is key  \n> for\n> Spread Free Culture and Spread Open Media\n>\n> However, i think that something like an open video collection would  \n> be a\n> brilliant addition to the arsenal of opencontentlibrary.org projects,\n> and something I would help support from within and out CC.\n>\n> Jon\n>\n> -- \n> Jon Phillips\n>\n> San Francisco, CA\n> USA PH 510.499.0894\n> jon@rejon.org\n> http://www.rejon.org\n>\n> MSN, AIM, Yahoo Chat: kidproto\n> Jabber Chat: rejon@gristle.org\n> IRC: rejon@irc.freenode.net\n>\n> _______________________________________________\n> cc-community mailing list\n> cc-community@lists.ibiblio.org\n> http://lists.ibiblio.org/mailman/listinfo/cc-community\n>\n\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}