{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nWednesday, 16 May, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nWarnock resigns as Blades manager\nNeil Warnock leaves Sheffield United three days after the club suffer relegation from the Premiership.\n\n\n\n \nBlades begin Tevez legal battle\nSheffield United launch a legal challenge to the Premier League's decision not to dock West Ham points in the Carlos Tevez case.\n\n\n\n \nTrio shy away from Man City post\nLouis Van Gaal, Ronald Koeman and Gerard Houllier are not interested in taking over at Man City.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nBallesteros set for senior debut\nSeve Ballesteros will make his Champions Tour debut at the Regions Charity Classic in Birmingham, Alabama, on Friday.\n\n\n\n \nIrish Open hit by lure of US Tour\nGraeme McDowell says events such as this week's Irish Open are suffering because of the US Tour's strength.\n\n\n\n \nClarke withdraws from Irish Open\nDarren Clarke is forced to pull out of this week's Irish Open because of injury.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nJacque ruled out of French MotoGP\nKawasaki's Olivier Jacque will miss this weekend's French Grand Prix at Le Mans with an arm injury.\n\n\n\n \nHamilton will set 'new standards'\nLewis Hamilton will \"create the new benchmark for Formula One\", according to three-time champion Jackie Stewart.\n\n\n\n \nSpaniard Pons to drive for Subaru\nSpain's Xevi Pons will compete for Subaru in the World Rally Championship for the second half of the season and the whole of 2008.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nHamilton will set 'new standards'\nLewis Hamilton will \"create the new benchmark for Formula One\", according to three-time champion Jackie Stewart.\n\n\n\n \nAlonso plays down Hamilton threat\nFernando Alonso says he does not regard McLaren team-mate Lewis Hamilton as his biggest threat this season.\n\n\n\n \nFerrari concerned by reliability\nFerrari boss Jean Todt fears lack of reliability may undermine his team's dual title challenge this year.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nKenya star denied Manchester visa\nWorld half-marathon record holder Sammy Wanjiru will miss Sunday's Great Manchester Run after failing to obtain a visa.\n\n\n\n \nSprint stars set for Loughborough\nThree of the British squad that won the Olympic 4x100m gold in 2004 will compete at the Loughborough International on Sunday.\n\n\n\n \nCheruiyot storms to Glasgow win\nVivian Cheruiyot wins the women's 10 kilometres road race in Glasgow.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nDi Luca claims Giro d'Italia lead\nDanilo Di Luca takes the overall lead in the Giro d'Italia after team-mate Enrico Gasparotto falls.\n\n\n\n \nCavendish outlines Tour ambition\nBritain's Mark Cavendish believes he is on course to one day challenge for sprint glory in the Tour de France.\n\n\n\n \nLandis lawyer blasts testing lab\nFloyd Landis' lawyer says the laboratory used for his dope tests failed to meet international standards.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nQuotes of the Week\nJose Mourinho reacts to the news that Graham Poll may retire, plus chants\n\n\n\n \nComment: Rough justice for Blades\nRobbo says West Ham should have been relegated \n\n\n\n \nReview of the week\nFreddy Shepherd offers to \"carry Michael Owen to Liverpool\"\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}