{"category": "ham", "to_address": "\"avcavc\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"AccuWeather.com Alert\" <inbox@messaging.accuweather.com>", "subject": "AccuWeather.com Alert(tm) Advisory  (avcavc)", "body": "\n\nAccuWeather.com Alert[TM]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSevere Watches and Warnings for BEVERLY HILLS \n\n\n\n\n\n\n\n\n\n\n\n\n\nLOXCFWLOX\r\nWHUS46 KLOX 131252\r\nCFWLOX\r\n\nCOASTAL HAZARD MESSAGE\r\nNATIONAL WEATHER SERVICE LOS ANGELES/OXNARD CA\r\n552 AM PDT FRI APR 13 2007\r\n\n..HIGH SURF CONTINUES ON SOUTHWEST FACING BEACHES OF SOUTHERN\r\nCALIFORNIA...\r\n\nA SOMEWHAT LARGE WESTERLY SWELL GENERATED BY STRONG NORTHWEST\r\nFLOW CONTINUES OVER THE COASTAL WATERS. IN ADDITION...THE MODERATE\r\nSOUTHERLY SWELL FROM A PREVIOUS STORM IN THE SOUTHERN HEMISPHERE\r\nCONTINUES TO IMPACT THE AREA. THIS COMBINATION OF WESTERLY AND\r\nSOUTHERLY SWELLS WILL PRODUCE HIGH SURF ALONG THE EXPOSED SOUTHWEST\r\nFACING BEACHES OF SOUTHERN CALIFORNIA AS WELL AS HIGH RIP CURRENT\r\nRISK THROUGH TONIGHT.\r\n\nCAZ040-041-131900-\r\n/O.CON.KLOX.SU.Y.0006.000000T0000Z-070414T0500Z/\r\nVENTURA COUNTY COAST-\r\nLOS ANGELES COUNTY COAST INCLUDING DOWNTOWN LOS ANGELES-\r\n552 AM PDT FRI APR 13 2007\r\n\n..HIGH SURF ADVISORY REMAINS IN EFFECT UNTIL 10 PM PDT THIS\r\nEVENING...\r\n\nA HIGH SURF ADVISORY REMAINS IN EFFECT UNTIL 10 PM PDT THIS EVENING.\r\n\nFIVE TO SEVEN FOOT BREAKERS ARE EXPECTED TO CONTINUE AT THE BEACHES\r\nOF LOS ANGELES AND VENTURA COUNTY...ESPECIALLY AT FAVORABLY EXPOSED\r\nSOUTHWEST FACING BEACHES THROUGH TONIGHT. MAXIMUM SETS UP TO EIGHT\r\nFEET ARE POSSIBLE AT THE MOST EXPOSED LOCATIONS THIS AFTERNOON. WHILE\r\nTHE GUSTY WINDS DRIVING THIS SWELL HAVE BEGUN TO DIMINISH...CONDITIONS\r\nARE STILL EXPECTED TO BE HAZARDOUS THROUGH THE EVENING. THE COMBINATION\r\nOF HIGH SURF WITH THE MIXED NORTHWEST AND SOUTH SWELL WILL ALSO CONTINUE\r\nTO PRODUCE DANGEROUS RIP CURRENTS ALONG THE BEACHES OF LOS ANGELES AND\r\nVENTURA COUNTIES. SURF WILL SUBSIDE BY THIS EVENING.\r\n\n$$\r\n\nCAZ034-035-131900-\r\n/O.CON.KLOX.CF.S.0004.000000T0000Z-070414T0500Z/\r\nSAN LUIS OBISPO COUNTY CENTRAL COAST-\r\nSANTA BARBARA COUNTY CENTRAL COAST-\r\n552 AM PDT FRI APR 13 2007\r\n\n..ABOVE NORMAL SURF EXPECTED ALONG THE CENTRAL COAST...\r\n\nSEVEN TO NINE FOOT BREAKERS ARE EXPECTED ALONG THE CENTRAL CALIFORNIA\r\nCOAST TODAY...WITH LOCAL SETS TO TEN FEET ALONG FAVORABLY EXPOSED\r\nWEST FACING BEACHES. WHILE THE PERIOD OF THESE WAVES IS ONLY NEAR\r\nTWELVE SECONDS...A STRONG NORTHWEST SWELL DRIVEN BY NORTHWEST WINDS\r\nIS STILL EXPECTED TO IMPACT THE COASTLINE THROUGH THE AFTERNOON.\r\nSURF SHOULD SUBSIDE THIS EVENING.\r\n\n$$\r\n\nMEIER\n\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChoose another forecast:\n\t\t\t\t\t\t\t\t\t\tEnter a zipcode, or a city, state\n  \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n©2007\n\t\t\t\t\t\t\tAccuWeather, Inc. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}