{"category": "ham", "to_address": "Debian-legal <debian-legal@lists.debian.org>", "from_address": "Steve Langasek <vorlon@debian.org>", "subject": "Re: Final text of GPL v3", "body": "On Sun, Jul 01, 2007 at 10:27:52AM +0100, Gervase Markham wrote:\n> It certainly addresses the problem. Let's look at the two possibilities:\n\n> Before:\n>   GPL (either explicitly or implicitly): you can do X\n>   Restriction: you can't do X\n\n> Result - conflict and confusion; non-redistributable code\n\n> After:\n>   GPL (either explicitly or implicitly): you can do X\n>   GPL: If I say you can't do X, you can ignore me\n>   Restriction: you can't do X\n\n> Result - the license is consistent, although it has one part which \n> nullifies another part. This is similar to clauses of the form \"The \n> previous part of this clause does not apply if you are wearing blue \n> underwear\".\n\n> If you (in your example) license under GPLv3 + restriction, then by \n> picking GPLv3 you are giving me, the recipient of the code, permission \n> to remove the restriction. If you didn't want to give me that \n> permission, you shouldn't have used GPLv3 - just as if you didn't want \n> to give me permission to link my code with the Affero GPL (to take one \n> example of many), you shouldn't have used GPLv3.\n\nUm, no.  \"You shouldn't have used GPLv3\" doesn't have any legal force to\nresolve the inconsistency.  If I license my work under the GPLv3, I *as the\ncopyright holder* can still modify the terms of my code's license however I\ndamn well want, regardless of what the GPLv3 itself says about whether that\nis permissible, because the GPLv3 is not binding on *me the copyright\nholder*.\n\nIf I go to the effort of writing\n\n    This program is Free Software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License version 3 as\n    published by the Free Software Foundation, with the exception that the\n    prohibition in section 7 of the license on additional restrictions does\n    not apply and the permission in section 13 is not granted.\n\nthen I have *explicitly addressed* the clause in GPLv3 which purports to\nprohibit additional restrictions.  Which statement is going to take\nprecedence?  At best I've created a lawyer bomb because my intentions are\nnot clear; at worst I've succeeded in licensing my code in a manner that's\nincompatible with the GPLv3.  But that's exactly the same problem that we\nhad with GPLv2, so what was the point of adding this clause?\n\n-- \nSteve Langasek                   Give me a lever long enough and a Free OS\nDebian Developer                   to set it on, and I can move the world.\nvorlon@debian.org                                   http://www.debian.org/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}