{"category": "spam", "to_address": "memolink@speedy.uwaterloo.ca", "from_address": "Rochelle Zombie<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, I have two important revelations about May 25th, 2007 and your immediate future", "body": "\n\nRGEM 1959 Mystical Secrets RG ED - 3176127\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApril 23, 2007 \nBecause of the warm friendship I feel for you, Memo, I wanted to provide these FREE special revelations just for you...\n\n\nRIGHT NOW, PLEASE NOTE THESE 2 VERY IMPORTANT DATES FOR YOUR IMMEDIATE FUTURE... \nMAY 25TH AND OCTOBER 31ST!\n\n...All the necessary information is in this letter...\nDear Memo, \n     As you undoubtedly know, your current environment has negative waves. \n     At least, that's what I sense, and past events tend to prove I'm right!\n     That would explain your recent stress over financial or professional problems.  \n     I sincerely think that these bad waves would have continued to influence you for many more years if I didn't make contact with you today.\n\n\n     However, I have sensed that you do have some particularly Lucky elements which we absolutely must energize, if we want to be sure to rescue you from all these troubles that have burdened you for far too long already. \n     We absolutely must join forces right now so that as of  May 25th, 2007, you'll rediscover your full personal luck potential in all areas of your life.\nWhy this particular date, May 25th, 2007?\n     Because during this time period, a powerful aspect between sweet Venus and Uranus, ruler of invention and unexpected bonuses, will set off a starburst of positive, wealth-attracting energies. Plus, heightened planetary energy in October will seal in the lucky effects for you. With the meeting of the Venus and Uranus on May 25th bringing you powerful vibrations for changing your life for the better, you can get in synch with an unusually fortunate series of astrological events that will mark the beginning of 367 days of Intense Happiness for you!\n     You must understand that we have to join forces against the negative waves that are frustrating you and affecting your life.\n     The urgency and power of this unique situation for your happiness made me realize that my dear friend, Joan Mudle, a psychic astrologer with 27 years of experience, was the ideal person to do some essential personal psychic groundwork for you.\n     No one is better than Joan Mudle at transforming powerful waves of psychic energy, so to give you the clearest understanding of the forces around you and how you can turn them to your extreme advantage, I want Joan Mudle to explain everything to you in her own words. \n     I know Joan Mudle can really help you, Memo, so please pay close attention to what she has to tell you.\n   \n\n     My dear Memo,\n     First, I can't believe how lucky it was that Rochelle gave me this chance to make contact with you, especially at this time of such tremendous opportunity for change and good fortune in your life. As Rochelle mentioned, I've done some essential personal psychic groundwork for you, and you've probably already noticed some positive changes around you.  Think about it...\n     My groundwork is now finished, and it has proved to be particularly encouraging. But there's still a lot to be done. May 25th will start an extremely interesting period that you must not let pass you by under any circumstances.  That's why I absolutely want you to rediscover your full personal luck potential before this date!\n     I know you're a good subject for this kind of experience. You seem to be particularly receptive to my positive waves. Maybe you even have some gifts as a medium without even knowing it! \n     I see us reaching that blessed day together, when we'll be able to announce your extraordinary success for everyone to hear, when you will finally be free of all your stress and financial and other problems... and when everything in your life will be back in order.\n     But we're not there yet, Memo. Before celebrating this great day, we need to work together to analyze the different aspects of your current difficulties.  Your main problem is most likely a money problem. This is the problem most of my correspondents and friends ask me to solve first. So this is the one we will attend to first and foremost.\n     It's true that for certain people this money problem is particularly dramatic. That's why I'm especially sensitive to it. I must say, though, that I received contradictory impressions from you.  Yes, contradictory, because I was seeing you with no financial problems whatsoever!  That probably makes you smile. I'm sure that this impression from me must surprise you... but I can assure you that I am very rarely mistaken.\n     So, what does this \"impression\" mean?\n     I think it means that very soon you won't be bothered by financial problems anymore. That they will have disappeared, flown out of your life as if they had never existed for you. Otherwise, what other explanation could there possibly be for my impression? \nIt even seems to me that an opportunity to win a lot of money recently presented itself to you, perhaps just several months ago. Think about it...\n     Look, I have to be sincere with you.  You were totally incapable of taking advantage of this generous opportunity that was offered to you. And for what very good reason?  You were then -- and still are -- under the influence of these frustrating negative waves.  You didn't dare to act, and the opportunity passed you right by, as it often does.  A little too often, in fact...\n     But above all, Memo, don't be angry with yourself.  Anyone else in your situation would have reacted in the exact same way, believe me.  But this period has changed; from today on you're no longer isolated in the face of your destiny -- you and I are partners now.\n     You and your faith, me and my psychic powers!\nThis new period of luck will be bountiful. I can already feel it vibrating very deeply in me!\n     This lucky period starts for you at the very beginning of May 25th, 2007 and will reach its peak exactly 159  days later, on October 31st, 2007 (the second very important date in your life...)!\n     After that, you'll still have 208 days left in the lucky period, then, that's it. It'll all be over -- unless you've learned by then to take charge of your luck, to grab it with both hands and direct it where you choose!\n     We should seize this new financial opportunity being offered to you together!\nYou should profit from this financial opportunity. As I told you, my psychic impressions prove it!\n     What surprises me the most, Memo, is that despite repeated failures, your luck since your birth has remained almost totally intact. That's so rare that it deserves mention.  That means that you still have the ability to change the course of your life.  Your luck is there, intact and ready to act for your benefit. It's just waiting for you to order it into action. So I'm telling you: Don't wait!  Act now!\n     But we're only talking about your financial problems now -- we are forgetting the emotional side of your personality.  You are also in the midst of negotiating a very important turning-point in your emotional and family life.  Despite your financial difficulties, Memo, you've succeeded in maintaining a certain bond of intimacy with your close friends and loved ones.\n     And so much the better for them and for you.  You really must decide to free yourself from this heavy burden created by the negative waves you've been accumulating for so many, many years.  It's your happiness and your future that we are talking about now, and by extension, the happiness and future of your close friends and loved ones.  Yes, I see happiness and love headed your way, Memo, the love which you've always aspired to and which YOU DESERVE!\n     YES, HAPPINESS AND LOVE WILL BE THERE, FAITHFULLY ON TIME FOR THE APPOINTMENT WE HAVE MADE WITH THEM!\n     Experience has shown me that very few people can single-handedly determine the deep reasons for their despair, much less chase them away.  In fact, these particular reasons are often tied to what we could call unusual or \"paranormal\" reasons -- because it's not normal for fate to hound the same person to such a degree.\n     Put your mind at ease, Memo. The more I work on your personality, the more it appears to me, through the vibrations I receive from your spirit, that you do possess the positive elements of a better future.  That's why, with this precious information about your future, I'm offering you here and now my personal beneficial help to free in you all the positive waves that are sleeping in your subconscious!\n     To free your positive forces and to drive away from your spirit the negative waves, that's my divine mission!\n     I possess this science, this philosophy, that makes me the true LIBERATOR of your hidden forces!  I want to accomplish for you this \"magic\" intervention that you've been awaiting for so long and that will turn you into a HAPPY person!\n     Say YES to Luck.   Say YES to Love.  Say YES to Happiness.  You can, and above all, you DESERVE it!\n     Understand me well, Memo, I'm offering to guide you towards a path paved with happiness and joy... but we have to act fast, because May 25th will mark the beginning of a period of intense luck which you cannot and should not miss!  The coming weeks are going to be crucial for you, as well as for those close to you -- don't forget it!\n     Listen carefully! Your beneficial period of luck begins on May 25th, and will last 159 days and not one day more! \n     The 159th day will be the highest point of this incredible period.\n     Your lucky period will end at dawn on the 367th day and won't recur for several years (according to my psychic estimate)!\n     Your auspicious spiritual vibrations and I are offering you our help; above all, don't refuse it. Believe me, facing your destiny alone, it will be hard to win, while together we can do it much more easily, I'm giving you my word!  In addition to the personal work I'm going to do on your behalf, indispensable in our fight against the negative forces that are blocking you, I will have to do for you a multi-contact telepathic action, as well as an intense psycho-magnetic action. \n     MY HELP IS FREE!\n     Put your mind to rest, you won't have to spend a penny for all these miraculous actions. I am very pleased to offer them to you FREE.  It will be my First Free Gift to you. Yes, my First Free Gift because I am going to offer you one more!\n     It's my own way of welcoming you into the wonderful new world that awaits you... But be careful, Memo: in order to get the most of this opportunity, it is absolutely necessary that you support the many ancient and miraculous actions I will do on your behalf and follow to the letter the instructions that I'm going to give you in a powerful work called:\nMYSTICAL SECRETS FOR WEALTH, HEALTH, AND HAPPINESS!\n     It's said that these secrets allow whoever knows them and uses them to obtain all they desire in life...\n...MONEY, from games of chance, or from your work...\n...LOVE, in helping you to find that special kindred soul for you, or in bringing back to you a loved one who has left you... \n...LUCK in every area of your life, as you learn to master the secrets of the natural world around you...\n     To make it easier for you, I've gathered these secrets together into a very practical book.  For the most part, these secrets can't be found in bookstores, even specialized ones. They are often passed down by \"word of mouth\" from generation to generation.\n     Because you show such great potential to have all you truly desire in life, I profoundly want to help you, and I'm ready to give you these incredible secrets at a special price of only $9.95!  That's a 50% discount off the regular price and a $10.00 savings for you.\n     And Memo, you risk absolutely nothing when you accept my help.  Because if at any time, for any reason, you aren't completely satisfied Mystical Secrets for Wealth, Health, and Happiness has helped you achieve all the happiness you deserve, simply return it and I will fully reimburse you, immediately...with no explanation necessary.  I make this honest and fair offer to you because I truly believe we can turn your life around into a life you will love.\n     All I ask is that you click the button at the end of this letter, and all these incredible secrets will be waiting for you.\n     Above all, act immediately, for let me remind you that your intense Lucky period begins on  May 25th, 2007, and will finish in a glorious burst of happiness 367 days later!  So don't lose another minute: order Mystical Secrets for Wealth, Health, and Happiness right now!  Believe me, you won't regret it for a minute.\n     One last thing: I've already made a lot of effort to make you my first priority, and so have neglected many other people who have asked for my help.  A work of capital importance for you and for your future awaits us: Memo, you will be, I think, one of my most dazzling successes.  And believe me, the result should fulfill your wildest hopes.\n     I am really counting on you; your happiness and that of all your loved ones is now in your hands.\n     Your devoted friend,      \n\n\n\n\n\nP.S. -- I almost forgot! I am going to enclose with your Mystical Secrets for Wealth, Health, and Happiness, FREE OF CHARGE, a golden \"Four Leaf Clover of Luck\" that will help you overcome your daily problems and protect your new positive waves (the ones that I am going to free in you)!\n     This golden Four Leaf Clover will also act as a lucky charm and serve as a \"psychic contact\" between you and me -- a kind of \"direct line\" with your subconscious!\n     It will surprise you with its efficiency. I'm offering it to you with joy; it's my second free gift for you!\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for offers and discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400.\n\n\n"}