{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Shirley Kelley\" <pifcfkentgew@cfkent.com>", "subject": "Melt away fat easily", "body": "\nControl your weight and appetite\n\n\n\n\n\n\nAnatrim – The newest and most attracting product for over-weight people is now readily available – As seen on CNN.\n\n\nCan you retain all the cases when you appeal to yourself to do any thing for being rescued from this fastly growing pounds of fat? Happily, now no major price is to be paid. Thanks to Anatrim, the ground-shaking kilos-melting medley, you can achieve naturally health life style and become really thinner. Have a look at what people say!\n\n\n\n\"I hate to admit it but I was an awful food addict. \n\n\nI devoured all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis torment passed away when I started course of taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my craving for food vanished, \n\n\nmood increased and I turned to the happiest person 20 pounds in 2.7 months. \n\n\n\n\nI can tell you now I became the happiest person on the planet!\"\n\n\n\n\n\nAmelia B., San Diego\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nYou can't fancy how I hated being ridiculed at school. \n\n\n\n\nI abhorred my stoutness and I abhorred myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nThis stuff literally took me out of this awful nightmare! The very sincere thanks to you, my friends.\"\n\n\n\n\n\nMike Brown, Washington\n\n\n\n\n\n\"Know what? Anatrim saved my marriage! I got into this circle, depression – eating more – even more depression. My wife had thought to leave the overweight psycho I was turning in. \n\n\nOne my best friend pointed at your web site and I ordered Anatrim as soon as it was possible. \n\n\nThe final result was magnficent, my appetite became normal, I was in good spirits oftener, and, be sure, I tightened my belt with no regrets. And the bedroom became cool also!\"\n\n\n\n\n\nTom\n\n\n\n\n There is a great number of testimonial letters left by happy people taking Anatrim. Don’t you gonna add yourself to the thousands and thousands of slim buyers and try this original appetite decreasing power lifting product now!\n\n\nDo not lose the chance!\n\n\n\n\n"}