{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Dawn Ledford\" <cebcalrealtyserviceshog@calrealtyservices.com>", "subject": "Less weight - more pleasure and joy", "body": "\nPounds down, mood up\n\n\n\n\n\nAnatrim – The up-to-the-moment and most delighting flesh loss product available – As told on Oprah\n\n\n\nDid you know redundant body kilos kill a lot of people every year? We believe you hate the ugly appearance of people like those and the low status they have in society. \n\nMoreover, you have not the will to resist a pressure of your terrible eating habits. If you think it sounds familiar, then we have something for you!\n\n\n\n\n\nIntroducing Anatrim, the later product for the elimination of your body’s extra weight. The greatest thing about Anatrim is it improves the quality of your life by repressing your feeling of hunger and giving you better cheer. Read what people write on this product:\n\n\n\n\n\n\"It’s great! \n\n\nI stopped watching TV continually and stuffing myself with food \n\n\nI became rather more interested in taking exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I’m more fit now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nAmelia B., Washington\n\n\n\n\n\n\n\"Passive weight losing was of no result to me. I could not restrain my ravenous hunger. \n\n\nOnce I was told about Anatrim the media by and I was really effected at the information.\n\n\n I had tried using it, and my wife said that I look very good now, 5 months later. \n\n\n32 pounds have gone away and I continue to become slimmer! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nSteve Burbon, Chicago\n\n\n\n\n\nAnatrim helps you to realize your body doesn’t need that much food. It raises your spirit up, provides you with extra energy, and attacks needless kilos. Especial thanks to its powerful comprehensive formula!!\n\n\n\nFind out more about this excellent product now!\n\n\n\n"}