{"category": "ham", "to_address": "431109@bugs.debian.org, debian-legal@lists.debian.org", "from_address": "Russ Allbery <rra@debian.org>", "subject": "Re: Bug#431109: [PROPOSAL] Disambiguate of Section 12.5, Deprecate GPL/LGPL symlinks", "body": "Robert Millan  writes:\n\n> AISI, the reason for using the unversioned link is that it means less\n> work for maintainers (and the work *is* significant when it comes to\n> lots of packages) who have to update the copyright file every time\n> license changes.\n\nThis reason doesn't make any sense to me.  Nothing about the licensing of\nthe package changes when a new version of the GPL is released, and nothing\nshould have to change about the copyright file.  It should continue to\npoint to GPL-2.  The language in the copyright file will already say that\nthe package is covered under GPL v2 or later, and if the user wants to\napply another license, they can figure it out.\n\nAfter reading this discussion, I think the right thing to do here is\npretty clearly to phase out the unversioned link.  Every package should\npoint in their debian/copyright file to the earliest version of the GPL\nthat the Debian project considers free (if that's ever an issue) and that\nthe package can be licensed under, and not be updated unless the package\nlicensing updates.\n\n> Most GPL programs out there are 2-or-later, so we are always allowed to\n> distributed as per the latest GPL.\n\nBut why would we want to?  We already know the GPL v2 is DFSG-free, so we\nhave, so far as I can tell, zero motivation to intentionally choose a\nlater version of the license under which to exercise our rights grant, and\ndoing so may get us into trouble if assumptions made by the package happen\nto not apply with the later version of the GPL.\n\nAs far as I can see, the only reason for the Debian project to ever choose\na later version of the GPL when distributing packages is if that later\nversion offers us some new freedom that we want to exercise, and I've not\nheard of any such thing happening yet.\n\n-- \nRuss Allbery (rra@debian.org)               \n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}