{"category": "ham", "to_address": "<november-d@november.org>", "from_address": "\"Rachel Morton\" <rachelmk@jps.net>", "subject": "Nov-D: send e-mail to author", "body": "\n\n\n\n\n\n\n\nThe tone of this newspaper article is very \noffensive to me because although I appreciate that the \narticle mentions the overcrowding, its focus on punishment is repugnant. \nThe jails are overcrowded and inhumane. The solution is not to alienate and \nfurther mistreat the unfortunate who have been placed in jail (for crimes that a \nperson with $$ would not be there for) ... I plan on sending the author an \ne-mail. If anyone else has articles like this, maybe we should share them with \neach other and get e-mails sent so that the tone will change in future articles, \nmaybe .....\n \nThanks - \n \nRachel\n \nhttp://www.mercurynews.com/peninsula/ci_6248742?nclick_check=1\n \nRestive jail inmates clog toilets; county \ngets $700,000 repair bill\nBy Michael ManekinMediaNews\nArticle Launched: 06/28/2007 01:34:48 AM \nPDT\n\n\n\n\n\n\n\nOrange jumpsuits at the San Mateo County jail are more than just standard \nissue clothing for some inmates - they're a means for overflowing the toilets at \nthe Maguire Correctional Facility, wreaking havoc. \nTo county officials, that's about $700,000 down the drain, according to a \nbill from the South Bayside Systems Authority, the joint powers authority that \nadministers Redwood City's sewer system. \n\"This is a big-dollar problem,\" said Sheriff Greg Munks. \"It's a continuing \nproblem, and the bill is only going to get bigger.\" \nThe problem has grown so expensive that the county manager, the county \ncounsel and the board of supervisors have joined the sheriff's department in \ntrying to resolve the issue with the South Bayside Systems Authority. \nCalls to the South Bayside Systems Authority were not returned. \nCounty law enforcement officials say nearly every correctional facility in \nthe country regularly experiences such flushing fiascoes. Often, the problem is \nexacerbated because inmates, who operate the laundry facilities at many jails, \nwill distribute extra clothing and sheets to their friends. \nSuch abuses are hard to monitor in the overcrowded condition at the county's \njail, Munks said. \n\"When you have a facility designed for 688 and our count is about 1,050, it's \nvery difficult,\" he said. \"When you have two deputies guarding 96 inmates, their \nforemost concern has to be the safety of staff and the safety of the inmates - \nand searching for extra blankets, extra jumpsuits, extra clothing items . . . we \ndo it, but we're sometimes hindered.\" \nThe sheriff's department has stepped up its action plan to stop the activity. \nSeveral months ago, officials installed grinders in the Maguire facility \ndesigned to chew up chunky items in the jail's pipes. \nNow that it's obvious that the grinders have not resolved the problem - the \ncounty counsel reportedly received Monday a $30,000 invoice from the authority - \nthe sheriff's department is considering tried-and-true alternatives imported \nfrom other jails. \nAmong the fresh approaches: Installing delayed-flush mechanisms and screens \non jail cell toilets; stocking the jail commissary with items wrapped in more \nbiodegradable packaging; and rethinking the standard-issue possessions given to \ninmates. \nPunishment is yet another option, according to Munks. \n\"We are considering charging inmates criminally or disciplining them by \ntaking money off their commissary books,\" he said. \n\"There has to be consequences for these actions,\" county Supervisor Jerry \nHill said. \"The sheriff needs to develop a mechanism for discipline or \npunishment of those inmates intentionally destroying property.\" \n\nContact Michael Manekin at mmanekin@sanmateocounty times.com or (650) \n348-4331.\n"}