{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Paul Cager <paul-debian@home.paulcager.org>", "subject": "Opinions on \"Paul Hsieh derivative license\" ", "body": "I am packaging MyServer (http://bugs.debian.org/288655) and have a\nquestion about the license in one file:\n\n> /* MyServer\n> Copyright (C) 2005, 2006 The MyServer Team\n> This program is free software; you can redistribute it and/or modify\n> it under the terms of the GNU General Public License as published by\n> the Free Software Foundation; either version 2 of the License, or\n> (at your option) any later version.\n> \n> This program is distributed in the hope that it will be useful,\n> but WITHOUT ANY WARRANTY; without even the implied warranty of\n> MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n> GNU General Public License for more details.\n> \n> You should have received a copy of the GNU General Public License\n> along with this program; if not, write to the Free Software\n> Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA\n> */\n> \n> /*\n> The superFastHash hash function is authored by Paul Hsieh\n> (http://www.azillionmonkeys.com/qed/bio.html)\n> \n> It's released under the Paul Hsieh derivative license\n> (http://www.azillionmonkeys.com/qed/weblicense.html)\n> */\n> \n\nThe Paul Hsieh licenses referred to are:\n\n> Paul Hsieh derivative license\n> \n> The derivative content includes raw computer source code, ideas, opinions, and excerpts whose original source is covered under another license and transformations of such derivatives. Note that mere excerpts by themselves (with the exception of raw source code) are not considered derivative works under this license. Use and redistribution is limited to the following conditions:\n> \n>     *\n> \n>       One may not create a derivative work which, in any way, violates the Paul Hsieh exposition license described above on the original content.\n>     *\n> \n>       One may not apply a license to a derivative work that precludes anyone else from using and redistributing derivative content.\n>     *\n> \n>       One may not attribute any derivative content to authors not involved in the creation of the content, though an attribution to the author is not necessary.\n\n\n> Paul Hsieh exposition license\n> \n> The content of all text, figures, tables and displayed layout is copyrighted by its author and owner Paul Hsieh unless specifically denoted otherwise. Redistribution is limited to the following conditions:\n> \n>     *\n> \n>       The redistributor must fully attribute the content's authorship and make a good faith effort to cite the original location of the original content.\n>     *\n> \n>       The content may not be modified via excerpt or otherwise with the exception of additional citations such as described above without prior consent of Paul Hsieh.\n>     *\n> \n>       The content may not be subject to a change in license without prior consent of Paul Hsieh.\n>     *\n> \n>       The content may be used for commercial purposes.\n\nIs this DFSG-free? I couldn't find any references to this license in the\narchives.\n\nThanks,\nPaul\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}