{"category": "spam", "to_address": "\"Kent Morris\" <adtrevors@plg.uwaterloo.ca>,\n   \"Terrance Clifton\" <dmason@plg.uwaterloo.ca>,\n   \"Rene Willard\" <jfbuss@plg.uwaterloo.ca>,\n   \"Eduardo Daryl\" <theorize@plg.uwaterloo.ca>,\n   \"Terrence Ross\" <henna@plg.uwaterloo.ca>", "from_address": "\"Desiree H. Schwartz\" <Desireextcj@retailcart.com>", "subject": "Just another email from Ms. Schwartz", "body": "Treat yourself and your woman to a marvelous, sensual experience.\n\nIntroducing the Vibration Ring \n\nIts patented design is both comfortable and washable. The Ring section\neasily stretches to fit any size and is made of non-toxic silicone rubber\nmaterial that is both soft and hygienic.\n\nThe Vibration Ring features a raised tickler with thinly sculptured ridges\nespecially designed to stimulate her c-spot and a micro vibration motor\nwhich produces pulsating sensations through the shaft promoting multiple\npleasures.\n\nIt's self-powered & has a switch to turn the device on and off as you\nchoose. So you're in control.\n\n\nhttp://www.wannalove.net\nWhy put up with boring bedroom Antics anymore? \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nmost of the superficial issues that occupy us today. This why we cannot\ncontinue to make decisions in the old way. cannot permit them to be made\nindependently of one another. cannot permit them to dictated by short-run\neconomic considerations alone. We permit them to be in policy vacuum. And\ncannot casually delegate responsibility for such decisions businessmen,\nscientists, engineers administrators who are unaware \nthe profound consequences of their own actions. TRANSISTORS SEX To capture\ncontrol technology, and through it gain influence over the accelerative in\ngeneral, we therefore, begin to submit new technology set of demanding tests\nwe unleash it in our midst. must ask whole series of unaccustomed about any\ninnovation before giving clean bill of sale. First, experience should have\nus by now to look more carefully at the potential physical side of any new\ntechnology. Whether we \nproposing new form of power, material, or new industrial chemical, we\nattempt to determine it will alter the delicate balance upon which we depend\nsurvival. Moreover, we must its indirect effects over great in both time\nspace. Industrial waste dumped river can turn up hundreds, thousands of\nmiles away in the ocean. may not show effects until years its use. So much\npeen written about that it seems hardly necessary to \nthe point further. Second, much more complex, must question the long-term\nimpact of technical innovation on the social, and psychological environment.\nThe automobile is widely to have changed the of our cities, shifted\nownership and retail trade altered sexual customs and loosened family ties.\nthe Middle East, the rapid spread of radios is credited with having\ncontributed to resurgence of Arab nationalism. The birth control the\ncomputer, the space effort,\n\n\nThanks...\n\n\n\nDesiree\n\n\n"}