{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "THE INSIDE SCOOP:  \"TRAGEDY AT VIRGINIA TECH\" IN-DEPTH TEAM COVERAGE, ON THE SCENE, FROM EVERY ANGLE!!", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early\n    Show | CBS\n    Evening News | 48 Hours\n    | 60 Minutes\n    | The\n    Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nQUOTE\n  OF THE DAY\n\n\"I'm a great believer\n  in luck, and I find the harder I work the more I have of it.\" \n  - Thomas Jefferson \n\n\n\n\nDID YOU KNOW?\n\n  Absolutely pure gold is so soft that it can be molded with the hands.\n\n\n\n\nTONIGHT ON THE CBS\n  EVENING NEWS\n\nHere is an early\n  preview of what Awe are planning for tonight’s CBS EVENING NEWS from\n  Anchor and Managing Editor, Katie Couric… \n\n  Hi everyone, \n\n  Today, the investigation continues into the tragedy at Virginia Tech and, of\n  course, our correspondents are on the scene covering every angle. \n\n  A picture of Cho Seung-Hui is slowly emerging: he was a solitary young man\n  with few friends. But his bizarre behavior had been noticed – two women\n  at Virginia Tech say they raised concerns in 2005 about Cho’s repeated\n  attempts to contact them. When can a school take steps against a student it\n  suspects might someday cause harm? Cynthia\n  Bowers will have the details. \n\n  The paper trail Cho left behind helps fill in the picture. Sharyn Alfonsi will report on Cho’s\n  alarming creative writing pieces, the ranting note he left behind and the\n  latest on the investigation into Monday’s massacre. \n\n  A significant part of that investigation hinges on forensic evidence, and\n  some of that is locked inside the computer Cho owned and used. Technology correspondent\n  Daniel Sieberg will report on\n  how authorities are extracting information from the gunman’s hard\n  drive. \n\n  Also, Thalia Assuras will have\n  an emotional interview with a young woman who lives near the site of the\n  first shooting Monday. It’s a dramatic account. \n\n  In other news, the Supreme Court upheld the country’s ban on certain\n  abortions this morning. The justices ruled 5-4 that the Partial Birth\n  Abortion Ban Act that Congress passed and President Bush signed four yeas ago\n  is constitutionally sound. Wyatt Andrews\n  will have more on the decision. Our chief legal analyst, Andrew Cohen, will also weigh in on the\n  implications of the decision. \n\n  Finally, it has been an extraordinarily deadly day in Baghdad, where more than 175 people were\n  killed in a series of bombings – the worst day of violence since the\n  American troop surge began a few months ago. Martin Seemungal will report. \n\nI hope you’ll join us. \n\nKatie \n\nFor more information on these stories,\n  please click on the following links: \n\nOfficials: Gunman Left \"Suicide\n  Note\" \nClick Here \n\nHigh Court Upholds Ban On Some Abortions\n\nClick Here \n\nAnd here’s a look at one of the\n  stories we’re working on for Thursday’s broadcast: \n\n  Attorney General Alberto Gonzales goes to Capitol Hill to fight for his job.\n  That story and much more, Thursday, on the CBS Evening News. \n\n  If you would like more information on any of these stories or the broadcast,\n  please click on the following address and e-mail us: \nevening@cbsnews.com\n  \n\n\n\n\nTONIGHT ON DAVID LETTERMAN\n\n  Join Dave tonight on The\n  Late Show with actress Edie Falco AND comedian Paul Scheer...\n  Plus, musical guests Son Volt! \n\n\n\n\nTHURSDAY MORNING ON THE EARLY\n  SHOW\n\nHarry Smith\n  and Kelly Wallace will anchor THE EARLY SHOW from\n  Blacksburg, VA. Russ\n  Mitchell anchors from New\n    York. Dave Price\n  will bring us the weather. Hannah Storm\n  and Julie Chen are off. \n\n  We will continue to cover the \"MASSACRE\n  AT VIRGINIA\n  TECH\". \n\n  We will have the latest on the allegations that Cho Seung-Hui had engaged in\n  stalking behavior, reaction from students, and how the injured are\n  recovering. Including: \n\nSTUDENT REACTION: Shot in the\n  massacre, Garrett Evans may never be the same. That is because doctors have\n  made the decision to leave the bullet in his injured leg. How is Garrett\n  coping through the pain? We'll speak with him Wednesday morning. \n\nSTUDENT REACTION CONTINUES:\n  We'll speak with a fellow English major who was enrolled in the same\n  playwriting class as Cho. What were the signs in Cho's writing? We'll find\n  out Wednesday morning. \n\nCOLUMBINE ANNIVERSARY: School\n  shootings are nothing new. As we approach the anniversary of Columbine, we'll\n  speak with a parent who knows all too well what it is like to lose a child in\n  such a horrific tragedy. Tom Mauser will join us. \n\n  If you would like more information on any of these stories or the broadcast,\n  please click on the following address and e-mail us: earlyshow@cbs.com \n\n\n\n\nTO SUBSCRIBE\nClick here to\n  subscribe to the Inside Scoop.\n\nTO UNSUBSCRIBE\n  Unsubscribe information is included in each e-mail you receive. \n\nTRANSCRIPTS AND VHS TAPES\n  For transcripts of our CBS News broadcasts, please call 1-800-777-TEXT. To\n  order VHS copies, please call 1-800-934-NEWS\n\nCOMMENTS \n  Please know that we do read all the e-mails that are sent to this newsletter\n  and when appropriate, these e-mails are forwarded to the each of the\n  respective broadcasts. Email us at InsideScoop@cbsnews.com. While we\n  do try to answer each e-mail, please be advised that sometimes we are just\n  not able to. Thank you. Your friends at the Scoop. \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\n  CBSNews.com, 524 W. 57th St.,\n  Room 514/1, New York, NY, 10019\nHelp | Advertise\n  | Terms of Service | Privacy Statement\n  ©MMVII, CBS Interactive Inc. All Rights Reserved. \n\n\n\n \n\n\n\n"}