{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "James ARKINSTALL <James.ARKINSTALL@paris.msf.org>", "subject": "[Ip-health] FT: Boerhinger Ingelheim to slash price of nevirapine", "body": "\nhttp://www.ft.com/cms/s/8581296e-0281-11dc-ac32-000b5df10621.html\n\n\nHIV drug price slashed\n\nBy Andrew Jack in London\n\nPublished: May 15 2007 03:00 | Last updated: May 15 2007 03:00\n\nBoehringer Ingelheim, the privately-controlled German pharmaceutical\ncompany, is to slash the price of a pivotal HIV drug in the developing\nworld and waive all barriers to generic manufacturers producing low-cost\ncopies.\n\nIn an interview with the Financial Times, Alessandro Banchi, chairman of\nthe company's managing board, unveiled measures to boost low-cost access to\nits medicine nevirapine (Viramune). \"We want to solve the problem (of\naccess) once and for all,\" he said.\n\nBoehringer Ingelheim will reduce the price of the drug by 50 per cent to 60\ncents a day per patient in 78 low-income countries, and by up to 90 per\ncent to $1.20 in 67 middle-income countries. In wealthy nations it sells\nfor $10-14 a day.\n\nSeparately, the company will waive 5 per cent royalty payments, reporting\nrequirements and other existing obligations for generic producers approved\nby the World Health Organisation to make nevirapine using voluntary\nlicences to override patents on the drug, in favour of a \"non assert\"\npolicy.\n\nThe action will put fresh pressure on other drug companies to cut medicine\nprices in poorer countries for essential medicines, at a time when Brazil\nand Thailand recently announced compulsory licences to override rival\ncompanies' patents in spite of the manufacturers' objections.\n\nThe move follows a disappointing take up by low-cost generics producers of\nBoehringer Ingelheim's previous offer to issue voluntary licences, as it\nattempts to stimulate others to produce its drug at the lowest possible\ncost.\n\nIn a blow to rivals' claims that deeper discounts are not possible without\nremoving necessary incentives to innovation, Mr Banchi added: \"Preferential\npricing is the only way how we can meet both conflicting needs in the fight\nagainst Aids. We can refinance our high research and development costs for\ninnovative, new treatments by the established price system in\nindustrialised countries and can offer affordable medicines to patients in\npoor countries who otherwise cannot afford antiretroviral medication.\"\n\nBoehringer Ingelheim last year reported worldwide sales of \\u20ac276m ($373m)\nfrom nevirapine, a modest amount compared with its other drugs. Mr Banchi\nsaid that if the decision to produce the drug was made on economic grounds\nalone, he would have ceased manufacture.\n\nNearly a third of nevirapine is supplied to the developing world, where it\nhas also provided 1m treatments free of charge since 2000to prevent\nmother-to-child transmission of HIV.\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}