{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisiory 7/5/07 - TV, Intelligence and More", "body": "July 5, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\nThere's Nothing On!\n\nThe SAT Measures What?\n\nA Company With Predictive Decisioning Software\n\n-----\n\nMy wife recently attended a conference in upstate New York and one night\nfound herself back in her hotel room, turning to the television for\nentertainment.\n\nNow, in our family, real-time network television is a rare event.   \nThanks to Replay TV, a one-time competitor of TiVo in the DVR (digital\nvideo recorder) business, our favorite shows get recorded on a big hard\ndisk and we watch them when we want, skipping the commercials as we go. \nIn fact, the only time we watch commercials is during the Super Bowl.\n\nMore often, we read.\n\nIn any event, there was my wife, in a New York state hotel room, \"forced\"\nto choose from a dreadful selection of real-time network TV offerings.\n\nOf course she could have turned it off, but in that dull hotel room in\nthat strange town, she was just searching for a little life, a little\nhumor, a little intelligence.  What she got was bad TV, along with an\nonslaught of repetitive, often-insulting commercials.\n\nSo she called me, and somewhere along the way she asked, \"Why do people\nwatch this garbage?  And why do the networks play the same commercials,\nsometimes several times during the same show?\"\n\nI couldn't give her an easy answer, but I did sympathize, and that's\nreally what she wanted.\n\nSoon after, I googled \"top ten TV shows,\" and here's what I found.\n\nAmerica's Got Talent\nDateline NBC\nDeal or No Deal\nLaw and Order\nN-C-I-S\nC-S-I\nAre You Smarter Than a 5th Grader?\nTwo and A Half Men\nSo You Think You Can Dance?\nC-S-I Miami\n\nI've never seen any of these, which goes to show you how out of touch I\nam.\n\nBut I do know (from reading) that four of them are crime dramas, two are\ntalent searches, two are game shows, one is a sitcom and one is a news\nmagazine that typically focuses on human-interest stories.\n\nReviewing this list, I'm reminded of the words of HL Mencken, who wrote,\n\"No one in this world, so far as I know, has ever lost money by\nunderestimating the intelligence of the great masses of the plain\npeople.\"\n\nThen, a few days ago one of my editors commented to me, no doubt after\nviewing one of the those headlines like \"Man Shoots Self in Groin While\nAttempting To Make Ham Sandwich,\" \"You know, half of Americans are of\nbelow average intelligence.\"\n\nUpon reflection, it's obvious.  And it's statistically inevitable.   \nThe average is near the middle, so half will always be below the average\n(technically, below the median, but given the very large numbers we're\ndealing with, there's little difference.)\n\nAnd if you don't know the difference between mean and median, you probably\nhaven't crammed for an SAT test lately.\n\nThe converse, however, does not mean that if you do know the difference\nyou have crammed for the test recently.  That's logic at work.\n\nAnd the SAT, now that I've brought it up, is not what it used to be.\n\nIn 1901 it debuted as the Scholastic Achievement Test, supposedly\nmeasuring what students had learned.\n\nIn 1941, the name was changed to Scholastic Aptitude Test, supposedly\nmeasuring what students were capable of learning, if they had the proper\nsocio-economic advantages.\n\nIn 1990, that was changed to Scholastic Assessment Test, supposedly\nmeasuring . . . something scholastic?\n\nAnd in 1994 the name was changed to SAT (the letters officially standing\nfor nothing at all!)\n\nFinally (or, should I say, most recently, because I suspect there are more\nchanges around the corner), in 2005 the name was changed to SAT Reasoning\nTest, creating a potential redundancy of the word \"Test\" but only if the\nfirst T still stood for Test, which it doesn't.\n\nReasoning, of course, includes logic, and I like that a lot. I hope they\nkeep that name for a while.\n\nNow, I took the SAT a few decades back.  Two of my kids have taken it and\nthe third is likely to in a couple years.  But something else has changed\nover the decades besides the name.  In 1995 the yardstick for scoring was\nadjusted to account for the growing number of kids from less rigorous\nschools taking the test.\n\nThe reason?  The big bulge in the middle of the distribution curve, which\nhad previously been centered at 400, had slipped down into the mid-300s. \nTo get the mid-point back up, the average verbal score was artificially\nincreased by some 70 points while the average math score had 20-30 points\nadded.\n\nThe kids at the top and bottom were barely affected, but the masses of\naverage kids near the middle saw their scores bumped up dramatically.\n\nWhat does it matter?  Well, a good score helps you get into college.   \nBut is there a correlation between success on the SAT and success in\ncollege?  Looking further out, is there correlation between success on the\nSAT and success in life?\n\nThe simple answer is, some, but not a lot.  And more and more colleges are\nrecognizing that; the number of colleges that admit students without\nregard to test scores now exceeds 400.\n\nBut the SAT lives on, and will continue to be here for years to come. \nWhy?  In part because it's the product of The College Board.   \nThe College Board is a non-profit organization, and while there's no doubt\nthat it works hard to serve the high schools and colleges and families\nthat use it, there's even less doubt - in my mind - that the organization\nworks even harder to ensure its own survival.\n\n\n----- ADVERTISEMENT -----\n\nJoin Cabot Stock of The Month and get in on the next stock that explodes\nlike these...\n\n * Broadvision-up 670%\n * Intuitive Surgical-up 500%\n * Yahoo-up 317%\n * Amazon.com-up 1,290%\n * First Marblehead-up 50%\n * International Game Technology-up 110%\n * eResearch Technology-up 180%\n * NetEase-up 100%\n * Expedia-up 114%\n * Broadcom-up 97%\n * Netflix-up 173%\n * Psychiatric Solutions-up 85%\n * PetroKazakhstan-up 86%\n * Nautilus-up 109%\n\nThat's the beauty of Cabot Stock of the Month. It gives us the opportunity\nto choose the best stock across all sectors, using our proven spectrum\nsystem. Sign up today and you'll get immediate access to all current\nrecommendations, along with the free bonus report, Sector of the Year.\n\nTo learn more, please visit this link:\n\nhttp://cabotmail.net/t/208666/13148861/102/0/\n\n-----\n\nSpeaking of intelligence, here's a news item I noticed recently.\n\n\"A financial services firm in Japan has begun offering lower mortgage\ninterest rates to \"intelligent\" customers.  GE Consumer Finance Company is\ngiving discounts to people who have good English or computer skills, and\nwork in \"high-value\" areas such as the law.  The company says more highly\nskilled workers usually find it easier than others to get jobs and to keep\nthem. They are therefore less likely to become insolvent and default on\ntheir home loan.  GE Consumer Finance Company claims this is the first\ntime that mortgage rates have been calculated like this in Japan.  People\nwho have high scores on a test of English proficiency and officially\ncertified IT skills can apply for a small discount.  Those of them who\nalso have certain jobs - such as lawyers, accountants, doctors and\nfinancial experts - can obtain further discounts.  If a couple are both\nemployed in the 20 \"high-value\" professions listed by the company, they\nwill be entitled to a major rate reduction.\"\n\nIt makes sense, and I'm guessing it's illegal to discriminate that way in\nthe U.S.\n\n-----\n\nGetting back to TV, the problem is not just the quality of programming but\nthe quantity of time people spend viewing.\n\nThe TV is on for over 7 hours in the average American home, and the\naverage American watches over 4 hours of TV per day.\n\nWorse still, the average American child watches 1,023 hours of TV a year\nand spends 900 hours in school.\n\nAnd one thing they're seeing in those hours is commercials.  For broadcast\nTV, commercials pay the bills, and the advertisers are doing all they can\nto ensure that the message from those commercials reaches your brain.\n\nBut more and more these days, people are working to avoid those\ncommercials by fast-forwarding through them using DVRs.\n\nSo NBC recently tested people to see if those commercials had any impact\nat high-speed.  NBC, you know, wants its advertisers' money even if\nviewers are watching at fast speeds.\n\nThe result, according to a story three days ago in The New York Times,\n\"judging from the biological reactions, the test subjects were just as\nengaged while watching fast-forwarded advertisements as they were while\nviewing opening scenes from the NBC show \"Heroes\" at regular speed.\"\n\nWhen it comes to fast-forward advertisements, \"the assumption has always\nbeen that they have no economic value, that they have no communication\nvalue,\" said Alan Wurtzel, president for research at NBC Universal. \"But\nthe fact of the matter is we're learning that they are valuable.\"\n\nAnd they're so \"valuable\" to the financial health of the TV industry that\nthe commercial-skipping DVR that I bought years ago can no longer be\nbought!\n\nBut the problem is not just the commercials.  The problem is that every\nminute spent watching TV is a minute not being used to reflect, to do\nsomething productive, or to interact with other family members.\n\nAnd the result of all this TV viewing, according to a recent study by the\nCulture and Media Institute, is that \"increased exposure to television\ncorrelates with a decline in acceptance of personal responsibility.\"\n\nNow, it's important to note that the word correlate was used there.   \nOfficially, there's no established causality.  But my sense is that our\ncountry has seen a marked decrease in a sense of personal responsibility;\nthat too many people all too easily blame others for their troubles.\n\nAnd when personal responsibility shrinks, we get a culture that thinks\nit's okay to act stupid because somebody else will pick up the tab.\n\n----- Contest -----\n\nNow, there is an investment idea coming here, but first I want to give a\nreward to a loyal reader who has chosen to read this far.   \n\nWho?  It could be you.  Just send me an e-mail right now addressed to\ncontest@cabot.net.  Put \"CONTEST\" in the subject line.  The sender of the\n50th e-mail received (no duplicates, please) will receive his choice of a\ncomplimentary one-year subscription to any one of our publications.  The\nwinner's name and state (or country if outside the U.S.) will be announced\nin the Saturday issue of Cabot Wealth Advisory, so if you want privacy,\ndon't enter.  It's simple.  Do it now.\n\n-----\n\nAnd now, finally, here we are at today's stock.\n\nIt's about intelligence and it's about marketing, and if you understand\nhow important marketing is to the world, you may like this one enough to\ninvest in it.\n\nYou know and I know that at every turn, companies are doing their darndest\nto sell us things.  At Amazon they know what I've bought before and thus\nknow what to sell me next.  And at Netflix they know what movies I've\nrated highly so they can suggest other movies they think I'd enjoy.\n\nThose two firms have developed specialized software that serves their\nindividual needs, but for most companies, there's off-the-shelf software\nthat works very well, and a lot of it is coming from a company named\nChordiant.\n\nHere's what we wrote in a recent issue of Cabot Top Ten Report.\n\n\"Chordiant (CHRD) makes customer service and marketing software that helps\nbig companies deal with their customers, so that the goals of both the\nmerchant and the customer are met. Customers include 21st Century\nInsurance, Bank of Ireland, Banque Populaire, Barclays, Capital One, Covad\nCommunications, Cox Communications, Deutsche Bank, HSBC, Lloyds, MetLife,\nNokia, Prudential, Royal Bank of Scotland, Royal Dutch Shell, Time Warner\nCable, T-Mobile, UPS and Wachovia. These are huge blue-chip companies, yet\nChordiant is still a small company, and growing fast. Historically, the\ncompany has had trouble making a profit (its last profitable year was\n2004), but after the first quarter's terrific results, CEO Steven R.\nSpringsteel commented that solid profitability was \"due to the strong\nperformance in our international business, the acceleration of percentage\nof completion project implementations in Europe, and greater enablement of\nour partners resulting in fewer Chordiant resources being required on some\nproject implementations.\" It sounds good to us. Since then the company has\nbeen awarded a patent for \"advanced predictive decisioning technology.\" In\nother words, the companies using this software sometimes know what you're\ngoing to buy before you do! As companies come to depend on this software,\nChordiant's future is likely to be consistently profitable, and the\nrealization of that is why the stock is strong today.\"\n\nDigging deeper, I see that Chordiant has been growing revenues since 2003,\nand in the latest quarter saw revenues grow 25% from the year before to\n$32.8 million, while earnings jumped from a penny per share to $0.18 per\nshare.  Analysts are projecting a profit of $0.48 per share this year and\n$0.72 per share next year.  And the after-tax profit margin was a fat\n19.6%.\n\nTrading at 16, it's rather low-priced and thus carries the extra risk of\nvolatility that comes from stocks at this level.   But average trading\nvolume is nearly 500,000 shares per day, and institutional interest is\ngrowing.  I'd like it better on a dip to 15, but if it doesn't dip there\nin the week ahead, 16 may be the best price you'll get.\n\n-----\n\nEditor's note:\n\nTo get regular updates on Chordiant, and to get first notice of other hot\nstocks, consider a no-risk trial subscription to Cabot Top Ten Report. \nEvery issue will include a buy-hold-sell rating on the stock.  More\nimportant, every issue will bring you full fundamental and technical\nanalysis of the ten hottest stocks in the market, so you'll get early\nwarning about the next Google, the next Apple Computer and the next Hansen\nNatural.\n\nTo get started with a no-risk trial subscription simply click the link\nbelow.\n\nhttp://cabotmail.net/t/208666/13148861/81/0/\n\n-----\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n\n------\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=208666&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}