{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "Tristan <gcl@bevcomm.net>", "subject": "For those who do not know Michael Stonebraker, suffice it to say that he does not work for me.", "body": "ERMX Jumps 12.5% and Volume Goes Through The Roof!\n\nEntreMetrix Inc. (ERMX)\n$0.18 UP 12.5%\n\nBig news last week pushed investors to the table. Wallst.net release of\nan audio interview got them excited. This is only the first day after\nthe release. Act fast and get on ERMX Tuesday morning!\n\nAnd even though there have been no verified reports of the data having\nbeen accessed or used by the thief, it would be kind of frightening to\nme if someone were to have my medical records.\n\nAs data professionals, many of us are just cogs in the machinery.\n\nAnd ninety-two percent of that information is stored on magnetic media,\nmostly hard disk drives.\nAnd a few things that Dvorak does not even mention include the World\nWide Web, Java, and spam.\n\nMy only recourse is to implement them or quit. I try to avoid making\npredictions about the future of technology for many reasons.\nThis book is uniquely geared toward the database-literate baseball fan.\nCheck this piece of junk mail out.\n\nModern organizations are going to have to come up with better methods of\nprotecting \"their\" data. In my opinion, this is a good thing.\n\nTap into the potential of this DBA community to expand your business!\n\nThe approach taken by Google, for example, whose much-ballyhooed notion\nof \"do no evil\" is, in my opinion, worthless. Folks want to know how to\ngo about doing it. They're gonna cost ya extra!\n\nThere are criteria that should be applied during the selection process.\nHowever, if your shop is more conservative, a DBMS that changes so\nquickly can be difficult to support.\n\nAnd I touched on the topic of governance in this blog before when I\nrooted for jail time for business executives. \"  But then I am given no\ncontrol over my time.\n\nOracle has a mainframe version of their database server, but IBM is far\nand away the market leader here.\n\nAnd how robust is your backup and recovery?\n\nThe predominant government regulation driving most of these concerns is\nthe U. So those seats in coach that are only marginally comfortable?\nSolutions, though, are slow coming.\nBy that I mean we need to become better informed about what our\nemployer's are doing to protect data. I don't know, but I think air\ntravel is about to become a LOT worse than the horrible experience it\nalready has become. , Keep Your Databases up to P. And SOX will bring\nvisibility and additional rigor into DBA practices and procedures.\n\nAnd it should be clear what is meant.\n\n"}