{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's Newsnight & Newsnight Review", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tFRIDAY 8 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM KIRSTY WARK\n\t\t\t\t\t\n\t\t\t\t\tHello to viewers at home and abroad, \n\n\n\nHILLARY CLINTON\n\n\nAs I write, we have a packed programme including the first British interview with Carl Bernstein about his new book A Woman In Charge: The Life of Hillary Rodham Clinton. He spent six years writing and researching it and it is published amidst a slew of books on the Clintons. In it he alleges she has suffered from depression, and that Hillary and Bill Clinton, decades ago, devised a strategy for a husband two term presidency followed by the same for his wife. \n\n\nThe book makes clear the energy and effort that went into devising strategies to deal with Bill Clinton's infidelities, but are they continuing? I'll also be asking Carl Bernstein why, when there is a feeling in America that the Democrats should win, when Hillary Clinton is put in the frame the mood changes.\n\n\nG8\n\n\nThe G8 pulled more aid for Africa out of the hat before the world leaders went their separate ways - or did they?  \n\n\nBob Geldof has called the summit a farce. There seems to be some disagreement as to whether new money has been pledged by countries that were falling behind in their promise to deliver by 2010, or whether the new drive to boost the fight against Aids and provide free schooling for all African children is a reassignment of existing donations. \n\n\nWe hope to have the definitive answer tonight. We're hoping to speak to Bob Geldof. And we'll be asking the  International Development Secretary, Hilary Benn, what exactly have the G8 countries signed up to on Africa?\n\n\nGB TOUR\n\n\nPaul Mason brings us his next instalment of the Zombie Brown Grand Tour. We'll be watching his progress through the north east of England, the heartlands of traditional Labour values, to find out what they are expecting to happen when the Brown boat comes in.             \n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nVENICE SHOWCASE FOR ISLAMIC ART\n\n\t\t\t\t\t\t\tThe world's longest running art show is offering a prominent showcase for Islamic art this year\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\nnewsnight review\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tPRESENTED BY KIRSTY WARK\n\t\t\t\t\t\n\nAnd then I'm joined for Newsnight Review by Johann Hari, Rachel Holmes, Jonathan Freedland and Anthony Horowitz.  \n\n\nMEMORY ALMOST FULL by PAUL McCARTNEY\n\n\nWe review Paul McCartney's new album - Memory Almost Full. It's named for the text that pops up on your mobile phone and just to reinforce the fact that the former Beatle is fully conversant in new technology, he is now part of the YouTube generation, where you can see snippets of conversation with Macca, his pop video and rehearsal sessions. \n\n\nThe swish CD is also his first release away from EMI and into the coffee houses - it's the debut album on the Starbucks label Hear Music. The music itself mines his past, his childhood, Liverpool and summers gone he says, as well as his writing days with John Lennon. \n\n\nMICHAEL TOLLIVER LIVES by ARMISTEAD MAUPIN\n\n\nArmistead Maupin first introduced us to the liberal gay San Francisco scene in the late 70's with the start of his Tales From The City series.  Now over 20 years on, he and we are revisiting some of his favourite characters - most important of all Michael Tolliver, in Maupin's new novel, Michael Tolliver Lives. Michael, the gay gardener, now in his 50s, lives with HIV and is married to a much younger partner. Their lives are bound up with biological family - Christian fundamentalists - and a \"logical family\" gay, straight, transgenerational and transexual with whom they work, rest and play. \n\n\nTHE DROWSY CHAPERONE\n\n\nThe first smash hit musical out of Toronto is some accolade, but The Drowsy Chaperone is just that - now in London's West End, by way of Broadway where it picked up five Tony Awards.\n\n\nThe star billing goes to Elaine Paige who plays the sozzled spinster of the title, but the middle aged, cardiganed, musical-loving geek in the armchair at the corner of the stage is a star too. Played by Bob Martin, who also co-wrote the book, The Man in the Chair takes us through The Drowsy Chaperone, a parody of a 20's musical with wit and charm. \n\n\nHELIO OITICICA: THE BODY OF COLOUR\n\n\nThe Brazilian artist Helio Oiticica was a leader of the modernist avant-garde art movement in his country in the 60s and 70s and was obsessed with colour until his premature death in 1980. His inspiration was artists such as Malevich, Klee and Mondrian but he went further in his desire to liberate colour into space.  \n\n\nNow Tate Modern is holding the first major UK exhibition of his work in 35 years entitled The Body of Colour - including work the Tate has recently acquired. The exhibition reveals Oiticica's belief that colour could be experienced through collage, sculpture, poetry, painting, installation and most gloriously - specifically in work called Parangole - in dance when the dancer becomes the colour.\n\n\nJoin us for a colourful discussion at 11.\n\n\nKirsty\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}