{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nI’ll be anchoring tonight’s broadcast\n  from North Carolina, home of Duke University,\n  where the sensational case of three lacrosse players accused of sexual\n  assault has unfolded. Now comes redemption for the accused former college\n  students, Reade Seligmann, David Evans and Collin Finnerty. Prosecutors have\n  decided to drop all criminal charges against the young men, saying the\n  athletes were victims of a “tragic rush to accuse” by District\n  Attorney Mike Nifong – who himself is now under scrutiny. I’ll\n  have that story and my colleagues will be with me in North Carolina covering all the angles.\n \nThe rape accusation last spring has had widespread\n  ramifications – it has stoked racial tensions in the Raleigh-Durham\n  community, scarred three families and tarnished the reputation of one of the\n  country’s top universities – but, as Bob Orr will report, the\n  legal case really was no case at all. \n \nDespite that, the parents of the three accused men,\n  who are now 20, 21 and 24 years old, spent an estimated $3.5 million on\n  lawyers. All three are now vindicated, but are still victims. Byron Pitts\n  will take a look at how the accusation has changed the lives of the accused\n  young men and will tell us where they are now.\n \nAnother reputation tarnished by the accusations was\n  that of one of the country’s top higher education institutions: Duke University.\n  Kelly Wallace will take a look at the media glare that focused on Duke and\n  its lacrosse team for the past year and assess the impact of the accusation\n  on the campus and community.\n \nAnd then we’ll turn to the controversy over\n  on-air comments made by Don Imus about the Rutgers\n  women’s basketball team. The radio host was suspended for two weeks\n  after making the remarks, but it is yet to be seen whether he will stay in\n  his position. But how much is he worth to his broadcasters and advertisers?\n  Anthony Mason will have the story.\n \nFinally, I sat down with the family of Reid\n  Seligmann, one of the accused Duke lacrosse players. I’ll share our\n  conversation with you tonight.\n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}