{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Genesearch <enews@genesearch.com.au>", "subject": "For RNA Research", "body": "\nYou're receiving this email because of your relationship with Genesearch. Please confirm your continued interest in receiving email from us or select your areas of interest to choose what kinds of information you are interested in.  You may unsubscribe if you no longer wish to receive our emails.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNew Products for RNA ResearchGenesearch eNews - July 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    In This Issue\n                    \n\n\nRNA Workbench Software\n\nPotent Convenient siRNA\n\nAnalysis: Ladders & Markers\n\nSynthesis, Ligation & Cloning\n\nRNA Isolation\n\n\n\n\nQuick Links\nNew England Biolabls\nCLC bio\nGenesearch\nAustralian Prices\n\n\n\n\n\n\n\n\n\nNew!RNA Workbench\n\n\n\n\n\n\nThe newcomer in CLC bio's workbench family focuses on RNA secondary structure prediction, using state-of-the-art free energy minimization algorithms - and is the first to offer an integrated and professional solution for RNA research.With CLC RNA Workbench, CLC bio offers a solution which will help RNA researchers to a considerably more efficient workflow, and thereby also save precious time in the research phases. Furthermore, researchers will get better quality in the results, due to the easy and user-friendly access to the cutting edge algorithms included in this new workbench. CLC bio offers a free 30-day trial of CLC RNA Workbench which can be downloaded here. \n\n\n\n\nPotent, Convenient siRNA\n                    \n\n\n\n\n\nFinding potent siRNAs against a specific target is a major task of many laboratories.A recent study in Biotechniques* compared silencing via enzymatically generated siRNAs against a large portion of a gene, versus several commercially available single synthesized siRNAs. All the enzymatically derived siRNA mixtures had higher silencing potency than most single synthetic 21-mers.This study indicates that targeting multiple sites of the mRNA by siRNA mixtures ensures robust target silencing.If you are working with gene silencing, try NEB's Shortcut RNAi Kit (#E2450S): for highly selective and potent silencing without needing siRNA design, and fast: from DNA template to transfection in just 1 day! * \"Determination of silencing potency of synthetic and RNase III-generated siRNA using a secreted luciferase assay\" - Biotechniques 42(5):599-605 (May 2007)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear zombie,\n\n\nOur understanding of the importance of RNA in the cell has grown dramatically in the last few years, notably in the regulation of gene expression by small RNAs and the RNAi mechanism, with new classes of RNA still being discovered.New England Biolabs is committed to developing new reagents for the isolation, amplification, copying and cloning of RNA molecules, and have also developed enzymatically generated, potent siRNA mixes for selective gene knockdown as well as providing transfection reagents for transferring the RNAs into cells.We are also pleased to announce the release of the RNA Workbench, the latest addition to CLC bio's range of bioinformatics software.If you are interested in RNA research, please read on! \n\n\n\n\n\n\n\n\n\n\n\nAnalysis: RNA Ladders & Markers\n\n\n\nNEB now provide a range of RNA ladders and markers:dsRNA Ladder: 21 to 500 bp size standards for dsRNA in native gels (#N0363S)Low Range ssRNA: 50 to 1,000 base size standards for ssRNA (#N0364S)siRNA Ladder: 17, 21 and 25 bp dsRNA specifically for siRNA in native gels (#N2101S)microRNA Ladder: 17, 21 and 25 bp ssRNA standards (#N2102S)\n\n\n\n\n\n\n\n\n\n\n\nSynthesis, Ligation & Cloning\n\n\n\n\t\t\t\t\tIn addition to their existing products such as MMuLV Reverse Transcriptase and RNA ligase, NEB also offer:E. coli Poly(A) Polymerase:Template-independent addition of AMP from ATP to the 3' end of ssRNA: for labelling the 3' end of RNA with cordycepin or ATP; generating a poly(A) tail for cDNA synthesis, cloning or affinity purification; or enhancing translation of RNA transfected into eukaryotic cells. (#M0276S & L)phi6 RNA Polymerase (RdRP):Phage RNA dependent RNA polymerase: for highly processive copying of ssRNA into dsRNA; synthesis of dsRNA in vitro and for RNAi experiments. (#M0255S & L)AMV Reverse Transcriptase:RNA-directed DNA polymerase for synthesis of cDNA from ssRNA for cloning or quantitation. Advantages include high purity (necessary for synthesis of full-length cDNA); higher temperature optimum than RT's from mammalian viruses; suitable for RNA sequencing and RT-PCR. (#M0277S & L; 2.5x concentration also available - #M0277T)T4 RNA Ligase 2, truncated:For ligation of RNA and/or DNA. Advantages are it requires 5' pre-adenylated RNA or DNA for ligation, reducing background ligation; joins single stranded adenylated primer to small RNAs for cloning; selectively ligates an adenylated oligo in an RNA:DNA hybrid; and suitable for miRNA cloning. (#M0242S & L)\n\n\n\n\n\n\n \n\n\n\nRNA Isolation\n\n\n\nMagnetic mRNA Isolation Kit:Isolate intact poly(A)+ RNA from cells and tissue. Eliminates the need for phenol or other organic solvents and the need to precipitate poly(A)+ transcripts, allowing complete isolation in less than one hour with negligible gDNA contamination. Features reusable Oligo d(T)25 paramagnetic beads and is suitable for automated high-throughput applications. (#S1550S)p19 siRNA Binding Protein:For the isolation of siRNA. For binding RNA in a size dependent and sequence independent manner; high affinity purification of siRNA with chitin magnetic beads; suppressing RNA interference in plants. (#M0310S & L)\n\n\n\n\n\n\n\nFor further information on any of these products, please email us or phone us on freecall 1800 074 278. \nSincerely, \nGenesearch \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGenesearch is the Australian distributor for New England Biolabs enzymes and kits for molecular biology, Finnzymes PCR enzymes and instruments, Cell Signaling Technology antibodies for cell signaling research, CLC bio's bioinformatics software and hardware, and Gene Codes Sequencher for DNA sequence assembly & analysis.. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForward email\n\n\n\n\nThis email was sent to ktwarwic@speedy.uwaterloo.ca, by enews@genesearch.com.au\nUpdate Profile/Email Address | Instant removal with SafeUnsubscribe™ | Privacy Policy.\n\n\nEmail Marketing by\n\n\n\nGenesearch | 14 Technology Dr | Arundel | 4214 | Australia\n\n\n\n\n"}