{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nSunday, 20 May, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nBayern confirm sale of Hargreaves\nBayern Munich agree to sell Owen Hargreaves to Man Utd for \"around\" £17m.\n\n\n\n \nMan Utd consider bid for Zombie\nHearts and Scotland goalkeeper Craig Zombie could be an £8m target for Manchester United, BBC Sport understands.\n\n\n\n \nAberdeen v Rangers\nMatch report follows from Sunday's Scottish Premier League game at Pittodrie Stadium.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nHarrington claims Irish Open win\nPadraig Harrington becomes the first home winner of the Irish Open in 25 years after beating Bradley Dredge in a play-off.\n\n\n\n \nAT&T Classic leaderboard\nThe latest news from the PGA Tour event at Sugarloaf, Georgia.\n\n\n\n \nSybase Classic leaderboard\nThe latest scores from the LPGA Tour at Upper Montclair, New Jersey.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nVermeulen wins in rainy Le Mans\nSuzuki's Chris Vermeulen wins a rain-swept French MotoGP at Le Mans.\n\n\n\n \nGronholm benefits from Loeb spin\nMarcus Gronholm wins the Rally of Italy after leader Sebastien Loeb spins out on the final day.\n\n\n\n \nMosley steps up push for green F1\nFormula One boss Max Mosley is proposing a raft of changes to help accelerate the adoption of \"green\" technology.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nMosley steps up push for green F1\nFormula One boss Max Mosley is proposing a raft of changes to help accelerate the adoption of \"green\" technology.\n\n\n\n \nHamilton won't win title - Jordan\nFormer team boss Eddie Jordan says Lewis Hamilton is an \"extraordinary talent\" but will not be world champion this year.\n\n\n\n \nHamilton will set 'new standards'\nLewis Hamilton will \"create the new benchmark for Formula One\", according to three-time champion Jackie Stewart.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nPavey races to Manchester victory\nBritain's Jo Pavey produces a world-class performance to win the Great Manchester Run.\n\n\n\n \nGB trio shine in Great Wall test\nBritain has three top-10 finishers in China's Great Wall Marathon as Salvador Calvo smashes the record in one of the world's toughest 26-mile races.\n\n\n\n \nUK to host landmark running event\nThe first-ever Commonwealth ultra running championships will be held in the UK in 2009.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nArvesen claims eighth Giro stage\nNorwegian Kurt Asle Arvesen snatches the eighth stage of the Giro d'Italia beating world champion Paolo Bettini in a sprint finish.\n\n\n\n \nLandis denies doping at hearing\nFloyd Landis again denies taking performance-enhancing drugs at a hearing in Malibu.\n\n\n\n \nPetacchi takes Giro seventh stage\nItaly's Alessandro Petacchi of the Milram team wins the seventh stage of the Giro d'Italia from Spoleto to Scarperia.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nReview of the week\nMovie legend to strip if team go up, as the hunt for Mourinho's dog goes on\n\n\n\n \nKP's rough guide to Britain\nListen to Pietersen spoof on new Radio 4 show Look Away Now\n\n\n\n \nComment: Blues up for the Cup\nRobbo backs Chelsea, providing there are no more dog dramas\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}