{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Steve Langasek <vorlon@debian.org>", "subject": "Re: inappropriate use of Debian Official Use Logo (Re: Hinner EDV: \tCorrect Logo Usage?)", "body": "On Wed, Apr 11, 2007 at 11:37:47AM +0100, MJ Ray wrote:\n> Bart Martens  wrote:\n> > > > * Steve Langasek:\n> > > > > Please escalate this to the DPL and/or SPI.  He certainly doesn't have a\n> > > > > legal right to use that logo,\n\n> > I agree with Steve that the \"Debian Official Use Logo\" is used in a way\n> > that is not allowed by the license published at\n> > http://www.debian.org/logos/ .\n\n> Please can someone explain to me how this use of the official logo\n> doesn't satisfy the licence?  It seems to be used to promote sales\n> of official CDs which are clearly labelled which parts are official.\n> Is the complaint that the logo is positioned in a confusing way (by\n> the menu rather than right next to the relevant product descriptions),\n> or that the CDs aren't really official CDs, or something else?\n\nWhen visiting that website, I saw no evidence that it was being used to\npromote the official CDs -- I saw only the official logo standing alone on\nthe page, which to me looked like it's being used to promote the site, not\nthe official CDs themselves.\n\nIf he's selling official CDs (which, as I said, was not at all obvious to\nme), then there's no reason to go C&D'ing anyone here, but there's at least\nroom for improvement in the labelling which I hope he would be amenable to\nworking with Debian on (given a clear and authoritative statement on\nDebian's behalf, that is).\n\n-- \nSteve Langasek                   Give me a lever long enough and a Free OS\nDebian Developer                   to set it on, and I can move the world.\nvorlon@debian.org                                   http://www.debian.org/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}