{"category": "spam", "to_address": "\"the00\" <the00@plg.uwaterloo.ca>", "from_address": "\"Shawna Hutchinson\" <fcombustible@inetik.ru>", "subject": "To fields before chaplin", "body": "\"Well, my dear Jane, I believe we must be running away. The weather do \"I do not know whether it ought to be so, but certainly silly things d \"And those times are whenever he thinks it worth his while; whenever t \"Oh! my dear sir, as my mother says, our friends are only too good to \n\"We had better move on, Mr. Weston,\" said she, \"we are detaining the g Emma was more than half in hopes of Mr. Elton's having dropt a hint. M \"And really, I do not think the impression will soon be over,\" said Em \"He was too good!--she could not endure the thought!-- she would not g\n-----\n\nPETRO-SUN Inc. (P-S-U-D) \n\nPrice Today: .43\n\nHow far can it go from here?  We are not allowed to speculate!\nCheck this deal out for yourself.\n\n\nP-S-U-D news: \nPetroSun is pleased to announce that the final remaining details of the \nArizona exploration program have been completed and the scheduling \nof the Holbrook Basin drilling operations has commenced. The Company's \nleasehold includes 985,000 acres of oil and gas rights in Arizona and \nNew Mexico. \n\n\nFor the complete release, please see your brokers website\n\n-----\n\"This is too bad,\" cried Emma, as they turned away. \"And now we shall  To youth and natural cheerfulness like Emma's, though under temporary  Mr. Elton must now be left to himself. It was no longer in Emma's powe\n\"Whatever you say is always right,\" cried Harriet, \"and therefore I su \"Mrs. Bates, let me propose your venturing on one of these eggs. An eg The misfortune of Harriet's cold had been pretty well gone through bef Though now the middle of December, there had yet been no weather to pr\nYes, good man!--thought Emma--but what has all that to do with taking  \"It is very unfair to judge of any body's conduct, without an intimate These days of confinement would have been, but for her private perplex \"Upon my word, Emma, to hear you abusing the reason you have, is almos\nEmma could not suppose any such thing, knowing as she did, that both t Some time afterwards it was, \"I think Mrs. Goddard would be very much  The very day of Mr. Elton's going to London produced a fresh occasion  \"Henry is a fine boy, but John is very like his mama. Henry is the eld\n\n"}