{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTHURSDAY 14 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tToday's Quote for the Day\n\n\n\"Tony Blair was more of a tragic than a comic figure. Zombie Brown has more comic potential because he's perceived as being so serious\" - comedian and impressionist Rory Bremner.\n\n\nPalestine\n\n\nJordan's King Abdullah prophesied in December last year that the truly pessimistic scenario for the Middle East would be three civil wars in 2007 - in Iraq, in Lebanon, and in Palestine. Well, it looks like about two and a half. \n\n\nTonight we'll have the latest from Gaza and the West Bank and what now looks like the schism between two Palestinian statelets, plus we hope to hear from a top level Israeli. \n\n\nControl Orders\n\n\nThe Government has been consistent in its loathing of control orders for dealing with terrorist suspects against whom there is insufficient evidence to bring charges. \n\n\nNow we learn that one of those who absconded had links to a key player in the 7/7 London bombings and the leader of the gang which tried a similar kind of mayhem but was stopped just in time. We'll debate what can be done about suspects of this type - if anything.  \n\n\nLiveleak\n\n\nA British based company gets 200 videos from US soldiers a day. They show a side of Iraq you rarely see on the television screens. Some are very  disturbing, showing US soldiers taunting Iraqis. And the Pentagon is trying to stop them showing their personal record of the war. \n\n\nBroken Society\n\n\nDo you know what a \"shank\" is? If you don't then our very disturbing film from Hackney tonight will tell you about the nastiest side of our youth culture, the violence, and the hopelessness of one young man who says that if he fails his exams he will pursue a career as a crack dealer. It's the stuff of nightmares, but it is happening in our country.\n\n\nFinally\n\n\nOn a day of uniformly grim news, my colleague Leanne lightens the load with the following Joke Fit For an Eleven Year Old (Well, almost):\n\n\nLast night, my wife and I were sitting in the living room and I \n\nsaid to her, \"I never want to live in a vegetative state, dependent on some machine and fluids from a bottle. If that ever happens, just pull the Plug.\" \n\n\nShe got up, unplugged the TV, and then threw out my beer. \n\n\nShe's Such A B**ch....\n\n\nNewsnight - Live and Unplugged is at 10.30pm on BBC2.\n\n\nGavin  \n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nCARAVAN CENTENARY\n\n\t\t\t\t\t\t\tThe Caravan Club celebrates 100 years of its formation to promote roaming holidays in the UK and Ireland\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}