{"category": "ham", "to_address": "tannhauser <tannhauser@nerdshack.com>", "from_address": "\"Chas Owens\" <chas.owens@gmail.com>", "subject": "Re: Variables not replaced", "body": "On 5/14/07, tannhauser  wrote:\nsnip\n> My problem:\n> I also want to replace quotions, depending whether they are at the beginning or\n> the end of a word. For example \"tick\" should become ``tick''. Annoyingly, my script just\n> gives me ``$1ic$1''. Any ideas?\nsnip\n\nThe problem here is that the replace part of s/// is for all effective\npurposes a double quoted string.  Double quoted strings do allow\ninterpolation when they are seen as literals, but not on each use.\nAnd this is a good thing (tm), can you imagine how confusing it would\nbe if you had to deal with a situtation like this:\n\nmy $doc = \"the unknown amount of dollars is represented by \\$x\";\nprint $doc, \"\\n\";\n\nThe interpreter would try to interpolate $x into $doc and since it\ndoesn't exist you would get an error.  You would have to do what the\npoor shell programmers do and include as many backslashes as necessary\nto get it to the right value when it was used.  But enough about what\nisn't the case.\n\nIt also isn't as easy as tacking on an e option since that just brings\nus full circle with the interpolated string problem, but tacking on an\ne option and calling eval on the string does the trick; however, it\nlooks like you have over generalized the problem and are just making\nwork for yourself and the interpreter.  In addition, if you are\nreading through the file line-by-line you will miss situations like\nthis\n\n\"foo foo bar\nbar baz baz\"\n\nAnd of course you may need to deal with escaped quotes\n\n\"foo \\\"bar\\\" baz\"\n\nI would suggest you de-generalize your code some and take a look at\nConway's Text::Balanced*.\n\n#!/usr/bin/perl\nuse strict;\nuse warnings;\n\nmy $search  = qr{\"([^\"]+?)\"};\nmy $replace = q(qq{``$1\"});\n\nmy $value = qq(\"foo bar baz\");\n\nprint \"$value\\n\";\n$value =~ s/$search/eval $replace/ge;\nprint \"$value\\n\";\n\n* http://search.cpan.org/~dconway/Text-Balanced-v2.0.0/lib/Text/Balanced.pm\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}