{"category": "spam", "to_address": "Wisdom <wisdom@flax24.uwaterloo.ca>", "from_address": "Stephanie Patrick <isten@gradphoto.com>", "subject": "Hymen destroyer", "body": "\n\nTired with your sexual problems? Can't have sex like you had 10 years ago? \nGo to the shop\nViagra, Cialis, Levitra, Valium, Phentermine - they are all licensed and are the best quality!\nGo to the site\nDon't miss your chance to recover your health!\nWith best regards,\nStephanie Patrick\n \n \nVo-vtoryh, polovina reguliarov byla vooruzhena arbaletami, a s Piatiudesiatiu stalnymi boltami, vypushchennymi tebe v spinu, ne osobenno-to Posporish. Da, Chto tam u nas na segodnia iz tekushchih del? Skeletoobraznyj shordok, zloradno glianuv v storonu dverej, za kotorymi Tolko chto pospeshno skrylsia poluchivshij zadanie sopernik, s gotovnostiu sklonilsia Nad volosatym uhom svetlejshego i toroplivo zasheptal: Vchera zaderzhali odnogo smutiana. Mozhet, risknut i zaglianut v Mezhkabak? beznadezhno predlozhil ia. Osoznanie etogo fakta prishlo sovershenno Otchetlivo. \nRebiata zdes Tertye, so smertiu v obnimku hodiat s detstva (osobenno esli vspomnit, chto Nepolnocennyh ubivaiut srazu posle rozhdeniia, malenkij chernyj iumor). Zapiaste hrustnulo, no v Mobra ia ne Oshchutil boli. Teper eto uzhe ne vazhno. Nubesov liudskie dela ne interesovali. No kakoj izoshchrennyj sposob Ubijstva! Poniatnoe delo, ves etot spektakl byl produman zaranee, no Chto-to mne ne hotelos igrat po chuzhomu scenariiu, v konce kotorogo Naverniaka byla zapisana molba o snishozhdenii. On ne smog odnovremenno Derzhat polnostiu pod kontrolem moi razum i telo, i ia etim vospolzovalsia za Neimeniem luchshego. Da net, ne mozhet byt. Soro Sletelo s golovy, obnazhiv korotkuiu pepelno-seruiu sheveliuru. \nVprochem, ne iskliucheno, chto imenno on i vernul menia v mir Dejstvitelnosti. No togda pochemu on ostavil svoih liudej? Ne doehav dvadcati metrov, Altares svernul nalevo i uglubilsia v les. Ot etoj shtuki Namestnik. Podyhat vmeste s diadiushkinymi idiotami on ne sobiralsia. ejisuminyon Q1FUW1pVckRcUFBGHUFCUEZWRlleXR1XVA==\n \n\n\n"}