{"category": "ham", "to_address": "speakup@braille.uwo.ca", "from_address": "Steve Holmes <steve@holmesgrown.com>", "subject": "Re: Slackware: kernel confusion", "body": "Yeah, I'm thinking of maintaining both the latest 2.4 and 2.6\nkernels.  I have a Cisco VPN client that works OK with a 2.4 kernel\nbut as soon as I throw it on a 2.6 kernel, I keep getting miss-matched\nkernel versions or some such; I thought it was compiled to work with\n2.6 but here we go with closed source again .\n\nOn Mon, Jun 25, 2007 at 11:21:03PM -0500, Spie Sutherland wrote:\n> Yea, listen to patrick, \"unless you have a particular reason\" to install\n> headers then it's better to not do so. The glibc is the crux of all of \n> this toolchain, and the same reason why that old viavoice became \n> a nightmare to support. The distro folks like patrick play with gcc,\n> glibc, and binutils combination until they find a stable combination\n> to build the entire system out of. The kernel headers, as he states \n> in his warning, it's dangerous to use headers newer than the glibc\n> version on your system. You can still build the 2.6.x kernel. There\n> are some situations where stuff will not build, which is why he has\n> the headers on the site, but don't change headers as a default \n> starting point, only as a last resort. And yes, you don't need the \n> modules, in fact you don't need anything from there. Patrick uses\n> ONLY unmodified kernels anyways, so if you want the latest \n> that still works with speakup, grab the last of the 2.21.x from \n> kernel.org. Or be like us old folks who prefer the stable \n> \"trailing edge\". I have not found a need for 2.6.x yet, so using\n> Patrick's similar logic, I will do so when I have a reason to. \n> I used to chase the leading edge kernels but found that it was \n> generally a waste of time in the large scheme of things.\n> \n>   -- Spie\n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n-- \nHolmesGrown Solutions\nThe best solutions for the best price!\nhttp://holmesgrown.ld.net/\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}