{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "1130p 6/15 Update: NASA elated with computer recovery, spacewalk", "body": "\n\n\n\n\n1130p 6/15 Update: NASA elated with computer recovery, spacewalk\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 65\nPosted: 11:44 PM, 6/15/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-62 (06/15/07): Spacewalk begins; blanket repair work goes smoothly\n   SR-63 (06/15/07): Russians restart computers; faulty secondary power switch possible culprit; more troubleshooting planned\n   SR-64 (06/15/07): Spacewalkers begin solar array retraction effort\n   SR-65 (06/15/07): Spacewalk ends; solar array successfully retracted; news briefing; combining takes\n\n=================================\n\n11:43 PM, 6/15/07, Update: Astronauts wrap up successful spacewalk; retract P6-2B array, complete heat shield repair; news briefing; combining earlier takes\n\nEnjoying an unexpected reversal of fortune, Russian cosmonauts carried out electronic bypass surgery today to resuscitate the international space station's befuddled electronic brains while an Atlantis spacewalker successfully stapled a wound in the shuttle's upper heat shield. Danny Olivas and fellow spacewalker Jim Reilly then fluffed and pampered a huge set of solar blankets, coaxing them back into compact storage boxes and avoiding a host of feared problems. The work clears the way for a future crew to move the arrays as required before delivery of European and Japanese research modules late this year and early next.\n\nAll in all, it was a banner day for NASA and the Russian space agency, which just a few hours earlier were contemplating gloomy contingency plans to keep a crippled space station alive after Atlantis' departure next week. Taking no chances, contingency planning continued while Russian engineers worked to confirm the health of the computers. But there was a clear sense of relief in U.S. space circles as the Russians reported initial success and the astronauts wrapped up a by-the-book spacewalk.\n\n\"You guys did a great job,\" astronaut Megan McArthur radioed Reilly, Olivas and their crewmates as they wound up a seven-hour 58-minute excursion. \"It was great watching you work, great job by the whole team.\"\n\nThe spacewalk, successful as it was, was overshadowed by concern about the station's on-again, off-again computers, machines that are critical to the safe operation of the international outpost.\n\nThree computers make up the so-called terminal computer system, which operates the station's Russian rocket thrusters to re-orient the lab complex as required to keep sunlight on solar arrays and to keep sensitive systems from getting too hot or too cold.\n\nThe central computer, also made up of three redundant channels, or lanes, is used to control the Russian segment's Elektron oxygen generator, its Vozdukh carbon dioxide removal system and a variety of other critical systems. While both computers are triply redundant, the systems can safely operate the station with a single channel in section.\n\nEarlier this week, around the time the Atlantis astronauts were installing a new solar power truss, the terminal computer crashed. An automated reboot procedure was then executed to shut down and restart all three terminal computer lanes and all three central computer channels. The reboot procedure didn't work, however, and engineers have been struggling ever since to restore the computer system to normal operation.\n\nAfter two days of fruitless, around-the-clock troubleshooting, engineers disconnected the computers from U.S. solar power early today on the theory something in the circuitry was producing \"noise\" or otherwise interfering with the operation of the German-built computers. The computers are equipped with power supplies that include protective low-voltage circuitry sensitive to such noise.\n\nWhen commands were sent to activate the isolated computers, they failed to respond properly and engineers feared the worst - a subtle software bug or a hardware failure that at some point, in a worst-case scenario, could force the station crew to abandon ship.\n\nThe Russians ultimately determined that two computers - one terminal lane and one central lane - had suffered hardware failures in their secondary power supplies earlier in the week. So they asked station commander Fyodor Yurchikhin and flight engineer Oleg Kotov to bypass the suspect power supply circuitry in the other four computers.\n\n\"While Danny and J.R. were outside, our Russian colleagues were busy uplinking a procedure to the crew in an attempt to bypass that sensitive circuit to see if we could prevent this constant rebooting that the computers were going through that wouldn't allow them to come up,\" said MIke Suffredini, manager of the space station program at the Johnson Space Center in Houston.\n\n\"It was a very simple shunt, they removed a connector on the back of the computers and they inserted a simple shunt and the shunt allowed them to bypass this circuitry. They went to activate the four that they thought were still good and all four of the computers came up in the configuration that tracked each other.\"\n\nAfter the power supply bypass surgery, Russian flight controllers told their NASA counterparts lanes one and three were had been successfully re-powered in the terminal computer, along with lanes two and three in the central computer. The systems then were shut down to close access panels and restarted in self-test mode as planned. Controllers said they planned to operate the computers throughout the evening and to collect telemetry for additional analysis during passes over Russian ground sites early Saturday.\n\n\"They want to let the computers run for a while overnight to make sure they remain stable and then tomorrow, if everything looks well and the data indicates the computers are doing all right, then I would expect we would slowly begin to activate the systems on board, including the attitude control system,\" Suffredini said. \"Our colleagues were very excited.\"\n\nToday's spacewalk began at 1:24 p.m. when Reilly and Olivas switched their spacesuits to internal battery power. This was the 86th EVA devoted to station assembly and maintenance since construction began in 1998, the ninth so far this year, the third overall for the Atlantis crew and the second this mission for Reilly and Olivas.\n\nOlivas began the blanket repair work by using his helmet camera to beam down close-up views of the torn insulation and surrounding blankets to help flight controllers assess the health of the system. The damage site showed up in sharp detail, with a 4-inch by 6-inch corner peeled back from an adjacent row of heat-shield tiles.\n\nThe damage was spotted during a routine payload bay survey shortly after launch last Friday. NASA's Mission Management Team decided earlier this week to extend the shuttle mission by two days and to add a fourth spacewalk, in part to accommodate a repair job. The team ultimately decided to add the blanket work to the third spacewalk today.\n\nOlivas had no problems gently tapping the peeled-back blanket down flat. And he had no problems using the stapler and later, inserting steel pins through the blanket and into nearby heat-shield tiles.\n\nTemperatures climb to between 700 and 1,000 degrees Fahrenheit on the upper surfaces of the rocket pods during re-entry and while the torn blanket did not appear to pose a threat to the crew, heat damage was possible to the graphite epoxy structure of the rocket pod. NASA managers decided to play it safe and order a repair.\n\nWhile Olivas was working on the blanket, Reilly installed a hydrogen valve on the Destiny laboratory module to support the eventual operation of a new U.S. oxygen generator. Then both astronauts turned their attention to completing the retraction of the P6-2B solar array.\n\nThe P6 array was attached to the station in 2000 to provide power during the early stages of assembly. Now, NASA needs to move it to the left end of the station's main power truss to prepare the complex for the delivery of the European and Japanese research modules.\n\nDuring retraction of the P6-4B array last December, the astronauts ran into major problems and ultimately had to stage an unplanned spacewalk to fold the blankets back in their storage boxes. This time around, the Atlantis astronauts have taken a more deliberate, step-by-step approach, retracting the array about 28 feet before a spacewalk Wednesday in which Pat Forrester and Steve Swanson manually cleared hangups and ultimately got the 115-foot-long array in about half way.\n\nThe central mast of the array was pulled in another few feet by remote control Thursday and today, Reilly and Olivas finished the job.\n\n\"We had a really good spacewalk today,\" said lead Flight Director Kelly Beck. \"The crew did an excellent job and we accomplished everything we planned.\"\n\nReilly now ranks 23rd on the list of most experienced spacewalkers, with 30 hours and 43 minutes of EVA time over five excursions.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}