{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Tara Cohen <paupenad@gonnellap.freeserve.co.uk>", "subject": "What's your opinion?", "body": "\n\nDo you have problems with prescriptions?\nAll this you can find here\nMake your life better. Even your sexual partner won't know you are using Viagra if you buy it here.\nOur shop\nThe highest quality, cheap prices, instant shipping worldwide, friendly support!\nWith best regards,\nTara Cohen\n \n \nKapiushon slegka kachnulsia, narushiv privychnuiu nepodvizhnost ohtana. Ty tozhe dumaesh, chto eto delo ruk koordinatora? Eto sovershenno iasno. U tebia Eshche est vremia dlia vybora. Vnimanie! mysl Nkota zazvenela, kak natianutaia tetiva. \nVo-vtoryh, hotia cvet kozhi i volos vydaval v nej urozhenku Kordosa, na samom dele rodilas ona v Abesine, gorode, prinadlezhavshem makoru Nubesov, gde izdavna prizhilis ee predki, pribyvshie siuda v chisle teh samyh Pereselencev-schastlivchikov. Kvin zametil vzgliad, kotorym Stilen neodobritelno odaril podsotnika, no Vsluh mag vozrazhat protiv takih dejstvij ne stal. Dal-rokty. I chto s togo? nedobro sprosil prizemistyj, shirokoplechij vozchik-kord Pozadi ryzhego vozhaka. Telo skryval plashch, golovu kapiushon. Nas, gorstku obychnyh liudej, Togda veli v boj za budushchee svoej civilizacii udivitelnye sushchestva oldzh po Imeni Nkot i trans, nazyvavshij sebia Celitelem. Drakhi i charsy poluchili svoiu porciiu lebsa, ostalnye pouzhinali tem, chto Predusmotritelno zahvatili erserkery Namestnika eshche v Neureje gribnoj hleb, Kopchenoe miaso rogacha, plody lesnogo oreshnika da legkij drontum, sogrevaiushchij Krov i ne groziashchij opianeniem. Uzh ne sobiraeshsia li ty vyiasn!\niat otnosheniia s shefirom priamo zdes, na Otkrytom vsem vzgliadam meste, a? Esli po tvoemu scenariiu tak neobhodimo, Chtoby my chistili drug drugu peryshki nepremenno sredi etih razvalin, to Pochemu by ne ukrytsia v kakom-nibud zdanii? Steny posluzhili by hot Kakoj-to zashchitoj. \nNa moj vzgliad, vsia eta boltovnia smahivala na otkrovennuiu popytku nadut Menia, i nadut grubo, a zhule ia terpet ne mog. Schastlivchik. Liubaia novost. Nu? Ia zhdu. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}