{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"Bioquest News\"<michelle.mckee@globalmarkithits.com>", "subject": "Private Label Contracted for Bioquest and Sherwin Williams", "body": "\n\n\nPrivate Label Contracted for Bioquest and Sherwin Williams\n\n\n\n\n\nPrivate Label Contracted for Bioquest and Sherwin Williams\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nSherwin-Williams and BioQuest Technologies to Create a Private Label Antimicrobial Paint for the Lynd Companye\n\n\n\n\n \n\n\n\n\n \n\nJUPITER, Fla.--(BUSINESS WIRE)--BioQuest Technologies, Inc., (Pink Sheets:BQTG - News), a leading  developer of innovative, environmentally safe antimicrobial products,  today announced it has been contracted by the Lynd Company, one of the  top 50 largest apartment management companies in the U.S., to work  with the Sherwin-Williams Company (NYSE:SHW - News) on a private label paint.  The new private label antimicrobial paint will be a blend of  BioQuest's ProShield 5000 and Sherwin-Williams paint. The Lynd Company  will use the new private label paint in its apartment communities  which are location throughout the U.S.\n\n\n\n \n\n\n\n\n \nThe Lynd Company, headquartered in San Antonio, TX, is a 25 year  old professional property management company dedicated to providing  quality living environments for an enjoyable living experience. The  Lynd Company and its subsidiaries have financed, brokered and/or  purchased over $1 billion in multifamily investments across markets in  the southeastern and southwestern U.S. The company was ranked the 35th  largest apartment manager in the U.S. for 2007, up from 40th place in  2006 by the National Multi Housing Council.\n\"Developing an antimicrobial paint with Sherwin-Williams on behalf  of the Lynd Company reinforces the proven effective, measurable  benefits our products offer like ProShield 5000,\" said Arne Rotne II,  CEO of BioQuest Technologies, Inc. \"Since our products can be used in  a multitude of areas incorporating our powerful antimicrobial solution  with the quality of Sherwin-Williams paint makes a lot of sense.  Apartment communities, homes and condos alike can realize direct  results with BioQuest's unique line of products which reduce and even  can eliminate bacteria on most surfaces.\"\nRotne said the Lynd Company is one of the largest customers of  Sherwin-Williams paint which makes it possible to have them involved  when it comes to creating a private label antimicrobial paint. By  utilizing the new private label antimicrobial paint it will greatly  reduce or eliminate mold and mildew in each apartment unit. In  addition, maintenance costs are reduced and property value is  maintained along with creating a better, safer, healthy living  environment.\n\n \n \n\n\n \n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}