{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Adam Borowski <kilobyte@angband.pl>", "subject": "Re: Final text of GPL v3", "body": "On Mon, Jul 02, 2007 at 11:37:06AM +0100, Gervase Markham wrote:\n> Adam Borowski wrote:\n> >Can we dub GPLv3 \"GPL with the advertising clause\" then? \n> \n> I don't think so. The advertising clause was highly impractical. I don't \n> see informing users of their legal rights as being impractical.\n\nThe only difference is that it's not the author of the software who is being\nadvertised, but GPL and FSF position.  And while informing users is not bad\nwhen done once, it's an abomination if every single piece of software does\nthat on its own.  If I use Debian, I already do know that I'm allowed to do\nX, Y, Z thanks to the DFSG, and there is no need to repeat that on every\nstep.  Especially when I didn't ask to be spammed with that notice.\nRepeatedly receiving some text has a price paid in my attention span, making\nme lose time which could be used for just anything else.  It's a cost which\nin some corner cases can be significantly detrimental to usability.  I'm not\nblind, but I can imagine the time wasted to go through the legal notice with\na Braille reader or such.\n\n\n> >While for GUI apps having an \"About\" menu\n> >item is usually not an issue, legal notices are a significant burden for\n> >console stuff, both full-screen and line-based.  \n> \n> How so?\n\nFor line-based stuff, yeah, you're right.  Having \"bc\" and \"colordiff\" in\nmind, I forgot about having --spam-me-with-legal-notices as an option merely\nmentioned in the manpage -- even though this contradicts the requirement\nabout the notice being \"prominently visible\".  In a non-menu/non-command\nbased full-screen program having a key combination bring up the legal\nnotices could also be a solution, albeit often an annoying one.  Let's\nimagine the following list of keys:\n  * arrows -- move\n  * q      -- quit\n  * ^L     -- show legal notices\nUgh, 33% of explanation being wasted on legal things.  Extremely ugly,\nespecially if you consider that for many of us most of the point of Free\nSoftware is not having the legal system stand in our way.  With Free\nSoftware, we (ideally) don't have to care about Intellectual Property,\nlicense fees, patents, trade secrets, etc -- just use/modify/copy the\nsoftware whenever it is for our benefit.  GPL gives an extra guarantee that\nmy work won't be used in a way inaccessible to me -- while forbidding me to\nbecome a \"bad guy\" in this regard.  Free Software, when it's really free and\nnot merely a ruse to sneak some proprietary crap through, makes us free from\nlegal concerns -- both \"am I allowed to use X?\" and \"I wouldn't want people\nto have a right to use Y without paying me\" are legal concerns here.\nHaving legal notices everywhere destroys this freedom.\n \n> >And just think about software which communicates using voice (hands-free\n> >things, for example).\n> \n> Why does voice-communicating software have any further problems? The ALNs\n> can be read out at the user's request.\n\nWell, let's take a system with two user interfaces:\n1) a GUI where you set up rules like \"if someone approaches the computer, do\n   X.  If someone leaves the room and there's no one else in, do Y.\".\n2) hands-free interface where user interacts by moving around, waving hands,\n   etc, and gets feedback using voice.\n\nInterface 1 can have \"Help | About\" just fine.  The problem is, you need to\nmake it possible to get legal notices using _every single interface_.  For\ninterface 2, this could be something like \"to unblank screen, approach the\ncomputer.  To blank it, move away.  To get told legal notices, jump\".\n\n-- \n1KB\t\t// Microsoft corollary to Hanlon's razor:\n\t\t//\tNever attribute to stupidity what can be\n\t\t//\tadequately explained by malice.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}