{"category": "ham", "to_address": "Christoph Heibl <christoph.heibl@gmx.net>", "from_address": "Charilaos Skiadas <skiadas@hanover.edu>", "subject": "Re: [R] graphics question: tilted axis labels?", "body": "On Apr 13, 2007, at 9:52 AM, Christoph Heibl wrote:\n\n> Dear Charilaos,\n>\n> Thanks ... your were right. I now get the names. But the problems  \n> remains that the space (30 items) is insufficient to bear all the  \n> names and I am still looking for a way to accommodate them. Do you  \n> know of any solution?\n>\nFrankly, if you have a barplot with 30 items, I would rethink the  \nsituation if I were you. As an audience, I would find it hard to  \nprocess such a graph. Put it might just be me.\nI personally think that tilting them 45, or even 90 degrees is not a  \nvery good idea presentation-wise, and opt instead to have the  \nbarplots be horizontal when something like this happens (barplot \n(...,horiz=TRUE) ).\nIf you look at ?par, you'll find the options \"crt\" and \"srt\", which  \ndon't seem to work on the axes, and also have a big warning about not  \nexpecting a 45 degree tilt to always work. You can use \"las\" to turn  \nit 90 degrees if you really want that.\n\nI think lattice and grid would allow you perhaps to do exactly what  \nyou want, though it might be somewhat more work.\n\nSorry, perhaps I was more critical than helpful. Best of luck with it.\n\nPS: Why do drawing commands have different names for the \"horizontal\"  \nattribute?\n\nboxplot -> horizontal\nbarplot -> horiz\n\n> Cheers,\n> Christoph\n>\n>\n> On 13.04.2007, at 15:27, Charilaos Skiadas wrote:\n>\n>> # create data frame\n>>   LA <- data.frame(countries=c(\"Chile\", \"Peru\", \"Bolivia\"), values=c\n>> (10, 12, 13), stringsAsFactors = FALSE)\n>> # call barplot\n>> barplot(LA$values, names.arg=LA$countries)\n>\n\nHaris Skiadas\nDepartment of Mathematics and Computer Science\nHanover College\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}