{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 134", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Nazi-Looted Pissarro in Zurich Bank Pits Heiress Against\n      Dealer (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Wed, 6 Jun 2007 12:31:19 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Nazi-Looted Pissarro in Zurich Bank Pits Heiress\n\tAgainst\tDealer\nTo: \nMessage-ID: <013201c7a825$d5955b20$80c01160$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nNazi-Looted Pissarro in Zurich Bank Pits Heiress Against Dealer \n\nBy Catherine Hickley\n\nJune 6 (Bloomberg) -- Gisela Bermann-Fischer was nine when her family fled\nVienna the night before Hitler's army marched into Austria in 1938. They\nleft almost everything in their haste: books, clothes and paintings. \n\nDays later, Gestapo agents came for the art collection, according to an\naccount by the family's nanny, who remained in the apartment. The men knew\nexactly where the pictures hung -- the Lovis Corinth flowers, the El Greco,\nthe Paul Gauguin, and, in the dining room, Camille Pissarro's ``Le Quai\nMalaquais, Printemps.'' The Nazis sold the art at a Vienna auction in 1940. \n\n``My father started trying to get the paintings back in 1947,''\nBermann-Fischer, now 78, said by phone from Zurich. ``Many of the pictures\nwere restored to us over the years through U.S. restitution processes. But\nthe Pissarro never showed up.'' \n\nUntil this year. After a 70-year search that she took over from her father\nin 1995, Bermann-Fischer now says she knows exactly where the painting is:\nin a safe at the Zuercher Kantonalbank in Zurich. \n\nRented by a company that prosecutors have linked to a Nazi art thief, the\nsafe has been sealed as part of a three-nation probe into money laundering\nand extortion. It contains two other paintings, the authorities said:\nPierre-Auguste Renoir's ``La Baie du Moulin Huet a Travers les Arbres --\nGuernsey,'' and an 1879 oil by Claude Monet, ``Vue de Vetheuil, l'Hiver.''\nIt's unclear if they, too, were looted. \n\nGoering's Thief \n\nThe safe was registered to a Liechtenstein trust, Schoenart Anstalt,\ncontrolled by Bruno Lohse, according to Swiss prosecutor Ivo Hoppler in a\nphone interview. Lohse was a German art dealer appointed by Hermann Goering\nin 1941 to confiscate art in occupied France. Hoppler said his office seized\nthe safe May 15 on behalf of authorities in Munich and Liechtenstein. \n\nImprisoned for war crimes until 1949, Lohse resumed his prewar work in the\n1950s. He died in Munich on March 19, before prosecutors could question him.\nHe was 95. \n\n``It made me furious to think that after my father had tried so hard and\nalmost given up the struggle to find this painting, it should end up in the\nhands of a thief of his own generation -- a Nazi thief,'' said\nBermann-Fischer, who has dual Swiss and U.S. citizenship. ``It's an absolute\nscandal.'' \n\nAltogether, the Nazis stole about 650,000 works in the biggest art-looting\nspree ever, the New York-based Jewish Claims Conference estimates. The\nEinsatzstab Reichsleiter Rosenberg, the art-confiscation unit where Lohse\nworked, seized almost 22,000 objects in France alone, according to U.S.\ngovernment figures. \n\n``It was long suspected that Bruno Lohse had looted art in his ownership and\nit seems scarcely believable that he went to the grave without this being\ncomprehensively investigated,'' said Anne Webber, co-chair of the Commission\nfor Looted Art in Europe, a London-based organization that helps track down\nstolen art. \n\nThree-Nation Inquiry \n\nSwiss prosecutor Hoppler said he secured the bank safe as part of a probe in\nLiechtenstein and Germany involving Lohse and another Munich art dealer. The\ndealer, Peter Griebert, denied any wrongdoing in an interview on June 1. \n\nLiechtenstein authorities began investigating Lohse on suspicion of money\nlaundering in January. His death forced them to call off that inquiry and\nopen a new one against another suspect, said the Liechtenstein national\ncourt spokesman, Lothar Hagen, who declined to name the person. The probe\nfocuses on Schoenart Anstalt, Hagen said in a phone interview. \n\nMunich prosecutor Hans-Joachim Lutz is investigating Griebert, 69, on\nsuspicion of attempted extortion related to an effort he and another man,\nU.S. historian Jonathan Petropoulos, made to return the Pissarro.\nBermann-Fischer said Griebert made the handover contingent on receiving a\nfee of 18 percent of the painting's market value. \n\n`Finder's Fee' \n\nGriebert said in the interview that while he wanted a ``finder's fee,'' he\ndidn't set it as a condition for the handover. \n\nPetropoulos, a history professor at Claremont McKenna College in California\nwho specializes in the Third Reich, isn't under investigation, Lutz said. \n\nBoth men knew Lohse. Griebert said he was a friend of Lohse, while\nPetropoulos said in an e-mail that he knew Lohse well, having met him\n``dozens of times over a 10-year period.'' \n\nBermann-Fischer's saga with Lohse began in 2003, when her lawyer, Norbert\nKueckelmann, telephoned the art dealer to ask whether he had any information\nabout the missing painting. \n\n``He was the only one of those Nazi art dealers who was still alive,''\nKueckelmann said in an interview in his Munich home office. Lohse proved\nevasive, so Kueckelmann eventually filed a request for him to be questioned\nin court. \n\nBermann-Fischer says the first direct information she got on the painting's\nwhereabouts came at a meeting in Munich on Jan. 8 this year, when she\nreceived a letter from Petropoulos. \n\n`Treacherous' \n\nAccording to a copy of the letter provided by Kueckelmann, Petropoulos wrote\nthat he knew someone who said the holder of the painting was willing to\nreturn it. The contact wished to remain anonymous, said the letter, dated\nDec. 7. \n\n``Until then, I had been looking for the Pissarro like a blind chicken,''\nBermann-Fischer said. ``I had no idea where it was, except that it had been\nin an exhibition in 1984. So on the one hand, I was overjoyed and thought --\noh great, my efforts have worked! On the other, I had the feeling that I was\nentering something very treacherous.'' \n\nPetropoulos said he became involved in the negotiations as a consultant for\nArt Loss Register Ltd., a London-based company that operates a database of\nstolen art and provides provenance reports for art buyers and sellers. He\nsaid he waited to send Bermann-Fischer the letter until he had notified his\nclient. \n\nJulian Radcliffe, chairman of the Art Loss Register, confirmed that\nBermann-Fischer had registered her lost painting with the company years\nbefore. \n\nHotel Meeting \n\nBermann-Fischer met with Griebert and Petropoulos on Jan. 25 in the Zurich\nHotel Sankt Gotthard, where the two men told her they had seen the painting\nthat morning and taken photos, which they showed her. Instead of agreeing to\ntheir terms, Bermann- Fischer said, she informed Kueckelmann, who filed a\ncomplaint against Griebert with the Munich prosecutors. \n\nGriebert said in the interview that he hadn't seen the painting before that\nday. He said he had no authority to dispose of the safe's contents and had\nreceived the task of negotiating the restitution as a single assignment from\na client he declined to identify. \n\nPetropoulos, who directs Claremont McKenna's Center for the Study of the\nHolocaust, Genocide and Human Rights, said he ``never had any idea that\nLohse still controlled the painting.'' Asked whether Lohse may have sold\nother looted paintings, Petropoulos said it was ``not only possible, but\nlikely.'' \n\nDutch Masters \n\nWilly Hermann Burger, Lohse's lawyer and the executor of his will, said the\nestate includes Lohse's private collection of paintings, though not the\nthree paintings found in the safe. In an interview, Burger said Lohse never\nmentioned the Liechtenstein trust to him and that he didn't know who would\ntake possession of its paintings. Lohse's sole heir is his niece, Burger\nsaid. \n\nLohse's preference was for 17th-century Dutch masterpieces and\nexpressionists such as Gabriele Muenter and Emil Nolde, said Petropoulos. He\nestimates the collection is worth ``millions.'' \n\nThe Pissarro is one of the artist's last, produced on an overcast morning\nfrom his wheelchair in a room overlooking the Seine. Bermann-Fischer said\nthe painting was acquired in 1907 by her grandfather, Samuel Fischer,\nfounder of S. Fischer Verlag, a German publishing house whose authors\nincluded Thomas Mann and Hermann Hesse. \n\nHis son-in-law, Gottfried Bermann-Fischer, took over after Fischer died.\nWhen the Nazis rose to power in 1933, many S. Fischer Verlag authors were\nbanned. The family left Berlin for Vienna in 1935, then fled to Switzerland\nand on to the U.S. \n\n``My father always saw the theft by the Nazis as a humiliation,''\nBermann-Fischer said. ``The deception continues to this day. It's about\nfinding out the truth. You can't undo the past: I just wanted to see through\nthe search. \n\n``Now it is just about getting my property back,'' she said. \n\nTo contact the writer on this story: Catherine Hickley in Berlin at\nchickley@bloomberg.net . \n\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 134\n****************************************\n\n"}