{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Suddenly you see \" <qc0cw9y7j@crystalnoon.com>", "subject": "Experienced and Affordable Laser Vision Correction ", "body": "              ULTIMATE AFFORDABILITY! Because You Want Excellent Results at an Affordable Price.  NOT A CENT UPFRONT! No down payment keeps more money in your pocket, more flexibility in your budget. NOT A PENNY OF INTEREST! Itâ%uFFFD%uFFFDs almost like paying cash, except now you have 18 months to s-t-r-e-t-c-h your payments.  BITE-SIZED PAYMENTS! Your interest-free payments could be as little as $41.94 per month. And itâ%uFFFD%uFFFDs a cinch to qualify.        LASIK Counselors Available Mon-Fri: 7 am - 12 am EST Saturday: 8 am - 12 am EST Sunday: 9 am - 8 pm EST                Proven Experience LASIK is all we do, with over 700,000 procedures since 1991.  FREE LASIK Vision Exam Get a complete LASIK vision exam at no charge or obligation.  Multiple LASIK Technologies Ensures optimized results by matching your eyes to the precise LASIK technology â%uFFFD%uFFFD including Custom Wavefront.  Climate-Controlled Treatment Center Promotes a better outcome by controlling humidity and temperature.                    Â©2007 LCA-Vision Inc. Offer is subject to credit approval. No finance charges will be assessed if the amount in full is paid by the due date. A minimum monthly payment of 3% of the balance is required. Other financing options are available. Call for details. FL Residents only: The patient and any other person responsible for payment has a right to refuse pay, cancel payment, or be reimbursed for payment for any other service, examination, or treatment that is performed as a result of and within 72 hours of responding to the advertisement for the free, discounted fee, or reduced fee service, examination, or treatment. To unsubscribe from future correspondence from LCA, please Use this Link. LCA-Vision, Inc / LasikPlus is located at 7840 Montgomery Road, Cincinnati, OH 45236.    \n\n\n\n"}