{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"L-Soft list server at (23) TBS, Inc (1.8d)\"               <LISTSERV@CNNIMAIL23.CNN.COM>", "subject": "Subscription probe for LOUDOBBS - please ignore", "body": "Sat, 23 Jun 2007 06:00:01\n\nThis message is a \"probe\" for your subscription to the LOUDOBBS list. You\ndo not need to  take any action to remain subscribed to  the list, and in\nparticular you should  not reply to this message. Simply  discard it now,\nor  read on  if  you would  like  to  know more  about  how this  probing\nmechanism works.\n\nA  \"probe\"  is a  message  like  the one  you  are  reading, sent  to  an\nindividual subscriber  and tagged  with a  special signature  to uniquely\nidentify  this  particular  subscriber  (you can  probably  not  see  the\nsignature because it is in the  mail headers). If the subscriber's e-mail\naddress is no longer valid, the  message will be returned to LISTSERV and\nthe faulty  address will be  removed from  the list. If  the subscriber's\naddress is still valid, the message will not bounce and the user will not\nbe deleted.\n\nThe main advantage  of this technique is that it  can be fully automated;\nthe list owner does not need to read a single delivery error. For a large\nor active  list, the manpower  savings can  be tremendous. In  fact, some\nlists are  so large that it  is virtually impossible to  process delivery\nerrors manually. Another advantage is that the special, unique signatures\nmake it possible to accurately process delivery errors that are otherwise\nunintelligible, even to an experienced technical person.\n\nThe  drawback,  however,  is  that  this  method  lacks  flexibility  and\nforgiveness. Since the Internet does not provide a reliable mechanism for\nprobing an  e-mail address without  actually delivering a message  to the\nhuman  recipient, the  subscribers  need to  be  inconvenienced with  yet\nanother \"junk message.\" And, unlike  a human list owner, LISTSERV follows\na number of  simple rules in determining when and  whether to terminate a\nsubscription. In  particular, a common  problem with automatic  probes is\nmail gateways  that return a delivery  error, but do deliver  the message\nanyway.  LISTSERV  has no  way  to  know that  the  message  was in  fact\ndelivered, and in most cases the subscriber is not aware of the existence\nof these  \"false\" error reports.  If this  happens to you,  LISTSERV will\nsend you  another message with a  copy of the delivery  error returned by\nyour mail system, so that you can show it to your technical people.\n\n\n"}