{"category": "ham", "to_address": "debian-vote@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Josip Rodin <joy@keid.carnet.hr>", "subject": "Re: Request for GR: clarifying the license text licensing / freeness issue", "body": "On Sun, Apr 22, 2007 at 09:30:51AM +1000, Ben Finney wrote:\n> > > [The status quo] doesn't address the concern that motivated this\n> > > discussion: that the license texts which have restrictions on\n> > > modification are non-free works by the DFSG, yet are being\n> > > distributed in Debian against the Social Contract.\n> >\n> > This concern DOES NOT NEED TO BE ADDRESSED.  It needs to be IGNORED.\n> \n> You seem to be saying that a violation of the social contract should\n> be ignored.\n\nThere's a difference between an ignorable concern and a violation.\n\nYes, the social contract says that the Debian system and all of its\ncomponents will be fully free; but for all practical intents and purposes\n(heh), the accompanying license texts are as much a \"component\" of the\n\"system\" as is the media the system is distributed on. Yes, you can't do\nwithout it, but you also can't start obsessing on it because the matter can\nsoon get absurd after that. (There is no free hardware to run it on, oh my!)\n\nLawyers would likely ask us - what would be the legal purpose of addressing\nthis concern? Will anyone ever be able to bring on a legitimate complaint\nagainst us for violating the social contract by distributing license texts?\n(So would we be eliminating that risk by addressing the concern?)\nI don't think so. (Somebody ranting on a random Internet forum about how\nevil Debian includes evil licenses is not automatically a legitimate\ncomplaint :)\n\nTrying to \"clarify\" the social contract by elaborating on peripheral things\nthat aren't immediately obvious, is basically nitpicking, and it shouldn't\nbe done. Also, nobody cares for statements that can be normalized to 'you\ncan do all this, except that, that, that, and that', and those should also\nbe avoided if we want readers to take the spirit of the document seriously.\n\nLastly, being dissected by people who like to think that official documents\nneed to resemble mathematical proofs is not really the purpose of the social\ncontract. Yes, I sometimes do those things too, so I'm not trying to\nblithely disrespect the said group. It's just that sometimes we who do that\nneed to curb our enthusiasm. :)\n\n-- \n     2. That which causes joy or happiness.\n\n(Reading on -vote, not on -legal.)\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}