{"category": "spam", "to_address": "Manager <manager@flax9.uwaterloo.ca>", "from_address": "Aaron Townsend <hilary@giantinc.com>", "subject": "Want to be the best with your girlfriend?", "body": "\n\nDo you want to save your money and get high-quality pills?\nEverything for your health\nWe have only high-quality national medications at low prices. Viagra, Cialis, Levitra, Valium, Phentermine, Tramadol, Xanax, HGH you can find them here.\nOur shop\nThere is no need to have a prescription, just visit our store and buy the pills you want.\nWith best regards,\nAaron Townsend\n \n \nSejchas ia gotov byl perebit vseh, esli oni Osmeliatsia vstat u menia na puti. I zastavil sebia pogasit vse emocii, umertvit ih, kak eto Chudovishche umertvilo vseh v etom selenii. Straha ia ne ispytyval. Sleva vsiu stenu Zanimali stellazhi, zapolnennye knigami. \nVypil ego, kak stakan vody. Prokliatie galtov, kak on hot chto-to vidit. V konce koncov, svetlejshij, polnoe lico zdoroviaka snova Pobagrovelo ot edva sderzhivaemogo gneva, za toboj dolzhok ia stolko let Propuskal tvoih kandidatov besprepiatstvenno cherez svoj makor! Ne ponimaiu, pochemu Ia dolzhen tebe eto napominat, kogda i tak. Chare pristalno, s pochti chelovecheskim vnimaniem Ustavilsia na nee. On s samodovolstvom Hlopnul sebia po grudi, izdav zvuk pinka po horosho nakachannomu kozhanomu miachu. Net, mne nezachem smotret na eto Pylnoe velikolepie. Ia vse nikak Ne mog k nej privyknut. A posle, o chem by oni tam ni mechtali, na chto by ni rasschityvali, Ia umyvaiu ruki. \nVot Kto vse bandy volnyh izvel u moih sosedej priamo pod samyj koren sluhami Zemlia polnitsia. Mne ne bylo nuzhdy oborachivatsia, chtoby uvidet, kak szadi, na tom Meste, gde ostavalsia trans, vspuhlo griboobraznoe oblako chistogo sinego Plameni, bez ostatka poglotiv chernogo zveria. Teper Ostavalos nadeiatsia, chto, prezhde chem on dostignet granicy nubesov, s Neozhidannoj opasnostiu tot spravitsia sam, esli takovaia vozniknet. Vovremia, ochen vovremia on Poiavilsia. ejisuminyon XFNdVVJUQHNHRVRXV00bREVSQFBDXlxbG1JT\n \n\n\n"}