{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Clair Estes\" <pifchalonggroupgew@chalonggroup.com>", "subject": "Burn pounds off with Anatrim", "body": "\nStop being obese and unhappy\n\n\n\n\n\nAnatrim – The newest and most attracting lose flesh product is made available now – As seen on BBC\n\n\n\nDid you realize redundant body kilos kill a lot of people around the world? We know you hate the unattractive appearance of people like those and the social bias against them. \n\nMoreover, you’ve not the will to withstand pressure of your fatal eating habits. If this sounds familiar, then we got something for your consideration!\n\n\n\n\n\nHere Anatrim comes, the recent product for the reduction of your body’s extra weight. The astonishing thing about Anatrim is it improves the quality of your life by making you crave food less and always cheering you up. Here’re what people say to us on this product:\n\n\n\n\n\n\"It is amazing! \n\n\nInstead of stuffing myself with food and watching TV constantly \n\n\nI became more interested in taking exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I am in a great form now and there are lots of men in my way!\"\n\n\n\n\n\n\nSilvia D., Bellevue WA\n\n\n\n\n\n\n\"Passive weight reducing was of little help to me. This terrible hunger would just kick in and spoil everything. \n\n\nOnce I was told on Anatrim the media by and I was really impressed at the information.\n\n\n I had tried taking it, and my wife said to me I look very good now, 4 months later. \n\n\n26 pounds off and it is not a limit! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nCharley Mock, New York\n\n\n\n\n\nAnatrim helps you to understand that you doesn’t have such a great need for that much food. It raises your mood up, provides you with extra energy, and attacks needless kilos. All thanks to its mighty newly-elaborated formula!!\n\n\n\nFind out more about this great product now!\n\n\n\n"}