{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: License concerns regarding package lft", "body": "Terry Hancock  wrote: [...]\n> A court is going to consider what the apparent intent was -- not try to\n> stretch the meaning beyond the obvious.\n\nIntent is not written on the paper.\nIt seemed obvious to me that this clause hinders binaries.\nIt seemed obvious to Florian Weimer that it rules out private changes.\nSo, I don't think it's obvious what the intent was.\n\n[...]\n> You can do that, because the license is POORLY WRITTEN. Which I have\n> already said. Miraculously, you and I appear to AGREE on that point.\n> \n> One consequence of this is that some lawyer might try to play the same\n> games with the language that you are doing here.\n\nIn other words, this is an obvious lawyerbomb and we need further data.\n\n[...]\n> > I'm trying to understand how it is possible to claim that compilers\n> > don't fit the meaning of materials there\n> \n> That would be by using the *normal*, *first* definition of \"materials\"\n> and not some alternate meaning that has come about by association.\n\nNormal?  First?  Those imaginary English Language Meaning Norms don't\nexist.  On the shelf behind me, I have ten dictionaries, and there's\nmore in the office across the landing and in my living room at home.\n\nIt doesn't matter whether one can support a view with a dictionary -\nI've made that mistake in the past.  Is it ambiguous?  Yes.  Is it\nclarified by licensor statements or case law?  I haven't found any.\n\n> There is also the point that it wouldn't make any sense to require the\n> meaning you are attempting to press: is there even a compiler which can\n> be \"released in source format under conditions of this license\"? If not,\n> then it stands to reason that the author, knowing this, cannot have\n> intended to limit compilation to such a hypothetical compiler. [...]\n\nIt wouldn't be the first source-only-distribution licence I've seen, or\nthe first licence to rely on US-style Fair Use.\n\n[...]\n> Intent is a matter of pragmatics[1] -- the study of situated utterances\n> as evidence for meaning, not semantics[2] -- the study of isolated\n> utterances for potential meaning. [...]\n\nI repeat my pragmatic questions ignored so far: can we tell how this is\ninterpreted by the licensor?  Can we claim binaries are GPL by clause\n6 or does the 'no permission is granted...' style of clause 7 overrule it?\n\nAny more comments?  Please stop getting so personal and flamey.\n\nRegards,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}