{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 5/21/07 - Bubbles Are Good?", "body": "May 21, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\nThree Cheers for the Alternative Energy Bubble!\n\nLet The Dogs Out\n\nTimely Sell Advice on a High-Quality Stock\n\n-----\n\nI've written before about perception as it applies to individual stocks,\nand no doubt I will again.  The fact that stocks move because people's\nopinions of them change, and not because of minute fundamental changes at\nthe company, is one of my favorite topics, and I think it needs repeating\nfrom time to time.\n\nBut today I want to discuss perception as it applies to bubbles.  The\ntakeoff point for this discussion is a new book by Daniel Gross titled\n\"Pop! Why Bubbles Are Good for the Economy.\"  I haven't read it, but\nreviews suggest that the thesis is worth pondering for all of us.\n\nCommon wisdom, of course, tells us bubbles are bad for the economy.   \nAnd recent experience in the wake of the 2000 top of the Internet-centric\nstock market bubble reinforces that conclusion among the vast majority of\nthe population.\n\nBut Gross argues differently.  He doesn't deny the pain, in the aftermath\nof the bubble's collapse, which accompanies bankruptcies, unemployment and\ninvestment losses.  But he argues that those are all offset - and more -\nby the benefits accorded by the new infrastructure.\n\nAnd he uses history to make his point, looking at the bubbles that\naccompanied and supported the rise of the telegraph, the railway and the\nInternet.\n\nThe telegraph bubble enabled rapid communication across the continent, and\nthus enabled the creation of efficient financial markets.  Increasing the\nspeed with which money could flow increased the speed at which business\ncould grow.\n\nThe railroad bubble enabled rapid low-cost transport of goods and people\nacross the continent, and thus ushered in the age of consumerism and the\nage of increased mobility.\n\nAnd the Internet bubble?  Without the thousands of miles of fiber-optic\ncable laid in the buildout of the Internet, and the accompanying advances\nin the technologies of data transmission and storage, we wouldn't have\nYahoo!, Google, YouTube, iTunes, Amazon, eBay, AOL, Monster, Skype,\nNetflix, Expedia or any of the other Internet services that we've come to\ndepend on.\n\nDo those Internet offerings offset the pain and suffering that came in the\ncollapse of the bubble, or would you rather go back to life as it was in\n1990?  I sure wouldn't, and I think most Americans would agree.\n\nAnd now we come to the best part.\n\nGross' hope, and I share it, is that the current enthusiasm for\nalternative energy keeps on growing from here, inflating higher and\nhigher, and becoming a bubble big enough to draw in massive amounts of\ninvestment.\n\nThe result, ideally, is a new energy infrastructure that helps to reduce\nour greenhouse gases and to free us from the complications (to put it\nmildly) of imported oil.\n\nIt would be enormously disruptive, particularly for people in the oil and\ngas industries.  But the long-term benefits would be spectacular.\n\nAs much as I hope for it, however, I have serious doubts that a major\nbubble in alternative energy will develop, and here's why.\n\nIn recent years I've come to believe that the 2000 bubble was of the sort\nthat comes along only once in a lifetime.  The logic behind this is that\nbubbles of that magnitude can only form when memory of the previous bubble\n(and the pain that followed it) fades from the collective memory of the\npopulace.\n\nThus the 2000 bubble was only possible because most people who suffered in\nthe 1929 bubble were no longer involved in the economy, through either\ncommerce or investment.\n\nThe 1929 bubble was preceded by the Railway Mania of 1846 in Britain, and\nthat was preceded by the South Sea Bubble 1720, all far enough apart to\nsupport the thesis that collective memory is key in preventing bubbles.\n\nToday, of course, the memory of the Internet bubble is still quite fresh,\nand so it's easy for pundits to \"see\" (and fear) other bubbles.  There's\nthe China bubble, the housing bubble, the copper bubble and the solar\nenergy bubble, to name a few.  The housing bubble in particular is one\nthat's highly feared because it would hit so close to (ahem) home.\n\nEven the fact that Gross can sell a book about bubbles reflects the\nprominence of the theme in the public consciousness.  As a contrarian, I\nbelieve trouble tends to come from where it's least expected, so to me,\nall this consciousness of bubbles means we won't have one.\n\nStill I continue to enthuse about solar power stocks because the charts\nare strong and the companies are growing revenues and earnings rapidly. \nLast Friday many of these stocks had pulled back to their 50-day moving\naverages, offering new investors in the sector a decent buying\nopportunity.\n\nSome uranium stocks look good, too.  There's a carbon fiber company (an\nold favorite of ours) whose product is being gobbled up by makers of\nwind-turbine blades.  And there's a company, public only four weeks, that\ngenerates electricity from wave power.  (Waves are more predictable than\nwind, and power can be generated just offshore, very close to where people\nneed power.)\n\nBottom line: while a bubble in alternative energy would be nice, you don't\nneed it to make money in the sector.  The stocks of well-managed companies\nin growth industries will continue to prosper, as they always have, and\ntoday we find many of them in the alternative energy sector.\n\n----- Advertisement -----\n\nAn Opportunity Bigger Than Microsoft?\n\nHard to believe?  No... not when you consider how one company that totally\ndominates an industry can make investors rich.  And we found such a\ncompany.\n\nIf you had invested $10,000 in Microsoft back in 1997, '98, or '99, by the\nyear 2000 your ten grand would have grown to $59,440, $38,550, or $17,640\nrespectively. The growth potential of the fast-growing company we found is\nmuch greater than its software counterpart - yet it's virtually unknown on\nWall Street.\n\nCompanies like this tend to find their way into the pages of Cabot Market\nLetter, and when their products are as life changing as those described\nabove, you'll hear about it from us. Other past big winners include Summit\nTechnology and Amazon.\n\nFor a taste of tomorrow's winners, take a trial subscription today. To get\nstarted, simply click the link below.\n\nhttp://cabotmail.net/t/184937/13148861/78/0/\n\n-----\n\nMoving on, I want to thank all you readers who took the time to respond to\nmy request for feedback last week.  It helps to know what you're\nthinking.\n\nHere's what one reader wrote:\n\n\"I like reading about why you like certain stocks as opposed to other\nstocks, and always wonder if I use my paid subscriptions to newsletters\ncorrectly, as I don't seem to ever get ahead.  Often I lose heavily, as\nwith Global Crossing and other big names I'm ashamed to mention. . . I\ncontinue to hold \"dogs\" like SCON, DIVX, JDSU recommended some time ago by\nother newsletters while I also hold things like VZ, DUK/SE, PFE, MSFT,\nDCX, APC and CSCO which I researched and bought on my own. I sure wish you\nwould cover that in one of your newsletters. . . I realize that probably\nmost of your readers are much more sophisticated than I, but there may be\ndummies out there like me.\"\n\nOkay, there's a lot to address there, but this reader is no dummy.   \nIt takes a smart person to ask the right questions, and I present this\nletter here because I think a lot of readers - especially newer ones -\nhave the same questions.\n\nSo let's start at the top.\n\nWe all like to listen to experts and get advice on buying stocks.   \nBuying is easy, because it's done with an aura of hope.  Selling, on the\nother hand, is hard, because it means admitting the dream is over.  By\nrefusing to sell, a person keeps the dream alive, even though the profits\ndwindle, or worse, the losses mount.\n\nSo when you recognize that your portfolio holds a \"dog,\" like Global\nCrossing (GLBC), Superconductor Technology (SCON), or JDS Uniphase (JDSU),\nyou should sell!  These three, in particular, are dogs because the\ncompanies generally lose money.  DIVX, contrarily, is a profitable\ncompany, but the chart says it's a dog, and one reason jumps out in a\ncasual inspection: profit margins are shrinking fast.\n\nSo whenever you buy a stock you should have an exit plan.  Sure, you're\ndreaming of a ten-fold gain, but the reality is likely to be different. \nWhen you buy a stock, you should know what it will take to sell it.\n\nNow, it's nice if the expert who recommended the stock tells you when to\nsell.  And in all Cabot's paid subscription newsletters, we do give\nspecific sell advice (with the exception of the \"Other Stocks of Interest\"\nsection in Cabot Market Letter).  But you've got to take some\nresponsibility.  After all, it's your money.\n\nMoving on to the \"good\" stocks in the reader's portfolio, I see Verizon\n(VZ), Duke Energy (DUK), Spectra Energy (SE) (spun off from Duke in\nJanuary), Pfizer (PFE), Microsoft (MSFT), DaimlerChrysler (DCX), Anadarko\nPetroleum (APC) and Cisco (CSCO).  And why are these good stocks?  Because\nthey tend to be in long-term uptrends.  They're not exactly market\nleaders; they're rather large (and therefore slow) to fill that role.  But\nthey are all extremely well managed and many pay dividends.\n\nBut even \"good\" stocks shouldn't be held forever.  Today we're in a\npowerful bull market and most stocks are acting well.  If you're a newer\ninvestor, perhaps you're pleasantly surprised with your ability to make\nmoney by investing.  But you should be aware that many times it is not\nthis easy.  You should be aware that when this bull turns to bear, it will\nhave the potential to take away your profits as quickly as it awarded\nthem.  When that time comes, the way to avoid losing money will be to\nsell.\n\nThis is just an advance notice, but I give it here because I've seen what\nhappens to novice investors who fail to sell . . . and it's not pretty.  I\npromise to write more on this in the future.\n\n-----\n\nSo now here's a specific piece of sell advice.  It comes from the pen of\nRoy Ward, editor of Cabot Benjamin Graham Value Letter.\n\n\"One of our Wise Owl Model stocks, Exxon Mobil (XOM), reached its Minimum\nSell Price on Friday, May 4, 2007.  We recommend that you SELL XOM now.\"\n\n\"XOM, a giant international oil company, reached its Minimum Sell Price of\n$80.94.  XOM shares sell at 13.4 times forward EPS, which is slightly\nhigher than XOM's 10-year average P/E of 12.5.  We believe oil prices will\nremain near current levels or fall somewhat during the next 6 to 12 months\ncausing XOM earnings to decline by 5% to 10% during the next 12-month\nperiod.  XOM was first recommended in our September 2006 issue at $66.36\nand has gained 22% in 8 months.  We recommend that you SELL your XOM\nshares now.\"\n\nClear enough?\n\nNow, you might say that since XOM has climbed from 81 to 84 since that\nsell advice was given, the sell advice was wrong.  Not true.   \nThe goal of investing is to make money, not to buy at the bottom and sell\nat the top.  And the method used by Roy Ward is to buy when a quality\nstock is undervalued and to sell when it exceeds its fair value.  After\neight months, XOM brought readers who followed his advice a profit of 22%,\nand that's great.  But at a price above 81, risk is higher than his system\nlikes, so he says sell and move on to another undervalued stock.\n\nI call that success.\n\n-----\n\nEditor's Note\n\nCabot Benjamin Graham Value Letter is your best source of investing advice\nif you're looking for a low-risk long-term investment system you can\nfollow with no anxiety.  It involves far less buying and selling than most\nsystems, and entails far less risk . . . as long as you follow the advice.\n Since inception in 2002, the Classic Model has achieved a compound annual\nreturn of 26.2% compared to 8.4% for the Dow.  Since inception in 1995,\nthe Wise Owl Model has achieved a compound annual return of 16.5% compared\nto 7.4% for the Dow.\n\nTo get started with a no-risk trial subscription, simply click the link\nbelow.\n\nhttp://cabotmail.net/t/184937/13148861/79/0/\n\n-----\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n-----\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=184937&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}