{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "\"A. F. Cano\" <afc@shibaya.lonestar.org>", "subject": "Re: thinkpad 600e and lucent wavelan pcmcia", "body": "On Wed, Apr 11, 2007 at 08:48:41PM -0400, Gabriel Farrell wrote:\n> Hi,\n> \n> I'm trying to install Debian on an old thinkpad 600e by way of the\n> testing netinst cd, but I don't have an ethernet pcmcia and I'm having\n> no luck with this wireless one -- a lucent wavelan pcmcia card that\n\nStrangely I've had no trouble with my orinoco gold classic on my 600e.\nI have read though that sometimes the hardware setup interferes with\nthe pcmcia cards.\n\n> works fine on my thinkpad x31 (also running Debian).  The 600e\n> recognizes the card and sees the network (evidence in iwconfig\n> output), but dhclient fails to get a lease.  The LED on the lucent\n> lights up, but doesn't blink as much as it does with my x31.  I\n\nThis could be an IRQ conflict with one of the built-in devices.\n\n> believe they're both using orinoco_cs, and the same version of\n> dhclient (3.0.4).\n> \n> Any ideas of where to troubleshoot next?\n\nI've had long-term problems (now solved) with the serial port.  Since I \ndon't run windows at all, I couldn't use the windows utilities, so\nI ended up downloading the dos version of ibm's PS2 thinkpad utilities\nand putting them on a bootable dos floppy created with dosemu.\n\nThis is important because some devices can only be set up (in the\nbios) with IBM's utility.  No amount of bit-twiddling by linux can\nmake some items work.  You can search for \"thinkpad 600e serial\" or\nother combinations and you'll get many web pages that describe how\nto deal with the 600e hardware.  But start with http://linux-laptop.net\nand peruse the 600e reports.\n\nSome internal devices not only need to be enabled, but also powered\nup, and some default IRQs conflict with some others.\nEven after I had booted the 600e with the dos floppy with the ps2\nutilities on it, it was not obvious what to do.  That ps2.exe is\na CLI utility where you need to type long commands with all the\noptions right for anything to happen.\n\nIn any case, I would check your set up for the on-board devices and\nif needed, disable (at least temporarily) what you don't need to\nuse, ie: IR port, serial port, modem.  Ah yes, disable quick boot\nin the bios.  Mmmm... Is the modem device trying to grab IRQ 10?\nI vaguely remember that IRQ being used by the psmcia cards.\n\nA.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-laptop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}