{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nRisk Management 101: Managing Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nEPRI's Value \n\t\t\tand Risk in Energy Markets - Introduction & Principles\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for June 19, 2007  \n\n\n\nFirst Enercast Featured Articles for June 19, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories  \n\n\nJun 19, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jun. 19, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 19, 2007\n\n\nJun 19, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nUtility wants pipeline in bay: $33.6 million project for natural gas must get federal approval\n\n\n\nJun. 19--A Delaware utility wants to build a $33.6 million pipeline under the Chesapeake Bay that would pump natural gas from Cove Point in Southern Maryland to Cambridge on the Eastern Shore, and from there underground to Delaware. Taking the first step in an elaborate approval process that ultimately will be decided by the Federal Energy Regulatory Commission, executives of the Eastern Shore ...\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nNew president named for Virginia Natural Gas\n\n\n\nJun. 19--Virginia Natural Gas President Hank Linginfelter has been promoted to a more senior corporate position with parent company AGL Resources.  As president of Mid-Atlantic operations, Linginfelter was in charge of the natural gas utilities Elizabethtown Gas and Elkton Gas. His new job will be the executive vice president of utility operations, where he will be in charge of all of AGL's ...\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nMaking energy savings the law: Legislators may soon vote on making alternative energy a significant electricity source\n\n\n\nJun. 19--North Carolina is moving closer to becoming the first state in the Southeast to require alternative energy to power homes and businesses.  After more than five months of negotiations among electric utilities, environmentalists and other key interests, the bill is to be debated Thursday by the state Senate committee on Agriculture, Environment and Natural Resources.\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nDTE to evaluate its greenhouse gas emissions\n\n\n\nJun. 18--DTE Energy said it has joined the Chicago Climate Exchange, a voluntary, legally binding program that allows companies to chart their reductions in greenhouse-gas emissions.  DTE said the Climate Exchange provides a platform upon which market-based emissions programs can be evaluated. DTE is the parent company of Detroit Edison and Michigan Consolidated Gas Co.\n\n\nJun 18, 2007 Knight Ridder Tribune Business News\n\n\n\nBush to visit Browns Ferry: President's tour of nuclear plant part of effort to push energy legislation\n\n\n\nJun. 19--ATHENS -- Athens is to experience a first in its history when the nation's president visits Thursday.  A White House spokesman confirmed that President Bush will be in Athens at 1:15 p.m. to tour the Browns Ferry Nuclear Plant and make remarks. Limestone County archivist Philip Reyer said to his knowledge, a sitting president has never visited Athens.\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nCMS Energy sells unit; proceeds to boost business in Michigan\n\n\n\nJun. 18--CMS Energy said it has completed the sale of its CMS Energy Brasil S.A. unit for $211.1 million to Brazilian utility CPFL Energia S.A.  The Jackson-based power company and parent to Consumers Energy said proceeds from the sale will be used to pay down debt, reinvest in the Michigan utility business and for other general corporate purposes. CMS Energy Brasil provides electric service to ...\n\n\nJun 18, 2007 Knight Ridder Tribune Business News\n\n\n\nNuclear regulators side with Progress\n\n\n\nJun. 19--RALEIGH -- The Nuclear Regulatory Commission rejected a claim by nuclear critics that Progress Energy's Shearon Harris nuclear plant in Wake County is vulnerable to fire risk and should be fined $130,000 daily for violations or have its operating license revoked.  Fire barriers at Shearon Harris first failed tests in 1989, two years after the plant went into operation.\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nYankee Gas rates could rise June 29\n\n\n\nJun. 19--Under a draft decision on a settlement agreement announced today, non-heating customers of Yankee Gas Services Co. will see their bills rise by about $5 a month.  \"Their bills will go up by 2.98 percent,\" or about $5.38 per month, said Beryl Lyons, spokeswoman for the Department of Public Utility Control. Yankee Gas reaches customers in 71 municipalities, including Ansonia, Bethel, ...\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nPower outage hits west Wichita\n\n\n\nJun. 19--A transformer failure knocked out power to more than 11,000 Westar customers in west Wichita today.  The outage occurred at 11:48 a.m. at the Hoover substation just south of Central and just east of I-235, Westar Energy spokeswoman Karla Olsen said. Outages were reported from 29th Street North to Harry on the south, and from just east of West Street to Ridge Road, she said.\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nAyer mulls starting local utility\n\n\n\nJun. 19--AYER -- Selectmen recently agreed to spend $30,000 in grant money to start researching potential benefits of creating a municipal electric company. If nothing else, the town could save about $30,000 annually by buying the street lights in town from National Grid, said Roger Beeltje, former chief executive for Groton Municipal Power Corp. The town pays National Grid about $60,000 a year ...\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nImation expands horizon: Data-storage manufacturer offers remote information-backup service to small and midsize companies.\n\n\n\nJun. 19--Imation Corp. is breaking into the protection racket.  No, the Oakdale-based manufacturer of magnetic tape and optical discs isn't pulling a Tony Soprano. It is offering protection for business data through an off-site backup and recovery service aimed at small-to-midsize businesses and remote branch offices of large corporations. If a customer of this new service experiences a power ...\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nRate increases for 2 utilities serving Valley in the works\n\n\n\nJun. 19--Naugatuck Valley residents could see increases in some utility bills later this year, with rate changes for Yankee Gas Services Co. and Aquarion Water Co. of Connecticut in the pipeline.  The state Department of Public Utility Control Monday gave preliminary approval, in a draft decision, for a rate increase that would boost Yankee Gas' revenue by $22.1 million.\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\nPa. seeks authority over nuclear materials\n\n\n\nJun. 19--Pennsylvania officials want to take on regulatory powers over nuclear materials used in medicine or industry inside the state's borders.  The Nuclear Regulatory Commission is considering a request from Gov. Ed Rendell that would make Pennsylvania the 35th state with authority to license, make and enforce rules and inspect businesses that work with radioactive materials -- such as a ...\n\n\nJun 19, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nUtility wants pipeline in bay\n\n\n\nA Delaware utility wants to build a $33.6 million pipeline under the Chesapeake Bay that would pump natural gas from Cove Point in Southern Maryland to Cambridge on the Eastern Shore, and from there underground to Delaware. Taking the first step in an elaborate approval process that ultimately will be decided by the Federal Energy Regulatory Commission, executives of the Eastern Shore Natural Gas ...\n\n\nJun 19, 2007 Baltimore Sun\n\n\n\nSDG&E Reaffirms Importance of Sunrise Powerlink\n\n\n\nPM SDG&E San Diego Gas & Electric has submitted official testimony to the California Public Utilities Commission (CPUC) reaffirming the need for the Sunrise Powerlink and countering alternatives proposed by project opponents that the utility said do not adequately address the long-term energy needs of the region or the state's energy policy initiatives. In its testimony, SDG&E described why the ...\n\n\nJun 19, 2007 Transmission & Distribution World\n\n\n\nCosts cited for coal-to-gas plant\n\n\n\nINDIANAPOLIS - A new coal-gasification power plant in northern Knox County would cost ratepayers about $2 billion and cause electric rates to increase 13 percent to 16 percent, a Duke Energy official testified Monday. The Indiana Utility Regulatory Commission this week is hearing a joint proposal from Duke Energy and Vectren to build a new coal gasification plant to generate electricity in ...\n\n\nJun 19, 2007 Evansville Courier\n\n\n\nWashington Group International awarded clean-air project for Constellation Energy\n\n\n\n-- Washington Group International said that it has been selected to provide engineering, procurement and construction services for a clean-air project at Constellation Energy's Brandon Shores Power Plant in Baltimore, Md. The three-year project will reduce plant emissions--including sulfur dioxide, particulate matter and mercury--allowing Constellation Energy to meet new Maryland clean-air ...\n\n\nJun 19, 2007 Power Engineering\n\n\n\nDuke to seek higher Ohio rates\n\n\n\nDuke Energy Ohio said Monday that it would seek an increase in base natural gas rates in Ohio, increasing the typical residential customer's monthly bill by about $12 in the next three years.The utility, which has about 420,000 gas customers in Southwest Ohio, said it will make a filing with the Public Utilities Commission of Ohio in about 30 days seeking an additional $34 million, or 5.8 ...\n\n\nJun 19, 2007 Cincinnati Enquirer\n\n\n\nUtility seeks input on proposed transmission lines to power plant\n\n\n\nDuke Energy will host a drop-in workshop from 4 to 8 p.m. today at Hillcrest Baptist Church in York County to receive<0x00A0>input from the public before<0x00A0>paths for transmission lines from the proposed Cherokee County nuclear power plant are determined.The meeting<0x00A0>is the third since<0x00A0>April. Other meetings<0x00A0>have been held in Cherokee, Union<0x00A0>and York counties.A Duke ...\n\n\nJun 19, 2007 Spartanburg Herald-Journal\n\n\n\nNational Grid CEO backs a bright idea: conservation\n\n\n\nSteve Holliday is jumping on the conservation bandwagon. That might be a little surprising, since Holliday is the chief executive officer of National Grid, which provides electricity for much of Western New York and currently stands to make more money with every extra kilowatt its customers use. But Holliday is convinced that increased energy efficiency is a strong first step toward reducing ...\n\n\nJun 19, 2007 Buffalo News\n\n\n\nComplete Energy selling power plant\n\n\n\nHATTIESBURG A subsidiary of Complete Energy Holdings, LLC, has signed a definitive agreement with a wholly-owned subsidiary of KGen Power Corporation to sell the Batesville Generating Facility, an 837-megawatt gas-fired combined cycle plant in Batesville, and La Paloma Generating Company, LLC, which operates a 1,022-megawatt gas-fired combined cycle plant in Kern County, Calif.\n\n\nJun 19, 2007 Mississippi Business Journal\n\n\n\nRules for utilities getting greener\n\n\n\nArizona utilities must have 15 percent of total energy output from renewable-energy sources, such as solar and wind, by 2025, Arizona's attorney general has ruled. The Arizona Corporation Commission now can put the requirement into effect for Arizona Public Service Co., Tucson Electric Power and other regulated utilities. Salt River Project is outside the commission's jurisdiction.\n\n\nJun 18, 2007 Arizona Republic\n\n\n\nMaine governor signs regional global warming bill\n\n\n\nAUGUSTA, Maine Gov. John Baldacci signed legislation Monday that includes Maine in the nations first regional effort to control greenhouse gas emissions through a cap-and-trade system. Maine joins other states that have already joined the 10-state Regional Greenhouse Gas Initiative, which is intended to reduce pollution from northeastern power plants by 10 percent over a decade through 2018.\n\n\nJun 18, 2007 Portland Press Herald\n\n\n\nU.S. SUPREME COURT / Energy refunds over alleged gouging in 2000 survive appeal\n\n\n\nCalifornians could receive at least $1 billion in refunds from energy companies that allegedly gouged the state in 2000 as federal regulators stood by, under a ruling that survived an appeal Monday to the U.S. Supreme Court. State officials are pressing for the payments in a lawsuit challenging the rates that energy suppliers charged California utilities from May to October 2000, a period of ...\n\n\nJun 19, 2007 San Francisco Chronicle\n\n\n\nCalif. needs fossil-fired power plants: officials\n\n\n\n-- The Reuters news agency quoted two California state energy officials as saying natural gas plants and possibly nuclear power would be needed to meet the state's energy needs. Coal power was ruled out unless 'clean coal' technologies could capture most of the carbon emissions. 'We can't do everything with renewables,' Michael Peevey, president of the California Public Utilities Commission, was ...\n\n\nJun 19, 2007 Power Engineering\n\n\n\n\n\nConstellation NewEnergy Wins Power Agreement With State of New Jersey\n\n\n\nBALTIMORE, June 19 /PRNewswire-FirstCall/ -- Constellation Energy (NYSE: CEG) today announced that its subsidiary, Constellation NewEnergy (CNE), has won a 36-month, 40 million kilowatt hours electricity supply contract with the State of New Jersey. CNE, a successful bidder in the state's May 2, 2007 online request for proposals (RFP), will provide electricity service to approximately 23 service ...\n\n\nJun 19, 2007 PR Newswire\n\n\n\nPG&E, San Francisco and Golden Gate Energy Combine Efforts to Explore Tidal Power Options in SF Bay\n\n\n\nTidal energy is newest renewable energy resource identified by PG&E to provide clean power and address global warming SAN FRANCISCO, June 19 /PRNewswire-FirstCall/ -- In support of ongoing efforts to increase California's renewable power supplies and address climate change, Pacific Gas and Electric Company today signed an agreement with the City and County of San Francisco and the Golden Gate ...\n\n\nJun 19, 2007 PR Newswire\n\n\n\nSCANA Energy Reappointed As Georgia's Regulated Natural Gas Provider\n\n\n\n/PRNewswire-FirstCall/ -- The Georgia Public Service Commission announced today that SCANA Energy, a unit of SCANA Corporation (NYSE: SCG), will continue to serve as Georgia's sole regulated provider of natural gas, a role the company has had since the regulated provider program began in 2002.     'We are pleased to continue our third term in this important role of providing natural gas service ...\n\n\nJun 19, 2007 PR Newswire\n\n\n\nAmerican Stock Exchange Lists the Common Shares of Command ZBB Energy Corporation\n\n\n\nThe American Stock Exchange(R) (Amex(R)) today listed the common stock of ZBB Energy Corporation under the ticker symbol ZBB.     ZBB Energy Corporation designs, develops, manufactures and distributes energy storage systems that can be used by utility companies, renewable energy generators, and commercial and industrial customers. The Company's systems are based upon a proprietary zinc-bromine ...\n\n\nJun 18, 2007 PR Newswire\n\n\n\nProgress Energy Expands Low-Income Neighborhood Energy-Efficiency Program\n\n\n\nST. PETERSBURG, Fla., June 19 /PRNewswire-FirstCall/ -- Progress Energy Florida is expanding an innovative program designed to assist families in low- income neighborhoods to save money on their energy bills. (Logo: http://www.newscom.com/cgi-bin/prnh/20020923/CHM008LOGO-c ) In partnership with the Florida Department of Community Affairs and the city of Perry, Progress Energy will install ...\n\n\nJun 19, 2007 PR Newswire\n\n\n\nRed Rock Plant Needed to Keep OG&E Rates Low\n\n\n\nOKLAHOMA CITY, June 19 /PRNewswire-FirstCall/ -- OG&E said today that the proposed Red Rock power plant remains the best solution for customers as the company seeks to meet the growing demand for electricity.     The company's statement follows its filing Monday of rebuttal testimony in its regulatory proceeding before the Oklahoma Corporation Commission that seeks pre-approval to build a new ...\n\n\nJun 19, 2007 PR Newswire\n\n\n\nKGen Power Purchases Electricity Generation Assets Totaling 1,859 Megawatts of Capacity\n\n\n\nHOUSTON--(BUSINESS WIRE)--KGen Power Corporation, a Houston-based electricity generation company, announced today it has executed a purchase-and-sale agreement to acquire Complete Energy Holdings 1,859-megawatt (MW) portfolio for $1.336 billion, plus working capital adjustments. KGen has executed a commitment letter with Morgan Stanley that provides debt financing for the acquisition, although ...\n\n\nJun 19, 2007 Business Wire\n\n\n\nAlternative Energy Sources Gets Permit for the First of Three New MidWest Fuel Ethanol Plants, an Industrial Info News Alert\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). Alternative Energy Sources Incorporated (OTCBB:AENS) has received its final permit from the Iowa Department of Natural Resources and is now ready to move into the next phase of development on the company's first of three new planned MidWest fuel ethanol plants.\n\n\nJun 19, 2007 Internet Wire\n\n\n\nPrairie State Energy Campus Advancing to Construction With EPCM Contract, Technology Equipment Purchase and New Equity Partners\n\n\n\nST. LOUIS, June 19 /PRNewswire-FirstCall/ -- Prairie State Energy Campus today announced that it is entering the final phase of project development and looks forward to beginning construction this fall. Prairie State has: signed a $2.9 billion engineering, procurement, construction and management (EPCM) agreement with Bechtel Power Corporation for the power-related facilities; committed to ...\n\n\nJun 19, 2007 PR Newswire\n\n\n\nCompetitive Markets Provide Platform for Environmental, Technological Benefits\n\n\n\n'Innovation occurs faster in competitive environments, because consumers will demand it,' said FERC Commissioner Philip D. Moeller WASHINGTON, June 19 /PRNewswire-USNewswire/ -- Electric power consumers, environmentalists and technology innovators recently voiced their support for competitive electricity markets, citing technological and environmental benefits.\n\n\nJun 19, 2007 PR Newswire\n\n\n\nLaidlaw Energy and Partners Moving Forward with Plans to Build a 60 - 70 Megawatt Biomass-Energy Plant in Berlin, NH\n\n\n\nNEW YORK--(BUSINESS WIRE)--Laidlaw Energy Group, Inc. (Ticker Symbol LLEG) announced today that Laidlaw and its partners have formed Laidlaw Berlin, LLC and have invested $1 million in equity capital in the newly formed entity that has been placed in escrow in connection with the contemplated purchase of certain property and assets of the former Fraser Paper Mill from North American Dismantling, ...\n\n\nJun 19, 2007 Business Wire\n\n\n\nCMS Energy Announces Early Tender Results for Debt Tender Offer\n\n\n\nJACKSON, Mich., June 18 /PRNewswire-FirstCall/ -- CMS Energy Corporation (NYSE: CMS) today announced early tender results for its previously announced offer to purchase (the 'Tender Offer') for its 7.5% Senior Notes Due 2009 (CUSIP No. 125896 AH3)(the 'Notes'). As of 5:00 p.m., New York City time, on Monday, June 18, 2007 (the 'Early Tender Date'), CMS had received tenders for $359.5 million in ...\n\n\nJun 18, 2007 PR Newswire\n\n\n\n\n\nRBS touted as Sempra mulls commodities unit options\n\n\n\nA report in Metal Bulletin said RBS hoped to complete a transaction to invest in the Stamford, Connecticut-based energy and metals trader by September. RBS declined to comment. Sempra Energy spokesman Spie Kline declined to comment on the RBS speculation. 'We are looking at three options for growing our commodities business -- staying on the current course, taking on a financial partner, or ...\n\n\nJun 18, 2007 The Scotsman\n\n\n\nGreenVolts picks up demonstration project, investment\n\n\n\nGreenVolts, a solar power company, said it was chosen by the Pacific Northwest utility Avista Corp. for a demonstration project to test a utility-scale solar energy system. Spokane-based Avista (NYSE: AVA) also made an investment in San Francisco-based GreenVolts, but the company did not disclose the method or amount of that investment. In addition to Avista's investment, GreenVolts has raised ...\n\n\nJun 18, 2007 San Francisco Business Times\n\n\n\nKGen Power to buy two plants from Complete Energy for $1.3 bil\n\n\n\nKGen Power on Tuesday said it had agreed to buy a power plant in California and another in Mississippi with a combined capacity of 1,859 MW from Complete Energy Holdings for $1.336 billion. The two plants are natural gas-fired, combined-cycle facilities, which would be added to KGen's existing portfolio of five power plants in the Southeast US that have total capacity of 3,030 MW.\n\n\nJun 19, 2007 Platts\n\n\n\nCO2 caps, capacity adds key concerns of US utility CEOs: survey\n\n\n\nBalancing likely US limits on carbon emissions with the need to meet growing demand for electricity is the major challenge facing the US electric utility sector, industry executives said in a new survey. The poll, conducted by Washington-based consulting firm GF Energy, found that more than 90% of US utility CEOs believe that a global policy to tackle climate change will be in effect before 2015, ...\n\n\nJun 18, 2007 Platts\n\n\n\nWind farm changes to boost energy\n\n\n\nThe design of the proposed Lexton wind farm, north-west of Ballarat, will be altered so it can produce more energy. The turbines planned to be used in the 19-tower farm now are not being made, forcing the company, Wind Power, to buy more expensive ones. The new turbines will generate more energy, making the wind farm large enough to require Victorian Government approval.\n\n\nJun 19, 2007 ABC Online\n\n\n\nGE Units Acquires Interests in Regency Energy for $603 Million\n\n\n\nGE Units Acquires Interests in Regency Energy for $603 Million June 19, 2007 - 09:52 a.m. HOUSTON (AP) - GE Energy Financial Services, a unit of General Electric Co., said Tuesday it bought a stake in Regency Energy Partners LP, a natural gas processor and distributor, from HM Capital Partners LLC for $603 million. GE Energy Financial acquired 91 percent of Regency's general partner and 16.7 ...\n\n\nJun 19, 2007 Canadian Business Magazine\n\n\n\nUtilities call on consumers to save energy\n\n\n\nNEW YORK (CNNMoney.com) -- With the hot summer approaching and ever more air conditioners and other consumer electronic devices straining the nation's already burdened power system, utilities are scrambling to get customers to use less. 'Eighty one percent of customers think they are in on energy efficiency,' Bill Brier, head of policy and public affairs at the industry association Edison ...\n\n\nJun 18, 2007 CNN\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nUK public sector to buy spot power to cut costs\n\n\n\n- Britain's public sector is to start buying electricity on a day-to-day basis on the spot market, under a new deal with EDF Energy, as government tries to cut energy costs by taking risks. According to Reuters, the deal with EDF Energy worth 1 bn ($1.98 bn) over the next four years, also guarantees about a third of the electricity from renewable sources until at least 2011.\n\n\nJun 19, 2007 Power Engineering\n\n\n\nTapping energy\n\n\n\nPARIS: As the world's political leaders debate ways to alleviate poverty in Africa, industrialists are moving ahead with their own designs for pan-African development - including the building of the world's largest hydroelectric dam at a bend in the Congo River, between Kinshasa, the capital of the Democratic Republic of Congo, and the Atlantic Ocean. Called Grand Inga, this giant dam will cost ...\n\n\nJun 19, 2007 International Herald Tribune\n\n\n\nKeydata Income VCT 2 UK Regulatory Announcement: Re Agreement\n\n\n\nLONDON--(BUSINESS WIRE)-- KEYDATA INCOME VCT 2 PLC VCT to invest in Renewable Energy Projects The Board of Keydata Income VCT 2 plc (the Company) is pleased to announce it has signed agreements to invest in a series of renewable energy power generation projects based on the technology of the gasification of recycled wood. The Companys principal partners in these projects are Biomass Engineering ...\n\n\nJun 19, 2007 Business Wire\n\n\n\nResearch and Markets: India's Oil and Natural Gas Corporation (ONGC), Deir Ez Zor Petroleum Company (DEZPC) and Syrian Petroleum Co (SPC) Are among the Companies Operating in Syria's Energy Market Today\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c60067) has announced the addition of Syria Energy Report to their offering. This report provides updated facts and figures on the evolution of the national energy market. For the oil, gas, coal and power markets, the report details the market organisation, institutions regulating the market, and ...\n\n\nJun 19, 2007 Business Wire\n\n\n\nHouse invests $50M for nuclear fuel bank\n\n\n\nWASHINGTON  The House on Monday approved a $50 million fund to create an international nuclear fuel bank, an idea aimed at negating Iran's argument that it needs its own nuclear fuel program. The bill, passed by voice vote, gives the president authority to make voluntary contributions to the International Atomic Energy Agency to set up the bank that would guarantee reactor fuel to qualifying ...\n\n\nJun 19, 2007 Augusta Chronicle\n\n\n\nThe Limited Appeal of Nuclear Energy\n\n\n\nAfter 20 years of stagnaion, nuclear energy again finds favor in the eyes of many energy planners. In contrast with electricity generated from coal or natural gas, nuclear power contributes little to greenhouse gas emissions and could therefore help in the effort to reduce global warming. The establishment of a tax on carbon emissions, which has been widely proposed as an incentive to move away ...\n\n\nJun 18, 2007 Scientific American\n\n\n\nEuropean emissions trading scheme generates unexpected fallout\n\n\n\nPARIS: In 2003, Rhodia, a French chemicals company, was on its knees. Mired in litigation, environmental and pension liabilities and accusations of accounting irregularities, it posted a net loss of ,1.3 billion for the year. The company survived, and by the first quarter of 2007, was able to report a net quarterly profit of ,59 million, or $80.2 million. A major reason for the turnaround, ...\n\n\nJun 19, 2007 International Herald Tribune\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}