{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Greenfield Vs. FAIR", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n\nJeff \n      Greenfield Responds To FAIR's Critique Of Michael Moore \n      PieceI asked Greenfield to respond to the FAIR piece, which \n      generated more than 70 emails to Public Eye in an hour. \"FAIR's critique is not,\" he argues. \"The organization is comparing apples and \n      oranges; actually, apples and bowling balls is more like it.\"[+ Read More]\n\n\n\nSorry...Mark \n      Knoller: \"A lot of people in the \n      news media – especially in television and radio – owe you an apology. \n      They think so little of what you’re interested in that many of us \n      led our newscasts overnight and this morning with the release from prison \n      of heiress and would-be celebrity Paris Hilton. When a story is \n      first in a newscast, we’re saying we think it’s important. We’re saying we \n      think it’s something you need to know about it.\"\n [+ Read More]\n\n\n\nSportsCenter \n      for TerroristsThe theatrical release of \"A Mighty Heart\" – \n      the story of Daniel Pearl's kidnapping and murder – has called to mind \n      many Americans' first encounter with the grainy terrorist videos from \n      non-descript locations that have become a grim, regular reminder of \n      current affairs. But we're kidding ourselves if we think that the \n      stereotype of low-tech tools and old school propaganda is the reality in \n      Iraq and elsewhere.[+ Read More]\n\n\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nE-Mailbag: \n      Should CBS Identify Islamic Terrorist Web Sites?\n \nWriting \n      The Rather Story For The “Evening News”The \n      Image Question\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}