{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@speedy.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "SatCon's High Reliability Product Line Expands", "body": "\n\n\n\n\n\n\n\n\nSatCon's High Reliability Product Line Expands\nNew Products for Alternative Energy, Avionics and Aerospace \nBOSTON, Apr 17, 2007 (BUSINESS WIRE) --  SatCon Technology Corporation(R) (Nasdaq CM: SATC), a developer of power management and system architecture solutions for the alternative energy and distributed power markets today announced that SatCon Electronics, a wholly owned subsidiary and a designer and manufacturer of high reliability electronic components recorded a 40% quarter over quarter increase in Q1 shipments of products used in alternative energy systems. The Electronics subsidiary utilizes high-speed surface mount manufacturing capability to build the company's proprietary DSP based controller boards which are further integrated into larger solar and fuel cell inverters produced by SatCon's Stationary Power Systems subsidiary. \"Having the internal capability to design and manufacture the controller electronics is a real competitive advantage in this rapidly expanding alternative energy market.\" said David Eisenhaure, SatCon President and Chief Executive Officer. \"The Electronics subsidiary also designs and manufactures components and systems for space flight and satellite applications. This business is also expanding with new high reliability products introduced over the last 18 months representing $1.2 million of orders booked in Q1.\" Eisenhaure added, \"It is interesting that alternative energy and aerospace applications have many similarities. High reliability, extended product life, and ultra high efficiency are critical elements in servicing both markets. With the Electronics Division's long history in high reliability systems serving the alternative energy market is a natural extension.\" Currently in development are several next generation products scheduled for release in Q2. These products will target high-end commercial, industrial, and alternative energy applications. Jack Worthen, SatCon Electronics President, noted, \"After twelve months in development, we are very excited about releasing an entirely new product line for the Electronics Division. We have a number of ultra high efficiency power modules which not only have a significant market opportunity as stand alone products but will also be integrated into our next generation system controller electronics for solar and fuel cell inverters.\" About SatCon Technology Corporation SatCon Technology Corporation is a developer and manufacturer of electronics and generators/motors for the Renewable Energy, Hybrid-Electric Vehicle, Grid Support, High Reliability Electronics and Advanced Power Technology markets. For further information, please visit the SatCon website at www.satcon.com. SATC-G Statements made in this document that are not historical facts or which apply prospectively are forward-looking statements that involve risks and uncertainties. These forward-looking statements are identified by the use of terms and phrases such as \"will,\" \"intends,\" \"believes,\" \"expects,\" \"plans,\" \"anticipates\" and similar expressions. Investors should not rely on forward looking statements because they are subject to a variety of risks and uncertainties and other factors that could cause actual results to differ materially from the Company's expectation. Additional information concerning risk factors is contained from time to time in the Company's SEC filings. The Company expressly disclaims any obligation to update the information contained in this release. SOURCE: SatCon Technology Corporation(R) SatCon Technology Corporation(R)\nDan Gladkowski, 617-897-2411\nVP, Administration\n\n\n\n\n\n\n\n\n\n\n You are subscribed to SatCon Technology Corporation Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n SatCon Technology Corporation \n 27 Drydock Ave. 6th Floor, South Boston, MA 02127\n Service provided by Shareholder.com \n\n\n\n\n\n"}