{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "Reliable Sources <reliablesrc@mail.cnn.com>", "subject": "Coming up this Sunday on Reliable Sources", "body": "\n\n\nCNN.com\n\n\n\n\n\n\n\n\n\n\nComing up this Sunday on Reliable Sources:\n\nMultimedia Manifesto\n\nDid NBC make a big\nmistake in airing the troubling, violent pictures and videos of\nVirginia Tech gunman Seung-Hui Cho?  Since the package landed\nat 30 Rock and led the Nightly News Wednesday, a vicious debate\nhas erupted and an angry public has convinced many of the media\noutlets who followed suit to scrub the images from their\nbroadcasts.  We'll go right to the decision-maker, NBC News\nPresident Steve Capus, and get reaction from talk radio hosts\nHugh Hewitt and Bill Press, and the Philadelphia Inquirer's\nGail Shister. \n\nA Safe Distance\n\nWhere\nshould we draw the line between aggressively covering a story\nand invading the privacy of a community?  As some students and\nfamilies ask for room to grieve, have reporters allowed them\nenough space?\tWe'll talk to three reporters who covered the\nstory on the ground in Blacksburg, Sharyn Alfonsi of CBS News,\nGene Robinson of the Washington Post, and CNN's Soledad\nO'Brien.\n\nNew Media, New Questions\n\nJamal Albarghouti's dramatic video, captured with his cell\nphone, instantly provided an eyewitness account of the Virginia\nTech incident to the world.  What are the promises and\npotential pitfalls of having so many people armed 24/7 with a\nvideo camera?  \n\nPlus, MySpace and Facebook\nhelped drive the coverage, giving reporters and bloggers\nintimate portraits of some victims, and generating backlash\nfrom students who just want the press to back off.  We'll get a\nnew media perspective from Townhall's Mary Katharine Ham and\nJeff Jarvis of Buzzmachine.com.\n\nJoin us this Sunday\nand every Sunday at 10am ET / 7am PT for our critical look at\nthe media! \n\n \n\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the Reliable Sources list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=reliablesrc\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}