{"category": "ham", "to_address": "\"\" <ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"The Internet Patrol\" <info@theinternetpatrol.com>", "subject": "\n The Internet Patrol -  How to Connect Your Computer to the Internet Using Your Cell Phone!", "body": "\n\n\nThe Internet Patrol\n\n\n The Internet Patrol\nhttp://www.theinternetpatrol.com\n\nHow to Connect Your Computer to the Internet Using Your Cell Phone as a Wireless Internet Connection or Tethered Modem\n\nUsing your cell phone as a modem is perhaps the most overlooked of all Internet connection options.  But with a laptop and cellphone you can check email and surf the web from anywhere, any time!  Follow these simple step-by-step directions, and you can have the Internet in your pocket and be online whenever and wherever you want!\n\nRead more here: How to Connect Your Computer to the Internet Using Your Cell Phone as a Wireless Internet Connection or Tethered Modem \n\nHere are some amazing deals we've found on the Internet for ourselves recently:\n\nGet gadget insurance for your cell phone, PDA and all your electronic gadgets, to protect against los or theft!  http://www.theinternetpatrol.com/get-your-stuff-back-with-stuffbak-pdas-laptops-cell-phones-protect-them-all\n\nSend Unlimited Newsletters to Your Customers, Friends, Family, and Others:  http://www.theinternetpatrol.com/the-perfect-way-to-send-email-newsletters\n\nUnlimited Calls to Any Phone in the U.S.:  http://www.theinternetpatrol.com/make-unlimited-phone-calls\n\nCheck out our online audio show, \"Three Things You Should Know\"!  http://www.ThreeThingsYouShouldKnow.com\n\n\nAnd check out the best collection of how to videos at http://www.LearnHowTo.TV !\n\n\nKnow somebody who would like to receive these alerts?  Forward this one to them and let them know\nthat they can sign up for free by sending email to \"internetpatrol@aweber.com\" with the \nword 'Subscribe' in the subject!\n\n\n\n\n\nThe Internet Patrol, \n302 W. El Camino Real, #411, \nSunnyvale, CA 94087, USA \n\n\n\nTo unsubscribe or change subscriber options visit:\nhttp://clients.suretymailings.com/z/r/?TBwMLMwctMzsTCxMTJzs\n\n\n"}