{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: Final text of GPL v3", "body": "Francesco Poli  wrote:\n> >   3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n> [...]\n> Waiving legal rights can be seen as a fee: this clause could fail\n> DFSG#1.\n\nIt could, but I don't think this is one we can test in many cases.\n\nIf GPLv3 does turn out to have bizarre interactions with Computer Misuse\nlaw, then either FSF will amend (I hope) or GPLv3 will surely be rejected\nen masse.  Until then, I'm willing to assume it does what was intended\nand not hold it as a problem following the DFSG.\n\n> >   5. Conveying Modified Source Versions. [...]\n> >     d) If the work has interactive user interfaces, each must display\n> >     Appropriate Legal Notices; however, if the Program has interactive\n> >     interfaces that do not display Appropriate Legal Notices, your\n> >     work need not make them do so.\n> [...]\n> What is more awkward\n> is that it seems that when a non-interactive work is modified so that it\n> becomes an interactive work, the modifier is *compelled* to implement\n> these features in *any* newly created interactive interface.\n\nAre you sure?  If the work has no interactive user interfaces, neither\nof the above 'if' parts seem true already, so adding the first such\ninterface lets its author make both parts true simultaneously by adding an\ninterface which does not display the notices, if they so wish.\n\n> >   7. Additional Terms.\n> [...]\n> Especially, clause 7b is a permission to add a possibly non-free\n> requirement.  Actually: what exactly is a \"reasonable legal notice\"?\n> What exactly is an \"author attribution\"?  These terms are not defined\n> anywhere in the license. [...]\n\nI share these reservations.  A problem to watch for in GPLv3 packages.\n\n> >   13. Use with the GNU Affero General Public License.\n> [...]\n> Being compatible with an unreleased (and probably non-free) license\n> destroys the copyleft mechanism of the GPLv3.\n\nNot destruction, but it means GPLv3 is only a weak copyleft IMO.  It is\namazing that GPLv3 may give a minor exit route from free software to\nadware.  The only way to avoid it is for FSF to never release GAGPL, but\nhow likely is FSF to change course now?  They've marginalised several\ngood web app authors from the consultations by putting it in a bad\nWeb-2.Null interface, so I'm fearful it's a done deal.\n\nRegards,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}