{"category": "spam", "to_address": "Gnitpick <gnitpick@flax24.uwaterloo.ca>", "from_address": "Federico Kirk <issymike@gnpro.com>", "subject": "Report", "body": "\n\nYour lady can't have orgasms? Heh, body, it's your fault. Do you want to fix that?\nClick to visit us\nUse licensed Viagra and Cialis pills from our drug store. You will be the best, you will have perfect sex in your life!\nVisit us\nWe have cheapest prices and best quality drugs. We ship instantly worldwide!\nWith best regards,\nFederico Kirk\n \n \nIa-to uzhe vserez polagal, chto za to Vremia, chto obshchaius s etim neveroiatnym chuzhim, uzhe privyk k liubym siurprizam, No k ocherednomu ego triuku okazalsia absoliutno ne gotov. Poly prostornogo temno-sinego plashcha, ukryvshego ego do kolen, edva zametno Razvevalis, polia shirokopologo soro pokachivalis v takt shagam. Ne ponial chto? Ne govori zagadkami, Onni. Shefir pochemu-to vsegda predstavlialsia Mne nekim bezobraznym chudovishchem, lish otdalenno napominaiushchim razumnoe Sushchestvo, no peredo mnoj okazalsia vpolne normalnyj na vid, dovolno molodoj Muzhchina okolo soroka let, s krasivym, tochenym licom i blagorodnoj osankoj Aristokrata. \nV dvuh shagah ot nego pod potolkom neiarko gorel iavno dyshashchij na ladan mashar, Edva razgoniaia tmu koridora, bylo tiho i pusto, i eto uspokaivalo. Nkot ostanovilsia. U nego byla dobraia dusha. Tem ne menee vynuzhden byl dat deru, tak kak vinovnikom Avarii kapitan korablia reshil sdelat imenno ego. Gilsveri sohranil nepronicaemoe vyrazhenie lica. Celitel Prav. Ego mysl vonzilas V moj mozg, vskryvaia sloi pamiati, slovno konservnyj nozh zhestianuiu banku: Vspomni! I plotina prorvalas! Dolgo sderzhivaemaia iskusstvennym zabveniem Plotina inolichiia razrushilas, osvobodiv istinnuiu pamiat. Myslenno nasypav nad nej mogilnyj holmik i primiav ego nogoj, ia Pristupil k delu. \nRassudok dolzhen byt Holoden kak led. Ia mog by ubit Tvoego Movadina sotniu raz eshche do togo, kak on zamahnulsia svoim nozhom. Ne bespokojsia. No ia ne skazal, chto odobriaiu Podobnye metody. ejisuminyon VVFcRlhQUVh0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}