{"category": "spam", "to_address": "<companyinfo@yahoo.com.au>", "from_address": "\"Mr. Dennis Woodson\" <heritage_info11@bellsouth.net>", "subject": "Part Time Job (With Commission)", "body": "Baker's Foods Limited\n187 Todd Road Fishermans\nBend VIC 3207\nAustralia.\n  \nBAKER'S FOODS LIMITED\nSells Vegemite, Kraft cheese,Kraft Peanut Butter, Maxwell House coffee, Oreo cookies, Ritz biscuits, Captain's Table crackers,Philadelphia cream cheese, and Toblerone chocolates.We have reached big sales volume in the european market and now are trying to penetrate the Northern American market. Quite soon we will open representative offices and authorized sales centers in North America and therefore we are currently looking for people who will assist us in establishing a new distribution network there. The fact that despite the Nothern America market \nis new for us we already have regular clients also speaks for itself. \n \nWHY YOU? \nThe international money transfer tax for legal entities (companies) in Australia is 35%, whereas for the individual it is only 10%. Thats why we need you, We need agents to receive payment for our products in their locality and to resend the money back to us. This way we will save money because of tax decreasing. \n\nHOW MUCH WILL YOU EARN? \n8%-10% from each sale/resale operation! For instance: you receive 2000 USD to your bank account. You will withdraw the money and keep $160 (8% from $2000) for yourself! At the beginning your commission will equal 8%, though later it will increase up to 10%. \n \nADVANTAGES \nYou do not have to go out as you will work as an independent contractor right from your home office.Your job is absolutely legal. You can earn up to $4000-5000 depending on time you will spend in this business. You do not need any capital to start. The employees who make efforts and work hard have a strong possibility to become managers. Anyway our employees never leave us. \n\nIf you are interested in our offer, please feel free to ask for the general provision of the Contract. \n\nRespectfully Submitted, \nMr. DENNIS WOODSON \nMANAGER/CONSULTANT OFFICER\ncompanyjobsinfo@yahoo.es\nBAKER'S COMPANY FOODS LIMITED.\n\n \n\n"}