{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 6, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESTop Diabetes Doc Says Glaxo Threatened Him\nThe president-elect of the diabetes association will tell Congress today that GlaxoSmithKline threatened him with legal action\n                        in 1999 when he first raised questions about Avandia. Glaxo is citing its own study to show that the drug is safe. More...Watch: Dr. Senay On Avandia    \n• Congress Wants Answers On TB Scare• GOP Debate Forecasts Stormy Days Ahead\n                     \t\t\t\t\t| Watch• Man Tries To Jump Into Popemobile\n                     \t\t\t\t\t| WatchU.S.Video May Have Clues In Missing Teen Case\nA young, goateed man videotaped leaving a store in Kansas moments before the apparent abduction of 18-year-old Kelsey Smith\n                        is being sought for questioning, police said. The man hasn't been identified and is not being called a suspect. More...Watch: New Clue In Kelsey Smith Case\n• Congress Wants Answers On TB Scare• Divorce American Style: Wife Gets $184M• Property Row Over Flight 93 Memorial Site• More StoriesWorldMan Tries To Jump Into Popemobile\nA man tried to jump into Pope Benedict XVI's uncovered popemobile in St. Peter's Square and held onto it for a few seconds\n                        before being wrestled to the ground by officers. The pope wasn't hurt and didn't even appear to notice the interruption.  More...Watch: Man Ambushes Popemobile\n• Bush: \"Russia Is Not An Enemy\"\n                     \t\t\t\t\t| Watch• Frail But Alert Castro Appears On Cuban TV\n                     \t\t\t\t\t| Watch• Spain To Seize U.S. Treasure Hunter Ships• More StoriesPoliticsGOP Debate Forecasts Stormy Days Ahead\nDivisions on issues from immigration to abortion were clear at the GOP presidential debate. After treading softly around an\n                        unpopular president, wide cracks emerged between Mr. Bush and those seeking to replace him, reports Vaughn Ververs. More...Watch: Republican Debate\n• Pardon Me?\n                     \t\t\t\t\t| Watch• Congress Wants Answers On TB Scare• Giuliani Draws Lightning From Above\n                     \t\t\t\t\t| Watch• More StoriesHealthCongress Wants Answers On TB Scare\nSenate and House committees were asking why a guard let Andrew Speaker cross the U.S.-Canada border, even though he was on\n                        a list to be stopped, and why various federal agencies didn't communicate better with each other.  More...\n• Body, Heal Thyself\n                     \t\t\t\t\t| Watch• Kevorkian's New Mission: Education\n                     \t\t\t\t\t| Watch• Can Aspirin Help Fight Cancer?• More StoriesSciTechNASA Head Sorry For Global Warming Doubts\nThe head of NASA told scientists and engineers that he regrets airing his personal views about global warming during a recent\n                        radio interview, according to a video of the meeting obtained by The Associated Press. More...\n• Mass Evacuations As Cyclone Gonu Hits Oman• Vatican Going Solar• Drought Exposes Finds On Fla. Lake Bottom• More StoriesBusinessSirius, XM, Hire High-Profile Lobbyists\nThe nation's only two satellite radio companies have hired a high-profile public affairs firm to lobby the federal government\n                        on their proposed merger, which faces regulatory and congressional scrutiny. More...\n• Billionaire Burkle May Bid For Dow Jones• A Win For Accidentally Aired Expletives• U.S. Auto Slump Moves Beyond The Big Three• More StoriesEntertainmentParis Hilton \"Crying\" Behind Bars\nDefense lawyer Richard Hutton and Dr. Charles Sophy were visitors at the facility for two hours, the paper said, as the hotel\n                        heiress seems to be struggling behind bars. More...\n• Aniston Dating Model For Several Weeks• \"Jericho\" Might Make Midseason Return• Judge Orders Sizemore Held Without Bail• More StoriesOpinionHarry Potter & The Continuous Exploitation\nIf a Harry Potter theme park is a success, says special contributor Lloyd Garver, then others based on popular books\n                        and movies are certain, although he hopes there won't be a theme park for the movie \"Knocked Up.\" More...\n• No Mercy For Libby• Hedge Hogs\n                     \t\t\t\t\t| Watch• GOP Must Focus On The Family\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Caught In The Web: Beware Of Internet Puppy Scam \nIf you've gotten an e-mail offering pedigreed puppies at a fire sale price, join the club. It's the latest Internet scam.\n                        Not surprisingly, there aren't really any puppies for sale and the AKC and the Better Business Bureau have put out a warning. More...\n• 48 Hours: Love And Lies\n                     \t\t\t\t\t| Watch• CBS Evening News: Opening Up New \"Posse\"-bilities\n                     \t\t\t\t\t| Watch• CBS Evening News: Body, Heal Thyself\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nMissing Girl's Parents SpeakGreg and Missey Smith speak with Julie Chen about their search to find their missing daughter, Kelsey Smith, who vanished\n                                    from a Target parking lot in Overland Park, Kan.\nTOP VIDEOS\nRick Reilly On Cheerleading\nCapitol Bob On GOP Standstill\nCarefree Gardening\nTwo Princes 'After Diana'\nPros & Cons Of Folic Acid \nOnline Scam Targets Pet Lovers\nSupporting U.S. War Dogs\nDiana's Sons Protest Film\nMan Ambushes Popemobile\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesHear from Dr. Jack Kevorkian, in his first post-prison interview with Mike Wallace. This Sunday, 7 p.m. ET/PT.48 Hou!\n rs Myste\nryLove And Lies:Murder exposes the secret lives of a suburban couple. Peter Van Sant reports, Tuesday, June\n                           5, at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}