{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Power Marketing Association<Power.Marketing.Association@calcium.netcontentinc.net>", "subject": "Alternative Regulation for Electric and Gas Utilities  June 25-26  Boston", "body": "Campaign Manager\n\n\n\n\n\n\n\n\n\nOATT Reform\n\n\n \n\n\n\n\n\nAlternative Regulation for Electric and Gas Utilities  \nJune 25 – 26, 2007  /Boston, Massachusetts\nClick Here \n            To Download A Complete Conference Brochure\n Click Here For A Complete Listing\n              Of Upcoming Conferences\n\n\n\n\n\n\n\n\n\n \nOverview:  \n\nAlternative Regulation (AltReg) has become increasingly popular in North America. More than two dozen US States and several Canadian Provinces have adopted some type of AltReg plan for electric or gas utilities. AltReg is also the norm overseas and has been implemented in most countries in Europe, Latin America, and Australia/New Zealand. AltReg can be designed to achieve a number of important regulatory objectives. For example, AltReg plans can reward utilities for good cost and quality performance and discourage bad performance. By linking financial outcomes to company performance, AltReg creates stronger incentives for utilities to manage costs, be innovative, and improve reliability and service quality compared with traditional cost-of-service regulation. A number of recent AltReg plans also establish innovative regulatory approaches for funding and recovering infrastructure investments.\nThis seminar is designed to give its participants a good understanding of the basics of AltReg. There will be a comprehensive review of the range of AltReg options and the types of plans that have been approved throughout North America. There will be an extensive analysis of the main issues companies need to address when designing AltReg plans for both rates and service quality applications. There will also be a discussion of an innovative “incentive power” model that companies and regulators can use to evaluate and compare regulatory alternatives. In addition, the seminar will consider recent experiences with AltReg in the US and Canada, including revenue decoupling for gas utilities and several plans for bundled power services, as well as “state of the art” developments in leading jurisdictions in North America and throughout the world.\nWhat Attendees Will Learn\n\n\nThe basics of AltReg plans\n\nThe advantages and disadvantages of AltReg compared to cost of service regulation\n\nThe range of available AltReg options\n\nThe main issues involved in designing AltReg plans that apply to rates and service quality\n\nAltReg approaches that encourage infrastructure investment\n\nImportant new developments in revenue decoupling AltReg and AltReg for bundled power services\n\nRecent and “state of the art” AltReg developments in the US, Canada and throughout the world\n\n\n\nWho Should Attend\nThe seminar is designed for management and senior level utility personnel, particularly those responsible for ratemaking, regulation and corporate strategy, as well as members of State, Provincial and Federal regulatory agencies. A detailed working knowledge of AltReg is not necessary, although some familiarity with the concept would be helpful. Utilities and regulators that have already adopted AltReg plans are strongly urged to attend and share their views and experiences.\n\n \n\n\n\n\n\nRegister today!\n\n\n\n\nClick\n        Here To Download A Complete Conference Brochure\n\n\n \nUpcoming \n  Conferences\n    Best Practices for Energy Risk Management\nNew York, NY\n  April 8-11, 2007\n  Coal \n  Gasification 2007: The Path Forward\nDenver, CO\n  April 11-13, 2007\n    The 7th Annual National Multicultural Business Conference\nLas Vegas, NV\n  April 11-13, 2007\n   Wall \n  Street Green Trading Summit VI\nNew York, NY\n  April 16-17, 2007\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}