{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Police arrest suspect in missing teen case", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJun  7, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nPolice arrest suspect in missing teen case\n\n\n\n\n\nPolice arrested a man in the abduction and death of a Kansas teenager who\ndisappeared four days ago from a store parking lot, authorities said late\nWednesday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMissing girl found hidden under staircase\n\n\n\n\n\nA 15-year-old girl who had been missing for nearly a year was found Wednesday,\nlocked in a small hidden room under a staircase in a West Hartford,\nConnecticut, home, police said.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nPolice arrest suspect in missing teen case\n\n\n\n\n\nPolice on Wednesday arrested a man in the abduction and death of a teenager\nwho disappeared four days ago from a store parking lot.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEx-cop executed for Houston woman's murder\n\n\n\n\n\nA former sheriff's deputy was executed Wednesday for the robbery, rape and\nfatal stabbing of a Houston woman at her family's flower shop.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCrash leaves transplant patient waiting for lungs\n\n\n\n\n\nThe patient who was on the operating table for a double lung transplant when a\nplane carrying the organ and transplant team went down in Lake Michigan on\nMonday is back on the waiting list for another donation. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJudge ponders appeal by man in prison for teen sex\n\n\n\n\n\nA judge said Wednesday he'll rule by next week on the appeal of a man\nsentenced to 10 years in prison for having consensual oral sex with a\n15-year-old girl when he was 17. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nPolice: Cylone killed 12 in Oman\n\n\n\n\n\nA Royal Oman Police spokesman tells Oman TV there are 12 reported deaths from\nCyclone Gonu. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nColombia seeks FARC prisoner swap\n\n\n\n\n\nColombia has begun releasing prisoners from its largest Marxist rebel group,\nbeginning with its \"foreign minister,\" Rodrigo Granda, in hopes of getting the\nRevolutionary Armed Forces of Colombia (FARC) to reciprocate, authorities said\nWednesday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBush, Putin to meet amid tensions\n\n\n\n\n\nU.S. President George W. Bush said he hoped to convince Russian President\nVladimir Putin on Thursday that their dispute over a U.S. missile defense\nsystem is not an issue \"to be hyperventilating about.\"\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReports conflict of Turkish troops in Iraq\n\n\n\n\n\nSeveral thousand Turkish troops crossed into northern Iraq early Wednesday to\nchase Kurdish guerrillas who attack Turkey from bases there, two Turkish\nsecurity officials said. Turkey's foreign minister denied its troops had\nentered Iraq.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nShaking off global rate worries\n\n\n\n\n\nInterest rates are ticking higher overseas, raising concerns on Wall Street\nthat U.S. rates will be pulled up along with them - but that may not\nnecessarily be the case.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA retirement mistake Boomers should avoid\n\n\n\n\n\nOf all people who apply for Social Security retirement benefits every year,\nthe number doing so before their \"full retirement age\" has been on the rise.\nFor some, that move is going to cost them money.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nArash Markazi: Niedermayers now have story to share\n\n\n\n\n\nANAHEIM, Calif. -- Scott Niedermayer had victoriously skated around with the\nStanley Cup before. Three times to be exact. Each time he had won it, he took\nit back to his home in Cranbrook, British Columbia, where he would gather with\nfriends and family for a barbeque. At sunset, they would sit around a campfire\nwith the Cup and point out certain names etched into the silver chalice and\ntell stories. Everyone would get to hold the trophy and tell a tale. Well,\neveryone except one.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKevin Goldstein: 2007 MLB Mock Draft\n\n\n\n\n\nFour years ago, the Devil Rays had the first pick in the draft, as they do\ntoday. Their internal debates came down to the wire, as they did not finalize\ntheir decision to select California high school outfielder Delmon Young over\nSouthern University second baseman Rickie Weeks until the morning of the\ndraft.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nYour guide to fibroid fixes \n\n\n\n\n\nCece Clark's fibroids had gotten so bad that she often had to lie down in the\nmiddle of the day. When she got up, it was usually for another trip to the\nbathroom. \"My periods were astoundingly heavy, and pressure on my bladder made\nme feel like I had to go all the time,\" she recalls. But after she tried an\nuncommon ultrasound treatment, everything changed. \"The pressure lessened\nright away,\" she says. \"It was such a physical and emotional relief.\"\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTB patient insists he was never banned from travel\n\n\n\n\n\nThe tuberculosis patient who set off an international health scare by flying\nto Europe then Canada before driving back to the U.S. told lawmakers Wednesday\nthat doctors told him he was not contagious. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nIf it's not tennis elbow, it may be 'Wiiitis'\n\n\n\n\n\nWhen Dr. Julio Bonis awoke one Sunday morning with a sore shoulder, he could\nnot figure out what he had done. It felt like a sports injury, but he had been\na bit of a couch potato lately.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n'DRM-free' iTunes songs raise concerns\n\n\n\n\n\nApple Inc.'s recent rollout of songs without copy protection software at its\niTunes Store has given consumers new flexibility, but questions have emerged\nover the company's inclusion of personal data in purchased music tracks.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nTherapists become bad guys on 'Sopranos'\n\n\n\n\n\nTherapists, we've long known, are among the biggest fans of \"The Sopranos.\"\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n'Jericho' fans assail CBS with 25 tons of peanuts\n\n\n\n\n\nFans trumpeting the cause of CBS' canceled drama \"Jericho\" have caught the\nnetwork's ear.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}