{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "appellation: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n101 Questions Answered!\n\nWhat is Hezbollah? What are stem cells?\nHow'd those swimsuits get so skimpy?\n\nClick here for the KnowledgeNews answers\nADVERTISEMENT\nWord of the Day for Sunday, May 27, 2007\nappellation \\ap-uh-LAY-shun\\, noun:\n1. The word by which a particular person or thing is called and known; name; title; designation.\n2. The act of naming.\nFor as long as Olympia can remember, her mother has been referred to, within her hearing and without, as an invalid -- an appellation that does not seem to distress her mother and indeed appears to be one she herself cultivates. -- Anita Shreve, Fortune's Rocks\nA communist or a revolutionary, for example, would likely readily accept and admit that he is in fact a communist or a revolutionary. Indeed, many would doubtless take particular pride in claiming either of those appellations for themselves. -- Bruce Hoffman, Inside Terrorism\nI feel honored by yet undeserving of the appellation \"novelist.\" I am merely a craftsperson, a cabinetmaker of texts and occasionally, I hope, a witness to our times. -- Francine Du Plessix Gray, \"I Write for Revenge Against Reality\", New York Times, September 12, 1982\nAppellation comes from Latin appellatio, from appellare, \"to name.\"\nDictionary.com Entry and Pronunciation for appellation\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9733005-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}