{"category": "ham", "to_address": "\"M. Jankowski\" <mjankowski@gmail.com>", "from_address": "Marc Schwartz <marc_schwartz@comcast.net>", "subject": "Re: [R] Need Help: User Defined R Functions in Sweave/Latex", "body": "On Wed, 2007-06-20 at 22:50 -0500, M. Jankowski wrote:\n> Dear all,\n> \n> I want to start my post by expressing my sincere gratitude for all the\n> help this group has given me in Sweave/Latex/R. The tools are\n> excellent and so is the community!\n> \n> On to the question.\n> \n> My Sweave code is intended to make lots of plots and create a *.pdf\n> document. Sweave is perfect for this. The only problem is that  I find\n> myself using the same R code, within my Sweave input file over an\n> over. I know about Latex macros and I can even get R functions,\n> essentially used as subroutines, to sort of work. \"\\Sexpr{}\" will not\n> work because the R code I want to use over and over is in the R\n> environment. I've tried numerous ways to tackle this process and could\n> really use some help. If there is some easier way to do this please\n> let me know!\n> \n> This is the R function:\n> basicplot <- function(x, nplots, sectionname){\n> # Begin to make figure here\n> file = paste(\"scatter\",nplots, \".pdf\", sep=\"\")\n> pdf(file = file,paper=\"special\", width=6, height = 6)\n> plot(x)\n> dev.off()\n> cat(\"\\\\begin{figure}\\n\")\n> cat(\"\\\\includegraphics{\",file,\"}\\n\", sep=\"\")\n> cat(\"\\\\caption{\", sectionname,\"}\\n\", sep = \"\")\n> cat(\"\\\\end{figure}\\n\")\n> #End figure making\n> }\n> \n> The aim is to generate Latex code which will have some basic\n> information as part of the caption. The trouble seems to be that the\n> output from the function appears to latex as if it is protected R code\n> when I really want to create output that pdflatex will act on.\n> Essentially, the resulting *.pdf contains the lines output by the cat\n> function in basicplot. Or:\n> \\begin{figure}\n> \\includegraphics{scatter1.pdf}\n> \\caption{myname}\n> \\end{figure}\n> These lines are not in the environment acted by Latex. I tried a\n> variant of the function where <> and received\n> the same result. Below are the files *.Snw -> *.tex -> *.pdf and the\n> output I received while compiling. If there is anything else I can\n> give to help you help me just let me know. Thanks!\n> \n> Matt\n\n\nMatt,\n\nI don't know if you have reviewed the Sweave manual, but section 3.4\nprovides insight into reusing named code chunks, as an alternative to\nlooping or creating LaTeX macros as proposed by Dieter. These can be\n\"nested\" within other named code chunks and/or R code.\n\nIf you don't yet have the manual, it is available here from Fritz' site:\n\nhttp://www.ci.tuwien.ac.at/~leisch/Sweave/Sweave-manual-20060104.pdf\n\nYou could consider using a figure chunk, if the sole output is the plot\nand not text. That way you don't have to worry about explicitly cat()ing\nthe figure related LaTeX markup as you are doing above. Thus, the LaTeX\nmarkup for things like captions will be in LaTeX sections of the .Rnw\nfile and you can use \\Sexpr{}'s to include derived scalar values.\n\nThe preferred approach may be to an extent dependent upon whether your\nfinal document will simply have several plots on one or more pages in\nsequence, or whether you will need to have text between the plots, such\nthat you really need LaTeX sections between the figure/code chunks.\n\nBack to Dieter's solution for a moment, take note of the Sweave FAQ\n(also in the above manual), specifically FAQ A.9, which covers the issue\nof figure chunks and multiple plots, proposing a looping approach\nconsistent with Dieter's.\n\nI hope that this might give you some other insights into alternative\napproaches.\n\nHTH,\n\nMarc Schwartz\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}