{"category": "spam", "to_address": "cruiseca@speedy.uwaterloo.ca", "from_address": "\"COPD Newsletter\" <return@anythingrading.com>", "subject": "Chronic Obstructive Pulmonary Disease Newsletter - News You Can Use", "body": "Chronic \nObstructive Pulmonary Disease Newsletter - News You Can Use \nMillions of people have COPD, \n  or Chronic Obstructive Pulmonary Disease. \n  In fact, COPD is the fourth-leading cause of death in the United States. \nCOPD is a lung condition that makes \n  it more and more difficult to breathe. \n  Both chronic bronchitis and emphysema are considered part of COPD.\nCOPD can affect your life as early \n  as your early 40s. Both men and women can get it. \n  Tobacco smoke causes approximately 80% to 90% of all cases of COPD. \n\n  In fact, a smoker is 10 times more likely to die of COPD than a nonsmoker.\nAnother cause of COPD is exposure \n  to indoor or outdoor pollutants. \n  If your job exposes you to toxic chemicals and pollutants, you will \n  also have increased odds of developing COPD. \nA recent study found that an estimated \n  19.2% of COPD was attributed in part to work-related exposure.\nExperts believe that about 10 million \n  Americans have been diagnosed with COPD. \n  However, just as many people have some form of lung impairment but have not \n  been diagnosed with COPD.\nCOPD may go unnoticed in its early \n  stages. This is because \n  it is often confused with asthma, a bad cough, or a natural part of aging. \nAlso, many people think of COPD as \n  a disease that only affects the elderly. \n  In fact, more than 70% of patients who have COPD are under age 65. \n  And some people start having symptoms in their early 40s.\nA \nDoctor Discusion Guide is available\n \nTHE SYMPTOMS OF COPD\nThe symptoms of COPD tend to develop \n  gradually and can begin in a person's early 40s. \n  They may be worse some days than others, or they may be bad all the time. \n  The important thing is to identify the symptoms early and get treatment.\nCommon symptoms of COPD include: \n  \n* Shortness of breath (dyspnea)\\u2014In \n  the early stages of COPD, patients may experience \n  breathlessness only during strenuous activity. This might include climbing stairs \n  or exercising. \n\n  At first, they may see this as a sign of aging or being out of shape. But gradually, \n  \n  patients begin to feel shortness of breath even during simple activities. \n  This can happen when simply walking across the room, or even at rest \n* Chronic cough\\u2014It is often \n  the first symptom of COPD to develop. \n  Many people discount it as \\u201csmoker's cough\\u201d or the effect of cold \n  weather at first \n* Increase and/or change in sputum\\u2014Patients \n  often produce sputum (also called phlegm) after coughing \n* Wheezing\\u2014Wheezing is a whistling \n  or squeaking noise that is heard when the patient breathes. \n  It may be caused by the narrowing of the airways in the lungs \n* Chest tightness\\u2014Patients \n  describe this as a feeling of pressure on the chest, \n  as if being wrapped tightly by a blanket \nA \n  Doctor Discusion Guide is available\n \n \n\n----------------------------------------------------\nTo stop \n  receiving announcements\n Boehringer Ingelheim Pharmaceuticals, \n  Inc. and Pfizer Inc.\n  P.O. Box 4964, \n  Trenton NJ 08650-9808\n\n\n______________________________________________________\n\n\n\n"}