{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Fred Bacon <bacon@aerodyne.com>", "subject": "Re: [R] Suggestions for statistical computing course", "body": "On Fri, 2007-04-20 at 16:02 +0200, ONKELINX, Thierry wrote:\n> >    \n> >    While I am looking for simple and effective solutions that do not\n> >    require installing emacs in our computer lab, the answer \"you\n> >    should teach your students emacs/ess on top of R\" is perfecly\n> >    acceptable.\n> >    \n> \n> TINN-R (http://www.sciviews.org/Tinn-R/) could be an alternative for\n> Emacs. But hen you would still have to install it on each computer.\n> \n> And there still is the build-in code editor.\n\nIf you want to avoid a complex setup on multiple computers you might try\nsomething we did recently for a customer training class.  \n\nWe used VMware to create a virtual machine.  Then we installed all of\nour software on the virtual machine and set up our training materials\nfor the class on it.  Then we rented the necessary computers, installed\nthe free VMware player on them, and copied our virtual machine to each\ncomputer.  This simplified the class setup significantly and guaranteed\nthat we had a uniform, functioning environment for each of the students.\n\nWe're a small company, but it should be a great solution for university\ncomputer labs.  The instructor could set up the environment for his\nclass separately from all other courses, and push it out to the computer\nlab.  A student comes in, opens the virtual machine for his course, and\nhas a clean sandbox to work in.\n\nIdeally, it would work like this:  \n\n   The free VMware player is installed on each of the lab computers.\n\n   The lab manager uses a licensed copy of VMware Workstation to create\na clean image of a computer.  \n\n   The instructor makes a copy of the clean image and installs the\nnecessary software and instructional materials.  The instructor can use\neither the free player or the paid workstation version to do this.  \n\n   After the virtual machine is completed, the image is sent back to the\nlab where it is made available to the lab computers.\n\nIf you use the paid workstation version rather than the free player\nversion on the lab computers, then you can use the Snapshot feature to\ncreate a consistent image for every student.  Every time the virtual\nmachine is shutdown, the system can revert back to the snapshot for the\nnext student.  It all depends on your budget.\n\nHow you handle the OS licensing issue for the guest operating system is\nup to you.  I personally would recommend using Linux, but some of our\ncustomers are terrified of anything that doesn't look like a Microsoft\nOS.\n\nThe only caveat is the disk space utilization.  Having a complete OS\nimage for every student for every class could eat up terabytes of space.\nBut heck, terabyte RAID arrays are readily available these days. \n\nFred\n-- \n-----------------------------------------------------------------------\nFred Bacon                                  Phone: 978 663-9500 x 273\nAerodyne Research, Inc.                     FAX:   978 663-4918 \n-----------------------------------------------------------------------\nWhere is human nature so weak as in the bookstore? \n                                                 -- Henry Ward Beecher\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}