{"category": "ham", "to_address": "Chas Owens <chas.owens@gmail.com>", "from_address": "Mathew <theillien@yahoo.com>", "subject": "Re: Hash Key is a Null Value", "body": "The purpose of getting the data in the first place is to allow my boss\nto see that people are still not doing things they are supposed to.  He\ncan then send out reminders so we can establish better habits.  My plan\nis to replace the null value with a description making it obvious that\nthe value had not been set instead of just leaving a big ugly blank spot.\n\nKeep up with my goings on at http://theillien.blogspot.com\n\nChas Owens wrote:\n> On 6/14/07, Mathew Snyder  wrote:\n>> I'm building a hash using values from a database backend to an\n>> application we\n>> use in house.  The application has a field which contains a customer\n>> name.  This\n>> values is supposed to be set by the person handling the work but\n>> sometimes\n>> doesn't get done.  This leaves a NULL value in the database which, in\n>> turn,\n>> leaves me with a null key in my hash.\n>>\n>> I've tried resetting it by assigning the value to another key so I can\n>> delete\n>> the element but so far nothing has worked.  I've tried to access it with\n>> $hash{}, $hash{\"\"}, and $hash{''}.  None of these will allow me to\n>> access the data.\n>>\n>> I could probably reassign it through more complicated means but that\n>> would\n>> require creating objects and accessing methods I'm not familiar with. \n>> If anyone\n>> knows an easier way to access a null key I'd appreciate hearing it.\n>>\n>> Thanks\n>> Mathew\n>> -- \n>> Keep up with me and what I'm up to: http://theillien.blogspot.com\n> \n> Jenda's solution should work, but if you are just going to throw it\n> away (instead of logging it as a problem) then why fetch it from the\n> database in the first place?  Add \"customer_name is not null\" to the\n> where clause.  Fetching data you are not going to use is unkind to the\n> database, the network, and your program.\n> \n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}