{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Computers & Electronics Newsletter May 24, 2007", "body": "\nhowstuffworksÂ® | computers & electronics May 24, 2007\nRSS\n  \n Get the Right Television for You and Your Family  If you're shopping for a new television, check out the\nTelevision Stuff Guide before you buy. Learn about the different TV types\n(including LCD, plasma and DLP), read reviews, compare prices and get answers\nto frequently asked questions about digital TV.\nAlso at HowStuffWorks\n\n\nHow Movie Download Services Work - If you want to buy or rent a\nmovie, you have a lot of options, including movie rental stores and mail services\nlike Netflix and Blockbuster Total Access. But if these are too slow for you,\nyou can download a movie online and begin watching within minutes. Learn more.  \n\nHow GPS Phones Work - Imagine driving to a job interview and realizing that you're\nlost. What if your cell phone could figure out exactly where you are and give\nyou turn-by-turn directions to where you're going? Learn\nhow GPS phones work.\n \n\nHow TiVo Works -  In 1997, a company changed the way people watch\n television. TiVo, a brand\nof DVR, allows subscribers to record their favorite TV shows and watch them\nwhen they want to. Take a look at how the typical TiVo set works and the\nservices it provides.\n   \nThis Week's Video \n\n\nHow HDTV Works - High-definition television (HDTV)\nhas revolutionized the quality of your TV picture. But for a lot of people,\nHDTV hasn't delivered a ready-made source for transcendent experiences in front\nof the tube. Instead, people have gone shopping for a TV and found themselves\nsurrounded by confusing abbreviations and too many choices. Learn how HDTV works\nin this video from HowStuffWorks.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. Â© 2007, HowStuffWorks, Inc. All Rights Reserved "}