{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 25, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESHouse Panel Subpoenas Rice On Iraq Claims\nA House committee looking into discredited claims that Iraq was seeking uranium from Africa has subpoenaed Secretary of State\n                        Condoleezza Rice. Another panel granted immunity to an ex-aide to Attorney General Gonzales in the prosecutor firings case. More...Watch: Bush: Gonzales Is Staying\n• Feds Arrest Mail Bombing Suspect• Taliban: Bin Laden Behind Cheney Attack\n                     \t\t\t\t\t| Watch• Cops Hunt Killer Of N.Y. State TrooperU.S.Cops Don't Know Va. Tech Gunman's Motives\nThe massacre inside a chained-shut Norris Hall went on for nine minutes as Seung-Hui Cho fired off 170 rounds, killing 30\n                        people before shooting himself in the head, police revealed Wednesday. More...Watch: Gun Control An Issue In Va.  \n• Student Film Causes Campus Gun Scare• Jessica Lynch Sets Record Straight\n                     \t\t\t\t\t| Watch• Supreme Court Throws Out 3 Death Sentences• More StoriesWorldTaliban: Bin Laden Behind Cheney Attack\nA top Taliban commander tells Al-Jazeera television that Osama bin Laden planned and supervised the February bombing outside\n                        a U.S. military base in Afghanistan when Vice President Cheney was visiting. The bombing killed 23 people. More...Watch: Cheney Safe In Afghanistan\n• Pakistan's Quiet Fight For Iran's Favor • A Final Farewell To Boris Yeltsin\n                     \t\t\t\t\t| Watch• Mugabe Losing Grip On Zimbabwe's Army• More StoriesPoliticsMcCain Makes It Official: He's Running \nRepublican Sen. John McCain officially launched his campaign for the presidency with a speech in New Hampshire, selling himself\n                        as a man with the experience to lead in wartime. \"I know how to fight and how to make peace,\" he told voters. More...Watch: McCain Announces Candidacy\n• House Panel Subpoenas Rice On Iraq Claims\n                     \t\t\t\t\t| Watch• Giuliani Says Dems Put U.S. At Risk\n                     \t\t\t\t\t| Watch• Obama Blasts Giuliani's Remarks• More StoriesHealthStudy: Being Smart Doesn't Make You Rich\nHaving a high IQ isn't money in the bank, according to new research that shows smarter doesn't necessarily mean richer. More...\n• Tainted Pet Food Was Fed To Hogs\n                     \t\t\t\t\t| Watch• New Plan For Better Vets' Care• Study: Breastfed Tots No Thinner As Adults• More StoriesSciTechCalifornia To Sue EPA Over Air Standards\nGov. Arnold Schwarzenegger's administration will sue the Environmental Protection Agency for acting too slowly on California's\n                        request to regulate greenhouse gas emissions from automobiles, a spokesman said. More...\n• Crocodile To Be Set Up With Four Partners• New Planet Spotted, Could Be Habitable• Lye In Water Blamed For Burns, Rashes• More StoriesBusinessNew Home Sales Rebound In March\nSales of new homes rebounded slightly in March, helped by better weather, but the gain was not enough to offset big declines\n                        in the previous two months. New homes were sold at a seasonally adjusted annual rate of 858,000 units in March. More...\n• How To Make A Graceful Job Exit• Dow Climbs Above 13,000 For First Time\n                     \t\t\t\t\t| Watch• Metal Thieves Grow Brash• More StoriesEntertainmentRosie O'Donnell Leaving \"The View\"\n\"We couldn't come to terms with my deal with ABC, so next year I'm not going to be on 'The View,' \" Rosie O'Donnell said Wednesday\n                        after announcing her departure from the show. More...\n• Opening Statements Begin In Spector Case\n                     \t\t\t\t\t| Watch• Team Gives Gift To Child Hit In End Zone\n                     \t\t\t\t\t| Watch• Alec Baldwin Leaves Talent Agency• More StoriesOpinionIran's Nukes No Match For Sanctions\nIran's elite, who have influence over nuclear-or-else President Ahmadinejad, dread economic sanctions; thus the U.S. and its\n                        allies would be best off pursuing these if they want to avoid a Middle East arms race, explains The New Republic. More...Watch: Iran Expands Nuclear Program\n• Give Progress A Chance In Iraq\n                     \t\t\t\t\t| Watch• Being No. 1 Is Over-Rated• Russia's Tragic Hero\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Jessica Lynch Sets Record Straight\nOn Tuesday, former Army Pvt. Jessica Lynch testified in Washington about the real story of her capture and rescue while serving\n                        in Iraq. She spoke before the House Government Reform Committee along with the family of fallen Army Ranger Pat Tillman. \n                         More...Watch: Lynch Discusses False Heroism\n• EARLY SHOW: Team Gives Gift To Child Hit In End Zone\n                     \t\t\t\t\t| Watch• ShowBuzz: People In Hot Water: Opening Statements Begin In Spector Case\n                     \t\t\t\t\t| Watch• EARLY SHOW: Wedding In A Week\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nPandas Ready For Hong KongCBS News RAW: Two pandas are being sent to Hong Kong as a gift from the Chinese government, as part of the 10th anniversary\n                                    celebrations of the former British colony's return to China.\nTOP VIDEOS\nCho Fired More Than 170 Rounds\nMcCain Announces Candidacy\nQuestions Remain At Va. Tech\nRodent Visits 'The Early Show'\nDow Jones Crosses 13,000 Mark\nMotive Sought At Virginia Tech\nYeltsin Laid To Rest\nStopping Identity Theft\nTexas Tornado Kills 5\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesAmid the debate whether life in Baghdad is getting better, Lara Logan meets ordinary Iraqis to find out. Sunday at\n                           7 p.m. ET/PT.\n                        48 Hours MysteryNightmare In Napa:A surprising murderer is unmasked in the Halloween killings of two young women. Bill Lagattuta\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}