{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nRisk Management 101: Managing Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nEPRI's Value \n\t\t\tand Risk in Energy Markets - Introduction & Principles\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (Jun. 15, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 15, 2007\n\n\nJun 15, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for June 15, 2007  \n\n\n\nFirst Enercast Featured Articles for June 15, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nJun 15, 2007 PowerMarketers Industry Publications\n\n\n\nInternational Community Pressures Bush (EnergyBiz Insider - Jun. 15, 2007)\n\n\n\nEnergyBiz Insider - Jun. 15, 2007 - The United States is trying to calm the waters that separate it from most of the rest of the industrialized world over the issue of global warming.\n\n\nJun 15, 2007 PowerMarketers Industry Publications\n\n\n\nManaging the Risk of ETRM Implementations (UtiliPoint.com - Jun. 15, 2007) \n\n\n\nUtiliPoint.com - Jun. 15, 2007 - Last month UtiliPoint completed a &#8220;snapshot&#8221; survey of companies which had recently completed ETRM implementation projects.\n\n\nJun 15, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nEnergy expert urges efficiency over adding capacity\n\n\n\nJun. 14--Global climate change is affecting American business, and more companies are starting to do something about it, according to an energy expert who spoke in San Antonio on Wednesday.  Hunter Lovins, president and founder of National Capitalism Inc., a Colorado-based nonprofit organization, said if the nation continues on its present path and uses more coal and builds more nuclear plants to ...\n\n\nJun 14, 2007 Knight Ridder Tribune Business News\n\n\n\nUtility finds fewer pipe issues\n\n\n\nJun. 14--About a quarter of Columbia Gas customers surveyed have a type of pipe known to leak natural gas, a state-requested inspection shows.  That's a slightly smaller percentage than the company predicted in February, the utility said yesterday. Columbia expected to find about 400,000 of its 1.3 million customers -- a little more than a third -- with potentially faulty pipes.\n\n\nJun 14, 2007 Knight Ridder Tribune Business News\n\n\n\nTexas wind farm would be largest\n\n\n\nJun. 14--Dallas oilman and investor Boone Pickens wants to build the world's largest wind farm in the Texas Panhandle, a project that would put as many as 2,000 turbines on nearly 200,000 acres in four counties.  Pickens' Mesa Power presented its plans to about 250 landowners and their representatives Tuesday in Pampa, about 50 miles northeast of Amarillo, said Mike Boswell, a Mesa official.\n\n\nJun 14, 2007 Knight Ridder Tribune Business News\n\n\n\nGroup will pay slightly more for TXU than estimated\n\n\n\nJun. 15--TXU Corp. filed documents Thursday that put a slightly higher price on the planned buyout of the Dallas-based power company and detailed the participation of the various private-equity groups, investment bankers and lenders involved in the deal.  The investment group seeking to buy TXU will pay $46.7 billion for the state's biggest electric utility, compared with the previous estimate of ...\n\n\nJun 15, 2007 Knight Ridder Tribune Business News\n\n\n\nOzone could foil economic initiative: High readings threaten bid to lift U.S. sanctions\n\n\n\nJun. 15--Eastern Wisconsin's air quality has been getting better in recent years, but rising ozone levels this spring could jeopardize an important bid by state officials on Thursday to have sanctions against the region removed.  Gov. Jim Doyle announced that the Department of Natural Resources is asking federal authorities to redesignate eight counties, including all of metropolitan Milwaukee, ...\n\n\nJun 15, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nTXU Power Announces \"Largest Ever Voluntary Program\" For Mercury Emissions Controls\n\n\n\n-- TXU Power, a subsidiary of TXU Corp. and Texas Energy Future Holdings Limited Partnership (TEF), the holding company formed by Kohlberg Kravis Roberts & Co. (KKR), Texas Pacific Group (TPG) and other investors to acquire TXU Corp., announced today plans to install new activated carbon sorbent injection systems (SIS) at all of TXU's existing coal-fueled generation units to reduce mercury ...\n\n\nJun 14, 2007 Industry Week\n\n\n\nAEP backs greenhouse gas program\n\n\n\nWeb Tools: By Mark Williams The Associated Press COLUMBUS, Ohio - American Electric Power is starting the nation's first large-scale program to convert greenhouse gas from livestock manure into a form that contributes less to global warming. AEP, one of the nation's largest power generators, announced on Thursday an agreement with an affiliate of Environmental Credit Corp.\n\n\nJun 15, 2007 Charleston Gazette\n\n\n\nHome pack plan faces chaos, say surveyors\n\n\n\nPlans to introduce Home Information Packs should be scrapped, property experts will tell ministers today. The controversial project is 'unworkable, unenforceable and unfair', says the Royal Institution of Chartered Surveyors. They will tell Communities and Local Government Secretary Ruth Kelly that the regime being phased in from August is riddled with loopholes and can only disrupt the 'fragile' ...\n\n\nJun 15, 2007 Evening Standard\n\n\n\nBiofuel Energy trading starts slow\n\n\n\nBiofuel Energy made its Nasdaq debut today without much of a pop, trading below its IPO price for a portion of the session. The Denver-based energy company is raising money to build six ethanol plants in a partnership with Cargill. Two are already under way in Minnesota and Nebraska. (None is in Colorado.) But the company had to scale back its expectations for the offering.\n\n\nJun 15, 2007 Rocky Mountain News\n\n\n\n\n\nSouth Carolina Electric & Gas Company Files for Increases to Customer Rates\n\n\n\n/PRNewswire-FirstCall/ -- South Carolina Electric & Gas Company (SCE&G), principal subsidiary of SCANA Corporation (NYSE: SCG), today filed an application with the Public Service Commission of South Carolina (PSC) requesting a 6.75 percent overall increase in retail electric base rates. In a separate application also filed today, the company requested a 1.33 percent overall increase to its retail ...\n\n\nJun 15, 2007 PR Newswire\n\n\n\nSouthern Star Announces Non-Binding Open Season for Highland Trails Pipeline Project\n\n\n\nSouthern Star Central Gas Pipeline, Inc., as agent for Southern Star Central Corp., announced today that it is developing a new interstate natural gas pipeline project that will connect the developing Fayetteville Shale production basin in Central Arkansas to Kinder Morgan's Rockies Express Pipeline, LLC (REX) in Audrain County, Missouri. Southern Star's Highland Trails Pipeline project is ...\n\n\nJun 15, 2007 PR Newswire\n\n\n\nFENOC responds to NRC on Davis-Besse reports\n\n\n\nAKRON, Ohio, June 14 /PRNewswire-FirstCall/ --FirstEnergy Nuclear Operating Company (FENOC) yesterday filed with the Nuclear Regulatory Commission (NRC) a response to the commission's Demand for Information (DFI) issued May 14, 2007. The demand is related to recent reports prepared for arbitration of an insurance claim for replacing the damaged reactor head at the company's Davis-Besse plant in ...\n\n\nJun 14, 2007 PR Newswire\n\n\n\nNevada Power Company and Sierra Pacific Power Company Commence Tender Offers for Debt Securities\n\n\n\nLAS VEGAS, June 15 /PRNewswire-FirstCall/ -- Nevada Power Company and Sierra Pacific Power Company, two wholly-owned subsidiaries of Sierra Pacific Resources (NYSE: SRP), announced today that each has commenced a tender offer for the entire principal amount outstanding of certain series of their respective General and Refunding Mortgage securities.\n\n\nJun 15, 2007 PR Newswire\n\n\n\nRendell Administration Voices Concerns Over Proposed Electric Transmission Corridor\n\n\n\nFederal Energy Department's Designation, FERC Ruling Will Undermine States' Rights, Possibly Lead to Unnecessary Transmission Lines Says DEP Official PITTSBURGH, June 14 /PRNewswire-USNewswire/ -- If the U.S. Department of Energy is allowed to designate a large area of Pennsylvania and the Northeast United States for transmission lines, a Rendell administration official said today such a ...\n\n\nJun 14, 2007 PR Newswire\n\n\n\nPrimary Energy Recycling Corporation Announces an Amendment to its Credit Agreement and Completion of the North Lake Turbine Outage\n\n\n\nOAK BROOK, IL, June 15 /PRNewswire-FirstCall/ - Primary Energy Recycling Corporation (TSX: PRI.UN or the 'Company') today announced that it has entered into an amendment to the Primary Energy Operations LLC Credit Agreement that provides temporary relief under certain financial covenants and that its North Lake Energy facility has returned to service. Effective June 13, 2007, Primary Energy ...\n\n\nJun 15, 2007 PR Newswire\n\n\n\nEarth Biofuels Outlines 2007 Growth Plan\n\n\n\nDALLAS--(BUSINESS WIRE)--Members of the Earth Biofuels, Inc. Board of Directors (OTCBB:EBOF) met to review operating results and expectations, and then affirmed the Companys 2007 plan for sustainable growth. The Board-approved plan presents, in managements opinion, an achievable path to profitability for the Company and its U.S. focused biofuels and alternative fuels businesses.\n\n\nJun 14, 2007 Business Wire\n\n\n\nMassey Energy Announces Resignation of Daniel Loeb and Todd Swanson From Its Board of Directors\n\n\n\nRICHMOND, Va., June 14 /PRNewswire-FirstCall/ -- Massey Energy Company (NYSE: MEE) today announced that Daniel S. Loeb and Todd Q. Swanson of Third Point, LLC resigned from its Board of Directors effective as of June 13, 2007. Messrs. Loeb and Swanson announced their resignation in a letter dated June 13, 2007 addressed to Don L. Blankenship, Massey's Chairman and CEO.\n\n\nJun 14, 2007 PR Newswire\n\n\n\n\n\nOntario encouraging more small energy producers to add power to grid\n\n\n\nTORONTO (CP) - With the start of summer approaching and demand for power on the rise, Ontario is trying to encourage more small-scale energy producers to add power to the grid. Energy Minister Dwight Duncan says three new programs will help reduce barriers so small energy-generation projects can get online. He says Ontario is leading the way in North America by paying a premium to those that ...\n\n\nJun 14, 2007 Canada.com\n\n\n\nPower price hike to fund Qld grid upgrade\n\n\n\nQueensland power bills are set to rise after the Australian Energy Regulator (AER) approved a $2.6 billion upgrade for the state's electricity grid. It is expected to add about $4 a year to residential energy bills but the costs are likely to be much higher for businesses. Prices could rise further, with an announcement expected early next week from the Queensland Competition Authority on ...\n\n\nJun 15, 2007 ABC Online\n\n\n\nCNG-station owners cry over proposed 6% income tax\n\n\n\nKARACHI: The Compress Natural Gas (CNG) Station owners have termed the newly proposed six per cent income tax as irrational and undue, demanding that the Central Board of Revenue (CBR) devise a formula of income tax collection to be implemented in the fiscal year 2007-08. The two companies namely Sui Southern Gas Company Limited (SSGC) and Sui Northern Gas Limited (SNGL) supply raw gas to CNG ...\n\n\nJun 14, 2007 Daily Times\n\n\n\nSuperior Plus to sell electricity contracts in Ont.\n\n\n\nCALGARY (CP) - Calgary-based Superior Plus Income Fund (TSX:SPF.UN) plans to start selling fixed-price electricity to Ontario consumers via a three-year supply deal with Bruce Power LP.  Under the arrangement announced Wednesday, Superior will sell power to customers on contracts running up to five years. The trust said the deal between its subsidiary, Superior Energy Management Electricity, and ...\n\n\nJun 15, 2007 Canoe Money\n\n\n\n$4.4 billion sweetener revives immigration bill\n\n\n\nWASHINGTON (CNN) -- Just a week after an immigration reform bill appeared to stall on the Senate floor, Senate leaders reached a bipartisan deal Thursday evening to bring it back for consideration as early as the end of next week. Senate Majority Leader Harry Reid and Minority Leader Mitch McConnell issued a joint statement announcing debate on the measure will resume after the Senate finishes ...\n\n\nJun 15, 2007 CNN\n\n\n\nHydro-Qubec accused of price manipulation\n\n\n\nMONTREAL - A Virginia energy trading firm has filed a complaint with the U.S. Federal Energy Regulatory Commission alleging that Hydro-Qubec manipulated electricity prices in the Northeast U.S. power corridor. DC Energy LLC of Vienna, Va., alleges in its complaint that a U.S. subsidiary of Hydro-Qubec engaged in an elaborate scheme apparently set up to immunize it from competition in the New York ...\n\n\nJun 15, 2007 CTV.ca\n\n\n\nUC Rusal Hopes to Expand Aluminum Operations in Jamaica With Coal - Generated Power\n\n\n\nKINGSTON, Jamaica (AP) - United Company Rusal  the world's biggest aluminum producer  said Thursday it has bought two bauxite plants in Jamaica and hopes to expand operations in the Caribbean nation with coal-generated power. UC Rusal's representative in Jamaica, Igor Dorofeev, said the company wants to boost annual alumina production at its Alpart and Windalco plants by building two ...\n\n\nJun 15, 2007 Canadian Business Magazine\n\n\n\nFenoc tells US NRC Davis-Besse vessel head analysis was correct\n\n\n\nFirstEnergy's Fenoc unit on Thursday said its analysis of severe vessel-head degradation at the Davis-Besse nuclear plant was correct and suggestions in a report that the corrosion was occurring at a faster rate than Fenoc had intimated were wrong. In a letter Fenoc sent Wednesday to the US Nuclear Regulatory Commission, Fenoc -- which operates three nuclear plants in Pennsylvania and Ohio -- ...\n\n\nJun 14, 2007 Platts\n\n\n\nIT consultants jump on green bandwagon\n\n\n\nIT research organizations have started weighing in with advice for CIOs, including brief podcasts, market research, and weighty practical guides to cutting data center power costs and emissions. Today's crop of green IT advice includes a free podcast from the Burton Group, market research from Forrester and, today's most imposing offering, a 136-page paid-for report from BroadGroup.\n\n\nJun 14, 2007 ITworld.com\n\n\n\nSynergy Hospitality Looks To Reduce Impact On Environment\n\n\n\nNEW YORK-Synergy Hospitality, the owner of the Holiday Inn Express in Exton, PA, and several other properties, is taking steps to reduce its impact on the environment. According to reports, company President Stephen Field said the lodging group looked at ways it could lesson the detrimental effects of its four area hotels. Synergy worked with NativeEnergy of Charlotte, VT, which funds renewable ...\n\n\nJun 14, 2007 Hotel Business\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nThe Spain Infrastructure Report Can Help You to Quickly Understand the Energy Market Network from a Commercial Perspective\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c59827) has announced the addition of Spain Energy Market Infrastructure Report to their offering. The Spain infrastructure report can help you to quickly understand the energy market network from a commercial perspective. This report provides comprehensive analysis and charts on the gas and ...\n\n\nJun 15, 2007 Business Wire\n\n\n\nItaly Energy Market Infrastructure Report Provides Comprehensive Analysis of the Sector\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c59789) has announced the addition of Italy Energy Market Infrastructure Report to their offering. The Italy infrastructure report can help you to quickly understand the energy market network from a commercial perspective. This report provides comprehensive analysis and charts on the gas and ...\n\n\nJun 15, 2007 Business Wire\n\n\n\nChinese supplier of wind power equipment plans IPO\n\n\n\nHONG KONG: China High-Speed Transmission Equipment Group, the nation's largest maker of gears for windmills, is seeking as much as 2.12 billion Hong Kong dollars in an initial public offering, two people with knowledge of the sale said. The company plans to sell 300 million new shares, a 25 percent stake, in Hong Kong at 5.38 dollars to 7.08 dollars apiece, said the people, who declined to be ...\n\n\nJun 15, 2007 International Herald Tribune\n\n\n\nUK Energy Market Infrastructure Report\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c59804) has announced the addition of to their offering. The UK infrastructure report can help you to quickly understand the energy market network from a commercial perspective. This report provides comprehensive analysis and charts on the gas and electricity infrastructure including capacity and ...\n\n\nJun 15, 2007 Business Wire\n\n\n\nUK government outlines future role of utilities\n\n\n\n- The UK government has published a new paper on the responsibilities of regional utilities, in which it has asserted that the future role of household energy suppliers could be as much about helping consumers to cut energy use and carbon emissions as about supplying energy. The new paper 'Household Energy Supplier Obligation from 2011: A Call for Evidence,' outlines the potential role of energy ...\n\n\nJun 15, 2007 Power Engineering\n\n\n\nMove aims to spark UK power market\n\n\n\n- An initiative to create a new system for electricity trading will be launched today (15 June) in an attempt to revive the moribund market for power in the UK, according to the Financial Times. The Futures and Options Association, which represents the derivatives industry, backed by most of Britain's leading electricity companies, is issuing a request for proposals of how the new market would ...\n\n\nJun 15, 2007 Power Engineering\n\n\n\nSignet Solar Chooses Saxony for New Facility\n\n\n\nThe California-based solar module manufacturer Signet Solar broke ground today on its main European factory. The facility, located near the eastern German city of Dresden, will serve as a production line as well as headquarters for research and development. The start-up will invest EUR50 million into the facility that should begin operations mid-way through the year 2008.\n\n\nJun 15, 2007 PR Newswire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}