{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@speedy.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "Napster Set to Launch Over-the-Air Music Subscription Service in Japan", "body": "\n\n\n\n\n\n\n\n\nNapster Set to Launch Over-the-Air Music Subscription Service in Japan\nNTT DoCoMo to Support Service with New Series of Handsets and Will Offer Wireless Customers Integrated Billing of New Napster Service \nLOS ANGELES, April 23, 2007 /PRNewswire-FirstCall via COMTEX News Network/ --  Napster (Nasdaq: NAPS) today announced that the company will soon launch the first deployment of its over-the-air (OTA) music subscription service through Napster Japan, a joint venture between the company and Tower Records Japan, with NTT DoCoMo, Japan's largest wireless carrier.  The service will be the first deployment of Napster's OTA music subscription service and will provide DoCoMo's customers with wireless access to Napster's unlimited listening and downloading music experience with full integration with Napster's industry leading PC-based subscription service. The new Napster OTA service will be available to DoCoMo's iMode subscribers via the soon-to-be-released 904i series of handsets, as announced today in Japan by DoCoMo.   Napster's OTA music subscription service is an extension of the company's award-winning Napster To Go PC service, which enables unlimited downloading and transfer of tracks for one low monthly fee to compatible portable digital music devices and cell phones.  Napster's new OTA subscription functionality will be available to DoCoMo's customers as an extension of the Napster To Go service at no additional cost and will be available to both new and current Napster To Go customers. \"Launching our music subscription product on a wireless platform is a landmark for Napster and we are honored to be delivering this cutting edge innovation with DoCoMo, one of the world's largest and most innovative wireless carriers,\" said Chris Gorog, chairman & CEO of Napster.  \"Napster's mission is to provide consumers with unlimited access to the world's music - anytime and anywhere - and we are proud to announce this latest achievement with our joint venture partner Tower Records Japan.\" In addition to receiving full-length songs directly on their mobile handsets, when subscribers use the Napster To Go OTA service to download songs without connecting to a PC those tracks will be \"bookmarked\" and added to their PC collection.  Further integrating the PC and OTA experience, users of the Napster To Go OTA service will be able to view Playlists available on the PC and download them directly to their handsets over-the-air.  Users of the 904i series of DoCoMo phones will also still enjoy the option of side-loading content from the PC onto their phones, as with any other Napster To Go compatible portable music device. In another first, Napster will offer the ability to integrate billing for the Napster To Go service directly into a user's NTT DoCoMo mobile phone bill. 904i series handset users will have the option to sign up for Napster To Go directly through their handsets and select integrated billing at the time of registration. For more information about Napster Japan's services visit www.Napster.jp. About Napster Napster, the pioneer of digital music, offers the ultimate interactive music experience. With an expanding roster of offerings including free, Web- based music listening and sharing, subscription and portable subscription services, and an advanced mobile music platform, Napster creates better ways to discover, share, acquire and enjoy music -- anytime, anywhere. Napster is headquartered in Los Angeles, with offices in Frankfurt, Luxembourg, New York, San Diego, San Jose and Tokyo. Safe Harbor Statement Except for historical information, the matters discussed in this press release, in particular matters related to Napster's relationship with Napster Japan and NTT DoCoMo, and the compatibility of the Napster service with current and future mobile phones, are forward-looking statements that are subject to certain risks and uncertainties such as decreased demand for Napster's products and services; failure of Napster products to interoperate with the hardware products of its customers; intense competition; failure to maintain relationships with strategic partners and content providers; and general economic conditions; that could cause actual results to differ materially from those projected. Additional information on these and other factors are contained in Napster's reports filed with the Securities and Exchange Commission (SEC), including the Company's Quarterly Report on Form 10-Q as filed with the SEC on February 8, 2007, copies of which are available at the website maintained by the SEC at http://www.sec.gov. Napster assumes no obligation to update the forward-looking statements included in this press release. Napster, Napster Mobile, Napster To Go and Napster Light are either trademarks or registered trademarks of Napster, Inc. or its subsidiaries in the United States and/or other countries. All other trademarks are owned by their respective owners. \n    Media Contact:\n    Becky Farina\n    Napster\n    (310) 281-5005\n    Becky.Farina@napster.com\n\n    Investor Contacts:\n    Alex Wellins or Jennifer Jarman\n    The Blueshirt Group, for Napster\n    (415) 217-7722\n    alex@blueshirtgroup.com; jennifer@blueshirtgroup.com\n\nSOURCE  Napster Media, Becky Farina of Napster, +1-310-281-5005, Becky.Farina@napster.com; Investors,\nAlex Wellins, alex@blueshirtgroup.com, or Jennifer Jarman,\njennifer@blueshirtgroup.com, both of The Blueshirt Group, for Napster,\n+1-415-217-7722\nhttp://www.napster.com\n\n\n\n\n\n\n\n\n\n\n You are subscribed to Napster Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n Napster \n 461 S. Milpitas Blvd. , Milpitas, CA 95035\n Service provided by Shareholder.com \n\n\n\n\n\n"}