{"category": "spam", "to_address": "<the00@plg.uwaterloo.ca>", "from_address": "\"Stanislas\" <refn@cistron.nl>", "subject": "It says: \"Flunitrazepam readily dissolves, and once in solution, is colourless, odourless, and tasteless.", "body": "The cream of the crop for 2007 - GET IN EARLY! DSDI IS SET TO ROCK YOUR\nPORTFOLIO!\n\nDSI Direct Sales, Inc.\nSymbol: DSDI\nPrice: $0.04\n\nThere is a MASSIVE PROMOTION underway this weekend! This is hot, read\nthe news and get on DSDI first thing Monday!\n\nCholera is spread by contaminated water and food. In addition, red blood\ncells containing sickle haemoglobin do not live as long as the normal\n120 days and this results in a chronic state of anaemia. Many\nscientists, although not all, believe this process is linked to high\nblood pressure, or hypertension, which in turn is linked to a greater\nrisk of coronary heart disease and stroke.\n\"Banking\" involves attaching the blood vessels of the amputated body\npart to healthy blood vessels surgically exposed at another site - in\nthe case of the Samurai victim, the arm. This can lead to blockages in\nthe vessels, preventing oxygen from getting through to the tissues, and\ncausing severe pain and damage to the organs.\nMost schizophrenic individuals are not violent; more typically, they\nprefer to withdraw and be left alone. Though the illness usually begins\nwith one or more painless but highly infectious sores appearing anywhere\non the body (but usually at the site of infection) this is not always\nthe case. How is schizophrenia treated? Although news and entertainment\nmedia tend to link mental illness and criminal violence, studies show\nthat mentally ill people are no more prone to violence than the general\npublic.\nReducing the temperature of the tissue helps to slow down its metabolic\nrate, so that the cells can go without their usual supply of nutrient\nand oxygen while detached from the blood supply.\nMen and women are affected equally. Many people may hurt themselves\nsecretly for some time before they ask for help, often because of fear\nand shame. The infection can be cured by antibiotics. There is no cure\nfor sickle cell anaemia.\nIt is also important to consult a doctor before considering strenuous\nexercise, and particularly before planning to start a family. If\nnecessary the patient is given fluid, or even a blood transfusion. Set\nup in 1993, the EHA works with other UN agencies and national health\nministries. Warts are found on or around the penis, anus or vagina. The\neffects last for about eight hours.\nSeveral cases report the drug being given to women without their consent\nin order to remove their inhibitions. It also plays a central role in\nthe transmission of electrical impulses in the nerves, and helps cells\nto take up nutrients. It is 10 times more potent. BBC News Online\nprovides details of the most common forms.\nGHB is also known as  liquid X or g-juice, and was once sold in health\nfood stores to bodybuilders. Other symptoms include pain or difficulty\nin passing urine. Similarly, a greater volume of fluid passing through\nthe heart can place additional strain on the organ, increasing the\npossibility of coronary disease.\nExperts suggest this may be because men find it easier to express\nemotions like anger in an outward way or take it out on others.\nOften displaced populations are forced to gather in confined spaces,\nfurther enabling the spread of epidemics, such as cholera, malaria and\ndengue fever.\nHowever, the average intake of salt is between 9g and 10g a day. Organs\nsuch as the liver, kidney, lungs, heart and spleen become damaged,\ncausing severe pain, especially in the bones.\nTests can also identify the haemoglobin type of a baby from about 11\nweeks gestation.\n\n"}