{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 26, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESKey Test Vote On Immigration Looms\nDespite conservative opposition, President Bush appears optimistic about winning Senate approval for immigration legislation\n                        before the week is over. The bill must first pass a key procedural vote today. More...Watch: Bush On Immigration Reform\n• Paris Hilton Gets Out Of Jail\n                     \t\t\t\t\t| Watch• WWE Wrestler And Family Found Dead• Good Weather Helps Fight Tahoe Wildfire\n                     \t\t\t\t\t| WatchU.S.Jessie's Mom Looks Suspect In The Eye\nPatricia Porter, mother of Jessie Davis, tells CBS News she wants her daughter's accused murderer to have a fair trial,\n                        but also wanted him to know she was there in the courtroom. Her grandson, she says, tries to call his mother every day. More...Watch: Jessie Davis' Mom Interviewed\n• WWE Wrestler And Family Found Dead• Good Weather Helps Fight Tahoe Wildfire\n                     \t\t\t\t\t| Watch• Floyd Landis: Champ Or Cheater?\n                     \t\t\t\t\t| Watch• More StoriesWorldMideast Quartet May Appoint Blair An Envoy\nThe U.S., EU, U.N and Russia met in Jerusalem and, among other issues, discussed a new role for outgoing British Prime Minister\n                        Tony Blair. Blair indicated he would do it. Russia's reluctance has delayed the announcement. More...\n• Mexico Suspends Top Cops For \"Trust Tests\"• U.K. Flooding Kills 3, Traps Hundreds• Afghan Opium Production Soars By 49%• More StoriesPoliticsThe Supreme Court Veers Right\nThree 5-4 rulings by the Supreme Court have the White House and the GOP smiling. Rupert Murdoch's China ties under scrutiny.\n                        And why is the U.S. an Internet slow poke? Joel Roberts has the best of the day's headlines. More...Watch: 2008 Election Ads\n• GOP Senator: Iraq Strategy Not Working• Blair Meets Arnold On Last Day In Office• Immigration Deal Irks Some Kennedy Allies• More StoriesHealthCDC: Number Of Uninsured Adults Rises\nThe number of adults without health insurance jumped by 2 million from 2005 to 2006, a new federal report says. Uninsured\n                        Americans numbered 43.6 million last year, according to the U.S. Centers for Disease Control and Prevention. More...\n• Omega-3s May Help Prevent Blindness• Top Spots For Household Bacteria• Cord Blood: To Save Or Not?\n                     \t\t\t\t\t| Watch• More StoriesSciTechProdigious Penguins Populated Peru\nGiant penguins as tall as 5 feet roamed what is now Peru more than 40 million years ago, much earlier than scientists thought\n                        the flightless birds had spread to warmer climes. More...\n• Feds Order At Least 4 Tire Brands Recalled• Tests To Solve Shark Pregnancy Mystery • Freecycling: Something For Nothing Online• More StoriesBusinessFeds Order At Least 4 Tire Brands Recalled\nU.S. safety officials have ordered a New Jersey tire importer to recall as many as 450,000 tires that it bought from a Chinese\n                        manufacturer and sold to U.S. distributors under at least four brand names. More...\n• Home Sales Slow To 4-Year Low• Fired CBS News Producer Sues Network• Americans Donated $295B In 2006• More StoriesEntertainmentParis Hilton Gets Out Of Jail\nA smiling Paris Hilton walked out of a Los Angeles County jail early Tuesday, officially ending a bizarre, three-week stay\n                        that ignited furious debate over celebrity treatment in the jail system.\n                         More...Watch: Paris: A Free Woman\n• Floyd Landis: Champ Or Cheater?\n                     \t\t\t\t\t| Watch• Fired CBS News Producer Sues Network• Lohan Will Be Doing Extended Care In Rehab\n                     \t\t\t\t\t| Watch• More StoriesOpinionChecking The Government\nDespite their historical stigma, government bureaucrats as an entity have checked the overbearing power wielded by the Bush\n                        administration in matters of national security and education, claims the Nation. More...\n• A Liberal \"Unfairness Principle\"• Bring On The Third Party Candidates!• Tracking Down Andy's Lexus\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Recipes: Master Baker Shares Secrets\nElisa Strauss of New York's Confetti Cakes demonstrates on The Early Show how to create cakes to wow all comers. More...\n• EARLY SHOW: Floyd Landis: Champ Or Cheater?\n                     \t\t\t\t\t| Watch• EARLY SHOW: Hot Vacation Fashions• EARLY SHOW: Hydrangea How-To's\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nSoccer Match Turns DeadlyCBS News RAW: Following Tigre's defeat of rival club Nueva Chicago in Buenos Ares, Argentina, clashing fans began to\n                                    riot, killing one man and injuring 14 others.\nTOP VIDEOS\nPygmy Hippo Premieres \nMother Confronts Accused\nParis Liberated\n3 Dead In U.K. Floods\nFresh Ideas For Baking A Cake\nLandis: 'Positively False'\nBush On Immigration Reform\nMandy Moore's License To Hope\nHeavenly Hydrangeas\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesA Rwandan genocide survivor recalls her tale of survival. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMemory Of Murder:Cops say a mother implicated her son in a brutal murder; she says they are dead wrong. Tuesday,\n                           10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}