{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nSaturday, 14 April, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nLive - FA Cup\nWatford face Man Utd at Villa Park in the first of the weekend's FA Cup semi-finals.\n\n\n\n \nArsenal 2-1 Bolton\nCesc Fabregas strikes the winner as Arsenal steal a march on Bolton in the race for a Champions League spot.\n\n\n\n \nMan City 0-0 Liverpool\nAn insipid game sees Man City and Liverpool share the spoils.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nConsistent Els leads at halfway\nErnie Els takes the lead at the midway point of the Verizon Heritage tournament in South Carolina.\n\n\n\n \nBrier hits the front in Shanghai\nAustria's Markus Brier takes the third-round lead at the China Open in Shanghai.\n\n\n\n \nDavies maintains form in Florida\nLaura Davies and Lorena Ochoa share a three-shot lead after round two of the Ginn Open in Florida.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nMassa pips Hamilton to claim pole\nFelipe Massa takes pole position for the Bahrain Grand Prix after a head to head battle with English rookie Lewis Hamilton.\n\n\n\n \nBayliss grabs pole start in Spain\nWorld Superbike champion Troy Bayliss will start on pole in Valencia after holding off the local favourite Ruben Xaus.\n\n\n\n \nClockwatch: Bahrain GP qualifying\nFelipe Massa edges Lewis Hamilton into second place on the grid for Sunday's Bahrain Grand Prix.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nMassa pips Hamilton to claim pole\nFelipe Massa takes pole position for the Bahrain Grand Prix after a head to head battle with English rookie Lewis Hamilton.\n\n\n\n \nClockwatch: Bahrain GP qualifying\nFelipe Massa edges Lewis Hamilton into second place on the grid for Sunday's Bahrain Grand Prix.\n\n\n\n \nHamilton seeks to make F1 history\nLewis Hamilton could make Formula One history by claiming a third consecutive podium finish in Sunday's Bahrain Grand Prix.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nHolmes set to race in Manchester\nDouble Olympic gold medallist Dame Kelly Holmes will take part in the Great Manchester Run.\n\n\n\n \nO'Sullivan winds down in Dublin \nSonia O'Sullivan will make her final Irish road race appearance in Sunday's Great Bupa Ireland Run.\n\n\n\n \nLiu signs up to run in British GP\nChina's Olympic 110m hurdles champion and world record holder Liu Xiang will compete in the British Grand Prix in Sheffield in July.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nCooke's winning run finally ends\nDutch rider Adrie Visser wins the third round of the World Cup, Nicole Cooke edged out in the final sprint.\n\n\n\n \nHammond takes second in Belgium\nBritain's Roger Hammond finished in second place in the Gent-Wevelgem one-day classic in Belgium.\n\n\n\n \nCooke powers to Belgium victory\nWelsh cyclist Nicole Cooke wins the Tour of Flanders to extend her World Cup lead.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nReview of the week\nBack to the future with Life on Mars and Manchester United\n\n\n\n \nHolloway column\n\"I won't be having a bet on the Grand National - I've never met a skint bookie\"\n\n\n\n \nKP's rough guide to Britain\nListen to Pietersen spoof on new Radio 4 show Look Away Now\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}