{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Mike Prager <mike.prager@noaa.gov>", "subject": "Re: [R] The R Book by M. J. Crawley", "body": "\"Pietrzykowski, Matthew (GE, Research)\"\n wrote:\n\n> Hello all-\n> \n> I would appreciate any guidance that can be provided.  \n>I am new to R and am using it exclusively in a statistics \n> program I am undertaking that mainly references\n> Minitab.  My focus is on data modeling and further \n> more multivariate data analysis [...]\n> I I am looking for a reference that has sound statistical\n> foundations with relevant R commands as well as \n> multivariate support.  I saw the new book,\n> \"The R Book\", by Michael J. Crawley and wanted to \n> know what R users thoughts of it.\n\nI can't comment on The R Book, as I haven't seen it. This is to\npoint out some other references for your consideration.  In\norder of most technical to most relaxed:\n\nThe standard reference for many R users is \"Modern Applied\nStatistics with S\" by Venables and Ripley, two important\ncontributors to R.  This has a language introduction and a great\nvariety of statistical material in its 500 pages. Though I\nhaven't read every word, I would not for a nanosecond doubt its\n\"sound statistical foundations.\"  It seems to me that every R\nuser would benefit from having MASS (as it's called) on his\nshelf.\n\nMore relaxed in presentation but still with some multivariate\ncoverage is \"Data Analysis and Graphics using R,\" by Maindonald\nand Braun, also names quite familiar to most R users. This is\nmore typical of a introductory statistics textbook, and shorter\n(about 350 p.).\n\nEven more relaxed but with less breadth of statistical topics is\n\"Introductory Statistics with R\" by Dalgaard, yet another\nfamiliar contributor to R.  This is an excellent introductory\nbook.  After I had been using R for 5 years, I bought a copy and\nlearned several good things immediately. About 270 p.\n\nYou may want to examine those (along with Crawley's) before\nsettling on the what you want to buy.\n\nI hope that helps.\n\nMike\n\n-- \nMike Prager, NOAA, Beaufort, NC\n* Opinions expressed are personal and not represented otherwise.\n* Any use of tradenames does not constitute a NOAA endorsement.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}