{"category": "ham", "to_address": "\"Speakup List\" <speakup@braille.uwo.ca>", "from_address": "\"Georgina Joyce\" <gena-j@bulldoghome.com>", "subject": "The gnome and orca interface - was: About Ubuntu", "body": "Hi\n\nI'd replied to this thread but hadn't trimmed the message so it never\ngot out on the list, so here's another go!\n\n\nWell, I can't comment on the accessibility question.  Attempting to run\nbefore you can walk is likely to prove unsuccessful.  You should start\nwith being able to navigate around the desktop, dialog boxes, property\nsheets and menus.\n\nMost Windows activity involves using the tab key and the arrows.  Menus\nare pulled down by pressing the alt key with another.  For example, 'f'\nfor the file menu, 'e' for the edit menu, 'very' for the view menu etc.\nBy tapping the alt key and the right curser key, you'll establish what\nthe top menu bar contains.  \\You can pull these menus down to explore\nwhat is in each of these categories.\n\nI think it is the Window manager that provides the keyboard access to\nGnome, which I think is meta-city.  Anyway, when ubuntu is loaded, you\nwill be able to tab between 2 buttons of orca's panel.  You can press\nalt+F2 to request an application by entering it's name in the run dialog\nbox.  Or it is likely you can select it by navigating through menus by\nalt+F1 and then down arrow, when you hear a category you wish to\nexplore, you step to the right and to withdraw to the left.\n\nTo get to a full console you need to press alt+ctrl and the appropriate\nfunction key i.e. alt+ctrl+F1 to get to tty1.  To kill the x / Gnome\nsession alt+ctrl+backspace but the ubuntu live CD will reload a new\nsession, ideal when you get in a mess.\n\nYou can shutdown from the alt+F1 menu but I usually go to a ordinary\nconsole and issue the 3 fingered salute.\n\nGo on, you can't loose with a live CD.  There's nothing to it, tab\narrows oh and not forgetting the enter key to select.\n\nThat's a short introduction but you would really benefit by reading and\nexperimenting yourself.\n\n See: http://live.gnome.org/Orca as a starting point.\n\nHTH\n\n\nGena - Another GNU Linux user!\n\nTel: 01772 380039  Mobile: 07876 502276 \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}