{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Don Armstrong <don@debian.org>", "subject": "Re: help with crafting proper license header for a dual-licensing project", "body": "On Mon, 28 May 2007, Francesco Poli wrote:\n> On Sun, 27 May 2007 14:24:21 -0700 Don Armstrong wrote:\n> > Of course, but the usage of free there is merely an extension of\n> > its actual english meaning.\n>\n> A piece of free software is not \"able to act at will\", nor is it\n> \"exempt from subjection to the will of others\".\n\nThe whole point of free software is that it is \"exempt from subjection\nto the will of others\". Your will does not impeed what I am able to do\nto Free Software, even if you hold the copyright upon it.\n\n> A piece of non-free software belongs to a proprietor, in the sense\n> that a monopoly over it is held by the copyright holder.\n\nProprietary software is typically non-free, but the converse is not\ntrue. There are many pieces of software which are non-free but are\ndecidedly not proprietary. Consider any of the pieces of software in\nnon-free for which the source code is available.\n\n> I still cannot see why \"proprietary\" should mean \"with secret source\n> code\": its basic common meaning is \"owned by a proprietor\" and does\n> not refer to closeness or secrecy.\n\nIf we are to use it in that sense, then it is completely meaningless\nin this discussion (unless you plan on distinguishing between PD and\nnon-PD works) as every single copyrightable work has a copyright\nholder, and is therefore owned by a proprietor.\n\n> > Exclusivity is nearly a synonym for proprietary.\n> \n> Yes, exclusivity. When enough actions covered by your exclusive\n> rights are permitted to everyone (as in Free Software), you have\n> really little exclusivity left. That's why I don't think the use of\n> the term \"proprietary\" as a synonym of \"non-free\" should be\n> considered so strange or awkward.\n\nBecause proprietary works are a subset of non-free works, a free work\ncannot also be proprietary. However, a non-free work does not\nnecessarily have to be proprietary. This is why you should not use the\nterms interchangeably.\n\nThis is the same reason why we talk about Free Software instead of\nmerely talking about Open Source Software: a piece of free software\ncannot be closed, but an open work does not necessarily have to be\nfree.\n\n> It's not me. I'm not trying to invent new definitions, as I am not\n> the only one who uses the term \"proprietary\" as equivalent to\n> \"non-free\". Many others seem to do so: one notable example is RMS\n> and the FSF\n\nNeither RMS nor the FSF use proprietary interchangeably with non-free\nto the best of my knowledge. [At least, I've never heard RMS use it\nthat way.] And frankly, even if they did, it wouldn't make their usage\ncorrect.\n\nFeel free to provide citations to back up your claims, though.\n\n\nDon Armstrong\n\n-- \nPersonally, I think my choice in the mostest-superlative-computer wars\nhas to be the HP-48 series of calculators.  They'll run almost\nanything.  And if they can't, while I'll just plug a Linux box into\nthe serial port and load up the HP-48 VT-100 emulator.\n -- Jeff Dege, jdege@winternet.com\n\nhttp://www.donarmstrong.com              http://rzlab.ucr.edu\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}