{"category": "spam", "to_address": "captains@flax24.uwaterloo.ca", "from_address": "\"Tracy Salgado\" <wufesogempab@esogem.de>", "subject": "Stop being obese and unhappy", "body": "\nYou'll love the new, non-obese you\n\n\n\n\n\n\nAnatrim – The newest and most attracting lose flesh product is now easily available – As told on CNN.\n\n\nCan you remember all the times when you told yourself you would do any thing for being delivered from this fastly growing pounds of fat? Happily, now no major price is to be paid. With Anatrim, the ground-shaking pound-melting mixture, you can get naturally health life style and become really thinner. Have a look at what people write!\n\n\n\n\"I hate to confess but I was a junk food addict. \n\n\nI ate all this rubbish \n\n\nand could not stop. \n\n\n\n\nThis misery finished when I started course with Anatrim! \n\n\nGod,\n\n\n\n\n my craving for food vanished, \n\n\nspirits improved and I’m the happiest person 28 pounds in 2.9 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person!\"\n\n\n\n\n\nRita R., Boston\n\n\n\n\n\n\"Since the very childhood I was a weighty boy. \n\n\nYou can't even fancy how I abhorred being derided at school. \n\n\n\n\nI detested the weight and I abhorred even myself. \n\n\nAfter trying this and that I heard about Anatrim. \n\n\n\n\nIt literally took me out of this awful nightmare! A lot of thanks to you, my friends.\"\n\n\n\n\n\nCharley Mock, Boston\n\n\n\n\n\n\"Do you know what? Thanks to Anatrim my marriage was luckily saved! I got into the circle, depression – eating more – even more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nMy friend pointed to your web site and I asked for pack of Anatrim right off. \n\n\nThe results were excellent, my appetite came to acceptable level, I was in good spirits oftener, and, certainly, I tightened my belt with no regrets. And you see me, the sex became fantastic also!\"\n\n\n\n\n\nFrancis\n\n\n\n\n There is a great number of testimonial letters delighted people leave after trying Anatrim. Don’t you wanna join the thousands and thousands of slender men and women and take this original appetite-suppressing energy increasing product now!\n\n\nDon’t miss your opportunity!\n\n\n\n\n"}