{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "Christian Ahlert <ca@openbusiness.cc>", "subject": "[cc-community] Overview of P2P finance", "body": "Hi allby coincidence we just published an overview of P2P finance covering Prosper, Zopa, Sellaband, Kiva and Fundable.http://www.openbusiness.cc/2007/05/20/the-emergent-field-of-p2p-finance/Best--ChOn 20 May 2007, at 03:38, drew Roberts wrote:On Saturday 19 May 2007 09:52 pm, Christopher Budnick wrote: Thank you so much for the info. Do you know if they have any fundingideas / experiments going on? I would be happy to throw ideas aroundalong those lines. Essentially the way we're handling it now is with allowing the bandsto handle a lot of the monetizing themselves. We release the musicourselves through multitude venues (local stores which play the musicand give away or sell CDs, priority radio time set aside for freemusic by college stations, distributed through our website and onother review sites) and promote and hold shows for the bands under ourlabel. We have a small amount of seed money from successful showswe've had and initial funding that I and a few others have provided.With that we're pressing limited runs of vinyl and cd-rs to give tothe band for free. in turn, the band sells them at their shows and ontheir website and keeps all of the money from any sales with noobligation to pay us back. If they'd like more materials, we're happyto order them, and this is just the first sort of experiment in how tofund the creation of free music.The studio time is donated to us by college radio stations (theyobviously have a vested interest, both in charter andself-preservation, in 'funding' free content) and the production istaken care of by the recording artist, a tech at the station, or anindependent producer/company that has donated us time.We've been able to involve /a lot/ of larger named bands, partially aswe're curating music to be distributed with the first shipments ofOLPCs as part of their free content packages. Thank you for this information. I will give it further thought. bestChristopher (typically a lurker) all the best,drew-- (da idea man)_______________________________________________cc-community mailing listcc-community@lists.ibiblio.orghttp://lists.ibiblio.org/mailman/listinfo/cc-community  Christian Ahlertca@openbusiness.cc "}