{"category": "ham", "to_address": "Michael Poole <mdpoole@troilus.org>", "from_address": "Kern Sibbald <kern@sibbald.com>", "subject": "Re: Bacula: GPL and OpenSSL", "body": "On Friday 08 June 2007 00:54, Michael Poole wrote:\n> Kern Sibbald writes:\n> \n> > On Thursday 07 June 2007 19:00, Michael Poole wrote:\n> >> \n> >> Debian generally distributes OpenSSL logically near the packages that\n> >> dynamically link against it, so the major system component option is\n> >> not available to Debian (\"... unless that component itself accompanies\n> >> the executable\").\n> >> \n> >> GPL section 3(a) also uses \"accompany\" in a way that Debian and others\n> >> interpret to include distribution in the same directory tree on a\n> >> particular server, so -- the usual line of reasoning goes -- it would\n> >> be inconsistent to interpret \"accompany\" one way at the start of\n> >> section 3 and a different way at the end of section 3.\n> >\n> > Well, the above is total Greek to me.  However, I must say that there is \n> > absolutely no reason why Bacula would every accompany OpenSSL in any sense \nof \n> > the the English meaning of accompany that I am aware of, nor is Bacula in \nthe \n> > same directory tree as any OpenSSL shared object unless you consider \n> > everything is under root thus everything on the server is in the same \n> > directory \"tree\".\n> \n> Bacula and OpenSSL packages are both found on Debian install media and\n> on mirrors.  I am not sure how to define \"accompany\" in a way that\n> excludes that.  In addition, Debian Bacula packages are marked to work\n> with the specific OpenSSL package at the same place (although others\n> are compatible).  GPL section 3 provides three options to someone who\n> wishes to distribute executable binary versions of GPLed works:\n> \n>   3. You may copy and distribute the Program (or a work based on it,\n>   under Section 2) in object code or executable form under the terms of\n>   Sections 1 and 2 above provided that you also do one of the following:\n> \n>     a) Accompany it with the complete corresponding machine-readable\n>     source code, which must be distributed under the terms of Sections\n>     1 and 2 above on a medium customarily used for software interchange; or,\n> \n>     b) Accompany it with a written offer, valid for at least three\n>     years, to give any third party, for a charge no more than your\n>     cost of physically performing source distribution, a complete\n>     machine-readable copy of the corresponding source code, to be\n>     distributed under the terms of Sections 1 and 2 above on a medium\n>     customarily used for software interchange; or,\n> \n>     c) Accompany it with the information you received as to the offer\n>     to distribute corresponding source code.  (This alternative is\n>     allowed only for noncommercial distribution and only if you\n>     received the program in object code or executable form with such\n>     an offer, in accord with Subsection b above.)\n> \n> 3(c) is not available to Debian.  3(b) is prohibitively expensive.\n> That leaves 3(a), with this clarification at the end of section 3:\n> \n>   If distribution of executable or object code is made by offering\n>   access to copy from a designated place, then offering equivalent\n>   access to copy the source code from the same place counts as\n>   distribution of the source code, even though third parties are not\n>   compelled to copy the source along with the object code.\n> \n> This seems to say that \"offering equivalent access to copy [] from the\n> same place\" is one way to \"accompany\", at least in the sense used by\n> section 3 of the GPL.\n> \n> > By the way, just to be clear, I consider all this (not you guys but these \n> > license difficulties) to be a real pain.  As long as the code is Open \nSource \n> > (i.e. I can get it, see it and modify it), I have no problem with it being \n> > linked with Bacula. \n> \n> I think most of the Debian community that has dealt with this shares\n> the sentiment.  I certainly do; it has pushed me to make sure that my\n> (small amount of) encryption-using code can use either OpenSSL or\n> GnuTLS's OpenSSL compatibility mode.\n> \n> Michael Poole\n> \n\nThe bottom line is that this license stuff for a developer such as me is all \nabsurd, and I'm not going to worry about it any longer. \n\nI've decided for the moment to go with a straight GPL v2 license, and if I can \nover time eliminate all the GPL copyrighted code by others, I will switch to \na nice simple license that provides a \"tit for a tat\" clause as Linus calls \nit  (i.e. requires releasing the source if you modify and distribute it).\n\nIn the mean time, I sincerely hope that Debian finds some way to continue \nreleasing Bacula.\n\nRegards,\n\nKern\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}