{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tMONDAY 4 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM KIRSTY WARK\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tOn Newsnight tonight - in the words of Frankie goes to Hollywood - two tribes go to war. Is President Putin simply grabbing the limelight and with it trying to dictate the agenda before the G8 on Wednesday or is this the Cold War revisited? \n\n\nHe's threatened to train his missiles on Europe if America sites its missile defence shield in countries bordering Russia. Are we really in for another Mexican standoff?\n\n\nOne of the big debates at the G8 will be sustainability, and tonight we examine one man's big idea, 'Cool Earth'. Johan Eliasch is a businessman, and Deputy Treasurer of the Conservative Party. He also owns 400,000 acres of the endangered Amazonian rainforest in order, he says, to protect it against logging and create a community reserve. \n\n\nNow through a charity launched tomorrow he's offering us all the chance to personally preserve an acre of the rainforest for £70. I'll be asking him how this all works and whether it's the new colonialism.\n\n\nSIX DAY WAR\n\n\nTomorrow is the 40th anniversary of the start of a war whose reverberations are still being felt in the Middle East. Newsnight looks back at the Six Day War which demonstrated Israel's superior firepower over its Arab neighbours and changed the map of the region. \n\n\nAt the end of this short sharp shock Israel controlled the Gaza Strip, the West bank, East Jerusalem and the Golan Heights. Tonight Jeremy Bowen reports on the war that shaped the Middle East.\n\n\nSee you tonight. \n\n\nKirsty\n\n\nMissed Newsnight Review?\n\nClick here to watch online\n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}