{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Janina Sajka <janina@rednote.net>", "subject": "Re: TTSynth Is Here At Last", "body": "We did what we could to support alsa, but support is via alsa's oss.\nCan't do anything about that because it's hardcoded into ibmtts, and we\ndo not have that source code. However, there were problems running with\nalsa which were fixed some time ago. It was one of the early issues that\nheld us up. There have been lots of issues! \n\nSo, bottom line--you should be able to play sounds while running\nsoftware speech. However, going back and forth between the desktop and\nconsole with the TTSynth drivers may still be problematical.\nFortunately, now that the product is actually available, we're hoping\nthis kind of remaining issue will get worked out fairly quickly, as it\ndoesn't require anything from the actual ibmtts module.\n\nJanina\n\n\nBrent Harding writes:\n> Will this use Alsa so that we don't have to use the odd work arounds if we \n> want to play streams or something while surfing the net? It is good that we \n> finally have Viavoice without the need to buy bulk licensing.\n> \n> ----- Original Message ----- \n> From: \"Shane\" \n> To: \"Speakup is a screen review system for Linux.\" \n> Sent: Thursday, June 07, 2007 2:11 PM\n> Subject: Re: TTSynth Is Here At Last\n> \n> \n> > On Thu, Jun 07, 2007 at 12:40:01PM -0400, Janina Sajka wrote:\n> >>      * IBM's incomparable IBM TTS text to speech (formerly called\n> >>        ViaVoice)\n> >\n> > Only part that matters.  Has anyone developed with this\n> > yet?  Does it come with library headers and is it a later\n> > version than the ibm viavoice previously distributed.  That\n> > version wouldn't link properly against newer libstdc++ and\n> > had issues where it puked if a linked program forked.  Just\n> > wondering if they've resolved these as otherwise it's a\n> > hell of an engine.  Oh also, is the english UK voice\n> > available?\n> >\n> > S\n> >\n> > -- \n> > http://www.cm.nu/~shane/\n> >\n> > _______________________________________________\n> > Speakup mailing list\n> > Speakup@braille.uwo.ca\n> > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> > \n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n-- \n\nJanina Sajka,\tPhone:\t+1.202.595.7777;\tsip:janina@a11y.org\nPartner, Capital Accessibility LLC\thttp://CapitalAccessibility.Com\n\nMarketing the Owasys 22C talking screenless cell phone in the U.S. and Canada\nLearn more at http://ScreenlessPhone.Com\n\nChair, Open Accessibility\tjanina@a11y.org\t\nLinux Foundation\t\thttp://a11y.org\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}