{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "ShowBuzz News <showbuzz_breaking_news-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "In The News: Larry Birkhead, Leeza Gibbons, Snoop Dogg", "body": "\nTheShowBuzz.com\n\n\n\n\n\n\n\n\nHOME | PEOPLE \n      | MOVIES \n      | TV \n      | MUSIC \n      | STYLE \n      | BOOKS \n      | GAMES \n      | COMEDY \n      | THEATER \n      | LIVE \n      RADIO | PHOTOS \n      | VIDEO\n\n\n\n\n\n\nLeeza \n            Gibbons Booted From \"Dancing\"Latest Celebrity Dropped From \n            \"Dancing With The Stars\" Jokes About Wanting A RecountRead \n            Story...\nLarry \n            Birkhead: I'm Dannielynn's DaddyDNA Proves Photographer Is \n            Father Of Anna Nicole Smith's Infant DaughterRead \n            Story...\n\n\nSnoop \n            Dogg Hit With Gun And Drug ChargesRapper Charged With Gun \n            And Drug Counts From Burbank Arrest In OctoberRead \n            Story...\n\n\nFire \n            Destroys Johnny Cash's Nashville HomeAmerican Music Legend \n            Wrote Much Of His Music At Lakeside HomeRead \n            Story...\n\n\nTwo \n            Major Sponsors Drop ImusOffice Supply Chain Staples And \n            Procter & Gamble Pull Ads From Imus' Radio ShowRead \n            Story...\n\n \nWhat we're working \n            on…Justin Timberlake, Larry Birkhead, the \"Perfect Stranger\" \n            premiere, more from Anna Nicole's half-sister and a reunion for the \n            cast of \"The Larry Sanders Show.\" \n\n\n\n\nAdvertisement\n\n\n\n\n\n\"Entourage\" star \n            Adrian Grenier attends Sundance Channel's launch of Robert \n            Redford's \"The Green\" held at the former La Brea Chrysler Jeep \n            showroom on April 9, 2007, in Los Angeles. \"The Green\" is a weekly \n            block of hosted programming focused on the environment. (Photo: \n            GETTY IMAGES/Marsaili McGrath)See More \n            Photos...\nTo \n      unsubscribe or change your subscription options, click \n      here.Contact: Email Administrator, CBSNews.com, 524 W. 57th \n      St., Room 514/1, New York, NY, 10019 Help \n      | Advertise | Terms \n      of Service | Privacy \n      Policy ©MMVII, CBS Interactive Inc. All Rights Reserved. \n  \n"}