{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Camille Haas\" <cijemailmessagingjaq@emailmessaging.net>", "subject": "Get your ideal weight with this natural method", "body": "\nHealthy living with less fat\n\n\n\n\n\nAnatrim – The very up-to-date and most fascinating flesh loss product is now readily available – As were told on BBC\n\n\n\nDid you understand that redundant body kilos kill a plenty of people around the whole world? We know that you hate the ugly look of people like those and the low status they have in society. \n\nOr, maybe, you got no will to withstand a siege of fatal eating habits of yours. If this all sounds familiar, then we got something to propose to you!\n\n\n\n\n\nHere Anatrim comes, the recent product for the reduction of your body’s extra weight. The astounding thing about Anatrim is it improves the quality of your life by soothing your feeling of hunger and giving you better mood. Look at some notes received from our customers:\n\n\n\n\n\n\"It is amazing! \n\n\nInstead of stuffing myself with food and watching TV constantly \n\n\nI became keen on exercise.\n\n\n\n\n\n\n Anatrim got me back on the right path.\n\n\n I have a great form now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nLusia R., Texas\n\n\n\n\n\n\n\"Passive weight reducing was of no help to me. I could not restrain my ravenous appetite. \n\n\nOnce I was told about Anatrim the media by and it brought a great influence on me.\n\n\n I had tried using it, and my wife said to me that I look very good now, 3 months later. \n\n\n26 pounds have gone away and I keep still losing them! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nRikky Martin, Washington\n\n\n\n\n\nAnatrim helps your brain to understand that you got no such great need for the constant eating. It raises your spirit, provides you with energy, and attacks needless kilos. Great thanks to its mighty comprehensive formula!!\n\n\n\nFind out more on this great product now!\n\n\n\n"}