{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 111", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. FW: for publication/ceremonial objects stolen from the order\n      of Eastern Star (Museum Security Network Mailing list)\n   2. The British and the Benin Bronzes\n      (Museum Security Network Mailing list)\n   3. PARTHENON MARBLES. PM says getting antiquities back is still\n      a priority for Greece (Museum Security Network Mailing list)\n   4. Austria. \"Saliera\"-Prozess wird Ende Juni wiederholt.\n      (Museum Security Network Mailing list)\n   5. Lebanon. Interpol aide ? retrouver une sculpture de\n      l'Antiquit? iraquienne. (Museum Security Network Mailing list)\n   6. usa. Bronze Busts Stolen From Cleveland Gardens.\n      (Museum Security Network Mailing list)\n   7. Antiquities Returned to Greece by Getty Museum\n      (Museum Security Network Mailing list)\n   8. Indianapolis Museum of Art limits its antiquities\n      acquisitions (Museum Security Network Mailing list)\n   9. Chile. Roban corona de oro de la Virgen en templo de Quillota\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Mon, 7 May 2007 08:15:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] FW: for publication/ceremonial objects stolen from the\n\torder\tof Eastern Star\nTo: \nMessage-ID: <004601c7906f$2a1d4780$7e57d680$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\n(this message has been edited by the list moderator)?\n\n\nVan: William Youngworth 3 [mailto:yworth3@msn.com] \nVerzonden: vrijdag 4 mei 2007 13:24\nto: MSN CPPROT\nsubject: for publication/ceremonial objects stolen from the order of Eastern\nStar\n?\n\n?\nI was just involved in the liquidation of the partial contents of an\nHistoric event taking place in Springfield, Massachusetts at the Masonic\nTemple on State street in Springfield. This was an amazing sale however\nduring the middle of the event a customer (and his party)?strayed away from\nthe crowd and got into a back meeting room and stole several important\nobjects belonging to the Order of the Eastern Star. This is a women's group\nconnected to the Masonic order. This sale and theft date was on April 21,\n2007. This is a benevolent society that only does good and I found this vile\nact extremely offensive. (XXXXXXXXXXXXXXXXX) I am certain who did this and\nobserved a certain group participating in this event which was put together\nby Stanton Auctions?of Hamden, Massachusetts. This group's actions were so\nsuspect it caused me to take down some plate numbers all belonging to\nvehicles?with California tags. (XXXXXXXXXXXXXXXXXXXXXXXXXX)??\n\nI was in hopes you would post this with the below listing of the stolen\nitems.\n\n1. Engraved Gavel with brass plate bearing the notation \"Gail A. Gutermann\".\n\n2. Ceremonial dagger/short sword with cross handle, pommel and white enamel\nwork of the Masonic order.\n\n3. 18 various jeweled ceremonial necklaces on 5 colored braided cords. 13\nare hexagon shaped with 5 point stars medallions and 5 are triangle formed.\nAll are clearly marked as belonging to the order of The Eastern Star and all\nhave various symbolic designs engraved on the medallions.\n\n?\nKindly have anyone with information concerning this theft contact the\nfollowing:\nWilliam Youngworth\nMiner Miracles Antiques SSC of\nHistoric Recoveries\n413-426-2396\n?\nThank you so much for your help,\nBilly Youngworth\n\n\n\n------------------------------\n\nMessage: 2\nDate: Mon, 7 May 2007 08:19:20 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The British and the Benin Bronzes\nTo: \nMessage-ID: <005201c7906f$a63eeda0$f2bcc8e0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nThe British and the Benin Bronzes        \nWritten by Darshana Soni     \nSunday, 06 May 2007  \n\nImages:\nhttp://www.afrikanet.info/index.php?option=com_content&task=view&id=626&Item\nid=2\n\n\nThe Kingdom of Benin had a long history of peaceful relations with European\nnations. Many early Portuguese, Dutch and British Visitors had expressed\nadmiration for this great African Civilization. However, just under 100\nyears ago in 1897, the British, fueled by a desire to control trade in the\narea, launched a \"Punitive Expedition\" to attack Benin City. They deposed of\nthe Oba (King) of Benin, burnt down his palace and looted the collection of\nunique art works in Bronze and ivory that adorned the palace.\n\n\nThe premier collection of the priceless Benin art treasures is today held at\nthe Museum of Mankind in London.\n\nThe Events of 1897\n\nJustification for the violent overthrow of this independent kingdom was to\navenge the deaths of seven Britons who had been ambushed who had been\nambushed on a path to Benin a few weeks earlier. They were represented as\npeaceful ambassadors sent to discuss the operation of a trade treaty with\nthe Oba, who were then murdered in cold blood - however, the evidence tells\na different story.\n\nBefore they set out, James Philips, the colonial officer who headed the\nmission, sent a report to his superiors in Whitehall complaining about the\nunprofitability of trade in the area. He recommended;\n\n    \"...I am certain that there is only one remedy, that is to depose of the\nking of Benin...I am concerned that pacific measures are now quite useless,\nand that the time has now come to remove the obstruction ... I would add\nthat I have reason to hope that sufficient ivory may be found in the King's\nhouse to pay the expenses incurred.\"\n\nPhilips sent a message to the Oba informing him of his intention to visit\nBenin and received a reply asking him to delay. his visit for a while due to\nthe customary rites that were being performed at the time, during which\nforeigners were not permitted to enter the city. Philips ignored several\nsuch messages.\n\nIt is not surprising that the generals whose task it was to defend Benin saw\nthis expedition, that had refused to heed repeated request to turn back and\nwait for an official invitation, as a threat. In the recent past the British\nhad used force several times to depose other African leaders whom they had\nfound too powerful to dominate. They responded to this threat by ambushing\nthe party, leaving seven of the nine Britons dead. The British government\nand press responded with self righteous outrage.\n\nThe Benis saw the 1987 event as an evil intrusion to their sovereignty end\nthe annexation of their region by a foreign power as unjustified. The then\nKing, Oba Ovonramwen, was subsequently deposed and sent into exile. Benin\nCity, whose civilization dates further back than the 13th\n\nCentury, was almost completely destroyed. Sacred treasures discovered by the\ncolonial army were stripped from their rightful owners and looted mainly to\nBritain, and later to other countries in the West.\nThe Benin Bronzes Today\n\nWhen the looted art treasures were brought back to England many of the\nmilitary officers kept private collections of them, whilst the foreign\noffice sold considerable quantities, much of which found it's way to museums\nof Europe and America. The remarkable quality of the work was rapidly\nreflected in high auction room prices. The Foreign Office gave the British\nmuseum a huge quantity of Bronze wall plaques which depict the history of\nthe Benin Empire in the 1 5th and 1 6th century. Many are displayed in the\nethnographic section of the museum. The premier collection of these\npriceless Benin art treasures are today held at the Museum of Mankind (\nthere are also many, many more, held in private collections which we do not\nknow about. )\n\nThese Museums also retained selling rights of duplicates to the originals,\nwhich of course means that enormous profits have been made. In 1984,\nSothebys auctioned a Benin plaque featuring a musician in the catalogue\naccompanying the auction, the asking price was set at between ?25,000 -\n?35,000. Many famous European artists, such as Picasso, have emulated the\nfine and abstract dimensional images found in Benin art - however, not a\npenny from this profit has ever gone back to Benin, from where the art was\nstolen. African scholars must by necessity travel to London to see these\nworks displayed without adequate commentary or proper context. The British\nMuseum and London continues to gain income from visitors from Africa and\nelsewhere - this should of course be transferred to Africa. Africa is the\nappropriate place to study and understand African Art and Artefacts and it\nwould also generate much needed income from tourism and scholarship if these\nitems were returned.\n\nThe Nigerian government has made several unsuccessful requests for the\nrestitution of these artefacts, since 1960 when they gained independence. On\nseveral occasions, they paid exorbitant prices amounting to thousands of\npounds to retain possession of some of these artefacts. Great offence was\ncaused when the British Museum and the British Government refused even the\nloan of a single ivory mask for a vast pan-African Arts festival in 1977.\n\nThe looting of artworks in the course of military conflict has been outlawed\nsince the Napoleonic wars and the restitution of looted works within Europe\nenforced. Increasingly, the morality and legality of holding art collections\nseized by force is being questioned. In the true sense of justice and\nself-determination, the Benin artefacts belong to the culture from where\nthey were deprived from - they symbolise a historical and social\nsignificance which the aesthetic and monetary value they hold in exile would\nnever compensate.  \n\nhttp://www.afrikanet.info/\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Mon, 7 May 2007 18:53:34 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] PARTHENON MARBLES. PM says getting antiquities back is\n\tstill\ta priority for Greece\nTo: \nMessage-ID: <002501c790c8$3fd8a4d0$bf89ee70$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nPARTHENON MARBLES\n\nPM says getting antiquities back is still a priority for Greece\n\nThe return of the Parthenon Marbles to Greece from the British Museum is\nstill a \"main target\" for the government, Prime Minister Costas Karamanlis\nsaid on Saturday after viewing a set of recently returned 5th century cups\nthat have been put on display at the Ancient Agora in central Athens. \"I am\nsure that the construction of the New Acropolis Museum, which is now being\nbuilt at a rapid pace, will provide a new, powerful argument to this effort\n[to bring back the Marbles],\" Karamanlis said. Visitors are likely to be\nallowed into the museum some time next year.\n\nhttp://www.ekathimerini.com/\n\n\n\n------------------------------\n\nMessage: 4\nDate: Mon, 7 May 2007 18:53:34 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Austria. \"Saliera\"-Prozess wird Ende Juni wiederholt.\nTo: \nMessage-ID: <002601c790c8$3fefd650$bfcf82f0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\n\"Saliera\"-Prozess wird Ende Juni wiederholt\nDer Prozess um den Diebstahl der \"Saliera\" wird am 26. Juni wiederholt. Das\ngab heute das Wiener Straflandesgericht bekannt. Beim Ersturteil war ein\n\"Schnitzer\" unterlaufen.  \n     \n     \nDer Diebstahl der \"Saliera\" sorgte wochenlang f?r Aufruhr.    Vier Jahre\nFreiheitsstrafe laut Ersturteil\nDer Oberste Gerichtshof (OGH) hatte das Ersturteil vom September 2006 aus\nformalen Gr?nden aufgehoben und eine Neudurchf?hrung des Verfahrens\nangeordnet. \n\nRobert Mang, der mit dem Diebstahl aus dem Kunsthistorischen Museum (KHM)\nf?r Schlagzeilen gesorgt hatte, war bei einem Strafrahmen von bis zu zehn\nJahren zu einer vierj?hrigen Freiheitsstrafe verurteilt worden.  \n     \n     \n    Briefe waren Erpressungsversuch\n\nNach Ansicht des OGH unterlief dem Gericht dabei jedoch ein \"Schnitzer\": Die\nBriefe, in denen Mang L?segeld forderte und f?r den Fall des Nichtbezahlens\ndas Einschmelzen der Saliera androhte, w?ren als Erpressungsversuch zu\nwerten gewesen. Das Erstgericht hatte Mang wegen schweren\nEinbruchsdiebstahls und versuchter N?tigung schuldig gesprochen.  \n     \n    Diebstahl nach Disco-Besuch\n\nLaut Eigenen Angaben war Mang, ein Alarmanlagen-Experte, am 11. Mai 2003\nnach einem Disco-Besuch auf die Idee gekommen, seinen schon l?nger gefassten\nPlan in die Tat umzusetzen. ?ber ein Bauger?st drang der inzwischen\n50-J?hrige ins Museumsinnere vor. Er wusste, dass die R?umlichkeiten\nschlecht gesichert waren. \n\nNach dem gelungenen Coup verwahrte Mang das Salzfass (Wert: mindestens 36\nMillionen Euro) einige Zeit unter seinem Bett, ehe er es in einem Waldst?ck\nbei Zwettl vergrub und brieflich mehrfach L?segeld verlangte.  \n     \n     \n    Tat mit \"Lebenskrise\" erkl?rt\n\nNachdem die Polizei immer n?her an den gesuchten \"Saliera\"-Dieb heranger?ckt\nwar, konnte Mang am 20. J?nner 2006 festgenommen werden. Er f?hrte die\nErmittler zum Versteck der gestohlenen Kostbarkeit und legte ein umfassendes\nGest?ndnis ab. \n\nDie Tat erkl?rte er selbst mit einer \"Lebenskrise\": Neben einer\nKrebserkrankung habe er vor allem den Umstand nicht verkraftet, dass sich\nseine Frau scheiden lie?, um eine neue Lebensgemeinschaft einzugehen.  \n     \nhttp://wien.orf.at/\n\n\n\n------------------------------\n\nMessage: 5\nDate: Mon, 7 May 2007 18:53:34 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Lebanon. Interpol aide ? retrouver une sculpture de\n\tl'Antiquit? iraquienne.\nTo: \nMessage-ID: <002701c790c8$419289d0$c4b79d70$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nLiban : Interpol aide ? retrouver une sculpture de l'Antiquit? iraquienne\nle 07-05-2007 15:05 | ?mis par : Interpol\n\ncat?gorie : Organisations Internationales\n\nth?me : Liban / Arts / Irak\n\nL'?troite coop?ration entre la police libanaise, Interpol et les experts\nitaliens en oeuvres d'art a permis de retrouver une sculpture ancienne\nrepr?sentant un roi arabe, vol?e au mus?e national de Bagdad.\n\nLa police a r?cemment saisi au domicile d'un d?corateur libanais tr?s connu\nune t?te en pierre calcaire du roi Sanatruq I er de Hatra. Apr?s sa\nd?couverte sur un site arch?ologique ? Hatra, la sculpture avait ?t? expos?e\nau mus?e d'Iraq ? Bagdad, jusqu'? sa disparition. Les circonstances exactes\ndu vol n'ont pas ?t? confirm?es.\n\nLa sculpture, d'une hauteur de 47 cm, date du II e si?cle avant J.-C. Elle\nest apparue dans un reportage sur le d?corateur diffus? en juin 2006 par la\ncha?ne de t?l?vision Al-Jazira. Un ?minent sp?cialiste italien de\nl'universit? de Turin ayant particip? ? l'exp?dition arch?ologique d'Hatra a\ncru reconna?tre la sculpture montr?e dans le reportage et en a inform?\nInterpol. \n\nInterpol s'est procur? une copie du reportage, de laquelle il a extrait une\nimage de la sculpture qui a ?t? communiqu?e ? l'arch?ologue en question afin\nqu'il l'examine. Ce dernier a formellement ?tabli l'origine de la sculpture\net a fourni des documents indiquant le num?ro d'inventaire attribu? ? la\npi?ce par le Mus?e d'Iraq.\n\nCes informations ont ?t? transmises le 10 avril 2007 aux Bureaux centraux\nnationaux (B.C.N.) Interpol de Beyrouth et de Bagdad, en vue de l'ouverture\nd'une enqu?te et afin que puissent ?tre prises les mesures n?cessaires pour\nprot?ger la sculpture. La saisie a ?t? op?r?e deux semaines plus tard, et\nl'enqu?te se poursuit.\n\nCette d?couverte n'aurait pas ?t? possible sans contacts ?troits entre le\nSecr?tariat g?n?ral d'Interpol et les experts en oeuvres d'art et sans la\nmobilisation et l'efficacit? des policiers des B.C.N. Interpol.\n\nC'est la deuxi?me sculpture repr?sentant un roi de l'Antiquit? iraquienne\nretrouv?e avec l'aide d'Interpol : une statue sans t?te du roi sum?rien\nEntemena a en effet ?t? retrouv?e en mai 2006 par les autorit?s des\n?tats-Unis.\n\nhttp://www.tv5.org/\n\n\n\n------------------------------\n\nMessage: 6\nDate: Tue, 8 May 2007 07:54:11 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] usa. Bronze Busts Stolen From Cleveland Gardens.\nTo: \nMessage-ID: <002a01c79135$4ce85fe0$e6b91fa0$@org>\nContent-Type: text/plain;\tcharset=\"US-ASCII\"\n\nBronze Busts Stolen From Cleveland Gardens\nBy Staff\nMay 7, 2007\n \nTwo historical bronze busts were stolen from two of Cleveland's Cultural\nGardens while a third artifact was damaged during the theft.\n\nOne of the busts was taken from the city's Hungarian Cultural Garden,\nanother sculpture was removed and a third damaged at the Slovak Cultural\nGarden last week, The Cleveland Plain Dealer reported Monday.\n\nCultural Gardens delegate David Dusek said the thieves took a pair of\nvaluable busts Friday night and damaged a third while removing it from its\npedestal.\n\n\"They went for the good ones ... the bronze,\" Dusek said. \"These are\noriginal pieces.\"\n\nPolice were contacting area scrap dealers in case the thieves try to sell\nthe sculptures for their metal.\n\nThe chairman of the Cleveland Cultural Gardens Federation said the theft\nwill not affect the group's expansion plans. (c) UPI\n\nhttp://www.postchronicle.com/\n\n\n\n------------------------------\n\nMessage: 7\nDate: Tue, 08 May 2007 11:31:43 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Antiquities Returned to Greece by Getty Museum\nTo: Museum Security Network Mailinglist \nMessage-ID: <4640437F.10101@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n*Antiquities Returned to Greece by Getty Museum*\n \nAthens.- Prime minister Costas Karamanlis on Thursday praised the \nculture ministry's systematic work for the return of the Parthenon \nMarbles to Greece, as well as the return of all antiquities illegally \nexcavated and smuggled out of the country, in the effort to safeguard \nGreece's cultural heritage.\n\n\"Defending our cultural heritage using all legal means is a self-evident \nobligation. Claiming from foreign museums and collectors every Greek \nancient artifact for which we have evidence that it was the product of \nantiquities-smuggling, illegal excavation or illegal trade is a matter \nof urgent priority,\" the Greek premier stressed.\n\nKaramanlis was speaking to reporters after a handover ceremony marking \nthe return of two important ancient Greek artifacts from the J. Paul \nGetty Museum in Los Angeles, held at the National Archaeological Museum \nin Athens, where the artifacts will be on display.\n\nThe artifacts are a 4th century B.C. gold funerary wreath from the \nnorthern Greek province of Macedonia and an archaic-era statue of a \n'kore' (young woman) made of Parian marble. They are the last of four \nartifacts returned to Greece by the museum under an agreement announced \na few months ago.\n\nThe agreement with the Getty Museum, where the antiquities were housed, \nwas reached after the Greek government contested the legality of their \nexport from the country.\n\nKaramanlis further said that a bill aimed at curbing the illegal trade \nand smuggling of antiquties would be tabled in parliament by the culture \nministry in the near future.\n\n\"Policy is vindicated when it yields tangible results. Our goals become \naction, day by day,\" Karamanlis added.\n\nThe Greek premier also referred to the completion of the new Acropolis \nMuseum and the return of two fragments of the Parthenon and the \nErechtheum in 2006, noting that these \"dismissed the spurious excuses \nput forward for not returning the Parthenon sculptures\".\n\nSpeaking after the premier, Culture Minister George Voulgarakis \ndescribed the two ancient artifacts retrieved from the J. Paul Getty \nMuseum as \"masterpieces of Greek art\".\n\nThe minister also emphasised the fact that all four items returned by \nthe Getty were given back without any form of exchange and without \nintervention by a court.\n\n\"The era when stolen objects of great value could be bought on the \n'grey' market is gone, never to return,\" Voulgarakis underlined.\n\nHe noted that the deal would allow Greece to claim the things that \nrightfully belonged to it, provided there was proof that it had been \nillegally obtained and exported from the country.\n\nAccording to the minister, meanwhile, the international community's \n\"shift to respecting international law and ethics\" was not incompatible \nwith the \"healthy interests of great museums\".\n\nApart from the golden wreath and the kore, the Los Angeles-based Getty \nmuseum had in August 2006 returned a 4th-century B.C. black limestone \nstele - grave marker - and a 6th-century B.C. marble votive relief from \nThasos that also went on display at the National Archaeological Museum \nin Athens.\n\nThe stele was unearthed during an illegal dig in the 1990s near the city \nof Thebes while the votive relief was stolen almost a century ago from \nthe French Archaeological School warehouse on the Aegean island of Thasos.\n\nhttp://www.greeknewsonline.com\n\n\n\n\n------------------------------\n\nMessage: 8\nDate: Tue, 08 May 2007 11:33:34 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Indianapolis Museum of Art limits its antiquities\n\tacquisitions\nTo: Museum Security Network Mailinglist \nMessage-ID: <464043EE.40209@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nArt museum limits its antiquities acquisitions\nArtifacts removed from their country of origin after 1970 must be \nexported legally, IMA director says\n\nBy Whitney Smith\n\nThe Indianapolis Museum of Art will not buy or accept gifts of ancient \nartifacts that left the country where they were discovered after 1970 -- \nunless there's proof they were exported legally. The decision by IMA \nDirector and CEO Maxwell L. Anderson and the museum's board comes amid \nan at-times acrimonious international debate about black-market \ntrafficking in antiquities that may encourage the plundering of \narchaeological sites.\nThe IMA isn't the only museum struggling with this issue. The J. Paul \nGetty Museum in Los Angeles adopted a policy similar to the IMA's last fall.\nSome government authorities, especially in antiquity-rich Italy, have \ndemanded that artifacts in museums be returned.\nLast year, New York's Metropolitan Museum of Art agreed to return \nobjects allegedly stolen from ancient sites in Italy, in exchange for \nlong-term loans of other objects. Its director, Philippe de Montebello, \nhowever, has made a case that museums should keep acquiring antiquities \n-- generally defined as objects that pre-date the Middle Ages in Europe \n-- even without complete documentation.\nFounded in 1883, the IMA is the nation's fifth-largest encyclopedic art \nmuseum, with more than 50,000 objects, said museum spokeswoman Jessica \nDiSanto. The museum's Asian art collection, including many antiquities, \nis a signature feature.\nAnderson, 51, has been with the IMA for almost a year but has been \npassionate about acquisitions for decades. As a former president of the \nAssociation of Art Museum Directors, he is a well-known figure in the \ndebate.\n\"I've had the unhappy experience of seeing pillaged sites in Italy, when \nI was a curator for the Met in the '80s,\" Anderson said in a phone \ninterview from Washington. \"Tomb robbers are seeing what they want, \npopping open the tombs like soft-boiled eggs, grabbing things and \ndisappearing.\"\nIn 2005, The New York Times quoted him as saying museum directors could \nno longer stand behind old collecting practices. \"The ground is shifting \nradically under the pressure of newly documented claims,\" he said. \n\"While there may not be a single clear solution for every claim, \ninstitutions will need to be forthright in explaining future acquisitions.\"\nAnderson thinks the IMA policy -- which still lets it acquire \nantiquities if they arrived in the U.S. before a 1970 United Nations \nprotocol -- could become part of a growing trend.\n\"It is our hope that the IMA's moratorium will encourage other major \ncollecting institutions around the world to take a similar step, along \nwith collectors and dealers,\" Anderson wrote in this month's edition of \nThe Art Newspaper, published in London. \"A universal moratorium would \nseriously impact the clandestine trade in antiquities.\"\nOne IMA patron agreed that museums must be concerned about an object's \npedigree.\n\"Objects ought to be documented, regardless of the year,\" said \nNorthwestside resident Robert Grubbs, 74, as he stood at a balcony near \nthe IMA's Asian art collection. \"I think, at least, that objects that \nare documented could be marked.\"\n\nCall Star reporter Whitney Smith at (317) 444-6226.\n\nhttp://www.indystar.com\n\n\n\n\n------------------------------\n\nMessage: 9\nDate: Tue, 08 May 2007 11:36:02 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Chile. Roban corona de oro de la Virgen en templo de\n\tQuillota\nTo: Museum Security Network Mailinglist \nMessage-ID: <46404482.6060101@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nRoban corona de oro de la Virgen en templo de Quillota\nLunes 7 de Mayo de 2007\nFuente :El Mercurio de Valpara?so\n\nDesconocidos robaron la corona de oro de la imagen de la Virgen del \nCarmen, ubicada al interior del templo y convento San Francisco de \nQuillota, en pleno centro de la ciudad.\n\nEl hecho se produjo a menos de una semana desde que se concretara la \nsalida de los Franciscanos de la ciudad, lo que no significa que el \ntemplo quede abandonado, ya que se continuar?n oficiando misas hasta el \narribo de una nueva congregaci?n.\n\nSin embargo, esto no fue obst?culo, para que desconocidos ingresaran al \ntemplo en horas de la madrugada, para lo cual rompieron los candados de \nacceso al recinto. Ya en su interior se dirigieron a la gruta ubicada en \nel exterior de la parroquia, donde existen varias im?genes religiosas.\n\nAll? robaron las alcanc?as donde los fieles hacen sus aportes en dinero \ny posteriormente abrieron la vitrina donde estaba la imagen de la Virgen \ndel Carmen, sustrayendo la corona de oro que ten?a en su cabeza.\n\nSeg?n se indic?, la joya tendr?a un valor de m?s de 500 mil pesos y \nhab?a sido donada por la familia Asmad, una de las m?s tradicionales de \nQuillota, en homenaje a la Virgen, por lo que m?s all? del valor \ncomercial, exist?a un valor sentimental en el objeto robado.\n\nLos antecedentes de este robo quedaron en manos de la Fiscal?a de \nQuillota, la que habr?a iniciado las diligencias para dar con el \nparadero de los autores de este delito, sin descartarse la posibilidad \nde recurrir a la im?genes de la c?mara de televigilancia que existe a \nmetros del templo.\n\nOtro caso\n\nEste no es el primer caso de robo que afecta a templos en la comuna de \nQuillota. En febrero de 2005 fue sustra?da la imagen del Ni?o Jes?s que \ncargaba la Virgen del Carmen en la iglesia San Mart?n de Tours.\n\nSe trata de una escultura tallada en madera y de origen quite?o, de unos \n300 a?os de antig?edad. Era la imagen de mayor valor que pose?a la \nc?ntrica parroquia de Quillota.\n\nEl robo de esta imagen caus? gran pesar entre la feligres?a que asiste a \nla iglesia, pues representaba un valor patrimonial y un sello que \ncaracterizaba al lugar. La imagen no cuenta con tasaci?n en dinero, pues \ndicha informaci?n no estaba en conocimiento del sacerdote. La misteriosa \ndesaparici?n del Ni?o Jes?s ha generado la especulaci?n de que esta \nsustracci?n pueda ser un robo por encargo, dada la particularidad del \ndelito y la selecci?n que hizo el ladr?n de la pieza sustra?da. Lo \nanterior, considerando que dentro de la iglesia hay m?s de cinco \nesculturas adem?s de la robada y que el antisocial se inclin? por la de \nm?s dif?cil acceso, ya que se encontraba al lado del altar principal, en \naltura y atornillada a la imagen de la Sant?sima Virgen.\n\nApenas los encargados del templo se percataron del robo, estamparon la \ndenuncia en Carabineros y en la Polic?a de Investigaciones de Quillota. \nSin embargo hasta la fecha no se ha podido dar con el paradero del autor \ndel il?cito, ni tampoco se ha podido recuperar la pieza robada.\n\nhttp://www.lasegunda.com\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 111\n****************************************\n\n"}