{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "China's newest popular export...what is it?  You'll be surprised to know--that's tonight on the CBS EVENING NEWS WITH KATIE COURIC", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n \n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening \n            News | 48 Hours | 60 Minutes | The Saturday Early \n            Show | CBS Sunday \n            Morning | Face The \n            Nation\n\n\n\n\n\n\n(CBS) QUOTE OF THE DAY\n“Give a man a fish and he will eat for a day. Teach a man to fish \n      and he will eat for a lifetime. Teach a man to create an artificial \n      shortage of fish and he will eat steak.” - Jay Leno \n\nDID YOU KNOW? A fetus acquires fingerprints at the age of \n      three months. \n\nTONIGHT ON THE CBS \n      EVENING NEWS Here's an early look \n      at what we are working on for tonight's broadcast of the CBS Evening News \n      from Anchor and Managing Editor, Katie Couric Hi everyone, \n      With wildfires ravishing the Southeast, a blaze that’s torched a \n      Los Angeles park, a tropical storm lingering off the East Coast and \n      massive flooding in the Midwest, the story of the day is nature’s fury \n      being unleashed on the United States. Cynthia Bowers will \n      report from Missouri, where riverside towns are under several feet of \n      water after at least 20 levees were overtopped, resulting in the worst \n      flooding in more than a decade. The deluge that caused the \n      flooding is a remnant of the storm system that leveled the town of \n      Greensburg, Kansas. President Bush toured the destruction in Greensburg \n      today and Hari Sreenivasan will have that story. On the \n      West Coast, a wildfire is threatening Los Angeles landmarks, including a \n      park's famed conservatory and zoo. Sandra Hughes will have that \n      report. And Bianca Solorzano is on the other side of the country \n      reporting on the massive fires that are working their way through southern \n      Georgia to the northern border of Florida. Meanwhile, Vice \n      President Dick Cheney is in Baghdad, on a surprise stop to urge Iraq's \n      warring factions to find more common ground. Mark Strassmann is \n      there and will have our report. What's the newest popular export \n      from China? Its language. American students are learning Mandarin in \n      droves, and it's becoming a popular subject in schools from Maryland to \n      Washington state. Barry Petersen will report on the programs and \n      their wide appeal in America. Finally, we’re going to introduce \n      you to a poet whose services reach an unusual market – the supermarket. \n      Zach Houston hawks his wares, commissioned poems, outside of grocery \n      stores in Berkeley, California. He may not be a Wordsworth, but what comes \n      out of this wordsmith’s typewriter just might surprise you. John \n      Blackstone will have the story. I hope you’ll join us, \n      Katie For more on two of the stories noted above, please \n      click on the following links... Failing Levees Spur Major \n      Missouri Floods Click Here Bush Tours Town Wiped \n      Out By Tornado Click Here Here's a look at one \n      of the stories we are working on for Thursday's broadcast of the CBS \n      EVENING NEWS...A quality-of-life decision for women -- stay on the \n      CAREER track .. OR, \"opt out\" of work .. to raise a family. We'll look at \n      whether it's REALLY a matter of choice. That story and much more on \n      Thursday night's broadcast of the CBS EVENING NEWS. If you would \n      like more information on any of these stories or the broadcast, please \n      click on the following address and e-mail us: evening@cbsnews.com \n      \n\nTONIGHT ON DAVID LETTERMAN Join Dave tonight on \n      The Late Show with actress Lindsay Lohan \n      AND comedian Tom Dreesen… Plus, musical guests The Kooks! \n\nTHURSDAY MORNING ON THE EARLY SHOW Harry Smith, \n      Hannah Storm, Julie Chen and Russ Mitchellanchor \n      THE EARLY SHOW from New York. Dave \n      Price will bring us the weather. Along with the top news of \n      the day, we will also have the following stories: OBSESSIVE \n      LOVE WITH DR. PHIL: On his talk show, Dr. Phil dishes out tough love. \n      His latest series takes a look at love to the extreme. Obsessive love when \n      loving someone includes jealousy and obsessive tendencies. Dr. Phil tried \n      to help one husband who is very obsessive of his wife of eleven years. \n      Thursday morning, Dr. Phil will join us with advice if you or someone you \n      love has taken things a bit too far. CSI WEEK: CSI SET \n      VISIT: This season of CSI has given us everything from a Big \n      Romance between Grissom and Sara... to a so-called \"Miniature Killer.\" All \n      season long, the killer left-behind a scale-model miniature of the crime \n      scene. The cast told our own Julie Chen that those models were as \n      fascinating for them as they were for the fans. Thursday morning, we’ll \n      have a preview of the big season finale from stars Marg Helgenberger and \n      William Petersen! MOTHER’S DAY EDITION OF MONEY MATTERS: In \n      honor of mother’s day, financial expert Ray Martin will join us \n      with tips. If you are a stay at home mom, how can you be sure you are \n      making the most of your dollar? And for working moms, how can you maximize \n      your pay and keep everyone at home healthy and happy? Thursday morning, \n      Ray will have advice for every type of mom. CAN TOYS MAKE YOUR \n      BABY SMARTER?: Educational videos, music, flash cards, computer \n      programs, toys that beep, talk and light up - there's no shortage of \n      products designed to transform our infants and toddlers into little \n      geniuses. But, investigative journalist Susan Gregory Thomas believes that \n      these products may not deliver what they promise. She has written about \n      them in her new book, Buy, Buy Baby and will join us Thursday \n      morning with advice. MITCH ALBOM PICKS THE WINNING MOM \n      ESSAY: Last month, author of For One More Day, Mitch Albom, \n      joined us to launch a contest about the Times Mom Stood Up For Me timed to \n      coincide with mother’s day. The top ten finalists were picked, and now \n      Albom has chosen the winner. Thursday morning, Albom will join us to \n      reveal the winner. The winner will receive a seven-night cruise vacation \n      for two from Royal Caribbean International. WILLIAMS SONOMA \n      MOTHERS DAY LUNCH: What better way to feed mom than with a perfect \n      menu of things she'll love: blue cheese in a fondue, a light chicken \n      salad, and a creamy fruit dessert. Our friend and cookbook author Tori \n      Ritchie will show us a lunch that is sure to please mom. If \n      you would like more information on any of these stories or the broadcast, \n      please click on the following address and e-mail us: earlyshow@cbs.com \n\nTO SUBSCRIBEClick here to subscribe to \n      the Inside Scoop.TO UNSUBSCRIBEUnsubscribe information \n      is included in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, \n      click here.Contact: Email Administrator, \n      CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n      10019Help | Advertise | Terms of \n      Service | Privacy \n      Statement©MMVII, CBS \n      Interactive Inc. All Rights Reserved. \n\n"}