{"category": "spam", "to_address": "manager@speedy.uwaterloo.ca", "from_address": "Elliot Navarro <uhvd@worldnet.att.net>", "subject": "willing monopoly", "body": "\n\n\n\n\n\n\nQualcomm has hit Nokia with a law suit at the American Arbitration\nAssociation.\nIn effect, KDDI will become an MVNO in North America sharing Sprint's\nnetwork in much the same way Virgin already does. (I realise you\nmentioned that they were rumours, and I want to confirm to you that they\nare indeed rumours. He let slip, however, that Nokia might have patents\non DVB-H that rival handset vendors have overlooked.\nThe provision of broadcast TV to mobile phones is currently a minimum of\na three horse race.\nIf a cellular handset can support WiFi, then why not offer a VoIP client\nto provide access to Internet telephony? Rumours are suggesting that\nKKDI will get together with fellow cdmaOne operator, Sprint Nextel, to\noffer a mobile phone service in the USA.\nSingh, which effectively admits to spin.\nKDDI will apparently rely on handsets produced by Sanyo. Sun said more\ndetails surrounding the deal will be announced at the annual JavaOne\nconference being held in San Francisco on May 8th-11th 2007. The service\nis clearly targeted at the many Japanese speakers living in the States.\nSun said more details surrounding the deal will be announced at the\nannual JavaOne conference being held in San Francisco on May 8th-11th\n2007.\nA spokesman for Orange confirmed to Mobile Insight that his company had\nindeed requested that Nokia shouldn't preload the Internet telephony\ncapability. As Mobile Insight has pointed out before, the trouble stems\nfrom Indian law which prevents more than a 74 per cent holding in an\nIndian telecommunications company by a foreign company. Nokia's attitude\nis clear.\nUnlike PC owners, a mobile phone user doesn't really expect the handset\nto take more than 60 seconds to boot up.\ncom on your mobile  Search  Other Versions You can also view 3G Insight\non your mobileWeb site addresses of mobile versionsView the WAP 2.\n(I realise you mentioned that they were rumours, and I want to confirm\nto you that they are indeed rumours.\nKDDI will apparently rely on handsets produced by Sanyo. Essar owns 33\nper cent. 0 version (What is RSS?\nAs far as Mobile Insight can ascertain, the S20 is the only commercially\navailable Savaje handset.\nHe claimed that the move wasn't deliberately aimed at stopping Internet\ntelephony, rather that there hadn't been sufficient time to test the\napplication thoroughly. It is also the technology of choice for the\nEU.\nAll you need is WAP or XHTML support to view them. The scheme has been\nsuccessfully trialed in Jackson's Hull where the redemption rate was\naround 20 per cent compared to a norm of around two to four per\ncent.\nIt plans a tie up with Sprint Nextel.\nThe snag is that Mobile Insight found the software - which admittedly is\nstill in Beta - was extremely flakey. \"First of all,\" he notes, \"while\nthere are rumours that the mobile phone unit may be sold off, they are\nsimply rumours at this point, and we have not announced anything to that\nnature.\n0 handsets to the very latest smartphones. Nokia's attitude is\nclear.\nIt plans a tie up with Sprint Nextel. It is also the technology of\nchoice for the EU.\n\n\n"}