{"category": "ham", "to_address": "\"'Marshall Van Alstyne'\" <marshall@MIT.EDU>, <cc-bizcom@lists.ibiblio.org>", "from_address": "\"Ryan Schultz\" <theoryshaw@yahoo.com>", "subject": "Re: [Cc-bizcom] an alternate licensing option where the 'community'\n\tdetermines value-not the contributors", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\nThanks Marshall for the feedback.  If at all\ninterested, I rewrote and tried to clarify my argument for finding this\nalternative, community-based CC license. \nhttp://studiowikitecture.wordpress.com/2007/05/11/win-win-ip-rights/\n \nHere’s a quote, from ‘Wikinomics:\nHow Mass Collaboration Changes Everything’ that I feel really sums up\nthis approach:\n \n“The interesting model\nis the one that falls in the middle ground—a model that says we’re\ncollaboratively building something that will be privately owned by our\nconsortia, or maybe your shares of ownership are apportioned in proportion to\nhow much you brought to the table.  One could envision a\n‘digital-age co-op” with peer rating systems that dynamically\napportion shares to contributors based on the community’s assessment of\nthe value added by individual contributors.  Annual profits from sales and\nserves could then be distributed across the community of contributors”\n \nRyan\n \n \n\n\n\n\nFrom: Marshall Van\nAlstyne [mailto:marshall@MIT.EDU] \nSent: Tuesday, April 17, 2007 5:14\nPM\nTo: cc-bizcom@lists.ibiblio.org\nCc: Ryan Schultz\nSubject: Re: [Cc-bizcom] an\nalternate licensing option where the 'community' determines value-not the\ncontributors\n\n \nRyan, here are several thoughts based on the questions you raised. \nApologies for a delay, I've been preparing a tenure package and that has\ndominated all other tasks.    Your set of issues around\nNonCommercial and Commercial licenses raise multiple follow up ideas!\n\nAt 03:16 PM 4/17/2007, you wrote:\n\n\nLet’s say I make a derivative work using someone else work\nthat’s under the “NonCommericial” license option and I want\nto commercialize it to make money.  Under this license I have to approach\nthe original licensor to work out a commercial licensing agreement to establish\npayout percentages.  I run the risk, however, that the original licensor\nwill not want to come to a fair and balanced assessment of each other’s\ncontribution.  With this potential risk loaming in the future, I am less\nlikely to even start a derivative work in the first place­there’s\nless initial incentive.  \n\nI think you've nailed one of the biggest problems.  In fact, it seems\nthere are related two sub-problems.  One is hold-up from a single owner --\nin this case the (c) holder -- who will want to negotiate for a chunk of\nvalue.  The other is the cleverness of the idea can be lost if you try to\nnegotiate and accidentally disclose it.\n\nEither way, I agree that these 2 kinds of risk discourage a person from making\nany kind of investment beforehand.\n\n\n\nWhat if, however, there was a New Licensing option­somewhere\nbetween ‘Attribution Non-commercial’ and ‘Attribution No\nDerivatives’­that stated that you are free to pursue commercial gain\nwithout consent, but if the derivative work marks money, the payout percentages\nare assessed by the community and not left up to the individuals and their\nlawyers to determine?  \n\nOne possibility that I like a lot is to use a default menu.  That is,\nsuppose the license has an offer of the following form:\n\nIf you make $x amount of money, then contribute y% of revenue to the original\nwork.\nIf you make $(x+d) amount of money, then contribute (y+n)% of revenue to the\noriginal work.\netc.\n\nAlternatively,\n\nIf you keep your piece closed for x years, then contribute y% of revenue to the\noriginal work.\nIf you keep your piece closed for (x+d) years, then contribute (y+n)% of\nrevenue to the original work.\netc.\n\nThis set of default options lets the person writing the derivative work choose\nbased on a fairly clear set of terms.\n\n\n\nSo in other words, under this agreement the assessment of value\ncontribution is determined by the community and not the individual\nparties.  In this case I can have a little more confidence using someone\nelse work initially, knowing that if my derivative work does indeed make money,\nthat the community’s assessment will mostly likely grant a fair\nevaluation. \n\nThis idea is pretty interesting.  I see at two possible concerns. \n(1) Is that there is still some uncertainty over what the final % will\nbe.  I agree it seems that the \"community,\" however defined, is\nlikely to be more neutral in assessing value but there is still some lack of\nclarity beforehand. (2) Have you thought about how large a community you\nneed?  If it's very small, there may be too few voters to establish a\nmeaningful baseline so there might be a need to build the community first.\n\n\n\n \nWhat is the community in this case?  Well that could take many forms\ndepending on the media and/or mode of distribution.  In the music\nindustry, diehard fans could determine, through some type of ranking system,\nhow each artist should be paid out.  If, however, asking the public to\naudit contribution becomes too overwhelming, there could be a pool of editors\nthat get paid to make these assessments.   This system of editors,\nhowever, would have to be anonymous in a sense, to avoid the possibility of\nbribery or kickbacks.  An additional safeguarding mechanism could be\nutilized were the editors in turn rank each other.  Editors that show an\nunusual high level of bias would be flagged by the community of editors and\nthus facilitate a higher level of consistency.\n\nOverall, this idea sounds quite useful.  A good reputation system can be\nused to \"rate the rater\" and help ensure integrity in the review\nprocess.\n\nThis \"information revelation\" mechanism looks like it should require\na subsidy i.e. some means of compensating the raters for their time and\neffort.  If done well, it could be covered out of the revenues generated\nby the pool of derivative works themselves.\n\nAnother form of information disclosure mechanism could be to have people who\nactually download the derivative work themselves state what % of value the new\npiece adds.  This is harder to \"fake\" since someone must\nactually pay for the good (so if you're going to stuff a ballot box it's going\nto be costly).  It's also unbiased because the person doing the buying is\nnot independent of the person doing the rating.\n\n\n\n \nAlthough I’m sure there’s ways to establish a fair assessment of\nvalue, this licensing system would require a transparency in accounting as well­such\nthat contributors would be assured that all the revenue is accounted for. \nTransparent accounting might be a tall order, but if artists demand it,\nproducers will find a way too oblige.  \n\nThis is also an excellent point.  It has long been an established tenet of\neconomics that more complete information leads to greater efficiency in\nproduction.  Such a system should be as transparent as possible.\n\nNote also that it should also align incentives the right way e.g. no one should\nhave a reason to misrepresent their rating, and the raters' votes should\ncorrespond closely to the consumers' reasons for buying.\n\n\n\n \nAnyways, Just a little food for thought.  Let me know if there’s any\nmajor hurdles I’m not considering in implementing a system like\nthis… just thinking out loud here.\n\nPersonally, I think the questions you raise are very interesting.  Plenty\nof thought munchies here! :-)\n\n\n\n \nIs there any current discussion out there that addresses this idea?  I\ncould not find any. If you could forward, I’d be much appreciative. \n\nThere is some good discussion on the Free Software Business (fsb) discussion\ngroup but aside from that, I've found very little on this topic.  Thanks\nfor raising some interesting issues.\n\nMVA\n\n\n\n \n \nThanks  \n \n \n \n \n \n \n \n_______________________________________________\nCc-bizcom mailing list\nCc-bizcom@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-bizcom\n\n\n\n"}