{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWEDNESDAY 27 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER KAVITA PURI\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\t\"And that is that...the end\". \n\n\nWe devote the whole of tonight's programme to the handover of Prime Ministerial power.\n\n\nDavid Grossman was on the front row of the Commons press gallery for Tony Blair's last Prime Minister's Questions. He witnessed an unprecedented sending off by Blair's fellow Parliamentarians. Combat suspended - for a while at least - the former PM received warm tributes, a standing ovation, as well as many good hearted pats on the back, he even threw in some good jokes. David brings us the definitive account of the final hours of Blair's premiership. \n\n\n\"Let the work of change begin\".\n\n\nMichael Crick started his day at the Treasury and has been watching the equally compelling journey of Zombie Brown's path to Number 10. He'll have the latest news on any reshuffle announcements.\n\n\nJeremy will be interviewing top figures from all the three parties as well as Quentin Letts, Andrew Rawnsley and Jackie Ashley. \n\n\nWe also reveal the winner of the Order of the Brown Nose.\n\n\nDo add your thoughts on what should be on Tony Blair's political epitaph. \n\n\nCLICK HERE TO POST YOUR COMMENTS \n\n\nDo join Jeremy at 10.30pm.  \n\n\nKavita\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nFILMMAKER FOLLOWS LEADERS\n\n\t\t\t\t\t\t\tThe independent filmmaker Jamie Campbell followed David Cameron and Zombie Brown to see how accessible they were.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}