{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: The \"Older White Guy\" Advantage", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe \n      Public Eye Chat With…Linda Mason\"I'm just surprised at how, \n      almost 30 years after I worked on the 'Evening News' as the first woman producer, that Katie \n      is having such a tough time being accepted by the public, which seems to \n      prefer the news from white guys, and now that Charlie's doing so well, \n      from older white guys. I guess they want the reassurance of a Walter \n      Cronkite. I had no idea that a woman delivering the news would be a \n      handicap.\"[+ Read More]\n\n\n\nCAIR \n      Says Not To Link Dix Six To IslamThe Council on \n      American-Islamic Relations requests \n      that \"media outlets and public officials refrain from linking [the Fort \n      Dix] case to the faith of Islam.\" On one level I understand why CAIR would \n      not want the case linked to the faith of Islam, as these men are clearly \n      not representative of the majority of Muslims. But media outlets should \n      not be in the business of selectively suppressing information. [+ Read More]\n\n\n\nE-Mailbag: \n      Leave The Clerk Alone?From the inbox comes this missive \n      from Ruthann B. about efforts by media outlets to identify the \n      person who tipped authorities off to the alleged Fort Dix plotters: \n\nI am writing to protest your news staff trying to get the \n        identity of the person responsible for alerting the FBI of the video \n        tape of the accused men. I feel you are putting this person in danger, \n        and every time I see when of your newspersons standing in front of the \n        Circuit City store, I get upset...\n[+ Read More]\n\n\n\n E-mail us your questions, tips, \n        concerns Public Eye RSS \n      Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nThe \n      God Squad\n \nAAJA \n      Says To Avoid Racial Identifiers In Virginia Tech \n      Coverage\n \nFrom The Vault: \n      Christmas In Korea \n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}