{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Spie Smith <bdsmith@buncombe.main.nc.us>", "subject": "Re: Definitely unslung", "body": "I might be a little off for inserting myself into your conversation,but I just have a hardware question.  My understanding of thecomputer, \\u311en any of its forms ends with the software, so I justthought I would learn.  \nI just bought this intel, pentium 4 a few weeks ago, and I have nothad a lick of trouble out of it.  What is the problem with intel, sothat I might watch it and be careful to try to avoid it on this one.  \nI have never worked with one of those sub-laptop machines?  What arethey like?  How much memory do they have? How hard are they to portLinux to?  Do they really work well? \nThis laptop is really good for me .  It has all the hardware I need.It seems to run Linux with \\u3122\\no problem at all.  \nI just want to make one recommendation to anyone interested inpurchasing a new machine, just be sure yyou test it really well withthe distribution you want to use.  \nThis is one other reason to use grml or any of the live cd distros.You can just get hold of the machine, either on the shelf at thestore, or wherever you go to pick it up, put in the di\\u0455k, hit thestarter and see if it is going to come up talking.  \nThis was part of my decision to get this one, not to mention that itis a laptop, and I have developed a real interest in them since theyhave started making them better.  \nNow, I wonder about this situation.  Whoever it was on here who has amac book, what are you using for speech?  Do you use Linux, since themachine has an intel chip, or do you use something on the mac-osxsystem?  \nwell, I'll get out of here, and let you experts discuss more relevantmatters.  Thanks for the information.  \n\n\nSincerely:\n\n\n\n-- Spie Smith: C.S.F.C.Computer Scientist For CHRIST\n\n_______________________________________________Speakup mailing listSpeakup@braille.uwo.cahttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}