{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Wall Street Journal: In Trade Deal, a Shift on Generics", "body": "\n\n\nIn Trade Deal, a Shift on Generics\nAgreement Opens the Door\nTo Cheaper Drugs Abroad,\nEasing Some Patent Rules\nBy SARAH LUECK\nMay 17, 2007; Page A4\n\nWASHINGTON -- A new trade agreement between Congress and the White\nHouse contains provisions that open the door to more sales of generic\ndrugs in developing countries. The plan, reversing earlier gains for\nAmerican drug makers backed by President Bush, marks the first big\nsetback for the pharmaceutical industry since Democrats claimed Capitol\nHill.\n\nFor now, the provisions likely only affect pending trade deals with\nPeru, Panama and Colombia. But the plan also signals a broader shift as\ncongressional leaders give greater weight in trade talks to providing\ncheaper medicines for the poor, even if it means denying the\nRepublican-friendly drug industry some of the protection it says it\nneeds.\n\nThe administration \"has permitted the weakening of\nintellectual-property protections in these agreements,\" said Billy\nTauzin, president of the Pharmaceutical Research and Manufacturers of\nAmerica, the drug industry's main trade group, in an interview. \"They\nwere desperate to get continuing trade authority\" from Democrats in\nCongress, he said. \"The fact is, their leverage changed since\nNovember.\"\n\nThe main focus of the bipartisan trade deal, announced last week,\ninvolves requiring U.S. trade partners to meet new standards for giving\ntheir workers labor rights and ensuring environmental protections. But\nthe deal also allows developing countries more flexibility in dealing\nwith U.S. drug makers than they would have had under earlier versions.\n\nSpecifically, the policy would ease requirements on developing-country\nregulators to prevent the sale of patent-infringing products. It also\nreleases trading partners from a requirement to extend the time for\npatent protections as a form of compensation for delays in drug\napprovals.\n\nPublic-health advocacy groups have argued for years that U.S. trade\npolicy under Mr. Bush often protected brand-name drug makers at the\nexpense of poor countries in need of more-affordable treatments. Many\nof those groups said they weren't satisfied with last week's deal. Even\nwith the changes, they say, the Peru and Panama deals advance many of\nthe protections the drug industry wants -- just fewer than would have\nexisted if the Bush administration had stuck with its earlier trade\nstance.\n\n  \"Compared to the many steps backward that have been taken since 2003,\nthis is a bit of relief for people who want access to affordable\nmedicines,\" said Ellen Shaffer, co-director of the Center for Policy\nAnalysis on Trade and Health in San Francisco. \"Compared to an actual\npolicy that would provide affordable medicines for people and fairly\nbalance that with innovation, it is a small step forward.\"\n\nTrade is just one of many fronts where the pharmaceutical industry\nfaces a less friendly policy environment, after enjoying strong support\nduring years of undivided Republican rule. Some Democrats want to\nrewrite the Medicare prescription-drug benefit to allow the government\nto negotiate lower prices with manufacturers. Some Democrats also want\nto legalize imports of cheaper medications from Canada and other\ncountries. The Bush administration has maintained its support for the\nindustry on those issues, and the Senate has blocked those policy\nchanges.\n\nBut on exports, the administration last week changed course. For the\nlast several years, U.S. trade officials and drug companies have worked\nto push new protections for drug makers in countries such as signers of\nthe Central American Free Trade Agreement.\n\nCompanies say stronger safeguards for their patents and proprietary\ndata are needed in many countries, to delay generic competition and\nmake it worthwhile for the industry to continue to invest in research\nand development of new treatments.\n\nUnder the new American trade strategy, the biggest loss for the\nindustry is a change that may shift more responsibility to drug makers\nfor preventing the marketing of patent-infringing products.\n\nUnder recent trade agreements, the U.S. pressed countries to agree to\n\"linkage,\" which requires local drug regulators to make sure a generic\nproduct doesn't violate any patents before allowing it on the market.\nPublic-health advocacy groups have said this puts makers of brand-name\ndrugs at an advantage and burdens regulators. Drug companies support\nlinkage because it prevents copies of their products from being sold\nduring lengthy court battles. Without it, companies will have to be\nmore vigilant. To take industry concerns into account, the new policy\ncalls for countries to set up fast procedures for resolving patent\ndisputes.\n\nAnother change in the new trade policy would weaken a common provision\nin past trade agreements: that local regulators \"shall\" compensate drug\nmakers for delays in the process of approving their products, by\nawarding extra time to sell their products free from competition.\n\nSome Democrats said this unfairly penalizes consumers in those\ncountries for slow bureaucracies. A description of the changes to the\nPeru and Panama agreements says countries \"may\" extend a company's\npatent to make up for delays, suggesting more flexibility on what they\nare required to do to compensate drug makers.\n\nHealth-advocacy groups complain the new policy still preserves the\ndata-exclusivity provision used to block generic competition. In many\ncountries, including the U.S., makers of generic drugs can often win\napproval by proving their products are equivalent to the original\ndrugs. In that process, regulators use test data submitted by makers of\nbrand-name drugs. The data-exclusivity provision typically prevents\nsuch use of the data for five years, acting as an effective hurdle for\ngenerics. The new policy does, however, place more restrictions on the\nfive-year data exclusivity than previously existed in the Panama and\nPeru agreements.\n\nWrite to Sarah Lueck at sarah.lueck@wsj.com1\n\n   \tURL for this article:\nhttp://online.wsj.com/article/SB117936226237705632.html\n\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}