{"category": "spam", "to_address": "simpsons@flax9.uwaterloo.ca", "from_address": "Groupe Desjardins / AccesD <services.de.cartes@scd.desjardins.com>", "subject": "Erreur possible lors de notre maintenance", "body": "\n\nMouvement Desjardins\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Cher(e) membre \nDesjardins/ AccèsD\nLe département de vérification comptable du Groupe Desjardins a détecté un problème de transaction dans votre compte. Un montant a été déposé et retiré par notre système comptable. Nous vous avisons de cette erreur afin que vous ne soyez pas surpris quand vous verrez ces transactions sur votre relevé transactionnel. Nous avons repris le montant total sans appliquer les frais de transactions. Ne divulguez \njamais vos renseignements personnels sur un site autre que le site sécurisé \nDesjardins. Si vous constatez une autre erreur, communiquez avec votre institution durant les heures de votre caisse.\nPour accéder à \n  votre compte et vérifier que tout soit normal, cliquez sur ce lien sécurisé si dessus :\nhttps://accesd.desjardins.com/\nSoyez assuré que Desjardins met tout en oeuvre pour protéger les utilisateurs de ses services Internet \nLe Groupe \n  Desjardins vous remercie de votre clientèle et apprécie votre compréhension.\nDesjardins / AccèsD\nConjuguer avoirs et \nêtres \n\n\n\n\n\n\n\n\nDear Desjardins Member\nThe Group Desjardins audit department has detected a problem with transactions in your account. \nAn amount was deposited and withdrawn by our accounting system. We warn you of this error so that you \nare not surprised when you see these transactions on your monthly statement. No Transaction expenses occurred. \nNever reveal your personal information on a site other than the Desjardins secure site. \nIf you noticed another error, contact your institution during opening hours.\nWe encourage you to    connect to your account and verify your transactions, by clicking the secured url below :\n\nhttps://accesd.desjardins.com/\n\nBe assured that Desjardins makes every effort to protect our internet users \nThe Group Desjardins  thanks you for your business and appreciates your comprehension\n\n  Desjardins / AccèsDMoney working for people \nSvp ne répondez pas à ce courriel car c'est seulement un avis. Le courrier envoyé à cette adresse ne peut pas être répondu. \n\n\n\n\n\n\nCopyright © 2006 Mouvement des caisses Desjardins. Tous droits \nréservés.\n\n \n\n\n\n\n\n\n"}