{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nToday a Defense Department panel warned that more\n  than one-third of U.S.\n  troops and veterans suffer from mental health problems such as traumatic\n  brain injury or post-traumatic stress disorder. With the conflicts in Iraq and Afghanistan continuing, these\n  numbers are only expected to grow, according to the group. David Martin will\n  have this story and a deeper look at veterans’ mental health issues.\n \nCorrespondent Allen Pizzey will introduce you to an\n  Army specialist with a special perseverance – and a unique perspective\n  on the roadside attacks that injure so many American troops: Specialist\n  Jordan Spurlin has survived four IED explosions. Now he’s sharing his\n  story.\n \nA boat carrying an estimated 150 Haitian migrants\n  capsized in the Atlantic Ocean this morning.\n  Kelly Cobiella will have the latest on the Coast Guard’s frantic search\n  for survivors.\n \nTen presidential hopefuls lined up on stage last\n  night, but what memorable about it? Our senior political correspondent Jeff\n  Greenfield will have a review of the first Republican debate.\n \nQueen Elizabeth II is causing quite a stir at the\n  site of one of America’s\n  first colonies. Mark Phillips will follow her through Jamestown – where Brits settled 400\n  years ago – and take a look back through its history and how it is\n  recently being revised.\n \nA bit of trivia: Who is the only sitting U.S. senator to serve on active duty in Iraq?\n  Sharyl Attkisson will have that exclusive story tonight, and she’ll\n  explain the work this lawmaker has done recently for the military.\n \nFinally, for Assignment America Steve Hartman will\n  have a sugar-sweet story about a small-town family fighting to save their\n  roots – one hand-dipped chocolate at a time. \n \nI hope you join us tonight and have a great weekend,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}