{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Common Dreams <commondreams@mail.democracyinaction.org>", "subject": "Arrowsic Votes 71-17 to Halt War Funding", "body": "\n\n\n\n \n \n \n \n \n\n\n\n\n \n\n\n\nJune 14, 2007\nDear Friend of Common Dreams,\nLast night, residents of the small, Maine coastal town Arrowsic came together for their annual town meeting. Among other town business, they voted 71-17  in favor of a resolution asking President Bush and Congress to immediately stop all war funding, to end American occupation in Iraq and to bring the troops home now.\nNo equivocating there.\nArrowsic is just across Casco Bay, about 30 miles  from our offices in the Old Port neighborhood in Portland. I know Arrowsic. And believe me, it's a typical, rural small town. \nAnd yet. \nNo mention of 'benchmarks'. No 'we broke it, we have to stay and fix it'. No 'we have to keep funding flowing for the troops.'\nThe mainstream media doesn't tell you the hundreds of other similar stories from towns all over the USA. We rarely hear the voices of ordinary Americans, the voices of people just like those in Arrowsic.\nInstead you hear from the John McCains. The Joe Liebermans. The retired General Talking-Heads who provide 'commentary' while on the payroll of the biggest military contractors. \nArrowsic's town meeting vote is the kind of news that we seek out. Thinking locally - acting globally. Inspiring. Lighting sparks that keep our progressive movement growing. \nWe are making a difference but we need your help.\nFirst, if you hear of a local news story that you think we should share with our CommonDreams.org community, please e-mail the link to me at editor@commondreams.org.\nSecond, over the next couple of weeks, CommonDreams.org needs to raise $75,000 to keep us going another few months. Can you pitch in  to keep the CommonDreams.org site up and running?\nCommonDreams.org doesn't accept advertising or corporate sponsorships -- because we don't want to have to answer to anyone except you. \nBut that means we have to rely on you - our readers - for 100% of our funding.\nPlease help  us harness the power of the independent media!\nYou can make your secure, tax-deductible online donation right now here. Or, you can print our donation form and mail it back to us with a check here.\nThanks so much. We can't do it without you.\nGratefully,\n\n                    Craig Brown\n                    Executive Director\n                    for the whole CommonDreams.org team\nP.S.\n                    Our readers are our only source of funding. We'll send everyone who pitches in a free \"Out of Iraq NOW!\" bumpersticker.\nThanks!\nAll contributions to Common Dreams are now tax-deductible to the fullest extent allowed by law.\n\n\n\n\n\nYou may   make a secure on-line donation right now or print & mail a contribution form:\n\n\n\n\n  \n \n  \n\n\n\n\n \n \n\nWe respect our supporters privacy. Information provided    by you will never be sold, rented, exchanged or \n        otherwise disclosed to any other organization.       Read our privacy policy here.\n\n \n \n \n \n \n \n \n \n \n \n\n"}