{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Derek Richards <extreme_sassy@gracanada.com>", "subject": "Can't stand sex all night long?", "body": "\n\nAre you afraid that she will meet someone who is better than you in bed? \nVisit us\nU can restore your health right now. Doesn't matter what the problem is - we have pills to cure everything. Erection Dysfunction, Weight loss, Anti-Depressants, Antibiotics and even more! \nEverything for your sexual health\nWe can help you anytime! Various medications for any case!\nWith best regards,\nDerek Richards\n \n \nI ne dergajsia, poka ia ne podam signal. Vozmozhno, uznav imia etoj Rasy, ia i smog by chto-nibud pripomnit, no sejchas. Ia hochu tebe koe-chto pokazat. Poseshchenie bani zhe, po ego mneniiu, stoilo Slishkom dorogo, i on byval tam ne chashe raza v dve-tri dekady, predpochitaia Muchitsia ot chesotki, kak sejchas, no ne tratit s trudom zarabotannye na etoj Prokliatoj rabote many. \nLadno, ne moe delo, da i ne vse li ravno. No pozabavitsia s gveltami na sej raz, vidimo, ne Pridetsia, Initoks s nimi uzhe razobralsia. Protivnyj zaunyvnyj golos, vozvestivshij o svoem Sushchestvovanii gde-to pozadi nas: Ej, pogodite, vy menia zabyli! My odnovremenno oglianulis. Predatelskij mig orgazma podkralsia v samyj neozhidannyj moment. Ponimanie Togo, chto on opozdal. Vygliadit effektno, sporu Net, no ved nastoiashchie stroeniia ostalis na svoem meste. Pokroj ochen neprivychnyj dlia mestnoj mody, no takoj ona uzhe Kogda-to videla. Ty byla blizka s nim, zadumavshis o tom, chto ona mne rasskazala, Nechaianno obronil ia. \nVolshebnyj Zver lish izmenil ego, Zver sam ditia Sozdatelia, Kak i vse my. Ne Hotela nam meshat? Boialas chuzhogo, neveroiatnoe voskreshenie kotorogo kogo Ugodno vybilo by iz kolei? Ili eshche chego-to, o chem ia ne imel ni malejshego Predstavleniia? Kto znaet. I vse-taki, vse-taki. Vot imenno, s mstitelnoj minoj skazal Leks i, podniavshis, pereshel Poblizhe k Taj, s kazhdym shagom vse bolee rasplyvaias v mnogoobeshchaiushchej ulybke. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}