{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Littlefield, Tyler\" <compgeek13@gmail.com>", "subject": "Re: moving from amd to p3?", "body": "If you do a make oldconfig, with your distro's kernel, in debian the one \nfound in /boot I believe, it will ask you questions about the kernel that \naren't in the old config.\nalso, if speakup patches, I'd mrproper, then put the config in, and patch \nspeakup in.\n\nThanks,\n~~TheCreator~~\n[My programs don't have bugs; just randomly added features]\nmsn:\ncompgeek13@gmail.com\naim: st8amnd2005\nskype: st8amnd127\nvertigo head coder\nweb: tysdomain.com\n----- Original Message ----- \nFrom: \"Spie Sutherland\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Saturday, June 16, 2007 8:49 PM\nSubject: Re: moving from amd to p3?\n\n\n>\n>\n>> Actually, as far as I know, and this is what I've always done, you're\n>> supposed to untar the kernel, patch with speakup, run make mrproper\n>> clean, then copy a .config file into place if any. Also, if you're just\n>> building a freshly untared kernel from kernel.org without speakup, or\n>> any other patches, you don't need to do make mrproper, I never did\n>> that in those cases.\n>\n> If you read the kernel FAQ it states that even if a fresh kernel from\n> source you should do mrproper because there is a chance that some\n> old stuff gets left behind when they package it. Better safe than sorry,\n> always do mrproper before building a kernel. It can't hurt anything\n> and does make sure there are no old deps or object modules around.\n> mrproper is a superset of clean so if you do that you don't need to\n> also do clean.\n>\n> Also, it doesn't seem right to copy an existing  .config after doing the\n> speakup patch. The speakup patch adds new items into .config after\n> speakup is selected in menuconfig, the CONFIG_SPEAKUP and\n> other related entries. If you copied in a .config from a kernel without\n> speakup then it won't have the speakup stuff in .config. If you copy\n> some existing .config then it may not match the kernel that you are\n> compiling from source. If it's the same kernel version that you used\n> before it will work, but if you now have a newer kernel it may or\n> may not work, and you might be missing some new stuff that's in the\n> newer kernel version.\n>\n> It is a pain to go through the config, but worthwhile to understand\n> what you need and don't for your hardware. There is so much in\n> the kernel that is not needed on most systems. If you set all those\n> to not be included, then you have a whole lot less to compile.\n>\n>  -- Spie\n>\n>\n>\n>\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}