{"category": "ham", "to_address": "Andrew <ktwarwic@flax9.UWATERLOO.CA>", "from_address": "\"Organic Consumers Association\" <ronniecummins@organicconsumers.org>", "subject": "Organic Bytes: Special Issue - Defending Organic Standards", "body": "\n\nOrganic Bytes #110: Big Food Attack, Toxic Sodas, Green Shopping\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHello Andrew,\nORGANIC \n                          BYTES #111\n                          Health, Justice and Sustainability News Tidbits with \n                          an Edge!\n\n6/14/2007\n\nWritten \n                        and edited by Craig Minowa and Ronnie Cummins\n\nSafe \n                        Unsubscribe: \n                        http://organicconsumers.org/unsuborganicbytes.cfm \n                        \n                        You are subscribed as: ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n \n\n\n\n\n\n\n\nIN \n                        THIS ISSUE\n\nPRODUCT \n                          PLUNDER OF THE WEEK:\n                          HORIZON ANNOUNCES FURTHER LOSSES AS OCA BOYCOTT CONTINUES \n                          \nTARGETS \n                          OF OCA'S ONGOING \"ORGANIC\" FACTORY FARM DAIRY \n                          BOYCOTT\nOCA \n                          ALERT UPDATE: SUCCESS! \n                          FACTORY FARM DAIRY SUPPLYING HORIZON LOSES ORGANIC CERTIFICATION \n                          \nOCA \n                          FARM BILL ALERT UPDATE:\n                          CONGRESS CONSIDERING NEARLY $200 MILLION FUNDING FOR \n                          ORGANICS\nOCA \n                          LAUNCHES NEW WEB FORUM \n                          YOUR ONLINE ORGANIC COMMUNITY HAS ARRIVED\nFEATURE \n                          STORY -- OCA ALERT UPDATE: \n                          USDA'S NEWEST SNEAK ATTACK ON ORGANIC STANDARDS\nRECENT \n                          HISTORY OF USDA ORGANIC LAWBREAKING\nYOUR \n                          HELP IS STILL NEEDED\n\n\n\n\n\n\n\n\n\n___________________________________\n\n\n\n\n\nImage \n                courtesy of salon.com\n\nPRODUCT \n              PLUNDER OF THE WEEK:\n              HORIZON ANNOUNCES FURTHER LOSSES AS OCA BOYCOTT CONTINUES \n              This week, Horizon, the largest organic dairy company in the U.S., \n              announced, for the second time this year that its profits are decreasing. \n              Horizon dairy is one of several brands being boycotted by the OCA \n              and thousands of organic consumers due to the company's practice \n              of sourcing milk from giant dairy feedlots where the animals have \n              little or no access to pasture. Gregg Engles, the CEO of Dean Foods \n              (Horizon's parent company) blamed recent profit losses on \"considerable \n              disruption\" in the organic dairy marketplace. When OCA launched \n              its boycott in 2006, Engles claimed factory farmed organics were \n              necessary in order to produce enough organic milk to meet growing \n              consumer demands. Ironically, this week Engles said part of the \n              blame for the company's profit losses is due to an oversupply of \n              organic dairy in the marketplace. \nLearn more: http://www.organicconsumers.org/rd/boycott.cfm\n\n\n\n\n\n___________________________________\n\n\n\n\nTARGETS \n              OF OCA'S ONGOING \"ORGANIC\" FACTORY FARM DAIRY BOYCOTT\n\n              Horizon, Costco's \"Kirkland Signature,\" Safeway's \"O\" \n              organics brand, Publix's \"High Meadows, \"Giant's \"Natures \n              Promise,\" \"Woodstock Farms\" and Wild Oats' organic \n              milk.\n\n\n\n\n___________________________________\n\n\n\n\nOCA \n              ALERT UPDATE: SUCCESS! \n              FACTORY FARM DAIRY SUPPLYING HORIZON LOSES ORGANIC CERTIFICATION \n              \n              After more than a year of efforts to raise public awareness, the \n              OCA and the Cornucopia Institute celebrated a major victory last \n              week when, for the first time, a massive 10,000 head intensive confinement \n              California feedlot dairy had its organic certification suspended. \n              Prior to OCA's boycott, this factory farm supplied Horizon Organic. \n              \"This is a big victory for the farm families around the country \n              who work so hard to create milk and dairy products that meet a high \n              ethical standard,\" said Mark Kastel, Cornucopia's senior farm \n              policy analyst. The Cornucopia Institute says that the good news \n              about organic dairy products is that the vast majority are produced \n              with high integrity and meet the spirit and letter of the organic \n              law. \nLearn more: http://www.organicconsumers.org/articles/article_5565.cfm\n\n\n\n\n__________________________________\n\n\n\n\nNONE \n                OF THIS WORK WOULD BE POSSIBLE \n                WITHOUT YOUR DONATIONS\n                We need your support today to help us continue our work to safeguard \n                organic standards and to promote fair trade and sustainability. \n                Please donate now.\n\n\n\nhttp://www.organicconsumers.org/donations.htm\n\n\n\n\n\n\n_________________________________\n\n\n\n\n\n\n\nOCA \n                FARM BILL ALERT UPDATE:\n                CONGRESS CONSIDERING NEARLY $200 MILLION FUNDING FOR ORGANICS\n\n                In the past few issues of Organic Bytes, the OCA has been alerting \n                its readers to contact various congressional subcommittees who \n                are in the process of allocating funding for the 2007 Farm Bill. \n                This massive piece of legislation provides funding until 2012 \n                and includes a variety of programs that would benefit organic \n                farmers, sustainable agriculture and the environment. Thanks to \n                your efforts and the concerted work of OCA's allies, many of these \n                target programs have been allocated funding. \n\n\n\n\n\n\n\nSpecifically, \n                the following funding has been approved in subcommittees for organic \n                and sustainable agriculture related programs over the course of \n                the next five years:\n\n$150 \n                  million to examine optimal conservation and environmental outcomes \n                  for organically produced agricultural products, and to develop \n                  new and improved seed varieties that are particularly suited \n                  for organic agriculture.\n\n$22 \n                  million to help farmers pay for organic certification\n$5 \n                  million for outreach to organic and specialty crop producers.\n$3 \n                  million to collect market and production data about organic \n                  farming.\n\nThe \n                OCA will continue to alert you to new issues arising in this arena, \n                as the 2007 Farm Bill continues to be developed by Congress. \nLearn more: http://www.organicconsumers.org/farm.cfm\n\n\n\n\n___________________________________\n\n\n\n\n\nOCA \n                LAUNCHES NEW WEB FORUM \n                YOUR ONLINE ORGANIC COMMUNITY HAS ARRIVED\n                This week, OCA announces the birth of our new online web forum. \n                This interactive web portal provides tens of thousands of green-minded \n                folk, like you, with a place to post questions, comments and critiques \n                about any OCA related issue. Whether its organics, food safety, \n                sustainability, social justice issues, politics, or any other \n                related topic, we welcome you to login for a free registration \n                today and start posting your ideas and questions for discussion. \n                Since we're just getting this started, we need a few of our readers \n                to get the forum buzz rolling by posting some of your OCA related \n                thoughts/questions now: http://www.organicconsumers.org/forum/index.php\n\n\n\n\n___________________________________\n\n\n\n\n\nFEATURE \n                STORY -- OCA ALERT UPDATE: \n                USDA'S NEWEST SNEAK ATTACK ON ORGANIC STANDARDS\n                Thanks to all of you who joined thousands of organic consumers \n                in late May and signed OCA's petition to the USDA opposing the \n                agency's latest \"Sneak Attack\" to allow 38 new non-organic \n                ingredients in products labeled as \"USDA Organic\". (Read \n                full petition here: http://www.organicconsumers.org/articles/article_5225.cfm)\nUSDA's \n                controversial proposal to allow 38 new non-organic ingredients \n                in products labeled as \"organic\" has fueled the anger \n                of organic consumers and generated a backlash of negative press \n                coast to coast. Over the weekend the New York Times and the L.A. \n                Times (as well as a number of other major news outlets) ran feature \n                stories on the debacle.\nThe \n                New York Times noted that the mega-brewer Anheuser-Busch pressured \n                the USDA into allowing them to use hops grown with pesticides \n                and chemical fertilizers in their \"Organic Wild Hop Lager\" \n                beer. In the Los Angeles Times, Ronnie Cummins, OCA's National \n                Director, was quoted as saying, \"This proposal is blatant \n                catering to powerful industry players who want the benefits of \n                labeling their products 'USDA organic' without doing the work \n                to source organic materials.\"\nAlthough \n                industry was given the better part of two years to work with the \n                USDA in developing this proposal, the agency only gave the public \n                a brief 7-day comment period. During that short time, the OCA \n                generated over 8,000 petition signatures telling the USDA to back \n                off on allowing non-organic hops, factory-farmed animal intestines, \n                tainted fish oil, and other problematic ingredients in organic \n                products.\nOn \n                Friday June 8, the USDA took its third swing at organic standards \n                and struck out, violating federal law by refusing to respond to \n                a federal court order to stop allowing companies to use the 38 \n                non-organic ingredients proposed for inclusion in products labeled \n                \"USDA Organic\". Unprepared for the firestorm of protest \n                against their latest Sneak Attack, the USDA has been refusing \n                to talk to the press.\n\n\n \n\n\n\n\n\nRECENT \n                HISTORY OF USDA ORGANIC LAWBREAKING\nJanuary 2005 (Strike One): Federal court rules that the \n                USDA has violated federal regulations in allowing conventional \n                and synthetic ingredients in products labeled as \"organic\".\nMay \n                2007 (Strike Two): After heavy lobbying from industry, USDA \n                proposed to allow 38 conventionally grown ingredients in foods \n                labeled as organic. One of those ingredients, fish oil, has never \n                undergone review, which is a violation of federal law.\nJune \n                2007 (Strike Three): A federal judge had given the USDA until \n                midnight Friday (6/8) to post its final ruling, which the agency \n                failed to do.\n\n\n\n \n\nYOUR \n                HELP IS STILL NEEDED\n                We need to put a lot more pressure on the USDA, demanding they \n                re-open the public comment period on this issue. Industry was \n                given two years, and the public was only given 7 days. Through \n                that process, it appears the organic standards will be significantly \n                weakened unless we can generate enough comments to force the USDA \n                to reconsider its proposal to weaken organic standards.\nPlease \n                forward this email to all interested friends and colleagues and \n                send a letter to the USDA here: http://www.organicconsumers.org/articles/article_5225.cfm\n \n\n\n\n\n__________________\n\n\n\n\nNONE \n                OF THIS WORK WOULD BE POSSIBLE \n                WITHOUT YOUR DONATIONS\n                We need your support today to help us continue our work to safeguard \n                organic standards and to promote fair trade and sustainability. \n                Please donate now.\n\n\n\nhttp://www.organicconsumers.org/donations.htm\n\n\n\n\n\n\n________________________________\n\n\n\n\nQUESTIONS?\n\n              Do you have comments, questions or critiques about present or past \n              issues of Organic Bytes? Please post them in the Organic Bytes section \n              of our web forum, and we will post a response. Thanks \n              http://www.organicconsumers.org/forum/index.php\n\n\n\n___________________________________\n******** support our \n        supporters*********\n\n\n\n\n\n\n\nEden\n                      Foods\n\n\n\nFrey\n                      Vineyards\n\n\n\n\n\n\n\n\n \n\n\n\n\nPlease \n                forward this publication to family and friends, place it on websites, \n                print it, duplicate it and post it freely. Knowledge is power!\n__________________________________\nNOTE \n                TO CO-OP AND NATURAL FOOD STORE SUBSCRIBERS:\n                Organic Bytes is a great tool for keeping your staff and customers \n                up to date on the latest issues. Feel free to forward this email \n                to your staff and print for posting on bulletin boards and staff \n                break tables. You are also welcome to use this material for your \n                newsletters. There's an attractive print-friendly PDF version \n                of this available for free download at http://www.organicconsumers.org/organicbytes.cfm\n\n_________________________________\nORGANIC \n                BYTES is a publication of:\n                ORGANIC CONSUMERS ASSOCIATION \n                6771 South Silver Hill Drive\n                Finland, Minnesota 55603\n                Phone: (218)- 226-4164 Fax: (218) 353-7652\n__________________________________\nSubscribe: \n                http://www.organicconsumers.org/organicbytes.htm\nSafe \n                Unsubscribe: \n                http://organicconsumers.org/unsuborganicbytes.cfm \n                \n                You are subscribed as: ktwarwic@SPEEDY.UWATERLOO.CA \nChange \n                your subscription settings to receive Organic Bytes as plain \n                text here:\nhttp://www.organicconsumers.org/campaign.cfm \n                \n__________________________________\n  \nxaxa1014138\n\n\n\n\n \n \n \n\n\n\n\n\n"}