{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "\"ArcaMax\" <ezines@arcamax.com>", "subject": "2nd Notice: Congratulations", "body": "\n\n\n\n\nCan't\n  see the images below?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   Arcamax Publishing, Inc.\n   744 Thimble Shoals Blvd.\n   Suite C\n   Newport News, VA 23606\n   Fax: (757) 596-9731\n\n\n\n\n   You signed up for \"ArcaMax Offers\" with the following email address:\n   debian-laptop@lists.debian.org.\n\n   \n\n\n\nThis offer was sent to you because you are an ArcaMax subscriber. Thank you! If you would like to change your subscription status\n       with ArcaMax Publishing, please visit our unsubscribe page. It is our policy\n       and practice not to send unwanted email.\n\n       If you have questions regarding this particular offer, or would like to stop receiving\n       all offers from this advertiser, please contact them directly. Otherwise you may continue\n       to receive offers from this advertiser even if you no longer receive them from ArcaMax\n       Publishing.\n\n\n\n\nSubscribe To:\n\n\n\n\nTravel:\n\n  The latest travel tips and hot spots are sent to your e-mail when you click the above link to subscribe (sent every weekday).\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\nMy Account\nUnsubscribing\nAdvertiser's Directory\nFAQ / Help\n\nContact the Editor.\n\n\nManage your subscriptions, change your email address and more...\nIf you wish to no longer receive our newsletters, visit our unsubscribe page.\nContact information for recent advertisers.Consumer Online Buying Guide:  FTC Tips for shopping online\nAnswers to our most frequently asked questions. Contact Customer Service\n\nHave a question or comment about an article you read in one of our ezines?\n\n\n\n\n\n\n   Copyright © 2007 ArcaMax Publishing, Inc. and its licensors.\n   All registered trademarks are the property of their respective owners.\n  \n\n\n\n\n\n\n\n"}