{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for April 17, 2007  \n\n\n\nFirst Enercast Featured Articles for April 17, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nApr 17, 2007 PowerMarketers Industry Publications\n\n\n\nCoal&#8212;Will It Ever Make the Market Data Ticker on CNBC? (UtiliPoint.com - Apr. 16, 2007)\n\n\n\nUtiliPoint.com - Apr. 16, 2007 - When watching the continuous streaming of commodity data coming over TV on CNBC during the day, the value of oil, gasoline and natural gas are prominently updated every minute.\n\n\nApr 17, 2007 PowerMarketers Industry Publications\n\n\n\nAging Workforce and Aging Asset Trends (UtiliPoint.com - Apr. 17, 2007)\n\n\n\nUtiliPoint.com - Apr. 17, 2007 - While awareness of the aging workforce and aging utility assets is high, the far-reaching effects of workforce retirement may prove to be more of a tsunami for utilities than a wave&#8212;and they are coming faster than anticipated.\n\n\nApr 17, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Apr. 17, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 17, 2007\n\n\nApr 17, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nRebuilt PSC begins hearings to probe electricity-rate rise: Panel also will weigh BGE plan to phase in future increases\n\n\n\nApr. 17--A reconstituted state utility commission launches today its first investigation of the electric rate increase that stunned utility customers last year and led to the appointment of several new panel members.  The Public Service Commission will begin a week of hearings that will deliver on Gov. Martin O'Malley's campaign pledge to scrutinize conditions that led to the expected 72 percent ...\n\n\nApr 17, 2007 Knight Ridder Tribune Business News\n\n\n\nWinds down power lines, trees\n\n\n\nApr. 16--HICKORY- High winds are wreaking havoc on the Hickory area, with widespread reports of downed trees and power lines.  [view video clip] By 11:45 a.m., more than 19,500 Duke Energy customers in Alexander, Burke, Caldwell and Catawba counties were without power. Almost 8,000 in Caldwell County alone were without power. Catawba County communications has received at least 45 calls between ...\n\n\nApr 16, 2007 Knight Ridder Tribune Business News\n\n\n\nStorm brings flooding, winds, hail, snow to Northwest N.C.\n\n\n\nApr. 16--A spring storm made for a windy, rainy and -- in some parts of Northwest North Carolina -- a snowy Sunday.  Boone was expected to get 2 to 5 inches of snow, and the surrounding areas were expecting anywhere from half an inch to three inches, according to the National Weather Service. Other parts of the state were under thunderstorm and tornado watches yesterday, and hail fell in several ...\n\n\nApr 16, 2007 Knight Ridder Tribune Business News\n\n\n\nStrom causes power outages, damage\n\n\n\nApr. 16--High winds caused a tree to fall on a home in Ruffin early today.  The massive oak fell on William Cross's home about 8 a.m. and trapped him in a bedroom. Cross' wife and daughter were not home. Cross called 911, and local volunteer firefighters were able to cut the tree out of the home, freeing Cross before 10 a.m. The tree fell on as Cross was preparing to take a nap.\n\n\nApr 16, 2007 Knight Ridder Tribune Business News\n\n\n\nMassive Explosion Rocks Hardee Power Plant\n\n\n\nApr. 16--BOWLING GREEN -- A massive explosion occurred Saturday night at Unit 3 of the Payne Creek Generating Station, severely damaging its steam turbine and generator, according to a spokesman from the Seminole Electric Cooperative, which owns the plant.  There were no injuries and no power was disrupted by the explosion. Seminole Electric is a cooperative of 10 member systems of which ...\n\n\nApr 16, 2007 Knight Ridder Tribune Business News\n\n\n\nStorms affected NPPD in Q1\n\n\n\nApr. 16--COLUMBUS -- Nebraska Public Power District's first quarter review focused the effects of severe winter storms plus safety and reliability, environmental, customer and stakeholder relationships, colleagues and financial considerations.  NPPD President Ron Asche presented the report to the board of directors Friday. Asche, speaking about the utility's safety goals reported that the Days ...\n\n\nApr 16, 2007 Knight Ridder Tribune Business News\n\n\n\nState helping with Praxair expansion\n\n\n\nApr. 16--The state's economic development arm has agreed to a $575,000 grant for Praxair Inc.'s industrial gas plant in Niagara Falls, to support corporate investment there and retain its 90 jobs, Empire State Development Upstate Chairman Daniel Gundersen announced.  Praxair's planned investment of more than $10 million will nearly double its production of nitrogen, oxygen and argon, an agency ...\n\n\nApr 16, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nWilliams gets FERC nod to expand pipeline\n\n\n\nThe Federal Energy Regulatory Commission has approved a plan by Williams Cos. Inc. to expand its Transco natural gas pipeline for serving markets in Baltimore and Washington, D.C., the Tulsa-based company announced Monday. The $74 million expansion is scheduled to begin this summer and serve the two cities by November, according to a company news release. 'We appreciate the support we have ...\n\n\nApr 17, 2007 Tulsa World\n\n\n\nIBM Hopes Coalition of Energy Companies Can Advance Grid\n\n\n\n(Computerworld) -- IBM and CenterPoint Energy Houston Electric LLC last week unveiled plans to create a coalition of energy companies that will use Web 2.0 tools to share information about major projects. IBM said that it hopes the Intelligent Utility Network Coalition will also help boost the adoption of its grid computing systems to improve automation in the energy industry.\n\n\nApr 16, 2007 Computerworld\n\n\n\n20,000 powerless for the third day\n\n\n\ncustomers of the city's Department of Water and Power remained without electricity for a third day early Saturday as crews labored to repair toppled utility poles and snapped power lines. The municipal utility also is investigating whether a blown power line in overgrown land it owns sparked a Thursday wildfire that damaged three expensive Beverly Hills homes.\n\n\nApr 16, 2007 Los Angeles Daily News\n\n\n\n\n\nEPA Awards Energy Star Label to Honda of America Plants in Marysville and East Liberty, Ohio\n\n\n\nU.S Environmental Protection Agency has awarded the Energy Star label to Honda of America's automobile assembly plants in Marysville and East Liberty, Ohio, for their energy efficiency performance over the past 12 months. 'The energy efficiency of these two plants places them among the top 25 percent of auto assembly plants in the country,' said EPA Region 5 Administrator Mary Gade.\n\n\nApr 16, 2007 PR Newswire\n\n\n\nWilliams Receives FERC Approval to Provide Additional Natural Gas Service to Mid-Atlantic Region\n\n\n\nTULSA, Okla., April 16 /PRNewswire-FirstCall/ -- Williams (NYSE: WMB) today announced that the Federal Energy Regulatory Commission has approved a proposal to expand Williams' Transco natural gas pipeline to serve markets in the greater Washington, D.C. and Baltimore, Md., metropolitan areas by November 2007. The proposal, known as Williams' Potomac Expansion Project, will provide the capacity to ...\n\n\nApr 16, 2007 PR Newswire\n\n\n\nMinnesota Power Announces Biomass Energy Initiative\n\n\n\nDULUTH, Minn.--(BUSINESS WIRE)--Minnesota Power, an ALLETE company (NYSE:ALE), announced today it is nearing completion of its Biomass Initiative, a long-range energy plan which has as its primary goal to add significant renewable generation to the Minnesota Power portfolio. Multiple biomass opportunities were screened to develop a short list of the most economically feasible projects.\n\n\nApr 16, 2007 Business Wire\n\n\n\nElectric Co-Op Line Crews Hard at Work Restoring Power\n\n\n\nNorth Carolina's electric cooperatives' line crews are making progress restoring power to areas affected by the recent high winds. Currently, the cooperatives are reporting 31,500 outages, compared to almost 50,000 this afternoon. The outages affected cooperative members primarily in the counties west of I-85. Storms such as this one offer particular challenges to repair crews because sustained ...\n\n\nApr 17, 2007 PR Newswire\n\n\n\nFitch Rates Florida Power & Light $300MM FMBs 'AA-'\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch Ratings has assigned an 'AA-' rating to Florida Power &amp; Light Company's (FP&amp;L) new $300 million issue of first mortgage bonds, 5.85% series due May 1, 2037. Proceeds will be added to general corporate funds and may be used to repay short-term borrowings and for other corporate purposes. The Rating Outlook is Stable. FP&amp;L's ratings reflect its strong ...\n\n\nApr 16, 2007 Business Wire\n\n\n\n\n\nDalby gas to be converted to LNG\n\n\n\nA pair of energy companies has signed an agreement that will see coal seam methane gas from southern Queensland liquefied in an Australian first. Liquefied natural gas (LNG) is natural gas that is cooled and concentrated and can be used as a diesel replacement or for generating power. Gas extracted from Arrow Energy's Daandine fields near Dalby will be converted to LNG as part of the project. ...\n\n\nApr 17, 2007 ABC Online\n\n\n\nNew Jersey loses round in LNG jurisdictional fight\n\n\n\nA special master to the US Supreme Court has issued a ruling in a jurisdictional dispute between New Jersey and Delaware that puts BP's proposed Crown Landing liquefied natural gas import terminal in jeopardy. In his recommendation, Ralph Lancaster said Delaware has the authority to block construction of an off-loading pier that would serve the 1.2 Bcf/d Crown Landing facility planned for Logan ...\n\n\nApr 17, 2007 Platts\n\n\n\nThermo Fisher Scientific Organizes 'Super Group III' Meeting On Clean Air Mercury Rule Implementation\n\n\n\nFranklin, MA -  Inc., the world leader in serving science, hosted industry specialists in Atlanta, March 26-27, to exchange ideas on progress achieved and future challenges regarding the federal Clean Air Mercury Rule (CAMR) emissions monitoring program. The 'Super Group III' meeting included representatives from the U.S. EPA, major utility companies, and leading research and consulting firms. ...\n\n\nApr 17, 2007 Power Online\n\n\n\nCoke plant proposed for former LTV site promises cleaner operation\n\n\n\nCoal & Coke Co. needs to overcome a few hurdles before it can begin building a new high-tech, environmentally friendly coke plant here and pick up some sizable state financial incentives for so doing. Knoxville, Tenn.-based Sun has won a lot of recognition -- and provoked a lot of community ire -- for the new coking process it wants to bring to town. And although company officials continually say ...\n\n\nApr 17, 2007 Pittsburgh Business Times\n\n\n\nOakland's the greenest of them all\n\n\n\nQuick, name the nation's greenest city government. Surprise  it's Oakland, although three other Bay Area cities tied for second place in a report released Monday. Drawing 17 percent of its power from alternative sources such as solar, wind and geothermal resources, Oakland makes the most use of renewable energy in city operations, according to SustainLane, an environmentally focused Web site ...\n\n\nApr 17, 2007 San Mateo County Times\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nPhotovoltaics: a High Potential Market Opportunity - Forecasts to 2010\n\n\n\nLYON, France--(BUSINESS WIRE)--Reportlinker.com announces that a new market research report related to the worldwide photovoltaic technology industry is now available to its catalogue. Photovoltaics - A high potential market opportunity (2005-2010) http://www.reportlinker.com/p047470/photovoltaics.html The report ' Photovoltaics - A high potential market opportunity (2005-2010) ' provides ...\n\n\nApr 17, 2007 Business Wire\n\n\n\nFortum to build &euro;60m biofuel-based CHP plant\n\n\n\n- Fortum is planning to build a biofuel-based combined heat and power plant (CHP) in the Ristinummi district of Jarvenpaa. The value of the investment is about 60m ($81.3m). The power plant is scheduled to be operational by 2010. The power plant will replace a number of heat boilers based on heavy fuel oil and natural gas, some of which will be decomissioned and a few left to serve as peak and ...\n\n\nApr 17, 2007 Power Engineering\n\n\n\nIran to privatize state-owned power plants\n\n\n\n- The shares of seven state-owned power plants will be offered to the private sector, according to a British Broadcasting Corporation Monitoring report. Minister of Energy Parviz Fattah said: 'With the approval of the cabinet, the plan for offering the shares of these power plants to the public through the stock market and justice shares will be implemented within the next six months.\n\n\nApr 16, 2007 Power Engineering\n\n\n\nChina to miss target for using natural gas\n\n\n\nSHANGHAI: China will miss a target for increased natural gas use because importers failed to secure enough supplies and energy demand gained more than expected. Gas will account for 5.3 percent of the nation's energy needs by 2010, the country's top economic planning body said in its latest five-year energy plan. That's less than the 8 percent targeted since at least 1999.\n\n\nApr 16, 2007 International Herald Tribune\n\n\n\nIndia Plans 10,000 MW Nuclear Plant as New Projects Connect to Grid\n\n\n\nResearched by Industrial Info  Researched by Industrial Info Resources (Sugar Land, Texas). The Nuclear Power Corporation of India Limited has granted environmental clearance for four 700 MW pressurized heavy water reactors and has launched preparatory work for the development of a 10,000 MW nuclear power project in Maharashtra state.  For details, view the entire article by subscribing to ...\n\n\nApr 17, 2007 Internet Wire\n\n\n\nAround the Markets: Future for coal brighter\n\n\n\nBEJING: Coal is poised to rebound from a two-year slump as China buys more than it exports for the first time in history. Power use in China, the world's biggest coal producer, is rising 13 percent annually; utilities are building plants at a record pace. The nation gets 78 percent of its electricity from coal, spurring imports from Australia, Indonesia and Vietnam.\n\n\nApr 16, 2007 International Herald Tribune\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}