{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 16, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIES1 Dead, Several Wounded At Virginia Tech\nA shooting at a Virginia Tech dorm left one person dead and one wounded and a second shooting has seven or eight casualties,\n                        officials said. A government official with knowledge of the shooting said the gunman had been arrested. More...\n• Flooded Homes, Power Outages On East Coast\n                     \t\t\t\t\t| Watch• German Army Video Shows Racist Bronx Jeer• The Duke Case: Innocent\n                     \t\t\t\t\t| WatchU.S.Ill. Parolee Charged In Deaths Of 5 Kids\nA man who was recently paroled from prison is accused of setting a fire at his cousin's house that killed five children and\n                        injured four other people, police said. The children ranged in age from 5 months to 10 years. More...\n• Flooded Homes, Power Outages On East Coast\n                     \t\t\t\t\t| Watch• The Duke Case: Innocent\n                     \t\t\t\t\t| Watch• Dreaded Middle-Class Tax May Be Fixed• More StoriesWorldGerman Army Video Shows Racist Bronx Jeer\nThe German Defense Ministry said that an incident in which a soldier was told to imagine facing hostile blacks in the Bronx\n                        while firing a machine gun was \"absolutely unacceptable.\" The incident was captured on an army training video. More...\n• Al-Sadr Orders Ministers To Quit Cabinet• World Bank Chief On The Ropes\n                     \t\t\t\t\t| Watch• Split With Prince \"Devastated\" Middleton\n                     \t\t\t\t\t| Watch• More StoriesPoliticsHillary Banks Big Bucks For Primary\nHillary Rodham Clinton leads all other presidential contenders with $24 million in the bank for the Democratic presidential\n                        primary campaign, even though rival Barack Obama collected more donations for the primary in the first quarter. More...\n• More Post-Crash Surgery For N.J. Governor• World Bank Chief On The Ropes\n                     \t\t\t\t\t| Watch• Gonzales: I've Done Nothing Wrong• More StoriesHealthAutism: More Treatable Than Thought?\nDr. Kenneth Bock says it is, along with ADHD, asthma and allergies, all of which have been rising sharply in recent years.\n                        He discussed his approach, which involves, among other things, detoxifying the body, on The Early Show. More...Watch: Healing The 4 'A' Disorders \n• How Safe Is Imported Food?• No More Diets!\n                     \t\t\t\t\t| Watch• Study: Bullying Common In Grade School• More StoriesSciTechNASA: Mars Probe Doomed By Human Error\nHuman error triggered a cascade of events that caused the battery to fail on the Mars Global Surveyor last year, according\n                        to a preliminary report. More...\n• China Steps Up Online Porn Busts• Google To Buy DoubleClick For $3.1B Cash• Pakistan, China Forge Energy Alliance• More StoriesBusinessStudent Loan Provider Sallie Mae Sold\nTwo private-equity companies and two major banks are paying $60 a share for the largest lender in the $85 billion student\n                        loan industry. Sallie Mae just last week settled a suit about how students are advised on selecting a lender. More...\n• Dreaded Middle-Class Tax May Be Fixed• Google To Buy DoubleClick For $3.1B Cash• Insurance: How Much Is Too Much?• More StoriesEntertainmentMadonna Visits Malawi With Adopted Son\nMadonna flew to Malawi on a silver jet Monday to continue her charity work in the impoverished southern African country, bringing\n                        along the Malawian boy she is in the process of adopting.\n                         More...Watch: Madonna Speaks On 'Oprah'\n• Regis Says He'll Return To TV April 26• Split With Prince \"Devastated\" Middleton\n                     \t\t\t\t\t| Watch• McDreamy Races In Florida• More StoriesOpinionMuddy Waters Still Run Deep For Gonzales\nCBSNews.com legal analyst Andrew Cohen examines the Justice Department's pre-emptive strike on the U.S. attorneys scandal,\n                        as the attorney general prepares to testify on Capitol Hill on Tuesday. More...\n• Andy's Trip To The Auto Show\n                     \t\t\t\t\t| Watch• Obama Headed Off-Track\n                     \t\t\t\t\t| Watch• The Iraq-Al Qaeda Link Revisited\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Celeb Spot: Split With Prince \"Devastated\" Middleton\nPrince William and longtime girlfriend Kate Middleton have called it quits and rumors abound about why. But royal watcher\n                        Katie Nicholl says that Middleton can stand on her own two feet, even though she is very upset by the breakup. More...Watch: Royal Romance Ends\n• ShowBuzz: People In Hot Water: Spector Words May Hurt Him In Murder Trial\n                     \t\t\t\t\t| Watch• EARLY SHOW: Cleared Duke Lacrosse Players Could Sue\n                     \t\t\t\t\t| Watch• EARLY SHOW: Autism: More Treatable Than Thought?\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nAngelou On The Power Of WordsThe comments shock-jock Don Imus made about the Rutgers women's basketball team sparked off a national debate about the power\n                                    of words. Poet Maya Angelou joins Russ Mitchell to discuss.\nTOP VIDEOS\nRunning Against The Wind\nChoosing Healthy Snacks\nPerfect Wedding Day Hair\nJapan Finds U.S. Sushi Lacking\nRoyal Watch On Break-Up\nHealing The 4 'A' Disorders \nPayback For Duke Players?\nA Night Owl's Nightmare\nDuke Players On '60'\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesThe exonerated Duke lacrosse students give their first interview to Lesley Stahl, just days after all remaining charges\n                           against them were dropped. Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryThe Puppet Master:A couple is gunned down, the triggerman is known. But who was pulling the strings behind the\n                           scenes? Troy Roberts reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}