{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nThere's a new generation of terrorists who have\n  learned and mastered their trade in Afghanistan\n  and Iraq,\n  and are now being told they are ready to go into the world. They are trained\n  in war, committed to destruction and some intelligence analysis says they could\n  be headed our way. Sheila MacVicar will have our exclusive report.\n \nIn Iraq,\n  the al Maliki government is facing serious trouble — from the inside.\n  Lara Logan will have the story.\n \nThere was a final salute today in Charleston, South Carolina,\n  as firefighters from around the country gathered at the memorial service for\n  nine firemen killed in a massive furniture-storeroom blaze. Mark Strassmann was\n  at the emotional memorial.\n  \nInteresting new research says that birth order might\n  affect your intelligence. Eldest boys in families tend to develop slightly\n  higher IQs than their younger siblings. Kelly Wallace will report on these\n  controversial findings.\n \nAnyone who's picked up a video game controller knows\n  there's something about certain games that can suck you in. But does rampant\n  video game playing qualify as an addiction for young people? Daniel Sieberg\n  will report on what the American Medical Association has to say on the\n  subject.\n \nFinally, for this week's special Assignment America,\n  Steve Hartman will meet a man who's got a hobby that's straight out of\n  Curious George. Join us to watch him go up, up and away.\n \nHave a great weekend!\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}