{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Spie Sutherland\" <spie@proficio.ca>", "subject": "Re: Definitely unslung", "body": "The sad truth is that the best technology doesn't win, this has \nbeen proven over and over. Truth is the x86 architecture is \nan ugly beast and getting uglier, but the economies of scale\nare huge and prior investment in development is what keeps \nit alive. Surely that is precisely why Apple switched to Intel,\nthe PowerPC is actually superior, so is SPARC and ARM.\nBeta was better than VHS video. What isn't better than \nWindoze? Why am I running it right now? Only because \nthere are still some things I can't do on linux yet. OS/2 was \nlight years ahead of Windows and even RAN windows apps. \nOSX has better prospects (it's based on BSD unix!), and I \nactually think Steve Jobs made the right decision ditching \nPowerPC because Intel compatible is a dime a dozen.  \n\nThe iPhone will use ARM ... like almosy anyPhone in the\nforseeable future. Perhaps this an example where better \ntech does win. There are more ARM processors running \nthan Pentiums right now, just on smaller devices. The wild\nthing is that ARM the company does NOT make silicon.\nThey sell IP ... intellectual property. They have hundreds \nof licensees of ARM IP. You can choose from well over \na hundred different ARM processors just from Digikey \nalone. This is one reason to be interested in ARM and do\nsome work with it, there may come a day when ARM \nwill actually bring the death of the ugly x86. Intel will have\nto design something new or jump on that same bandwagon.\nSo will AMD. What IBM will do is anybody's guess, same\nwith Sun, executives at all three are surely squirming right\nnow.\n  \n  -- Spie\n\nPS. Then there's the iRack LOL\nhttp://www.glumbert.com/media/irack\n  \n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}