{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Doctor's refuse to participate in death-row executions. That story tonight only on the CBS EVENING NEWS WITH KATIE COURIC", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n \n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening \n            News | 48 Hours | 60 Minutes | The Saturday Early \n            Show | CBS Sunday \n            Morning | Face The \n            Nation\n\n\n\n\n(CBS) QUOTE OF THE DAY\n“A sense of humor is part of the art of leadership, of getting \n      along with people, of getting things done.” - Dwight D. Eisenhower \n      \n\nTODAY’S TRIVIA The blood of mammals is red, the blood of \n      insects is yellow, and the blood of lobsters is blue. \n\nTONIGHT ON THE \n      CBS EVENING NEWS Here's an \n      early look at what we are working on for tonight's broadcast of the CBS \n      EVENING NEWS from Anchor and Managing Editor, Kate Couric...\nHi everyone, Officials arrested and charged six men in New \n      Jersey today, claiming the suspects are “Islamic militants” who were \n      plotting to attack one of the country’s largest Army bases. According to \n      authorities, the six men planned to “kill as many soldiers as possible” at \n      Fort Dix Army Base in Northern New Jersey. Correspondent Bob Orr \n      will have the main story and our investigative correspondent Armen \n      Keteyian will look at previous alleged terror plots that have been \n      uncovered by authorities here at home. Also at the top of the \n      broadcast, rivers are rising in the Midwest. They are swelling to the \n      brink in Missouri, Kansas and Oklahoma today, raising fears that local \n      flooding there will grow more widespread. Cynthia Bowers will \n      survey the situation while Nancy Cordes will explain exactly how the \n      Midwest’s geography makes it so susceptible to flooding. Much of \n      the water accumulation now threatening the center of the country is due to \n      the storm system that spawned the tornadoes that leveled Greensburg, \n      Kansas. Hari Sreenivasan is in Greensburg tracking the recovery \n      effort. In North Carolina, doctors are refusing to participate in \n      death-row executions saying that by doing so they violate the physician’s \n      oath. Doctors say it is their right and duty not to participate in \n      executions. But some prosecutors say that’s just not the case and that \n      doctors shouldn’t be able to overrule the justice system. Randall \n      Pinkston will cover the debate. Some of the smallest victims \n      of the war in Iraq go largely unnoticed, though there are thousands of \n      them. The orphans of Iraq often live on the city’s violent streets if they \n      cannot find a place in one of the eight cramped orphanages. Our Mark \n      Strassmann will introduce you to some Iraqi kids who navigate daily \n      danger alone. Finally, headgear with pizzazz has become a \n      signature of Great Britain’s royal family. Mark Phillips will take \n      a look at the hats that are fit for a queen – Queen Elizabeth II. \n      I hope you’ll join us, Katie For more on two of \n      the stories noted above, please click on the following links:\nFeds Arrest Six In Plot Against Army Base Click Here Flood Fears Rise As \n      Rain Pounds Midwest Click Here Here's an early look \n      at one of the stories we are working on for Wednesday's broadcast of the \n      CBS EVENING NEWS The American Spirit. You'll meet a woman who's \n      training the next generation of business leaders-- in a most unlikely \n      place-- a state penitentiary. That story, and much more, Wednesday on the \n      CBS Evening News. If you would like more information on the \n      broadcast, please click on the following address and e-mail us: \n      evening@cbsnews.com \n\nTONIGHT ON DAVID LETTERMAN Actress Jane Fonda will \n      join Dave tonight along with author/Late Show writer Tom \n      Ruprecht… Plus, musical guest Kelly Clarkson! \n\nWEDNESDAY MORNING ON THE EARLY SHOW Harry Smith, \n      Hannah Storm, Julie Chen and Russ Mitchell anchor \n      THE EARLY SHOW from New York. Dave \n      Price will bring us the weather. Along with the top news of \n      the day, we will also have the following stories:\nMORTGAGES: TRIGGER LISTS: A warning to anyone who is \n      applying for or has a mortgage. Whether you know it or not, your personal \n      and financial information could be getting distributed to hundreds of \n      strangers. It can happen the very night you apply for that loan. CBS News \n      Correspondent Mark Strassmann reports on a growing trend taking \n      home buyers by surprise. CSI WEEK: CSI: NY SET VISIT: There \n      is always plenty of drama on CSI: NY. And Wednesday night’s episode \n      is no exception. Wednesday’s episode features a sports legend who is known \n      for his volatility. Sparks fly when John McEnroe is a suspect in a murder. \n      What was it like shooting the scenes for the episode? We visited the set \n      to speak with John McEnroe and CSI: NY star Gary Sinise to find \n      out. LIFE MATTERS: WOMEN WITH ADHD: When you hear the words \n      \"Attention Deficit Hyperactivity Disorder,\" or ADHD, people often think of \n      children, especially young boys who can't sit still in class. But what \n      about the young girl with ADHD who isn't so disruptive? The daydreamer who \n      gets missed? CBS News Correspondent Susan McGinnis will join us \n      with the story of what happens when young girls are not diagnosed. \n      JOEY LAWRENCE TAKES BROADWAY: Teen heartthrob Joey Lawrence \n      is all grown up and soon he will be starring on Broadway. He’ll be taking \n      the stage in Chicago and Wednesday night, he will make a guest \n      appearance on CSI: NY. Wednesday morning, Joey will join us out on \n      our plaza. KITCHEN/BATH INDUSTRY SHOW: The Kitchen/Bath \n      Industry Show & Conference is the world’s largest international trade \n      event dedicated to the kitchen and bath industry. The annual K/BIS event, \n      as it is known, showcases the very latest products and cutting-edge design \n      ideas in the kitchen and bath industry. This captivating event features \n      the largest array of product displays and demonstrations. Wednesday \n      morning, EARLY SHOW guru Danny \n      Lipford will join us live from the show in Las Vegas with all the \n      latest in kitchen and bath designs. MASTER ILLUSIONIST CRISS \n      ANGEL: Criss Angel is one of the most influential names in magic today \n      mystifying fans on his hit A&E show Mindfreak. Now, he takes us \n      deep into his inner sanctum in the new book Mindfreak: Secret \n      Revelations. Wednesday morning, master illusionist Criss Angel will \n      join us on our plaza to show us a few tricks that are sure to amaze! \n      MEET THE JAKES: A staple of Glamour magazine, the \n      Jake: A Man's Opinion column has long been a hit with readers. The \n      column debuted in February 1956 and was the first relationship column \n      written by a man for a national women's magazine. Now, Glamour is \n      looking for the new \"Jake,\" a young single guy to write each month about \n      his real-life search for love. And, for the first time ever, the new Jake \n      will not be anonymous. Glamour narrowed down the contenders and now \n      three men are vying to be Glamour’s next single-guy relationship \n      columnist. In a three-part series, we’re teaming up with Glamour to \n      ask viewers and readers to pick the next Jake. Find out how the three guys \n      would answer your questions and what they believe makes them qualified to \n      be the next Jake. The winner, based on online voting, will be revealed on \n      THE EARLY SHOW on July 6th and in the \n      August issue of Glamour. Wednesday morning, we’ll introduce you to \n      the three contestants. If you would like more information on any \n      of these stories or the broadcast, please click on the following address \n      and e-mail us: earlyshow@cbs.com \n\n\n\nTO SUBSCRIBEClick here to subscribe to \n      the Inside Scoop.TO UNSUBSCRIBEUnsubscribe information \n      is included in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, \n      click here.Contact: Email Administrator, \n      CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n      10019Help | Advertise | Terms of \n      Service | Privacy \n      Statement©MMVII, CBS \n      Interactive Inc. All Rights Reserved. \n\n"}