{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "Direct2Drive <owner-d2d_cp_announce_list@news.ign.com>", "subject": "Download EverQuest 2 All in One Compiliation Today!", "body": "\n\n\nDirect2Drive\n\n\n\n\n\n\n\n\nJune 29th, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWorld of Warcraft - $19.95\nPlayed by over 8 million people world wide, World of Warcraft is the most popular MMO out there. Join Today!\n \nDriver: Parallel Lines - $19.95\nExperience the Driver franchise that?s sold over 14 million copies with Driver Parallel Lines PC. \n \nCall of Juarez - $49.95\nFight your way through the Wild West, birthplace of the term \"shooter,\" in the only game to give you an authentic look into the Old West and all its glory through the eyes of the hunter AND the hunted.\n\n\n \n \n \n \n \n\n\nPeaceMaker - $19.95\nPeaceMaker is inspired by real events in the Israeli-Palestinian conflict. The game challenges you to succeed as a leader where others have failed. Experience the joy of bringing peace to the Middle East or the agony of plunging the region into disaster...\n \nMedieval 2: Total War - $39.95\nTake command of your army and expand your reign in Medieval II - the fourth installment of the award-winning Total War series of strategy games... \n \nEverQuest: The Anniversary Edition - $19.99\nIncludes all available in-game retail items from all 13 expansion packs! \n\n\n \n \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\nEverQuest II: All In One Compilation\n$39.99\n6\n\n\nNeverwinter Nights 2\n$29.95\n\n\n2\n\n\nWorld of Warcraft\n$19.95\n7\n\n\nThe Matrix Online\n$19.99\n\n\n3\n\n\nVampire: The Masquerade - Bloodlines\n$19.95\n8\n\n\nWarhammer 40k: Dawn of War GotY\n$19.95\n\n\n4\n\n\nCall of Juarez\n$49.95\n9\n\n\nCivilization 4\n$39.95\n\n\n5\n\n\nEverQuest: The Anniversary Edition\n$19.99\n10\n\n\nFar Cry\n$9.95\n\n\n\n\n\n\n\n\n\nTo Unsubscribe: Click Here.\n\t\t\t\nYou have received this e-mail because you are a registered user of GameSpy and have opted-in to receive GameSpy email updates concerning new products and services. If you believe you're receiving this e-mail in error or prefer not to receive promotions from GameSpy.com, reply to this message to opt out of future promotional mailings. Our privacy policy is viewable at http://corp.igngamespy.com/privacy.html. You may still receive other e-mails from GameSpy. To update your e-mail address or manage your account, visit GameSpyID.com. It may take up to 10 days for adjustments to your email preferences. If you have questions about this offer or your services, you can reach Customer Service here.\n\t\t\n\t\tYou may mail inquiries to: IGN Entertainment, Inc., 8000 Marina Boulevard, 2nd Floor, Brisbane, CA 94005\nCopyright © IGN Entertainment, Inc. All rights reserved.  \n\n\n\n\n\n\n\n\n\n\n\n\n"}