{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "\"rmbordalo rmbordalo\" <rmbordalo@gmail.com>", "subject": "[cc-community] Fwd: needing some copyright advice", "body": "Hello everybody,\n\nWe are a small group of people that are working to publish an art\nmagazine on the internet. We plan to deliver it for free in .pdf\nformat, under the Creative Commons Attribution-Noncommercial-No\nDerivative Works 3.0 License. The magazine will include articles\nsubmitted by the readers and we've chosen CC so that the respective\nauthors may keep the copyright of their work after publication. The\nlicense is mentioned during the submission process that they must\nfollow in order to send us their articles so we can make sure that\nthey read it. However, we still have two questions:\n\n1. Do we need to ask them to sign an agreement in paper to get assured\nthey really took knowledge of the License terms? (as I read in the FAQ\non the website, \"you can only secure this kind of permission if you\nare in direct contact with the person, discuss Creative Commons\nlicensing with them and they agree to a specific license;\").\nWould it be enough for example to simply state on our website\nsomething like \"in the moment a submission is received, it is implicit\nthat the authors took knowledge of the terms specified by the license\nand agree with them?\"\n\n2. As I mentioned before, the magazine will be available for free\ndownload. However we plan to publish other special issues for selling\nthem on the website. We also want to reuse the content of the website\nitself (but not the articles of the readers!) and to include it in\nfuture possible prints for sale. Our question is: can we apply the CC\nLicense only to the magazine in .pdf but not to the website itself,\nwhich we would  like to keep under the traditional (c) \"All rights\nreserved\"?\n\nWe would really appreciate if somebody could give some advice,\n\nThank you very much for taking the time.\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}