{"category": "ham", "to_address": "debian-desktop@lists.debian.org", "from_address": "Marina <sjvj@gkbaum.com>", "subject": "beeper droop", "body": "SREA Jumps 45% After News Releases!\n\nScore One Inc.\nSREA\n$0.29 UP 45%\n\nSREA announced its plan to develop a $75 Million project duplicates a\nsuccessful plan in 2006 than returned over $100 million in profits.\nInvestors are getting in fast. Read the news and get all over SREA\nTuesday!\n\nYou in know way are forced to buy it.\ndoc format for ISO certification?\n\nIt was a delicate balance to strike between functionality and overall\nsize. Most of the rest of us like having a couple of options. Go get a\ngood job and buy it.\n\nAlthough it will be hard to implement of course just like ODF is.\nBALD-FACED LIE: \"ODF is hard to implement.\n\nI also think that the controller if garbage. Just imagine how much\ninteroperability we could have in the world if we simply could\nstandardize more formats. Anyway, ODF is not that easy to implement\nwithout looking at OpenOffice messy source code, just ask the guys at\nAbiWord.\nWhat are they afraid of? Likewise, many offenders are ones who fall into\nan authority figure category, such as teachers, youth group leaders,\nreligious ministers and the like, who have some relationship with the\nvictims.\n\nWhy should we stop at MS-OOXML?\n\nHe also admitted that the Nintendo Wii had broad appeal to consumers,\nand acknowledged his success.\n\nAbout the Wii,  give me a break.\nNot to mention that the introduction of VB. let's face it if your a\nconvicted sex offender your life is over, might as well kill yourself.\n\"Just as the automobile can co-exist with the airplane, ODF and Open XML\ncan and should co-exist, the team writes.\n\nThere is a perception that the vast majority of sex offenders will\nrepeat their crimes. They want recurring income. In that case, I do\nwonder whether standardization is the most appropriate way, and\nshouldn't you look to some of the other tools that you have available to\nyou, to address interoperability? Hopefully ISO will not ratify OXML as\na standard.\nOnly when customers demand that vendors meet a standard will compliant\nproducts be produced.\nYes a PC costs more but I would use a keyboard and mouse solution if\ngiven the chance. The object of that yet-to-be Microsoft-implemented\nfunctionality within it's own packages, to ensure that an author using a\nMicrosoft tool to publish a document has the widest possible audience.\nOpen Microsoft Expression Blend.\nIf we have that, the competition will be much better, and end-users will\ngreatly benefit from it. In order to use the functionality, the user\nmust log in and create a \"travel map\" that shows the places he has been.\n\nA port of OpenOffice for god sake.\nConversion is what they do. MS has done nothing but make improvements to\ntheir console.\n\nOther systems have had a steady stream of titles since launch. Clearly,\nsome things have been factored out of the .\n\nMerging Library and Developer Centers.\n\nEvery application, could have its own standard format, or maybe two or\nthree. More choices is good.\n\nThat's what we are trying to refine,\" he told the Financial Times on\nThursday.\n\nYes it looks nice but the game is just BORING.\nI can't wait to hear your wailing and screaming when MS-OOXML gets\nrejected in September. I think there should be a death penalty or life\nimprisonment for men and women who do this.\n\n\"More from our interview with Tom Robertson, general manager of\ninteroperability and standards at Microsoft, later in BetaNews.\nResearch studies by the US Dept. We are dealing with human beings,\ntherefore each and every one is different.\n\nAnd KOffice also does not use ODF if your document are complex, and will\nask you to save in their own format especially in word processing and\npresentation. The company says that in real world situations, consumers\ntypically rely on travel advice from their friends anyway, so\nTripAdvisor is taking that concept and applying it to its business.\n\nShould I instead take your methodology of simply cutting and pasting the\ntestimony from the latest \"experts\"?\nA port of OpenOffice for god sake. The Wii is not HD capable and does\nnot have DVD. In order to use the functionality, the user must log in\nand create a \"travel map\" that shows the places he has been.\n\nHow many Microsoft employees does it take to change a light bulb? Those\nstalking parks and cyberspace are actually quite the minority.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}