{"category": "ham", "to_address": "IP-Health <ip-health@lists.essential.org>", "from_address": "Benjamin Krohmal <ben.krohmal@keionline.org>", "subject": "[Ip-health] Brazil rejects Merck price offer", "body": "--\n[ Picked text/plain from multipart/alternative ]\nhttp://www.reuters.com/article/healthNews/idUSN0325916620070503\n\nBrazil rejects Merck price offer for AIDS drug\nThu May 3, 2007 2:40PM EDT\n\nBy Natuza Nery\n\nBRASILIA (Reuters) - Brazil's president is to decide whether his\ncountry will honor Merck & Co's AIDS drug patent, after the health\nministry rejected the company's price-cut.\n\n\"We consider the offer insufficient and we told the manufacturer,\"\nBrazil's health minister, Jose Temporao, told Reuters on Thursday.\n\"The decision (on whether to break the patent) is now being analyzed\nby the president.\"\n\nThe government said last week it was considering importing generic\nversions of the drug, Efavirenz, for Brazil's lauded AIDS treatment\nprogram if it decides not to honor the patent. It has not mentioned\nany plans to make the drug locally. Brazil has threatened to break\npatents before, but has hammered out deals in the end.\n\nUnder World Trade Organization rules, a country can sidestep patents\nby issuing a \"compulsory license,\" which allows production and\nimports of generic drugs for public health and national emergencies.\nBrazil declared the drug \"in the public interest\" and too expensive\nto buy.\n\nBrazil wanted Merck to cut the price of Efavirenz to $0.65 per pill\n-- the same price paid by Thailand -- from $1.57 per pill paid by\nBrazil, the ministry said.\n\nA source close to the negotiations said the New Jersey-based\ndrugmaker has since come back with an offer of $1.10 a patient per\nday, but Brazil rebuffed that bid. The source said the talks were at\nan impasse.\n\nMerck sells the drug for $1.80 per day in most middle-income\ncountries, according to the company.\n\n\"We at Merck are disappointed to have had what we considered to be a\nfair offer rejected by the government of Brazil,\" Merck spokeswoman\nAmy Rose said, adding that Merck had repeatedly requested a face-to-\nface meeting with the health ministry to \"further explore a mutually\nacceptable agreement\".\n\n(Additional reporting by Kim Dixon in Chicago and Ricardo Amaral in\nBrasilia)\n\n\nBenjamin Krohmal\nCoordinator - Project on Medical Innovation\nKnowledge Ecology International\nTel: +1-202-332-2670 ex. 14\nFax: +1-202-332-2673\nben.krohmal@keionline.org\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}