{"category": "ham", "to_address": "debian-legal@lists.debian.org, Kern Sibbald <kern@sibbald.com>", "from_address": "Steve Langasek <vorlon@debian.org>", "subject": "Re: Bacula: GPL and OpenSSL", "body": "On Fri, Jun 08, 2007 at 09:11:45AM +0200, Kern Sibbald wrote:\n\n> However, the \"strict\" interpretation would imply that the GPL is not fair (in \n> the sense of compaints about the Novell - Microsoft contract), because I can \n> distribute Bacula binaries because no where on any of the project sites do we \n> distribute OpenSSL, but then the strict definition says that you cannot \n> distribute Bacula because you have OpenSSL someplace on the distribution \n> disks, or on your servers.\n\nI'm not familiar with the arguments that have been made in the case of\nNovell-Microsoft.  I'm certainly not aware of any argument why this aspect\nof the GPL is not \"fair\" (=permitted under law) in a legal sense.\n\n> > In recent times, it \n> > appears that some Unix vendors such as Sun and Apple have also begun\n> > distributing GNU software as part of systems whose cores are not licensed\n> > compatibly with the GPL, with the FSF's tacit consent; that seems\n> > ill-advised to me, but in any case the FSF's interpretations of the GPL\n> > aren't binding on other copyright holders where those interpretations don't\n> > follow logically from the text of the license.\n\n> I'm not sure Sun and Apple are so ill-advised.\n\nSorry, I meant that I considered it ill-advised for the FSF to give their\ntacit approval. :)\n\n> > > By the way, just to be clear, I consider all this (not you guys but these \n> > > license difficulties) to be a real pain.  As long as the code is Open \n> Source \n> > > (i.e. I can get it, see it and modify it), I have no problem with it being \n> > > linked with Bacula. \n\n> > Ah, well, that right there is sufficient for us to use as a license\n> > exception grant. :)  But of course it's not binding on other copyright\n> > holders.\n\n> If that resoves the problems, great.  Here is what I have just added to the \n> LICENSE file -- hopefully it should be clear.  Here is a snippet from the \n> LICENSE file ...\n\n> ...\n> License:\n> For the most part, Bacula is licensed under the GPL version 2\n> this code is listed under Copyright Free Software Foundation\n> Europe e.V. A small part of the code (less than 20 files) is\n> copyrighted under the GPL by other people (FSF, Sun, ...).\n\nOh.  So this is a case where you've assigned copyright to FSFE?  Does the\nFSFE's copyright assignment procedure give you the right to continue\nlicensing your code under any license of your choice?\n\n> What follows is information from the authors of the code:\n\n> Linking:\n> Bacula may be linked with any libraries permitted under the GPL.\n> However, if configured with encryption Bacula does use the\n> OpenSSL libraries which are, unfortunately, not compatible with\n> GPL v2.  To the best of our knowledge these libaries are not\n> distributed with Bacula code because they are shared objects, and\n> as such there is no conflict with the GPL according what I (Kern)\n> understand in talking to FSFE, and in any case, for the code that\n> I have written, I have no problems linking in OpenSSL (of course\n> this does not speak for the few files in Bacula that are\n> copyrighted by others).  If you take a more severe stance on this\n> issue, and you are going to distribute Bacula, then simply do not\n> use the --with-openssl when building your package, and no use of\n> OpenSSL even through dynamic linking will be included.\n> ...\n\nSeems rather overwrought to me for inclusion in a license file.  I would\nsuggest one of the following two approaches, either:\n\n  In addition, for code copyright $foo, permission is explicitly granted to\n  distribute binaries dynamically linked with libraries distributed under\n  the OpenSSL license, even in cases where those libraries are distributed\n  together with the binaries.\n\nor:\n\n  It is the understanding of $foo that the GPL permits distribution of\n  binaries dynamically linked to OpenSSL, even in cases where OpenSSL is\n  distributed together with the binaries.\n\nBut if the code is copyright: FSFE, I don't know if this is something you\nwould have to clear with them first.\n\n> > > The problem is that those third-party sources are linked into the Bacula \n> > > binaries, and since they are licensed as GPL with no modifications, I \n> > > cannot include them in a binary that has code that is licensed in a way\n> > > that is incompatible with the GPL.  Adding the OpenSSL exception to my\n> > > license makes my code incompatible with the non-modified GPL, and\n> > > hence I was violating the license on those 3rd party files\n> > > (copyrighted by FSF, ATT, Sun, and a few others ...). \n\n> > To be clear here, it's not incompatible with the GPL for you to grant\n> > additional linking permissions, which is what is being done.  The only real\n> > issue is that you can't grant such permission on behalf of other copyright\n> > holders.\n\n> That is what I believed, but according to Fedora/Red Hat and FSFE, the fact \n> that I have mixed code in a single binary that is \"pure\" GPL for which I \n> (FSFE) do not hold the copyright and GPL with a modified license violates the \n> license given by the authors of the \"pure\" GPL.  Since that is serious to me, \n> and I am not a lawyer, and I have first hand experience in how \"illogical\" \n> (IMO) judges can be, I prefer to avoid the problem and not modify the GPL.  \n> So now Bacula is all \"pure\" GPL with no modifications with my explanations in \n> notes rather than as modifications of the license.\n\nWhat I understand from your other message is that previously, you had\nmodified the text of the license under which the code was being distributed.\nThat in particular is something that you can't do without permission from\nall of the copyright holders, AFAICS.\n\nCheers,\n-- \nSteve Langasek                   Give me a lever long enough and a Free OS\nDebian Developer                   to set it on, and I can move the world.\nvorlon@debian.org                                   http://www.debian.org/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}