{"category": "spam", "to_address": "captains@flax24.uwaterloo.ca", "from_address": "\"Patty Elliott\" <lexexperienceprinciplevub@experienceprinciple.nl>", "subject": "Achieve picture perfect weight and enjoy life", "body": "\nAchieve picture perfect weight and enjoy life\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting product for over-weight people is now available – As told on ABC\n\n\n\nDid you understand that excessive body kilos kill a plenty of people around the whole world? We believe that you hate the ugly appearance of those people and the social bias against them. \n\nOr, maybe, you have not the will to withstand pressure of baneful eating habits of yours. This all sounds familiar? Then we have something for you!\n\n\n\n\n\nHere Anatrim comes, the later product for the reduction of your body’s extra weight. The astounding thing about Anatrim is it improves the quality of your life, making you feel no hungry and giving you better cheer. Read what people write to us about this product:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of watching TV continually and always glutting myself with food \n\n\nI became more interested in doing exercise.\n\n\n\n\n\n\n Anatrim set me on the right path.\n\n\n I have a great shape now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nMaria H., Chicago\n\n\n\n\n\n\n\"I tried some passive weight burning, but with no result. I was difficult for me to hold in my ravenous hunger. \n\n\nOne day I heard on Anatrim in the media advertisement and it brought a great influence on me.\n\n\n I had attempted using it, and my wife said to me I'm a different person now, 4 months later. \n\n\n33 pounds have gone away and I keep losing them! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nSteve Doubt, New York\n\n\n\n\n\nAnatrim helps you to realize that your body doesn’t need that much food. It raises your mood up, provides you with additional energy, and attacks useless kilos. All thanks to its mighty newly-elaborated formula!!\n\n\n\nElicit latest news!\n\n\n\n"}