{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "\"Health Week\" <mailings@mail.cnn.com>", "subject": "This Week in Health", "body": "\n\n\n\n\nCNN.com - Health Week\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFriday, April 13, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNo scientific evidence diet supplements halt aging\nAmericans spend billions of dollars a year on dietary supplements in hopes of gaining energy, warding off disease and slowing down the aging process. Yet for all the money spent, and growing interest from mainstream physicians, virtually no evidence exists that supplements can improve your health\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDiabetes complications swell health costs\nPoorly managed type 2 diabetes costs the U.S. health system an extra $22.9 billion a year to treat heart, eye, kidney and other serious health problems associated with the disease.\nFULL STORY\n\n\n\n\n\n\nInsect-based flu vaccine shows promise \nGenetically engineered flu vaccine made from yellow striped caterpillars instead of hen eggs has been shown for the first time to keep people from getting the flu, scientists say.\nFULL STORY\n\n\n\n\n\n\nSeverely obese fastest-growing overweight group\nPeople who are 100 pounds or more overweight are the fastest-growing group of overweight people in the United States, researchers reported Monday.\nFULL STORY\n\n\n\n\n\n\nStatin drugs lower risk of death from respiratory issues\nPeople who use statin drugs are less likely to die of influenza and chronic bronchitis, according to a study that shows yet another unexpected benefit of the cholesterol-lowering medications.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Health Week email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}