{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Juliet Salgado\" <kordistantheatnaw@distantheat.com>", "subject": "Control your weight and appetite", "body": "\nStop the painful craving for more food\n\n\n\n\n\nAnatrim – The latest and most exciting product for over-weight people is now easily available – As could be seen on BBC\n\n\n\nDo you understand that superfluous body kilograms kill a lot of people around the planet? We believe that you hate the unsightly look of those people and the low status they obviously have in society. \n\nMoreover, you can’t withstand a siege of ruinous eating habits of yours. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nHere comes Anatrim, the new product for the elimination of your body’s extra weight. The most astonishing thing is that Anatrim improves the quality of your life, making you crave food less and giving you joyful spirit. Here’re some notes from our customers:\n\n\n\n\n\n\"It is outstanding! \n\n\nInstead of watching TV and gorging any food easy to reach \n\n\nI became rather more interested in exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I’m more fit now and there are lots of men in my way!\"\n\n\n\n\n\n\nVictoria K., Boston\n\n\n\n\n\n\n\"Passive weight burning was of no result to me. I could not restrain my ravenous hunger. \n\n\nOne day I heard on Anatrim in the commercial and I was really effected by the information.\n\n\n I had tried using it, and my wife said I’m not more a weighty man now, 4 months later. \n\n\n26 pounds off and this is still far to an end! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nSteve Doubt, Colorado\n\n\n\n\n\nAnatrim helps your mind to realize that your body doesn’t need that much food. It improves your mood, provides you with additional energy, and attacks needless kilos. Especial thanks to its mighty original formula!!\n\n\n\nElicit latest news!\n\n\n\n"}