{"category": "ham", "to_address": "smiles@flax9.uwaterloo.ca", "from_address": "TopCoder Competitions <competitions@topcoder.com>", "subject": "TopCoder(R) Single Round Match sponsored by AOL(R) - $5,000 prize\n purse!!", "body": "Hello sm1lies,\n\nTopCoder(R) Single Round Match 355 is scheduled for Wednesday, June 20 at 9:00 PM Eastern Daylight Time (UTC/GMT -4 hours).\n\nPlease be sure to check here for the start time in your time zone:\nhttp://www.timeanddate.com/worldclock/fixedtime.html?day=20&month=6&year=2007&hour=21&min=00&sec=0&p1=179\n\n* $5,000 in SRM prizes, provided by AOL, will be given away during this match\n* Registration will begin at 6:00 PM and will end at 8:55 PM Eastern Daylight Time\n* Allowable programming languages are Java, C++, Microsoft(R) Visual\nC#(R) .NET, and Microsoft Visual Basic(R) .NET\n* TopCoder Administrators will be available in the Admin Lobby Room to answer questions\n* For more details click here: \nhttp://www.topcoder.com/tc?module=MatchDetails&rd=10712\n\n------------------------------------------------------\n\nSRM 355 is sponsored by AOL.  AOL representatives will be in the chat room starting at 8:00 PM EDT (GMT/UTC -4) for an introduction to the MapQuest APIs.\n\nAOL, one of the world's largest online communities, has opened its doors and is inviting you, the developer, in.  Available at dev.aol.com, the AOL Developer Network provides developers with direct access to AOL's technology platform, open APIs, and design tools.  And with development centers in the U.S., Europe, and Asia, AOL wants to hear from you if you are seeking new career opportunities and want to help shape the next generation of Web applications.  For information on job opportunities:\n\nhttp://www.topcoder.com/tc?module=Static&d1=tournaments&d2=tco07&d3=sponsorspatrons&d4=aol\n\n------------------------------------------------------\n\nBest of luck to you in the Arena!\n\n- The TopCoder Competitions Team\n\n===================================================================\nYou have received this email because you indicated in your TopCoder profile that you want to be notified of TopCoder competitions.  If you no longer wish to receive these emails, login to www.topcoder.com/tc and click on 'Update My Profile'.  In the 'Email Notification' section of your TopCoder profile, you have the option to enable or disable receipt of various types of TopCoder emails.  Be sure to save any changes to your member profile.\n\nwww.topcoder.com\nTopCoder, Inc.\n703 Hebron Avenue\nGlastonbury, CT 06033\nPhone: 1-866-867-2633\n\n\n"}