{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Attorney General on the Hot Seat on the Hill:  What does the public think about it?  A NEW CBS POLL", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nQUOTE OF THE DAY\"When the gods wish to punish \n      us, they answer our prayers.\" - Oscar Wilde \n\n\n\nDID YOU KNOW?Although identified with \n      Scotland, bagpipes are actually a very ancient instrument, introduced into \n      the British Isles by the Romans. \n\n\n\nTONIGHT ON THE CBS EVENING \n      NEWSHere is an early preview of what Awe \n      are planning for tonight’s CBS EVENING NEWS from Anchor and Managing \n      Editor, Katie Couric… Hi everyone, Tonight we’ll \n      continue our coverage of the tragedy at Virginia Tech. Bob Orr will \n      report new details on the investigation into the life of the gunman, Cho \n      Seung-Hui. In college, Cho was so introverted that his own roommates \n      barely knew him. Sharyn Alfonsi will share her interview with one \n      of the students who lived closest to Cho. Meanwhile, Attorney \n      General Alberto Gonzales was on the hot seat in a Senate hearing on the \n      firing of eight federal prosecutors who some Democrats say were improperly \n      dismissed. Jim Axelrod will have the story. And we’ll have a new \n      CBS News poll on the subject. And Dr. Jon LaPook will share \n      the results of research that offers the strongest evidence yet that \n      menopause hormones could raise the risk of breast cancer. Rates of the \n      cancer plunged in 2003 after millions of women stopped taking hormones and \n      breast cancer rates stayed at the lame level in 2004, adding to the \n      evidence against use of menopause hormones. And one day after the \n      Supreme Court affirmed the legality of the Partial Birth Abortion Ban Act, \n      our correspondent Wyatt Andrews will take a look at the impact of \n      the ruling. It's the start of what is going to be a long, intense debate. \n      Finally, Jerry Bowen will have the story of an \n      extraordinary man battling a crippling disease. So far, he’s winning: Last \n      week he crossed the finish line of the Boston Marathon. Thanks, \n      and I hope you’ll join us tonight. Katie\nFor more information on these stories, please click on the \n      following links: Va. Tech Killer Picked On, Classmates \n      Say Click \n      Here Gonzales Defends Prosecutor Firings Click \n      Here And here’s a look at one of the stories we’re working \n      on for Friday’s broadcast: After a difficult week, Steve \n      Hartman will introduce us to a man who devotes his life to bringing a \n      little joy to people in need. On this week's Assignment America. \n      That story and much more, Friday, on the CBS Evening News. \n      If you would like more information on any of these stories or the \n      broadcast, please click on the following address and e-mail us: evening@cbsnews.com \n\n\nTONIGHT ON DAVID \n      LETTERMANJoin Dave tonight on The Late \n      Show with actor/comedian Gary Shandling AND American \n      Chopper stars Paul Teutul Sr. and Jr... Plus, musical guests Tokyo \n      Police Club! \n\n\n\nFRIDAY MORNING ON THE EARLY SHOWHarry Smith, \n      Russ Mitchell and Tracy Smith anchor THE EARLY \n      SHOW from New York. Julie Chen anchors from Los Angeles. \n      Dave Price will bring us the weather. Hannah Storm is off. \n      Along with the top news of the day, we will also have the \n      following stories: STUDY HALL - STUDENT ENTREPRENEURS: \n      For a teenager, what's cooler than being captain of the football team? \n      Well, how about owning a million dollar company? There was a time when if \n      you wanted to be popular in high school you tried out for football or the \n      cheerleading squad. But now, there is a new way for kids to really shine. \n      All you have to do start your own company. Friday morning, we'll meet two \n      high schoolers who did just that. DEAN CAIN IN CROSSROADS - A \n      STORY OF FORGIVENESS: In a movie inspired by real events, \n      Crossroads: A Story of Forgiveness, paints the difficult portrait \n      of the tragic consequences of reckless driving. A remorseful student \n      speaks out about the dangers of careless driving and how one mistake \n      behind the wheel can change things for good. As Dean Cain, who we all \n      remember from The Adventures of Lois & Clark, portrays Bruce \n      Murakami, a man whose wife and daughter are killed in a terrible car \n      accident. Cain brings a vulnerability to the role and it is a pleasant \n      departure for the actor, from portraying the Man of Steel on the small \n      screen. Friday morning, we will speak with Dean Cain about the importance \n      of this film and the message it conveys. HIDDEN TREASURE: \n      If you have ever dreamed about finding hidden treasure in your home, then \n      this story just might give you hope. Two Renaissance paintings bought \n      forty years ago for two hundred dollars, have sold for 3.4 million dollars \n      in an auction in England. And for years, they hung behind the spare room \n      door in an elderly woman's home. CBS News Correspondent Sheila \n      MacVicar will take a look at these valuable paintings. If you \n      would like more information on any of these stories or the broadcast, \n      please click on the following address and e-mail us: earlyshow@cbs.com \n\n\n\n\n \nSATURDAY \n      ON 48 HOURS\nHere's a note from Bill Lagattuta on Saturday's \n      48 Hours Mystery, NIGHTMARE IN NAPA: \n      \"Our story this week sounds a lot like the plot of one of those \n      Hollywood slasher flicks. But this story really happened. Two young women \n      viciously murdered in their home by an unknown attacker with a knife who \n      disappeared into the night. And it happened on Halloween. The scene of the \n      crime was the beautiful Napa Valley, America's premiere wine country in \n      California. That made the crime seem even more brutal because killings \n      like that are unheard of in Napa. As we covered the story of the crime \n      three years ago, the killer was still at large and the chance of finding \n      him began to dwindle with each passing month. The families grew frustrated \n      as police seemed unable to turn up new evidence or find suspects. And then \n      it happened... an ending to this story almost a year to the month of the \n      murders. I won't spoil it... the accused killer is someone no one \n      suspected. I hope you'll join us on Saturday night.\" - Bill \n      Lagattuta 48 Hours Mystery airs Saturdays at \n      10pmET/PT FOR MORE ON THIS STORY, WHY NOT READ THE \n      BOOK? 48 Hours Mystery, Nightmare in \n      Napa is now available in bookstores and online at \n      Amazon.com Click Here. This is the first in a brand \n      new series of true crime books published by Simon and Schuster, Pocket \n      Books. Here's more from 48 Hours \n      producer and author Paul LaRosa. \"Nightmare in Napa \n      is the first in a series of true crime books based on the broadcasts of \n      CBS News' 48 Hours Mystery. It is the \n      chilling story of what happened to two women in a house in Napa, \n      California on Halloween night, 2004. 48 Hours \n      Mystery already had produced an hour on the story when Executive \n      Producer Susan Zirinsky and Executive Editor Al Briganti \n      hatched the idea to do a series of true crime books. They asked me to get \n      involved and write the first book because I had then recently published a \n      true crime book of my own called Tacoma Confidential. I \n      began reviewing all the tapes from the Napa broadcast and, as always, \n      there were a lot. That's something most viewers do not realize. In \n      producing any hour for 48 Hours Mystery, producers typically \n      will supervise the videotaping of more than one hundred hours of \n      interviews and other material. All of those hours are edited down to make \n      a compelling, fast-moving, one-hour broadcast for prime-time television. \n      This should give you an idea of the wealth and breadth of material we \n      compile for each broadcast. Because of time restrictions, a lot of \n      material never makes it onto the air. So much is left out that, well, you \n      could write a book, and that's just what we're going to do in this series. \n      Just under three-hundred, thirty-minute tapes existed for the \n      first hour. I went through a good portion of them but decided I had to go \n      to Napa and meet the principals and get a feel for the town and the Napa \n      Valley. So that's what I did. I got to meet, have lunch with or email many \n      of those involved with the story. In some cases, I did original reporting. \n      The original hour ended with the arrest of the murderer but now the case \n      had to wind its way through the courts. I followed it every step of the \n      way, culminating with the dramatic sentencing of the defendant in January, \n      2007. Along the way, I got a real sense for the lives of the two \n      murder victims: Adriane Insogna and Leslie Mazzara, and I hope that I've \n      been true to their memories in the book. They were both special young \n      women whose families are heartbroken by their loss. In many ways, the most \n      surprising aspect of the story is not the murder itself but the identity \n      of the murderer and his reasons for doing what he did. To buy the \n      book: Click Here I can't wait until you \n      read it and please send along your comments. My email is PLR@CBSNEWS.COM or look at my website: PaulLaRosa.com Click Here.\" Thanks, Paul \n      LaRosa If you would like more information on any of these stories \n      or the broadcast, please click on the following address and e-mail us at: \n      48hours@cbsnews.com \n\n\nSUNDAY \n      ON 60 MINUTES\n \nMIND OF AN ASSASSIN: Few people know \n      more about the minds of assassins than those protecting the president of \n      the U.S. Secret Service intelligence officers compare their research to \n      the characteristics of the Virginia Tech shooter. Scott Pelley \n      reports. LIFE IN BAGHDAD: Bombs, shootings and long gas \n      lines are some of the obstacles that residents of Iraq's capital city must \n      deal with daily to survive. Lara Logan reports. STOP \n      SNITCHIN': Anderson Cooper reports on how the hip-hop culture's \n      message not to cooperate with the police in any way has undermined efforts \n      to solve murders across the country. \n      \n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help \n      | Advertise | Terms \n      of Service | Privacy \n      Statement©MMVII, CBS Interactive Inc. All Rights Reserved. \n      \n"}