{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Financial Times: Indonesia lifts bird flu sample ban", "body": "Indonesia lifts bird flu sample ban\n\nBy Andrew Jack in Geneva\n\nPublished: May 16 2007 03:00 | Last updated: May 16 2007 03:00\n\nIndonesia said yesterday it had resumed sharing samples of the H5N1\nbird flu virus from infected humans with the World Health Organisation.\n\nBut it warned it would not allow pharmaceutical companies to use the\nsamples for vaccines unless they were swiftly and affordably made\navailable to the developing world.\n\nSiti Fadillah Supari, the country's health minister, told delegates at\nthe annual World Health Assembly in Geneva that she had stopped sharing\nvirus samples with international researchers last December because the\nWHO had passed on strains to other parties without -consent.\n\nThe move was the latest step in challenges to the WHO's framework for\ndisease control and intellectual property rights concerning medicines\nin the developing world, with important implications for global health\nand the pharmaceutical industry.\n\nWhile stressing that Indonesia was not seeking royalties from vaccines\nbased on the strains it provided,the minister called themechanisms for\nvirus-sharing co-ordinated by theWHO \"unfair\" and said \"developing\ncountries must be assured of equitable access\".\n\nShe said any vaccine producers must pledge preferential pricing,\ntechnology transfer and distribution to countries based on need not\nwealth.\n\nHer comments came as Indonesia introduced a resolution on sharing\nviruses that would require \"the transparent, fair and equitable sharing\nof benefits\" from vaccines developed from virus samples.\n\nIt said vaccines made from the viruses must be \"affordable and readily\navailable in developing countries\".\n\nWHO representatives agreed that a drafting -committee would draw up\ncompromise proposals for approval before the end of the health assembly\nnext week.\n\nThe WHO has attempted to apply its existing long-standing procedures\nfor -seasonal flu to potential pandemic strains, which gives\ninternational researchers and drug companies access to viruses that\nemerge each year so they can be sequenced, made safe and used to\ndevelop vaccines.\n\n\"The situation is unacceptable,\" Ms Siti Fadillah said. She said virus\nstrains provided by Indonesia to the WHO had been passed on without its\nconsent to -academic researchers who published their findings in\njournals, and to commercial companies which then sought to patent their\nwork.\n\nOther countries and pharmaceutical companies warned that the proposals\ncould discourage drug companies from developing new vaccines and slow\ndown the WHO's system for rapid international sharing of flu viruses.\n\n\"If we can't get the reference strains, we can't do the studies and we\ncan't develop the vaccines,\" warned Tony Colegate, scientific\nco-ordinator for the pharmaceutical industry's Influenza Vaccine Supply\ntask force and an executive with Novartis -Vaccines.\n\nHe said a system for industry to contribute to international vaccine\nstockpiles for developing countries could be a possibility but\nexpressed frustration that the vaccine industry was shut out from the\ntalks with the WHO.\n\nBackground\n\nBy John Aglionby in Jakarta\n\nIndonesia is the country worst affected by bird flu with 76 deaths.\n\nTriono Soendoro, its deputy health minister and architect of the\nstrategy of withholding samples, said Indonesia was not engaged in a\nfight with the WHO. \"Indonesia is working for the common good of\nhumanity, while others are just working for profit,\" he said. \"We just\nwant to shine a light on something unacceptable.\" He said the new\nsystem should include a mechanism whereby \"if a novel virus emerges,\nthe WHO will be empowered to mobilise vaccines from around the world to\ntreat it\".\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}