{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "New hope in the treatment of osteoporosis. You'll hear it first TONIGHT on the CBS EVENING NEWS WITH KATIE COURIC.", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n \n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening \n            News | 48 Hours | 60 Minutes | The Saturday Early \n            Show | CBS Sunday \n            Morning | Face The \n            Nation\n\n\n\n\n(CBS) QUOTE OF THE DAY\n“Life isn't fair. It's just fairer than death, that's all.”\n- William Goldman \n\nDID YOU KNOW? The Bledowska Desert in Poland is the only \n      true desert in Europe. \n\nTONIGHT ON THE CBS \n      EVENING NEWS Here's an early look \n      at what we are working on for tonight's broadcast of the CBS EVENING NEWS \n      from Anchor and Managing Editor, Katie Couric... Hi everyone, \n      The House of Representatives this afternoon failed to override \n      President Bush’s veto of the funding bill for Iraq that would have started \n      withdrawing troops by October 1. So what’s next? While House Speaker Nancy \n      Pelosi has said Democrats will work with the White House to strike a deal, \n      but she’s also said “there is a great distance between us right now.” \n      Jim Axelrod will have the latest on the stalemate and David \n      Martin will report on the benchmarks that may be discussed for Iraq. \n      Yesterday’s immigration rallies across the United States were \n      smaller than last year’s, but more than just harsh words were exchanged at \n      some of the protests. In Los Angeles, protesters scuffled with police, who \n      fired rubber cartridges and used batons against the crowd. Bill \n      Whitaker will more on the backlash from the clashes. There’s \n      good news for patients suffering from osteoporosis: a promising new \n      treatment that is given intravenously only once each year. Our medical \n      correspondent Dr. Jon LaPook will have the details. In \n      other medical news, a soon-to-be released study shows an alarming number \n      of American children go without basic health care. Sharyl Attkisson \n      will have details. The role of peacekeepers in Darfur is changing, \n      as our Allen Pizzey will report from the Sudan. He’ll have a story \n      about the flow of funding and the growing threat of militias against both \n      cities and refugee camps there. More than 100 journalists have \n      died reporting on the war in Iraq, and now a memorial is being dedicated \n      to these journalists and other members of the press killed in the line of \n      duty since 1944, Richard Roth will report. The memorial site: \n      Normandy which, of course, was the first part of France liberated by \n      allied forces in World War II. And Barry Petersen will have \n      a story on treating Internet addiction in China for our series “Caught in \n      the Web.” I hope you’ll join us. Katie House Bid \n      To Override Bush Veto Fails Click Here Immigration Protest \n      In L.A. Turns Ugly Click Here Here's a look at one \n      of the stories we are working on for Thursday's broadcast of the CBS \n      EVENING NEWS The late, great racehorse Barbaro has a new baby brother. \n      We'll introduce you to him, and preview the upcoming Kentucky Derby. That \n      story, and much more, Thursday on the CBS EVENING NEWS. If you \n      would like more information on any of these stories or the broadcast, \n      please click on the following address and e-mail us: evening@cbsnews.com \n      \n\nTONIGHT ON DAVID LETTERMAN\nJoin Dave tonight on The Late Show with actress Drew Barrymore AND impressionist Mike MacRae… Plus, \n      musical guest Ben Kweller! \n\nTHURSDAY MORNING ON THE EARLY SHOW\nHarry Smith, Hannah Storm, Julie Chen and \n      Russ Mitchell anchor THE EARLY SHOW from New York. Dave Price will bring us the weather. \n      Along with the top news of the day, we will also have the \n      following stories: TREATING BIPOLAR DISORDER IN \n      CHILDREN: In the second part of our series on children with bipolar \n      disorder, we’ll examine the case of four-year-old Rebecca Riley. In \n      December 2006, Rebecca died after overdosing on her bipolar medications. \n      Rebecca’s parents, Carolyn and Michael, are in jail facing first-degree \n      murder charges in Plymouth County, Massachusetts court. Prosecutors say \n      Carolyn and Michael intentionally overdosed their daughter, but defense \n      attorneys argue her parents were merely following doctor's orders. How is \n      a two-and-a-half-year-old diagnosed? EARLY SHOW National Correspondent Tracy Smith reveals the dangerous \n      side of a disorder; one that has serious implications for treatment. \n      SUMMER TRAVEL DESTINATIONS: Hard to believe, but summer is \n      just around the corner. Have you booked your summer vacation yet? It’s not \n      too late to book your trip and still get a great deal. The editors at \n      Travel & Leisure magazine have a list of hot destinations that \n      you can take advantage of while you still can. Amy Farley, Senior Editor \n      of Travel & Leisure, will join us Thursday morning with her \n      list. KIRSTEN DUNST ON SPIDERMAN 3: Exactly five years ago \n      Thursday, Spiderman made his way to theaters and changed the way \n      movies were made. Not only did it have groundbreaking special effects, but \n      at the film's core was a complex love story between Spidey's alter ego \n      Peter Parker and his childhood crush, Mary Jane Watson, played by Kirsten \n      Dunst. In Spiderman 3, it looks like Peter and MJ are about to take \n      their relationship to the next level. After transitioning from child roles \n      in Little Women, and Interview with the Vampire, Kirsten \n      Dunst has proven herself a very versatile and mature actress. A favorite \n      of the paparazzi, she has had a number of rumored love interests in her \n      off-screen life. Kirsten will join us Thursday morning to talk about the \n      latest in the trilogy. COOKING FOR SPRING WITH MARCUS \n      SAMUELSSON: Cookbook author and Chef Marcus Samuelsson has earned more \n      accolades than most chefs will ever receive in their lifetime. In 1995, he \n      was the youngest chef ever awarded a three-star review by The New York \n      Times. In 1999, the James Beard Foundation named him as a “Rising Star \n      Chef”. Thursday morning, Samuelsson will join us with delicious spring \n      recipes -- some of which you can certainly find at his restaurant Aquavit \n      in New York City. DREW BARRYMORE ON LUCKY YOU: From the \n      time she appeared in ET, Drew Barrymore has always had presence \n      on-screen. From Charlie’s Angels to romantic comedies such as \n      Never Been Kissed, Barrymore has gained a legion of fans. Now, \n      along with Eric Bana, she stars in Lucky You, a drama set among the \n      bright lights of Las Vegas. The film opens Friday. Thursday morning, \n      Barrymore will join us with the latest on her life and her glitzy film. \n      CSI PREVIEW: Thursday night’s episode of CSI \n      involves other-worldly conspiracies and alien creatures from another \n      planet. In our exclusive \"sneak peek\" you won't see anywhere else, Nick is \n      looking for clues in a location that couldn't be any more \"down-to-earth.\" \n      If you would like more information on any of these stories or the \n      broadcast, please click on the following address and e-mail us: earlyshow@cbs.com\n\n\n\nTO SUBSCRIBEClick here to subscribe to \n      the Inside Scoop.TO UNSUBSCRIBEUnsubscribe information \n      is included in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, \n      click here.Contact: Email Administrator, \n      CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n      10019Help | Advertise | Terms of \n      Service | Privacy \n      Statement©MMVII, CBS \n      Interactive Inc. All Rights Reserved. \n\n"}