{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nRisk Management 101: Managing Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nEPRI's Value \n\t\t\tand Risk in Energy Markets - Introduction & Principles\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nTHIS WEEK AT EIA (Volume 9, Issue 22) (May 25 - May 31, 2007)\n\n\n\nEIA - May 31, 2007 - THIS WEEK AT EIA is a list summarizing and providing URLs for every Energy Information Administration (EIA) product released during this week.\n\n\nMay 31, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 31, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 31, 2007\n\n\nMay 31, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for May 31, 2007  \n\n\n\nFeatured Articles for May 31, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 31, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nDuke will ask for rate increase: If the state approves the utility's request, a typical household's power bill would jump $7.20 a month\n\n\n\nMay 31--Duke Energy, the state's largest electric utility, will seek to raise rates for the first time since 1991.  The Charlotte-based company announced Wednesday that it will ask the N.C. Utilities Commission for permission to raise residential rates by 6.8 percent, or $7.20 a month for the typical household. Industrial and commercial customers would see smaller changes.\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nNuclear reactor plan on hold: Promoting energy savings will come first, Progress Energy says. Expect rates to go up\n\n\n\nMay 31--Progress Energy will delay building a new reactor at the Shearon Harris nuclear plant in Wake County and instead push customers to use less electricity. Robert McGehee, chief executive of the Raleigh utility, said Wednesday that the company will also observe a moratorium on proposing coal-burning power plants as it devotes the next two years to testing whether its 1.2 million customers ...\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nReferee forwards AEP-PSO rate case: Members of the Oklahoma Corporation Commission will review recommendations.\n\n\n\nMay 31--The referee overseeing the AEP-PSO rate case made many \"point by point\" recommendations to regulators Wednesday, but she did not determine whether electricity rates should increase or decrease, a spokesman with the Oklahoma Corporation Commission said.  Matt Skinner, a spokesman with the OCC, said the 164-page report submitted by Referee Jacqueline Miller would be turned over to ...\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nOregon electricity bills just got bigger\n\n\n\nMay 31--In an unusual and unusually brief session Wednesday, the Oregon Public Utility Commission approved one of the largest electricity rate increases in decades, one that will boost average home and small-farm bills by 13 percent. Utility rate hikes of any size normally require utility companies, consumer advocates and state regulators to haggle for months and exchange crates of ...\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nGroups want Legislature to come back for electricity\n\n\n\nMay 31--Consumer groups are calling on Gov. Rick Perry to order the state Legislature back into session to make changes to Texas' competitive electricity markets.  AARP Texas and Texas ACORN, which advocates for low-income families, said a bill that died in the final hours of the legislative session on Monday fell short of making the kinds of changes they wanted to see, but would have been better ...\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nEPA panel gets an earful: Daylong hearing is held on state push to enforce tougher emissions rule.\n\n\n\nMay 31--California's much-vaunted law restricting greenhouse gas emissions from vehicles won't make a dent in global warming, even if adopted worldwide, a group of automobile manufacturers declared Wednesday.  Though delivered with bombshell flourish, the auto lobby's assertion at a U.S. Environmental Protection Agency hearing in Sacramento did not appear to rattle California representatives -- ...\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nTwo towns phasing out meter readers: Cary and Morrisville will buy self-reading meters that will eventually save money\n\n\n\nMay 31--CARY -- Town meter readers are facing looming obsolescence now that plans are in place to equip homes and businesses with self-reading machines. The new meters, slated to be installed in Cary and Morrisville over the next two years, will have wireless transmitters that Cary officials hope will beam readings to town hall no less than four times a day.\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\nUnderground alternative: Some say Dane County power line should be buried\n\n\n\nMay 31--The quest to build a major power line across Dane County has shifted into a debate over whether the line should be buried or strung on giant towers above ground.  American Transmission Co. of Pewaukee wants to begin operating the line by 2013 to help the fast-growing Madison area keep up with rising demand for electricity. Concerns about the line prompted the mayor of Madison, the head of ...\n\n\nMay 31, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nCliffside estimate rises to $3,000/kW\n\n\n\n-- Duke Energy Carolinas said it expects its proposed 800 MW Cliffside unit to cost $2.4 billion, including financing expenses, or $3,000/kW. Duke says it is 'reasonably confident' it will be able to keep the project costs to the current estimate. The company filed its latest estimate for the proposed unit with the North Carolina Utilities Commission. Duke says construction costs will be $1.8 ...\n\n\nMay 30, 2007 Power Engineering\n\n\n\nVectren ready to meet summer power demand\n\n\n\nEvansville-based Vectren Energy Delivery told state regulators Thursday the company will have plenty of power to meet summer demand. The company issued its peak demand forecast for the summer months during the annual Energy Forum hosted by the Indiana Utility Regulatory Commission. Each of the state's large utilities discussed their forecasts and electric capacity with the commission this week. ...\n\n\nMay 31, 2007 Evansville Courier\n\n\n\nProgress Energy defers nuke and pauses on coal\n\n\n\n-- Progress Energy Carolinas said it has notified the Nuclear Regulatory Commission that if the company moves forward with plans for a new nuclear plant at the Harris site in Wake County, the new plant would be online in 2018 or beyond, at least two years later than initial energy demand forecasts had indicated. The company also said it would 'aggressively' implement energy-efficiency programs ...\n\n\nMay 30, 2007 Power Engineering\n\n\n\nAt windmills, dead birds, bats by the hundreds\n\n\n\nALBANY  While generating megawatts of electricity, windmills on the Tug Hill Plateau in northern New York are also killing hundreds of bats and birds, according to a recent study. The consultants report for PPM Energy and Horizon Energy identified 123 birds, mostly night migrants, and 326 bats found dead over the course of five months last year beneath 50 wind turbines on the plateau between Lake ...\n\n\nMay 31, 2007 Buffalo News\n\n\n\nGreen Equals Green At GE\n\n\n\n-- GE recently reported that revenues from its portfolio of energy efficient and environmentally advantageous products and services exceeded $12 billion in 2006, up 20% from 2005, while the order backlog rose to $50 billion. 'Ecomagination is growing beyond our expectations, evolving into a sales initiative unlike any other I've seen in 25 years at GE,' said GE Chairman and CEO Jeff Immelt. ...\n\n\nMay 31, 2007 Industry Week\n\n\n\nN.Y. electricity price drop slight when compared with other states\n\n\n\nDeregulating New Yorks electricity markets has helped keep the states power prices from rising by less than the inflation rate over the last 12 years, a study commissioned by a group of energy services firms found Tuesday. The study found that residential electricity costs in New York dropped by 9.2 percent from their pre-deregulation peak in 1994 through last year, after adjusting for inflation. ...\n\n\nMay 30, 2007 Buffalo News\n\n\n\nPower Authority shift spurs WNY hopes\n\n\n\nRoger B. Kelley will lead the New York Power Authority. But new chief plays down area links The governing board of the State Power Authority hired an Amherst energy executive Tuesday as its chief operating officer. The hiring of Roger B. Kelley marks the first time a Western New Yorker will run the authority since the Niagara Power Project, one of the nations largest hydropower plants, was ...\n\n\nMay 30, 2007 Buffalo News\n\n\n\nUtility gets approval to build towers across Livingston\n\n\n\nTwenty-one miles of overhead power lines will be strung along 100-foot tall poles through eastern Livingston County, along M-59, to the General Motors Proving Ground in Milford. The Michigan Public Service Commission approved a certificate for construction of the power line to be built by Novi-based ITC Transmission. In addition, the commission plans to consider an extension of its underground ...\n\n\nMay 31, 2007 Detroit News\n\n\n\nAirtricity opens 124 MW Forest Creek Wind Farm in West Texas\n\n\n\n-- Airtricity North America has officially opened its 124 MW wind farm at Forest Creek, West Texas. The facility will generate enough electricity to power more than 35,000 homes and avoid the emission of 225,000 tons of greenhouse gases. TXU Wholesale will purchase the electricity generated by the wind farm, which entered commercial operation in March 2007.\n\n\nMay 31, 2007 Power Engineering\n\n\n\n\n\nDominion to Streamline Corporate Structure by Merging CNG Subsidiary Into Holding Company\n\n\n\nRICHMOND, Va., May 31 /PRNewswire-FirstCall/ -- Dominion (NYSE: D) announced today that it intends to merge its wholly owned subsidiary, Consolidated Natural Gas Company, into the parent holding company, Dominion Resources, Inc., as part of a move to streamline its corporate structure. The merger is targeted for the second to third quarter of the year. Dominion will then assume all obligations ...\n\n\nMay 31, 2007 PR Newswire\n\n\n\nEnvironmental Power Corporation Announces Intent to Dispose of Interest in Scrubgrass Generating Facility\n\n\n\nEPC Reinforces Focus on Renewable Natural Gas and Carbon Market PORTSMOUTH, N.H., May 31 /PRNewswire-FirstCall/ -- Environmental Power Corporation (Amex: EPG) announced today that its Board of Directors has unanimously authorized management to enter into negotiations finalizing the termination of the leasehold interest in the 83 megawatt waste coal-fired electric generating station located in ...\n\n\nMay 31, 2007 PR Newswire\n\n\n\n'Stated Rate' Plan Pays Credits to PJM Members\n\n\n\nPJM Interconnection is crediting refunds to its members as its rates continue to decline. A year ago, June 1, 2006, PJM instituted 'stated rates,' fixed rates to recover the costs to run the grid control organization. The rate plan included a five-year series of rate cuts. During 2007, PJM is crediting members' bills with a total of $6.5 million, or approximately one cent per megawatt-hour.\n\n\nMay 31, 2007 PR Newswire\n\n\n\nEnergy Transfer Receives Prestigious Ranking among Top Performing Companies in 2007\n\n\n\nEnergy Transfer Partners Ranked No. 13 On 2007 BARRONS 500 Corporate Performers List Energy Transfer Equity received nod from FORTUNE As No. 306 on the Magazines Annual Ranking of Americas Largest Corporations DALLAS--(BUSINESS WIRE)--Dallas-based Energy Transfer Partners, L.P. (NYSE: ETP) was ranked No. 13 on this years Barrons 500 list of top performers among the largest companies in the U.S. ...\n\n\nMay 31, 2007 Business Wire\n\n\n\nClean Energy Fuels Corp. Announces Closing of Initial Public Offering\n\n\n\nSEAL BEACH, Calif.--(BUSINESS WIRE)--Clean Energy (NASDAQ:CLNE) today announced the closing of its initial public offering of 10,000,000 shares of its common stock at a price to the public of $12.00 per share. The net proceeds to the Company from this offering of approximately $108.8 million are expected to be used to build an LNG liquefaction plant and CNG and LNG fueling stations, to finance ...\n\n\nMay 31, 2007 Business Wire\n\n\n\nCheniere Energy Commits to Exercise 9,175,595 Share Call Options and Closes $400 Million Credit Facility\n\n\n\nHOUSTON--(BUSINESS WIRE)--Cheniere Energy, Inc. (AMEX:LNG) announced today that it has notified Credit Suisse International (Credit Suisse) of Chenieres irrevocable commitment to exercise, on one or more occasions on or before July 23, 2007, all of Chenieres options to purchase from Credit Suisse an aggregate of 9,175,595 shares of Chenieres common stock for $35.42 per share.\n\n\nMay 31, 2007 Business Wire\n\n\n\nVeraSun Plans Official Groundbreaking Ceremony Today for Minnesota Fuel Ethanol Plant, an Industrial Info News Alert\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). The nation's second largest ethanol producer and publicly traded company VeraSun Energy Corporation (NYSE:VSE) is planning to hold an official groundbreaking ceremony today in Welcome, Minnesota to mark the construction start on yet another ethanol plant in the company's growing portfolio in ...\n\n\nMay 31, 2007 Internet Wire\n\n\n\nSiemens to Provide Centerpoint Energy's Electric Transmission and Distribution Subsidiary Its First Flexible AC Transmission Systems\n\n\n\nRALEIGH, N.C.--(BUSINESS WIRE)--Siemens Power Transmission & Distribution, Inc. has been awarded a contract to provide CenterPoint Energy Houston Electric, LLC, a transmission and distribution subsidiary of CenterPoint Energy, Inc. (NYSE: CNP), with its first Flexible AC Transmission Systems (FACTS). The turnkey contract for the FACTS projects will include all equipment and civil works for two ...\n\n\nMay 31, 2007 Business Wire\n\n\n\nThe Brattle Group Documents Significant Rate Increases in Both Restructured and Non-Restructured States and Recommends Strategies for Addressing Recent Rate Hikes\n\n\n\nThe Brattle Group has found that over the last decade, during which retail competition was introduced through restructuring of the electricity markets in 20 U.S. states and the District of Columbia, average electricity rates have increased 31% in both restructured and non-restructured states. The Brattle Group's working paper, Restructuring Revisited: What We Can Learn from Retail Rate Increases ...\n\n\nMay 31, 2007 PR Newswire\n\n\n\nFitch Downgrades DQE's IDR to 'BB+'; Affirms Duquesne Light Company's IDR at 'BBB-'; Outlook Stable\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch Ratings has downgraded the Issuer Default Rating (IDR) and senior unsecured debt ratings of Duquesne Light Holdings, Inc. (DQE - formerly known as DQE, Inc.) to 'BB+' from 'BBB-'. In addition, Fitch has affirmed DQE subsidiary, Duquesne Light Company's (DLC), as follows: --Issuer Default Rating (IDR) at 'BBB-'; --Senior secured debt at 'BBB+'; --Preferred ...\n\n\nMay 31, 2007 Business Wire\n\n\n\nThe US Chemical Industry is the World's Largest Producer with a Balance of Trade Surplus in Excess of $15 Billion\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c58625) has announced the addition of Analyzing the Chemical Industry in United States to their offering. The chemical industry world over always enjoys a love-hate relationship with communities. Driven by many objectives as well as balancing social concerns with profit and R&amp;D investments, the ...\n\n\nMay 31, 2007 Business Wire\n\n\n\n\n\nFPL Energy files to build in Texas\n\n\n\nA subsidiary of FPL Energy LLC has filed an application with Texas regulators to establish a new regulated utility business unit to construct, own and operate transmission facilities in Texas. The Juno Beach-based company said it has asked the Public Utility Commission of Texas (PUC) for a certificate of convenience and necessity for a unit to serve the Dallas/Fort Worth metroplex and other ...\n\n\nMay 31, 2007 South Florida Business Journal\n\n\n\nOregon Regulators Approve Rate Hikes for Some Smaller Electricity Users\n\n\n\n- 12:22 a.m. PORTLAND, Ore. (AP) - The Oregon Public Utility Commission on Wednesday approved, reluctantly, a rate hike for some residential and small-farm electricity customers of private utilities in Oregon. The rate hike affects about 75 percent of electricity customers in Oregon. Portland General Electric and PacifiCorp customers will see a 13 percent hike in their bills beginning Friday, ...\n\n\nMay 31, 2007 Canadian Business Magazine\n\n\n\nStudy: Competitive Electricity Markets Continue To Develop\n\n\n\nThe Alliance for Retail Choice (ARC) recently released a study showing that many states continue to make progress in adopting competitive retail electricity markets. New York and Texas were the clear leaders among states that have given customers the ability to choose their electricity supplier. \"Our economy is built around competitive markets, and we need to bring the full advantages of that ...\n\n\nMay 31, 2007 Power Online\n\n\n\nBrochure: SEACLOR On-site Generation from Seawater\n\n\n\nOn-site Generation from Seawater         Search:  Products Suppliers Articles Downloads News   Community            Details SEACLOR On-site Generation from Seawater Published By: Severn Trent , Inc. SEACLOR systems are the standard and preferred electrochlorination unit for biofouling control in power plants, cooling towers, liquefied natural gas (LNG) terminals and desalination facilities, as ...\n\n\nMay 31, 2007 Water Online\n\n\n\nCalifornia and Ontario agree to work together to combat warming\n\n\n\nSan Francisco (Platts)--30May2007 California Governor Arnold Schwarzenegger and Ontario Premier Dalton McGuinty Wednesday signed a memorandum of understanding committing the state and province to work together to combat climate change. The two governments will explore potential linkages between regional market-based mechanisms, promote innovative technology and energy efficiency programs and ...\n\n\nMay 30, 2007 Platts\n\n\n\nEntergy's Arkansas customers will see 12.6% hike\n\n\n\nEntergy Corp. is adjusting rates for some of its residential customers in order to comply with a federal order. Entergy's customers in Arkansas face a 12.6 percent increase, while customers in Mississippi, Texas and part of Louisiana will get decreases ranging from 3.6 percent to 6.6 percent. New Orleans customers are unaffected, the company stated in a news release Wednesday.\n\n\nMay 30, 2007 Memphis Business Journal\n\n\n\nEntergy&#39;s Arkansas customers will see 12.6% hike\n\n\n\nEntergy Corp. is adjusting rates for some of its residential customers in order to comply with a federal order. Entergy's customers in Arkansas face a 12.6 percent increase, while customers in Mississippi, Texas and part of Louisiana will get decreases ranging from 3.6 percent to 6.6 percent. New Orleans customers are unaffected, the company stated in a news release Wednesday.\n\n\nMay 30, 2007 Memphis Business Journal\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nRemarks by President Bush on the United States International Development Agenda\n\n\n\nThe following is a transcript of remarks by President Bush on the United States International Development Agenda: Ronald Reagan Building and International Trade Center Washington, D.C. 10:07 A.M. EDT MRS. BUSH: Thank you, George, for that kind introduction. Thanks to the United States Global Leadership Council for hosting us this morning. Next week, leaders from around the world will gather in ...\n\n\nMay 31, 2007 PR Newswire\n\n\n\nGE Energy Expands Power Project Capabilities in Middle East\n\n\n\nRIYADH, Saudi Arabia--(BUSINESS WIRE)--Further expanding its local capabilities in the regions robust power generation industry, GE Energy (NYSE: GE) is establishing new power generation projects offices in the Middle East to coordinate project management activities for the region, where the company has project commitments of more than $4 billion. Ed Wollyung, a 33-year GE veteran, will lead GEs ...\n\n\nMay 31, 2007 Business Wire\n\n\n\nThe United States Has 100 Nuclear Reactors Supplying More Than 20% of the Nation's Electricity\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c58582) has announced the addition of Uranium Mining and Nuclear Reactor Market Opportunities, Strategies, and Forecasts, 2007 to 2013 to their offering. The US, France, Germany, Japan, Russia, and South Korea are the largest users of nuclear power. China, India, and Southeast Asia are among regions ...\n\n\nMay 31, 2007 Business Wire\n\n\n\nG8 greenhouse gas emissions rise\n\n\n\nBy Alister Doyle, Environment Correspondent OSLO (Reuters) - Greenhouse gas emissions by leading industrialized nations have accelerated since 2000 and several countries are performing worse than the United States which opposes a U.N. pact for curbing global warming, U.N. data shows. Leaders of the Group of Eight rich nations meet in Germany next week with President George W.\n\n\nMay 31, 2007 Scientific American\n\n\n\nBush calls on 15 countries to agree on global emissions goal by end of 2008\n\n\n\n[ Top ][ National News ][ Regional News ][ National Sports ][ Regional Sports ] AP White House Correspondent WASHINGTON (AP) -- President Bush, seeking to blunt international criticism of the U.S. record on climate change, on Thursday urged 15 major nations to agree by the end of next year on a global target for reducing greenhouse gases. Bush's proposal was welcomed by the leaders of Britain and ...\n\n\nMay 31, 2007 Charleston Daily Mail\n\n\n\n@Ventures Invests in Powerit Holdings, Inc.\n\n\n\nWALTHAM, Mass.--(BUSINESS WIRE)--@Ventures, the venture capital business of CMGI, Inc. (Nasdaq: CMGI), announced today that it has made a $3.0 million investment in Powerit Holdings, Inc., a leader in intelligent energy-demand management. @Ventures led the companys $7.1 million Series A financing round, joined by new co-investor Expansion Capital Partners, and existing investors including Stellar ...\n\n\nMay 31, 2007 Business Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}