{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "phantasmagoria: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Wednesday, July  4, 2007\nphantasmagoria \\fan-taz-muh-GOR-ee-uh\\, noun:\n1. A shifting series or succession of things seen or imagined, as in a dream.\n2. Any constantly changing scene.\n. . .all combined to form a picture, like the illusory semblance of a phantasmagoria, almost leaving me in doubt whether that on which I looked were indeed reality, or the mere creation of a distempered brain. -- Julia Pardoe, quoted in \"Here's the Rub,\" by David Streitfeld, Washington Post, July 6, 1997\nThe new writings more and more take the form of apocalypses -- that is, of supernatural visions which reveal past, present and future under the guise of a phantasmagoria of symbolic persons and animals, divine and diabolical beings, celestial and infernal phenomena. -- Edmund Wilson, The Dead Sea Scrolls: 1947-1969\nDavid Nixon created this version of the fairy tale -- a phantasmagoria of grim goblins, dancing cushions, flying fish and magical mirrors -- for his former company, BalletMet Columbus, in 1997. -- Stephanie Ferguson, \"Beauty and the Beast\", The Guardian, January 6, 2003\nThe significant items in the ensuing phantasmagoria soon appear, however -- a dry well, a house abandoned because of a series of tragedies, a so-called alley blocked at both ends, the statue of a bird looking sadly unable to fly, and the unidentified wind-up bird that creaks invisibly in a nearby tree. -- Phoebe-Lou Adams, review of The Wind-up Bird Chronicle by Haruki Murakami, The Atlantic, November 1997\nPhantasmagoria is from French phantasmagorie, from phantasme, \"phantasm\" (from Greek, from phantazein, \"to make visible,\" from phantos, \"visible,\" from phainein, \"to show\") + -agorie, perhaps from Greek agora, \"assembly.\"\nDictionary.com Entry and Pronunciation for phantasmagoria\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-10177421-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}