{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nRisk Management 101: Managing Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nEPRI's Value \n\t\t\tand Risk in Energy Markets - Introduction & Principles\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nEU Enters New Era (EnergyBiz Insider - Jun. 18, 2007) \n\n\n\nEnergyBiz Insider - Jun. 18, 2007 - European regulators are endorsing a plan to make the transport of power and gas more accessible by forcing large electric and gas utilities to disown their transmission infrastructure.\n\n\nJun 18, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jun. 18, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 18, 2007\n\n\nJun 18, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for June 18, 2007  \n\n\n\nFirst Enercast Featured Articles for June 18, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories  \n\n\nJun 18, 2007 PowerMarketers Industry Publications\n\n\n\nClimate Change Breakthrough: The Devil is in the Details (UtiliPoint.com - Jun. 18, 2007)\n\n\n\nUtiliPoint.com - Jun. 18, 2007 - G8 summits are always full of much pre-event hullabaloo and the recent June meeting in Heiligendamm, Germany, was no different.\n\n\nJun 18, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nLet the rebates shine in: Solar installers see residential sales dim under state's new initiative.\n\n\n\nJun. 17--For a program meant to bring solar power to a million rooftops in the state, the new California Solar Initiative isn't bringing a lot of sunshine to Tommie Nellon's life.  In fact, he's worried it could cast a cloud over the state's solar industry. Unlimited Energy, Nellon's Fresno-based solar company, \"should be booked up through this year\" with solar installation jobs, he said.\n\n\nJun 17, 2007 Knight Ridder Tribune Business News\n\n\n\nBureaucratic glitch holds up wind deal\n\n\n\nJun. 18--Plans to bring electricity to Columbia next month from a wind farm in northwest Missouri might be delayed until early 2008.  The city signed a first-of-its-kind deal last year to buy as much as 7 megawatts of electricity from Wind Capital Group's Bluegrass Ridge wind farm in King City beginning July 1. But Columbia could remain cut off from the power for another seven months because of a ...\n\n\nJun 18, 2007 Knight Ridder Tribune Business News\n\n\n\nKutztown joins battle against global warming: The municipality is the first in Berks to sign the U.S. Mayors Climate Protection Agreement, which calls for communities to recycle, improve energy efficiency and aid in reducing greenhouse gases.\n\n\n\nJun. 18--Kutztown has joined a national effort to combat global warming by signing a climateprotection agreement that promotes energy efficiency and pollution control.  While the agreement does not force Kutztown to take any action, it shows the public that the borough is committed to the global-warming fight, said Jaymes A. Vettraino, borough manager. By signing the pact, Kutztown has set a goal ...\n\n\nJun 18, 2007 Knight Ridder Tribune Business News\n\n\n\nWind farm developers optimistic about tax break\n\n\n\nJun. 17--Federal tax benefits for wind power development may be scheduled to lapse next year, but wind farm developers proposing local projects are unfazed. The New York Times reports that the federal government provides about $2.57 million per year in tax breaks for wind farm development. Wind Farm developers say that while the PTC, or production tax credit, has not yet been renewed by ...\n\n\nJun 17, 2007 Knight Ridder Tribune Business News\n\n\n\nWestar charge shocks family: Homeowner gets instructions, bill for burying own power line\n\n\n\nJun. 18--Late last month, Toni Dudley's lights went out at her home at 3033 Campfire Drive.  A crew from Westar Energy came out and determined that the underground electrical line from the pole to the meter had become water-saturated and failed. The crew set up a temporary, above-ground line, but Westar informed Dudley she had 30 days to dig a three-foot-deep trench and bury the new line in a ...\n\n\nJun 18, 2007 Knight Ridder Tribune Business News\n\n\n\nNCCC won't get cheap electricity from Power Project agreement\n\n\n\nJun. 18--LOCKPORT -- The new budget for Niagara County Community College, expected to be ratified Tuesday by the County Legislature, does not contain any savings from lowcost power that county facilities will begin receiving Sept. 1 from the Niagara Power Project.  If County Manager Gregory D. Lewis has his way, NCCC won't get any of that electricity next year, or any year after that.\n\n\nJun 18, 2007 Knight Ridder Tribune Business News\n\n\n\nKeySpan deal could be hung up\n\n\n\nJun. 18--A government meltdown over utility regulation, now entering its third month, could further delay or help disconnect the big KeySpan merger.  The state Public Service Commission holds crucial approval power over the move to fold KeySpan Corp. into National Grid Plc -- a multibillion-dollar deal of import on Long Island and in New York City. Not long ago, the merger's proponents viewed ...\n\n\nJun 18, 2007 Knight Ridder Tribune Business News\n\n\n\nMeeting to focus on power plant plans\n\n\n\nJun. 18--Representatives with Heart of the Brazos FutureGen are expected to host a public meeting at 5 p.m. Thursday at the Buffalo Civic Center.  Attendees will be able to view for the first time a video touting a Leon County site as a potential home for the world's first near-zero-emissions power plant. A public hearing on the plant's environmental impact begins at 7 p.m.\n\n\nJun 18, 2007 Knight Ridder Tribune Business News\n\n\n\nNRC sets date for public meetings: Diablo Canyon Nuclear Power Plant\n\n\n\nJun. 18--The federal Nuclear Regulatory Commission will hold two local meetings June 26 and expects to get an earful on its recent new assessment of a radioactive storage project at Diablo Canyon nuclear power plant.  A 2:30 p.m. meeting that day will feature discussion with officials from plant owner Pacific Gas and Electric Co. on Diablo's safety performance during 2006.\n\n\nJun 18, 2007 Knight Ridder Tribune Business News\n\n\n\nEthanol plant developer also eyeing S.C. site\n\n\n\nJun. 18--CHESAPEAKE  The developer of a proposed alternative-fuel refinery in Chesapeake also is considering a 100-acre site in or near Charleston, S.C., to build a $500 million ethanol plant. Economic development officials in Chesapeake are well aware of the competition for the plant. They know the refinery will be built here only if the International Bio Energy Virginia LLC can obtain the ...\n\n\nJun 18, 2007 Knight Ridder Tribune Business News\n\n\n\nWilkes-Barre, Pa., Times Leader, Tom Venesky column: Wind energy debate divides town, developers\n\n\n\nJun. 17--If you go up to the Rattlesnake Roundup this weekend in Noxen, take a look beyond the snakes.  Look past the fenced snake pen, the crowd of people and the bucolic small town. Focus on the mountains that guard over Noxen, for they are about to change. BP Alternative Energy is eyeing the mountains as the future sight of a wind turbine facility. The corporate energy giant believes the top ...\n\n\nJun 17, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nNational Grid CEO backs a bright idea: conservation\n\n\n\nSteve Holliday is jumping on the conservation bandwagon. That might be a little surprising, since Holliday is the chief executive officer of National Grid, which provides electricity for much of Western New York and currently stands to make more money with every extra kilowatt its customers use. But Holliday is convinced that increased energy efficiency is a strong first step toward reducing ...\n\n\nJun 18, 2007 Buffalo News\n\n\n\nGas Turbine Information & Resources: Power Engineering Magazine & Buyer's Guide\n\n\n\nGas turbines enjoy popularity in large part due to their efficiency. After all, fuel is the primary operating expense in any power plant. With gas turbines, plants are able to use more of the potential energy of the fuel with less waste. In a gas turbine-powered electric generating plant, natural gas combustion turns the rotor of the generator--eliminating the need for the 'middle man' furnace ...\n\n\nJun 18, 2007 Power Engineering\n\n\n\nHow one startup is taking on Big Power\n\n\n\nSan Francisco solar startup GreenVolts today announced an agreement to build a demonstration solar power plant for Pacific Northwest utility Avista. GreenVolts was one of the companies featured in Green Wombat's Big Solar story that appeared in the June issue of Business 2.0. Avista (AVA), based in Spokane, Washington, will also make a 'strategic investment' in GreenVolts.\n\n\nJun 18, 2007 Fortune\n\n\n\nUtilities call on consumers to conserve\n\n\n\nNEW YORK (CNNMoney.com) -- With the hot summer approaching and ever more air conditioners and other consumer electronic devices straining the nation's already burdened power system, utilities are scrambling to get customers to use less. 'Eighty one percent of customers think they are in on energy efficiency,' Bill Brier, head of policy and public affairs at the industry association Edison ...\n\n\nJun 18, 2007 Fortune\n\n\n\n\n\nAvista Chooses GreenVolts for Utility Scale Solar Trial\n\n\n\nGreenVolts (www.greenvolts.com), a leader  GreenVolts (www.greenvolts.com), a leader in helping utilities deliver green energy to their customers, today announced that it has been chosen by Pacific Northwest utility, Avista, for a demonstration project to test the company's utility-scale solar energy solution. The company also announced that Avista has made a strategic investment in GreenVolts ...\n\n\nJun 18, 2007 Internet Wire\n\n\n\nDuke Energy Ohio to Seek Increase in Natural Gas Base Rates\n\n\n\nCINCINNATI, June 18 /PRNewswire-FirstCall/ -- Duke Energy Ohio announced today it will file an application with the Public Utilities Commission of Ohio seeking an increase of $34 million, or 5.8 percent overall, in natural gas rates. The increase would be effective in the early- to mid-2008 and is the first general rate filing since 2001.\n\n\nJun 18, 2007 PR Newswire\n\n\n\nAGL Resources Announces Organizational Changes; Linginfelter Named Head of Utility Operations\n\n\n\nATLANTA, June 18 /PRNewswire-FirstCall/ -- AGL Resources (NYSE: ATG) today announced several organizational changes to its leadership team. Henry P. 'Hank' Linginfelter, currently senior vice president, Mid-Atlantic Operations, has been named executive vice president, Utility Operations. In his new role, Linginfelter will assume responsibility for both Southern and Mid-Atlantic utility ...\n\n\nJun 18, 2007 PR Newswire\n\n\n\nSpectra Energy Partners, LP Announces Commencement of Initial Public Offering\n\n\n\nHOUSTON, June 18 /PRNewswire-FirstCall/ -- Spectra Energy Partners, LP has commenced an initial public offering of 10,000,000 of its common units representing limited partner interests pursuant to a registration statement on Form S-1 previously filed with the Securities and Exchange Commission. The underwriters will be granted a 30-day over-allotment option to purchase up to 1,500,000 additional ...\n\n\nJun 18, 2007 PR Newswire\n\n\n\nEnergy Outreach Colorado Names New Development Director\n\n\n\nDENVER--(BUSINESS WIRE)--Energy Outreach Colorado, a nonprofit organization that raises funds for energy assistance, has named Lisa McDonald as its development director. McDonalds previous experience includes positions as development director with Colorado Environmental Coalition and the Childrens Law Center in Minnesota. Her educational background includes an MBA in marketing from Capella ...\n\n\nJun 18, 2007 Business Wire\n\n\n\nCMS Energy Announces Price Determination Relating to Debt Tender Offer\n\n\n\nJACKSON, Mich., June 18 /PRNewswire-FirstCall/ -- CMS Energy Corporation (NYSE: CMS) today announced that it has established the early tender price for each $1,000 principal amount outstanding of its 7.5% Senior Notes Due 2009, CUSIP No. 125896 AH3 (the 'Notes') for which CMS previously announced an offer to purchase (the 'Tender Offer'). Assuming a settlement date of July 3, 2007, CMS will pay ...\n\n\nJun 18, 2007 PR Newswire\n\n\n\nAmericans taking some action to reduce greenhouse gases, but don't consider their homes a major source of emissions\n\n\n\nBuilding store employee just as likely to spur more action as President Bush     BUFFALO, NY, June 18 /PRNewswire/ - A new poll conducted by Ipsos Reid on behalf of Icynene has found nearly two-thirds (64%) of U.S. homeowners claim to  have taken 'some' or 'a lot' of action to reduce greenhouse gases, yet only four percent believe their homes and offices ...\n\n\nJun 18, 2007 PR Newswire\n\n\n\nNexsun Ethanol Anticipates Fall Construction Start on Biofuels Complex in Kansas, an Industrial Info News Alert\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). Privately held Nexsun Ethanol LLC (Ulysses, Kansas), an affiliate of Nexsun Energy Corporation (Los Angeles, California), has announced that the company has secured a design-build contractor and construction management firm in anticipation of starting construction this fall on the first phase of ...\n\n\nJun 18, 2007 Internet Wire\n\n\n\nStrategic Energy Helps Rodney Company N.V., Inc. Purchase Cleaner Electricity\n\n\n\nPITTSBURGH--(BUSINESS WIRE)--Strategic Energy, a national provider of retail electricity services to commercial and industrial customers, today announced that it has been selected to provide electricity services to Rodney Company N.V., Inc., owners of commercial properties in New York City including 555 Madison Avenue. Strategic Energy purchased Renewable Energy Credits (RECs) that offset 30 ...\n\n\nJun 18, 2007 Business Wire\n\n\n\nTransAlta Power, L.P. will record a $50 million non-cash charge to second quarter earnings as a result of substantive enactment of Bill C-52 Budget Implementation Act, 2007\n\n\n\nTransAlta Power, L.P. (TSX: TPW.UN) (\"TPW\") announced today it will record a non-cash charge to earnings of $50 million and a corresponding reduction in the book value of its equity investment in TransAlta Cogeneration, L.P. (TransAlta Cogen) in the second quarter of 2007. The charge relates to TPW's 49.99 per cent share of future income tax liabilities to be recorded at the TransAlta Cogen level ...\n\n\nJun 18, 2007 Internet Wire\n\n\n\n\n\nDaniel Weintraub: Cheap green energy lures S.F. back to open market\n\n\n\nSix years after a poorly written law and market manipulation caused a meltdown of California's electricity industry and halted the state's experiment with competition, it is coming back, in the strangest of places.The city and county of San Francisco, thinking it can get its electricity greener and cheaper, are moving closer to declaring its independence from Pacific Gas & Electric and instead ...\n\n\nJun 17, 2007 Sacramento Bee\n\n\n\nEx-Enron exec gets 27-month sentence\n\n\n\nHOUSTON - The former chief of Enron Corp.'s high-speed Internet unit, who turned government witness and testified in the trial of former Enron CEO Jeffrey Skilling and company founder Kenneth Lay, was sentenced Monday to 27 months in prison.It's been nearly three years since Kenneth Rice, 48, pleaded guilty to securities fraud and agreed to help federal prosecutors on other cases related to the ...\n\n\nJun 18, 2007 MSNBC\n\n\n\nOregon tax credit may boost solar\n\n\n\nA pending energy tax credit in Oregon has some solar energy analysts predicting a statewide solar technology investment boom. Oregon may have a reputation for cloudy weather, but the forecast could all change, according to Russ Wright, an Oregon-based solar panel marketing executive who calls the pending Business Energy Tax Credit legislation 'free money' for Oregon business owners who invest in ...\n\n\nJun 18, 2007 UPI\n\n\n\nCaltrans unveils solar energy system\n\n\n\nCalifornia-based Caltrans has unveiled a solar energy system producing enough power for the equivalent of more than 550 homes. The company deployed a 251 kilowatt photovoltaic system at its District 10 in Stockton, Calif. Caltrans District Director Kome Ajise held a ceremony at the site of the system located in the parking area of the district office. Caltrans manages more than 45,000 miles of ...\n\n\nJun 18, 2007 UPI\n\n\n\nAlberta proposes splitting regulator into two separate agencies\n\n\n\nNew York (Platts)--18Jun2007  In an effort to improve regulatory efficiency, Alberta is contemplating splitting its Energy and Utilities Board into two separate regulatory bodies, the province's Department of Energy said.      The Alberta Utilities Commission Act, also known as Bill 46, would split the EUB into a new Energy Resources Conservation Board and a new Alberta Utilities Commission.\n\n\nJun 18, 2007 Platts\n\n\n\nOnt. Liberals promise to close coal plants by 2014\n\n\n\nA man roller blades with his dog as smog hangs over Toronto. (CP / Adrian Wyld) Updated Mon. Jun. 18 2007 10:46 AM ET Canadian Press TORONTO -- Premier Dalton McGuinty's promise to close Ontario's coal plants by 2014 and reduce greenhouse gas emissions over the next 50 years isn't good enough - at least not according to a protester who interrupted his announcement.\n\n\nJun 18, 2007 CTV.ca\n\n\n\nCleco agrees to pay $2 million civil penalty for code of conduct, settlement violations\n\n\n\nCleco agrees to pay $2 million civil penalty for code of conduct, settlement violations The Federal Energy Regulatory Commission today approved a Stipulation and Consent Agreement requiring Louisiana-based Cleco Power, LLC, et al., to pay a civil penalty of $2 million to resolve an investigation into whether it violated its code of conduct and a 2003 Commission-approved settlement agreement.\n\n\nJun 17, 2007 Federal Energy Regulatory Commission\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nNew Report Helps You to Understand Argentina's Energy Market\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c59854) has announced the addition of Argentina Energy Market Flow by Fuel Report to their offering. The Argentina overview report can help you to quickly understand the countrys energy market from a commercial perspective. This report provides detailed information, charts and tables on various types ...\n\n\nJun 18, 2007 Business Wire\n\n\n\nEnergy Projects Lawyer Sean Korney Joins Baker Botts in Dubai\n\n\n\nNew Partner Strengthens Firm's Middle East Regional 'Hub', International Energy Resources     HOUSTON, June 18 /PRNewswire/ -- Sean Korney, who has built a substantial international energy practice during his 13-year legal career, joined Baker Botts L.L.P. today as a partner in the Firm's Dubai office.\n\n\nJun 18, 2007 PR Newswire\n\n\n\nFrench EDF insists power networks will be ready for 1 July\n\n\n\n- Electricite de France's power distribution business will operate independently from its retail business when energy markets open fully July 1, the state-controlled company said in a statement. Following newspaper reports that the joint distribution business of GDF and Electricite de France would not be separated in time for the opening of residential energy markets July 1, EDF said it was ...\n\n\nJun 18, 2007 Power Engineering\n\n\n\nActive Power to Showcase Green Critical Power Solutions at China Eco Expo\n\n\n\nFirm Supports Asia Pacific Market Expansion with Business Seminar and Showcase Exhibition AUSTIN, Texas, June 18 /PRNewswire-FirstCall/ -- Active Power, Inc. (Nasdaq: ACPW), inventor and manufacturer of the most reliable and energy-efficient critical power systems in the world, continues to strengthen its presence in the Asia Pacific region, playing a major role at the China Eco Expo, being held ...\n\n\nJun 18, 2007 PR Newswire\n\n\n\nBy the Year of 2020, the Amount of Installed Generation Capacity of Hydropower All over China Will Reach 270 Million\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c59942) has announced the addition of 2007-2008 Report on the Survey & Forecast of Investment Prospect of Hydropower Industry in China to their offering. In 2006, the gross generated energy in China has reached 2755.7 billion KWH, which has increased by 13.67% as compared with 2005, while the ...\n\n\nJun 18, 2007 Business Wire\n\n\n\nSolar Thermal: Tech on the Rebound\n\n\n\nTry, try again: it might work for solar thermal technology, which unlike traditional solar power can still generator power in the evening. A 64-megawatt plant just opened outside of Las Vegas, but even at that scale it may not be efficient enough to offer mainstream cost savings. , 'Solar thermal plants, also called concentrated solar power plants, harvest heat from the sun with highly polished ...\n\n\nJun 18, 2007 ECN\n\n\n\nNeed for Clean and Environment-Friendly Power Boosts the European Cogeneration Equipment Market\n\n\n\nThe Western European energy market, beleaguered by increasing oil prices, threats of climatic change and greater dependence on fuel imports, has turned to cogeneration for a long-term solution to all these issues. But what exactly is cogeneration? It is combined heat and power (CHP) and implies the use of a heat engine or a power station to simultaneously generate both electricity and useful ...\n\n\nJun 18, 2007 PR Newswire\n\n\n\nIn Ukraine, illegal mines beckon the jobless\n\n\n\nTOREZ, Ukraine: Every day, Sanya works eight hours in an illegal mine hidden away in a forest, extracting coal with three other men. They work with hand-held tools far below the surface, sometimes going down as deep as 150 meters. A compressor taken from an old car powers a motor that drags the coal out of the mine. Sanya, 25, who did not want his last name to be used because he is engaged in ...\n\n\nJun 18, 2007 International Herald Tribune\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}