{"category": "spam", "to_address": "Wisdom <wisdom@flax24.uwaterloo.ca>", "from_address": "Friedrich Flores <extract_og@go-teamworks.com>", "subject": "Master Penis", "body": "\n\nCan't satisfy your girlfriend? Do you want to?\nOur shop\nViagra and Cialis will help you in any situation. \nClick to visit us\nConfidential and secure purchase. Instant shipping!\nWith best regards,\nFriedrich Flores\n \n \nOn ponimal, chto Teper ego bescennuiu shkuru mog spasti tolko diadiushka ili zasfernik, kotoryh on Tak mechtal ubit. Neetichnym, prezhdevremennym. Ot usiliia Zuby szhalis tak, chto cheliusti onemeli, a legkie tut zhe zanyli, vse eshche ne Utolennye kislorodom posle sumasshedshego bega, i ruka vse zhe drozhala. Edva on popal mne Na glaza, kak ia srazu zahotel proiznesti pro sebia s bolshoj bukvy: Klinok! i poluchit u Nkota blagoslovenie, slovno ia byl monahom, a on pastyrem. \nBylaia slovoohotlivost magika tozhe kuda-to Podevalas. V otlichie ot prostogo myslennogo predstavleniia Eto dejstvitelno dolzhno pomoch. I eto zlilo eshche bolshe. Dobycha i tak Nikuda ne ujdet, no zveri zastoialis i rvalis vpered, da i krov vzygrala v Zhilah ohotnikov za chuzhim dobrom. I vot eta zhutkovataia tvar obratilas ko mne na mezhiazyke vibriruiushchim Basom: Eliot Niksard? Ia ne zametil u nego rta ili kakoj-libo shcheli, ego zameniaiushchej, no rech Prozvuchala otchetlivo. Ty! hriplo vydohnula ona, iavno sobiraias vyskazat vse, chto obo mne Dumaet, no dogovorit ne uspela okruzhaiushchij vozduh vdrug zaiskrilsia, po volosam Onni s harakternym treskom probezhali elektricheskie razriady Vremeni na obiasneniia Ne ostalos, poetomu ia prosto molcha shagnul ej za spinu, podsek ee pod koleni i Podhvatil na ruki. Ia ne otojdu, Onni. No est odno no ia dolzhen byt v horoshej fizicheskoj forme. \nIa proshel k bagazhniku, vyudil iz nego litrovuiu emkost s kiri, vinnym Napitkom (proizvodstvo Gabena iz sozvezdiia Liry, o chem soobshchal cvetovoj kod Na etiketke), i otoshel v storonu, ustupaia mesto sheltianam. A esli on uzhe znaet o tvoem namerenii pritvoritsia trupom. Bolvan. Vse pravilno, Niks, spokojno vozrazil Celitel. ejisuminyon Q1FUW1pVckRcUFBGHUFCUEZWRlleXR1XVA==\n \n\n\n"}