{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Michael Whapples <mikster4@msn.com>", "subject": "Re: Regarding running Linux with Speakup under a virtual machine\n\twith Windows XP", "body": "To add another option, it is possible to set up dual boot on the\ncomputer and make windows the default. If you think the lilo, grub or\nother boot loader screen would be off-putting to the rest of your\nfamily, you can install lilo (I don't know about grub) to a floppy disk,\nand leave the windows boot loader on the HD, so when you want linux\nstick the lilo disk in. I guess you could actually install lilo to any\ndisk that you could boot from, eg. USB storage devices, etc. NOTE: with\nthis it is only the boot loader on the removable media, the OS is still\non the HD and so will behave as you would want and expect. I don't know\nif other distros offer installing the boot loader to other places like\nfloppy, but I know slackware allows lilo on a floppy from the installer\n(any distro should be able to install lilo to a floppy but you may need\nto do it once it is installed).\n\nFrom\nMichael Whapples\nOn Thu, 2007-06-07 at 12:01 -0700, Shane wrote:\n> On Thu, Jun 07, 2007 at 11:41:00AM -0700, Keith Hinton wrote:\n> > I have a Windows XP Media Center Edition box that I mainly use for Skype \n> > reasons and other voice over IP things that Linux sadly does not seem to \n> > help me with.\n> \n> A number of options here.  There is a Linux skype client\n> and chan_skype which can gate it to Asterisk and therefore\n> SIP.  I haven't tried this method myself and use a Windows\n> skype/sip gateway but no reason why it wouldn't work.\n> \n> > not.Now, would it be possible to use VMWare worksation and run Linux and \n> > isntall it, and use software speech with Speakup? Any considerations that I \n> > should take into account first? Will this work? Let me know. Regards,--Keith \n> \n> Should work.  I use a similar setup on a laptop and is\n> quite stable.\n> \n> Shane\n\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}