{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] WHO technical briefing: Technical briefing: Public Health, Innovation and Intellectual property", "body": "http://www.who.int/mediacentre/news/notes/2007/wha01/en/print.html\n\n\n\n\n  Thursday, 17 May\n\n\n\nTechnical briefing: Public Health, Innovation and Intellectual property\n13:00 - 14:30, Room XII\n\n     * Dr Margaret Chan, Director-General, WHO\n     * Dr Howard Zucker, Assistant Director-General, Health Technology\nand Pharmaceuticals, WHO\n     * Mr Peter Oldham, Chair, IGWG-PHI (Intergovernmental Working Group\non Public Health, Innovation, and Intellectual Property)\n     * Dr Elil Renganathan, Executive Secretary, PHI (Secretariat on\nPublic Health, Innovation and Intellectual Property)\n\n\n\nMembers of the IGW\n\n     * Mr P. Oldham, Counsellor, Permanent Mission of Canada, Geneva\n     * Mr B. Wijnberg, Senior Policy Adviser, Ministry of Health,\nWelfare and Sport, the Netherlands\n     * Dr H. Gashut, Counsellor, Permanent Mission Libya, Geneva\n     * Dr A.E.O. Ogwell, Head, Office for International Health\nRelations, Ministry of Health, Kenya\n     * Mr Jaya Ratnam, Chargé d\\u2019Affaires a.i., Deputy Permanent\nRepresentative, Permanent Mission of Singapore, Geneva\n     * Mr N. Dayal, Secretary, Ministry of Health and Family Welfare,\nIndia\n\n\n\n\n-----------------\n\n\nhttp://www.who.int/mediacentre/news/notes/2007/wha01/en/print.html\n\n11 May 2007\n\nSixtieth World Health Assembly: Media opportunities\n\n\nGENEVA -- The Sixtieth World Health Assembly (WHA) will take place from\n14 to 23 May 2007 at the Palais des Nations, Geneva, Switzerland.\nIssues to be discussed include: avian and pandemic influenza\n(developments, response and follow-up) and the application of the\nInternational Health Regulations; smallpox eradication: destruction of\nvariola virus stocks; malaria, including proposal for establishment of\nMalaria Day; tuberculosis control: progress and long-term planning;\nprevention and control of noncommunicable diseases: implementation of\nthe global strategy; better medicines for children; and progress in the\nrational use of medicines. The Health Assembly will consider draft\nresolutions recommended by the WHO Executive Board on these and other\nissues.\n\nThe agenda, the daily Journal and other WHA documents can be found at\nhttp://www.who.int/gb/ and are available in Arabic, Chinese, English,\nFrench, Russian and Spanish. Below is a list of agenda items and other\nevents which may be of particular interest to journalists. Depending on\nthe length of discussions, times and dates for agenda items will likely\nshift, so journalists should regularly consult the World Health\nAssembly Journal posted daily. All technical briefings are open to\njournalists.\n\nInvited speakers\n\nPrime Minister Jens Stoltenberg of Norway will address the Health\nAssembly on issues related to the Millennium Development Goals (MDGs).\nMr Stoltenberg and the Norwegian Government have a particular\ncommitment to MDG 4 and 5 (child and maternal health) and will outline\nhow Norway is implementing this commitment. Mr Stoltenberg will also\nspeak about UN reform as he recently co-chaired the Secretary General\\u2019s\nHigh-level Panel on UN System-wide Coherence.\n\nThoraya Obaid, Executive Director of UNFPA, will also be addressing the\nHealth Assembly. Ms Obaid has a long and distinguished career at the\nUnited Nations with a focus on development and the advancement of\nwomen. She has also been instrumental in efforts in the United Nations\nsystem to reform business practices and improve the efficiency and\neffectiveness of UN development support. She will speak about\ncollaborative activities with WHO on maternal and child health and\ninternational global security.\n\nMonday, 14 May\n\n10:00 - 11:30: Opening of the Sixtieth World Health Assembly, Election\nof the President and other office bearers, and Adoption of the agenda\nMusic from South Africa performed by Adrian Kevin More and Nonhlanhal\nPretty Yende\n\n14:30 - 17:30: Plenary Speakers\n\n     * Chair of Executive Board\n     * Dr Margaret Chan, WHO Director-General\n\nThe General Debate in Plenary will continue during Tuesday and\nWednesday morning\n\n16:00 Committee A: Opening Avian and pandemic influenza:\n\n     * Developments, response and follow-up\n     * International Health Regulations\n\n\n\n18:00: WHO Director-General reception at WHO restaurant (journalists\nwelcome)\n\nTuesday, 15 May\n\n9:00 - 11:30 Committee A:\nAvian and pandemic influenza:\n\n     * Developments, response and follow-up\n     * International Health Regulations\n     * Best practices for sharing influenza viruses and sequence data\n\n\n\nPlenary:\n11:30 - 12:15 Guest Speakers\n\n     * Mr Jens Stoltenberg, Prime Minister, Norway\n     * Ms Thoraya Obaid, Executive Director, UNFPA\n\n\n\nTechnical briefing: Avian Influenza virus sharing and vaccine\n13:00 - 14:30, Room XII\n\n     * Viroj Tangcharoensathien,Thailand\n     * Spie Holtzman, the Bill & Melinda Gates Foundation\n     * Dr Ali Jaffer Mohammad, Director General of Health Affairs, Oman\n     * Dr David Heymann, Assistant Director-General, Communicable\nDiseases, WHO\n     * Dr Mudle-Paule Kieny, Director, Initiative for Vaccine Research,\nWHO\n     * Dr Keiji Fukuda, Coordinator, Global influenza Programme, WHO\n\n\n\nCommittee A:\n\n     * Smallpox eradication: destruction of variola virus stocks\n     * Control of leishmaniasis\n     * Polio: mechanisms for management of potential risks to eradication\n\nMedia briefing: 17:00 - 18:00, Salle I\nWhat: Roadmap to North-South consensus on health worker migration\n\n     * Mary Robinson, President of Realizing Rights; Co-chair of the\nHealth Worker Global Policy Advisory Council\n     * Dr Francis Omaswa, Executive Director, Global Health Workforce\nAlliance\n     * Dr Anders Nordström, Assistant Director-General, Health Systems\nand Services, WHO\n     * Erik Solheim, Minister for International Development, Norway\n     * Patricia Aragon Sto Tomas, Minister of Labor and Employment, the\nPhilippines\n\n\n\nWednesday, 16 May\n\nCommittee A\n\n     * Malaria, including proposal for establishment of Malaria Day\n\n\n\nCommittee B\n\n     * Health conditions in the occupied Palestinian territory,\nincluding east Jerusalem, and in the occupied Syrian Golan\n\n\n\nTechnical briefing: Global health security: Pandemic influenza and\nimplementation of the International Health Regulations\n13:00 - 14:30, Room XII\n\n     * Dr Margaret Chan, Director-General, WHO\n     * Mr Tony Clements, Minister of Health, Canada\n     * Mr Alan Reilly, Deputy Chief Executive, Food Safety Authority,\nIreland\n     * Mr A.K. Rémi, Minister of Health, Côte d'Ivoire (TBC)\n     * Dr David Heymann, Assistant Director-General, Communicable\nDiseases, WHO\n     * Dr Maria Neira, Director, Protection of the Human Environment, WHO\n     * Dr Shigeru Omi, Regional Director, WHO Regional Office for the\nWestern Pacific (TBC)\n     * Dr Guenael Rodier, Director, International Health Regulations\nCoordination Programme, WHO\n     * Dr Mike Ryan, Director, Department of Epidemic and Pandemic Alert\nand Response, WHO\n     * Dr Jorgen Schlundt, Director, Department of Food Safety, Zoonoses\nand Foodborne Diseases, WHO\n\n\n\nLaunch of an Initiative on yellow fever\n18:00, Salle XXII (followed by a cocktail).\nThe meeting will describe the importance of the Yellow Fever Initiative\nin responding and managing a specific threat to global health security.\nSupported by the Global Alliance for Vaccines and Immunization (GAVI)\nand led by WHO and UNICEF, it aims to reduce the risk of yellow fever\nin 12 endemic countries in Africa and will result in the vaccination of\n48 million people in the coming years.\n\nThursday, 17 May\n\nCommittee A:\n\n     * Proposed 2008-2009 programme budget\n     * Evidence-based strategies and interventions to reduce\nalcohol-related harm\n     * Prevention and control of non communicable diseases:\nimplementation of global strategy\n\n\n\nCommittee B:\n\n     * Administrative and financial issues\n\nTechnical briefing: Public Health, Innovation and Intellectual property\n13:00 - 14:30, Room XII\n\n     * Dr Margaret Chan, Director-General, WHO\n     * Dr Howard Zucker, Assistant Director-General, Health Technology\nand Pharmaceuticals, WHO\n     * Mr Peter Oldham, Chair, IGWG-PHI (Intergovernmental Working Group\non Public Health, Innovation, and Intellectual Property)\n     * Dr Elil Renganathan, Executive Secretary, PHI (Secretariat on\nPublic Health, Innovation and Intellectual Property)\n\n\n\nMembers of the IGW\n\n     * Mr P. Oldham, Counsellor, Permanent Mission of Canada, Geneva\n     * Mr B. Wijnberg, Senior Policy Adviser, Ministry of Health,\nWelfare and Sport, the Netherlands\n     * Dr H. Gashut, Counsellor, Permanent Mission Libya, Geneva\n     * Dr A.E.O. Ogwell, Head, Office for International Health\nRelations, Ministry of Health, Kenya\n     * Mr Jaya Ratnam, Chargé d\\u2019Affaires a.i., Deputy Permanent\nRepresentative, Permanent Mission of Singapore, Geneva\n     * Mr N. Dayal, Secretary, Ministry of Health and Family Welfare,\nIndia\n\n\n\nPlenary: Awards: 17:00\n\n     * A.T. Shousha Foundation Prize\n     * Leon Bernard Foundation\n     * Ihsan Dogramaci Family Health Foundation Prize\n     * Sasakawa Health Prize\n     * United Arab Emirates Health Foundation Prize\n\n\n\nFriday, 18 May\nCommittee A:\n\n     * Oral health: Action plan\n     * Working towards universal coverage of maternal, newborn and child\nhealth interventions\n     * Health promotion in a globalized world\n\n\n\nCommittee B:\n\n     * Collaboration with the United Nations system and with other\ninternational organizations\n     * WHO's role and responsibilities in health research\n     * Progress in the rational use of medicines\n     * Better medicines for children\n\nTechnical briefing: Managing the international migration of health\nworkers\n13:00 - 14:30, Room XII\n\n     * Dr Anders Nordström, Assistant Director-General, Health Systems\nand Services, WHO\n     * Dr Tim Evans, WHO Assistant Director-General, Information,\nEvidence and Research\n     * Dr Francis Omaswa, Executive Secretary, Global Health Workforce\nAlliance\n     * Erik Solheim, Minister for International Development, Norway\n     * Patricia Aragon Sto Tomas, Minister of Labour and Employment, the\nPhilippines\n     * Heads of delegation from Portugal and Brazil (TBC)\n\n\n\nSaturday, 19 May\n\n9:00 - 13:00\nCommittee A:\n\n     * Integrating gender analysis and action into the work of WHO\n\n\n\nMonday, 21 May:\n\nCommittee A:\n\n     * Workers health: draft global plan of action\n     * Health systems: emergency care\n\n\n\nCommittee B:\n\n     * Health technologies\n     * Public health, innovation and intellectual property\n\n\n\nTechnical briefing: WHO Global Action Plan Against Cancer\n13:00 - 14:30, Room XII\n\nCancer is a leading cause of death worldwide. From a total of 58\nmillion deaths worldwide in 2005, cancer accounted for 7.6 million (or\n13%) of all deaths. More than 70% of all cancer deaths in 2005 occurred\nin low and middle income countries. The purpose of the briefing is to\nreview with Member States the current and expected global cancer\nburden, and WHO activities to better support Member States in their\nfight against cancer.\n\n     * Professor Mike Chirenje, Zimbabwe\n     * Dr Andrej Bru\\u010dan, Minister of Health, Slovenia\n     * Dr Mohamed- Cheikh Biadillah, Minister of Health, Morocco (TBC)\n     * Professor Franco Cavalli, President of the International Union\nAgainst Cancer\n     * Dr Luís Gomes Sambo, Regional Director, WHO/AFRO\n     * Dr Catherine Le Gales-Camus, Assistant Director-General,\nNoncommunicable diseases and Mental Health, WHO\n     * Dr Andreas Ullrich and Dr Richard Lessard, cancer control medical\nofficers, WHO\n\n\n\nDiscussion on \"Health Protection from Climate Change\"\n18:00 - 19:30, Room XII\n\nThe discussion will summarize the accumulating evidence of climate\nchange as an emerging threat to global public health, and outline the\nnecessary responses. Presentations by international experts on the\nissue, and by delegates of some of the most vulnerable countries will\nbe made. The event will also introduce a new WHO strategic initiative\non \"Public health protection from climate change\", designed to reduce\nvulnerability to climate change, while also bringing immediate health\ngains.\n\n     * Ms Susanne Weber-Mosdorf, Assistant Director-General, Sustainable\nDevelopment and Healthy Environments, WHO\n     * Dr Bettina Menne, Global change and health, WHO European office\n     * Dr Diarmid Campbell-Lendrum, Scientist, Global environmental\nchange and health, WHO\n     * Dr Carlos Corvalán, Coordinator, Interventions for healthy\nenvironments, WHO\n     * Dr Solomon Nzioka, consultant to WHO/UNDP Global Environment\nFacility project (TBC)\n     * Dr Samlee Plianbangchang, Regional Director, South East Asian\nRegion, WHO\n     * Dr Maria Neira, Director, Public Health and Environment, WHO\n\nTuesday, 22 May\n\n12:00 - 12:30: Mrs Reiko Kaburaki Lee, widow of the late\nDirector-General Lee Jong-wook, will be making a presentation on her\nwork with Socios en Salud in Lima, Peru.\n\nCommittee A:\n\n     * Strengthening of health information systems\n\n\n\nCommittee B: Progress reports:\n\n     * Improving the containment of antimicrobial resistance; improving\nAIDS coordination among multilateral institutions; world report on\nviolence and health; promotion of road safety and traffic- injury\nprevention; disability, including prevention, management and\nrehabilitation; cancer prevention and control; sustaining the\nelimination of iodine deficiency disorders; strengthening active and\nhealthy ageing; emergency preparedness and response; reducing global\nmeasles mortality; health metrics network\n\n\n\nTechnical briefing: 20th Anniversary of Safe Motherhood Initiative\n13:00 - 14:30, Room XII\n\nIn the last 20 years, the issue of safe motherhood has evolved from a\nneglected issue to an essential and integrated element of the women\\u2019s\nhealth agenda. The event that set this change in motion was a landmark\nworldwide movement launched in 1987\\u2014the Safe Motherhood Initiative.\nGovernments are committed to achieving MDG 5 and would need all the\nsupport. UNICEF, UNFPA, WHO, World and Regional Banks, major donors,\nNGOs and Civil Societies all needs to work together in helping\ncountries to achieve their goals and improve maternal and newborn\nhealth and survival.\n\n     * Dr Dorothy Shaw, President, International Federation of\nGynaecology and Obstetrics (FIGO)\n     * Dr Kathy Herschderfer, Executive Secretary, International\nConfederation of Midwives (ICM)\n     * Ms Jill Sheffield, Executive President, Family Care International\n(FCI)\n     * Ministers of Health: Kenya, Lao, Bolivia, Ireland, Germany, Spain\n(TBC)\n     * Member of Parliaments: Sally Keeble, MP, UK and Chantal Gill'Ard,\nMP, The Netherlands\n     * Dr Monir Islam, Director, Department of Making Pregnancy Safer,\nWHO\n\n\n\nWednesday, 23 May\n\n11:00 Closure of the Health Assembly\nClosing Speech, President of the Sixtieth Health Assembly\nClosing speech, Dr Margaret Chan, Director- General, WHO\n\nJournalists may expect a closing news release at around 13:00.\n\nFor more information contact:\n\nWHO Department of Communications, Geneva\n\nFadéla Chaib\nPhone: +41 22 791 32 28\nMobile: +41 79 475 5556\nE-mail: chaibf@who.int\n\nChristine McNab\nPhone: +41 22 791 4688\nMobile: +41 79 254 6815\nE-mail: mcnabc@who.int\n\nIain Simpson\nPhone: +41 22 791 32 15\nMobile: +41 79 475 5534\nE-mail: simpsoni@who.int\n\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}