{"category": "spam", "to_address": "Mail <mail@flax9.uwaterloo.ca>", "from_address": "Barbara Buckner <istafanous@gmtcp.com>", "subject": "U won't believe!", "body": "\n\nThe differences between men and women is that women are always ready for sex, but men need an erection. Let us remove this difference by offering you Viagra!\nOur pharmacy\nErectile Dysfunction is one of the most serious problems that a man can get in his life. The best cure nowadays are Viagra and Cialis.\nEverything for your sexual health\nWe have cheapest prices and best quality drugs. We ship instantly worldwide!\nWith best regards,\nBarbara Buckner\n \n \nZa Sutki ia ne smogu dobratsia do blizhajshej planety s gipertransliatorom, dazhe Esli korabl opustitsia peredo mnoj priamo sejchas. Iavno bystree. S takim zhe uspehom mozhno Skazat i kogda gremit grom ili i kogda sodrogaetsia zemlia (skoree vsego, Nikakih iavlenij voobshche ne nabliudaetsia), no, kogda zvenit etot zlokliatyj zvonok, mir, v kotorom spit Volshebnyj Zver, sozdaet Geroia, kotoryj ego i Razbudit. Ty zhe ne hochesh pokazat emu, chto nervnichaesh, i tem samym dat Emu preimushchestvo? Ne dozhidaias, kogda Alani zakonchit, ia reshitelno dvinulsia k kreslu, i Shefir blagosklonno kivnul svoemu nachalniku ohrany: Horosho, Alani, ostalnoe pozzhe. \nDazhe ne znaiu, zachem tebe ia? Chto ia mogu predlozhit? I Celitel i ty, vy oba tolko tem i zanimaetes, to Spasaete mne zhizn, slovno eto vashe liubimoe razvlechenie. Eliot Niksard, spokojno otvetil zasfernik. Nu uzh dudki. Pravo, eto silno nervirovalo. Reshenie, nado skazat, okazalos svoeobraznym Postupivshis svoej elitarnostiu, frajdeny obuchili Leshu vseh zhelaiushchih llerov V otvet na soglasie pokinut planetu dlia osvoeniia drugih mirov, kotoryh oni Pochemu-to zhutko boialis. Dumaiu, kak i shefir v Svoe vremia, oni reshili vospolzovatsia moim opytom i znaniem sredy shelty. Kak tolko ia ego zamknu, nikto ne dolzhen Othodit ot trassera bolshe chem na dva metra, chto by ni sluchilos. Zatem Myslenno schital trebuemuiu summu s bankosa v bankopriemnik kassy lichnye Dannye pri etom, kak obychno, vvelis avtomaticheski. \nZa nej tretia, chetvertaia, piataia, kazhdaia semerka s sobstvennym Vedushchim. Osoboe stroenie glaz ne pozvolialo emu Videt tolko to, chto bylo szadi, no tron nahodilsia priamo pered nim Vyrublennoe iz celnogo kuska mramora vysokoe kreslo s vytianutoj v dva rosta Dal-rokta spinkoj i shirokimi, kak stol, otpolirovannymi do bleska Podlokotnikami. Ia dazhe pochuvstvoval vozbuzhdenie Pri etoj mysli. Pochti Ni pri chem. ejisuminyon XFNaWHVCQlZRUUgcRkNURVdBWFpeHFBV\n \n\n\n"}