{"category": "ham", "to_address": "Ip-health@lists.essential.org", "from_address": "Judit Rius Sanjuan <judit.rius@keionline.org>", "subject": "[Ip-health] Bridges: White House & Democrats deal on FTAs", "body": "From: BRIDGES Weekly Trade News Digest - Vol. 11, Number 17 16 May 2007\n\nWHITE HOUSE, DEMOCRATS REACH DEAL ON BILATERAL FTAs, SPARKING HOPES FOR TPA\n\nThe Bush administration and senior Democratic lawmakers have struck a\ndeal on environmental, labour, and drug patent protections in pending US\nbilateral free trade agreements, boosting their chances of receiving\nCongressional approval. Movement towards broader bipartisan cooperation\non trade may also herald brightened prospects for the troubled Doha\nRound multilateral negotiations at the WTO.\n\nAs per the accord, which was the product of months of negotiation\nbetween Congress and the White House, Washington will seek to modify its\nFTAs to require the enforcement of some International Labour\nOrganization (ILO) standards as well as several multilateral\nenvironmental agreements (MEAs). It will also change intellectual\nproperty rights rules in FTA to make it somewhat easier for developing\ncountry trading partners to expand access to generic copies of patented\ndrugs. These changes were largely in line with a list of objectives set\nout by senior Democrats at the end of March (see BRIDGES Weekly, 28\nMarch 2007, http://www.ictsd.org/weekly/07-03-28/story2.htm).\n\nAccording to the House Ways and Means Committee, the powerful body with\njurisdiction over trade issues, the agreement \"clears the way for broad,\nbipartisan support for the Peru and Panama FTAs.\" Unresolved concerns\nabout the already-concluded agreements with Korea and Colombia means\nthat their future remains murky.\n\nThe compromise on trade policy was announced on 10 May by Democratic\nHouse Speaker Nancy Pelosi (California), Congressional leaders from both\nparties, and top administration officials. Charles Rangel, the New York\nDemocrat who chairs the Ways and Means Committee, played a major role in\nbrokering the deal with Republican lawmakers and the White House.\n\nUS Trade Representative Susan Schwab said that the administration and\nCongress had \"seized an historic opportunity to restore the bipartisan\nconsensus on trade.\" Notably, she added that \"the new trade policy\ntemplate also opens the way for bipartisan work on trade promotion\nauthority (TPA).\"\n\nThe White House's current TPA mandate, which lets it require Congress to\nvote either for or against trade agreements without the possibility of\namendments, expires at the end of June. This 'fast-track' will have to\nbe in force for WTO Members to be able to finalise a Doha Round\nagreement - without it, other countries would be reluctant to sign an\nagreement that could then be picked apart by US lawmakers.\n\nLabour, environment, pharma patent rules\n\nIronically, the countries that signed bilateral FTAs with the US in time\nfor them to be considered under TPA now face last-minute modifications\n-- or else risk having the deals torpedoed by Congress.\n\nUnder the bipartisan agreement, the FTAs will have to require countries\nto enforce worker protections set out in the ILO's 1998 Declaration of\nFundamental Principles and Rights at Work. These include freedom of\nassociation, the right to organise, and prohibitions on forced and most\nkinds of child labour. They will also have to implement seven MEAs,\nincluding the Montreal Protocol on Ozone Depleting Substances, the\nConvention on International Trade in Endangered Species (CITES), the\nConvention on Marine Pollution, and the Ramsar Convention on Wetlands.\n\nSignificantly, both the labour and environmental obligations would\nbecome subject to the same dispute settlement procedures as the core\ncommercial rules on tariff cuts. Furthermore, it would be more difficult\nfor countries to plead insufficient resources as a reason for not\nenforcing labour laws. However, violations of both sets of provisions\nwould only become subject to dispute settlement if they demonstrably\naffect trade and investment. This and the fact that the US has adopted\nthe ILO principles in question appear to have assuaged fears among some\nRepublicans that worker protections in FTAs could be used by union\ngroups to force changes to US labour legislation.\n\nThe accord specifically directs the US trade representative to negotiate\na new annex on forest sector governance with Peru, aimed principally at\nbeefing up rules to prevent trade in endangered forest products.\n\nIn response to Democrats' complaints that the intellectual property\nprotections in FTAs were restricting access to lifesaving medicines in\ndeveloping countries, the new template for trade agreements will allow\ntrading partners to bring generic drugs to market more quickly. For\ninstance, pharmaceutical test data will not be protected in partner\ncountries beyond the period that it is in the US, which will make it\npossible for generics to be brought to market at the same time in both.\nA public health exception from data exclusivity obligations will also be\nintroduced. Furthermore, patent extension requirements for\npharmaceutical products will be softened, and drug regulatory agencies\nwill be allowed to approve generics without having to first establish\nthat no patents have been violated. Finally, the new policy calls for\nmaking side letters on public health concerns part of the formal text of\nthe FTAs, along with a reaffirmation of countries' right under WTO\nagreements to suspend patents in order to expand access to essential\nmedicines.\n\nAdditional modifications to the FTAs will include a provision in the\npreamble making clear that foreign investors in the US will not benefit\nfrom stronger protections than domestic investors. Washington's earlier\nmodel for FTAs included investor protections so far-reaching that they\nwere often accused of undermining the ability of governments to regulate\nin the public interest.\n\nUS trade officials say that they are working with partner countries to\nsee how these changes can be made into new legal language in the FTAs.\nWhether or not this will require a new legislative vote in countries\nsuch as Peru that have already ratified the agreements remains to be seen.\n\nTo complement the new provisions in the FTAs, the compromise also\nprovided for expanded worker assistance and training in the US, along\nwith support for making health and pension benefits portable between\ndifferent employers. In theory, these policies would help soften the\nblow of trade-related adjustment, and make it easier for workers to\nchange jobs without losing benefits.\n\nThe agreement may only smooth the Congressional passage of the FTAs with\nPeru and Panama. Democrats want the administration to seek greater\naccess to the Korean market, particularly with regard to automotive,\nagricultural, and services trade. They also want the Colombia FTA to\ninclude special judicial measures to address violence against trade\nunionists.\n\nUnder the previous Republican-controlled Congress, trade-related\nlegislation passed by razor-thin majorities. Moreover, upporting trade\ndeals will not be easy for all Democrats, several of whom were helped to\npower in last November's elections by anxieties over trade-related job\nlosses. However, the Bush administration's willingness to renounce its\npast opposition to stronger environmental and labour protections might\nhelp trade legislation receive support from enough Democrats to succeed.\n\nPossible cooperation on TPA?\n\nLawmakers from both sides of the aisle broadly welcomed the deal,\nalthough not without some grumbling from more trade-sceptical sections\nof the Democratic caucus.\n\nRangel said that \"for decades now, trade has been a polarising issue in\nCongress, but today's agreement signals a new direction and a renewed\nspirit of bipartisanship.\" He expressed hope that the new policy would\nhelp boost employment and thus make \"trade work, not just for\nshareholders, but for all Americans.\" Wally Herger, the California\nrepresentative who is the top Republican on the House trade\nsubcommittee, said that the \"breakthrough agreement\" provided a way\nforward not only on the FTAs, but also on the \"reauthorisation of TPA.\"\n\nNevertheless, fast-track extension faces an uphill struggle. Speaking to\njournalists in Geneva on 11 May, US WTO Ambassador Peter Allgeier said\nthat the agreement was \"a very important step in the process toward TPA\nrenewal.\" However, he noted that \"what would be most helpful now [for\nencouraging renewal] is to give the Congress a real indication that we\nhere in Geneva are going to be able to produce a genuinely market access\nopening agreement.\" The extent of tariff and subsidy cuts continues to\nleave WTO Members deeply divided. The AFL-CIO, a major US union, has\nindicated that it will oppose TPA extension despite the deal in\nWashington. The spike in the US' trade deficit for March will make the\nissue even more politically contentious.\n\nOf course, TPA is not technically necessary for negotiating - US trade\ndiplomats will still be able to bargain with their WTO counterparts\nafter it expires in a few weeks. However, officials from many other\ncountries say that it will be difficult to seriously negotiate with the\nUS in the absence of signs that TPA renewal is genuinely in the offing.\n\nICTSD reporting; \"Bush and Democrats in Accord on Trade Deals,\" NEW YORK\nTIMES, 11 May 2007; \"Labour, Drugmakers Not Sold on New Trade Accord\nRules,\" BLOOMBERG, 11 May 2007; \"Bush, Congress Agree on Trade\nStandards,\" WALL STREET JOURNAL, 11 May 2007.\n\n--\nJudit Rius Sanjuan\nAttorney\njudit.rius@keionline.org\n\nKnowledge Ecology International (KEI)\nwww.keionline.org / www.cptech.org\n1621 Connecticut Ave, NW, Suite 500 Washington, DC 20009 USA\nTel.: +1.202.332.2670, Ext 18  Fax: +1.202.332.2673\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}