{"category": "ham", "to_address": "debian-desktop@lists.debian.org", "from_address": "Bastian Venthur <venthur@debian.org>", "subject": "Re: A common Debian style for Debian Installer and the desktop", "body": "On 12.06.2007 23:49 schrieb Frans Pop:\n\n> Before the release of Etch there were some proposals [1] to change the \n> theme of the graphical version of Debian Installer to match the theme \n> developed for the desktop. As D-I release manager, I rejected those \n> proposals, basically for two reasons:\n> 1) because it was just plain too late in the release process for such\n>    changes\n> 2) because IMNSHO the proposals were just not good enough and certainly\n>    not an improvement over the current D-I theme\n\nLet's hope next time there will be some kind of vote (not a GR, just a \npoll or something). Personally, I find the current DI theme boring and \nwould have preferred a moreblue-like theme like the Debian Desktop is \nnow using by default.\n\n> The installer is totally different: it is a completely separate piece of \n> software and is also probably the only thing in Debian that is totally \n> and uniquely \"Debian\". As such it needs a much stronger identity.\n> \n> * The light blue of the desktop theme really is too weak for the \n> installer, especially in combination with the grey general background. \n> The contrast between the blue and grey is just not strong enough and this \n> makes the whole user interface look weak.\n> * As the installer is so uniquely Debian, it needs a much stronger tie \n> with the official Debian logo. That means that it needs to include the \n> *red* swirl and the *red* \"dot\" on the i in \"Debian\" (and in the correct \n> font).\n\nI Disagree. Because the shape of the swirl is usually enough to make the \nconnection to the \"real\" logo and the organization behind it, we should \nbe pretty much free for all color variations. The Etch desktop theme is \na perfect example how things could look like (fresh, modern) if we don't \nlimit to use the same boring logo-color-combo again and again.\n\nEvent the MS Windows logo changed over the years, but you still make the \nconnection if you see one of them. So we really shouldn't limit us to \nthe original *red* swirl and the *red* \"dot\" on the i in \"Debian\". It \nlooks boring (like our homepage and our wiki BTW).\n\n\nCheers,\n\nBastian\n\n-- \nBastian Venthur                                      http://venthur.de\nDebian Developer                                 venthur at debian org\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}