{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Napoleon Tillman\" <nexcanisterwod@canister.fi>", "subject": "Doctors and Celebrities endorse Anatrim", "body": "\nMelt away pounds with Anatrim\n\n\n\n\n\nAnatrim – The up-to-the-moment and most enchanting product for corpulent people available – As could be seen on CNN\n\n\n\nDo you understand that superfluous body kilograms kill very much people around the whole world? We know that you hate the ugly appearance of people like those and the low status they have in society. \n\nMoreover, you have not the will to resist a pressure of terrible eating habits of yours. If it sounds familiar, then we got something for your consideration!\n\n\n\n\n\nWe’re proudly introduce you Anatrim, the recent product for the reduction of your body’s extra weight. The astounding thing about Anatrim is it raises the quality of your life, repressing the feeling of hunger and always cheering you up. Here you may see what people write on this product:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of watching TV and eating everything close at hand \n\n\nI became more interested in doing sport.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I’m more fit now and there are lots of men around me!\"\n\n\n\n\n\n\nRita R., San Diego\n\n\n\n\n\n\n\"Passive weight reducing was of little help to me. It was very hard for me to hold back and not to eat something just at hand. \n\n\nOne day I heard on Anatrim in the media and I rather liked the information.\n\n\n I had tried to use it, and my wife said that I had changed for the better since then, 3 months later. \n\n\n26 pounds have gone away and it’s not a limit! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nSerge Smith, San Diego\n\n\n\n\n\nAnatrim gives you an opportunity to realize you doesn’t have such a great need for the constant eating. It raises your spirit, supplies you with additional energy, and attacks useless kilos. Especial thanks to its mighty newly-elaborated formula!!\n\n\n\nPry out latest intelligence!\n\n\n\n"}