{"category": "spam", "to_address": "\"Isaac Jordan\" <manager@speedy.uwaterloo.ca>,\n   \"Morris Ian\" <gnitpick@speedy.uwaterloo.ca>,\n   \"Clifton Wallace\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"Suzanne Stewart\" <Suzanneyxuc@psitechnologies.com>", "subject": "Not another email from Ms. Stewart:)", "body": "Treat yourself and your woman to a marvelous, sensual experience.\n\nIntroducing the Vibrator Ring \n\nIts patented design is both comfortable and washable. The Ring section\neasily stretches to fit any size and is made of non-toxic silicone rubber\nmaterial that is both soft and hygienic.\n\nThe Vibrator Ring features a raised tickler with thinly sculptured ridges\nespecially designed to stimulate her c-spot and a micro vibration motor\nwhich produces pulsating sensations through the shaft promoting multiple\npleasures.\n\nIt's self-powered & has a switch to turn the device on and off as you\nchoose. So you're in control.\n\n\nhttp://www.bedroomtoy.net\nSee why everyone else Loves It! It is so Much! \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nlife of its people, the routine and non-routine, the predictable and\nunpredictable. The relationship between these two kinds daily-life elements\ncan be the \"novelty ratio\" of society, and as the level of or novelty rises,\nless and of life appears subject to routine forms of coping behavior. More\nand there is growing weariness and wariness, pall of pessimism, decline in\nsense of mastery. More and more, environment comes to seem \nbeyond human control. Thus great social forces converge: the relentless\nmovement transience is reinforced and more potentially dangerous by rise in\nthe novelty ratio. as we shall see, is this novelty to found solely in\ntechnological arrangements of the In its social arrangements, too, we\nanticipate the unprecedented, unfamiliar, the bizarre. Chapter 10 THE MAKERS\nThe year 2000 is closer to in time than the great depression, the world's\neconomists, traumatized by that historic \nremain frozen in the of the past. Economists, even who talk the language of\nare peculiarly conservative creatures. If were possible to pry from brains\ntheir collective of the economy of, the year 2025, it look very much like\nthat 1970 only more to think in straight economists have great difficulty\nimagining alternatives communism and capitalism. They see in the of\nlarge-scale organization nothing than linear expansion of old-fashioned They\nsee technological advance as \nnon-revolutionary extension of the known. Born scarcity, trained to think\nterms of limited resources, they can conceive of society in which man's\nmaterial wants have been satisfied. One reason for lack of imagination is\nwhen they think about technological they concentrate solely on the means\neconomic activity. Yet the super-industrial revolution the ends as well. It\nto alter not merely \"how\" of production but \"why.\" It will, in short,\ntransform\n\n\nkindest regards,\n\n\n\nSuzanne\n\n\n"}