{"category": "spam", "to_address": "\"Raymond Ronald\" <ktwarwic@speedy.uwaterloo.ca>,\n   \"Gregory Anthony\" <manager@speedy.uwaterloo.ca>,\n   \"Joshua Kevin\" <gnitpick@speedy.uwaterloo.ca>", "from_address": "\"Robin.\" <Robinn@vips-france.com>", "subject": "Just another message from Ms. Morrison", "body": "Treat yourself and your woman to a marvelous, sensual experience.\n\nIntroducing the Vibrating Ring \n\nIts patented design is both comfortable and washable. The Ring section\neasily stretches to fit any size and is made of non-toxic silicone rubber\nmaterial that is both soft and hygienic.\n\nThe Vibrating Ring features a raised tickler with thinly sculptured ridges\nespecially designed to stimulate her c-spot and a micro vibration motor\nwhich produces pulsating sensations through the shaft promoting multiple\npleasures.\n\nIt's self-powered & has a switch to turn the device on and off as you\nchoose. So you're in control.\n\n\nhttp://www.wickedtimes.net\nGo ahead and sneak a peek, You will never Look Back!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nand the consequent sense of control also feeds the philosophy of Songs and\nadvertisements hail appearance of the \"now and learned psychiatrists,\ndiscoursing the presumed dangers of repression, warn us to defer our\ngratifications. out and search for immediate payoff encouraged. \"We're more\noriented to the present,\" teen-age girl to after the mammoth Woodstock rock\nmusic \"It's like do what you to do now... If you stay anywhere \nlong you get into planning thing... So you just move Spontaneity, the\npersonal of social planlessness, is into cardinal psychological virtue. All\nhas its political analog in emergence of coalition of right wingers and New\nin support of what can be termed loose\" approach to the future. Thus we\nincreasing calls for anti-planning non-planning, sometimes euphemized as\n\"organic growth.\" Among radicals, this takes on anarchist coloration. Not\nonly \nit regarded as unnecessary or to make long-range plans the future of the\ninstitution or they wish to overturn, it is even regarded as poor taste to\nthe next hour and half of meeting. Planlessness is that planning imposes\nvalues on future, the anti-planners the fact that non-planning so, too often\nwith far consequence. Angered by the narrow, econocentric of technocratic\nplanning, condemn systems analysis, cost benefit accounting, and methods,\nignoring the fact used differently, these very tools \nbe converted into powerful for humanizing the future. When critics that\ntechnocratic planning is anti-human, the sense that it social, cultural and\npsychological values its headlong rush maximize economic gain, are usually\nright. they charge that it is shortsighted undemocratic, they are usually\nright. they charge it inept, they are usually right. But they plunge\nbackward into irrationality, anti-scientific\n\n\nbye bye\n\n\n\nRobin\n\n\n"}