{"category": "ham", "to_address": "Giovanni Petris <GPetris@uark.edu>", "from_address": "Duncan Murdoch <murdoch@stats.uwo.ca>", "subject": "Re: [R] Suggestions for statistical computing course", "body": "On 4/20/2007 9:34 AM, Giovanni Petris wrote:\n> Dear R-helpers,\n> \n> I am planning a course on Statistical Computing and Computational\n> Statistics for the Fall semester, aimed at first year Masters students\n> in Statistics. Among the topics that I would like to cover are linear\n> algebra related to least squares calculations, optimization and\n> root-finding, numerical integration, Monte Carlo methods (possibly\n> including MCMC), bootstrap, smoothing and nonparametric density\n> estimation. Needless to say, the software I will be using is R.\n> \n> 1. Does anybody have a suggestion about a book to follow that covers\n>    (most of) the topics above at a reasonable revel for my audience? \n>    Are there any on-line publicly-available manuals, lecture notes,\n>    instructional documents that may be useful?\n\nAfter you're done the course, please write a review of whatever book you \nchoose.  I think a lot of people would be interested.\n\n> 2. I do most of my work in R using Emacs and ESS. That means that I\n>    keep a file in an emacs window and I submit it to R one line at a\n>    time or one region at a time, making corrections and iterating as\n>    needed. When I am done, I just save the file with the last,\n>    working, correct (hopefully!) version of my code. Is there a way of\n>    doing something like that, or in the same spirit, without using\n>    Emacs/ESS? What approach would you use to polish and save your code\n>    in this case? For my course I will be working in a Windows\n>    environment. \n>    \n>    While I am looking for simple and effective solutions that do not\n>    require installing emacs in our computer lab, the answer \"you\n>    should teach your students emacs/ess on top of R\" is perfecly\n>    acceptable.\n\nThe Windows GUI has a simple editor built in, that allows the work flow \nyou want (but it doesn't have all the bells and whistles of ESS).  I'd \nrecommend using it if you want simple installation:  it's just there.\n\nThere are a couple of shareware/freeware editors (WinEDT, Tinn-R) that \nhave hooks to R.  WinEDT also has support for TeX/LaTeX; if that's \nimportant to you, it might be worth the cost/effort to install.  I'm \nless familiar with Tinn-R, but I believe it's free, whereas WinEDT is not.\n\nIf you want your students to link compiled C/C++/Fortran code to R, \nyou'll need to install a number of tools that don't normally come with \nWindows.  See the R Admin manual or www.murdoch-sutherland.com/Rtools.\n\nDuncan Murdoch\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}