{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Neil Blanchard\" <hoqdatapulsedbmac@datapulsedb.com>", "subject": "Doctors and Celebrities endorse Anatrim", "body": "\nMake yourself more attractive to others\n\n\n\n\n\n\nAnatrim – The latest and most fascinating product for corpulent people is now available – As told on Oprah.\n\n\nDo you hold in your memory all the times when you asked yourself to do anything for being saved from this quickly growing number of kilos? Fortunately, now no big price is to be paid. With Anatrim, the ground-shaking pound-melting blend, you can get naturally health lifestyle and a really slender figure. Just look at what our customers state!\n\n\n\n\"I hate to admit it but I was an awful food addict. \n\n\nI ate all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis ruinous passion finished when I started course of taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my craving for food abated, \n\n\nmood improved and I turned to the happiest person on the planet 24 pounds in 2.6 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nRita R., Boston\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nYou can't imagine how I detested being derided at school. \n\n\n\n\nI detested my stoutness and I detested even myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nThis stuff literally pulled me out of this awful nightmare! A lot of thanks to you, guys.\"\n\n\n\n\n\nMikkey Fox, New York\n\n\n\n\n\n\"You know what? My marriage was saved thanks to Anatrim! I went into this circle, depression – eating more – even more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce one of my friends pointed to your web page and I ordered Anatrim as soon as it was possible. \n\n\nThe result was splendid, my appetite came to normal level, I was in a good mood oftener, and, be sure, I went some belt holes back. And the sex became fantastic, too!\"\n\n\n\n\n\nFrancis\n\n\n\n\n There is a lot of thanks left by happy people trying Anatrim. Why don't you join the thousands and thousands of slender people and take this all-natural appetite decreasing power increasing product now!\n\n\nDon’t decline your opportunity!\n\n\n\n\n"}