{"category": "spam", "to_address": "<ktwarwic@flax24.uwaterloo.ca>", "from_address": "\"The Bull Report\" <news@thebullreport.com>", "subject": "News update on MBKR... Wells Fargo Financial Corporation Canada and MortgageBrokers.com Inc. Form a Strategic Partnership", "body": "    To view this email as a web page, go    here.     \n\n\nThe Bull ReportMay 14th, 2007\nWells Fargo Financial Corporation Canada and MortgageBrokers.com Inc. Form a Strategic PartnershipAlliance Will Expand Consumer Choice in Mortgages While Lowering Costs\nONTARIO, NY, May 14 /PRNewswire-FirstCall/ - Wells Fargo Financial Corporation Canada and MortgageBrokers.com Holdings Inc. (OTC BB: MBKR - News) said they entered into a strategic partnership alliance through which Wells Fargo Financial Canada will provide dedicated resources and exclusive financial products for MortgageBrokers.com to generate greater mortgage volumes for both companies. \nRead the full release\n\n\nAbout MortgageBrokers.comMortgageBrokers.com is an online lead generator and mortgage brand specializing in the mortgage brokerage sector. The Company is dedicated to re- branding the over 40,000 small and medium mortgage broker (SME) firms in North America while providing these entities scalability through a centralized, shared services platform. MortgageBrokers.com is designed to facilitate continued owners ship of these SME brokers while they work under the umbrella of one globally recognized brand.\n\nRead the full disclaimer \nClick here\n\n\n\n\n\n\n                                    This email was sent to:  ktwarwic@flax24.uwaterloo.ca\n\n\n\n\n                                                            This email was sent by: The Bull Report                                                                                                              \n                                                            1846 rosemeade 104 dallas, TX 75007 USA \n                                                            \n\n\n          \n                                    We respect your right to privacy - view our policy\n\n\n\n\n\n\n\n\n\nManage Subscriptions | \n                                    Update Profile | \n                                    One-Click Unsubscribe\n\n\n\n\n\n"}