{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nI’ll be anchoring a special hour-long\n  broadcast of the CBS Evening News tonight from Blacksburg, Virginia, where earlier\n  today a gunman opened fire multiple times on the Virginia Tech University\n  campus, resulting in the deadliest campus massacre in U.S. history. Our team\n  of correspondents will bring you complete coverage.\n \nWe will start by telling you about the incidents\n  that began unfolding at 7:15 this morning in one of the largest residence\n  halls on the Virginia Tech campus and continued two hours later at Norris Hall,\n  an engineering building. By late morning, at least 31 on campus were dead. President\n  Bush said he was “horrified” by the news of the shooting, and\n  expressed his sympathy for the victims and their families. Thalia Assuras will\n  talk with some of the students who survived the shooting and have more\n  eyewitness accounts.\n \nDaniel Sieberg, our science and technology correspondent,\n  will detail how the university and the students who study there used Internet\n  communications to keep one another informed as the tragedy unfolded.\n \nAnd in the wake of such a massacre, it is natural to\n  ask “could this have been prevented?” Hari Sreenivasan will\n  report on the state of security on campuses around the country.\n \nIn the meantime, residents of the Northeast are\n  coping with the remnants of a massive storm that hit over the weekend,\n  bringing record rainfall and strong winds. By Monday afternoon, much of the\n  East Coast was still under water and hundreds of thousands of people were\n  without electricity. Nancy Cordes will have the story.\n \nThe National Urban League is releasing a report tomorrow\n  that will show that black men in America don’t have many of\n  the same privileges as other citizens. We’ll have the study’s\n  findings tonight.\n \nI hope you’ll join us. In the meantime, stay\n  updated on news out of Virginia\n  by visiting CBSNews.com.\n \nThanks,\n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}