{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@flax9.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "Napster and Motorola Enter Unique Marketing Agreement for the US, UK and German Markets", "body": "\n\n\n\n\n\n\n\n\nNapster and Motorola Enter Unique Marketing Agreement for the US, UK and German Markets\nAward-Winning Napster To Go Service To Be Featured Across Extensive Line of Motorola Music Handsets \nLOS ANGELES, May 15, 2007 /PRNewswire-FirstCall via COMTEX News Network/ --  Napster (Nasdaq: NAPS), the pioneer of digital music, and Motorola, Inc. (NYSE: MOT), a global leader in wireless communications, today announced a unique marketing agreement that will bring Napster's industry-leading on demand music subscription service to mobile consumers, offering free and easy access to a vast collection of music and content across Motorola's entire line of portable subscription-enabled devices. Napster and Motorola will develop promotional efforts for North America, the UK and Germany designed to make it easy for consumers to experience the unparalleled Napster music experience and load music content to a full range of Motorola music-enabled and optimized handsets, including the ROKR Z6 and Z6m unveiled today. The companies will also explore the creation of unique and exciting new bundled music experiences at retail for mobile music enthusiasts. The first phase of the multi-faceted marketing agreement provides mobile music lovers with one free month of the award-winning Napster To Go subscription service, enabling unlimited access to more than 3 million songs, expert programming and exclusive content.  The companies will offer the service through in-box and aftermarket promotions, via retail and carrier channels in the US and Europe, together with additional promotional opportunities to be announced in the coming months.  European customers will also receive five free permanent downloads in addition to their subscription. \"Mobile music enthusiasts will enjoy the most popular music subscription service to complement Motorola's sleek design and functionality that delivers the ultimate mobile music experience,\" said  Chris White, senior director, Mobile Devices Multimedia Entertainment, Motorola. \"Our relationship with Napster further advances Motorola's global music strategy and presents an incredible opportunity to expand the company's strong music ecosystem.\" \"Motorola's powerful global brand image, music-enabled handset portfolio and exceptional market positions, present tremendous potential for Napster to further deepen and broaden its global presence,\" said Chris Gorog, chairman and CEO of Napster. \"We are very pleased to announce this new global relationship which supports our focus on driving adoption of our subscription model by attaching to music enabled cell phones which are expected to become the dominant device for portable music over the next few years.\" Napster To Go is compatible across Motorola's extensive portfolio of music-optimized and enabled phones which feature Window Media DRM. The first retail music experiences are expected to launch across North America and Europe in the second half of 2007. About Napster Napster, the pioneer of digital music, offers the ultimate in interactive music experiences, creating better ways to discover, share, acquire and enjoy music -- anytime, anywhere.  The company's offerings include \"Napster\" (http://www.napster.com) -- the most popular on demand music subscription service in the world; \"Freenapster\" (http://www.freenapster.com) -- a unique Web experience offering free on demand music legally; and \"Napster Mobile\" -- one of the industry's fastest growing mobile music platforms.  Napster is headquartered in Los Angeles, with offices in New York, Luxembourg, Frankfurt and Tokyo. Copyright (C) 2007 Napster, LLC. All rights reserved. Napster, Napster Mobile, Napster To Go and Napster Light are either trademarks or registered trademarks of Napster, Inc. or its subsidiaries in the United States and/or other countries. MOTOROLA and the Stylized M Logo are registered in the US Patent & Trademark Office.  All other trademarks are owned by their respective owners. \n    Media Contact:\n    Becky Farina\n    Napster\n    310-281-5005\n    becky.farina@napster.com\n\n    Investor Contacts:\n    Alex Wellins or Jennifer Jarman\n    The Blueshirt Group, for Napster\n    (415) 217-7722\n    alex@blueshirtgroup.com; jennifer@blueshirtgroup.com\n\nSOURCE  Napster, LLC Media, Becky Farina of Napster, +1-310-281-5005, becky.farina@napster.com; or\nInvestors, Alex Wellins, alex@blueshirtgroup.com, or Jennifer Jarman,\njennifer@blueshirtgroup.com, both of The Blueshirt Group, +1-415-217-7722, for\nNapster\nhttp://www.napster.com\n\n\n\n\n\n\n\n\n\n\n You are subscribed to Napster Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n Napster \n 461 S. Milpitas Blvd. , Milpitas, CA 95035\n Service provided by Shareholder.com \n\n\n\n\n\n"}