{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTUESDAY 17 APRIL 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER ROBERT MORGAN\n\t\t\t\t\t\n\t\t\t\t\tHello, \n\n\n\nBLOOD\n\n\nWe're leading tonight's programme on an extraordinary story. Today is World Haemophilia Day, but there's little to celebrate. Thousands of British haemophiliacs are living with life-threatening viruses - like HIV and hepatitis - contracted from NHS and commercial blood products. \n\n\nTomorrow, sees the start of a controversial inquiry to find out what went wrong. But this is not a proper public inquiry - successive Governments have resisted attempts to hold anyone to account. \n\n\nNow, Newsnight's been given startling, and damning new evidence that suggests some doctors used haemophiliacs to test out new blood products. Our Science Editor, Susan Watts, asks if this tragedy could - and should - have been avoided.\n\n\nSHOOTINGS\n\n\nPolice in Virginia have identified the gunman who killed at least thirty students on a college campus yesterday. He's been named as Cho Seung-Hui, from South Korea. \n\n\nOfficials had indicated that there might have been more than one person behind the shootings - but police say that now seems unlikely. We'll have latest on the ground from Virginia.\n\n\nINFLATION\n\n\nHome owners are bracing themselves for a further rise in interest rates after inflation reached a ten year high. It now stands at 3.1%. \n\n\nThe Governor of the Bank of England has had to write a public letter to the Chancellor to explain why the rise was so high. Paul Mason will explain what all this could mean live.\n\n\nPOLITICS\t\n\n\nTony Blair and Zombie Brown are in the spotlight today. The Prime Minister has given what will be one of his last press conferences. \n\n\nThe Chancellor is facing a rare vote of no confidence in Parliament over the pensions crisis. And the BBC has learnt that David Milliband will not run for the Labour leadership when Tony Blair retires. \n\n\nOur Political Editor, Michael Crick will give us his analysis of events.\n\n\nNewsnight is on BBC2 at 10.30pm.\n\n\nRobert\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nNEW TOLKIEN BOOK\n\n\t\t\t\t\t\t\tA new Tolkien book, published many years after the author's death, has been written from his notes by his son.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}