{"category": "spam", "to_address": "<mack@speedy.uwaterloo.ca>", "from_address": "\"Benjamin\" <awv@ima.dcgov.org>", "subject": "circumvent refinish", "body": "\n\n\n\n\n\n\n\nEXPECT VISIBILITY TO BE NEAR ZERO AT \nTIMES.\nRAIN AND WET SNOW AT TIMES EARLY THIS MORNING. This \nsame information is available in other file formats including the XML based RSS and \nCAP formats. MOVEMENT WILL BE TOWARD THE NORTHEAST ABOUT 30 MPH. WINDS WILL REMAIN \nLIGHT. AND NORTHWEST MISSISSIPPI INCLUDING THE MEMPHIS METRO AREA. 07 - Fri - \n01:32:25 PM (EDT) Warnings, Watches and Advisories in Effect for the United States \nThis page contains watches, warnings and advisories that are in effect for the \nUnited States.\nLOW LEVEL MOISTURE WILL INCREASE ABOVE CRITICAL \nLEVELS SATURDAY AS WINDS SWING AROUND TO THE SOUTH AHEAD OF AN APPROACHING STRONG \nCOLD FRONT. NATIONAL WEATHER SERVICE DOPPLER RADAR CONTINUED TO INDICATE A SOLID \nAREA OF RAIN AND EMBEDDED THUNDERSTORMS ACROSS NORTHEAST OKLAHOMA AND NORTHWEST \nARKANSAS MOVING NORTHEAST AT 50 MPH. HYDER 700 AM ADT FRI APR 13 2007 . MOSTLY \nCLOUDY SKIES WITH SCATTERED SHOWERS THROUGH NOON. NO MORE THAN A TENTH OF AN INCH IN \nMOST LOCATIONS.\nAND MONTGOMERY COUNTIES. AND JACKSON HAVE THE BEST \nCHANCE OF GETTING WET THROUGH 200 PM CDT. WIND SOUTHEAST TO EAST 5 TO 15 MPH WITH \nGUSTS TO 25 MPH IN CHANNELS AND OUTFLOW AREAS.\nKAKE 6 AM ADT FRI APR 13 2007 . SOME OF THESE \nSTORMS HAVE BEEN PRODUCING VERY SMALL TO PEA SIZE HAIL. DENSE FOG ADVISORY IN EFFECT \nUNTIL 9 AM ADT THIS MORNING. LITTLE OR NO SNOW ACCUMULATION. SHOWERS CONTINUING \nTHROUGH NOON WITH SOUTHEAST WIND TO 15 MPH. FLURRIES AND PATCHY FOG. SHOWERS THROUGH \nNOON WITH EAST WIND TO 15 MPH.\nSOME OF THESE STORMS HAVE BEEN PRODUCING VERY SMALL \nTO PEA SIZE HAIL. PORT ALEXANDER 6 AM ADT FRI APR 13 2007 . \nFRANCIS-TALLAHATCHIE-TATE-TIPPAH-TIPTON-TISHOMINGO-TUNICA- UNION-YALOBUSHA- \nINCLUDING THE CITIES OF. HAINES 6 AM ADT FRI APR 13 2007 .\nRAINFALL RATES WILL GENERALLY CONTINUE BE AROUND A \nTENTH OF AN INCH PER HOUR. PORT ALEXANDER 6 AM ADT FRI APR 13 2007 \nPORT ALEXANDER 6 AM ADT FRI APR 13 2007 \n\nKAKE 6 AM ADT FRI APR 13 2007 . LOW LEVEL MOISTURE \nWILL INCREASE ABOVE CRITICAL LEVELS SATURDAY AS WINDS SWING AROUND TO THE SOUTH \nAHEAD OF AN APPROACHING STRONG COLD FRONT.\nHEAVIER AMOUNTS CAN BE EXPECTED IN \nTHUNDERSTORMS.\nSOME POSSIBLY SEVERE. HOONAH 6 AM ADT FRI APR 13 \n2007 . RAIN AND WET SNOW AT TIMES EARLY THIS MORNING.\nRAINFALL AMOUNTS WILL BE ONE TENTH INCH PER \nHOUR.\nMOSTLY CLOUDY SKIES WITH SHOWERS THROUGH \nNOON.\nRAIN SHOWERS THROUGH NOON WITH EAST WIND TO 15 \nMPH.\nThis same information is available in other file \nformats including the XML based RSS and CAP formats.\nRAIN SHOWERS THROUGH NOON WITH EAST WIND TO 15 \nMPH.\n"}