{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "robert weissman <rob@essential.org>", "subject": "[Ip-health] Patent Barriers and the Clinton Foundation announcement", "body": "Patent Barriers Pose Threat to Realizing Benefits of Generic Competition\nfor Second-Generation/Second-Line Therapies\n\nRobert Weissman, Essential Action\nMay 8, 2007\n\nToday's announcement from the Clinton Foundation and UNITAID means that\ndeveloping countries have in their grasp the opportunity to benefit from\nprice-lowering generic competition for second-generation and second-line\nHIV/AIDS drugs.\n\nPatent barriers may stand in the way, however. Among the medicines for\nwhich the Clinton Foundation has announced price discounts, lamivudine\n(3TC), abacavir (ABC) and emtricitabine (FTC) appear to be heavily\npatented, in both larger developing countries and throughout the poor,\nhigh-HIV-incidence countries in Africa.\n\nAchieving the gains possible from efficient generic competition will\nrequire countries to overcome existing patent barriers. This means\ncountries must identify patents in force within their borders; and,\nwhere there are patent barriers, countries will need to issue compulsory\nlicenses to overcome them.\n\nASCERTAINING PATENT STATUS\n\nAscertaining patent status for any particular drug in many developing\ncountries is very difficult -- often beyond the capacity of national\npatent offices. National governments should ask brand-name companies to\nidentify patents they claim on HIV/AIDS (and other new and important)\nmedicines, and adopt policies that make it clear they will not enforce\nmedicine patents that are not disclosed.\n\nPATENT BARRIERS ON IMPORTANT PRODUCTS\n\nConsiderable information is available on the patent status of two Gilead\nproducts, tenofovir and FTC. Gilead's closed licensing scheme with a\nlimited number of generic firms has been made public, and includes\ninformation on patent status. (1) Tenofovir does not appear to be widely\npatented in developing countries, but, according to Gilead, it is\npatented (or a patent application is pending) in India and Indonesia.\nThe Gilead materials leave unclear whether tenofovir is patented in the\nseveral dozen countries not included in the licensing scheme.\n\nThe patent in India is not likely to constitute a significant barrier,\nbecause under India law tenofovir if patented is likely subject to an\nautomatic compulsory license. But Indonesia will need to obtain or issue\na license if it hopes to benefit from the generic prices and\ncombinations available through the Clinton Foundation agreements.\n\nFTC is much more widely patented. The Gilead licensing documents\nindicate patents have been granted or filed on the product in: Barbados,\nBenin, Botswana, Burkina Faso, Burundi, Cameroon, Central African\nRepublic, Chad, Congo, Democratic Republic of Congo, Egypt, Equatorial\nGuinea, Gabon, Gambia, Ghana, Guinea Bissau, Indonesia, Kenya,\nKyrgyzstan, Lesotho, Madagascar, Malawi, Mali, Mauritania, Moldova,\nMorocco, Mozambique, Namibia, Nicaragua, Niger, Nigeria, Pakistan,\nSenegal, Sierra Leone, South Africa, Sudan, Swaziland, Tajikistan,\nTanzania, Togo, Tunisia, Uganda, Uzbekistan, Vietnam, Zambia and\nZimbabwe. The Gilead materials leave unclear whether FTC is patented in\nthe several dozen countries not included in the licensing scheme.\n\nKey second-line products for which the Clinton Foundation has announced\nmajor price reductions are ABC and 3TC. Both of these products appear to\nbe widely patented in the developing world, including throughout Africa.\nThere are two regional patent offices in Africa: the African\nIntellectual Property Organization (known by its French acronym, OAPI)\nand the African Regional Intellectual Property Organization (ARIPO).\nBoth regional offices have approved or granted patents for ABC and 3TC.\nPatents on ABC are also reportedly in effect in Brazil, China, South\nAfrica and Ukraine, with the status in many other countries unknown.\nPatents on 3TC are also reportedly in effect in China, South Africa and\nUkraine, with the status in many other countries unknown. (2)\n\nCONCLUSION\n\nThe door is now open for developing countries to maintain treatment for\npeople with HIV/AIDS as they move to second-generation treatments.\nThailand, Brazil, Indonesia, Malaysia, Mozambique, Zambia, Ghana,\nEritrea, South Africa and others have shown that issuing compulsory\nlicenses is politically feasible. It is time for individual and\ncoordinated action among developing countries -- and international\nagencies -- to prioritize public health over the narrow commercial\ninterests of Big Pharma.\n\nThe benefits of generic competition have again been illustrated today\nwith the Clinton Foundation/Unitaid announcement. But fully realizing\nthat potential will require governments to act.\n\n(1) See Knowledge Ecology International, \"KEI Request for Investigation\nInto Anticompetitive Aspects of Gilead Voluntary Licenses for Patents on\nTenofovir and Emtricitabine, February 12, 2007, Attachments 1 and 2,\navailable at: www.keionline.org/misc-docs/ftcgilead12feb07.pdf.\n\n(2) WHO-MSF-UNAIDS, \"Determining the Patent Status of Essential\nMedicines in Developing Countries,\" WHO/EDM/PAR/2004.6, 2004, available\nat:\n\n\n---\n\nRobert Weissman\nEssential Action\nTel: 1-202-387-8030\nE-mail: robe@essential.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}