{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 21, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESGas Prices Set New Record\nGasoline prices climbed to another record Monday, as the average cost of a gallon of regular unleaded rose to $3.19, up from\n                        $3.17 on Sunday. Nationwide, the highest average price for regular fuel is $3.59 in Chicago. More...Watch: Gas Prices At All-Time High\n• Diabetes Drug Tied To Heart Risk In Study\n                     \t\t\t\t\t| Watch• MySpace To Share Sex Offender Data• Lebanon's Fight With Militants Heats UpU.S.Court Sides With Telecoms, Autistic Child\nConsumers alleging that phone companies conspired to limit competition lost before the Supreme Court. The court ruled in favor\n                        of an Ohio couple seeking to represent their special needs child themselves because they'd run out of money for a lawyer. More...Watch: Court Backs Cops On Chase\n• Detroit Fire Kills Pregnant Mom, 3 Kids• Idaho Gunman's Wife Found Dead At Home\n                     \t\t\t\t\t| Watch• Midwest Bracing For Cicada Invasion• More StoriesWorldIran Charges U.S. Scholar With Spying\nIran has charged a detained Iranian-American academic with seeking to topple the ruling Islamic establishment. After months\n                        of interrogation, Haleh Esfandiari was transferred to a prison with no further communications or visits with her family. More...\n• Hamas Strikes Back From Gaza\n                     \t\t\t\t\t| Watch• Lebanon's Fight With Militants Heats Up• Historic 19th Century Ship Burns In London\n                     \t\t\t\t\t| Watch• More StoriesPoliticsJimmy Carter To Bush: Never Mind\nFormer President Jimmy Carter called his remarks \"careless or misinterpreted\" when he said the Bush administration was the\n                        \"worst in history\" for its impact around the world. Mr. Carter said he only meant to compare President Bush with Nixon. More...Watch: Carter Bashes Bush\n• Fla. Moves Presidential Primary To Jan. 29\n                     \t\t\t\t\t| Watch• Bill Richardson Makes It Official\n                     \t\t\t\t\t| Watch• Bush: Gonzales \"Has Done Nothing Wrong\"\n                     \t\t\t\t\t| Watch• More StoriesHealthStatins May Cut Prostate Cancer Deaths\nResearchers say there may be a surprising reason for the ongoing decline in U.S. prostate cancer deaths: increased use of\n                        cholesterol-lowering statin drugs. More...\n• N.J. May Give Pet Owners Right To Sue• Diabetes Drug Tied To Heart Risk In Study\n                     \t\t\t\t\t| Watch• When \"Senior Moments\" Begin\n                     \t\t\t\t\t| Watch• More StoriesSciTechMidwest Bracing For Cicada Invasion\nThe Midwest is about to get noisy. \"Brood XIII\", the next generation of the 17 year cicada, is about to take over the trees,\n                        air and ground. Dogs have a big snack to come, but some outdoor events planners have a major headache on their hands. More...\n• MySpace To Share Sex Offender Data• Wayward Whales Headed Back To Sea\n                     \t\t\t\t\t| Watch• Alltel Acquired For $27.5B• More StoriesBusinessLess Bang For Your Buck In Europe\nThe dollar has fallen 5 percent so far this year against the euro and the pound. That's equivalent to a 20 percent annual\n                        decline. It could be good for the trade deficit, but bad for anyone who buys foreign products or travels abroad. More...\n• S&P 500 Ventures Into Record Territory• Alltel Acquired For $27.5B• James Dyson Keeps Innovating• More StoriesEntertainmentBrangelina Takes On Cannes\nAngelina Jolie, Marianne Pearl and Brad Pitt, the movie's co-producer, were at the Cannes Film Festival on Monday for the\n                        premiere of \"A Mighty Heart,\" about Daniel Pearl's abduction and murder in Pakistan in 2002. More...Watch: Brangelina Arrives At Cannes\n• Garrison Pleads Guilty In Fatal Crash\n                     \t\t\t\t\t| Watch• Yeah Boyeeee! Flavor Flav Roast Announced• Three Could Be Charm Twice For Bloom\n                     \t\t\t\t\t| Watch• More StoriesOpinionThompson Doing Things His Way\nFred Thompson wasn't at last week's Republican presidential debate, but he still managed to be relevant, the Weekly Standard\n                        says, thanks to the former senator's innovative pre-campaign strategy. More...Watch: Republicans Take Jabs\n• Jimmy Carter's Cutting Words\n                     \t\t\t\t\t| Watch• John And Rudy's New York Revue\n                     \t\t\t\t\t| Watch• Andy Pays A Visit To The Book Fair• More StoriesCBS NEWS BROADCASTSThe Early Show: Celeb Spot: Three Could Be Charm Twice For Bloom\nThe third movie in the \"Pirates\" trilogy comes out this week, to go along with his \"Lord of the Rings\" trilogy. \"Pirates of\n                        the Caribbean: At World's End\" is expected to rack up the same mega-numbers its predecessors did. More...Watch: Bloom's 'Pirate' Success\n• EARLY SHOW: Teen Slims Down With Gastric Bypass• EARLY SHOW: Katrina Heroes Honored With Courage Award\n                     \t\t\t\t\t| Watch• EARLY SHOW: Ponytails Key \"Beat-The-Heat\" Hairstyles\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nLebanon Battles MilitantsLebanese troops exchanged fire with militants in the northern city of Tripoli after laying siege to a Palestinian refugee\n                                    camp suspected of being a militant stronghold. Charlie D'Agata reports.\nTOP VIDEOS\nEmergency Landing In Florida\nFirst Look: Immigration Debate\nFire Damages Famous School\nRichardson Declares Candidacy\nDogs Attack Little Boy\nDoggy Mama Nurses Tiger Cubs\nGas Prices Fuel Cost-Cutting\nReport: Immigration Costs High\nViolence Flares In Lebanon\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMike Wallace profiles GOP presidential hopeful Mitt Romney, this Sunday, 7 p.m. ET/PT.48 Hours MysteryDeath Of A Dream:An aspiring Broadway dancer is murdered. Did her secrets contribute to her death? Erin Moriarty\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}