{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Reuters piece on Clinton supporting Thai and Brazilian CL decisions", "body": "\n\n\n\"I strongly support the position of the governments of Thailand and\nBrazil and their decision after futile negotiations to break these\npatents,\" said Clinton.\n\n-----------\n\nhttp://www.reuters.com/article/homepageCrisis/idUSN08193718._CH_.2400\n\nBill Clinton brokers deal for lower AIDS drug prices\n\nTue May 8, 2007 6:03PM EDT\n\n(Updates with details from announcement)\n\nBy Caroline Valetkevitch\n\nNEW YORK, May 8 (Reuters) - Former President Bill Clinton announced\ndeals with two Indian generic drug companies on Tuesday to cut prices\nof AIDS treatments for 66 developing countries, a move that could help\nnearly half a million patients.\n\nThe new prices for second line anti-retroviral drugs, which are\nrequired by patients who develop resistance to a previous drug regimen,\nwill mean an average savings of 25 percent in low-income countries and\n50 percent in middle-income countries, said Clinton, who announced the\ndeal at the Clinton Foundation offices in New York.\n\nThese drugs are about 10 times the price of first-line treatments, he\nsaid, noting that nearly a half million patients will require these\ndrugs by 2010.\n\n\"That's a very great strain on countries' health-care budgets, and\ngovernments fear all over the world that they will simply not be able\nto keep patients on treatment,\" he said.\n\nThe pact between the Clinton Foundation and Indian companies Cipla Ltd.\nand Matrix Laboratories Ltd. HIV/AIDS is widespread in many countries\nin Africa and Southeast Asia.\n\nThe companies collaborated with the foundation to lower production\ncosts, in part by securing lower prices for key raw materials and by\naddressing chemistry challenges, he said.\n\nClinton also said a new once-daily pill now prohibitively expensive in\ndeveloping countries would be made available for less than $1 a day. He\nsaid the pill combines the drugs Tenofovir and Lamivudine and\nEfavirenz.\n\n\"This drug represents the best chance that science has to offer,\" said\nClinton, who was joined by the health ministers of Thailand and Kenya,\nthe chairman of Matrix and France's ambassador to the United States.\n\nThe new cost for this treatment of $339 per patient per year marks a 45\npercent reduction from the current rate available to low-income\ncountries and a 67 percent reduction from the price available to many\nmiddle-income countries, the foundation said.\n\nThe announcement is one of several price reductions the Clinton\nFoundation said its HIV/AIDS Initiative has helped broker since 2002.\nSome 750,000 people are receiving drug treatments for AIDS through the\nfoundation, it said.\n\nThe AIDS virus infects nearly 39 million people globally, and has\nkilled 25 million people since it was identified 25 years ago.\nVirtually all -- 95 percent -- of people infected with the virus live\nin the developing world.\n\nClinton said he supported Brazil and Thailand's efforts to challenge\ndrug patents of big pharmaceutical companies.\n\nThailand this year issued licenses for cheap generic versions of Abbott\nLaboratories Inc.'s (ABT.N: Quote, Profile, Research Kaletra for HIV,\nand Brazil last week took a similar step with Merck & Co.'s (MRK.N:\nQuote, Profile, Research Efavirenz.\n\n\"I strongly support the position of the governments of Thailand and\nBrazil and their decision after futile negotiations to break these\npatents,\" said Clinton.\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}