{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "drew Roberts <zotz@100jamz.com>", "subject": "Re: [cc-community] Strayform - where artists and fans connect to\n\tfund and distribute new creative works", "body": "On Tuesday 15 May 2007 03:19 pm, dream dream wrote:\n> I am the founder of a new company, Strayform.  The goal of\n> the site is provide an alternative means for musicians,\n> programmers, movie producers, and authors to fund,\n> publicize, and distribute their works.  I would like to\n> get feedback on the concept and the site itself.\n>\n>\n>\n> – The Philosophy –\n>\n> Historically publishing companies provided many useful\n> services for creative producers.  They provided equipment\n> and facilities, funded artists, developed worldwide\n> distribution channels, and publicized and advertised on\n> artists\n> \u001b$B!G\u001b(B behalf.  But as time went on the industry became\n> bloated and corrupt.  Artists have been forced into\n> restrictive contracts, lost control of the copyrights, and\n> given small cuts of the revenue.  Consumers have been\n> forced to pay exorbitant prices and suffer DRM and nasty\n> lawsuits.\n>\n>\n>\n> But the industry has undergone massive change.  In the\n> Internet age, the functions of the media industry are\n> being taken over by consumers and artists themselves.  The\n> price of equipment has dropped so that individuals can now\n> create professional quality productions independently.\n> Fans now use blogs, messengers, and e-mail to spread the\n> word about what they like.  There is no longer a need to\n> ship CDs, books, or DVDs as File sharing services offers a\n> costless distribution method.\n>\n>\n>\n> The only missing piece now is \u001b$B!H\u001b(Bfunding\u001b$B!I\u001b(B.  While file\n> sharing is great, the result of unchecked piracy will\n> leave artists with no way to make money and therefore no\n> incentive to produce new media.  \n\nIf you want more support, you might want to consider rewording this piracy \ntheme for one.\n\nAlso, even if artists do not make money from producion/copying/distribution, \nthat does not leave them with no way to make money. (It may restrict their \noptions, but it does not leave them with no options at all.) You don't need \nto overstate the case.\n\n> It is time for the \n> funding model to evolve.  \n\nExperiments welcome here.\n\n> Historically, bundled into the \n> cost of each CD or book is the cost of production and\n> distribution.  But now with the internet distribution is\n> nearly costless.  Let\n> \u001b$B!G\u001b(Bs move the payment forward to the point of creation.\n\nThat is one option. Worth an experiment in my book.\n\n> Recording companies pay artists upfront to create\n> something new and then charge the consumers per copy; let\n> \u001b$B!G\u001b(Bs have fans pay the artists directly and give them the\n> freedom to use and share.  They will use this freedom to\n> distribute and promote, providing a valuable service to\n> artists.  The end result would be lower total costs, more\n> freedom and control for artists and consumers, and new\n> communities with strong ties between artists and fans.\n>\n>\n>\n> – The Site –\n>\n> With actualizing this vision in mind, I created\n> www.strayform.com.  It works like a social network for\n> artist and fans with specialized features to promote,\n> fund, and distribute new media.  A library of CC licensed\n> media leads to you to discover new artists.  Becoming fans\n> of these artists and selecting media as one of your\n> favorites allows us to rank and provide recommendations,\n> while giving you specialized privileges and notifications.\n>  People with similar interests surfing your pages use\n> these connections and find new favorites and artists as\n> well.  These massive connectivity provides a network that\n> funnels interest into Proposals.  Proposals are artists\n> \u001b$B!G\u001b(B offers to create new CC licensed media funded by fans.\n\nUnless htis is for BY and BY-SA works, I am not too interested. To me the \nworks are still mostly gonna be useless and pollution.\n\n> The more proposals that are completed the large the\n> library grows.  For artists, the more of their media\n> circulating the more fans they gather.  The more fans an\n> artist has the more money he can make on each successive\n> proposal, the greater the incentive to create new works.\n> As the ecosystem grows we have a new system for funding,\n> promotion, and distribution built by fans and artists.\n>\n>\n>\n> We are a very small company, but have created an expansive\n> system based on this concept.  We have just launched and\n> would like feedback on how to improve our system and would\n> like to get the word out about Strayform.  So please try\n> our site out and give me your feedback, I am Member\n> \u001b$B!H\u001b(BStray Brandt.\u001b$B!I\u001b(B  We are new and small so I am sure we\n> have a lot of room for improvement, but please join us and\n> help us reach this vision.\n\nI have been thinking along similar lines for a few years now, issues down this \nway prevent me from moving as fast as I might like.\n\nIf you decide to restrict the game to only Free Works, I may have some ideas \nthat could help make the plan better.\n\n>\n>\n> Brandt Cannici\n> Founder\n> www.strayform.com\n>\n\nall the best,\n\ndrew\n-- \n(da idea man)\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}