{"category": "spam", "to_address": "\"croy\" <croy@ivic.qc.ca>", "from_address": "\"cposa\" <cposa@acs.ryerson.ca>", "subject": "Financial Alliance Company", "body": "\nHello,\nFinancial  Alliance  Company, one of the fastest growing financial group\nin USA. With over six years of specialized experience has openings for\ncourier place.\nCompany was established in 2000 year, currently is based in USA and\nprovides mergers and acquisitions consultation and policy consulting\nfor all clients across the entire range of wealth management and\nfinancial services businesses worldwide.\nWe are seeking individuals who are interested in building a profitable\nand rewarding business with our help and support, while achieving a\nbalanced lifestyle that offers both personal and professional growth.\nThis job, if approached correctly is an opportunity for almost\nunlimited income potential, and very fast-growing career.\nAnd the Job itself is not that hard one may think, on a contrary it as\neasy as one-two-three, as we already have mentioned our company works\nwith the clients worldwide, many of them deposited their money in our\ndividends and we are paying them every month, the point is that there\nare too many clients (more then 5,000) and our managers can not do\nall job that is why we are hiring the courier as indeed one of the\nmain parts of the company work-chain, and the courier will have\nresponsibility for receiving company funds and dividends and sending\nthem to the company clients and will receive payments from every\ntransfer they did . The Financial Alliance is growing and we again\nneed an\nopen-minded people with the ambition to become successful and richer\nindeed.\nRequirements: The ideal candidate has prior experience and familiarity\nwith financial services.\nYou must have excellent organizational as well as customer service\nskills.\nTeamwork Skill is a \"must\".\nBachelor Degree is an advantage.\nRead more and register here:\nhttp://falliance.net/contacts/information.php\nBest regards,\nSteve  Peters\nChief manager of Financial   Alliance\n\n\n"}