{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 11, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESGeorgia Judge Voids Teen Sex Sentence\nA Georgia judge ordered the release of a man sentenced to 10 years in prison for having consensual oral sex with a 15-year-old\n                        girl when he was 17. He instead gave Genarlow Wilson a 12-month misdemeanor sentence with credit for time already served. More...Watch: Genarlow Wilson To Be Released\n• Court Rebuffs Bush On Enemy Combatants• S.C. Court Rejects Killer's Zoloft Defense• Searchers Seek Soldier Missing For 3 Days\n                     \t\t\t\t\t| WatchU.S.Court Rebuffs Bush On Enemy Combatants\nA divided federal appeals court ruled that the Bush administration cannot legally detain a U.S. resident it believes is an\n                        al Qaeda agent without charge and must allow him to be released from military detention. More...\n• Searchers Seek Soldier Missing For 3 Days\n                     \t\t\t\t\t| Watch• Cops: Domestic Dispute Caused Wisc. Deaths\n                     \t\t\t\t\t| Watch• High Court Bolsters Anti-Pollution Program• More StoriesWorld3 GIs Killed In Baghdad Bridge Blast\nA car bomb brought down a section of bridge over a highway south of Baghdad yesterday, killing three soldiers, wounding six\n                        and blocking traffic on Iraq's main north-south artery. Meanwhile, former Sunni foes are being asked to help fight al Qaeda. More...Watch: 82nd Airborne Heads To Iraq \n• U.S. Chummy With Sudan Despite Darfur?\n                     \t\t\t\t\t| Watch• Two Red Cross Workers Killed In Lebanon• Bandits Jeopardize Darfur Lifelines• More StoriesPoliticsSenate Set to Vote On Gonzales\nArlen Specter, the top Republican on the Senate Judiciary Committee, says he will vote for a no-confidence resolution against\n                        Attorney General Alberto Gonzales. The measure isn't expected to pass, but few senators are rushing to defend Gonzales. More...Watch: Senate Set For Gonzales Vote\n• Thompson Shakes Up GOP Race\n                     \t\t\t\t\t| Watch• Bush Undaunted On Immigration, Gonzales\n                     \t\t\t\t\t| Watch• Congress' Goal: A Clean, Green Capitol• More StoriesHealthCeliac Disease Clue Found\nGene studies link celiac disease to a defective immune signal. Celiac disease is a digestive disease sometimes called celiac\n                        sprue or gluten-sensitive enteropathy.  More...\n• Autistic Child's Parents Get Day In Court• S.C. Court Rejects Killer's Zoloft Defense• Which Is Cleaner, Toilet Or Fountain?• More StoriesSciTechSony Assailed Over Cathedral War Game\nThe Church of England has threatened to sue Sony for using turning Manchester Cathedral into a war zone in a popular video\n                        game for PlayStation 3. Sony denies the allegation, saying the game takes place in a \"mythical\" reality. More...Watch: 'Resistance: Fall of Man'\n• Congress' Goal: A Clean, Green Capitol• Have QWERTY, Will Travel• High Court Bolsters Anti-Pollution Program• More StoriesBusinessCEOs Rake In Sky-High Perks, Too\nEven as their pay has soared, CEOs continue to receive cushy perks, from personal trips on the corporate jet or yacht to country-club\n                        fees and home alarm systems. Many companies pick up the tab for the taxes on those extras, too. More...Watch: Debate Over CEO Pay\n• A Silver Lining On High Gas Prices?\n                     \t\t\t\t\t| Watch• Estate Planning 101 For Same-Sex Couples• High Court Bolsters Anti-Pollution Program• More StoriesEntertainmentMontana Officials Hunt Letterman Plotter \nA prison inmate accused of plotting to kidnap David Letterman's young son is on the loose after he and another man escaped\n                        the Montana State Prison ranch in a truck. More...\n• Was This Really It For \"Sopranos?\"\n                     \t\t\t\t\t| Watch• Gore Convinced Peppers To Play Live Earth• The Showbuzz Weekly Forecast• More StoriesOpinionPutting Senators On The Spot\nDon't bet the Senate will hold scandal-plagued Attorney General Alberto Gonzales to account, says the Nation. The real\n                        issue will be holding senators to account.  More...Watch: Senate Set For Gonzales Vote\n• Rudy's Unconventional Bid\n                     \t\t\t\t\t| Watch• Graham's Crusade Saved America\n                     \t\t\t\t\t| Watch• Wolfowitz Redux?\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSShowBuzz: People In Hot Water: Paris : God Has Given Me \"New Chance\"\nIn her first interview from behind bars, Paris Hilton says God has given her a \"new chance\" and that her ordeal has inspired\n                        her to make a difference. More...Watch: Paris Busy Behind Bars\n• EARLY SHOW: Was This Really It For \"Sopranos?\"\n                     \t\t\t\t\t| Watch• EARLY SHOW: Cat Cora Cooks \"From The Hip\"• EARLY SHOW: Color Your Hair Bold For Summer\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nCop Sideswiped On HighwayCBS News RAW:  Police in South Carolina are looking for a reckless driver who sideswiped one of their officers while\n                                    on a routine traffic stop near Greenville.\nTOP VIDEOS\nTroops Surge Despite Loss\nFirst Look: Alzheimer's\nBangladesh Mudslides Kill 67\nGenarlow Wilson To Be Released\n'Sopranos' Sign-Off\nSearch For Solider Continues\nTaming Baghdad's 'Hotspots'\nSenate Set For Gonzales Vote\nSopranos Says Arrivederci \n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesLesley Stahl profiles Internet tycoon Barry Diller. This Sunday, 7 p.m. ET/PT.48 Hours MysteryDark Voyage:An aspiring actress dies under mysterious circumstances. Bill Lagattuta reports Saturday at\n                           8 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}