{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (Apr. 9, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 9, 2007\n\n\nApr 9, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for April 9, 2007  \n\n\n\nFirst Enercast Featured Articles for April 9, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories  \n\n\nApr 9, 2007 PowerMarketers Industry Publications\n\n\n\nNew Sheriff On the Grid (EnergyBiz Insider - Apr. 9, 2007)\n\n\n\nEnergyBiz Insider - Apr. 9, 2007 - The National Electric Reliability Council is important. Now that the Federal Energy Regulatory Commission named it the Electric Reliability Organization the standards that it now sets -- with FERC's approval -- are mandatory, not voluntary.\n\n\nApr 9, 2007 PowerMarketers Industry Publications\n\n\n\nBig fish moves to bigger pond - Direct hires Cerniglia (ghi^markets.com - Apr 9, 2007) \n\n\n\nghi^markets.com - Apr 9, 2007 - Direct Energy recently hired Ronald Cerniglia as its leading advocate for competitive markets. It&#8217;s a national job with a national focus. \n\n\nApr 9, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nPacific Gas and Electric Company Seeks to Increase Renewable Energy Resources for its Customers\n\n\n\nSAN FRANCISCO, March 13 /PRNewswire-FirstCall/ -- Pacific Gas and Electric Company announced today that it has issued a Request for Offers (RFO) to solicit renewable energy supply on behalf of its five million electric customers. This marks the company's fifth renewable energy solicitation pursuant to the State of California Renewable Portfolio Standard (RPS) program.\n\n\nApr 9, 2007 The Energy Daily\n\n\n\nConstellation Energy Commodities Group To Acquire Power Contracts for Georgia Electric Cooperatives\n\n\n\nBALTIMORE, March 12 /PRNewswire-FirstCall/ -- Constellation Energy (NYSE: CEG) today announced that its wholesale origination and risk management arm, Constellation Energy Commodities Group, Inc., signed agreements related to the acquisition of select power and gas contracts of Progress Ventures, Inc., a non-regulated subsidiary of Progress Energy. Under the agreement, Progress Ventures will ...\n\n\nApr 9, 2007 The Energy Daily\n\n\n\nPower plants ship out energy\n\n\n\nThe reasons I've heard for this new power plant are the same reasons given for the other power plants that have been built in this region. They have all been in the name of addressing the growing energy needs of Mohave County. The newly proposed Northern Arizona Energy LLC Project is designed to address a particular energy need, that of peak demand. I support generation in Mohave County, both ...\n\n\nApr 9, 2007 Kingman Daily Miner\n\n\n\nStatement By KKR and TPG on TXU Statement About Plant Shutdowns\n\n\n\nAUSTIN, , April 6 PRNewswire Kohlberg Kravis Roberts & Co. and  Pacific Group, investors in the proposed buyout of TXU Corp. by Texas Energy Future Holdings Limited Partnership (TEF), released the following statement today: \"TXU's April 2nd letter to the Public Utility Commission (PUC) referencing potential power plant shutdowns was not shared with the investor group in advance, and we strongly ...\n\n\nApr 8, 2007 DiGiTAL50\n\n\n\nSmart Grid Vision Meets Distribution Utility Reality\n\n\n\nby David Moore and Don McDonnell The term smart grid is hyperbole that seems to imply a future when the grid runs itself absent human intervention. While this is clearly not the case, there is a hard reality emerging: The smart grid concept in many ways suggests that utility companies, executives, regulators and elected officials at all levels of government will indeed face a brutal pass/fail ...\n\n\nApr 9, 2007 Utility Automation & Engineering T&D\n\n\n\nNymex Gas Is Steady Amid Expectations for Stronger Demand During Cold Snap\n\n\n\nNymex Natural Gas Is Steady as Cold Increases Heating Demand By Geoffrey Smith April 9 (Bloomberg) -- Natural gas was little changed in New York after rising earlier as a wave of colder-than-normal weather boosted heating needs across the U.S.  Demand for natural gas, the country's most widely used heating fuel, typically ebbs at this time of the year as higher temperatures curb demand.\n\n\nApr 9, 2007 Bloomberg\n\n\n\nGeorgia Power aims for energy increase\n\n\n\nMudletta Daily Journal Staff WriterATLANTA - Georgia Power has announced it will submit a request to the state Public Service Commission on April 17 for three contracts for 1,795 megawatts of energy beginning in summer 2010.Expiring contracts with energy providers have led the utility to seek additional power from three new locations beginning in June 2010.The company announced plans to contract ...\n\n\nApr 8, 2007 Mudletta Daily Journal\n\n\n\nTXU Issues Apology On Plant Closing Issue\n\n\n\nDALLAS, April 6 /PRNewswire-FirstCall/ Today, TXU Corp. (NYSE: TXU) issued the following statements from TXU Corp. CEO John Wilder and Michael McCall, CEO of TXU Wholesale. McCall: 'TXU apologizes for creating any perception of threatening to shut down power plants in Texas. TXU is not permitted to unilaterally shut down power plants. Such a step can only be done after a review by ERCOT.\n\n\nApr 8, 2007 DiGiTAL50\n\n\n\nTXU Corp. Subsidiaries to Refinance Portion of Existing Short-Term Debt\n\n\n\nDALLAS, March 13 /PRNewswire-FirstCall/ -- TXU Corp. (NYSE: TXU) announced today that its subsidiaries TXU Energy Company LLC (the parent company of TXU Power, TXU Wholesale and TXU Energy) and TXU Electric Delivery Company plan to issue an aggregate $1.8 billion of senior unsecured floating rate notes maturing by September 2008. The notes are expected to include $1 billion principal amount of ...\n\n\nApr 9, 2007 The Energy Daily\n\n\n\nNEW - Deadline approaches for back energy payments\n\n\n\nThose who fell behind on their energy bills during the high-cost winter months have one more week to make arrangements before utility companies can pull the plug on their service. The Public Service Commission of Wisconsin issued a reminder last week on the upcoming deadline, and urged consumers with past-due bills to make payment arrangements with their utility providers.\n\n\nApr 9, 2007 Post Crescent\n\n\n\nSpectra to parcel assets as IPO in latest MLP\n\n\n\nA midstream energy player recently spun off from Duke Energy Corp. is gearing up to siphon part of its assets into a master limited partnership. Natural gas supplier Spectra Energy Corp. will break out a key chunk of its interstate natural gas pipeline and storage system into Spectra Energy Partners LP and will offer at least 11.5 million units in an initial public offering.\n\n\nApr 9, 2007 Biz Journals\n\n\n\nMirant exploring sale of company\n\n\n\n|  | Reprints [-] Text [+] NEW YORK (Reuters) - Power company Mirant Corp. (MIR.N: Quote, Profile, Research) said on Monday it was exploring strategic options, including a sale of the company, sending its shares up 6 percent. Mirant, which last year dropped its unsolicited bid to buy rival NRG Energy Inc. (NRG.N: Quote, Profile, Research), said it did not expect the options to include acquiring ...\n\n\nApr 9, 2007 Reuters\n\n\n\nBeware the Ides of March, Regulators unsheath their daggers\n\n\n\nby Tanya Bodell Despite more than Energy sales have traditionally been regulated by state public utility commissions and the Federal Energy Regulatory Commission. Although FERC has had long-standing power to audit company books and records at its discretion, in practice, investigations were initiated only upon receipt of a formal complaint. In the last few years, however, FERC has issued new ...\n\n\nApr 9, 2007 Utility Automation & Engineering T&D\n\n\n\nEnergy firm alters focus, eyes big boost in revenue: Rollcast ready to take advantage of demand for alternative-energy plants\n\n\n\nA shift in strategy for a local developer of independent power plants could open the door to a surge of revenue growth. Charlotte-based Rollcast Energy Inc. was founded in 2005 by a former Duke Energy Corp. executive to build and buy power plants. If you are already a Charlotte Business Journal subscriber please create or sign into your bizjournals.com account to link your valid print ...\n\n\nApr 9, 2007 Biz Journals\n\n\n\nNation's Chains Recognize Outstanding Electric Company Customer Service\n\n\n\nThe nation's multi-site businesses (hotels, restaurants, supermarkets, retail, convenience stores, health care facilities, and the federal government) today acknowledged the electric utilities that provided them with the best overall customer service last year in the 10th annual Edison Electric Institute (EEI) Customer Service Awards program. The awards were presented here during EEI Spring ...\n\n\nApr 9, 2007 The Energy Daily\n\n\n\nBrunswick prepares nuclear-fuel site\n\n\n\nSite preparation at the Brunswick Nuclear Plant near Southport has started for the outdoor storage of spent nuclear fuel.Actual storage of the spent fuel in garage-sized 'dry cask' bunkers made of steel and concrete will not begin until 2010.'We have begun some on-site work and we are on track. We have started to clear the area and we are starting to do some soil remediation studies to determine ...\n\n\nApr 9, 2007 Wilmington Star\n\n\n\n\n\nAssembly passes wind-power bill\n\n\n\nA bill to reduce environmental reviews required of wind turbine proposals in Maryland has breezed through the General Assembly, a move lauded by industry leaders pushing for renewable forms of energy in the state. The House of Delegates and Senate passed identical versions of the bill by overwhelming margins Friday. Gov. Martin O'Malley is reviewing the proposed legislation and is inclined to ...\n\n\nApr 8, 2007 Baltimore Sun\n\n\n\nMd. lawmakers approve wind power measure\n\n\n\nAssociated Press Writer ANNAPOLIS, Md. (AP) -- Maryland lawmakers agreed Friday on a measure that will make it easier to build large wind power projects, after the Senate voted 40-6 to agree to a similar bill passed in the House with amendments. The measure would allow developers to build wind farms that generate electricity for the wholesale market by eliminating environmental reviews looking at ...\n\n\nApr 8, 2007 Charleston Gazette\n\n\n\nEmissions Suit Gets First Test\n\n\n\nBURLINGTON, Vt. -- A week after the U.S. Supreme Court said vehicle carbon dioxide emissions can be regulated like other pollutants, an effort by several states, including Connecticit, to do that is about to get its first court test. California long has been the pacesetter in regulating car emissions, setting tougher limits than those imposed by the federal government.\n\n\nApr 9, 2007 Hartford Courant\n\n\n\nZeroing Out Carbon Emission in Woodstock\n\n\n\nMichael Esposito rides his bike all the time  from cold nights when leaving his old job at a natural food store to warm days while passing shops selling yoga clothes and soy drinks. So the 67-year-old is excited about a new plan to reduce this countercultural haven's net carbon dioxide emissions to zero within a decade, an ambitious attempt to erase the town's 'carbon footprint.' The goal might ...\n\n\nApr 9, 2007 San Francisco Chronicle\n\n\n\nVt. bid to curb emissions heads to court\n\n\n\nExhaust pipes are seen on a new Ford pickup in Montpelier, Vt., Thursday, April 5, 2007. A week after the U.S. Supreme Court said vehicle carbon dioxide emissions can be regulated like other pollutants, an effort by several states to do that is about to get its first court test. Trial is set to begin Tuesday in U.S. District Court for Vermont in a suit by auto makers trying to block California, ...\n\n\nApr 9, 2007 Augusta Chronicle\n\n\n\nAre ethanol plants a good idea?\n\n\n\nIs the proposed proliferation of ethanol plants good for Indiana and the nation? It's good for the farmers, the construction workers who build the plants and the people eventually employed by the plants, even though the facilities are not major employers. Three bio-fuel plants have been proposed for Posey County, as well as plants in Spencer and Pike counties. But there is a down side.\n\n\nApr 9, 2007 Evansville Courier\n\n\n\nChron 200 - Selling people on solar cells - Greener pastures, finally: SunPower had a great idea and strategy, but cash was running short until it received a $750,000 personal check from someone who saw the light\n\n\n\nIf Silicon Valley had a favorite color these days, it would be green to represent money and the best new way to make it, by creating clean energy to stave off global warming. As its name implies, the San Jose company makes cells that turn sunlight into electricity. SunPower, which is majority-owned by Cypress Semiconductor Corp., went public in November 2005 in time to capitalize on the greening ...\n\n\nApr 9, 2007 San Francisco Chronicle\n\n\n\nVirginia's electric power play\n\n\n\nVirginia's recently enacted electricity legislation drew widespread criticism because it increases electric rates, gives utilities some pretty hefty profit opportunities and flew through the legislature with no hearings. On top of all that, the law would end Virginia's experiment with retail electricity competition for all but the very largest customers. Electricity markets have changed in ...\n\n\nApr 9, 2007 Washington Times\n\n\n\n\n\nDCED Official Says Energy Independence Strategy Means Good Things for PA Businesses, Consumers\n\n\n\nStrategy Would Cut Costs, Create Jobs, Strengthen State's Clean Energy Production Industry     LANCASTER, Pa., April 9 /PRNewswire-USNewswire/ -- Governor Edward G. Rendell's Energy Independence Strategy will save consumers $10 billion over the next 10 years, promote Pennsylvania's energy independence, and create 13,000 new jobs by rapidly expanding the commonwealth's  ...\n\n\nApr 9, 2007 PR Newswire\n\n\n\nHelioPower Solar Selects Artichoke Creative as Agency of Record\n\n\n\nHelioPower, a leading provider of solar power solutions, has selected Artichoke Creative, an Encinitas, California-based integrated advertising agency to handle all of its marketing and promotion work. Artichoke will be providing HelioPower a variety of marketing services ranging from digital technologies such as email marketing, banner and web design along with traditional mediums including ...\n\n\nApr 9, 2007 PR Newswire\n\n\n\nThe Pennsylvania NanoMaterials Commercialization Center Funds Plextronics' Plexcore PV Development for Organic Solar Cells\n\n\n\nPlextronics, a world leader in developing and delivering active layer technology for electronic devices, announced it has been awarded a $340,500 grant from the Pennsylvania NanoMaterials Commercialization Center (the Center). This initiative will focus on the continued development of Plexcore(TM) PV active layer technology for organic solar cells. Plexcore PV is a new generation of polymer-based ...\n\n\nApr 9, 2007 PR Newswire\n\n\n\n\n\nInvestors seek to revive Enron class-action\n\n\n\nasked the U.S. Supreme Court for help in their effort to recoup billions they lost in the once-mighty energy company's collapse.Shareholders and investors filed a motion asking the court to review an appeals court's ruling that halted their class-action lawsuit against investment banks and firms.There is no timetable for the Supreme Court to decide whether to consider the motion.The $40 billion ...\n\n\nApr 9, 2007 MSNBC\n\n\n\nWoodstock, New York, takes on global warming\n\n\n\nWoodstock, New York, has plan to erase the town's 'carbon footprint' by 2017 Residents can keep cars if they produce enough clean power to offset emissions Woodstock is best known for the 1969 rock concert that borrowed its name WOODSTOCK, New York (AP) -- Michael Esposito rides his bike all the time -- from cold nights when leaving his old job at a natural food store to warm days while passing ...\n\n\nApr 9, 2007 CNN\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nLNG too perilous for offshore site\n\n\n\nTHE Southern California coast is one of our greatest gifts from Mother Nature. From surfing and boating to just hanging out at the beach, the coast provides recreation and respite for families, and draws visitors from every part of the world, fueling the region's economy. Now our irreplaceable Southern California coast may be at risk. The world's largest mining company, BHP Billiton, has proposed ...\n\n\nApr 9, 2007 Los Angeles Daily News\n\n\n\nTehran ripening its long alliance with Damascus\n\n\n\nHugh Macleod, Chronicle Foreign Service del.icio.us Digg Technorati Reddit Slashdot Fark Newsvine Google Bookmarks Georgia (default) Verdana Times New Roman Arial (04-09) 04:00 PDT Raqqa, Syria -- The high-profile visit to Damascus last week by House Speaker Nancy Pelosi at the head of a delegation of lawmakers enraged the Bush administration, which considers the government of Syrian President ...\n\n\nApr 9, 2007 San Francisco Chronicle\n\n\n\nLatest report urges world to adapt\n\n\n\nLatest global warming report urges world to begin adapting The poor may be hit the hardest by climate changes, IPCC report says; calls for stronger action By | Staff writer of The Christian Science Monitor Global warming is having a measurable effect on Earth's climate, including agriculture, freshwater resources, and plants and animals on both sea and land.\n\n\nApr 9, 2007 Christian Science Monitor\n\n\n\nBHP Billiton Responds to Local Newspapers' Fact Errors on Cabrillo Port\n\n\n\nRecent newspaper articles and editorials in Southern California newspapers are both premature and factually inaccurate, according to Patrick Cassidy, BHP Billiton's Director of Public Affairs. The California State Lands Commission will meet today in Oxnard to consider certification of the Final EIR on Cabrillo Port, a floating natural gas facility planned 14 miles off the Ventura County coast. ...\n\n\nApr 9, 2007 PR Newswire\n\n\n\nLatest global warming report urges world to begin adapting\n\n\n\nLatest global warming report urges world to begin adapting The poor may be hit the hardest by climate changes, IPCC report says; calls for stronger action By Peter N. Spotts | Staff writer of The Christian Science Monitor Global warming is having a measurable effect on Earth's climate, including agriculture, freshwater resources, and plants and animals on both sea and land.\n\n\nApr 8, 2007 Christian Science Monitor\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}