{"category": "spam", "to_address": "", "from_address": "through4892@neurotic-underground.de", "subject": "Neue Nachricht von sort - www.neurotic-underground.de", "body": "ENVIROMENTAL TANKS ARE LOADED! WILL THEY BLAST OFF TO FARMERS NATIONWIDE?\n\nOrganization Name: Petro Sun\nTicket To Success!: SLAP .:PSUD:. ON YOUR RADAR MONDAY\nCurrent?: $0.42 +0.02% 5.0%\nWhen Trading?: May 21 MON-DAY, 2007\n\n2007-05-11 11:44  News Release  PetroSun Issues Corporate Updates  \n2007-05-11 11:00  News Release  PetroSun Issues Biofuels License Agreement \nto ETC Energy  \n2007-05-11 06:00  News Release  PetroSun BioFuels Announces Transaction \nWith Icon Drilling \n\nPSUD On Radar Screen! GO GO GO PSU D!\n\nGET IN BEFORE THIS HOTCAKE BECOMES THE NEW FEEDSTOCK SOLUTION!\n\nBiodiesel produced from algae offers an alternative that is not subject to \ncommodity risks as is crude oil, corn and soybeans and is capable of \nsupplying a sustainable feedstock. \n\n.:Safe Harbor Confidentiality Statement:.\n\nAll information inside this email pertaining to any sort of financial \nadvice need to be \n\nunderstood as just information and not any real advice. Any of the above \nstatements with \n\nrespect to the future predications or goals and events may be seen as only \nFoward Looking \n\nwithin the meaning of Section 27A of the Securities Act of 1933 and Section \n21B of the \n\nSecurities Exchange Act of 1934 and nothing else. Absolutely none of the \ninformation \n\nabove can be constructed as any sort of financial advice. We urge you to \nread the \n\ncompany\\'s SEC filings now, before you invest. The publisher of this \nnewsletter is not a \n\nregistered invstment advisor. All factual information in this report was \ngathered from \n\npublic sources, including but not limited to SEC filings, Company websites \nand Company \n\nPress Releases. The publisher of this newsletter believes this information \nto be reliable \n\nbut can make no guarantee as to its accuracy or completeness. Use of the \nmaterial within \n\nthis email constitutes your acceptance of these terms.\n\n\n\n\n\n\n\n\n\n\n.\n\n\nsort schrieb am 21.05.2007 um 10:04:32 Uhr:\n\nsort\n\n"}