{"category": "spam", "to_address": "<gnitpick@speedy.uwaterloo.ca>", "from_address": "\"PC Error Detection\" <PCErrorDetection@candoconsutling.info>", "subject": "Detect and eliminate errors that are slowing down your PC", "body": "\n\n\n\n\n\n\n\n\n\n\nHow many error files are slowing you down?\n\n\n \nFind and eliminate harmful PC errors.\nRestore your PC to its maximum performance.\nStabilize your Windows operating system.\nFast and easy to use for beginners and experts.\nRuns on all new and older Windows machines.\n\n\n\n\n\nEvery month since you first took your PC out of the box, \nit's gotten slower and slower. For most people, that's because your Windows registry \nhas become filled with obsolete and redundant information. This prevents your \nmachine from being as fast as it could be. Whether you're a beginner or expert \nuser, run PC SpeedScan Pro today to detect hundreds of useless \nfiles and errors that may be slowing down your PC.\n\nOnce you use PC SpeedScan Pro to fix your computer, you'll be amazed at how much faster and more stable it makes it.\n You'll get that \"brand new PC\" feeling all over again!\n\nFind out how many errors are slowing down your PC -\n (FREE Scan)\nReal life success story from an Ascentive customer.\n\"Thank you so much for making these products. I thought my desk top was crashing. It would start, then shut it self off. Then it would not reboot again. I thought I was going to have to buy a new computer, or have to hire someone to come and look at it, or take it somewhere to be looked at. With a simple click and down load, and then scan to see what was wrong with the computer. IT is RUNNING like BRAND NEW. And this computer gets a lot of heavy use, and I have had it since 2001, so to have it running better then ever is so wonderful. This is a GREAT value.. and easy to use. I am going to tell all my friends and family about Ascentive software.\"\nKathy E Pierce of NH\nWhether your PC is misbehaving or just needs a regular tune-up, PC SpeedScan will boost your system's performance in just a few minutes.\n\nDon't wait any longer to TRY this ground breaking new software for F R E E\n\n\n\n\n\n\n\n\n\n End e-mails \nfrom Internet Alert Service by going\nhere.\n\nOr send mail to:\nInternet Alert Service \n201 Spring Garden St, Suite 400 \nPhiladelphia, PA 19123 \n\n\n\n\n\n\n\nUse this link to be automatically removed from any future offers\n\n\nIf you do not wish to receive any more offers from via e-mail, please write us with your removal request.  Customer Service 560- A F ST #438 Grants Pass, OR 97528.Please note: It may take up to 3 days for your name to be removed from our list. \n\n\n\n\n\n\n"}