{"category": "spam", "to_address": "nnpc_nigeria_org@ig.com.br", "from_address": "nnpc_nigeria_org <nnpc_nigeria_org@ig.com.br>", "subject": "GOOD DAY,", "body": "\nPhone: (24 hours): +234-8055479170Email: \nosite111@yahoo.co.ukI am the chairman of the contract award \ncommittee of the oil ministry here in Nigeria, for security reasons, I may \nnot wish to disclose how I got your email address for now. After due \ndeliberation with my partner, I decided to forward to you this business \nproposal, we want you to assist us receive the sum of Twenty eight million, \nsix hundred thousand united state bills(us28.6m) into your account. This \nfund resulted from an over-invoiced contract awarded by us under the budget \nallocation to my ministry and the bill was approved for payment by the \nconcerned ministries. The contract was executed, commissioned and the \ncontractor was paid his actual cost of the contract. Now, we are left with \nthe balance of us28.6m as the over invoiced amount, which we have \ndeliberately over estimated for our own use. Please note that the law \nforbids civil servants to perate or own foreign accounts hence this contact, \nwe have agreed to share the money in the following ercentages: 30 for you, \n60 for us 10 for tax as may be required by your government. Note \nthat this transaction is very much free from all sorts of risk hence the \nbusiness was carefully planned before it was successfully executed and we \nthe officials involved in the deal have put many years in service to our \nministry. We have been exercising patience for this privilege for so long \nnot until the presidential nnouncement last week, that all foreign \ncontractors owed be paid forthwith, this will enable the presidency \nreconcile our debt ratio with the outside world and to most of us, this \nis a lifetime blessing we cannot afford to miss. Upon indication of your \ninterest to fully co-operate with us, a payment application/information form \nwill be sent to you via email for completion. Note that the \nfollowing information: a) bankers name and address, b) account number and \naccount name and c) your private phone number and email address will \nenable us seek/secure approval of the fund from the concerned government \nquarters/ministries within 3-4 banking days. As soon as we confirm \nreceipt of this money in your nominated bank account, my partner and I will \ncome over to your country to arrange for our own share and possibly \ninvest part of this money in your country. Let honesty and trust be \nour watchword throughout this transaction. I shall furnish you with some \ndetails about myself. Your prompt reply will be highly appreciated. \nBest regards. Engr.St.michael Adams\n\n"}