{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@flax9.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "SatCon to present Invited Paper at 2007 IEEE Power Engineering Society General Meeting", "body": "\n\n\n\n\n\n\n\n\nSatCon to present Invited Paper at 2007 IEEE Power Engineering Society General Meeting\n\nBOSTON, Jun 25, 2007 (BUSINESS WIRE) --  SatCon Technology Corporation(R) (Nasdaq CM: SATC), a developer and supplier of power management and system architecture solutions for the alternative energy and distributed power markets, today announced that it will be presenting at the 2007 IEEE Power Engineering Society General Meeting in Tampa, Florida, this week. The theme of this year's Annual General Meeting is \"Powering the Future, Today\". SatCon's presentation and paper is titled \"Advanced Semiconductor Impact on Distributed Generation, Energy Storage and the Utility Grid\". \"In this era of energy resource depletion, energy supply fragility, and increasing concern over the environmental consequences of our fossil fuel based economy, the IEEE Annual Meeting is focused on these critical concerns,\" said Dr. Leo Casey, Chief Technology Officer of SatCon Technology Corporation. \"Our paper at the Annual meeting addresses the great advantages in efficiency and reliability that are derived from distributed, and in particular, renewable-distributed generation. Building on our experience as a leading provider of Utility Scale Photovoltaic and Fuel Cell Inverters, we also present the value enhancement that is derived from the addition of sufficient storage to the intermittent renewable resource. The ability of advanced semiconductors, such as Silicon-Carbide, to impact this value proposition by enabling robust MicroGrids is the unifying conclusion of this presentation.\" About SatCon Technology Corporation SatCon Technology Corporation is a developer and manufacturer of electronics and generators/motors for the Renewable Energy, Hybrid-Electric Vehicle, Grid Support, High Reliability Electronics and Advanced Power Technology markets. For further information, please visit the SatCon website at www.satcon.com. (SATC-G) Statements made in this document that are not historical facts or which apply prospectively are forward-looking statements that involve risks and uncertainties. These forward-looking statements are identified by the use of terms and phrases such as \"will,\" \"intends,\" \"believes,\" \"expects,\" \"plans,\" \"anticipates\" and similar expressions. Investors should not rely on forward looking statements because they are subject to a variety of risks and uncertainties and other factors that could cause actual results to differ materially from the Company's expectation. Additional information concerning risk factors is contained from time to time in the Company's SEC filings. The Company expressly disclaims any obligation to update the information contained in this release. SOURCE: SatCon Technology Corporation SatCon Technology Corporation(R)\nDan Gladkowski, 617-897-2411\nVP, Administration\n\n\n\n\n\n\n\n\n\n\n You are subscribed to SatCon Technology Corporation Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n SatCon Technology Corporation \n 27 Drydock Ave. 6th Floor, South Boston, MA 02127\n Service provided by Shareholder.com \n\n\n\n\n\n"}