{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBS News Early Show <cbsnews___early_show_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Hannah Storm: The Imus Story Keeps Getting Bigger", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nApril 11, \n      2007\n \nHi, \n      everybody,\n \nWe've \n      made it halfway through the week and there was so much to talk about this \n      morning. It seems like the Don Imus story gets bigger by the day. \n      \n \nAs most of you \n      know, after Rutgers\nUniversity lost the NCAA \n      women's basketball championship game to Tennessee, the radio talk \n      show host the next day used racist and sexist language to describe the \n      team. We spoke with Rutgers \n      head coach C. Vivian Stringer and team captain Essence Carson \n      about how hurtful those remarks have been at a time that should have been \n      a celebration of their athletic ability. The team is emotionally exhausted \n      and disheartened.\n \nCoach Stringer is \n      one of the legendary coaches in women's basketball, whom I first met \n      over 20 years ago. She is a model of strength, having endured, among other \n      things, her baby daughter suffering from meningitis and the death of her \n      husband. Coach Stringer has always been a champion of doing what's right, \n      by being the first black cheerleader at her high school, and her players \n      are taking the high road by meeting with Imus to hear what he has to say. \n      Remarkably, so far, no one at Rutgers has called for his \n      firing. \n \nMeanwhile, we asked CBS News correspondents Jeff Greenfield and Bob Schieffer whether or not they would \n      continue to be on Imus' program, and they both said, \"yes.\" However, \n      several sponsors have suspended ads on the program and high-profile \n      guests, like Cal Ripken Jr., have cancelled appearances on the show. \n      \n \nSports \n      was in the news again today, as an announcement was scheduled about the \n      sexual assault charges against former Duke Lacrosse \n      players. Katie Couric will anchor the CBS Evening News from \n      Raleigh, \n      N.C., tonight, and \n      Harry will anchor The Early Show from \n      Raleigh tomorrow morning, \n      providing comprehensive coverage of the breaking developments in the \n      Duke\nUniversity rape case. You can \n      also check CBSNews.com \n      for the latest.\n \nAlso tomorrow, we \n      will bring you the highlights from Dave's All-Access Adventures, and \n      our friend Tori Ritchie will show us how to make crepes.\n \nTake \n      care,\n\nHannah \n      StormEarlyShow@cbs.com \n\n\n\n\nAdvertisement\n\n\n\nTo \nunsubscribe or change your subscription options, click here.Contact: \nEmail Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All \nRights Reserved. \n"}