{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Lifestyle Newsletter June 28, 2007", "body": "June 28, 2007 \nRSS | lifestyle\nThis Week's Highlights: \nHow the Mafia WorksHow Fireworks Work\nHow Guide Dogs WorkHow Gas Prices Work\nHow Social Security Numbers Work \nGrilling out this 4th of July? - Whether you have a gas grill or a charcoal grill, we'll help you master the best techniques, paired with delicious grilling \nrecipes for everyone -- the cooking-impaired who need easy recipes; dieters \nlooking for low-carb recipes; and backyard BBQ chefs celebrating the 4th of \nJuly.    This week's trivia question:In Mafia parlance, what is a â\\u20ac\\u0153consigliereâ\\u20ac\u009d? \nFind out here   \n \nHow the Mafia Works \n- From â\\u20ac\\u0153The Godfatherâ\\u20ac\u009d to â\\u20ac\\u0153The Sopranosâ\\u20ac\u009d to numerous novels, video games and television shows, America has a particular fascination with the Mafia and organized crime. But what exactly is the Mafia, and what role does it play in the criminal world? In this article, learn what the Mafia is, how these criminal organizations are structured and about the Mafiaâ\\u20ac™s activities in America and abroad.    \n  This week's video:How Fireworks Work\n - Fireworks have a special and beautiful magic all their own, though they can also be quite dangerous. With the 4th of July approaching, we thought itâ\\u20ac™d be a good time to learn how fireworks work. Learn about fireworks in this video from HowStuffWorks. \n     Also at HowStuffWorks:\n \nHow Guide Dogs Work - Guide dogs provide an invaluable service to humans. Every day, they help their masters get from place to place more safely. Discover how guide dogs are trained and what the life of a guide dog is all about. \n \nHow Gas Prices Work - Gasoline is the bloodline that keeps America moving, but tracking gas prices can feel like a roller coaster ride. In this article, learn about the forces that impact the price of gas at the pump, and find out where your gas money actually goes. \n \nHow Social Security Numbers Work - In the United States, the nine digits that make up your Social Security number (SSN) may be the most important numbers in your life. We use our SSNs daily, although many times we don't even know it. In this article, find out how Social Security numbers are assigned and how the social security program got started. \n \n   Coming Soon:\nHow Men WorkHow the Amish Work   \n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA \nYou received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please unsubscribe here or change your preferences using our \nprofile manager.To view this email as a web page, click here.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. Â© 2007, HowStuffWorks, Inc. All Rights Reserved\n"}