{"category": "ham", "to_address": "ted.harding@manchester.ac.uk", "from_address": "Gad Abraham <g.abraham@ms.unimelb.edu.au>", "subject": "Re: [R] Allocating shelf space", "body": "\n> A: Make the efficient use of space\n> B: Minimise the spatial disclocation of related books\n>    (it is acceptable to separate large books from small books\n>    on the same subject, for the sake of efficient packing).\n\nSome comments, hope they make sense:\n\nLet f(x) be a function that maps from a specific book arrangement to a \ncertain amount of space wastage.\n\nYou're also trying to minimise some function g() of the books' location. \nYou can't minimise two functions at once, unless you minimise some \nfunction of both: h(f(x), g(x)). It up to you to determine what h() is.\n\nFor example, you could use a linear function, deciding that saving space \nis 10 times more important than keeping books close together. Then your \nobjective function could be:\nminimise:   h = f(x) + g(x)\nsubject to: f(x) = 10g(x)\n             f(x) >= 0, g(x) >= 0\n\t    (plus some nontrivial constraints on x)\n\n(You should also set a lower bound on the solution values, otherwise f \nwill always be minimised at the expense of g, since f is \"worth\" more).\n\nAlthough I've stated the problem in terms of Linear Programming, it's \nreally cheating. The much bigger issue is the combinatorial optimisation \nproblem underneath --- different arrangements of x result in different \nvalues of h. This is much harder than LP, for anything but a small \nnumber of objects to arrange. I'd be tempted to set up a toy version, \nwith small number of possible x values and simple constraints, and run \nsome heuristic-driven optimisation method such as simulated annealing, \nAnt Colony Optimisation, Genetic Algorithms, etc.\n\nCheers,\nGad\n\n-- \nGad Abraham\nDepartment of Mathematics and Statistics\nThe University of Melbourne\nParkville 3010, Victoria, Australia\nemail: g.abraham@ms.unimelb.edu.au\nweb: http://www.ms.unimelb.edu.au/~gabraham\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}