{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "\"CNN Political Ticker\" <politicalticker@cnn.com>", "subject": "CNN Political Ticker AM, Tuesday, April 17, 2007", "body": "For the latest, breaking political news, check for updates throughout the day on the CNN Political Ticker\nhttp://www.cnn.com/ticker. All politics, all the time.\n\nCompiled by Stephen Bach (stephen.bach@cnn.com)\nCNN Washington Bureau\n\nMaking news today...\n\n* Monday's incident at Virginia Tech \"sparked a largely one-sided response in the long-running debate over guns. Gun\ncontrol advocates said the shootings pointed to the need for tougher laws, while supporters of gun rights generally\nkept their heads down.\" (Los Angeles Times)\n\n\"Democrats have grown very reluctant to talk about gun control. It has become a radioactive issue.\" (The Politico)\n\n* \"The chilling effect of the Virginia Tech shootings reverberated yesterday from the late-night comics to presidential\nhopefuls... Clearly wary of offending voters, several presidential candidates hurriedly canceled plans to campaign\ntoday out of respect for the Virginia Tech shooting victims.\" (New York Daily News)\n\n* Turning to New Jersey where Gov. Jon Corzine remains hospitalized following an automobile accident, \"Cooper\nUniversity Hospital doctors said the governor was recovering better than they had expected and that they hoped to begin\nweaning him off medication that has left him barely conscious since Thursday.\" (Newark Star-Ledger)\n\n* More interesting nuggets from the official Q1 FEC filings:\n\nMitt Romney, \"by far the richest candidate, was stingiest with his staff members' salaries, often having them fly\ndiscount airlines and stay in accommodations as humble as a Super 8 Motel in Parsippany, N.J.\" (New York Times)\n\nJohn Edwards \"insists on first-class pampering - enjoying $400 haircuts on the road and plunking down nearly $500 for\nswank spa treatments.\" (New York Post)\n\nAnd Hugh Hefner's $2300 donation to one candidate landed him on the front page of The Hill today.  Find out who gets\nthe Playboy vote in Hot Topics below.\n\nPresident's Schedule:\n\n* President Bush participates in a 9:25 am ET meeting with tax families in the Roosevelt Room.\n\nLater, the president and First Lady Laura Bush will attend the 2 pm ET Convocation meeting at Virginia Tech's Cassell\nColiseum.  President Bush will speak at the event.\n\nAlso on the Political Radar:\n\n* Many candidates have cancelled events due to the tragedy at Virginia Tech.  Check The Ticker throughout the day for\nupdates on candidate schedules.\n\n* Sen. Barack Obama (D-IL) gives a foreign policy address at the Fairmont Chicago hotel at 12 pm ET.\n\n* The Senate Radio-Television Correspondents' Gallery Daybook: http://www.senate.gov/galleries/radiotv/list.htm\n\n* The House Radio-Television Correspondents' Gallery Daybook: http://radiotv.house.gov/news-events.aspx\n\n=================================================================\nPolitical Hot Topics\n(Today's top political stories from news organizations across the country)\n\n\"THE IMPACT IS FELT IN EVERY CLASSROOM\": President Bush said Monday that the mass shooting at Virginia Tech, the\ndeadliest campus shooting ever in this country, affects every student across the nation. \"Schools should be places of\nsafety, sanctuary and learning,\" Bush said in reaction to the deaths of more than 30 people on the campus. \"When that\nsanctuary is violated, the impact is felt in every American classroom in every American community.\" Bush spoke with\nGov. Timothy M. Kaine and Virginia Tech President Charles Steger. \"I told them that Laura and I and many across our\nnation are praying for the victims and all the members of university community that have been devastated by this\nterrible tragedy,\" Bush said in the Diplomatic Room of the White House. AP via Yahoo! News: Bush says shootings affect\nall students http://news.yahoo.com/s/ap/20070417/ap_on_go_pr_wh/bush_virginia_tech\n\nINCIDENT REVIVES GUN CONTROL DEBATE: Monday's deadly rampage at Virginia Tech sparked a largely one-sided response in\nthe long-running debate over guns. Gun control advocates said the shootings pointed to the need for tougher laws, while\nsupporters of gun rights generally kept their heads down. And leaders of both major political parties expressed\nsympathy for victims and their families, while avoiding comment on gun control. In brief remarks from the White House,\nPresident Bush expressed the nation's grief over the carnage in Blacksburg, Va... Bush, a longtime champion of the\nright to bear arms, said nothing about the gun control debate. Similarly, Senate Majority Leader Harry Reid of Nevada\nand House Speaker Nancy Pelosi of San Francisco expressed sorrow about the shootings but remained silent on gun\ncontrol. Los Angeles Times: Gun control debate resumes, on one side\nhttp://www.latimes.com/news/politics/la-na-gunlaw17apr17,1,2333005.story\n\nA \"RADIOACTIVE\" ISSUE FOR DEMS: Democrats have grown very reluctant to talk about gun control. It has become a\nradioactive issue. And a Republican who once was an ardent supporter of it, Rudy Giuliani, now says he supports the\nright of individuals to bear arms and that the states not the federal government should decide how to control guns.\nAfter Gore's defeat, Terry McAuliffe, then chairman of the Democratic Party, was vocal in advising Democrats to abandon\ngun control as an issue in future elections. \"I believe we ought to move it out, let the individual communities decide\ntheir gun laws and how guns ought to be treated,\" he said. \"It has had a devastating impact on elections because the\nNRA has targeted and spent millions of dollars distorting individual members' views and Al Gore's views.\" The Politico:\nShootings Echo Across Decades Without Gun Control Solutions http://www.politico.com/news/stories/0407/3533.html\n\n\"CHILLING EFFECT\" ON CAMPAIGNS: The chilling effect of the Virginia Tech shootings reverberated yesterday from the\nlate-night comics to presidential hopefuls. Jay Leno led into his \"Tonight\" show monologue with what sounded almost\nlike an apology for doing jokes after the worst shooting massacre in U.S. history. \"Our job has always been to kind of\nend your day, get a few laughs, so that is what we will try to do,\" Leno said. \"I just want to be respectful. We will\ndo some jokes, we will be silly. But we just want - we don't want to forget what happened today.\" Clearly wary of\noffending voters, several presidential candidates hurriedly canceled plans to campaign today out of respect for the\nVirginia Tech shooting victims. New York Daily News: Campaigns - and comics - feel chill\nhttp://www.nydailynews.com/news/crime_file/2007/04/17/2007-04-17_campaigns__and_comics__feel_chill.html\n\nHOUSE, SENATE NEGOTIATORS HAMMER OUT DETAILS ON SPENDING BILL: Congress and the White House will move this week toward\na final showdown over a contested war funding bill, with most Americans trusting Democrats over President Bush to set\nIraq policy but with sentiment deeply divided over Congress's push to set a deadline for withdrawing U.S. forces.\nDemocratic leaders will formally convene House and Senate negotiators tomorrow to hammer out a final version of the\nbill, hoping to have the compromise on Bush's desk by the end of next week. The president and Democratic leaders again\nexchanged verbal fire yesterday. Bush used a backdrop of military families to declare: \"We should not legislate defeat\nin this vital war.\" Senate Majority Leader Harry M. Reid (D-Nev.), flanked by retired Army generals, fired back: \"The\npresident and the vice president continue to desperately cling to their failed escalation strategy and attack those who\ndisagree with them.\" Washington Post: Final War Funding Bill in Works\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/04/16/AR2007041601099.html\n\nSENATORS TO HOLD HEARING ON EAVESDROPPING BILL: FBI agents and other federal investigators would have greater leeway to\neavesdrop on foreigners in the USA suspected of having information on terrorism or national security threats, under a\nBush administration proposal. The bill has the backing of the Justice Department and Director of National Intelligence\nMike McConnell. It would allow the telephone calls, e-mails and other activities of persons who are not U.S. citizens\nor legal residents to be secretly monitored if they are thought to \"possess significant foreign intelligence\ninformation.\" Individuals and groups who deal in \"weapons of mass destruction\" would also become surveillance targets,\nunder the proposed law. The Foreign Intelligence Surveillance Act requires that a surveillance target be an agent of a\nforeign power or connected to a terrorist group before a secret FISA court authorizes monitoring. The proposed law, a\ncopy of which was furnished to USA TODAY by McConnell's office, would amend that requirement. USA Today: Surveillance\nbill gets Hill hearing http://www.usatoday.com/news/washington/2007-04-16-FISA_N.htm\n\nDOCS SAY NJ GOV \"RECOVERING BETTER THAN THEY HAD EXPECTED\": Surgeons operated on Gov. Jon Corzine yesterday for the\nthird time since he was critically injured in a Parkway crash, and said he might soon eat, talk and breathe on his own.\nIn their most detailed explanation yet of Corzine's condition, Cooper University Hospital doctors said the governor was\nrecovering better than they had expected and that they hoped to begin weaning him off medication that has left him\nbarely conscious since Thursday. But they cautioned that the extensive injuries to his leg, chest and back made any\npredictions dicey. \"I don't say patients are out of the woods until they leave the hospital,\" said Steven Ross, head of\nthe hospital's trauma unit. \"He's certainly not out of the woods yet.\" Newark Star-Ledger: MDs say Corzine healing\nbetter than they expected http://www.nj.com/news/ledger/index.ssf?/base/news-11/1176786570251210.xml&coll=1\n\nDEMS HAVE NEARLY TWICE AS MANY DONORS: From Congress to the presidential campaign, Republican fundraising is lagging\nwhile Democratic donations are surging. Yet beneath the record-breaking million-dollar totals lies another statistic\nthat could be more ominous in 2008 for Republicans: a yawning gap between the presidential primary fields' donor bases.\nAccording to campaign figures, the Democrats' top three candidates received donations from about 204,000 individuals.\nThe first-tier Republican trio drew checks from 110,000, roughly half as many. That donor disparity helped give the\nDemocrats a big first-quarter financial advantage. The Democrats' top three candidates reported having $61 million in\ncash at the end of the quarter, compared with $29 million posted by the top Republicans. Of the nine presidential\nhopefuls who raised more than $1 million, six are Democrats, compared with three Republicans. The Politico: GOP Funk:\nTop Dems Have Twice As Many Donors http://www.politico.com/news/stories/0407/3538.html\n\nQ1 NUMBERS CONTRADICT PREVIOUS ASSUMPTIONS: The first-quarter fundraising reports from the 2008 presidential campaign\ncrystallized two realities of this intensely fought election: The battle for each party's nomination is more open than\nit was just three months ago, and each contest pits three relatively well-funded candidates against one another, with\nthe rest of the field at a disadvantage. Two common assumptions proved false: that Sen. Hillary Rodham Clinton (N.Y.),\nwith the most extensive money network in Democratic politics, would blow away her rivals in first-quarter fundraising,\nand that Sen. John McCain (Ariz.), who had spent the previous two years preparing for this campaign, would easily best\nhis Republican rivals. Instead, Sen. Barack Obama (D-Ill.) stunned political observers by raising more money for the\nprimudles than Clinton, and McCain's anemic fundraising and rapid spending left the onetime front-runner on the\ndefensive. Washington Post: Fundraising Totals Challenge Early Campaign Assumptions\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/04/16/AR2007041601705.html\n\nWHO'S THE KING OF WALL STREET? Democratic presidential candidate Barack Obama ran ahead of New York Senator Hillary\nClinton and former New York Mayor Rudy Giuliani on their home turf, raising cash from the biggest investment banks on\nWall Street. Obama raised $479,209 from employees at the banks in the first quarter, according to Federal Election\nCommission filings. That was better than Giuliani, a Republican who collected $473,442. Clinton, Obama's Democratic\nrival, raised $447,625. The figures are based on employers listed by donors; in some cases, the names are missing or\nincomplete.  The employees of Goldman Sachs Group Inc. and UBS AG gave Obama more than a combined $260,000, boosting\nhis showing. The Illinois senator's top fundraisers include David Heller, a managing director at Goldman, and Robert\nWolf, chief executive officer of UBS Americas. Bloomberg: Obama Gets Edge on New Yorkers Clinton, Giuliani on Wall\nStreet http://www.bloomberg.com/apps/news?pid=washingtonstory&sid=aLeZ7ht_LtZg\n\nHOW THEY ARE SPENDING: [E]ach campaign doled out its contributions differently, often in unexpected ways that provide\nsome insights into the candidates. Mitt Romney, the Republican, who is by far the richest candidate, was stingiest with\nhis staff members' salaries, often having them fly discount airlines and stay in accommodations as humble as a Super 8\nMotel in Parsippany, N.J. Senator John McCain of Arizona, whose Republican primary campaign spent the highest\npercentage of income during the quarter, paid nearly $11,000 for photography, $1,700 for decorations and $1,671 for\nflowers. Senator Hillary Rodham Clinton of New York, who irked donors during her last Senate campaign by running up\nheavy bills for such amenities, spent just $205 for photographs and $89 for flowers, according to the campaign's\nfilings. But her campaign did report a debt of $1,995 to Jack H. Lucky Floral Design in New Market, Va. New York Times:\nFinance Filings Offer Glimpses of '08 Candidates http://www.nytimes.com/2007/04/17/us/politics/17donate.html\n\nEDWARDS GETS A $400 HAIRCUT: Democratic White House hopeful John Edwards insists on first-class pampering - enjoying\n$400 haircuts on the road and plunking down nearly $500 for swank spa treatments, according to campaign records.\nEdwards, who touts himself as the poor man's champion and even launched his bid from New Orleans' hurricane-devastated\nLower Ninth Ward, tucked the vanity treatments into his 5,236-page first-quarter Federal Election Commission filing\nunder \"consulting\" expenses. Records show he doled out $400 of his contributors' money to Beverly Hills mane maestros\nat Torrenueva Hair Designs in February and another $400 to Torrenueva in early March. New York Post: JOHN'S $400 TRIM\nhttp://www.nypost.com/seven/04172007/news/nationalnews/johns_400_trim_nationalnews_ian_bishop.htm\n\nHEF'S ON THE HIL BANDWAGON: Sen. Hillary Rodham Clinton (D-N.Y.) is seeking to become the first woman president, and a\nman who has published countless pictures of naked women is pitching in for her White House bid. Hugh Hefner, the\nfounder of the Playboy Enterprises empire, is among the many celebrities who have picked their favorite candidate to\nsucceed President Bush in 2009.  Hefner contributed $2,300 (the maximum allowed in the primary) to Clinton's campaign\non March 28, identifying his occupation on the fundraiser form as \"editor-in-chief\" of Playboy magazine. The Hill: Hugh\nHefner gives $2,300 to Clinton's '08 campaign\nhttp://thehill.com/under-the-dome/hugh-hefner-gives-2300-to-clintons-08-campaign-2007-04-16.html\n\nMcCAIN CALLS FOR \"GREATER FISCAL RESTRAINT\": Senator John McCain of Arizona acknowledged Monday that his fellow\nRepublicans \"forgot who we were\" in recent years by spending too much, and said that as president he would rely on low\ntaxes, greater fiscal restraint and free trade to lift the nation's economy. Mr. McCain, whose presidential campaign\nhas been viewed with suspicion by some conservatives because of his initial opposition to the Bush administration's tax\ncuts, used the first major economic address of his campaign to reaffirm his commitment to the free market but said he\nwould move to overhaul the nation's unemployment programs to help people find jobs in the new economy. And he had some\nstrong words for the way his fellow Republicans governed when they controlled Congress. New York Times: McCain Says\nFellow Republicans Spent Too Much While Running Congress http://www.nytimes.com/2007/04/17/us/politics/17mccain.html\n\nOBAMAS EARNED $991K IN '06: The annual income for Illinois Sen. Barack Obama and his wife dropped about $680,000 in\n2006 from the nearly $1.7 million they took in the prior year, according to documents released Monday. Information\nreleased by the Chicago Democrat's presidential campaign indicated that the Obamas' total income decreased because in\n2005 they had a major book deal and a one-time bonus. Their 2006 income of $991,296 included Obama's salary of $157,082\nand his wife's administrator's pay of $273,618 from the University of Chicago Hospitals and $51,200 in director fees\nfrom a food distributor, TreeHouse Inc. AP via Yahoo! News: Obamas' 2006 income put at $991,296\nhttp://news.yahoo.com/s/ap/20070417/ap_on_el_pr/obama_tax_returns\n\nCLINTON NO LONGER \"VERY MUCH RIGHT\" ON \"VILLAGE,\" SAYS ROMNEY: Presidential hopeful Mitt Romney says that Sen. Hillary\nRodham Clinton is wrong when she contends that \"it takes a village\" to raise a child, though he told a newspaper in\n1998 that Clinton was \"very much right.\"... During a speech to New Hampshire Republicans last weekend in which he\ntouted the need for strong American families, the former Massachusetts governor said, \"I think it's time for us to\nrecognize every child deserves a mother and a father.\" Asked by The Associated Press after the speech if he disagreed\nwith Clinton's view, expressed in her 1996 book \"It Takes a Village,\" that raising children requires a community-wide\neffort, Romney said he disagreed and added, \"It takes a family.\" However, in 1998, Romney told The Boston Globe:\n\"Hillary Clinton is very much right, it does take a village, and we are a village and we need to work together in a\nnon-skeptical, no-finger-pointing way.\" AP via Yahoo! News: Romney changes view on 'village' comment\nhttp://news.yahoo.com/s/ap/20070417/ap_on_el_pr/on_the2008_trail\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings go to\nhttp://audience.cnn.com/services/cnn/memberservices/member_auth.jsp?url=http%3A%2F%2Faudience.cnn.com%2Fservices%2Fcnn%2Fmemberservices%2Fregwall%2Fmember_profile.jsp%3Fsource%3Dcnn\n\nTo unsubscribe from the CNN Political Ticker list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=morninggrind\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n(c)2007 Cable News Network.\nA Time Warner Company.\nAll Rights Reserved.\n\n"}