{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"ace\" <ace@talkingirc.net>", "subject": "Re: Slackware: kernel confusion", "body": "My advice would be to grab the latest 2.6.21 kernel from www.kernel.org, \npatch Speakup into it, configure it, compile, and install.  Don't try \nanything 2.6.22 yet as it is still broken.\n\nHere are the commands (or something close to what they would be) for doing \nthis:\nwget ftp://ftp.kernel.org/pub/linux/kernel/v2.6/linux-2.6.21.5.tar.bz2\n\nThis will grab the kernel for you.  Switch to root and cp the file to \n/usr/src.  Then\ntar xfv linux-2.6.21.5.tar.bz2\nto untar it.\n\nGet the checkout script from ftp.linux-speakup.org.  Place it in /usr/src \nand make it executable:\nchmod +x checkout\nmake a symlink to the kernel source:\nln -s linux-2.6.21.5 linux\nthen run checkout.  Hit enter then give it the password of\nplease\n\nAfter a very long time, the patch should succeed.  Switch to the kernel \ndirectory\ncd linux\nand read the README file.  Compiling the kernel can be done with the \nfollowing general command set:\n\nmake mrproper\nmake menuconfig  # Menu driven program for selecting everything to put in \nkernel\nmake\nmake modules_install\ncp -v arch/i386/boot/bzImage /boot/bzImage\ncp -v System.map /boot/System.map\n\nRemember to update lilo.conf and run the lilo command.\n\nGood luck\nRobby\n----- Original Message ----- \nFrom: \"Zachary Kline\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Monday, June 25, 2007 10:21 PM\nSubject: Slackware: kernel confusion\n\n\n> Hiya,\n>    I know this might be a rather elementary question for Linux people to \n> answer.  However, I've become aware through reading the LFS book that the \n> kernel headers are a rather important thing.  Slackware ships with \n> 2.4.33.3.  I'm pretty sure that the kernel headers are 2.4.33.3 as well.\n>    All that being said, I'd like to get Speakup support with a more recent \n> kernel.  I know I can probably download, compile, etc. something like \n> 2.6.20 or 2.6.21.  I know also that Slackware provides 2.6.17 in Extra. \n> My question is: does that 2.6.17 version already have Speakup included? \n> If not, should I download its source code from a Slackware package site \n> and patch it in myself?  And what about those pesky headers?\n> Sorry for the barrage of questions.  I'm confedent once I figure out what \n> exactly is happening I'll be good to go.\n> Thanks,\n> Zack.\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n> __________ NOD32 2353 (20070625) Information __________\n>\n> This message was checked by NOD32 antivirus system.\n> http://www.eset.com\n>\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}