{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "Direct2Drive <owner-d2d_cp_announce_list@news.ign.com>", "subject": "Download Infernal on Direct2Drive Today!", "body": "\n\n\nDirect2Drive\n\n\n\n\n\n\n\n\nMay 18th, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArmA: Armed Assault - Combat Operations - $39.95\nArmA is a first person tactical military shooter with large elements of realism and simulation. This game features a blend of large-scale military conflict spread over large areas alongside the more closed quarters battle...\n \nCompany of Heroes - $39.95\nExperience the cinematic intensity and the courage and bravery of the heroes that defined a generation, set against the backdrop of the most dynamic battlefield ever seen in a game... \n \nFreestyle Street Basketball - $19.95\nA fast-paced online basketball game where players meet on virtual courts to challenge each other in a dynamic pick-up game environment, featuring cutting-edge music, fashions and gravity defying basketball moves.\n\n\n \n \n \n \n \n\n\nGames Under $20\nCheck out a wide variety of big name games for under $20!\n \nRainbow Six Vegas - $39.95\nRainbow operatives take to the chaotic streets of Las Vegas as an escalating terrorist siege in \"Sin City\" threatens to take world terrorism to new, uncontrollable heights. \n \n24 Season 6 Latest Episode - $1.99\nAs the climactic conclusion to \"Day Six\" nears, the Administration copes with a compromising situation as Jack Bauer stops at nothing to get what he wants and to protect the country from an international incident that could change the world forever.\n\n\n \n \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\nArmA: Armed Assault\n$39.95\n6\n\n\nThe Matrix Online\n$19.99\n\n\n2\n\n\nCompany of Heroes\n$39.95\n7\n\n\nInfernal Uncensored\n$39.95\n\n\n3\n\n\nSTALKER: Shadow of Chernobyl\n$39.95\n8\n\n\nPlanetside: Aftershock\n$19.95\n\n\n4\n\n\nDeath Note Episode 1\n$1.99\n9\n\n\nSupreme Commander\n$39.95\n\n\n5\n\n\nFar Cry\n$9.95\n10\n\n\n24 Season 6 Latest Episode\n$1.99\n\n\n\n\n\n\n\n\n\nTo Unsubscribe: Click Here.\n\t\t\t\nYou have received this e-mail because you are a registered user of GameSpy and have opted-in to receive GameSpy email updates concerning new products and services. If you believe you're receiving this e-mail in error or prefer not to receive promotions from GameSpy.com, reply to this message to opt out of future promotional mailings. Our privacy policy is viewable at http://corp.igngamespy.com/privacy.html. You may still receive other e-mails from GameSpy. To update your e-mail address or manage your account, visit GameSpyID.com. It may take up to 10 days for adjustments to your email preferences. If you have questions about this offer or your services, you can reach Customer Service here.\n\t\t\n\t\tYou may mail inquiries to: IGN Entertainment, Inc., 8000 Marina Boulevard, 2nd Floor, Brisbane, CA 94005\nCopyright © IGN Entertainment, Inc. All rights reserved.  \n\n\n\n\n\n\n\n\n\n\n\n\n"}