{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Michelle Childs <michelle.childs@keionline.org>", "subject": "[Ip-health] Coming soon: the shopping channel run by drug firms", "body": "--\n[ Picked text/plain from multipart/alternative ]\nhttp://www.guardian.co.uk/medicine/story/0,,2084391,00.html\n\nComing soon: the shopping channel run by drug firms\n\n\nSarah Boseley\nMonday May 21, 2007\nThe Guardian\n\nFour of the world's biggest pharmaceutical companies are proposing to\nlaunch a television station to tell the public about their drugs,\namid strenuous lobbying across Europe by the industry for an end to\nrestrictions aimed at protecting patients. Pharma TV would be a\ndedicated interactive digital channel funded by the industry with\nhealth news and features but, at its heart, would be detailed\ninformation from drug companies about their medicines.\n\nA 10-minute pilot DVD, seen by the Guardian, featured a white-coated\ndoctor discussing breast cancer and a woman patient who reassured\nviewers that \"there are many new treatments available\". Under the\nproposals, viewers could use their remote control to click on\ntreatment options and read what manufacturers have to say about the\nlatest branded breast cancer drugs.\nFour companies, Johnson & Johnson, Pfizer, Novartis and Procter &\nGamble, are behind the pilot, which they are offering to the European\ncommission as a way to give patients more information. The commission\nis consulting on potential changes to the regulations that ban all\ndirect-to-consumer advertising of medicinal drugs.\n\nThe industry has been lobbying in Europe to be allowed direct access\nto patients. It argues that lifting restrictions would help its\ncompetitiveness and has hinted that companies may relocate to the US,\nwhere they can advertise to patients who then demand drugs from their\ndoctors. Profits have soared there as a result.\n\nThe proposed change in the rules is being led within the commission\nby its trade arm, DG Enterprise, and not health, DG Sanco. It is\nbacked by a number of influential patient groups that are themselves\nheavily funded by drug companies. But consumer organisations are\nopposed, warning that the companies will play down risk, and that\ntheir real interest lies in boosting profits.\n\nThe International Society of Drug Bulletins (ISDB) - consumer\npublications which analyse the benefits of drugs and draw comparisons\nbetween them - warns that the industry is not a reliable source of\ntrustworthy information.\n\nThe US and New Zealand allow drug companies to advertise to the\npublic; the ISDB says in both these countries this has been shown to\nbe detrimental to health.\n\n\"Pharmaceutical companies' messages are focused on relatively few top\nsellers, exaggerating effects and concealing risks, confusing\npatients and putting pressure on doctors to prescribe drugs they\nwould not use otherwise,\" it says. \"Lack of comparative information\nin advertising means people cannot choose among several options.\"\nJohnson & Johnson presented the companies' proposals to a meeting in\nBrussels of the Centre for Health, Ethics and Society, a thinktank\nwhich describes itself as \"developed in partnership with Johnson &\nJohnson\". The audience comprised members of the commission, patient\ngroups and others.\n\nThe European Patient Information Channel, as industry is calling it,\ncould be available on the internet as well as TV, and would offer \"on\ndemand\" information about drugs \"to enable patients and citizens to\nmake better decisions\", said Scott Ratzan of Johnson & Johnson. It\nwould be self-regulating, with a board of medical, pharmaceutical and\npatient representatives to hear complaints.\n\nThe TV pilot was welcomed by the European Patients' Forum. The forum,\nan umbrella group, is one of only two patient organisations admitted\nto the working group set up by the commission to discuss changes in\nthe rules.\n\nAlthough its executive director, Nicola Bedlington, said the pilot's\n\"slightly sanctimonious and patronising\" tone needed improvement, she\nand other patient representatives present approved it in principle.\n\n---------\nMichelle Childs\nHead of European Affairs\nKnowledge Ecology International\nmichelle.childs@keionline.org\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}