{"category": "ham", "to_address": "samba-cvs@samba.org", "from_address": "tridge@samba.org", "subject": "Rev 443: merge from ronnie in http://samba.org/~tridge/ctdb", "body": "------------------------------------------------------------\nrevno: 443\nrevision-id: tridge@samba.org-20070603044128-wa8l4mq1nc454did\nparent: tridge@samba.org-20070603043927-duv31mw1amr5hkfs\nparent: sahlberg@ronnie-20070603014813-ynuw05wtnyb8fbjz\ncommitter: Andrew Tridgell \nbranch nick: tridge\ntimestamp: Sun 2007-06-03 14:41:28 +1000\nmessage:\n  merge from ronnie\nmodified:\n  web/ctdb.html                  ctdb.html-20070601052353-vgod9lfo4an4o83j-2\n    ------------------------------------------------------------\n    revno: 432.1.7\n    merged: sahlberg@ronnie-20070603014813-ynuw05wtnyb8fbjz\n    parent: sahlberg@ronnie-20070603014050-2a92zyko4dkmhxno\n    committer: Ronnie Sahlberg \n    branch nick: ctdb\n    timestamp: Sun 2007-06-03 11:48:13 +1000\n    message:\n      mention that ctdb offers cross cluster messaging to applications\n    ------------------------------------------------------------\n    revno: 432.1.6\n    merged: sahlberg@ronnie-20070603014050-2a92zyko4dkmhxno\n    parent: sahlberg@ronnie-20070602235851-2snnvuaodz1d5q1w\n    parent: tridge@samba.org-20070603002957-gw0nyg6k8d1wzavy\n    committer: Ronnie Sahlberg \n    branch nick: ctdb\n    timestamp: Sun 2007-06-03 11:40:50 +1000\n    message:\n      merged with tridge\n      \n      update to the web page for ctdb\n    ------------------------------------------------------------\n    revno: 432.1.5\n    merged: sahlberg@ronnie-20070602235851-2snnvuaodz1d5q1w\n    parent: sahlberg@ronnie-20070602223229-vohn6ethg95kal56\n    committer: Ronnie Sahlberg \n    branch nick: ctdb\n    timestamp: Sun 2007-06-03 09:58:51 +1000\n    message:\n      when we get a dmaster error,   show the database id in the log so we can \n      track which db it happens for\n    ------------------------------------------------------------\n    revno: 432.1.4\n    merged: sahlberg@ronnie-20070602223229-vohn6ethg95kal56\n    parent: sahlberg@ronnie-20070602065058-zorzcz56e16k4btv\n    parent: tridge@samba.org-20070602080816-xkcs5l60md7prakr\n    parent: tridge@samba.org-20070602094506-384lkqipi0x10k6c\n    committer: Ronnie Sahlberg \n    branch nick: ctdb\n    timestamp: Sun 2007-06-03 08:32:29 +1000\n    message:\n      merge from tridge\n=== modified file 'web/ctdb.html'\n--- a/web/ctdb.html\t2007-06-02 06:50:58 +0000\n+++ b/web/ctdb.html\t2007-06-03 01:48:13 +0000\n@@ -5,22 +5,78 @@\n \n\n \n-ctdb\n-\n-ctdb is a fast cluster database for temporary data.\n-ctdb also provides HA features such as IP failover between nodes.\n-\n-It is the core component for samba3/4 clustering.\n-\n+CTDB\n+\n+CTDB is a cluster implementation of the TDB database used by samba and other \n+projects to store temporary data.\n+\n+CTDB provides the same functions as TDB but with the difference that it is\n+clustered and thus it appears as a TDB database that spans multiple physical\n+hosts in a cluster.\n+\n+CTDB provides a TDB that has consistent data and consistent locking across\n+all nodes in a cluster.\n+\n+CTDB is fast. Very fast.\n+\n+In case of node failures, CTDB will automatically recover and repair all TDB databases that it manages.\n+\n+If an application is already using TDB for temporary data it is very easy to convert that application to be cluster aware and use CTDB instead.\n+\n+CTDB is the core component that provides pCIFS with samba3/4.\n+\n+CTDB provides HA features such as node monitoring, node failover, and ip takeover.\n+\n+CTDB provides a messaging transport to allow applications linked with CTDB to communicate to other instances of the application running on different nodes in the cluster. Allowing an easy to use mechanism for an application running on one node in the cluster to communicate with an application running on a different node.\n+\n+Requirements\n+CTDB relies on that a clustered filesystem is available and shared on all nodes that participate in the CTDB cluster.\n+This filesystem must be mounted and available on all nodes in the CTDB cluster.\n+Ontop of this cluster filesystem, CTDB then provides clustered HA features so that data from the clustered filesystem can be exported through multiple nodes in the CTDB cluster using various services.\n+Currently this is used to export data off a clustered filesystem using SMB/CIFS and NFS to clients.\n+\n+TDB\n+TDB is a very fast simple database that was originally developed for use in samba. Today many other projects use TDB to store its data.\n+\n+See TDB README file for some description of how TDB is used.\n+\n+Getting Started\n To get started with ctdb, I would recommend you read the ctdb wiki.\n \n+HA Features\n+The CTDB node sin a cluster designates one node as a recovery master through an election process.\n+If the recovery master node fail a new election is initiated so that the cluster will always guarantee there will be a recovery master.\n+The recovery master will continously monitor the cluster to verify that all nodes contain a consistent configuration and view of the cluster and will initiate a recovery process when required.\n+During the recovery phase, the recovery master will automatically rebuild/recover all clustered TDB database to ensure that the databases are consistent.\n+\n+IP Takeover\n+When a node in a cluster fails, CTDB will arrange that a different node takes over the IP address of the failed node to ensure that the ip addresses for the services provided are always available.\n+To speed up the process of IP takeover and when clients attached to a failed node recovers as fast as possible, CTDB will automatically generate Gratious ARP packets to inform all nodes of the changed MAC address for that IP.\n+CTDB will also send \"tickle ACK\" packets to all attached clients to trigger the clients to immediately recognize that the TCP connection needs to be reestablished and to shortcut any TCP retransmission timeouts that may be active in the clients.\n+\n+Services using CTDB\n+\n+Samba 3/4\n+Extensions has been developed to samba3 and samba 4 to integrate with CTDB to build a clustered HA version os samba where the same data/network shares are exported read-write from multiple nodes in a cluster.\n+These versions of samba have been demonstrated to provide very good scalability.\n+See CTDB Project at samba.org for more information about this pCIFS implementation.\n+\n+NFS v2/v3\n+NFS v2/v3 has been successfully tested with exporting the same data/network share from multiple nodes in a CTDB cluster with correct file locking behaviour and lock recovery.\n+\n+See Configuring NFS for CTDB clustering for isntructions on how to configure a CTDB cluster to provide NFS clustering.\n+\n+\n Discussion and bug reports\n \n ctdb does not currently have its own mailing list or bug tracking\n system. For now, please use the samba-technical\n mailing list, and the Samba\n-bugzilla bug tracking system.\n+bugzilla bug tracking system.\n+\n+We would be very interested in hearing from and work with other projects that want to make their services cluster aware using CTDB.\n+\n \n Download\n"}