{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Energy Seminars<Energy.Seminars@calcium.netcontentinc.net>", "subject": "Trading Technically  June 21  Santa Fe", "body": "\n\n\nEnergy Trading Regulations\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTrading Technically\n(The Basic Mechanics of Using Technical Indicators \n\t\tto Trade Energy) \n\n\n\t\tJune 21 ? Hilton of Santa Fe Historic Plaza - Santa Fe, NM\n\nClick Here To Register Online\n\n\n\n\n\n\n\n\n\nClick To \n      Download A Complete Conference Brochure and Order Form\nClick Here For A Complete Listing \n      Of Upcoming Conferences\n\n\n\n\n\n\n\nBrief: Successful energy trading \n\t\trequires discipline. Traders must not only have a market view, but also \n\t\ta consistent, objective strategy to determine how and when to enter, \n\t\texit, and manage risk to let profits run and cut losses. This seminar is \n\t\tdesigned to introduce traders to the basic mechanics of technical \n\t\ttrading. The first part of the class is an introduction to the basic \n\t\ttechnical indicators and techniques. The latter part will focus on \n\t\tpractical application of trading strategies using real market data.\nAttendees of both this seminar and its \n\t\tsister seminar, Forecasting Using Technical Analysis, will receive $100 \n\t\toff the registration fee of both seminars.\n\n\n       \n\n\n\nTrading Technically ($695) \n\t\t- CPE: TBA\n\n      \tOutline\n1. Review of Technical \n\t\tIndicators?\n\t\ta. Momentum.\n\t\tb. Stops\n\t\tc. Entry\n\t\t2. Entering a trade\n\t\ta. Types of Entry Signals\n\t\ti. Simple entry systems\n\t\tii. More complex entries\n\t\tiii. Filtering with higher time frame\n\t\tb. Using multiple entry signals to confirm\n\t\tc. Second Signals\n\t\td. Scaling in\n\t\t3. Exiting a trade\n\t\ta. Divergence\n\t\tb. Overbought Oversold\n\t\tc. Candlestick Exits\n\t\td. Scaling out\n\t\t4. Stops and Stop Systems\n\t\ta. Types of Stops\n\t\tb. Fixed Price Stops\n\t\tc. Trailing Stops\n\t\td. Using Stops to manage trade risk\n\t\te. Using Stops with warning/exit signals\n\t\t5. Choosing a bar length\n\t\ta. Tick vs. Time\n\t\tb. Based upon trading style\n\t\tc. Based upon risk assessment\n\t\td. Using multiple time frames\n\t\t6. Practice Sessions\n\t\ta. Standard Indicator Trading System\n\t\tb. Kase Indicator Trading System\n\n\n\n\n\n\n\n\n\n\n\n\n? Cash market traders looking to better \n\t\ttimed purchases and sales \n\t\t? For-profit traders looking for a disciplined method of trade execution \n\t\tand exits \n\t\t? Analysts who wish to add \"charting\" to their fundamental or \n\t\tquantitative views \n\t\t? Hedgers seeking insight as to the timing of short term hedges\n\n\t\tA question often asked is \"I have no experience with technical analysis, \n\t\tis this class for me?\" The class begins with the basics of charting and \n\t\tis designed for those who know what a futures contract is and perhaps \n\t\thave some experience with the cash market or hedging but no knowledge of \n\t\ttechnical trading.\n\n\t\tThe class will teach techniques that will be helpful not only for those \n\t\twho wish to trade futures for profit, but also for cash market \n\t\tparticipants and hedgers who must time transactions.\n\n\t\tA typical class attendee has had some exposure to the market, usually on \n\t\tthe physical side, or as a support person, but lacks an understanding of \n\t\tthe technical. Those who do have experience trading futures, but need a \n\t\tmore rigorous, disciplined approach to doing so will find this class \n\t\tgives them the structure to approach the markets more methodically. \n\t\tFinally, those tasked with market analysis and forecasting will find the \n\t\tanalytical techniques taught helpful to developing a more accurate \n\t\tmarket view.\n\n\n\n\n\n\nP. Dean \n\t\tRogers - P. Dean Rogers studied computer science at the University \n\t\tof New Mexico before joining Kase and Company, Inc. in early 2001 as a \n\t\tprogrammer and became manager of the Kase Call Center in 2002. Rogers \n\t\thas co-taught classes for both trading and hedging since that time and \n\t\tis responsible for all client training in regards to trading and \n\t\thedging. He has also assisted Ms. Kase, president of Kase and Company, \n\t\tInc., with the weekly natural gas and forecast for five years, has \n\t\twritten the review of trading strategies and trading lessons, and is now \n\t\tthe primary forecaster of crude oil for Kase.\n\n\n\n\n\n\n\n\nClick To \n      Download A Complete Conference Brochure and Order Form\nClick Here For A Complete Listing \n      Of Upcoming Conferences\n\n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}