{"category": "spam", "to_address": "<mack@speedy.uwaterloo.ca>", "from_address": "\"Vance E. Rolf\" <kgn@sannet.ne.jp>", "subject": "instinct greatly", "body": "\n\n\n\n\n\n\n\nTHOMPSON PASS 650 AM ADT SUN APR 15 2007 . This \nsame information is available in other file formats including the XML based RSS and \nCAP formats.\nTHIS ADVISORY INCLUDES THE COMMUNITIES OF YES BAY \nAND BELL ISLAND.\nSOUTHEAST WIND 20 TO 30 MPH WITH GUSTS UP TO 50 MPH \nBY MID MORNING.\nCLOUDY SKIES WITH RAIN.\nSNOW ACCUMULATIONS THROUGH THOMPSON PASS MY REACH \nUP TO 2 INCHES THIS MORNING WITH VISIBILITIES BEING REDUCED TO ONE-HALF MILE AT \nTIMES. BOAT AND AIRCRAFT OWNERS SHOULD CHECK MOORINGS AND TIEDOWNS AS \nNECESSARY.\nWIND ADVISORY REMAINS IN EFFECT UNTIL 7 PM CDT THIS \nEVENING. EXCEPT SNOW ABOVE 500 FEET AND RISING THROUGH THE MORNING. WIND ADVISORY \nREMAINS IN EFFECT FROM 9 AM SUNDAY UNTIL 12 AM ADT MONDAY. WIND ADVISORY REMAINS IN \nEFFECT FROM 9 AM SUNDAY UNTIL 6 PM ADT MONDAY NEAR THE COAST.\nMOSTLY CLOUDY SKIES WITH RAIN OCCASIONAL MIXING \nWITH SNOW THROUGH 1 PM. STRONG NORTHWEST WINDS TO BE FELT ACROSS THE AREA \nTODAY.\nWINDY WITH SOUTH TO SOUTHEAST WIND TO 20 \nMPH.\nHAINES 630 AM ADT SUN APR 15 2007 . This file is \nusually updated about every two minutes. BECOMING WINDY WITH SOUTHEAST WIND 10 TO 20 \nMPH. CLOUDY SKIES WITH RAIN CONTINUING THROUGH THE MORNING. RAIN MIXING WITH SNOW \nCONTINUES TO FALL ACROSS NORTHEAST PRINCE WILLIAM SOUND THIS MORNING.\nCLOUDY SKIES WITH RAIN CONTINUING THROUGH THE \nMORNING.\nCLOUDY SKIES WITH RAIN.\nAN ADVISORY MEANS A POTENTIALLY HAZARDOUS EVENT IS \nIMMINENT. KAKE 537 AM ADT SUN APR 15 2007 .\nINCREASING TO 25 TO 35 MPH WITH GUSTS TO 45 MPH BY \nMID MORNING. THIS ADVISORY INCLUDES THE COMMUNITIES OF KETCHIKAN.\nALSO BE CAREFUL IN CARRYING OR OPENING LARGE FLAT \nOBJECTS SUCH AS CAR DOORS.\nSHOWERS CHANGING TO RAIN THIS MORNING. WIND \nADVISORY REMAINS IN EFFECT FROM 9 AM SUNDAY UNTIL 12 AM ADT MONDAY. CLOUDY SKIES \nWITH RAIN CONTINUING THROUGH THE MORNING.\nCLOUDY SKIES WITH RAIN CONTINUING THROUGH THE \nMORNING.\n"}