{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Richard Marquez <gallegos@greenpeach.net>", "subject": "Penis loader", "body": "\n\nYou want to save your money and get licensed medications? I bet you do!\nVisit us\nYou can spend thousands and buy pills at your local drug store. But you can spend less by ordering the same quality Viagra and Cialis at Online pharmaceuticals.\nClick here\nInstant shipping directly from our warehouses!\nWith best regards,\nRichard Marquez\n \n \nOtsmeiavshis, no Vse eshche prodolzhaia prezritelno ulybatsia, Altares snizoshel do togo, chtoby Proiasnit situaciiu: Ploho u tebia s chuvstvom iumora, plemiannik. Ne tolko tvoi, Dos, s ottenkom ugrozy vozrazil vtoroj frajden. I mnogoznachitelno dobavila: Ty pojmesh eto, kogda uznaesh, kto on na Samom dele. Inop, ia ved byl na drugih planetah, videl, Kak tam zhivut liudi. \nOn ster s pomoshchiu sheptunov ih Individualnost. Ia poproboval vyiasnit, v chem delo, i uznal Sleduiushchee: kogda-to dal-rokty byli takim zhe svetoliubivym narodom, kak i Haaskiny, kordy, serye adalai i prochie chelovecheskie rasy, naseliaiushchie etot mir. Pravda, V svete zelenovato-zheltogo mashara, prilepivshegosia k potolku, lico u nego bylo Kak u utoplennika. Mne pora otpravliatsia. Emu vse eshche ne verilos, chto on Tak legko otdelalsia. On skazal, chto ia smogu najti ego v Neureje, esli on zhiv. On prishchuril glaza, pritushiv ih stalnoj blesk. Mysl prervalas na seredine, a myshcy instinktivno napriaglis. \nPotom glaza maga potuskneli okonchatelno. Nesterpimo iarkij zheltyj iazyk Kristalnoj chistoty miagko podhvatil maga pod podoshvy sapog i voznes ego na Prezhniuiu vysotu, zatem eshche vyshe, ostaviv vnizu biushcheesia v agonii zhivotnoe. Ona snova podavila v sebe vspyshku zlosti i obrisovala situaciiu korotkimi, Rublenymi frazami, vsem svoim vidom demonstriruia, chto vinovnik sluchivshegosia Stoit priamo pered nej. Ved moj rang uzhe opredelen odnoznachno. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}