{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Amalia Frost\" <pifcfiemailgew@cfiemail.com>", "subject": "Healthy living with less fat", "body": "\nWomen will love your new figure\n\n\n\n\n\nAnatrim – The very up-to-date and most fascinating product for corpulent people is now available – As could be seen on ABC\n\n\n\nDid you see redundant body kilograms kill more and more people every year? We know that you hate the unattractive look of people like those and the social prejudice against them. \n\nOr, maybe, you can not withstand a siege of your fatal eating habits. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nWe’re proudly introduce you Anatrim, the new product for the elimination of your body’s extra weight. The astounding thing about Anatrim is it raises the quality of your life by making you crave food less and giving you better cheer. Note what people say about this product:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of watching TV constantly and eating any food close at hand \n\n\nI became more interested in taking exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I am more fit now and lots of men fix their eyes on me!\"\n\n\n\n\n\n\nMaria H., New York\n\n\n\n\n\n\n\"I tried some passive weight losing, but with little result. I could not restrain my ravenous hunger. \n\n\nOne day I heard on Anatrim in the media advertisement and I was really effected by the information.\n\n\n I had tried taking it, and my wife told me I had changed for the better since then, 3 months later. \n\n\n26 pounds off and this is still far to an end! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nMike Brown, Washington\n\n\n\n\n\nAnatrim helps your mind to realize you doesn’t have such a great need for the constant eating. It raises your spirit, gives you extra energy, and attacks useless kilos. Especial thanks to its mighty newly-elaborated formula!!\n\n\n\nFind out more information on this great product now!\n\n\n\n"}