{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\"\n\t<speakup@braille.uwo.ca>", "from_address": "John covici <covici@ccs.covici.com>", "subject": "Re: Speakup kernel patch dropped from Ububtu Gutsy ", "body": "I was going to install ubuntu on a laptop, but now I think I will use\ngentoo instead which seems to not find speakup too difficult to\nmaintain and has a very nice frame buffer patch as well.\n\non Tuesday 05/15/2007 Gene Collins(collins@gene3.ait.iastate.edu) wrote\n > \n > To put it in language you'll understand, that stinks.  Not everyone\n > wants to use a gui interface.  There are still functions under the gui\n > that are not accessible.  As for the argument that Speakup is not\n > popular, you have only to look at the number of Speakup users on this\n > list.  As for the maintenance issue, speakup is no more difficult to\n > maintain than any other of the hundreds of modules that habitually are \n > included.  The thing that makes building your own kernel more difficult\n > is Ubuntu's insistence on using an initrd for a standard system.  All\n > the extra hardware discovery stuff isn't necessary once a system is\n > installed.  Besides which, without speakup, there is no way to do a\n > server install, and Speakup has never been included in a manner that\n > would allow a blind person to do an install from a server cd.  Mot to\n > mention the times when Orca or Gnome crashes in some fashion, and the\n > only way to recover things is by using Speakup from a text console.  If\n > you really have maintenence issues, talk to Kirk and find a way to\n > resolve them.  I think the decission to drop Speakup from Ubuntu is\n > extreemly short sighted.\n > \n > Gene Collins\n > \n > >Hi,\n > >\n > >As part of an ongoing effort to bring our kernel tree closer with the \n > >mainline kernel (ideally identical) we have opted to drop the speakup \n > >patch from our tree.\n > >\n > >We have found it fairly difficult to maintain and it has not seen the \n > >kind of usage that the graphical systems (Orca, etc) have.\n > >\n > >It seems that many speakup users traditionally prefer to compile their \n > >own kernel, which will of course still be an option, and as Ubuntu \n > >approaches a fairly standard kernel this should be fairly easy.\n > >\n > >This does by no means mean that we are reducing our focus on \n > >accessibility. We have a range of new projects in the works both for the \n > >visually impaired and other groups. See: \n > >https://wiki.ubuntu.com/Accessibility/Specs\n > >\n > >Henrik\n > >\n > >\n > >ps. I originally sent this on 30/04, but as was not subscribed it must \n > >have bounced\n > >\n > >_______________________________________________\n > >Speakup mailing list\n > >Speakup@braille.uwo.ca\n > >http://speech.braille.uwo.ca/mailman/listinfo/speakup\n > \n > _______________________________________________\n > Speakup mailing list\n > Speakup@braille.uwo.ca\n > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n-- \nYour life is like a penny.  You're going to lose it.  The question is:\nHow do\nyou spend it?\n\n         John Covici\n         covici@ccs.covici.com\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}