{"category": "ham", "to_address": "\"rhelp.20.trevva@spamgourmet.com\" <rhelp.20.trevva@spamgourmet.com>", "from_address": "\"Deepayan Sarkar\" <deepayan.sarkar@gmail.com>", "subject": "Re: [R] Display Multiple page lattice plots", "body": "On 6/7/07, rhelp.20.trevva@spamgourmet.com\n wrote:\n> Gudday,\n>\n> I am generating a series of lattice contourplots that are conditioned on a variable (Year) that has 27 different levels. If I try and put them all on one plot, it ends up pretty messy and you can't really read anything, so instead I have set the layout to 3x3, thus generating three pages of nine plots each. The problem is that I can't display all these on screen at once, because each subsequent page overwrites the previous one. I have found in the mailing lists how to print them to separate files without any problems eg.\n>\n>       p<-contourplot(log10(x)~lat*long|Year,\n>                   data=data.tbl,\n>                   layout=c(3,3))\n>       png(file=\"Herring Distribution%02d.png\",width=800,height=800)\n>       print(p)\n>       dev.off()\n>\n> but there doesn't seem to be anything about how to output multiple pages to the screen... I suspect that I may need to use the page=... option in contourplot command, but I can't seem to make it work. Its a simple, and not particularly important problem, but it sure is bugging me!\n>\n\nYou haven't told us what you want to happen exactly. Gabor's solution\nwill work (on Windows), and a multi-page PDF file is a similar option\nthat's portable. Here's another option if you want multiple windows:\n\nxyplot(1:10 ~ 1:10 | gl(3, 1, 10), layout = c(1, 1), page =\nfunction(n) dev.copy(x11))\n\nyou should replace x11 with the appropriate choice on your platform.\nThis will produce an extra copy of the last page, which you can\nsuppress by making use of 'n' inside your page function.\n\n(Unfortunately page = function(n) x11() does not work, even though\nthat would have been more natural.)\n\nAnother option is to print your trellis object in parts; e.g.\n\np<-contourplot(log10(x)~lat*long|Year,\n                 data=data.tbl,\n                 layout=c(3,3))\n\nx11()\np[1:9]\nx11()\np[10:18]\nx11()\np[19:27]\n\n-Deepayan\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}