{"category": "spam", "to_address": "<theorize@plg.uwaterloo.ca>", "from_address": "\"Florine Hebert\" <baff@espaflor.com>", "subject": "Investor's Insight", "body": "\n\n\n\n\n\n\n\nBreaking News Alerts!   We ask you to watch and enjoy the ride. \nStocks like this Do Not happen often....We expect big things Monday!\nE XTREME \nMOTORSPORTSSym: ETMO.PKCurrent $0.00065 Day   $0.03\nE XTREME Motorsports of California, Inc. Completes Acquisition of Southern \nOffroad Vehicle ServicesJune 27, 2:00 pm ET \nBAKERSFIELD, CA--(MARKET WIRE)--Jun 27, 2007 -- E XTREME Motorsports of \nCalifornia, Inc. (Other OTC:ETMO.PK - News) (\"E XTREME\" or the \"Company\"), has \ncompleted the acquisition of Southern Offroad Vehicle Services, LLC (\"SOVS\"), a \ncompany dedicated to providing financing for customers purchasing off-road \nvehicles. Through this acquisition, E XTREME will not only be able to offer its \ncustomers direct financing of sandcar purchases, but will also be the first \nsandcar manufacturer  As previously announced, in exchange for all \nof the capital stock of SOVS, E XTREME has paid $10,000 in cash and 15 million \nshares of EXTR EME common stock. Of the 15 million share of common stock, 10 \nmillion will be restricted shares of common stock and 5 million will be \nfree-trading shares.\nIn the past, EXTREM E required customer down-payments at contract signing and \nfinal payment upon acceptance of the final vehicle, which required EX TREME to \nfinance the 12-month or more build-out process through the operating cash flow \nof the company. Now, EXTR EME will be able to achieve both greater throughput and \nprofit margins by shifting its financing costs to the customer. SOVS has \ncurrently secured $14 million in financing for future customers of EXTREM E, both \nfor direct purchases and for leased vehicles. This will provide EX TREME with \nimmediate funding for the build-out of custom sandcars for private customers and \n\"spec\" vehicles for its dealers.\n\"The acquisition of SOVS provides EXTR EME with the capability to deliver \ndirect financing to our customers at rates comparable to dealers of standard \nover-the-road vehicles,\" commented Alan McCaa, President and CEO of EXT REME \nMotorsports. \"Through this acquisition, we provide what no other sandcar \nmanufacturer in the world is able to claim: in-house financing to all customers. \nThis not only ensures consistent operating cash flows to EXTREM E, but \nincentivizes buyers who might otherwise defer a purchase to a later date to \ncomplete a purchase immediately through consumer financing.\"\nAbout EXTR EME Motorsports of California, Inc.\nEXT REME Motorsports of California, Inc., operating under the trade name \n\"Xtreme Motorsports,\" is a manufacturer of custom and production-line sandrails, \ndesert and dual sport racecars. Founded in 1983, EXTR EME's sandcars have been \nsold to customers in England, the United Arab Emirates, Australia, South America \nand the US. For more information, visit the corporate web site\n• E XTREME Motorsports of California, Inc. Completes Acquisition of Southern \nOffroad Vehicle Services Marketwire (Wed, Jun 27)  • EXTR EME \nMotorsports Closes 504 Offering, Prepares to Complete Audit of Financial \nStatements and Move to Over-the-Counter Bulletin Board Marketwire (Wed, Jun \n27)  • Alan McCaa, CEO and President of EXT REME Motorsports of \nCalifornia, Inc., is the Featured Guest in an Audio Interview at \nSmallCapVoice.com Business Wire (Thu, Jun 14)  • EXTR EME \nMotorsports of California, Inc. (ETMO) SqueezeTrigger Price is $0.0037. \nApproximately 279.9 Million Shares Shorted Since September 2006 According to \nBUYINS.NET Research Report Marketwire (Mon, Jun 11)  • EXTR EME \nMotorsports of California, Inc. Initiates Stock Repurchase Program, Prepares to \nClose Out 504 Offering Marketwire (Thu, Jun 7)  • EXT REME \nMotorsports of California Receives Master Distributor Agreement for EXTREM E \nSecurity Vehicles, Provides Share Structure Update Marketwire (Thu, May \n31)  • EXT REME Motorsports of California, Inc. Completes Letter of \nIntent to Acquire Southern Offroad Vehicle Services Marketwire (Tue, May \n29)  • EXTREM E Motorsports of California, Inc. Confirms Symbol, CUSIP \nChange and Trademark Protection Strategy Marketwire (Mon, May 21) \n \n\n"}