{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Ralph W. Reid\" <rreid@sunset.net>", "subject": "Re: comparison of different distros", "body": "Slackware 11.0 has 2.6.x kernels in the 'extra' directory tree.  The\nwork on the next release seems to be exclusively with 2.6.x kernels,\nbut I can not guess when the next release will take place.  I have not\nhad much trouble compiling programs in Slackware, but I have found\nthat Slackware already includes most of what I need straight off of\nthe shelf--I have not added much to it at all.  Perhaps the next\nSlackware release will suit your needs better.  Others here can\ncomment on their favorite distributions.\n\nHTH, and have a great day.\n\nOn Mon, Jun 04, 2007 at 10:23:57AM +0100, Michael Whapples wrote:\n> Hello,\n> With the news of ubuntu dropping speakup in gutsy, I am thinking of\n> changing to another distro where I will have speakup for the text\n> console. I am just wondering what is the advantages of the different\n> distros (what is the good points and bad points to each one). I have\n> previously used slackware, but found sometimes compiling software could\n> be a problem due to the continuation of using a 2.4 kernel and some of\n> the libs. I have also used gentoo which seemed to work well except for\n> all configuration was left to be done by hand and if not careful while\n> doing an update you may find the system fails because of a change in the\n> configuration options. How does debian compare? Also could anyone point\n> me in the direction of a comparison of the different distros.\n> \n> From\n> Michael Whapples\n\n-- \nRalph.  N6BNO.  Wisdom comes from central processing, not from I/O.\nrreid@sunset.net  http://personalweb.sunset.net/~rreid\n...passing through The City of Internet at the speed of light...\nSLOPE = (y2 - y1) / (x2 - x1)\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}