{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@flax9.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "SatCon Wins Air Force Aerospace Generator Contract", "body": "\n\n\n\n\n\n\n\n\nSatCon Wins Air Force Aerospace Generator Contract\n\nBOSTON, May 22, 2007 (BUSINESS WIRE) --  SatCon Technology Corporation(R) (Nasdaq CM: SATC), a developer and supplier of power management and system architecture solutions for the alternative energy and distributed power markets, today announced that it has been awarded a Phase I SBIR contract with the U.S. Air Force Research Laboratory to develop a high speed, power dense generator for airborne applications in the range of 100-300 kW scalable to the MW-class for directed energy weapon (DEW) power supplies. SatCon is currently developing starter/generators, traction motors, and generators for ground and undersea vehicles. This award expands SatCon's portfolio of electric power conversion technologies with the development of a generator for aerospace applications based on advanced permanent magnet machinery design concepts. This work is a direct follow-on from machinery research conducted for the US Army, Ft. Belvoir, for a HMMWV inline generator and an active development program with the Army Research Laboratory for a 410kW hybrid electric tactical vehicle generator. This machine technology has direct applicability to military and dual-use civilian series hybrid vehicles, on-board vehicle power (OBVP), and for generator set applications. This concept will also be scalable to MW-class applications such as airborne directed energy weapons (DEW) and naval ship power generation. The objectives for this program are high-speed capability, rugged design, high power density, and affordable manufacturing capability. SatCon's President & Chief Executive Officer, David Eisenhaure, stated \"In addition to opening up opportunities for future military aircraft power applications, this new SatCon program further solidifies our push into the hybrid electric vehicle sector for military, commercial, and passenger applications. SatCon is targeting best in class solutions for the widest possible range of hybrid electric vehicle and power conversion applications through a broad array of developments.\" About SatCon Technology Corporation SatCon Technology Corporation is a developer and manufacturer of electronics and generators/motors for the Renewable Energy, Hybrid-Electric Vehicle, Grid Support, High Reliability Electronics and Advanced Power Technology markets. For further information, please visit the SatCon website at www.satcon.com. (SATC-G) Statements made in this document that are not historical facts or which apply prospectively are forward-looking statements that involve risks and uncertainties. These forward-looking statements are identified by the use of terms and phrases such as \"will,\" \"intends,\" \"believes,\" \"expects,\" \"plans,\" \"anticipates\" and similar expressions. Investors should not rely on forward looking statements because they are subject to a variety of risks and uncertainties and other factors that could cause actual results to differ materially from the Company's expectation. Additional information concerning risk factors is contained from time to time in the Company's SEC filings. The Company expressly disclaims any obligation to update the information contained in this release. SOURCE: SatCon Technology Corporation SatCon Technology Corporation(R)\nDan Gladkowski, 617-897-2411\nVP, Administration\n\n\n\n\n\n\n\n\n\n\n You are subscribed to SatCon Technology Corporation Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n SatCon Technology Corporation \n 27 Drydock Ave. 6th Floor, South Boston, MA 02127\n Service provided by Shareholder.com \n\n\n\n\n\n"}