{"category": "spam", "to_address": "<smiles@liverpool.ac.uk>", "from_address": "\"Yulia\" <smiles@blaenavon.freeserve.co.uk>", "subject": "Hello!", "body": "\n\n\n\n\nHello dear friend!\nMy name is Yuliya. I am 26 years old. I'm from Russia, city\nYoshkar-Ola.\nI live together with my mum and I work as adviser on sale home\nappliances.\nI have many various hobbies: sport, a photo, drawing. I dream to have\nstrong and happy family.\nIt's my purpose in life. I want to be happy and to do happy my family.\n=Recently I thought that I have it already. However.......\nI wish to tell you history which have pushed me write to you.\n6-7 months ago I have got acquainted with man from your country. His\nname is Donovan.\nOur meeting was at a seminar in city St. Peterburg. It was the working\n=meeting. Between us began the novel.\nIt was so fast and I thought that it's my man. Through 3 days he has\nleft home.\nWe have understood that letters can not replace our meeting face to\nface again.\nDonovan has told that I should arrive to him!!! I was very glad during\n=that moment.\nI wrote the application for reception visa. I waited reception of visa\n=approximately half of year.\nAll this time Donovan called and wrote to me letters. All things was\nvery good.\nI have received the invitation from the ambassador for reception visa.\n=My director has given me holiday from work and I have gone to Moscow to\n\nreceive visa.\nI said this news to Donovan, but he told that he does not want our\nmeeting.\nHe played with me. He has told me that he has wife with 3!!!!!!\nchildren and now he don't want our meeting.\nI have been broken...\nI could not think that it was game with my feelings..... I did not\nthink that people are so severe.......\nNow I am in Moscow and waiting for reception visa.\nI don't want that all was gone for nothing and will be glad if my visa\n=will be useful to our meeting.\nI could arrive already in 4-5 days, but I have problem.\nI don't know any man who would like my arrival.\nI hope that it will not sound silly if I will ask you about our meeting\n\nand good time together.\nI don't know your ideas about my letter, but it would be fine if we\ncould meet and have some weeks or months together.\nI want to use my visa for trip to your country and search man with\nwhich I would like to have happy and strong family.\nI was never married and have no any children. I'm woman which ready to\n=creation family with good man.\nI don't know about you anything, but I want it very much.\nIt would be fine if we could meet, to do friendship or more than simply\n\nfriendship.\nI will be happy if you also have a free time and we could meet soon.\nI don't know about your plans at present time, but I sincerely hope\nthat we can have meeting with you in the near future.\nYou can write all that you want. Ask any questions which interest you.\n=I hope that you understand my English :) I began to study English\napproximately 1,5 year ago.\nWrite to me back and I will tell more about myself and send my photos.\n= \nPlease, write to me back and send your pic on my regular e-mail:\n,\"yuliyase@bk.ru\"\nHave a good day,\n\nYuliya\n\n\n"}