{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "proselytize: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Thursday, June 14, 2007\nproselytize \\PROS-uh-luh-tyz\\, intransitive verb:\n1. To induce someone to convert to one's religious faith.\n2. To induce someone to join one's institution, cause, or political party.\n3. To convert to some religion, system, opinion, or the like.\nJesuit missionaries appeared; the Japanese allowed them to proselytize. -- Walter LaFeber, The Clash: A History of U.S.-Japan Relations\nIt has given the world an example of what hard work can do, but in general Japan prefers to focus on its own affairs and let other countries proselytize for democracy, capitalism, communism, or whatever else they believe in. -- James Fallows, \"Containing Japan\", The Atlantic, May 1989\nHe has a message and he wants to proselytize the whole world. -- William Schneider, \"The Republicans in '88\", The Atlantic, July 1987\nProselytize is formed from proselyte, \"a new convert, especially a convert to some religion or religious sect, or to some particular opinion, system, or party,\" from Greek proselutos, \"a proselyte, a newcomer,\" from pros, \"toward\" + elutos, from eluthon, \"I came.\"\nDictionary.com Entry and Pronunciation for proselytize\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9916787-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}