{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 11, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESDivorce Rate Down, But What Does It Mean?\nDespite the common notion that America remains plagued by a divorce epidemic, the national per capita divorce rate has declined\n                        steadily since its peak in 1981 and is now at its lowest level since 1970. What's fueling that decline? A lot of things. More...\n• Missouri's Flooding Woes Continue• Wildfire Threatens SoCal Island City\n                     \t\t\t\t\t| Watch• Smoking Will Play Role In Movie RatingsU.S.Second Georgia Wildfire Burns 100K Acres\nA second wildfire in the Okefenokee Swamp has burned more than 100,000 acres, firefighters said. Georgia and Florida have\n                        been battling wildfires for weeks, with nearly 300 square miles charred as a drought has left the land tinder-dry. More...Watch: Florida Fights Fire With Fire\n• Divorce Rate Down, But What Does It Mean?• Bail Hearing For Fort Dix Six\n                     \t\t\t\t\t| Watch• Wildfire Threatens SoCal Island City\n                     \t\t\t\t\t| Watch• More StoriesWorldBlair's Likely Successor Takes The Mic\nThe man who is all but certain to take over from Tony Blair as British Prime Minister at the end of June has launched his\n                        de-facto campaign; vowing to keep up with the country's commitment in Iraq, but predicting a marked \"shift\" in emphasis. More...Watch: Blair Stepping Down In June\n• No Welcome Wagon For Arab Tourists• U.K.'s Mixed Message On Assisted Suicide• North, South Korea Agree On Train Crossing• More StoriesPoliticsMitt Romney Discusses Mistakes In Iraq\nGOP presidential candidate Mitt Romney tells Mike Wallace that the Bush administration made mistakes in Iraq that the country\n                        is still paying for. Wallace's report airs Sunday, May 13, at 7 p.m. ET/PT. More...Watch: Preview: Mitt Romney On Bush\n• Former Gore Strategist On Dems, '08• Meet Michelle Obama• Bush, Democrats Agree On Trade Deals• More StoriesHealthWomen's Knee-Injury Mystery Unsolved\nIt's still a mystery why women suffer more knee injuries than men do. An elaborate new study fails to link ACL rupture to\n                        menstrual cycle. More...\n• Doctors Warn Thin People May Be Fat Inside• Report: Veterans Have Greater Suicide Risk• Aspirin May Help Prevent Colon Cancer• More StoriesSciTechNYC Cabs Going High-Tech\nThe city's Taxi and Limousine Commission unanimously approved a plan to install touch-screen monitors in all 13,000 city cabs\n                        over the objections of some drivers who consider the technology too expensive and intrusive. More...\n• NASA Warns Of Scorching Summer Temps\n                     \t\t\t\t\t| Watch• Cell Phone GPS Finds Transplant Patient\n                     \t\t\t\t\t| Watch• Fuel-Efficiency Bill \"Full Of Holes\"• More StoriesBusinessGerman Steelmaker To Build Alabama Plant\nGerman steelmaker ThyssenKrupp AG said it will build a new $4.19 billion steel plant in Alabama, generating thousands of jobs.\n                        The plant is set to open in 2010 and employ as many as 2,700 workers when fully operational. More...\n• Bush, Democrats Agree On Trade Deals• No Welcome Wagon For Arab Tourists• Guilty Pleas In Giant Insider-Trading Case• More StoriesEntertainmentSmoking Will Play Role In Movie Ratings\nSmoking will be a bigger factor in determining film ratings, the Motion Picture Association of America said. However, critics\n                        said the move does not go far enough to discourage teens from taking up the habit. More...\n• Report: Paris Might Not Serve 45 Days\n                     \t\t\t\t\t| Watch• Landis: They Wanted Me To Squeal On Lance• Brangelina's Biggest Problem? Quality Time\n                     \t\t\t\t\t| Watch• More StoriesOpinionRomney's Religion Problem\nRepublican Mitt Romney took offense to Al Sharpton's comment about his Mormon faith, but if he wants a real chance of winning\n                        over GOP voters, being targeted by liberals might be his only hope, says The New Republic. More...Watch: Preview: Mitt Romney On Bush\n• Counting The Bentleys• A Prescription For Details\n                     \t\t\t\t\t| Watch• Leaving Iraq Puts More Than U.S. At Risk\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Meet The 95-Year-Old Graduate\nFor most college seniors, the schedule would seem ordinary, trying to strike a balance between studying and socializing. But,\n                        as Jeff Glor reports, there is nothing ordinary about what Nola Ochs is about to accomplish. More...Watch: The Oldest College Graduate\n• EARLY SHOW: Gifts That Keep On Growing\n                     \t\t\t\t\t| Watch• EARLY SHOW: Missing:  Analyce \"Anna\" Guerra\n                     \t\t\t\t\t| Watch• CBS Evening News: Are Women \"Opting Out\" Of Careers?\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nFlorida Fights Fire With FireOnly On The Web: Firefighters are trying to fight wildfires in Florida and Georgia with a strategy of controlled burning.\n                                    Kelly Cobiella reports that the plan has been problematic.\nTOP VIDEOS\nGiuliani's Choice On Abortion\nFires Ravage Catalina Island\nJane Fonda On 'Georgia Rule'\nStacy Voted Off 'Survivor'\nStorm Fans Florida Flames\nSecret 'Survivor' Scene\nWitness: Spector Drunk\nYounger Women's Hearts\nThe Oldest College Graduate\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMike Wallace profiles GOP presidential hopeful Mitt Romney, this Sunday, 7 p.m. ET/PT.48 Hours MysteryDeath Of A Dream:An aspiring Broadway dancer is murdered. Did her secrets contribute to her death? Erin Moriarty\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}