{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "The number of severely obese is on the rise...why?  We'll tell you tonight on the CBS Evening News with Katie Couric", "body": "\nCBSNews.com\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\nQUOTE OF THE DAY\"The avoidance of taxes is the \n      only intellectual pursuit that carries any reward.\" - John \n      Maynard Keynes \n\nDID YOU KNOW?Cats average 16 hours of sleep a day, more \n      than any other mammal. \n\nTONIGHT ON THE CBS EVENING NEWSHere's an \n      early look at what we are working on from Anchor and Managing Editor, \n      Katie Couric... Hi everyone, This morning, the \n      Rutgers women’s basketball team spoke up about controversial comments made \n      about them by radio host Don Imus. Their coach slammed what she called \n      “racist and sexist remarks that are deplorable, despicable and \n      unconscionable.” The team captain said Imus had stolen “a moment of pure \n      grace” from the athletes. Nancy Cordes will have the story and \n      Richard Schlesinger will put the Imus controversy in perspective \n      with a report on racism in America. On Capitol Hill, momentum is \n      building up to a likely clash over stem-cell research. As dual bills that \n      would provide public funding for research using human embryos move through \n      Congress, the White House says that President Bush’s veto pen is ready for \n      whatever form of the legislation hits his desk. Sharyl Attkisson \n      will have that story. And Dr. Jon LaPook will look at one \n      of the potential uses for stem-cells: to help cure type 1 diabetes. The \n      Journal of the American Medical Association reported that stem cells taken \n      from the blood of a small sample of diabetes patients have helped the \n      patients’ immune systems go months, and even years, without insulin. \n      Fourteen out of the 15 patients studied saw marked improvement in their \n      diabetes, showing a glimmer of hope for a cure. In other health \n      news, researchers reported last night that the fastest-growing group of \n      obese people in the United States are those 100 pounds or more overweight. \n      These people are known as “severely obese.” The proportion of Americans \n      fitting that description grew by an astonishing 50 percent between 2000 \n      and 2005.  Kelly \n      Cobiella will bring us this \n      report. For two years Army Specialist Mario \n      Lozano has agonized about taking the life of an Italian secret agent while \n      manning a roadblock on Iraq’s most dangerous highway. Now, as he awaits \n      trial in Italy for the death of Nicola Calipari, Lozano shares details of \n      the shooting with our chief foreign correspondent Lara Logan. \n      I hope you’ll join us. Katie For more on \n      the stories noted above, please click on the following links: \n      Rutgers Team: Angry, Disgusted At Imus Click Here Bush Promises Veto On \n      Stem Cell Bill Click Here And here's an early \n      look at one of the stories we are working on for Wednesday's broadcast of \n      the CBS Evening News: Fighting in Afghanistan between NATO \n      forces and the Taliban is intensifying with the arrival of spring, and our \n      Lara Logan is in the thick of it. So that story and much more, \n      Wednesday night, on the CBS Evening News. If you would like more information on the broadcast, \n      please click on the following address and e-mail us: evening@cbsnews.com \n      \n\nTONIGHT ON DAVID \n      LETTERMANActor David Duchovny AND Philadelphia Phillies \n      star Ryan Howard will join Dave tonight. Plus, musical guest Andrew \n      Bird!\n\nWEDNESDAY\nMORNING ON THE EARLY SHOWHarry Smith, Hannah Storm, Julie \n      Chen and Russ Mitchell anchor THE EARLY \n      SHOW from New York. Dave Price will \n      bring us the weather. Along with the top news of the day, we \n      will also have the following stories: ANNA NICOLE'S SISTER: \n      NEW BOOK, PT. 2: In the second part of our exclusive two-part \n      interview with Donna Hogan, the sister of Anna Nicole Smith, we'll ask \n      Hogan what is was like for the former Playboy Playmate and reality show \n      star to live in the spotlight. What does Hogan make of the paternity \n      battle over Anna Nicole's daughter Dannielynn? We'll ask her Wednesday \n      morning. MOUNTAIN LION ATTACK UPDATE: In January, \n      seventy-year-old Jim Hamm and his wife Nell went hiking in the Redwood \n      Forest near Eureka, California. Suddenly, Jim was attacked by a vicious \n      mountain lion. The ambush left Jim fighting a long road to recovery. The \n      lion had gripped Jim's head in its jaws, with a clench so tight that his \n      wife of nearly fifty years thought nothing could deter the beast. But \n      before she even had time to think, Nell picked up a stick to beat the \n      lion. Eventually, the lion let go. Miraculously, Jim lived to tell the \n      tale: about the attack, his wife's courage, and how he is doing today. He \n      and his wife will join us Wednesday morning with their harrowing tale. \n      MY GENERATION: BRIDES WITH BELLIES: It used to be that \n      women got married and then had a baby. But increasingly, that is not the \n      case. Celebrities have made it fashionable to wed while with child, but \n      they are certainly not the first women to do so. Today, because more and \n      more women are marrying when they are older, many are pregnant when they \n      do walk down the aisle. Some women, on the other hand, are waiting to get \n      married until after their baby is born. What used to be a stigma is now \n      something brides are flaunting with maternal pride. So what is behind the \n      trend? Relationship writer Amy Kean will join us with the latest on \n      baby-on-board nuptials, and why saying \"I do\" may be a reaction to the \n      pitter-patter of little feet. PET ALLERGIES: Dogs, just \n      like people, can suffer from allergies and some of the symptoms: chewing \n      on paws, scratching, licking or recurrent ear infections. So how can you \n      protect your pooch from the effects of seasonal allergies? While your \n      pet's vet may have tips, our resident veterinarian Debbye Turner \n      will join us with her advice on keeping man's best friend comfortable \n      during allergy season. ACCESSORIZING WITH SPRING BAGS: With \n      the rise of spring, fashion's hottest accessory very well may be the \n      handbag. But what are the best picks for every occasion? Whether you are \n      looking for a carry-all to tote all of your belongings, or a slim clutch \n      for a night out on the town, choosing a bag that suits you does not have \n      to be a difficult affair. Kim France, Editor of Lucky magazine, \n      will join us Wednesday morning with her top picks for spring. \n      GENE SIMMONS PLAYS XBOX: Known for his over-the-top antics \n      and outrageous displays, Gene Simmons is as bad as he ever was. The KISS \n      star and family man has a hit reality show and is showing no signs of \n      slowing down. Wednesday morning, two of the best Guitar Hero video gamers \n      will join us, along with Gene Simmons, to play Guitar Hero on XBOX! \n      Simmons will play the bass while the gamers play the game. You won't want \n      to miss it! If you would like more information on any of these \n      stories or the broadcast, please click on the following address and e-mail \n      us: earlyshow@cbs.com \n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}