{"category": "ham", "to_address": "R-help@stat.math.ethz.ch", "from_address": "Robert A LaBudde <ral@lcfltd.com>", "subject": "Re: [R] bivariate normal distribution in likelihood", "body": "At 11:32 PM 4/30/2007, Deepankar wrote:\n>Hi all,\n>\n>I am trying to do a maximum likelihood estimation. In my likelihood \n>function, I have to evaluate a double integral of the bivariate \n>normal density over a subset of the points of the plane. For \n>instance, if I denote by y the y co-ordinate and by x, the x \n>co-ordinate then the area over which I have to integrate is the \n>following set of points, A:\n>A = {x>=0 & y < 3x+10}\n>\n>I have used the following code to calculate this double integral:\n>\n>x <- rmvnorm(100000, mean=me, sigma=sig)\n>c <- nrow(x)\n>x1 <- x[ ,1]\n>x2 <- x[ ,2]\n>e1 <- as.numeric(x2 < 3*x1 + 10 & x1>0)\n>p1 <- sum(e1)/c\n>\n>In this code, I provide the mean and covariance while drawing the \n>bivariate random normal variables and get \"p1\" as the required \n>answer. The problem is that I have to draw at least 100,000 \n>bivariate random normals to get a reasonable answer; even then it is \n>not very accurate.\n>\n>Is there some other way to do the same thing more accurately and \n>more efficiently? For instance, can this be done using the bivariate \n>normal distribution function \"pmvnorm\"? Also feel free to point our \n>errors if you see one.\n\nSimple random sampling is a poor way to evaluate an integral \n(expectation). It converges on the order of 1/sqrt(N).\n\nStratified random sampling would be better, as it converges on the \norder of 1/N.\n\nEven better is product Gauss-Hermite quadrature which will give a \nvery accurate answer with a few dozen points.\n\n================================================================\nRobert A. LaBudde, PhD, PAS, Dpl. ACAFS  e-mail: ral@lcfltd.com\nLeast Cost Formulations, Ltd.            URL: http://lcfltd.com/\n824 Timberlake Drive                     Tel: 757-467-0954\nVirginia Beach, VA 23464-3239            Fax: 757-467-2947\n\n\"Vere scire est per causas scire\"\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}