{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@speedy.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "Circuit City Teams with Napster to Launch New Digital Music Service; Circuit City + Napster Will Provide Exclusive Content and New Releases Weekly", "body": "\n\n\n\n\n\nCircuit City Teams with Napster to Launch New Digital Music Service; Circuit City + Napster Will Provide Exclusive Content and New Releases Weekly\n\nRICHMOND, Va., April 20 /PRNewswire-FirstCall/ -- Building on the combination of strong offerings of both music CDs and MP3 players, Circuit City Stores, Inc. today announced that it is joining with Napster (Nasdaq: NAPS) to offer a new digital music service, Circuit City + Napster, for consumers to explore and enjoy music.\n\n            The new service will be powered by Napster's award-winning digital music subscription service and will include all the same great music discovery and community features such as personalized recommendations, message boards, and the ability to browse other members' collections and share music\n and play lists. In addition, all customers at Circuit City + Napster will enjoy continuing access to exclusive songs and new releases on a weekly basis. \n\n            Starting April 29, 2007, consumers can sign up for Circuit City + Napster at www.circuitcity.com/napster and gain unlimited access to millions of songs on their PCs and compatible digital music devices for $14.95 per month. New subscribers will receive the first month of access free of charge, along with five free song downloads. Consumers will also find information about Circuit City + Napster and the introductory offer at Circuit City stores nationwide and on Circuitcity.com. \n\n            In addition to the unlimited access that digital music subscription empowers, Circuit City + Napster customers can purchase individual song downloads at 99-cents each. Pre-paid download cards can also be purchased in- store and online in bundles of 15, 25 or 60 tracks. \n\n            \"Our goal with music and movies is to excite and inspire our customers to fully enjoy their portable and in-home electronics, and we're thrilled to enter this strategic relationship with Napster,\" said Irynne V. MacKay, Circuit City's senior vice president and general merchandise manager for entertainment. \"Circuit City + Napster will offer our customers a new avenue to find, share and delight in music. Increasingly, consumers are turning to the digital environment for entertainment and this new service will give our customers easy access to the content they want, when and how they choose to enjoy it.\" \n\n            \"We are delighted to create this new alliance with Circuit City which is one of the top destinations in the U.S. to learn about exciting, new digital entertainment products,\" said Chris Gorog, chairman & CEO of Napster. \"Circuit City's strength both in consumer electronics and as\n a music retailer should be an ideal environment to introduce Napster's industry leading music subscription service.\" \n\n            To celebrate the new digital music service, Circuit City will host an event on April 29, coinciding with the annual meeting of the National Association of Recording Merchandisers. \n\n            About Circuit City: \n\n            Circuit City Stores, Inc. (NYSE: CC - News) is a leading specialty retailer of consumer electronics and related services. The domestic segment operates through 643 Superstores and 12 other locations in 158 U.S. markets. The international segment operates through approximately 800 retail stores and dealer outlets in Canada. Circuit City also operates Web sites at http://www.circuitcity.com, http://www.thesource.ca and http://www.firedog.com. \n\n            About Napster: \n\n            Napster, the\n pioneer of digital music, offers the ultimate interactive music experience. With an expanding roster of offerings including free, Web- based music listening and sharing, subscription and portable subscription services, and an advanced mobile music platform, Napster creates better ways to discover, share, acquire and enjoy music -- anytime, anywhere. Napster is headquartered in Los Angeles, with offices in Frankfurt, Luxembourg, New York, San Diego, San Jose and Tokyo. \n\n            Source: Circuit City Stores, Inc.\n\n\n\n\n\n\n\nYou are subscribed to Napster Investor Relations\" e-mail alerts as avcooper@speedy.uwaterloo.ca.\n\n  \n          To update your e-mail and alert preferences, please click here.\n            To unsubscribe, please click here.\n\n            Napster \n            461 S. Milpitas Blvd. , Milpitas, CA 95035\n            Service provided by Shareholder.com \n\n\n\nble>\n"}