{"category": "ham", "to_address": "samba-cvs@samba.org", "from_address": "tridge@samba.org", "subject": "Rev 536: - tidied up some of the web page text in\n\thttp://samba.org/~tridge/ctdb", "body": "------------------------------------------------------------\nrevno: 536\nrevision-id: tridge@samba.org-20070612013030-v96d3dun2z2s4t5t\nparent: tridge@samba.org-20070611130323-4jb1shtg78r4wsed\ncommitter: Andrew Tridgell \nbranch nick: tridge\ntimestamp: Tue 2007-06-12 11:30:30 +1000\nmessage:\n  - tidied up some of the web page text\n  - added volker to the list of developers\nmodified:\n  web/index.html                 ctdb.html-20070601052353-vgod9lfo4an4o83j-2\n=== modified file 'web/index.html'\n--- a/web/index.html\t2007-06-09 07:15:26 +0000\n+++ b/web/index.html\t2007-06-12 01:30:30 +0000\n@@ -12,9 +12,9 @@\n using TDB for temporary data it is very easy to convert that\n application to be cluster aware and use CTDB instead.\n \n-CTDB provides the same types of functions as TDB but with the\n-difference that it is clustered and thus it appears as a TDB database\n-that spans multiple physical hosts in a cluster.\n+CTDB provides the same types of functions as TDB but in a clustered\n+  fashion, providing a TDB-style database that spans multiple physical\n+  hosts in a cluster.\n \n Features include:\n \n@@ -39,25 +39,24 @@\n \n Requirements\n \n-CTDB relies on that a clustered filesystem is available and shared on\n+CTDB relies on a clustered filesystem being available and shared on\n all nodes that participate in the CTDB cluster. This filesystem must\n be mounted and available on all nodes in the CTDB cluster.\n \n On top of this cluster filesystem, CTDB then provides clustered HA\n features so that data from the clustered filesystem can be exported\n through multiple nodes in the CTDB cluster using various\n-services. Currently this is used to export data off a clustered\n-filesystem using Samba (for SMB/CIFS) and NFS to Windows and Unix\n-clients.\n+services. Currently included with CTDB are the necessary hooks for Samba, NFS\n+  and ftp exports. Support for new service types can easily be added.\n \n TDB\n \n TDB is a very fast simple database that was originally developed for\n use in Samba. Today several other projects use TDB to store their data.\n \n-See TDB\n-README file for some description of how TDB is used.\n+See the TDB\n+README file for a description of how TDB is used.\n \n Documentation\n \n@@ -70,7 +69,7 @@\n High Availability Features\n \n The CTDB nodes in a cluster designates one node as a recovery master\n-through an election process. If the recovery master node fail a\n+through an election process. If the recovery master node fails a\n new election is initiated so that the cluster will always guarantee\n there will be a recovery master. The recovery master will\n continuously monitor the cluster to verify that all nodes contain a\n@@ -81,7 +80,7 @@\n rebuild/recover all clustered TDB database to ensure that the\n databases are consistent. Recovery typically takes between 1 and 3\n seconds. During the recovery period the databases are 'frozen', and\n-all IO operations by ctdb clients are suspended.\n+all database IO operations by ctdb clients are suspended.\n \n Is CTDB a HA solution?\n \n@@ -90,15 +89,16 @@\n CTDB alone is not a HA solution, but when you combine CTDB with a clustered \n filesystem it becomes one.\n \n-CTDB is primarily developed around the concept of having a shared cluster \n-filesystem shared across all the nodes in the cluster to provide the features\n-required for building a NAS cluster.\n-\n-Thus CTDB relies on an external component (the cluster filesystem) to provide \n-the mechanisms for avoiding split-brain and other difficult tasks.\n-\n-However, If you applications do need a clustered filesystem for all the nodes, \n-in that scenario CTDB will provide a very easy to install and manage \n+CTDB is primarily developed around the concept of having a shared\n+cluster filesystem across all the nodes in the cluster to provide the\n+features required for building a NAS cluster.\n+\n+Thus CTDB relies on an external component (the cluster filesystem) to\n+provide the mechanisms for avoiding split-brain and other core\n+clustering tasks.\n+\n+However, if you do have a clustered filesystem for all the nodes, in\n+that scenario CTDB will provide a very easy to install and manage\n solution for your clustering HA needs.\n \n IP Takeover\n@@ -135,6 +135,7 @@\n Andrew Tridgell\nRonnie Sahlberg\nPeter Somogyi\n+Volker Lendecke\n\n\n"}