{"category": "ham", "to_address": "<ted.harding@manchester.ac.uk>, <ted.harding@nessie.mcc.ac.uk>,\n   <r-help@stat.math.ethz.ch>", "from_address": "\"S Ellison\" <S.Ellison@lgc.co.uk>", "subject": "Re: [R] Allocating shelf space", "body": "Isn't this rather closely related to the (more or less classic) bin packing and knapsack problems? The 'hardness' of the problem is combinatoric (NP) and that is statistical, but the answers aren't particularly statistical. Both have been studied quite a lot for pragmatic reasons (packing products with minimal packaging etc), so there is quite a large literature out there somewhere \n\nhttp://en.wikipedia.org/wiki/Bin_packing_problem is one possible starting point.\n\n\nS\n\n>>> ted.harding@nessie.mcc.ac.uk 09/05/2007 18:23:56 >>>\nHi Folks,\n\nThis is not an R question as such, though it may well have\nan R answer. (And, in any case, this community probably\nknows more about most things than most others ... indeed,\nhas probably pondered this very question).\n\nI: Given a \"catalogue\" of hundreds of books, where each\n\"entry\" has author and title (or equivalent ID), and also\n\nIa) The dimensions (thickness, height, depth) of the book\nIb) A sort of classification of its subject/type/genre\n\nII: Given also a specification of available and possibly\npotential bookshelf space (numbers of book-cases, the width,\nheight and shelf-spacing of each, and the dimensions of any\nfree wall-space where further book-cases may be placed),\nwhere some book-cases have fixed shelves and some have shelves\nwith (discretely) adjustable position, and additional book-cases\ncan be designed to measure (probably with adjustable shelves).\n\nQuestion: Is there a resource to approach the solution of the\nproblem of optimising the placement of adjustable shelves,\nthe design of additional bookcases, and the placement of the\nbooks in the resulting shelf-space so as to\n\nA: Make the efficient use of space\nB: Minimise the spatial disclocation of related books\n   (it is acceptable to separate large books from small books\n   on the same subject, for the sake of efficient packing).\n\nAwaiting comments and suggestions with interest!\nWith thanks,\nTed.\n\n--------------------------------------------------------------------\nE-Mail: (Ted Harding) \nFax-to-email: +44 (0)870 094 0861\nDate: 09-May-07                                       Time: 18:23:53\n------------------------------ XFMail ------------------------------\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help \nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html \nand provide commented, minimal, self-contained, reproducible code.\n\n*******************************************************************\nThis email and any attachments are confidential. Any use, co...{{dropped}}\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}