{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Bernice Reese\" <ztgoqndnraw@yahoo.com>", "subject": "Las Malvinas son Argentinas!", "body": "\n\n\n\n\n\n\n\n\n\n¿Por \n          qué 25 Abriles? \nEn \n            un abrir y cerrar de ojos se cumplen 25 años de la gesta que \n            protagonizó un puñado de jóvenes, nuestros chicos, \n            los que fueron a defender un pedacito de suelo Argentino tan querido, \n            las Islas Malvinas. Ofrecieron y entregaron lo más preciado \n            que tiene un ser humano, su propia vida. Mandamos Jóvenes y \n            regresaron hombres con los ojos llenos de lágrimas ante la \n            terrible realidad del poder desmedido de sus adversarios.\nTenemos \n            una deuda muy grande con esos héroes olvidados, la sociedad \n            en su conjunto, ya que una guerra muestra lo mejor y lo peor del ser \n            humano, la paz no debería ver a nuestros héroes vendiendo \n            en los colectivos ni pidiendo dádivas por la calle.\n\nPor eso \n            queridos amigos, todos aquellos que sientan que 25 Abriles es mucho, \n            hagamos realidad la propuesta de Concreciones una ONG en serio y bien \n            seria\n\n\n\n\n¿Quiénes \n          somos? \n  Somos \n          un grupo humano conformado por gente de diferentes estratos sociales, \n          políticos, religiosos y profesionales. Buscamos una meta importante \n          casi única, la posibilidad de resarcir en gran medida la hipocresía \n          y el olvido que han sufrido esos Jóvenes comunes que se transformaron \n          en Gigantes en \"La Gesta de Malvinas”.\nConformamos \n          “Concreciones” una ONG seria sin fines de lucro que trabaja \n          fuerte y para el bien común, nos sentimos cien por cien capacitados \n          para esta tarea y nos mueve el orgullo que sentimos por esos hombres \n          que se jugaron el todo por nosotros. Hoy después de tantos años \n          y gracias a la madurez que da la experiencia, contamos con las herramientas \n          necesarias para que el éxito sea sólo el fin de nuestro \n          proyecto “Malvinas 25 Abriles”. \n\nNo podemos \n          creer que ya pasaron 25 años y el pueblo todo no haya podido \n          rendir su más sincero y justo homenaje, por tal motivo nos vemos \n          en la más grata e inmensa de las tareas, ser los portadores de \n          este sueño y mediar con ustedes para aprovechar esta gran oportunidad \n          que tenemos de revertir estos injustos 25 años\n \n\n¿Qué nos proponemos? \n\nLa \n          propuesta es clara, sencilla, transparente y ambiciosa: queremos comprar \n          un predio para allí establecer una Sede que cuente con todas \n          las instalaciones necesarias para proyectar, contener y reinsertar a \n          esos hombres en el mundo laboral de hoy. Desarrollar una ONG de gente \n          conformada exclusivamente por Veteranos de Malvinas. Una ONG que cubra \n          y atienda las necesidades básicas de sus integrantes, una ONG \n          en la que sus miembros se sientan incluidos y representados; pudiendo \n          generar puestos de trabajo a través de talleres, aulas y diversos \n          proyectos que iremos contando en la sección Paso a Paso.\nEn \n          pocas palabras construir un lugar que contará con una oficina \n          de atención y asesoramiento al excombatiente, gabinete psicológico, \n          aulas de capacitación, laboratorio informático, alojamiento \n          para excombatientes que vengan de cualquier rincón del País \n          a realizar trámites y no cuenten con los medios para hospedarse \n          en capital.\nConvocar \n          a todos los Veteranos de Malvinas que quieran participar, para que cuenten \n          con su propio lugar, capacitarlos, guiarlos y que se hagan cargo de \n          su propia ONG, para que desarrollen libremente sus propios sueños.\n  \n          Sabemos que no es fácil, pero también sabemos que no es \n          imposible. Tenemos profesionales de casi todas las disciplinas que nos \n          dan su ayuda incondicional, empresarios que quieren colaborar para este \n          hermoso proyecto sin pedir nada a cambio y lo que es más importante... \n          contamos con vos.\n\n\n\n \n¿Cómo \n            participar?\n\nTe ofrecemos \n          una pieza conmemorativa realizada con el fin de rendir homenaje a nuestros \n          héroes de Malvinas.\nCon ella \n          se entrega un certificado de autenticidad, evitando así copias \n          ilegales que desvirtúen este hermoso emprendimiento.\nNo parece \n          mucho, pero estarás realizando con nosotros una obra increíble, \n          toda una proeza social.\nMas allá \n          de un artículo, lo que estarás comprando es un pedacito \n          de participación donde tu nombre figurará en una de las \n          paredes principales de la Sede que proyectamos construir con lo recaudado.\nSomos una \n          O.N.G. que se dedica a trabajar fuerte y en serio, una Organización \n          No Gubernamental sin fines de lucro.\nPretendemos \n          realizar esta tarea para recordar, homenajear y dignificar a nuestros \n          hermanos que se jugaron la vida en nuestro querido suelo de Malvinas.\n No \n          levantamos banderas políticas de ninguna clase, por eso podemos \n          resolver con más dinamismo la problemática de los excombatientes, \n          pues hasta hoy siguen peleando por sus derechos después de 25 \n          años.\n\n\n\n\n\n\n\nCOMPRE \n          NUESTROS PRODUCTOS AQUI\ncontactenos \n          a : malvinas25abriles@gmail.com\n\n\n\n \n\n\n\n"}