{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Nathanael Nerode <neroden@fastmail.fm>", "subject": "Re: Bug #383316: Derivative works for songs", "body": "Francesco Poli wrote:\n>We must determine what is the preferred form for making modifications to\n>the song.  I'm not sure an Ogg Vorbis + MIDI form qualifies...\n\nWhat sort of modifications?\n\n...Actually, a concept from copyright law may help here.  There are \n*two* copyrights on any given recording.  One is the copyright on the \n*song*, which applies to the sheet music as well.  The other is the \ncopyright on the *recording*, which is represented by a P in a circle, \nnot by a C in a circle.\n\nI believe that for a recording to be DFSG-free, we need *both* \ncopyrights to be licensed in a DFSG-free manner.\n\nFor modifying the *song*, the preferred form is almost certainly sheet \nmusic or the equivalent.  MIDI files are actually very close to sheet\nmusic, conceptually, since they consist of instructions of the form \n\"play this note on this instrument at this volume; wait this long;...\" \netc.  Modification for the *song* generally consists of making a new\nsong with a related melody or lyrics but different harmony or structure. \n\nFor modifying the *recording*, the preferred form is likely the \nrecording itself.  Overdubs, post-processing, and sampling \nare common ways in which derivative works are made from a a *recording*.\nFor this purpose, an Ogg Vorbis is likely to be exactly right.\n\nSo I believe we want to have both the Ogg Vorbis and the MIDI, and that\nprobably really is the source.  (Unless there's a higher-quality master\nrecording and the Ogg Vorbis is a lower-quality version, or the MIDI \ndoesn't actually contain all the data in the sheet music, etc.)\n\nNow, it would be preferable to be able to regenerate the \nrecording from the MIDI.  Which would mean including the \nsoundfonts (instrument descriptions, basically) used.  So the question \nof whether *they* are free is also important.  Here's a legal question: \nDo you need a copyright license for the soundfont in order to distribute \nor modify the recording made using them?  If not, then even if they \naren't free, I think we can consider the song and the recording \nDFSG-free.  If you *do* need such a license, I think if the license \nallows total unrestricted distribution and modification of recordings \nmade using them, again the recording would be free.\n\n(Many pardons if my understanding of MIDIs and soundfonts is inaccurate.\nThis is the impression I've picked up.)\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}