{"category": "ham", "to_address": "\"General Copyright Discussions \\(questions, organizing,\n\t\\ etc\\)\" <discuss@list.digital-copyright.ca>", "from_address": "Joseph Potvin <jpotvin@linuxmail.org>", "subject": "Re: [d@DCC] Bill C-59 currently being \"debated\"", "body": "RE: \"the process by which it came forward.\"\n\nIt was in that context that I meant it.\n\njoseph\n\nRussell McOrmond wrote:\n> Joseph Potvin wrote:\n> \n>>Is there anyone in the Senate who particularly cares about new media and \n>>new business models for digital works?\n> \n> \n>    The problem here isn't the content of this specific bill (which isn't \n> really bad), but the process by which it came forward.  The same \n> lobbying tactics may be successful in getting extremely harmful bills \n> brought forward and fast-tracked without consultation or debate.\n> \n>    The Senate has its hands full with other bills (including the budget \n> bill), and it is highly unlikely they will debate it at all.\n> \n>    The Government wants to prorogue rather than recess for the summer as \n> they want to Kill Bill C-30 (the by-committee revised Clean air and \n> Climate Change act).  If they prorogue then this causes all unpassed \n> bills die on the order paper, meaning all government and private members \n> bills would have to be re-introduces and the Conservatives don't want \n> there to be a climate change act.\n> \n>    Some Liberal members of the senate have said they will delay the \n> budget bill to force the Conservatives to recess, allowing them to pass \n> the budget without this immediately killing C-30.\n> \n>    This is all typical procedural trickery that the Conservatives are \n> into.  I've seen them pull some pretty nasty fast ones, including last \n> Friday when they tried to pass the budget through a loophole that \n> involved a motion changing the order of business after most \n> parliamentarians were already heading back to constituencies. \n> Fortunately this one was caught (people running back into the house who \n> were otherwise heading for a plane).  Pretty dishonest stuff, but not \n> stuff the general public would understand -- and thus stuff they can get \n> away with without voters getting upset.\n> \n>    I wonder how much of this was in their controversial Handbook they \n> created to describe how to manipulate parliament and committees.\n> \n> BTW: I'm not wanting to pick on the Conservatives.  At least old-school \n> Liberal members are generally honest about their hatred for the Internet \n> and new media/new economy.   The Conservatives seem to rather avoid \n> answering controversial questions and prefer to use procedural trickery.\n> \n>    Hard to stick to being non-partisan with some of what I observe every \n> day with the federal parliament.\n> \n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}