{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"John McCann\" <lists@jamsite.us>", "subject": "Re: Wireless Router", "body": "After my venerable linksys befw11s4 started losing it this past weekend, I \nreceived just yesterday my new linksys WRT54GL, which came highly \nrecommended, and so far, I am quite impressed. The latest firmware is \n4.30.9, but I understand that there's lots of GPL tweaks and such that are \navailable for this router.\n\nJohn McCann\n\n----- Original Message ----- \nFrom: \"Dawes, Stephen\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Friday, June 08, 2007 10:05 AM\nSubject: Wireless Router\n\n\n> This is slightly off topic, but I am looking for opinions on which\n> wireless router to purchase.\n>\n>\n> Steve Dawes\n> Phone: (403) 268-5527\n> Email: SDawes@calgary.ca\n>\n>\n>\n>\n> NOTICE -\n> This communication is intended ONLY for the use of the person or entity \n> named above and may contain information that is confidential or legally \n> privileged. If you are not the intended recipient named above or a person \n> responsible for delivering messages or communications to the intended \n> recipient, YOU ARE HEREBY NOTIFIED that any use, distribution, or copying \n> of this communication or any of the information contained in it is \n> strictly prohibited. If you have received this communication in error, \n> please notify us immediately by telephone and then destroy or delete this \n> communication, or return it to us by mail if requested by us. The City of \n> Calgary thanks you for your attention and co-operation.\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n> __________ NOD32 2318 (20070608) Information __________\n>\n> This message was checked by NOD32 antivirus system.\n> http://www.eset.com\n>\n> \n\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}