{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTHURSDAY 19 APRIL 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER CAROL RUBRA\n\t\t\t\t\t\n\t\t\t\t\tHello, \n\n\n\nVIRGINIA SHOOTINGS\n\n\nFor the relatives and friends who have been struggling to understand why a student was able to shoot 32 students and teachers at Virginia Tech University, the news that the gunman had prepared a video and sent it to a US television network must have been a horrific twist in events. \n\n\nQuestions continue over whether Cho Seung Hui should have been given more psychiatric help early on and whether the killings could have been prevented. Added to that now are questions over whether the video should have been broadcast at all: the police handling the investigation say it shouldn't have been. We'll be discussing the issues.\n\n\n\nALBERTO GONZALES\n\n\nUS Attorney General Alberto Gonzales is being questioned today by the Senate Judiciary Committee over his controversial decision to sack eight US attorneys who, allegedly, showed insufficient \"loyalty\" to the Bush administration. The question for his boss, George Bush, is whether he can keep his loyal Attorney General amid the growing pressure to fire him. Laura Trevelyan will have the latest from the hearing. \n\n\nCALLED TO ACCOUNT\n\n\nShould Tony Blair be called to account over the war in Iraq? The Guardian correspondent, Richard Norton Taylor, asked two top lawyers, Philippe Sands QC for the prosecution and Julian Knowles for the defence, to interview 12 witnesses, including former cabinet ministers and civil servants, to assess whether the prime minister should be indicted for the war crime of aggression. He turned their findings into a play, which opens tonight. The two lawyers will debate the case for and against on the programme.\n\n\nROAD SAFETY\n\n\nEvery day, one and a quarter million people are killed on the world's roads, and 50 million are injured.   Most of the victims are in the world's poorer countries. \n\n\nAhead of the first ever UN global road safety week, we follow a road safety campaigner from India - himself paralysed in a road accident - as he travels to India and Brazil to find out if anything can be done to halt the rise in deaths on the roads.\n\n\nJoin us at 10.30pm.\n\n\nCarol\n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nBODY PARTS\n\n\t\t\t\t\t\t\tEthical questions of patient consent after revelations former Sellafield staff had organs removed after death\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}