{"category": "ham", "to_address": "sugar@laptop.org", "from_address": "\"Shankar Pokharel\" <memshankar@gmail.com>", "subject": "[sugar] Fwd: OLPC Nepal looking for Volunteers for this Summer", "body": "---------- Forwarded message ----------\nFrom: Bryan Berry \nDate: May 3, 2007 6:54 AM\nSubject: OLPC Nepal looking for Volunteers for this Summer\nTo: devel@laptop.org, games@laptop.org, olpc-open@laptop.org\n\n\nfrom: http://olpcnepal.blogspot.com/2007/05/were-looking-for-volunteers-for-this.html\n\nAs you may read in the previous Post \" An Amazing Educator,\" a\nfantastic educator has joined our group. We are looking to work with\nher very intensely this summer to implement many of her existing\nlearning activities and add as many cool activities as we can. In the\nfall we plan to visit many, many schools to figure out how kids and\nteachers react to these materials.\n\nRight now we have three full-time volunteer developers, all of them\nNepali. We would love four (4) foreign volunteers to come work with us\nthis summer in Kathmandu. We will pair each foreign volunteer with a\nNepali intern. That should bring our content strike force to 11\npeople. That would really help us to advance OLPC in Nepal.\n\nRequirements:\nWe are looking for experienced programmers. Your age and # of\nuniversity degrees are less important to us than your passion for\nsoftware development. We seek individuals with significant software\ndevelopment experience on Linux, ideally in Python, PyGames, C, etc.\nYou should have already run the OLPC image in an emulator.\n\nYou should expect to stay in Nepal for a minimum of 6 weeks. You can\nstay a maximum of 5 months due to Nepal's complex visa rules. If your\napplication is selected, you can start as soon as you can get here.\n\nCompensation:\nWe are prepared to offer a generous salary package of $0 per month,\nreimburse you for a full 0% of your airplane ticket cost, and offer no\nhealth plan. We don't have any $ :) Our office, bandwidth, and\ncomputers have all been donated. We can offer comfortable lodging for\na total of four volunteers. We can accept additional volunteers if\nthey are willing to find and pay for their own accommodation.\n\nWe can offer you an opportunity to work w/ a very passionate team of\nengineers on one of the most exciting projects in the world. If you\nare interested please send an e-mail with your C.V. and a brief\ndescription of what you have done w/ OLPC so far to bryan at olpcnepal\ndot org\n\nUnfortunately, summer is monsoon season so Nepal aweseome trekking\nisn't a good idea. Still, it's been a weird year weather-wise. We'll\ntry to get you out for a trek near the end of the summer.\n\nWe'll take you running/hiking in the hills surrounding Kathmandu if\nyou are so inclined and subject you to Ankur's bad jokes (and they are\nvery bad).\n\nThe Work:\nYou will work closely with our lead developers Shankar, Ankur, and\nHimali Kiran and our lead educator Christine Stone. You will help\nimplement a series of activities based on PyGame and/or GCompris. That\nmeans writing a lot of Python, possibly some C, working with sound\nlibraries, and more. If you have some exciting ideas for power\nmanagement or mesh networking, we may find some time to work on them\nw/ you. However, you should expect to spend most of your time building\nSugar activities, getting feedback from Christine, revising, showing\nto kids and teachers, repeat.\n\nWe will expect you to train the Nepali intern assigned to you. The\nintern will most likely be an undergraduate computer science student.\n\nThe development team will frequently interact with kids and teachers\nover the course of the summer.\n\nWe intend to recruit education volunteers at a later date. I'll save\nthat for a future blog entry.\n\n-- \nBryan W. Berry\nVolunteer\nOne Laptop Per Child Nepal\nwww.olpcnepal.org\n_______________________________________________\nDevel mailing list\nDevel@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/devel\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}