{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Radical NetSurfer <radsurfer@yahoo.com>", "subject": "DecTalk PC Reading Program", "body": "I just wanted to pass along the news of an interesting\nprogram I have started developing in CentOS 5...\nthis comes after being able to get my ISA Dectalk PC 2\ncard working flawlessly in the 2.6 linux kernel.\n\nthe new program I am designing is written in gcc and\nuses ncurses, and runs from a terminal.\n\nThe program is designed to read any ordinary ascii\ntext file, you can pause and resume in real time, you\ncan move forward 10% to 90% using the 1 through 9\nkeys, 0 key rewinds the file to the start.\nPressing T while the file is read will insert into the\ntext to speech stream the percentage into the file you\nare at, and the amount of minutes that have been used\nreading. (takes a moment for it to be heard, but not\ntoo long).\nIn order for the keyboard commands to be obeyed, of\ncourse, the terminal window must have the focus.\nncurses must be linked into the program to provide\nkeyboard support.\nThe program also displays the line number and\npercentage into the file on the screen as the actual\ntext itself is fed into Dectalk.\n\nSo far, I have read the Diane C. startrek novel\n\"Final Frontier\", an excellant T.O.S. startrek novel,\nand had no problems at all following every detail.\nAfter this book, if you're a startrek fan, read\n\"Best Destiny\" about how James T. Kirk actually became\ncaptain, if you follow the novels.\n\nI imagine with some minor effort, this program could\nbe adapted to Doubletalk ISA card as well, although\nit's not a high priority for me right now.\n\nThis is the best program I have ever seen for the\nDectalk, and not too shabby for a deprecated peice of\nhardware, lol.\n\nInquiries should be sent to RadSurfer@yahoo.com\n\n//Rich//\n\n\n__________________________________________________\nDo You Yahoo!?\nTired of spam?  Yahoo! Mail has the best spam protection around \nhttp://mail.yahoo.com \n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}