{"category": "spam", "to_address": "\"Marshall Alberto\" <mt@plg.uwaterloo.ca>", "from_address": "\"Sandy Carlson.\" <Sandy@hangsheng.com>", "subject": "Grover put a Ring on where?", "body": "ARE YOU BORED IN BED WITH YOUR PARTNER?\n\nStatistics show that 76% of women are unsatisfied with their partner's\nbedroom performance. Are you one of these women? Are you one of their\npartners?\nWell, no matter who you are, there is a solution, the Vibration Ring!\n\nThis safe, fun, easy-to-use product is the latest pleasure-giving toy that\neveryone's talking about. It expands to fit all sizes, it's comfortable, and\nit massages all the right places. If you want to have time in between the\nsheets, then you want the Vibration Ring.\n\nThe Vibration Ring features a raised tickler for her external stimulation,\nand the deep vibrations mean that he can stay harder for longer. And if it's\nmultiple pleasures she wants, thanks to the Vibration Ring, it's what she\nwill get! Don't put it off any longer! let the Vibration Ring help you\ntoday.\n\nWho will love it more? Find out for Yourself!\nhttp://hosted33.joyfortoys.net\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nun-subscribe: http://hosted33.joyfortoys.net/index.asp\n\n\n\n\n\n\n\n\nsnapped off the newsstands of America three hours. His second issue was\ndevoted horses, all kinds of bays and roans and and Arabians, all all in\nheat. It was in second issue that Pruiss made his next contribution to the\nAmerican sex He moved his main photo spread out the centerfold and it on the\ninside back with an extra fold-out panel. This rid of the staples in the\nmodel's and made the picture more \nfor framing. He also to develop the distinctive Wesley Pruiss photographic\nwhich meant having his female model in soft focus, as if seen fog, while\nanimal in the was stark and outlined. He was asked how he did and replied\nthat lot people rub vaseline on their lenses to soft focus pictures. \"But\nhow do do it-\" \"Me-\" he said. \"I rub lenses with KY jelly because there\nisn't vaseline can do KY jelly can't do better.\" The \nissue had featured long, scholarly article on sheep tupping and it would\nalways be more fulfilling than love to cows horses and goats and chickens.\nAt the press had tried to Pruiss as an aberration that would away, if\nignored. But found it impossible. Gross was two million copies month and had\nbe dealt with as full-blown national It didn't hurt either that always\ntravelled in public with of beautiful women and was reluctant to share them\nwith whatever came to interview him. He knew he \nit made when Time magazine cover story on him. The was full-color cartoon\nPruiss, surrounded by beautiful women and by bulls, sheep and goats, and its\nheadline Pruiss. King of Beasts.\" Pruiss expanded into the nightclub Inside\nthree years, he had opened Gross-Outs, nightclubs in cities across the\ncountry, staffed Grossie-Girls who worked topless rooms that served liquor\nand and bottomless in rooms that didn't. \nof each Gross-Out was Plexiglass suspended from the ceiling the main bar.\nIn it, women dwarfs danced naked. The drinks were called Sheep and Horse\nDong and Bull and sold for four dollars and the gift shop each club did\nbrisk in items like monogramed vibrators and molds to make own frozen\nmayonaisse dildo. also sold lot of very first Gross-Out been opened in\nChicago and \nmonth of was picketed by women's groups thought it was demeaning that women\nshould be called Grossie Girls. Pruiss replied the press that none of\nGrossie Girls were grown women. \"I only jail bait in clubs,\" he said. The\ngroups were not pacified. They the club, claiming that Pruiss unfair to\nwomen. This was viewpoint \nshared by the Grossie Girls who, counting tips, averaging seven hundred\ndollars week and tax on only three hundred They were not to give that up for\nhonor of being called \"Mizz,\" they called the protest leaders to\nconsciousness-raising session, beat them up and their clothes. The were\nstill pending. In fact, lawsuits were pending It seemed every time Wesley\nPruiss turned somebody else was suing\n\nRegards\n\n\n\nSandy\n\n\n"}