{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "AN EXCLUSIVE CBS NEWS INVESTIGATION:  THOUSANDS OF KATRINA VICTIMS ARE STILL IN FEMA TRAILERS....ARE THE TRAILERS TOXIC?", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nQUOTE OF THE DAY\"If only we'd stop trying to be \n      happy we could have a pretty good time.\" - Edith Wharton \n      \n\n\n\nDID YOU KNOW?\"Second string,\" meaning \"replacement \n      or backup,\" comes from the middle ages. An archer always carried a second \n      string in case the one on his bow broke. \n\n\n\nTONIGHT ON THE CBS \n      EVENING NEWSHere is an early preview of what we \n      are planning for tonight's CBS EVENING NEWS from Anchor and Managing \n      Editor, Katie Couric... Hi everyone, August marks \n      the two-year anniversary of Hurricane Katrina but at least 86,000 families \n      are still living in those white FEMA trailers along the Gulf Coast. While \n      FEMA may have helped shelter a lot of families, our investigative team has \n      discovered that the trailers may be toxic to the people who call them \n      home. Investigative Correspondent Armen Keteyian will report. \n      Sharyl Attkisson is also reporting from the Gulf Coast. \n      Tonight she'll have an update on New Orleans and the surrounding area - \n      how far has it really come since Katrina? In South Carolina last \n      night, Republican presidential candidates took the stage for their second \n      debate. As our senior political correspondent Jeff Greenfield will \n      report, there were more than a few sparks. He'll have the highlights. \n      In health news, we'll look into the Internet and its growing role \n      as a place to find prescription drugs. But, as Wyatt Andrews will \n      report, much of that buying and selling is done illegally without \n      prescriptions - so much that it is catching the attention of legislators \n      on Capitol Hill. Younger and younger kids are using cell phones - \n      and parents are paying the price as kids ring up big bills for games, \n      ringtones and other electronic accessories. The catch: kids don't need a \n      parent's go-ahead before adding charges their bill. Richard \n      Schlesinger will have the story as well as some solutions. \n      Finally, we've got a story about possible Irish roots popping up \n      in an unlikely spot in American politics. According to members of one \n      little church on the Emerald Isle, records show a potential genealogical \n      connection to the 2008 presidential race. I'll give you a hint - \n      his surname isn't O'Malley or O'Connor, but it does start with an \"O.\" \n      I hope you'll join us, Katie For \n      more information on these stories, please click on the following \n      links: Brits Nix Prince Harry Iraq Tour Click \n      Here GOP Candidates Sharpen Their Attacks Click \n      Here And here's a look at one of the stories we're working \n      on for Thursday's broadcast: Credit card companies are now \n      targeting HIGH SCHOOL KIDS...getting them hooked on PLASTIC. Part of our \n      series Gotta Have It: The Hard Sell to Kids. This story and much \n      more, Thursday, on the CBS Evening News. If you \n      would like more information on any of these stories or the broadcast, \n      please click on the following address and e-mail us: evening@cbsnews.com \n\n\n\nTONIGHT ON DAVID \n      LETTERMANJoin Dave tonight on The Late \n      Show with actor Ricky Gervais AND actress Mary \n      Lynn Rajskub... Also, don't miss a Top Ten List presented by The Price \n      Is Right host Bob Barker. Plus, musical guest Mavis Staples! \n      \n\n\n\nTHURSDAY MORNING \n      ON THE EARLY SHOWHarry Smith, Hannah Storm, Julie \n      Chen and Russ Mitchell anchor THE EARLY \n      SHOW from New York. Dave Price will \n      bring us the weather Along with the top news of the day, we \n      will also have the following stories: GOTTA HAVE IT: ALPHA \n      MOMS: The \"Alpha Mom\" is educated, affluent and in charge. She sets \n      the trends, and controls over $500 billion dollars of total spending. That \n      is why companies are so interested in targeting \"Alpha Moms\" with their \n      products. As we continue our series Gotta Have It, we'll see why \n      these mothers may be influencing the way YOU spend. EARLY SHOW National Correspondent Tracy Smith will have details. \n      FAREWELL TO BOB BARKER, PART 2: Bob Barker's final \"Come on \n      Down\" is coming up fast. But before he leaves The Price is Right \n      for good, Bob will be honored Wednesday night with a prime time special, \n      looking back at a half-century of work on the small screen. EARLY \n      SHOW National Correspondent Hattie Kauffman finds out what \n      Bob is leaving behind: the adoration of game show contestants from across \n      the nation. JUST ASK A WOMAN. . . ABOUT HER LOOKS: \n      Wednesday morning we continue our Just Ask A Woman series by \n      looking at women and beauty. In fact, the anti-aging industry reportedly \n      racks in over $50 billion dollars a year in sales. EARLY \n      SHOW Contributor Mary Lou Quinlan will \n      join us with more. PET PLANET: GENTLE BARN: A California \n      woman has devoted her life to rescuing abused and unwanted farm animals \n      and giving them a second chance. But she's not stopping there. Those \n      animals are now helping children with troubled lives of their own. The \n      result is pretty amazing. Our resident veterinarian, Dr. Debbye \n      Turner will share with us in Wednesday morning's Pet Planet. \n      ANTONIO BANDERAS ON SHREK THE THIRD: When Spanish \n      heartthrob Antonio Banderas made his Hollywood film debut in 1992's \n      Mambo Kings, he didn't speak any English. Now he supplies his voice \n      to the ever so suave Puss In Boots, who returns in the new animated film \n      Shrek The Third. Wednesday morning, Antonio will join us to discuss \n      the latest Shrek film. NEW YORK LIBERTY: WNBA players Shay \n      Doron, Tiffany Jackson, Jessica Davenport, and the NY Liberty Mascot will \n      join us to talk about the upcoming season. We'll shoot some hoops with the \n      basketball stars out on our plaza. BILL GEIST ON WAY OFF THE \n      ROAD: For twenty years, Bill Geist has delivered the big news \n      from some of America's smallest towns. And, the Correspondent best known \n      for his reporting for CBS News' Sunday Morning, has often taken us on quite an adventure. From flying with a \n      paperboy pilot, to challenging a watermelon champion speed eater, these \n      exploits and many more are featured in Bill's new book, Way Off The \n      Road: The Peculiar Charms of Small-Town America. Monday morning, Bill \n      will join us for more on his adventures and his latest book. \n      BOBBY FLAY'S HOT DOGS: Summer is the perfect time to fire \n      up the grill and take advantage of the weather by cooking outside. Whether \n      you are cooking for two or for a Memorial Day weekend get-together, \n      grilling delicious favorites is quick and easy. How can you make the best \n      tasting ballpark frank right at home? Our resident chef Bobby Flay \n      will join us for a special taste of summer hot dogs. CSI \n      PREVIEW: The nail-biting season finale of CSI airs Thursday \n      night. The CSI team is closing-in on the so-called \"Miniature \n      Killer,\" with Grissom going as far as making his OWN \"miniature\" to get \n      inside the murderer's mind. Thursday morning, we'll get an exclusive \n      \"sneak peek\" from the episode in which the team gets a surprising clue \n      into the killer's identity. If you would like more information on \n      any of these stories or the broadcast, please click on the following \n      address and e-mail us: earlyshow@cbs.com \n\n\n\n \n\"THAT'S THE WAY \n      IT IS: CELEBRATING CRONKITE AT 90\" FRIDAY, MAY 18TH (8-9pmET/PT)\nThe world is a very different place than it was in the 1960s and \n      '70s when one voice seemed to speak for all Americans and, in so doing, to \n      bind the nation together. That unique and iconic voice was, of course, \n      Walter Cronkite's. CBS News will celebrate the legendary newsman's \n      singular life and career in a CBS News primetime special, \"THAT'S \n      THE WAY IT IS - CELEBRATING CRONKITE AT 90,\" to be broadcast \n      Friday, May 18th (8:00-9:00 PM, ET/PT) on the CBS Television Network. \n      \n\n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help \n      | Advertise | Terms \n      of Service | Privacy \n      Statement©MMVII, CBS Interactive Inc. All Rights Reserved. \n      \n"}