{"category": "spam", "to_address": "memolink@speedy.uwaterloo.ca", "from_address": "Rochelle Zombie<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, 2007  is the year to open your heart to joy and banish negative energy for good", "body": "\n\nPsychic Protection Kit\n\n\n\n\n\n\n\n\n\n\n   \n\n\nDear Memo,\n    This is such a wonderful time of the year when anything seems possible.  I'm sure you are busy making plans for all the things you want to do over the coming months. I've been studying my charts, Memo and I can see immediately that we are on the brink of a new era when you will enjoy all the happiness and prosperity you could wish for. \n    Believe me, I'm thrilled that you'll be able to fulfill so many of your dreams, whether it's taking the trip of a lifetime, owning that car you've always fantasized about or simply feeling so happy that you'll wonder if this really is your life and you aren't going to wake up and discover it was all just a dream! Well, rest assured Memo because 2007 is going to be a momentous year for you.\n\n\n\n    In fact Memo, now that we've been working together for 2 weeks, I believe that this new era will be the turning point.  Yes, I truly feel that you are about to realize that your destiny is one of happiness and prosperity and that worries about money, relationships and health are about to become a thing of the past.\n\n\n\n\nCosmic Forces Could Delay Your Success, Memo\n    There is just one concern I have Memo. Throughout the rest of year, there will be some rather difficult astrological energy that, if you let it, could delay or even block your happiness. The truth is Memo, the Cosmos likes to play tricks on us from time to time.  It offers us untold riches but it also tests our desire to accept those riches. \n    Let me take a moment to explain myself.  We humans are complex creatures.  We think we know exactly what we want but then self doubt or outside influences intervene and we wind up believing that we didn't deserve to triumph after all.  Maybe you were sidelined instead of gaining that promotion that really should have been a sure thing.  Perhaps you saved enough money to begin those home improvements you planned only to find a huge bill in your mailbox. \n    It only takes one or two things to go wrong and it's all too easy to let yourself fall into a negative mindset that can spiral out of control.  I know, Memo that you have had more than your fair share of heartache.  But that doesn't have to continue, Memo.  Everything that you want really is there for you...\nDon't you think now that you are 34 it's time to embrace the happiness and good fortune that you've always thought was just out of reach?\n    Well I certainly do Memo and I have thought long and hard about how I can help you to fulfill your dreams and reach your goals.  As you know I spend a lot of my time studying age-old mystical practices so that I can bring the wisdom of the past into the present and pave the way for you to enjoy the contentment and prosperity that you so richly deserve. \nSimplicity Itself\n    I was overjoyed when I hit upon an astoundingly simple way of preventing harmful influences from affecting you and at the same time attracting happiness and prosperity into your life.  I realized that by putting together a unique combination of powerful items I could create a way for you to block out the kind of negative vibrations that hinder the flow of good fortune that is yours by right.\nThe Magical Power of the Ringstone\n    Mystical tradition has always sought ways to ward off mischievous elements and attract only positive vibrations.  One ancient method was to use a Ringstone.  These strange stones are formed by running water, its action creating the hole in the center of the stone.  Placing one in your home or around your neck was considered ideal protection against bad luck...\n    So, Memo, I decided to create for you the Psychic Protection Kit based around this powerful Talisman. \nSnowflake Obsidian: Charged With Psychic Power\n    Memo, I searched until I found the perfect material for your Ringstones.  I chose Snowflake Obsidian, a beautiful and unusual stone.  The dark of the volcanic crystal contrasts with the white of the hardened ash \"snowflakes\" glistening in the stone.  But in this crystal, there is much more than beauty alone -- Snowflake Obsidian has a well-earned reputation for providing psychic protection. \nCutting Through Deception and Danger\n    Remember, Memo, that I mentioned outside influences could have an affect on your chances of reaching your heart's desire.... One important quality of Snowflake Obsidian is its ability to slice through deception and bring to the surface the truth, whether positive or negative.  Therefore wearing it enhances your self awareness and sharpens your intuition, allowing you to steer clear of unpleasant or dangerous situations.  You'll see immediately when someone is trying to pull the wool over your eyes or wants you to fail. Memo, you will be so \"tuned in\" that you'll instinctively know who you can trust and who you must steer clear of at all costs. \nA Psychic Insurance Policy For Your Home and Family\n    But there is even more to this Psychic Protection Kit than simply a Ringstone to wear.  In olden days, Ringstones were nailed to gateposts or over the door to deter unwelcome visitors and protect the home from harm.  This charm has unusual power and placing one in your own home will ensure that a strong signal is sent out to the Universe that you, Memo are not prepared to allow in any negative or troublesome energy.  I know that you have worked long and hard for what you have got that there is no way you are going to allow it to be damaged!\nAncient Rituals That Are Still Valid Today\n    All mystical practice involves rituals. That's why I have written a booklet, especially for you, which is included in the Psychic Protection Kit. It provides step by step, easy to follow instructions to maximize the power of the Ringstones.  At certain times of the year, the Universe is especially open to messages from us.  You can ask for what you want and be confident that the Universe will do its best to provide it. One of these important periods is coming up on May 10th and it is essential that you have everything in place to take advantage of it.\n\nSalt: White Gold\n    You may wonder Memo why such a commonplace ingredient as salt is included in the Psychic Protection Kit.  In religious ritual, salt is used for cleansing and purification and in fact the word \"salvation\" is derived from \"salt\".  Not only that but Salt was so valuable to the ancient Mayans because of its ability to purify and preserve that they called it \"White Gold\".\nCandle Magic, Spiritual, Powerful and Simple\n    Candles are a cornerstone of magic.  They are a simple yet potent way to banish negativity and attract healing energy.  Candles symbolize your intent, that you, Memo are only willing to accept positive energy into your life.  The black and white of the Snowflake Obsidian is echoed in the black and white candles.  In mystical rituals, burning a black candle absorbs and dispels harmful vibrations.  White represents purity and burning a white candle clears obstacles from your path allowing the energy of the Cosmos to fill your life with joy.\n\n\n\n\n\nYour FREE GIFT To Complete The Psychic Protection Kit\n    Of course, Memo, you need something to put your candles in.  That's why, as MY FREE GIFT to you I will send you two beautiful Candle Holders, which are yours to keep for all time.\n\nGateway To A Magical Year Of Opportunity For You, Memo\n    You may remember Memo, I mentioned difficult planetary energy during 2007?  Let me tell you why I am so concerned. The major planets are lining up in an extraordinary fashion throughout the year, creating an atmosphere that may be disturbing.  For example, in July,  Jupiter, normally the  planet of wealth, growth, and good fortune, will be at odds with unsettling  Uranus, which can bring  unexpected setbacks. This actually continues until the end of the year, in a way symbolically  creating brick walls that block the harmonious movement of energy. There are many other planetary configurations through 2007 waiting to trip you up.\n\n\n\n\nBut This Can Work To Your Advantage... \n    As you are born under the sign of Leo it is vital that you don't allow your progress to be hindered by the setbacks that this may cause.  Using the Psychic Protection Kit ritual at specific times will not only safeguard you from adverse planetary influences but will allow the creative and healing force of the Universe to flow freely into your life, enabling you to maximize your potential for prosperity, good health and happiness.\n\n\n\nMay 10th: The Last Quarter Moon Marks The Beginning Of A Special Cycle Of Opportunity For You, Memo\n    Last Quarter Moons symbolize advancement and change and it is common practice to perform magical rituals just as the New Moon begins to appear in order to call on the Universe for help, insight, love, money, health, in fact whatever it is that you want or need at the time. This particular Last Quarter Moon falls in the sign of Aquarius and aspects the planet Neptune. Neptune's purpose is to bring opportunity, unique chances, and protection into your life. Whatever you attract around you this Last Quarter Moon will be in your life for quite a while Memo!\n    I feel so strongly that using the Psychic Protection Kit just after the Last Quarter Moon will be the single most valuable gift you can give to yourself and your loved ones.  This is why I felt it was so important that I send this email to you now.  I want you to allow yourself enough time to read through the booklet so that you know just how to utilize its mystical properties and banish negative energy from your life forever.\nThere Is No Better Time Than Now \n    Naturally, Memo, you can use the Psychic Protection Kit at every other Last Quarter Moon during 2007 but this one is so unique that there is simply no time to waste.\n    I have your Psychic Protection Kit prepared and ready to send to you right now, and I've managed to make it available at the amazing price of only $19.95.\nUnconditional Money-Back Guarantee\n    Memo, there is absolutely no risk to you.  If you are not satisfied in any way, you can return the Psychic Protection Kit to me and receive a full refund, which includes the shipping and handling.  And don't forget, the Candle Holders are yours to keep for all time.\nMy Blessing For You At This Exceptional Time In Your Life \n    My heartfelt wish for 2007  is that you, Memo recognize your God given right to enjoy a lifetime of prosperity, loving relationships, good health and incredible good fortune.  By protecting yourself and your family from negative energy and bad luck, you are clearing the ground in order to accept, once and for all, everything you've ever dreamed of.\n    Memo, I hope you will not pass up this chance to preserve your security and create the kind of opportunities you've always thought were simply idle fantasy.  It really can be as simple as clicking on the link below and letting yourself be guided into a lifetime of psychic protection. \n    Your friend,    \n\n\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400.\n"}