{"category": "spam", "to_address": null, "from_address": "lyno123@planet.nl", "subject": "CONGRATULATIONS.............YOUR EMAIL HAS WON!!! KTU/9023118308/07", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             UK NATIONAL LOTTERY        \nThe National Lottery P O Box 1010Liverpool, L70 1NLUNITED KINGDOM (Customer S ervices)Ref: UK/9420X2/68Batch: 074/05/ZY369\nFax :+(44) 870 4714089\n \nWINNING NOTIFICATION 2007We happily announce to you the draw (#1187) of the UK NATIONAL LOTTERY,online Sweepstakes Easter  Bonanza and as part of our International program held on  Friday 11th May  2007.Your e-mail address attached to ticket number: 56475600545188 with Serial number 5368/02 drew the lucky numbers: 08-09-19-34-47-49 (with bonus ball 04)which subsequently won Five(5)of you the Rollover prizes of £4,337,270.Therefore you have been approved to claim a total sum of £867,454 (Eight Hundred and Sixty-Seven Thousand,Four Hundred and Fifty-Four Pounds Sterlings) which is equivalent to 1,623,002.01 USD in cash credited to file KTU/9023118308/07All participants for the online version were selected ra ndomly from the World Wide Web through a computer draw system and extracted from over 100,000 unions, associations, and corporate bodies that are listed online.For security reasons, you are advised to keep your winning information confidential till your claim is processed and your money remitted to you in whatever manner you deem fit to claim your prize.This is part of our precautionary measure to avoid double claiming and unwarranted abuse of this program be warned.\nPlease be informed that claims not processed within the stipulated period may be forfeited to the pool without further notice.Our European agent will immediately commence the process to facilitate the release of your funds as soon as you contact him. You may wish to establish contact via e-mail with the particulars presented below citing the batch and reference numbers to this letter between the hours of 8.00am - 7.30pm on Monday through SundayOverseas Claims UnitUnited Kingdom Lottery FiduciaryContact Person:Thomas ChessEmail:  transfer_manager02@yahoo.co.uk\nPhone: +44-7045705243LOTTERYCLAIMS APPLICATION FORM-C (Prize Winning Receipt)============================================================================================[FULLNAME OFWINNER]................................................................[CURRENTADDRESS]........................................... ............................[COUNTRY/REGION]............  [STATE/PROVINCE]......................................[AGE] ...........    [SEX]...................................[MARTIALSTATUS].............................[OCCUPATION].. ............................................................[CURRENTEMAIL]......................................[TEL/FAX]......................................---------------------------------------------------------------------------.                      ENTRY WINNING INFORMATION----------------------------------------------------------------------------------[ENTRYTICKET NR]....................................................................    [DRAWDATE]...........................................................................CLAIMANTSIGNATORY DECLARATION==================================== I,......................................................................................HEREBY   DECLARE THAT I HAVE NEVER  RECIEVED ANY SETTLEMENT FROM THE NATIONALLOTTERY PROMOTION PRIZE AWARDS WINNING NOR ANY MEMBER OF MY FAMILY FILLED CLAIM ON MY BEHALF TO NATIONAL LOTTERYINTERNATIONAL PROMOTION. I, THEREFORE, UK NATIONAL  LOTTERY PROMOTION PRIZE AWARDS WINNING  PROMOTION  TO ACT ON MY BEH ALF IN THE PROCESSING AND TRANSFER MY PRIZE AS INSTRUCTED BY ME. =======================================================================================Make Sure this Verification and Funds Release Form is sent to the Fiduciary agent for quick verification and funds release purpose.Our winners are assured of the utmost standards of confidentiality, and press anonymity until the end of proceedings, and beyond where they so desire. Be further advised to maintain the strictest level of confidentiality until the end of proceedings to circumvent problems associated with fraudulent claims. This is part of our precautionary measure to avoid double claiming and unwarranted abuse of this program.\nGoodluck from me and members of staff of the UK NATIONAL LOTTERY.\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAn Eynsham mother scooped a Lotto jackpot fortune of £650,000 on Sat 28thApril 2007, thanks to her dedicated grandparents. \n\n\n\n\n\n\nYou have been advised to contact your claims officer with the above contact details.Congratulations from me and members of staff of the UK NATIONAL LOTTERY.Yours faithfully,GREG STEWART (Mr.)Online coordinator for UK NATIONAL LOTTERYSweepstakes International ProgramOpen 7 days 8am-8pm                \n\n                                        \n \n                 Copyright © 1994-2007 The UK International Promotion Inc.                             All rights reserved. Terms of Service - Guideline \n                                                               77635 476378 255667460\n"}