{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"VIP Advantage VISA\" <k3z3xqld@berryoak.com>", "subject": "Your Prepaid Visa", "body": "   \nThis Card is issued by Four Oaks Bank & Trust\n\nKeep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. Keep your Money safe - No more need for Money Orders or walking around with cash in your Pocket. \n\n\n\n______________________________________________________\n\n\nTo stop receiving emails, click here\n"}