{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Deena Schwartz\" <korditecarnaw@ditecar.com>", "subject": "Achieve picture perfect weight and enjoy life", "body": "\nBecome fit and happy again\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most delighting product for corpulent people is made available now – As could be seen on Oprah.\n\n\nDo you count up all the cases when you appeal to yourself to do any thing to get rid of this desperately growing number of kilos? Fortunately, now no major offering is necessary. With Anatrim, the earth-shaking weight-reducing medley, you can achieve healthier lifestyle and become really thinner. Just look at what our customers state!\n\n\n\n\"It’s unbearably difficult to confess but I was an awful food addict. \n\n\nI greedily swallowed up all this garbige \n\n\nand just could not stop. \n\n\n\n\nThis fatal passion passed away when I started course of taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my craving for food abated, \n\n\nmood improved and I’m the happiest person in the world 22 pounds in 2.7 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person!\"\n\n\n\n\n\nAmelia B., Las Vegas\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nIt’s difficult to fancy how I detested being ridiculed at school. \n\n\n\n\nI hated my stoutness and I detested even myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nIt literally took me out of this horror! Thanks and thanks to you, guys.\"\n\n\n\n\n\nMike Brown, Las Vegas\n\n\n\n\n\n\"You know what? Anatrim kept my marriage intact! I went into the circle, depression – eating more – more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nOnce one of my friends pointed at your web site and I ordered up pack of Anatrim at the time. \n\n\nThe results I achieved were magnficent, my appetite came to admissible level, I was often in a good mood, and, certainly, I went some belt holes back. And you see me, the bedroom became cool, too!\"\n\n\n\n\n\nMike\n\n\n\n\n There is a lot of thanks happy people leave after taking Anatrim. Don’t you gonna add yourself to the tens of thousands of slender customers and take this original appetite suppressing energy raising product now!\n\n\nDo not miss your opportunity!\n\n\n\n\n"}