{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"Law Watch\" <mailings@mail.cnn.com>", "subject": "Law Watch: Legal News and Analysis from CNN.com", "body": "\n\n\n\n\nCNN.com - Law Watch\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTuesday, May 8, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEx: 'Demonic' Spector pulled gun\nA second woman has testified that Phil Spector threatened her with a gun, saying the music producer suddenly turned \"demonic\" after a party 18 years ago and tried to rape her. Spector is on trial, accused of murdering B-movie actress Lana Clarkson at his suburban Los Angeles mansion. The defense says her death was an \"accidental  suicide.\"\nFULL STORY\n\n•  Court TV: Full coverage\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNANCY GRACE Airs on Headline PRIME, 8 p.m. ET\n\"Nancy Grace\" is television's only justice-themed interview and debate show. Nancy Grace challenges guests\non the most controversial and high-profile legal issues of the day by drawing on her unique perspective\nas a former violent crimes prosecutor and as a crime victim herself.  Send your questions and comments.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMissing pants lead to big suit\nA judge got so steamed when a dry cleaner lost his trousers that he sued for $65 million. Two years later, he is still pressing the suit -- and creating controversy. The dry cleaner, a Korean immigrant, fears losing his business.\nFULL STORY\n\n\n\n\n\n\nCouple ripped off mob, got whacked\nThomas and Rosemudle Uva were not criminal masterminds. They ripped off mobsters. Predictably, this got them whacked. Now their story is at the center of the trial of reputed mob capo Dominick \"Skinny Dom\" Pizzonia.\nFULL STORY\n\n\n\n\n\n\nNew search pleases Holloway's dad\nAn Aruban attorney for Natalee Holloway's father says her client is happy to see Dutch police renew the investigation into his daughter's disappearance. Investigators dug up the yard of a one-time suspect.\nFULL STORY\n\n\n\n\n\n\nColleague suspected affair\nFellow astronauts described Lisa Nowak as smart, hardworking and a good mother, but also selfish and unwilling to perform tasks for which she hadn't trained, according to documents released Tuesday by the state attorney's office.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Law Watch email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}