{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "445p 6/6 Update: Spacewalk ends", "body": "\n\n\n\n\n445p 6/6 Update: Spacewalk ends\n\n\n\n=================================\n\nCBS NEWS Coverage of Breaking Space News\nPosted: 4:38 PM, 6/6/07\n\nBy William Harwood\nCBS News Space Consultant\n\nChanges and additions:\n\n   06/06/07 (10:30 AM): Spacewalk begins\n   06/06/07 (04:38 PM): Ethernet cable, debris shields installed; spacewalk ends\n\n=================================\n\n4:38 PM PM, 6/6/07, Update: Spacewalk ends; ethernet cable, debris panels installed\n\nSpace station commander Fyodor Yurchikhin and Oleg Kotov began repressurizing the Pirs airlock and docking module at 4:00 p.m. to officially close out a five-hour 37-minute spacewalk.\n\nThe spacewalk began at 10:23 a.m. After replacing a hull-mounted science experiment package, the cosmonauts routed a long ethernet cable along the outside of the Russian Zarya module that ultimately will permit computer commands to be sent from the U.S. section of the station to Russian control systems. They then turned their attention to installing 12 micrometeoroid debris panels on the front end of the Zvezda command module.\n\nMoving through space at 5 miles per second, the station - and spacewalkers - are vulnerable to collisions with space debris. That point was brought home today when the cosmonauts reported an apparent impact site on the station.\n\n\"How interesting. What an interesting hole,\" one spacewalker said through a translator.\n\n\"Where?\"\n\n\"Well see, this is not a hole but a dent from a meteorite.\"\n\nA few moments later, one of the spacewalkers reported to mission control: \"We found a dent or a hole from a meteorite, it looks like a bullet hole.\"\n\n\"Is it on the pressurized adapter?\" a flight controller asked.\n\nThe reply from space was garbled, but one of the cosmonauts added, \"I want to say the size is about five to six millimeters.\"\n\nThis was the 83rd spacewalk devoted to station assembly and maintenance since construction began in 1998 and the second for Yurchikhin and Kotov, pushing their Expedition 15 total to 11 hours and two minutes. Overall all, station astronauts and cosmonauts have logged 509 hours and five minutes of EVA time since assembly began.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}