{"category": "ham", "to_address": "a2k@lists.essential.org, ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Bridges Weekly: WIPO members agree on a development agenda", "body": "\n\n\nCivil society groups expressed delight with an outcome that seemed\nunfeasible not long ago. James Love, director of Knowledge Ecology\nInternational, welcomed \"a meaningful and welcome new vision for WIPO\"\nthat promised to consider \"a range of topics, including measures to\nprotect or promote access to knowledge, the implications and benefits\nof a rich and accessible public domain, and strategies for dealing with\nabuses of rights, or other measures to protect the public interest.\"\nThough compromise was reached by watering down much of the final text,\nit was important to introduce concepts that WIPO had never broached\nbefore, a developing country official said.\n\nTom Goodwin, UK delegate, said that whilst the outcome does not give\nWIPO a new mandate, it \"sets out a clear message from members, to each\nother and the secretariat, as to how they want that mandate executed on\nIP and development.\" He noted that members had affirmed the validity of\ndevelopment concerns relating to IP and had recognised that WIPO needed\nstrategies to address what he termed \"an emerging area.\"\n\nGoodwin also praised the efforts made by developed and developing\ncountry members alike, in their preparation and willingness to engage\nboth before and during the official sessions. Informal meetings in\nDelhi in February and Singapore earlier this month had \"focussed people\nand helped to get ideas in order ahead of time.\" The tenor of exchanges\nbetween the Friends of Development and the Group B industrialised\ncountries had improved markedly. \"Trust was an ingredient in the\nsuccess of the PCDA that had perhaps been lacking before,\" he said.\n\n------------------------------------------------------------------\n\n\nhttp://www.ictsd.org/weekly/07-06-20/story1.htm\n\nVolume 11 \tNumber 22 \t20 June 2007\n\nWIPO MEMBERS AGREE ON DEVELOPMENT AGENDA\n\nMembers of the World Intellectual Property Organization (WIPO) last\nweek reached an agreement on recommendations for reforms aimed at\nensuring that development concerns are placed at the heart of the work\nof the UN agency.\n\nIn the fourth and final session of the committee dealing with the\n'development agenda' talks, held in Geneva from 11-15 June,\nrepresentatives from over 100 governments successfully negotiated a\nseries of proposals to forward to the 2007 General Assembly, WIPO's top\ndecision-making body. They also agreed to create a new Committee on\nDevelopment and Intellectual Property.\n\nMany delegates praised the continuation of a cooperative spirit from\nthe previous session of the Provisional Committee on Proposals Related\nto a WIPO Development Agenda (PCDA) in February, where they had managed\nto agree on a set of initial recommendations. A developing country\ndelegate said a \"good mood\" prevailed last week, with all members\n\"flexible and constructive towards an outcome.\" That the 111 reform\nproposals submitted by governments over the past two and a half years\nhad been digested into agreed and workable recommendations was widely\nseen as a giant step forward from the deep divisions a year ago (see\nBRIDGES Weekly, 5 July 2006,\nhttp://www.ictsd.org/weekly/06-07-05/story1.htm).\n\nThe recommendations address controversial subjects including WIPO's\nprovision of technical assistance, as well as broadening the\norganisation's focus on issues such as public domain, competition, and\naccess to knowledge. However, the US released a statement following the\nconclusion of the meeting stating that whilst the proposals \"reinforce\nWIPO's commitment to the needs of developing countries\" they also\n\"reaffirm WIPO's clear mandate as the specialised UN agency that\npromotes the protection of intellectual property worldwide.\"\n\nAn African delegate described the accord as \"a breakthrough by all\nstandards [that] really reflects the level of conviction among all\nmember states on the need to address the existing imbalance between\nintellectual property rights and the public interest.\"\n\nBrazil and Argentina originally proposed a Development Agenda for WIPO\nat the 2004 General Assembly (WO/GA/31/11). They have been joined by 13\nother countries - Bolivia, Cuba, Dominican Republic, Ecuador, Egypt,\nIran, Kenya, Peru, Sierra Leone, South Africa, Tanzania, Uruguay, and\nVenezuela - to form a group dubbed the 'Friends of Development' (see\nBRIDGES Weekly, 6 October 2004,\nhttp://www.ictsd.org/weekly/04-10-06/story1.htm). The 2005 General\nAssembly created the PCDA and charged it with drawing together a\ncohesive package from the 111 proposals. The committee's mandate was\nextended for a further year in 2006 after members were unable to make\nmeaningful progress.\n\nMeeting focused on the toughest proposals\n\nThe PCDA's final session last week had the task of working through 71\nproposals towards an outcome document that could be forwarded to the\nGeneral Assembly. These proposals were what remained after the\ncommittee's February meeting, when delegates boiled down 40 of the 111\nproposals into 24 recommendations (see BRIDGES Weekly, 28 February\n2007, http://www.ictsd.org/weekly/07-02-28/story1.htm). However, the\ncurrent set of proposals, contained in 'Annex B' of a working document\nprepared by previous General Assembly Chair Ambassador Manalo\n(Philippines), addressed more controversial issues, such as access to\nknowledge, competition, and collaborative innovation models.\n\nA developed country delegate said that expectations had been surpassed\nin finding agreement on all aspects of Annex B.\n\nChairman Clarke guides process with informal sessions\n\nPCDA Chair Ambassador Trevor Clarke (Barbados) continued the 'green\nroom' process - informal negotiations limited to the regional\ncoordinators and a representative selection of key delegations - that\nhad facilitated the breakthrough in February. Clarke had aimed to\nfinish discussing the substantive proposals by mid-week to allow two\ndays to discuss their implementation. However, substantive discussions\ncontinued until the final day, with implementation issues receiving\nattention only at the end; the final plenary accordingly concluded at\n10pm. For the rest of the week, plenary sessions were short and spare,\nwith most time invested in regional group sessions and the green room\nprocess.\n\nThe proposals in Annex B were divided into five issue clusters on\ntechnical assistance; norm setting, flexibilities, public policy, and\npublic domain; technology transfer, information technology, and access\nto knowledge; evaluation; and institutional matters including mandate\nand governance. A sixth, on 'other issues' present in Manalo's paper,\nwas incorporated into the preamble of the final recommendations. Each\ncluster was assigned to a different regional group; the coordinators\nwere then tasked with preparing draft proposals in advance of the PCDA.\nThese then became the basis of negotiations in the green room sessions.\n\nThe preamble of the text setting out the recommendations calls for the\nimmediate establishment of a WIPO \"Committee on IP and Development.\"\nThe institution's inconsequential Permanent Committee on Cooperation\nfor Development Related to Intellectual Property (PCIPD), into which\nthe US and other Group B (industrialised) countries have previously\nsought to push the Development Agenda, will cease to exist. The Friends\nof Development were wary that locating their concerns in the PCIPD\nwould marginalise their objective of mainstreaming development into all\nof WIPO's activities. The PCDA's work is complete, but a final one-day\nmeeting will be held prior to the General Assembly in September to\napprove the Chair's report and a list of proposals for immediate\nimplementation.\n\nCivil society groups expressed delight with an outcome that seemed\nunfeasible not long ago. James Love, director of Knowledge Ecology\nInternational, welcomed \"a meaningful and welcome new vision for WIPO\"\nthat promised to consider \"a range of topics, including measures to\nprotect or promote access to knowledge, the implications and benefits\nof a rich and accessible public domain, and strategies for dealing with\nabuses of rights, or other measures to protect the public interest.\"\nThough compromise was reached by watering down much of the final text,\nit was important to introduce concepts that WIPO had never broached\nbefore, a developing country official said.\n\nTom Goodwin, UK delegate, said that whilst the outcome does not give\nWIPO a new mandate, it \"sets out a clear message from members, to each\nother and the secretariat, as to how they want that mandate executed on\nIP and development.\" He noted that members had affirmed the validity of\ndevelopment concerns relating to IP and had recognised that WIPO needed\nstrategies to address what he termed \"an emerging area.\"\n\nGoodwin also praised the efforts made by developed and developing\ncountry members alike, in their preparation and willingness to engage\nboth before and during the official sessions. Informal meetings in\nDelhi in February and Singapore earlier this month had \"focussed people\nand helped to get ideas in order ahead of time.\" The tenor of exchanges\nbetween the Friends of Development and the Group B industrialised\ncountries had improved markedly. \"Trust was an ingredient in the\nsuccess of the PCDA that had perhaps been lacking before,\" he said.\n\nImmediately after the accord, members got an early indication of the\ndifficult work ahead for WIPO and its new Committee on IP and\nDevelopment. In particular, the US renewed its calls for \"ambitious\nplans for substantive patent law harmonisation,\" progress on which has\nbeen linked to the development agenda negotiations. Developing\ncountries have generally been wary of attempts to harmonise patent\nrules.\n\nICTSD reporting; \"WIPO Committee Reaches Breakthrough Agreements On\nDevelopment Agenda,\" INTELLECTUAL PROPERTY WATCH, 15 June 2007.\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}