{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Leah Ball\" <veqdeefaxod@deefa.com>", "subject": "Summer is almost here, be ready", "body": "\nSay goodbye to extra pounds\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting flesh loss product is now easily available – As you could see on BBC\n\n\n\nDo you understand that superfluous body kilograms kill a lot of people for every new year? We believe that you hate the unsightly appearance of people like those and the social bias against them. \n\nOr, maybe, you got no will to resist a siege of your terrible eating habits. If you think it sounds familiar, then we got something to propose to you!\n\n\n\n\n\nHere there is Anatrim, the new product for the elimination of your body’s extra weight. The greatest thing about Anatrim is it improves the quality of your life, making you eat less and giving you better spirit. Pay you attention to some notes from our customers:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of eating any food close at hand and watching TV \n\n\nI became more interested in doing exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I am more fit now and there are lots of men around me!\"\n\n\n\n\n\n\nAmelia B., New York\n\n\n\n\n\n\n\"I tried some passive weight burning, you know, but all came in vain. It was difficult for me to hold back and not to eat something just at hand. \n\n\nOnce I heard on Anatrim in the media advertisement and it brought a great influence on me.\n\n\n I had tried taking it, and my wife said to me I'm a different person now, 3 months later. \n\n\n26 pounds off and it is not a limit! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nSerge Smith, Chicago\n\n\n\n\n\nAnatrim helps you to realize you got no such great need for the constant eating. It improves your mood, provides you with additional energy, and attacks unnecessary kilos. All thanks to its mighty newly-elaborated formula!!\n\n\n\nPry out more information!\n\n\n\n"}