{"category": "spam", "to_address": "\"Subscriber\" <cruiseca@flax9.uwaterloo.ca>", "from_address": "\"Legal World Wide Internet TV Now available \" <qmle84ezw@forgivetrace.com>", "subject": "Watch Legal world wide TV on Your PC ", "body": "We wanted to remind you that you can easily activate hundreds of uncensored TV channels from around the world to watch on your computer or laptop.\n\nIt will only take a couple of moments to activate these channels, and then you can begin watching uncensored TV from around the world on your computer or laptop right away.\n\nPress Here to receive Internet TV activation instructions:\n\nhttp://winthinthenthall.com/t/qmle84ezw/543275\n\nHere is some more information about the Internet TV channels that you will be able to activate and watch:\n\n1) All of the programming is uncensored!\n\n2) There are hundreds of channels from around the world to watch! And new channels are added every day!\n\n3) Hundreds of Radio stations to listen to anytime, all of the time! And new stations are added daily!\n   \n4) All of these channels are available 24 hours per day right from your PC and laptop!\n\n5) No additional hardware is needed!\n\n6) You won't have to pay a cable or satellite bill any longer!\n \n \nPress Here For More Information and To Download Now:\n\n\nhttp://winthinthenthall.com/t/qmle84ezw/543275\n\n\nOnce you download the software get ready to watch sports, news, sitcoms, music videos, dramas, and other programming from around the world!\n\nPress Here For More Information and To Download Now:\n\n\nhttp://winthinthenthall.com/t/qmle84ezw/543275\n\n \n-----\n \nIf you wish to no longer receive marketing promotions for PCTV4ME just visit the page below and you can easily remove yourself from future electronic mail messages:\n\n\nhttp://winthinthenthall.com/t/qmle84ezw/543276\n\nOr send a letter to us at the address below:\n\n100 E. San marcos Blvd.\nSuite 370\nSan Marcos, CA 92069\n\n\n\nHi Subscriber! You are receiving this solicitation because cruiseca@speedy.uwaterloo.ca previously agreed to receive correspondence from Splash Tree. If this service should fail to meet your expectations, feel free to disassociate yourself from our service.\nhttp://winthinthenthall.com/u/183e/cruiseca%40speedy.uwaterloo.ca/2\n\nShould you want to contact us via the United States Postal Service, our address is as follows: 333 Mamaroneck Avenue Suite 193 White Plains, NY 10605\n\n\n"}