{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nWe'll begin tonight's broadcast with an exclusive\n  report on secret efforts to delay Iran's moves to develop nuclear\n  technology. Sheila MacVicar will have the story and David Martin will fill in\n  more details about our country's volatile relationship with Iran.\n \nIn Iraq,\n  the search for the three U.S.\n  soldiers seized two weeks ago continues. Today, the hunt yielded a body that\n  Iraqi police believe to be one of the missing soldiers. Mark Strassmann\n  reports that the military continues the search while investigators hurry to\n  find more clues and identify the body.\n \nAt home, the summer travel season is rapidly\n  approaching, and the Federal Aviation Administration announced a new program that\n  is aimed to help better navigate the upcoming stormy summer months. Could it\n  work? Nancy Cordes will report.\n \nIf you're an individual in the United States seeking medical\n  insurance coverage, the odds are stacked wildly against you. Our\n  investigative team has been probing the sometimes questionable tactics used\n  by insurance companies, and tonight Armen Keteyian will have a report.\n \nFinally tonight, Sandra Hughes will report that concern\n  is growing for the safety of the wayward whale duo dubbed Delta and Dawn,\n  which have been circling near a Sacramento River\n  bridge. Scientists analyzing photographs of the mother-and-calf pair say\n  their appearance indicates declining health. We’ll have more details on\n  these whales and what others of their species to get themselves in situations\n  like this.\n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}