{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "Jim Moore <j9916moore@bellsouth.net>", "subject": "Re: ipw2200 on Gateway running etch", "body": "\n\n\n\n\n\n\nBob Proulx wrote:\n\nJim Moore wrote:\n  \n\nGot the connection active this morning.  Getting the fw files in place \nwas all it needed. The ipw2200 was in my install.  So all was in place \nand upon rebooting it showed that I had an active wireless connection.  \n    \n\n\nVery good to hear.\n\n  \n\nThen came the process of getting wpa_supplicant up as I run WPA-PSK TKIP \nsecurity.  I really complicated that as it was one of the modules in the \n\"etch\" install.  I heard about supplicant from a local linux user and \nhad downloaded the tarball for 0.5.7. I proceeded to try to install it \nbefore I finally did some checking and discovered that the preloaded \nversion was 0.5.5.  After removing 0.5.7, shutting down and removing my \nnetwork cable, I restarted and the supplicant gui came up asking for my \npassword. Entered and voila.  Connected like a champ. \n    \n\n\nThat seems like a lot of work.  Not to detract from your good results\nbut I think that much effort was not needed.\n\nThe default installation of Etch will install NetworkManager by\ndefault.  Internally NetworkManager already uses wpa_supplicant.\nTherefore I think that if you use NM to connect that you will get\nwpa_supplicant without needing to compile and install it explicitly.\n\nIt \"just worked\" for me when I connected up to a WPA wireless node.  I\nhave always been a low-level type of guy and only recently tried using\nNM to manage these things.  But so far I am quite impressed, like it\nquite a bit, and think the relationship with NM will be a long one.\n\nBob\n\n\n  \n\nHear you Bob.  I make the whole thing much toooo difficult by trying to\nconfigure the later version of supplicant while the one in etch was\nalready installed.  It was a matter of forging ahead without having\nread enough about etch and knowing that supplicant was already there.  \n\nJim\n\n\n\n\n\n-- \nTo UNSUBSCRIBE, email to debian-laptop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}