{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "insuperable: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\nFind out how to release your inner genius and ace your exams \nin Teresa Bolen's epochal book, MASTER PLAN TO MASTER EXAMS: \nHOW TO DISCOVER YOUR HIDDEN ABILITIES TO CREATE THE SUCCESS YOU DESIRE.\nYou'll get a package of wonderfully empowering F-R-E-E Bonus Gifts\nfrom some of the world's leading success and learning experts --\ntake action NOW.\nRelease Your Inner Genius Abilities Today\nADVERTISEMENT\nWord of the Day for Monday, May 21, 2007\ninsuperable \\in-SOO-pur-uh-bul\\, adjective:\nIncapable of being passed over, surmounted, or overcome; insurmountable; as, \"insuperable difficulties.\"\nThey have overcome almost insuperable odds that the poor facilities and elements have brought about. -- Raimund E. Goerler (Editor), To the Pole: The Diary and Notebook of Richard E. Byrd, 1925-1927\nOnce the Soviet Union acquired the bomb, in 1949, proposals for nuclear disarmament were rejected on grounds that the character of the Soviet regime posed an insuperable obstacle. -- Jonathan Schell, The Gift of Time\nInsuperable comes from Latin insuperabilis, from in-, \"not\" + superare, \"to go above or over, to surmount,\" from super, \"above, over.\"\nDictionary.com Entry and Pronunciation for insuperable\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9663222-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}