{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Robin Williams\" <robster3@hotmail.com>", "subject": "Re: TeX", "body": "Yes, you could indeed use it for producing essays. You can use it to produce \nwhatever you want, and have complete control over the formatting. I would \nthink that it's most constructive use would be in the preparation of \nscientific documents, which is the purpose for which I use it, but there is \nno reason why written essays shouldn't be prepared in LaTeX.\n  You will need to decide on an editor in which to write the LaTeX, and get \nthings set up so that you can compile in to your prefered format. Under \nlinux Emacspeak is fine for an editor, and there are many shortcuts to \naleviate the typing of what can be fairly complicated expressions.\n  If you google for learn latex, the first thing that comes up should be \nenough to get you started.\n\nhth\nRobin Williams\nMobile:\n07883017949\nPersonal email:\nrobin@robin-williams.co.uk\nUniversity business email:\nrmw205@ex.ac.uk\nMSN:\nrobster3@hotmail.com\n----- Original Message ----- \nFrom: \"Zachary Kline\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Thursday, May 24, 2007 12:10 AM\nSubject: TeX\n\n\n> Hello,\n>    I have heard a great deal about the use of TeX and LateX by the blind \n> to do 'structured documents'.  I'm wondering if this package would be \n> appropriate for things like essays, with fairly specific formatting \n> requirements.  (I could always use a Windows word processor to do the \n> same, but I get less feedback with those than I feel comfortable with.)\n> If this is indeed the case, could anybody recommend a good site for \n> learning the fundamentals?  I've heard of a publication called the \n> TeXbook, but can't find an accessible version.\n> Thanks much in advance,\n> Zack.\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}