{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 10, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESBush Seeks Deal With Democrats On Iraq\nUnder growing political pressure, President Bush said the White House will seek agreement with Congress on benchmarks to measure\n                        progress in Iraq. However, the president pledged to veto a bill that would cut off money for the war by the end of July. More...\n• OxyContin's Deception Costs Firm $634M • Engineer Guilty In Military Secrets Case• Gonzales Faces New Round Of Questioning\n                     \t\t\t\t\t| WatchU.S.Colorado High School On Lockdown\nPolice launched a room-to-room search of Boulder High School before students arrived because a cook reported seeing two suspicious\n                        men inside the building, both wearing camouflage and one wearing a ski mask. More...\n• Engineer Guilty In Military Secrets Case• Weather Aids Florida Firefighters\n                     \t\t\t\t\t| Watch• Cop Avoids Charges For Making Pot Brownies• More StoriesWorldRevived Taliban Restrict Afghan Aid Effort\nIn the wake of Operation Medusa, in which hundreds of insurgents were killed, military officials hoped that development workers\n                        would move in to fill the vacuum. But almost a year later, most of Afghanistan's four southern provinces are off limits. More...Watch: Taking A Taliban Stronghold\n• Blair To Step Down On June 27\n                     \t\t\t\t\t| Watch• Putin Offers Blunt Victory Day Speech• Turkey Approves Popular Vote For President• More StoriesPoliticsGOP Moderates Warn Bush On Iraq\nDuring a private, \"frank\" discussion with President Bush at the White House, a group of moderate Republicans warned Mr. Bush\n                        that he would lose the support of his party if progress isn't demonstrated in Iraq, and soon. More...\n• Gonzales Faces New Round Of Questioning\n                     \t\t\t\t\t| Watch• Fuel-Efficiency Bill \"Full Of Holes\"• Another Prosecutor Pushed Out?• More StoriesHealthNew Evidence Cervical Cancer Vaccine Works\nGardasil is designed to protect against the strains of human papilloma virus that cause most cases of the disease, and Dr.\n                        Emily Senay says the latest clinical trials show it does the job. But, she adds, the Gardasil remains controversial. More...Watch: HVP Vaccine & Cancer\n• OxyContin's Deception Costs Firm $634M • Cell Phone GPS Finds Transplant Patient\n                     \t\t\t\t\t| Watch• Safer Tobacco Alternative From Sweden?• More StoriesSciTechNYC Cabs Going High-Tech\nThe city's Taxi and Limousine Commission unanimously approved a plan to install touch-screen monitors in all 13,000 city cabs\n                        over the objections of some drivers who consider the technology too expensive and intrusive. More...\n• Cell Phone GPS Finds Transplant Patient\n                     \t\t\t\t\t| Watch• Fuel-Efficiency Bill \"Full Of Holes\"• Web Profiteering Off Va. Tech Massacre• More StoriesBusinessJetBlue Dumps CEO\nJetBlue Airways Corp. replaced founder David Neeleman as CEO months after operating snafus essentially shut down the carrier\n                        for days and frayed relations with customers. The low-fare airline appointed Chief Operating Officer Dave Barger. More...\n• Tax Revenues Hit Record High In April• Guilty Pleas In Giant Insider-Trading Case• OxyContin's Deception Costs Firm $634M • More StoriesEntertainmentBrangelina's Biggest Problem? Quality Time\nDoes the world's most beautiful couple fight? \"Not really. We'll get into issues about global events or something that was\n                        just on the news,\" Angelina Jolie tells Readers Digest in a new interview. More...Watch: Jolie On Adopting Orphan Kids\n• Depp Opens Up About Daughter's Sickness\n                     \t\t\t\t\t| Watch• LaKisha Sings Her Last Song On \"Idol\"\n                     \t\t\t\t\t| Watch• HBO Chief Forced Out After Assault Arrest• More StoriesOpinionCounting The Bentleys\nConspicuous consumers need to think about the message they intend to send, writes CBSNews.com's Dick Meyer. More...\n• A Prescription For Details\n                     \t\t\t\t\t| Watch• Leaving Iraq Puts More Than U.S. At Risk\n                     \t\t\t\t\t| Watch• Tenet Chose Power Over Honor\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Williams-Sonoma: Perfect Lunch For Mom\nTori Ritchie serves up simple and delicious recipes for a Mother's Day menu. Why not give her a home-cooked meal, rather\n                        than heading out to a restaurant? More...\n• EARLY SHOW: New Evidence Cervical Cancer Vaccine Works\n                     \t\t\t\t\t| Watch• EARLY SHOW: Does It Pay For Mom To Work?\n                     \t\t\t\t\t| Watch• EARLY SHOW: Woman's Essay On Mom Wins Her A Cruise\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nMissouri Copes With FloodingIn Levasey, Mo., homes and crops now sit beneath a few feet of water. State officials say that many levees along the Missouri,\n                                    Platte and Grand Rivers have breached. Manuel Gallegus reports.\nTOP VIDEOS\nAndrea Storms Off Fla. Coast \nGonzales' House Testimony\nBlair To Resign After A Decade\nFirst Look: Battle Over Iraq\nBush OK With Iraq Benchmarks\nSk8er Dog Carves The Pavement\nCheney Admits Security Issues\nBritain's Tony Blair Resigns\nStory Wins Mother's Day Prize\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesDoes fiery CNN anchor Lou Dobbs consider himself a journalist? Lesley Stahl finds out, Sunday, 7 p.m. ET/PT.48 Hours!\n  Mystery\nPower, Passion And Poison:An ambitious politician meets a suspicious death. Troy Roberts reports, Saturday at 10\n                           p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}