{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Freda Greer\" <macccdtelecomdoc@ccdtelecom.com>", "subject": "Watch the pounds disappear", "body": "\nLess weight - more pleasure and joy\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most exciting product for corpulent people is made available now – As were told on BBC.\n\n\nDo you hold in your memory all the times when you plead to yourself to do anything to get rid of this desperately growing number of kilos? Happily, now no major sacrifice is demanded. With Anatrim, the earth-shaking kilos-melting mixture, you can achieve naturally health mode of life and a really slender figure. Have a look at what our customers say!\n\n\n\n\"I hate to confess but I was extremely addicted to food. \n\n\nI greedily ate all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis ruinous passion left off after I started course of taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my inclination to eat constantly vanished, \n\n\nmood improved and I became the happiest person 22 pounds in 2.3 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nRita R., San Francisco\n\n\n\n\n\n\"I had weight problems since a boy. \n\n\nIt’s pretty hard to imagine how I abhorred being derided at school. \n\n\n\n\nI abhorred my stoutness and I abhorred myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nThis stuff literally pulled me out of this horrible nightmare! A plenty of thanks to you, guys.\"\n\n\n\n\n\nDave Klark, New York\n\n\n\n\n\n\"Do you know what? Anatrim preserved my marriage! I got into this circle, depression – eating more – just more depression. My wife was about to leave me as I was turning in overweight psycho. \n\n\nOnce one of my friends pointed to your web page and I asked for Anatrim immediately. \n\n\nThe results I achieved were great, my appetite came to admissible level, I was often in good spirits, and, of course, I became able to tighten my belt on some holes. And you know, the bedroom became cool, too!\"\n\n\n\n\n\nMike\n\n\n\n\n There are lots of testimonial letters left by happy people trying Anatrim. Don’t you gonna join the thousands and thousands of slender buyers and try this original appetite-suppressing power boosting product now!\n\n\nDo not miss the opportunity!\n\n\n\n\n"}