{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 118", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Sweden. Rare Violin Stolen from Train\n      (Museum Security Network Mailing list)\n   2. Counter-affects of Museum Raid, Reinforced Control of North\n      Korea-China Trade Routes (Museum Security Network Mailing list)\n   3. Switzerland. Hesse-Museum in Montagnola wurde bestohlen\n      (Museum Security Network Mailing list)\n   4. UK. Painting is found 15 years after theft\n      (Museum Security Network Mailing list)\n   5. Court upholds dismissal of lawsuit seeking Taylor's van Gogh\n      (Museum Security Network Mailing list)\n   6. Canada. B?dard blames her parents for partner's theft charges\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Sat, 19 May 2007 09:13:57 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Sweden. Rare Violin Stolen from Train\nTo: Museum Security Network Mailinglist \nMessage-ID: <464EA3B5.4070706@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nRare Violin Stolen from Train\n\nThe music died in Stockholm when a unique violin and two bows were stolen from a train at the capital?s central station.\n\nMusician Fredrik Burstedt was on his way to a rehearsal at Stockholm?s Concert Hall. He woke up just as the train pulled in to the station and with a groggy jolt, jumped off. When he realized he had left his instrument behind, he ran back but the violin was gone and witnesses were able to describe the man who took it.\n\nThe violin was made in 1820 by Lupot, and was on loan to Burstedt from a foundation. In total, the stolen items are worth more than \n140, 000 US dollars and have been placed on Interpol?s wanted list.\n\nhttp://www.sr.se\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Sat, 19 May 2007 09:13:51 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Counter-affects of Museum Raid, Reinforced Control of\n\tNorth Korea-China Trade Routes\nTo: Museum Security Network Mailinglist \nMessage-ID: <464EA3AF.7070606@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nCounter-affects of Museum Raid, Reinforced Control of North Korea-China Trade Routes\n\nChaos as security officers hunt for criminal in Haeju\nBy Kwon Jeong Hyun, of China\n[2007-05-18 18:23 ] \n\nGolden statues of Buddha and ancient Korean pottery were stolen from Haeju Historical Museum in Haeju, South Hwanghae, on the 11th, creating havoc in the area.\n\nNorth Korean authorities are currently investigating ways to monitor the smuggling routes known in the border region of Dandung, Shinuiju to prohibit these artifacts from being exported to China. Consequently, even small-scale illegal deals normally made along the Yalu River are being affected.\n\nThrough an inside source in North Korea and confirmation by a correspondent, the DailyNK discovered that artifacts from the Haeju Museum had been stolen on the night of 11th by an outside thief and that special orders had been made, involving the National Security Agency to conduct investigations along the border regions.\n\nAnother source from Shinuiju directly called the DailyNK on the 17th and said, ?Agents from the National Security Agency and National Safety Agency in Haeju are in mayhem as they try to find the person who came out from Kaesong and then (assumingly) stole golden statues of Buddha and ancient Korean pottery from the Haeju Historical Museum.?\n\nThe source said, ?(North Korean) Tradesmen who smuggle antiques in Shinuiju are saying nothing and keeping a low profile? things will only quieten down once the criminal is caught.? The source added, ?As the smuggling routes along the Yalu River are also being carefully watched, small-scale trade is on the decrease as smuggling of daily goods and cigarettes are also affected.?\n\nEven until the 17th, there has been no news of the thief?s capture, according to the source. Rather, as control is further reinforced, it seems that the goods stolen were of significant value.\n\nhttp://www.dailynk.com/\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Sat, 19 May 2007 09:14:02 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Switzerland. Hesse-Museum in Montagnola wurde bestohlen\nTo: Museum Security Network Mailinglist \nMessage-ID: <464EA3BA.1070009@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nHesse-Museum in Montagnola wurde bestohlen\n\nZwei Verd?chtige festgenommen  \n\nDas Hermann Hesse Museum in Montagnola im Tessin soll von zwei der Gr?nder um mehrere hundert Sammelst?cke gebracht worden sein. Die Staatsanwaltschaft Lugano er?ffnete auf Klage der Erbengemeinschaft eine Strafuntersuchung.\nap) Die ermittelnde Staatsanw?ltin wollte sich am Freitag zum Fall nicht ?ussern, der Tags zuvor durch einen Bericht des Tessiner Fernsehens tsi bekannt geworden war. Die Erbengemeinschaft klagt laut ihrem Rechtsvertreter Paolo Bernasconi auf Diebstahl und Betrug und verlangt, dass nach den verschwundenen Aquarellen und Zeichnungen gesucht und diese mit Beschlag belegt werden. Es sollen mehrere hundert Werke fehlen.\nZwei der Museums-Gr?nder unter Verdacht\n\nBei den Festgenommenen soll es sich um zwei Gr?nder des Museums handeln, die laut der heutigen Museums- und Stiftungsdirektorin seit 2001 Hausverbot haben. Damals wurde der 1997 gegr?ndete und von einem der Festgenommen pr?sidierte Verein ?Amici Museo Hermann Hesse? aufgel?st und auf Entscheid des Eidgen?ssischen Departementes des Inneren vom 5. M?rz 2001 in eine Stiftung umgewandelt. Der zweite Verd?chtigte amtete von 1997 bis 2001 als Kurator der figurativen Werke Hesses. \n\nhttp://www.nzz.ch\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Sat, 19 May 2007 09:14:10 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] UK. Painting is found 15 years after theft\nTo: Museum Security Network Mailinglist \nMessage-ID: <464EA3C2.1060409@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nPainting is found 15 years after theft\n\nA PAINTING stolen 15 years ago has been recovered after being put up for auction.\n\nThe oil painting by James Webb, which depicts cottages at Southend, in Essex, was checked against a database of stolen property when it was put up for sale last month.\n\nIt was identified as having been stolen from a Cambridgeshire home in a burglary in 1989, and now, more than 15 years after it went missing, police are attempting to trace its rightful owners.\n\nDet Con Martin Brocklebank, investigating, said:\n\n\"Stolen but easily recognised paintings are often kept hidden only to resurface for sale many years after the original burglary.\n\n\"Databases of stolen valuables have proved to be effective tools to help us identify stolen property, prevent its resale and return the items to their rightful owners.\"\n\nhttp://www.cambridge-news.co.uk\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Sat, 19 May 2007 09:14:15 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Court upholds dismissal of lawsuit seeking Taylor's van\n\tGogh\nTo: Museum Security Network Mailinglist \nMessage-ID: <464EA3C7.4030000@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nCourt upholds dismissal of lawsuit seeking Taylor's van Gogh\n\nFriday, May 18, 2007\n\n(05-18) 17:26 PDT San Francisco (AP) --\n\nA federal appeals court on Friday upheld the dismissal of a lawsuit demanding that Elizabeth Taylor turn over a Vincent van Gogh painting once confiscated by Nazis.\n\nFour descendants of the late Margarete Mauthner, whose possessions were seized by the Nazis after she fled Germany in 1939, claimed in a 2004 lawsuit that Taylor failed to review the ownership history of \"View of the Asylum of Saint-Remy\" before acquiring the painting more than 40 years ago.\n\nThe heirs contended a sales brochure warned the painting was likely confiscated by Nazis. They asked for restitution and for the painting, which was appraised at between $10 million and $15 million when it hung in Taylor's living room about two years ago.\n\nBut the 9th U.S. Circuit Court of Appeals said a lower federal court properly ruled in 2005 that the statute of limitations had expired for the state law under which the family filed its claim.\n\nThe lower court also correctly ruled that the Holocaust Victims Redress Act did not establish a right to sue for the return of confiscated property, the appeals court held.\n\nIn court documents, Taylor's attorneys acknowledged that Nazis forced Mauthner and her family to give up jobs, pensions and homes, but said they had no information on whether Mauthner sold the painting or it was stolen from her.\n\nIn its opinion Friday, the 9th Circuit took note of the geographic and legal journey the painting has made.\n\n\"Vincent van Gogh is said to have reflected that 'paintings have a life of their own that derives from the painter's soul.' The confused and perhaps turbulent history of his painting Vue de l'Asile et de la Chapelle de Saint-Remy may prove the truth of his observation,\" the court wrote.\n\nElizabeth Taylor said in court papers that she had never seen information suggesting the painting was ill-gotten by the Nazis. Her father, Francis Taylor, bought the painting in 1963 on his daughter's behalf for $257,600 at a Sotheby's auction in London.\n\nThe descendants who sued are Andrew J. Orkin of Canada and three South African residents, F. Mark Orkin, Sarah-Rose Josepha Adler and A. Heinrich Zille.\n\nhttp://www.sfgate.com\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Sat, 19 May 2007 09:14:24 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Canada. B?dard blames her parents for partner's theft\n\tcharges\nTo: Museum Security Network Mailinglist \nMessage-ID: <464EA3D0.7040504@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nB?dard blames her parents for partner's theft charges\nLast Updated: Friday, May 18, 2007 | 4:37 PM ET\nCBC News\n\nFormer Olympic athlete Myriam B?dard blamed her parents for charges of art theft against her partner Nima Mazhari at his trial Friday, saying they wanted to control her life and resented her relationship with the accused.\n\nThe former champion biathlete was called by the prosecution to be a witness in the case against Mazhari, who is charged with stealing and possessing 20 paintings by the late Ghitta Caisserman-Roth, with whom he once shared studio space.\n\nMontreal artist Caisserman-Roth died in 2005. The 20 paintings have been estimated to be worth about $100,000.\n\nUnder questioning by the Crown, B?dard told the jury she couldn't identify four of the allegedly stolen paintings when shown photos of them in court.\n\nShe had been shown other paintings Thursday, and also said then she didn't recognize most of them.\n\nShe testified Thursday that, during a certain period in her life, she had changed homes several times, and had asked her father to store some of her valuables, including her Olympic medals and items from her art collection.\n\nB?dard testified Friday that her father told her former agent that he had some stolen paintings in his home, brought there by her and Mizhari. The agent, Jean-Marc St-Pierre, testified Thursday that he went to police about the matter.\n\nUnder questioning by defence counsel, B?dard said her parents and siblings have been upset ever since she and Mazhari became friends. She said her family wanted to control her life.\n\nShe also said her relatives feared her child would be brought up by an immigrant, instead of being raised like a Quebecer.\n\nShe told jurors her family thought she and Mizhari would take her daughter to Iran.\n\nB?dard and Mazhari travelled to the U.S. with her daughter from a previous marriage in October 2006.\n\nB?dard was arrested in Maryland in late December and has been ordered to stand trial on a charge of violating a custody order. A court date for that case is expected to be set in June.\n\nThe 37-year-old won two gold medals at the 1994 Lillehammer Olympics and a bronze at the Albertville Games two years earlier.\n\nhttp://www.cbc.ca\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 118\n****************************************\n\n"}