{"category": "ham", "to_address": "Andrew <ktwarwic@flax9.UWATERLOO.CA>", "from_address": "\"Organic Consumers Association\" <ronniecummins@organicconsumers.org>", "subject": "Organic Bytes: Big Food Attack, Toxic Sodas, Green Shopping", "body": "\n\nOrganic Bytes #110: Big Food Attack, Toxic Sodas, Green Shopping\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHello Andrew,\nORGANIC \n                          BYTES #110\n                          Health, Justice and Sustainability News Tidbits with \n                          an Edge!\n\n5/31/2007\n\nWritten \n                        and edited by Craig Minowa and Ronnie Cummins\n\nSafe \n                        Unsubscribe: \n                   http://alerts.organicconsumershttp://alerts.organicconsumers.org/trk/chttp://alerts.organicconsumers.org/trk/click?ref=zqtbkk3um_1-b1x317x3340774&\" >http://organicconsumers.org/unsuborganicbytes.cfm \n                        \n                        You are subscribed as: ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n \n\n\n\n\n\n\n\nIN \n                        THIS ISSUE\n\nALERT \n                          OF THE WEEK: MONSANTO & BIG FOOD ATTACK LOCAL \n                          RIGHTS TO REGULATE FOOD AND CROPS\nGOOD \n                          NEWS OF THE WEEK: VENEZUELA MOVES TO BAN FRANKENCROPS\nALERT \n                          UPDATE:  OCA'S BOYCOTT OF HORIZON CONTINUES AS \n                          COMPANY'S STOCK PLUMMETS\nQUOTE \n                          OF THE WEEK:  PLANET'S POPULATION IS NOW MORE \n                          URBAN THEN RURAL\nPRODUCT \n                          PLUNDER OF THE WEEK:  CANCER-CAUSING BENZENE \n                          IN SODA DRINKS\nWEB \n                          VIDEO & ACTION OF THE WEEK: WATCH MICHAEL \n                          MOORE'S INTERVIEW AND TAKE ACTION FOR HEALTH CARE FOR \n                          ALL \nQUICK \n                          FACTS OF THE WEEK: GREEN CONSUMERS CAN'T FIND \n                          GREEN GOODS\nWEB \n                          TIP OF THE WEEK:  ONLINE SHOPPING FOR THE GREEN-MINDED\nHEALTH \n                          TIP OF THE WEEK:  CANADIANS MAKE IT OFFICIAL: \n                          TEA IS GOOD FOR YOU\n\n\n\n\n\n\n\n\n\n___________________________________\n\n\n\n\n\n\nALERT \n              OF THE WEEK:\n              MONSANTO & BIG FOOD ATTACK LOCAL RIGHTS TO REGULATE FOOD AND \n              CROPS \n              Since 1998, the biotech industry and industrial food corporations \n              have unsuccessfully tried to take away local and states' rights \n              to ban or regulate genetically modified organisms (GMOs) and other \n              controversial foods and crops. For example, OCA and other public \n              interest groups successfully generated a mass outcry in 2006 that \n              blocked the passage of the National Uniformity for Food Act. \n              This highly unpopular bill would have nullified 200 food safety \n              and food labeling laws across the U.S. Failing to suppress grassroots \n              control over food safety laws and labels in the last session of \n              Congress, industry has now called on their friends in the House \n              Subcommittee on Livestock, Dairy, and Poultry to slip a similar \n              poison pill into an obscure section of the voluminous 2007-2012 \n              Farm Bill. The provision would give the White House appointed Secretary \n              of Agriculture the power to eliminate local or state food and farming \n              laws, such as those in four California counties banning genetically \n              engineered crops, and set an an ominous precedent undermining states' \n              rights. \nTell Congress to repeal this provision before \n              it becomes law: http://www.organicconsumers.org/articles/article_5424.cfm\n\n\n\n\n___________________________________\nWe \n        rely on your donations to continue policing organic standards. \n        Please donate now!\n\nhttp://www.organicconsumers.org/donations.htm\n___________________________________\n\n\n\n\nGOOD \n              NEWS OF THE WEEK:\n              VENEZUELA MOVES TO BAN FRANKENCROPS\n              Monsanto's plans to grow 500,000 acres of genetically engineered \n              crops in Venezuela have been thwarted by the nation's popular President, \n              Hugo Chavez. According to Chavez, when he learned about Monsanto's \n              Plans, \"I ordered an end to the project. This project is terminated.\" \n              Chavez is now encouraging Venezuela's national legislature to pass \n              some of the most sweeping restrictions on genetically modified organisms \n              in the entire Western Hemisphere. \nLearn more: http://www.organicconsumers.org/articles/article_5353.cfm\n\n\n\n\n___________________________________\n\n\n\n\nALERT \n              UPDATE: \n              OCA'S BOYCOTT OF HORIZON CONTINUES AS COMPANY'S STOCK PLUMMETS\n\n              April marked the one year anniversary of OCA's boycott of factory \n              farmed dairy products produced by Horizon Organic and Aurora. Ninety-six \n              percent of Organic Bytes readers, in an online survey in 2006, voted \n              to launch a boycott of so-called \"USDA Organic\" brands \n              sourcing dairy products from intensive confinement feedlots where \n              the cows have little or no access to pasture, and where many of \n              the calves have been purchased from conventional farms. A loophole \n              in the USDA Organic Standards has allowed two companies, Horizon \n              and Aurora, to buy their milk from \"organic\" factory farms \n              where as many as 10,000 cows are packed into feedlots. Although \n              Horizon claims the OCA boycott has not affected sales, Executive \n              Gregg Engles recently admitted to investors that profits for the \n              year have been much lower than projected. The company's stock market \n              price has recently dropped 11 percent. In addition Wal-Mart, Wild \n              Oats, Safeway, Costco, Woodstock Farms, Publix, and other private \n              label vendors of Aurora's feedlot milk are coming under increasing \n              criticism from consumers. \n              Learn more about this campaign and take part in the boycott: http://www.organicconsumers.org/sos.cfm\n\n\n\n__________________________________\n\n\n\n\n\n\nQUOTE \n              OF THE WEEK: \n              PLANET'S POPULATION IS NOW MORE URBAN THEN RURAL\n              \"So far, cities are getting whatever resource needs that can \n              be had from rural areas. But given global rural impoverishment, \n              the rural-urban question for the future is not just what rural people \n              and places can do for the world's new urban majority. Rather, what \n              can the urban majority do for poor rural people and the resources \n              upon which cities depend for existence? The sustainable future of \n              the new urban world may well depend upon the answer.\" \nDr. \n                Ron Wimberley, Professor of Sociology at NC, addressing the fact \n                that as of May 23, 2007, the world's population for the first \n                time is primarily urban.\nLearn \n                more: http://www.organicconsumers.org/articles/article_5407.cfm\n \n\n\n\n\n___________________________________\n\n\n\n\n\nPRODUCT \n                PLUNDER OF THE WEEK: \n                CANCER-CAUSING BENZENE IN SODA DRINKS\nThe \n                problem of cancer causing benzene turning up in sodas seems to \n                pop up in the U.S. with alarming regularity. Last week, the FDA \n                reported that it tested 100 sodas and found unacceptable levels \n                of the known carcinogen in five of the drinks. Some of these drinks \n                had benzene levels nearly 100 times that which is considered safe \n                by the EPA for drinking water. The toxin is formed when a soda \n                manufacturer uses two ingredients that can react to form benzene: \n                ascorbic acid and sodium benzoate or potassium benzoate. Soda \n                companies found to have dangerous levels of benzene have vowed \n                to reformulate their drinks. In the meantime, boycott the following \n                beverages and consider avoiding any soda with the \"toxic \n                two\" ingredients, found in an astoundingly high number of \n                popular drinks. (As a note, beverages labeled as \"organic\" \n                cannot contain these ingredients.) \nSodas \n                Found to Contain Carcinogenic Benzene: \n\nSafeway \n                  Select Diet Orange \nAquaCal \n                  Strawberry Flavored Water Beverage \nCrystal \n                  Light Sunrise Classic Orange \nGiant \n                  Light Cranberry Juice Cocktail \nCrush \n                  Pineapple\n\n\nLearn \n                more: http://www.organicconsumers.org/articles/article_5422.cfm\n\n\n\n\n___________________________________\n\n\n\n\n\nWEB \n                VIDEO & ACTION OF THE WEEK:\n                WATCH MICHAEL MOORE'S INTERVIEW AND TAKE ACTION FOR UNIVERSAL \n                HEALTH CARE\n                If you've been reading OCA's \n                Health Page you're aware of the sorry state of the nation's \n                health care system. In 2000, the World Health Organization ranked \n                our system (which is the most expensive in the world) 37th, just \n                after war-torn and drug-ravaged Columbia. In the last seven years, \n                with cuts in employee health benefits and miserly HMO coverage, \n                things have only gotten worse. A 2007 report by the Commonwealth \n                Fund ranks the US last among other rich countries in health care \n                access, patient safety, efficiency, and equity, despite the fact \n                that it spends twice as much on health care. This is the subject \n                of Michael Moore's new documentary, \"Sicko.\" The difference \n                between the US and countries with better health outcomes? Universal \n                health care.\nWatch this short interview with Moore and take \n                action for universal health care: http://www.organicconsumers.org/articles/article_5423.cfm\n  \n\n\n\n\n__________________\n\n\n\n\nQUICK \n              FACTS OF THE WEEK: \n              GREEN CONSUMERS CAN'T FIND GREEN GOODS\nA \n              new Hartman Group survey indicates that consumers have generated \n              a greater demand for green and sustainably produced products than \n              the market is able to provide. While the vast majority of consumers \n              say they want to purchase a wide variety of products from companies \n              with sustainability ethics, relatively few consumers actually know \n              where to find those products.\n\nNearly \n                  3 out of 4 U.S. consumers believe their purchases have significant \n                  impact on society.\n71% \n                  say they would pay more for sustainably made products.\nOnly \n                  5% of consumers can name companies that they know have values \n                  based on sustainability.\nOnly \n                  one in ten consumers know where they can buy sustainably made \n                  products.\n\nSource:\n http://www.organicconsumers.org/articles/article_5400.cfm\n\n\n\n\n\n___________________________________\n\n\n\n\n\nWEB \n                TIP OF THE WEEK: \n                ONLINE SHOPPING FOR THE GREEN-MINDED\nAlthough \n                finding sustainably made products in your local strip-mall may \n                be difficult, there are an increasing number of independently \n                owned retailers, coops and online businesses where you can research \n                and/or buy green products from green companies. The Organic Consumers \n                Association has teamed up with GreenPeople.org to bring you one \n                of the world's largest directories of green and organic businesses. \n                Buy Green, Sell Green, Be Green\nFind Green Products and Services in Your Area \n                and nationwide.\nhttp://www.organicconsumers.org/btc/BuyingGuide.cfm\n\n\n\n\n\n___________________________________\n\n\n\n\nHEALTH \n              TIP OF THE WEEK: \n              CANADIANS MAKE IT OFFICIAL: TEA IS GOOD FOR YOU\n              Last week, the Canadian government officially deemed tea (black, \n              green and oolong) as having medicinal qualities. Although the news \n              of tea's health benefits may not seem surprising, this story becomes \n              particularly noteworthy when put in the context of the sheer difficulty \n              of convincing U.S. & Canadian governments to acknowledge specific \n              health benefits of herbs. After reviewing hundreds of studies conducted \n              over the past few decades, the Canadian government stated there \n              is enough evidence to prove that these particular teas are stimulants, \n              support cardiovascular health and are an important dietary source \n              of antioxidants. Tea is second only to water as the healthiest beverage \n              choice, according to healthy beverage guidelines that were developed \n              by a panel of American nutrition experts and published in the March \n              2006 issue of the Journal of American Clinical Nutrition. According \n              to experts like Dr. Carol Greenwood, a Professor of Nutritional \n              Sciences at the University of Toronto, \"Tea is one of the highest \n              sources of antioxidants in the diet.\" The U.S. FDA has rejected \n              petitions similar to what Canada approved this week, saying there \n              is no evidence supporting these herbal health claims. \nLearn more: http://www.organicconsumers.org/articles/article_5401.cfm\n\n\n\n___________________________________\nWe \n        rely on your donations to continue our work on these important issues!\n\nhttp://www.organicconsumers.org/donations.htm\n \n******** messages from \n        our supporters*********\n\n\n\n\n\nTHE \n                NATURAL FOODS INDUSTRY GOES \"BEYOND ORGANIC\"\nFrom \n                organic food companies promoting ecological restoration and economic \n                justice to micro-credit, a Nobel-prize winning solution to poverty; \n                from U2's Bono on Africa, terrorism, and God to the top 20 organic \n                products; from Eve Ensler's calls for women in power to socially \n                responsible investing. Find out why leading thinkers have described \n                Ode as “essential reading” and \"a way of \n                life.\"\nGet \n                Ode for yourself and give a subscription as a gift through \n                our  special \n                offer. Smile, laugh and cry with Ode. Find \n                out more now.\n\n_______________________________\n\n\n\n\n \n\n\n\n\nPlease \n                forward this publication to family and friends, place it on websites, \n                print it, duplicate it and post it freely. Knowledge is power!\n__________________________________\nNOTE \n                TO CO-OP AND NATURAL FOOD STORE SUBSCRIBERS:\n                Organic Bytes is a great tool for keeping your staff and customers \n                up to date on the latest issues. Feel free to forward this email \n                to your staff and print for posting on bulletin boards and staff \n                break tables. You are also welcome to use this material for your \n                newsletters. There's an attractive print-friendly PDF version \n                of this available for free download at \n_________________________________\nORGANIC \n                BYTES is a publication of:\n                ORGANIC CONSUMERS ASSOCIATION \n                6771 South Silver Hill Drive\n                Finland, Minnesota 55603\n                Phone: (218)- 226-4164 Fax: (218) 353-7652\n__________________________________\nSubscribe: \n                Safe \n                Unsubscribe: \n                Change \n                your subscription settings to receive Organic Bytes as plain \n                text here:\n__________________________________\n  \nxaxa1014138\n\n\n\n\n \n \n \n\n\n\n\n\n"}