{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "\"heeseob nam\" <hurips@gmail.com>", "subject": "[Ip-health] Official Launch of EU-Korea FTA", "body": "YONHAP News 2007/05/06 10:59 KST\n\nhttp://english.yonhapnews.co.kr/Engnews/20070506/640000000020070506105947E9.html\n\nFull text of joint declaration on start of South Korea-EU free trade talks\nSEOUL, May 6 (Yonhap) -- The following is the full text of a joint\ndeclaration on the beginning of South Korea-EU free trade negotiations\nas the two sides are set to launch the first round of formal talks\nfrom Monday through Friday in Seoul.\n\nTrade minister of the Republic of Korea Kim Hyun-chong and the\nEuropean Union Trade Commissioner Peter Mandelson, meeting in Seoul on\nMay 6, agreed to the launch of negotiations on a bilateral free trade\nagreement (FTA). The Ministers agreed to aim at a new generation WTO\ncompatible FTA that would extend beyond present agreements and build\ntowards future multilateral negotiations. The ministers agreed that\nbilateral liberalization of goods and services would contribute to the\nstrengthening of the multilateral trading system and promised to\ncooperate in promoting an early and successful conclusion of the Doha\nDevelopment Agenda.\n\nThe ministers said that a comprehensive and high-level FTA that is\nconsistent with WTO rules and principles would open new markets and\nexpand opportunities for Korean and EU businesses while giving\nvaluable momentum to liberalization of global trade. They also noted\nthat the EU is Korea's second largest trading partner and Korea is the\nfourth largest non-European trading partner for the EU.\n\nEmphasizing the need for rapid progress in the FTA negotiations so as\nto allow for its timely conclusion, the ministers promised to achieve\nsignificant progress over the scheduled rounds comprehensively\ncovering areas that include tariff and non-tariff aspects of trade in\ngoods, services and investment, and regulatory issues, such as\nintellectual property rights, government procurement and competition.\n\nThe ministers reaffirmed their strong commitment to the primacy of the\nmultilateral trading system and reconfirmed that the bilateral\nliberalization of trade and investment through new generation FTAs\nwould contribute to the strengthening of the multilateral trade\nsystem.\n\n(END)\n\n\n--\nHeeSeob Nam\nIPLeft (www.ipleft.or.kr)\nMobile: +82 11 470 1180\nhurips@gmail.com\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}