{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"Health Week\" <mailings@mail.cnn.com>", "subject": "This Week in Health", "body": "\n\n\n\n\nCNN.com - Health Week\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThursday, May 3, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFDA expands antidepressant warning to young adults \nYoung adults beginning treatment with antidepressants should be warned about an increased risk of suicidal thoughts and behavior, federal health officials said Wednesday. The Food and Drug Administration proposed labeling changes that would broaden the \"black box\" warning that currently appears on all antidepressants, which applies only to children and adolescents, to include adults 18-24 during the first month or two of treatment with the drugs, the agency said.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGuide promotes Latin American Diet Pyramid \nA new food pyramid, designed to encourage Latinos to eat healthier, emphasizes the benefits of grains and tubers such as maize, quinoa and plantains, and tropical fruits such as mangos and papayas.\nFULL STORY\n\n\n\n\n\n\nExperts skeptical of 'Master Cleanse' detox diet \nMix lemon juice, maple syrup, bottled water and cayenne pepper and you've got a key element of the detoxifying diet known as the \"Master Cleanse,\" touted by celebrities including Beyonce Knowles.\nFULL STORY\n\n\n\n\n\n\nUnexpected heart problems seen in bone drugs \nTwo research reports suggest a possible link between the bone-building drugs Fosamax and Reclast and irregular heart rhythms in a small number of women who take the medicine for osteoporosis.\nFULL STORY\n\n\n\n\n\n\nHormone therapy may ward off dementia\nNew research suggests that hormone therapy taken soon after menopause may help protect against dementia, but it raises the risk of mental decline in those who do not take it until they are older.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Health Week email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}