{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Thomas Ortega <istop@grill57.com>", "subject": "Master Penis", "body": "\n\nDo you have problems with prescriptions?\nOur pharmacy\nU can restore your health right now. Doesn't matter what the problem is - we have pills to cure everything. Erection Dysfunction, Weight loss, Anti-Depressants, Antibiotics and even more! \nOur site\nLicensed medications you can buy right now!\nWith best regards,\nThomas Ortega\n \n \nMy bystro dvinulis dalshe. Za mnoj, otstavaia na paru shagov, tak zhe besshumno, Kak i brat, peredvigalsia Otshelnik, tozhe vooruzhennyj smerchem. No somneniia menia na etom ne ostavili. Ty mozhesh ego sderzhivat? Dostatochno dolgo, chtoby ty mog ubratsia, serdito provorchal tolstiak. \nI eto bylo samym skvernym vo vsej etoj istorii. Skazhem tak. Zapahom, suliashchem slavu, bogatstvo, Mogushchestvo, pozhiznennoe poklonenie mnogih i mnogih narodov, naseliaiushchih etot Ugasaiushchij mir, v kotorom, k moemu neschastiu, mne dovelos poiavitsia na Svet. Ee neozhidannyj Vopros zastal menia vrasploh: Ty liubil kogda-nibud? Po-nastoiashchemu? Gluboko zhe ia ee zadel, esli ona reshilas sprosit ob etom menia, ne prosto Postoronnego, chuzhogo ej cheloveka, a chuzhaka iz sovsem drugogo mira. To, chto Pritailos v centre kruga, bylo kuda strashnee mertvogo shuta, mechushchegosia v Vozduhe nad golovoj. Po raskrytiiu zagovorov ty u nas mastak, eto Tvoia rabota, no dolzhen zametit, chto dal-rokty v predloge nikogda ne nuzhdalis. Vremia shlo, i ostyvaiushchij mozg mertvogo maga Skoro mog okazatsia bespolezen. I mne snova povezlo. \nI vpervye zhe v zhizni on stoial na boevom postu naravne s ostalnymi, Kak togo trebovala situaciia. Pust luchshe uzh budet pravdoj, golos pryguna napolnilsia oshchutimoj Ugrozoj. Perenesennoe napriazhenie ne moglo ne otrazitsia na Sostoianii, i ia ne udivilsia svoej slabosti. Obychnyj paren. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}