{"category": "ham", "to_address": "\"toby909@gmail.com\" <toby909@gmail.com>", "from_address": "\"Spielas Bates\" <bates@stat.wisc.edu>", "subject": "Re: [R] parallel processing an lme model", "body": "On 5/28/07, toby909@gmail.com  wrote:\n> Hi All\n\n> Had anyone of you seen if it is possible to split a large lme() job to be\n> processed by multiple cpus/computers?\n\n> I am just at the very beginning to understand related things, but does the lme()\n> use solution finding functions like nlm() mle(), and I-dont-know-what-else of\n> the standard R pagage or does lme come with its own? If the former, has onyone\n> seen how to split an mle() function call to be processed by multiple cpus?\n\nFirst, if you want speed and your model can be fit by lmer I would\nrecommend using lmer or lmer2 from the lme4 package.  These functions\ncan fit models with crossed or partially crossed random effects which\nis often the case for models in very large data sets.  However, they\ndo not provide the facility for specifying correlation structures or\nvariance functions in addition to those implied by the random effects.\n\nBoth lme and lmer end up calling nlminb to do the optimization of the\nlog-likelihood or the REML criterion.  The lmer2 function does not\ncall nlminb explicitly but does use the underlying code from nlminb.\n\nNone of these operations are easily parallelizable.  The only hope for\ngetting a speed boost from multiple CPU cores or multiple processors\nis by using a multithreaded accelerated BLAS (Basic linear algebra\nsubroutines) library (see the R Installation and Administration manual\nfor details).  However, in some cases we have observed that\nmultithreaded BLAS actually slow down the computation.  To check if\nthis is the case for you try the following both with and without\nmultithreaded BLAS.\n\nlibrary(lme4)\ndata(star, package = \"mlmRev\")\nsystem.time(fm1 <- lmer(math ~ sx*eth+ses+gr+cltype\n   +(yrs|id)+(1|tch)+(yrs|sch),\n    star, control = list(grad = 0, nit = 0, msV = 1))\nsystem.time(m1 <- lmer2(math ~ sx*eth+ses+gr+cltype\n   +(yrs|id)+(1|tch)+(yrs|sch),\n    star, control = list(msV = 1))\n\n> In the case if, I would very much appreicate your hint or point to a source\n> where I can read about.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}