{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "drew Roberts <zotz@100jamz.com>", "subject": "Re: [cc-community] Does BY-SA extend to a newspaper?", "body": "On Thursday 19 April 2007 05:29 pm, Terry Hancock wrote:\n> Lawrence Lessig wrote:\n> > I think we need to have a real, extended discussion of this. I like\n> > this proposal, though I don't know enough to say I think it is right.\n> > I'm hopeful the iCommons Summit might be an opportunity to work\n> > through this more carefully.\n>\n> Although I understand the motivation to extend the copyleft to\n> containing works, it presents a number of nasty consequences which I\n> believe have to be avoided if you want it to work (here's a few I can\n> think of right off):\n>\n> 1) \"License the Universe\"\n>\n> Any reasonable use of a work means it is \"contained\" in something else\n> whose license you are not able to, or should not attempt, to control.\n>\n> For example, an HTML page \"contains\" an image. A website \"contains\" an\n> HTML page. The Internet \"contains\" the website.  Therefore, if a\n> copyleft license binds \"containing\" works, then a copylefted image\n> either cannot be published on the Internet period, or the entire\n> Internet must be relicensed!\n>\n> Think of Wikipedia -- is it one work, or millions?\n>\n> Obviously, the courts won't hold that up. So is the plan to leave the\n> scope up to the courts? That seems like a dangerous piece of baiting.\n> They might easily decide to set a precedent against ALL copyleft.\n>\n> I used to think that copyleft was intrinsically limited to what\n> copyright can cover -- and I think that's not a bad rule of thumb to\n> apply to what copyleft *should* be. However, the legal mechanism of\n> copyleft can apparently be used to make just about any requirement you\n> want (\"you must hop on one foot for the rest of your life or your\n> license to this work is revoked\"). Given that this can clearly be taken\n> to unreasonable extremes, where should the line be drawn?  I think it's\n> a very good idea for the line to be drawn by license stewards like CC\n> instead of leaving it up to lawsuits.\n\nPlease read this link again:\n\nhttp://lists.ibiblio.org/pipermail/cc-community/2007-April/001702.html\n\nand consider the phrase therein:\n\n\"If you use the work in another work where a copyright arises\"\n\n(and respond to it in its own right if you would be so kind)\n\nAny container situation where there is no copyright on the container as a work \nwill not cause this to kick in. That gets rid of a lot of your above \nconcerns, right?\n\nI also speak to the siblings in the container where the container gets a \ncopyright as well.\n\nAgain:\n\n\"In cases where no copyright would arise from putting the BY-SA work together \nwith other works, none of this would apply.\"\n\nSo siblings are in the clear totally where no copyright arises on the \ncontainer as a work.\n>\n>\n> 2) \"Balkanization of the Commons\"\n>\n> It is the nature of copyleft licenses to conflict with each other. We\n> have no really good solution for defining \"a free license\" so that we\n> can make the sort of claim where a license binds other licenses simply\n> to be \"free licenses\".\n>\n> We can't even agree within the free software/free culture community what\n> exactly constitutes a \"free license\", so how can we expect the courts to\n> figure it out?\n>\n> We are saved to a degree by the limited scope of existing copyleft\n> terms. They allow any license (including other free licenses) to be\n> applied to \"mere containers\" and to siblings within the same container,\n> so they prevent lock-ups due to license incompatibility.\n\nThere would be no attempt to force the siblings in the container to carry the \nexact same license under any circumstances since they are not derivatives, \nonly derivatives are derivatives. ~;-) You would use the right to copy \nprovisions to specify OK licenses for siblings in the container which has a \ncopyright and not try and control siblings at all where the container does \nnot get a copyright. (I even propose relaxing the sync provisions for \nsounds/video if this can work.)\n>\n>\n> 3) \"My Brother's Keeper\"\n>\n> Defining the \"container\" of a work as a \"derivative\" so that it must be\n> licensed entirely under the same terms also binds all sibling works.\n\nCould be, but does it have to be?\n>\n> Thus, if I have an HTML page with GFDL, GPL, By, and By-SA images in it\n> (not to mention \"verbatim use only\", \"By-NC-ND\", or \"fair use\" images),\n> then -- if a container-binding copyleft is applied to any of the above\n> \"free\" licenses -- the licensing is locked up and I cannot publish.\n>\n>\n> As things stand we have a situation with some admitted faults -- it may\n> be a little *too* free. But trying to sew up the loopholes is going to\n> cause problems, and I'm not convinced that the cure wouldn't be worse\n> than the disease.\n\nI think we can do better. Like I have said before in other situations, it is \nearly days yet and we have a lot of thinking and experimenting to do yet.\n>\n> Cheers,\n> Terry\n\nall the best,\n\ndrew\n-- \n(da idea man)\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}