{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "915a 6/16 Update: Computer recovery continues; Williams sets new endurance mark", "body": "\n\n\n\n\n915a 6/16 Update: Computer recovery continues; Williams sets new endurance mark\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 66\nPosted: 8:30 AM, 6/16/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-63 (06/15/07): Russians restart computers; faulty secondary power switch possible culprit; more troubleshooting planned\n   SR-64 (06/15/07): Spacewalkers begin solar array retraction effort\n   SR-65 (06/15/07): Spacewalk ends; solar array successfully retracted; news briefing; combining takes\n   SR-66 (06/16/07): Russians activate revived computers; continue tests and troubleshooting\n\n=================================\n\n8:30 AM, 6/16/07, Update: Computer recovery continues; Williams sets space endurance record\n\nRussian flight controllers successfully switched a command-and-control computer over to operational status early today and began the process of re-activating critical systems aboard the international space station after electronic bypass surgery Friday to isolate suspect power supply switches.\n\n\"In the last 24 hours, we've had a lot of successes,\" Flight Director Holly Ridings said early today.\n\nEarly today, outgoing space station astronaut Sunita Williams, launched to the lab complex aboard shuttle Discovery last December, passed the 188-day four-hour mark, setting a new space endurance record for female astronauts. The old record was set by Shannon Lucid during a stay aboard the old Russian Mir space station.\n\nAtlantis delivered Williams' replacement - Clay Anderson - to the international space station and if all goes well, Williams will return to Earth next week aboard the shuttle.\n\n\"We think Suni's awesome, I mean she's been just so much fun to have on orbit,\" Ridings said. \"She's competent, intelligent, laid back and we've just really, really enjoyed her stay on orbit.\"\n\nToday, Williams should have time to catch up a bit briefing Anderson on the subtleties of space station operation.\n\n\"One of the by products of doing all this wonderful troubleshooting in the last couple of days is we haven't done some of our standard work,\" Ridings said, \"which is to transfer items back and forth between the shuttle and station and to have some time for Suni and Clay to talk to each other and do some what we call handover, where Suni will teach him sort of the rules of the road, where things are and how things are done. So hopefully today, the crews will get to take a deep breath now that the systems are a little more (healthy).\"\n\nThe astronauts face a relatively light schedule, preparing tools for a fourth and final spacewalk Sunday and holding a traditional joint crew news conference this evening at 7:43 p.m. Here is an updated timeline of today's activities (in EDT and mission elapsed time; includes rev. L of the NASA television schedule):\n\nDATE/EDT...DD...HH...MM...EVENT\n\n06/16/07\n\n09:38 AM...07...14...00...ISS crew wakeup\n11:08 AM...07...15...30...STS crew wakeup\n11:08 AM...07...15...30...Oxygen transfer preps\n02:03 PM...07...18...25...Post-EVA transfer and reconfig\n03:08 PM...07...19...30...Joint crew meal\n04:00 PM...07...20...22...Mission status briefing on NTV\n04:08 PM...07...20...30...Spacesuit swap\n04:38 PM...07...21...00...EVA-4: Tools configured\n06:18 PM...07...22...40...EVA-4: Procedures review\n07:18 PM...07...23...40...Joint crew photo\n07:43 PM...08...00...05...Joint crew news conference\n08:30 PM...08...00...52...Mission status briefing on NTV\n09:53 PM...08...02...15...EVA-4: Mask pre-breathe and tool configuration\n11:00 PM...08...04...22...Daily video highlights reel on NTV\n11:08 PM...08...03...30...ISS crew sleep begins\n11:38 PM...08...04...00...STS crew sleep begins\n\nEarlier this week, around the time the Atlantis astronauts were installing a new solar power truss, the guidance computer system in the Russian segment of the station, a three-computer set known collectively as the terminal computer, suffered a malfunction and crashed. An automated reboot procedure was then executed to shut down and restart all three terminal computer \"lanes\" and the three machines making up the command-and-control system central computer. The reboot procedure didn't work.\n\nAfter two days of fruitless, around-the-clock troubleshooting, engineers disconnected the computers from U.S. solar power early Friday on the theory something in the circuitry was producing \"noise\" or otherwise interfering with the operation of the German-built computers. The computers are equipped with power supplies that include protective low-voltage circuitry sensitive to such noise.\n\nWhen commands were sent to activate the isolated computers, they failed to respond properly and engineers feared the worst - a subtle software bug or a hardware failure that at some point, in a worst-case scenario, could force the station crew to abandon ship.\n\nThe Russians ultimately determined that two computers - one terminal lane and one central lane - had suffered hardware failures in their secondary power supplies earlier in the week. So they asked station commander Fyodor Yurchikhin and flight engineer Oleg Kotov to bypass the suspect power supply circuitry in the other four computers.\n\nTo the relief of the U.S. and Russian flight control teams, the procedure worked and the computers booted normally.\n\n\"There were a lot of really smart people here and over in Moscow working literally around the clock to try to figure out what we needed to do,\" Ridings said early today. \"And I'm happy to report we have established some communication with the computers on the Russian segment.\"\n\nThe computer initially were allowed to run in self-test mode to verify their general health. Overnight, during passes over Russian ground stations, Russian engineers \"started doing some further troubleshooting,\" Ridings said. \"The first thing they were able to do was bring up one of those two lanes of the central computer to an operational state where they could send commands to it, receive some telemetry. We managed to get the central computer ... on the U.S. side to communicate so now we've got the top-tier computer in both the Russian segment and the U.S. segment talking to each other. ... So that was great progress.\n\n\"The next step is the terminal computer, which is the guidance and navigation computer on the Russian segment, or SMTC,\" Ridings said. \"They turned that computer on, it took a little more work, but just as before, they managed to synch up with the U.S. GNC computer and that SMTC and have them talk to each other as well. They were working on getting all the software modes set right and get everything looking stable and steady so that kind of bit by bit we can check and make sure our attitude control system is working properly.\n\n\"So of the four computers I've mentioned - Russian central computer, U.S. central computer, U.S. navigation computer and Russian navigation computer - all four of them are talking to each other, which is a huge improvement from yesterday.\"\n\nAfter assessing the operation of the machines, the Russians switched one central computer lane and one terminal lane to operational mode.\n\n\"Now that we've got command capability and telemetry, our Russian colleagues are going to start bringing al the systems back on line, kind of take baby steps and do it bit by bit,\" Ridings said. \"Same thing with our attitude control system.\"\n\nEarly today, Russian flight controllers asked Yurchikhin and Kotov to hotwire the two computers with failed power supply switches to get all of the machines in the same state.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}