{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Fred Hawkins <isteber@grandalliance.com>", "subject": "Say \"YES\" to perfect sex!", "body": "\n\nCan't have sex like you had 10 years ago? Looking for an effective and cheap solution?\nGo to the site\nWith Viagra from RX Online Drug Store you will have perfect sex.\nClick here\nThere is no need to visit your local drug store at all.\nWith best regards,\nFred Hawkins\n \n \nBeskrylye, probormotal ia. Mertva lish moia fizicheskaia obolochka, El. Pust eta problema tebia ne volnuet. Kengsh ruhnul licom vniz i bolshe ne shevelilsia. \nSilno. Ne veriu, skazal ia sebe. Vy vse znaete pravila Desiat metrov dlia boia! Davaj, davaj, ne zaderzhivaj! Chem shire krug, tem luchshe Predstavlenie! Poshevelivajtes! Ty, nosatyj, kuda presh, glaza poterial, chto Li? A nu ubiraj svoi hoduli, poka ia ih tebe v zadnicu ne vstavil! Nu nikogda Nikakogo poriadka, galt vas zaderi! Zhivee dvigajtes, zhivee, eshche nemnogo. Posle nedolgih poiskov v rukah oseli plastikovye upakovki S konservirovannym miasom, ryboj v souse, kartofelnymi chipsami i Bezalkogolnym pivom. Vdobavok ia ovladel zachatkami magii leshuka, Vyrazhavshejsia v umenii upravliat vneshnimi energiiami prostranstvennyh Struktur, i posle etogo dostig predela usvaivaemosti materiala. A tam, na ploshchadi, tvoj Hranitel byl v dejstvii? O net. Ia ne poveril svoim glazam gorela ego ruka! Plamia vyryvalos Priamo iz palcev! Horosho, chto ia vovremia eto vspomnil, Niks, ne tak li? Kstati, kak tebe Moj fokus? Tebe ne meshalo b emu nauchitsia. Ia pozhal plechami, vnutren!\nne posmeivaias. \nEvrial byl priznal Podmasterem Vozduha, Hotia i ochen slabym ego ksomoh lish slegka pogolubel. chto zh, ia eto predpolagal, mrachno soglasilsia ia. No teper ia vizhu, chto uzhe Opozdal. Celitel, mne naplevat, pochemu on eto sdelal, no ty mne skazhi vot Chto: eto chto-nibud meniaet dlia nas, to, chto Dos mertv? Vriad li, uverenno otvetil trans. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}