{"category": "ham", "to_address": "Neil Losin <neil.losin@gmail.com>", "from_address": "Uwe Ligges <ligges@statistik.uni-dortmund.de>", "subject": "Re: [R] klaR stepclass", "body": "\n\nNeil Losin wrote:\n> Hi,\n> \n> I'm trying to use \"stepclass\" to do a stepwise variable selection with\n> method=lda. I keep getting this warning message, which shows up once\n> for each variable added to the model during variable selection:\n> \n> Warning message:\n> error(s) in modeling/prediction step in: cv.rate(vars = c(model,\n> tryvar), data = data, grouping = grouping,\n\nThis means that in some steps of the stepwise procedure, one of the \nfunctions for estimating the parameters or predicting (in this case lda \nor predict.lda)  generates an error. This typically happens if you \ncannot invert the covariance matrix in one of the intermediately tried \nmodels due to singularity (examples for such a case are collinear \nvariables or an unluckily chosen partition of the data for \ncross-validation).\n\n\n> I don't know how to interpret this warning. I do not have a separate\n> data set for cross validation. Is this important, or will \"stepclass\"\n> do leave-one-out cross-validation in the absence of other\n> cross-validation data?\n\nBy default, it uses 10-fold cross-validation which can be changed to \nleave-one-out by specifying the argument\n   fold = nrow(dataframe)\n\n> Also, when I run \"stepclass\" several times with identical parameters,\n> it will give me a slightly different \"best\" model each time. It seems\n> to me that it should always return the same model, as long as the\n> dataset and call are the same. Am I missing something? Is there some\n> randomization going on behind the scenes that I'm unaware of?\n\nYes, 10-fold cv is performed with randomly chosen partitions of the \ndata. You can either run leave-one-out cv (which is rather time \nconsuming) or use set.seed() in order to get reproducible results.\n\nUwe Ligges\n\n\n> Thanks in advance,\n> Neil Losin\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}