{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] AP: Chan: Bird Flu Huge Global Health Threat", "body": "Chan: Bird Flu Huge Global Health Threat\n\nBy ELIANE ENGELER\nThe Associated Press\nWednesday, May 16, 2007; 7:42 PM\n\nGENEVA -- The U.N. health chief on Wednesday harshly criticized\ncountries that do not share their H5N1 virus samples, accusing them of\ncrippling the world in the fight against a possible flu pandemic.\n\n\"If you do not share the virus with us ... I would fail you,\" said Dr.\nMargaret Chan, Director-General of the World Health Organization, in a\nspeech to the agency's 193 member countries. Without H5N1 samples from\naffected countries, Chan said that \"you are tying my hands, you're\nmuffling my ears, you're blinding my eyes.\"\n\nChan did not single out any country by name, but Indonesia and China\nhave been the main holdouts. Indonesia in particular has been locked in\na virus stand off with WHO since last year.\n\nThough Indonesia's health minister Tuesday announced that the country\nhad shared three viruses with a WHO-accredited laboratory in Japan, it\nis uncertain whether further viruses will be shared. Indonesia has\ncomplained that the viruses it shares would be used for vaccines that\nits population cannot afford.\n\nChina has also been less than forthcoming with bird flu samples. No\nH5N1 viruses have been received from China for nearly a year _ during\nwhich time Beijing has reported several human bird flu cases. China is\nreadying five virus samples to be shared with WHO, but it is unknown\nwhen they will actually be sent, WHO spokesman Gregory Hartl said.\n\nChan said that a flu pandemic would be the greatest threat to global\nhealth in the 21st century. Tracking H5N1's evolution is essential to\ndetermine when virus mutations might enable it to be more easily spread\nbetween people.\n\nWithout current bird flu samples, Chan warned that the global\ncommunity's current stockpiles _ numerous countries have bought\nanti-viral and pre-pandemic vaccine stockpiles _ would be wasted. \"I\nneed the virus to track new resistance patterns so that your investment\nin antivirals does not go down the drain,\" Chan said.\n\nSeveral experimental pre-pandemic vaccines based on H5N1 exist, but as\nthe virus continues to mutate, scientists need to match the latest\ncirculating strain to that in the vaccine, to ensure that the vaccines\nwould work.\n\nThree draft resolutions on the sharing of bird flu samples and access\nto a future pandemic vaccine are being scrutinized by an expert group\nat WHO's annual gathering.\n\nKey to the WHO's disease surveillance system, including early warning\nof a flu pandemic, are the WHO's revised International Health\nRegulations on preventing and responding to infectious disease threats\nwhich will come into effect June 15.\n\nMany countries _ including the U.S. _ have already adopted them, though\nthey remain voluntary. The new health regulations oblige countries to\nreport new disease threats with global public health significance, such\nas new flu subtypes. They also allow the WHO to act on credible\ninformation sources, rather than being reliant strictly on official\ngovernment channels. The regulations are not legally binding.\n\nChan said she would do her best to help countries implement the\nregulations.\n\n\"We are not afraid of difficulties. What we're afraid of, is lack of\ncommitment on your part to deliver,\" she told WHO member states.\n\n___\n\nAP Medical Writer Maria Cheng contributed to this report.\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}