{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "pastiche: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\nWelcome To Our Wedding Registry\nBy registering online, the bride and groom have access to an extensive name brand selection.\n Wedding Registry\nADVERTISEMENT\nWord of the Day for Monday, May  7, 2007\npastiche \\pas-TEESH; pahs-\\, noun:\n1. A work of art that imitates the style of some previous work.\n2. A musical, literary, or artistic composition consisting of selections from various works.\n3. A hodgepodge; an incongruous combination of different styles and ingredients.\nThe figure was a pastiche, assembled from fragments: a Greek head, a Roman imperial cuirass, and halo, limbs, weapons, and crocodile fashioned by a Venetian craftsman. -- Patricia Fortini Brown, Venice and Antiquity\nWhoever said the unexamined life is not worth living apparently never intended to go into book publishing, where there is almost no research and where much of the conventional wisdom is a pastiche of folklore, myth and wishful thinking. -- Edwin McDowell, \"Publishing: And They All Said It Wouldn't Sell\", New York Times, February 6, 1989\nRather, the aim is to create a composite reflection of how New York got this way, how its bridges and subways were built, how its power structure and political culture evolved, how its pastiche of unique neighborhoods developed, collapsed and rose again, and how some of its citizens survive on the bottom rung and others succeed or fail on the top. -- Sam Roberts, \"The 10 Best Books About New York\", New York Times, February 5, 1995\nPastiche comes from Italian pasticcio, \"a paste,\" hence \"a hodgepodge, literary or musical,\" ultimately from Latin pasta, \"paste.\"\nDictionary.com Entry and Pronunciation for pastiche\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9533318-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}