{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"Crabtree & Evelyn\" <crabtree@mailings.crabtree-evelyn.com>", "subject": "New Gifts for Mother's Day & Free Shipping", "body": "\n\nCrabtree & Evelyn Email Exclusives\n\n\n\n\nIf you are not able to view this message, click here.\nPlease add Crabtree & Evelyn (crabtree@mailings.crabtree-evelyn.com) to your email address book.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   \n\n\t\t\tOur gift collection of naturally-inspired spa and beauty remedies will delight, relax \n\t\t\tand inspire her - whether she's an avid gardener, spa-lover, cook or fragrance collector. \n\t\t\t\nIn-store:\n\t\t\tFor more gift ideas, visit your local store. Why not create your very own Mother's \n\t\t\tDay gift? Select one of our new gift containers and fill it with your mom's favorite treats. \n\t\t\tView in-store specials\n\nRemember: Free online shipping with any $25 purchase.\n\t\t\tFor guaranteed Mother's Day delivery order by 10:00 AM EST on May 10th.\n\t\t\t\nShop:\n\t\t\t• Mother's Day favorites\n\t\t\t• new India Hicks Island Living\n\t\t\t• pretty, vintage-inspired gifts\n\t\t\t• perfect spa packages\n\t\t\t• natural goodies\n  \n\n\n\n\n\n\n\n\n\n\nCUSTOMER SERVICE  |  STORES  |  CONTACT  |  COMPANY  |  PRIVACY POLICY\nFORWARD TO A FRIEND\n\n\n\n\n\n\n\n\n\nTERMS & CONDITIONS FOR SPECIAL OFFERS ONLINE\n\t\tOffers valid at www.crabtree-evelyn.com. Not valid at Crabtree & Evelyn retail or outlet stores. \n\t\tPlease note that gifts with purchase will not show on your order at checkout but will be included automatically in your shipment when you purchase the required amount from any of our collections. We do not split orders. All items in one order will be sent to one shipping address. Offer is good while supplies last. May not be combined with other offers or coupons. Minimum purchase amount does not include taxes or shipping charges. Purchase of Gift Cards do not count toward special offer. Crabtree & Evelyn retains the right to substitute gift.\nTERMS & CONDITIONS FOR SPECIAL OFFERS IN STORE \n\t\tOffers valid at participating Crabtree and Evelyn retail stores. Not valid in Crabtree & Evelyn independent specialty boutiques. Offers are good while supplies last. May not be combined with other offers or coupons. Minimum purchase amount does not include taxes or shipping charges. Limit 4 per customer. Purchase of Gift Cards do not count toward special offers.\nTERMS & CONDITIONS FOR FREE SHIPPING ON ORDERS OF $25 OR MORE\n        Free shipping on orders of $25.00 or more and is valid online only. Shipping Offer applies to standard shipping only. Orders should take 3-7 days to arrive. All purchases are subject to bank authorization prior to processing. Only authorized purchases will be processed and shipped.\nEMAIL EXCLUSIVES\n        You are receiving this E-mail Exclusive from Crabtree & Evelyn because you requested it. Information provided to Crabtree & Evelyn is used solely for the purpose of providing you with product information and custom special offers. Your information is never sold, given to, or viewed by any third party. If you no longer wish to receive email from us or wish to update your subscription, click here to unsubscribe or update your address.\nCRABTREE & EVELYN, 102 Peake Brook Road, Woodstock, CT 06281\n\n\n\n\n\n\n\n"}