{"category": "ham", "to_address": "R-help@stat.math.ethz.ch", "from_address": "Gregory Warnes <gregory.warnes@mac.com>", "subject": "[R] JOB: Biostatistician/Statistical Programmer/Data Analyst", "body": "Biostatistician/Statistical Programmer/Data Analyst\n\nThe Department of Biostatistics and Computational Biology, University  \nof Rochester Medical Center is seeking a Biostatistician/Statistical  \nProgrammer/Data Analyst to assist with several center-wide immunology  \nand infectious disease research studies. The biostatistician will  \nwork with senior statisticians and other senior biomedical  \ninvestigators to prepare data analysis plans, perform study design  \nand sample size calculations, clean data, perform data analyses on  \ncomplex datasets, produce tables and graphs in publication-quality  \nform, and present results to senior investigators. Additional duties  \ninclude review of data collection tools and data quality control  \nplans. Basic\n\nQualifications: Master's degree in Biostatistics, Statistics, or  \ncombination of education and experience. At least 3 years of  \nexperience. Knowledge of statistical techniques and statistical  \nprogramming in SAS (including SAS graphics) or S-Plus/R is also needed.\n\nAdditional Qualifications: Excellent technical, computer, and  \nanalytical and problem-solving skills. Strong interpersonal, customer  \nservice and communication skills. Ability to work independently,  \nunder supervision, and as a part of a team.\n\nInterested parties please contact Kevser Turhan via email:\n\tKevser_Turhan@urmc.rochester.edu\nor via postal mail:\n\t601 Elmwood Avenue, Box 630,\n\tRochester, NY 14642\nor visit our employment web site:\n\thttp://www.urmc.rochester.edu/smd/biostat/employment.html\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}