{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Glenna Chacon\" <pofchiradiyiltyd@chiradiyil.org>", "subject": "Healthy living with less fat", "body": "\nMake yourself more attractive to others\n\n\n\n\n\n\nAnatrim – The newest and most fascinating product for over-weight people is now readily available – As shown on Oprah.\n\n\nCan you remember all the times when you appeal to yourself to do any thing for being saved from this fastly growing pounds of fat? Happily, now no big price is to be paid. With Anatrim, the ground-breaking kilos-melting blend, you can get healthier life style and become really slimmer. Just look at what people say!\n\n\n\n\"It’s rather difficult to admit it but I was a junk food addict. \n\n\nI greedily swallowed up all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis ruinous passion finished after I started course of taking Anatrim! \n\n\nGod,\n\n\n\n\n my appetite decreased, \n\n\nspirits increased and I’m the happiest person 21 pounds in 2.5 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person in the world!\"\n\n\n\n\n\nLinda F., Washington\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nYou can't fancy how I abhorred being mocked at school. \n\n\n\n\nI detested my stoutness and I detested myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nThis stuff literally took me out of this horror! Many thanks and a great respect to you, guys.\"\n\n\n\n\n\nMike Brown, Boston\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was luckily saved! I went into this circle, depression – eating more – just more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce one of my friends showed me web page and I ordered up Anatrim at the same time. \n\n\nThe final result was great, my appetite came to acceptable level, I was in a good mood oftener, and, certainly, I tightened my belt with no regrets. And you see me, the bed became cool also!\"\n\n\n\n\n\nFrank\n\n\n\n\n There is a lot of thanks happy people leave after taking Anatrim. Don’t you wanna join the tens of thousands of slim buyers and try this original appetite suppressing power lifting product now!\n\n\nDon’t lose the chance!\n\n\n\n\n"}