{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Littlefield, Tyler\" <compgeek13@gmail.com>", "subject": "Re: Hello...", "body": "I'd suggest learning with a command line.\nYou can also get speechd-up, and other programs to give you software speech,\nrather than using gnome.\nIt's accessibility is still being worked on, while the linux command line\nhas been used for a long time.\n\nThanks,\n~~TheCreator~~\n[My programs don't have bugs; just randomly added features]\nmsn:\ncompgeek13@gmail.com\naim: st8amnd2005\nskype: st8amnd127\nvertigo head coder\nweb: tysdomain.com\n----- Original Message ----- \nFrom: \"Cody Hurst\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Thursday, June 14, 2007 12:40 PM\nSubject: Re: Hello...\n\n\n> Hello Mike,\n>\n>   To get ou up to speed, there is a graphical desktop called Gnome, whihc\n> supports a screen reader called Orca. If you download the live CD of\nUbuntu\n> 7.04, you can use the screen reader right fromthe live CD. I wish I had\ntime\n> to explain it all, but visit http://live.gnome.org/Orca and read all about\ni\n> there. I would say orca is comparable to jaws or window eyes the team who\n> developes is in my opinion is the bes in the industry of open source\n> sofware.\n> ----- Original Message ----- \n> From: \"Gaijin\" \n> To: \n> Sent: Thursday, June 14, 2007 2:54 AM\n> Subject: Hello...\n>\n>\n> >     Hello all,\n> >\n> >     Just joined the list and thought I's say \"hello\" to everyone.\n> > Really nice to find a place like this.  I'm a rabid Linux fanatic who\n> > went blind from diabetic retinopathy in August of '02, and I've been\n> > pretty much offline ever since.  Finally broke down and upgraded my\n> > system to support WinXP and quickly heard about SpeakUp for Linux.  I'm\n> > in the process of looking for a supported speech synth for SpeakUp, so\n> > I'm still stuck in Windows on a 30 minute Win-Eyes time limit.  I hope\n> > to soon get Slackware up and running, and soon be able to contribute to\n> > the SpeakUp effort right along-side everyone.  I'm presently playing\n> > around with a copy of Oralux and learning the features.  Just need that\n> > speech synthesizer, and I should be off and running.  Thank you for all\n> > your efforts.  It is well appreciated.\n> >\n> >     Best regards,\n> >         Michael \"Foreign White Devil\" Ferranti\n> >\n> > _______________________________________________\n> > Speakup mailing list\n> > Speakup@braille.uwo.ca\n> > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}