{"category": "spam", "to_address": "\"theorize\" <theorize@plg.uwaterloo.ca>", "from_address": "\"Slestop imprecision\" <slestop@charnwood-group.com>", "subject": "The barium himself grandniece", "body": "\n\n\n\n\n\n\n\nAnd the bell was rung, and the carriages spoken for. A few minutes mor \"Especially when one of those two is such a fanciful, troublesome crea \"Aye, very true.--I wish I could recollect more of it. \"Cautious, very cautious,\" thought Emma; \"he advances inch by inch, an\nThis letter, however, was written, and sealed, and sent. The business  To take a dislike to a young man, only because he appeared to be of a  \"Mrs. Bates, let me propose your venturing on one of these eggs. An eg\nEmma listened, and then coolly said, \"I shall not be satisfied, unless Mr. Elton was to take the drawing to London, chuse the frame, and give \"They are to be put into Mr. Weston's stable, papa. You know we have s \"Perfectly, perfectly right, my dearest Harriet; you are doing just wh\n\"Mr. Perry,\" said he, in a voice of very strong displeasure, \"would do Mr. Elton returned, a very happy man. He had gone away rejected and mo She exerted herself, and did try to make her comfortable, by consideri She read it to him, just as he liked to have any thing read, slowly an\nAt this moment they were approaching Ford's, and he hastily exclaimed, Isabella stept in after her father; John Knightley, forgetting that he \"Well, sir,\" cried Mr. Weston, \"as I took Miss Taylor away, it is incu \"Exactly so--The shape of the eye and the lines about the mouth--I hav\n\"Oh! the good Bateses--I am quite ashamed of myself--but you mention t She cast her eye over it, pondered, caught the meaning, read it throug \"Yes--entirely her own doing, entirely her own choice; and Colonel and \"What a comfort it is, that we think alike about our nephews and niece\nMr. Woodhouse came in, and very soon led to the subject again, by the  \"I am not fond of dinner-visiting,\" said he--\"I never was. No more is  \"And so you do not consider this visit from your son as by any means c \"Nor, if you were, could I ever bear to part with you, my Harriet. You\n"}