{"category": "ham", "to_address": "\"Liu, Ningwei\" <ningwei.liu@countryfinancial.com>", "from_address": "Roger Bivand <Roger.Bivand@nhh.no>", "subject": "Re: [R] Graphically show population density for a specific\n geographicarea using R", "body": "On Mon, 21 May 2007, Greg Snow wrote:\n\n> 1. Yes you need a shape file with that information.\n> \n> 2. One place to look is:\n> http://www.census.gov/geo/www/cob/bdy_files.html There are shapefiles\n> (the .shp ones) for counties and zip codes (as well as many other\n> things).  These work pretty directly with the tools in the maptools and\n> sp packages.\n> \n> 3. Read the .shp file in using maptools, the .dbf information is\n> automatically read in as well (with whatever details come with the\n> shapefile), then look at the structure of what you read in, you will see\n> the data frame and you should be able to just add your data into that\n> data frame, or use it seperately.\n\nwget http://www.census.gov/geo/cob/bdy/zt/z500shp/zt17_d00_shp.zip\nunzip zt17_d00_shp.zip\nR\n\nill_zip <- readShapePoly(\"zt17_d00.shp\", proj4string=CRS(\"+proj=longlat\"))\nnames(ill_zip)\nsummary(ill_zip)\nplot(ill_zip, axes=TRUE)\n\nsuggests that there is no useful attribute data in the shapefile. It is in \ngeographical coordinates, so that the AREA variable is not in useful \ncoordinates. If you look at the codes, you'll see that some are \nrepresented by multiple polygons, especially the HH codes (water \nfeatures). Also note that ZCTA are not the same as Postal ZIP Codes, \naccording to the FAQ.\n\nThe easiest way to map a variable at the moment is:\n\nspplot(ill_zip, \"AREA\")\n> ill_zip$HH <- FALSE\n> ill_zip$HH[grep(\"HH\", as.character(ill_zip$NAME))] <- TRUE\n> spplot(ill_zip, \"HH\")\n\nonly AREA doesn't tell you anything. You'll need to look for data for\nZCTAs or similar, and if you need to compute the areas, project to\nsomething suitable and extract the values from the underlying\nSpatialPolygons object.\n\nFinally, you'll need up-to-date numbers of inhabitants, as at this scale, \na housing development can easily date your data.\n\nI suggest you follow up on R-sig-geo.\n\nRoger\n\n> \n> 4. plot.Map has an option auxvar, though it is now prefered to use the\n> plot methods for the more specific objects (SpatialLinesDataFrame object\n> from the readLinesShape function).  I would expect that they would have\n> an auxvar or similar argument also.  Or you can decide what color you\n> want to use, plot the overall map, then add each county/zipcode\n> individually using the specified color.\n> \n> Hope this helps,\n> \n> \n\n-- \nRoger Bivand\nEconomic Geography Section, Department of Economics, Norwegian School of\nEconomics and Business Administration, Helleveien 30, N-5045 Bergen,\nNorway. voice: +47 55 95 93 55; fax +47 55 95 95 43\ne-mail: Roger.Bivand@nhh.no\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}