{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\nPerformance \n\t\t\tBenchmarking For Energy Utilities\nSeattle, WA\n            May 23-24, 2007\n\nPandemic \n\t\t\tPreparedness For Utilities\nSeattle, WA\n            May 23-24, 2007\n\n\nCapacity \n\t\t\tMarkets\n\n\t\t\tWashington, DC\n\nJune \n4-6, 2007\n\nCoal-to-Liquids \n\t\t\tFinance and Development Summit\n\n\t\t\tNew York, NY\n\nJune \n4-6, 2007\n\n\nStrategies for \n\t\t\tBidding Ancillary Services in LMP Markets\n\nIndianapolis, IN\n\nJune 6-7, 2007\n\n\nIntro to Electric \n\t\t\tUtility Systems for Non Engineers\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nDistributed \n\t\t\tEnergy Resources-Emerging Business Models for Utilities\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (May 11, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 11, 2007\n\n\nMay 11, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for May 11, 2007  \n\n\n\nFirst Enercast Featured Articles for May 11, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 11, 2007 PowerMarketers Industry Publications\n\n\n\nCarbon Market for Emission Reductions Under Kyoto Protocol's CDM (UtiliPoint.com - May 11, 2007)\n\n\n\nUtiliPoint.com - May 11, 2007 - The Kyoto Protocol established the Clean Development Mechanism (CDM) under the auspices of the United Nations Framework Convention on Climate Change (UNFCCC) in December 1997.\n\n\nMay 11, 2007 PowerMarketers Industry Publications\n\n\n\nA Wise Grid (EnergyBiz Insider - May 11, 2007)\n\n\n\nEnergyBiz Insider - May 11, 2007 - While Americans are talking about clean air and fuel diversity, a lot of policymakers are speaking about energy reliability and the mechanism by which such power is delivered to homes and businesses.\n\n\nMay 11, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nDuke CEO pushes selling and saving energy\n\n\n\nMay 10--Depending on which speech he makes on a given day, James E. Rogers, Duke Energy's chief executive, has been described as a visionary, a self-promoter and an enigma.  Rogers meets privately with critics, embraces environmental causes, proposes curbing greenhouse-gas emissions to fight global warming. All the while he says the Carolinas need new coal-burning and nuclear power plants. ...\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nDuke moving ahead with coal-fired unit\n\n\n\nMay 10--Duke Energy Corp. plans to move ahead with building just one coal-fired power unit in Western North Carolina, Chief Executive Jim Rogers said at the company's annual shareholders meeting this morning.  Environmentalists opposed the Charlotte company's original 2005 request to the N.C. Utilities Commission to build two 800-megawatt power units at its Cliffside facility, located in the Blue ...\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nState OKs NIPSCO rate change\n\n\n\nMay 10--State regulators have approved the biggest change in NIPSCO natural gas charges in more than a decade and approved a $4 million energy-efficiency program that could result in savings for customers.  Consumer groups who spent months negotiating with NIPSCO over the changes say it will put the utility on the same side as customers when it comes to conservation efforts.\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nProgress Moves Full Steam Ahead On Levy County Nuclear Plant Site\n\n\n\nMay 10--ST. PETERSBURG -- Progress Energy is moving quickly in its evaluation of a site in Levy County for a new nuclear reactor and hopes to submit an application for construction by mid-2008, Chairman and Chief Executive Officer Bob McGehee said Wednesday.  \"I think it's one of the best sites in the country\" for a nuclear plant, McGehee said after the company's annual shareholders meeting in ...\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nKalama power plant put on hold\n\n\n\nMay 10--A new state law, intended to curb emissions of gases warming the globe, has prompted a consortium of public utilities to delay a $1.5 billion coal gasification plant proposed in Kalama.  Energy Northwest on Tuesday asked state regulators to set aside its application to build a 600-megawatt power plant, which would be the first on the West Coast to burn gasified coal.\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nGov't to publish $4b gas transportation tender: The government is negotiating with British Gas for the purchase of natural gas at a price of $4 per BTU.\n\n\n\nMay 10--Sources inform \"Globes\" that the government is set to publish a tender for the distribution to the private sector of the gas that will be purchased from BG Group (NYSE: BRG; LSE: BG) (formerly British Gas). The $4 billion tender is believed to be one of the largest the energy economy will see in the coming years.  According to the plans drawn up by the Ministries of Finance and National ...\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nDeal on TXU legislation unravels: Bill could have killed takeover by splitting utility into three parts\n\n\n\nMay 10--A legislative compromise that could have killed the proposed $45 billion buyout of TXU Corp. unraveled Wednesday, snared by questions over funding of a discount for low-income customers.  The compromise, reached Tuesday by House and Senate conference committee members, would have forced TXU to break into three companies and cut retail electricity prices 15 percent.\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nQuestions arise over Ansonia power plant\n\n\n\nMay 10--ANSONIA -- Some residents and city officials have questions about the plans of Ansonia Copper & Brass to generate its own power.  Officials from the Ansonia-based company and Sasco River Advisors LLC in Southport explained their plans to build a 58-megawatt combined cycle gas and steam electric plant to the Connecticut Siting Council on Wednesday during a hearing at City Hall.\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nElectric rate case hearing concludes: A decision on AEP-PSO is expected in June.\n\n\n\nMay 10--The hearing on a proposed electricity rate increase that could raise bills for more than 500,000 Oklahomans concluded Wednesday.  A final decision on whether rates will increase or even decrease is expected in June. American Electric Power-Public Service Company of Oklahoma has presented a $47.9 million rate increase to state regulators during the last week and a half.\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nMeetings scheduled on new rule aimed at lower emissions\n\n\n\nMay 10--Meetings have been scheduled across the central San Joaquin Valley on a new rule aimed at lowering emissions levels from natural gas and diesel engines. Valley-wide, nearly all stationary and portable engines that are more than 50 horsepower will have to be replaced or retrofitted. The rule's deadlines start to kick in Jan. 1, 2008. The rule falls under the jurisdiction of the San ...\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nProposed power plant gets no static at meeting\n\n\n\nMay 10--A proposed Aquila power plant here has met little opposition so far. Aquila is hosting a series of meetings to garner community support for the project before it decides to build. Naysayers were silent, if there were any among the 18 people who attended an afternoon meeting Wednesday at State Fair Community College. Most people, like Frank and Marilyn Archer, of Sedalia, are curious ...\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nBan on windmills may not harm Steelwinds project: TOWN OF HAMBURG\n\n\n\nMay 10--A moratorium on windmills in Hamburg may never affect the turbines proposed for the former Bethlehem Steel site.  The town's code review committee -- a standing ad hoc group -- has finished work on the town's new wind power ordinance and is sending it to the Town Board. \"We have a final draft. It will be discussed Monday night,\" said Councilman D. Mark Cavalcoli, who is also a member of ...\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nPower plant explosion kills 1: Two others seriously scalded when water pipe ruptures\n\n\n\nMay 10--IATAN, Mo. -- One worker was killed and two others were seriously scalded when a hot water pipe exploded at a coal power plant shortly before noon Wednesday.  The major Kansas City Power and Light facility in Platte County was closed indefinitely pending an investigation. Authorities remained unsure what caused the high pressure pipe to rupture, but had fully ruled out any connection from ...\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nHuge write-offs zap TXU earnings\n\n\n\nMay 10--TXU Corp. reported a net loss of $497 million Wednesday as revenue declined and the company took two big write-offs, including one related to the cancellation of eight coal-fired power plants, which it has made a condition of its pending $45 billion buyout.  The state's biggest power company had announced Monday that it would report a $463 million after-tax charge to cover money spent on ...\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\nWind power skeptics to meet\n\n\n\nMay 10--MARTINSBURG -- A summit for those concerned about commercial wind power will take place this weekend in the shadows of the largest wind farm east of the Mississippi River.  The \"wind summit/call to action\" -- featuring several speakers from the Northeast and beyond -- will be held Saturday morning at Flat Rock Inn, just south of the 195-turbine Maple Ridge Wind Farm.\n\n\nMay 10, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nBerkeley lab takes aim at energy hogs\n\n\n\nBERKELEY - The lights may burn long into the night in the U.S. House of Representatives office complex and the Capitol in Washington in coming months, but they just might be energy-efficient lights, thanks to the work of a team of Lawrence Berkeley National Laboratory scientists. Not long after the Democrats took control of the House, Speaker Nancy Pelosi, perhaps in a not-so-subtle dig at the ...\n\n\nMay 11, 2007 Oakland Tribune\n\n\n\nLIPA's experiment\n\n\n\nLong Island Power Authority's decision to spend $14 million on an experimental fuel-cell program that really didn't generate too much heat or light may now seem excessive. Yet LIPA, as a public utility, has some responsibility to take the lead in pioneering alternative energy sources. The possibility, however, that LIPA chief Richard Kessel was inclined to make a deal with the Albany company Plug ...\n\n\nMay 11, 2007 Newsday\n\n\n\nAttorney says DPL execs fattened bonuses\n\n\n\nDAYTON  An attorney for DPL Inc. heaped more allegations of wrongdoing on the utility's ousted top executives Thursday, saying they fattened their bonuses by double-counting some investment gains and by improperly basing bonus calculations on gains of investments they didn't manage. Also, former DPL President Stephen F. Koziar Jr.'s employment contract was altered in 2003 without board approval ...\n\n\nMay 11, 2007 Dayton Daily News\n\n\n\nWisconsin Power and Light Co. to build $180 million wind farm\n\n\n\n-- Wisconsin Power and Light Co. (WPL) received unanimous approval from the Public Service Commission of Wisconsin (PSCW) to build Alliant Energy's first owned wind farm, Cedar Ridge Wind Farm. The farm will generate between 60 and 99 MW of energy, enough to power between 15,000 and 25,000 residential homes. It will have 41 wind turbines spread out over a 12.2-square mile area in Fond du Lac ...\n\n\nMay 10, 2007 Power Engineering\n\n\n\n\n\nPacific Gas and Electric Company Adds More Geothermal Energy to Renewable Energy Mix\n\n\n\nSigns Power Purchase Agreement With Western GeoPower Inc. SAN FRANCISCO, May 10 /PRNewswire-FirstCall/ -- Pacific Gas and Electric Company announced today it has entered into a contract with Western GeoPower, Inc., a wholly owned subsidiary of Western GeoPower Corp., to purchase renewable geothermal energy from The Geysers Geothermal Field in Northern California.\n\n\nMay 10, 2007 PR Newswire\n\n\n\nPG&amp;E Collaborates With IBM to Reduce Energy Consumption in the Utility's California Data Centers by 80 Percent\n\n\n\nIBM (NYSE: IBM) and  IBM (NYSE: IBM) and Pacific Gas and Electric Company (PG&amp;E) today announced a collaborative effort to optimize energy efficiency opportunities in PG&amp;E's California IT operations through a server consolidation program and by jointly developing a new way to measure and reduce heat in data centers. IBM also announced today its participation in PG&amp;E's Energy ...\n\n\nMay 10, 2007 Internet Wire\n\n\n\nVisiphor Announces New Business in the Canadian Energy &amp; Utility Sectors\n\n\n\nVisiphor Corporation (\"Visiphor\") (OTCBB: VISRF) (TSX-V: VIS) (XETRA: IGYA) continues to expand its market presence  Visiphor Corporation (\"Visiphor\") (OTCBB: VISRF) (TSX-V: VIS) (XETRA: IGYA) continues to expand its market presence in the thriving Canadian energy and utility sectors with multiple new contracts totalling $620,000. Visiphor has been selected to provide solutions addressing ...\n\n\nMay 10, 2007 Internet Wire\n\n\n\nCon Edison, Inc. Reports 2007 First Quarter Earnings\n\n\n\nConsolidated Edison, Inc. (Con Edison) (NYSE: ED) today reported 2007 first quarter earnings of $256 million or $0.99 a  Consolidated Edison, Inc. (Con Edison) (NYSE: ED) today reported 2007 first quarter earnings of $256 million or $0.99 a share, compared with earnings of $181 million or $0.74 cents a share for the first quarter of 2006.  These amounts reflect after-tax net mark-to-market losses ...\n\n\nMay 10, 2007 Internet Wire\n\n\n\nGovernor of Florida Experiences ''Hurricane Max,'' FPL's Storm Preparedness Exercise, as the 2007 Storm Season Approaches\n\n\n\nPM Eastern Daylight Time Governor of Florida Experiences Hurricane Max, FPLs Storm Preparedness Exercise, as the 2007 Storm Season Approaches Floridas Largest Utility Company Conducts Dry Run by Simulating the Arrival of a Major Hurricane MIAMI--(BUSINESS WIRE)--Preparing for the 2007 hurricane season is a top priority for Floridas largest utility, Florida Power & Light Company (NYSE:FPL).\n\n\nMay 10, 2007 Business Wire\n\n\n\nMinnkota Power Plans Environmental Upgrades at Milton Young Station\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). Minnkota Power Cooperative (Grand Forks, North Dakota) is conducting preliminary design and preparing to spend an estimated $120 million on environmental upgrades to further reduce pollutants at its 734-megawatt Milton Young Power Station.  For details, view the entire article by subscribing to ...\n\n\nMay 10, 2007 Internet Wire\n\n\n\n\n\nWestar issuing $100M in mortgage bonds\n\n\n\nWestar Energy Inc. will issue $100 million in mortgage bonds to help finance construction of a new power plant and transmission line. The Topeka-based utility announced its intentions Thursday. The bonds will be due in 2047 with Westar (NYSE: WR) paying interest quarterly starting in August 2007. Citigroup Global Markets Inc., Wachovia Capital Markets LLC, UBS Securities LLC, Banc of America ...\n\n\nMay 10, 2007 Wichita Business Journal\n\n\n\nBuilding nuclear plants 'critical' in the future: Duke chief\n\n\n\nDuke Energy Chairman, President and CEO James Rogers said to his company's shareholders Thursday that it is 'critical' to build nuclear plants in the future. In Duke's annual shareholders meeting, Rogers discussed nuclear power in the context of providing solutions to climate-change issues. Nuclear plants 'have zero greenhouse gas emissions,' he said. 'We can meet our demand, we can support our ...\n\n\nMay 10, 2007 Platts\n\n\n\nGeoMet Swings to 1Q Loss on Weaker Gas Prices, Unrealized Loss From Derivative Contracts\n\n\n\nHOUSTON (AP) - Natural-gas producer GeoMet Inc. said Thursday it swung to a first-quarter loss, hurt by lower gas prices and trading losses. Quarterly losses totaled $1 million, or 3 cents per share, compared with a prior-year profit of $7.2 million, or 22 cents per share. GeoMet said the recent quarter's results included an unrealized loss from derivative contracts of $3.2 million, while the ...\n\n\nMay 10, 2007 Canadian Business Magazine\n\n\n\nParamount Energy Trust reports loss of $39.3M in Q1 after accounting change\n\n\n\nCALGARY (CP) - Paramount Energy Trust (TSX:PMT.UN) reported a first-quarter loss of $39.3 million compared to a gain of $7.9 million last year but says the loss won't impact its ability to pay distributions. The company said it incurred a loss of $48.5 million in the first three months of the year due to a change in value of its financial instrument assets. Paramount said its cash flow and its ...\n\n\nMay 11, 2007 Canoe Money\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nSouth Korea seeks cleaner energy sources\n\n\n\n- South Korea broke ground for the world's biggest solar power plant on Thursday (10 May) as it tries to diversify its power sources and use cleaner energy. The $170m plant, along with the world's largest tidal power plant that is already under construction off the country's west coast, is part of an aggressive effort to seek new and renewable energy sources at a time when global concern about ...\n\n\nMay 11, 2007 Power Engineering\n\n\n\nThorium Power Provides Business Update for the First Quarter of 2007; Reports Accelerated Progress Towards Commercialization of Non-Proliferative, Low-Waste Nuclear Fuel Designs\n\n\n\nThorium Power, Ltd. (OTCBB: THPW), the leading  Thorium Power, Ltd. (OTCBB: THPW), the leading developer of thorium-based nuclear fuel designs, today provided a business update for the first quarter ended March 31, 2007.  First Quarter 2007 Business Highlights:  --  Conducted advanced discussions with foreign governments and commercial  entities with emerging plans for thorium-based nuclear power ...\n\n\nMay 10, 2007 Internet Wire\n\n\n\nOthers are catching up to EU on wind\n\n\n\nThe industry has seen an average of 25 percent growth annually over the last seven years,  said Jos Beurskens of the Energy Research Center of the Netherlands. But it is no longer the only major producer of wind power. Wind used to be concentrated, with five European countries providing 80 percent. Now the United States, China, India and Australia are all beginning to compete. ...\n\n\nMay 10, 2007 Washington Times\n\n\n\nHarbin Electric Develops World's First High Efficiency, Energy Saving 'Tower Type Oil Pump' Driven by Permanent Magnetic Linear Motor\n\n\n\n-Linear Motor Oil Pump Broadens Company's Product Line into Oil and Gas Industry-     HARBIN, China, May 10 /Xinhua-PRNewswire/ -- Harbin Electric, Inc., (Nasdaq: HRBN) a U.S. company, with operations based in Harbin, China, today announced that the Company has successfully developed a high efficiency,  energy saving 'Tower Type Oil Pump' driven by permanent ...\n\n\nMay 10, 2007 PR Newswire\n\n\n\nAdvance Battery Technologies Announces New Sales Initiative in the United States\n\n\n\nAdvanced Battery Technologies, Inc. (OTCBB: ABAT), a developer and manufacturer of rechargeable Polymer-Lithium-Ion  Advanced Battery Technologies, Inc. (OTCBB: ABAT), a developer and manufacturer of rechargeable Polymer-Lithium-Ion (PLI) batteries,  announced today that it has entered into a sales, marketing and distribution agreement with JRH Marketing Company, Monrovia, Ca.\n\n\nMay 10, 2007 Internet Wire\n\n\n\nTransGlobe Energy Corporation Announces Normal Course Issuer Bid\n\n\n\nTransGlobe Energy Corporation (TSX: TGL) (AMEX: TGA) (\"TransGlobe\" or the \"Company\") announced today that the Toronto Stock Exchange (\"TSX\") has accepted its Notice to Make a Normal Course Issuer Bid (the \"Bid\") to purchase, from time to time, as it considers advisable, up to 5,479,501 of its 59,662,439 currently issued and outstanding common shares (being no greater than 10% of the public float ...\n\n\nMay 10, 2007 Internet Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}