{"category": "spam", "to_address": "<ktwarwic@flax24.uwaterloo.ca>", "from_address": "\"The Bull Report\" <news@thebullreport.com>", "subject": "SUN Moves ART OF WAR 3 Date to Accommodate Larger TV Broadcast Audience", "body": "    To view this email as a web page, go    here.     \n\n\n\nThe Bull ReportJune 5th, 2007\nSUN Moves ART OF WAR 3 Date to Accommodate Larger TV Broadcast Audience\nDALLAS, TX--(MARKET WIRE)--Jun 5, 2007 -- SUN Sports & Entertainment Inc. (Other OTC:SSPE.PK - News\n) announced today that SUN's ART OF WAR 3, Undisputed Arena Fighting Championships will be moved from June 30th, 2007 to Saturday September 1st, 2007 to accommodate a larger television broadcast audience. This highly anticipated international Mixed Martial Arts (MMA) Event is set to take place at the American Airlines Center in Dallas, Texas.\nIt was finally going to happen... and now it is here: \"Team USA Vs. Team Brazil.\" Never has such a strong cast of mixed martial arts fighters been assembled in an international MMA event until now. The main event will feature USA veteran Jeff \"Snowman\" Monson (5'9\", 240 lbs) taking on Brazilian Jiu Jitsu legend Pedro \"The Rock\" Rizzo (6'1\", 230 lbs), for Rizzo's IFA World Heavyweight title. The Monson Vs. Rizzo five-round world championship title bout will headline a card that will feature some of the top fighters that will compose Team USA MMA taking on some of the top Team Brazil MMA best action fighters.\nSUN President, J. Buckeye Epstein, said, \"We have fighters from all over Brazil to include major camps such as: 'Chute Boxe, Ruas Vale Tudo' and others which should provide an interesting challenge for our 'ground and pound' Team USA. This is an incredible fight card (Team USA Vs. Team Brazil) and in order to make this event available to as many households as possible, we felt it was necessary to make the strategic move to September 1st, 2007 (Labor Day Weekend).\"\nART Of WAR 3 is set to make history. The excitement is certainly not just limited to the main event. SUN has stacked this line-up with several of the best MMA fighters in the world. The fight at the American Airlines Center on September 1st, 2007 will begin at 7:00 pm/Central. The Company is in the process of detailing its television strategy and will be following up with additional news.\nTICKETS for ART OF WAR 3 are priced at $300 (VIP Ringside), $100, $75, $50, $35 and available at the American Airlines Center Box Office and all Ticketmaster Outlets. They will also be available online at www.ticketmaster.com. Tickets will go on sale Saturday, July 14th, 2007.\nRead the full release on SSPE\nRead the full disclaimer Click here\n\n\n\n\n\n                                    This email was sent to:  ktwarwic@flax24.uwaterloo.ca\n\n\n\n\n                                                            This email was sent by: The Bull Report                                                                                                              \n                                                            1846 rosemeade 104 dallas, TX 75007 USA \n                                                            \n\n\n          \n                                    We respect your right to privacy - view our policy\n\n\n\n\n\n\n\n\n\nManage Subscriptions | \n                                    Update Profile | \n                                    One-Click Unsubscribe\n\n\n\n\n\n"}