{"category": "spam", "to_address": "<manager@speedy.uwaterloo.ca>", "from_address": "\"loaf\" <indi@atmc.net>", "subject": "primary care file", "body": "\n\n\n\n\n\n\n\nAnd I know that you have grandchildren of your own. \nCan you tell me what is it like to come back to something like this after having \nbeen away from it for so long? I think that the reason why some women seem to like \nCinderella so much is her spirit, that she never lost her spirit. I sang for \nPresident Truman at the White House because of the work I had done for the soldiers \nand sailors during the war. That's sort of akin to a Cinderella story for the voice \nof Cinderella. It was fun, enlightening and wonderful. She was kind of \nspunky.\nI had a wonderful, wonderful career as a very young \ngirl. Can you talk about that?\nThere was always something wonderful going to \nhappen and that's what kept her spirit up.\nI sort of forget when I'm watching the movie that I \nhad anything to do with it, I really do. Oh, I treasure it so. I don't like to \ncompare her to any of the others because I liked playing her so much.\nOther girls will come up to me and say that they \nhad their whole bedroom decorated in Cinderella!\nIt was fun, enlightening and \nwonderful.\nThe fact that he had done that was enough to \nsatisfy him.\nI lived most of my young life her way when actually \nI was interested in being a teacher.\nI think she was a very spirited \nperson.\nIt was a wonderful two years.\nI worked off and on the movie for two and a half \nyears.\nI taught third grade and I learned with them! I \nstarted at 15 years old in New York with my own show three nights a week on NBC so I \nhad been in the business a long time.\nI had a very stern mother and I think at times \nthere was a comparison.\nI noticed on your resume that you actually did get \nto teach school in the Florida Keys for two years. Earlier you talked about working \nduring the war, doing the radio shows and singing, and started getting a little \nemotional about your experiences performing at that time.\n"}