{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Spie Sutherland\" <spie@proficio.ca>", "subject": "Re: Speakup in userspace", "body": "A few useful references\n\nhttp://linuxconsole.sourceforge.net/input/input.html\n\nUsing the Input Subsystem - No matter how many buttons an input device\nhas or how many kinds of events it can generate, you can now work with\nit from user space.\n\nhttp://www.linuxjournal.com/article/6429\n\nHere is part one of that article series\nhttp://www.linuxjournal.com/article/6396\n\nHere is a useful way to browse around in the input driver source\nhttp://www.gelato.unsw.edu.au/lxr/source/drivers/input/?a=i386\n\nThis POC /dev/input/event/* keylogger is interesting\nhttp://archives.neohapsis.com/archives/sf/linux/2005-q3/0065.html\n\nThis is an interesting simple example driver code for input driver\nhttp://kernel.org/pub/linux/kernel/people/landley/kdocs/Documentation/input/input-programming.txt\n\nThis is old but useful due to its description of the bigger picture\nof keyboard scancodes and related stuff\nhttp://www.linuxjournal.com/article/1080\n\nAs for console output, just as with the Input Driver redesign, it is\nchanging quicky and they are trying to clean up the architecture.\nI suppose the first thing would be to see how the console is\nchanging and where it's heading architecture wise. I have a lot\nof interest in this for other projects and will be doing some\ninvestigation.\n\nOne thing I have in mind is implementing what will basically be the\nequivalent of a VT100 terminal using a small microcontroller, where\ninput is an attached keyboard and output is speech. Since there\nalready is serial console, a means to implement a terminal with\nkeyboard input and speech output would be quite useful. Rather\nthan connecting a machine to serial port for console, you'd plug\nin a dongle which would have both a keyboard port and an\noutput port for speech, or possibly even speech hardware in the\nactual dongle. I'll share some more info on this idea a bit later.\n\n  -- Spie\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}