{"category": "ham", "to_address": "Yifan (Eric) Jiang <e.jiang@auckland.ac.nz>", "from_address": "Rajarshi Guha <rguha@indiana.edu>", "subject": "Re: [R] JRI and Axis Web Service", "body": "\nOn Jun 24, 2007, at 7:58 PM, Yifan (Eric) Jiang wrote:\n\n> I've been asked to develop a Java Axis web service to retrieve an\n> R-script file from the client side and then using JRI jar file in  \n> order\n> to call the R program that installed on the web service server. After\n> reading the online documentation, I've successfully installed the R\n> program with rJava and JRI packages. In addition, I can call the R\n> program to run the R-script by using org.rosuda.JRI.Rengine.  \n> Everything\n> is running fine if this program is running as a normal Java  \n> application.\n> However, I fail to obtain any return when I was trying to consume this\n> method by using the Java Axis web service.\n>\n>\n>\n> So I am wondering if any one could share their experiences to using  \n> JRI\n> in Axis web service. Your helps mean a lot to me and I've been  \n> struggled\n> to fix this problem for days.\n\nWe have developed a distributed computational infrastructure using R  \n(and JRI) as the backend coupled with AXIS web services and have  \nbuilt a number of clients on top of this.\n\nYou can browse the source code for the services from the Sourceforge  \nrepository located at\nhttp://svn.sourceforge.net/viewvc/cicc-grid/cicc-grid/rws/trunk/  \n(though the R code in the repository has not been updated recently)\n\nExamples of what functionality is available via the web services can  \nbe found at http://www.chembiogrid.org/projects/proj_statistics.html\n\nThe page also lists a number of clients that make use of the web  \nservice infrastructure.\n\n-------------------------------------------------------------------\nRajarshi Guha  \nGPG Fingerprint: 0CCA 8EE2 2EEB 25E2 AB04  06F7 1BB9 E634 9B87 56EE\n-------------------------------------------------------------------\nI'm related to people I don't relate to.\"\n                 -Calvin\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}