{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Michael Pobega <pobega@gmail.com>", "subject": "Re: The GPL and soundfonts", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nOn Sat, Jun 02, 2007 at 12:40:25PM +0100, Andrew Sidwell wrote:\n> If someone releases a song in MIDI form under the GPLv2, and I use\n> non-GPL'd tools (e.g. a shareware licence) and royalty-free instrumental\n> samples to produce a high-quality WAV version of the original MIDI, can\n> I legally release that under the GPLv2?\n> \n> The GPLv2, section 3, states:\n>   \"However, as a special exception, the source code distributed need\n>    not include anything that is normally distributed (in either source\n>    or binary form) with the major components (compiler, kernel, and so\n>    on) of the operating system on which the executable runs, unless\n>    that component itself accompanies the executable.\"\n> \n> I take it that audio production software is not a major component of the\n> operating system, and based on this, I can only assume that if one wants\n> to distribute high-quality versions of MIDI files which are under the\n> GPLv2, one is restricted to an entirely free toolchain.\n> \n\nI believe that the MIDI files can be distributed under the GPL. I mean,\nif you use a non-free IDE to write a program, would the GPL restrict you\nfrom distributing your code under it? I doubt it.\n\nAs long as the MIDI files don't need the original (Shareware) program to\nplay you should be fine distributing it under the GPL.\n\nBut don't act just on me, wait until someone confirms this; I don't have\nmuch experience in debian-legal, so I may be wrong.\n\n- -- \nhttp://digital-haze.net/~pobega/ - My Website\nIf programmers deserve to be rewarded for creating innovative\nprograms, by the same token they deserve to be punished if they\nrestrict the use of these programs. \n - Richard Stallman\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGYXAsg6qL2BGnx4QRAh2BAJ4nl/QlFIWQ/UTYWewnzhdTvKdJCwCgq42h\n1M7ZdvuBAtuFHpEQZFBUCog=\n=aOyt\n-----END PGP SIGNATURE-----\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}