{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Nelson Hairston\" <laxcriativafmvew@criativafm.com>", "subject": "Join the thousands of people who got slim", "body": "\nAchieve picture perfect weight and enjoy life\n\n\n\n\n\n\nAnatrim – The latest and most attracting product for corpulent people is made available now – As told on Oprah.\n\n\nCan you recall all the times when you said to yourself you would do any thing for being delivered from this desperately growing pounds of fat? Fortunately, now no big price is to be paid. With Anatrim, the ground-breaking pound-melting medley, you can get healthier life style and a really slender figure. Take a look at what people write!\n\n\n\n\"It’s rather difficult to confess but I was exceedingly addicted to food. \n\n\nI devoured all this trash \n\n\nand just could not stop. \n\n\n\n\nThis ruinous passion ceased when I started course with Anatrim! \n\n\nGod,\n\n\n\n\n my inclination to eat constantly decreased, \n\n\nspirits increased and I became the happiest person in the world 29 pounds in 2.1 months. \n\n\n\n\nI can tell you now I became the happiest person on the planet!\"\n\n\n\n\n\nAmely S., Chicago\n\n\n\n\n\n\"I had weight problems since I was a boy. \n\n\nYou can't fancy how I hated being derided at school. \n\n\n\n\nI hated my weight and I detested even myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nIt literally dragged me out of this dreadful nightmare! A plenty of thanks to you, my friends.\"\n\n\n\n\n\nSerge Smith, San Diego\n\n\n\n\n\n\"Know what? Anatrim saved my marriage! I went into the circle, depression – eating more – even more depression. My wife was about to leave me as I was turning in overweight psycho. \n\n\nMy best friend pointed at your web site and I called for pack of Anatrim at once. \n\n\nThe results were excellent, my appetite became normal, I was in good spirits oftener, and, of course, I became able to tighten my belt on some holes. And you know, the bedroom became cool, too!\"\n\n\n\n\n\nFrank\n\n\n\n\n There many and many thanks left by delighted people trying Anatrim. Don’t you wanna add yourself to the thousands and thousands of slender clients and take this natural appetite reducing power boosting product now!\n\n\nDo not decline the opportunity!\n\n\n\n\n"}