{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Ben Bolker <bolker@ufl.edu>", "subject": "Re: [R] besselK", "body": "Robin Hankin  noc.soton.ac.uk> writes:\n\n> \n> Hello\n> \n> AFAIK, R has no capability for evaluating Bessel functions for  \n> complex arguments.\n> \n> Bessel functions for complex arguments are difficult to evaluate  \n> numerically.\n> Some Bessel functions require cut lines or consideration of Riemann  \n> surfaces.\n> \n> The GSL library (for which the gsl package is an R wrapper) does\n> not include such functionality although the issue has arisen\n> on the GSL email list a couple of times over the last few years.\n> \n> Writing R functionality for Bessel functions (and in particular\n> the Airy function) is on my List of Things To Do, but\n> don't hold your breath  . . .\n> \n> best wishes\n> \n> Robin\n> \n> On 14 Jun 2007, at 10:31, ivivi mwaniki wrote:\n> \n> > Assistance,\n> > besselK- complex number problem\n> >  Im a student  intrested in using R in my learning and research  \n> > work in option pricing however i have a problem with besselK  \n> > function In R.\n> >  Would you assit me in computing the besselK of third kind of a  \n> > complex number in R.\n> >  Any code or suggestion will be highly appriceiated\n> >  eg\n> >  besselK(2,10)  works well.. but\n> >  besselK(2,10i) doesnt work !!\n> >\n> >  im supprised it works in MATLAB but NOT in R.\n> >  rgds\n> >  ivivi mwaniki\n> >  student kenya\n> >\n> >\n\n   I have some code for complex Bessel functions which consists\nof R wrappers for C++ code: the licensing a little obscure -- the code is\nultimately from \"Computation of Special Functions\", Zhang and Jin, John Wiley\nand Sons, 1996.  The FORTRAN routines are available from\nhttp://jin.ece.uiuc.edu/routines/routines.html ; Chris Bond\nhttp://www.crbond.com/math.htm has made a C++ translation\navailable.  Both versions are copyrighted: Zhang and Jin\nsay \"we give permission to the user who downloads these routines to incorporate\nany of these routines into his or her programs provided that the copyright is\nacknowledged\".  The code seems to work for my purposes, but hasn't\nbeen thoroughly tested.\n\n  I can send my crude versions to anyone who would like it.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}