{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"Dhanoa Revenues News\"<Marilyn.Moran@leadgenngroup.com>", "subject": "Dhanoa Minerals Modernization Effort ", "body": "\n\n\nDhanoa Minerals Modernization Effort \n\n\n\n\n\nDhanoa Minerals Modernization Effort \n\n\nDhanoa Minerals Modernization Effort Producing Additional Revenues of $5,500,000 From ''Tailings''\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nDhanoa Minerals Modernization Effort Producing Additional \n                              Revenues of $5,500,000 From ''Tailings''\n\n\n\n \n\n\n\n \nTORONTO--(BUSINESS WIRE)--Dhanoa Minerals, Ltd (OTCBB:DHNA - News; FWB:D7Z) announced today that  the company is re-processing \"tailings\" at its recently acquired  \"Spanish Plant.\"\n\n                        Tailings are the raw ore material remaining after the gold and  silver extraction process has been completed. Tailings often contain  precious metals, which are nearly as valuable as the already processed  metals.\n\n \n\n\n\n\n \nWhile difficult to exactly estimate the value of tailings left  behind at the company's mining properties as well as at the company's  newly acquired refining and processing Spanish Plant, initial results  indicate that the tailings contain a minimum of 1.7 grams of gold and  as many as 6 grams of silver per ton. The dollar value of the  reprocessed tailings could amount to as much as $37 per ton.\nBased upon current production of 500 tons per day, the tailings  could be worth a minimum of $18,500 per day as additional revenues,  which equates to an additional $5,500,000 per year.\nAs mining techniques become more efficient, and with the  implementation of modernization practices coupled with the increased  market price of gold and silver, reprocessing additional minerals,  previously more difficult and costly to extract, has become  increasingly economically feasible.\nIn addition, re-processing tailings serve to restore some of the  ecological damage caused by traditional mining practices.\nMr. Lee Balak, President of Dhanoa stated, \"Native Ecuadorian  mining methods are very crude and inefficient. They leave behind a  significant amount of tailings that Dhanoa Minerals can now profitably  mine. Re-processing these tailings will provide substantial added  revenue for the company. We at Dhanoa Minerals are committed to  environmentally-conscious mining practices. We believe that reducing  the harmful environmental effects of gold and silver mining to be in  the interest of both the citizens of Ecuador, as well as our  shareholders.\"\nAbout Dhanoa Minerals Ltd.\n'Dhanoa' is a production stage company formed for the purpose of  acquiring, exploring, and developing natural resource properties.  Activities during the production and exploration stage include further  development of the Company's business plan and raising capital. The  Company has recently initiated a new program to evaluate undervalued  assets for potential addition to its mineral claim portfolio.\n\n \n \n\n\n \n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}