{"category": "spam", "to_address": "ktwarwic@plg.uwaterloo.ca", "from_address": "\"Celeste Tatum\" <miqekusfew@ekus.cz>", "subject": "Say goodbye to extra pounds", "body": "\nJoin the thousands of people who got slim\n\n\n\n\n\n\nAnatrim – The newest and most delighting product for over-weight people is now readily available – As told on CNN.\n\n\nCan you remember all the situations when you told yourself you would do anything for being delivered from this quickly growing pounds of fat? Happily, now no big price is to be paid. With Anatrim, the ground-breaking pound-melting medley, you can achieve healthier life style and a really slender figure. Have a look at what our customers write!\n\n\n\n\"I hate to admit it but I was awfully addicted to food. \n\n\nI devoured all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis misery left off after I started taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my appetite abated, \n\n\nmood increased and I’m the happiest person in the world 22 pounds in 2.5 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person in the world!\"\n\n\n\n\n\nRita R., Bellevue WA\n\n\n\n\n\n\"I had weight problems since I was a boy. \n\n\nIt’s pretty hard to imagine how I detested being derided at school. \n\n\n\n\nI detested my weight and I detested even myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nIt literally took me out of this awful nightmare! The very sincere thanks to you, guys.\"\n\n\n\n\n\nCharley Mock, San Diego\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was happily saved! I got into this circle, depression – eating more – more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOnce one of my friends pointed at your web page and I asked for Anatrim at the time. \n\n\nThe result was excellent, my appetite came to normal level, I was often in a good mood, and, of course, I became able to tighten my belt on some holes. And you see me, the bedroom became cool, too!\"\n\n\n\n\n\nFrank\n\n\n\n\n There many and many thanks delighted people leave after trying Anatrim. Don’t you gonna add yourself to the tens of thousands of slim men and women and take this all-natural appetite-suppressing energy lifting product now!\n\n\nDo not decline your opportunity!\n\n\n\n\n"}