{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Honey Bees are disappearing.  Why you should care tonight on the CBS EVENING NEWS with Katie Couric", "body": "\nCBSNews.com\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nQUOTE OF THE DAY“There are two motives for \n      reading a book: one, that you enjoy it; the other, that you can boast \n      about it.” - Bertrand Russell \n\n\n\nDID YOU KNOW?An albatross can sleep while it \n      flies. It apparently dozes while cruising at 25 mph. \n\n\n\nTONIGHT ON THE CBS \n      EVENING NEWSHere is an early preview of what we \n      are planning for tonight’s CBS EVENING NEWS from Anchor and Managing \n      Editor, Katie Couric… Hi everyone, After the town \n      of Greensburg, Kansas, was reduced to little more than rubble over the \n      weekend, a survivor was found in the wreckage today – bringing some good \n      news to the grim story. Hari Sreenivasan will have our report on \n      the aftermath from Greensburg. When a disaster like this massive \n      tornado strikes, the National Guard is often called upon to help citizens \n      piece together broken lives. But during wartime, the guard isn’t always \n      there in full force, David Martin will report. Reports said \n      the tornado was more than a mile wide and it was a whopping F-5 storm – \n      the classification for the very strongest twisters. What’s behind such a \n      monster tornado? Cynthia Bowers will have the story from a storm \n      prediction center in Norman, Oklahoma. In business news, prices at \n      the gas pump surged over the weekend, reaching $4.00 per gallon in some \n      places. Anthony Mason will have the reasons behind the pump price \n      spike. Yesterday French voters elected Nicholas Sarkozy, the \n      pro-American conservative candidate, in a close election that had a huge \n      turnout. But would the French candidates’ personal lives horrify American \n      voters? Jeff Greenfield will take a look at what American voters \n      can learn from some of the culture behind France’s election. And \n      correspondent John Blackstone reports on what some are calling an \n      agricultural emergency in the United States: the sudden disappearance of \n      honeybees. The die-off has hit 27 states – and with about 30 percent of \n      the nation’s food supply being pollinated by bees, the risk is great and \n      scientists are scrambling to nail down the cause. We’ll have the story in \n      a segment we’re calling Saving the World. Finally, it was a \n      day of much pomp and fanfare at the White House, as Queen Elizabeth II was \n      welcomed to Washington. President Bush tonight is hosting the first \n      white-tie dinner of his presidency in honor of the queen. Mark \n      Phillips will share details of Elizabeth’s elegant day inside the \n      beltway. I hope you’ll join us. Katie For more \n      information on these stories, please click on the following links:\nSurvivor Found In Kansas Tornado Rubble Click \n      Here A White House Welcome For Queen Elizabeth Click \n      Here And here's a look at one of the stories we’re working \n      on for Tuesday's broadcast: Murderers sentenced to death. But \n      find out why the state can't pull the switch. That story and MUCH more \n      Tuesday on the CBS EVENING NEWS. If you would like \n      more information on any of these stories or the broadcast, please click on \n      the following address and e-mail us: evening@cbsnews.com \n\n\n\nTONIGHT ON DAVID \n      LETTERMANDave sits down with talk show host and friend \n      Regis Philbin! And, a spectacular musical performance by Darlene Love! \n      \n\n\n\nTUESDAY MORNING ON THE \n      EARLY SHOWHannah Storm, Julie \n      Chen, Russ Mitchell and Chris Wragge, of our New York \n      affiliate WCBS, anchor THE EARLY SHOW \n      from New York. Dave Price will bring us the weather. Harry \n      Smith is on assignment. Along with the top news of the day, \n      we will also have the following stories: CONSUMERWATCH: \n      RATING DIETS: If you're anxious about fitting into that bathing suit \n      this summer, you're not alone. Right now, nearly half of all Americans are \n      on a diet--with the average person wanting to lose more than 30 pounds! So \n      what's the best way to do it? Consumer Reports magazine has done \n      the homework for you--revealing which diets get the best results. \n      EARLY SHOW Consumer Correspondent \n      Susan Koeppen will join us with important new information about \n      diet plans. \n \nTAKE LOU: GAS PRICES: In his weekly \n      commentary, Lou Dobbs, anchor and managing editor of CNN’s Lou Dobbs \n      Tonight, will join us to talk about gas prices. \nSIMPLE SOLUTIONS: DRUG STORE DEALS: Walk down an \n      aisle at your local drugstore and it's easy to get overwhelmed by the \n      hundreds of beauty products you can choose from. So the editors at Real \n      Simple magazine compiled a list of the best drugstore skincare and \n      hair products to save you time and money the next time you're shopping. \n      Kris Connell from Real Simple magazine will join us with some of \n      her favorites. CSI WEEK: CSI MIAMI BEHIND THE SCENES: \n      Tuesday morning, we continue CSI week. Monday night's CSI: \n      Miami has your standard dose of stylized murder and intrigue in an \n      exotic setting. What it also has is Horatio being Horatio. To the delight \n      of millions of fans, each week actor David Caruso puts his stamp on what \n      has become one of television's most iconic characters. We'll take a look \n      behind the scenes of the hit show. MOTHER'S DAY GIFTS: \n      Don't know what to get mom this Mother's day? Style expert Sarah Shirley \n      will join us with some gift suggestions that may be the perfect way for \n      you to thank mom for all she does. DENNIS HAYSBERT ON THE \n      UNIT: Dennis Haysbert is best known to television audiences for his \n      portrayal of President David Palmer on the series 24, for which he \n      received his first Golden Globe nomination. Now, he stars as Jonas Blane \n      on The Unit, one of CBS's biggest hits. The Unit offers a \n      realistic look at a group of elite special forces fighting terrorism in \n      all corners of the world. Tuesday night's cliff hanger season finale will \n      show you what the buzz is about, when The Unit, led by Haysbert's \n      character, face criminal charges that threaten it's very existence. We'll \n      speak with Haysbert Tuesday morning. YOUNG AT HEART: HOT \n      GRANNY: Grandmothers aren't what they used to be. \"Hot\" and \n      \"grandmother\" are not two words you usually think of together, but \n      gerontologist Mel Walsh's new book, Hot Granny, says otherwise. \n      Walsh's book defines what exactly makes a grandmother sizzle. How you can \n      accept the limitations brought on by age and learn to reinvent yourself? \n      Hot Granny is filled with practical advice on how to be happy, \n      healthy and sexy into your golden years. Tuesday morning, Walsh will join \n      us with tips you won't want to miss. If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: earlyshow@cbs.com \n      \n\n\n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\nTo \nunsubscribe or change your subscription options, click here.Contact: \nEmail Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Worldwide Inc, All \nRights Reserved. \n"}