{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@speedy.uwaterloo.ca>", "from_address": "\"Carol F. Carol World Market Systems.com\" <qgwde.2lp@vendglad.com>", "subject": "I couldn't believe it either - Until I got my first check ", "body": "\n\n  <!--Sunni militants are believed to have withdrawn to surrounding areas such as Diyala province where they have safe haven. The U.S. command also deployed an extra 700 soldiers to the area last month.\n\nA U.S. soldier also was killed Monday in a roadside bombing in Muqdadiyah, about 60 miles north of Baghdad, a predominantly Shiite area that also is in Diyala, the military said in an earlier statement. A British soldier was shot to death while on patrol in the southern city of Basra, officials said.\n\nThe deaths raised to 85 the number of U.S. service members who died have in        Iraq in April, making it the deadliest month for American troops since December, when 112 died.\n\nIt was the single deadliest attack on ground forces since Dec. 1, 2005, when a roadside bomb killed 10 Marines and wounded 11 on a foot patrol near Fallujah.\n\nTwelve soldiers died when a Black Hawk helicopter crashed in Diyala on Jan. 20. The military said it might have been shot down but the investigation is still ongoing.\n\nIn other devastating attacks, 14 Marines were killed when a roadside bomb struck an amphibious assault vehicle near the western town of Haditha on Aug. 3, 2005. And a suicide bomber struck a mess tent in a base near Mosul on Dec. 21, 2004, killing 22 people, including 14 U.S. soldiers and three American contractors.\n\nAt least 68 Iraqis were killed or found dead Monday, according to police, including 10 in a suicide car bombing against a police station in the Diyala provincial capital of Baqouba.\n\nWith the U.S. casualty toll mounting, Democratic leaders in Washington agreed Monday on legislation that requires the first American combat troops to be withdrawn from Iraq by Oct. 1 with a goal of a complete pullout six months later. Bush has promised to veto any such measure as the legislative confrontation intensifies.\n\nU.S. officials, meanwhile, signaled that they might reconsider putting a three-mile concrete barrier around a Sunni Arab neighborhood in Baghdad after Iraq's struggling prime minister came under pressure from Sunnis and ordered construction of the wall halted.\n\nHe said he did not want the 12-foot high wall in Azamiyah to be seen as dividing Iraqis based on their religious affiliation, throwing the strategy of sealing off Baghdad neighborhoods from sectarian attacks into doubt.\n\n--!>         To stop future mailings, please Visit Hereor write to: 515 E. Carefree HWY PMB 831 Phoenix, AZ 85085  \n\n\n \n"}