{"category": "ham", "to_address": "love-hounds@gaffa.org", "from_address": "\"Boolbar\" <boolbar@gaffa.vispa.com>", "subject": "Re: [LH] Conclusion", "body": "On 8:32:14 am 16/05/2007 Donny Bravo  wrote:\n> Well, now, let's get this discussion rolling along.\n>\n> What are your 4 great tracks? Your 4 reasonable tracks? Your 4 bland\n> tracks?\n\nThe Great:\nMrs. Bartolozzi (stunning. A friend of mine hates Aerial as a whole, except\nfor this track which he described as \"a work of art\".)\nA Coral Room (Yeah, I'm a sentimental old fool.)\nPrologue (So simple, so good, could do without the intrusive percussion at\nthe end though.)\nAerial (Yey! Upbeat uplifting fun. I thought I would get bored of this, but\nstill play it twice at the end.)\n\nThe Reasonable:\nBertie (charms the pants of me.)\nJoanni (the only real single potential on the album, apart from a dance\nremix of Aerial that is. She has done much better though.)\nAn Architect's Dream (nice.)\nSunset (nicer - but she does drag out the middle part by repeating the same\nlyrics again. The way she sings \"Could be honeycomb\" is gorgeous.)\n\nThe Bland:\nPi (good idea, but as I said, needs a good kicking. She should have let the\nweirdness in.)\nHow to Be Invisible (even more boring than Experiment IV.)\nSomewhere in Between (a dull backing beat and I find Kate's singing doesn't\nplease me.)\nNocturn (the very beginning is great, then that backing beat makes the next\n4 minutes rather dull. It finally gets going though.)\n\n> I can't agree about KOTM. ...... If it were given a SIYL treatment, it \n> would have been that much better.\n\nOh, yes I can agree with that, and get rid of that annoying fade out as\nwell. It is interestingly done, but like Experiment IV I find it does\nnothing for me.\n\n> And, looking back, TSW might just be my favorite KB album, taken as a\n> whole. HOL is half-great, but, oh, what a half. I also love TD and\n> NFE. So those are the big 4 long-players for me.\n>\n> TKI is something special, but not overwhelmingly strong from start to\n> finish. Lionheart and Ae are flawed. TRS suffers from contributions\n> by awful mainstream artists who are clearly not worth of Kate Bush.\n>\n> - Donny\n\nTD is easily my favourite, with TKI, HoL, Ae, TSW bunched together (in that\norder for now). Although I can see TSW making a comeback over time. It is\nmy most played KB album as I had a spare copy in the car for years, so I've\ngot a soft spot for it. NFE and Lh come next with TRS trailing.\n\nIMHO, the first half of \"A Sky of Honey\" is one of the best things that\nKate has ever done. Aerial Tal (as cute as it is) breaks the flow of the\npiece, then I have to wait until the last part of Nocturn before I get back\ninto it again.\n\nBoolbar\n\n"}