{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Graciela Short\" <laxcrinkleyvew@crinkley.net>", "subject": "Stop being obese and unhappy", "body": "\nBe leaner and slimmer by next week\n\n\n\n\n\n\nAnatrim – The very up-to-date and most exciting flesh loss product is now available – As you could see on CNN.\n\n\nCan you hold in your memory all the cases when you plead to yourself to do any thing for being delivered from this fastly growing pounds of fat? Happily, now no major offering is necessary. With Anatrim, the earth-shaking weight-reducing combination of elements, you can achieve healthier lifestyle and a really slender figure. Take a look at what our customers state!\n\n\n\n\"It’s rather difficult to admit it but I was exceedingly addicted to food. \n\n\nI devoured all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis torment left off after I started course with Anatrim! \n\n\nOh, God,\n\n\n\n\n my inclination to eat constantly decreased, \n\n\nmood improved and I became the happiest person 26 pounds in 2.9 months. \n\n\n\n\nI can tell you now I became the happiest person!\"\n\n\n\n\n\nVictoria K., Bellevue WA\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nYou can't even fancy how I detested being mocked at school. \n\n\n\n\nI abhorred the weight and I abhorred myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nThis stuff literally took me out of this terrible nightmare! A plenty of thanks to you, my friends.\"\n\n\n\n\n\nSteve Doubt, Chicago\n\n\n\n\n\n\"Know what? Anatrim saved my marriage! I went into the circle, depression – eating more – just more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOne of my friends pointed to your web page and I called for my pack of Anatrim right away. \n\n\nThe results I achieved were magnficent, my appetite came to admissible level, I was often in a good mood, and, of course, I went some belt holes back. And you see, the bedroom became cool, too!\"\n\n\n\n\n\nDave\n\n\n\n\n There is a lot of sincere gratitudes left by happy people taking Anatrim. Don’t you gonna join the thousands and thousands of slender clients and try this original appetite-abating energy lifting product now!\n\n\nDo not lose your chance!\n\n\n\n\n"}