{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nIn Washington\n  today all eyes were on a former top White House aide who was sentenced to\n  time behind bars. Former vice presidential chief of staff I. Lewis\n  “Scooter” Libby was slapped with 30 months in prison and fined\n  $250,000 for lying and hindering the CIA leak case investigation. Bob Orr\n  will have the story.\n \nAn appeals court struck down a new U.S. policy against accidentally\n  aired profanities on TV and radio. The decision noted that what’s\n  considered vulgar language is now so common even President Bush uses it\n  (remember what he told Tony Blair that Hezbollah should stop doing?). Now, a\n  sudden slip of the tongue – even on air – will likely be excused.\n  That could come as a relief to some broadcasters, but the FCC isn’t so\n  thrilled, Nancy Cordes will report.\n \nMeanwhile, our chief foreign correspondent Lara\n  Logan is in Baghdad\n  embedded with a unit that discovered what’s thought to be an al Qaeda\n  dumping ground. She’ll report on what she’s seen and also show\n  you new video of a massive attack on Iraqi insurgents.\n \nAthletes could have a quicker new way to get up and\n  running after joint injuries. Our Dr. Jon LaPook will report on a therapy\n  that extracts a patient’s own blood platelets and puts them back in the\n  injured area so they can help the body heal itself. \n \nFinally, Wyatt Andrews will report for Shades of America\n  on groups of inner-city students who got a little help from their friends\n  – to attend and graduate college. It is a scholarship program that\n  stresses the importance of students’ “posse” as a support\n  network through college – and it is having outstanding results.\n \nI hope you’ll join us for these stories and\n  more,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}