{"category": "ham", "to_address": "perl6-language@perl.org", "from_address": "Smylers <Smylers@stripey.com>", "subject": "Re: Web Module (Was: Perl6 new features)", "body": "Moritz Lenz writes:\n\n> Smylers wrote:\n> \n> > Moritz Lenz writes:\n> > \n> > > Web is hopefully \"CGI done right\"\n> > \n> > ... why are we hoping that it will be \"done right\"?  \n> \n> Because we hope we learned from the past. There are several other\n> modules that fullfill most of CGI's tasks, some of them do most of it\n> better. Reimplementing one of them would already make Web a \"better\n> CGI\" ;-)\n\nIndeed -- making a better CGI is a great idea.\n\nBut the fact that such innovations came along later supports my point.\nI suspect that some of these got less mindshare than they otherwise\nwould have done (or were seen as inferior to CGI) because:\n\n* The CGI module was core.\n\n* By being called simply CGI, the CGI module gets some kind of\n  superiority over all the other modules which have to be\n  CGI::Something.\n\nHas Larry yet decreed whether Web will be bundled with Perl 6?\n\n> > Given the history of things like this it strikes me as unlikely that\n> > now is the particular moment where we suddenly manage to create a\n> > perfect library, and as such this would be hoping against the light\n> > of available evidence!\n> \n> You're right, but we should ship things as best as we can, so we try\n> ;-)\n\nOf course.  But there's a big difference between the attitude of 'let's\ndo the best we can right now' and 'this is our one chance to do this\nright'.\n\n> > It seems entirely possible that during Perl 6's life somebody,\n> > possibly somebody who at the moment hasn't even heard of Perl 6,\n> > will create a better web module.  It would be good if at that point\n> > it becomes straightforward for it to get acceptance and people to\n> > adopt it.\n> \n> Right, but that's no reason not to try hard on your own.\n\nIt isn't.  But it is a reason to anticipate the existence of future\ndevelopments, and try to be careful not to do anything which makes life\nharder for them.\n\nSmylers\n\n"}