{"category": "spam", "to_address": null, "from_address": "Johnny Powell <koolpop1@cox.net>", "subject": "From Johnny Powell Chambers", "body": "I am Johnny Powell an attorney to Christian Marty \nFrank, a Concorde pilot. property magnate who \nwas based in the U.K., Also referred to as my \nclient.On the 25th of July 2000, my client, his \nwife and their two Children died in the Air France \nconcord plane crash bound for New York in their \nplan for a world cruise, \nhttp://news.bbc.co.uk/1/hi/world/europe/859479.stm \nSince then I have been managing his properties \nhere in the U.K. and some of his properties, which \nhe put out for sale. Which I monitored the payment \nas his attorney, has been bought and paid for. Now \nthe money paid was deposited into his Local account \nhere. I have contacted you to assist in repatriating \nthe money and property left behind by my client \nbefore they get confiscated or declared \nunserviceable by his bank. Particularly, the \nbank has issued me a notice to provide any of \nhis next of kin or have the account confiscated \nwithin a short time. My late client has an account \nvalued at 15.5 million dollars. Since I have been \nunsuccessful in locating the relatives for some \ntime now, and with the bank giving me deadline, \nI now seek your consent to present you as the next \nof kin of the deceased, so that the proceeds of this \naccount valued at 15.5 million dollars can be paid to \nyou and then you, and I can share the money. 50% \nto me and 40%for you and 10% for miscellaneous \nexpenses that might arise. I have all necessary \ninformation that can be used to back up any \nClaim we may make. All I require is your honest \nco-operation to enable us see this deal through. I \nguarantee that this will be executed under a \nlegitimate arrangement that will protect you from \nany breach of the law. Trust me, as his attorney, this \nis a risk-free relationship.Please get in touch with \nme by alternative my email: johnnypowell_02@yahoo.co.uk \nand send me your full contact info to enable us discuss further about this \ntransaction.Best regards,Johnny Powell\n\n"}