{"category": "ham", "to_address": "Bert Freudenberg <bert@freudenbergs.de>", "from_address": "Simon Schamijer <simon@schampijer.de>", "subject": "Re: [sugar] olpc-games osc protocol", "body": "Bert Freudenberg wrote:\n> On Jun 11, 2007, at 13:06 , Simon Schamijer wrote:\n> \n>> Hi,\n>>\n>> memosono is using the osc protocol\n>> (http://opensoundcontrol.org/spec-1_0) to communicate with the game\n>> server and to talk to the csound server.\n> \n> Which game server? I thought osc is about sound?\n\nThe initial idea of osc was to use it in sound applications but it does \nnot mean it only works in sound applications. Memosono uses osc to talk \nto the game server and to the soundserver(which is activity wide at the \nmoment) as well.\n\n>> I think it is an easy to use\n>> protocol and maybe some other games or activities want to use it as well.\n> \n> Does that mean an osc server will be running? Or does it have to be \n> started by each activity?\n\nEach activity has an osc server running. I thought about inner activity \ncommunication. In memosono for example you may want to use the mesh \nnetwork to play the game. In this case the person who shares the game \nwill open a game server. The game server listens for osc messages from \nthe other players (switched tile x etc) and uses osc messages to \ncommunicate the game state to the players.\n\n\n> \n>> An osc message consists of an OSC address pattern (a path) followed by\n>> an OSC type tag string followed by zero or more OSC arguments.\n>>\n>> '/MEMOSONO/test', 'ifs', [1, 3.4, 'test']\n>>\n>> osc is callback based. On the receiver side the osc path and the type\n>> tag is used to dispatch the right callback.\n>>\n>> A python implementation of the osc protocol and a basic api for\n>> receiving and sending osc messages can be found in the memosono tree in\n>> the osc folder. There exist python bindings for the osc library liblo as\n>> well (http://das.nasophon.de/pyliblo/).\n> \n> There is an OSC package for Squeak at\n> \n> http://map.squeak.org/package/61f807be-83a3-4944-bfa1-686ddac7153c\n> \n> Now, to try that I would need to have csound (and an osc server?) \n> running in jhbuild. I saw chatter about this, but did anybody actually \n> make it available?\n> \n> - Bert -\n> \n\nThe initial olpc-csound-server was started by an init.d daemon on \nstartup. The idea to use csound as the olpc csound server has been \ndeprecated afaik. Memosono was the only activity using this service. I \nhave moved the sound server to the memosono activity and changed it to \nuse osc messages to control it.\nHowever if it is not used system wide the easier way is to create a \ncsound instance in the activity and use it directly (assuming we have \nonly one activity using the sound device at a time).\n\nBest,\n    Simon\n\n\n_______________________________________________\nSugar mailing list\nSugar@lists.laptop.org\nhttp://lists.laptop.org/listinfo/sugar\n\n"}