{"category": "ham", "to_address": "langa3@flax9.uwaterloo.ca", "from_address": "\"Windows Secrets\" <Editor@WindowsSecrets.com>", "subject": "Microsoft, McAfee, Symantec charge cards repeatedly [Newsletter Comp Version]", "body": "\n\nMicrosoft, McAfee, Symantec charge cards repeatedly\n\n\n\n\n\n\nIf your software garbles this newsletter, read \nthis issue \nat WindowsSecrets.com.\n\n\n\n   \n\n\n\n\n\n\n \n\n\n\n\nYOUR NEWSLETTER PREFERENCES\nChange\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nLocale: United States 90210\nReader number: 83107-13329\n\n\n   \n\n\n\n\n\n   \n\n\n\n\n Home \n Newsletter \n WinFind \n Reviews \n Polls \n Contact \n \n\n\n\n\n This issue \n Past issues \n Upgrade \n Prefs \n Unsubscribe \n \n\n\n\n\n   \n\n\n\n\n\n   \n\n\nWindows Secrets Newsletter • \nIssue 108 • \n2007-05-17 • \nCirculation: over 270,000\n\n   \n\n\n\n\n\n\n   \n\n\n\n \nContents\n\n\nTOP STORY: Microsoft, McAfee, Symantec charge cards repeatedly\nKNOWN ISSUES: What code signing is and is not good for\nWACKY WEB WEEK: Practice your bunny-surgery skills online\nKNOWN ISSUES 2: The reality of Microsoft's signed-drivers policy\nWOODY'S WINDOWS: Windows Home Server looks like a winner\nPERIMETER SCAN: Microsoft launches new security products\n\nYOUR SUBSCRIPTION:   How to change your address or unsubscribe  \n\n   \n\n\n\n\n\n\n   \n\n\nFor links to every subtopic in this issue, scroll down to the \nIndex\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nForget Vista, make your XP system faster\nPC Pitstop's Optimize Scan 1.5 is easy-to-use software  that will automatically diagnose problems with your PC and give you a custom report detailing issues that are hurting your PC's performance. Run this free scan now!  \nwww.pcpitstop.com\n\n\n\n\n\n\n\n\n\n \n\nLaunch your IT career with CompTIA A+\nOur CompTIA A+ training videos have everything you need to earn the industry's most popular and respected entry-level certification (including coverage of all four A+ exams). Tell employers you know computers — get A+ certified! View the demo now.\nwww.TrainSignal.com\n\n\n\n\n\n\n\n\n\n \n\nBackup your data with ZipBackup\nFinally, a backup program that is easy to use.  ZipBackup's Wizard makes backups a snap for beginners. Filtering,  scheduling, and disk spanning make it a powerful tool for experts. For a limited time, Windows Secrets readers receive 25% off.\nwww.zipbackup.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\nTOP STORY\n\n\n\nMicrosoft, McAfee, Symantec charge cards repeatedly\n\n\n\n\n\n\n\n\n\n\nBy Scott Dunn\nThese days, most antivirus and other security products come with a \nsubscription to update your virus definitions.\n\nSigning up usually means forced automatic subscription renewal, in which your \ncredit card is charged every year, and it's not easy to opt out — \nbut I'll show you how.\n\n\n\n\n\n\n\nSubscription sabotage: a case study\n\n\n\nIT consultant and Windows Secrets subscriber Bruce Weiskopf received a \nroutine notice that his Norton Internet Security \nproduct subscription was about to expire. Then, when he \nbegan examining some online forms, he became upset. There, in the fine \nprint, he noticed a clause saying he was already signed up for automatic \nsubscription renewal.\n\n\"It's barely noticeable, and, in any event, you aren't given the \nopportunity to decline at this point,\" he told Windows Secrets. All he could see \nwas a link for more information. So, he went to the Symantec Web site to find \nout more.\n\nAccording to Bruce, what ensued was an onerous process of hoop-jumping before he was \nfinally able to tell the company not to renew his subscription and charge his credit card \nautomatically each year.\n\n\"It's really, really an unconscionable scam,\" Bruce adds. \"I'm sure there are \nmany consumers who don't pay attention to their credit card statements, enabling \nSymantec to make quite a profit at about $50 a pop!\"\n\nFor those who feel as Bruce does, the unfortunate truth is that the practice of \nenrolling customers in automatic renewal for antivirus and other security \nproducts is not limited to Symantec. Indeed, it has become an industry standard. \nMicrosoft Windows Live OneCare, Symantec, McAfee, and ZoneAlarm all enroll customers \ninto the companies' automatic subscription-renewal programs with the purchase of a \nsubscription-based product. In most cases, customers aren't given a choice to opt out, \nand only find out about the annual renewals when they receive an e-mail notice or see \na charge on their credit card.\n\nFor some users, automatic renewal is a boon, since it saves the annual chore \nof manually renewing subscriptions to new virus definitions. Others \nview the policy with suspicion, especially since these policies are \noften not made clear at the outset. Moreover, the amount charged for the renewal each \nyear can change, depending on the going rate for the subscription at the time of \nthe renewal.\n\nIn order to get to the bottom of this, I bought products from each of the \nfollowing four security companies to see how transparent the auto-renewal \npolicy is and just how difficult it is to get out of the scheme once you \nknow about it.\n\n\n\nWindows Live OneCare is the least transparent\n\n\n\nOf all the companies I tested, Microsoft's all-in-one security and maintenance \npackage, Windows Live OneCare, has the most-hidden automatic \nsubscription-renewal policy and is the most difficult to learn how to cancel.\n\nYou begin the process by signing up for a free Windows Live account (basically a \nHotmail e-mail account). At the bottom of the form is a link to the \n\nWindows Live Service Agreement, \na 6,708-word document that hints at what's to come. It reads, \"If we \ninformed you that the service will be provided indefinitely or automatically \nrenewed, we may automatically renew your service and charge you for any renewal \nterm.\"\n\nThe actual commitment isn't made until you enter your credit-card information \nand are allowed to review your data before confirming the purchase. \nThe review page shows no information on the subscription-renewal policy — that is, \nuntil you click View Details under Windows Live OneCare. Only if you open the \nlink do you see this policy statement:\n\n\n\n\"You have selected a one year subscription to Windows Live OneCare ... This is an \nannual subscription that will be automatically charged to your credit card every \nyear at the then current price unless you cancel your account or select an \nalternative plan. You must agree to the Windows Live OneCare Subscription \nAgreement to access the service. Major credit card required. Prices subject to \nchange. Valid in US only.\"\n\n\nDespite the above language, no \"alternative plans\" are listed. Nor is any \ninformation provided on how to get out of the automatic renewal program.\n\nAfter your purchase, you can go to Microsoft's \n Billing and account management page and sign in with your Windows Live \ne-mail and password. There, you can click on the service you purchased (Windows\nLive OneCare) and see links for complete cancellation of the service itself.\nBut nowhere is there information on simply canceling recurring \ncredit-card charges.\n\nIn the end, you have to phone Windows Live OneCare Support at 866-663-2273\nin order to cancel only the automatic-renewal aspect of your subscription. (I\nwas told by a Microsoft representative that this toll-free number also\ncan be called from outside the U.S. if international dialing and the country\ncode 1 is used, but I wasn't able to test this.)\n\n\n\nMcAfee embeds auto-renewal policy in EULA\n\n\n\nA somewhat stealthy approach is taken by McAfee. As part of \nthe online purchase process, users see a scrolling box containing a \n3,280-word end-user license agreement (EULA). Buried in the scrolling text is a \nstatement that reads:\n\n\n\n\"If you have agreed to permit McAfee to automatically renew your subscription to \nthe Software by charging a valid credit card number which you have provided to \nMcAfee, your subscription will be automatically renewed thirty (30) days prior \nto the expiration of the term and each anniversary thereafter for a fee no \ngreater than McAfee's then-current price, excluding promotional and discount \npricing.\"\n\n\nAccording to the license, simply purchasing with a credit card gives the company \npermission to automatically charge you for a subscription renewal year after \nyear.\n\nHow do you get out of it? The EULA goes on to say:\n\n\n\n\"McAfee may continue charging you for any subscription automatically renewed \nunless you inform McAfee´s customer support department at (408) 992-8599 or \n(866) 622-3911 (or any other local number provided by the respective McAfee \nentity in your region) not to renew your subscription to the Software at least \nthirty (30) days prior to the expiration of your subscription to the Software \nand informing them of your desire not to have such subscription automatically \nrenewed.\"\n\n\nGranted, every customer should read the fine print before \npurchase. But, many would argue that this important information about ongoing \ncharges should be made more apparent.\n\nIn case you missed the phone numbers in the EULA, you can always cancel \nauto-renewal of your subscription at the McAfee Web site. However, \nfinding the right page isn't easy, especially since the \nsite's search feature provides no quick answers. Here are the steps for U.S. \ncustomers:\nStep 1: Go to \n\nMcAfee's main U.S. page.\nStep 2: At the right end of the navigation bar near the top, click \nMy Account.\nStep 3: Log in using your e-mail address and password.\nStep 4: In the navigation pane on the left, select Auto-Renewal Setup \nunder My Account.\nStep 5: Under Auto-Renewal Setup, the page should have check boxes \ncorresponding to each product you've purchased. Uncheck the boxes for each \nitem whose subscription you do not want to have renewed automatically. Then \nclick Done.\n\nCustomers outside the United States may need to contact a customer service \nrepresentative either by e-mail, phone, or online chat. These options are \navailable at McAfee's \n main customer service page.\n\n\n\nSymantec: Mandatory auto-renewal, but easier to cancel\n\n\n\nI found that Symantec actually has the second-best policy of the four security \nsites I tested. Symantec products give you no choice, requiring you to accept \nautomatic subscription renewal as part of your purchase, but at least this is \nmade pretty clear from the beginning. An explanation just below the \ncredit-card form in Symantec's online store reads, in part:\n\n\n\n\"By placing this order, you consent to Symantec automatically renewing your annual \nsubscription. Symantec will notify you by e-mail prior to expiration of your \ncurrent subscription ... If you do not want to be automatically charged, you \nmay discontinue the auto-renewal feature of Norton Ongoing Protection at \nany time after completing this order by following the instructions contained on \nthe Symantec Web site and in the confirmation e-mail.\"\n\n\nDespite the lack of choice, Symantec at least warns you, both at the time of \npurchase and in the confirmation e-mail. Moreover, it provides a link to the \n\ncancellation page, both in the \nonline receipt and the confirmation mail.\n\nOn the chance the buyer might miss these statements, I went to \nSymantec's main site to see \nhow hard it would be to find the cancellation page on my own. I entered cancel \nautomatic renewal in the search box at the top of the page. The search returned \nthree results, the first of which was an Enterprise Support Knowledge Base \narticle entitled \"How to cancel On-going Protection.\" The article included a \nlink to the cancellation form.\n\nThe actual cancellation process is a simple matter of filling out the form \nonline and clicking Submit. (This only cancels auto-renewal, not your current \nsubscription.) The only downside is that you'll need to have your name, e-mail \naddress, order number, product activation key, and product serial number to \ncomplete the form! So remember to save your online receipt or the confirmation \ne-mail you received after your purchase.\n\n\n\nZoneAlarm provides a fairly upfront choice\n\n\n\nAs far as security products go, \nCheck Point's ZoneAlarm is the least coercive when it comes to automatic \nsubscription renewal. Unlike the other three companies I tested, the order \nform for ZoneAlarm provides a check box where you enter your credit-card \ninformation that reads \"Automatically renew my subscription upon \nexpiration.\" The box is checked by default, however, so if you miss \nit, you'll be signed up for automatic charges until you cancel. And the \nconfirmation e-mail you receive won't clue you in to this fact.\n\nOnce you're signed up for automatic renewal with a ZoneAlarm product, \ncanceling the auto-renewal isn't too difficult — providing you know \nwhere on ZoneAlarm's site to look. I had to do a lot of clicking around to \nfind the right page, and the site's search function was little to no help. \nHere's the solution:\nStep 1: On \n\nZoneAlarm's main page, click Customer Support in the navigation pane \non the left.\nStep 2: On the \n Customer Service page, click Login to My Account \nunder Customer Service. You may be \nprompted whether to display both secure and nonsecure items.\nStep 3: On the \n Account Login page, enter the user ID and password you created \nwhen you purchased the product. Click Sign In Now! Again, you \nmay be prompted whether to display both secure and nonsecure items.\nStep 4: On the My Account page, click Manage Subscriptions \nunder the Manage Subscriptions heading.\nStep 5: On the Manage Subscriptions page, look in the section \nwith the Automatic License Renewal heading. Choose Manually renew \nthis license from the Renewal Option drop-down list. Click Submit.\n\n\n\nWhat's behind the hard-to-cancel policies?\n\n\n\nNot surprisingly, companies that enroll customers in automatic-renewal programs \nby default tend to describe the policy as an advantage for customers.\n\nA Microsoft spokeswoman explained that \"the goal of implementing the \nautomatic-renewal process was to protect customers from an interruption in their \nservice. Recent studies show as many as two-thirds of antivirus users postpone \ntheir subscription renewal.\" (Microsoft policy prohibits identifying \np.r. spokespeople by name.)\n\nJohn Gable, director of product management for Check Point's ZoneAlarm \ndivision, says the company's recently implemented auto-renewal practice \nwas intended \"to help consumers keep their subscriptions up to date, \nas well as in response to feedback from many users who felt subscription \nrenewal reminders were too intrusive.\"\n\nCorporate altruism doesn't seem to be the only motive in the move to recurring \ncredit-card charges, however. Last year, an article in \n\nTechWeb credited Symantec's then consumer-group chief Enrique Salem as \nsaying that automatic renewal of product updates was one of several \n\"revenue-generating\" strategies to \"pump up the consumer group's \nbottom line.\" (A representative I contacted at Symantec did not \nprovide a comment by press time.)\n\n\n\nConsumer reaction is decidely negative\n\n\n\nDespite the promise of continued service that automatic renewal offers, some \ncustomers clearly don't like being signed up for recurring credit-card billing \nby default. It isn't difficult to find complaints about this practice posted in \nonline forums.\n\nFor example, a user with the screen name RideRed claimed in \n\nBroadbandReports.com that Symantec charged his credit card at renewal time \nwithout his consent, despite the fact that he had turned off automatic renewal \nat the time he made his purchase.\n\nSimilarly, a user of \n Digg.com comments:\n\n\n\n\"I usually don't sign up for services \nthat auto-renew. Why? Because I am surrounded by examples of companies that \nREFUSE to stop charging when the customer tells them to. They call it an 'error' \nand keep right on charging — all you can do is call and hope they eventually stop \ntaking your money for a service you've long since stopped using.\"\n\n\nQuantifying the level of dissatisfaction is \nmore difficult. None of the companies I was able to reach had (or would reveal) \nthe number of customers who have canceled automatic renewal, although the \nMicrosoft representative did say the majority of customers are auto-renewing \ntheir subscriptions.\n\nNevertheless, it's safe to say most companies track customer \ncomplaints and respond when they reach a critical level. As ZoneAlarm's John \nGable acknowledges, \"We are continuing to run usability testing with regards to \nplacement of the auto-renew option and whether to keep it checked by default or \nnot. Therefore, the way we have it today may very well change based on user \nfeedback.\"\n\n\n\nIf you feel the pain, you must complain\n\n\n\nNo product I reviewed has a completely clean record. ZoneAlarm, to its credit, \nactually does allow users to opt out of automatic renewal before \ncompleting a purchase (but opting out is not the default choice). Symantec, \nfor its part, does make its auto-renewal process apparent and \nrelatively easy to turn off — compared with the worst cases.\n\nI'm the first to agree that the ability to automatically renew a subscription, \nespecially to an important security service, is a convenience most customers \nshould consider. But to compel customers to adopt automatic charges and then \nhide or obscure that fact is quite another matter. Security \ncompanies compound the problem by making the cancellation process difficult \nand hard to find. In most cases, companies are implementing this policy in every \ncountry where they can lawfully do so.\n\nMicrosoft's spokeswoman told me that the company \"has taken steps to prevent \ntheir customers from being surprised by automatic renewals. Sign-up forms make \nit clear that online customers are entering an automatic-renewal program.\"\n\nBut this is in direct contradiction to my own purchasing experience. It may come as \na surprise to Microsoft that not everyone clicks every link to read the fine print \nduring their online shopping experiences.\n\nAlthough the companies I surveyed send out reminders before the renewal fee is \ncharged, customers can easily lose track of these notices in the deluge of spam \nand business promotions they receive each day.\n\nCorporations seldom change policies that make them rich, unless enough customers \ncomplain. If automatic renewal works for you, then by all means keep the service \ngoing. But, if you don't like the way it's been implemented by your security \nprovider, it's time to let them know.\n\n\n\t\t\t\tReader, please rate the above article:\n1: Poor \n\t\t\t\t2: Fair \n\t\t\t\t3: Good \n\t\t\t\t4: Great  5: Superb\n\n\n\nScott Dunn is associate editor of the Windows Secrets Newsletter. He is \nalso a contributing editor of PC World Magazine, where he has written a \nmonthly column since 1992, and co-author of \n 101 Windows Tips & Tricks (Peachpit) with Jesse Berst and Charles Bermant.\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nGet your product seen by 270,000 readers\nDoes your company offer a product or service? Now you can place an ad in the Windows Secrets Newsletter and be seen by more than 270,000 active buyers of PC hardware and software. Bid as much or as little as you like to get the ideal ad placement.\nwww.WindowsSecrets.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\nKNOWN ISSUES\n\n\nWhat code signing is and isn't good for\n\n\n\n\nBy Scott Dunn\nAs I explained in my \n\nMay 10 article, driver-signing requirements for the 64-bit version of \nVista have slowed down developers, but not hackers.\n\nReaders wrote in, pointing out further complications, while cautioning \nthat the practice of driver signing itself is still useful.\n\n\n\nCode signing is valuable, despite flaws\n\n\n\nRegarding my story on Microsoft's driver-signing strategy for Windows \nVista, reader Donald P. Welker writes:\n\n\n\n\"I'm afraid your FUD [fear, uncertainty, and doubt] may be even more dangerous \nthan Microsoft's. There is no basis for trusting a vendor-supplied (or worse, \ndownloaded) binary without code signing. While Microsoft clearly deserves your \nindictment of their shortcomings, your article overlooks the fact that \nthird-party antimalware products can also examine code signatures and prevent \ninstallation and/or execution on that basis.\n\n\"Since it seems unlikely that we're \ngoing to force Microsoft into an open-source model, we have no choice but to \naccept a code-signing model and start signing our code. If there's a real \nAchilles heel in code signing, it would be the allowance of file-based \ncertificates instead of mandatory use of smart cards or similar tamper-resistant \ntokens. Besides, signing open-source code is a good idea \nanyway.\"\n\n\nJust to clarify, it was not and is not my intention to say that driver signing \nis a bad idea, or that it should be abandoned. On the contrary, in light of the \nconstant security and malware threats users face, a multipronged approach to \nsecurity only makes sense.\n\nThe point of the article was that the specific \napproach taken by Microsoft so far in Vista development has not been enough to \nstop serious hackers, while the certification process has created headaches for \nthe legitimate driver developers.\n\n\n\nAnother way to subvert driver signing\n\n\n\nReader Robert Chapin has his own concerns about driver signing:\n\n\n\n\"Scott Dunn didn't mention the most fundamental flaw of the Vista device \ndriver-signing scheme. In fact, because there is no facility for un-signing a driver, \nthis scheme has a history of benefiting malware coders. Once a driver is signed, \nit is considered safe by the OS, even when that driver is obsolete. This \nfundamental problem has been exploited to overwrite drivers with older, published \nversions that are known to have security bugs in them, thus allowing the target \nto be compromised.\n\n\nThere's more on code-signing, our \nMay 3 \nstory on Data Execution Prevention (DEP), and restrictions — and the \nlack thereof — on academic editions of software in the \npaid version of today's newsletter. \n\n How to upgrade\n\n\n\nContents\n Index\n\n\n\n   \n\n\n\n\n   \n\n\n\nTELL A FRIEND\n\nHow you can share this information\nWe love it when you send your friends links to our articles. But please don't \nforward your copy of our e-mail newsletter to people, which subjects us to spam \ncomplaints. Instead, simply suggest that your friends visit this issue's permanent \nWeb address, shown below. A complete index at the bottom of the \nWeb page provides you with hyperlinks to any article you'd like to recommend.\n\nThe address of this issue is http://WindowsSecrets.com/comp/070517\n\n   \n\n\n\n\n   \n\n\n\nEDITOR'S BOOKSHELF\n\n\n \n\n\n\nGet the tips you need about Windows Vista\n\n\n\nThe all-new Windows Vista Secrets helps novices \nand experts alike understand Microsoft's latest operating system. \n\"To really appreciate what is in Vista, you almost \nneed to read through the leading book on the product, Windows Vista \nSecrets, by Brian Livingston and Paul Thurrott,\" writes Rob Enderle, \nprincipal analyst of the Enderle Group, in TechNewsWorld. \"It's 595 \npages of things you can do with this product — most of which \nyou probably wouldn't have discovered for some time, let alone right \nat first.\" Check the book out now for tips you can use.\nMore information:\nUnited States / \nCanada / \nElsewhere\n\n \n\n\n\nSpam-Proof Your E-Mail Address, 2nd Ed.\n\n\n\nThis 32-page e-book by Brian Livingston gives you step-by-step instructions that \ncan prevent 97% of the spam that would otherwise clog an e-mail\naccount. You could call it \"Livingston's Spam Secrets.\" The PDF e-book\nis the result of months of experiments and tests we conducted. We now\nreceive little or no spam to the addresses we used as guinea pigs. These tests\nshow that you can make your e-mail addresses invisible to spammers,\nnot just battle an ever-growing flood. The methods we describe\nwork with Windows, Apple, and Linux and don't require any filters or block\nlists — but you can use those in addition to the book's techniques,\nif you wish. \n\nMore info\n\n   \n\n\n\n\n\n   \n\n\n\nContents  \nIndex\n\n   \n\n\n\n\n   \n\n\n\nWACKY WEB WEEK\nPractice your \nbunny-surgery skills online\n\n\n\n\n\n\n\n\n\nIf you've ever wanted be a surgeon, you've probably realized that your first \nattempts should be on something safe — for example, on a stuffed bunny. \nNow, you can do just that, without ever hurting the bunny!\n\nThis Flash-based game is a demonstration of the services offered by 10mg \nInteractive of Amsterdam. It lets you resuscitate a dead bunny, then shave \nand operate, saving its life — if you can. But, you may find surgery \nis harder than you thought. Even virtual surgery!\nPlay the game\n\n\n\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n\n   \n\n\n\nINDEX\n\nThe following topics appear in the free version\n\n\n\n\nTOP STORY  \nMicrosoft, McAfee, Symantec charge cards repeatedly\n\n \nSubscription sabotage: a case study\n\n \n Windows Live OneCare is the least transparent\n\n \nMcAfee embeds auto-renewal policy in EULA\n\n \nSymantec: Mandatory auto-renewal, but easier to cancel\n\n \nZoneAlarm provides a fairly upfront choice\n\n \nWhat's behind the hard-to-cancel policies?\n\n \n Consumer reaction is decidely negative\n\n \nIf you feel the pain, you must complain\n\n \n \n\n\nKNOWN ISSUES  \nWhat code signing is and is not good for\n\n \nCode signing is valuable, despite flaws\n\n \nAnother way to evade driver signing\n\n \n \n\n\nWACKY WEB WEEK  \nPractice your bunny-surgery skills online\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou get all of the following in the paid version\n\n\nKNOWN ISSUES 2  \nThe reality of Microsoft's signed-drivers policy\n\n \nMicrosoft does what it wants\n\n \nToward a deeper understanding of DEP\n\n \nAdobe places few restrictions on educational versions\n\n \n \n\n\nWOODY'S WINDOWS  \nWindows Home Server looks like a winner\n\n \nNot another Windows Server, puh-lease\n\n \nThe six pillars of WHS\n\n \nThere's more coming in WHS\n\n \n \n\n\nPERIMETER SCAN  \nMicrosoft launches new security products\n\n \nForeFront Security 2007 centralizes MS antimalware\n\n \nSystem Center Operations Manager is the new MOM\n\n \nSystem Center Essentials is the scaled-down version\n\n \n \n\n\n\nPaid subscribers can access all old and new paid newsletter content\nMake a contribution to support our research into Windows and you'll immediately\nbe able to read and search through scores of valuable articles. In addition,\npaid subscribers are entitled to download valuable content that we license for\nyou at least once every calendar quarter.\nTo upgrade, simply make a contribution of any amount you choose.\nIf you do this by May 23, 2007, \nyou'll instantly be sent the full, paid version of today's newsletter.\n\nTo upgrade to the paid version of the Windows Secrets Newsletter, please visit our \n upgrade page.\n\nThanks in advance.\n\n\n   \n\n\n\n\n\n   \n\n\n\nContents\n Index\n\n\n   \n\n\n\n\n\n   \n\n\n\nYOUR SUBSCRIPTION\n\nThe Windows Secrets Newsletter is published weekly on \nthe 1st through 4th Thursdays of each month, plus occasional news updates. \nVacation breaks occur in late August, Thanksgiving Week, and Christmas/New Year's.\nPublisher: WindowsSecrets.com, Attn.: #120 Editor, 1700 7th Ave., Suite 116, \nSeattle, WA 98101-1323 USA. Vendors, please send no unsolicited packages to this address \n(readers' letters are fine).\nEditorial Director: Brian Livingston. Editor-at-Large: Fred Langa. Associate \nEditor: Scott Dunn. Contributing Editors: Susan Bradley, Mark Edwards, Woody \nLeonhard, Chris Mosby, Ryan Russell. Research Director: Vickie Stevens. \nProgram Director: Brent Scheffler. Managing Editor: Jody Braverman.\nTrademarks: Microsoft and Windows are registered trademarks of Microsoft \nCorporation. The Windows Secrets series of books is published by\nWiley Publishing Inc. The Windows Secrets Newsletter,  \nWindowsSecrets.com, LangaList, LangaList Plus, WinFind, Security Baseline, Patch Watch, \nPerimeter Scan, Wacky Web Week, the Logo Design (W, S or road, and Star), and the \nslogan Everything Microsoft Forgot to Mention all are trademarks and service \nmarks of WindowsSecrets.com LLC. All other marks are the trademarks or service \nmarks of their respective owners.\n\n\nYOUR SUBSCRIPTION PREFERENCES\n(change \nyour preferences):\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nCountry: United States\nZIP or postal code: 90210\nReader number: 83107-13329\nBounce count: 0\n\nYour bounce count is the number of times your server has bounced a newsletter back to us\nsince the last time you visited your preferences page. We cannot send newsletters to you\nafter your bounce count reaches 3, due to ISP policies. If your bounce count is higher\nthan 0 or blank, please visit your\npreferences page.\nThis automatically resets your bounce count to 0.\nTo change your preferences: Please visit your \npreferences  page.\nTo access all past issues: Please visit our\npast issues page.\nTo upgrade your free subscription to paid: Please visit our \nupgrade  page.\nTo resend a missed newsletter to yourself: If your mail server filtered \nout a\nnewsletter, you can resend the current issue to yourself. To do so, visit your\npreferences page\nand use the Resend link.\nTo get subscription help by e-mail (fastest method): Visit our \ncontact page.\nSubscription help by facsimile:\n206-282-6312 (fax). Emergency subscription help by phone: 206-282-2536 (24\nhours).\n\nHOW TO SUBSCRIBE: Anyone may subscribe to this newsletter by visiting our \nfree signup page.\nWE GUARANTEE YOUR PRIVACY:\n\n1. We will never sell, rent, or give away your address to any outside party, ever.\n2. We will never send you any unrequested e-mail, besides newsletter updates.\n3. All unsubscribe requests are honored immediately, period.  \nPrivacy policy\nHOW TO UNSUBSCRIBE: To unsubscribe\nlanga3@speedy.uwaterloo.ca\nfrom the Windows Secrets Newsletter,\nUse\nthis 2-click\nUnsubscribe\nlink; or\nSend\na blank e-mail to\nunsub@WindowsSecrets.net\nwith leave langa3@speedy.uwaterloo.ca\nas the Subject line; or\nVisit our \nUnsubscribe page.\n\n\nCopyright © 2007 by WindowsSecrets.com LLC. All rights reserved.\n\n\nContents\n Index\n\n\n\n\n\n\n   \n\n\n\n\n\n"}