{"category": "spam", "to_address": "Smiles <smiles@flax9.uwaterloo.ca>", "from_address": "Allison Avila <smokefeet@gonetchannels.com>", "subject": "Hymen penetrator", "body": "\n\nThe differences between men and women is that women are always ready for sex, but men need an erection. Let us remove this difference by offering you Viagra!\nGo to the shop\nU can restore your health right now. Doesn't matter what the problem is - we have pills to cure everything. Erection Dysfunction, Weight loss, Anti-Depressants, Antibiotics and even more! \nAll this you can find here\nThere is no need to go to your local drug store!\nWith best regards,\nAllison Avila\n \n \nTut mne prishla v golovu mysl, zastavivshaia spriatat ulybku: Znaesh, ller, a odna prosba u menia vse zhe est. S nekotoryh por. Ty hochesh skazat, chto posviashchen tolko inoplanetnik, etot galtov Niks?! nadsazhivaias, prooral v otvet sheltianin, chut ne placha ot boli, Otchaianiia i bessilnogo gneva. Stoit otkryt glaza, i etot zhutkij i zhestokij mir snova vcepitsia v Glotku vsemi svoimi kogtiami, mir, gde smert, igraia so mnoj v priatki, Nezrimo sleduet po piatam. \nOn vseh podvel, on tak vseh podvel. Prestupnikom i podvergsia. On pil moiu energiiu ogromnymi Zhadnymi glotkami, rasschityvaia bystro oslabit menia, no ne ponimaia, chto ia s Pomoshchiu Klinka v sostoianii nakormit sotniu takih zhe monstrov, kak shefir, daj Tolko mne vremia. I chto samoe interesnoe, nikto za eto vremia Menia ne tronul. Ot shirokoplechego, krepko sbitogo tela korda ishodila Oshchutimaia fizicheskaia sila, a izrezannoe vetrom i vremenem lico prinadlezhalo Cheloveku, privykshemu komandovat hotia by i na svoej lohanke. Skolko ty poluchaesh kak posrednik za rejs? Nu, po-raznomu. No somneniia menia na etom ne ostavili. Moi oshchushcheniia mozhno sravnit s rabotoj restavratora, Vosstanavlivaiushchego drevnie, prekrasnye proizvedeniia iskusstva. \nVozduh budto by zagustel, a raznokalibernye teni zdanij Neestestvenno bystro pocherneli, vmig uplotnivshis nastolko, chto chast Ploshchadi, na kotoruiu oni padali, stala kazatsia edinym provalom v inoe Izmerenie, v bezdonnuiu propast, ogromnoj razverzshejsia pastiu chem ugodno, Tolko ne teniu. Poka ia riadom, nikomu ne budet izvestno o nashem razgovore. Poslushaet etot kriuchkonosyj togo, vtorogo? Ladno, Celitel, s holodnoj zloboj progovoril kriuchkonosyj. A potomu uchast kazhdogo iz nih byla Predreshena, kak tolko ih noga stupala vo vladeniia Vnutrennego Kruga. ejisuminyon Ql9aWFBCckBEUFRWShpARlNHUUddXVwaVlA=\n \n\n\n"}