{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "This weekend on BBC Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJONATHAN AGNEW ON 50 YEARS OF TMS\nTest Match Special is celebrating its 50th birthday this summer which is a marvellous achievement.\n\n\nIt is such a unique programme and it's more than just cricket commentary, it has grown into something different.\n\n\nIt's hopefully an intelligent debating forum where people can tell stories and have a laugh, but perhaps most importantly of all, listeners have always been able to enjoy direct contact with the show. \n\n\nThis was the legacy of the late, great Brian Johnston.\n\n\nHe was the master of being able to make people think he was talking to listeners as individuals and hopefully that lives on. \n\n\nFor all of us it's as close to a dream job as we could imagine. \n\n\nWe are all too old and decrepit to still be playing professional cricket so this is without doubt the next best thing.\n\n\nOur producer Peter Baxter retires at the end of the West Indies series after an amazing 34 years in the job.\n\n\nHis impact on the team has been enormous, he has set the tone for the programme and I will miss him terribly as he has been my colleague, friend and travelling companion for 17 years.\n\n\nIf I had to pick out my favourite moment working on TMS it would have to be the 2005 Ashes series.\n\n\nMore than anything though, and it sounds corny, I just enjoy every day as they are all so completely unpredictable.\n\n\nAnd the start of the third Test between England and the West Indies certainly didn't disappoint.\n\n\nEngland looked to be cruising, but suddenly found themselves struggling after the West Indies' bowlers finally found the right line.\n\n\nThe pitch at Old Trafford has become the fastest in the country, and as we saw last year against Pakistan, the pitch can be steepling and uneven.\n\n\nI am very much looking forward to seeing Steve Harmison bowling on it and it will be fascinating to see whether the influence of new bowling consultant Allan Donald will have any effect.\n\n\nEnjoy the action,\n\n\nAggers \n\n\nJonathan Agnew is part of the Test Match Special team that is commentating on the third Test between England v West Indies at Old Trafford. You can listen to TMS on BBC Radio 4 198LW and on Five Live Sports Extra on digitial radio from 1045 BST \n\n\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nCRICKET\n bbc.co.uk/cricket\nSaturday\n1045-1900, Radio 4 198LW, Radio Five Live Sports Extra, BBCi and BBC Sport website.\nSunday\n1045-1900, Radio 4 198LW, Radio Five Live Sports Extra, BBCi and BBC Sport website.\n\n\n\n\n\n\nTENNIS\n bbc.co.uk/tennis\nSaturday\nFrench Open women's final: 1400-1635, BBC ONE, BBC Radio Five Live/online  \nSunday\nFrench Open men's final: 1345-1900, BBCi; BBC Radio Five Live/online, 1400-1700; 1600-1810, BBC TWO.\n\n\n\n\n\n\nRUGBY LEAGUE\n bbc.co.uk/rugbyleague\nSaturday\nChallenge Cup quarter-final: St Helens v Warrington (1210-1400, BBC ONE and BBC Sport website); Interactive forum (1400-1430, BBCi and BBC Sport website).\nSunday\nChallenge Cup quarter-final: Bradford v Huddersfield (1400-1600, BBC TWO and BBC Sport website).\n\n\n\n\n\n\nMORE SPORT ON THE BBC\n bbc.co.uk/tvandradio\nSaturday\nMotoGP: Catalunya qualifying (1245-1400, BBCi and BBC Sport website); Formula One: Canadian Grand Prix qualifying (1800, Radio Five Live/online).\nSunday\nMotoGP: Catalunya race live (1230-1400, BBCi and BBC Sport website); MotoGP Extra (1400-1430, BBCi and website); Formula One: Canadian Grand Prix (1800, Radio Five Live/online).\n\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tTest Match Special blog\n Read expert opinions on the third Test\n\t\t\t\t\t\n\t\t\t\t\t\tDazzler behind the mic\n Darren Gough starts a new show on BBC Five Live \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}