{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTHURSDAY 5 JULY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER ROBERT MORGAN\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nINTEREST RATES\n\n\nThe cost of borrowing is going up again - the Bank of England has raised the interest rate by a quarter of one per cent to five and three quarters percent. Why have interest rates gone up now and who or what is responsible? Our Economics Editor, Stephanie Flanders, will give us the benefit of her analysis.\n\n\nWe hope to be joined by senior politicians from all main parties to discuss the state of the UK economy and whether we can cope with a record 1.3 trillion pounds level of personal debt.\n\n\nFLOODS\n\n\nThe government has made clear that it's considering \"as a matter of urgency\" extra funding for those areas hit by last week's floods.  In Hull, thousands of people are struggling to cope with what has been described by the local authority as a \"humanitarian disaster\" - after the city was deluged with two months of rain in just 12 hours.  \n\n\nThe local council says its resources have been overwhelmed and it's accused ministers of ignoring their plight. Our science editor Susan Watts is on the case. The Department of Environment say they're responsible for sorting out the damage. But Susan is finding that it's difficult to pin down who out of the agencies and local authorities on the ground is really in charge.   \n\n\nWe hope to bring together the Leader of Hull City Council and a government minister to discuss what should be done.\n\n\nSCHOOL SWAP\n\n\nEarlier this year on Newsnight we teamed up with our colleagues at BBC Look North in Yorkshire and started a project called Bradford United - with two groups of 15-year-olds reporting on life at two different schools in the city.  At one school called Laisterdyke most pupils are Asian.   At Hanson School most are white.  This week, we got the two groups together for the first time to tell us about their experience with a different community - and at a different school.\n\n\nYou can watch the original report and read more about the project by clicking here.\n\n\nQUARRYMEN\n\n\nIt's 50 years this week since a very young Paul McCartney first met John Lennon and his band The Quarrymen. As Liverpool celebrates, Peter Marshall reports on a day that changed music for ever.\n\n\nSee you at 10.30pm.\n\n\nRobert\n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nCHOCOLATE PROTEST\n\n\t\t\t\t\t\t\tSchool children have protested against modern day slavery in the cocoa trade following Newsnight's report\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}