{"category": "ham", "to_address": "<ip-health@lists.essential.org>", "from_address": "\"Sean Flynn\" <sflynn@wcl.american.edu>", "subject": "[Ip-health] Drug makers fear trade deal from House Dems, administration", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nThe Hill\n\nThe Executive\n\n\n\nDrug makers fear trade deal from House Dems, administration\n\n\n\nBy Ian Swanson\n\nMay 03, 2007\n\nResearch-based pharmaceutical companies could be among the biggest\nlosers if House Democrats and the Bush administration reach an agreement\non trade, industry sources said this week.\n\nThe administration is prepared to accept changes demanded by Ways and\nMeans Committee Chairman Charles Rangel (D-N.Y.) that would lessen\nprotections in trade deals for brand-name drugs, according to drug\nindustry sources and business lobbyists closely following talks.\n\nThese protections consistently had been included in U.S. trade deals\nthat were approved by the Republican Congress. For example, the Central\nAmerican Free Trade Agreement (CAFTA) included \"data exclusivity\"\nprovisions that can delay the arrival of generic drugs on the market,\nsometimes even after a patent for a brand-name drug expires.\n\nSome public health activists see the shift as a sign that the trend\ntoward ever-stricter intellectual property rules for drug patents is\nturning with a Democratic Congress. \"We'd see that as an improvement,\" a\npolicy adviser at the advocacy group Oxfam, Stephanie Burgos, said.\n\nBusiness lobbyists and some sources in the pharmaceutical industry also\nsaid the trade talks reflect a tougher political climate for\npharmaceutical companies. They noted that while the administration is\ndrawing a line in the sand over labor talks related to the trade deals,\nit is not being as aggressive in defending the pharmaceutical industry.\n\nIndustry sources said U.S. drug makers realize they cannot stop the\ntrade deals from being approved no matter how much they protest if there\nis a deal between the administration and Rangel. As a result, they\nquestioned how strenuously the drug lobby would fight the deals if they\nmove forward.\n\nExpending political capital on the trade agreements might not make sense\nin a context in which U.S. drug producers are under siege on many other\nissues, one industry source said, since while international patent rules\nare important, U.S. rules are even more valuable. Just last week, the\nSenate approved legislation lifting a prohibition on government\ninvolvement in price negotiations between drug makers and Medicare Part\nD plans.\n\nOne industry source predicted that at a minimum, U.S. drug makers would\noppose pending free-trade deals with Panama, Peru, Colombia and South\nKorea that have different provisions than deals approved by the\nRepublican Congress. He also said the changes \"call into question the\nvalue of the intellectual property protections in the free-trade\nagreements\" for the industry.\n\nRangel explained his position to drug industry representatives in a\nmeeting last week, sources said. A spokesman for the Pharmaceutical\nResearch and Manufacturers of America (PhRMA) said that discussions are\ncontinuing and that proposals on patent rules for pharmaceuticals in\ntrade deals are still evolving. He said U.S. drug makers share Rangel's\nobjective of providing access to medicines for residents of trading\npartners.\n\nOther lobbyists, however, predicted there would be at best only minor\nchanges to the terms laid out by Rangel and his staff if there were a\nseparate deal on labor. Rangel is insisting on the changes in response\nto long-standing complaints from members of his caucus, including House\nOversight and Government Reform Committee Chairman Henry Waxman\n(D-Calif.).\n\nLabor issues have been the major sticking point in the talks, and labor\nand business sources said those talks hit a snag last week after a\nmeeting between Rangel and AFL-CIO President John Sweeney when Sweeney\nsaid labor could not support deals that would prevent U.S. labor laws\nfrom being challenged for violating International Labor Organization\nprinciples.\n\nOne of the biggest changes Rangel is pushing deals with data\nexclusivity, which prevents generic-drug makers from using the clinical\ntest data used by brand-name drugs to secure marketing approval for\ntheir generic drugs. In the Central American deal, this protection lasts\nfive years.\n\nThis has the effect of preventing generic drugs from coming to the\nmarket. PhRMA has argued that such restrictions are justified to reward\nthe innovation of the research-based drug companies, and because of\ndelays that can prevent those drugs from coming to market during their\npatent life.\n\nThe language Rangel is pushing would start the data-exclusivity clock\nonce a brand-name drug receives marketing approval in the U.S..\n\nSome activists, however, argue this does not go far enough, and that\npoor countries such as Peru and Colombia should not be subject to the\nsame rules as U.S. law. Burgos said Oxfam's position is that these\ncountries should only be subject to the standards of the World Trade\nOrganization, and not the stricter terms of U.S. law.\n\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}