{"category": "ham", "to_address": "jdaviestx@tx.rr.com, debian-desktop@lists.debian.org,\n   debian-publicity@lists.debian.org", "from_address": "Luis Matos <a26652@alunos.mec.ua.pt>", "subject": "Re: congratulations to all Debian  contributors", "body": "Dom, 2007-04-15 às 14:08 -0700, jdaviestx@tx.rr.com escreveu:\n> Tester of the Tecra M5 here - I was just repeating what I read on the official \"cdrecord\" website; the author disparaged the Debian packages, so I didn't look to see if they were there or not.\n> \nok, so i will give you the news: cdrecord was forked in debian because\nhe has now non free license or other issues. Now it is called wodim.\n\n>From cdrecord's description:\n\nDescription: Dummy transition package for wodim\n This is a dummy package to ease the transition to wodim, the fork of\n cdrecord.  It provides a cdrecord symlink to wodim for compatibility\n purposes.  Please use wodim instead of cdrecord.\n\n\n> BTW, I love Debian - been using it since Potato.  But this latest release is really amazing.\n\nyes, true. I am just stating what i also read on other reviews and that\ndon't make the debian way of doing stuff and makes users have more work\nto find stuff that is already in debian.\n\njust to check, please do, with contrib and non-free enabled in\nsources.list ( just add non-free contrib next to main )\n\napt-cache search 3945\nyou have kernel-module and a daemon to check when the wireless card is\non.\n\napt-cache search nvidia.\n\nbesides the nvidia drivers there is also all utilities.\n\nI would like, if possible, you to test them.\n\ni would also you to fill a bug against gdm because of the monitor issue.\n\nuse \"reportbug gdm\" from the command line.\n\n\nAnyway, thank you for your review. It is nice to have hardware tested\nwith debian to ensure users that it works and warn them about possible\nproblems.\n\nbest regards\n\nLuis atos\n> \n> ---- Luis Matos  wrote: \n> > Dom, 2007-04-15 às 14:15 -0300, André Felipe Machado escreveu:\n> > > Hello,\n> > > Please, read the reviews at  http://wiki.debian.org/PressCoverage2007 >\n> > > Debian GNU/Linux 4.0 reviews :\n> > > \"Debian redefines itself with new release\"\n> > > \"Installing Debian Etch on Toshiba Tecra M5\"\n> > > Congratulations.\n> > > Andre Felipe Machado\n> > > \n> > > \n> > > \n> > just a point ...\n> > \n> > from the reviews i read i found that all of them had the same\n> > supposition: debian is only the main repository.\n> > \n> > in the tecra M5, for example, the DVD rom i don't have a work, but there\n> > are nvidia drivers and the ipw3945ABG ... i have one of this is my own\n> > laptop and worked out of the box ( after i added non-free and installed\n> > it, of course)\n> >  .. and there is xsupplicant in debian ( and it is installed i think by\n> > network-manager) no need to download nd install it from source.\n> > \n> > \n> > There ARE nvidia drivers, packaged from nvidia.com in non-free ... \n> > \n> > i am pointing this out because:\n> > \n> > 1) maintainers packaged this nd maintain good quality solutions in terms\n> > of stability and ompatibility with the system\n> > \n> > 2) it's easier for the user to add non-free and install the packages.\n> > \n> > 3) Debian is a fine quality distribution that includes TONS of\n> > software... and people thinks that it does not have some of the more\n> > important support for wireless and video).\n> > \n> > \n> > other comments directly to the tester of the M5 laptop:\n> > \n> >  - cdrecord is not even in debian.\n> >  - please use debian tools to check the description of the package named\n> > cdrecord.\n> > \n> > seems to me that you are  console kind of guy. (apt-cache show cdrecord\n> > is your friend)\n> > \n> > also, i think there are some issues that are found to be important:\n> >  - gdm overlaps xorg.conf\n> >  - hwclock issue.\n> > \n> > best regards\n> > \n> > Luis Matos\n> > \n> \n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}