{"category": "ham", "to_address": "ip-health@lists.essential.org, HEALTHGAP@LISTSERV.CRITPATH.ORG", "from_address": "Sheila.SHETTLE@geneva.msf.org", "subject": "[Ip-health] MSF: G8 Declaration Will Directly Harm Access to Medicines Across the\n Developing World", "body": "G8 Declaration on Innovation and Intellectual Property Will Directly Harm\n              Access to Medicines Across the Developing World\n\nHeiligendamm, 7 June 2007 \\u2013 The G8 leaders\\u2019 agreement to demand higher\nlevels of intellectual property protection in emerging economies is set to\nhave a major negative impact on access to affordable medicines in all\ndeveloping countries and fails to promote health innovation where it is\nmost needed, the international medical humanitarian organization Médecins\nSans Frontières (MSF) said today.\n\nMiddle-income countries such as India and Brazil are key producers of\naffordable essential medicines that are used locally and across the\ndeveloping world.  Generic medicines produced in India, for example, make\nup more than 80% of antiretrovirals (ARVs) used by MSF to treat over 80,000\npatients in its AIDS projects in over 30 countries. The day before meeting\na number of developing country leaders, the G8 have already decided to\ncreate a new process to further increase patent protection in the\ndeveloping world, in particular in emerging economies.\n\n\\u201cIf the G8 further increases patent protection, it will keep prices of new\ndrugs across Africa, Asia and Latin America high and will do nothing to\nstimulate innovation where it is most needed,\\u201d said Dr. Tido von\nSchoen-Angerer, Director of MSF\\u2019s Campaign for Access to Essential\nMedicines. \\u201cWe need AIDS medicines that are more affordable and we also\ndesperately need new and better tests and medicines to treat tuberculosis\nand tropical diseases.\\u201d\n\nA report from the World Health Organization (WHO) released in April 2006\nfound that intellectual property protection does not stimulate development\nof medicines to treat diseases that primarily affect people in developing\ncountries. Yet G8 leaders solely promote increased intellectual property\nprotection as the way to foster innovation. Although WHO has set up an\nintergovernmental working group to address the problem of innovation and\naccess for developing countries, the G8 is flatly ignoring this process.\n\nCounterfeit medicines are a danger to people\\u2019s health that received\nparticular attention by the G8. Similar attention should have been paid to\nthe need for affordable, quality generic medicines upon which poor\ncountries can rely.\n\nWith international trade laws making medicines patenting far more\nwidespread, newer drugs are becoming unaffordable.  Newer medicines are\ncritical, e.g. for the treatment of AIDS, where a second-line drug\ncombination costs at least five times more than first line.\n\nTo address high drug prices, countries such as Brazil and Thailand have\nrecently overcome patent barriers by issuing \\u2018compulsory licenses\\u2019 on\nseveral drugs. Although these measures are fully compliant with the TRIPS\nAgreement of the World Trade Organization, these countries are facing\nunacceptable pressure and retaliation from some governments and\npharmaceutical companies.\n\nBy ignoring fora that have traditionally dealt with intellectual property\nand instead only inviting five emerging economies to talks, the G8 is\nignoring the critical input of other developing countries, whose own\nability to obtain affordable and appropriate medicines is affected by such\ndiscussions.\n\n\\u201cStricter levels of intellectual property protection will only worsen the\nhealth crisis in developing countries, where medicines are either\nunaffordable or simply not available because there is no market to\nincentivise their development,\\u201d said Rohit Malpani, Policy Advisor with\nOxfam.\n\nContact:\nSheila Shettle + 41.79.293.0270, Christiane Löll + 49.163.88 08 405\n\n\n\n+++++++++++++++++++++\nSheila Shettle\nSenior Communications Officer\nMédecins Sans Frontières\nCampaign for Access to Essential Medicines\nRue de Lausanne 78\n1211 Geneva, Switzerland\n+ 41.22.849.8403\n+ 41.79.293.0270 (m.)\nwww.accessmed-msf.org\n+++++++++++++++++++++++\nSIGN MSF'S 'DROP THE CASE' PETITION\n\nMillions of people around the world today rely on affordable medicines\nproduced in India.  Pharmaceutical company Novartis is taking the Indian\ngovernment to court to force a change in the country's patent law.  If\nNovartis wins, a major source of affordable medicines for millions of\npeople across the globe could dry up.\n\nMSF is urging Novartis to DROP THE CASE.\n\nFind out more and sign up to our petition:\nhttp://www.msf.org/petition_india/international.html\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}