{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Ira Glazer <ira@yanua.com>", "subject": "[Ip-health] PhRMA: \"How can a chronic, slow-acting, non-contagious condition\n be considered a public-health crisis?\"", "body": "http://tinyurl.com/2frhy4*\n\n*(from thehill.com)*\n*\nContributed by Ian Swanson\nMay 23, 2007\n\nDrug companies are making a concerted effort to increase pressure on\nThailand and other developing countries to honor\nU.S. drug patents.  The Pharmaceutical Research and Manufacturers\nAssociation (PhRMA) is alarmed by Thailand's decision to authorize  the\nproduction of generic versions of two AIDS drugs that are still under\nU.S. company patents, as well as one\ncardiovascular drug.\n\nIn particular, U.S. drug-makers worry that other countries could emulate\nThailand's decision. Brazil earlier this month\nannounced it will authorize a license for the production of an AIDS\ndrugs, PhRMA notes.  PhRMA President and Chief Executive Officer Bill\nTauzin said that in the long term, this move could cost U.S. jobs and\ncause the entire system of protecting intellectual property \"to crumble.\"\n\nIf other countries also issue compulsory licenses for the production of\ngeneric drugs, particularly emerging markets like\nThailand, Tauzin said U.S. consumers would be forced to carry a greater\nburden of covering the industry's research and\ndevelopment costs.\n\nWorld Trade Organization (WTO) rules do grant poor countries the right\nto issue compulsory licenses authorizing the\nproduction of generic drugs to deal with public health crises. But\ncritics feel Thailand is pushing the envelope by\nannouncing a license for Plavix, a cardiovascular disease medication.\n\nTauzin met with Thailand Health Minister Mongkol na Songkhla on Tuesday\nto discuss the issuance of the three\ncompulsory licenses. In a follow-up call to reporters, Tauzin emphasized\nthat his talks with the Thai minister were frank\nand helpful, and that Mongkol emphasized that his country sees the\nissuance of compulsory licenses as a rare event.\n\nThailand officials have also suggested they may issue a compulsory\nlicense for a cancer drug, but Tauzin said Mongkol\noffered nothing new during the meeting on that subject.\n\nTauzin said Mongkol's message to PhRMA was that many of Thailand's\ncitizens are mired in poverty and that the country\nhas a need for access to cheap medicines. Tauzin said PhRMA's hope is\nthat Thailand will fully consult with U.S.\ncompanies to lower drug costs without resorting to authorizing the\nproduction of generic drugs.\n\nAt the same time, Tauzin said that if Thailand continues to issue\ncompulsory licenses for the production of drugs\nprotected by patents, PhRMA could press the administration for tougher\naction. He specifically mentioned the possibility\nthat the U.S. could eliminate trade preferences allowing some Thai\nimports to enter the country duty-free.\n\nIndeed, the Office of the U.S. Trade Representative late last month\nissued an annual U.S. report on the status of\nintellectual property protections that faulted Thailand for\ndeteriorating patent protections. The Special 301 report elevated\nThailand to a list of \"priority watch\" countries, which could lead to a\ndecision to withdraw trade preferences.\n\nBut it is unclear whether Washington will want to punish poor countries\nthat issue compulsory licenses to increase their\nsupplies of affordable drugs, particularly with Democrats in charge of\nCongress and PhRMA's influence on the wane.\n\nThailand's actions have received support from some key advocates,\nincluding former President Bill Clinton, whose\nClinton Foundation has worked with drug companies to lower prices for\nmedicines in developing countries. The Reuters\nnews service this week quoted Clinton as stating that \"no company will\nlive or die because of high price premiums for\nAIDS drugs in middle-income countries, but patients may.\"\n\nRep. Henry Waxman (D-Calif.), in a statement released after his meeting\nwith the health minister said the U.S. should\nrespect Thailand's decision.   But some in the pharmaceutical industry\nbelieve members of Congress will draw a distinction between drugs for\nthe treatment of AIDS, malaria and tuberculosis, and those for other\ndiseases such as cancer or heart disease. \"How can a chronic,\nslow-acting, non-contagious condition be considered a public-health\ncrisis?\" asked one lobbyist. He suggested there could be bipartisan\nsupport for actions against Thailand or other countries that issue\ncompulsory licenses for non- AIDS drugs.\n\nIn March, five Democratic senators and 12 Democratic House members\nraised the issue in letters to U.S. Trade\nRepresentative Susan Schwab. They said the use of WTO rules to produce\ngeneric AIDS drugs is one thing, but the\nrules were not intended to be used on just any medicine.\n\nWhile Thailand has argued the issuance of compulsory licenses was\nnecessary to pay for drugs through its national\nhealth-care system, Tauzin said the country's government, run by the\nmilitary after a coup last year, has increased\nmilitary spending while arguing it cannot afford to pay for patented drugs.\n\n Tauzin said the debate will always be controversial because finding the\nbalance between access to medicines and  paying for research and\ndevelopment costs is always difficult. At the same time, he expressed\nsome confidence that PhRMA's arguments would have support.\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}