{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nEU Full Market Opening: The End of the Beginning (UtiliPoint.com - Jul. 2, 2007) \n\n\n\nUtiliPoint.com - Jul. 2, 2007 - It is now July and the deadline for full energy retail market opening in the European Union (EU) has passed, yet the European Commission's desired goal of a single, efficiently functioning European energy market remains a distant possibility rather than an imminent actuality.\n\n\nJul 2, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jul. 2, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jul. 2, 2007\n\n\nJul 2, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for July 2, 2007  \n\n\n\nFirst Enercast Featured Articles for July 2, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nJul 2, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nDeal cuts Atmos' proposed hike: Rate increase could take effect in fall\n\n\n\nJul. 3--A rate increase requested by natural gas provider Atmos Energy Corp. will be lower than expected under an agreement reached with the state attorney general's office.  Attorney General Greg Stumbo has announced that the utility, which provides natural gas service to 173,000 customers in western Kentucky, has agreed to cut the rate increase it was seeking from the state Public Service ...\n\n\nJul 3, 2007 Knight Ridder Tribune Business News\n\n\n\nUtility will resume payments to Akron: Agreement reached on water, sewer bill\n\n\n\nJul. 3--The last water bill that the indebted steam utility Akron Thermal paid in cash to the city was in 1999. But starting this month, Akron will start collecting again.  Akron Thermal is the second largest retail user of Akron water and the third largest retail user by volume of Akron's sewers. It owes $5.2 million in water and sewer bills. Two weeks ago, the utility filed for bankruptcy ...\n\n\nJul 3, 2007 Knight Ridder Tribune Business News\n\n\n\nAquila hires reader for Lawrence meters\n\n\n\nJul. 3--David Dudley has joined Aquila in Lawrence as a meter reader, responsible for accurately reading the company's natural gas meters and observing meter sets monthly to identify potential problems.  Dudley worked previously as a carpenter, and recently completed boot camp with the Kansas National Guard. Kansas City, Mo.-based Aquila's natural gas business for Kansas is based in Lawrence at ...\n\n\nJul 3, 2007 Knight Ridder Tribune Business News\n\n\n\nEast Ky. Power settles EPA suit: WILL SPEND $650 MILLION FOR POLLUTION CONTROLS, PAY FINE\n\n\n\nJul. 3--East Kentucky Power Cooperative will pay a $750,000 fine and spend more than $650 million on pollution controls as part of a settlement announced yesterday to end a 2004 lawsuit by the federal government.  The suit alleged that East Kentucky Power modified its Spurlock and Dale electric-generating plants without getting the proper permits or installing new technology.\n\n\nJul 3, 2007 Knight Ridder Tribune Business News\n\n\n\nCalifornians asked to cut energy use today\n\n\n\nJul. 3--Californians facing the summer's first major heat wave are being asked to conserve -- or risk losing their power.  The California Independent System Operator, which manages the state's power grid, urged all Californians to cut energy use from 2 p.m. to 6 p.m. today. Rising temperatures coupled with damaged powered lines in Southern California could mean tight power supplies for all of the ...\n\n\nJul 3, 2007 Knight Ridder Tribune Business News\n\n\n\nTacoma utilities boss to take job in D.C.\n\n\n\nJul. 3--Tacoma Public Utilities Director Mark Crisson, who helped create Click! Network and Tacoma's second water supply, announced Monday that he is retiring from his current position to head the American Public Power Association in Washington, D.C.  Crisson led the agency for 15 years. \"It's a big loss to the city to lose him,\" said Bob Casey, the board's vice chairman.\n\n\nJul 3, 2007 Knight Ridder Tribune Business News\n\n\n\nOrmat Technologies signs 20-year deal with SCE: Market sources: The contract could be worth up to $51.5 million a year.\n\n\n\nJul. 2--Ormat Industries Ltd. (TASE: ORMT) subsidiary Ormat Technologies Inc. (NYSE: ORA) has signed 20-year power purchase agreement (PPA) with Southern California Edison (SCE) to purchase 50 megawatts (MW) of clean energy output from the company's Brawley I Project, which Ormat is building in Imperial County, California. The PPA includes an option to increase deliveries to SCE to 100 MWs at ...\n\n\nJul 2, 2007 Knight Ridder Tribune Business News\n\n\n\nMinnesota, other states take lead on climate\n\n\n\nJul. 2--In the race among states to do something about the warming planet, Minnesota legislators this spring voted to reduce carbon dioxide pollution, ordered power companies to conserve more energy and adopted the nation's most aggressive goals for switching to wind power and other renewable energy.  But when it comes to tackling what Gov. Tim Pawlenty called a \"huge and defining issue for our ...\n\n\nJul 2, 2007 Knight Ridder Tribune Business News\n\n\n\nAlcoa bid for power called boggling: Per-job subsidy comes to $148,000 a year\n\n\n\nJul. 2--Which companies should get inexpensive electricity to help shore up the local economy? That question is especially important in Western New York, where a huge block of discounted industrial power will go up for grabs over six years. Do the same companies now receiving power get to keep it largely because possession is nine-tenths of the law? Or should the power be put to its best ...\n\n\nJul 2, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nGlobal warming gives nukes new energy\n\n\n\nThanks to global warming, nuclear energy is hot again. Its promise of abundant, carbon emissions-free power is being pushed by the president and newly considered by environmentalists. But any expansion wont come cheap or easy. The enormous obstacles facing nuclear power are the same as they were in 1996, when the nations last new nuclear plant opened near the Watts Bar reservoir in Tennessee ...\n\n\nJul 2, 2007 Boston Herald\n\n\n\nWatchdog Opposes Power Projects\n\n\n\nContracts To Aid Plant Construction Termed Too Costly A state agency that represents electric ratepayers says a series of contracts to help pay for new power plant construction should be rejected because the contracts could cost ratepayers nearly $2 billion and are not cost-effective. The four power projects that state regulators selected in April are designed to save ratepayers money during the ...\n\n\nJul 3, 2007 Hartford Courant\n\n\n\nSolar Power Generation Information & Resources: Power Engineering Magazine & Buyer's Guide\n\n\n\nSolar power generation, like wind power, makes sense because the fuel is free and the power produced is clean and renewable. Like windmills, solar generating systems can be constructed to meet any sized requirement and are easily modified to meet changing energy needs. Cost-effective solar power generation requires large-scale solar-heated collectors driving steam turbines--and plenty of ...\n\n\nJul 2, 2007 Power Engineering\n\n\n\nGreen flooring panels save money while they heat\n\n\n\nThe push to build green and reduce energy costs is gaining mainstream appeal in residential construction, and Gary Hydock hopes to capitalize on the trend. Hydocks company, GCS Radiant in Amherst, makes radiant floor heat panels that are designed to sharply reduce the cost of heating a home. The panels he invented and patented use recycled products and require less construction materials to ...\n\n\nJul 2, 2007 Buffalo News\n\n\n\nStorm power\n\n\n\nWhile most people consider the wonders of generators only when staring down the barrel of a hurricane, Nathan Iacobacci, president of Weather Engineers in Melbourne, thinks about it 365 days a year. In summer, however, the rest of the world catches up with him. 'If people see a storm anywhere, the phones start ringing off the hook,' Iacobacci said. 'It's become a very popular item.' Weather ...\n\n\nJul 2, 2007 Florida Today\n\n\n\nEPA unit probing Mo. reservoir collapse\n\n\n\nCriminal investigators at the Environmental Protection Agency are looking into a 2005 reservoir collapse that flooded a state park, injuring the park superintendent and his family, documents show. The collapse of Ameren Corp.'s Taum Sauk reservoir in southeast Missouri washed mud, rocks and debris into the Black River, along with more than a billion gallons of water, and significantly damaged ...\n\n\nJul 3, 2007 Buffalo News\n\n\n\nDuquesne Light Co. Refurbishes URD System\n\n\n\nThe Digital Utility Vegetation Management To keep the customers connected to a secure and reliable source of electricity, the Duquesne Light Co. (DLC; Pittsburgh, Pennsylvania, U.S.) invested US$500 million in its transmission and distribution system. While DLC's infrastructure has served customers well for decades, some components are nearing the end of their useful operating lives.\n\n\nJul 3, 2007 Transmission & Distribution World\n\n\n\n\n\nPSA: SEMCO ENERGY GAS COMPANY Experiencing Intermittent Phone Outage; Alternate Emergency Contact in Place\n\n\n\nSEMCO ENERGY GAS COMPANY is currently experiencing intermittent telephone system outages. Customers who need to report a gas leak or emergency should call their local emergency services dispatch number until further notice. The message will be forwarded to SEMCO ENERGY. This system is for EMERGENCIES ONLY. Thank you for your patience and cooperation. SEMCO ENERGY, Inc.\n\n\nJul 3, 2007 PR Newswire\n\n\n\nHusky Energy Completes Ohio Lima Refinery Acquisition\n\n\n\nHusky Energy Inc. (TSX: HSE) is pleased to announce the completion of its acquisition of the refinery in Lima, Ohio from Valero Energy Corporation. The transaction was effective July 1, 2007.  Husky Energy Inc. (TSX: HSE) is pleased to announce the completion of its acquisition of the refinery in Lima, Ohio from Valero Energy Corporation. The transaction was effective July 1, 2007.\n\n\nJul 3, 2007 Internet Wire\n\n\n\nHydroGen Corporation Announces Mechanical Completion of Commercial Demonstration Fuel Cell Power Plant\n\n\n\nCLEVELAND--(BUSINESS WIRE)--HydroGen Corporation (Nasdaq: HYDG), a designer and manufacturer of multi-megawatt air-cooled phosphoric acid fuel cell (PAFC) systems, today announced the mechanical completion and initiation of pre-commissioning activities of the Companys full-scale 400 kW commercial demonstration PAFC power plant at Ashta Chemicals Inc.s chlor-alkali plant in Ashtabula, Ohio.\n\n\nJul 3, 2007 Business Wire\n\n\n\nTEP Seeks Its First Rate Increase in 12 Years to Recover Rising Costs\n\n\n\nTUCSON, Ariz.--(BUSINESS WIRE)--Tucson Electric Power Company (TEP) has requested its first rate increase in more than a decade to help cover the rising cost of serving its growing customer base. TEP customers are paying lower rates today than we charged in 1994 despite a 42 percent increase in consumer prices since then and even more dramatic increases in the cost of providing electric service, ...\n\n\nJul 2, 2007 Business Wire\n\n\n\nCMS Energy Announces Final Debt Tender Results And Senior Note Issuance\n\n\n\nJACKSON, Mich., July 3 /PRNewswire-FirstCall/ -- CMS Energy (NYSE: CMS) announced today the final tender results for its previously announced offer to purchase its 7.5 percent Senior Notes Due 2009 (CUSIP No. 125896 AH3). As of 11:59 p.m. EDT Monday, July 2, 2007, the expiration date, CMS Energy had received tenders for $360.597 million in principal amount of the notes representing 88 percent of ...\n\n\nJul 3, 2007 PR Newswire\n\n\n\n\n\nConstellation Energy Subsidiary Completes Cornerstone Energy Buy\n\n\n\nBALTIMORE (AP) - Power supplier Constellation Energy said Monday a subsidiary completed its acquisition of Cornerstone Energy Inc. to create one of the country's biggest natural gas marketing companies. Financial terms were not disclosed, but Constellation Energy said it expects the deal to be neutral to 2007 earnings and to add moderately to 2008 profit. The deal  which was first announced in ...\n\n\nJul 2, 2007 Canadian Business Magazine\n\n\n\nFund says New York ISO withheld information from market players\n\n\n\nA company that trades in transmission congestion credits has accused the New York Independent System Operator of violating its open-access transmission tariff by failing to inform market participants that two gas turbines with a combined capacity of nearly 94 MW had been relocated from outside to inside a Staten Island load pocket. In a complaint filed Friday with the US Federal Energy Regulatory ...\n\n\nJul 3, 2007 Platts\n\n\n\nAES appeals District Court decision on LNG terminal zoning\n\n\n\nNew York (Platts)--2Jul2007  Arlington, Virginia-based AES Corp. has appealed a recent US District Court judge's ruling regarding a zoning ordinance that would block a proposed liquefied natural gas import facility outside Baltimore. AES's Sparrows Point LNG facility is planned for a former industrial site near Dundalk, Maryland, but Judge Richard Bennett late last month upheld a Baltimore ...\n\n\nJul 3, 2007 Platts\n\n\n\nTucson Electric proposes three options for raising rates\n\n\n\nPortland, Maine (Platts)--3Jul2007 Tucson Electric Power Monday offered Arizona regulators three approaches for raising the utility's electric rates, which could boost annual revenue between $117 million, or 14.9%, and $181 million, 23%, according to a Tuesday filing with the US Securities and Exchange Commission. The current rates for TEP, a UniSource Energy subsidiary, are set to expire at the ...\n\n\nJul 3, 2007 Platts\n\n\n\nCEZ to take MUS to court over long-term coal supply agreement\n\n\n\nCEZ to take MUS to court over long-term coal supply agreementCzech utility CEZ is taking Mostecka Uhelna, a member of the Czech Coal Group, to court, over claims that the company is impeding the implementation of a long-term coal supply agreement that was established in 2005.CEZ made the agreement with Mostecka Uhelna (MUS), which ensured coal supply until 2055, because of the impending ...\n\n\nJul 2, 2007 Datamonitor\n\n\n\nSCE Proposes Final Leg Of California's Largest Renewable Transmission Project\n\n\n\nSouthern California Edison (SCE) has applied to the California Public Utilities Commission (CPUC) and the U.S. Forest Service for authorization to construct Segments 4 through 11 of the Tehachapi Renewable Transmission Project, a series of new and upgraded high-voltage electric transmission lines to deliver electricity from proposed new wind farms in the Tehachapi Wind Resource Area to SCE ...\n\n\nJul 3, 2007 Power Online\n\n\n\nDOE Provides Up To $51.8 Million to Modernize The U.S. Electric Grid System\n\n\n\nThe U.S. Department of Energy will provide up to $51.8 million for five cost-shared projects that will help accelerate much-needed modernization of the nation's electricity grid. This research will advance the development and application of high-temperature superconductors, which have the potential to alleviate congestion on an electricity grid that is experiencing increased demand from ...\n\n\nJul 3, 2007 Power Online\n\n\n\nStep towards single electricity market\n\n\n\nEnergy regulators north and south say the main step towards a single all-island electricity market has been taken. The Commission for Energy Regulation and the NIAUR say the legal framework the start of trading on November 1 this year is now in place. The single electricity market is a set of wholesale trading arrangements aimed at bringing more competition and security of supply to electricity ...\n\n\nJul 3, 2007 RTE Online\n\n\n\nRio Tinto commits $1.8 billion to expand Yarwun alumina refinery\n\n\n\nRio Tinto has approved a $1.8 billion expansion of its wholly owned Yarwun alumina refinery in Gladstone in the eastern Australian state of Queensland. The project will more than double the plant's production capacity from 1.4 million mt/year to 3.4 million mt/year of alumina by 2011, the Anglo-Australian resources giant said Tuesday. Work on the expansion will start in the third quarter of 2007 ...\n\n\nJul 3, 2007 Platts\n\n\n\nWesdyne, NFS win nuke down-blend contract\n\n\n\nThe U.S. National Nuclear Security Administration has awarded a contract to down-blend more than 17 tons of uranium. The NNSA, an agency of the U.S. Department of Energy, announced Friday that it had given the contract to a consortium of Wesdyne International -- a subsidiary of the Westinghouse Electric Co. -- and Nuclear Fuel Services. The two companies will 'down-blend 17.4 metric tons of U.S. ...\n\n\nJul 2, 2007 UPI\n\n\n\nInternational Rectifier Fires CFO\n\n\n\nThe El Segundo, Calif.-based chipmaker said Monday that its board of directors has terminated the employment of Michael McGee, who has served as CFO since 1993. Until the company finds a permanent replacement, it said, Linda Pahl, the vice president of corporate finance, would serve as CFO. The company didn't specifically say why McGee was fired, although the announcement mentioned the ongoing ...\n\n\nJul 2, 2007 TheStreet.com\n\n\n\nHSBC to spend 45m on green initiatives over next five years\n\n\n\nHSBC is to spend $90m (45m) over the next five years to help reduce the bank's impact on the environment. The company is to introduce a series of initiatives, including the use of renewable energy technology, water and waste reduction programmes, and an employee engagement drive. The  will be reviewed annually to consider the success of trials, emerging technology, innovation and business needs. ...\n\n\nJul 2, 2007 Personnel Today\n\n\n\nHSBC invests in environmental change\n\n\n\nBanking giant HSBC has appointed former government advisor Sir Nicholas Stern to help reduce the firms impact on the environment through a series of initiatives including the introduction of renewable energy technology. Stern was economic adviser on climate change and development to the prime minister and chancellor from 2003-7 and led the Stern Review on the Economics of Climate Change.\n\n\nJul 2, 2007 Computing.co.uk\n\n\n\nHSBC invests in environmental change\n\n\n\nFormer government advisor Sir Nicholas Stern appointed to help the bank become carbon neutral Banking giant HSBC has appointed former government advisor Sir Nicholas Stern to help reduce the firms impact on the environment through a series of initiatives including the introduction of renewable energy technology. Stern was economic adviser on climate change and development to the prime minister ...\n\n\nJul 2, 2007 IT Week\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nMerkel confronts German energy industry with radical policy overhaul\n\n\n\nBERLIN: The German chancellor, Angela Merkel, Tuesday announced an ambitious plan to reduce greenhouse emissions by up to 40 percent by 2020, an initiative welcomed by environmentalists but harshly criticized by the energy industry, a powerful lobby. Merkel also ruled out any change to the government's nuclear policy before the next election, scheduled for 2009, that calls for the industry to be ...\n\n\nJul 3, 2007 International Herald Tribune\n\n\n\nAdvisor appointed on first western-funded wind project in China\n\n\n\n- SgurrEnergy, a UK-based independent renewable energy consultancy, has been appointed to advise on a multi-million pound wind farm development in China. The company will provide technical advice on the first-phase of the Bailingmiao project on behalf of Honiton Energy, a company emerging as China's fastest-growing alternative energy provider. The project is the first Chinese wind farm to be ...\n\n\nJul 3, 2007 Power Engineering\n\n\n\nEdison Will Buy Power From Sempra's Baja Wind Farm\n\n\n\nA Sempra Energy subsidiary plans to develop a 250-megawatt wind-power generation project in Baja California, Mexico, and sell at least part of that power to Southern California Edison. Sempra Generation announced its plans June 29 to develop the wind farm. It announced a 20-year contract with Edison on July 2. The news marks Sempra's entrance into the renewable-energy-development business.\n\n\nJul 2, 2007 San Diego Business Journal\n\n\n\nFeasibility Study Report of Guodian Wanxi Power Plant Passed Examination, an Industrial Info News Alert\n\n\n\nResearched by Industrial Info Resources (Sugar  Researched by Industrial Info Resources (Sugar Land, Texas).  The Examination Meeting for the Feasibility Study Report of the Guodian Wanxi Power plant project, which will include two 600-megawatt (MW) units, was held by the Electric Power Planning &amp; Engineering Institute, an agent directly under China Power Engineering Consulting Group ...\n\n\nJul 3, 2007 Internet Wire\n\n\n\nValue-Creating Wind Energy Alliance Completed by GE Energy Financial Services and Theolia\n\n\n\nPARIS and STAMFORD, Conn.--(BUSINESS WIRE)--GE Energy Financial Services, the energy investing unit of GE (NYSE:GE), and Theolia announced today the completion of a previously announced transaction that will significantly increase Theolias wind generation portfolio in Europe, bring it additional capital to fund growth, and form an alliance to access additional wind project development ...\n\n\nJul 3, 2007 Business Wire\n\n\n\nN Korea may delay nuclear shutdown\n\n\n\nNorth Korea has said it wants to get promised shipments of oil before shutting down its Yongbyon nuclear reactor, delaying again a key obligation under a February nuclear agreement, US officials have said. Administration critics of the agreement said the demand was further evidence of North Korean bad faith, but two other senior officials said they believe the agreement was on track and any delay ...\n\n\nJul 3, 2007 Dominion Post\n\n\n\nOil rises to 10-month high\n\n\n\nLONDON (Reuters) -- Oil prices struck a 10-month high on Tuesday on strong summer driving demand in top consumer the United States. U.S. crude for August delivery settled up 32 cents to $71.41 on the New York Mercantile Exchange, its highest since last August. Experts have been concerned about U.S. gasoline supplies as domestic refiners strain to meet rising summer demand. U.S.\n\n\nJul 3, 2007 Fortune\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}