{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "\"heeseob nam\" <hurips@gmail.com>", "subject": "[Ip-health] Patent Linkage in KORUS FTA and Its Comparison with AUS FTA", "body": "This is a preliminary analysis on \"approval-patent linkage\" provision\nin the KORUS FTA, text of which was released today. Welcome comments\nto hurips@gmail.com.\n\nText of KORUS FTA and AUS FTA\n\nArticle 18.9:4 of KORUS FTA\n\nWhere a Party permits, as a condition of approving the marketing of a\npharmaceutical product, persons, other than the person originally\nsubmitting safety or efficacy information, to rely on that information\nor on evidence of safety or efficacy information of a product that was\npreviously approved, such as evidence of prior marketing approval in\nthe territory of the Party or in another territory, that Party shall:\n(a)\tprovide that the patent owner shall be notified of the identity of\nany such other person that requests marketing approval to enter the\nmarket during the term of a patent notified to the approving authority\nas covering that product or its approved method of use; and\n(b)\timplement measures in its marketing approval process to prevent\nsuch other persons from marketing a product without the consent or\nacquiescence of the patent owner during the term of a patent notified\nto the approving authority as covering that product or its approved\nmethod of use.\n\nArticle 17.10:4 of AUSFTA\n\nWhere a Party permits, as a condition of approving the marketing of a\npharmaceutical product, persons, other than the person originally\nsubmitting the safety or efficacy information, to rely on evidence or\ninformation concerning the safety or efficacy of a product that was\npreviously approved, such as evidence of prior marketing approval by\nthe Party or in another territory:\n(a) that Party shall provide measures in its marketing approval\nprocess to prevent those other persons from:\n(i) marketing a product, where that product is claimed in a patent; or\n(ii) marketing a product for an approved use, where that approved use\nis claimed in a patent, during the term of that patent, unless by\nconsent or acquiescence of the patent owner; and\n(b) if the Party permits a third person to request marketing approval\nto enter the market with:\n(i) a product during the term of a patent identified as claiming the product; or\n(ii) a product for an approved use, during the term of a patent\nidentified as claiming that approved use, the Party shall provide for\nthe patent owner to be notified of such request and the identity of\nany such other person.\n\nDifferences between KORUS FTA and AUS FTA and Analysis\n\n1. \"Implement measures\" vs. \"provide measures\"\n\nKORUS FTA requires that the Party shall \"implement\" measures, while\nAUS FTA requires that the Party shall \"provide\" measures. KORUS FTA\nseems to require higher obligation than AUS FTA.\n\nIn this regard, Korean government explains that during the negotiation\nher negotiating team denied accepting the demand of US to include\n\"automatic stay (30 months)\" when a patent holder files a patent\ninfringement action. Instead it is said to have \"agreed to devise an\nappropriate way to implement\" according to detailed explanations\nreleased by Korean government on May 25, 2007.\n\n2. \"patent notified to the approving authority\"\n\nThis is a new phrase, which is not found in any other FTAs involving\nUS. Every patent can benefit the approval-patent linkage provision\nsimply by notifying the drug-approval authority of a patent\ninformation. Further, this phrase eliminates any possible policy\nmeasures, which may be taken by Korea without such a phrase, to\nevaluate if a patent is valid or generic drug actually infringes the\npatent before applying the linkage benefit to the patent.\n\n3. \"patent notified \\u2026 as covering that product or its approved method\nof use\" vs. \"product/approved use is claimed in a patent\"\n\nPatent that covers a pharmaceutical product is much broader than a\npatent that claims a pharmaceutical product. For instance, a process\nclaimed in a patent can cover a product produced by the process. See\nArticle 28(b) of TRIPS Agreement saying \"a party shall confer on its\nowner the following exclusive rights \\u2026 where the subject matter of a\npatent is a process, to prevent third parties not having the owner's\nconsent from the act of using the process, and from the acts of:\nusing, offering for sale, selling, or importing for these purposes at\nleast the product obtained directly by that process\".\n\nKorean government argues that, with this phrase, only a product patent\nand a new use patent are applicable to the linkage provision and any\npatents directed to a manufacturing process or packaging are excluded\nfrom the linkage provision. However, it seems that this argument goes\nfar beyond the actual meaning of the text.\n\n4. \"Automatic stay of 30-month\"\n\nNeither the KORUS FTA nor the AUS FTA offers means for early\nresolution of patent disputes.  The \"automatic stay\" is a mechanism to\nbalance the patent linkage system by facilitating the\nelimination of weak patents and encouraging timely resolution of\npatent disputes under the US law (see GPhA's letter to USTR on March\n2, 2006).\n\nI believe that the Korean negotiating team denied the US demand to\ninsert the \"automatic stay\" in the linkage provision simply because\nthey misunderstood the linkage system in FTA and in the US law.\n\n--\nHeeSeob Nam\nIPLeft (www.ipleft.or.kr)\nMobile: +82 11 470 1180\nhurips@gmail.com\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}