{"category": "spam", "to_address": "\"Duane Gene\" <nishi@plg.uwaterloo.ca>", "from_address": "\"Muriel.\" <Murielmyub@pha.roacoxmail.com>", "subject": "You have received a new message from Muriel", "body": "ARE YOU BORED IN BED WITH YOUR PARTNER?\n\nStatistics show that 76% of women are unsatisfied with their partner's\nbedroom performance. Are you one of these women? Are you one of their\npartners?\nWell, no matter who you are, there is a solution, the Vibrating Ring!\n\nThis safe, fun, easy-to-use product is the latest pleasure-giving toy that\neveryone's talking about. It expands to fit all sizes, it's comfortable, and\nit massages all the right places. If you want to have time in between the\nsheets, then you want the Vibrating Ring.\n\nThe Vibrating Ring features a raised tickler for her external stimulation,\nand the deep vibrations mean that he can stay harder for longer. And if it's\nmultiple pleasures she wants, thanks to the Vibrating Ring, it's what she\nwill get! Don't put it off any longer! let the Vibrating Ring help you\ntoday.\n\nAffordable to everyone and enjoyed by Everyone! \nhttp://www.theultimatetoy.net\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\napart such groups as the (now largely vanished the scene), the political\nactivist beatniks, folk beatniks, and then, and only the original hippies\nper Members of these subsidiaries wore identifying badges that held for\ninsiders. Teeny-boppers, for example, were beardless, in fact, being too\nyoung to Sandals were \"in\" with folk set, but not of the others. The\ntightness one's trousers varied to subcult. At the level of ideas, there \nmany common complaints about the dominant But sharp differences emerged\nwith respect political and social action. ranged from the withdrawal of the\nhippie, through the unconcern of the teeny-bopper, to the involvement of the\nNew activist and the activities of groupings the Dutch provos, Crazies, and\nthe guerrilla crowd. The hippie corporation, to speak, grew too to handle\nall its business in \nstandardized way. It had to diversify and did. It spawned flock of\nfledgling subcultural enterprises. TRIBAL TURNOVER Even as happened,\nhowever, the movement began die. The most passionate LSD advocates yesterday\nbegan to admit that \"acid bad scene\" and various underground began warning\nfollowers against getting too involved \"tripsters.\" mock funeral was in San\nFrancisco \"bury\" the hippie subcult, and its favored Haight-Ashbury and the\nEast Village into tourist meccas as the original movement and disintegrated,\nforming new and odder, but and weaker subcults and as though to \nthe process all over again, yet subcult, the \"skinheads,\" Skinheads had\ntheir own characteristic outfits boots, short haircuts and an unsettling\npredilection for violence. The of the hippie movement the rise of the\nskinheads crucial new insight into the subcultural of tomorrow's society.\nFor we not merely multiplying subcults. We are them over more rapidly. The\nof transience is at work too. As the rate of change accelerates \nall other aspects of the society, too, grow more ephemeral. Evidence\npointing decrease in the span of subcults also lies the disappearance of\nthat violent subcult the fifties, the fighting street Throughout that decade\ncertain streets in New were regularly devastated by peculiar form of urban\nwarfare called the During rumble, scores, if not of youths would attack one\nanother flailing chains, switchblade knives, broken bottles zip-guns.\nRumbles occurred in Chicago, Philadelphia, Angeles, and even as far away as \nand Tokyo. While there was no direct between these far-flung outbreaks,\nrumbles by no means chance events. They planned and carried out with\nmilitary precision highly organized \"bopping gangs.\" New York these gangs\ncolorful names Cobras, Corsair Lords, Apaches, Kings and the They fought one\nfor dominance in their the specific geographic area they \nout for themselves. At their peak there were 200 such gangs in New alone,\nand in single year, they accounted for no fewer eleven homicides. Yet by\n1966, according to officials, the bopping gangs virtually vanished. Only one\ngang left in New York, and The York Times reported: \"No one on what garbage\nstreet ... the rumble took place. But it four or five\n\nkindest regards,\n\n\n\nMuriel\n\n\n"}