{"category": "ham", "to_address": "<ggrothendieck@gmail.com>", "from_address": "<matt.pettis@thomson.com>", "subject": "Re: [R] http proxies: setting and unsetting", "body": "Hi Gabor,\n\nThanks for the reply and link.\n\nI took a look at the link -- one thing I don't understand is why if I delete the 'http_proxy' variable via the cmd shell (or equivalent OS dialog box), why I can get R to ignore the proxy, but using Sys.setenv(\"http_proxy\"=\"\") won't do that for me (at least for the scope of the session).  If there were other variables affecting it, I would think my deleting 'http_proxy' in the OS would also have no effect -- yet it does.\n\nAny ideas?\n\nThanks again,\nMatt\n\n\n-----Original Message-----\nFrom: Gabor Grothendieck [mailto:ggrothendieck@gmail.com]\nSent: Tue 5/29/2007 9:49 PM\nTo: Pettis, Matthew (Thomson)\nCc: r-help@stat.math.ethz.ch\nSubject: Re: [R] http proxies: setting and unsetting\n \nNote that Windows XP has 4 types of environment variables and I suspect\nthat the problem stems from not taking that into account:\n\nhttp://www.microsoft.com/technet/scriptcenter/guide/sas_wsh_kmmj.mspx?mfr=true\n\nOn 5/29/07, matt.pettis@thomson.com  wrote:\n> Hi,\n>\n> I am trying to use R at work and at home on the same computer.  At work, I have a proxy, and at home, I do not.  I have, for work, a User environment variable \"http_proxy\" which I set in the OS (Windows XP Pro).  When I am at work, and I try to retrieve data from the web with 'read.csv', things work just fine.  I assume it knows how to use the proxy.\n>\n> The trouble is when I am at home and have no proxy, R still tries to use my work proxy.  I have tried the following:\n>\n> Sys.setenv(\"http_proxy\"=\"\")\n> Sys.setenv(\"no_proxy\"=TRUE)\n> Sys.setenv(\"no_proxy\"=1)\n>\n> none of which seems to work.  Whenever I try to use read.csv, it tells me that it cannot find my work proxy, which I am trying to tell R to ignore.\n>\n> I can solve this problem by removing the http_proxy environment variable binding in the OS when at home, but that is a pain, because then I have to reset it when I go back into work.\n>\n> Is there a way to tell R within a session to ignore the proxy?  If so, what am I doing wrong?\n>\n> thanks,\n> matt\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}