{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nSunday, 22 April, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nKilmarnock 1-2 Celtic\nCeltic wrap up the Premier League title thanks to a stunning linjury time free-kick from Shunsuke Nakamura.\n\n\n\n \nStrachan delight after title win\nCeltic manager Zombie Strachan is full of praise for his team after sealing a second successive SPL title.\n\n\n\n \nNewcastle 0-0 Chelsea\nChelsea fail to close the gap on leaders Man Utd after a poor performance at Newcastle.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nJacquelin victory in Asian Open\nRaphael Jacquelin of France leads from start to finish to a win the Asian Open by two strokes.\n\n\n\n \nWatney surges into two-shot lead\nAmerican Nick Watney moves into a two-shot lead after the third round of the New Orleans Classic.\n\n\n\n \nZurich Classic leaderboard\nAll the latest from the USPGA Tour event in Louisiana.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nVictorious Stoner overhauls Rossi\nCasey Stoner wins the Turkish MotoGP to claim the overall world championship lead from Valentino Rossi.\n\n\n\n \nBMW may offer Heidfeld new deal\nNick Heidfeld's impressive start to the season could go a long way to landing a new deal with BMW Sauber.\n\n\n\n \nNascar honours Virginia victims\nNascar is to honour the 32 victims of the Virginia Tech shooting tragedy at its next three races.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nBMW may offer Heidfeld new deal\nNick Heidfeld's impressive start to the season could go a long way to landing a new deal with BMW Sauber.\n\n\n\n \nSchumacher vows to answer critics\nRalf Schumacher aims to turn around his season when his Toyota car is \"competitive again\"\n\n\n\n \nHamilton 'could become best ever'\nLewis Hamilton could go on to become the greatest racing driver of all time, his McLaren boss Martin Whitmarsh says.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nLel wins London Marathon thriller\nMartin Lel out-sprints his rivals to win the London Marathon for the second time.\n\n\n\n \nChina's Zhou records landmark win\nChina's Zhou Chunxiu takes victory in the women's race in the 2007 London Marathon.\n\n\n\n \nWeir & Woods land British double\nBritain's David Weir and Shelly Woods win the wheelchair races at the London Marathon.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nTour will snub dope-probe riders\nTour de France chief says riders implicated in the Spanish doping scandal will not be welcome at this year's race.\n\n\n\n \nLandis lines up return to racing\nFloyd Landis will ride in events in the US this summer despite the ongoing doping inquiry into his 2006 Tour de France win.\n\n\n\n \nCavendish claims Belgian success\nBritish cyclist Mark Cavendish held off a world-class field to win the Scheldeprijs Vlaanderen in Belgium.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nMarathon man bucks his ideas up\nA Harlequins rugby league fan is running the London Marathon dressed as Buck, the club's mascot.\n\n\n\n \nHolloway column\nGary's fiery and he says 'You what?' The bloke says '£500,000 for a midget?'\n\n\n\n \nReview of the week\nLionel Messi's wonder goal matches Maradona, while Fletcher feels the heat\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}