{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Power Marketing Association<Power.Marketing.Association@calcium.netcontentinc.net>", "subject": "Sarbanes-Oxley for Utilities  April 19-20 Chicago", "body": "\n\n\n\nRenewable Power Project Finance\n\n\n\n\n\n\n\n\n\n\nSOX-101 for Electric, Gas & Water Utilities..An \n\t\tIntroduction to Sarbanes-Oxley\nAPRIL 19-20, 2007  - Chicago, IL\n Click\n        Here To Download A Complete Conference Brochure\n \n\n\n\n\n\n\n\n\n\n\nOverview  \n This in-depth \ncourse is designed for those in a position to be directly impacted by the \nSarbanes-Oxley Act, 2002, to include\nSAS-70 Reporting requirements, for investor owned and municipal \nutilities...electric, gas & water. It opens with a detailed review of the \ncurrent SOX compliance environment and what has guided it to this point, \nextensive workshops to learn compliance methodologies, and concludes with \ninsight into future direction of the initiative. The seminar uses several \napproaches to elicit participation from attendees including individual and group \nexercises for recognizing, creating and documenting internal controls and a case \nstudy to simulate experiential learning. All participants are encouraged to ask \nquestions and discuss issues of special interest to them. Extensive and \ncomprehensive course notes are provided to each\nattendee.\n\n\nRegister today!\n\nWho \n\t\tShould Attend:\n New members of a \nSOX environment will learn how to be productive immediately and experienced SOX \npersonnel will hone\nand focus their skills from the following business categories...\n\n• Managers and Supervisors in Finance, Accounting, Operations and IT personnel\n• Internal Audit Personnel ? IT and Finance\n• Department Managers impacted by compliance efforts\n• Service Providers to the various Utility industries (Electric, Gas & Water), \nsuch as Accountants, external IT services,\nCustomer Service outsourcing providers\n\n\nWhat Attendees Will Learn\n This intensive \none and a half day course will provide participants with a solid understanding \nof the basic components of internal controls, terms, issues, and methods of \ndocumentation necessary to be successful in the audit of compliant internal \ncontrols. Attendees will learn the following:\n\n• How to...solve short-term compliance problems by improving your current \nbusiness processes, rather than adding further overhead. (Get a return on your \ninvestment)\n• How to...work with your executive team, including your internal and external \nadvisors, to ensure continuity. (No need to replace any trusted advisors)\n• How to...improve efficiency by using a risk-based approach to controls and \naudits (Positions your company for improvement opportunities and Enterprise Risk \nManagement, not just compliance)\n• How to...create and maintain internal controls through a better understanding \nof the components (Who, what, where, when & why)\n• How to...identify and document the part IT controls play in the overall \ncontrol framework\n\n\n\n\nTopics Include:\n\nThe History And Future Of Sarbanes-Oxley For Utility Industries\nCommon SOX Practices in a Utility Enterprise\nFocus on IT Controls in a Utility Business\nFocus on Internal Controls for Utilities\nRisk Assessment Approach to Internal Controls in a Utility\nProject Planning Process Improvement - Every Utility Needs It!\nBringing it all Together in Your Utility\n\nAbout The Instructors:\n \nMr. Russell \"Buddy\" Wimberley - Partner, Visage Solutions, LLC\nMr. Wimberley has a diversified operational management background in the utility \nindustry, with hand-on experience in transforming evolving business problems \ninto cost effective technology based solutions concentrating on emerging \ntechnologies and business solutions for electric, gas and water utilities. He \nhas broad experience in regulated business unit Asset Management, T&D Planning \nand budgeting, retail access, customer choice, customer information systems, and \ncommercial/industrial wholesale power customer billing systems.\n\nAs a Partner in Visage Solutions, a Sarbanes-Oxley compliance methodology \nsolutions provider he has worked with associates in launching the products and \nservices of the business. For one of the \"Big-Four\", served as a member of an \nissue resolution team to perform Information Technology Testing of Internal \nControls for Sarbanes Oxley §404 Compliance for a multinational client company \nwith three major business units and twenty-seven data centers. Mr. Wimberley as \na member of a SAS-70 Training Team conducted extensive SAS-70 workshops for \ndistributor members of the TVPPA.\n\nMr. Richard M. Owen, PMP, MBA - Executive Consultant, Visage \nSolutions, LLC\nMr. Owen has 25 years leadership experience in compliance, ethical business \npractices and project management in multiple\nindustries. He continues to provide keynote-speaking engagements on business \nprocess improvement, management techniques, project management effectiveness and \nmotivation. Richard is an Adjunct Professor at the University of Houston, Bauer \nCollege of Business and Ph.D. Candidate in Leadership Ethics at Our Lady of the \nLake University in San Antonio, Texas.\n For one of the largest global oil companies, Mr. Owen served as a team lead to \n\t\t  perform Walkthrough Documentation, Process Mapping, Design and Testing of \n\t\t  Internal Controls of business functions for Sarbanes Oxley §404 Compliance. As a \n\t\t  member of a SAS-70 Training Team Mr. Owen has conducted extensive SAS-70 \n\t\t  workshops for distributor members of the TVPPA and currently is the Team Lead \n\t\t  for the Law, Ethics & Compliance Chapter in the Guide to the Sarbanes-Oxley Body \n\t\t  of Knowledge (SOXBoK) as commissioned by the SOX Institute.\n\n\n\n\nReserve your place today!\n\n\n\n\nClick Here To Download A Complete Conference Brochure\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}