{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Deedra Waters <dmwaters@gentoo.org>", "subject": "Re: gentoo dropping speakup support", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nI've not used something like what you're suggesting to fix my system but\ni've used a livecd god knows how many times to fix my system, boot,\nchroot, and fix, has worked well enough for me in the past and i've seen\nother gentoo users use the same to fix their machines.\nOn Sun, 17 Jun 2007, Spie Sutherland wrote:\n\n> Date: Sun, 17 Jun 2007 22:48:52 -0500\n> From: Spie Sutherland \n> Reply-To: Speakup is a screen review system for Linux.\n>     \n> To: Speakup is a screen review system for Linux. \n> Subject: Re: gentoo dropping speakup support\n>\n> I still wonder about the usb console in relation to speakup.\n> The kernel already has support to direct console to usb\n> rather than serial port, and has had this capability for a\n> long time, yet we still can't use usb serial adapters with\n> speakup because the code assumes hardware serial\n> port. My understanding is that with usb serial console\n> you may miss a bit of the initial boot messages, but I\n> wonder how it might work if speakup was in user space\n> and we could use usb serial adapters. We'd miss a few\n> of the initial boot messages but enable more widespread\n> use of speakup. One way or another this usb problem\n> needs to be sorted out. I have heard it mentioned by\n> someone, I forget who, that a hybrid solution might\n> be the answer, some kernel space and some user.\n> It could be argued that a lot of what happens with\n> speakup is application code, and if the line was drawn\n> between actual hardware drivers and application code\n> then there would be better chance of getting speakup\n> into the official kernel. And this, of course, would be\n> the best thing to happen. If it was all in the kernel with\n> no patches required then there would be none of this\n> discussion about gentoo or ubuntu not supporting it.\n> But presumably the whole thing would have to be\n> re-written. I can think of another reason to do this\n> hybrid idea, to enable getting speakup beyond x86\n> and into ARM for example. There is no ISA bus\n> there and interrupts are completely different. If it\n> was well engineered as hybrid, with a \"port\" being\n> generically abstracted in the application code, then\n> it would not matter if the actual port was ISA or\n> PCI card or USB or firewire, or some other thing\n> that hasn't been invented yet.\n>\n> I have an interim suggestion though. Couldn't one\n> make a small root filesystem that loads speakup\n> like as a rescue CD, but not a CD, on the hard\n> drive, for those situations where the regular distro\n> isn't speaking for whatever reason? If you always\n> had a small partition like this bootable with speech\n> then you could at least boot that and then fix your\n> full fledged distro if need be. Also wondering if\n> anyone has tried using chroot in this sort of way,\n> booting minimal system with speech and then\n> chrooting into the full system.\n>\n>   -- Spie\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n\n- -- \nDeedra Waters - Gentoo accessibility and amd64 -\ndmwaters@gentoo.org\nGentoo linux: http://www.gentoo.org\n\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.7 (GNU/Linux)\n\niD8DBQFGdfXhU5AGPOTGNc8RAsPSAJ4+pVbprVRiu/Ytr7LUnMOYWAfT0gCdGrKA\n6x0rR4zDIxa15G1beVGQaoQ=\n=tFf6\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}