{"category": "spam", "to_address": "langa2@speedy.uwaterloo.ca", "from_address": "\"Windows Secrets\" <Editor@WindowsSecrets.com>", "subject": "Help Fred Langa discover North America [Newsletter Comp Version]", "body": "\n\nHelp Fred Langa discover North America\n\n\n\n\n\n\nIf your software garbles this newsletter, read \nthis issue \nat WindowsSecrets.com.\n\n\n\n   \n\n\n\n\n\n\n \n\n\n\n\nYOUR NEWSLETTER PREFERENCES\nChange\nDelivery address: langa2@speedy.uwaterloo.ca\nAlternate address: langa2a@speedy.uwaterloo.ca\nLocale: United States 90210\nReader number: 82660-13329\n\n\n   \n\n\n\n\n\n   \n\n\n\n\n Home \n Newsletter \n WinFind \n Reviews \n Polls \n Contact \n \n\n\n\n\n This issue \n Past issues \n Upgrade \n Prefs \n Unsubscribe \n \n\n\n\n\n   \n\n\n\n\n\n   \n\n\nWindows Secrets Newsletter • \nIssue 104 • \n2007-04-19 • \nCirculation: over 270,000\n\n\n\n\n\n \n\n\n\n\n\nWin a visit from Fred Langa and his hog\n\n\n\nWindows Secrets editor Fred Langa (at left in helmet) is taking \nthe summer off to cruise around North America on his beloved \nmotorcycle. He's going to select at least four subscribers in the \ncontiguous United States and southern Canadian provinces to win one \nof his renowned Housecalls, as determined by our\ncontest rules. \nIf you're selected, Fred will roar \nup on his bike and spend the day optimizing your PC, testing for \nviruses, and more. Use the links below for more information or \nto enter the contest. (You must enter by Apr. 25, 2007.) \n—Brian Livingston, Editorial Director\n\n• Read more details below\n•  Skip the details, just enter me in the contest\n\n\n\n  \n\n \n\n\n\n\n\nHelp Fred Langa discover North America \n\n\n\n\n  Stop avoiding Vista — accept it!  \n\n\n  Purr-fection through yoga    \n\n\n  Antirootkit tools to protect your computer   \n\n\n   Missing Microsoft patches, part III   \n\n\n  Outlook 2007 sluggishness fix is out   \n\n\n\n  How to change your address or unsubscribe  \n\n\n   \n\n\n\n\n\n   \n\n\nFor links to every subtopic in this issue, scroll down to the \nIndex\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nWindows Vista training — watch the demo\nGet the most out of Windows Vista with over 19 hours of hands-on video training covering all editions. Learn what's new in Vista, Installation, Group Policy, Securing Vista, Networking, Administration, IE7 and much more. View our free demo now!  \nwww.TrainSignal.com\n\n\n\n\n\n\n\n\n\n \n\nBackup your data with ZipBackup\nFinally, a backup program that is easy to use.  ZipBackup's Wizard makes backups a snap for beginners. Filtering,  scheduling, and disk spanning make it a powerful tool for experts. For a limited time, Windows Secrets readers receive 25% off.\nwww.zipbackup.com\n\n\n\n\n\n\n\n\n\n \n\nGet your product seen by 270,000 readers\nDoes your company offer a product or service? Now you can place an ad in the Windows Secrets Newsletter and be seen by more than 270,000 active buyers of PC hardware and software. Bid as much or as little as you like to get the ideal ad placement.\nwww.WindowsSecrets.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\n\n\nINTRODUCTION\n\n\n\n\nHelp Fred Langa discover North America\n\n\n\n\n\n\n\n\n\n\n\nBy Brian Livingston\nOur esteemed editor, Fred Langa, is taking a much-deserved sabbatical to ride his \nmotorcycle coast-to-coast across the U.S. and back through Canada — \nand YOU can win a day with him, free.\n\nEvery subscriber, free and paid, can enter to win one of Fred Langa's \npatented Housecalls, with the master himself riding up to optimize \nyour PC, scan it for viruses, and more.\n\n\n\n\n\n\n\nAt least four Housecalls will be given away\n\n\n\nFred has agreed to select three or more subscribers who live in the \ncontiguous United States, plus at least one in the southern Canadian \nprovinces. (No, he's not biking to Honolulu, London, or Baffin Island, \nOK?) Here's all you need to know to enter Fred's contest.\nStep 1. Be a subscriber. If you're not already a subscriber to \nthe Windows Secrets Newsletter, first get a free subscription by \nusing the following link:\nGet a subscription\nStep 2. Enter to win. Any subscriber, free or paid, can use the \nfollowing link to enter the contest. Entries will be accepted Apr. 19 through 25:\n\n•  Enter to win a Housecall from Fred Langa\n\nAll we ask is that you supply a reason why \nyou'd like Fred to visit you, and provide us with your general location. Fred \nhimself will make the final selection and notify the winners by May 31. We'll \nnotify everyone about the winning entries in our June 7 newsletter. Fred's \nHousecalls will occur in July and August.\nStep 3. What fine print? Like any contest, we're required to \npublish our  contest rules, so there you go. (The main restrictions are that we can't \naward any prizes to applicants who are under 18, and we can't select those who \nlive in Québec, a province that requires registration and fees for contests of \nany type.)\n\nThat's it! I hope you'll enter today.\n\n\n\n\nRiding into the sunset across the continent\n\n\n\n\n\nFred and his wife, Michelle, are shown in the photo at left on one of \nhis favorite bikes. Fred will be riding in the breeze and sleeping in \ncampgrounds from New Hampshire to the West Coast to Montréal, \nfeeling footloose and computer-free. (Michelle will be flying \nin to join Fred on occasion, but she isn't part of the Housecalls, \nsorry.)\n\nFred has been making Housecalls ever since he offered them in his LangaList newsletter on\nMay  21, 2005. One of his visits was written up \non Oct. 6, 2005.\n\nFred's forthcoming sabbatical this summer means that he won't be writing for \nWindows Secrets again \nuntil September 2007. At that time, he promises to provide us with an irregular \nseries of columns describing what he learned during his labors on behalf of the \ncontest winners. The newsletter is supporting his travels, in part, by \npaying for his screeds, which should be highly amusing.\n\nWhen I heard that Fred would go out cruising this summer, I felt a sense of loss at \nfirst. But then I realized that anyone who wrote the LangaList newsletter \nfor nine years, and then did Windows Secrets every week after our two \nnewsletters merged in 2006, deserves to get away. I hope you'll give \nyour blessing to his new adventure.\n\n\n\nEven more great content coming your way\n\n\n\nIn honor of Fred's midlife crisis, I'm promoting him to the new title of \neditor-at-large, so he can contribute whenever and wherever he likes. \nMeanwhile, the rest of us will just work that much harder to deliver \nto you our weekly jolt of tips and tricks.\n\n\nTo keep the secrets of Windows flowing, I've promoted Scott Dunn to \nthe position of associate editor. As you may recall, he wrote the \nLangaList Plus section in the paid version of the newsletter as a \ncontributing editor last November and December before taking a leave \nof absence.\n\nScott previously worked full-time as a senior editor at Adobe Systems \nand has published a monthly column in PC World tirelessly for an \nincredible 15 years. Starting next week, he'll \nbe writing our lead stories, such as his report on how to buy Windows \nsoftware at half-price that appeared in our \n\nApr. 12 issue. In addition, he'll be running a \nreader-response column to answer your questions — all in the free \nversion of the newsletter.\n\n\nTo whip our weekly content into shape, Jody Braverman has come \non board as our new managing editor. She moved to Seattle to work with \nus after three years in Shanghai, where she was managing editor \nof EuroBiz Magazine, an English-language publication on foreign business \nin China.\n\nWith her help, our scribblings will sound even gooder.\n\nWe'll still have regular columns from our contributing editors, including \nSusan Bradley, Mark Edwards, Woody Leonhard, Chris Mosby, Ryan Russell, \nand even more on the way in the paid version of the newsletter.\n\nWe're excited about the great tricks we'll be able to bring you in the \nmonths to come. First, though, be sure to use the links above to enter Fred's \ncontest and support his travels.\n\nRide safely, my friend. And watch out for bugs.\n\nBrian Livingston is editorial director of WindowsSecrets.com and the co-author of \nWindows Vista  Secrets and 10 other books.\n\n\nContents\n Index\n\n\n\n   \n\n\n\n\n   \n\n\n\nLANGALIST TIPS\n\n\nStop avoiding Vista — accept it!\n\n\n\n\n\n\n\n\n\n\n\n\nBy Fred Langa\nThere's some highly questionable advice about Vista out on the Web. Take it \nwith a grain of salt.\n\nYou'll get a much better idea of what Vista's really like by ignoring the most \nextreme commentaries for and against the new operating system.\n\n\n\n\n\n\n\n\n\nShould we just forget about Vista?A Windows \nSecrets reader named Howard wrote in to ask about some advice he read on a \npopular PC tune-up Web site. The site recommended to its readers that they buy \nan XP computer, while that operating system is still available, and \"forget about \nVista.\"\n\nNo operating system is perfect. If perfection were the necessary standard for \nadopting an OS, we would all still be using the abacus. But wait! Abacus beads can \ngive you splinters, so maybe we should just use our fingers and \ntoes...\n\nVista has its warts, just like any other OS. But I'd personally have no qualms at all \nabout buying a new notebook or PC that comes with Vista preinstalled. In fact, \nthat's actually a pretty good way of avoiding the driver hassles that almost \nalways occur with a major new release of an OS. If the hardware comes with Vista \npreinstalled and ready to run, you already have the drivers you need. Once you \nhave Vista, then you can \navoid the pitfalls and maximize the positives by using the information in \nthis newsletter and in Brian's\n Windows Vista Secrets book to tune and tweak your copy of Vista.\n\nThe pros and cons of upgrading an older system to Vista are a little less clear. \nDriver hassles are more common than I thought they'd be, given Vista's long \ngestation. (What the heck were hardware makers doing all that time?) \nBut, if your PC meets the Vista compatibility recommendations, \nas shown on Microsoft's \n hardware compatibility page, you shouldn't have any problems.\n\nSo, saying \"forget about Vista\" is sensationalistic and simplistic. Of \ncourse, the appearance of Vista didn't suddenly make XP obsolete. XP remains \na mainstream operating system. If you're running a well-tuned, \nstable copy of XP and it meets your needs, there's no \nfour-alarm reason to drop everything and upgrade to Vista right away. But that's \nnot the same thing as saying we should forget about Vista completely.\n\nMake no mistake, sooner or later, Vista is in your future. All of Microsoft's \nproducts have a defined and published \n\"life cycle,\" \nand Microsoft will \"retire\" full support for XP Home and Professional on \nApr. 14, 2009. That's just two years from now.\n\nXP will continue to work after that date, of course. But you can think \nof Apr. 14, 2009, as the date when Microsoft's \nsupport attentions will turn away from XP. For the next five years thereafter \n(until 2014), online self-help for XP (e.g., the Knowledge Base) will remain \navailable. Microsoft may, if it chooses, continue to release critical \npatches and updates.\n\nBut one way or another, if you want to continue to work with a Windows \noperating system, you will have to make friends with Vista. Therefore, \nI think it's just plain bad advice — downright silly, \nin fact — to say \"forget about Vista.\" But it's also silly to \nsay, \"You're doomed unless you upgrade to Vista \nimmediately.\" Both extremes are wrong.\n\nUpgrade to Vista in the normal course of your hardware and software purchases. \nThen, with the good information provided by Brian and the contributors to this \nnewsletter, you'll be able to use Vista as safely, enjoyably, and productively \nas possible.\n\n\n\nHow to determine which cookies can be deleted\n\n\n\nIf you've poked around in your browser's settings, you've probably discovered \nan easy way to see what cookies are being stored on your system. For example, \nin IE 7, click Tools, Internet Options, then in the Browsing History section, \nclick Settings, View Files. In Firefox, it's Tools, Options, Privacy, Cookies, \nView Cookies. If you haven't done a cleanup in a while, you'll probably find \na pile of cookies waiting for you.\n\nCookies are just ASCII text files created via your browser by Web sites you \nvisit. Some cookies are very useful, storing login information for the Web sites \nyou frequent, the date of your last visit (so the site can flag newer \ninformation for you), your favorite search terms, and so on. These cookies are worth \nsaving. Other cookies really only benefit Web advertisers, and can be deleted \nwith no negative consequences to you. But how do you tell which cookies are which?\n\nBecause cookies are plain text files, they can be opened and read with Notepad. \nEven so, the data stored inside a cookie may not be very easy to figure out.\n\nThat's where a tool like Karen Kenworthy's free\nCookie \nViewer can help. Cookie Viewer works with Internet Explorer and \nFirefox cookies, and presents all of a cookie's data in a comprehensive but \neasy-to-understand way. You can see when the cookie was created, by whom, when \nit expires, and more. The program also lets you delete any cookies you don't want.\n\nFigure 1. Cookie Viewer lets you see all the data a cookie contains, so \nyou can delete the ones you don't want.\n\nFirefox users can also use any of several cookie-viewing add-ons, such as the \nfree  View Cookies download.\n\nOnce you know what cookies you want to keep, managing them becomes much simpler. \nFor example, you can mark the cookies you want to keep as read-only, \nmass-delete the rest, and then clear the preserved cookies' read-only attribute.\n\nAnother alternative is to copy the cookies you want to preserve to a safe \nplace, mass-delete the rest, and then copy the cookies back. If you have \nany skill with batch files or other \nscripting tools, you can easily automate this process.\n\nThere's also a huge number of cookie managers available for sale on the Web, but \nI've never found them particularly useful. As you can see from the above, managing \ncookies manually isn't particularly difficult. The first time you do it can \nbe somewhat time-consuming, but subsequent cleanups can be easy and \nlightning-fast.\n\n\n\nMore on accessing Device Manager\n\n\n\nThe many ways you can accomplish tasks in Windows is one of the operating \nsystem's greatest strengths and, at the same time, one of its biggest \ndrawbacks. Some see it as a weakness, because it can make \nWindows harder to learn and use. It's true that it makes our jobs at Windows \nSecrets more difficult, because it means that there are several ways of \nexplaining how to access or manipulate different features.\n\nFor example, a few readers had trouble with the how-to instructions I \ngave on Apr. 5 \nfor accessing Device Manager via Control Panel, Performance \n& Maintenance, System, Hardware, Device Manager.\n\nThe above process works for Control Panel's default Category View. But, \nif you're using the Classic View, the category headings, such as \nPerformance and Maintenance, are not shown. Instead, you simply see \na list of individual Control Panel applets. In Control Panel's Classic View, \nthe clickstream to access Device Manager would be Control Panel, System, \nHardware, Device Manager.\n\nBut that just scratches the surface of the many ways to open Device \nManager. You can also get to Device Manager by right-clicking on My \nComputer and selecting Properties from the context menu. From there, \nyou click Hardware and then Device Manager.\n\nOr, you can click Start, Run and then enter devmgmt.msc \nin the Run box. (In Vista, simply enter devmgmt.msc in the \nSearch box.\n\nOr, you can click Start, Run and then enter mmc \nto open the Microsoft Management Console. Once inside the Console, you \ncan navigate to the Console plug-ins, usually located in \n/Windows/System32. You can recognize them by the .msc \nfile extension.\n\nFor that matter, you can browse directly to the \n/Windows/System32 folder in Explorer and click on any \n.msc file to open that plug-in.\n\nOr, use Windows' Search function to find all *.msc files, then \nclick on the one you want from the search results list.\n\nThere are probably other ways to get there, too. You can see why we can't \npossibly list every way of accomplishing a task in every article — there \nisn't enough space or time!\n\nThe flexibility that Windows provides means that you can do things in the manner \nthat feels most natural to you, whether this be typed commands or \npoint-and-click navigation. This is one of the things I like most about Windows.\n\nSo, if a how-to instruction doesn't fit your situation exactly, don't \nworry. It's actually an artifact of one of Windows' most positive attributes: \nits incredible flexibility. If you don't find the exact answer you're looking \nfor here, a little spelunking in the Windows Help system or online will almost \nsurely find you a solution.\n\n\n\nHasta la vista, amigos!\n\n\n\nAs Brian explained in his introduction to this newsletter, after 30 years of tech \nwriting (and 25 years specifically and continuously in computers), it's time for me to take a \nbreak. With the approach of good weather, I'll soon be heading out on an \nextended trip around North America by motorcycle. \n\nMy wife will join me for some \nof the trip, but the rest will be solo and will include some backcountry travel \nand camping. It should be restorative, and quite an adventure. With no firm \nschedule for the trip, this will be my first time in three decades without \npublication deadlines setting the pace. I'm looking forward to seeing what that \nfeels like!\n\nAs Brian also explained, I hope to meet some of you in my travels. (Please see \nthe introduction and follow the directions to send in your name.) I'll be back in the newsletter at the end of the summer, \nand look forward to sharing my experiences with all of you. \n\nHope to see you along the way! \n\n\n\t\t\t\tReader, please rate the above article:\n1: Poor \n\t\t\t\t2: Fair \n\t\t\t\t3: Good \n\t\t\t\t4: Great  5: Superb\n\n\n\nFred Langa \nis editor-at-large of the Windows Secrets Newsletter. He \nedited the LangaList e-mail newsletter from 1997 to 2006, when it merged with \nWindows Secrets. Prior to that, he was editor of Byte Magazine and editorial \ndirector of CMP Media, overseeing Windows Magazine and others.\n\n\nContents \n Index\n\n\n\n   \n\n\n\n\n  \n\n\n\nEDITOR'S BOOKSHELF\n\n\n\n\n\n\n\nGet the tips you need about Windows Vista\n\n\n\nThe all-new Windows Vista Secrets helps novices \nand experts alike understand Microsoft's latest operating system. \n\"To really appreciate what is in Vista, you almost \nneed to read through the leading book on the product, Windows Vista \nSecrets, by Brian Livingston and Paul Thurrott,\" writes Rob Enderle, \nprincipal analyst of the Enderle Group, in TechNewsWorld. \"It's 595 \npages of things you can do with this product — most of which \nyou probably wouldn't have discovered for some time, let alone right \nat first.\" Check the book out now for tips you can use.\nMore information:\nUnited States / \nCanada / \nElsewhere\n\n \n\n\n\nSpam-Proof Your E-Mail Address, 2nd Ed.\n\n\n\nThis 32-page e-book by Brian Livingston gives you step-by-step instructions that \ncan prevent 97% of the spam that would otherwise clog an e-mail\naccount. You could call it \"Livingston's Spam Secrets.\" The PDF e-book\nis the result of months of experiments and tests we conducted. We now\nreceive little or no spam to the addresses we used as guinea pigs. These tests\nshow that you can make your e-mail addresses invisible to spammers,\nnot just battle an ever-growing flood. The methods we describe\nwork with Windows, Apple, and Linux and don't require any filters or block\nlists — but you can use those in addition to the book's techniques,\nif you wish. \n\nMore info\n\n  \n\n\n\n\n\n  \n\n\n\nContents  \nIndex\n\n  \n\n\n\n\n   \n\n\n\nTELL A FRIEND\n\nHow you can share this information\nWe love it when you send your friends links to our articles. But please don't \nforward your copy of our e-mail newsletter to people, which subjects us to spam \ncomplaints. Instead, simply suggest that your friends visit this issue's permanent \nWeb address, shown below. A complete index at the bottom of the \nWeb page provides you with hyperlinks to any article you'd like to recommend.\n\nThe address of this issue is http://WindowsSecrets.com/comp/070419\n\n   \n\n\n\n\n   \n\n\n\nWACKY WEB WEEK\n\n\nPurr-fection through yoga \n\n\n\n\n\n\n \n\n\nAs if you need any more convincing that some \npeople have way too much time on their hands, check out Yoga Kitty, a \ntongue-in-cheek Web site purportedly aimed at helping you and your pet cat enjoy \nthe benefits of yoga, together. \n\nThe centerpiece of the project is a handful of \ndownloadable videos (in English and French) demonstrating a human-kitty \n\nteam clearing past karmas, exploring meditation, and dispelling static cling. \nT-shirts and video tapes available.\n\nMore info\n\n\n\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n\n   \n\n\n\nINDEX\n\nThe following topics appear in the free version\n\n\n\n\nINTRODUCTION  \nHelp Fred Langa discover North America \n\n \nAt least four Housecalls will be given away \n\n \nRiding into the sunset across the continent \n\n \nEven more great content coming your way\n\n \n \n\n\nLANGALIST TIPS  \nStop avoiding Vista — accept it!\n\n \nShould we just forget about Vista?\n\n \nHow to determine which cookies can be deleted \n\n \nMore on accessing Device Manager \n\n \nHasta la vista, amigos! \n\n \n \n\n\nWACKY WEB WEEK  \nPurr-fection through yoga  \n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou get all of the following in the paid version\n\n\nLANGALIST PLUS  \nAntirootkit tools to protect your computer \n\n \nSystem Repair Engineer antirootkit tool \n\n \nGrisoft's new AVG Anti-Rootkit Free tool \n\n \nCallingID software helps protect against bad guys \n\n \nThunderbird is an excellent, easy-to-use mail client \n\n \nHow to secure your e-mail connection \n\n \nSpamihilator is a free spam-elimination tool \n\n \nDon't let static electricity destroy your computer! \n\n \nMore about WildBlue satellite Internet \n\n \n \n\n\nOVER THE HORIZON  \n Missing Microsoft patches, part III \n\n \nWindows DNS Server flaw threatens networks \n\n \nHow to mitigate the DNS vulnerability \n\n \n \n\n\nPATCH WATCH  \nOutlook 2007 sluggishness fix is out \n\n \n Outlook 2007 gets a performance boost \n\n \nContinued issues with the ANI patch \n\n \nThe infamous SVChost.exe issue \n\n \nHow to avoid patching for the DNS flaw\n\n \nGet MS Accounting Professional 2007 SP1 now \n\n \nContent Management Server patch has issues \n\n \nOracle's own Patch Tuesday \n\n \nOpera gets an update to 9.20 \n\n \n \n\n\n\nPaid subscribers can access all old and new paid newsletter content\nMake a contribution to support our research into Windows and you'll immediately\nbe able to read and search through scores of valuable articles. In addition,\npaid subscribers are entitled to download valuable content that we license for\nyou at least once every calendar quarter.\nTo upgrade, simply make a contribution of any amount you choose.\nIf you do this by Apr. 25, 2007, \nyou'll instantly be sent the full, paid version of today's newsletter.\n\nTo upgrade to the paid version of the Windows Secrets Newsletter, please visit our \n upgrade page.\n\nThanks in advance.\n\n\n   \n\n\n\n\n\n   \n\n\n\nContents\n Index\n\n\n   \n\n\n\n\n\n   \n\n\n\nYOUR SUBSCRIPTION\n\nThe Windows Secrets Newsletter is published weekly on \nthe 1st through 4th Thursdays of each month, plus occasional news updates. \nVacation breaks occur in late August, Thanksgiving Week, and Christmas/New Year's.\nPublisher: WindowsSecrets.com LLC, 300 Queen Anne Ave. N. #456, Seattle, WA 98109\nUSA. Vendors, please send no unsolicited packages to this address (readers' letters\nare fine).\nEditorial Director: Brian Livingston. Editor-at-Large: Fred Langa. Associate \nEditor: Scott Dunn. Contributing Editors: Susan Bradley, Mark Edwards, Woody \nLeonhard, Chris Mosby, Ryan Russell. Research Director: Vickie Stevens. \nProgram Director: Brent Scheffler. Managing Editor: Jody Braverman.\nTrademarks: Microsoft and Windows are registered trademarks of Microsoft \nCorporation. The Windows Secrets series of books is published by\nWiley Publishing Inc. The Windows Secrets Newsletter,  \nWindowsSecrets.com, LangaList, LangaList Plus, WinFind, Security Baseline, Patch Watch, \nPerimeter Scan, Wacky Web Week, the Logo Design (W, S or road, and Star), and the \nslogan Everything Microsoft Forgot to Mention all are trademarks and service \nmarks of WindowsSecrets.com LLC. All other marks are the trademarks or service \nmarks of their respective owners.\n\n\nYOUR SUBSCRIPTION PREFERENCES\n(change \nyour preferences):\nDelivery address: langa2@speedy.uwaterloo.ca\nAlternate address: langa2a@speedy.uwaterloo.ca\nCountry: United States\nZIP or postal code: 90210\nReader number: 82660-13329\nBounce count: 0\n\nYour bounce count is the number of times your server has bounced a newsletter back to us\nsince the last time you visited your preferences page. We cannot send newsletters to you\nafter your bounce count reaches 3, due to ISP policies. If your bounce count is higher\nthan 0 or blank, please visit your\npreferences page.\nThis automatically resets your bounce count to 0.\nTo change your preferences: Please visit your \npreferences  page.\nTo access all past issues: Please visit our\npast issues page.\nTo upgrade your free subscription to paid: Please visit our \nupgrade  page.\nTo resend a missed newsletter to yourself: If your mail server filtered \nout a\nnewsletter, you can resend the current issue to yourself. To do so, visit your\npreferences page\nand use the Resend link.\nTo get subscription help by e-mail (fastest method): Visit our \ncontact page.\nSubscription help by facsimile:\n206-282-6312 (fax). Emergency subscription help by phone: 206-282-2536 (24\nhours).\n\nHOW TO SUBSCRIBE: Anyone may subscribe to this newsletter by visiting our \nfree signup page.\nWE GUARANTEE YOUR PRIVACY:\n\n1. We will never sell, rent, or give away your address to any outside party, ever.\n2. We will never send you any unrequested e-mail, besides newsletter updates.\n3. All unsubscribe requests are honored immediately, period.  \nPrivacy policy\nHOW TO UNSUBSCRIBE: To unsubscribe\nlanga2@speedy.uwaterloo.ca\nfrom the Windows Secrets Newsletter,\nUse\nthis 2-click\nUnsubscribe\nlink; or\nSend\na blank e-mail to\nunsub@WindowsSecrets.net\nwith leave langa2@speedy.uwaterloo.ca\nas the Subject line; or\nVisit our \nUnsubscribe page.\n\n\nCopyright © 2007 by WindowsSecrets.com LLC. All rights reserved.\n\n\nContents\n Index\n\n\n\n\n\n\n   \n\n\n\n\n\n"}