{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "From junk food to the latest gadgets...the hard sell to your kids is on.  That story only on the CBS Evening News with Katie Couric", "body": "\nCBSNews.com\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nQUOTE OF THE DAY\"All paid jobs absorb and \n      degrade the mind.\" - Aristotle \n\n\n\nDID YOU KNOW?Basketball was invented \n      in 1891 by James Naismith. He set out to invent a game to occupy students \n      between the football and baseball seasons. \n\n\n\nTONIGHT ON THE CBS EVENING NEWSHere's an early \n      look at what we are working on for tonight's broadcast of the CBS Evening \n      News from Anchor and Managing Editor, Katie Couric... Hi \n      everyone, The merger of Daimler and Chrysler was one of the most \n      expensive – and least fruitful – in American automaking history. Now \n      DaimlerChrysler is dropping its struggling Chrysler Group, which is \n      getting picked up for $7.4 billion by a private equity firm. Anthony \n      Mason will have the story of Chrysler’s sale and Nancy Cordes \n      will look at what’s pinching American automakers, from union costs to \n      pensions and sales numbers. Turning to Iraq, we’ll have two \n      stories. First: the anatomy of an ambush. Mark Strassmann will \n      report on the abduction of three American soldiers in Saturday’s early \n      morning hours south of Baghdad. He’ll break down what happened and the \n      effort to get the missing soldiers back. And it has been reported \n      that between 100,000 and 300,000 barrels of Iraq’s oil has been \n      unaccounted for – that’s every day for the past four years. Our Sharyl \n      Attkisson asks why – was it corruption, smuggling or simply poor \n      accounting? Cycling great Floyd Landis opened his doping hearing \n      denying the charge. He also criticized the testing procedure used by the \n      Tour de France, Bill Whitaker will report. As for health \n      news, I’ll talk with our Dr. Jon LaPook about the surprising study \n      that shows the number of women older than 40 getting mammograms is on the \n      decline. It is the first time the rate has fallen, according to the \n      National Cancer Institute. And I’ll wrap-up our broadcast with the \n      first piece in a series we’ve been working on called “Gotta Have It: \n      The Hard Sell To Kids.” I’ll take a look at the multitude of ways \n      cartoon characters and other faces our kids and grandkids love are used to \n      market everything from junk food to exercise. Experts say there’s more at \n      stake here than just money. I hope you’ll join us. Katie\nFor more on two of the stories noted above, please click on the \n      following links... Chrysler Sold For $7.4 Billion\nClick \n      Here Terror Group Warns U.S. Over Missing GIs Click \n      Here Here's an early look at one of the stories we are \n      working on for Tuesday's broadcast of the CBS Evening News It's called \n      ADVER-GAMING -- using on-line games to sell products to your kids. Part of \n      our series, GOTTA HAVE IT: THE HARD SELL TO KIDS. That story and much \n      more, Tuesday night on the CBS Evening News. If you would like \n      more information on any of these stories or the broadcast, please click on \n      the following address and e-mail us: evening@cbsnews.com \n\n\nTONIGHT ON DAVID \n      LETTERMANDave sits down with actor \n      Mike Myers AND actress America Ferrara! \n\n\n\n \nTUESDAY MORNING \n      ON THE EARLY SHOW\nHarry Smith, Julie Chen, and \n      Russ Mitchell anchor THE EARLY SHOW from New York. Hannah Storm anchors from Las Vegas, NV. \n      Dave Price will bring us the weather. Along with the top \n      news of the day, we will also have the following stories:\nEATING DISORDERS AND MODELS: Ever since eating disorders \n      contributed to the deaths of two super skinny South American models last \n      year, the fashion industry has examined standards that force models to fit \n      into clothes most women can't wear. For now, thin is still in but \n      EARLY SHOW National Correspondent \n      Tracy Smith has the story of a designer who's out to change that. \n      BEST YOU CAN BE: BAGS OF SUMMER: With the rise of spring, \n      summer cannot be far and fashion’s hottest accessory very well may be the \n      handbag. But what are the best picks for every occasion? Whether you are \n      looking for a carry-all to tote all of your belongings, or a slim clutch \n      for a night out on the town, choosing a bag that suits you does not have \n      to be a difficult affair. Kim France, Editor of Lucky magazine, \n      will join us Tuesday morning with her top picks for summer. \n      HIGH SOCIETY: SUBSTANCE ABUSE: Joseph A. Califano, Jr. \n      served as Lyndon B. Johnson's domestic affairs chief and Jimmy Carter's \n      secretary of Health, Education, and Welfare, where he started the nation's \n      first national anti-smoking campaign. In 1992, Califano founded The \n      National Center on Addiction and Substance Abuse. Now, he has written, \n      High Society, a detailed look at how substance abuse ravages \n      America and what we can do about it. Substance abuse has touched every \n      family in some way and Tuesday morning Califano will join us with more. \n      VINCE GILL: Country star Vince Gill’s latest album, \n      These Days, is a four-CD set of 43 new and original songs, blending \n      traditional country and bluegrass, jazz and rock 'n roll. Vince recently \n      turned fifty, and is showing no signs of slowing down. Tuesday night he \n      will be performing at the Academy of Country Music Awards where he is \n      nominated for three awards including Album of the Year. Tuesday morning, \n      Vince will join our own Hannah Storm live from Las Vegas. \n      HOME THEATER: CAGNEY AND LACEY: 25TH ANNIVERSARY: It has \n      been twenty-five years since Cagney and Lacey first captured our \n      attention solving crime. Now, a special DVD has been released showcasing \n      Season One of stars Sharon Gless and Tyne Daly’s adventures. Tuesday \n      morning, we’ll take a look at the special features the DVD offers and \n      Sharon Gless and Tyne Daly will stop by our plaza for a trip down memory \n      lane. TONY NOMINATIONS: The nominations for the 61st Annual \n      Tony Awards will be announced live from the New York Public Library for \n      the Performing Arts. Actors Jane Krakowski and Taye Diggs will announce \n      this year’s nominations. The 61st Annual Tony Awards will take place at \n      Radio City Music Hall on June 10th. JOSH TURNER PERFORMS: \n      Josh Turner has become one of country music's brightest young stars since \n      Long Black Train, his critically acclaimed, platinum-selling debut \n      album hit shelves in 2003. For his sophomore effort entitled Your \n      Man, which debuted at number one on the country music charts, Josh dug \n      deeper into his South Carolina roots to display a more mature side. He's \n      also nominated for three Academy of Country Music Awards Tuesday night, \n      including a nod for Song of the Year for Would You Go With Me. He \n      will join us Tuesday morning to perform his hit song Me and God. \n      If you would like more information on any of these stories or the \n      broadcast, please click on the following address and e-mail us: \n      earlyshow@cbs.com \n\n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}