{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 92", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Artefact thieves ravage Nok culture\n      (Museum Security Network Mailing list)\n   2. Santana Row gallery mystified by art theft\n      (Museum Security Network Mailing list)\n   3. Ceramic plate worth $3,\t700 stolen from Ohio artist during\n      sale (Museum Security Network Mailing list)\n   4. Churches are easy prey for art thieves\n      (Museum Security Network Mailing list)\n   5. From here to eternity: Egyptian artefacts\n      (Museum Security Network Mailing list)\n   6. Egyptian art with prices fit for a Pharaoh\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Mon, 16 Apr 2007 09:03:10 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Artefact thieves ravage Nok culture\nTo: Museum Security Network Mailinglist \nMessage-ID: <46231FAE.1020809@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n*Artefact thieves ravage Nok culture*\nSunday, Apr 15, 2007\n\nThe highly revered historical sites of the Nok culture have been reduced \nto a shadow of the past as looters have invaded the fields.\n\nTwo German archeologists from the Frankfurt University, Prof. Peter \nBreunig and Dr. Nicole Rupp, who had been working on the Nok sites in \nthe last two months made the disclosure.\n\nThe archeologists, who had an interactive session with newsmen in Abuja \nlast week on their experience in the field, said the sites were in a \n?deplorable state?.\n\nBreunig said that the sites required urgent attention as a considerable \namount of damage had been done to the trenches that once housed the Nok \nartefacts.\n\n?Our mission is not business and we are concerned about the serious \ndamage done because it was done for commercial reasons,? he said.\n\nBreunig said the Nok terracotta and its cultural links was still among \nthe greatest discoveries of archeology and would continue to command \nglobal attention.\n\n?We are not after terra cotas but we are here to reconstruct some of the \ndistortions of the Nok history,? he said.\n\nBreunig said the museum at the Nok village does not meet acceptable \nstandards ??as it is only a table with bits of artifacts?.\n\nRupp had said that the situation at the sites was complicated as some of \nthe custodians said they sold artifacts to feed their families.\n\n?The Nok sites have been turned into a battle field because you find \nwhole paths like two football fields completely excavated,? he added.\n\n?It is a very complicated matter that cannot be solved by an \narcheologist,? she said.\n\nSpeaking at the same session, the Director General of the National \nCommission for Museums and Monuments, Dr Joseph Eboreime, said the \ngovernment had adopted a community-based approach to preserve artifacts.\n\nHe said the bottom - up approach involved working hand in hand with \ncommunities on how to preserve their values and the importance of \nkeeping their historical identities.\n\nEboreime said that the approach was three-pronged as it would also \ninvolve developing the customary laws and mores of the people and \nensuring administrative contacts.\n\nHe said there was already a silent effort at retrieving some of the \nstolen artifacts in \\some museums from abroad and it would have security \nimplications.\n\nOur correspondent reports that the Nok culture, situated in Kwoi Local \nGovernment Area in Kaduna, is among the 100th discoveries of archaeology.\n\nhttp://www.thetidenews.com/\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Mon, 16 Apr 2007 09:03:18 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Santana Row gallery mystified by art theft\nTo: Museum Security Network Mailinglist \nMessage-ID: <46231FB6.9090102@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n    Santana Row gallery mystified by art theft\nPAINTING DISAPPEARS WHILE STAFF AT SANTANA ROW SHOP DISTRACTED\nBy Jessie Mangaliman\nMercury News\nSan Jose Mercury News\nArticle Launched:04/15/2007 01:39:25 AM PDT\n\nWhether it was the oil painting's contrast of sunlight and moonlight or \nthe $35,000 price tag that caught the thief's eye, Frank Licsko's \ntreasured art is gone.\n\n\"To me it's a big loss. I thought, `Should I be flattered? Should I be \nupset?' Someone is going around stealing expensive paintings!\" said the \nSan Jose artist.\n\nOne month after it vanished in broad daylight from a Santana Row art \ngallery, the painting is still missing.\n\n\"It's an unusual image,\" said Licsko, author of the work, titled \"Tree \nof Life.\" It's an oil painting of an earth-like disc, in yin-yang style \n- one side in sunlight, the other in moonlight.\n\nThe painting, measuring 3 feet by 3 feet, had been in consignment at the \nBlu Art Gallery at Santana Row since November, one of hundreds of \npaintings displayed in the 6,000-square-foot gallery.\n\nOn March 15, between 11 a.m. and 1 p.m., the painting disappeared while \ntwo employees and the manager were attending to other things.\n\n\"Whoever did this had to distract all of us at once,\" said gallery owner \nJohn Nassar. \"This is professional.\"\n\nIn the frame, the painting measured five-foot square, and would have \nbeen difficult to carry out of the gallery, Nassar said.\n\n\"I've been in this business for 15 years,\" he said, \"and I've never seen \nthis happen. This is a very sophisticated type of theft.\"\n\nNassar said when he opened the store at 11 a.m., the painting was still \nin the gallery. But when another employee arrived to begin a new shift \nat 1 p.m., the first thing he noticed was the blank spot on a wall where \nthe painting was hung, 20 feet from the gallery entrance.\n\nNassar said he has since learned from Santana Row security that \nsurveillance cameras were not scanning in the vicinity at the time. \nNassar reported the theft to Santana Row security, who reported it to \nSan Jose police.\n\nSgt. Nick Muyo confirmed the theft, but was unable to provide details on \nFriday. And a spokesman for Santana Row said he was checking on the \nstatus of the case.\n\nAs for the 61-year-old Licsko, he was stunned when he heard about the theft.\n\n\"My jaw dropped,\" he said.\n\n------------------------------------------------------------------------\n/Contact Jessie Mangaliman at jmangaliman@mercurynews .com or (408) \n920-5794.\n\nhttp://origin.mercurynews.com\n\n/\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Mon, 16 Apr 2007 09:03:14 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Ceramic plate worth $3,\t700 stolen from Ohio artist\n\tduring sale\nTo: Museum Security Network Mailinglist \nMessage-ID: <46231FB2.3070909@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nCeramic plate worth $3,700 stolen from Ohio artist during sale\n**\n*Associated Press*\n\n*CLEVELAND HEIGHTS, Ohio - *A hand-crafted ceramic plate valued at \n$3,700 was stolen from property owned by acclaimed artist and industrial \ndesigner Viktor Schreckengost, his stepson said.\n\nThe second-edition plate, produced last year and based on \nSchreckengost's 1931 \"Jazz Bowl\" series of plates and bowls that became \nicons of the Art Deco era, was stolen from an unlocked china cabinet \nduring an estate sale Saturday, stepson Chip Nowacek said.\n\nAbout 400 people attended the sale at a 32-room mansion that \nSchreckengost's second wife, Gene, lived in before they were married in \n1991, Nowacek said. The mansion is just a few doors down from where the \ncouple currently lives in this Cleveland suburb.\n\nPolice have not announced an arrest.\n\n\"Whoever it was knew what they were doing,\" Nowacek, 41, said. \"To pull \nsomething like that off with all these people around, it was just \nincredible.\"\n\nPolice searched vehicles and questioned people who attended sale but \ndidn't find the plate, Nowacek said. The family will be contacting art \ndealers in New York, Los Angeles and Miami to make them aware of the \ntheft and will monitor the Internet to see if it shows up on the auction \nWeb site eBay, he said.\n\nThe plate is signed by Schreckengost and contains many studio markings \nthat make it easy to identify, Nowacek said.\n\nSchreckengost, 100, is a prolific designer whose works range from toys, \nceramics and paintings to dinnerware and trucks.\n\nHis artistic creations include paintings, sketches, sculptures and famed \nNew Yorker ceramics that caught the eye of Eleanor Roosevelt. His \nindustrial designs include millions of bicycles sold by Sears, iconic \nchildren's pedal wagons, lawn chairs, sit-down lawn mowers, American \nLimoges dinnerware - all with eye-catching flair.\n\n*ON THE NET*\n\nSchreckengost: http://www.viktorschreckengost.org\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Mon, 16 Apr 2007 09:03:24 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Churches are easy prey for art thieves\nTo: Museum Security Network Mailinglist \nMessage-ID: <46231FBC.4010607@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nChurches are easy prey for art thieves\nBY DANE STICKNEY AND ASHLEY HASSEBROEK\nWORLD-HERALD STAFF WRITERS\n\nChances are, thieves aren't taking paintings from Omaha churches to \nenhance their spiritual lives.\n\nMore likely it's to enhance their bank accounts, investigators say.\n\nBut though the motivation seems clear, much about the yearlong rash of \nthefts of church paintings puzzles art scholars and investigators \nlocally and nationwide.\n\nSince last May, thieves have taken works from St. Cecilia Cathedral and \nFirst Covenant, All Saints Episcopal, Immaculate Conception Catholic, \nSt. Thomas More Catholic and St. Joseph Catholic Churches.\n\nThe thefts don't tie into any particular national or global trend. Most \nof the works don't have a large resale market.\n\nSo they're tough to figure out.\n\nJohn Wilson, head curator of Omaha's Joslyn Art Museum, said art thefts \nfrom churches are widespread in South America, Italy and other places \nabroad.\n\n\"But why is it happening in the middle of America, in Omaha? I don't \nhave a clue,\" he said.\n\nIt's not happening in other Midlands museums or churches.\n\nAnna McAlpine, a spokeswoman for the American Association of Museums, \nsaid galleries across the country have not been seeing thefts of \nreligious art.\n\nRepresentatives of the Catholic Archdioceses of St. Louis and St. \nPaul-Minneapolis and the Diocese of Kansas City-St. Joseph, Mo., say \nthey haven't heard of thefts of art from their churches.\n\nOmaha may be a surprising spot, but churches aren't. They are often \nnotorious for having lax security.\n\n\"Churches don't see these artworks as investments,\" Wilson said. \"They \nhang the paintings for spiritual purposes, and sometimes they may be a \nlittle too trusting.\"\n\nThe criminals aren't drawn to the works because of spirituality, said \nBob Spiel, a Chicago-based private investigator, security consultant and \nformer art theft and forgery investigator for the New York City branch \nof the FBI. He has worked dozens of cases similar to those in Omaha. The \nmotivation is always the same.\n\n\"It's always about money,\" Spiel said. \"Someone is looking to turn the \npainting around for some quick cash.\"\n\nIt doesn't have to be lots of money. The value of the artworks snatched \nfrom Omaha churches ranges from about $500 to the $100,000 painting of \nthe Virgin Mary at St. Cecilia Cathedral, said Brother William Woeger, \nexecutive director of the Cathedral Arts Project.\n\nMost works will reap at least some cash.\n\nThe black market is the most common outlet. The thief could sell the \npainting for a small fraction of its value to a collector or dealer. \nOften, a single painting is swapped a number of times with gradually \nincreasing prices until it reaches an auction house, a dealer or a \nprivate buyer.\n\nThe more quickly the artwork gets outside the United States - especially \nto Latin America or some European countries - the lower the chances it \nwill be recovered.\n\nIt still happens, though, said Beth Kocher, a New York-based art \nhistorian with the Art Loss Register, an international organization that \nrecovers artwork.\n\nThe organization, which is working on the Omaha cases, recovers more \nthan 150 stolen works each year, mostly at auction houses. About 40 \npercent of the recoveries are made outside the country where the piece \nwas stolen.\n\nMany buyers, dealers and auction houses check the works with the FBI's \nNational Stolen Art File, Interpol or the Art Loss Register before they \nbuy, Kocher said.\n\nBecause of that, the risk of selling artwork on the black market is \nincreasingly outweighing the reward to thieves.\n\nEven if they don't get caught, they hardly ever get anything close to \nthe value of the works.\n\n\"We have had cases where a work is worth $1 million and is sold on the \nblack market for $800,\" Kocher said.\n\nThough black market profits may not be huge, the sales are easy to cover \nup, said John Geppert, a finance professor at the University of \nNebraska-Lincoln.\n\nBusinesses that deal with a lot of cash have been known to buy stolen \nartwork at deep discounts, then sell them for closer to the full price.\n\n\"Because they deal almost exclusively in cash, it's very easy to hide \nthat transaction in an audit or an investigation,\" Geppert said.\n\nArtwork doesn't even have to be sold to make the thief some cash. \nIncreasingly, art is being used for collateral in drug operations, Spiel \nsaid.\n\nA thief without cash could give a drug lord a painting for collateral. \nOnce the thief sells the drugs, he keeps a profit, pays the drug lord \nand gets his painting back.\n\n\"That's certainly a possibility,\" said Raneta Mack, a criminal law \nprofessor at Creighton University. \"Anything that has value can be used \nas collateral in drug deals. A painting works just fine.\"\n\nWhile the motivation is clear-cut, profiling an art thief is much \nharder, Spiel said.\n\nThe Omaha Police Department is treating the first five burglaries as \nrelated, but are investigating the most recent - the theft of a piece, \nsaid to be worth $50,000, from First Covenant Church sometime between \nOctober and this month - as an unrelated incident.\n\nSpiel would be surprised if the same person - or group of people - \ncommitted all the church break-ins.\n\n\"You've probably got a copycat phenomenon going on,\" he said. \"Each time \na burglary gets some publicity, the churches look like easier targets.\"\n\nhttp://www.omaha.com/i\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Mon, 16 Apr 2007 10:50:55 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] From here to eternity: Egyptian artefacts\nTo: Museum Security Network Mailinglist \nMessage-ID: <462338EF.9000309@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n From here to eternity: Egyptian artefacts\nVirginia Blackburn on Ancient Egyptian artefacts for the afterlife\nApril 14, 2007\n\n\nCollecting can throw up strange anomalies, one of them being that the \nAncient Egyptian rituals of death have, ironically, given long life to \nthat culture?s artefacts.\n\nThe Egyptians placed vast numbers of artefacts in their tombs ? from \neveryday objects, which they believed would be needed in the afterlife, \nto pieces that were created especially for the tombs ? with the result \nthat a great deal has been preserved to the present day.\n\nAnd many are affordable. Charles Ede, the London-based gallery, has \npublished a new catalogue and it is still possible to buy, for example, \nan amulet of the god Khnum for ?650. Even so, that is a great deal more \nthan it would have cost a few decades ago.\n\n?Egyptian antiquities really became popular among collectors in 1972, \nwhen the British Museum staged the Tutankhamun exhibition,? says James \nEde, the gallery?s owner. ?Since then, prices for the good Egyptian \nantiquities have appreciated by 20 to 50 times.?\n\nHowever, he is quick to emphasise that no one should buy these pieces as \nan investment, rather as an object to be greatly loved.\n\nThe pieces in the new catalogue are exquisite. Egyptian antiquities are \nclassed from the predynastic era of 3500BC until about 500BC. ?The \nafterlife was of paramount importance,? Mr Ede explains. ?They would \nplace /ushabti/ ? meaning ?answerer? ? figures in their tombs to serve \nthem in the afterlife /./ Initially they would have only two, but in \ntime this grew until they would have had at least one for each day of \nthe year and then they even introduced figures of overseer /ushabti/.?\n\nMr Ede has several /ushabti/ in the new catalogue. No 7 is a rare and \nbeautiful piece, hand-carved out of limestone. It is in excellent \ncondition and its colour has not deteriorated. The piece dates from \nabout 1200BC and on it a carved inscription in hieroglyphics gives the \nname of its owner: ?The chief scribe and master of the house, Hormin?. \nThe price is a hefty ?55,000.\n\nNo 16 in the catalogue is a fa?ence /ushabti/, with a quartz-paste glaze \nof bright cobalt-blue ? a colour associated with the afterlife. Its \nowner was the son of Ramses IX and, with only three existing \n/ushabti/known to have belonged to him, the ?12,000 price tag is no \nsurprise.\n\nAlso featured in the catalogue is a bronze of the catheaded goddess \nBastet. ?Its features are remarkably lifelike,? Mr Ede says. ?Although \nthe Egyptians did put figures of their gods in the tombs, this may have \ncome from a private chapel.? The price is ?45,000.\n\nAlso of great interest are four limestone canopic jars designed to hold \nthe viscera of the deceased. During mummification the heart was left \nintact, while the brain was removed and destroyed. The liver, lungs, \nstomach and intestines, however, were taken out and put into the four \npots. These represented the four sons of Horus, the four points of the \ncompass and the four protective goddesses. The set costs ?37,500.\n\nThere is also a great deal to tempt the more modest collector. A \ndelicate apple-green fa?ence of Thoth, the ibis-headed scribe of the \ngods, is only ?900, while an amulet of Tauert, the pregnant hippopotamus \ngoddess of childbirth, is ?950.\n\nIt is astonishing to look at some of the pieces in the catalogue and \nreflect that they have existed for 5,000 years. There are two jars from \nabout 3100BC, decorated in a na?ve style. No 40 depicts an aloe tree and \nis priced at ?2,900, while No 39, shows the River Nile with hills rising \nabove it and is priced at ?9,750.\n\nThe catalogue features 50 objects in total and although the items will \nbe on sale for the next month, the gallery has limited opening hours so \nit is best to ring in advance.\n\n*Charles Ede:* 020-7493 4944, www.charlesede.com\n\nhttp://business.timesonline.co.uk\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Mon, 16 Apr 2007 10:51:04 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Egyptian art with prices fit for a Pharaoh\nTo: Museum Security Network Mailinglist \nMessage-ID: <462338F8.60002@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nEgyptian art with prices fit for a Pharaoh\nApril 15, 2006\n\nWHAT price a piece of history ? or ancient history, no less? Of course, \nin one sense, the deeds of the past are beyond price, but the artefacts \nof our ancestors certainly aren?t.\n\nFor anyone interested in one of the most sophisticated ancient \ncivilisations, Charles Ede, a gallery in London, is currently holding \nits annual exhibition of Ancient Egyptian art, ranging from the \npre-dynastic period in 3000BC to 100BC.\n\nThe more expensive pieces, as you would expect, command prices fit for a \nPharaoh, but it is possible to buy a small amulet for about ?100.\n\nJames Ede, who put the sale together, says: ?One of the most remarkable \naspects of Egyptian art was the wide range of materials used. The \npurposes were diverse and the materials varied. For example, in our \nexhibition alone, you can find gold inlay, hippo ivory, wood and stones.\n\n?One of my favourite pieces is a wand made from hippo ivory. It was a \ndomestic object, designed to be used by a woman. They were used for many \npurposes, such as warding off snakes and hidden dangers.? At ?16,000, \nthe wand is one of the more expensive items in the sale.\n\nThe quality of the work is extraordinary. ?In Ancient Egypt, there was \nno word for artist ? they were just considered to be craftsmen,? Mr Ede \nsays. ?They often worked in very hard substances, such as granite, but \nthey didn?t have anything stronger than granite itself as a tool, so the \nprocess could take years. We have a ram?s head that was formed by honing \nit with another piece of rock over the years, after which it was \nsmoothed with sand and then chiselled.?\n\nAnother very expensive piece, priced at ?35,000, is a fragment from the \nside of a sarcophagus depicting two of the sons of Horus: the \njackal-headed Duamutef and the falcon-headed Qebhsenuef. ?The stance of \nthe figures is classic Egyptian style,? Mr Ede says. ?The head and arms \nare portrayed from the side, while the body is portrayed from the front.?\n\nThe piece dates from 1200BC to 1100BC, but Mr Ede points out that the \nstyle employed here has been used throughout millennia of Egyptian art.\n\nAmong the less expensive items are amulets, which were designed to \nprotect their owner from specific evils and problems. Mr Ede says: ?They \nwere worn while the owner was alive and after death they were wrapped in \nthe folds of the mummy. They are popular with collectors because they \nare not too expensive and do not take up a lot of space.?\n\nThe cheapest is ?110 and depicts a sow. The forms of the figures are \ncertainly intriguing: they include the lion goddess Sekhmet (?200), \nNefertum seated on a block throne while wearing a lotus head-dress \n(?385) and a seated ibis, its beak resting on the Feather of Truth (?480).\n\nMany of the pieces had a purpose beyond the grave. ?The Egyptians \nbelieved that, in the afterlife, you had to perform tasks such as \nworking in the fields to pay your way,? Mr Ede says. ?The only trouble \nwas that the Pharaohs didn?t want to. So instead they created ushabti \nfigures, which were designed to do the work for them.\n\n?The ushabtis, which are mentioned in the /Book of the Dead, /the \nEgyptian equivalent of the Bible, would be placed in the tomb and were \noften inscribed with a spell that would call upon them to work. The word \nushabti means answer and the ushabti figures are also known as workers \nfor the dead.?\n\nBut will they hold their value? Mr Ede says that, like all art, these \npieces should be bought for the love of them, not as investments. \nNevertheless, prices have soared over the years, particularly in the \nupper end of the market.\n\n?If my father had bought something in the 1960s for ?7, it would \nprobably be worth ?70 now,? he says. ?But if he had bought something \nworth ?600, it would now be worth ?60,000. Over the past 20 to 30 years, \nprices have more than kept pace with inflation.?\n\n/VIRGINIA BLACKBURN/\n\n    * Charles Ede: 020-7493 4944, www.charlesede.com\n\nhttp://business.timesonline.co.uk/\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 92\n***************************************\n\n"}