{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@flax9.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "SatCon Awarded $2.5M Phase 2 Contract for Pulse Power Energy Storage and Delivery System", "body": "\n\n\n\n\n\n\n\n\nSatCon Awarded $2.5M Phase 2 Contract for Pulse Power Energy Storage and Delivery System\n\nBOSTON, May 01, 2007 (BUSINESS WIRE) --  SatCon Technology Corporation(R) (Nasdaq CM: SATC), a developer of power management and system architecture solutions for the alternative energy and distributed power markets, today announced that its SatCon Applied Technology division has been awarded an additional $2.5M contract with a California customer for the next phase of pulse power equipment capable of providing 8.8 megawatts of power for several seconds. The total system will have pulse power capabilities in excess of 18 megawatts. Delivery of the first stage is scheduled for June 2007 and this new Stage 2 delivery is scheduled for October 2007. This pulse power application is an adaptation of SatCon's high power electronics and flywheel energy storage products. SatCon's Chief Executive Officer, Dave Eisenhaure, stated, \"SatCon is pleased to be participating in this pulse power program. This contract supports leadership in supplying power conversion and energy storage products. These types of programs allow customers to draw low levels of power from the grid and then supply large pulses of power for unique applications.\" The award expands on SatCon's portfolio of power electronics products with the development of an integrated pulse power energy storage system. This technology has direct applicability to both civilian and government customers. About SatCon Technology Corporation SatCon Technology Corporation is a developer and manufacturer of electronics and generators/motors for the Renewable Energy, Hybrid-Electric Vehicle, Grid Support, High Reliability Electronics and Advanced Power Technology markets. For further information, please visit the SatCon website at www.satcon.com. SATC-G Statements made in this document that are not historical facts or which apply prospectively are forward-looking statements that involve risks and uncertainties. These forward-looking statements are identified by the use of terms and phrases such as \"will,\" \"intends,\" \"believes,\" \"expects,\" \"plans,\" \"anticipates\" and similar expressions. Investors should not rely on forward looking statements because they are subject to a variety of risks and uncertainties and other factors that could cause actual results to differ materially from the Company's expectation. Additional information concerning risk factors is contained from time to time in the Company's SEC filings. The Company expressly disclaims any obligation to update the information contained in this release. SOURCE: SatCon Technology Corporation SatCon Technology Corporation(R)\nDan Gladkowski, 617-897-2411\nVP, Administration\n\n\n\n\n\n\n\n\n\n\n You are subscribed to SatCon Technology Corporation Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n SatCon Technology Corporation \n 27 Drydock Ave. 6th Floor, South Boston, MA 02127\n Service provided by Shareholder.com \n\n\n\n\n\n"}