{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "\"Charlotte Burn\" <charlotteburn@googlemail.com>", "subject": "Re: [R] Degrees of freedom in repeated measures glmmPQL", "body": "Apologies, I made a mistake with my maths. The degrees of freedom look\ncorrect, assuming they are the denominator and that glmms work this\nway. I just under-estimated the number of data points I had. Sorry.\n\nCharlotte\n\n\nOn 02/05/07, Charlotte Burn  wrote:\n> Hello,\n>\n> I've just carried out my first good-looking model using glmmPQL, and\n> the output makes perfect sense in terms of how it fits with our\n> hypothesis and the graphical representation of the data. However,\n> please could you clarify whether my degrees of freedom are\n> appropriate?\n>\n> I had 106 subjects,\n> each of them was observed about 9 times, creating 882 data points.\n> The subjects were in 3 treatment groups, so I have told the model to\n> include subject as a random factor nested within treatment.\n> There are two other variables and I'm interested in their two-way\n> interactions with Treatment.\n> I'm happy with the model structure, and the output generally looks right, but...\n>\n> In the 'DF' column of the output table, it has 882 as the degrees of\n> freedom for all the variables (except Treatment itself, which has 0\n> degrees of freedom). At the bottom of the output, it says Groups:\n> Subjects = 106, Treatment = 3.\n>\n> Should I be worried or is this what to expect?!\n>\n> I was expecting it to be more like an ANOVA table, where the error\n> degrees of freedom should reflect the number of subjects, not all the\n> data points.\n>\n> I can't see the usual differentiation between the numerater and\n> denominator/error degrees of freedom, so am I right in thinking the DF\n> column shows the error degrees of freedom? Or do glmms not work like\n> this?\n>\n> Thank you very much in advance,\n> Charlotte\n>\n\n\n-- \n------------------\nDr Charlotte C. Burn\nDepartment of Animal Welfare and\nBehaviour\nSchool of Clinical Veterinary Science\nUniversity of Bristol\nLangford House\nBristol BS40 5DU\nTel: 0117 9219134\nhttp://seis.bristol.ac.uk/~frccb/charlotteburn.html\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}