{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Stopping the HINALs, was: Final text of GPL v3", "body": "Sean Kellogg  wrote:\n> On Saturday 30 June 2007 09:56:44 am Francesco Poli wrote:\n> > On Sat, 30 Jun 2007 16:31:29 +0100 Anthony Towns wrote:\n> > > Francesco is not a lawyer, [...]\n> > I *explicitly* wrote this disclaimer in my comment message [...]\n> \n> Francesco...  as I've said on this list before, \"IANAL\" is not a sufficient\n> disclaimer.\n\nJOOI when did you send that here?  I found 'I very much believe that all\nresidences of a jurisdiction should be able to fully discuss the\nimplication of the law and how it should be applied' but not the above ;-)\n\n> [...] There are laws,\n> criminal laws, against the providing of legal advice by those who not\n> certified by the Bar Association within the jurisdiction the advice is given\n> in. [...]\n\nHowever, AFAIK, aj is not in the Bar Association of any jurisdiction\n(so doesn't know for sure whether Francesco is a lawyer, only that he's\nclaimed not repeatedly on this list not to be so - given the popularity\nof lawyers among debian users, that might be smoke) and aj doesn't have\nFrancesco under 24/7 surveillance (so doesn't know for sure whether or\nnot Francesco based his comments on legal advice).  aj is flashing the\nblindingly obvious on debian-legal in a particularly irritating manner.\n\n> But definitive statements like \"I wish it could, but I am afraid it\n> cannot...\" in response to a question about the meaning of a particular term\n> in a legal document is arguably legal advice.\n\nSomeone stating their fears is arguably legal advice?  Quick!  Let's all\nstop describing what we feel before someone hurts themselves(!)\n\n> > > that isn't legal advice,\n> >\n> > Since I explicitly noted that IANAL, it goes without saying that I\n> > cannot give legal advice.\n> \n> This, of course, is patently false.  Anyone can provide legal advice...\n\nIt depends if you read \"legal advice\" as \"advice about the law\" (as you\nseem to) or \"advice from the law\" (which is how I'd read it).\n\n> [...] Here, on an email list\n> entitled \"debian-legal\" I think one might have a reasonable expectation that\n> actual lawyers were providing advice. [...]\n\nShall we ask to beef up http://lists.debian.org/debian-legal/ ?\n\nMaybe take the FAQ text:\n  Debian's conclusion that a particular computer program is free\n  software, and our choice to distribute it, is an evaluation made for\n  our own purposes. It is not a legal statement on which you can rely,\n  either as a user, software developer, or distributor. We do our best,\n  but we are not lawyers. /We are unpaid volunteers. We make no guarantees./\n\n> To that end, Mr. Towns' continued reminders that you are not, in fact, a\n> lawyer, is helpful to those who may be mistaken that you are, as it would\n> appear, providing legal advice.\n\nI feel it's unnecessary noise, statements of the obvious that obscure the\nsignal.  If we can do something to stamp it out, we should.\n\nHope that explains,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}