{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 5/24/07 - Wedding Season", "body": "May 24, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\nThe Hungarian at the Wedding\n\nInvest In This Credit Card Company For Long-Term Profits\n\nMy Favorite Chinese Solar Power Stock\n\n-----\n\nLast weekend I attended a wedding here in Salem.  The daughter of a friend\nmarried a young man from Madrid, and I was fortunate to meet a number of\ninteresting young people, chiefly recent graduates of Johns Hopkins and\nYale, as well as a contingent from Spain.\n\nWith the Spaniards, I didn't get beyond the usual wedding pleasantries, no\nsurprise given the language barrier on both sides.\n\nWith the young American graduates, I did better.  Most interesting were a\ncouple of earnest young men trained in finance - one landed a job with\nMorgan Stanley in London, while the other is working at Thomas H. Lee\nPartners in Boston.  Bright young men, without question, and well-trained\nin finding things to buy that will be worth more later.  But I got the\nsense that while both will succeed at their jobs - at making money - they\nhave no purpose beyond that.   (Shades of the thoughts of Kevin Phillips, \nfound in my Wealth Advisory of May 10)   With luck, greater purpose will \ncome with maturity.\n\nBy far the most interesting guest at the wedding came from neither the\nU.S. nor Spain but from Hungary.  His name is Laszlo Szekfu.  At 34, he's\none of Hungary's best-known Internet entrepreneurs.  He's also an adviser\nto the Minister of Economy and Transport.  And he's using his networking\nskills to build a biotechnology cluster around a promising vaccine for\nHIV/AIDS. So why was he at the wedding?\n\nFor the past semester he's been a Yale World Fellow, which means he's been\npaid to attend high-level classes at Yale while networking with 18 other\nWorld Fellows as they work to increase global cooperation as well as\nstimulate progress in their own countries.\n\nWhen this young man was born, 34 years ago, Hungary was still controlled\nby Communists and the future was bleak.  Today it's a member of the\nEuropean Union, still struggling with inflation and unemployment, but\nexpecting to adopt the Euro by 2014, if not by 2010.  And entrepreneurs\nlike Laszlo Szekfu are part of the reason.\n\nBut what does this have to do with investing?\n\nWell, at the very least, it reminds me that it's a big world out there,\nwith a wide range of investment opportunities.  If you're limiting\nyourself to American blue chips you're missing out on a lot of the fun.\n\nMore specifically, it reminds me that as Communism falls by the wayside in\nvarious countries around the world, younger generations who are not\nsaddled by memories and habits learned in the \"old days\" are turning the\nunderused assets of their countries to good use, just as Laszlo is in\nHungary.\n\nHoldouts to this trend are North Korea and Cuba . . . but the clock is\nticking.  And then there's China, which nominally is still Communist but,\npractically speaking, is determinedly capitalistic.   \n\nTo me, this feels like a new model, and I think it's appropriate for a\ncountry in transition.  What comes next for China no one knows - ideally a\nfar more educated populace, a representative democracy, free elections,\nand a higher standard of living . . .  though not necessarily in that\norder.\n\nBut regardless of whether Communism eventually withers in China, you can't\nignore the fact that today China's economy is booming along at a 10% rate,\nmore or less (the reliability of the figures is questionable), and\nauthorities are working hard to keep it from expanding faster.  Workers\nare streaming from their farms into cities, where jobs are multiplying\nrapidly.  And consumers are beginning to spend . . .which brings me to my\nfirst stock, MasterCard.\n\nMasterCard, of course, is a well-known name.  It's one of the top two\ncredit card companies in the world.  But it's no dinosaur; it's taking\nfull advantage of the globalization movement to leverage its brand, and\nthe results are apparent in the company's first quarter results, which\nrevealed a 19% increase in transactions over last year, a 24% increase in\nrevenues, and a 67% increase in earnings!\n\nThose results touched of a wave of new buying a few weeks ago, which\nearned the stock a place in Cabot Top Ten Report, and here's what we\nsaid.\n\n\"MasterCard is a global brand, and a very profitable one.  It provides\nservices in more than 210 countries, serving over 25,000 financial\ninstitutions.  Yet its business is not well understood by most consumers. \nMasterCard does not issue credit cards or set interest rates or annual\nfees on cards or solicit merchants to use cards.  But it serves as a\nliaison between financial institutions and merchants and the businesses\nand customers that use its cards, taking a tiny fee for every payment\nprocessed, and working hard to keep the system secure.  It even acts as an\nadvisor to all those parties, using its data-mining capabilities to tell\nits partners how they can derive maximum benefit from the service. \nMasterCard's is a well established, robust business, with limited\ncompetition, and it's only getting better.  Two factors we like in\nparticular: in recent quarters, revenue growth has been accelerating, and\nin the latest quarter, the profit margin hit a plum 23.5%, the best in\nyears, if not ever.  Fundamentally, we also like the stock because it's\nonly been public for one year, so there are far more potential buyers -\nespecially among institutions - than sellers.\"\n\nLooking deeper into the business, I see that MasterCard has been offering\nservices in China since 1998, and that its greatest growth in the first\nquarter came from China, India and Brazil.  Looking forward, I expect more\nof the same, so I recommend the stock as a long-term holding.\n\n----- Advertisement -----\n\nOur Next 10 Stocks Could Put You On Easy Street!\n\nCabot Top Ten Report comes to your email inbox once a week with capsule\nanalyses of the market's ten strongest stocks. Some are big, some are\nsmall, some are young and some are old. Our job is to describe why each\none is strong, to give you an idea of how likely that strength is to\ncontinue, and to provide a follow-up in each issue until we tell you to\nsell.\n\nIt's the single best way we know to find great growth stocks in their\nearly stages . . . stocks like Hansen Natural, Titanium Metals and Ultra\nPetroleum. To get started with a no-risk trial subscription, simply click\nthe link below.\n\nhttp://cabotmail.net/t/186759/13148861/81/0/\n\n-----\n\nNow, some of you are going to look at this stock and say, \"MasterCard is\ntrading for $140 a share.  I can't afford that!  Give me something that's\nunder $10.\" And I understand where you're coming from.\n\nYou think you have a better chance of making money in a stock that's\nselling for under $10 than you do of making money in a stock that's\nselling for $140.  But with all due respect, you're wrong.\n\nSure, the low-priced stock has the potential to make you money faster, but\nit also has the potential to take your money away faster.  More\nimportantly, it is more likely to take your money away!\n\nAt bottom, it's a matter of quality.  The $140 stock, which is in an\nuptrend, is supported by a growing number of institutions and by improving\nperceptions, not to mention excellent fundamentals.\n\nBut most stocks selling under $10 got there by falling from above $10, and\nthat alone tells you something went wrong.  Furthermore, it suggests there\nare shareholders still waiting to sell until the stock climbs back to\ntheir buy price (so they get out even).  And it tells you there will\nprecious few institutional shareholders to provide stability for the\nstock.\n\nConsider, for example, three names from our past, going back as far as ten\nyears when we (and many other investors) thought hydrogen fuel cells were\nthe next big thing.  There was Ballard Power (BLDP), which had partnered\nwith Daimler and Ford to provide fuel cells for cars.   \nAnd there were Fuel Cell Energy (FCEL) and Plug Power (PLUG), who were\nworking on fuel cells for stationary applications.\n\nHave you seen any fuel cell-powered cars lately?  No, you see Toyota\nPriuses.  And houses powered by hydrogen?  It's not happening.  In every\ncase, the hopes and dreams of both management and investors have failed to\ncome true.  As a result, all three stocks are trading in the single digits\n(BLDP is 5, FCEL is 7 and PLUG is 3).\n\nAnd commissions?  In the old days it may have mattered, but in the\nInternet era it doesn't.  You can spend $150 buying one share of\nMasterCard (assuming a $10 commission) or you can spend it buying 45\nshares of Plug Power.  I think your chances are better with one share of\nMasterCard.  (The symbol is MA.)\n\n-----\n\nAnd now that we're on energy, I can segue into a hot little energy stock\nwith great growth potential.\n\nThe background: China gets 70% of its energy from coal.  It burns 2.1\nbillion tons of coal per year, more than the U.S., E.U and Japan,\ncombined.  And this coal pollutes its air, which causes health problems\n\nSo there's a great demand for clean-energy solutions in China.  And\nglobally, there's growing demand - due to increased perceptions of global\nwarming - for energy sources that replace the burning of fossil fuels.\n\nI've mentioned solar power companies before, and will likely mention them\nagain; I think this is a big growth market, and I like the rapid growth\nthese companies are experiencing today.  So today's topic is Trina Solar,\nwhich stands out from the crowd because it's the one company in the\nindustry that's vertically integrated.\n\nHere's what Paul Goodwin, editor of Cabot China & Emerging Markets Report,\nwrote last month.\n\n\"Trina is working toward reducing the cost of solar cells in a number of\ninnovative ways.  First, Trina's proprietary formulas allow it to use scrap\nsilicon that has been discarded by other electronics and solar\nmanufacturers.  Back in 2000, when the solar industry used just 10% of the\nworld's silicon, this wasn't so important.  But solar has now surpassed\nsemiconductors as a silicon consumer, and the global shortage of\npolysilicon feedstock has put pressure on all users.   \nSince it takes 18 to 30 months to get a polysilicon plant up and running,\nTrina's ability to use scrap is a major advantage.\n\n\"Trina's second big advantage: it's on the verge of becoming a totally\nvertically integrated manufacturer, meaning that the company will soon\nrefine its own silicon feedstock, grow its own ingots, cut its own wafers,\nmanufacture its own cells, assemble its own modules, and install its own\nsystems, all at its fab site in Changzhou.\n\n\"Trina's third advantage is a little paradoxical.  It's that Trina is both\na young company, but also already a major player in the industry, with\nlong-term technology partnerships with companies in Switzerland, Italy and\nGermany.\n\n\"Trina's ingot production facility became fully operational just in\nOctober 2005, and wafer manufacturing began just in February 2006.   \nBy the end of 2006, the company had reached 28 megawatts (MW) of\nproduction output; output capacity is projected to reach 150MW by the end\nof 2007.\n\n\"Yet despite this relative youth, Trina has sales in Germany, Spain,\nItaly, Norway and Australia in addition to its leadership in sales and\nresearch into solar homes and industrial installations in China.\n\n\"There is no doubt that the generous subsidies offered by the German\ngovernment have had a huge effect on global solar production.  But\nadditional programs in California and renewed global interest in PV\nelectricity production are creating a wave of new customers.\"\n\nTrina's revenues grew 194% in the first quarter to $42.6 million, while\nearnings grew 57% to $0.22 per share, and I'm confident there's plenty\nmore growth ahead.\n\nFinally - here's the timely part - TSL peaked at 69 in mid-April and then,\nlike all solar stocks, pulled back toward its 50-day moving average.  In\nshort, the solar stocks needed a rest from the heated environment that\nfollowed their market-leading first quarter performance.  As I write, TSL\nsits right on that 50-day moving average at 53, and I think this marks a\ndecent buying opportunity.\n\n-----\nEditor's Note\n\nTo get the latest recommendation on Trina Solar and other exciting\nemerging-market stocks, try a no-risk subscription to Cabot China &\nEmerging Markets Report.  When you do, you'll not only be sure of getting\nregular buy-hold-sell advice on all previously recommended stocks, you'll\nalso get a regular monthly overview of the emerging markets landscape from\neditor Paul Goodwin.\n\nCabot China & Emerging Markets Report was the top-performing investment\nadvisory service of 2006, with a gain of 76%, and it remains the top\nperformer over the past twelve months, with a gain of 28%.\n\nTo get started with a no-risk trial subscription, simply click the link\nbelow.\n\nhttp://cabotmail.net/t/186759/13148861/93/0/\n\n-----\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n-----\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=186759&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}