{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Dick Kraft\" <lazclubmarebeachbow@clubmarebeach.com>", "subject": "Say goodbye to extra pounds", "body": "\nStop being obese and unhappy\n\n\n\n\n\n\nAnatrim – The newest and most attracting lose flesh product is now readily available – As told on BBC.\n\n\nCan you retain all the times when you appeal to yourself to do anything for being delivered from this fastly growing number of kilos? Happily, now no great price is to be paid. Thanks to Anatrim, the ground-shaking weight-reducing mixture, you can achieve naturally health lifestyle and become really slimmer. Just look at what people write!\n\n\n\n\"It’s quite difficult to admit it but I was an awful food addict. \n\n\nI greedily devoured all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis misery stopped when I started course of taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my inclination to eat constantly vanished, \n\n\nmood improved and I’m the happiest person 24 pounds in 2.2 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person in the world!\"\n\n\n\n\n\nSilvia D., Washington\n\n\n\n\n\n\"Since my early childhood I was a weighty boy. \n\n\nYou can't imagine how I detested being mocked at school. \n\n\n\n\nI detested my stoutness and I abhorred even myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nThis stuff literally took me out of this terrible nightmare! Many thanks and a great respect to you, guys.\"\n\n\n\n\n\nRikky Martin, New York\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was saved! I fell down into this circle, depression – more eating – even more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nOne of my friends pointed at your web page and I ordered up my pack of Anatrim as soon as it was possible. \n\n\nThe results I achieved were great, my appetite became normal, I was in a good mood oftener, and, of course, I tightened my belt with no regrets. And the bed became cool, too!\"\n\n\n\n\n\nDave\n\n\n\n\n There is a great number of gratitudes left by happy people taking Anatrim. Why don't you add yourself to the thousands and thousands of slim men and women and try this original appetite-suppressing energy raising product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}