{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Computers & Electronics Newsletter May 31, 2007", "body": "\nhowstuffworks® | computers & electronics May 31, 2007\nRSS\n \n  Computer Monitors Now Play a Major Role  The\nmonitor is one of the most important parts of a computer, yet we don't usually\ngive it much thought. Instead, many people simply accept whatever is included\nin a package deal. But with computers now playing a major role in home\nentertainment, business and multimedia, it's time to judge displays on their\nown merits. Read computer monitor reviews, compare prices and learn everything\nyou need to know before you buy.\nAlso at HowStuffWorks\n \nHow OLEDs Work -OLEDs are solid-state devices composed of thin films of organic molecules that create light with the application of electricity. \n Learn how OLEDs can provide brighter, crisper displays on electronic devices while using less power than LEDs or LCDs.   \nHow Computer Monitors Work  - Because we use them daily, many of us have a lot of questions about our monitors and may not even realize it. What do \"aspect ratio\" and \"refresh rate\" mean? What is the difference between \nCRT and LCD? Find out.  \n \nHow\nSpam Works - You block\nit, you filter it, you unsubscribe from lists you actually want to be on, and\nstill it lands in your inbox. If you have an e-mail account, chances are you\nalso have spam. Learn where spam comes from, who's doing the spamming and how\nto stop it.\n   \nThis Week's Video\n \n\nHow to\nAdd RAM to a Laptop - Random access memory (RAM) is the best-known form of computer memory.\nRAM is considered \"random access\" because you can access any memory\ncell directly if you know the row and column that intersect at that cell.\nUpgrading your laptop can seem like a daunting task, but it doesn't have to be.\nAdd RAM to your laptop with the help of this HowStuffWorks video.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved "}