{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS News Early Show <cbsnews___early_show_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Russ Mitchell: On Immigration and the Bush Administration", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nHi,\n \nI'm \n      Russ Mitchell and here's a re-cap of this morning's Early \n      Show. \n \nContributor Lou Dobbs from CNN stopped by to give us his thoughts \n      about immigration. Today thousands are expected to attend pro-immigrant \n      rallies across the country pushing for laws to turn America's illegal \n      immigrants into legal residents. Dobbs, who is against that proposal, \n      asked US officials to enforce existing immigration laws. \n \nIn our \n      7:30 half hour former CIA director George Tenet spoke \n      to Harry about his new book, \"At The Center of The \n      Storm\".\nTenet \n      once again criticized the Bush Administration for its handling of \n      the Iraq war. \n \nFinancial expert Dave Ramsey was here to answer your questions on getting your financial house in order. Johan  Otter and  his daughter \n      Jenna survived a grizzly \n      bear attack and joined us today to talk about that \n      horrifying ordeal. Dave Price played a game \n      of Harry Potter trivia with the folks out on our plaza. We saw some cool \n      new sunglasses that are now available just in time for the Spring sun \n      and game show icon Chuck Barris came by the studio to talk \n      about his new book. \n \nOn tomorrow's show, we're looking forward to hearing from our \n      friend Capitol Bob -- Bob Schieffer, \n      that is -- and also from London correspondent Mark Phillips, who'll \n      be filling us in on Queen Elizabeth II's visit to the U.S. this weekend. \n      She'll be here to commemorate the 400th anniversary of the first English \n      settlement in America and she'll also take in the Kentucky Derby. \n      \nTake care,\n \n      \n\n\nRuss \n      Mitchell \nEarlyShow@cbs.com \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}