{"category": "spam", "to_address": "Wisdom <wisdom@flax24.uwaterloo.ca>", "from_address": "Heather Lee <istlbhrd@gkatmar.com>", "subject": "Twin turbo for your penis", "body": "\n\nGoing to have sex with two ladies at the same time? You need a strong erection, or they will have to satisfy each other. You really need Viagra!\nVisit us\nYou can spend thousands and buy pills at your local drug store. But you can spend less by ordering the same quality Viagra and Cialis at Online pharmaceuticals.\nVisit us\nAbsolutely confidential and secure purchase.\nWith best regards,\nHeather Lee\n \n \nDva gromadnyh, kazhdyj s prilichnoe ozero, glaza, dyshashchih kakoj-to Nepostizhimoj bezdonnoj pustotoj, kak budto tam, za nimi, sosredotochilas Svoia Vselennaia, smotreli na menia v upor. Dumaiu, on eto prekrasno ponimal. No Snachala ia vozmus za devchonku, priamo na tvoih glazah, i ty ne smozhesh mne Ni pomeshat, ni otvernutsia, chtoby ne videt togo, chto ia s nej sdelaiu. Vsego mgnovenie. \nMozhet byt, eto, mozhet byt, To. Obrechenno vzdohnuv, Evrial stupil na poverhnost Zerkala mezhdu dvuh zubev, Proshel na seredinu i ostanovilsia, povernuvshis licom k Rogu Vody, chto nikogo Ne udivilo. Chastokol oranzhevyh klykov uzhe ne vyzyval sodroganiia kazhdyj raz, kogda chuzhoj Ih demonstriroval. chto ty delaesh! vozmutilsia Celitel, kogda my ostanovilis. Piat. Oni mogut sejchas na nas smotret! Davaj dejstvuj! Propori mne shkuru eshche razok huzhe mne ot etogo ne stanet, zato sozdast Pravdopodobnuiu kartinu. Vyzvannyj Altaresom demon ognia byl stol ogromen, chto mog zaprosto Proglotit mechnika, dazhe ne perezhevyvaia, a liushchijsia ot nego svet stol iarok, chto Ozarial ves kolodec, zatmiv dazhe siianie Kruga Prichastiia. Bigman, v kotoryj raz, vyrugalsia, ne svodia s Mashin zlyh prishchurennyh glaz. \nDlia obychnogo nabliudatelia so storony, ne Vladeiushchego Leshu, udar mog tak i ostatsia nezamechennym, v krajnem sluchae mag mog Razgliadet lish razmytuiu ten, melknuvshuiu tuda i obratno. Nu gde zhe oni?! Ni Gilsveri, ni zasfernika! On videl, kak ta zhe mysl glozhet i Onni, i Leksa, i dazhe Altaresa. Son plohoj Prisnilsia. Vprochem, nezavidnym on budet v liubom sluchae, pobeda lish Otsrochit predstoiashchee udushe, i tut uzhe ostaetsia nadeiatsia tolko na chudo, Kotoroe spaset menia v samyj poslednij moment, chudo, ozhidanie kotorogo Spriatano v glubine podsoznaniia liubogo chelovecheskogo sushchestva dazhe v samyh Bezvyhodnyh situaciiah. ejisuminyon Q1FUW1pVckRcUFBGHUFCUEZWRlleXR1XVA==\n \n\n\n"}