{"category": "ham", "to_address": "\"avcavc\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"AccuWeather.com Alert\" <inbox@messaging.accuweather.com>", "subject": "AccuWeather.com Alert(tm) Advisory  (avcavc)", "body": "\n\nAccuWeather.com Alert[TM]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSevere Watches and Warnings for BEVERLY HILLS \n\n\n\n\n\n\n\n\n\n\n\n\n\nLOXCFWLOX\r\nWHUS46 KLOX 101127\r\nCFWLOX\r\n\nCOASTAL HAZARD MESSAGE\r\nNATIONAL WEATHER SERVICE LOS ANGELES/OXNARD CA\r\n427 AM PDT TUE APR 10 2007\r\n\n..HIGH SURF TO AFFECT WEST FACING BEACHES OF SOUTHWESTERN\r\nCALIFORNIA...\r\n\nA STRONG NORTHWEST FLOW WILL BRING A RISE IN SEA CONDITIONS IN\r\nTHE COASTAL WATERS THROUGH LATE WEEK. HIGHER THAN NORMAL SURF IS\r\nEXPECTED ACROSS WEST-FACING BEACHES FOR LATE WEEK AS AN INCREASE\r\nIN WIND DRIVEN WAVE ENERGY ARRIVES AT THE BEACHES.\r\n\nCAZ034-035-101600-\r\n/O.NEW.KLOX.SU.Y.0005.070410T1700Z-070411T1000Z/\r\nSAN LUIS OBISPO COUNTY CENTRAL COAST-\r\nSANTA BARBARA COUNTY CENTRAL COAST-\r\n427 AM PDT TUE APR 10 2007\r\n\n..HIGH SURF ADVISORY IN EFFECT FROM 10 AM THIS MORNING TO 3 AM PDT\r\nWEDNESDAY...\r\n\nTHE NATIONAL WEATHER SERVICE IN LOS ANGELES/OXNARD HAS ISSUED A HIGH\r\nSURF ADVISORY...WHICH IS IN EFFECT FROM 10 AM THIS MORNING TO 3 AM\r\nPDT WEDNESDAY.\r\n\nEIGHT TO TEN FOOT BREAKERS WITH MAXIMUM SETS TO TWELVE FEET CAN BE\r\nEXPECTED TODAY THROUGH WEDNESDAY ON WEST FACING BEACHES. AS\r\nSTRONG WINDS INCREASE ON THURSDAY...BREAKERS ARE EXPECTED TO\r\nINCREASE TO NEAR TWELVE FEET IN THE MOST SUSCEPTIBLE LOCATIONS. WITH\r\nAN INCREASED SOUTHERLY SWELL DEVELOPING AS WELL...A HIGH POTENTIAL\r\nFOR DANGEROUS RIP CURRENTS EXISTS FOR ALL WEST FACING BEACHES\r\nTHROUGH MUCH OF THE WEEK.\r\n\nA HIGH SURF ADVISORY MEANS THAT HIGH SURF WILL AFFECT BEACHES IN THE\r\nADVISORY AREA...PRODUCING RIP CURRENTS AND LOCALIZED BEACH EROSION.\r\nSWIMMING OR SURFING IN THESE WAVES MAY BE DANGEROUS FOR ANYONE.\r\nWHEN IN DOUBT...JUST STAY OUT.\r\n\n$$\r\n\nCAZ039>041-101600-\r\n/O.NEW.KLOX.CF.S.0003.070410T1700Z-070411T1000Z/\r\nSANTA BARBARA COUNTY SOUTH COAST-VENTURA COUNTY COAST-\r\nLOS ANGELES COUNTY COAST INCLUDING DOWNTOWN LOS ANGELES-\r\n427 AM PDT TUE APR 10 2007\r\n\n..HIGHER THAN NORMAL SURF EXPECTED FOR LATE WEEK...\r\n\nFOUR TO SIX FOOT BREAKERS WITH MAXIMUM SETS TO SEVEN FEET CAN BE\r\nEXPECTED LATER TODAY THROUGH WEDNESDAY ON WEST FACING BEACHES.\r\nWITH AN EXPECTED INCREASE IN NORTHWEST FLOW OVER THE COASTAL\r\nWATERS ON THURSDAY...A HIGH SURF ADVISORY MAY BE NECESSARY FOR THE\r\nAREA. WITH AN INCREASED SOUTHERLY SWELL DEVELOPING AS WELL...A\r\nHIGH POTENTIAL FOR DANGEROUS RIP CURRENTS EXISTS FOR ALL WEST\r\nFACING BEACHES THROUGH MUCH OF THE WEEK.\r\n\nALL PERSONS SHOULD BE AWARE OF THE RISKS ASSOCIATED WITH WATER\r\nRELATED ACTIVITIES AND USE EXTREME CAUTION WHEN ENTERING THE OCEAN.\r\nSTRONG RIP CURRENTS WILL ALSO MAKE SWIMMING OR SURFING IN THESE\r\nLARGE WAVES VERY DANGEROUS FOR ANYONE. WHEN IN DOUBT...JUST STAY\r\nOUT.\r\n\n$$\r\n\nMEIER/HALL\n\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChoose another forecast:\n\t\t\t\t\t\t\t\t\t\tEnter a zipcode, or a city, state\n  \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n©2007\n\t\t\t\t\t\t\tAccuWeather, Inc. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}