{"category": "spam", "to_address": "\"Subscriber\" <cruiseca@flax9.uwaterloo.ca>", "from_address": "\"Countrywide Home Loans\" <r5sdavxywb@juicefry.com>", "subject": "Countrywide Could Help Consolidate Your Debt w/ the Combo Loan", "body": "Attention: \n  \n    The housing bubble has burst, but that doesn't mean you can't find an affordable home loan! \nFind out how you could get a home loan with low monthly payments and no closing costs+ so you can purchase the home of your dreams. \n \nhttp://yarnclass.com/t/r5sdavxywb/73105\n\nCountrywide Home Loans, \nhttp://yarnclass.com/t/r5sdavxywb/73105\n\nAmerica's #1 home loan lender^ approves 4 out of 5 \napplicants\\u2021 for: \n  \n         \\u2022 Home Loans \n         \\u2022 Home Equity Loans \n         \\u2022 Debt Consolidation Loans \n  \nCountrywide Home Loans could help put you into the home you've always dreamed of owning. Learn how Countrywide Home Loans offers a full spectrum of services that could make your dreams a reality. \nhttp://yarnclass.com/t/r5sdavxywb/73105\n  \nCountrywide Home Loans \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n  \n\n^Countrywide Home Loans is a member of the Countrywide family - America's # 1 home lender, as ranked for 2006 by Inside Mortgage Finance (Feb. 2, 2007), Copyright 2007. \n\\u2021 Calculation does not include withdrawn or incomplete applications. \n+Some up-front fees may apply that are credited back at funding. Borrowers who choose to pay lender fees and closing costs up-front may qualify for a lower rate. Refinancing or taking out a home equity loan or line of credit may increase the total number of monthly payments and the total amount paid when compared to your current situation. \n\nWe are pleased to present you with this advertisement. If you would like to unsubscribe from future emails from Countrywide, if you no longer wish to receive email offers from Countrywide, \nhttp://yarnclass.com/t/r5sdavxywb/73106______________________________________________________\n\nNo More Mail:\nhttp://yarnclass.com/u/13b7/cruiseca%40speedy.uwaterloo.ca/2\nor write to\nTurnCoach\n2309 Bel Air Rd.,Suite 311\nFallston, MD 21047\n\n\n"}