{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWEDNESDAY 23 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tI wasn't going to offer a Quote for the Day today - just a health warning. \n\n\nA new member of the Newsnight staff, who, to hide his identity, we'll call \"Peter C\" has sent me a couple of jokes which are so bad they might have been the prototype for the Monty Python joke which resulted in people dying of laughter. \n\n\nOne of his offerings is at the end of this email. You have been warned. \n\n\nIn tonight's programme:\n\n\nThe Congo \n\n\nWe have a powerful film from Fergal Keane about the failure of the UN in the Congo. \n\n\nThe peacekeeping mission has been powerless to act while a warlord has committed gross human rights abuses and forced tens of thousands of Congolese to leave their homes. \n\n\nWe track down the warlord and speak to the UN about their inability to intervene.  \n\n\nEnergy\n\n\nWe now have the latest energy white paper. This one argues the case for nuclear power. Does the government really intend to \"consult\" over the next five months or has it already made up its mind?  \n\n\nMichael Crick is on the case, and I'll speaking to the Minister in charge. \n\n\nMcJobs\n\n\nThe fast food chain McDonalds has struggled hard to change its image. No longer as secretive as it once was, McDonalds UK has launched a campaign to change the Oxford English Dictionary definition of the word \"McJob\".  \n\n\n\"An unstimulating low-paid job with few prospects, especially one created by the expansion of the service sector\".\n\n\nNewsnight has been granted access to McDonalds to talk to staff about how they view their work - and what they think of the \"McJob\" label, and I've been talking to the company boss in the UK, Steve Easterbrook. You can see the full length interview here.\n\n\nWhat do you think of the term \"McJob\"? Join the debate here. \n\n\nAnd finally... \n\n\n\"Peter C\" sent the following Joke Fit For an Eleven Year Old:\n\n\nQ: \"Why do French people never eat two boiled eggs for breakfast?\"\n\n\nA: \"Because in France, one egg is an ouef.\"\n\n\nUnless someone sends in something better, Peter C has another offering in store for tomorrow's email. Now please excuse me, I am feeling a little ill and may have to lie down until the programme which is at 10.30 tonight on BBC2. \n\n\nGavin \n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nETHICAL MAN GOES TO INDIA\n\n\t\t\t\t\t\t\tNewsnight's Ethical Man, Justin Rowlatt, has investigated how India's economy copes with pollution and carbon emissions.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}