{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "1030a 6/18 Update: Williams bids tearful farewell to station", "body": "\n\n\n\n\n1030a 6/18 Update: Williams bids tearful farewell to station\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 73\nPosted: 10:15 AM, 6/18/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-71 (06/17/07): Flight director pleased with mission\n   SR-72 (06/18/07): Critical SARJ, attitude control tests on tap\n   SR-73 (06/18/07): Suni Williams bids tearful farewell to space station\n\n=================================\n\n10:15 AM, 6/18/07, Update: Williams bids tearful farewell to station\n\nIn her final daily planning conference with space station controllers in the United States and Russia, astronaut Sunita Williams, now the world's most experienced female space flier, bid a tearful farewell to her Russian crewmates, her American replacement - Clay Anderson - and the laboratory she's called home since last December.\n\n\"Houston, Moscow and Huntsville on (channel) 2, we're going to start the DPC a little bit early because I'm going to start it, Clay's going to finish it, or Clay, Fyodor (Yurchikhin) and Oleg (Kotov) are going to finish it without me,\" Williams radioed.\n\n\"Exploration isn't necessary or always logical,\" she said in a halting voice. \"It's something that comes from inside each and every one of us. I believe we're all born with this curiosity called exploration. Human spaceflight is just one aspect of exploration, but it's the one that I've been intimately familiar with over the past six months.\n\n\"So I feel I can talk to how it affects thousands of people around the world who have worked on and still work on this amazing engineering and science project we call the international space station. These folks, along with their families, have dedicated their lives to ensure the success of the astronauts and cosmonauts (audio cutout) curiosity called exploration for the next generation.\n\n\"I'm saddened to say goodbye, but that means progress is being made and it's time for the international space station to grow a little more,\" Williams said, struggling to contain her emotions. \"You and the ISS will always be a part of me as you are part of so many who will pave the way for our future.\"\n\nShe then beamed down a recording of James Blunt's \"Goodbye My Lover:\"\n\n------------------------\n\nIt may be over but it won't stop there,\nI am here for you if you'd only care.\nYou touched my heart you touched my soul.\nYou changed my life and all my goals.\n\n...\n\nGoodbye my friend.\nYou have been the one.\nYou have been the one for me.\n\n------------------------\n\nOn a more humorous note, she dedicated a second song to Anderson: the Bee Gees' \"Stayin' Alive.\"\n\nSpeaking in English, Yurchikhin told ground controllers, \"we had real great time with Suni here. She did real great job in space. ... We would like to say Suni, Suni have a good trip and a safe trip, not only Suni, all shuttle crew. And good luck.\"\n\nSaid Anderson: \"I would like to say thanks to Suni. She's been very helpful to me and I know this is going to be a tough day for her, but I'm very proud of her, she's a sister to me and I hope I can carry on and do half as well as she did while she was on orbit.\"\n\nWilliams set a new space endurance record for female astronauts last Saturday, moving past the 188-day four-hour record set by Shannon Lucid during a stay aboard the old Mir space station.\n\nLate today, assuming tests show Russian computers can once again manage the space station's orientation, Williams and her shuttle crew mates will bid farewell to Yurchikhin, Kotov and Anderson and close hatches between the two spacecraft to set the stage for undocking Tuesday morning.\n\nAtlantis is scheduled to land at the Kennedy Space Center around 1:54 p.m. Thursday. The initial forecast calls for clouds and thunderstorms in the area Thursday and Friday. The weather at Edward Air Force Base, Calif., is expected to be favorable.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}