{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "SNL Energy<SNL.Energy@calcium.netcontentinc.net>", "subject": "Electric Transmission Week complimentary trial", "body": "\n\n\n1105_ETW_Trial\n\n\n\n\n\n\n\nView this message as a Web page.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFREE Trial Offer\n\n\n\n\n\n\n\n\nYou're invited to receive a FREE trial subscription \n                to \n                ELECTRIC TRANSMISSION WEEK, your eyes and ears on all \n                aspects of the North American power grid.\n\nClick \n                here to accept this FREE trial offer.\n\nELECTRIC TRANSMISSION WEEK provides in-depth \n                coverage of standard market design; regulatory actions and controversies; \n                congestion management issues; regional bottlenecks and their effect \n                on the market; RTO developments; transmission rights; capacity \n                pricing; projects, planning, disputes and much more.\n\n                Your subscription also includes FREE access to \n                SNL's online Information Service for Energy where you can view your current issue, \n                catch up on back-issues and stay on top of the latest news headlines. \n            \n\n                You have no risk or obligation -- just an exclusive opportunity \n                to acquire comprehensive transmission intelligence at no cost. \n               \n\n\nACT \n                NOW AND CLICK HERE!\n\n                \nONE \n                SNL PLAZA  •  CHARLOTTESVILLE, VA 22902  •  434.951.7797\n\n\n\n\n\n\n\n\n\nThis is a promotional email from SNL Financial. If you prefer not to receive messages of this type by email from us, please click here, or reply to this email with \"remove\" in the subject line. Click here to view our Privacy Policy.\n\n\n\n1207\n\n\n \n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}