{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "james.love@keionline.org", "subject": "[Ip-health] e-drug's discussion of \"Expanding the WHO Model Essential\n Medicines List\"", "body": "There has been a brief discussion on the e-drug list on the proposal to\nexpand the WHO model Essential Medicines List to include a new category\nfor products that are cost effective, \"if available at generic prices.\"\nThat debate has been \"terminated\" by the e-drug moderators, in the message\nbelow which also defends the current methodology.\n\nKEI's March 2, 2007 submission to the WHO Expert Committee largely focused\non the policy issue, but did identify products which would be appropriate\nfor the EML \"if available at generic prices.\"\nhttp://www.keionline.org/misc-docs/eml2March2007.pdf   We will continue to\nexplore this issue, and welcome comments on the topic.\n\nJamie\n\n---------------------------- Original Message ----------------------------\nSubject: [e-drug] Expanding the WHO Model Essential Medicines List (11)\nFrom:    e-drug@healthnet.org\nDate:    Thu, May 10, 2007 7:08 am\nTo:      \"E-Drug\" \n--------------------------------------------------------------------------\n\nE-DRUG:  Expanding the WHO Model Essential Medicines List (11)\n--------------------------------------------------------------------\n\nE-drug moderators have agreed that this thread should be terminated for\nthe moment as we seem to have covered the issues.   The discussion can be\nreopened if new lines of thought are contributed.\n\nWe would like to confirm that apart from ARV's there are very few patented\nmedicines on the WHO Model List. While some people suggest that patents\nand high costs prevent their inclusion an alternative explanation might be\na lack of significant therapeutic innovation as is seen with neglected\ndiseases. There have also not been applications for such high cost\nmedicines as some of those described.\n\nThe opportunity exists for those who believe that there are significant\nomissions to make submissions for the next committee. As a previous E-Drug\nmessage described, anybody including medical student groups can make a\nsubmission. As the process is evidence based and all applications are\nposted on the WHO web site it is easy to see that for at least the last\nthree meetings, cost was not a significant factor in the rejection of past\napplications.\n\nE-DRUG Moderators\ne-drug@healthnet.org\n_______________________________________________\nPost message: e-drug@healthnet.org\nSubscribe: e-drug-join@healthnet.org\nUnsubscribe: e-drug-leave@healthnet.org\nHelp: e-drug-owner@healthnet.org\nInfo & archives: http://list.healthnet.org/mailman/listinfo/e-drug\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}