{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Nell Browne\" <menedilforniturepef@edilforniture.it>", "subject": "Summer is coming, time to tone up", "body": "\nPounds down, mood up\n\n\n\n\n\n\nAnatrim – The newest and most exciting flesh loss product is now readily available – As seen on ABC.\n\n\nDo you hold in your memory all the situations when you told yourself you would do anything for being delivered from this fastly growing number of kilos? Happily, now no major offering is required. Thanks to Anatrim, the ground-shaking kilos-melting medley, you can get naturally health lifestyle and a really slender figure. Have a look at what our customers write!\n\n\n\n\"I hate to acknowledge it but I was terribly addicted to food. \n\n\nI ate all this garbige \n\n\nand was unable to stop. \n\n\n\n\nThis misery stopped after I started course of taking Anatrim! \n\n\nGod,\n\n\n\n\n my craving for food disappeared, \n\n\nmood improved and I turned to the happiest person 25 pounds in 2.4 months. \n\n\n\n\nI can tell you now I became the happiest person on the planet!\"\n\n\n\n\n\nLinda F., Boston\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nYou can't imagine how I detested being ridiculed at school. \n\n\n\n\nI hated my stoutness and I hated even myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nIt literally dragged me out of this nightmare! The greatest respect to you, guys.\"\n\n\n\n\n\nSteve Burbon, New York\n\n\n\n\n\n\"You know what? My marriage was saved thanks to Anatrim! I went into the circle, depression – eating more – just more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nMy friend pointed at your web site and I asked for pack of Anatrim at the same time. \n\n\nThe results were great, my appetite came to acceptable level, I was often in a good mood, and, certainly, I tightened my belt with no regrets. And the sex became fantastic, too!\"\n\n\n\n\n\nKarl\n\n\n\n\n There many and many gratitudes left by delighted people trying Anatrim. Don’t you gonna add yourself to the tens of thousands of slim buyers and try this natural appetite reducing energy lifting product now!\n\n\nDo not lose your chance!\n\n\n\n\n"}