{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Lisa Echols\" <powcjcautomobilesdeq@cjcautomobiles.com>", "subject": "Stop being obese and unhappy", "body": "\nBecome fit and happy again\n\n\n\n\n\n\nAnatrim – The latest and most delighting product for weighty people is now easily available – As were told on BBC.\n\n\nDo you retain all the times when you plead to yourself to do any thing for being saved from this fastly growing pounds of fat? Fortunately, now no great offering is required. Thanks to Anatrim, the earth-shaking kilos-melting mixture, you can achieve healthier mode of life and become really thinner. Have a look at what people write!\n\n\n\n\"I hate to admit it but I was an awful food addict. \n\n\nI greedily swallowed up all this rubbish \n\n\nand could not stop. \n\n\n\n\nThis ruinous passion passed away when I started course with Anatrim! \n\n\nGod,\n\n\n\n\n my inclination to eat constantly disappeared, \n\n\nmood improved and I turned to the happiest person 18 pounds in 2.6 months. \n\n\n\n\nI can tell you now I’m the happiest person in the world!\"\n\n\n\n\n\nLusia R., Colorado\n\n\n\n\n\n\"I had weight problems since a boy. \n\n\nIt’s difficult to imagine how I hated being mocked at school. \n\n\n\n\nI detested the weight and I abhorred even myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nIt literally took me out of this horror! The warmest thanks to you, guys.\"\n\n\n\n\n\nRikky Martin, Boston\n\n\n\n\n\n\"You know what? Thanks to Anatrim my marriage was luckily saved! I fell down into this circle, depression – more eating – more depression. My wife had thought to leave the overweight psycho I was turning in. \n\n\nOne my best friend showed me site and I asked for pack of Anatrim as soon as it was possible. \n\n\nThe results were excellent, my appetite came to admissible level, I was often in good spirits, and, of course, I tightened my belt with no regrets. And you know, the bed became cool also!\"\n\n\n\n\n\nTom\n\n\n\n\n There are lots of testimonial letters happy people leave after taking Anatrim. Don’t you wanna join the tens of thousands of slender customers and try this all-natural appetite-suppressing energy increasing product now!\n\n\nDon’t lose the opportunity!\n\n\n\n\n"}