{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nFor American troops in Iraq, a new heavy-duty armored\n  vehicle has proven to be a life-saver. It is called an MRAP for short, and\n  its ability to withstand powerful blasts from roadside bombs is already\n  renowned. Naturally, the demand for the vehicle is great among troops in the\n  field. But the Marine Corps says because of bureaucratic red tape\n  they’ve received less than one-tenth of the vehicles they’ve\n  ordered. How long will it take for American soldiers in Iraq to get the protection\n  they’re pleading for? David Martin will report.\n \nIn Washington,\n  the battle over the war heated up. Sen. John McCain went after two of his\n  colleagues for voting against the Iraq war spending resolution and\n  the spat – which mostly took place in a flurry of press releases\n  – devolved into a dispute over spelling. Jim Axelrod will have the\n  details. \n \nPacking up and getting out: that’s what tens\n  of millions of Americans are doing for this Memorial Day weekend. It’s\n  the unofficial start of summer, and an estimated 38 million people will be\n  hitting the road and the airports. Nancy Cordes will take a look at the\n  travel crunch.\n \nWith gas prices hitting a nationwide average of\n  $3.23 per gallon, holiday travelers – and daily commuters – are\n  reconsidering how they get around. For many, the answer is to\n  “downsize.” Is America’s\n  appetite for huge vehicles really diminishing? Byron Pitts will have the\n  answer. \n \nAt the Indy 500, the cars are already small, but\n  this year they’re all making an environment-friendly change, Cynthia\n  Bowers will report.\n \nThe rescuers attempting to steer California’s wayward whales in the\n  right direction to lead them out to sea have stopped with the whale calls;\n  they’ve given up on banging pipes underwater. Now they’re\n  bringing out the fire hoses to help. John Blackstone will explain.\n \nFinally, the story of a boy who rescued himself.\n  Faced with a learning disability and then sudden poverty and homelessness, Daniel Lazzatti got himself to school\n  every day, worked a night job and now is graduating high school. In this\n  week’s Assignment America, Steve Hartman will tell you what other great\n  things may be awaiting Daniel.\n \nHave a great Memorial Day weekend!\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}