{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\nPerformance \n\t\t\tBenchmarking For Energy Utilities\nSeattle, WA\n            May 23-24, 2007\n\nPandemic \n\t\t\tPreparedness For Utilities\nSeattle, WA\n            May 23-24, 2007\n\n\nCapacity \n\t\t\tMarkets\n\n\t\t\tWashington, DC\n\nJune \n4-6, 2007\n\nCoal-to-Liquids \n\t\t\tFinance and Development Summit\n\n\t\t\tNew York, NY\n\nJune \n4-6, 2007\n\n\nStrategies for \n\t\t\tBidding Ancillary Services in LMP Markets\n\nIndianapolis, IN\n\nJune 6-7, 2007\n\n\nIntro to Electric \n\t\t\tUtility Systems for Non Engineers\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nDistributed \n\t\t\tEnergy Resources-Emerging Business Models for Utilities\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for May 30, 2007  \n\n\n\nFirst Enercast Featured Articles for May 30, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories  \n\n\nMay 30, 2007 PowerMarketers Industry Publications\n\n\n\nCondoleezza Rice's Energy Guy (EnergyBiz Insider - May 30, 2007)\n\n\n\nEnergyBiz Insider - May 30, 2007 - One floor under U.S. Secretary of State Condoleezza Rice's top-level suite at the State Department sits a sparsely furnished office taken over by Gregory Manuel at the beginning of the year.    \n\n\nMay 30, 2007 PowerMarketers Industry Publications\n\n\n\nThe Expanding Business Case for Remote Connect/Disconnect (UtiliPoint.com - May 30, 2007)\n\n\n\nUtiliPoint.com - May 30, 2007 - Remote connect/disconnect switches have traditionally been installed on only a small percentage of electric meters for customers who either were consistently late on paying their electric bill or that lived in an area where people moved more frequently, such as near a university.\n\n\nMay 30, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 30, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 30, 2007\n\n\nMay 30, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nUtility ruling benefits payers: IRS would let customers get money from sale\n\n\n\nMay 30--We Energies customers could receive at least $70 million more from the sale of Point Beach nuclear power plant as a result of a ruling by the Internal Revenue Service.  The agency agreed to let We Energies and FPL Energy Inc. change the terms of the nearly $1 billion transaction that they hope to complete this summer. The changes would reduce the price paid by FPL but increase the money ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nElectric utility may give green option: Renewable energy plan carries fee at FirstEnergy\n\n\n\nMay 30--FirstEnergy Corp. customers who are willing to pay a premium to be environmentally friendly might have the opportunity by early summer. FirstEnergy, the Ohio Consumers' Counsel and staff of the Public Utilities Commission of Ohio worked together on the proposed \"Green Pricing Option,\" which still needs PUCO approval. If approved, FirstEnergy customers would be able to pay an extra ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nConsumers Energy buys Zeeland power plant\n\n\n\nMay 29--Consumers Energy said it agreed to purchase the Zeeland power plant from LS Power Group for $517 million.  Jackson-based Consumers Energy, a unit of CMS Energy, said it plans to complete the purchase of the 946-megawatt natural gas-fired power plant sometime in 2008. Consumers Energy has 1.8 million electric customers throughout Michigan's Lower Peninsula.\n\n\nMay 29, 2007 Knight Ridder Tribune Business News\n\n\n\nAnchorage Daily News, Alaska, Inside Alaska business column\n\n\n\nMay 30--MERMAID IMPORTS  Retailer moves from Dimond Center Mermaid Imports and Designs has moved from the Dimond Center to 209 W. Dimond Blvd., across from the Costco store. Mermaid features exotic stones and jewelry, clothing, belly dancing costumes, incense, candles, garden statuary, home furnishings and more. The phone number, 349-1170, has not changed. SEMCO Stockholders may sell Enstar ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nEMS response slowed by old maps\n\n\n\nMay 30--Bob McDonnell could hear the ambulance sirens fading in and out as he and his neighbor Leslie Kirrane performed CPR on his 10-month-old daughter, Brinn.  Brinn had suddenly stopped breathing that Sunday, April 8. McDonnell's brother-in-law called 911 while he, his wife Heather and Leslie rushed to try to revive the baby. Leslie's husband Brian also dialed 911.\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nTXU shares bounce back\n\n\n\nMay 30--TXU stock moved to its best close since late February as the utility's pending $45 billion buyout appeared more likely after the Texas Legislature adjourned without taking significant action that could have threatened the deal. The Dallas-based company's stock (ticker: TXU) finished trading Tuesday at $68.04, up 23 cents, the highest since an investment group announced its $69.25-a-share ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\n500 customers lose power\n\n\n\nMay 30--Power was out for about an hour to 500 Xcel Energy Co. customers in central Greeley on Tuesday due to an underground cable being severed by a contractor. About three of those customers were without power for three hours, said Ethnie Groves, Xcel spokeswoman.  The power went out at about 10:30 a.m., Groves said. The area hit by the outage was between 26th and 35th avenues and 10th and 16th ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nLawyers in Westar trial want off case: The attorneys for Spielas Lake say a freeze on their fees has led to a $3.3 million unpaid bill.\n\n\n\nMay 30--Saying they are owed nearly $3.3 million in legal fees and expenses, the attorneys for former Westar Energy executive Spielas Lake have moved to withdraw from his criminal case.  In a filing Tuesday in federal court in Topeka, the attorneys said the government's efforts to freeze the assets of Lake and his co-defendant, former Westar chief executive David Wittig, had left them no choice ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nCouple sue state to limit air pollution\n\n\n\nMay 30--TOPEKA -- With a permit pending on a massive coal-burning power plant in western Kansas, a Lawrence couple have filed a lawsuit demanding that the state limit carbon dioxide emissions.  \"The time to act is now,\" Sarah Dean, an environmentalist and appointee to the governor's Kansas Energy Council, said Tuesday. Dean and her husband, Ray, said carbon dioxide pollution from coal-fired ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nPower Authority shift spurs WNY hopes: But new chief plays down area links\n\n\n\nMay 30--The governing board of the State Power Authority hired an Amherst energy executive Tuesday as its chief operating officer.  The hiring of Roger B. Kelley marks the first time a Western New Yorker will run the authority since the Niagara Power Project, one of the nation's largest hydropower plants, was built a half-century ago. The hope is that Kelley will reform the New York Power ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nN.Y. electricity price drop slight when compared with other states: DEREGULATION\n\n\n\nMay 30--Deregulating New York's electricity markets has helped keep the state's power prices from rising by less than the inflation rate over the last 12 years, a study commissioned by a group of energy services firms found Tuesday.  The study found that residential electricity costs in New York dropped by 9.2 percent from their pre-deregulation peak in 1994 through last year, after adjusting for ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nTown of Union considers wind power ordinance\n\n\n\nMay 30--UNION TOWNSHIP  The attempt by Sean and Heather Brown to live an environmentally friendly lifestyle is putting pressure on Union Township officials. The Browns drive a Toyota hybrid car and have a geothermal heating system in their house. They want their next step to be generating their own electricity with a small wind turbine. The Browns want to put up a 6 kilowatt system at their home ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nSeattle Times Eastside Digest column: Fried critter may be Kirkland power outage culprit\n\n\n\nMay 30--Kirkland  About 1,600 Puget Sound Energy customers lost power Tuesday morning after a \"little critter\" climbed into an electrical substation at 683 Seventh Ave. N. and short-circuited the system, utility officials said. \"It was most likely a squirrel getting up in the equipment. When they crawl over [the wires], their hind legs stand on one part and their forelegs on another, and they can ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nFund established for Clinton Township family whose home exploded\n\n\n\nMay 29--A fund has been established for a Clinton Township family whose home exploded last week.  A natural gas leak, along with a lit candle, apparently sparked the blast early last Monday. Marcy Hill, 34, and her children Patricia Hill, 19, and Christopher Williams, 9, escaped and are recovering from their injuries. Their home on Scott, near Joy and Gratiot, was completely destroyed.\n\n\nMay 29, 2007 Knight Ridder Tribune Business News\n\n\n\nGood news for fish in Missouri: New license brings changes to Bagnell Dam sought by Department of Conservation.\n\n\n\nMay 29--Water flowing through and over Bagnell Dam from Lake of the Ozarks will be managed in ways more friendly to fish and shoreline conservation.  A 40-year license recently granted by the Federal Energy Regulatory Commission to AmerenUE, the St. Louis-based utility that owns Lake of the Ozarks, mandates several measures sought by the Missouri Department of Conservation.\n\n\nMay 29, 2007 Knight Ridder Tribune Business News\n\n\n\nWater districts' bills for power criticized: Federal tabs fall far short of retail rates in California, report says.\n\n\n\nMay 30--Farmers in the Westlands Water District are underpaying to the tune of $71 million annually on cheap electricity for federal water deliveries, says an environmental watchdog group.  The nonprofit Environmental Working Group in Oakland is expected today to release a report showing retail rates in California are 12 times higher than federal bills paid by Westlands and other districts. ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nEDITORIAL: New Youth Council making a difference\n\n\n\nMay 30--Wow! Those kids on Destin's new Youth Council are doing a great job. Did you read the article in Saturday's Log about the council's fi rst meeting? These kids are amazing. Already, they're contributing to the betterment of Destin. First, credit should go to the seven current city councilors for their wisdom in establishing the council. Specifically, it was Councilor Sam Seevers who ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nPoll: Triad still heart of N.C. manufacturing\n\n\n\nMay 30--GREENSBORO -- With 21 percent of the state's manufacturing, the Triad is the heart of North Carolina's manufacturingindustry. About 30 percent of the state's manufacturing is in the Charlotte area and 12 percent lies in the Triangle.  This and other revelations about the supposedly dying industry sector werebrought to light in the first annual Manufacturing Competitiveness Poll.\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nFANS EAGER TO GET WHIFF OF PRINCE: Rocker will release perfume, play hometown shows July 7 at Macy's, Target Center\n\n\n\nMay 30--July 7 looks like one lucky day for Prince fans. On that jackpot of a date -- 7/7/07 -- the Purple One will headline the Target Center, launch his perfume and play a special in-store performance for an audience of 1,400 at Macy's in downtown Minneapolis.  While both concerts are expected to sell out quickly, the Macy's gig has generated especially intense interest, as its tickets will ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nUtility ups its prices for repair\n\n\n\nMay 30--The hourly rate for appliance repair through Clark Public Utilities will go up June 1, following a unanimous vote of the utility's board of commissioners Tuesday.  Under the new rate schedule, customers will pay $100 for the first hour of service and $50 for each additional half-hour. The expiring rate schedule also charged $100 for the first hour of service but allowed customers to pay ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nFord sells hydropower to Canadian company\n\n\n\nMay 29--The Ford Motor Company officially began pulling the plug on its St. Paul truck plant on Tuesday, announcing that it had sold the company's hydropower generating facility to a Canadian firm.  Brookfield Power, with offices in Gatineau, Quebec, near Ottawa, was the winning bidder on the plant, which dates back to more than 80 years and was part of the reason Henry Ford built a factory in ...\n\n\nMay 29, 2007 Knight Ridder Tribune Business News\n\n\n\nEPA receives landfill plan for fire safety: Proposal suggests installation of synthetic liner over 88 acres\n\n\n\nMay 30--Placing a synthetic liner over a portion of a major landfill in southern Stark County is the best way to extinguish the underground fires there.  That's the conclusion of a 62-page fire-suppression plan submitted Friday to the Ohio Environmental Protection Agency and released Tuesday on the EPA's Web site. The plan was prepared for Republic Waste Services of Ohio for its Countywide ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nFeathered friend is no eagle!: If a Limestone fish hawk could talk, here's what she'd tell you\n\n\n\nMay 30--ATHENS -- If I had hands instead of wings, I would write a sign for my nest that said, \"No, I'm not a bald eagle.\"  I am not the symbol of America, even if I look like one at a distance. I'm an osprey, or what some folks call a fish hawk, and I'm about 10 inches smaller than an eagle. It's the white head that gets people every time. I know I get antsy around people.\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nSafety system fails at restarted Ferry Unit 1\n\n\n\nMay 30--A coolant pump failed during tests of Browns Ferry Unit 1 on Monday, forcing the Tennessee Valley Authority to halt ascension power tests aimed at hooking the restarted plant to the electric grid.  This is the second snafu TVA has reported to the Nuclear Regulatory Commission since TVA achieved a self-sustaining chain reaction in the reactor May 22. On May 24, a leak of non-radioactive ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nThe Riders' last line of defense\n\n\n\nMay 30--Grand Forks Red River coach William Olson offered a couple of analogies for his sophomore defender, Mudle Meagher.  \"She's the anchor of our defense,\" he said. And, \"She's the engine, so to speak.\" Whether she's acting as the anchor or an engine, Red River will rely heavily on Meagher when the Roughriders play Bismarck St. Mary's in the opening round of the North Dakota state girls soccer ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nCities to sit down with ethanol refinery developer\n\n\n\nMay 30--CHESAPEAKE -- Representatives for the developer of a proposed $500 million ethanol refinery will meet today with city officials from Chesapeake and Portsmouth.  Chesapeake Mayor Dalton Edge said he hopes the meeting with International Bio Energy Virginia LLC at Portsmouth City Hall will help to resolve traffic and fire-protection issues, as well as environmental concerns -- just some of ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nNuke plant safety system fails test\n\n\n\nMay 30--A safety system at the newly restarted Unit 1 reactor at TVA's Browns Ferry Nuclear Plant has failed an operational test, but the failure did not prompt a shutdown of the reactor.  The high-pressure coolant injection system, which is used to rapidly inject cooling water into the reactor core under certain conditions, was declared inoperable after a system test early Monday at the Athens, ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nAlaska's governor tops the approval rating charts\n\n\n\nMay 30--JUNEAU -- With the latest poll showing her approval rating at 89 percent, Gov. Sarah Palin may now be the most popular governor in the nation.  A recent public opinion poll taken by Ivan Moore Research showed both Republicans and Democrats in favor of the state's first female governor. The poll comes just two weeks after a separate poll taken by Dittman Research gave Palin a 93 percent ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nNuclear storage at Diablo Canyon said to be safe from terrorism: Diablo Canyon\n\n\n\nMay 30--The federal Nuclear Regulatory Commission has reaffirmed its original finding that an above-ground storage facility for highly radioactive nuclear waste at Diablo Canyon Power Plant is safe in the event of a terrorist attack. The preliminary decision means the agency does not intend to require that plant owners Pacific Gas and Electric Co. make any changes to the facility.\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nCorrections\n\n\n\nMay 30--Allison C. de Cerreno, the director of the NYU Rudin Center for Transportation Policy & Management, was quoted imprecisely in an amNewYork story in Newsday on May 22. In discussing the benefits of a planned Yankee Stadium Metro-North stop, she said the station fits in well with the city's plans \"of getting people off the roads and onto transit.\"  Because of incorrect information provided ...\n\n\nMay 30, 2007 Knight Ridder Tribune Business News\n\n\n\nVital step taken for pellet plant\n\n\n\nMay 29--An important step has been taken in the process of building a wood pellet plant near Cottondale.  The Jackson County Commission is now advertising for bids on paving, water and sewer line projects that will support the proposed Green Circle Bioenergy International plant. The company will cut down pine trees that are unsuitable as lumber and use them to make small wood pellets for the ...\n\n\nMay 29, 2007 Knight Ridder Tribune Business News\n\n\n\nUtilities develop new strategies: Power companies ready for hurricanes\n\n\n\nMay 29--Utility companies in South Mississippi have strengthened procedures and developed new strategies to reason with hurricane season.  After a hurricane -- no matter how large or small -- arguably the most critical resource is power. Without it, just about everything else shuts down and recovery efforts slow to a crawl. As a result, power suppliers are beefing up their maintenance schedules, ...\n\n\nMay 29, 2007 Knight Ridder Tribune Business News\n\n\n\nMercury to hit mid-90s by weekend\n\n\n\nMay 29--Go ahead and plant those tomatoes.  Record heat is expected this week, with temperatures hitting the mid-90s on Saturday and Sunday, according to forecasts from the National Weather Service. The warm weather will start building today, with highs reaching the upper 80s by Wednesday, said Spokane meteorologist Jeff Cote. The high Saturday is expected to be 94 -- 2 degrees warmer than the ...\n\n\nMay 29, 2007 Knight Ridder Tribune Business News\n\n\n\nObjection kills utility bill\n\n\n\nMay 29--AUSTIN -- Legislation that would have provided protections for low-income electricity customers and given regulators more tools to combat market abuses by power companies was killed for good late Monday, falling victim to a technical objection.  Senate Bill 482, by state Rep. Phil King, R-Weatherford, would have included new rules to protect low-income residents against disconnections and ...\n\n\nMay 29, 2007 Knight Ridder Tribune Business News\n\n\n\nTimeout is more than enough for Generals\n\n\n\nMay 29--NARUNA -- Chris Smith had something to say, and it couldn't wait. Smith, William Campbell's softball coach, called timeout in the sixth inning Monday, walked to the pitcher's circle and put his hands on Amber Marstin's shoulders. Then he made his sophomore pitcher laugh. \"I walked out there and said, 'I've never seen this grass as green as it is today,'\" Smith said after the Generals' ...\n\n\nMay 29, 2007 Knight Ridder Tribune Business News\n\n\n\nPower lines spark summer of discontent in area communities\n\n\n\nMay 29--This could be the summer of discontent for homeowners living along the 69-mile route of the power line upgrade project between Middletown and Norwalk. With work crews pushing to keep the project on schedule to be completed in the second half of 2009, the volume of complaints in places like Orange and Wallingford is attracting the attention of state lawmakers, Attorney General Richard ...\n\n\nMay 29, 2007 Knight Ridder Tribune Business News\n\n\n\nEDITORIAL: An electricity market?: Any 'deregulation' can't mean dirty power\n\n\n\nMay 29--The regulators at the Public Utilities Commission are poised to revisit California's spectacular failure at creating a private market for electricity. Caution is in order.  A bit of history for recent arrivals: The previous effort to create a market brought the state rolling blackouts and stratospheric prices. Now big consumers of electricity are looking to reduce their costs by buying ...\n\n\nMay 29, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nPlans for big new power line in Pa. worries those in its path\n\n\n\nEIGHTY FOUR, Pa. - The farmhouse Deb Bandel built with her husband in this southwest corner of Pennsylvania was meant to be a peaceful retreat from the bustle of the outside world. But a fixture of modern life may soon carve a path through their lush 60-acre property: a buzzing, crackling high-voltage power line. We built what we thought was the house we'd live in for the rest of our lives, said ...\n\n\nMay 29, 2007 York Daily Record\n\n\n\nAnswers anyone?\n\n\n\nIn 1984, the city of Tulsa supported the construction of a trash-to-energy plant because of a concern over the availability of adequate landfills. Over the years the trash-to-energy plant has been condemned as the most expensive approach to the problem of refuse. The contract for plant operation expires July 1. If the contract is not renewed, the plant probably will be closed.\n\n\nMay 29, 2007 Tulsa World\n\n\n\nBourne Energy Introduces New Utility-Scale Hydropower Technology\n\n\n\n-- California-based research and development company Bourne Energy has developed a novel hydropower technology that does not require a dam or reservoir to produce power. The RiverStar river power system is a 20-foot long self-contained energy module composed of a stabilizer, energy absorber, energy transmission and mooring system and energy conversion and control system designed to be sited ...\n\n\nMay 29, 2007 Industry Week\n\n\n\nIn Brief: Fed Ends Consent Pact with Citigroup\n\n\n\nThe Federal Reserve Board terminated a long-standing written agreement with Citigroup Inc. in which the New York company had consented to improve its risk-management practices after regulators examined its dealings with Enron Corp.  The Fed investigated the risk-management practices in Citi's credit and legal departments after Enron, the former Houston energy company, declared bankruptcy in ...\n\n\nDec 26, 2007 American Banker\n\n\n\nAriz.-Calif. power line vote nears\n\n\n\nAriz.-Calif. power line vote nears Regulators to decide on $581 mil plan to send energy generated here to neighboring state Jodie Snyder The Arizona Republic May. 29, 2007 12:00 AM The Arizona Corporation Commission is expected to vote Wednesday on a controversial plan to transmit energy generated in Arizona to power California homes and businesses. The proposed 231 miles of high-voltage lines ...\n\n\nMay 29, 2007 Arizona Republic\n\n\n\nChevron and Texas A&M Form Strategic Biofuels Research Alliance\n\n\n\n-- Chevron Corporation and the Texas A&M Agriculture and Engineering BioEnergy Alliance (Texas A&M BioEnergy Alliance) recently announced a strategic research agreement to accelerate the production and conversion of crops for manufacturing ethanol and other biofuels from cellulose. Cellulose is an energy-rich carbohydrate that is the main structural component of green plants, found in the stems, ...\n\n\nMay 29, 2007 Industry Week\n\n\n\nAES to sell biomass power plants for $51 million\n\n\n\n--  AES Corporation said its wholly-owned subsidiary AES Central Valley, L.L.C. has agreed to sell its 100 percent indirect interest in two biomass fired power plants in California (the 50 MW Delano facility and the 25 MW Mendota facility) and an associated biomass fuels management company to Covanta Holding Corporation for $51 million. The sale is subject to certain regulatory approvals and ...\n\n\nMay 29, 2007 Power Engineering\n\n\n\nPNM Resources to buy Houston-area plant\n\n\n\n-- PNM Resources said its joint venture with a unit of Cascade Investment, L.L.C., will acquire the CoGen Lyondell Power Generation Facility, a combined-cycle plant, from Dynegy for approximately $467.5 million. Based on the plant's winter rating of 614 MW, the purchase price equates to less than $800/kW, which the buyer said is 'consistent with new construction costs in the Houston Zone' of ...\n\n\nMay 29, 2007 Power Engineering\n\n\n\nFull-court press: States put pressure on Washington\n\n\n\nImagine Utahns heading north to go skiing. Parched grass crunching under your feet. Lake Powell as a puddle. Imagine turning on the faucet, and nothing coming out. It could happen, and in the not-too-distant future. Experts say global warming is a clear and present danger, and climate change could bring severe and extended drought, excessive heat waves, more wildfires, reduced snow packs and ...\n\n\nMay 29, 2007 Salt Lake Tribune\n\n\n\n\n\nKKR, TPG and TXU Announce a Total 15% Price Reduction\n\n\n\nOriginal price reduction increased and accelerated for customers  Reaffirm structural separation and no new debt on Oncor as a result of the transaction     DALLAS, May 29 /PRNewswire-FirstCall/ -- Texas Energy Future Holdings Limited Partnership (TEF) -- the holding company  formed by Kohlberg Kravis Roberts & Co. (KKR), Texas Pacific Group (TPG) and other ...\n\n\nMay 29, 2007 PR Newswire\n\n\n\nEntergy Files Compliance Plan for FERC System Agreement Order\n\n\n\nNEW ORLEANS, May 29 /PRNewswire-FirstCall/ -- Entergy's utility companies made a filing with the Federal Energy Regulatory Commission (FERC) today that contains the first payments and receipts necessary to comply with a FERC order to bring production costs of the utility companies into 'rough equalization.' In its 2005 order, the FERC found the System Agreement no longer roughly equalizes total ...\n\n\nMay 29, 2007 PR Newswire\n\n\n\nFirstEnergy To Offer Green Option To Its Ohio Utility Customers\n\n\n\nAKRON, Ohio, May 29 /PRNewswire-FirstCall/ -- A green option will be available to FirstEnergy's (NYSE: FE) Ohio utility customers under a proposed program filed today with the Public Utilities Commission of Ohio (PUCO). Customers interested in supporting renewable energy could do so through an added charge on their monthly electric bill beginning as early as this summer.\n\n\nMay 29, 2007 PR Newswire\n\n\n\nProgress Energy Carolinas Sets Goal of Doubling Efficiency Savings to 2,000 MW\n\n\n\nCompany announces deferral of potential construction for new nuclear plant    in N.C., proposes 2-year moratorium on new coal plants while pursuing aggressive conservation     RALEIGH, N.C., May 30 /PRNewswire-FirstCall/ -- With its service area expanding by 25,000 to 30,000 new homes and businesses each year, and facing increased costs  to ensure continued reliable ...\n\n\nMay 30, 2007 PR Newswire\n\n\n\nUranerz Energy Corporation: Environmental Permitting Update\n\n\n\nUranerz Energy Corporation (AMEX: URZ)(FRANKFURT: U9E) is pleased to announce that the environmental permitting efforts on its Nichols Ranch and Hank commercial in-situ recovery (\"ISR\") mining projects in Wyoming remain on track. These two properties are located in the Powder River Basin in the Pumpkin Buttes mining district where the first uranium mining in Wyoming started in 1951.\n\n\nMay 29, 2007 Internet Wire\n\n\n\nSherwood Reports Yukon Utilities Board Approves Revised Power Purchase Agreement\n\n\n\nSherwood Copper Corporation (TSX VENTURE: SWC)(TSX VENTURE: SWC.DB) reports that the Yukon Utilities Board (\"YUB\") has approved the amended power purchase agreement (\"PPA\") between Sherwood's wholly owned subsidiary Minto Explorations Ltd. (\"MintoEx\") and Yukon Energy Corporation (\"YEC\"). As a result, the high grade Minto copper-gold mine should have access to grid power by the end of 2008, ...\n\n\nMay 29, 2007 Internet Wire\n\n\n\nOpen Energy to Provide GreenSource Solutions With 29.81 kW Solar BIPV System for National Tropical Botanical Gardens, Hawaii\n\n\n\nOpen Energy Corp. (OTCBB: OEGY)  Open Energy Corp. (OTCBB: OEGY) today announced  the  signing  of  a  new  sales  agreement  with GreenSource Solutions, LLC for a 29.81 kW AC  Open  Energy  solar BIPV  system  for  the new, LEED Silver  certified,  Juliet  Rice Wichman   Botanical  Research  Center at  the  National  Tropical Botanical Gardens in Kalaheo, Kauai, Hawaii.\n\n\nMay 29, 2007 Internet Wire\n\n\n\nMidAmerican Energy Set to Begin Commercial Start-Up of $1.2 Billion Expansion Project at Council Bluffs\n\n\n\nResearched by Industrial Info Resources (Sugar  Researched by Industrial Info Resources (Sugar Land, Texas). MidAmerican Energy has completed construction and is currently in start-up testing for the $1.2 Billion 790-megawatt Unit 4 expansion project at the Council Bluffs Power Station located in Council Bluffs, Iowa.  For details, view the entire article by subscribing to Industrial Info's ...\n\n\nMay 30, 2007 Internet Wire\n\n\n\nEnvironmental Power Corporation Announces Signing of Project Agreements in Colorado and Idaho\n\n\n\nProjects are the first under Business Development Agreement with Cargill PORTSMOUTH, N.H., May 29 /PRNewswire-FirstCall/ -- Environmental Power Corporation (Amex: EPG) today announced the execution of two project option agreements by Microgy, Inc., a wholly owned subsidiary of Environmental Power Corporation, to build, own and operate Renewable Natural Gas (RNG(TM)) production facilities in ...\n\n\nMay 29, 2007 PR Newswire\n\n\n\nCalifornia ISO Discusses California Global Climate Change Regulations\n\n\n\nFOLSOM, Calif.--(BUSINESS WIRE)--The California Independent System Operator Corporation (California ISO) is hosting an environmental forum that will draw renewable power developers, environmentalists, utility officials, state agencies as well as national experts in the area of global warming, greenhouse gas (GHG) emissions and alternative energy. This is the first meeting of its kind hosted by ...\n\n\nMay 29, 2007 Business Wire\n\n\n\nBrookfield Power to Acquire and Build Hydroelectric Plants in Minnesota\n\n\n\nBrookfield Power announced today that it has signed an agreement with Ford Motor Company to acquire the Twin Cities hydroelectric facility in St. Paul, Minnesota for an undisclosed purchase price.  Brookfield Power announced today that it has signed an agreement with Ford Motor Company to acquire the Twin Cities hydroelectric facility in St. Paul, Minnesota for an undisclosed purchase price.\n\n\nMay 29, 2007 Internet Wire\n\n\n\nNew Solar Homes Outpace the Market\n\n\n\nSolar Homes with SunPower SunTile Selling at Twice the Pace of Standard Homes     SAN JOSE, Calif., May 30 /PRNewswire-FirstCall/ -- For eight communities in the Whitney Ranch residential development in Rocklin, Calif., outside Sacramento, an average of 1.9 homes have sold each  month since 2006. A ninth community, Grupe Homes' Carsten Crossings, stands out with ...\n\n\nMay 30, 2007 PR Newswire\n\n\n\nTitan Energy Worldwide, Inc. Hires James Fahrner as Chief Financial Officer and Vice President of Administration\n\n\n\nSAN DIEGO--(BUSINESS WIRE)--Titan Energy Worldwide, Inc. (OTCBB: TEWW) announced today it has hired James Fahrner as Chief Financial Officer and Vice President of Administration. Titan Energy Worldwide, Inc. manufactures the Sentry 5000 mobile utility system (www.titanenergydevelopment.com) and through its Stellar Energy Services subsidiary (www.stellarenergyservices.com) sells and services ...\n\n\nMay 29, 2007 Business Wire\n\n\n\nIntelligent Results Launches Enhanced Analytics Platform\n\n\n\nBELLEVUE, Wash.--(BUSINESS WIRE)--Intelligent Results, Inc., a leader in customer analytics and decision management solutions, and a subsidiary of First Data Corp. (NYSE: FDC), today announced the launch of PREDIGY\" 5.0. The PREDIGY 5.0 release includes innovations based on customer and partner needs, delivering three areas of expanded functionality: An industry-leading platform for partners to ...\n\n\nMay 29, 2007 Business Wire\n\n\n\nCytec Industries Inc. Appoints New CFO\n\n\n\nWEST PATERSON, N.J.--(BUSINESS WIRE)--Cytec Industries Inc. today announced that David M. Drillock has been elected Chief Financial Officer. Additionally, Mr. Drillock was named a member of Cytecs four person Executive Committee. Mr. Drillock began his career with American Cyanamid Company in 1978 where he held a number of progressively more responsible financial positions.\n\n\nMay 29, 2007 Business Wire\n\n\n\nFacing Chronic Power Shortfalls Pakistan Opens Door to Foreign Investment\n\n\n\nResearched by Industrial Info  Researched by Industrial Info Resources (Sugar Land, Texas). Private sector and foreign investors are invited to set up power plants in Pakistan to help the country close its energy gap. This was said by the country's president General Pervez Musharraf towards the end of May at the foundation laying of a $200 million combined-cycle power plant at Daharki, north of ...\n\n\nMay 29, 2007 Internet Wire\n\n\n\nIBM Helps Retailers 'Go Green'\n\n\n\nThe IBM (NYSE: IBM) Retail Store Solutions  The IBM (NYSE: IBM) Retail Store Solutions (RSS) group today outlined its Retail Green Initiative, designed to help its retail clients to meet their ecological goals and those of their customers with conservation-oriented technology solutions.  The Retail Green Initiative is focused on educating IBM's retail clients on the environmentally responsible ...\n\n\nMay 30, 2007 Internet Wire\n\n\n\nAlternate Energy Holdings (AEHI) to Be Featured on \"21st Century Business\"\n\n\n\nAlternate Energy Holdings (PINKSHEETS: AEHI)  Alternate Energy Holdings (PINKSHEETS: AEHI) announced that Alexander Haig, host of the award-winning and internationally acclaimed television show \"21st Century Business,\" has selected AEHI to be featured on the program.  The segment will be filmed in June 2007 and aired July/August 2007 on CNBC.  Focus will be on the company's unique position and ...\n\n\nMay 30, 2007 Internet Wire\n\n\n\nPureSpectrum, Inc. Developing Technology to Improve Half-Bridge Ballast Performance\n\n\n\nSAVANNAH, Ga., May 30 /PRNewswire-FirstCall/ -- Engineers from PureSpectrum, Inc. (Pink Sheets: PSPM) have developed a circuitry modification which could change the performance and popularity of Compact Fluorescent Light (CFL) bulbs. In response to feedback received during meetings with major lighting manufacturers which took place during Lightfair International in May, PureSpectrum plans to ...\n\n\nMay 30, 2007 PR Newswire\n\n\n\n\n\nSherwood Reports Yukon Utilities Board Approves Revised Power Purchase Agreement\n\n\n\n-- Sherwood Copper Corporation (CDNX:SWC.V - News)(CDNX:SWC-DB.V - News) reports that the Yukon Utilities Board ('YUB') has approved the amended power purchase agreement ('PPA') between Sherwood's wholly owned subsidiary Minto Explorations Ltd. ('MintoEx') and Yukon Energy Corporation ('YEC'). As a result, the high grade Minto copper-gold mine should have access to grid power by the end of 2008, ...\n\n\nMay 29, 2007 Yahoo!\n\n\n\nFlorida Power & Light Pushing State Regulators Hard for Glades Coal Plant\n\n\n\nTALLAHASSEE, Fla. (AP) - Florida Power & Light is urging state utility regulators to let it go forward with a proposed coal-fueled power plant in Glades County to help it meet demand and move away from its reliance on natural gas. But the plant has been strongly opposed by environmentalists, despite claims from FPL that it will be built using the latest clean-coal technology.\n\n\nMay 29, 2007 Canadian Business Magazine\n\n\n\nReliant Energy Executive Vice President Jerry J. Langdon Exercises Shares for 168,300 Shares\n\n\n\nWASHINGTON (AP) - The executive vice president of public and regulatory affairs of electricity provider Reliant Energy Inc. exercised options for 168,300 shares of common stock, according to a Securities and Exchange Commission filing. In a Form 4 filed Friday with the SEC, Jerry J. Langdon reported he exercised the options Wednesday for $6.58 and $8.14 apiece and then sold all 168,300 shares on ...\n\n\nMay 29, 2007 Canadian Business Magazine\n\n\n\nUtilities, Insurers Say They're Better Prepared for Hurricane Season\n\n\n\nForecasts for a busier-than-normal hurricane season mean added pressure on the utility and insurance industries, but they say they're more prepared to absorb a catastrophic hit. Power utilities have invested in hardier equipment to better withstand storms, gas utilities have formed a resource-sharing plan that quickly sends reinforcements, and insurers have more cushion to absorb losses after ...\n\n\nMay 29, 2007 Insurance Journal\n\n\n\nNREL Updates National Solar Radiation Database\n\n\n\nGolden, CO - The Department of Energy's (DOE) National Renewable Energy Laboratory (NREL) and collaborators have updated the National Solar Radiation Database, a planning tool that provides critical information about the amount of solar energy that is available at any given location. The database is widely used by solar system designers, building architects and engineers, renewable energy ...\n\n\nMay 29, 2007 Power Online\n\n\n\nPNM Resources Venture With Bill Gates' Investment Firm Buys Dynegy Plant in Texas for $467.5M\n\n\n\nALBUQUERQUE, N.M. (AP) - Southwest electric utility PNM Resources Inc. said Tuesday that its EnergyCo joint venture would buy a power plant in suburban Houston from Dynegy Inc. for about $467.5 million in cash. PNM Resources called its purchase of the CoGen Lyondell plant consistent with its plan to pursue opportunities in the unregulated energy sector through EnergyCo, which it founded in ...\n\n\nMay 29, 2007 Canadian Business Magazine\n\n\n\nState House Weighs Electric Rate Freeze Again\n\n\n\nNew Plan Would Evaluate Utility Regulation Policies SLIDESHOW: The Graduates: CBS 2 Anchors And Reporters SLIDESHOW: It's In To Be Out: Openly Gay Celebrities VIEWER PHOTOS: Cicada Invasion (AP) SPRINGFIELD, Ill. State lawmakers are advancing another try at freezing electric rates, this time with long-term decisions about how Illinois regulates electric utilities.\n\n\nMay 30, 2007 CBS 2 Chicago\n\n\n\nGovernment expecting higher revenues from excise tax change\n\n\n\nChanges to the excise tax law are expected to generate PLN 1.7 bln in additional revenues in 2008, and PLN 2.6 bln in 2009, according to a draft bill prepared by the Finance Ministry. '[A]dditional budget revenues resulting from proposed solutions may stand at PLN 1.7 bln in 2008 and at PLN 2.6 bln in 2009,' the Ministry wrote, but added that actual revenues will depend on excise tax rates.\n\n\nMay 29, 2007 Warsaw Voice\n\n\n\nOveroptimistic\n\n\n\nSome of the numbers used in your article seem a little optimistic, Power use during cold front bodes ill for winter supply (May 23). It used to take about eight years to build a 3600MW conventional coal- fired power plant at a greenfield site. Now its only about three for a 4800MW plant! Even with computers, improvements in civil and building work, and manufacturing methods, this seems a little ...\n\n\nMay 29, 2007 Business Day\n\n\n\nDynegy sells plant to PNM-Cascade venture for $470 mil\n\n\n\nMerchant generator Dynegy Tuesday said it had reached a deal to sell its CoGen Lyondell Power Generation Facility in Channelview, Texas, to EnergyCo, a joint venture between PNM Resources and a subsidiary of Cascade Investment, for roughly $470 million in cash. Dynegy said the sale of the facility is expected to result in a collateral reduction of approximately $20 million in letters of credit ...\n\n\nMay 29, 2007 Platts\n\n\n\nCompromise electric utility bill fails to pass Texas Legislature\n\n\n\nIn a last-minute turnaround, a compromise Texas bill that would have reduced some retail electricity rates and subjected future utility acquisitions to tougher regulatory scrutiny was killed by a parliamentary maneuver as the 2007 session of the state legislature drew to a close late Monday night. Conferees from the Texas House and Senate Thursday agreed on a compromise version of a bill (S.B. ...\n\n\nMay 29, 2007 Platts\n\n\n\nAustria OKs Eur500 million climate fund for 2007-2010\n\n\n\nThe environmental committee of the Austrian government has approved an Eur500 million ($674 million) climate fund for 2007-2010 to support research and development of green technologies and projects, the Austrian environment ministry said Thursday. The fund will manage subsidies and allocate tenders to support initiatives of climate protection and sustainable energy supply.\n\n\nMay 29, 2007 Platts\n\n\n\nEditorial: An electricity market?\n\n\n\nThe regulators at the Public Utilities Commission are poised to revisit California's spectacular failure at creating a private market for electricity. Caution is in order.A bit of history for recent arrivals: The previous effort to create a market brought the state rolling blackouts and stratospheric prices. Now big consumers of electricity are looking to reduce their costs by buying power on the ...\n\n\nMay 29, 2007 Sacramento Bee\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nNew Report Provides A Comprehensive Overview of the Italian Energy Market\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c58134) has announced the addition of Italy Energy Market Flow by Fuel Report to their offering. The Italy overview report can help you to quickly understand the country's energy market from a commercial perspective. This report provides detailed information, charts and tables on various types of ...\n\n\nMay 29, 2007 Business Wire\n\n\n\nEDF to build Belgium's first offshore wind farm\n\n\n\n- EDF Energies Nouvelles, together with its partners in the C-Power consortium, is building Belgium's first offshore wind farm at Thornton Bank, 25 km off the country's coast. The 153m ($206m) first phase of the initiative will have a capacity of 30MW. EDF Energies Nouvelles, the renewable energy arm of French utility EDF, has a 20.8 per cent interest in C-Power.\n\n\nMay 29, 2007 Power Engineering\n\n\n\nAshmore Energy International (AEI) Agrees to Acquire Shell's interests in AEI and Shell Joint-Venture Businesses in Brazil and Bolivia\n\n\n\nHOUSTON--(BUSINESS WIRE)--Ashmore Energy International (AEI) announced today an agreement for the acquisition of Shells interests in the AEI and Shell joint-venture businesses in Brazil and Bolivia. The transaction is pending regulatory approvals and consents, and the assets involved include: Cuiab Integrated Project (AEIs share to increase from 50% to 100%), comprising: -- EPE - Empresa ...\n\n\nMay 29, 2007 Business Wire\n\n\n\nWall Street News Alert: HMSO, Wednesday's Hot Stock to Watch! May 30, 2007\n\n\n\nWall Street News Alert's \"stocks to watch\" this  Wall Street News Alert's \"stocks to watch\" this morning are: Hemis Corporation (OTCBB: HMSO), IAMGOLD Corporation (NYSE: IAG), Kinross Gold Corp. (NYSE: KGC) and Newmont Mining Corporation (NYSE: NEM).  There is more exciting news out of Hemis Corporation (OTCBB: HMSO) for investors. The company, an international resource company with several ...\n\n\nMay 30, 2007 Internet Wire\n\n\n\nIndia Tries to Balance Coal Supply With Power Hunger, an Industrial Info News Alert\n\n\n\nResearched by Industrial Info  Researched by Industrial Info Resources (Sugar Land, Texas). At a time when India's coal rich states are demanding cheaper electricity and other incentives from government in the form of tariff-based competitive bidding for power from new power plants to be reserved for them, the Central Electrical Authority (CEA) is pegging the coal requirements of power utilities ...\n\n\nMay 30, 2007 Internet Wire\n\n\n\nAES Expands Wind Generation Operations to 1,000 MW in the US\n\n\n\nARLINGTON, Va.--(BUSINESS WIRE)--The AES Corporation (NYSE:AES) today announced that it is expanding its wind generation business in the US through the acquisition of two wind farm projects totaling 186 MW from GE Energy Financial Services, a unit of General Electric. Financial terms of the transaction were not disclosed. With the addition of these two wind farms, AES will have more than 1,000 MW ...\n\n\nMay 30, 2007 Business Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}