{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Michael Whapples <mwhapples@aim.com>", "subject": "Re: pdf,  javascript, and flash was Re: hello", "body": "While I think things like javascript, flash PDF and some other\ntechnologies are use inappropriately, I think certain ones, thinking of\nPDF in particular here, do have there place.\n\nExtending on what I mean about PDF, if the full specifications were\nfollowed properly, and usually this is not done, the situation regarding\nPDF should be alot better than it is for us. Unfortunately, software,\nboth the readers and the writers don't follow this wonderfully, and for\nthe creating software, if it doesn't follow the specification properly\nthen no matter how good the reader is the output won't be good (how many\ncases can you think of finding untagged PDF), but in most cases the\nreader isn't realyy up to it fully either. As I understand it, PDF and\npost script is aimed at printing (or the layout), so yes it can be\nappropriate to post PDF on the internet if you expect the user to print\nit off, but if there is expected online viewing, then there are\ncertainly more appropriate formats for that (I am thinking of those\nscientific papers I would have found useful for my physics that were\nonline in PDF although mathml is more accessible).\n\nWhile technology has done alot for me, I do get concerned by various\ndevelopments and if theyh are going to create more problems than they\nwill solve (in my case), eg.e-books and all the security they are\nbuilding in to prevent users doing anything to it, how will this impact\non my ability to convert it to a format suitable for me, javascript on\nwebsites (particularly when not needed, sometimes even used when a link\nwould do the same), etc.\n\nFrom\nMichael Whapples\nOn Sat, 2007-06-16 at 13:10 -0500, Spie Sutherland wrote:\n> Javascript really is a bad idea as Chris stated, and so is flash.\n> Both can be opening connections to anywhere without your\n> knowledge. They are not secure, period. Many sites will not\n> work properly with browsers like links even though they have\n> javascript support. \n> \n> The adobe situation is far worse. It is becoming an entirely \n> different platform on its own. Its almost like windows, in fact\n> it is competition to windows, it's a challenge to own desktop.\n> Look what google does, it can convert pdf to html but NOT \n> text, its graphical. Its a total mess. It's huge software and is\n> buggy.\n> \n> I could go on and on about these three evil bits of software.\n> \n> But fundamentally they all assume I am on a PC, also on \n> windows, and desktop windows. This is not my idea of \n> information being free. The future does not lie in PCs. It \n> will be portable devices. None of them handle these types\n> of \"pages\" properly. Web sites should be standardized in \n> such a way that they are not form fit for PCs. There are \n> some that support mini version pages like WAP format\n> but that's pretty lame. The information should be just \n> information, and the protocols should be standard and \n> generic such that ANY device or process can read them\n> and re-format them any way necessary. This will never \n> happen with javascript, flash, or pdf.\n> \n> All of the above are really used because of the silly need\n> to make the web more like TV than information, with \n> all kinds of dizzying adverts, and the use of them is usually \n> ONLY to make the site look pretty. Wrong reasons to \n> diverge from the original idea, that there should be a set\n> of standards that are globally accessible.\n> \n> I believe in accessibility beyond just for what most \n> people think, it should allow not only different devices\n> or browsers, it shoul allow different modalities. The \n> CONTROLS in particular should not assume that \n> there is keyboard and mouse. Some very serious work\n> needs to be done in accessibility standards, and it's \n> not headed in the right direction.\n> \n>   -- Spie\n> \n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}