{"category": "ham", "to_address": "<r-help@stat.math.ethz.ch>", "from_address": "\"Eric Peterson\" <peterson@heritage.nv.gov>", "subject": "[R] GAM for censored data? (survival analysis)", "body": "First let me admit that I am no statistician... rather, an ecologist with\njust enough statistical knowledge to be dangerous.\n \nI've got a dataset with percent ground cover values for species and other\nentities.  The data are left censored at zero, in that percent ground cover\ncannot be negative.  (My data rarely reach 100% cover so I haven't bothered\nwith adding a right censoring at 100).  I've done some previous analyses\nusing survival analysis methods to create a predictive model for an entity\nof particular interest... library(\"survival\"); survreg(Surv(Y) ~ X).\n \nHowever, I know my data do not really match linear modeling and would like\nto work with some alternate methods, one of which is GAM.  I noticed that\nYee and Mitchell (1991, p.589) stated that GAM is appropriate for \"certain\ntypes of survival data\".  How do I implement a survival data model in GAM\nwith R?  I've searched both R help and the R site search, but not found\nanything relevant.  \n \nWould it be as simple as library(\"survival\"); library(\"mgcv\"); gam(Surv(Y) ~\nX)  ???\n \nWhile I have your attention, I have a related second question.  I'd like to\nmodel one entity (percent ground cover) as a function of another (also\npercent ground cover).  Is there any way to deal with a censored predictor\nvariable as well as the censored response?\n \nCitation: Yee, T. W. & N. D. Mitchell.  1991.  Generalized additive models\nin plant ecology.  Journal of Vegetation Science 2: 587-602.\n \nThanks,\n-Eric Peterson\nVegetation Ecologist\nNevada Natural Heritage Program\n\n\t[[alternative HTML version deleted]]\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}