{"category": "ham", "to_address": "Graham Wideman <gwlist@grahamwideman.com>", "from_address": "Duncan Murdoch <murdoch@stats.uwo.ca>", "subject": "Re: [R] Concepts question: environment, frame, search path", "body": "On 01/05/2007 12:29 AM, Graham Wideman wrote:\n> Folks:\n> \n> I'd appreciate if someone could straighten me out on a few concepts which \n> are described a bit ambiguously in the docs.\n> \n> 1.  data.frame:\n> ----------------\n> Refan p84: 'A data frame is a list of variables of the same length with \n> unique row names, given class \"data.frame\".'\n> \n> I probably don't need to point out how opaque that is!\n\nWhich manual are you looking at?  The \"reference index\" (refman.pdf)? It \ndoesn't usually include statements like that; they are usually found in \nthe Introduction to R (R-intro.pdf) or the R Language Definition \n(R-lang.pdf).  But since the refman is just a collection of man pages, \nit might be in there somewhere.  And since the manuals do get updated, \nthat statement may not be present in the current release.  (I did a \nquick search of the source, and couldn't spot it, but my search might \nhave failed because of line breaks, strange formatting, or looking in \nthe wrong place.)\n\nBy the way, it's generally best to cite the section name where you found \na quote, because the pagination varies from system to system.  Even \nbetter would be to give a URL to the online HTML version at \nhttp://cran.r-project.org/manuals.html.\n\nFor future reference, if you are suggesting a change, it's best to cite \nthe line number in the source at \nhttps://svn.r-project.org/R/trunk/doc/manual in the *.texi files or \nhttps://svn.r-project.org/R/trunk/src/library/*/man/*.Rd for man pages, \nand send such suggestions to the R-devel list.\n\n> Anyhow, key question: Some places in the docs seem pretty firm that a \n> data.frame is basically a 2-D array with:\n> a) named rows and\n> b) columns whose items within a column be of uniform data type.\n> \n> Elsewhere, it seems like a data.frame can be a collection of arbitrary \n> variables.\n\nThe former interpretation is correct.  Since the variables all have the \nsame length, things like df[i, j] make sense:  they choose the i'th \nentry from the j'th variable (according to the \"refan\" definition), or \nthe i'th row, j'th column (according to the 2-D array interpretation.\n> \n> 2. environment\n> ---------------\n> Refman p122:  \"Environments consist of a frame, or collection of named \n> objects, and a pointer to an enclosing environment.\"\n> \n> Is the \"or\" here explaining parenthetically that a frame is a collection of \n> named objects, or is separating too alternative structures for an \n> environment?\n\nThe former.\n> \n> If the former, does this imply that a frame can contain arbitrary variables?\n\nYes, but a frame isn't an R object, it's a concept that appears in \ndescriptions, e.g. part of an environment, or the local variables \ncreated during function evaluation, etc.\n> \n> And \"pointer\"? Is that a type of thing in R?\n\nNo, there are no pointers in R.  There are a couple of tricks to fake \nthem (e.g. environment objects aren't copied when assigned, you just get \na new reference to the same environment; this allows you to construct \nsomething like a pointer by wrapping an object in an environment), but I \ndon't recommend using these routinely.\n\n> \n> 3.  R search path; attach()\n> ----------------------------\n> The R search path appears to hold the list of \"collections of data\" (my \n> term) that can be accessed by a users' commands. Refman p27 tells that \n> search path can hold items that are data.frame, list, environment or R data \n> file (on disk).  Yet R-intro p28 describes attach() as taking a \"directory \n> name\" argument.  What is the concept \"directory\" in this context?\n\nI haven't read the preceding pages carefully, but that looks like an \nerror.  The usual argument to attach is a package name, and what gets \nattached is an environment holding the exports from the package. \nPackages are stored in directories in the file system, so maybe that's \nwhat the author of that line had in mind.\n\nDuncan Murdoch\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}