{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Bloomberg: Brazil to Break Patent on Merck's Efavirenz AIDS Drug", "body": "Brazil to Break Patent on Merck's Efavirenz AIDS Drug\n\nBy Katia Cortes\n\nMay 3 (Bloomberg) -- Brazilian President Luiz Inacio Lula da Silva is\nset to break the patent on Merck & Co's AIDS drug Efavirenz after the\ncompany's offer to cut prices failed to satisfy demands from the\ncountry's health ministry.\n\nLula is scheduled to sign an act tomorrow at 11 a.m. New York time that\nwill allow the government to purchase the generic version of the drug\nfrom laboratories certified by the World Health Organization, the\npresident's office said.\n\nThe decree would mark the first time Brazil by-passed a patent since\nthe country began recognizing patented drugs in 1996, said Michel\nLotrowska, Brazil representative of the access campaign for essential\nmedicines at Doctors Without Borders. The government is pushing for\nlower drug prices to cut costs for the free treatment offered all\n200,000 people in the country infected with AIDS and the HIV virus that\ncauses the disease, he said.\n\nMerck, the third-largest U.S. drugmaker, offered to cut the price of\nthe drug to the government by 30 percent to $1.10 a pill from $1.59.\nThe government said the company must cut the price to 65 U.S. cents a\npill, the same price paid by Thailand.\n\nMerck is ``disappointed'' by the decision and believes the offer of a\n30 percent cut was ``fair,'' spokeswoman Amy Rose said in an e-mailed\nstatement. The company remains open to further negotiations, she added.\n\nLast week, Lula declared the medication ``of public interest.'' The\ndeclaration gives the president power to issue a compulsory license for\nthree years and allows the government to purchase the generic version\nof Efavirenz from laboratories certified by the World Health\nOrganization. All three of the labs are in India.\n\nBrazil will save $30 million this year from $42.9 million it would pay\nto Merck and will save $237 million until 2012, when the patent right\nwould expire, the health ministry said.\n\nTo contact the reporter on this story: Katia Cortes in Brasilia at at\nkcortes@bloomberg.net\nLast Updated: May 3, 2007 20:32 EDT\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}