{"category": "spam", "to_address": "avcooper@speedy.uwaterloo.ca", "from_address": "\"Zachariah Davila\" <kupjpnrehf@xyz.com.tw>", "subject": "Post your ads where people read them", "body": "\n\n\nFeed Blaster puts your ad right to the screens of millions in 15 Minutes !\nI'm not pulling your leg! \nDiscover the new way of advertising on the Internet! This Tool is one of the hottest - if not the hottest - marketing tools available! \nDiscover the power of the Feed Blaster!\nBrand new software revolutionizes the power of online advertising -never seen before!-\nBRAND NEW FOR 2007\nClick here and visit my website\nDate: From: Sebastian Foss Subject: How would you like to put your ad right to the screens of millions in minutes? \nHi, my name is Sebastian Foss. Are you like me? Frustrated by the lack of traffic coming to your Site ?After all, how many times a day are you BOMBARDED with some lame \"get-traffic\" scheme on the Internet? \nWell, I've got great news for you. \nOne day I had an idea. An amazing idea actually.\nFirst off, let me tell you what feeds are!Think of it as a distributable \"What's New\" for your site. The number of web sites offering news & information using feeds is exploding! A feed is a regularly updated summary of web content, along with links to full versions of that content. When you subscribe to a given website's feed by \r\nusing a feed reader, you'll receive a summary of new content from that website right on your screen or in a software feed reader. Many websites are using feeds to publish their latest information right to thousands of users within minutes. Soon everyone will be using them. This makes feeds the ideal place to advertise.\nClick here and visit my website\nMore and more people are subscribing to feeds every day and there are millions who are already subscribed. Thus, your ad will reach a very broad range of potential customers with each use of Feed Blaster! \nFeed Blaster is the first & only submitter that can submit your ads to thousands of feeds within a few minutes! \nPost your ads where people read them!\n- What if you could place your ad into all these feeds ?\nRight, that would mean you would have millions of sites linking to your ad - and millions of users reading your message within minutes - and my idea actually works.\nI have developed a software that automatically places your ad into thousands of feeds.\nYou will receive thousands of targeted hits to your website as Feed Blaster places your ad into feeds that match your ad's category.\nThis method has never been released to the public before. Very few, if anyone has implemented this.\nHere are the results of a click tracker that I used (it counts each click in an ad) for tracking results for feed blaster:\n(I received more than 5800 clicks on my ad within a few days after using Feed Blaster!) \nClick here and visit my website\nSo, How Does This Work? ------------------------\nIt's simple and takes just 15 minutes to complete.\nUsing my automated program I have developed, just insert your ad......choose your ad's category... ...have Feed Blaster post your ad to thousands of feeds - your are only minutes away from receiving a steady flow of traffic to your website! \nFeatures of Feed Blaster -----------------------\n-Feed Blaster automatically posts your ad to thousands of feeds - your ad will be right on the screens of millions within 15 Minutes! -Be among the first to use this brand new method of online advertising and dominate the web with your ads! -Feed Blaster will automatically create thousands of links to your website - which will rank your website in a top 10 position! \r\n-Receive hundreds of targeted hits to your website every day from the links in the feeds! -Post your ads where people read them!-The software is not complicated - it's as easy as 1,2 - 3 -No matter if you are a professional advertiser or new to online advertising - Feed Blaster is suitable for everyone. -You can use Feed Blaster for as many ads as you like - no limitations! -You do NOT have to pay monthly fees to use Feed Blaster - pay once and use it forever! \r\n-Your ads stay visible for a long time - daily submissions are not required! -I personally guarantee that if the software does not increase your website's traffic you will receive a full refund! There is absolutely NO RISK! -Advertising using Feed Blaster is 100% SPAM FREE advertising! You will never be accused of spamming. Your ads are submitted to feeds whose owners have agreed them.\r\n-24/7 Support for our customers! You will even receive my personal email address so I can assist you. \nThis idea, method & software are unique and have never been released before - be among the first to use this brand new method of online advertising and dominate the web with your ads! \nClick here and visit my website\n \nUnsubscribe by sending email\nUnsubscribe by remove form"}