{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: The Massacre", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nCitizen \n      Journalists, Dangerous SettingsOne of the most striking \n      moments in the television coverage of the Virginia Tech massacre came \n      early in the day yesterday, when CNN aired cell phone footage from Tech \n      student Jamal Albarghouti. As the Albarghouti video \n      illustrates, ordinary citizens can have real incentives to get compelling \n      material of dangerous situations and send them to news outlets. But will \n      they always make the right determination when it comes to keeping \n      themselves safe? [+ Read More]\n\nToo \n      Soon For Blame And \n      Debate?The debate over gun control, and the assigning of blame forthe handling of the situation, has already begun in the wake of theVirginia Tech tragedy. That happened awfully fast: We just \n      learned the identity of the suspect, and investigators are still trying to \n      piece together what happened. I understand reporters' desire to push \n      forward the story, but won't we have plenty of time in the future \n      to debate gun control and assign blame? [+ Read More]\n\nAAJA \n      Says To Avoid Racial Identifiers In Virginia Tech \n      CoverageThe Asian American Journalist \n      Association is calling on news outlets \"to avoid using racial \n      identifiers unless there is a compelling or germane reason\" when \n      identifying the Virginia Tech suspect. Says the Association: \"There is no \n      evidence at this early point that the race or ethnicity of the suspected \n      gunman has anything to do with the incident, and to include such mention \n      serves only to unfairly portray an entire people. The effect of mentioning \n      race can be powerfully harmful. It can subject people to unfair treatment \n      based simply on skin color and heritage.\"[+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\n \n“48 \n      Hours” In The Case Of The Altered Image\n \n'Sunday \n      Morning' Apologizes Over David Pogue Segment\n \nStop \n      The Bode Bashing!\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}