{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nThe Power of the Tides (EnergyBiz Insider - Apr. 13, 2007)\n\n\n\nEnergyBiz Insider - Apr. 13, 2007 - A pilot project in New York's East River is evaluating the use of underwater turbines to generate electricity. If the project bears fruit, the technology could have widespread applications.\n\n\nApr 13, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Apr. 13, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 13, 2007\n\n\nApr 13, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for April 13, 2007  \n\n\n\nFirst Enercast Featured Articles for April 13, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nApr 13, 2007 PowerMarketers Industry Publications\n\n\n\nWhat is Driving Energy Trading, Transaction and Risk Management (ETRM) Software Sales? (UtiliPoint.com - Apr. 13, 2007)\n\n\n\nUtiliPoint.com - Apr. 13, 2007 - 2007 is set to be another great year for ETRM software vendors. Sales of ETRM software are booming and each vendor I talk to recently tells me they are having a banner year thus far.\n\n\nApr 13, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nA new power struggle: State power-system operator and federal agency tell LIPA to avoid a practice that could lead to price manipulation\n\n\n\nApr. 13--As workers break ground in Yaphank this week on the LIPA-backed Caithness power plant, a little-known dispute between the power authority and a state-sanctioned power-markets administrator casts LIPA's urgent calls for more Long Island capacity in a previously unseen light.  In a February ruling and other documents in a complaint filed by the Long Island Power Authority in November, ...\n\n\nApr 13, 2007 Knight Ridder Tribune Business News\n\n\n\nRuling jeopardizes Excelsior Energy's Iron Range plans\n\n\n\nApr. 13--A $1.5 billion coal-gasification plant proposed to be built on the Iron Range may be headed for trouble.  A conclusion written by two administrative law judges, obtained Thursday by the News Tribune, recommends that a power-purchase agreement -- needed to move the Excelsior Energy project ahead -- be denied by the Minnesota Public Utilities Commission on grounds including cost and ...\n\n\nApr 13, 2007 Knight Ridder Tribune Business News\n\n\n\nSan Antonio Express-News David Hendricks column\n\n\n\nApr. 12--TXU PUTS THE TEXAS POWER MARKET IN LIMBO: Who's in control at TXU Corp., the giant Dallas-based energy company?  Plenty of Texans want to know. Since deregulation of the Texas power generation business in 2002, municipal-owned utilities, like CPS Energy here, have tried to predict where the Texas power market is headed. If the market was clouded before recent events, it's indecipherable ...\n\n\nApr 12, 2007 Knight Ridder Tribune Business News\n\n\n\nSeminole to build Nebraska pipeline: The Tulsa-based company's natural gas conduit would serve ethanol facilities.\n\n\n\nApr. 12--The Tulsa-based company's natural gas conduit would serve ethanol facilities.  Seminole Energy Services LLC announced plans Wednesday to build a natural gas pipeline that would serve ethanol facilities in central Nebraska. The exact route and cost of the pipeline has not been determined, company officials said, but they anticipate the conduit will span 150 miles, connecting an existing ...\n\n\nApr 12, 2007 Knight Ridder Tribune Business News\n\n\n\nVictorville power plant clears hurdle: City's 563-megawatt project would supply the power grid\n\n\n\nApr. 12--SACRAMENTO -- A $450 million hybrid power plant planned by the city has cleared a major permit hurdle with the California Energy Commission.  The commission voted 4-0 Wednesday that Victorville's permit application has enough data to proceed with an environmental review of the plant. The clock is now ticking to a 12-month countdown, after which the CEC must make a decision on licensing ...\n\n\nApr 12, 2007 Knight Ridder Tribune Business News\n\n\n\nCoal-to-gas plant dealt a setback by judges\n\n\n\nApr. 13--The dream of a $2 billion coal-gasification plant on the Iron Range the was dealt a setback Thursday when two administrative law judges urged the Minnesota Public Utilities Commission to deny the plans of Excelsior Energy, a newcomer power company.  While not binding on regulators, the ruling is filled with warnings, from doubts that the plant will burn coal as cleanly as guaranteed to ...\n\n\nApr 13, 2007 Knight Ridder Tribune Business News\n\n\n\nOhio's emissions rank fourth in U.S.: Carbon dioxide releases up 7% from 1990-2004\n\n\n\nApr. 13--Emissions of carbon dioxide, a gas key to global warming, grew by 7 percent in Ohio from 1990 to 2004, and the state ranked fourth overall in the emissions, which were mostly from coal-burning power plants and vehicles.  That information is contained in a report released Thursday by Environment Ohio, a citizen-based advocacy group. Ohio ranked behind Texas, California and Pennsylvania, ...\n\n\nApr 13, 2007 Knight Ridder Tribune Business News\n\n\n\nBills promote Fire Island wind farm\n\n\n\nApr. 12--JUNEAU -- Lawmakers proposing to use $24 million to place windmills on Anchorage's Fire Island are facing opposition from at least one electric company that says such state money would be better spent for more pressing needs. Companion bills introduced by Sen. Lesil McGuire, R-Anchorage, and Rep. Harry Crawford, D-Anchorage, would allocate money from the state's Railbelt Energy Fund to ...\n\n\nApr 12, 2007 Knight Ridder Tribune Business News\n\n\n\nHouse won't ask for TXU buyout approval: Lawmakers satisfied with group's commitments to PUC\n\n\n\nApr. 13--AUSTIN -- The Texas House of Representatives isn't likely to vote to require regulatory approval of the buyout deal for TXU Corp.  Rep. Phil King, R-Weatherford, said he hasn't seen any amendments to his electricity legislation they are considering Thursday that would do so. Instead, he said, there's a general agreement to consider requiring the Public Utility Commission to review ...\n\n\nApr 13, 2007 Knight Ridder Tribune Business News\n\n\n\nTVA ready for final Browns Ferry review\n\n\n\nApr. 12--TVA has told the Nuclear Regulatory Commission that it is ready for a final review of its restart of the Unit 1 reactor at Browns Ferry Nuclear Plant. Unit 1, which TVA expects to return to service in May, would be the first new nuclear generation in the United States this century. The NRC, which oversees TVA's three nuclear plants, will send a team to evaluate Browns Ferry's management ...\n\n\nApr 12, 2007 Knight Ridder Tribune Business News\n\n\n\nEPA moves to ease air pollution standards for ethanol plants\n\n\n\nWASHINGTON _ The Environmental Protection Agency took a major step to stimulate ethanol production by issuing a rule Thursday allowing ethanol plants to operate with fewer environmental rules and less air pollution equipment.  The agency rejected pleas by clean-air advocates and increased the amount of nitrogen oxide, sulfur dioxide and other pollutants that will be allowed before an ethanol ...\n\n\nApr 12, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nSenate Endorses Simmons For Post\n\n\n\nEven before former U.S. Rep. Rob Simmons received final approval for his new job, legislators were debating on Wednesday what he should do as the state's first business advocate.The state Senate confirmed Gov. M. Jodi Rell's nomination of Simmons by a 36-0 vote, but the debate on the Senate floor focused on issues far beyond the former legislator's resume and accomplishments.Senate President Pro ...\n\n\nApr 12, 2007 Hartford Courant\n\n\n\n\n\nResearch and Markets: Bunge Limited, Exxon Mobil Corporation and Archer Daniels Midland Company Are among the Top Five Competitors For VeraSun Energy Corporation\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c53733) has announced the addition of VeraSun Energy Corporation - Company Analysis to their offering. Company Analysis assists individual investors, managers and companies in evaluating opportunities, trends, market innovations as well as in selecting appropriate information solutions in order to ...\n\n\nApr 12, 2007 Business Wire\n\n\n\nEnergy Savings Announces 26th Distribution Rate Increase\n\n\n\nEnergy Savings Income Fund (TSX: SIF.UN) filed notice with the Toronto Stock Exchange on April 2, 2007 announcing its April distribution. A distribution of $0.09292/unit will be paid on April 30, 2007 to Unitholders of record at the close of business on April 15th, 2007. The Units trade on the Toronto Stock Exchange under the symbol \"SIF.UN\".  Energy Savings Income Fund (TSX: SIF.UN) filed notice ...\n\n\nApr 13, 2007 Internet Wire\n\n\n\nMissouri Generators Developing Over 1,900 Megawatts of New Renewable Energy\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). Power producers in Missouri are looking at renewable energy as an alternative for the state's future power needs. The power producers are evaluating sixteen sites equaling about 1,900 megawatts (MW) of renewable generation. These proposed projects would represent about 33% of the new power ...\n\n\nApr 13, 2007 Internet Wire\n\n\n\nMidlands Minerals Announces Granting of Stock Options\n\n\n\nMidlands Minerals Corporation (\"Midlands\" or the \"Company\")(TSX VENTURE: MEX) announces the company has granted options, consistent with the Company's Stock option plan as approved by the shareholders on May 10, 2006, and in accordance with the policies of the TSX Venture Exchange.  Midlands Minerals Corporation (\"Midlands\" or the \"Company\")(TSX VENTURE: MEX) announces the company has granted ...\n\n\nApr 12, 2007 Internet Wire\n\n\n\n\n\nIomega Delivers New Rack-Mount NAS\n\n\n\nIomega Corporation (NYSE: IOM), a global leader in data storage and protection, today announced a new rack-mount addition to its extensive line of network attached storage models for small and mid-sized businesses: the new Iomega StorCenter(TM). Featuring advanced performance, capacity, and energy efficiency in a 1U form factor, the new Iomega StorCenter Pro NAS 450r series featuring 1 TB and 2 ...\n\n\nApr 12, 2007 BIOS\n\n\n\nNEB report finds no likely environment impact from Emera Brunswick gas line\n\n\n\nCALGARY (CP) - The proposed Emera Brunswick pipeline to carry imported natural gas across southern New Brunswick to the United States 'is not likely to result in significant adverse environmental effects,' according to a National Energy Board environmental assessment. The NEB released its report Wednesday, noting that the finding is contingent on the project receiving regulatory approval and on ...\n\n\nApr 12, 2007 Canadian Business Magazine\n\n\n\nGreat River Energy Extends Coal Contract with The Falkirk Mine to 2045\n\n\n\nUNDERWOOD, N.D.--(BUSINESS WIRE)--Great River Energy recently extended a contract with The Falkirk Mining Company (a wholly-owned subsidiary of The North American Coal Corporation) to provide all of Coal Creek Station's lignite coal requirements through 2045.  The original contract between Great River Energy and The Falkirk Mining Company was signed in 1974.\n\n\nApr 12, 2007 Yahoo!\n\n\n\nAASHE releases annual review of sustainability in higher education\n\n\n\nA new report from the Association for the Advancement of Sustainability in Higher Education (AASHE) shows an 'explosion' of sustainability-related activity on campuses across the US and Canada. AASHE Digest 2006, an annual compilation of news stories and resources from AASHE's weekly newsletter (the AASHE Bulletin), offers a comprehensive review of campus sustainability efforts from the past ...\n\n\nApr 12, 2007 FMLink\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nCredit Suisse backs Japanese firms whose products might help fight climate change\n\n\n\nTOKYO: Investors should buy shares of Japanese environment-related companies like Toshiba and NGK Insulators, Credit Suisse said, on the view that they will benefit from expanding business opportunities. Shinichi Ichikawa, chief strategist at Credit Suisse in Tokyo, wrote in a report published Wednesday that global warming was a threat that would prove costly.\n\n\nApr 13, 2007 International Herald Tribune\n\n\n\nChinese and Japanese companies sign energy deals\n\n\n\nTOKYO: Japanese and Chinese companies said they signed business deals in the energy sector on Thursday that could lead to possible joint development of oil and gas projects in the future, including in the East China Sea. The deals were struck at a Japan-China energy seminar in Tokyo during the visit of Prime Minister Wen Jiabao of China. Nippon Oil and China National Petroleum signed an accord ...\n\n\nApr 12, 2007 International Herald Tribune\n\n\n\nEndesa and Iberdrola open electricity auctions to rivals\n\n\n\nMADRID: Endesa and Iberdrola, the two largest Spanish power producers, said Thursday they would jointly auction power for delivery starting in July, letting banks and foreign utilities gain a foothold in the Spanish market. The two will together sell 14.9 terawatt hours of electricity in a two-year period starting July 1, Iberdrola, based in Bilbao, said in a statement.\n\n\nApr 13, 2007 International Herald Tribune\n\n\n\nSwiss Re Announces Final Close of EUR 329 Million European Clean Energy Fund\n\n\n\nSwiss Re announces the successful close of the EUR 329 million European Clean Energy Fund, one of the largest funds of this type in Europe. The Fund, a UN accredited investment vehicle, provides capital to European clean energy projects, which are environmentally beneficial, generate carbon credits or tradable renewable energy certificates. The European Clean Energy Fund raised EUR 329.2 million ...\n\n\nApr 12, 2007 PR Newswire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}