{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "550p; 6/14 Update: NASA officials confident Russians will resolve computer glitches", "body": "\n\n\n\n\n550p; 6/14 Update: NASA officials confident Russians will resolve computer glitches\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 58\nPosted: 5:52 PM, 6/14/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-55 (06/14/07): Russian engineers troubleshoot computer problem; telemetry restored; false fire alarm sounds\n   SR-56 (06/14/07): Computer system partially revived; troubleshooting continues\n   SR-57 (06/14/07): Shuttle astronauts gear up for more solar array retraction work\n   SR-58 (06/14/07): NASA spaceflight chief, former station astronaut optimistic Russians will resolve computer snafu\n\n=================================\n\n5:52 PM, 6/14/07, Update: Gerstenmaier urges patience, says Russians will resolve - or work around - computer glitches\n\nRussian engineers troubleshooting computer problems aboard the international space station coaxed three of six critical guidance and control computers back into operation today after a crippling shutdown Wednesday. A few hours later, apparently still experiencing problems, the two operating command-and-control computers, along with a lone guidance computer, were shut back down to give engineers time to assess telemetry.\n\nAdditional troubleshooting and work to restore the computer system to more normal operation will be attempted early Friday when the space station passes back within range of Russian ground stations.\n\n\"Is this routine? No, it's not routine,\" veteran station astronaut Bill McArthur, manager of safety and mission assurance for the shuttle program in Houston, told CBS News. \"This is a situation that's a little more challenging than we've run into before. We really must recover the function of the computers in the Russian segment. They are required to maintain full attitude control, which is mandatory after the shuttle undocks. So this is something we're taking very, very seriously.\n\n\"We do have confidence, though, that we're going to be able to come to a resolution of this issue and get the station back in a nominal configuration,\" said McArthur, who spent 190 says aboard the station in 2005 and 2006. \"I have a lot of experience working with our Russian colleagues. They're very professional, they do understand this vehicle quite well and we're confident that within the next few days they'll understand the problem with these redundant computers and get the station back under nominal control.\"\n\nIn the meantime, power from the U.S. segment of the station is flowing into the Russian Zarya module and a three-seat Soyuz lifeboat docked to a downward-facing port. After the computer shutdowns Wednesday, Zarya lost power when its solar arrays were no longer able to track the sun. As a precaution, the Russians switched the Soyuz over to power from its own solar arrays and batteries. That problem, at least, has been resolved and Zarya remains fully powered.\n\n\"We're in a stable configuration,\" said Bill Gerstenmaier, NASA's chief of space operations. \"We're not really sure what caused this problem, it's going to take a little bit of time to understand it because of the complexity. But once we understand it, we'll get station back in operating function.\"\n\nAs to characterize the severity of the problem, Gerstenmaier said engineers have plenty of time to resolve it or come up with work arounds and \"we're still a long away away from where we'd be to de-man the space station.\"\n\n\"We're getting more creative as we go, we're figuring out other ways to operate station that will keep us manned for an extended period of time,\" he said. \"So I think we're a long way from that scenario. But if we got there, we would leave station in a configuration where we could come back to it if we had to. But we're not near where we have to go de-man space station.\"\n\nProblems first started cropping up Tuesday when critical Russian computers began acting erratically. On Wednesday, the three redundant computers making up the guidance and navigation system went down. That prompted an automated attempt to reboot the navigation system computers as well as the station's three command-and-control computers.\n\nTo the surprise of the engineering community, the computers failed to reboot.\n\nThe guidance computers are used to fire Russian maneuvering jets when the station's orientation must be changed to a degree that is beyond the capability of U.S. control moment gyroscopes, or CMGs. With the shuttle Atlantis docked to the station, the problem was not severe because any problems could be corrected by the orbiter's maneuvering jets.\n\nGerstenmaier said today engineers are working on alternative ways to control the station's orientation, or attitude, including use of rocket thrusters in an unmanned Progress supply ship docked at lab complex.\n\n\"Ideally, we would like to have the Russian computers up and operating when the shuttle undocks,\" Gerstenmaier said. \"That way, we can ... command the thrusters on the space station to essentially remove the momentum associated with the docking attitude and desaturate the CMGs and get back in control.\"\n\nWhen gyroscopes get \"saturated,\" the spinning wheels can no longer affect the station's orientation. Rocket thrusters are used instead, moving the station and \"desaturating\" the gyros.\n\n\"Could we undock today in this configuration, even with the computers down? I think we could,\" Gerstenmaier said. \"We would end up saturating the control moment gyros and we're looking at options to potentially use the Progress to provide that desaturating capability.\"\n\n\"Ideally, we'd like to have the computers up and operating in some function before the shuttle departs. But if we had to have the shuttle depart now, it would be off nominal for us but the shuttle could depart and we would still be in a stable configuration with station.\"\n\nEngineers say the computer problem may have been triggered by trouble with a power converter used to feed electricity from the new U.S. solar arrays into the Russian segment of the station. Engineers also are studying how \"noisy\" the power might be and the possibility of electromagnetic interference.\n\n\"We're still struggling to try to understand what the real problem is here,\" Gerstenmaier said. \"As you change any configuration, the first thing you want to go back and look at, did any of the configuration change cause the problem we've got? So when we added the solar arrays, was there anything unique with that power or the electro-motive interference that could be associated with that that could be causing a problem?\n\n\"So we've got to try to isolate some of the new arrays from the Russian segment and see if that helps. We also have an oscilloscope on board and we'll probably be able to go ahead and take a look at some of the power quality to see if that's causing any problems.\"\n\nResolving the problem will take time, he said, \"it will not be quick. Unless we get lucky right away and find the problem, it will be a couple of days we'll probably be in this configuration.\"\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}