{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Miles Mclaughlin\" <nofdecunhasrod@decunhas.com>", "subject": "Join the thousands of people who got slim", "body": "\nLess weight - more pleasure and joy\n\n\n\n\n\nAnatrim – The latest and most exciting product for over-weight people is now readily available – As told on CNN\n\n\n\nDo you understand that superfluous body kilos kill a plenty of people around the whole world? We believe that you hate the ugly look of those people and the low status they have in modern society. \n\nOr, maybe, you can’t withstand an assault of ruinous eating habits of yours. If this all sounds familiar, then we got something to propose to you!\n\n\n\n\n\nHere comes Anatrim, the new product for the elimination of your body’s extra weight. The greatest thing about Anatrim is it raises the quality of your life, repressing the feeling of hunger and giving you gay spirit. Here you may see what people write about this product:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of watching TV and always glutting myself with food \n\n\nI became rather more interested in doing exercise.\n\n\n\n\n\n\n Anatrim put me back on the right path.\n\n\n I have a great form now and lots of men stare hard at me!\"\n\n\n\n\n\n\nLusia R., Boston\n\n\n\n\n\n\n\"Passive weight burning was of little result to me. This terrible hunger would just rush in and spoil everything. \n\n\nOnce I heard on Anatrim from my very best friend and I rather liked the information.\n\n\n I had attempted taking it, and my wife told me that I had changed for the better since then, 5 months later. \n\n\n25 pounds have gone away and I keep still losing them! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nRikky Martin, Chicago\n\n\n\n\n\nAnatrim helps your mind to realize that your body doesn’t need that much food. It raises your mood up, provides you with additional energy, and attacks unnecessary kilos. Especial thanks to its powerful distinguished formula!!\n\n\n\nWorm out more information!\n\n\n\n"}