{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Josie Inman\" <tyccedivinaluzsal@cedivinaluz.org>", "subject": "Doctors and Celebrities endorse Anatrim", "body": "\nHealthy living with less fat\n\n\n\n\n\nAnatrim – The up-to-the-moment and most fascinating flesh loss product is now available – As were told on BBC\n\n\n\nDo you realize that excessive body kilograms kill a plenty of people for every new year? We believe you hate the ugly appearance of people like those and the social prejudice against them. \n\nOr, maybe, you can’t resist an assault of pernicious eating habits of yours. If you see it sounds familiar, then we got something to propose to you!\n\n\n\n\n\nHere Anatrim comes, the recent product for the reduction of your body’s extra weight. The astounding thing about Anatrim is it raises the quality of your life by making you crave food less and giving you better cheer. Here are what people say to us on this product:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of watching TV and gorging everything easy to reach \n\n\nI became rather more interested in doing exercise.\n\n\n\n\n\n\n Anatrim put me on the right path.\n\n\n I’m in a great form now and there are lots of men around me!\"\n\n\n\n\n\n\nAmelia B., Boston\n\n\n\n\n\n\n\"I tried some passive weight burning, but almost with no result. It was difficult for me to hold back and not to eat something just at hand. \n\n\nOnce I heard about Anatrim in the media and I rather liked the information.\n\n\n I had tried to use it, and my wife said to me I’m not more a weighty man now, 3 months later. \n\n\n25 pounds have gone away and this is not a limit! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nRikky Martin, Chicago\n\n\n\n\n\nAnatrim gives you an opportunity to understand you got no such great need for the constant eating. It raises your spirit, supplies you with extra energy, and attacks useless kilos. Great thanks to its powerful comprehensive formula!!\n\n\n\nWorm out latest news!\n\n\n\n"}