{"category": "ham", "to_address": "perl6-internals@perl.org", "from_address": "bernhard@cvs.develooper.com", "subject": "[svn:parrot-pdd] r18425 - trunk/docs/pdds", "body": "Author: bernhard\nDate: Sat May  5 06:05:33 2007\nNew Revision: 18425\n\nModified:\n   trunk/docs/pdds/pdd15_objects.pod\n\nLog:\n#42882: List numbering typo in pdd15\n\nCourtesy of Dave Rolsky.\n\n\nModified: trunk/docs/pdds/pdd15_objects.pod\n==============================================================================\n--- trunk/docs/pdds/pdd15_objects.pod\t(original)\n+++ trunk/docs/pdds/pdd15_objects.pod\tSat May  5 06:05:33 2007\n@@ -177,32 +177,32 @@\n \n A \"have I been instantiated since I was last modified\" flag\n \n-=item 2\n+=item 3\n \n An array PMC of the immediate parent classes\n \n-=item 3\n+=item 4\n \n A cached array of all parent PMCs, in search order (this is an optional\n optimization, and can be calculated from the class's rules of inheritance,\n the list of immediate parent classes, and the parent classes' rules of\n inheritance)\n \n-=item 4\n+=item 5\n \n An array PMC of the composed roles (these are Role PMCs, not string names of\n roles).\n \n-=item 5\n+=item 6\n \n A hash PMC of the methods defined in the class or composed into the\n class\n \n-=item 6\n+=item 7\n \n A hash PMC of the overloaded PMC vtable entries for the class.\n \n-=item 7\n+=item 8\n \n The class attribute metadata hash. Keys are the attribute names and the\n values are a hash of attribute characteristics, including name, type, the\n@@ -210,7 +210,7 @@\n that this only stores metadata for the attributes defined in this class,\n and not for attributes inherited from its parents.\n \n-=item 8\n+=item 9\n \n The full attribute lookup table. This associates attribute names with an\n index into the object's attribute storage (an array). It includes all\n@@ -220,7 +220,7 @@\n attribute name. The value is an index into the per-object attribute\n store.\n \n-=item 9\n+=item 10\n \n The attribute cache. While the attribute lookup table defines every\n attribute, whether it is visible or not with the current method\n\n"}