{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Norris Adkins\" <dofcoverprintgus@coverprint.ee>", "subject": "Burn pounds off with Anatrim", "body": "\nBecome fit and happy again\n\n\n\n\n\nAnatrim – The latest and most fascinating flesh loss product is now readily available – As told on ABC\n\n\n\nDid you know that superfluous body kilos kill more and more people every year? We believe that you hate the unsightly look of people like those and the social prejudice against them. \n\nOr, maybe, you’ve not the will to resist a pressure of pernicious eating habits of yours. If you see it sounds familiar, then we got something for your consideration!\n\n\n\n\n\nIntroducing Anatrim, the new product for the elimination of your body’s extra weight. The most amazing thing is that Anatrim raises the quality of your life, repressing your feeling of hunger and giving you joyful spirit. Look at some e-mails from our customers:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of stuffing myself with food and watching TV \n\n\nI became more interested in exercise.\n\n\n\n\n\n\n Anatrim put me back on the right path.\n\n\n I have a great form now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nMaria H., San Diego\n\n\n\n\n\n\n\"I tried some passive weight reducing, you know, but with no result. I could not restrain my ravenous appetite. \n\n\nOnce I was told on Anatrim my very best friend by and I rather liked the information.\n\n\n I had tried to use it, and my wife said to me that I'm a different person now, 5 months later. \n\n\n34 pounds have gone away and it’s not a limit! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nRikky Martin, New York\n\n\n\n\n\nAnatrim helps your mind to understand that you doesn’t have such a great need for the constant eating. It raises your mood up, provides you with energy, and attacks needless kilos. Great thanks to its mighty comprehensive formula!!\n\n\n\nElicit more useful information!\n\n\n\n"}