{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Energy Seminars<Energy.Seminars@calcium.netcontentinc.net>", "subject": "Forecasting Using Technical Analysis  June 19-20  Santa Fe", "body": "\n\n\n\nEnergy Trading Regulations\n\n\n\n\n\n\n\n\n\n\n\n\n\nForecasting Using Technical Analysis\n\n(Using \n\t\tTechnical Analysis to Predict the Market Direction of Energy Prices)\n\nJune 19-20 ? \n\t\tHilton of Santa Fe Historic Plaza - Santa Fe, NM\n\nClick Here To Register Online\n\n\n\n\n\n\n\n\n\nClick To \n      Download A Complete Conference Brochure and Order Form\nClick Here For A Complete Listing \n      Of Upcoming Conferences\n\n\n\n\n\n\n\n\nBrief: \n\t\tThe class will teach techniques that will be helpful not only for those \n\t\twho wish to trade for profit, but also for cash market participants and \n\t\thedgers who need to understand the market.\nUnderstanding \n\t\ttechnical analysis is the key to learning how to view the market \n\t\trealistically and accurately so that whether your company is hedging or \n\t\ttrading, or if you're just managing your own portfolio, you can avoid \n\t\tgroup think and interact successfully with the market.  Even those who \n\t\tsee the fundamentals comprehensively and clearly often err on their \n\t\tdeductions about the impact of fundamentals on price.\n\n\n\n\n\t\tCost:\n\n$995 \n\t\t(Save $200!) - Attendees of both this seminar and its sister seminar, \n\t\tTrading Technically, will save $100 off the price of each seminar.)\n\n\n\n\n       \n\n\n      Course Outline\nUnderstanding Energy \n\t\tMarkets\n\t\tWhy Learn Technical Analysis/Forecasting\n\t\tBasic Math and Rules of Thumb\n\t\tFibonacci Numbers\n\t\tGolden Mean, Phi\n\t\tLarger the time frame more important the pattern\n\t\tWhat is a Wave\n\t\tCalculating Swings\n\t\tCalculating Proportions\n\t\tBasic Wave Rules\n\t\t5 Wave Patterns\n\t\tStandard\n\t\tIrregular\n\t\tEnding/Beginning Triangles\n\t\t3 Wave Patterns\n\t\tABC corrections\n\t\tExtended corrections\n\t\tCorrective patterns\n\t\tDetails on Corrective Patterns\n\t\tFlags\n\t\tPennants\n\t\tDiagonal Wedges\n\t\tFlat Wedge\n\t\tBroadening Wedge\n\t\tOther Patterns Useful in Forecasting\n\t\tHead and Shoulder (Inverse)\n\t\tDouble/Triple Tops and Bottoms\n\t\tSpike Tops and Bottoms\n\t\tDiamond Tops and Bottoms\n\t\tRounding Tops and Bottoms\n\t\tSymmetrical Triangles\n\t\tGaps\n\t\tDeveloping a Forecasting Grid\n\t\tBasic Math\n\t\tOrganizing by calculation type (Landscape page)\n\t\tOrganizing by target price (PQ page)\n\t\tRetracements\n\t\tBasic layout of table\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n? Anyone wanting to be able to read and understand a \n\t\ttechnical market analysis and forecast, and to develop a basic technical \n\t\tview on their own.\n\t\t? Energy and other commodity traders seeking to understand market \n\t\tdirection and develop effective trading strategies.\n\t\t? Analysts who wish to understand the basics of technical forecasting.\n\t\t? Market participants who want to be able to identify when the market is \n\t\ttrending or correcting.\n\t\t? Planners who want to be able to determine market targets.\n\n\t\tA question often asked is \"I have no experience with technical analysis, \n\t\tis this class for me?\" The class begins is designed for those who know \n\t\twhat a futures contract is and perhaps have some experience with the \n\t\tcash market or hedging but no knowledge of technical analysis. \n\n\t\tA typical class attendee has had some exposure to the market, usually on \n\t\tthe physical side, or as a support person, but lacks an understanding of \n\t\tthe technical. Those who do have experience with the markets but need a \n\t\tclear understanding of how forecasting is done, will find this class \n\t\tgives them the foundation needed to read and understand a high-level \n\t\ttechnical forecast and the basics develop more accurate market view on \n\t\ttheir own.\n\n\n\n\n\n\n\nCynthia Kase \n\t\t- CMT, CTA - Cynthia Kase, with over 30 years industry experience, \n\t\tis an engineer turned oil trader who, after Chevron, Chemical Bank and \n\t\tthe Saudi Oil Ministry, started Kase and Company, Inc., a trading and \n\t\thedging consultancy, geared towards the institutional energy sector, \n\t\tback in 1992. As a Chartered Market Technician, and Commodity Trading \n\t\tAdvisor, she won the Market Technician Association?s ?Best of the Best? \n\t\taward in 1997 for momentum, and is recognized by many as that market?s \n\t\tleading forecaster, calling energy prices to within pennies with a \n\t\tdocumented 96% accuracy. The author of dozens of trading articles, and \n\t\tthe acclaimed Trading with the Odds, Kase has been teaching technical \n\t\tforecasting and analysis since 1989.\n\n\n\n\n\n\n\n\n\nClick To \n      Download A Complete Conference Brochure and Order Form\n\nClick Here For A Complete Listing \n      Of Upcoming Conferences\n\n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}