{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Felling In The Fold", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nMatthew \n      Felling Joins Public EyeSome good news to report today: \n      Matthew Felling, former media director at the Center for Media and \n      Public Affairs, is joining Public Eye. If you're in Washington D.C., you \n      might know Matt's voice from his regular gig as a guest host on NPR \n      affiliate WAMU; he's also been a regular on MSNBC's \"Scarborough Country\" \n      and just this past Sunday appeared on CNN's \"Reliable Sources.\" Oh, and \n      he's been quoted just about everywhere.[+ Read More]\n\nThe \n      Public Eye Chat With…Daniel Sieberg\"I think that the 'Evening News' will still exist [in a decade]. I don't know if it will be \n      the same demographic. I think that it's going to depend on whether people \n      embrace the idea of, let's say, watching video on their cell phone or PDA. \n      The image of somebody sitting down and watching the 'Evening News' I think is harder to convey to the \n      younger generation of people. And so you imagine them getting older, and \n      are they going to go into that way of thinking and they're all going to \n      decide to sit on the couch and watch the 'Evening News?' Or are they going to push against that, \n      and stay with their devices and be on the go?\"[+ Read More]\n\nJournalists \n      – Traditional And Otherwise – Beaten In L.A. One issue \n      we've been keeping our eye on here is the implications of the increasingly \n      blurring lines between regular citizens engaged in reporting and \n      traditional journalists. Now comes news that journalists were beaten by \n      police at the Los Angeles immigration protests – and part of the reason \n      may be that police couldn't distinguish between traditional journalists \n      and citizen journalists who were also there as activists.[+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nJim \n      Axelrod Responds To Media Matters Criticism\n \nAxelrod \n      Responds To White House Criticism\n \nSweeps: \n      Time For A Promotion?\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}