{"category": "ham", "to_address": "Robert A LaBudde <ral@lcfltd.com>", "from_address": "adschai@optonline.net", "subject": "Re: [R] [Not R question]: Better fit for order probit model", "body": "Thank you so much Robert. Please find the information below. \n\nThe scale 1-10 are subjective physical condition ratings scored by inspection engineers at the site. 1-5 are in very bad conditions (bridge close down to seriously deteriorated). The rest from 6-10 are categorized as good condition.However, the proportion of samples in my data are as follows. Bridges with 1-5 scale covers about 2-3% of total population. The majority of the bridges are in 7-8. Certainly, I have enough data for model estimation but the mix of the proportion is good. I attached the detail of condition rating scale at the end of this message.\n\nAs a result, my ordered probit model yield cutting points that cannot capture level 1-5 well. Even in my in-sample population, the model cannot capture level 2-5 at all. In other words, with the estimated cutting points for level 1-5, I have zero bridges that belong to level 2-5. Unfortunately, my objective is especially to analyze statistically what kind of design attributes lead to such a bad condition. So I would like my model to be able to capture bad condition bridges as much as it could.\n\n\n9                  EXCELLENT CONDITION\n\n8                  VERY GOOD CONDITION - no problems noted.\n\n7                  GOOD CONDITION - some minor problems.\n\n6                  SATISFACTORY CONDITION - structural elements show some minor deterioration.\n\n5                  FAIR CONDITION - all primary structural elements are sound but may have minor section loss, cracking, \n                    spalling or scour.\n\n4                  POOR CONDITION - advanced section loss, deterioration, spalling or scour.\n\n3                  SERIOUS CONDITION - loss of section, deterioration of primary structural elements.  Fatigue cracks \n                    in steel or shear cracks in concrete may be present.\n\n2                  CRITICAL CONDITION - advanced deterioration of primary structural elements.  Fatigue cracks in steel \n                    or shear cracks in concrete may be present or scour may have removed substructure support.  Unless \n                    closely monitored it may be necessary to close the bridge until corrective action is taken.\n\n1                  \"IMMINANT\" FAILURE CONDITION - major deterioration or section loss present in critical sructural \n                    components or obvious vertical or horizontal movement affecting structure stability.  Bridge is \n                    closed to traffic but corrective action may put it back in light service.\n\n0                  FAILED CONDITION - out of service; beyond corrective action.\n\n\n----- Original Message -----From: Robert A LaBudde Date: Saturday, June 16, 2007 9:59 amSubject: Re: [R] [Not R question]: Better fit for order probit modelTo: R-help@stat.math.ethz.ch> At 03:17 AM 6/16/2007, adschai wrote:> >Thank you so much Robert. I haven't thought about the idea of > >clumping categories together. One of the reason is because > these > >categories are bridge condition rating scores. They indeed > represent > >different meaning and serviceability conditions. They vary from > 0-9. > >I have about 300,000 data in which the first 5 labels, i.e. 0-> 4, are > >bad condition bridge and there are only less than 1000 > instances in > >total. The worst case, is for example, score 0 (meaning the > bridge > >is not operatable), I have 60 instances. Score 1 I have about 100.> >> >I would appreciate if you could provide some opinion as to how > you > >would make the order probit fits better in this case? Thank you > so > >much in advance.> > You certainly appear to h!\n ave enough data to populate these > categories. Your problems in a getting a good fit may relate to > other problems.> > You need to supply more information in order to say more.> > What are the definitions of each category?> > Is the ordering consistent, or are there really two different > scales, > one for bridge with essentially no problems, and another for > those > with serious damage?> > What evidence do you have that your fit is poor?> > What model are you fitting?> > Etc.> > ================================================================> Robert A. LaBudde, PhD, PAS, Dpl. ACAFS  e-mail: ral@lcfltd.com> Least Cost Formulations, Ltd.            URL: http://lcfltd.com/> 824 Timberlake Drive                     Tel: 757-467-0954> Virginia Beach, VA 23464-3239            Fax: 757-467-2947> > \"Vere scire est per causas scire\"> > ______________________________________________> R-help@stat.math.ethz.ch mailing list> https://stat.ethz.ch/mailman/listinfo/r-help> PLEASE do r!\n ead the posting guide http://www.R-> project.org/posting-guide.html> a\nnd provide commented, minimal, self-contained, reproducible code.>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}