{"category": "ham", "to_address": "Benilton Carvalho <bcarvalh@jhsph.edu>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] names of objects in .rda", "body": "On Fri, 11 May 2007, Benilton Carvalho wrote:\n\n> Hi everyone,\n>\n> sorry if this was discussed before (and in this situation, could you\n> please point me to the discussion in the archive? My search didn't\n> seem to be effective).\n>\n> Is there a way of getting the names of objects in a .rda file without\n> having to load it?\n\nWell, of course there is a way (R has ways to read datafiles from other \npackages, and similarly one could write a .rda reader from the description \nin 'R Internals').\n\nFirst, .rda files exist in several different formats, so you would have to \nopen it to get the format or assume the most recent format.\n\nSecond, the internal structure is as a pairlist (a pairlist is constructed \nand that single object saved), and you are asking for the tags of the \npairlist.  Those are distributed throughout the file, so you would need to \nknow a great deal about the structure to read the file without making use \nof R's internals.\n\nI wonder what motivates the question: loading into a new enviroment is \npretty painless and returns a character vector of object names.  It is \npossible that the file would be too big to do so, but then knowing what is \nin it is not going to help as there is no way to extract just part of it \n(and R objects are not in any case self-contained and may share \nsub-objects).\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}