{"category": "spam", "to_address": "captains@flax24.uwaterloo.ca", "from_address": "\"Herbert Keyes\" <coseuropeanstudioviw@europeanstudio.com>", "subject": "Melt away fat easily", "body": "\nCheck out the wonders of pound melting\n\n\n\n\n\n\nAnatrim – The very up-to-date and most fascinating product for weighty people is now easily available – As could be seen on Oprah.\n\n\nDo you recall all the times when you appeal to yourself to do any thing for being delivered from this fastly growing number of kilos? Luckily, now no great offering is required. Thanks to Anatrim, the ground-shaking kilos-melting blend, you can get healthier lifestyle and become really slimmer. Have a look at what people state!\n\n\n\n\"It’s unbearably difficult to admit it but I was terribly addicted to food. \n\n\nI ate all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis suffering left off when I started course with Anatrim! \n\n\nHoly God,\n\n\n\n\n my craving for food abated, \n\n\nspirits improved and I became the happiest person 26 pounds in 2.9 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person!\"\n\n\n\n\n\nVictoria K., Las Vegas\n\n\n\n\n\n\"Since the very childhood I was a weighty boy. \n\n\nIt’s difficult to fancy how I detested being mocked at school. \n\n\n\n\nI abhorred the weight and I abhorred myself. \n\n\nAfter trying this and that I heard about Anatrim. \n\n\n\n\nIt literally took me out of this nightmare! Lots of thanks to you, fellows.\"\n\n\n\n\n\nMike Brown, New York\n\n\n\n\n\n\"You know what? Thanks to Anatrim my marriage was saved! I went into the circle, depression – more eating – more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nMy best friend showed me web page and I ordered up my pack of Anatrim right off. \n\n\nThe results I achieved were magnficent, my appetite came to admissible level, I was often in good spirits, and, be sure, I went some belt holes back. And you see, the bedroom became cool, too!\"\n\n\n\n\n\nTom\n\n\n\n\n There are lots of thanks delighted people leave after taking Anatrim. Don’t you gonna add yourself to the thousands and thousands of slender people and take this original appetite-suppressing energy raising product now!\n\n\nDo not lose your chance!\n\n\n\n\n"}