{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Computers & Electronics Newsletter May 17, 2007", "body": "\nhowstuffworks® | computers & electronics May 17, 2007\nRSS\n  \n How DVR Works\n  A DVR is basically a glorified hard drive inside a fancy box that looks nice in your entertainment center. But the digital storage of television signals opens up a whole new world of possibilities when it comes to playback and viewing. Learn how a \nDVR lets you pause live TV, skip the commercials and record every instance of a program, even in high-definition!\n Also at HowStuffWorks\n \n\nHow Netflix Works - When Reed Hastings founded Netflix in 1997, DVD players\nhad only been on the market for a few months. Nearly 10 years later, Netflix\nhas nearly 6.8 million subscribers. Find out how the Netflix movie rental system\nworks and learn about its shipping process.\n \n\nHow Spyware Works - According to recent estimates, more than two-thirds of all\nPCs are infected with some kind of spyware. This malicious type of program infiltrates your computer, tracks your Web habits \nand more. Learn all about spyware and how you can get rid of it.\n \n\nHow FoIP Works - If\nyou've ever sent a fax from a computer, you've used a form of Fax over Internet\nProtocol (FoIP). FoIP combines the benefits of traditional faxing with the cost\nsavings of Internet transmission methods. Learn how faxing over the Internet\nworks. \n   \nThis Week's Video\n \n\nWhich MP3 players make good video players? - If you're looking for an MP3 player to watch\nyour favorite movies or TV shows on, check out the models in this HowStuffWorks\nvideo. They've got big, bright LCD screens and are packed with memory to hold\nhundreds of hours' worth of video and music files.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved "}