{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "This Weekend on BBC Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGABBY LOGAN ON INSIDE SPORT\nHi everyone - Gabby here. \n\n\nWe've got our second Monday edition of Inside Sport going out on BBC ONE at 2305 BST tonight. (I hope you caught our first Sunday morning show yesterday but if you didn't, try to tune in next week at 1130 BST, BBC TWO.)\n\n\nTonight I meet Britain's number one tennis player Andy Murray. I met up with him at the new Roehampton tennis centre and watched him knocking up with Tim Henman. I also met his coach Brad Gilbert. \n\n\nI'm a rubbish tennis player so you won't see me attempting to return one of those fierce Murray serves but I did work out with him and just about managed to keep up!  \n\n\nAndy is a really interesting guy - he spoke about his life on the tennis tour, his pride in his brother Jamie's achievements, about Wimbledon and about the sacrifices he has had to make to get to the top.  \n\n\nAlso on the programme, Britain's top paralympian, Tanni Grey Thompson is retiring and we reveal one of her new goals in life - to help search out the paralympians for London 2012. She thinks she might find them among the servicemen and women injured in action in Iraq and Afghanistan.\n\n\nAll that and Des Kelly and Steve Bunce to debate the hot topics of the week. \n\n\nJoin me BBC ONE, 2305 BST tonight. \n\n\nGabby hosts Inside Sport on Monday 7 May, 2305 BST on BBC ONE, and second edition, 13 May, 1130 BST on BBC TWO.\n\n\nIf you miss the show, you can catch up on the best bits on the website, bbc.co.uk/insidesport\n\n\nCOMING UP THIS WEEK ON BBC SPORT...\n\n\nWORLD SNOOKER\n\nbbc.co.uk/snooker\n\nCoverage from the Crucible of the World Snooker Final on BBC TWO, Monday 1500-2300\n\n\nMATCH OF THE DAY - WOMEN'S FA CUP FINAL\n\nbbc.co.uk/matchoftheday\n\nCoverage of Arsenal v Charlton from the City Ground, Nottingham on BBC ONE, Monday 1240-1510. \n\nLive audio commentary also available on Radio Five Live and BBC website from 1300 (UK users only).\n\n\nPREMIERSHIP FOOTBALL \n\nbbc.co.uk/football\n\nCharlton v Tottenham audio commentary:\n\n2000 BST, Radio Five Live and BBC website (UK users only)\n\n\nSCOTTISH PREMIER LEAGUE FOOTBALL\n\nbbc.co.uk/sportscotland\n\nAudio commentary:\n\n2000 BST, Dunfermline v Motherwell \n\n\nSUPER LEAGUE SHOW\n\nbbc.co.uk/rugbyleague\n\nBBC ONE North, Monday 2235-2305.\n\nVideo coverage also available on the BBC website from 2235 (UK users only).\n\n\nINSIDE SPORT\n\nbbc.co.uk/insidesport\n\nGabby Logan hosts the big names and stories on BBC ONE, Monday 2305-2345\n\n\nRUGBY\n\nbbc.co.uk/rugby\n\nRadio Wales, Tuesday 1930-2115\n\n\nMATCH OF THE DAY\n\nbbc.co.uk/matchoftheday\n\nPremiership highlights on BBC ONE, Wednesday 2310-2350\n\n\nSCRUM V \n\nbbc.co.uk/scrumv \n\nFri 1900-2100, BBC TWO Wales, BBCi and website. Service available throughout the UK. Not available on Freeview.\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nFOOTBALL ON THE BBC \n bbc.co.uk/football\nSaturday\nFootball Focus (1210, BBC ONE).\nSunday\nScore (1430, BBCi & BBC Sport website); Final Score (1630, BBC ONE); Match of the Day (2220, BBC ONE).\n\n\n\n\n\n\nMORE SPORT ON THE BBC\n bbc.co.uk/tvandradio\nSaturday\nMotorsport: Sports Extra Formula One (0955 and 1255, Radio Five Live Sports Extra). Rugby League: Challenge Cup Round 5 - Leeds v Wigan (1430, BBC ONE and Radio Five Live); Rugby League Forum (1630, BBCi and BBC website).  Racing: From Ascot (1310, 1345, and 1420, BBC ONE) and Haydock (1325, 1400, BBC ONE).\nSunday\nRugby Union: Premiership Rugby (1300, BBC TWO and BBC website).  Rugby League: Challenge Cup Round 5 - Wakefield v Bradford (1345, BBC TWO and BBC website).  Paralympic World Cup: 1545, BBC TWO.\n<br>\n\n\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tWatch Inside Sport\n Download the best bits of the show\n\t\t\t\t\t\n\t\t\t\t\t\tWin FA Cup final tickets\n Enter Inside Sport's photography competition\n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}