{"category": "spam", "to_address": "Ktwarwic <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Robert Burris <chi@gis-mbh.com>", "subject": "Straining yourself when you are with a woman?", "body": "\n\nOnline pharmacy presents top products that will make you healthy! You do not need to go to your local drug store, you can buy here any pill that you need.\nOur pharmacy\nBuy the most wanted pills at LOW prices! Viagra, Levitra, Phentermine etc. Find any pill you need in our shop!\nClick here\nCompletely conidential and secure purchase.\nWith best regards,\nRobert Burris\n \n \nNa menia obrushivalsia shkval ee Emocij oshchushchenie bessilnogo gneva, rasteriannosti, obrechennosti i Vsepodavliaiushchego uzhasa pered licom takoj groznoj sily, kak Vladyka Koldena. Nu gde zhe oni?! Ni Gilsveri, ni zasfernika! On videl, kak ta zhe mysl glozhet i Onni, i Leksa, i dazhe Altaresa. Schitalos, chto dobrovolno nikto iz nih ne sposoben Pozhertvovat soboj radi schastia i blagopoluchiia zhitelej Tenevogo Mira, to bish, Po-mestnomu Habusa. Sotnica, poluchiv Myslennyj posyl, mgnovenno okazalas riadom, vsem svoim vidom vyrazhaia gotovnost K dejstviiu. \nPrezhde chem ty Verneshsia obratno v svoj mir, ia obuchu tebia Leshu. Shest Bigmana ushel vlevo, no on i ne pytalsia pogasit Inerciiu, kak ia, a, naoborot, vospolzovavshis svoim opytom bojca i moej Oshibkoj diletanta, pribavil sily, i nizhnij konec ego shesta, vychertiv vituiu Dugu, metnulsia k moim nogam. Nadeius, sleduiushchee utro dlia nas nastupit. Ne pomeshaet, esli ty nazovesh Starshinu llerom, po ih poniatiiam, starym imenem rasy frajdena imeet pravo Nazvat tolko master, ne nanesia priamogo oskorbleniia, to est nikto, ved Master dlia nih ostalsia tolko v mifah i legendah. Takih vo vsej Federacii bylo raz, dva i obchelsia, i obychno oni ne afishirovali svoih Sposobnostej ili prosto ne bralis za podobnye avantiury. Ne vremia i ne mesto zuboskalit. I tolko Sejchas soobrazil, chto etot tip vidit menia dazhe v Leshu. A-a. \nPo storonam ot Vhoda stoialo po moshchnomu energeticheskomu orudiiu, prednaznachennomu dlia Stacionarnogo ispolzovaniia: za bronirovannymi shchitami na vrashchaiushchihsia Platformah vossedali strelki. Davaj, paren, rasskazyvaj. No pora zakanchivat eti igry, Vselennaia ne igrushka. Greshnikami, sviazannymi Vechnym prokliatiem odinochestva. ejisuminyon VkRQW0dcU1B0RkFXVlBMH0dEVUFUQF9bWh9RUg==\n \n\n\n"}