{"category": "ham", "to_address": "R-help@stat.math.ethz.ch", "from_address": "Andy Weller <weller@erdw.ethz.ch>", "subject": "[R] Salient feature selection", "body": "I am relatively new to R. I am hoping that someone will be able to point \nme in the right direction and/or suggest a technique/package/reference \nthat will help me with the following. I have:\n\na) Some explanatory variables (integers, real) - these are \"real world\" \nphysical descriptions, i.e. counts of features, etc\n\nb) Some response variables (integers, real) - these are image analysis \nmeasurements (gray-value distributions, textural descriptors, etc) of \nthe same things represented in a\n\nand I want to find out which between the two correlate best - i.e. the \nsalient features from BOTH sets (i.e. not for classification purposes).\n\nFor example, if a has 10 explanatory variables and b has 10 response \nvariables, I want to test the complete set of explanatory variables with \neach individual response (or vice versa). So, explanatory 1-10 with \nresponse 1, explanatory 1-10 with response 2, explanatory 1-10 with \nresponse 3, etc...\n\nThis should ultimately tell me which \"real world\" physical features are \nrelated best with the image analysis measurements (with the confidence \nlevel between them).\n\nI hope this makes sense?\n\nI have used SPSS AnswerTree's \"Exhaustive CHAID\" before to select a \nsubset of input features for a complete set of output features to aid \nthe creation of artificial neural networks. I want to do a similar \nthing, but it is not important for ALL explanatory and response \nvariables are used/selected.\n\nI hope that I have been clear in my intentions and I look forward to \nyour replies, Andy\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}