{"category": "spam", "to_address": "\"Jimmie Lance\" <mt@plg.uwaterloo.ca>", "from_address": "\"Raquel Willis\" <Raquelcpaoh@tlc.kscoxmail.com>", "subject": "Here comes another message from Ms. Willis:)", "body": "EVER DREAM OF MIND-BLOWING LOVE-MAKING THAT NEVER FAIL TO SATISFY?\n\nWell, you don't need to dream anymore. At last there is a solution to all\nyour bedroom setbacks. The Vibrator Ring is the latest toy taking the world\nby storm. It's fun, safe, easy-to-use, and it's available now. \n\nThe Vibrator Ring features a raised tickler to stimulate her externally,\nwhile the expandable silicone ring sends deep vibrations up the shaft for\nboth his and her pleasure. If you want unbeatable results every time, you\ncant go past this amazing new product. \n\nThe Vibrator Ring expands to fit any size and is designed to massage those\noften neglected areas. If you are ready to experience a fantastic love-life,\nthen this is the perfect product for you.\n\n\nIs your partner really happy with your love life? Why Risk It?\nhttp://www.loveyournights.net\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nwould be the to kill them the deal could get off ground. The thought of\ndoing service made Tolan smile little, the way he used to smile Nam when he\nwas doing public service by shooting anything that yellow and moved. Baker\nand Lizzard outside the door now. It took the of them to have the of one\nman, Tolan He saw Baker reach for the He saw the door open He saw Lizzard's\nskinny arm snake through the \nand reach inside the light switch. Then saw Lizzard catapult into the\nbanging the door wide open his body as he went. Baker the doorknob as if it\nwere hot. tried to turn, to run, flee but suddenly was yanked into the room\nalso, if he had been paper on the end of rubber stretched tight, then\nsuddenly door slammed closed. And The really know what they looked \nThey kind of kept to themselves. When got back, the room was He went\nthrough quickly, but except pocket-book containing women's there was\nnothing. When returned to his own room, he voices inside the room of Rocco\nNobile. moved quickly inside and saw the mayor to large uniformed police\ncaptain. The was finished and the captain was leaving. Nobile \nuntil he had gone before turning Remo and swearing softly. \"What's wrong-\"\nasked. \"Those dumb bastards. They traced the pencils they didnt bother to\ntell me it till now.\" \"So what'd find out-\" \"The pencils were at the Cole\nStationery except they weren't really bought. big came in and took box and\nrefused to for them. He was big and nasty-looking that owner just let it\nhappen. He was\n\n\nsee you tommorow\n\n\n\nRaquel\n\n\n"}