{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Joan Ramos <joaninha@comcast.net>", "subject": "[Ip-health] Inexpensive medicine not solution for real health-care savings", "body": "FYI, commentary from \" celebrations for April 14 Novartis Medicine and\nPharmaceuticals Day\" held in Istanbul.\n\nJoana\n\n---------------------------original\narticle-------------------------------------------------------------\n\n\nhttp://www.turkishdailynews.com.tr/article.php?enewsid=70956\n\nInexpensive medicine not solution for real health-care savings\nWednesday, April 18, 2007\nTurkish Daily News\n\nBUSINESS REPORT\n\n\n\n'Currently, in terms of turnover, medicine prices are 17 percent cheaper\nin Turkey than the cheapest available in Europe,' said professor Emin\nKansu. Inexpensive medicines that are marketed by India and China and\nthat doctors refrain from prescribing are now purchased in Egypt for\nsaving purposes\n\nTUTKU AYVAZ\nISTANBUL - Referans\n\nChairman of the Association of Research-Based Pharmaceutical Companies\n(AIFD) Altan Demirdere thinks the government's implementation and\nchanges in refund lists in the health system for inexpensive medicine is\nnot reasonable. AIFD and Novartis-Turkey head Dr. Demirdere added the\nassociation also does not believe that the implementation is transparent\nenough.\n\nDemirdere emphasized discounts in the prices of medicine and on-going\nchanges in refund lists do not help savings in the health care system,\ngiving German health policy as an example. ?A new research conducted in\nGermany proves that price cuts in pharmaceuticals failed to meet its\ntarget. The country saving 14 billion euros in medicine during the last\nthree years spent 17 billion euros for treatment expenses only.? With\ninexpensive medicine, expensive treatment not savings is achieved, said\nDemirdere, suggesting rational use of medicine.\n\n\n\n17 percent cheaper than the cheapest:\n\nCommenting during the celebrations for ?April 14 Novartis Medicine and\nPharmaceuticals Day,? Demirdere criticized the government for selecting\nthe cheapest medicine instead of taking the average of five-country\nreferences to determine the amount the state will pay for generic drugs.\n\nReference countries are the cheapest in the world as it is, Demirdere\nadded. ?We suggested for these countries to have an average price;\nhowever, we ignore that and adopt the cheapest price instead. Currently,\nin terms of turnover, medicine prices are 17 percent cheaper in Turkey\nthan the cheapest available in Europe.? Hacettepe University Oncology\nDepartment Faculty Member Professor Emin Kansu, attending the same\nevent, pointed out medicines, which are marketed by India and China,\nthose that doctors refrain from prescribing, are now purchased in Egypt\nfor saving purposes. However, these cheap medicines will cause worldwide\ntrouble in coming years. As for the future of pharmaceutical research in\nTurkey, Kansu told of a shortage in postgraduates for Research and\nDevelopment (R&D) programs, saying, the priority will be to bridge this\ngap of 25,000 in the labor force.\n\nHead of Corporate Research at Novartis professor Paul Herrling said the\ncompany earmarks 19 percent of its annual budget for R&D and separates\nResearch and Development activities. There are on going development\nstudies in Turkey; however, Novartis is looking for some specific\ncriteria in countries to set up research centers. These are: Academic\nproficiency, inter-university coordination, political stability and\nintellectual property rights, Herrling listed. Novartis is already\nexamining the environment in Turkey for research centers. On the other\nhand, the company realizes only 1 percent of its overall sales in\nTurkey, and accomplished just 0.1 percent of its total activities for\ndeveloping medicine in the country. ?Turkey has an environment potential\nthat we could conduct clinical research at ten times its current level.?\nHerrling added that the annual R&D budget of Novartis reaches $5-6\nbillion and $1-2 billion is allocated for development only.\n\n\n\nIreland cut corporate taxes:\n\nIreland Bioscience and Bioengineering Director Maurice Treacy shared the\nexperiences of his country in the pharmaceutical sector. He said the\nIrish government cut corporate taxes to attract more foreign investors\nand the country also has an upper hand when it comes to an educated\nlabor force. \"We are a small country,\" Treacy said, \"So, we concentrated\non an area that we feel strong about and possess expertise; we applied a\nfocused strategy. Thus, we have created an enormous base for\npharmaceutical companies.\" Ireland earmarks $3.8 billion for R&D, Dr.\nTreacy added.\n\n-------\n\nJoana Ramos, MSW\nCancer Resources & Advocacy\nSeattle WA USA\nTel. +1-206-229-2420\nhttp://ramoslink.info/\nwww.cancersurvivorsproject.org\nwww.healthyskepticism.org\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}