{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Under The Hoodia", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nShould \n      The Virginia Tech Tragedy Be Sparking The Gun Control \n      Debate?As this latest tragedy once again illustrates, the \n      availability of guns is a major issue in this country. The press corps \n      doesn't need a debate in the halls of Congress to recognize that. \n      Certainly, the international press corps has focused on the issue in the \n      wake of the shootings; the British-based Economist, for example, put an \n      American flag in the shape of a gun on its cover and proclaimed that the \n      country's \"politicians are still running away from a debate about guns.\" \n      [+ Read More]\n\nUnder \n      The HoodiaAs I noted last February, a 2004 \"60 Minutes\" \n      story about an African plant has been surprisingly popular on CBSNews.com. \n      The plant in question is hoodia zombieii, \"a natural substance that \n      literally takes your appetite away,\" according to the story. \n      Unsurprisingly, hoodia retailers liked the \"60 Minutes\" piece. [+ Read More]\n\nThe \n      Price Of Free SpeechCheck \n      out Science and Technology Correspondent Daniel Sieberg's interview \n      with BuzzMachine founder Jeff Jarvis. The \n      two talk about whether anything should be done about the more vitriolic \n      rhetoric and comments one can find on the Web. \"You can't sanitize the \n      whole world,\" says Jarvis. \"You can't clean up everything. There are going \n      to be miscreants and bad people around. And we all know to step around \n      them.\"  [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nThe \n      Public's Eyes: Big In '05\n \nRobertson \n      Out Of The Club?\n \nQuiet Newsrooms \n      and the Holiday \n      Season\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}