{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 128", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. German. CHEMNITZ - Kunstdiebstahl unter den Augen des Herrn:\n      In der Schlosskirche haben Ganoven ein Kupferkreuz mitgehen\n      lassen - direkt vom Altar. Ein Fall f?r die Kripo.\n      (Museum Security Network Mailing list)\n   2. Austria. 14 weltber?hmte Gem?lde in Banksafe entdeckt\n      (Museum Security Network Mailing list)\n   3. Thieves break into mansion house\n      (Museum Security Network Mailing list)\n   4. Swiss raid bank safe belonging to late Nazi art thief\n      (Museum Security Network Mailing list)\n   5. New Zealand. 'Meathead' call solves artwork mystery\n      (Museum Security Network Mailing list)\n   6. Mexico. Roban documentos hist?ricos del siglo XIX en Atlixco,\n      Puebla (Museum Security Network Mailing list)\n   7. An Idea Whose Time Has Come? The model for art ownership\n      protection: Real-estate title insurance.\n      (Museum Security Network Mailing list)\n   8. Twenty-seven rare 1867 coins worth more than $150,\t000 are\n      missing from their designated storage spot at the Iowa\tState\n      Historical Building. (Museum Security Network Mailing list)\n   9. Belgium. Vol d'un tableau de grande valeur ? Namur\n      (Museum Security Network Mailing list)\n  10. Australia. Web list to track thieves.\n      (Museum Security Network Mailing list)\n  11. Argentona. Investigan el robo de 12 cuadros de pintores\n      famosos (Museum Security Network Mailing list)\n  12. 'The Medici Conspiracy' co-author discusses art looting in\n      Italy (Museum Security Network Mailing list)\n  13. USA. Police called in on theft of museum money\n      (Museum Security Network Mailing list)\n  14. The man who was convicted of stealing artifacts from the\n      Kansas Cosmosphere and Space Center has been working\toccasionally\n      for a museum in Oklahoma City (Museum Security Network Mailing list)\n  15. Police investigating a bank heist ring have recovered an\n      antique piece of jewelry that was made for Queen Elisabeth of\n      Austria, better known as Empress Sisi,\tthe Winnipeg Police\n      Service said Friday. (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Sun, 3 Jun 2007 09:19:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] German. CHEMNITZ - Kunstdiebstahl unter den Augen des\n\tHerrn: In der Schlosskirche haben Ganoven ein Kupferkreuz mitgehen\n\tlassen - direkt vom Altar. Ein Fall f?r die Kripo.\nTo: \nMessage-ID: <00db01c7a5af$943d1780$bcb74680$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nDiebe klauten Kreuz vom Altar der Schlosskirche\n\nCHEMNITZ - Kunstdiebstahl unter den Augen des Herrn: In der Schlosskirche\nhaben Ganoven ein Kupferkreuz mitgehen lassen - direkt vom Altar. Ein Fall\nf?r die Kripo.\n\nChristoph Weber (48), Pfarrer der St.-Pauli-Schloss-kirchgemeinde, ist\nsauer. ?Unsere Kirche steht allen Besuchern offen - und eigentlich verlassen\nwir uns auf ihren Respekt vor den im Haus stehenden Dingen.? Doch das fremde\nEigentum war den Dieben am Nachmittag wohl nicht sonderlich heilig. Objekt\nihrer Begierde: ein 30 Zentimeter hohes kupfernes Kreuz, daran befestigt aus\nEmaille der Corpus Christi. K?nstler Helmut Senf schuf es 1971 in Erfurt.\n?Auch wenn vielleicht der reine Materialwert mit 500 Euro nicht sonderlich\nhoch erscheint, so ist es f?r uns doch ein wesentlich h?herer ideeller Wert,\nder dahintersteht?, sagt Pfarrer Weber.\n\nUnklar, ob das Kreuz mit Absicht gestohlen worden ist oder ob ein\njugendlicher Schabernack dahinter steckt. Doch die Kirche war nicht das\nerste Mal Zielscheibe krimineller Ener-gien. Erst vor zwei Wochen hatten\nn?chtliche Besucher eine Scheibe eingeschlagen, waren ins Haus gedrungen.\nBeute machten sie allerdings keine. Jetzt ermittelt die Kripo. Sprecher\nFrank Fischer (51): ?Wir suchen Zeugen, die etwas bemerkt haben.? Hinweise:\n0371/3872319. (jko)\n\nhttp://www.sz-online.de/\n\n\n\n------------------------------\n\nMessage: 2\nDate: Sun, 3 Jun 2007 09:19:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Austria. 14 weltber?hmte Gem?lde in Banksafe entdeckt\nTo: \nMessage-ID: <00dc01c7a5af$95ae0ca0$c10a25e0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\n14 weltber?hmte Gem?lde in Banksafe entdeckt \n\nZ?RICH. 14 Gem?lde von weltber?hmten Malern fand die Polizei nach einem\nHinweis in einem Banksafe in Z?rich. Die teuren Werke waren seit der NS-Zeit\nverschwunden.\n\nEinem spektakul?ren Fall von Kunstraub w?hrend der Zeit des\nNationalsozialismus sind nach einem Zeitungsbericht die Z?rcher\nJustizbeh?rden auf der Spur. Die Staatsanwaltschaft fand in einem Bank-Safe\nmindestens 14 Gem?lde von Pierre-Auguste Renoir, Claude Monet, Oskar\nKokoschka und anderen ber?hmten Malern, wie die ?S?ddeutsche Zeitung?\n(Freitagausgabe) berichtete.\n\nDer Safe geh?rte demnach dem Kunsthistoriker Bruno Lohse, der w?hrend des\nZweiten Weltkrieges im besetzten Frankreich Kunstwerke f?r Hermann G?rings\nPrivatsammlung konfiszierte, zumeist aus j?dischem Besitz. Die Gem?lde seien\nbeschlagnahmt worden und m?ssten nun auf ihre Echtheit ?berpr?ft werden.\n\nLohse war im M?rz im Alter von 95 Jahren in M?nchen gestorben. Der Fall war\nans Licht gekommen, weil ein M?nchner Kunsth?ndler ein im Weltkrieg\ngestohlenes und sp?ter angeblich ?ber Lohse erworbenes Bild der Erbin zum\nR?ckkauf angeboten hatte. Den Safe in Z?rich hatte Lohse dem Bericht zufolge\nim Jahr 1978 angemietet. In Liechtenstein laufen zudem Ermittlungen wegen\neiner Stiftung namens ?Sch?nart-Anstalt?, in die Lohse sein Verm?gen\neinbrachte.\n@apa/nachrichten.at \n\nhttp://www.nachrichten.at/\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Sun, 3 Jun 2007 09:19:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Thieves break into mansion house\nTo: \nMessage-ID: <00de01c7a5af$979ff190$c6dfd4b0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nThieves break into mansion house  \n \nA Pontefract Race Cup and tankard were among the items taken:\nPhotos\nhttp://news.bbc.co.uk/2/hi/uk_news/england/south_yorkshire/6713097.stm\n \nThieves broke into an historic mansion in South Yorkshire and stole antiques\nworth hundreds of thousands of pounds. \nThe intruders broke into the 18th Century Cusworth Hall, near Doncaster, on\nWednesday morning. \n\nPolice said among the objects stolen was a 1812 Pontefract Race Cup, worth\n?35,000. \n\nOther items included a silver teapot from 1787, a tankard dating back to\n1848 and six silver clover-design plate fittings from 1927. \n\nTwo christening mugs and three silver cased menu holders, all made in 1936,\nwere also stolen. \n\nSouth Yorkshire Police urged anyone with information about the theft at the\nDoncaster Council-owned museum to contact them. \n\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Sun, 3 Jun 2007 09:19:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Swiss raid bank safe belonging to late Nazi art thief\nTo: \nMessage-ID: <00e001c7a5af$97ef7120$c7ce5360$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nSwiss raid bank safe belonging to late Nazi art thief\n\n\n2007-06-01 18:58:50 - \n\n\nZURICH, Switzerland (AP) - Paintings from a Swiss bank safe linked to a\nnotorious Nazi art thief have been confiscated as part of an investigation\ninto whether the heir of a Jewish art collector was blackmailed, authorities\nsaid Friday.\n\nThe Zurich prosecutor's office said it raided the safe as part of a\nthree-nation probe of a German art dealer accused of conspiring with an\nAmerican art historian to withhold a painting by French impressionist\nCamille Pissarro from its rightful owner unless she paid a finder's fee\nequal to 18 percent of its value.\n\nProsecutor Ivo Hoppler said the safe was rented by a trust based in the\nneighboring principality of Liechtenstein and was accessed by Bruno Lohse,\nwho spirited away art from all over Europe during World War II on behalf of\nHermann Goering, Hitler's top aide.\n\nLohse died two months ago in Munich.\n\nConfirming reports in the Swiss weekly ?Cash? and German daily ?Sueddeutsche\nZeitung,? Hoppler said Zurich officials were acting on a judicial assistance\nrequest from Munich prosecutors, who are investigating how the unidentified\nart dealer obtained Pissarro's ?Le Quai Malaquais, Printemps.?\n\nThe painting was stolen from Jewish publisher Samuel Fischer in 1938. The\ninvestigation began on a complaint from his niece, who was not identified.\n\nSueddeutsche Zeitung estimated the value of the painting at ?5 million\n(US$6.7 million). That would put the fee demanded by the men at ?900,000\n(US$1.2 million).\n\nThe paper said the German dealer claimed to have acquired the painting from\nLohse in good faith in the 1950s.\n\nMunich chief prosecutor Christian Schmidt-Sommerfeld said the dealer\ncontested the blackmail accusation and argued that requesting a finder's fee\nwas normal in such cases.\n\nSchmidt-Sommerfeld said the investigation does not extend to the art\nhistorian because he is an American citizen and his alleged crimes would\nhave been committed outside Germany.\n\nHoppler said he could not yet confirm whether the Pissarro piece was among\nthose found in the safe kept at the Zuercher Kantonalbank. He said he would\ninform prosecutors in Munich and Liechtenstein of his findings by early next\nweek. \n\nhttp://www.pr-inside.com/\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Sun, 3 Jun 2007 09:19:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] New Zealand. 'Meathead' call solves artwork mystery\nTo: \nMessage-ID: <00dd01c7a5af$969b04b0$c3d10e10$@org>\nContent-Type: text/plain;\tcharset=\"US-ASCII\"\n\nSaturday, 2 June 2007  \n\n'Meathead' call solves artwork mystery \n\nThe words \"it is the meathead here\" were music to artist Barry Bailey's ears\nwhen a deeply embarrassed friend confessed to removing a driftwood ship\nartwork originally feared stolen from Paekakariki Beach. \n\nMr Bailey was delighted to get the call from the local businessman, who did\nnot want to be identified. \n\nThe man said he \"freaked out\" when he saw a report in The Dominion Post this\nweek quoting Mr Bailey's fear that his gift to the community had been stolen\nby \"a meathead\". \n\nMr Bailey believed his 2.4-metre Cutty Sark replica, made of driftwood and\nwith calico sails, had suffered the bad luck that the real ship had just\nencountered. \n\nThe Cutty Sark, the world's last remaining tea clipper, was badly damaged in\na fire in London last month. \n\nMr Bailey had feared his driftwood ship had been stolen within an hour of\nhim screwing it to a log on the beach last weekend. It was designed as a\ngift to the community. \n\nIt has now been revealed that a friend of his removed it to protect it from\nferocious weather conditions, putting it in his garage. \n\nThe friend, who often spoke to Mr Bailey on the beach, planned to tell him\nhe had rescued the artwork the next time they met, and to also discuss\nputting it in a more protected spot. \n\nTo remove the work, the friend had to unscrew it from a large log at the\nsouthern end of the beach. \"I wanted to save it from big tides - the sea\nwould have destroyed it,\" the friend said. \n\nMr Bailey said he was rapt. \"I feared it had met the same fate as the Cutty\nSark and gone up in flames.\" \n\nHe planned to meet residents to decide on a safer location. It could be in\nthe town centre, but he would still prefer the sculpture to be on the beach\nin the sea air where the waves could lap around it - in a more protected\nspot. \n\n\n\nYou may not copy, republish or distribute this page or the content from it\nwithout having obtained written permission from the copyright owner. To\nenquire about copyright clearances contact clearance@fairfaxnz.co.nz.\n\n\n\n------------------------------\n\nMessage: 6\nDate: Sun, 3 Jun 2007 09:19:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Mexico. Roban documentos hist?ricos del siglo XIX en\n\tAtlixco, Puebla\nTo: \nMessage-ID: <00e201c7a5af$984b25b0$c8e17110$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nRoban documentos hist?ricos del siglo XIX en Atlixco, Puebla\nNotimex / La Jornada On Line \n\n02/06/2007 15:33\n\nAtlixco, Pue. El archivo municipal de esta ciudad sufri? el robo de cerca de\n300 hojas con valor hist?rico, mismas que podr?an ya estar en el mercado\nnegro, inform? Agust?n Ayaquica, encargado del inmueble.\n\nEn entrevista, inform? que desde el pasado mi?rcoles se percat? del faltante\nde las hojas que se caracterizan por contar con sellos que datan de los a?os\nde 1810 a 1870.\n\nIndic? que los documentos refieren la historia del municipio, por ello la\nimportancia de los mismas, aunque desconoce qui?n o qui?nes pudieron haber\nsido los responsables del robo.\n\nAgust?n Ayaquica lament? que con este hecho se mutile parte de la historia\ndel municipio.\n\nSe?al? que las autoridades municipales y estatales ya fueron enteradas del\nhecho por lo que espera que en breve se d? con los responsables, aunque\nreconoci? que este robo se suma o otros de objetos hist?ricos ocurridos\nanteriormente.\n\n?La riqueza que tenemos en el archivo es tan valiosa como la de un banco,\npero lamentablemente las autoridades no lo ven as?, mucho menos en los\ntemplos de donde tambi?n se han llevado varias pinturas?, dijo.\n\nEl encargado del archivo agreg? que a la falta de inter?s de los\nayuntamientos, hay que sumarle el deterioro de las instalaciones, donde se\npuede observar humedad, abandono y orden.\n\nEl municipio de Atlixco se localiza al centro-oeste del estado de Puebla, y\nse caracteriza por su clima privilegiado, por lo que el lema de la ciudad es\n?El mejor clima del mundo?.\n\nEntre los principales atractivos que destacan est? el ex convento de El\nCarmen, del siglo XVI, as? como sus viveros donde se aprecian plantas y\nflores multicolores.\n\nhttp://www.jornada.unam.mx/\n\n\n\n------------------------------\n\nMessage: 7\nDate: Sun, 3 Jun 2007 09:19:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] An Idea Whose Time Has Come? The model for art\n\townership\tprotection: Real-estate title insurance.\nTo: \nMessage-ID: <00e601c7a5af$98f0db90$cad292b0$@org>\nContent-Type: text/plain;\tcharset=\"US-ASCII\"\n\nAn Idea Whose Time Has Come?\nThe model for art ownership protection: Real-estate title insurance\nBy STEVE YAHN\n\nIn a celebrated case reported at length in this newspaper, a Norman Rockwell\npainting that had been hanging in the home of movie mogul Steven Spielberg\nturned out to be stolen, and the Hollywood tycoon pledged to return the\n\"Russian Schoolroom\" painting to its rightful owner. Done by Rockwell on a\ntrip to Russia, the canvas shows a group of Russian schoolchildren\ncontemplating a white bust of Soviet leader Vladimir Lenin.\n\nMr. Spielberg's promise has become embroiled in a legal battle between two\nclaimants to the work, with the Federal Bureau of Investigation caught in\nthe middle between these two parties and Mr. Spielberg, who is holding the\npainting in the meantime. What isn't so well known is that if Mr. Spielberg\nhad been able to purchase something called \"art title insurance,\" his\ndefenses would be in a lot better shape than they are now.\n\nArt title insurance is an old notion, says Richard Gray, co-owner of Richard\nGray Gallery in New York and Chicago and the unofficial dean of American\ngallerists. But only with the rise of attention generated by art stolen\nduring the Holocaust and quite recently reclaimed, as well as the surge of\ndisputes surrounding looted antiquities -- not to mention the booming art\nmarket in general -- has this concept sprung to life in new forms.\n\nFor example, one potential dispute that was amicably resolved led to the\nrecent return of J.M.W. Turner's painting \"Glaucus and Scylla\" by the\nKimbell Art Museum in Fort Worth, Texas, to the heirs of John and Anna\nJaffe. This occurred after an investigation into the provenance of the\npainting, which had been in the museum's collection since 1966, revealed\nthat it had been seized by the pro-Nazi Vichy regime in France in 1943.\n\nNot long ago, John Singleton Copley's portrait of William Posonby, second\nearl of Bessborough, was returned to Harvard University more than 30 years\nafter it was reported missing. The painting belonged to the estate of\nprivate collector William M.V. Kingsland, who died in March. This, too,\ncould have been a source of dispute but was resolved when Alexander Acevedo,\nan art dealer, bought the painting from the estate and gave it to Harvard.\n\nArt title insurance functions in a fashion similar to real-estate title\ninsurance, protecting a policyholder's right to title though not\nguaranteeing the authenticity of a work of art. Title is title, but a\n\"Monet\" could be by Monet himself or by a knock-off artist.\n\nWhy didn't the idea of art title insurance stick until recently? The short\nanswer is that there has never been enough demand. \"There isn't enough\nvolume for art title and authenticity insurance, since demand is so low you\ndon't get enough premium to offset a potential loss. So you have to charge a\nlot of money, and that charge is almost unaffordable to the majority of\npeople who would rather self-insure the risk,\" says LeConte Moore, managing\ndirector and fine arts specialist at New York-based DeWitt Stern Group.\n\n\"I will say, though,\" notes Mr. Moore, one of the top fine-arts brokers in\nthe world, \"that there is much more renewed interest in this insurance today\nbecause paintings and photographs have escalated in value far beyond what\nanybody imagined. So there are a lot of people concerned about it and\nquestioning whether they should buy the insurance.\"\n\nSomebody who tried and failed to promote a form of art title insurance was\nLloyd Goldenberg, an attorney with Bryne Goldenberg & Hamilton in\nWashington. In the late 1990s, a group Mr. Goldenberg was a member of tried\nto sell a service to bank trust departments that made multiple inquiries\ninto the marketplace value of a work of art and then proposed to issue a\ncertificate of title based on those findings.\n\nBut the marketplace wasn't ready. Says Mr. Goldenberg: \"The marketplace --\nand these are sophisticated people -- just doesn't treat art, this type of\nasset, the same way they treat all other types of assets. They seem to treat\nit as art first, and an asset second, living in this Never Never Land in\nwhich they're going to trust their reputable dealers and auction houses\nabove all else. The dealers and auction houses might be reputable, but they\ndon't guarantee title.\"\n\nYet another firm that tried to promote the notion of art title insurance was\nmighty Hiscox, a syndicate of Lloyd's of London and perhaps the premier name\nin art insurance in the world. Hiscox's downfall was that given the nature\nof its business, it had to renew art title contracts on an annual basis, and\nmost customers were looking for the life-of-ownership protection that comes\nwith owning title to a home in the U.S.\n\nSo what has changed? A fledgling but well-backed insurer called ARIS Corp.\nentered the market last June. To date it has not signed up any clients\n(though some major candidates are pending), but it has attracted plenty of\nsupport, including at Hiscox, which is serving as its reinsurer.\n\n\"I've always felt there's a market there\" for insuring against defective\ntitle, says Robert Read, fine-art underwriter at Hiscox and arguably the\nmost influential arts-insurance practitioner in the world. \"It's a real\nissue, and we like the product ARIS has put together. They spent an enormous\namount of time with their due diligence.\"\n\nARIS is the result of the brother-and-sister collaboration of its chairman,\nLawrence Shindell, and president, Judith Pearson. The heart of what the two\nare offering is title protection; research and vetting services; and payment\nof all the expenses of a legal defense should one become necessary.\n\nDiffering from Hiscox's former method of operation, an ARIS policy covers\nthe full lifetime ownership of a work. If a work of art is proved to have\nbad title and must be returned, ARIS will pay for its full value -- as would\nhave been the case in the Spielberg instance.\n\nWith all the disputed art claims around, maybe this is the time that art\ntitle insurance will catch on.\n\nMr. Yahn is an art and media critic based in Croton-on-Hudson, N.Y. He was\nrecently named Editor, Special Projects of ArtCalendar magazine.\n\nhttp://online.wsj.com/\n\n\n\n------------------------------\n\nMessage: 8\nDate: Sun, 3 Jun 2007 09:19:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Twenty-seven rare 1867 coins worth more than $150,\t000\n\tare missing from their designated storage spot at the Iowa\tState\n\tHistorical Building.\nTo: \nMessage-ID: <00df01c7a5af$97c5f020$c751d060$@org>\nContent-Type: text/plain;\tcharset=\"US-ASCII\"\n\nCoins gone from state museum \nOfficials want to know what happened to the rare 'trial strikes' from 1867.\n\nBy TOM ALEX\nREGISTER STAFF WRITER\n\n\nJune 1, 2007\n\nTwenty-seven rare 1867 coins worth more than $150,000 are missing from their\ndesignated storage spot at the Iowa State Historical Building.\n\nRetiree V.E. \"Felix\" Augspurger of Des Moines has been asking about them in\nrecent years and says he finally was told that their whereabouts are\nunknown.\n\nNearly 40 years ago, Augspurger was a state employee who helped arrange a\ndisplay for the coins at the state's former historical building. For the\npast few years, he has been trying to find out what happened to them.\n\n\"At this point, we know the coins are not in their appropriate place,\" said\nJeff Morgan, a spokesman for the museum. It's unclear whether they were\nmisplaced or stolen.\n\nJim Saunders, spokesman for the Iowa Department of Public Safety, said he\ncould find no report indicating the coins had been stolen, but when he\nchecked with the staff of the State Historical Building this week, he\nlearned that the coins were missing.\n\n\"The Iowa Division of Criminal Investigation is interested in pursuing that\ninformation,\" he said. \"If anyone knows anything about the coins, we'd like\nto have them call the DCI.\" The phone number is 725-6010.\n\nThe coins are copper trial strikes made from dies used some 140 years ago by\nthe U.S. Mint. Trial strikes were often made in lighter metals as\npresentation pieces; the process let the U.S. Mint show what the coins for\nthe next year were going to look like. The collection included two examples\nof each coin so both sides could be displayed at one time.\n\nIt's not the first time something has gone missing at the State Historical\nBuilding. In 1997, staff members reported Civil War-era firearms were\nmissing. Some eventually were found in a storage area, but others still are\nmissing, Saunders said. In the past three years, some documents went missing\nfrom the building. They later were located, and an arrest was made.\n\nMorgan said security officers no longer patrol the building day and night as\nthey did before budget cuts of the early '90s.\n\n\"We are eager to work with the (DCI) to develop leads,\" he said, referring\nto the missing coins.\n\nFour of the original 34 copper trial strike coins are still in the museum's\npermanent collection of 110,000 artifacts.\n\nHere's what museum officials know:\n\nThe coin collection was checked after the guns went missing in 1997.\n\nIn 1998, it was noted that the coins were not in the spot listed for them.\n\nNine years later, an investigation is being launched.\n\nThe coins apparently came to Iowa through John Kasson, a U.S. representative\nfrom Iowa who was chairman of the Committee on Coinage, Weights and\nMeasures. He also was first assistant postmaster general in President\nAbraham Lincoln's administration in 1861.\n\nIt's not known whether the coins were on display in Iowa in the late 1800s,\nbut when they were rediscovered in 1961, they looked awful.\n\nFormer State Curator Jack Musgrove found the coins in a cardboard box and\ngave them to Augspurger, who remembers taking them home and cleaning them in\nhis kitchen. Augspurger said he knew that cleaning coins is not recommended,\nbut he said that at the time he had no choice. The coins were badly\ntarnished and were covered with some kind of dark material.\n\nJohn Holden of Garwin made a special display case for the coins in the shape\nof the state of Iowa. The collection included pennies, 2-cent pieces, 3-cent\npieces, half dimes, dimes, quarters, half dollars, and \"gold coins\" (made of\ncopper) in all denominations. The $20 trial strike pieces are worth about\n$11,000 each today, according to Steve Contursi, president of Rare Coin\nWholesalers of Dana Point, Calif. He estimated the value of a complete\ncollection of cleaned trial strikes from 1867 at $176,000.\n\nReporter Tom Alex can be reached at (515) 284-8088 or talex@dmreg.com\n\nhttp://desmoinesregister.com/\n\n\n\n\n------------------------------\n\nMessage: 9\nDate: Sun, 3 Jun 2007 09:19:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Belgium. Vol d'un tableau de grande valeur ? Namur\nTo: \nMessage-ID: <00e701c7a5af$99129460$cb37bd20$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nVol d'un tableau de grande valeur ? Namur \n\n Un tableau valant plusieurs millions d'euros a ?t? vol? ce samedi matin,\npeu avant 11 heures, au mus?e des arts anciens de Namur, a indiqu? le\nParquet de Namur. \n\nSelon ce dernier, le ou les auteurs ont d?coup? ledit tableau hors cadre\navant de prendre la fuite avec la toile. Pour l'heure, les enqu?teurs ne\ndisposent encore d'aucun ?l?ment permettant l'identification des voleurs.\nIls esp?rent n?anmoins pouvoir tirer quelques indices de la bande\nenregistr?e par la cam?ra de surveillance.\n\nhttp://www.rtl.be/article/74190.aspx?lg=1\n\n\n\n------------------------------\n\nMessage: 10\nDate: Sun, 3 Jun 2007 09:19:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Australia. Web list to track thieves.\nTo: \nMessage-ID: <00e301c7a5af$9877db00$c9679100$@org>\nContent-Type: text/plain;\tcharset=\"US-ASCII\"\n\nWeb list to track thieves\n\nNIGEL HUNT\nJune 03, 2007 12:15am\n\nPOLICE will get more than $2 million in this week's State Budget for a\ncompulsory online register for all secondhand dealers to combat\nhousebreakers\n\nThe move will provide police with a real-time list of property sold to\nsecondhand dealers or lodged at pawn shops - allowing them to track stolen\ngoods and find the thieves rapidly. \nOnline transaction recording systems are used successfully in Western\nAustralia, Queensland and NSW, and also in Vancouver, Canada.\n\nThose systems - expected to be the base for SA's register - also allow\nautomatic matching with the police database of stolen property.\n\nThey will have the ability to flag suspected stolen items with individual\ninvestigators, who are instantly notified via an email or mobile phone.\n\nPolice Minister Paul Holloway said it was expected the initiative would\nenhance the ability of police to \"further reduce crime\" in the community.\n\n\"This will improve the productivity of police resources through electronic\ndata collection, powerful database queries and automation of time-consuming\ncomparisons against stolen property records,\" he said.\n\n\"Police will be able to spend less time sifting through receipts and data\nand more time enforcing the law.\"\n\nMr Holloway and Police Commissioner Mal Hyde last year examined the\nstate-of-the-art online register in Vancouver - called Xtract - and were\nimpressed with its results.\n\nIn 2001, its first year of operation, Vancouver police increased their\nidentification and recovery rate of stolen property by 300 per cent and\nreduced property crime and theft from vehicles by 16 per cent.\n\nPreliminary SA police statistics show, to the end of April this financial\nyear, there were 10,119 reported house breakings - a decrease of 8.2 per\ncent from the 11,023 reported in the same period the previous financial\nyear.\n\nMr Holloway said if the introduction of the online register in SA resulted\nin the same crime reduction reported in Vancouver there would be a\nsignificant reduction in such offences as residential house-breaking,\nnon-residential break-ins and theft from vehicles.\n\n\"The consensus of international research is that the movement of stolen\nproperty through the secondhand dealing and pawnbroking industries can be\nlimited through stringent licence controls and a real-time web-based\ntransaction reporting system that allows cross-matching with police\nrecords,\" he said.\n\nAs part of the new measure, the Government also intended to amend the Second\nHand Dealers and Pawnbrokers Act to restrict trading hours for such\npremises.\n\nIn May last year, the Sunday Mail revealed police concerns about the\noperation of Silversun Loans and Hire at Richmond - Adelaide's only 24-hour\nsecondhand shop.\n\nA resource-intensive operation by Sturt police around the South Rd premises\nfound people from across the metropolitan area were travelling to Silversun\nto sell property.\n\nAmendments to the legislation will include measures to regulate scrap metal\ndealers to include them in the online register.\n\n\"The government has no mercy for businesses which support theft and criminal\nactivity by buying stolen goods from criminals,\" Mr Holloway said.\n\nhttp://www.news.com.au/\n\n\n\n\n------------------------------\n\nMessage: 11\nDate: Sun, 3 Jun 2007 09:19:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Argentona. Investigan el robo de 12 cuadros de pintores\n\tfamosos\nTo: \nMessage-ID: <00e101c7a5af$9827bf30$c8773d90$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nPertenecen a un cient?fico marplatense radicado en los EE.UU. \nInvestigan el robo de 12 cuadros de pintores famosos \n\nLa Justicia local e Interpol investigan el posible accionar de una\norganizaci?n dedicada al robo de objetos de arte, que sustrajo del\ndepartamento de un particular 12 cuadros de pintores argentinos famosos que\nest?n valuados en 30 mil d?lares.  \n \n\n  02.06.07 \n\nLa Justicia local investiga el hurto de 12 cuadros de pintores argentinos de\nrenombre que, en total, fueron valuados en 30.000 d?lares, los que se\nhallaban guardados en el interior del departamento de un cient?fico local\nradicado desde hace unos a?os en los Estados Unidos. Como se registraron\nhechos similares en galer?as de arte de Mar del Plata y en otras casas\nparticulares, no se descarte que sea obra de una organizaci?n delictiva\ndedicada a este rubro. Sin embargo, el abanico de sospechas abarca otras\nposibilidades.\nLos familiares del damnificado, Gerardo Vasta, con el patrocinio de los\nabogados C?sar Ventimiglia y Fortunato de la Plaza, presentaron la denuncia\nante el fiscal de la Oficina de Determinaci?n de Autores, Fabi?n Bel?n,\nquien inici? una pesquisa dando intervenci?n a la Polic?a Internacional\n(Interpol) a fin de establecer si las obras de arte permanecen aqu? o\nsalieron del pa?s en busca de compradores en el extranjero.\nAl ser consultado, el doctor Ventimiglia explic? que \"nuestro representado\nhab?a adquirido estas obras de arte y las ten?a guardadas en su departamento\nde Gasc?n y C?rdoba. El caso es que al ir a buscarlas para trasladarlas a\notro lugar, se encontr? con que ya no estaban m?s. Inmediatamente, nos dio a\nconocer el hecho, y nosotros presentamos la denuncia ante la Justicia Penal,\na fin de que se investigue d?nde se encuentran y qui?nes fueron los autores\ndel delito\".\n\nOrganizaci?n delictiva\n\nEn cuanto a si pudo ser obra de una organizaci?n dedicada a la sustracci?n\nde objetos de arte, el interlocutor se?al? que \"es una de las hip?tesis con\nla que se trabaja, pero no la ?nica. Las dem?s no podemos revelarlas, para\nque no se frustre la investigaci?n que realiza, con muy buena\npredisposici?n, el fiscal Bel?n\".\nDestac? que \"al darse a conocer esta investigaci?n, y que la polic?a y la\nJusticia est?n detr?s de variadas pistas, la venta en el mercado negro se\nver? impedida o restringida, por lo que posiblemente si los autores de este\nhecho no tienen ya compradores, tengan que vender en conjunto a un precio\ncon el que no comprar?an ni una sola de estas\".\n-?Hay en la Argentina antecedentes de la existencia de organizaciones\ndedicadas al robo de objetos de arte?\n-Particularmente, en Mar del Plata no conocemos ning?n precedente del caso.\nPero seguramente se trata de gente que conoce de arte, porque si fueran\nladrones comunes se hubieran llevado art?culos electr?nicos u otros. Pero\ncon los cuadros lo tiene que hacer alguien que sepa de su valor y que tenga\nla posibilidad de qued?rselos sin despertar sospecha o venderlos a alg?n\ncoleccionista que tiene individualizado. De otro modo, ser?a raro que se\narriesgara, teniendo en cuenta que est? cometiendo un delito...\n-Teniendo en cuenta que los cuadros estaban bajo llave dentro de un cuarto\ncerrado, ?sobre qui?n o qui?nes se ciernen las mayores sospechas?\n- No podemos revelar nada al respecto, porque forma parte de la\ninvestigaci?n...\n-Sin embargo, ?habr?a un c?rculo de sospechosos bastante definido?\n- La Fiscal?a estar?a haciendo alg?n tipo de relevamiento sobre qu? personas\ntuvieron acceso al departamento donde se guardaban los cuadros.\n\nSin despertar sospechas\n\n- ?Cu?ndo y c?mo habr?a sido el hecho?\n- Por supuesto que no tenemos precisiones, pero sucedi? hace un par de\nmeses. Los ladrones ingresaron a la casa (no podemos tampoco decir nada\nsobre si forzaron o no la cerradura, porque algunas fueron cambiadas) y\naparentando una mudanza, se llevaron los cuadros que tuvieron que cargar en\nun veh?culo. Posiblemente, haya alg?n testigo de esa maniobra.\n- ?Se ha detectado alg?n mercado donde comercializar estos art?culos?\n- Seg?n tenemos entendido, existe un mercado negro en Capital, donde hay\ncoleccionistas que realizan inversiones importantes en objetos de arte. Pero\nen el orden internacional, es muy amplio. Al margen de ello confiamos en que\nInterpol tenga detectadas las posibles bocas de venta.\n- ?Ahora, hay que esperar que la investigaci?n d? sus frutos o ya hay alguna\npista m?s o menos firme?\n- Sabemos que el fiscal Bel?n dispuso una serie de medidas que se estar?an\ncumpliendo y se recibir?an testimoniales para establecer cu?ndo fueron\nsustra?dos los cuadros. Pensamos que hay testigos importantes que pudieron\nhaber visto la supuesta mudanza con que se simul? la comisi?n del delito.\n\nLas obras sustra?das\n\nComo para alertar a la poblaci?n para que no adquiera las obras sustra?das,\nel doctor Ventimiglia dio la lista completa con sus respectivos autores\n(entre par?ntesis):\n\"Figura en descanso\" (Carpani), \"Potros\" (Castagnino), \"Desnudo\" (Diz).\n\"Paisaje\" (Fara), \"Colla y ni?o\" (Frexas), \"Tetera negra\" (Mastro), \"Calle\nde pueblo\" (Pierri), \"Desnudo\" y \"Retrato de L.T. Ag?ero\" (Presas), \"Desnudo\nsentado\" y \"Desnudo recostado\" (S?nchez), y \"Jarr?n con flores\" (Lumerman),\nadem?s de cuatro marcos bru?idos.  \n \nhttp://www.lacapitalnet.com.ar/\n\n\n\n\n------------------------------\n\nMessage: 12\nDate: Sun, 3 Jun 2007 09:19:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] 'The Medici Conspiracy' co-author discusses art looting\n\tin\tItaly\nTo: \nMessage-ID: <00e501c7a5af$98c22a70$ca467f50$@org>\nContent-Type: text/plain;\tcharset=\"US-ASCII\"\n\n'The Medici Conspiracy' co-author discusses art looting in Italy     \nBy Patricia Arrigon    Saturday, June 02 2007, 12:41 AM EDT    Views: 64  \n \nMEDICI CONSPIRACY Italian journalist Cecilia Todeschini became involved in\nthe question of art looting when she was asked to do some research for a\ntelevision documentary about Peter Watson's work on the subject. Eventually\nthe two co-authored \"The Medici Conspiracy: the Illicit Journey of Looted\nAntiquities From Italy's Tomb Raiders to the World's Great Museums\" (Public\nAffairs).\n\nIn a recent conversation with Todeschini, she talked first about Giacomo\nMedici, an Italian already convicted in 2004 for smuggling and selling\nancient antiquities. He has been sentenced to 10 years in prison plus given\na 10 million euro fine, but he is still waiting for his court appeal to be\nresolved. He declares himself innocent on all charges. \n\n\"He served, I believe, six days in 1995 or '96,\" Todeschini said. \"There are\nsome legal problems over a law passed by the former Berlusconi government\nwhich shortens the statute of limitations and has been challenged as being\nunconstitutional if applied unequally. He can't leave the country, though.\" \n\n \nEXPOSED IT ALL She also discussed the ongoing trial in Rome of Marion True,\nformer curator of antiquities of the J. Paul Getty Museum in Malibu, Calif.,\nand Robert Hecht Jr., another American who lives in Europe, for conspiracy\nto traffic in illegal antiquities. In November 2006, the government of\nGreece added their charges against True of knowingly buying a stolen ancient\nartifact, a golden wreath, which was sold to the Getty for $1.15 million in\n1993. \n\n\"The situation involves me personally,\" Todeschini said, \"because anybody\nwho cares about history and culture and the knowledge that our past can give\nus finds it unacceptable that curators of great museums have bought objects\nthey could not have not known were looted. They should be the ones to\nprotect archaeology. \n\n\"For decades they were the buyers who could pay millions of dollars and by\ndoing so encouraged looters to destroy tomb after tomb. I find this very\ndifficult to forgive, even more than the tomb robbers. I hold them less\nresponsible than a great collector or archaeologist who considers himself a\nprotector of art. \n\n\"I have seen dozens of looted tombs in Puglia (Apulia in ancient times), and\nit makes your hair stand on end. There is total destruction. There are tooth\nmarks of mechanical diggers in the structures. These structures could have\ntold us so much if they had not been brutally emptied of sizable artifacts.\nOnly broken vases are sometimes found. \n\n\"Archaeologists know this. How could they have allowed it to happen?\" \n\nShe credits some museums with doing the right thing, however. \n\n\"The Boston Museum of Fine Arts returned 13 objects to Italy, amongst which\nwere three Apulian vases and six magnificent Attic vases. There was also a\nstatue of Vibia Sabina, Emperor Hadrian's wife, over 2 meters high. \n\n\"I was there when the artifacts were shown to the press in Rome on Sept. 28,\n2006. Malcolm Rogers, director of the Boston Museum of Fine Arts, who\nreturned them said, 'This is the beginning of a new era.' He meant that\nlooted art would no longer be bought and stolen artifacts would be returned\nto their origin. I thanked him as an Italian. \n\n\"'That era is finished,' he said. Now the Boston Museum has signed an\nagreement for loans of archaeological artifacts from Italy to be shown in\ntheir museum. The Italian minister of culture went to Boston and brought\nobjects for a long-term loan.\" \n\nOther situations have increased the hope that the selling of looted\nartifacts has become more difficult. \n\n\"A couple of months ago it was made public that 12 slabs of marble from a\nfirst century B.C. funerary monument with carvings in bas-relief of\ngladiators had been discovered,\" she said. \"These were terribly important.\nIt turned out that the slabs had been on the market for four years and had\nfound no buyers. Fifteen years ago there would have been a race to buy them\nup. \n\n\"They were found by chance by an Italian man digging a road in Fiano Romano\nnear Rome. He was not a professional tomb robber, but he did not notify\nauthorities because he thought this could make him a fortune. He\nphotographed and then reburied 11 of the slabs and left one to show to\nprospective buyers. They turned out to be too important to be sold. The man\nwas caught red-handed and finally took authorities to the site when he had\ndug them up. \n\n\"The fact that there was not a single buyer, I believe, is the result of the\ncourt cases now going on. It has become very clear that no museum will buy\nlooted archaeological artifacts from Greece or Italy, but will they still\npurchase unprovenanced items from places like Iraq, Afghanistan, Peru,\nMexico, Egypt or Syria?\" \n\nTodeschini is encouraged by current Italian inquiries. \n\n\"Gen. Roberto Conforti, when he was the head of the Italian Carabinieri Art\nUnit, was an extraordinary driving force in these investigations. His\nsuggestion of establishing a legal international market for antiquities in\nwhich all items for sale would first be registered with appropriate\ngovernments, could be effective. It might not be easy to do this. If we aim\nsky high, we might reach something halfway up. Each object would be approved\nby the country of origin.\" \n\nAs to the famous pottery fragments of vases sold to the Getty museum: \"They\nare what the tombaroli (tomb raiders) call 'little orphans.' I can't say if\nthey were deliberately broken. Most vases are found in fragments. If any are\nfound intact, they would probably be found in Italy in a chamber tomb. \n\n\"I grew up in Cape Town, South Africa. When I returned to Italy over 40\nyears ago, I was in Southern Italy, in Calabria, and working in an entirely\ndifferent field. One night at a dinner party the conversation turned to\nplowing fields and sometimes finding artifacts or tombs. A man said, 'We\nbreak the vases, then number the pieces. It makes it easier to send them to\nSwitzerland.' \n\n\"These pieces that are found may have been deliberately broken or broken\nduring an unscientific dig. Often if they are fragments of a very important\nvase, when the vase is put together, several pieces are held back. The buyer\nis then shown a Polaroid photo of a missing piece. There are several known\ncases of this. The owner of the vase would pay anything to get the missing\nfragment and complete the vase. \n\n\"According to Getty documents, that museum purchased fragments of the\npriceless Euphronious/Onesimos red-figured Attic kylix depicting scenes of\nthe Trojan War (a drinking vessel that was returned to Italy in 1999) over a\nperiod of 10 years. It is difficult to maintain they were not aware that the\nfragments were looted. The dealer would not put all the fragments onto the\nmarket, but they would photograph the missing pieces. They would be used as\na hook - 'You buy this vase and I will give you this fragment.' \n\n\"The fragments were split among the dealers, such as Robert Hecht, Giacomo\nMedici and others. Although they were rivals, they worked together. They\nwould say, 'You can sell it on my behalf.' \n\nTodeschini acknowledges that she has not heard back from any of the museum\ncurators or trustees to whom she and co-author Watson sent \"The Medici\nConspiracy.\" \n\n\"The book has not gone down very well with the museum curators and\ndirectors, but we see the beginning of the end to this disgraceful epic. An\nobject is beautiful, it tells a story, but it tells us nothing about the\nfamily in whose tomb it was found or about other objects in the tomb. \n\n\"Some years ago I visited the Etruscan Museum in Rome to see an exhibit.\nAmong the objects on display was a simple silver earring like kids wear\ntoday, one of many on an ear. Because the dig was done scientifically, they\nwent in with a pathologist who examined the bones and found they were male.\nSo it was determined that the earring was worn by a man clear back then. If\nthat dig had been done by a looter, he would have gotten nothing for the\nearring, so he would probably have discarded it and we would not have known\nthat.\" \n\nA paperback edition of \"The Medici Conspiracy\" that will be released June 11\ncontains a new chapter on Greece written by Nikolas Zirganos, a Greek\ninvestigative journalist, that parallels the looting of tombs in Italy,\nsmuggling and selling the stolen ancient artifacts. \n\nPatricia Arrigoni is a freelance travel and arts writer.  \n\nhttp://www.paramuspost.com/\n\n\n\n------------------------------\n\nMessage: 13\nDate: Sun, 3 Jun 2007 09:19:52 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] USA. Police called in on theft of museum money\nTo: \nMessage-ID: <00e401c7a5af$98a66510$c9f32f30$@org>\nContent-Type: text/plain;\tcharset=\"US-ASCII\"\n\n\nPolice called in on theft of museum money\nBy Ashley Bach\n\nSeattle Times Eastside bureau\n\nBellevue police are now involved in the investigation into how at least\n$200,000 was embezzled from the Bellevue Arts Museum.\n\nMuseum officials told supporters last month that the museum's chief\nfinancial officer had stolen the money, but they didn't want police\ninvestigating while they sorted things out internally and worked with the\nemployee on a restitution plan. They changed their minds last week and filed\na police report, according to Bellevue police spokesman Greg Grannis.\n\nMuseum officials contacted police and filed a claim notice with their\ninsurance company \"to move us closer to resolving this matter and obtaining\na full financial recovery for the museum,\" wrote museum Executive Director\nMichael Monroe in a letter sent to supporters this week.\n\nThe internal investigation may be over before Bellevue police come on board.\nAn outside attorney and forensic accountant hired to look into the museum's\naccounting controls and policies may be finished with their probe in about\ntwo weeks, officials said.\n\nThe Bellevue fraud detective assigned to the case is on vacation and busy\nwith other cases and may not get started for a couple of weeks, Grannis\nsaid.\n\nIt's still unclear how much money was stolen from the museum. Officials\noriginally estimated about $200,000, but the exact amount is now up in the\nair, said museum Deputy Director Renate Raymond.\n\nAccording to a Bellevue police report, more than $284,000 was stolen between\nOctober 2005 and April 2007. The chief financial officer worked for the\nmuseum for two years before resigning last month.\n\n(The Seattle Times is not naming the financial officer because she has not\nbeen charged with a crime and has not been publicly identified by the\nmuseum.)\n\nMuseum officials said this week they've already made several changes to\ntheir accounting controls. For instance, they don't allow the acting\nfinancial officer to sign checks and they improved the way they record\ndonations, Raymond said.\n\nThe museum closed less than four years ago because of weak leadership, low\nattendance and accounting problems. Since it reopened in June 2005, a new\nset of leaders has been luring back donors and mounting a new slate of\nexhibits.\n\nAshley Bach: 206-464-2567 or abach@seattletimes.com\n\nhttp://seattletimes.nwsource.com/\n\n\n\n------------------------------\n\nMessage: 14\nDate: Sun, 3 Jun 2007 09:33:25 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The man who was convicted of stealing artifacts from\n\tthe\tKansas Cosmosphere and Space Center has been working\toccasionally\n\tfor a museum in Oklahoma City\nTo: \nMessage-ID: <013201c7a5b1$7893e020$69bba060$@org>\nContent-Type: text/plain;\tcharset=\"US-ASCII\"\n\nEx-Cosmosphere chief working after conviction\nAssociated Press\n\nOKLAHOMA CITY - The man who was convicted of stealing artifacts from the\nKansas Cosmosphere and Space Center has been working occasionally for a\nmuseum in Oklahoma City, according to a published report.\n\nMax Ary, who is free as he appeals his conviction and three-year prison\nterm, has been used periodically as a consultant, Don Otto, executive\ndirector of the Omniplex science center, told The Oklahoman on Friday.\n\nAry started putting together some of the space exhibits when he served as\ndirector at Omniplex. He was placed on leave after being indicted in April\n2005; then his contract as director was not renewed when it expired several\nmonths later.\n\nAry, founder and former director of the Kansas Cosmosphere, was accused of\nstealing artifacts from the Hutchinson museum and NASA. A jury convicted Ary\nin November 2005 on 12 counts, including theft of government property, wire\nand mail fraud, interstate transport of stolen goods and money laundering.\nHe was ordered to pay $132,374 in restitution.\n\nOtto said Ary's expertise made him the logical choice to finish up the work\nhe had started.\n\n\"This museum has no problem with Max Ary,\" Otto said.\n\nOmniplex board president James Farris agreed, but board member Butch Freeman\nsaid he didn't know Ary was being paid as a museum consultant.\n\n\"On the surface, it sounds a little concerning,\" said Freeman, the Oklahoma\nCounty treasurer. \"Certainly from an appearance standpoint I can see where\nthere would be a cause for concern.\"\n\nOtto declined to reveal how much Ary has been paid as a consultant.\n\nOtto said museums often employ consultants when their specific expertise is\nneeded. Other experts may be tapped as the Omniplex is renovated over the\nnext decade, he said.\n\n\"That's the way the system works,\" Otto said. \"A lot of people in the museum\nbusiness moonlight, if you will.\"\n\nJim Remar, senior vice president for the Kansas Cosmosphere, acknowledged it\nis fairly common for museums to hire consultants for some tasks.\n\nHe declined to comment on Ary.\n\n\nhttp://www.kansas.com/\n\n\n\n------------------------------\n\nMessage: 15\nDate: Sun, 3 Jun 2007 09:33:25 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Police investigating a bank heist ring have recovered\n\tan\tantique piece of jewelry that was made for Queen Elisabeth of\n\tAustria, better known as Empress Sisi,\tthe Winnipeg Police Service\n\tsaid Friday.\nTo: \nMessage-ID: <013101c7a5b1$78764600$6962d200$@org>\nContent-Type: text/plain;\tcharset=\"US-ASCII\"\n\nPolice investigating a bank heist ring have recovered an antique piece of\njewelry that was made for Queen Elisabeth of Austria, better known as\nEmpress Sisi, the Winnipeg Police Service said Friday.\nThe Koechert Diamond Pearl or Star of Empress Sisi (or Sissi) was found in a\nhouse in Winnipeg during a raid at the cusp of a two-year investigation of a\nstring of bank break-ins across Canada, police said in a statement.\n\nIt was stolen by a \"highly sophisticated thief\" in June 1998 from an alarmed\nand secure glass display on exhibition at Castle Schonbrunn in Vienna,\nAustria, police said.\n\nThe exhibit had marked the centennial anniversary of Empress Sisi's\nassassination.\n\nThe wife of Emperor Franz Joseph I, Sisi (1837-1898) was renowned for her\ntragic life, her beauty and ankle-length hair, a strict diet and exercise\nregime to maintain her 20-inch (50-centimeter) waistline, as well as a\nseries of reputed lovers.\n\nShe was stabbed in the heart in at age 61 by a young anarchist in Geneva,\nand her last words were reportedly: \"What happened to me?\"\n\nPolice have charged Gerald Blanchard with possession of the stolen gem, as\nwell as seven alleged accomplices, including an 83-year-old Vancouver man,\nwith a total of 101 charges of fraud, conspiracy, forging credit cards and\ntheft.\n\nConstable Jacqueline Chaput of the Winnipeg Police Service told AFP the Star\nof Empress Sisi would eventually be returned to Austria.\n\nhttp://www.chinapost.com.tw/\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 128\n****************************************\n\n"}