{"category": "ham", "to_address": "Ip-health <ip-health@lists.essential.org>", "from_address": "\"Biotech. Info. Inst.\" <biotech@biopharma.com>", "subject": "[Ip-health] Generic/Follow-On Biologics - Care to Share Your Views?", "body": "I am interested in learning the views of list members (and promoting\nlist discussion) concerning biogenerics, including the opinions of\nmany of the consumer, safety, patient and other advocates that\nsubscribe to this list.  Many groups and individuals usually very\nvocal on topics involving pharmaceutical economics and safety seem to\nbe strangely quiet on this topic and related bills currently being\nconsidered in Congress.\n\nWhat is your view regarding the U.S. implementing a regulatory regime\nfor generic biopharmaceuticals, biogenerics, follow-on proteins/\nbiologics, or whatever you may call them?  This includes the current\nbills in Congress to grant FDA authority for follow-on biologics,\ni.e., giving FDA the ability to grant full approvals for biologics\nbased on abbreviated applications (often involving bioequivalence/\npharmacokinetic trials comparing the new product with an earlier\nreference product, rather than full placebo-controlled Phase III-like\nsafety and efficacy trials), optionally with the ability to formally\ndesignate therapeutic equivalency/substitution.\n\nStated very simplistically:  Biogeneric approvals favor economics,\nnotably cheaper versions of many of the most expensive\npharmaceuticals, but potentially at the risk of safety, e.g.,\ndifficulties in post-marketing surveillance, inappropriate\nsubstitution/use of products that are not really equivalent/\nsubstitutable, and mixing-up of similarly-named prescriptions by\nphysicians, pharmacies and patients, etc.  Keeping the status quo (no\ngeneric biologics approvals; all products must be fully proven safe\nand effective, not presumed safe and effective based on similarities/\ncomparisons to a prior product, and given their own unique name)\nfavors safety, easier tracking of prescriptions, less opportunities\nfor mix-ups, etc.  But, this eliminates much or even all of the\nsavings development as a generic offers (cheaper, faster, simpler\ntesting and applications, allowing lower price) and reduces/\neliminates incentives for biogenerics development and competition in\nthe marketplace.\n\nWhere do you stand?  [Again, stating things very simplistically].  Do\nyou support the innovator/established companies, many of which are\ncriticized for overly-expensive products, and supporters in claims\nthat safety should not be compromised, that full or extensive\nclinical testing should be required for each biologic; or the claims\nof some that generic biologics, both abbreviated approvals and,\nparticularly, therapeutic equivalency, are inherently impossible\n(unsafe), due to the inherent inability for others to manufacture the\nsame complex biological product?  Do you view the innovator industry\n\"process = product\" mantra as valid/true or bogus/a smoke screen?  Do\nyou take a pragmatic/economic approach, e.g., patient groups with\ndiseases treated with available biopharmaceuticals favor anything\nthat would facilitate cheaper generics, while patient groups with\ndiseases lacking adequate therapeutics are against biogenerics/follow-\nons, because they threaten innovation, incentives and development of\nnew, needed therapeutics?\n\nFor those with an interest in biogenerics, check out my embryonic Web\nsite at http://www.followonproteins.com, and the U.S. BIOPHARMACOPEIA\nRegistry of Biopharmaceutical Products Web site at http://\nwww.biopharmacopeia.com.  The former currently provides some basic\nnews and background.  The later concerns the underlying paradigms,\nterminology, definitions and nomenclature for biopharmaceuticals and\nbiogenerics (which will largely control how these are perceived,\nregulated and marketed).\n\nThank you.\n\nRonald A. Rader\nPresident / Author:  Biopharmaceutical Products in the U.S. and\nEuropean Markets\nBiotechnology Information Institute\n1700 Rockville Pike, Suite 400\nRockville, MD 20852\nPhone:  301-424-0255\nE-mail:  ron@biopharma.com\nWeb sites:  www.biopharma.com; www.bioinfo.com; www.biomanuf.com;\n     www.biopharmacopeia.com; www.followonproteins.com\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}