{"category": "spam", "to_address": "Myrtless <myrtless@flax24.uwaterloo.ca>", "from_address": "Yesenia Dunlap <dts@greekstyle.com>", "subject": "Can you imagine that you are healthy?", "body": "\n\nYou want to save your money and get licensed medications? I bet you do!\nClick to visit us\nBuy Licensed and Quality Viagra or Cialis at US Drug store now and you'll be at the top all night long!\nClick here to have a nice dick\nEverything you need to cure yourself.\nWith best regards,\nYesenia Dunlap\n \n \nDa ia nichego takogo ne imel v vidu, Stilen, Svetom klianus. Dva gromadnyh, kazhdyj s prilichnoe ozero, glaza, dyshashchih kakoj-to Nepostizhimoj bezdonnoj pustotoj, kak budto tam, za nimi, sosredotochilas Svoia Vselennaia, smotreli na menia v upor. Taj . Vzgliad metnulsia vpered. \nDumaiu, my vse ego zasluzhili. Zaslugi Nkota prinesli mne izvestnost. Konechno, ia znachitelno prevoshodil drakonokonia po skorosti, i Rezerv byl eshche daleko ne ischerpan, no moshch tela zveria, ego stremitelnye Dvizheniia navodili uzhas i. No Sejchas, ia uveren, s nim uzhe vse v poriadke. Kstati, ty goloden? Vnezapnaia peremena temy sbila s mysli. Opershis na svoiu izzubrennuiu kosu, kostliavaia bezzvuchno hohotala i Shchelkala cheliustiami, vziraia na stol bogatyj urozhaj. Vzgliad svetlejshego podobrel. Kstati, a kak ty sumel napravit zasfernika po Puti, esli oboshelsia bez Prinuzhdeniia? Rasskazal odnu bajku. \nChem obiazan? Dolgoviazyj nabor kostej korotko kivnul i nizkim skripuchim golosom, takim zhe Nepriiatnym, kak i ego vneshnost, prodolzhil: Proshu proshcheniia za to, chto prerval vash razgovor, no u menia est dlia tebia Predlozhenie, chuzhezemec. Odnogo tebia ia by vzialsia dostavit v Kosmoport zhivym, no na tebia i tvoiu devchonku menia uzhe ne hvatit. Ia tianulsia santimetr za Santimetrom, ponimaia, kak sejchas uiazvim: esli vystrel povtoritsia, to ia Ostanus bez vtoroj kisti. chto sluchilos? U nas nepriiatnosti, Niks. ejisuminyon XF5FVVtTW1Z0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}