{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "915a 4/21 Update: Soyuz lands", "body": "\n\n\n\n\n915a 4/21 Update: Soyuz lands\n\n\n\n=================================\n\nCBS NEWS Coverage of Breaking Space News\nLast Updated: 09:15 a.m., 04/21/07 (all times Eastern)\n\nBy William Harwood\nCBS News Space Consultant\n\nChanges and additions:\n\n   04/20/07 (03:30 p.m.): Station crew prepares for Saturday landing\n   04/21/07 (05:15 a.m.): Soyuz TMA-9 undocks from space station\n   04/21/07 (07:50 a.m.): Soyuz braking rockets fired\n   04/21/07 (09:15 a.m.): Soyuz lands in Kazakhstan\n\n=================================\n\n09:10 a.m., 04/21/07, Update: Soyuz brings outgoing station crew, space tourist, back to Earth\n\nAfter a fiery plunge from space, a Soyuz descent module carrying outgoing space station commander Mike Lopez-Alegria, Mikhail Tyurin and U.S. space tourist Charles Simonyi made a safe parachute descent to Kazakhstan today, landing at 8:31:30 a.m. EDT. Touchdown marked the end of a 215-day flight for Lopez-Alegria and Tyurin, the 14th crew to live aboard the international space station, and the end of a two-week voyage by Simonyi, who rode into orbit April 7 with two new station crew members as the fifth space tourist to visit the lab complex.\n\nLanding originally was targeted for Friday, but Russian mission managers, concerned about wet conditions at the normal landing zone, delayed entry one day to permit the Soyuz to reach a more southerly zone where conditions were more acceptable. Russian recovery forces stationed nearby quickly converged on the spacecraft to help the returning crew members get out of the cramped capsule.\n\nLive television from Kazakhstan showed the Soyuz TMA-9 descent module resting on its side under a bright blue afternoon sky, surrounded by technicians and flight surgeons. About 15 minutes after touchdown, technicians carried Tyurin out of the capsule, followed by Simonyi and Lopez-Alegria. Simonyi looked and moved normally after his relatively short flight while Tyurin and Lopez-Alegria moved more slowly and appeared tired as they felt the pull of gravity for the first time in seven months.\n\nSmiling and answering questions, Simonyi described the flight as \"fantastic\" and \"everything I expected.\"\n\n\"Good to be back, good to be back on Earth. Fantastic,\" he said.\n\nSaid Lopez-Alegria: \"It was about what I expected. But it feels good. ... It's all good.\"\n\nNASA spokesman Rob Navias said by satellite phone from the landing site \"the preliminary indication from the flight surgeons here on the ground is that all three crew members are in excellent shape.\"\n\nAfter medical checks and refreshments, the spacemen will be flown to Star City near Moscow for debriefing, reunions with friends and family members and the start of the physical rehabilitation needed to readjust to gravity.\n\n\"Thank you very much for the hospitality. I enjoyed working here and working with the excellent crews and commanders,\" Simonyi said during a farewell ceremony aboard the space station earlier this morning. \"It is a bittersweet moment for all of us. We are very sad leaving the station but at the same time looking forward to continuing our work on Earth.\"\n\nLopez-Alegria echoed those sentiments early Friday, saying \"we have very mixed emotions about leaving, but it doesn't matter what we think - it is time. I just want to pass on for the whole crew that we've had a blast. It's been a short seven months in a way, but it's time to come home and hand over the torch to the next crew. ... It's been our pleasure.\"\n\nLopez-Alegria and Tyurin blasted off Sept. 18, accompanied by space tourist Anousheh Ansari. She returned to Earth Sept. 28 with the outgoing Expedition 13 crew while Tyurin and Lopez-Alegria joined European Space Agency astronaut Thomas Reiter, who rode to the station last summer on a space shuttle. Last December, Reiter was replaced by NASA astronaut Sunita Williams, who arrived aboard the shuttle Discovery. Now part of the Expedition 15 crew, joining commander Fyodor Yurchikhin and flight engineer Oleg Kotov, Williams plans to return to Earth later in the summer.\n\n\"It's hard to believe we were just having tea with them a couple of hours ago,\" Williams marveled from the space station, watching live television from the landing zone beamed up from mission control in Houston.\n\nLopez-Alegria, a veteran of three earlier shuttle missions, now holds the U.S. record for the longest single flight. He also ranks second on the list of most experienced spacewalkers, with 67 hours and 40 minutes of EVA time.\n\n=================================\n\nQuick-Launch Web Links:\n\nNASA ISS-15 Crew Page:\nhttp://www.nasa.gov/mission_pages/station/expeditions/expedition15/index.html\n\nNASA ISS-14 Crew Page:\nhttp://www.nasa.gov/mission_pages/station/expeditions/expedition14/index.html\n\nCharles Simonyi:\nhttp://www.charlesinspace.com\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}