{"category": "ham", "to_address": "Debate List <debate@lists.kabissa.org>,\n   TOES List <toeslist@yahoogroups.com>, ip-health@lists.essential.org", "from_address": "\"Riaz K. Tayob\" <riazt@iafrica.com>", "subject": "[Ip-health] \"Let Us Live and Let Them Die\" ISIS on Katz", "body": "\nThis article can be found on the I-SIS website at\nhttp://www.i-sis.org.uk/\n\n\n?Let Us Live and Let Them Die?\n*****************************\n\n\nA WHO staff member's parting salvo to the international\nhealth agency and its neoliberal approach to health.\nSam Burcher\n\n  Social scientist, Alison Katz has left the World Health\nOrganisation (WHO) after 17 years of devoted service,\ncondemning its ?Let us live and let them die? attitude,\nwhich sums up the neglect of millions of people over the\npast three decades, suffering and dying from diseases of\npoverty, including notably HIV/AIDS [1]. She is the second\nAIDS researcher to leave within the past 12 months (see On\nQuitting HIV [2] this series).\n\n?For over twenty years now, the international AIDS community\nhas persisted in a reductionist obsession with individual\nbehaviour and an implicit acceptance of a deeply flawed and\nessentially racist theory.? Katz writes. She believes that\nthe narrow and totalitarian approach to AIDS by the WHO not\nonly has had negligible effect, but also has betrayed public\nhealth principles and perversely forbidden exploration of\nany alternative perspectives. Like many others, Katz\nquestions the exclusion of a plethora of co-factors known to\nincrease biological susceptibility to infection by all\ndisease agents, including HIV, among which are under-\nnutrition, poverty, powerlessness, and the basic necessities\nfor a healthy and dignified life.\n\nShe believes that the WHO has fallen victim to neoliberal\nglobalisation, and by default, to the economic interests of\npowerful nations and the transnational corporations. In an\nopen letter dated January 2007 [3] addressed to Dr. Margaret\nChan, the incoming Director-General of WHO, Katz set out\nseven key points to steer her focus back to serving the\npublic, including the critical importance of addressing the\ncommercialisation of science, and the close relationship\nbetween industry and academia as highlighted in ISIS'\nDiscussion Paper Towards a Convention on Knowledge [4].\n\nThe neoliberal approach to health\n---------------------------------\n\n\nThere is a strong tendency in the neoliberal approach to\nhealth ? and particularly in relation to HIV/AIDS, to blame\nvictims, Katz says [5], for their faulty or irresponsible\nbehaviour. Demeaning stereotypes, coupled with flawed\nanalysis, and ineffectual policies do not appear to have\ncontributed to any significant decrease in infection rates\nin the worst affected regions such as the continent of\nAfrica. Furthermore, the world's first global sex survey\npublished in The Lancet in 2006 found that multiple sex\npartners were more common in industrialized countries where\ndisease incidence is relatively low [6]. According to Katz,\nthe dominant neoliberal perspective reinforces the\nstructures of hegemony that create poverty and powerlessness\nwhich are themselves the root causes of avoidable disease\nand death. (Poverty eradication must be central to change\nand the narrow focus to the problem is being challenged by\nwomen in Africa (see Women Confront Aids in Africa SIS 34\n[7]).\n\nEileen Stillwaggon, an associate Professor of Economics at\nGettysburg College USA, says that [8] the ecology of poverty\nmust be understood, as populations that lack access to\nmedical care and are already coping with parasitic and\nmultiple other infections, are more vulnerable to other\ndiseases, regardless of how they are transmitted. In this\nrespect, HIV/AIDS is no exception. The public health\nprinciple, neatly summarized by Pasteur as ?the bacteria is\nnothing; the terrain is all?, applies to all the diseases of\npoverty. The focus on individual sexual behaviour is itself\nhighly stigmatising - in addition to being unscientific. On\nan optimistic note, Stillwaggon observes that solutions to\nthe problems caused by almost all the co-factors exist, and\ninstitutions, like the WHO are well placed to advocate for\nthem among vulnerable populations. ISIS has proposed many\naffordable and patent-free alternative treatments to the\ndisease and its' co-factors in Unraveling AIDS [9]).\n\nIn order to neutralise the entrenched neoliberal bias within\ninternational agencies Katz believes that the WHO must\nreturn to its founding principles and advocate for attention\nto root causes ? the social and economic determinants of\nhealth and disease. In today's world, this implies\ndenouncing unfair rules of trade and commerce, the\nexploitation of national resources, and ruthless\nliberalization foisted on developing countries, all of which\nhave been shown to have devastating effects on the health of\npopulations. Furthermore, the WHO must take the lead in\nproviding scientific research with independent scientists\nfree of vested interests. To achieve its mandate of ?Health\nFor All?, the WHO must support serious science based on\nsound evidence. Millions of people's lives are at stake.\n\nPolitical prejudice within the WHO\n----------------------------------\n\n\nKatz worked for 12 years in the division of WHO dealing with\nfamily, community, sexual and reproductive health, and 8\nyears in the HIV/AIDS department. In 1999 she responded to\nan Internet discussion posting from the perspective of\nbiological vulnerability to HIV infection and racist\nassumptions underlying current policies and strategies. Her\nsupervisor, on instructions from the executive director,\nimmediately censored her by sending an email instructing\nthat she must not debate this issue. At the same time she\nreceived a request from the editor of the African Journal of\nAids Research to write up her ideas in an article [1].\nShortly after that, she was isolated from all technical work\nwithin her department for 18 months.\n\nFollowing her isolation, Katz's contract was not renewed, so\nshe submitted an internal legal appeal against the WHO for\nreinstatement and for a proper contract after serving 11\nyears on 37 temporary contracts. She won the appeal on\ncondition that she leave the HIV/AIDS department. As a\nworking mum supporting three children, she had no choice but\nto accept the Director General's offer.\n\nEfforts on Katz's part to discuss alternative approaches\nwith the WHO HIV/AIDS programme director and the UNAIDS\nexecutive director have consistently been declined, even\nafter the publication of the Lancet series, mentioned above,\nwhich supports the perspective she is advocating.\n\nIndependence of international civil servants to fulfil WHO's\nmandate\n------------------------------------------------------------\n\n\nKatz's concerns expanded to the question of independence of\ninternational civil servants, which is seriously undermined\nby neoliberal influence exerted through powerful member\nstates, private sources and extra-budgetary funding.\nPressures at this level have resulted in a repressive,\nauthoritarian and hierarchical management style, which\ndiscourages free debate. Katz joined the staff association\nto fight for proper contracts for all long term ?temporary\nstaff? - some 55 percent of the workforce. The success of\nthis action was limited. A very small proportion of ?false\ntemps? were regularized into proper contracts and then\nthrough a major, costly ?restructuring? exercise, many of\nthese long serving staff then lost their jobs, often to\ninappropriately qualified appointees with better\nconnections.\n\nThese struggles took place against what she describes as a\nbackground of nepotism, cronyism, corruption, harassment,\nfinancial mismanagement and chaotic, highly discretionary,\nhuman resources management [5]. Furthermore there is an\nunder representation of Africans, Asians, Latin Americans,\nor Eastern Europeans within staff departments. The\npredominant influence of the UK, USA and Canada, as well as\nAustralia, and New Zealand; whose representatives are\ninvariably white, male, Anglo-Saxon Protestants linked by\npowerful networks prevails.\n\nWHO's first strike and out\n--------------------------\n\n\nTogether with a small group in the staff association, Katz\norganized a one hour work stoppage, the first industrial\naction in WHO's history, in which 700 staff participated.\nHer post was abolished three weeks after the work stoppage\nand three weeks before the normal renewal of her 2-year\ncontract. Swiss unions and staff association lawyers qualify\nthis as interference in the right of association; the WHO\nadministration qualifies it as a ?coincidence?.\n\nKatz believes that the WHO must respect international labour\nstandards, including negotiation status for the staff\nassociation, in line with ILO (International Labour\nOrganisation) covenants; to provide workers with formal\npower, adequate funding, and strong links to a bona fide UN\numbrella union. WHO staff should be held accountable to\nWHO's 1978 constitutional mandate, to the Alma Ata\nprinciples underlying Health for All, and to the UN Charter\nand should fully understand the duties and responsibilities\nof public service.\n\nWHO's challenge to achieve Health for All\n-----------------------------------------\n\n\nKatz calls for a return to a basic needs and rights-based\napproach to health [1] in order to provide a sustainable and\nmeaningful response to AIDS that is simultaneously a\nresponse to all the diseases of poverty. An alternative\npolitical strategy for AIDS and its co-factors would embrace\nmacroeconomic reforms for a fair, rational and sustainable\ninternational economic order so that democratically elected\ngovernments may reasonably meet people's basic needs,\nincluding health, without external interference.\n\nIn her open letter [3], Katz urges WHO's newly elected\nDirector General, Dr Chan, to address the following major\nissues in order to fulfil her vision. A focus on inequality\nrather than poverty; holding meetings and consulting with\nthe poor rather then the rich; a solid, equitable tax base,\nnationally and internationally, rather than public-private\npartnerships; knowledge for the public good rather than\ncorporate ?science?; respect for ethical values and an\nappropriate balance between loyalty to WHO's constitutional\nmandate and loyalty to current governments of powerful\nmember states and current office holders.\n\n\nRead the rest of this article here\nhttp://www.i-sis.org.uk/LULALTD.php\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}