{"category": "ham", "to_address": "\"Eben Eliason\" <eben.eliason@gmail.com>,\n   \"Bert Freudenberg\" <bert@freudenbergs.de>", "from_address": "Alan Kay <alan.kay@squeakland.org>", "subject": "Re: [sugar] Rebe", "body": "\n\nWell, objects need some machinery behind them. The machinery could be\nSqueak, or it could be Python, or JS, or ...\nAs I've mentioned in the past, on the OLPC, one of the ways that\nintegration could have been done (and still could be done) would be to\nuse something like X windows without frames to allow compositing of\ngraphical front-ends of media objects. \nA composited collection would be what Etoys calls a \"project\",\netc. From this point of view everything is like a widget but could be\nmade from different stuff,\n From the object perspective all the graphical properties of the\nobjects/\"windows\" are the same, but the back-end drivers for\nthe phenomena could be rather different. This is \"windows without\nwindows\", which is kind of what the OLPC really needs.\nAlso, since Squeak allows plugins, all of this could be done in Squeak,\nbut I don't think that is the point here. I would rather see a richer\nbetter architecture using the chosen paradigm (e.g. Python) than do any\n\"language wars\".\nBut I will just gently say again that \"Sugar can and should be a lot\nmore integrated in its approach to dealing with many different kinds of\nmedia objects. They really need to be combined freely and not be bound to\napplications but should all be able to populate any \"document\"\nor \"project\".) Etoys uses one way to do this.\nCheers,\nAlan\nAt 01:34 PM 6/21/2007, Eben Eliason wrote:\nI think the biggest point to be\nmade here is an argument for a \"document\" or \"object\"\nof sorts.  Etoys definitely seems to have most of the types of\ninteraction and media embedding solutions I believe Rebecca and I both\nwant, but (as far as I know, though I admittedly don't know that much) it\ndoes so in an all encompassing environment.  What we really need is\na lightweight format that lets one pass around these\n\"scratchpads\" or \"collages\" as objects, so the\nteacher can create a file, pass it out as homework, etc.  I could be\nvery wrong in my assumptions, though, so please correct me where I\nam.  I see lots of potential for Etoys, and I'd like to better\nunderstand how it integrates with Sugar now, and how we can push it in\nthe most effective direction. \n\n- Eben\nOn 6/21/07, Bert Freudenberg\n<bert@freudenbergs.de>\nwrote:\n\nIndeed, \"scratchpad\" describes Etoys pretty precisely\n;)\nYou can draw, write (even with multi-column text layout flowing\naround abjects), and of course calculate.\nIt's not just \"type anywhere and a curve pops up\", although\nin fact \nsuch an extension exists (but not included in the OLPC Etoys\nversion): called MathMorphs and MorphicWrappers done by the\nArgentinian Squeak community a couple years ago:\n       \n\n\nhttp://www.dm.uba.ar/MathMorphs/\nand updated to work in recent Squeak releases\n       \nhttp://wiki.squeak.org/squeak\n/5855\nIf there is enough interest in this (and I agree it's a great \nenvironment for exploring Math) we might try to find someone\nporting\nit to the OLPC version. Or maybe it just works if installed, I\nhaven't tried (unfortunately our plates are still full with\nlower-\nlevel stuff). \n\n- Bert -\nOn Jun 21, 2007, at 22:01 , Eben Eliason wrote:\n> Rebecca -\n>\n> This sounds similar to some of my ideas for\n\"Collage\"...allowing\n> combinations of text, drawing, image, and other media formats in\na \n> freeform canvas.  The response there seemed that Etoys was,\nin many\n> ways, already providing such a thing.  I think this is a\nreally\n> interesting area though, and the potential to be able to\nsend\n> multimedia documents around, specifically in an educational\n> environment, is huge. Do you have more thoughts on specifically\nhow\n> this could be distinguished from Etoys?\n>\n> Additionally, there is the Sophie project, but I'm not that\n\n> familiar with it or how far along they've come with the project\non\n> the XO.\n>\n> - Eben\n>\n>\n> On 6/21/07, Rebecca Gettys\n<\nrebecca.gettys@comcast.net > wrote:\n> Hello all,\n> I had an idea while playing witha green machine...this may be a\nlittle\n> late, I don't know. What if ther was some sort of\n\"scratchpad\"\n> activity,\n> not draw, or write,or calculator but a kind fusion of all three.\n\n> mathimatical equasions could be typed out and then they could\nsolve\n> with\n> typing and or drawing for their work, and they could write\nguides and\n> picture books and such with this activity as well. Is this in\n\n> possible/in the plans/something similar is being made???\n> ~Rebecca Gettys\n>\n\n\n\n_______________________________________________\nSugar mailing list\nSugar@lists.laptop.org\n\nhttp://lists.laptop.org/listinfo/sugar\n\n"}