{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Isiah Russo\" <powcirclejskatedeq@circlejskate.com>", "subject": "Control your weight and appetite", "body": "\nAnatrim will change your life\n\n\n\n\n\n\nAnatrim – The latest and most fascinating product for over-weight people is now available – As could be seen on CNN.\n\n\nCan you retain all the cases when you asked yourself to do any thing for being saved from this quickly growing number of kilos? Luckily, now no big price is to be paid. With Anatrim, the ground-breaking pound-melting medley, you can get healthier life style and a really slender figure. Just look at what people write!\n\n\n\n\"It’s quite difficult to acknowledge it but I was a junk food addict. \n\n\nI greedily swallowed up all this trash \n\n\nand just could not stop. \n\n\n\n\nThis misery finished when I started course of taking Anatrim! \n\n\nGod,\n\n\n\n\n my appetite vanished, \n\n\nmood improved and I’m the happiest person in the world 23 pounds in 2.1 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person in the world!\"\n\n\n\n\n\nSilvia D., Washington\n\n\n\n\n\n\"I had weight problems since a boy. \n\n\nIt’s pretty hard to imagine how I detested being mocked at school. \n\n\n\n\nI detested my stoutness and I abhorred myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nIt literally took me out of this terrible nightmare! Thanks and thanks to you, guys.\"\n\n\n\n\n\nSerge Smith, San Francisco\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was luckily saved! I got into the circle, depression – eating more – more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOne my best friend showed me web page and I asked for my pack of Anatrim at the same time. \n\n\nThe results were splendid, my appetite came to normal level, I was often in a good mood, and, certainly, I tightened my belt with no regrets. And you see, the sex became fantastic, too!\"\n\n\n\n\n\nMike\n\n\n\n\n There are lots of gratitudes happy people leave after trying Anatrim. Don’t you gonna add yourself to the tens of thousands of slender buyers and try this natural appetite abating power boosting product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}