{"category": "ham", "to_address": "<ip-health@lists.essential.org>", "from_address": "\"Sean Flynn\" <sflynn@wcl.american.edu>", "subject": "[Ip-health] [korus-fta may be changed?", "body": "\nFrom: Michael Palmedo\n\n[snip]\n\nUSTR has taken the position that an FTA can still be changed over the\nnext\n30 days up to the deadline when U.S. industry advisors have to complete\ntheir assessment of the deal, according to a USTR spokesman.\n\n[snip]\n\n-----Original Message-----\n\nInside US Trade\nBush Administration Provides Partial Korea FTA To Congress\n______________________________________________\n\nDate: April 6, 2007\n\nThe Bush Administration mid-week provided Congress parts of the text for\nthe\nnewly concluded free trade agreement with Korea but has not committed to\na\ndeadline of when it will provide the full text, according to\ncongressional\naides.\n\nThe Office of the U.S. Trade Representative submitted \"more than half\"\nof\nthe FTA text to Congress and cleared industry and agriculture advisors\nwho\nwill have to assess the agreement for a formal report to Congress within\na\nmonth, Assistant U.S. Trade Representative for Japan, Korea and APEC\nWendy\nCutler said on April 5.\n\nBut a critic of the FTA said that the text provided does not cover many\nof\nthe controversial issues that were settled in the last round of\nnegotiations\nthat ended on April 1.\n\nDeputy U.S. Trade Representative Karan Bhatia said on April 2 the U.S.\nand\nKorea are in the process of \"writing up\" the agreement after their final\nmarathon negotiating session, but he emphasized that was not unusual.\n\"There\nis always additional legal drafting that needs to occur, so we'll be\ndoing\nthat,\" he said.\n\nUnresolved is the issue of which standards the FTA should contain with\nrespect to labor and the environment. USTR says the text now reflects\nthe\nobligation for each signatory to enforce its own laws, a standard that\nHouse\nDemocrats have criticized as insufficient and are seeking to strengthen\nin\ndiscussions with the Administration for a new FTA template.\n\nAs a result of these on-going efforts, there \"may be a need\" to revisit\nthe\nlabor and environment issues, Bhatia said. He signaled that Korea was\nnot\nhappy with the fact that there was no final U.S. government position on\nthe\nlabor and environment provisions. \"[If] it turns out that there are\nchanges\nthat would need to be made on labor and environment in order to obtain\ncongressional passage, . . . we'll make a decision jointly as to whether\nthose changes would be acceptable to Korea,\" he said.\n\nBhatia emphasized that Korea is a \"different case\" in terms of labor\nrights\ncompared to other countries with which the U.S. has concluded FTAs\nbecause\nit has strong labor rights and strong unions.\n\nUSTR has taken the position that an FTA can still be changed over the\nnext\n30 days up to the deadline when U.S. industry advisors have to complete\ntheir assessment of the deal, according to a USTR spokesman.\n\nThe Bush Administration on April 1 formally notified Congress of its\nintent\nto sign the FTA just \"minutes before the expiration of the [statutory]\ndeadline\" of midnight, and this was possible because Congress agreed to\nhave\nsomeone available to formally receive the letter of notification at that\ntime, the spokesman said.\n\nCongress was out of session at that time, but the fast-track law does\nnot\ncontain a requirement that Congress be in session to receive the formal\nnotification of an Administration's intent to sign a trade agreement,\naccording to a Senate aide. Therefore, the Administration met the\nstatutory\nrequirements of the fast-track law, he said. Separately, a USTR\nspokesman\nsaid the deadline for the submission of the notification was determined\nafter consultations with Congress and an internal assessment by USTR\nlawyers.\n\nU.S. negotiators had initially told their Korean counterparts that the\ndeadline was late March 30 in Washington, D.C.\n\nThe fast-track law provides that a trade agreement can be signed 90 days\nafter the administration formally notifies to Congress its intent to do\nso.\nNotifying the Korea FTA on April 1 means it can be signed before fast\ntrack\nexpires on July 1 this year. Once a trade agreement is signed, it can be\nconsidered under fast track with an up-or-down vote even after the law\nitself has expired.\n\nBhatia also said the Korea FTA will pressure other Asian economies to\nnegotiate FTAs with the U.S. \"To be honest with you, there is a\npossibility\nthat a successful Korea-U.S. FTA will be the stepping stone to a wave of\nliberalization in East Asia.\"\n\nHe also said the FTA with Korea contains stronger commitments than any\nother\nFTA negotiated by the U.S. in such areas of financial services,\ntransparency\nand competition.\n\n\nInside US Trade\nBhatia Cool To Auto Changes In Korea FTA, Takes On Critics\n_______________________________________________\n\nDate: April 6, 2007\n\nDeputy U.S. Trade Representative Karan Bhatia this week ruled out\nchanges to\nthe auto provisions of the newly negotiated U.S.-Korea free trade\nagreement\nas demanded by House Energy and Commerce Committee Chairman John Dingell\n(D-MI) and House Ways and Means Trade Subcommittee Chairman Sander Levin\n(D-MI).\n\n\"With respect to changes during the 90-day period to the auto\nprovisions, I\ndon't anticipate such changes,\" Bhatia said in an April 4 press\nconference.\nHe insisted that the FTA automotive provisions took \"carefully into\nconsideration the views expressed by industry and also by members of\nCongress\" and will enable American manufacturers to access the Korean\nmarket.\n\nBoth Levin and Dingell charged in their respective public statements\nthat\nthe FTA negotiators disregarded the proposal from members of Congress\naimed\nat correcting the automotive trade imbalance between Korea and the U.S.\nInstead, Dingell said, the agreement has created new opportunities for\nKorean carmakers and not for the U.S. industry.\n\nBoth Levin and Dingell said they would vote no on the agreement in its\ncurrent form. Separately, Sen. Debbie Stabenow (D-MI) strongly\ncriticized\nthe Korea FTA and vowed to defeat it at all costs. \"The automobile\nindustry\nbuilt the middle class in this country, and by supporting this agreement\nthe\nAdministration has turned its back on our working families,\" she said in\nan\nApril 2 statement.\n\nSimilarly, Ford Motor Company and Chrysler Group as well as the\nAutomotive\nTrade Policy Council, which represents all three U.S. automakers on\ntrade\nissues, expressed disappointment over the outcome of the negotiations\nbut\nstopped short of strong criticism. General Motors, which has operations\nin\nKorea through its partner company, GM-Daewoo, failed to issue a\nstatement.\n\nFord Motor Company's Vice President of International Governmental\nAffairs\ncalled on Congress to reject the FTA in its \"current form\" in an April 2\nstatement. Chrysler Group in an April 2 statement also pledged to oppose\nthe\nagreement \"as we currently understand it.\" The Chrysler statement\npointed\nout the company has supported every past FTA the U.S. government has\nnegotiated.\n\nHowever, one private-sector source speculated that the auto companies,\nthough displeased with the outcome of the negotiations, might not lobby\nhard\nagainst the FTAs, given the other major issues for which they may need\nadministration cooperation. This includes fuel standards, developing an\nalternative fuel infrastructure and legacy costs, he said.\n\nThis may mean that the UAW will emerge as the only strong force in\nlobbying\nagainst the Korea FTA, according to this source. In its statement, the\nUAW\nurged Congress to reject the deal, which it said is one-sided and\nthreatens\n\"tens of thousands of U.S. auto jobs.\"\n\nBhatia downplayed this criticism and insisted that the auto industry is\nbetter off with this agreement than without it because the FTA provides\nfor\nthe elimination of tariff and non-tariff barriers in the Korean market.\n\"Without this agreement, there is no such assurance,\" he said. \"I would\nsuggest that [the industry] very much would be better off with the\nagreement.\"\n\nThe FTA would phase out the U.S. tariff for certain cars immediately and\nthe\n25 percent truck tariff over 10 years without establishing any specific\nmarket access targets, according to U.S. officials. Some sources\nspeculated\nthat the U.S. auto industry is most unhappy with the end of the truck\ntariff, which the congressional automotive proposal sought to exclude\nfrom\nthe FTA.\n\nThe 2.5 percent U.S. auto tariff will be immediately be eliminated for\ncars\nwith engine sizes up to 3,000 ccs, Bhatia said on April 2. One\nprivate-sector source said that this covers the bulk of the cars that\nKorea\nexports to the United States. This would exclude luxury cars or sports\nutility vehicles, he said.\n\nIn addition, the FTA would phase out Korea's 8 percent tariff on U.S.\ncars\nimmediately upon entry into force, Bhatia said.\n\nUnder the agreement, Korea agreed to restructure its engine displacement\ntax, which the U.S. had sought to eliminate as a non-tariff barrier, he\nsaid. It will revamp its structure in the first three years after\nimplementation to \"require the leveling of the taxes\" so that cars of\nthe\nsize the U.S. makes \"compet[e] on a level playing field with somewhere\nbetween 70 and 90 percent of the domestic market.\"\n\nAssistant USTR for Japan, Korea and APEC Wendy Cutler said Korea's\nspecial\nconsumption tax would be cut to 5 percent from its current 10 percent\nwithin\nthree years after implementation.\n\nCutler said Korea also agreed to reduce the number of categories of cars\nsubject to the tax. By year three of the FTA, she said, about 80 percent\nof\nKorean and imported cars will be in a common category for engines 1,000\nccs\nand above, while cars 1,000 ccs and below will be in a second category.\n\nIn addition, Korea has agreed to a bilateral working group that would\nkeep\nabreast of government initiatives on standards development to prevent\nfuture\ntrade problems. Bhatia said that the group is meant to promote\ncoordination\nbetween the U.S. and Korea on regulatory issues.\n\nThe bilateral working group features a built-in transparency requirement\n\"to\nensure that there is not coordination [between the Korean government and\nKorean industry] that we're not aware of with respect to technical\nstandards,\" Bhatia said. \"The Koreans can bet that any time they share\nwritten information with any stakeholder outside of their government\nconcerning a regulation or a technical standard, they have to provide\nthat\nsame information to the U.S.-Korea bilateral working group on\nautomotive.\"\n\nThe FTA also contains an expedited dispute settlement process for autos\nthat\nwould last six months between the formal launch of a dispute and the\npanel\ndecision, Bhatia announced. A signatory that brings a successful case\nwould\nhave the right to snap its tariffs back to most-favored nation levels,\nhe\nsaid. \"We think that is a very powerful incentive not to violate any of\nthe\nFTA commitments in this area, and the fact that reimposition could\nhappen\nimmediately upon the finding by the panel only enhances that deterrent\neffect,\" Bhatia said. \"The dispute settlement provision I think very\nclosely\nparallels the request that Congress put forth to us.\"\n\nBhatia also said the FTA addresses a set of emissions regulations to\nfacilitate U.S. automotive exports to Korea. Specifically, he said that\nunder the FTA, some U.S. cars can enter Korea if they follow a\nCalifornia\nemissions standard, rather than a harder-to-meet Korean standard. --\nLuke\nEngan\n______________\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}