{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Dwayne Gold\" <wuferoflirtspab@eroflirts.de>", "subject": "Control your weight and appetite", "body": "\nBe leaner and slimmer by next week\n\n\n\n\n\nAnatrim – The latest and most attracting product for weighty people is now available – As were seen on CNN\n\n\n\nDo you know excessive body kilograms kill a plenty of people around the planet? We know you hate the unsightly appearance of those people and the social prejudice against them. \n\nOr, maybe, you’ve not the will to withstand an assault of your terrible eating habits. If you think it sounds familiar, then we got something to propose to you!\n\n\n\n\n\nHere comes Anatrim, the new product for the elimination of your body’s extra weight. The most astounding thing is that Anatrim raises the quality of your life by soothing your feeling of hunger and giving you better spirit. Look at some e-mails from our customers:\n\n\n\n\n\n\"It’s great! \n\n\nI stopped stuffing myself with food and watching TV \n\n\nI became keen on exercise.\n\n\n\n\n\n\n Anatrim set me back on the right track.\n\n\n I feel as fit as a fiddle now and lots of men stare hard at me!\"\n\n\n\n\n\n\nMaria H., Bellevue WA\n\n\n\n\n\n\n\"Passive weight reducing was of little result to me. I was very hard for me to restrain my ravenous appetite. \n\n\nOne day I heard about Anatrim in the commercial and it brought a great influence on me.\n\n\n I had tried to take it, and my wife said I’m not more a weighty man now, 4 months later. \n\n\n33 pounds have gone away and I keep still losing them! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nDave Klark, Bellevue WA\n\n\n\n\n\nAnatrim helps you to realize that you got no such great need for the constant eating. It raises your spirit up, gives you energy, and attacks useless kilos. All thanks to its mighty newly-elaborated formula!!\n\n\n\nFind out latest intelligence about this excellent product now!\n\n\n\n"}