{"category": "spam", "to_address": null, "from_address": "john judge <jjudge@wmail.saigonnet.vn>", "subject": "ENQUIRY", "body": "Good day, I am John Judge, a staff of ADAM & COMPANY I\nam contacting you independently of my investigation and no one is\ninformed of this communication. I would like to intimate you with\ncertain facts that I believed would be of interest to you.I Would\nrespectfully request that you keep the contents of this mail\nconfidential and respect the integrity of the information you come\nby as a result of this mail. \nI am contacting you in respect of $10.5 Million USD deposited with\nour private bank whose original depositor died in mid 2002,According to\npractice, The bank will by the end of its financial year broadcast a\nrequest for statements of claims,failing to receive viable claims they\nwill probably revert the deposit back to ADAM & COMPANY.This will\nresult in the money entering the ADAM & COMPANY accounting\nsystem,This will not happen if I have my way, the world of private\nbanking especially is fraught with huge rewards for those who occupy\ncertain offices and oversee certain portfolios.As a matter of\nfact,In line with our internal processes for account holders who\nhave passed away,we instituted our own investigations in good fate to\ndetermine who should have right to claim the estate. This investigation\nhas for the past years been unfruitful. We have scanned every continent\nand used our private investigation affiliate companies to get to the\nroot of the problem. It is this investigation that resulted in my\nbeing furnished with your details as a possible relative of the\ndeceased. \nMy present official capacity as the Head of private banking sector\ndictates that I am the only party to supervise the investigation and the\nonly party to receive the results of the investigation,leaves me as the\nonly person with the full picture of what the prevailing situation is in\nrelation to the deposit and the beneficiary of the deposit. \nMy proposal:I am prepared to place you in a position to initiate\nthe release of the deposit to you as the closest surviving relation,Upon\nsuccessful delivery of the deposit to you,I am prepared to share the\nmoney with you. That is: I will simply norminate you as the next of kin\nand have them release the deposit to you. We share the proceeds 50/50\n%.The alternative would be for us to have The bank ADAM & COMPANY\ndirect the funds to another bank with you as account holder. This\nway there will be no need for you to think of receiving the money from\nThe bank. We can fine-tune this based on our interactions am aware of\nthe consequences of this proposal. I ask that if you find no interest in\nthis project that you should discard this mail. I ask that you do not be\nvindictive and destructive. If my offer is of no appeal to you, delete\nthis message and forget I ever contacted you.\nMy present official capacity as the Head of private banking\nsector I assure you that I could have the deposit released to you\nwithin few days. I  shall validate the claim, make a customary\nwriting report that you are the Beneficiary.This report will validate\nthe bonafide of your claim and confirm you as the beneficiary and\ntherefore entitled to an allocation of Control Approval code for the\nrelease of the deposit by the bank .once i validate the claim, the bank\nis bound to approve same, this is why i have an unflinching confidence\nin the safety of our arrangement.The transaction will be 100% legal.\nFrom the foregoing, you are therefore able to appreciate why i have\nhammered on the absolute necessity of our maintenance of confidentiality\nof the project and the transfer even after we have disbursed the money\nafter arrival in your position.\nI am not a criminal and what I do, I do not find against good\nconscience,this may be hard for you to understand, but the dynamics\nof my industry dictates that I make this move. Such opportunities only\ncome ones' way once in a lifetime. I cannot let this chance pass me by,I\nam a family man and this is an opportunity to provide them with new\nopportunities.There is a reward for this project and it is a task well\nworth undertaking. I have evaluated the risk and the only risk I\nhave here is from you refusing to work with me and alerting my bank.\nI am the only one who knows of this situation,If you find yourself able\nto work with me, contact me through this email account. If you give me\npositive signals, I will initiate this process towards a conclusion. I\nwish to inform you that should you contact me via official channels; I\nwill deny knowing you and about this project.  \nI repeat, I do not want you contacting me through my official phone\nlines nor do I want you contacting me through my official email account.\nContact me only through the numbers I will provide for you and also\nthrough this email address. I do not want any direct link between you\nand myself. My official lines are not secured lines as they are\nperiodically monitored to access our level of customer care in line with\nour Total Quality Management Policy.Please observe this instruction\nreligiously.\nAwaiting your immediate response. Thanks for your\nco-operation.\nPlease to my private email address jjudge10@sify.com yours\nfaithfully,John Judge\n \n------------------------------------------------------\n**This mail was sent by SaigonNet WebMail 1.0\n------------------------------------------------------\n\n"}