{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 12, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESBush Presses GOP On Immigration\nWith his immigration reform plan stalled in Congress, President Bush made a rare personal appearance on Capitol Hill hoping\n                        to sway Senate Republicans to back the bill. Mr. Bush said the status quo \"is unacceptable.\" More...Watch: Bush On Immigration Bill\n• Hamas Captures Key Palestinian Facility\n                     \t\t\t\t\t| Watch• U.S.: Iran Transferring Weapons To Taliban• House Panel Probes \"Poisoned Patriots\"U.S.5 Kids Die In Pittsburgh House Fire\nFire swept through a three-story home in Pittsburgh, killing five young children, ages 2 to 7, who were believed to have been\n                        under a babysitter's care at the time. Two other children were taken to hospitals. Police are looking for the babysitter. More...Watch: 5 Kids Dead in Pittsburgh Fire\n• Ga. Teen Still Jailed, Despite Court Order\n                     \t\t\t\t\t| Watch• The Cruel Fate For A Boy Named Osama\n                     \t\t\t\t\t| Watch• Duke Lacrosse DA Ethics Trial Begins• More StoriesWorldHamas Captures Key Palestinian Facility\nHamas now occupies the headquarters of the Fatah-allied security forces. Meanwhile, Mahmoud Abbas' Fatah movement is considering\n                        pulling out of the government coalition with Hamas as the factional fighting in Gaza intensifies. More...Watch: Gaza Nears Civil War\n• U.S.: Iran Transferring Weapons To Taliban• Drug Wars Endanger Mexican Press• U.S. Kills 7 Afghan Cops In Friendly Fire• More StoriesPoliticsFBI Chief Flying High In Anti-Terror Jet\nThe Washington Post says FBI chief Robert Mueller routinely flies a $40 million jet intended for crucial anti-terror work\n                        to speeches and appearances. And Giuliani hangs on as Thompson surges. Joel Roberts has the best of the day's headlines. More...\n• Clinton Gets Campaign Link To Latinos\n                     \t\t\t\t\t| Watch• White House: No Watch-Gate\n                     \t\t\t\t\t| Watch• Bush Presses GOP On Immigration\n                     \t\t\t\t\t| Watch• More StoriesHealthFDA Keeps Eye On Body Parts Companies\nFederal regulators say they have dramatically boosted inspections of companies that harvest cadaver body parts for transplant,\n                        acknowledging weaknesses in government oversight of the multibillion-dollar human tissue industry. More...\n• China  Plays Down Food Safety Problems• Getting Pumped May Aid Heart Patients\n                     \t\t\t\t\t| Watch• Sun Safety Vital At A Young Age\n                     \t\t\t\t\t| Watch• More StoriesSciTechHouse Panel Probes \"Poisoned Patriots\"\nFederal health investigators say Marine families who lived at Camp Lejeune in North Carolina over three decades drank water\n                        contaminated with toxins as much as 40 times over today's safety standard. More...\n• Deaf Dolphin Gives Birth In Florida\n                     \t\t\t\t\t| Watch• Atlantis Mission Extended For 2 Days\n                     \t\t\t\t\t| Watch• Auto Industry Plays The Safety Card\n                     \t\t\t\t\t| Watch• More StoriesBusinessAuto Industry Plays The Safety Card\nIn radio ads and over the Internet, the auto industry is pushing a message that implies that tougher standards will force\n                        automakers to make smaller and lighter cars that are not as crashworthy as today's less-efficient models.  More...Watch: The Benefits Of Going Small \n• Four Inexpensive, Easy Home Improvements• Many Baby Boomers Plan To Retire Late• Aviation Expert Blasts FAA\n                     \t\t\t\t\t| Watch• More StoriesEntertainmentAbout 12 Million Watched \"Sopranos\" Finale\nAn estimated 11.9 million people watched Sunday's finale of HBO's \"The Sopranos\" - and every one of them seemed to have an\n                        opinion about the series' open-ended conclusion. More...\n• Paris And Lindsay: Is The Party Over?\n                     \t\t\t\t\t| Watch• Soap Stars Glam Up For Daytime Emmys\n                     \t\t\t\t\t| Watch• Kelly Clarkson: Love Doesn't Come Easily• More StoriesOpinionGarbage In, Garbage Out\nCBSNews.com legal analyst Andrew Cohen observes a lack of uniformity in how the Bush administration treats terror suspects,\n                        which results in the courts throwing out cases and reversing Justice Department decisions. More...\n• Baghdad Security Plan A Success\n                     \t\t\t\t\t| Watch• A Hidden Assault On Liberties\n                     \t\t\t\t\t| Watch• Rudy's Unconventional Bid\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: A Handy Guide To Relationships\nCosmopolitan magazine editor in chief Kate White chats with Hannah Storm about PDA's -- public displays of affection. More...Watch: Decoding P.D.A.\n• EARLY SHOW: Using Herbs To Spice Up Your Cooking\n                     \t\t\t\t\t| Watch• EARLY SHOW: Aviation Expert Blasts FAA\n                     \t\t\t\t\t| Watch• EARLY SHOW: Murdered Russian Spy's Widow, Friend Speak\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nGaza Nears Civil WarWith reports of gruesome street executions and savage brutality, fighting between Palestinian rivals Hamas and Fatah is seemingly\n                                    at the brink of civil war. Charlie D'Agata reports.\nTOP VIDEOS\nLet Them Eat Cake\n'Tear Down This Wall' \nReid: 'We've Done Our Job'\nBush On Immigration Bill\nImmigration Bill Divides GOP\n5 Kids Dead in Pittsburgh Fire\nVictims Of Communism Honored\nHerbs Perk Up Summer Cooking\nAlgerian Camel Races\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesLesley Stahl profiles Internet tycoon Barry Diller. This Sunday, 7 p.m. ET/PT.48 Hours MysteryDark Voyage:An aspiring actress dies under mysterious circumstances. Bill Lagattuta reports Saturday at\n                           8 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}