{"category": "ham", "to_address": "\"Joe Emenaker\" <joe@emenaker.com>, bhasker@unixindia.com,\n   kevmitch@gmail.com", "from_address": "\"Hardik Mehta\" <hard.mehta@gmail.com>", "subject": "Re: Nothing on display after suspend/resume", "body": "On 6/26/07, Joe Emenaker <joe@emenaker.com> wrote:\nrangalo wrote:> powersave -u  # -u is for suspend to ram (suspend to disk doesn't work> at all, it just hangs while suspending)>> command, but while resuming, I get only a black screen, I see a lot of\n> activity of my hard-disk and I can hear the fans running, so I think> that resume is working, but there is something with the display.I had that same problem with my Dell Inspiron 8600. I tried the\n\"hibernate\" package, which someone suggested, and everything works fine,now. I recall there were a couple of changes to the config that I wastold to make, but I think hibernate fixed the problem even without those\nchanges.Try \"hibernate\" first. If that doesn't work, then I can go find thechanges I made.One thing you probably do have to do is change one config file in/etc/hibernate. There's a config file which basically lists the types of\nhibernation to try and in what order. It's something like:   Load /etc/hibernate/ram.conf   Load /etc/hibernate/sysfs-ram.conf   Load /etc/hibernate/ususpend-ram.conf   Load /etc/hibernate/disk.conf\n   Load /etc/hibernate/sysfs-disk.conf   Load /etc/hibernate/ususpend-disk.confOr something like that. You can rearrange them to alter what orderthey're tried in. You can probably also just use the \"hibernate-disk\"\nand \"hibernate-ram\" commands.- JoeHi all,\n\nThanks for your replies.\n\nBhaskar: I cannot switch to the terminal with Alt+F1 or any other virtual terminal for that.\n\nKevin: I used the raw (low-level) program s2disk and s2ram for it but\nthey do the same thing as the powersave script, which additionally\nremoves some kernel modules. \n\nJoe: I installed hibernate, but with the same result. May be you can suggest me the configs you made for making it work for you. regards,Hardik \n"}