{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Kerry Hoath\" <kerry@gotss.net>", "subject": "Re: Regarding the solution of this computer issue", "body": "There are certainly reasons for running Windows on a machine; easy \ntroublefree access to word documents, skype, soundforge, cisco cariculum \naccess all spring to mind.\nI have successfully run Windows in about 30gb of disk space, and if you have \na 320gb drive why not allocate 80gb for Windows and the rest for Linux?\n\nI run Linux on all my file and web servers, we use it for the audio playing \npc and it runs on the firewall.\nI run Windows on my laptops, because I require access to flash enabled sites \nfor teaching cisco and my internet banking does not work at all in Linux \nwithout running a GUI and a copy of firefox which is still beta.\n\nIf I need Linux on the laptops I run it inside vmware which is fine for \nnon-time-critical tasks. As to the performance of vmware workstation verses \nserver, I haven't had any problems with this.\nOften the problems of vmware's virtual machines is due to the fact that \nLinux kernels especially smp kernels demand an extremely high timer \nfrequency 1000 or 2000hz which Windows can not provide.\nRecompiling the Linux kernel that will run in the virtual machine to use \nhz=100 and optionally turning off smp apic and setting the timer source to \npit with clock=pit makes a big difference.\n\nThere is an article on vmware time keeping on vmware.com that explains all \nthis happy to give more details if desired.\nRegards, Kerry.\n\n----- Original Message ----- \nFrom: \"Keith Hinton\" \nTo: \nSent: Saturday, June 23, 2007 2:14 PM\nSubject: Regarding the solution of this computer issue\n\n\n>I have not as of yet installed Linux on this thing. I may just totally \n>destroy Windows after cloning it (on the off-chance) that I ever require it \n>again.\n> However, I am considering teaching my father about Linux, explaining it to \n> him (if I can, or if he will listen to me that is)\n> Also, I can easyily let him navigate around the Gnome desktop and use \n> Firefox to do his online research. He wouldn't be on that much, and I \n> could then kill X-Windows and go back to running server apps.\n> Not sure still, though.\n> Oh and a minor note to all:\n> I do not have a floppy drive in this thing, just one of those internal \n> nine-in-one media reader devices.\n> Also: Although my website and such is online, Noone appears to be \n> accessing it or they can't.\n> Could I have someone test this?\n> The site is available at:\n> http://www.KeithNet.DynDNS.org\n>\n> If that just doesn't work, just try using:\n> KeithNet.DynDNS.org.\n> Regards, --Keith\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}