{"category": "ham", "to_address": "samba-cvs@samba.org", "from_address": "tridge@samba.org", "subject": "Rev 444: web page tidy ups in http://samba.org/~tridge/ctdb", "body": "------------------------------------------------------------\nrevno: 444\nrevision-id: tridge@samba.org-20070603055623-775f45a8zkswk856\nparent: tridge@samba.org-20070603044128-wa8l4mq1nc454did\ncommitter: Andrew Tridgell \nbranch nick: tridge\ntimestamp: Sun 2007-06-03 15:56:23 +1000\nmessage:\n  web page tidy ups\nmodified:\n  web/ctdb.html                  ctdb.html-20070601052353-vgod9lfo4an4o83j-2\n=== modified file 'web/ctdb.html'\n--- a/web/ctdb.html\t2007-06-03 01:48:13 +0000\n+++ b/web/ctdb.html\t2007-06-03 05:56:23 +0000\n@@ -7,75 +7,128 @@\n \n CTDB\n \n-CTDB is a cluster implementation of the TDB database used by samba and other \n-projects to store temporary data.\n-\n-CTDB provides the same functions as TDB but with the difference that it is\n-clustered and thus it appears as a TDB database that spans multiple physical\n-hosts in a cluster.\n-\n-CTDB provides a TDB that has consistent data and consistent locking across\n-all nodes in a cluster.\n-\n-CTDB is fast. Very fast.\n-\n-In case of node failures, CTDB will automatically recover and repair all TDB databases that it manages.\n-\n-If an application is already using TDB for temporary data it is very easy to convert that application to be cluster aware and use CTDB instead.\n-\n-CTDB is the core component that provides pCIFS with samba3/4.\n-\n-CTDB provides HA features such as node monitoring, node failover, and ip takeover.\n-\n-CTDB provides a messaging transport to allow applications linked with CTDB to communicate to other instances of the application running on different nodes in the cluster. Allowing an easy to use mechanism for an application running on one node in the cluster to communicate with an application running on a different node.\n+CTDB is a cluster implementation of the TDB database used by Samba and\n+other projects to store temporary data. If an application is already\n+using TDB for temporary data it is very easy to convert that\n+application to be cluster aware and use CTDB instead.\n+\n+CTDB provides the same types of functions as TDB but with the\n+difference that it is clustered and thus it appears as a TDB database\n+that spans multiple physical hosts in a cluster.\n+\n+Features include:\n+\n+CTDB provides a TDB that has consistent data and consistent locking across\n+all nodes in a cluster.\n+CTDB is very fast.\n+In case of node failures, CTDB will automatically recover and\n+  repair all TDB databases that it manages.\n+CTDB is the core component that provides pCIFS\n+(\"parallel CIFS\") with Samba3/4.\n+CTDB provides HA features such as node monitoring, node failover,\n+  and IP takeover.\n+CTDB provides a reliable messaging transport to allow applications\n+ linked with CTDB to communicate to other instances of the application\n+ running on different nodes in the cluster.\n+CTDB has pluggable transport backends. Currently implemented backends are TCP\n+ and Infiniband.\n+CTDB supports a system of application specific management scripts,\n+  allowing applications that depend on network or filesystem resources\n+  to be managed in a highly available manner on a cluster.\n+\nRequirements\n-CTDB relies on that a clustered filesystem is available and shared on all nodes that participate in the CTDB cluster.\n-This filesystem must be mounted and available on all nodes in the CTDB cluster.\n-Ontop of this cluster filesystem, CTDB then provides clustered HA features so that data from the clustered filesystem can be exported through multiple nodes in the CTDB cluster using various services.\n-Currently this is used to export data off a clustered filesystem using SMB/CIFS and NFS to clients.\n+\n+CTDB relies on that a clustered filesystem is available and shared on\n+all nodes that participate in the CTDB cluster. This filesystem must\n+be mounted and available on all nodes in the CTDB cluster.\n+\n+On top of this cluster filesystem, CTDB then provides clustered HA\n+features so that data from the clustered filesystem can be exported\n+through multiple nodes in the CTDB cluster using various\n+services. Currently this is used to export data off a clustered\n+filesystem using Samba (for SMB/CIFS) and NFS to Windows and Unix\n+clients.\n \n TDB\n-TDB is a very fast simple database that was originally developed for use in samba. Today many other projects use TDB to store its data.\n-\n-See TDB README file for some description of how TDB is used.\n+\n+TDB is a very fast simple database that was originally developed for\n+use in Samba. Today several other projects use TDB to store their data.\n+\n+See TDB\n+README file for some description of how TDB is used.\n \n Getting Started\n To get started with ctdb, I would recommend you read the ctdb wiki.\n \n HA Features\n-The CTDB node sin a cluster designates one node as a recovery master through an election process.\n-If the recovery master node fail a new election is initiated so that the cluster will always guarantee there will be a recovery master.\n-The recovery master will continously monitor the cluster to verify that all nodes contain a consistent configuration and view of the cluster and will initiate a recovery process when required.\n-During the recovery phase, the recovery master will automatically rebuild/recover all clustered TDB database to ensure that the databases are consistent.\n+\n+The CTDB nodes in a cluster designates one node as a recovery master\n+through an election process. If the recovery master node fail a\n+new election is initiated so that the cluster will always guarantee\n+there will be a recovery master. The recovery master will\n+continuously monitor the cluster to verify that all nodes contain a\n+consistent configuration and view of the cluster and will initiate a\n+recovery process when required.\n+\n+During the recovery phase, the recovery master will automatically\n+rebuild/recover all clustered TDB database to ensure that the\n+databases are consistent. Recovery typically takes between 1 and 3\n+seconds. During the recovery period the databases are 'frozen', and\n+all IO operations by ctdb clients are suspended.\n \n IP Takeover\n-When a node in a cluster fails, CTDB will arrange that a different node takes over the IP address of the failed node to ensure that the ip addresses for the services provided are always available.\n-To speed up the process of IP takeover and when clients attached to a failed node recovers as fast as possible, CTDB will automatically generate Gratious ARP packets to inform all nodes of the changed MAC address for that IP.\n-CTDB will also send \"tickle ACK\" packets to all attached clients to trigger the clients to immediately recognize that the TCP connection needs to be reestablished and to shortcut any TCP retransmission timeouts that may be active in the clients.\n+\n+When a node in a cluster fails, CTDB will arrange that a different\n+node takes over the IP address of the failed node to ensure that the\n+IP addresses for the services provided are always available.\n+\n+To speed up the process of IP takeover and when clients attached to\n+a failed node recovers as fast as possible, CTDB will automatically\n+generate gratuitous ARP packets to inform all nodes of the changed MAC\n+address for that IP.  CTDB will also send \"tickle ACK\" packets to all\n+attached clients to trigger the clients to immediately recognize that\n+the TCP connection needs to be re-established and to shortcut any TCP\n+retransmission timeouts that may be active in the clients.\n \n Services using CTDB\nSamba 3/4\n-Extensions has been developed to samba3 and samba 4 to integrate with CTDB to build a clustered HA version os samba where the same data/network shares are exported read-write from multiple nodes in a cluster.\n-These versions of samba have been demonstrated to provide very good scalability.\n-See CTDB Project at samba.org for more information about this pCIFS implementation.\n+\n+Extensions has been developed to Samba3 and Samba 4 to integrate with\n+CTDB to build a clustered highly available version of Samba where the\n+same data/network shares are exported read-write from multiple nodes\n+in a cluster. These versions of Samba have been demonstrated to provide very good\n+scalability.\n+\n+See CTDB\n+Project at samba.org for more information about\n+this pCIFS implementation.\n \n NFS v2/v3\n-NFS v2/v3 has been successfully tested with exporting the same data/network share from multiple nodes in a CTDB cluster with correct file locking behaviour and lock recovery.\n-\n-See Configuring NFS for CTDB clustering for isntructions on how to configure a CTDB cluster to provide NFS clustering.\n+\n+NFS v2/v3 has been successfully tested with exporting the same\n+data/network share from multiple nodes in a CTDB cluster with correct\n+file locking behaviour and lock recovery.\n+\n+See Configuring\n+NFS for CTDB clustering for instructions on how to configure a\n+CTDB cluster to provide NFS clustering.\n \n \n Discussion and bug reports\n \n ctdb does not currently have its own mailing list or bug tracking\n-system. For now, please use the samba-technical\n+system. For now, please use\n+the samba-technical\n mailing list, and the Samba\n-bugzilla bug tracking system.\n+bugzilla bug tracking system.\n \n-We would be very interested in hearing from and work with other projects that want to make their services cluster aware using CTDB.\n+We would be very interested in hearing from and work with other\n+projects that want to make their services cluster aware using CTDB.\n \n \n Download\n"}