{"category": "ham", "to_address": "\"General Copyright Discussions \\(questions, organizing,\n\tetc\\)\" <discuss@list.digital-copyright.ca>", "from_address": "Russell McOrmond <russell@flora.ca>", "subject": "Re: [d@DCC] Mixed feelings about \"DVD DRM row sparks user rebellion\"", "body": "Darryl Moore wrote:\n> In particular, you think that what happened at Digg will only be of \n> value if it translates into some political action, without realizing \n> that what happened at Digg WAS A POLITICAL ACTION. It was the most basic \n> grass roots political action on earth. People were taking direct action \n> to influence policy that they felt strongly about.\n\n   It influenced the policy of Digg, a pretty modern and obviously \nWeb2.0 aware company, not the policy of the government.  Who a political \naction is aimed at matters.\n\n> Why do you think so many people flout \n> the law and download movies and music so openly?\n\n   Because they believe (IMHO correctly) that they are more likely to \nget hit by lightning than get caught for this infringement.  They are \nseen as doing it because they can get away with it, not because they \nhave something substantive to say about the underlying laws.\n\n\n   I hear this argument that infringement is a form of civil \ndisobedience often, and I simply don't buy it.  Politicians are also not \nbuying it, and believe that all that is needed to \"fix\" this problem is \npass more laws -- especially those targeted at intermediaries (which are \nfewer, and thus easier to control).\n\n> I think events like this one if seen by the country's politicians will \n> make them stand up and take note of just how much we will allow our \n> freedoms to be limited.\n\n   \"if seen by\" -- and that is my point, it's not being seen by our \npoliticians or other policy makers.\n\n\n   Most politicians are unaware of anything we talk about and work with \non a daily basis.  They think there is either only one or two sources of \ncomputer operating systems, and have no idea of the entertainment value \nof user generated content.\n\n\n   Of the MPs I've met so far I believe that Bev Oda and Hedy Fry \nrepresent the majority of those that have an opinion at all on issues of \ncopyright, and both have no problem shutting down all alternatives to \nthe \"professional\"/incumbent methods of production, distribution and \nfunding of content.  (IE: Goodbye personal ownership/control of ICT, \nuser generated content, peer production, etc)\n\n\nI'm a Green, Hedy Fry is Blue, Nickie is a Space Cadet, lets hang out in \nthe Tiki Bar\nhttp://www.digital-copyright.ca/node/3859\n\n\n\n   Civil disobedience that isn't clearly documented and understandable \nto the policy makers who make the rules can easily backfire.  I believe \nall the infringement that is currently going on is further convincing \nCanadian policy makers to push towards more draconian laws.\n\n   The petitions are written in a language that policy makers can \nunderstand (in fact, that is one of their flaws-- the general public has \na harder time understanding them).  Copyright infringement isn't being \nseen by policy makers as a form of civil disobedience, just \"theft\". \nAnd this will never change until we stop speaking to ourselves and start \nspeaking with them.\n\n-- \n  Russell McOrmond, Internet Consultant: \n  Please help us tell the Canadian Parliament to protect our property\n  rights as owners of Information Technology. Sign the petition!\n  http://www.digital-copyright.ca/petition/ict/\n\n  \"The government, lobbied by legacy copyright holders and hardware\n   manufacturers, can pry my camcorder, computer, home theatre, or\n   portable media player from my cold dead hands!\"\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}