{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Rosario Pettit\" <paxentrtuf@entr.us>", "subject": "Watch the pounds disappear", "body": "\nDoctors and Celebrities endorse Anatrim\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most delighting product for corpulent people is now readily available – As were seen on CNN.\n\n\nCan you hold in your memory all the situations when you said to yourself you would do any thing for being saved from this quickly growing number of kilos? Luckily, now no great price is to be paid. With Anatrim, the ground-breaking kilos-melting combination of elements, you can achieve naturally health lifestyle and a really slender figure. Just look at what people write!\n\n\n\n\"It’s difficult to confess but I was terribly addicted to food. \n\n\nI swallowed up all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis suffering stopped after I started course with Anatrim! \n\n\nGod,\n\n\n\n\n my appetite vanished, \n\n\nspirits increased and I’m the happiest person on the planet 19 pounds in 2.4 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person!\"\n\n\n\n\n\nSilvia D., Bellevue WA\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nYou can't imagine how I abhorred being ridiculed at school. \n\n\n\n\nI hated my weight and I detested even myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nThis stuff literally took me out of this awful nightmare! The very sincere thanks to you, guys.\"\n\n\n\n\n\nDave Klark, New York\n\n\n\n\n\n\"You know what? Anatrim saved my marriage! I fell down into this circle, depression – more eating – more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nMy friend showed me web page and I ordered my pack of Anatrim at the same time. \n\n\nThe result was splendid, my appetite became normal, I was in a good mood oftener, and, of course, I became able to tighten my belt on some holes. And you see, the bedroom became cool, too!\"\n\n\n\n\n\nJoe\n\n\n\n\n There is a great number of testimonial letters delighted people leave after trying Anatrim. Why don't you join the tens of thousands of slim buyers and try this natural appetite suppressing energy lifting product now!\n\n\nDon’t lose your chance!\n\n\n\n\n"}