{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Wilfred Zegwaard <wilfred.zegwaard@gmail.com>", "subject": "Re: [R] Reasons to Use R", "body": "Dear Johann and Gabor,\n\nIt's what amounts to large datasets. There are hundreds of datasets R\ncan't handle, probably thousands or more. I noticed on my computer\n(which is nothing more that an average PC) that R breaks down after 250\nMB of memory. I also note that SPSS breaks down, Matlab, etc.\n\nI'm not a SAS user, but I have worked in the past with SAS. It's very\ngood as a remember, but it's ten years ago. And it's a \"dollar machine\"\nI've been told: you add dollars to SAS as you add dollars to a Porsche.\nI haven't got it and for most statistical applications it isn't\nnecessary I've been told. R is sufficient for that. The datasets I use\nare often not that big (the way I like it).\nAbout three years ago I spoke to somebody who has worked with it and\nsaid \"it's database system is excellent and statistical profound\".\nSomeone with a PhD, so probably he is right.\n\nMonte-Carlo simulations are computationally time-consuming, but probably\nthese can be done in R. I haven't seen any libaries for it (they might\nbe there). It has been done with S (the commercial counterpart of R), so\nprobably with R too. If you tie Monte Carlo simulaton with large\ndatasets you probably run into problems with a conventional R system.\nWhat I've been told in those instances is \"buy a new computer\" / \"add\nmemory and buy a new processor\"... and don't smoke hashiesh.\n\nThat wasn't a good advice because the guy who told me smoked hashiesh\nlike hell and drank Pastis (blue liqor) like water. I kicked him out.\nBut that's another story.\n\nCheers,\n\nWilfred\n\n(I drink wine and tailor made beer, and only on occasions. That's why.\nHis simulations were good I've been told.)\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}