{"category": "ham", "to_address": "\"enrico.foscolo2\" <enrico.foscolo2@libero.it>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] Find zeros of analytic functions", "body": "There is no need to send this twice under different subject lines.\n\nOn Mon, 16 Apr 2007, enrico.foscolo2 wrote:\n\n> Dear Partecipants to the list,\n\n> I am Enrico Foscolo, a student of the Faculty of Statistics, University of Bologna,\n> and I am interested under consideration of the search of zeros of one function.\n> I would want to write a code using the software R.\n> I have already read the book \"Computing the Zeros of Analytic Functions\" (P. Kravanja and M. Van Barel, 2000) that speaks about this problem, computing a Fortran 90 code.\n> Consequently, I would want to ask You if:\n> - already exists a R code,\n\nI presume you mean analytic functions of a complex argument.  Few R \npackages use complex vectors, and none of those few do this to my \nknowledge.\n\n> - how can I recall a Fortran 90 function in R (Windows XP Operating System).\n\nThis is covered in 'Writing R Extensions', section 1.2.3 in the version \n(2.5.0 beta) I looked at.\n\n> My aim is to write the code for complete my work about studying functions and\n> searching points of maximum and minimum (local and global).\n> Many thanks for any kind of help and for Your availability.\n>\n> Enrico Foscolo\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}