{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Spie Sutherland\" <spie@proficio.ca>", "subject": "Re: ttsynth help: download problem", "body": "Regarding libstdc++-libc6.2-2.so.3\n\nMike wrote:\n> So how do I find gcc-2.95 and build it without damaging my machine?\n\nIt's more complicated that needing a compiler. That library contains\nruntimes created with an old glibc that stopped being used on most\nlinux systems a few years ago.\n\n> You mentioned a discussion on this list regarding doing that.\n\nThis is old, but I made it work three years ago on slackware 9.1 by\nbuilding an old glibc from source\n\nhttp://www.cs.vassar.edu/~priestdo/emacspeak/list.archive.2004/msg00128.html\n\nThat might be difficult if you've never built any toolchains. Since\ntime has passed and we're using newer gcc, you might have to\ninstall an old gcc to compile the glibc without the build choking.\nAnd it can get worse, there is certain combinations of the gcc,\nglibc, and binutils that will build together, other combinations\nbreak, and they are moving targets. If I still had the old ibm tts\nfiles I'd have another go at trying to make it work the hard way,\nbut I have lost my viavoice files somewhere along the way.\n\n> Would it be possible for someone just to email the library to me?  I'm\n> using the 2.6.13 kernel under Slackware 10.1.\n\nYou may find that even if you can locate a binary library and put\nit on your system, it may be incompatible and when you execute\nprograms that need it you may get unresolved symbol errors or\nthe dreaded segmentation error. That error is almost as useful\nas the three possible errors shown on my first computer, which\nwere: what? how? and sorry. LOL I am not kidding. That was\nthe only thing the computer could tell you if it didn't understand\nwhat you typed.\n\nThis, however, looks interesting\nhttp://www.digitalsanctum.com/2007/01/28/libstdc-libc62-2so3-on-ubuntu/\n\nIt states that on ubuntu, installing libstdc++2.10-glibc2.2 gives you\ncompatibility with libstdc++-libc6.2-2.so.3\n\nSlackware may be a different story, but what I did before is surely\ndoable again, if you're willing to build toolchains.\n\n  -- Spie\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}