{"category": "ham", "to_address": "431883@bugs.debian.org", "from_address": "Don Armstrong <don@debian.org>", "subject": "Bug#431883: dcraw license does not give permission to distribute modified versions or source alongside", "body": "On Thu, 05 Jul 2007, Steve King wrote:\n> The license against which you have raised a bug is not the one that covers \n> the version that is currently part of debian. The appropriate license is \n> here:\n\nRight, but the issues present in the current version of the license\nare also present in the versions which we are distributing.\n\n> http://packages.debian.org/changelogs/pool/main/d/dcraw/dcraw_8.39-1/dcraw.copyright\n>\n> You should also probably consider the text on the web page where the source \n> is available http://cybercom.net/~dcoffin/dcraw/ :\n> \"[dcraw is] free (both \"gratis\" and \"libre\")...\"\n> and\n> \"Unless otherwise noted in the source code, these programs are free for all \n          ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n> uses...\"\n\nThe underlined section is the important point. I'm almost certain that\nDave Coffin intends for the software to be free, but the dissonance\nbetween the copyright statement in ddraw.c and the DFSG has to be\nresolved.\n\n[It's also not clear whether free applies to the ability to modify or\nwhether it merely means that you don't have to pay; licencing under\nthe GPL or MIT/Expat would resolve these questions as far as I'm\nconcerned.]\n\n> My query on debian-legal was with respect to the current license text, \n> rather than the historical license that applies to the version in debian.\n\nYes; both issues came up in the context of re-examining the entire\nlicense, though. I've only prsented the entire new license in the bug\nreport, since that was what the original question was about.\n\nIn any event, let me know if you need any assistance or clarification\nin your communication with Dave.\n\n\nDon Armstrong\n\n-- \nFiling a bug is probably not going to get it fixed any faster.\n -- Anthony Towns\n\nhttp://www.donarmstrong.com              http://rzlab.ucr.edu\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}