{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Carol F. Carol World Market Systems.com\" <qc4cw9y7j@crystalnoon.com>", "subject": "Work with an honest home business from home ", "body": "Imagine! A home business that lets you make money day and night over a marketplace that encompasses the entire world!\n\nThe World Market Systems online home business is so simple and affordable that anyone can do it! And forget going to the office every day because this business runs right from the privacy and comfort of your own home, anywhere in World.\n\nWith your World Market System business, you\\u2019ll never have to sell anything, handle or ship any inventory, or even communicate with your own customers. And, with our remarkable system, you can actually start making money on your very FIRST day!\n\nhttp://plumcopper.com/t/qc4cw9y7j/181779\n\nThe World Market Systems online home business is a complete turnkey system. Our amazing system will set you up with your very own website and in no time at all you\\u2019ll be tapped into the internet and ready to make money! You\\u2019ll also be assigned your very own Internet Coach to help make this one of the easiest things you\\u2019ve ever done! It\\u2019s just like having your own webmaster, programmer and Internet expert right at your fingertips.\n\nSo if you like the idea of being your own boss, making money the easy way and getting your share of the Internet\\u2019s incredible wealth right from your home \\u2013 take the next step and find out how easy it is to get started.\n\nhttp://plumcopper.com/t/qc4cw9y7j/181779\n\nTo stop future mailings, please visit this link:\n\nhttp://plumcopper.com/t/qc4cw9y7j/181780\n\n515 E. Carefree HWY PMB \n831 Phoenix, \nAZ 85085\n\n\nHi Subscriber! You are receiving this solicitation because producttestpanel@speedy.uwaterloo.ca previously agreed to receive correspondence from Copper Banana. If this service should fail to meet your expectations, feel free to disassociate yourself from our service.\nhttp://plumcopper.com/u/fbe/producttestpanel%40speedy.uwaterloo.ca/2\n\nShould you want to contact us via the United States Postal Service, our address is as follows:\n405 Tarrytown Road Suite 1203 White Plains, NY 10607\n\n\n"}