{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "840p 6/10 Update: MMT considers EVA blanket repair; S3/S4 unberthed", "body": "\n\n\n\n\n840p 6/10 Update: MMT considers EVA blanket repair; S3/S4 unberthed\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 37\nPosted: 8:33 PM, 6/10/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-33 (06/10/07): Shuttle begins final rendezvous phase\n   SR-34 (06/10/07): Atlantis docks with space station\n   SR-35 (06/10/07): Hatches open; shuttle crew welcomed aboard\n   SR-36 (06/10/07): Flight director thrilled with smooth rendezvous; pitch maneuver finds no obvious signs of damage to shuttle's heat shield\n   SR-37 (06/10/07): Shannon leaning toward spacewalk repair of protruding blanket\n\n=================================\n\n8:33 PM, 6/10/07, Update: Shannon says spacewalkers may be asked to tap down protruding insulation blanket\n\nConcern about possible re-entry heat damage to the underlying structure of the shuttle Atlantis' left-side maneuvering rocket pod under a pulled-up insulation blanket may prompt a simple spacewalk repair job, the chairman of NASA's Mission Management Team said today.\n\nThe front edge of the blanket in question apparently pulled away from adjacent heat-shield tiles by the swift flow of air passing over it during the early stages of launch Friday.\n\nJohn Shannon told reporters that engineers studying the protruding triangular 4-inch by 6-inch blanket are concerned about the possible effects of re-entry heating on the graphite epoxy honeycomb structure of the shuttle's left Orbital Maneuvering System pod.\n\nShuttles have safely returned to Earth on several occasions with broken or lost tiles and lost blankets on the OMS pods. But in some cases, the underlying structure was damaged and required repairs.\n\n\"We have actually damaged that on several of those flights where you had some heat effects,\" Shannon said. \"When we talked to the engineering guys and the structural team, they were a little bit uncomfortable today. And the reason they were uncomfortable was because if you get down to that honeycomb, that structural area, you're losing some margin, you're not exactly in the flight parameters you expect to go fly.\"\n\nHe said it was difficult to accurately predict what sort of damage might occur because engineers cannot tell how much underlying insulation might have pulled away with the blanket.\n\n\"Because we do not want to damage flight hardware, we sent off a (team of engineers) to work with the EVA, the spacewalk team, to go assess some options. The simplest is we would just tuck that blanket back down and fill that cavity back up. And they're talking about different ways to maybe secure it.\n\n\"We did not judge what the right answer was, we're going to let that spacewalk team go off and assess that and they'll come back to me tomorrow and lay out options, pros and cons, and then we'll decide A) if we want to do anything with this blanket and then if we do want to do something, what is the right course of action.\"\n\nDuring the region of peak heating, the upper surfaces of the OMS pods experience 700 to 1,000 degree Fahrenheit for about 15 minutes. During that period, the shuttle is at such high altitudes that very little aerodynamic pressure is present.\n\n\"You have the heating of the vehicle in this area that goes up and is significant for 15- to 20-minute period of time but you really don't have any aerodynamic loads on it at that time, it's very, very low dynamic pressure on that blanket area,\" Shannon said. \"So after you get through the high heating area, then you start to pick up aerodynamic loads.\n\n\"What does that mean to you? Well, what it means is whatever condition you start re-entry in with that cavity, or that blanket, it's going to pretty much stay in that configuration throughout the high-heating time frame. Then it might change, it might pull up more, whatever, in a time when you don't really care very much.\"\n\nShannon said he was not leaning one way or the other toward ordering a repair, saying \"tomorrow I'll have a better idea of what the different options are.\"\n\nBut a few minutes later he said, \"I think after seeing the effect on the graphite epoxy honeycomb on some (past flights) I'm leaning may be a little bit toward doing it, but we have to hear what the options are.\"\n\nBecause engineers don't know exactly what sort of heat damage to expect, \"I would just like to kind of avoid that whole scenario altogether and  tuck that blanket back down. And I'm expecting the team to come in and give me some ideas of how to do that and then we'll see where it fits in the timeline. If we can accommodate it, I think that's probably what we'll do.\"\n\nThe Atlantis astronauts plan spacewalks Monday, Wednesday and Friday to activate and configure a new solar array and to carry out a variety of other tasks. If a repair job is added, it likely would occur during the third spacewalk, after the high-priority work to complete the activation of the new solar arrays.\n\n=================================\n\n3:50 PM, 6/10/07, Update: Atlantis docks with space station (UPDATED at 5:30 p.m. with hatch opening; UPDATED at 8 p.m. with comments from flight director, MMT chairman)\n\nCommander Rick Sturckow guided the shuttle Atlantis to a picture-perfect docking with the international space station today after a dramatic end-over-end flip across the heart of South America to let the station crew photograph the shuttle's fragile heat shield. After a brief welcome-aboard ceremony and a safety briefing by station commander Fyodor Yurchikhin,\n\nUsing a joystick on the shuttle's aft flight deck, Sturckow deftly closed out a trouble-free two-day rendezvous with a gentle docking at 3:36 p.m. as the two spacecraft sailed high above the east coast of Australia northeast of Sydney.\n\n\"ISS and Houston, from Atlantis. Capture confirmed,\" a shuttle astronaut radioed as the docking systems engaged. A few minutes later, hooks and latches were activated to firmly pull the two spacecraft together. After leak checks to make sure the interface is airtight, hatches were opened and the station crew will welcome their shuttle colleagues aboard a few minutes past 5 p.m.\n\n\"Atlantis. Arriving,\" station flier Sunita Williams said, following naval tradition and ringing the ship's bell in the Destiny laboratory module. The shuttle crew then floated into the station to hugs, smiles and handshakes.\n\nRunning three months late because of hail damage to the shuttle's external fuel tank, Atlantis brought two welcome additions to the international lab complex: A $367 million set of solar panels and a fresh crew member - Clay Anderson - to replace Williams.\n\nLaunched to the outpost last December aboard shuttle Discovery, Williams will set a new space endurance record for female astronauts and cosmonauts when she lands aboard Atlantis June 19 after 192 days off planet.\n\n\"Great job today, Atlantis, on the rendezvous,\" astronaut Terry Virts radioed from mission control. \"Very nice approach. And welcome to your new home, Clay.\"\n\n\"Thanks a lot, Houston,\" Sturckow replied.\n\nLead flight director Cathy Koerner was elated.\n\n\"What a great day to be in the space business,\" she told reporters later. \"We had just a picture-perfect rendezvous and docking today and I could not have asked for smoother operations between the flight control team and the crew on orbit. We made this look easy. To put that in perspective for you, on how not easy it really is, we took a quarter-million-pound vehicle today and we connected it with about a half-million-pound (space station) and we did all that at 17,500 mph.\"\n\nToday's rendezvous and docking included a now-routine but nonetheless spectacular rotational pitch maneuver, or RPM, a key element in NASA's post-Columbia focus on assessing the health of the orbiter's heat shield before a crew commits to re-entry.\n\nSpectacular video beamed down from the space station showed Atlantis performing a graceful pirouette 600 feet directly below the laboratory, a slow-motion back flip against the backdrop of the Brazilian rain forest racing past 220 miles below.\n\nThere were no obvious signs of anything unusual, but engineers are just beginning their assessment of zoomed-in digital photographs shot by station commander Fyodor Yurchikhin and flight engineer Oleg Kotov.\n\n\"Right now, the team is looking at the approach photography that you saw the station crew take,\" said John Shannon, chairman of NASA's mission management team. \"I was just up in the imagery lab and nothing really jumped out at us.\"\n\nEngineers plan to work through the night to analyze the photos and determine whether any additional, \"focused\" inspections might be needed.\n\nAfter completing the pitch maneuver, Sturckow piloted Atlantis in a slow loop up to a point about 300 feet directly in front of the station with the shuttle's nose pointing toward deep space and its open payload bay toward a docking port on the front of the Destiny laboratory module.\n\nFrom there, he flew the shuttle straight in for docking.\n\nOn most flights, rendezvous and docking would be the highlight of a busy day in space. But for Atlantis' crew, docking kicked off an equally busy afternoon of work to pull the 36,000-pound S3/S4 solar array truss segment from the shuttle's cargo bay so it could be handed off to the station's robot arm and safely \"parked\" overnight. The arm-to-arm handoff was completed around 8:30 p.m.\n\nThe massive segment will be attached to the right side of the station's main power truss on Monday just before the start of a spacewalk by Jim Reilly and Danny Olivas to make critical electrical connections and prepare the new arrays for deployment Tuesday. Once extended, the panels will stretch 240 feet from tip to tip.\n\nAn identical set of arrays was attached to the left side of the main power truss last September. The new arrays, and the relocation of a third set of solar panels later this year, are required to generate the power needed to support the long-awaited delivery of European and Japanese research modules late this year and early next.\n\nAtlantis' crew plans spacewalks Monday, Wednesday and Friday to complete the outfitting and activation of the new S3/S4 solar array segment and to perform a variety of other assembly tasks. They also will assist, if necessary, work to retract the P6-2B solar panel so the arrays can be moved to the left end of the power truss later this year.\n\nOne wild card in the crew's flight plan is what, if anything, NASA managers might decide to do about a pulled-up insulation blanket on the upper section of Atlantis' left-side Orbital Maneuvering System rocket pod. Engineers have not yet completed their assessment of the blanket or what techniques spacewalking astronauts might employ to address the problem.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}