{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Moshe Olshansky <m_olshansky@yahoo.com>", "subject": "Re: [R] Stock Price Correlation to Index Price Levels", "body": "Josh Kalish wrote:\n\n>Thanks to all of the people who responded.  What I\n>was trying to do is \n>to\n>turn my matrix or frame containing index level\n>returns and stock \n>returns\n>into a matrix of \"betas\".  I don't really need to\n>worry about risk-free\n>interest rates.  I just need to be able to come up\n>with a number that \n>shows\n>the expected index correlation.  \n\n \n\n>I was able finally to figure out how to use cor() to\n>get what I think \n>is an\n>R^2 value.  But, I'm trying to also figure out the\n>ratio of \n>correlation.\n>For example, some stocks correlate very well and\ncor() returns a value \n>of\n>.92.  But, how do you then figure out if the stock\n>should have a 1.5:1\n>correlation? \n\n \n\n>The way I would do it by hand is to turn the closes\n>into daily returns \n>and\n>then get the mean() return for each stock against the\n>index by day.  I \n>can't\n>find an example as hard as I look, but this must be\n>very common.\n\n \nIf X is a vector of daily returns (today's close -\nyesterday's close) for your index (in dollars) and Y\nis the vector of daily returns for your stock (in\ndollars), then to hedge 1 share of your stock you need\nto hold u = -(1/r)*(Sy/Sx) units of the index, where r\nis the correlation coefficient, Sx is the standard\ndeviation of daily returns of the index and Sy is the\nstandard deviation of daily returns of Y.\nIn R,\nu <- -(1/cor(X,Y))*(sd(Y)/sd(X))\n \nIn this case your stock is \"fully\" hedged by the index\n(but the index of course is not \"fully\" hedged by the\nstock, unless the correlation coefficient is +/- 1).\n\nHope this helps,\n\nMoshe Olshansky.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}