{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Cheapflights Travel Deals <cheapflights@list.cheapflights.com>", "subject": "Cheap Summer Airfare Deals From Your Local Airport", "body": "\n\nCheap Summer Airfare Deals From Your Local Airport\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMay 31, 2007\n\n\n\n\n\n\n\n\n\n\nFrom: \nTo: \n\n  \n\n\n\n\n\n\n\n\n\n\n\n \n\nIN THIS ISSUE: SUMMER'S BEST DEALS ARE HERE!\n\n\n\n\n\nCheap Flights From Your Local AirportBest airfares from your hometownAustin, TX Baton Rouge, LA Chicago, IL Cincinnati, OH Cleveland, OH Columbus, OH Corpus Christi, TX Dallas/Ft. Worth, TX Detroit, MI El Paso, TX Fort Wayne, IN Houston, TX Indianapolis, IN Kansas City, MO Lexington, KY Lincoln, NE Louisville, KY Madison, WI Memphis, TN Milwaukee, WI Minneapolis, MN Nashville, TN New Orleans, LA Oklahoma City, OK Omaha, NE St. Louis, MO San Antonio, TX Toledo, OH Tulsa, OK Wichita, KS Click herefor more city airfare deals.\n\n\n\n\n\n\nfrom $81 RTKayak\n\nUnited Airlines: U.S. Summer Savings United Airlines Summer Fare Bargains Your favorite destinations all over the country; includes taxes, fees.\n\n\n\n\n\n\n\n\nfrom $78 RTKayak\n\nU.S. Summer Airfares Under $200 Summer Flight Savings Nationwide departures and destinations; includes taxes and fees.\n\n\n\n\n\n \n\nClick-and-Compare Fares\nFrom Cheapflights\n\nDestination Spotlights \nTop Picks: Popular City Destinations \nCompare the best airfare bargains to:\n\n\nLas Vegas\nSan Francisco\nSan Diego\nFt. Lauderdale\n\nOrlando\nD.C. \nLondon\nAtlanta \nBoston \nChicago\nL.A.\n\n\t    Cancun\n\n\n\n\n\n\n\n\n \n\nNew York City \u0097 Summer Spotlight New York City: Summer's Best Big Apple cost-cutting tips\u0085 free events and summer calendar\u0085 the latest dining dish\u0085 celeb sightings\u0085 and much more\n\n\n\n\n\n\n\n\nfrom $78* RT\nAmerican Airlines\n\nAmerican Airlines: Summer & Fall Sale American Airlines U.S. Airfare Sale Dozens of departures and destinations nationwide. Purchase on AA.com by June 5.\n\n\n\n\n\n\n\n\nfrom $589 /person1800FlyEurope\n\nEurope Air/Hotel Deals of the Week 3-Night Late Summer/Early Fall Vacations Includes airfare, 3-star hotels, fuel surcharge, hotel tax and breakfast; travel Sept 1–Oct 31.\n\n\n\n\n\n\n\n\nTravelocity\n\nU.S. Summer Airfare Deals Airline Bargains + Top Destinations Book now for nationwide savings \u0097 and seats.\n\n\n\n\n\n\n\n\nSave Up to 75%VacationsToGo\n\nCruise Deals of the Week Last-Minute Cruises: Up to 75% Discounts Cruise away your cares: Caribbean, Mexico and Hawaii sailings on top lines.\n\n\n\n\n\n\n\n\nfrom $81 RTCheapTickets\n\nAirTran: Deep Discount Fare Deals AirTran Spring-Thru-Fall Airfare Sale Dozens of top U.S. cities; travel thru Nov 8.\n\n\n\n\n\n\n\n\nfrom $78 RTKayak\n\nUS Airways \u0097 Unadvertised Sale Fares US Airways Summer Airfares Our deal finders found this week's top bargain airfares; includes taxes, fees.\n\n\n\n\n\n\n\n\n \nIceland Vacations: Last 2 Days to Save Save Up to $150 Per Person Enjoy summer in Iceland with its midnight sun, mild temperatures and pristine landscapes. Explore its glaciers and waterfalls. Enjoy a gourmet seafood dinner in Reykjavik. Relax in the surreal Blue Lagoon hot springs. Pick your favorite package and add-ons; purchase by May 31. \n\n\n\n\n\n\n\n\n\nSell-Out-Fast PricesExpedia\n\nU.S. & International Summer Travel Sale! \nAirfare, Hotel, Package, Cruise Discounts \nSave on summer travel \u0097 all over the U.S. or around the globe. Up to 30% off hotels, rental cars and more. \n\n\n\n\n\n\n\n\n\nUniversal Orlando® Resort Limited Time Offer: Unlimited Admission to Two Parks for $85.99/person! Explore two amazing theme parks for an entire week for less than the price of a Disney® 1-day ticket (with Park Hopper Option). \n\n\n\n\nSpain & The Bahamas\n\n\n\n\n\nfrom $1,569 /personEuropean Destinations\n\nSpain City Vacation Sampler Spain: 3-City, 7-Night Getaways Includes international airfare; accommodations in Madrid, Cordoba and Seville; rail transportation between cities; air & hotel taxes and more.\n\n\n\n\n\n\n\n\nfrom $790 /personBeach Destinations\n\nBahamas Spring/Summer Getaways Save 35% on 4-Night Paradise Island Packages Includes airfare, 4 nights' accommodations at the Riu Paradise Island, all meals, drinks and entertainment.\n\n\n\n\n\n\n\n\n\n\n\n\n Tell a friend   Change \nyour profile  |  Unsubscribe\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nTRAVEL NEWS\n\n\n\nIn the Headlines\u0085 From Cheapflights.com's daily travel news and other sources: \u0095 AirTran spring-thru-fall sale ends June 5 \u0095 Book by May 30 to save on Florida to Caribbean Flights (thru Nov) on American Airlines \u0095 United Airlines moves up departure times on some early-morning flights \u0095 Book by June 7 to save on Southwest Airlines Vegas' air/hotel packages \u0095 New American Airlines Web site features booking grid with fares and flight times \u0095 jetBlue celebrates new NYC/JFK to Nantucket flights with one-way fares from $79 \n\u0095 TSA to scan carry-on liquids at major airports \n\u0095 JD Powers study lists top airports The Lighter Side of Travel \u0095 Borat to Pen Travel Guidebooks \u0095 Misbehaving Tourists: Bad Manners Are a Global Phenomenon \u0095 Elvis Hits the High Seas on Nostalgia Cruise \u0095 Rolling Stone Picks the 25 Best Road SongsTrip Planning & Destinations \u0095 Cheapflights' Tips for Summer Air Travel \u0095 What's Free and Fun in NYC This Summer \u0095 Clubs, Interests Allow Solitary Travelers to Connect on the Road \u0095 Travel Writers Share Their Favorite Summer Getaway Spots \u0095 Amusement Parks Woo Families, Kids With New and Updated Rides \u0095 When Evaluating Travel Deals, Don't Overlook These Questions \u0095 Checking Your Bags? Check Airline Fees to Avoid Costly Surprises \u0095 Plan Ahead to Snag Deals and Discounts at Disney World\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nGETAWAY CALENDAR\n\n\n\nHouston (TX), thru June 30: Texas Music Festival Maui (HI), June 13\u009617: Maui Film Festival New York City, June 9\u009617: Caribbean Week; June 12: Museum Mile Festival Pittsburgh (PA), June 1\u009617: Three Rivers Arts Festival San Diego (CA), June 8 thru July 4: San Diego County Fair San Francisco (CA), June 2\u00963: Union Street FestivalWashington (D.C.), June 2\u009628: Start With the Arts Family Festival Coming Soon: Chicago (IL), June 23\u009624: Summerfest (Lincoln Park); June 29\u0096July 8: Taste of ChicagoColchester (VT), Lake Champlain, June 16\u009618: Father's Day Fishing Derbies Los Angeles (CA), June 21\u0096July 1: Los Angeles International Film Festival Manchester (TN), June 14\u009617: The Police are among 100+ bands performing at the Bonnaroo Music Arts Festival. San Francisco (CA), June 16\u009617: The North Beach Festival, one of the most popular U.S. street fairs Washington (D.C.), June 23\u009624: National Barbecue Battle; Caribbean Carnival Parade \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   Want the \nlatest airline and related news? Visit Cheapflights.com Flights News\n\n\nFind the best airfare deals on Cheapflights.com\n\n\n\n\n\n  From: \nTo: \n\n\n\n\n\n\n\n\n\nFlights | \nPrivacy Policy | \nContact us\n\n\n\n\nWould you like to \nUnsubscribe? \n\n\n\nTerms and Conditions:\n\nCheapflights.com does not sell tickets, but publishes deals and displays \ninformation only. Prices do not include taxes and other fees unless \nstated.   We list deals that are correct when \npublished, but cannot guarantee accuracy or completeness. \n\nThe information provided in this e-mail may include inaccuracies and \ntypographical errors. Terms and Conditions apply to the above deals and \nthese deals may expire or be subject to change. Cheapflights.com (USA) \nInc., its subsidiaries & affiliates are not liable for any claims of \ndamages, loss or injury to persons or property arising out of this \nnewsletter. For more details on a specific deal, check with the agent or \ncompany selling the tickets.\n\n*\nTaxes, fees, and restrictions apply\n\n\nFor written correspondence please contact Cheapflights (USA) Inc. at 24 School \nStreet, Boston 02108.\n\n\n\n\n\n"}