{"category": "ham", "to_address": "\"Alan Kay\" <alan.kay@squeakland.org>,\n   \"Eben Eliason\" <eben.eliason@gmail.com>", "from_address": "\"Samuel Klein\" <meta.sj@gmail.com>", "subject": "Re: [sugar] Spreadsheets/ Slideshows", "body": "Eben, this might be a great opportunity to spend some time with the\netoys team working out how you could realize what you have in mind\nwith existing tools.  As Alan notes, it is designed to do very much\nwhat you are writing about -- as well as  doing some excellent sugar &\n1200x900 emulation ;-)\n\nI'd like to spend a day this coming week working through Alan's\n50-of-100 notes, and the use cases you have in mind.  (Alan, can we\nmake the document public?)\n\nAs for presentations and slides, Etoys remains for the time being our\nsupported method for importing .ppt -- Rebecca, have you tried this?\nWere you asking for something more specific?\n\nSJ\n\nps - That might also be a good opportunity to think about what a\ngeneric bundle looks like.\n\nOn 6/2/07, Alan Kay  wrote:\n> You might want to check out what Etoys actually does and is. (Hint:\n> it covers your desiderata beIow pretty well.)\n>\n> I suggest perusing the document that I made up for the OLPC countries\n> meeting a few weeks ago. Nia Lewis will probably have a copy.\n>\n> Cheers,\n>\n> Alan\n>\n> At 07:50 AM 6/2/2007, Eben Eliason wrote:\n> >Ever since this project began, I've had this idea in my head regarding\n> >what a \"slideshow\" might mean on the OLPC machine.  I'd really like to\n> >see an activity called \"Collage\" which is something like a modern\n> >descendent of Hypercard.  It should take the idea of embedding media\n> >further, of course allowing images, sounds, video and text, but\n> >perhaps also supporting live logo turtles, live editable text boxes\n> >and other interactive forms.  Ideally, there would be an interface\n> >which made it pluggable so that any activity could embed its formats\n> >and provide hooks for interacting with it.\n> >\n> >Bringing it all together, it should support a basic logo-like\n> >scripting language.  This could allow simple actions like \"next page\",\n> >but could also be allowed to pull text from the live text boxes via\n> >some identifiers, animate the embedded objects, track some basic mouse\n> >and keyboard events, and interact with hooks provided by the plugins.\n> >\n> >A child could create a single page, or a simple slideshow, but by\n> >taking full advantage of the nature of the scripting which pulls\n> >things together, they can create non-linear books, interactive\n> >animations, science reports with embedded interactive experiments,\n> >games, and more.\n> >\n> >As fun as this would be for kids, I also see this as being a fantastic\n> >format for teachers to create lesson plans in:  provide some\n> >instructions with text and images, embed a video about the topic,\n> >script up a little physics simulation that the kids can experiment\n> >with, embed an abiword table widget which automatically records the\n> >results of the experiment, and place some questions with textboxes at\n> >the end so the kids can answer them and then turn in their \"lab.\"\n> >Heck, you could even automatically check the answers when they are\n> >done, or interactively assist them when they answer incorrectly,\n> >nudging them along or referencing the results table again.\n> >\n> >- Eben\n> >\n> >\n> >On 6/2/07, Rebecca Gettys  wrote:\n> > > Hi All,\n> > > I think that sideshows CAN be very sueful in the class room, and they\n> > > have actually taught be to pay attention to detail. You need notes to do\n> > > anything really, and they do have their applications with other\n> > > students. Just a thought.\n> > > ~Rebecca\n> > > _______________________________________________\n> > > Devel mailing list\n> > > Devel@lists.laptop.org\n> > > http://lists.laptop.org/listinfo/devel\n> > >\n> >_______________________________________________\n> >Sugar mailing list\n> >Sugar@lists.laptop.org\n> >http://lists.laptop.org/listinfo/sugar\n>\n> _______________________________________________\n> Sugar mailing list\n> Sugar@lists.laptop.org\n> http://lists.laptop.org/listinfo/sugar\n>\n_______________________________________________\nSugar mailing list\nSugar@lists.laptop.org\nhttp://lists.laptop.org/listinfo/sugar\n\n"}