{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Ronny Baldwin\" <veqdekgxod@dekg.org>", "subject": "Stop being obese and unhappy", "body": "\nBe leaner and slimmer by next week\n\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting product for over-weight people is now readily available – As told on CNN.\n\n\nCan you hold in your memory all the situations when you appeal to yourself to do anything for being rescued from this quickly growing number of kilos? Happily, now no major price is to be paid. With Anatrim, the ground-shaking kilos-melting mixture, you can get healthier lifestyle and become really thinner. Just look at what our customers say!\n\n\n\n\"I hate to confess but I was extremely addicted to food. \n\n\nI greedily swallowed up all this garbige \n\n\nand just could not stop. \n\n\n\n\nThis suffering stopped after I started course with Anatrim! \n\n\nHoly God,\n\n\n\n\n my craving for food abated, \n\n\nmood improved and I became the happiest person 18 pounds in 2.1 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nAmely S., Chicago\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nYou can't even fancy how I abhorred being derided at school. \n\n\n\n\nI detested the weight and I abhorred myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nIt literally pulled me out of this awful nightmare! A plenty of thanks to you, my friends.\"\n\n\n\n\n\nRikky Martin, New York\n\n\n\n\n\n\"You know what? Thanks to Anatrim my marriage was happily saved! I went into this circle, depression – more eating – even more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nOnce one of my friends showed me web page and I asked for pack of Anatrim immediately. \n\n\nThe results I achieved were magnficent, my appetite came to normal level, I was in good spirits oftener, and, certainly, I became able to tighten my belt on some holes. And you see, the sex became fantastic also!\"\n\n\n\n\n\nRikky\n\n\n\n\n There is a lot of testimonials happy people leave after taking Anatrim. Why don't you add yourself to the tens of thousands of slender customers and take this all-natural appetite abating energy lifting product now!\n\n\nDo not lose the chance!\n\n\n\n\n"}