{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's Newsnight & Newsnight Review", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tFRIDAY 18 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM EMILY MAITLIS\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nTHE EDGWARE DISSIDENT\n\n\nNewsnight understands that one man, living in Edgware, may be masterminding a political campaign which could keep Pakistan's President Musharraf in power. Altaf Hussain is the leader of the Muttahida Quami Movement - MQM. He directs his flock via phone - when he talks thousands gather round in Pakistan to listen to him on loudspeaker. \n\n\nBut his critics - amongst them cricket legend turned opposition politician Imran Khan - say he shouldn't even be here. He accuses the British Government of giving sanctuary to a man whose party he alleges was linked to recent violence in Pakistan. Tonight we'll look at the Edgware operation, and speak to Imran Khan in Islamabad. \n\n\nGB TOUR\n\n\nYesterday a softer, humbler sounding Prime Minister elect said he wanted to win back trust for the Labour Party and listen to the country.  So we take to the road for the GB tour to see what he really means and indeed what the country's saying. \n\n\nWe kick off in Basildon, a bell weather constituency which was Tory under Thatcher and Labour under Blair. What do they make of Zombie?\n\n\nGOOD DAY FOR BURYING AWKWARD NEWS?\n\n\nMPs have just passed a controversial bill to exempt themselves and peers from freedom of information laws. What does this mean in practice? It means all of us - voters, media, the public at large, will have a much harder time finding out the truth from them. Just how does this fit into Zombie Brown's new attempt to build trust? \n\n\nWEMBLEY\n\n\nWe've almost forgotten how many years late it is but tomorrow the stadium will officially open. We have an interview with Michael Cunnah, the former CEO of Wembley who oversaw the building project. And we ask what the organizers of the Olympic Games should be learning from Wembley's mistakes. \n\n\nDo join us at 10:30pm on BBC2.\n\n\nEmily\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nIRAQ'S FUTURE\n\n\t\t\t\t\t\t\tWe examine the effectiveness of the Iraqi government and the chances of a stable future\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\nnewsnight review\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tPRESENTED BY KIRSTY WARK\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tAnd on Newsnight Review, Natalie Haynes, Grayson Perry, Denise Mina and Tony Parsons will be here to give their verdict on the week's cultural releases:\n\n\nZODIAC\n\n\nDavid Fincher's new film Zodiac, starring Mark Ruffalo, Jake  Gyllenhaal, and Robert Downey Jr is based on the real story of the California serial killer who brought terror to the area for more than a decade and who taunted the police and the press with codes, ciphers, calls and letters but who was never caught.\n\n\nANTONY GORMLEY\n\n\nAntony Gormley's retrospective at the Hayward Gallery in London has been heralded by the appearance of 31 life size cast iron figures on the roofs in sight of the gallery; an installation called Event Horizon, while inside there is selection of both new and older iconic pieces. The centrepiece is Blind Light, a glass room, into which visitors literally disappear in a vapour cloud.  It is a disconcerting experience - I was reminded of almost getting lost in the mist on Goatfell on the island of Arran.\n\n\nWHAT IS THE WHAT by DAVE EGGERS\n\n\nDave Eggers' new book What is the What is an unexpected novel from the writer whose calling card was A Heartbreaking Work of Staggering Genius, but this too is a kind of memoir. It is the result of collaboration with Valentino Achak Deng, from southern Sudan who was finally resettled in America in 2001 after many hellish years in African refugee camps.  \n\n\nAt the age of six or seven he became one of the thousands of Sudanese \"Lost Boys\" who trekked thousands of kilometres through unimaginable terror - beheadings, slaying of children, children dying of hunger and thirst, or killed by lions - to flee the militias of the Arab led government in Khartoum, who attacked the African population during the Second Sudanese Civil War.\n\n\nRUFUS WAINWRIGHT - RELEASE THE STARS\n\n\nAnd finally, Rufus Wainwright's new album Release the Stars finds him in a more restrained and happier place than before, and with music perhaps destined to bring him the commercial success that has eluded him so far. But as ever the music is both personal and political including the lyrics, \"I'm so tired of America.\" \n\n\nDo join us at 11. \n\n\nKirsty\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}