{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Siddharth Varadarajan op-ed in the Hindu: Putting people's health before company profits", "body": "--\n[ Picked text/plain from multipart/alternative ]\n\n\n\n  While Merck maintains a country like Brazil can afford to pay more for\nits drug than countries which are poorer, Brasilia has taken the fight\nfor lower prices one step further by pushing for a resolution at the\nrecently concluded World Health Assembly in Geneva encouraging\ngovernments to address \"the linkage between the cost of research and\ndevelopment and the price of medication.\"\n\n  The resolution was passed unanimously after one delegation  the United\nStates  walked out. Washington's fear  and the fear of the big drug\ncompanies for whom the U.S. administration always bats  is that\nBrazil's decision might prompt other countries to join the slowly\nexpanding `Axis of IP Evil.' Last year, Thailand thumbed its nose at\nthe U.S., issuing compulsory licenses for three patented formulations,\nincluding Efavirenz and Kaletra. China, Cuba, South Africa, and India\nare also considered members of the `axis,' though India's new Patents\nAct, passed amid opposition by health advocacy groups in 2005, grants\npharma companies considerable leeway as far as patent protection is\nconcerned.\n\n  For Brazil and India, increased collaboration in the pharmaceutical\nsector is a priority area on the bilateral front and at least one\nIndian drug company, Strides Arcolab, has already established a\nmanufacturing facility in Brazil under the name Cellofarm. But health\nactivists are also looking forward to greater cooperation between the\ntwo countries at both the WTO and World Health Organisation. \"It was\namazing to see how closely the Brazilian and Thai delegations worked\ntogether at the WHO's World Health Assembly earlier this week,\" Dr.\nMeera Shiva, an NGO observer, told this correspondent. \"India must also\nbe in the forefront of the struggle for cheaper drugs and social\nmedicine.\"\n\n\n------------------------------\n\nDate:01/06/2007 URL:\nhttp://www.thehindu.com/2007/06/01/stories/2007060102701100.htm\n\nOpinion - News Analysis\n\nPutting people's health before company profits\n\n  Siddharth Varadarajan\n\nBrazil's AIDS control programme will save $30 million every year by\nbreaking Merck's patent on Efavirenz.\n\n  TUCKED AWAY inside a nondescript campus on the outskirts of Rio de\nJaneiro, the silent, gleaming corridors of the Farmanguinhos Drugs\nTechnology Institute have emerged as the latest battleground in the war\nbetween big pharma and the handful of national governments seeking to\nprevent monopoly profits from coming in the way of their citizens'\nhealth needs.\n\n  As a state-run institute, Farmanguinhos manufactures and supplies the\nHealth Ministry's \"strategic programmes\" with drugs that are freely\ndistributed to the Brazilian population through the country's `unified\nhealth system' (SUS). With more than 180,000 registered AIDS patients\nand a presidential decree ordering the free supply of medication to\nthem, the Brazilian Health Ministry spends more than $450 million every\nyear buying anti-retroviral drugs (ARVs). One of these is Efavirenz, a\npatented drug developed by the U.S.-based company, Merck, and sold to\nBrazil at $1.56 a tablet or $580 per patient for a year's supply.\n\n  With comparable generics available from India for as little as $0.45 a\ntablet, the Brazilian authorities had long been pressing Merck for a\nprice reduction. Under existing World Trade Organisation rules,\ngovernments have the right to issue a \"compulsory license\" for patented\ndrugs if there is a pressing public health need, thereby enabling the\nimport of cheaper generics as well as the domestic reverse-engineering\nof patented formulations.\n\n  Shortly after winning the national elections for a second time,\nhowever, the government of President Luis Inacio Lula da Silva struck.\nOn April 25, the Health Ministry notified Efavirenz as a drug of public\ninterest, the first step towards compulsory licensing. Merck finally\noffered a 30 per cent price cut, which the Brazilian government\nrejected as inadequate. Finally, on May 5, a compulsory license was\nissued.\n\n  Farmanguinhos and another public laboratory have now begun work on\nmanufacturing the drug and are expected to begin production within a\nyear. In the interim, the government has said it will buy the requisite\nquantity of the generic version of Efavirenz from India. The three\nIndian companies likely to benefit from this are Cipla, Ranbaxy, and\nAurobindo Pharma.\n\nLula's line\n\n  In his public statements, President Lula has been direct. \"It is not\npossible for anyone to get rich with the misery of others. In a choice\nbetween our trade and our health, we will take care of our health,\" he\nsaid in a speech announcing the licensing decision. He also warned that\naction might be taken in the case of other drugs too. \"If the prices\nare not fair, not only for us, but for every human being infected on\nthis planet, we will have to make this decision.\"\n\n  For President Lula  who arrives in New Delhi on Sunday for an official\nvisit  this new willingness to confront big drug companies marks a\nshift from his earlier policy of seeking only modest concessions.\n\n  Not surprisingly, Brazil's push for compulsory licensing is the result\nof spiralling costs since 2005, caused mainly by the proportional\nreduction of first-line drug use, which are locally manufactured, and\nincreased second line therapies, all imported and patent protected.\n\n  According to the Brazilian Health Ministry, the Efivarenz compulsory\nlicense will save the country $30 million a year and as much as $237\nmillion by 2012, when Merck's patent expires.\n\n  In legal terms, Brazil is not breaking Merck's patent but only\nsuspending it. And a royalty of 1.5 per cent will be paid to the\ncompany for all generics sold in the country at the price of $0.45 or\nlower.\n\n  According to Oxfam, developed countries in North America, Europe and\nEast Asia account for 80 per cent of global pharmaceutical sales. The\nwhole of sub-Saharan Africa and South Asia, on the other hand, accounts\nfor less than two per cent of global sales. Thus there is no reason why\ncompulsory licensing by developing countries should have an adverse\nimpact on the incentive of big pharmaceutical companies to invest in\nR&D.\n\n  While Merck maintains a country like Brazil can afford to pay more for\nits drug than countries which are poorer, Brasilia has taken the fight\nfor lower prices one step further by pushing for a resolution at the\nrecently concluded World Health Assembly in Geneva encouraging\ngovernments to address \"the linkage between the cost of research and\ndevelopment and the price of medication.\"\n\n  The resolution was passed unanimously after one delegation  the United\nStates  walked out. Washington's fear  and the fear of the big drug\ncompanies for whom the U.S. administration always bats  is that\nBrazil's decision might prompt other countries to join the slowly\nexpanding `Axis of IP Evil.' Last year, Thailand thumbed its nose at\nthe U.S., issuing compulsory licenses for three patented formulations,\nincluding Efavirenz and Kaletra. China, Cuba, South Africa, and India\nare also considered members of the `axis,' though India's new Patents\nAct, passed amid opposition by health advocacy groups in 2005, grants\npharma companies considerable leeway as far as patent protection is\nconcerned.\n\n  For Brazil and India, increased collaboration in the pharmaceutical\nsector is a priority area on the bilateral front and at least one\nIndian drug company, Strides Arcolab, has already established a\nmanufacturing facility in Brazil under the name Cellofarm. But health\nactivists are also looking forward to greater cooperation between the\ntwo countries at both the WTO and World Health Organisation. \"It was\namazing to see how closely the Brazilian and Thai delegations worked\ntogether at the WHO's World Health Assembly earlier this week,\" Dr.\nMeera Shiva, an NGO observer, told this correspondent. \"India must also\nbe in the forefront of the struggle for cheaper drugs and social\nmedicine.\"\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n--\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}