{"category": "spam", "to_address": "<iplacereports@flax9.uwaterloo.ca>", "from_address": "\"JohnLansing@Investorplace.com\" <JohnLansing@Investorplace.com>", "subject": "Trade Talk Weekly June 19 2007: Market Check Up", "body": "\n\nTrade Talk Weekly Update\n\n\n\n\n\n\n\n\nJune 19, 2007\n“Market Checkup”\nI’ve told you before, and I’m going to tell you again: the market may look like a happy, healthy person in their prime but that’s all an illusion.   Take the market for a full physical — scan it through the MRI machine — and you’ll see it breaking down.\n\nYou may wonder how I can be so sure of myself.   Have I lost my marbles?   Am I too stubborn to admit my predictions have been wrong?   No and no.   I am absolutely 110% certain that there is an inevitable correction headed our way.   The red flags continue to pop up proving me right.\nPresenting the Proof\nIs my confidence not enough to convince you of the upcoming market correction?\nFair enough.\nI present you with the proof that can’t be ignored:\n\nQQQ Performance: Okay, so we had a nice three-day rally late last week.   The market was clamoring over it, for sure.   But should we really have been so excited?   Considering that if not for Friday’s price action — allowing a super-light volume (0.78%) bounce for the day and therefore up 0.67% for the month — we would not even be up for the month!\nHitting Resistance: NASDAQ stock exchange hit its all-time high back on March 10, 2000 at 5132.52 and it bottomed around the latter part of 2002.   Now, for the first time since then, we are approaching the 38.2% Fibonacci retracement area.   And if you don’t know, that is a huge area of resistance.\nSo let’s review: the bubble popped and eventually crashed and ever since we have been in this counter-trend rally.   But up until now, we have never even come close to the minimum percent retracement area.   That changed on Friday.   And now we are just not that far off.\n\nThe $NASI: Lately, we have been in drifting mode.   This lack of momentum can best be shown in the Nasdaq Summation Index ($NASI).\n\nAs you look at the chart, what can’t be ignored is how it continues to make lower highs.   Stocks have traded sideways even though the NASDAQ itself has continued to fluctuate ever so slightly up.   Bottom line: it hasn’t had the participation of a lot of stocks.\n\nThe Evil Twins: There are two distinct patterns that should capture your attention.   One is the Megaphone Bottom, which can currently be seen in the QID (remember, it trades inverse to the QQQs).   For every bullish thing going on in this pattern in the QID, there’s an evil twin—the Megaphone Top—that we see within the QQQs.   For the bullish divergence we see in the QID, we see the bearish divergence in the QQQs.\nNASDAQ New Highs ($NAHGH): This chart proves the market’s bullishness (or lack thereof).   NASDAQ new highs have failed to take out previous rally highs even though the index is up from prior weeks.   Back in April, when we at Trending123 sold off all our stocks, was the last time the NASDAQ closed at new highs.   We haven’t crossed that area since then!\nVolatility Index (VXN): The fact is there’s no buying pressure right now.   The low volume up days to the high volume down days all spells distribution.   Forget the bearish divergence; forget the chart patterns, JUST LOOK at the buying pressure and the selling pressure!\n\n\n\n\n\n\nDecoding Fibonacci\nIf you’ve seen The Da Vinci Code, you’ve heard of the Fibonacci sequence.   And those of you who’ve been reading Trade Talk for a while might remember our explanation of this curious series of numbers.   For the rest, let’s review.\nThe Fibonacci sequence is used in many fields, including trading.   Its name comes from an Italian mathematician, Leonardo of Pisa, son of Bonacci—in Latin, filius Bonacci, or simply Fibonacci.   Fibonacci helped popularize both this sequence and the superiority of Hindu-Arabic numerals (1, 2, 3, etc.) over Roman numerals (I, II, III, etc.) in the early 13th Century.\nThe Fibonacci sequence starts with 0 and 1.   After that, every number in the sequence is the sum of the previous two.   So, since 0 + 1 = 1, the next number is 1, giving us 0, 1, 1.   Since 1 + 1 = 2, the next number is 2, giving us 0, 1, 1, 2.   Can you guess the next number?   That’s right—it’s 3.   Continue the pattern, and you get 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, and so on to infinity.   Interestingly, the higher you go in the sequence, the closer the ratio between each pair of consecutive numbers gets to the Golden Mean, or 0.618.   People of various cultures, from the ancient Greeks and Romans to stock market analysts today, have believed for millennia that this ratio occurs again and again in nature and human behavior.\nIn modern trading, we can apply this to identify retracement levels useful for setting target prices, stop losses, and strategic points to place trades.   For instance, in a strong trend, the minimum retracement level is generally anywhere from 38.2% (1 − 0.618 = 0.382) to 61.8% (0.618).   The difference between 61.8% and 38.2% is 23.6%, and the median point between them is 50%. \nTogether, these four numbers (23.6%, 38.2%, 50%, and 61.8%) represent the key Fibonacci ratios used in trading.   If you take a stock chart and draw a line at each level relative to a stock’s highest and lowest price over a given period, you’ll have a better idea of where the price might find support or resistance in a retracement before it continues its trend.\nAs you can see, we have a lot to thank Fibonacci for.   After all, just think how difficult trading would be if we measured stock prices in Roman numerals: “The closing price of GSS yesterday was III dollars and LXXXI cents.”\n\n\n\n\nAs bullish as the three-day rally was late last week, why would the VXN have closed so bullishly on Friday?   Let me repeat: If everything was UP, why would the VXN continue to go UP as well?\nThe fact is that we are back to the same levels of support that were reached toward the middle to the end of February — just before we had the big correction at the end of February/beginning of March.   (If this isn’t ringing any alarm bells in your head, it should!)\nAnyone for a “Loser” Stock?\nFewer and fewer stocks continue to make new highs.   The rally movement has been increasingly selective and that is why it is so much easier right now to buy a loser than it is to buy a winner.\nI’m not in the business of recommending losers.   That’s why I have to suggest my valued subscribers get back into the market.   It’s simply not safe right now.\nAnd don’t go pegging me as a conservative or cautious investor.   I assure you, I am not.   It’s just not the time to throw caution to the wind — unless of course you have money to burn.   Because no matter what you see on the index right now, the internals are no different than what we saw a week ago, a month ago or six weeks ago.\nSurface health may continue to appear vibrant but now you know what is really happening inside.   If you want to take an even deeper look around, I invite you to join me at Trending123 right now.\n\nSincerely,\n\nJohn LansingTrending123\n\nP.S. We will be back in the market — when the time is right.   And when we are, I expect to get right back to taking profits.   In the past, we have made gains like 23.23% in Valero, 33.56% in Pacific Sunwear and 38.71% in Tessera Technologies.   If you want a chance to earn sudden profits — 10%–30% gains (and sometimes higher), often in a matter of weeks, or even days, then join me today at special introductory price!\n\n\n\n\n\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you.   Please tell us if your email has changed by visiting here: http://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice from InvestorPlace advisors, you can let us know by visiting \nhttp://www.investorplace.com/u/?p=8FP197-1&e=iplacereports@speedy.uwaterloo.ca\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,2420A Gehman LaneLancaster, PA 17602\nCopyright © 2007 ACP Phillips Investment Resources, LLC.\nAll rights reserved.\n06/19/2007 6:08PM\n\nThank you for subscribing to InvestorPlace.com.   Please note that we cannot be liable for any missed bulletins caused by overzealous spam filters.   To ensure that you continue to receive this valuable part of your service please take a moment to add (JohnLansing@InvestorPlace.com) to your address book.   Click here for instructions:\nhttp://www.investorplace.com/whitelist.php?eml=JohnLansing@InvestorPlace.com\n\nee==8FP197\n\n\n\n\n\n\n"}