{"category": "ham", "to_address": "\"Eben Eliason\" <eben.eliason@gmail.com>", "from_address": "Bert Freudenberg <bert@freudenbergs.de>", "subject": "Re: [sugar] Rebe", "body": "Indeed, \"scratchpad\" describes Etoys pretty precisely ;)\n\nYou can draw, write (even with multi-column text layout flowing  \naround abjects), and of course calculate.\n\nIt's not just \"type anywhere and a curve pops up\", although in fact  \nsuch an extension exists (but not included in the OLPC Etoys  \nversion): called MathMorphs and MorphicWrappers done by the  \nArgentinian Squeak community a couple years ago:\n\thttp://www.dm.uba.ar/MathMorphs/\n\nand updated to work in recent Squeak releases\n\n\thttp://wiki.squeak.org/squeak/5855\n\nIf there is enough interest in this (and I agree it's a great  \nenvironment for exploring Math) we might try to find someone porting  \nit to the OLPC version. Or maybe it just works if installed, I  \nhaven't tried (unfortunately our plates are still full with lower- \nlevel stuff).\n\n- Bert -\n\nOn Jun 21, 2007, at 22:01 , Eben Eliason wrote:\n\n> Rebecca -\n>\n> This sounds similar to some of my ideas for \"Collage\"...allowing  \n> combinations of text, drawing, image, and other media formats in a  \n> freeform canvas.  The response there seemed that Etoys was, in many  \n> ways, already providing such a thing.  I think this is a really  \n> interesting area though, and the potential to be able to send  \n> multimedia documents around, specifically in an educational  \n> environment, is huge. Do you have more thoughts on specifically how  \n> this could be distinguished from Etoys?\n>\n> Additionally, there is the Sophie project, but I'm not that  \n> familiar with it or how far along they've come with the project on  \n> the XO.\n>\n> - Eben\n>\n>\n> On 6/21/07, Rebecca Gettys  wrote:  \n> Hello all,\n> I had an idea while playing witha green machine...this may be a little\n> late, I don't know. What if ther was some sort of \"scratchpad\"  \n> activity,\n> not draw, or write,or calculator but a kind fusion of all three.\n> mathimatical equasions could be typed out and then they could solve  \n> with\n> typing and or drawing for their work, and they could write guides and\n> picture books and such with this activity as well. Is this in\n> possible/in the plans/something similar is being made???\n> ~Rebecca Gettys\n>\n\n\n\n\n_______________________________________________\nSugar mailing list\nSugar@lists.laptop.org\nhttp://lists.laptop.org/listinfo/sugar\n\n"}