{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Jame Briggs\" <nifcomidesignsaw@comidesign.com>", "subject": "Pounds down, mood up", "body": "\nMelt away fat easily\n\n\n\n\n\n\nAnatrim – The latest and most delighting lose flesh product available – As were told on Oprah.\n\n\nDo you count up all the cases when you appeal to yourself to do any thing to get rid of this desperately growing number of kilos? Happily, now no great price is to be paid. Thanks to Anatrim, the ground-shaking kilos-melting medley, you can achieve healthier lifestyle and a really slender figure. Just look at what people write!\n\n\n\n\"It’s rather difficult to acknowledge it but I was an awful food addict. \n\n\nI ate all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis fatal passion stopped when I started taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my inclination to eat constantly abated, \n\n\nspirits improved and I’m the happiest person 25 pounds in 2.7 months. \n\n\n\n\nI can tell you now I turned to the happiest person!\"\n\n\n\n\n\nMaria H., Colorado\n\n\n\n\n\n\"Since the very childhood I was a weighty boy. \n\n\nYou can't imagine how I detested being mocked at school. \n\n\n\n\nI abhorred the weight and I abhorred myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nIt literally dragged me out of this horror! Many and many thanks to you, my friends.\"\n\n\n\n\n\nDave Klark, Colorado\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was saved! I went into the circle, depression – eating more – more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce my friend pointed at your site and I ordered up pack of Anatrim right away. \n\n\nThe final result was excellent, my appetite became normal, I was in a good mood oftener, and, certainly, I tightened my belt with no regrets. And you see, the bed became cool also!\"\n\n\n\n\n\nDave\n\n\n\n\n There is a lot of testimonials delighted people leave after taking Anatrim. Don’t you wanna join the thousands and thousands of slim women and men and take this all-natural appetite-reducing energy boosting product now!\n\n\nDo not miss your chance!\n\n\n\n\n"}