{"category": "ham", "to_address": "\"General Copyright Discussions \\(questions, organizing,\n\tetc\\)\" <discuss@list.digital-copyright.ca>", "from_address": "Russell McOrmond <russell@flora.ca>", "subject": "[d@DCC] Talk to MPs this summer Re: anti-circumvention! (Was: Re:\n Registering my opposition to Bill C-47)", "body": "Scott Elcomb wrote:\n> \"OTTAWA, June 22, 2007 -- The Honourable Maxime Bernier, Minister of\n> Industry, today proudly announced that Bill C-47, the Olympic and\n> Paralympic Marks Act, has received Royal Assent.\"\n\n\n   I was going to write about C-59 and how the debates about it in \nParliament and the Senate are a much more interesting study for how WIPO \ntreaty ratification might go (with the push from the Industry and Public \nSafety committees) --- but it seems that many of the parl.gc.ca websites \nare down right now.\n\n> Frustrated,\n\n   We need to talk to MPs, especially any in Industry, Public Safety, \nJustice or Heritage committees.  It is clear that the lobbying from the \nspecial interests pushing for anti-circumvention legislation is getting \nto the politicians, but our message is not.\n\n   If any of these folks are your MP or the MP in a riding close to you, \ndo everything you can to get a meeting with them!\n\nBTW: I wrote the following letter and both printed (and mailed in smail \nmail) and sent an email link to it on Friday.\n\n----\n\n   Dear Mr. James Rajotte, member for Edmonton-Leduc, and current chair \nof the Standing Committee on Industry, Science and Technology (INDU),\n\n   Brian Masse, member for Windsor West, and current NDP Industry Critic,\n\n   On May 4, 2004, I was invited to be a witness in front of the \nStanding Committee on Industry, Science and Technology.  The debate was \non Bill C-2 (An Act to amend the Radiocommunication Act). I was invited \nto speak about the unintended consequences surrounding the excessive \nregulation on the manufacture, import, ownership and use of \nmulti-purpose communications technology.  I spoke about how the language \nof the bill has components similar to the 1996 WIPO treaties and the \nmassive harm that ratification of these treaties would have to the \nproperty rights of technology owners, the rights of software authors, \nthe rights of users of digital content, and the rights of a majority of \ncontent creators.\n\n   I had the impression that it was the two of you, as Industry critics \nfor the Conservatives and NDP in that Liberal minority government, that \nhad me invited.  At the time the Heritage committee seemed unwilling to \ninvite people not seen as historical stakeholders in the copyright \ndebate, and the two of you observing this wanted to have the views of \nsomeone from the software and technology community on the record.\n\n   Industry Committee recently had similar hearings where only a tiny \nsubset of relevant stakeholders were invited.   The results of the \nmisinformation and half-truths you received was the report the committee \n  recently tabled titled \"Counterfeiting and Piracy are theft\".\n\n   I explain in an article titled \"Jefferson Debate: A Godwin's law for \ncopyright discussions?\" why the inappropriate reference to \"theft\" is \noffensive to many of us involved in this area of public policy, and how \nthis language is abused to shut down debate.  I am enclosing a copy of \nthis article.\n\n   http://www.digital-copyright.ca/Jefferson_Debate\n\n   The primary problem with the report (beyond language) is not issues \naround counterfeiting, but things unrelated to counterfeiting that these \nspecial interest groups tried to lump together. I believe it is \ncritically important that we have a conversation about the harm to the \nCanadian economy that will come from so-called \"anti-circumvention\" laws \n(prohibiting owners removing third party digital locks from the hardware \nwe own, or the software that drives the hardware we own), and the \npossible ratification of the 1996 WIPO treaties.\n\n   I realize that parliament is in recess for the summer.  I would like \nto meet with you to discuss this issue. If necessary I can pay some \namount out of my own pocket for traveling.  Easier for me is if I could \nmeet in Ottawa.  Another possibility is to have a voice-only \nconversation (phone, Internet) at your convenience.\n\nMy contact information is as follows:\n\n[contact info removed -- see http://flora.ca#contact ]\n\n-- \n  Russell McOrmond, Internet Consultant: \n  Please help us tell the Canadian Parliament to protect our property\n  rights as owners of Information Technology. Sign the petition!\n  http://www.digital-copyright.ca/petition/ict/\n\n  \"The government, lobbied by legacy copyright holders and hardware\n   manufacturers, can pry my camcorder, computer, home theatre, or\n   portable media player from my cold dead hands!\"\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}