{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Genesearch <enews@genesearch.com.au>", "subject": "Autumn Antibody Sale", "body": "\nYou're receiving this email because of your relationship with Genesearch. Please confirm your continued interest in receiving email from us (and optionally choose your interest categories). You may unsubscribe if you no longer wish to receive our emails.\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAutumn Antibody Sale20% off all total protein antibodies until June 30!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    In This Issue\n                    \n\n\nTotal Protein Signaling Antibodies\n\nSignaling Antibodies Pathways\n\n\n\n\nQuick Links\nCST website\nGenesearch website\nAustralian pricesAntibodies on special\n\n\n\n\n\n\n\n\n\n\nTotal Protein Signaling Antibodies\n                    \n\n\n\n\n\nCST now sells almost 1,000 separate total protein\nantibodies, including polyclonal and mouse or rabbit monoclonal\nantibodies.These\nantibodies can be used to detect your total (e.g. phosphorylated plus\nnon-phosphorylated) protein of interest, as a control in conjunction\nwith the corresponding state-specific antibodies, or on their own.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear zombie,\n\n\nCell Signaling Technology (CST) are leaders in phospho-specific and other activation state-specific antibodies for cell signaling research, but did you know they also have a rapidly expanding range of total protein antibodies (i.e. ones that detect both the active and inactive forms of their target signaling proteins)?Until the end of Autumn and to make that first month of winter just a little bit cozier, Genesearch is offering CST's entire range of total antibodies at 20% off list prices!\n\n\n\n\n\n\n\n\n\n\n\nSignaling Antibodies Pathways\n\n\nActivation state-specific and total protein antibodies for a broad range of signaling pathways are available from CST, including:Chromatin regulationMAPK signalingApoptosis / CaspaseAkt signalingTranslational controlCa, cAMP & lipid signalingCell cycle / checkpointJak/Stat pathwayNF-kappaB signalingTGF-beta / SMAD signalingLymphocyte signalingNeuroscienceTyrosine Kinase / AdaptorsCytoskeletal signalingGlucose metabolismWnt / Hedgehog signalingNuclear receptorProtein folding & stabilityFor the full range of CST antibodies and further technical information, visit www.cellsignal.com. For all our current total protein antibodies, view the complete list here.Discounted prices until the end of June for most small sizes of the total protein antibodies are 100 ul for $271.20 (before GST) (no further discounts apply). Check the prices of your items of interest on our web price list or by calling 1800 074 278.\n\n\n\n\n\n\n\n\n\n\n\n\n\nOrder now to try these quality antibodies while these special prices last! Performance to specifications is guaranteed. \nSincerely, \n\nGenesearch \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrices quoted are before GST and subject to change without notice. Contact Genesearch or visit our web site for current Australian prices.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSave 20%\nJust order by June 30 and you will receive 20% off the list price of any CST total protein antibodies as listed here. No further discounts apply.\n\n\nOffer Expires: June 30, 2007\n\n\n\n\n\n\n\n\n\n\nForward email\n\n\n\n\nThis email was sent to ktwarwic@speedy.uwaterloo.ca, by enews@genesearch.com.au\nUpdate Profile/Email Address | Instant removal with SafeUnsubscribe™ | Privacy Policy.\n\n\nEmail Marketing by\n\n\n\nGenesearch | 14 Technology Dr | Arundel | 4214 | Australia\n\n\n\n\n"}