{"category": "ham", "to_address": "Samuel Klein <meta.sj@gmail.com>", "from_address": "Don Hopkins <dhopkins@DonHopkins.com>", "subject": "Re: [sugar] [OLPC India] xbook : pdf viewer in $100 laptop", "body": "\n\n\n\n\n\n\nHello, Kumar. \n\nI will write some stuff to the wiki page about the ebook reader, to\ndescribe what I've been working on and where we could take it. \n\nI agree, it would be great to have a voice synthesizer read the text\nout loud! \n\nThere's a great, fast, small open source speech synthesizer called\n\"flite\" from CMU:\n\nhttp://www.speech.cs.cmu.edu/flite/\n\nA commercial version of flite and a bunch of voices (and demos) are\navailable from Cepstral:\n\nhttp://www.cepstral.com\n\nCepstral develops commercial quality voices, including US English, UK\nEnglish, Italian, German, Canadian French, Americas Spanish, and\nWoofing Dog (which is the most universally recognized international\nlanguage by far). \n\nThe difficult part about speech synthesis on the OLPC is that it\nrequires a huge amount of meticulous production work to make a voice\nfor any particular language, and the OLPC is intended to support many\ndifferent languages. \n\nI asked how much it cost to produce a custom voice, and they\nestimated the production work would cost about $10,000 for an English\nvoice, and more for voices in\nother languages (especially if they haven't done the language before),\nbut less for animals like dogs and cats ;-). \n\nIt would be way cool if Cepstral could donate some of the voices\nthey've developed for other languages, for use by kids on the OLPC! \n\nThere are some good free English voices, of course, so we could\ncertainly ship an English speech synthesizer. \nAn English voice would be helpful for teaching English, but making\nvoices for all the different languages the OLPC will support is an\nenormous task. \n\nA good low-tech approach for now would be for the eBook reader to\nenable recording and playing back an audio voice-over of a real person\nreading each page. \n\n    -Don\n\n\nSamuel Klein wrote:\nHi Kumar, \n\nThanks for the suggestions.  If you want to help with development, we\ncould use help developing xbook / pdf viewing so that runs quickly on\nthe laptops.  Don Hopkins has also been looking into this, and thinking\nabout a feature wishlist for an ideal viewer.  Please add to the ideas\nhere: \nhttp://wiki.laptop.org/go/Talk:Books#Bookreader_features\n\nYou might send these kinds of notes to sugar@laptop.org\n   as well, where there is a discussion underway about how to\nimprove the bookreading experience.\n\nSJ\n\nOn 4/19/07, Kumar Pritam <\nkumarpritam84@gmail.com> wrote:\nHi\neverybody,\n I am very glad and enthusiastic about this project(OLPC). It's really\na project which is gonna revolutionize the education system and make it\neasy to learn.\n    \n As far as pdf viewer is concerned, i would like u to consider adding\nthese functionalities also.\n    \n 1. Full screen View(no options, just d keyboard interface to navigate,\nonly contents will be shown on the display)\n 2. What about \"a reader(a voice : text to speech conversion)\" to read\nthe document.\n\nPlease let us know more about how can we be more helpful in making the\nOLPC projetc a success. It can be anything related to development or\npromotion.\n\nThanks a lot.\nWith regards:\n-- \nKumar Pritam\n    \nNIE Mysore\n\n\n\n\n\n"}