{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Meagan Fair\" <mawchennorfig@chennor.com>", "subject": "Stop the painful craving for more food", "body": "\nLosing weight has never been so easy\n\n\n\n\n\nAnatrim – The newest and most exciting product for corpulent people is now readily available – As told on CNN\n\n\n\nDo you know that redundant body kilograms kill a lot of people around the world? We know you hate the unsightly appearance of those people and the low status they obviously have in modern society. \n\nOr, maybe, you got no will to withstand pressure of pernicious eating habits of yours. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nWe are proudly introduce you Anatrim, the later product for the reduction of your body’s extra weight. The greatest thing about Anatrim is it raises the quality of your life by soothing your feeling of hunger and giving you better cheer. Here’re what people write to us about this product:\n\n\n\n\n\n\"It is amazing! \n\n\nInstead of stuffing myself with food and watching TV constantly \n\n\nI became more interested in exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I’m in a great form now and there are lots of men in my way!\"\n\n\n\n\n\n\nVictoria K., Colorado\n\n\n\n\n\n\n\"I tried some passive weight burning, but almost with no result. This terrible hunger would just kick in and spoil everything. \n\n\nOnce I heard about Anatrim in the media and it brought a great influence on me.\n\n\n I had tried using it, and my wife told me I'm a different person now, 3 months later. \n\n\n34 pounds have gone away and this is still far to an end! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nCharley Mock, Boston\n\n\n\n\n\nAnatrim helps your mind to understand that you got no such great need for that much food. It raises your spirit, provides you with energy, and attacks useless kilos. Especial thanks to its mighty comprehensive formula!!\n\n\n\nElicit more useful information!\n\n\n\n"}