{"category": "ham", "to_address": "<ip-health@lists.essential.org>", "from_address": "\"Sean Flynn\" <sflynn@wcl.american.edu>", "subject": "[Ip-health] Second Wave of AIDS drug activism", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nThe Second Wave of Developing Country Activism on AIDS Drug Pricing\n\nSean Flynn and Mike Palmedo\n\nProgram on Information Justice and Intellectual Property\n\nAmerican University Washington College of Law\n\nMay 8, 2007\n\n\n\n\n\nThe announcement today of further generic AIDS drug price reductions by\nthe Clinton Foundation, following close on the heels of compulsory\nlicenses issued by Brazil and Thailand, indicates that the second wave\nof developing country activism to create competitive generic markets for\nneeded AIDS drugs has arrived.\n\n\n\nThe first antiretroviral drugs to hit the market, such as AZT, were\noften not patented in low and middle income nations. Permissive patent\nlaws in India, Thailand, Brazil and other countries permitted the\nmanufacture and consumption of the first AIDS drugs without utilizing\ncompulsory licensing as permitted by the WTO TRIPS agreement.  But\ndeveloping countries knew then that the day would come when newer more\neffective medicines would be needed that would be covered by patents\nrequired by the TRIPS agreement.  That is why they fought through the\nWTO negotiations to retain the ability to grant compulsory licenses for\nany reason, including to meet public health challenges.\n\n\n\nBrazil and Thailand are developing countries with a long history of\nrobust public programs to treat people with AIDS.  These countries moved\nfirst to lower prices of second-line antiretrovirals because they have\nlarge numbers of patients with advanced disease who have been on\ntreatment long enough to require second-line treatments.  In addition,\nWHO guidelines for best treatment practices have shifted to advise\nincluding more newer medicines in the first line of treatment.  Over\ntime, all countries that desire to provide the best possible treatment\nto their residents with AIDS will reach this point and demand access to\nthe low prices that only generic competition can create.\n\n\n\nA highly-active antiretroviral treatment (HAART) regime, sometimes\ncalled a \"cocktail,\" typically consists of a backbone of two nucleoside\nanalogue reverse transcriptase inhibitors (NRTIs) plus a third powerful\ndrug such as a protease inhibitor (PI), or a non-nucleoside reverse\ntranscriptase inhibitor (NNRTI).\n\n\n\nBrazil and Thailand both recently issued compulsory licenses for\nefavirenz.  This drug is the most-prescribed NNTRI in the US, and it is\nrecommended by WHO as preferable to the older NNTRI nevirapine, which\nhas more side-effects. (Additionally, it can be used by people with both\nHIV and TB, while nevirapine cannot.)  Last year, the World Health\nOrganization recommended improved cocktails for first-line HAART\nregimes, half of which included efavirenz.\n\n\n\nThailand also recently issued a compulsory license for the combination\nof lopinavir and ritonavir, which is a highly potent Protease Inhibitor.\nThis is considered a first-line medicine in the U.S., but it is\ntypically used as a second line treatment in lower and middle income\ncountries, after patients have developed a resistance to less expensive\nfirst line drugs.\n\n\n\nThe problem facing Brazil, Thailand and other countries with mature\ntreatment programs is that there has not been a robust competitive\nmarket for generic second-line and second-generation AIDS drugs.\nGeneric competition in the supply of the first line medications,\nincluding drugs such as AZT, 3TC and Nevirapine, pushed prices down from\nover $10,000 to under $200 for a year's supply of full cocktail.  MSF\ndata show that the average price paid for second line treatments is\n$1,700 in low income countries and $5,229 in middle income countries.\nAs more and more patients need second line treatments, the burden of\nthese higher priced medications will grow more onerous.\n\n\n\nThe Clinton Foundation price reductions will improve the pricing\nlandscape by introducing further generic competition to the second line\nand improved first-line antiretroviral drug market.  Antiretroviral\nprices for the 66 countries that procure drugs through the Clinton\nFoundation's Procurement Consortium will immediately fall 25-67%.  Over\nthe long run, increased generic competition will lower prices worldwide.\nHowever, since the newer drugs are protected by more patents, further\ncompulsory and voluntary licenses and price reductions will be needed in\norder to continue - and expand - the provision of HAART in low and\nmiddle income countries.\n\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}