{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"Somatic Systems\"<Heather.Cohan@globalmarkithits.com>", "subject": "Somatic Systems CEO Interviewed for Television Feature", "body": "\n\n\nSomatic Systems CEO Interviewed for Television Feature\n\n\n\n\n\nSomatic Systems CEO Interviewed for Television Feature\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nSomatic Systems, Inc. Interviewed for Television Feature\n\n\n\n \n\n\n\n \nNORTHAMPTON, MA--(MARKET WIRE)--Jun 26, 2007 -- Somatic Systems, Inc. (Other OTC:SMAS.PK - News) is  pleased to announce that CEO Steven Aronstein was interviewed  extensively  this week for a potential feature about Somatic Systems  and their  proprietary Clinical Somatics techniques to appear on Women's  Entertainment  television network (WE tv).\n\n\n\n \n\n\n\n\n \nAdditionally, the program would be aired on the Travel Channel,  as well as  in syndication in other local television markets nationally.  Somatic  Systems' Clinical Somatics treatments and products were  identified as an  important element of their ongoing television series on  maintaining health  and wellness.\n\"This kind of exposure is really valuable in our current  business growth  strategies. WE tv is the kind of network that synergizes  with our  marketing efforts, catering to educated, health-conscious  women who are  generally the ones making the health care decisions for  the whole family,\"  stated Somatic Systems, Inc. CEO Steven Aronstein. \"We will  be seeking to  increase these types of opportunities to access media, culture  and  household recognition over the next years, in order to build  brand  awareness and make Somatics a household name.\"\nAbout Somatic Systems, Inc.\nSomatic Systems serves as the worldwide center for Clinical  Somatics and  Clinical Somatic Education, the groundbreaking pain-management  method and  fitness system of Thomas Hanna. We are home to some of the  only fully  trained, certified Clinical Somatics practitioners  in the Northeast, and  operate the largest clinical centers worldwide. Somatics  trains and  certifies clinical practitioners on how to reeducate and  recalibrate  overused or injured muscles through a simple series of training  sessions  and prescribed at-home movements that lengthen muscles back  to their  natural, relaxed state. We are very proud to be able to  provide access to  this revolutionary (and all too scarce) form of truly holistic  healthcare.\n\n \n \n\n\n \n\n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}