{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nSunday, 13 May, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nSheff Utd 1-2 Wigan\nWigan win at Sheff Utd to secure Premiership survival and relegate their hosts.\n\n\n\n \nMan Utd 0-1 West Ham\nCarlos Tevez fires West Ham to a shock win at Man Utd to keep his side in the Premiership.\n\n\n\n \nTottenham 2-1 Man City\nTottenham secure fifth spot with a narrow win over a determined City side at White Hart Lane.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nWestwood ends wait for tour title\nLee Westwood takes the Andalucia Open to win his first European tour title since 2003.\n\n\n\n \nAndalucia Open leaderboard\nLatest updates from the European Tour event in Marbella.\n\n\n\n \nO'Hair leads as Donald finds form\nSean O'Hair leads The Players' Championship after three rounds but Luke Donald moves into contention after a 65.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nHamilton takes lead in title race\nMcLaren's Lewis Hamilton leads the world championship after finishing second to Ferrari's Felipe Massa in the Spanish Grand Prix.\n\n\n\n \nHaga rides to double win at Monza\nNori Haga earns a win double at Monza but James Toseland increases his championship lead.\n\n\n\n \nLapwatch: Spanish Grand Prix\nThe McLaren and Ferrari drivers rejoin their intense world title battle at Barcelona's Circuit de Catalunya.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nHamilton takes lead in title race\nMcLaren's Lewis Hamilton leads the world championship after finishing second to Ferrari's Felipe Massa in the Spanish Grand Prix.\n\n\n\n \nLapwatch: Spanish Grand Prix\nThe McLaren and Ferrari drivers rejoin their intense world title battle at Barcelona's Circuit de Catalunya.\n\n\n\n \nMassa snatches pole from Alonso\nFerrari's Felipe Massa takes pole from Fernando Alonso in the dying seconds of qualifying for Sunday's Spanish Grand Prix.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nCheruiyot victory in Glasgow 10K\nVivian Cheruiyot wins the women's 10 kilometres road race in Glasgow.\n\n\n\n \nLegendary running track reopens\nA £19m sports complex is opened at the historic site where Roger Bannister broke the four-minute mile.\n\n\n\n \nGlasgow begins Commonwealth bid\nGlasgow's official 2014 bid document  is on its way to London to be handed over to the Games Federation.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nHoy fails with second record bid\nChris Hoy misses out on the kilometre world record in Bolivia by just five thousandths of a second.\n\n\n\n \nMcEwen pips Bettini to stage win\nRobbie McEwan out-sprints Paolo Bettini to claim the second stage of the Giro d'Italia.\n\n\n\n \nLiquigas snatch Giro time-trial\nThe Italian Liquigas team win the opening team time-trial stage of the Giro d'Italia and Enrico Gasparotto takes the pink jersey.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nReview of the week\nFreddy Shepherd offers to \"carry Michael Owen to Liverpool\"\n\n\n\n \nHolloway column\n\"Maybe Blair could be the next manager of Newcastle, if he can take the pressure\"\n\n\n\n \nTen to tackle\nTest your sporting knowledge of the last seven days\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}