{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"ace\" <ace@talkingirc.net>", "subject": "Re: lynx links and forms in speakup", "body": "> PS; Michael, do you think you might limit yourself to one though per\n> sentence? I, for one, would find it much easier to answer your questions\n> if you could learn to end one sentence before starting another thought.\n\nHonestly, when I saw your typo, I thought that you were suggesting that he \nonly put one instance of the word \"though\" in a sentence.  Might I suggest \nthat you spell check yours?  :)\n\n----- Original Message ----- \nFrom: \"Janina Sajka\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Monday, June 11, 2007 8:42 PM\nSubject: Re: lynx links and forms in speakup\n\n\n>I wonder whether  your expectations of lynx are conditioned by\n> experience of gui browsers? If so, lynx isn't like that. Up and down\n> arrow in lynx takes you to next and previous hyperlinks, not lines of\n> text on screen. Tab and Alt-Tab will do the same, by the way. Please\n> note it's the old, traditional Unix Alt-Tab, and not Windows Shift-Tab\n> for backward motion in lynx.\n>\n> PS; Michael, do you think you might limit yourself to one though per\n> sentence? I, for one, would find it much easier to answer your questions\n> if you could learn to end one sentence before starting another thought.\n>\n>\n> I'm willing to wager you've heard this criticism from various teachers\n> before, but you needn't answer me on that, of course.\n>\n> Janina\n>\n> Michael Weaver writes:\n>> I have set the cursor on, forms and links for numbers, user mode to\n>> advanced and underlined links to on so why am I having problem with\n>> links being read out on a line when I use the standard up and down\n>> arrow keys, links being repeated and for example when I go to google,\n>> the form for search isn't announced as if there is no number for the\n>> edit field when doing a search or am I missing something in settings\n>> which is making it more difficult to focus which why I am having\n>> difficulty scrolling down web pages using up and down arrow?\n>> Do I perhaps need to use the speakup keystrokes for navigating through\n>> pages more than I would normally when using a web browser in Windows\n>> where I can go up and down pages with the standard arrow keys and it\n>> reads either text or links depending on where you are on a page rather\n>> than trying to put all the links together and maybe causing a problem\n>> when navigating?\n>>\n>> _______________________________________________\n>> Speakup mailing list\n>> Speakup@braille.uwo.ca\n>> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n> -- \n>\n> Janina Sajka, Phone: +1.202.595.7777; sip:janina@a11y.org\n> Partner, Capital Accessibility LLC http://CapitalAccessibility.Com\n>\n> Marketing the Owasys 22C talking screenless cell phone in the U.S. and \n> Canada\n> Learn more at http://ScreenlessPhone.Com\n>\n> Chair, Open Accessibility janina@a11y.org\n> Linux Foundation http://a11y.org\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n> __________ NOD32 2325 (20070612) Information __________\n>\n> This message was checked by NOD32 antivirus system.\n> http://www.eset.com\n>\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}