{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Esteban Navarro\" <pwcdwwetcuzx@gmx.net>", "subject": "Buscado..", "body": "\nCurso INTERACTIVO de PhotoShop!\n\n\n\n\n\n\nCurso \n              INTERACTIVO de PhotoShop!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Uno \n            de los mejores programas para retocar fotos y realizar fotomontajes \n            del mercado. El primer Curso de Photoshop INTERACTIVO Completamente \n            en Español con Animaciones / Videos \n            y un Locutor como maestro durante TODO el curso!!!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n¡¡ \n            PODRA REALIZARLO DESDE SU COMPUTADORA Y MANEJANDO SUS PROPIOS HORARIOS \n            !!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEl mejor y mas completo \n              software para que realice sus diseños de manera PROFESIONAL!!\n• \n              Podra realizar extraordinarios montajes fotograficos, al conocer \n              Photoshop, se le abrira un mundo de creación.\n• \n              Aprenda teoria del color, como combinar los colores y los mas adecuados \n              para sus diseños o trabajos, sabra como crear pantones o \n              grupos de colores afines entre si. \n• \n              Desea un diseño elegante, uno impactante o quiza uno femenino, \n              este curso le brinda las herramientas y la teoría para realizar \n              sus mejores trabajos conociendo a fondo la utilizacion de esta fabulosa \n              aplicacion!\nAdemas \n              encontrara una gran variedad de ejemplos de como construir sus diseños.\n• \n              Podra realizar cualquier diseño de forma elegante y ordenada \n              con el uso de capas, mascaras y una infinidad de herramientas, que \n              le facilitaran eltrabajo y lo haran entretenido.\n¿ \n              Le gustaría DOMINAR este programa, ganar dinero diseñando \n              o simplemente divertirse ? \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPara \n              realizar este curso NO requiere de conocimientos previos, \n              ya que PARTE DESDE CERO, para luego ir aumentando \n              gradualmente la dificultad en las Lecciones / Ejercicios.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n No \n              se deje engañar con cursos \"Falsos\" somos los unicos \n              que le permitimos ver una demo antes de  comprar!! \n              Ver una demostracion del Curso ------> http://www.youtube.com/watch?v=dIY00xsnQjw\nNi \n              con cursos que le ofrecen TODO en uno! (Diseño en Flash / \n              Dreamweaver / Photoshop etc) Son crusos muy basicos e INCOMPLETOS. \n              El curso que estamos ofreciendo son 700MB! de VIDEOS INTERACTIVOS \n              + EJERCICIOS RESUELTOS Paso a paso!!!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n/\n\n\n\n\n\n\n\n\n\n\n\n\nHaga \n              su pedido haciendo click acá: --->\nCursos.Photoshop@gmail.com\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nO \n              envíe un mail a\ncursos.photoshop@gmail.com\nCC: \n               cursos.photoshop@yahoo.com.ar\nsolicitandolo!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEl \n              precio final con el envio incluido (a toda la Argentina) es de 40$ \n              (pesos).\nEl \n              envio es por correo y contra re-embolso o en Cap Fed / Gran Bs As \n              via mensajeria privada.\n \n              (En ambos casos \n              abona cuando le llega el curso NO ANTES!!)\nPor \n              envíos a otros paises u otros cursos de diseño\nGRAFICO / WEB / CAD Consultar!!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSI \n              SU PEDIDO NO ES CONTESTADO DENTRO DE LAS 48 HS POR FAVOR \n              VUELVA A RELAIZARLO.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSi \n            desea quitarse de la BD envie un correo con el asunto - quitar - a \n            esta direccion. De todas formas este mensaje se envía por \n            única vez.\n\n\n\n\n\n\n\n\n\n\n\n"}