{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Tonight we celebrate Walter Cronkite as he turns 90...we hope you'll join us tonight on the Evening News and at 8:00pm for a special", "body": "\nCBSNews.com\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nQUOTE OF THE DAY\"Anything too stupid to be said \n      is sung. \" - Voltaire \n\n\n\nDID YOU KNOW?On average, 90% of the \n      people that have the disease Lupus are female. \n\n\n\n \n\"THAT'S THE WAY IT IS: CELEBRATING CRONKITE AT \n      90\" FRIDAY, MAY 18TH (8-9pmET/PT) The world is a very \n      different place than it was in the 1960s and '70s when one voice seemed to \n      speak for all Americans and, in so doing, to bind the nation together. \n      That unique and iconic voice was, of course, Walter Cronkite's. CBS News \n      will celebrate the legendary newsman's singular life and career in a CBS \n      News primetime special, \"THAT'S THE WAY IT IS - CELEBRATING CRONKITE AT \n      90,\" to be broadcast Friday, May 18th (8:00-9:00 PM, ET/PT) on the CBS \n      Television Network. \n\n\n\nSATURDAY ON 48 HOURSHere's a note from Producer \n      Miguel Sancho on Saturday's 48 Hours Mystery, Beyond the \n      Boardwalk: \"This report is a heartbreaker. It chronicles the \n      tragic descent of four beloved but troubled women onto the harsh streets \n      of Atlantic City, and their ultimate demise at the hands of a suspected \n      serial killer. Like any good 48 Hours Mystery episode, this \n      program provides in-depth coverage of the crime and the investigation: the \n      case is a true whodunit, replete with intriguing clues and some very \n      unusual suspects. But just as importantly, the report explores the \n      dynamics of the criminal underworld where the victims, and many young \n      women like them, found themselves trapped in a vicious cycle of \n      drug-abuse, prostitution, and violence. From a producer's \n      perspective, covering this story was an intense and harrowing experience. \n      Atlantic City is an awesome place -- in the very literal sense of \n      inspiring awe. To its great credit, Atlantic City does not pretend to be \n      Disneyland - it is an unabashed adult entertainment environment. And it \n      cannot be denied that the gaming industry has created tens of thousands of \n      jobs, and streamed countless millions of tax revenues into the state. \n      Still, when you first arrive in town, the contrast between the hulking \n      casinos and the squalor that surrounds them is a shock. Frankly the place \n      can look like a collaboration of Bukowski and Bosch. Then, as you start to \n      get a sense of how the streets operate and who the players are - the \n      not-so-hidden economy of sin-seeking tourists, drug dealers, hustlers, and \n      street-walkers - there's the thrill of gaining secret, specialized \n      knowledge. Atlantic City is, truly, one of most fascinating places I have \n      ever been, and for the journalist and the junkie alike, the action of \n      street life is an addiction all its own. But after a while, as you become \n      attached to people whose lives are so sad and hopeless, reporting becomes \n      an emotional ordeal. It is hard to wade through all the human wreckage of \n      the city's dark side without absorbing some of the suffering one \n      witnesses. After three days there, you want desperately to leave. Of \n      course once you've left you can think only about going back. It \n      may be easy for people to dismiss the murders as a story of four women who \n      succumbed to their own bad judgment and worse luck. Others may see the \n      killer as a something of an allegorical figure, a human embodiment of the \n      danger and damage of drug addiction. But if there's one thing I hope the \n      viewers remember, it is that these women, for all their problems, were \n      very real human beings. They all had families and friends who loved them. \n      They all had young children. And whatever bad choices they'd made, none of \n      them deserved this.\" - Miguel Sancho (48 \n      Hours Mystery airs Saturday at 10pmET/9CT) If you would \n      like more information on any of these stories or the broadcast, please \n      click on the following address and e-mail us at: 48hours@cbsnews.com \n\n\n\nTONIGHT ON THE CBS EVENING NEWSHere is an early \n      preview of what we are planning for tonight\u0092s CBS EVENING NEWS from Anchor \n      and Managing Editor, Katie Couric\u0085 Hi everyone, \n      The Middle East is plunging deeper into chaos as clashes continue \n      between rival Palestinian groups in Gaza. Today, as Israel launched \n      explosive air strikes, the harshest Palestinian infighting took place \n      outside Gaza City\u0092s pro-Hamas Islamic University. Allen Pizzey will \n      report. And David Martin will have more about the United States\u0092 \n      role in this new explosion of violence \u0096 it is backing and training \n      fighters from Hamas\u0092 rival group, Fatah. A battle of a different \n      kind is going on in the United States. A group of gun owners has a message \n      for New York City mayor Mike Bloomberg: don\u0092t pick on Virginia. They\u0092re \n      hosting what they\u0092ve dubbed a \u0093Bloomberg Gun Giveaway,\u0094 a publicity stunt \n      that\u0092s already garnered national attention. Sharyn Alfonsi will \n      report. There\u0092s an important update on the investigative story our \n      chief investigative correspondent Armen Keteyian broke earlier this \n      week. He reported that FEMA trailers that house displaced hurricane \n      Katrina survivors are unleashing toxic fumes on their residents. Now, \n      action is being taken. For more updates, check out our investigative blog, \n      Primary Source Click \n      Here, at CBSNews.com. You may have heard about the pair of \n      humpback whales that are stranded in the Port of Sacramento, more than 90 \n      miles from the ocean. Marine scientists\u0092 most recent attempt to lure them \n      out to sea hasn\u0092t been successful. Sandra Hughes will tell you \n      about their Plan B. Finally, the story our viewers chose this week \n      for Assignment America \u0096 and to call it a success story of the \n      American Dream would be an understatement. We will introduce to you a \n      brain surgeon know by his patients as Dr. Q. But once upon a time he was \n      crossing the southern border of the United States and laboring here as an \n      illegal immigrant. Steve Hartman will share the story. Also \n      during the broadcast tonight, we\u0092ll give you a special preview of our \n      retrospective tonight of Walter Cronkite\u0092s life and career as he turns \u0096 \n      can you believe it \u0096 90 years old. It was a pleasure working on this \n      program about such talented and inspirational journalist. I hope \n      you\u0092ll join us. Have a great weekend, Katie\nFor more information on these stories, please click on the \n      following links: Gaza Falls Deeper Into Chaos Click \n      Here Time For Whale Rescue Plan B Click \n      Here And here's an early look at one of the stories we are \n      working on for Monday\u0092s broadcast: It's not QUITE \"Beam me up \n      Scotty,\" but it's pretty close. Twenty-first century teleporting... \n      Video-commuters at work. All that and much more, Monday, on the CBS \n      Evening News. THIS WEEKEND ON THE CBS EVENING NEWS: \n      SATURDAY ON THE CBS EVENING NEWS\u0085 Jeff Glor \n      will anchor the Saturday Edition of the CBS Evening News from New York. \n      We'll have the latest news in addition to these stories: \n      LIBERTY COMMENCEMENT: Liberty University holds its \n      commencement just a week after the death of founder Jerry Falwell. Another \n      standard-bearer of conservative politics will speak at the ceremonies \n      today and possibly signal his intentions for the White House. Joie \n      Chen reports. SOUTH STRATEGY: Senator Hillary Clinton \n      will be in Louisiana for a commencement speech. Democratic candidates for \n      president are not shying away from the south despite getting pummeled \n      there in recent elections. Jeff Greenfield explains why. \n      LANDIS TESTS: American cyclist Floyd Landis's \n      disqualification from the Tour de France for alleged use of performance \n      enhancing drugs could be overturned. Bill Whitaker is following the \n      Landis' appeal hearings. SUNDAY ON THE CBS EVENING NEWS\u0085 \n      Russ Mitchell will anchor the Sunday Edition of the CBS Evening \n      News from New York. We'll have the latest news in addition to \n      these stories: IRAN-U.S.: The U.S. and Iran will be holding \n      bilateral talks on Iraq security in Baghdad. Elizabeth Palmer looks \n      ahead. GUN SUIT: Bianca Solorzano reports on allegations by \n      New York's mayor that Virginia is not enforcing gun laws. \n      FLORIDA INSURANCE: Kelly Cobiella reports on the drastic \n      steps Florida is taking to insure homeowners in hurricane zones -- and how \n      the approach could leave taxpayers around the country footing the bill. \n      If you would like more information on any of these stories or the \n      broadcast, please click on the following address and e-mail us: evening@cbsnews.com \n\n\nTONIGHT ON DAVID \n      LETTERMANDave chats with actress \n      Teri Hatcher AND actor Jonah Hill... Plus, musical guest Elvis Costello! \n      \n\n\n\nTOMORROW ON THE SATURDAY EARLY SHOWTracy \n      Smith and Jeff Glor anchor THE SATURDAY EARLY \n      SHOW from New York. Ira Joe Fisher will bring us the \n      weather. Along with the top news of the day, we will also have \n      the following stories: SPRING CLEANING: If you\u0092re getting a \n      late start on your spring cleaning, don\u0092t despair. We will have tips to \n      get you back on track. Laura Dellutri, author of White Couch, With \n      Kids?! will demonstrate shortcuts and new products that make spring \n      cleaning less of a chore. SUMMER SKIN CARE: It\u0092s tanning \n      season, but don\u0092t let getting golden wreck havoc on your skin. Our Dr. \n      Mallika Marshall will join us with advice about the medical dangers of \n      too much sun exposure. She'll talk about different skin types, cancer \n      signs, what kinds of clothes to wear, tanning salons, and how to reverse \n      skin damage we already have. MONEY MATTERS \u0096 ALLOWANCES FOR \n      KIDS: Financial adviser Ray Martin will join us Saturday \n      morning with important advice for parents regarding allowances. He will \n      help parents decide how much allowance their children should get. He'll \n      also discuss how that equation should change when a child is old enough to \n      earn money through a summer job or is working an unpaid internship. \n      SIBLING RIVALRY: Siblings arguing is normal behavior\u0085 But \n      when does the fighting become too much? Dr. Alexandra Barzvi, a clinical \n      psychologist at the New York University Child Study Center, will have \n      great suggestions to help parents bring about peace in their household. \n      CELEBRITY DISH: Saturday morning is the perfect time to \n      catch up on all of the celebrity buzz in our new weekly feature. We'll \n      dish with Michelle Lee, executive editor of In Touch Weekly. \n      GLAMOURGALS: President and founder Rachel Doyle will join \n      us to explain her non-profit organization GlamourGals. Her mission is to \n      bring teens and senior citizens together to create bridges across \n      generations. KISS AND MAKE UP: For some couples, it's not \n      quite that simple to get over a fight. Sex therapist Ian Kerner and \n      psychologist Cooper Lawrence will have advice on how to patch things up in \n      a constructive way. JUST PERFECT SLEEPWEAR: Do you have \n      trouble finding pajamas that fit your style? Saturday morning, we will \n      have the latest in adult sleepwear. Editor-at-Large for Life&Style \n      Weekly Dawn Yaneck will show us what's new in silk, satin, and cotton \n      PJs and loungewear. CHEF ON A SHOESTRING: Lucinda Scala \n      Quinn is the co-host of Everyday Food on PBS and has just released \n      her second cookbook, Lucinda's Rustic Italian Kitchen. She'll show \n      us how to make a delicious Italian meal for four on our budget of $40. \n      SECOND CUP CAFE: 25-year-old singer-songwriter Brandi \n      Carlile hit the scene back in 2005 with her self-titled debut, earning her \n      a place in Rolling Stone\u0092s \u009310 Artists to Watch in 2005\u0094 list. The \n      Seattle native will perform songs from her latest album, The Story, \n      in our Second Cup Café. To look for our fabulous recipes... \n      Click \n      Here If you would like more information on any of these \n      stories or the broadcast, please click on the following address and e-mail \n      us: sat@cbsnews.com \n\n\nHERE'S WHAT WE HAVE PLANNED FOR SUNDAY MORNINGWe have a SPECIAL \n      BROADCAST called SUNDAY MORNING BY DESIGN. CHARLES OSGOOD \n      ANCHORS FROM CHICAGO PERFECTVILLE: Most Americans live \n      either in large cities or suburban homes where life revolves around the \n      automobile and traffic. Now government officials, city planners, \n      architects are proposing another way. Small towns, old-fashioned \n      neighborhoods where people talk with the folks next door are popping up in \n      the suburbs and in previously ignored parts of overcrowded cities. It is \n      called the New Urbanism. It's goal--return the word \"community\" to the \n      lives of Americans, and also get us out of our cars and walking again. \n      Rita Braver reports. CLEANING UP: Invention is a \n      great Chicago tradition. In fact, the first manually powered vacuum \n      cleaner was patented there by Ives McGaffey in 1869. Today, a certain \n      modern inventor is CLEANING UP with a vacuum of a totally different \n      design. Richard Roth has more on James Dyson. TRY \n      AGAIN!: Bill Geist takes a look at some products that made it to the \n      market place, but never quite \"took off\" with consumers. ABOUT \n      FACE: Can physical attractiveness - beauty - be reduced to formula... \n      replicated... designed? The answer is a qualified \"Yes\". As Correspondent \n      Tracy Smith explains, one doctor's research has uncovered a \n      mathematical model for facial beauty...and a Beverly Hills plastic surgeon \n      draws on his art training to help redesign his patients' faces. \n      FERRARI: What goes on behind the scenes at one of the most \n      famous automobile shops of all time? Allen Pizzey finds out as he \n      visits the maker of the ultra-expensive and super fast sports car, \n      Ferrari. HOTELS: Anthony Mason interviews famous hotelier \n      Ian Schrager, who explains the spare, minimal and cutting edge look for \n      which he has become known. HIGH ON CHICAGO: Cynthia Bowers \n      talks with residents of one of Chicago's tallest and most famous apartment \n      buildings, the 100-story John Hancock Center, to hear what it's like to \n      live high above the city in a beautifully designed home. STYLE \n      IN THE SKY: Richard Schlesinger investigates the mystery of the \n      ever-shrinking airplane seat. ROCK OF AGES: What does your \n      final resting place say about you? Do you want your tombstone to reflect \n      how you lived your life? Martha Teichner looks at the design of \n      tombstones through the ages--from modest to extravagant, from monumental \n      monuments in granite and marble to the latest high-tech options. \n      NATURE: Chicago Horticultural Society Gardens in suburban \n      Glencoe. If you would like more information on any of these \n      stories or the broadcast, please click on the following address and e-mail \n      us: sundays@cbsnews.com \n\n\nSUNDAY ON FACE THE NATION Bob Schieffer \n      moderates...CBS News Face the Nation is \n      going to look at two issues this Sunday. With two influential senators \n      from the Judiciary Committee, we'll talk about the fate of Attorney \n      General Alberto Gonzales. The Senate will take a vote next week on whether \n      or not it has confidence in the Attorney General. Will that pass? And, if \n      so, what will it mean to the President? We'll ask Senator Dianne \n      Feinstein, Democrat of California, and Arlen Specter, Republican of \n      Pennsylvania. Then we'll turn to the troop surge in Iraq and have a debate \n      between Major General Paul Eaton (Ret.) who thinks it's not working, and \n      Military Historian Frederick Kagan, who thinks it is. There will be, as \n      always, a final word. That's all on Face the Nation, this \n      Sunday. \n\n\nSUNDAY ON 60 \n      MINUTESDEEPWATER: The country is \n      less secure and the U.S. Coast Guard is in worse shape now than when it \n      began its $24 billion \"Deepwater\" refurbishment plan years ago, says a \n      congressman overseeing the maritime force. Steve Kroft reports. \n      DUMPED ON SKID ROW: Hospitals put homeless patients in a \n      van or a taxi and drop them on the city's Skid Row, sometimes dressed in \n      only a flimsy gown, even if they're not healthy enough to fend for \n      themselves. Anderson Cooper reports on the practice known as \n      \"hospital dumping.\" ONE LAPTOP PER CHILD: MIT Prof. \n      Nicholas Negroponte's dream is to put a laptop computer into the hands of \n      every child as an educational aid. Lesley Stahl reports on his \n      progress in Cambodia and Brazil. \n\n\n\nMONDAY MORNING ON THE EARLY SHOWHarry Smith, \n      Hannah Storm, Julie Chen and \n      Russ Mitchell anchor THE EARLY \n      SHOW from New York. Dave Price will bring us \n      the weather. Along with the top news of the day, we will \n      also have the following stories: TEEN GASTRIC \n      BYPASS SURGERY: Obesity in this country is an enormous health \n      crisis - the CDC says almost one-fifth of America's children are \n      overweight or obese. And as that number grows, so does the number of \n      adolescents turning to surgery to help them get healthy. CBS News \n      Correspondent Cynthia Bowers will have one girl's story. \n      HAPPILY EVER AFTER, #1: High profile divorces \n      frequently make headlines, but what about the couples who make it? Monday \n      morning, we kick off our special week-long series, Happily Ever \n      After, where we profile couples who have weathered the storms and \n      stayed strong through the years. First, we will meet one couple who has \n      been married for sixty-one years. Until she met her husband, Virginia had \n      wanted to be a nun. But Stanley's charm, and persistence, brought these \n      two lovebirds together. We'll have their story. ORLANDO \n      BLOOM ON PIRATES OF THE CARIBBEAN: AT WORLD'S END: Orlando Bloom \n      is best known for his blockbuster epics Lord Of The Rings, \n      Pirates Of The Caribbean, and Kingdom Of Heaven. And \n      high-profile celebrity romances certainly don't hurt his image either. The \n      third installment of the Pirates of the Caribbean finds Orlando as \n      William Turner once again, fighting for Elizabeth against the moody \n      Captain Jack Sparrow, played by none other than Johnny Depp. Monday \n      morning, we'll get the latest on the film from Orlando himself. \n      PERFECT PARENTING: BRIBE VS. REWARD: You may be \n      like many parents out there who vow never to bribe your kids to do things \n      like clean up or eat their vegetables, but some experts believe that \n      rewards can be effective. Alix Kennedy is the editorial director of \n      Wondertime magazine, and she says it's all about how you present \n      it. She will join us Monday morning with advice. DAVID \n      EVANGELISTA: SUMMER HAIR: Summer unofficially starts next week, \n      but the heat and humidity that come along with it can ruin an otherwise \n      good hair day. What to do? Our stylist to the stars, David \n      Evangelista, has 3 beat-the-heat hairstyles that'll look great \n      all day and for any occasion...and each starts with a simple ponytail. \n      PROFILES IN COURAGE: The Profile in Courage Award is \n      a private award given to someone who displays the type of courage JFK \n      described in his book of the same name. Live from the JFK library in \n      Quincy, Massachusetts, Caroline Kennedy will join us with this year's \n      recipients. If you would like more information on any of these \n      stories or the broadcast, please click on the following address and e-mail \n      us: earlyshow@cbs.com \n\n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}