{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nThis May Day was a day of protest for U.S.\n  immigrants. Tens of thousands of demonstrators in cities from Los Angeles to New\n    York demanded more of the nation’s estimated\n  12 million illegal immigrants be granted legalization. Bill Whitaker will\n  have more on the protests. Sandra Hughes will report on how the deportation\n  of illegal immigrants has divided families, with children sometimes left\n  behind to fend for themselves.\n \nIn Cuba\n  today, there was a great deal of talk that Fidel Castro would reappear at\n  that country’s main May Day parade. But as hundreds of thousands of\n  Cubans marched through the streets, there was no sign of Castro. Our chief\n  foreign correspondent Lara Logan is there and will report on what that could\n  mean.\n \nEven before Congress approved a spending bill\n  calling for the withdrawal of troops from Iraq, President Bush threatened a\n  veto. Jim Axelrod will have the very latest on what happened today when the\n  president got the bill and what’s in store in the days ahead.\n \nContinuing our series, “Caught in the\n  Web,” Daniel Sieberg will take a look at the growing obsession with\n  Internet pornography, and how viewing it can be addictive. He’ll talk\n  to one family that overcame an addiction – and also look at an\n  innovative way to confront the problem.\n \nTwenty Texas teenagers who died from a cocktail of\n  crushed nighttime pain relievers and black-tar heroin seemed to know they\n  were doing something illegal, but didn’t seem to realize it was also highly\n  addictive and could be deadly. Kelly Cobiella will report on the schoolyard\n  high called “cheese.”\n \nIt is spring fashion season in Tehran, but with the hardliners in power\n  the fashion police are cracking down on non-Islamic styles more than ever.\n  Elizabeth Palmer is there and talks to several Iranian women.\n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}