{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "60 Minutes Newsletter <newsletter_sixty_minutes-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "60 Minutes E-mail Alert", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nSunday’s 60 Minutes offers insightful \n      stories that advance and give context to two of the week’s biggest news \n      stories: the dropping of the Duke rape charges and the offensive comments \n      of radio shock jock Don Imus.\n \nIn our first story, correspondent Lesley Stahl is the \n      first to interview the three white former Duke lacrosse players, whose \n      indictment for the alleged rape of a black exotic dancer set off a \n      national debate on race, sex and privilege. Reade Seligmann, Collin \n      Finnerty and David Evans were exonerated at a news conference Wednesday \n      and now tell Stahl what it was like to live a year of their lives in a \n      media fishbowl and in a state of worry over an uncertain future. She \n      also speaks to the North Carolina Attorney General who made the \n      vindicating announcement and who investigated the case after the local \n      prosecutor’s questionable tactics forced him to recuse himself.  \n      Attorney General Roy Cooper reveals the problems in the original case and \n      the inconsistencies of the accuser, who, he says, continued to tell \n      contradictory stories during his own investigation. \"We started out \n      knowing we had a problem…and the way it turned out, it was much worse than \n      we thought.\"\n \nRadio shock jock Don Imus is \n      off the air after his disparaging comments about the Rutgers women's basketball team.  \n      Mike Wallace profiled him a \n      decade ago, and given the events of the past week, the story is especially \n      revealing. The profile, broadcast in 1998, provides a look back at \n      his rude and crude behavior, and includes a startling exchange about the \n      N-word.\n \nIn our third story, Bob Simon doesn't have to go to \n      the ends of the earth to find an unusual story, because he finds one right \n      inside a prison just north of New \n      York City. Violent offenders serving long sentences \n      now have a way to free their minds from the harsh prison milieu – a \n      college education in liberal arts. Murderers and robbers studying \n      classical philosophy in a class taught by a teacher from elite Bard College may be a strange sight, but \n      it does go to the heart of the debate for rehabilitation. As the \n      Commissioner of Corrections for the State of New York \n      says, \"I think it’s the logical view of incarceration. Going to \n      prison is the punishment. Once in prison, it’s our obligation to make them \n      better than they were.\"\n \nThese timely stories and Andy \n      Rooney’s auto show adventure, this Sunday, April 15, on 60 Minutes at 7 p.m. \n      ET/PT.\n\n \n       \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}