{"category": "ham", "to_address": "\"r-help@stat.math.ethz.ch\"@hss.caltech.edu", "from_address": "Ben Klemens <klemens@hss.caltech.edu>", "subject": "Re: [R] FW:  [OT] Is data copyrightable?", "body": "Hadley,\n\nThe relevant case law in the USA is Feist Publications v. Rural Telephone\nCorp. (499 U.S. 340, 1991). In this case, one phone book publisher\nbasically lifted a competing publisher's listings wholesale. The courts\nfound that this was _not_ copyright infringement. The logic is that\ncopyright infringement requires some sort of creative step, which\nalphabetizing names does not pass.\n\nAnother ruling regarding somewhat more intersting data states that\n\"only the manner and order in which [the data] are presented\" may\nbe copyrighted.  So in the USA, you have to ask what value you are\nadding on top of the raw data, if any.  This is discussed briefly in the\nbelow-mentioned _Math You Can't Use_ on page 147. [Amazon.com will let you\nread the section online, though I don't say much more than I did here.]\n\nThe EU has a \"sweat of the brow\" protection that is not quite\ncopyright, but allows copyright-like protection on databases. Wikipedia\nknows as much about this law as I do, so see:\nhttp://en.wikipedia.org/wiki/Directive_on_the_legal_protection_of_databases\n\nRegards,\n\nB Klemens\n\n\n\n\n>    P.s.  Ben Klemens (2006) Math you can't use (Brookings) cites cases\n> where people have been successfully sued for copyright infringement for\n> using a theorem they independently discovered.  That's pretty scary to\n> me and seems totally unreasonable, but apparently the law at least in\n> the US.\n> \n>    Spencer Graves\n> \n> ########################\n>       Brian's reply seems more consistent with what I've heard than\n> Peter's.\n> \n>       The briefest summary I know of copyright law is that expression\n> but not ideas can be copyrighted.  Copyright law exists to promote\n> useful arts, and a compilation of data is intended to be useful.\n> Google, led me to \"http://ahds.ac.uk/copyrightfaq.htm#faq1?\", says that\n> \"data or other materials which (a) are arranged in a systematic or\n> methodical way, or (b) are individually accessible by electronic or\n> other means\" can be copyrighted.\n> \n>       Beyond that, there is a \"fair use\" doctrine, which in the US at\n> least allows use in many cases by educators in public institutions, but\n> the same use by someone not affiliated with a public school might be an\n> infringement.  Ten years ago, I heard from attorneys at the University\n> of Wisconsin that a college prof can run copies of a journal article and\n> distribute them to this class without worrying about copyright\n> infringement (provided any money collected is clearly designed to cover\n> costs not make a profit), but the same copies prepared by Kinko's off\n> campus for the same class (sold perhaps at the same price) must get\n> copyright permission.\n> \n>       Hope this helps.\n>       Spencer Graves\n> \n> Peter Dalgaard wrote:\n> > hadley wickham wrote:\n> >   \n> >> Dear all,\n> >>\n> >> This is a little bit off-topic, but I was wondering if anyone has any\n> >> informed opinion on whether data (ie. a dataset) is copyrightable?\n> >>\n> >> Hadley\n> >>   \n> >>     \n> > In general not, I believe. E.g., I didn't have to ask formal permission\n> > to use data from Altman's book in mine (and I did check with my\n> > publisher). I suspect that things can get murkier than that though; I\n> > seem to recall stories of plagiarism cases in relation to collections of\n> > mathematical tables. Beware also that there can be other legal\n> > complications, including rights to first publication of new results,\n> > which usually implies that you cannot publish entire datasets until\n> > their publication potential has been exhausted. And of course, proper\n> > attribution is required for reasons of scientific integrity and general\n> > courtesy. (Disclaimer: I Am Not A Lawyer, esp. not a US one...)\n> >\n> > ______________________________________________\n> > R-help@stat.math.ethz.ch mailing list\n> > https://stat.ethz.ch/mailman/listinfo/r-help\n> > PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> > and provide commented, minimal, self-contained, reproducible code.\n> >\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n> \n> ------ End of Forwarded Message\n> \n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}