{"category": "spam", "to_address": "<IPLACEREPORTS@flax9.UWATERLOO.CA>", "from_address": "\"RichardYoung@InvestorPlace.com\" <RichardYoung@InvestorPlace.com>", "subject": "Second Chance to Get Rich in the Commodities Boom", "body": "\n\nYour Second Chance To Get Rich In The Great Commodities Boom \n\n\n\n\n\n\n\nWe love giving our InvestorPlace.com members benefits like access to this timely message.\n In order to ensure you keep receiving special alerts and offers like this one, please take a moment to click on any of the links in this message to reconfirm that this is the email address where you want to receive emails from InvestorPlace.com  \n              \n                \n\n\n\n\n\nA  Glorious Harvest\nFor  Your Retirement Years!\n\n\nThe Man: Richard C. Young\nOften called in by America's wealthiest families to do a little \"repair work\" on portfolios that have lost a couple or ten million.\nPersonally wealthy. \"Why would you take advice from someone who had made less money than you have?\"\nLives frugally. Runs or walks 5 miles a day. Highly disciplined about what he eats. Married 37 years with two grown children and four grandchildren. His few extravagances include a tendency to buy 30 or 40 jazz CDs at a clip.\nSkeptical. \"If my own mother tells me the time, I check my watch.\"\nHas never biked through the Andes on his Harley, but he and his wife want to go. \"When you travel a country on a Hog, folks make a point of talking to you. That's how you come up with great investments. You don't find them on a computer screen on Wall Street. Plus, it's major fun.\"\nRarely gives interviews. Reporters declare him \"curmudgeonly\" but he despises the media circus. \"Everyone's got an angle they're trying to push. Even the journalists. I don't have an angle. I just want top returns without risk to principal. Not much of a story there.\"\nDevoted follower of Graham and Dodd, the founding fathers of financial analysis. Graham's definition of an investment is taped to Young's computer. It says, \"An investment operation is one which, upon thorough analysis, promises safety of principal and satisfactory return. Operations not meeting these requirements are speculative.\" Young's Intelligence Report is so named as a tip-of-the-hat to Graham's most important work, The Intelligent Investor.\nGave up a career on Wall Street as one of its most respected analysts and traders. \"In the end, the herd mentality is too strong to resist. Living in the countryside, I can maintain my independence of outlook and help the people I admire--individual investors.\"\nEarned his B.S. in investments from Babson College, where he has served as investment advisor to the Board of Trustees.\nHis first job was as a Wall Street runner, earning $60 a week.\nLost $5,000 once. \"It wasn't an investment. It was a speculation.\" That was the first and last time in over 36 years of investing that he became confused about the difference.\nSees Young's Intelligence Report as his life-work. \"I can make a real, lasting difference to so many private investors this way. I know that all the work that goes in is worthwhile, because subscribers tell me so.\" Indeed, it is a rare occurrence for a subscriber to drop off the rolls.\nCredentials: Keynote speaker at prestigious investment conferences. (\"I try to limit my appearances to once-a-decade. More often could give the wrong impression.\") Best-selling author of Richard C. Young's Financial Armadillo Strategy, hailed as \"required reading\" by the press. The Professional Investor said the book \"surpasses anything written on personal finances for the past 18 years.\"\n\n\nIf  you didn’t double, triple or quadruple  your money in the last 5 years in the great bull market in things—commodities  like gold, copper, steel, coal, uranium, oil or natural gas, please read every  word of this urgent report.\nIndeed,  if you are not sitting down and ready to take notes right now, PLEASE LAY THIS  REPORT ASIDE until this evening, when you can review it carefully and make some  very important decisions.\nYou  may feel you missed out on the great commodities bull market of the last 4  years and that, in any case, commodities are too risky for a conservative  investor like you.\nBut  you are mistaken on both counts.\nAnd  in fact a commodity laggard—agriculture—is just beginning its amazing bull run.\nBest  of all, new ETF funds make investing in commodities as diverse as biofuels,  timber or corn a snap.\nTime  To Take Another\nBite  of The Apple\nAllow  me to introduce myself.\nMy  name is Dick Young and I would like to tell you exactly how to achieve your most ambitious financial goals  in the next 36 months, and do it in natural resource stocks.\nThis  is a very practical guide.  I’m  going to lay out as much of my plan as possible in the next few pages and then  I’m going to show you what first steps you must take.  To make sure we get the job DONE, I’m going to stick with  you FOR THE WHOLE YEAR.\nBy  that time, you could be well on your way to achieving your goals. \nWell  on your way to reaching your dreams without EVER, even for one second, becoming  a speculator.\nAnd  you will have done it by investing conservatively in…commodity stocks.\nOne  Thing I Do Require\nI’ve  already said I don’t need you to be a speculator.  In truth, risk-takers appall me.  I don’t make friends with traders and they consider me a  terrible stick-in-the-mud.\nBut  the very thought of losing a dollar on  an investment fills me with dread.   Once, when I was a young Wall Street runner in the ‘60s, I lost $5,000  on a speculation.  That experience  made me so physically sick, I  made a solemn vow never to let it happen again.\nAnd  it hasn’t.\nNo  Dreamers, Please\nI have put a lifetime of study into success.  Success of every stripe.\nWhat,  for example, makes the Rolling Stones successful?  That is not a question most investment advisors would think  to ask, is it?  The answer in The  Stones’ case is Andrew Oldham, the man who literally locked Jagger and Richards  in his kitchen to force them to write their own songs.\nIn  a world of one-hit wonders, the Stones keep rolling, keep on message, and just  get more and more successful.\nThat’s  how I work and that is how I expect you to work with me.  Success compounds success—that’s what I have learned over the last 35 years of  professional investing.\n\n\nThe Great Commodities Bull\nSelected Young's Intelligence Report Recommendations up 126% --just getting going\n\n\n\n\n3 Year Returns\n\n\nSugar\n59%\n\n\nLumber\n37%\n\n\nNatural Gas\n34%\n\n\nCoal \n115% \n\n\nCopper \n157%\n\n\nOil\n78%\n\n\nUranium \n507% \n\n\nWater \n54%\n\n\nTitanium \n180%\n\n\nEthanol \n39% \n\n\n\nAverage Gain: 126%\n\n\n\n$100,000 invested equally in these select commodity-oriented investments recommended in Young's Intelligence Report over the past three years would be worth $226,000 today.\nAnd a $1,000,000 portfolio, invested the same way would be worth nearly $2,226,000--and provide a million-dollar profit. Read on for a complete track record breakdown.\n\n\nAnd  dollars compound dollars.\nListen:\nStay focused, stay on message and about 60% of what  you ever make in investing will spring from interest on your  interest.  That is power, my  friend.  That is investing.  That is not a dream: it is math.\nSuccess  comes in many guises.  The Rolling  Stones may not exactly fit your own self-image and that’s fine.  It may be Jeff Immelt, CEO of GE, or  Vanguard’s Jack Bogle, Berkshire Hathaway’s Warren Buffett, or even Jimmy Buffett!   I’ve made in-depth studies of all of them—and hundreds more  extraordinary success stories.\nAnd  IN ABSOLUTELY EVERY CASE, these qualities of focus, discipline and respect for  the power of time have been decisive.\nBut  I am surely preaching to the converted.   I am not sending this Intelligence Report to wannabees.  Realists,  hard-of-nose, skeptical of mind, are my audience and it is no accident that you  are on such a mailing list and reading this report today.\nSo,  if you’re ready, let’s begin our fabulous journey together.\nStep One: The Great Sugar Rush\n \nIn 1974, the price of sugar was 66  cents.  Then it collapsed to almost  2 cents in 1985.  For the next  decade, sugar was stuck at a dime or less.\nIn  the last few months, the price of sugar has doubled—and the value of a white  sugar futures contract has quadrupled.\nThis  breakout has been two decades in the making:\n\nFirst, Brazil got smart and decided to dominate sugar  production while stabilizing prices by diverting all over-supply into ethanol.\n\n\nMeanwhile, sugar demand rose 63% in the last 20 years,  largely driven by huge increases in consumption in Asia.\n\n\nAnd supply has shrunk in Europe, Africa, even Asia.  Exports of sugar from the EU, for example, have collapsed from 7 million tonnes  a year in 2005 to less than one million  in 2007.\n\n\nAnd finally, oil prices went stratospheric—and remain  so high, sugar-based ethanol prices are up over 250% since mid 2004!\n\nThe case for sugar  is compelling today, but I don’t want  you running around out there trying to buy sugar futures!  Employ a new ETF fund to do that for  you.  The one I have selected works  on a formula that cushions the effect of monthly contracts rolling at very  different prices.  \n\n\n\n\n\nShares of the top agriculture and  energy futures exchange, Intercontinental Exchange, (ICE) have doubled in the  last year as the second round in the commodities super-cycle gets under way.\n\n\nUnless you have a  cast-iron stomach, you need that.\nIf sugar has been  so low, so long, isn’t a collapse possible again?  Yes—if Asia stops growing.  Yes—if the price of a gallon of gas goes back to 33  cents.  \nThose are odds I  find very acceptable.\nIn your free  report, Sugar, Wood and Sod I show you\n\nthe best way to ride the next great supercycle in sugar,  corn, wheat and soy\n\n\nthe best way to get rich in timber as 70 million boomers move out into ex-urbs\n\n\nthe best way to capitalize on the citrus and sod boom in central and southern Florida.   This stock lets you pick up Florida farmland for $2,550 an acre!\n\n\nthe best way to get in on the Argentinean farmland boom, including vineyards and cattle ranches.  This is the next Napa! \n\n\nand the best way to get in on the global agribusiness boom with a Swiss technology company that boosts  yields.\n          \n\n\n\n\n\n\nSugar and ethanol prices are surging—and now there’s a simple way for conservative investors to get in on the action.\n\n\n\n\nStep Two: Start Your Geiger\n        Counters\n \nGet A Grip On The New\n        Reality\nIf you really, truly\n        want to make remarkably safe, fast profits--not just dream about it, but really\n        DO IT--then you must come to grips with\n        the central theme of our time: we are at war. A world\n        war. It is a war, like all wars, of Havenots against Haves. The difference between the\n        Haves and Have-nots is not difficult to define. The average wage of a Chinese\n        laborer, gluing MacDonald's Happy Meal toys together in suffocating labor\n        camps, is 60 cents an hour. A few hours away, in Singapore or Australia, the\n        average wage is\n        $6.70 an hour.\nOr consider Central\n        America. The average Nicaraguan makes $2,400 a year. A few miles across the\n        jungle, a Costa Rican makes $10,100.\nUranium is one\n        commodity the Havenots desperately want (there are many others, as we shall\n        see, and each\n        presents a stunning investment opportunity). Uranium also happens to be one\n        commodity that North America is abundantly rich in.\nTo have, in investment\n        terms, is to have natural resources--commodities in desperate demand.\nSo this is where you\n        must begin. And\n        uranium is your very first step in our million\n        dollar quest.\nThe Weakest Link\nThat pound of\n        yellowcake valued at $9 before 9/11, is now worth $95. In 1979, when\n        America was still building nuclear reactors and the arms race was in full\n        swing, uranium hit $43 a pound--so until recently, it has been a long bear market.\nBut a uranium shortage of huge magnitude is developing so quickly that many of the earth's most critical nuclear power plants could face the risk of imminent SHUTDOWN.  \nNearly 200 million\n        pounds of uranium is needed this year to keep the lights on in France, China,\n        the U.K. and U.S.A. But only 100 million pounds will be mined.\nAnd meanwhile, China is\n        building FORTY new reactors!\nAnd with reactor\n        shut-downs come blackouts, a global economic seizure, political unrest, and\n        oil prices at home you\n        don't even want to think about!\nUranium prices,\n        already up 900% from their lows\n        before 9/11,\n        could jump over $100 in a heartbeat.\nThe DeBeers of Yellowcake\nFortunately, North\n        America is wealthy in uranium. \nOne mine, in fact,\n        has access to so much of the world's uranium, it is The DeBeers of\n        yellowcake! Add it up: A monopoly position...in a natural resource set to double. The stock\n        trades at 40 times estimated 2006\n        earnings per share, which is not cheap. But also, you aren't buying\n        Colgate-Palmolive.\nAction To Take\nThe first step is to buy a small stake in this North American uranium mine. This stock is up over 507% in the past three years, so we're off to a good start in our million dollar quest.\nI want you to do your\n        own investigating before you invest, naturally. I have put the case of\n        uranium and this one company together in an urgent Intelligence Report briefing called The DeBeers of Uranium. \nThe report is\n        FREE--download it here.\nStep Three: The Oil\n        Weapon\n        (The Real\n        Reason Gas Prices Remain High)\n \nWe have taken the\n        first vital\n        step in our\n        profit plan. What next?\nOne driver of this Uranium Rush is uncertainty over oil prices. So let's see how we can factor oil into our own race for safe, fast profits. \nAny time a\n        FUNDAMENTAL shift occurs, the biggest money is made by the earliest movers.\nAnd the biggest money\n        lost is by those who\n        stubbornly ignore the shift.\nI've already shown\n        you how uranium's role suddenly shifted in the wake of 9/11. It's a small\n        (and hugely profitable!) example of using the shift before it uses you.\nNow let's look at oil,\n        the dirty bomb of this new conflict.\nYou've heard it said that the world is running out of oil and that's why it's costing more. This is balderdash. \n\n\n\n\"Forecasts worth their weight in bullion...Grade A.\"\n\t\t\t\t\t\t\t\t\t\t\t-Money magazine \n\n\nHere's What You\n        Haven't Been Told\nThe world is swimming\n        in oil and reserves are expanding.\n        The Saudis are bringing an extra two million barrels a day online next year\n        and refining capacity is more than ample. Usage is down--people are\n        cutting back.\nBut still, prices are\n        up from about $20 a barrel on 9/11 to around $60 a barrel today. So: why? Because oil has\n        become the ultimate weapon of Havenot revenge.\nIf you want to see\n        this dirty bomb used at its cruelest, consider what \"Father Joseph\" Putin did\n        in February 2004. He simply cut off the gas pipelines to Belarus. It was\n        exactly what it appeared\n        to be--an act of terrorism--a guerrilla maneuver in the greater\n        World War III action.\nOil Stocks: A Slow\n        Swim Across A Shark Tank\nAs investors, then,\n        we need to be very careful about using oil in\n        our program to make a million dollars. We must not make the mistake of buying it\n        \"because we're running out\" or \"because it's going up.\"\nWe're not running out any time\n        soon--and it isn't even going\n        up, not in a\n        straight line, anyway. Oil's price, as we've seen, is almost purely a\n        reflection of how it is being used as\n        a weapon. After all, Saudi oil costs just $3 a barrel. Call the other $50 or\n        so the fear\n        premium.\n\n\n\n\n\n\nYoung's Intelligence Report\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tBuy List: Up 282% \n\n\n\nYour first step to safe, fast profits is in uranium. \n\n\n\n \n\n3 year gains \n\n\n\nCanadian Uranium Miner    \n\n507% \n\n\n\nAustralian Uranium Exporter \n\n180% \n\n\n\nGlobal Uranium Refiner  \n\n157%  \n\n\n\nAverage Gain: \n\n282% \n\n \n\n\nSafe. Fast. In That Order\nFor our purposes, this makes overseas oil exploration companies a very high risk. It also makes global and foreign oil stocks in general speculative.\nNo thanks. Here at Young's Intelligence Report we've played oil the safe way. So let's stay home and make 58% and a 6.0% annual yield in a U.S. pipeline company. Let's stay home and ALSO make 275% in a Canadian tar sand stock. That's what we've been doing. It's time you did likewise.\nJoin Canada's Oil Rush\nCanada's oil sands hold 175 billion barrels of oil--a treasure trove that rivals Saudi Arabia. The fact that the region is friendly to U.S. interests makes it even more valuable.\n\n\n\n\"Dick Young takes the mystery out of the financial markets. His straightforward no-nonsense approach to investing is refreshing and rewarding. Dick brings the kind of advice that makes people money.\"\n\t\t\t\t\t\t\t\t\t\t\t-Mario J. Gabelli, Chairman, Gabelli & Co. \n\n\nIt costs about $20 a barrel to boil these tar sands down to sweet crude. The math, when oil is trading above $60, is compelling.\nOur top tar sands producer has not had to sink billions--and decades into the project. It has just snapped up a massive stake in the region and expects to turn on the spigot this year.\nThis stock's current share price discounts future oil prices to $40. If my research is correct, the simple fact that oil prices remain closer to $80 than $40 will give us a double. No promises. Just math.\n\n\n\nThe Truth About Hybrid Cars\nYou've probably driven a hybrid. Wondered about ethanol. Even dreamed of fuel cells.But don't count out OPEC quite yet. Imported oil will keep pumping money into your portfolio for many decades to come.\nHybrids don't get the mileage they advertise, and the extra base-cost will never, according to some reports, be paid off.\nEthanol is great, but it is intensely corrosive, which makes distribution a not-so-small challenge. Who's building a nationwide ethanol pipeline? Last I checked, no one.As for fuel cells, yes, they will change everything. But they aren't here yet. No fuel cell stock I know of is likely to make you a million in less than 20 years. In our race for remarkably safe, fast profits in the next three years, traditional oil and gas stocks still deserve a prime place in your strategy.\"\nThanks, here's your $400 million\"For proof, consider the $400 million reward that the outgoing Chairman of ExxonMobil collected for doing a nice job. What does that tell you? Fossil fuels are where it's at, at least for now. When Hertz charges more for an economy car than for a big car, then and only then sell your oil stocks!\nUntil then, make sure you've loaded up refineries, pipelines, oil and gas trusts and drillers. More details in my special white paper, The Safest Oil Stocks Now. Get the report here. \n\n\nIt's A Gusher!\nThe case for this stock is actually even better than I have described. If it is able to produce 250,000 barrels of oil a day at $60 a barrel, the company would be throwing off $2.5 billion or more a year in free cash flow.  This torrent of cash could support a truly magnificent dividend.\nLet's buy this tar sands newcomer for the double it should give us over the next three years, and hold on to it for the 10% yield it very well may give us for the next 50!\nTrust This \nCanadian energy trusts are making conservative investors rich and I want you to be one of them. I only recommend trusts that are growing their reserves. These are a rare breed and deserve a place in your portfolio.\nEnergy trusts are a classic case of having your cake and eating it, too. Consider Vermilion Energy Trust, up 33% in 2006. Or Enerplus Resources, up 155% since 9/11, and throwing off a safe-as-a-house 10.3% yield.\nIf you haven't discovered Canadian oil trusts, you will be grateful for the day you buy your first. Many of the best ones have tripled in the last three years, and, that's before counting their 8%+ yields!\n\n\n\n\n\n\nYoung's Intelligence Report\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBuy List: Up 111% \n\n\nU.S. Gas Producer\n\n64% \n\n\n\nGlobal Refinery \n\n27% \n\n\n\nGlobal Integrated Oil \n\n78% \n\n\n\n Tar Sands Producer \n\n275%  \n\n\n\nAverage Gain: \n\n111% \n\n \n\n\nWhat's more, many of these oil trusts are adding to their oil reserves faster than any conventional oil company--in effect lengthening their life and viability every year.\n\t\t\t\t\t\tIn your report, The Safest Oil Stocks Now, I show you the best in oil and gas investments now:\n\nThe best U.S. refinery \nThe best global oil major \nThe best U.S. oil and gas pipeline company \nThe best domestic gas producer \nThe best oil, gas and CO2 transporter (7.1% yield, to boot) \nThe best U.S. gas partnership, now paying out 15 TIMES more in dividends than it did 3 years ago! \n\n\n\n\n\"Dick Young delivers a wealth of cogent and useful information in each issue, and does so with clarity and purpose.\"\n\t\t\t\t\t\t\t\t\t\t\t-Jack Bogle, Former Chairman, The Vanguard Group \n\n\nAS WELL AS the low-down on the best tar sands producer and the best energy income trust. \nThese are cornerstone investments that I want you to put in place now, before we take the next step, which is venturing into the surprising--and extremely profitable--area of energy: alternatives and renewables. \nLet's look at these opportunities now.\nStep Four: Considering the Alternatives\n \nEvery investor needs to understand--and invest maybe just a little--in alternative energy. This might mean wind power (General Electric, with its turbines, is the way to go here), biorefineries or ethanol.\nBut my money's on coal.\nYes--coal.\nHere at Young's Intelligence Report, we've doubled our money in coal stocks just in the last year, but we very well could double that double in the next year. Here's why.\nA new process takes low-grade, water-logged, $6-a-ton Western U.S. coal, and converts into a clean liquid fuel worth the equivalent of $60 a barrel.\nThe process is expensive but several factors make K-fuel, as it's called, work:\nIt cuts our dependency. The American west sits atop a larger store of energy than Saudi Arabia. It's simply in the form of coal, not oil. Some of the coal is high quality and where it is, you should invest. No less than 140 new coal-fired power plants are about to be built.  This is more than at any time since the 1950s. Coal is the new favorite alternative to oil. Here at Young's Intelligence Report we've been getting fat on a Canadian coal trust that produces super high-grade coal and returns the profits to us in the form of a 11.3% yield. Very nice.\nIt's clean. Coal's big drawback has always been that it burns dirty. Clean it up, convert it into liquid diesel, and you've turned low-grade coal you'd otherwise discard in slag heaps into a $2-a-gallon at the pump high-test. Pure alchemy.\nIt's making early investors rich. Call it the Spindletop Effect. The U.S. company that's leading the K-fuel revolution is up 73% in the last three years.  But at no point in the past 3 years would I have recommended it except as a speculation. Now, however, things are different. Oil is at $60 for starters. And Sasol, the South African blue chip, has created a $20 billion business out of converting low-grade coal to diesel.  The fact that Sasol is also up 148% in three years tells you: the clean coal solution is for real. \n\n\n\n\n\n\nYoung's Intelligence Report\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tBuy List: Up 132% \n\n\n\nYou don't have to take big risks in oil and gas. It's still early in the game. \n\n\n\n \n\n3 year gains \n\n\n\nEastern Coal-Miner \n\n115% \n\n\n\nCanadian Coal Miner \n\n71% \n\n\n\nAustralian, Natural Gas, LNG Shipper \n\n180%  \n\n\n\nWestern Coal  \n\n90% \n\n\n\nClean Coal Refiner \n\n275% \n\n\n\nHawaiian Sugar Refiner  \n\n59% \n\n\n\nAverage Gain: \n\n132% \n\n \n\n\nSasol signed a joint-venture with ChevronTexaco to produce a gas-to-liquid plant and GE has teamed up with American Electric Power to produce gas from coal by 2010. \nMore and more, it looks like coal--and especially clean coal--needs to be in your portfolio.\nIn Clean Coal And Other Alternatives I tell you how to make a fortune in the coal-to-diesel revolution. I'll also show you:\n\nHow to grab that 11.3% yield in our super-high grade coal trust. \nWhich traditional coal mines are the ExxonMobils of their industry. \nExactly how to play the new ethanol boom. \nTwo ways to play wind power--one very safe, one still speculative. \nHow to time your entry into a hydrogen fuel cell investment. The concept will change the entire outcome of World War III--but not yet. \n\nPLUS: Sugar, the most efficient renewable energy source. How to ride the sugar rush over the next three years. \nWe've seen how energy--from uranium to sugar--must play an important role in your portfolio. If you do nothing else as a result of reading this Intelligence Report, I hope you resolve to reallocate, away from the more speculative oil stocks and seek out safer, more consistent returns in North American energy stocks. \nIn a single stroke, you will have protected and enhanced your returns.\nIn our quest for million dollar profits in the next three years, we have made significant strides. Uranium, oil and gas, coal and renewables, conservatively selected, have the potential to triple our original investment in three years.\nFor all the details on how to profit from clean coal and other renewables, get my exclusive FREE white paper on this subject.\n\n\n\nRobbed blind by the biggest rip-off of all time\nGrowth stocks are good for brokers because they make investors as nervous as goats.\nBut they are ruinous for investors who need to plan for their retirement.\nYou see, the fact is, a dollar invested year-end 1927 in large growth stocks would have grown to just $1,017. Small growth stocks would have grown your dollar to a paltry $727. But if you had shut your ears to what you were being told about growth stocks and, instead, invested in small value stocks, your dollar would have blossomed to $16,027.\nThese numbers, supplied by the research firm Ibbotson Associates, are irrefutable, but behind the numbers lurks a real tragic story.\nWhy They Call It Burn Rate\nSold on the myth of growth investing, investors find they've got a tiger by the tail. Unable to hold on during wild whipsaws, they sell and buy a different growth stock, become traders and gamblers instead of long-term wealth-builders. If there are any winnings, they are swallowed in taxes and commissions, leaving crumbs for their retirement. \nIn short, your children will curse the day you became a growth investor.\nDownload report today! \n\n\nStep Five: Should You Buy Gold Now?\n \nBetween 1971 and 1974, the price of oil went from $1.65 a barrel to $9.76--a 592% increase.\nIt was a period that looks in retrospect like the first rumblings of today's roaring World War III. Oil fields were being nationalized, America was loathed by the Havenots and global tribalism was rampant.\nWhat happened to gold? Gold prices also soared. The ounce of gold worth $43.63 in 1971 was worth $186.50 four years later--a 427% increase. \nOn 9/11, the price of oil was $26 and gold was $271. Since then, oil prices are up 130% and gold is up 153%.\nSo, again, a reasonably close correlation, yes?\nI'd like to compare oil and gold prices because this approach sidesteps the emotional issues that can cloud our thinking about gold. We can put the case for gold simply in terms of oil. If you believe oil prices are headed back towards $26 a barrel, whatever you do, don't buy gold.\nBut if you believe oil prices could hit $100 a barrel, mortgage the farm and load up on gold--it'll be the smartest investment move of your life.\n\n\n\n\n\n\n\n\n\nBuy What China's Hoarding:\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe Profits are just beginning! \n\n\n \n\n3 year gains \n\n\n\nGold \n\n71% \n\n\n\nAluminum miner \n\n24% \n\n\n\nCopper, Aluminum exporter \n\n180% \n\n\n\nZinc, Iron smelter  \n\n157% \n\n\n\nZinc miner \n\n275% \n\n\n\nVanadium miner \n\n309% \n\n\n\nAverage Gain: \n\n169% \n\n \n\n\nThe Truth About China\n\t\t\t\t\t\t\t\t\t\tCrouching tiger, leaping gold.\nChina is about to QUADRUPLE its gold reserves. That's what is driving gold prices stratospheric right now. \nBut that isn't all.\nChina is amassing enormous strategic reserves of gold, copper, uranium, aluminum, zinc and manganese.  These efforts have two effects that benefit you as you build your natural resource million-dollar portfolio.\nFirst, China's buying puts a floor under prices. Whenever a commodity price dips, in steps China with an order.\nSecond, the urgency with which Beijing is building resource reserves puts relentless upward pressure on all commodities. \nFocus your buying on the resources that China is hoarding: gold, aluminum, oil, copper, uranium, nickel, zinc.\nClick here to dowload the report! \n\n\nIt Came To This\n\n\n\n\"Dick Young knows the financial markets like few others.\"\n\t\t\t\t\t\t\t\t\t\t\t-James M. Benham, Former Chairman, The Benham Group of Mutual Funds \n\n\nThe more the dollar falls, the higher the nominal price for gold. \nThe more confidence erodes, the higher gold goes. \nThe more inflation spirals, the faster the run on gold becomes. \nThe deeper into World War III we wade, the greater the demand for gold as a safe heaven. \nWhichever way you look at it: gold's going up. Consider: Gold is over $600 today. Could it go to $2,000? If that sounds crazy, consider that $2,000 is merely the 1980 high--expressed in 2006 dollars. \nThe Truth About Gold\n\n\n\n\n\n\nYoung's Intelligence Report\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tBuy List: Up 80% \n\n\n\nIt's still early in the game. \n\n\n\n \n\n3 year gains \n\n\n\nGold Bullion (spot prices) \n\n71% \n\n\n\nGlobal Gold Mining \n\n35% \n\n\n\nAsian Gold Producer \n\n180%  \n\n\n\nDiversified Gold/Metals Fund \n\n77% \n\n\n\nBullion Gold Fund* \n\n54% \n\n\n\nVanguard Gold Fund \n\n118% \n\n\n\nAverage Gain: \n\n89% \n\n\n\n*Results only available for two-year gains.  \n\n \n\n\nGold bullion or mining stocks? Which will get us to a million quicker?\nThose of us with a few years on our backs know that a gold mine is a hole in the ground with a liar sitting at the top. The phrase Vancouver penny stock should be enough to send a shudder down your spine.\nSo when you see some wacky financial commentator doing a jig on TV over a mine in Venezuela that's never produced an ounce of anything, grab your wallet and run.\nSo, with mines, make like Nancy Reagan and just say no. (A few exceptions exist and they are covered in your report.)\nBullion's the way to go. I own a lot and it makes dandy gifts. But best of all, you don't have to take possession of it anymore. My favorite gold fund gives me ownership of bullion without delivering. Perfect.\nOne more caution about mines, by the way. They are big users of energy--so costs are going up. Inefficiencies are reappearing. Few miners are good business people.\nIn your report, The Truth About Gold, I'll show you how to \"get physical\" with bullion. I'll also tell you which three mines in the world I make an exception for.\nGet your report today with a risk-free subscription.\nStep Six: How Copper Got Golden\n\nRight now, the world has three days of copper reserves. \nThis is not a dangerous situation. It is catastrophic.\nBut it is eerily familiar to you, if you have read carefully everything I have told you about oil, gas and gold. A glut triggers infrastructure neglect, which is followed by an economic boom of such force the supply-demand see-saw breaks. Countries with the commodity talk of nationalism, which drives prices to speculative heights. \nAnd then we run out.\nWhich is why copper prices were up 40% in 2006 with a lot more room to run.\nI've got 4 big copper players on my buy list right now, and all 4 averaged 230% gains over the last 3 years. All are named for you in Red Gold, the free report I've put together for new subscribers to explain this opportunity. \nCopper Breakthrough\nOur top copper company has pioneered a new copper mine in America that uses bacteria, not shovels, to find copper. \nThe miner that has developed this breakthrough technology could own the copper market in the next five years. Complete details in your report. \nStep Seven: The Great Water Rush\n \n\n\n\n\"My success with you over the years is triple the net gain of the other services combined.\"\n\t\t\t\t\t\t\t\t\t\t\t-J. Lipton, HI \n\n\nBoth plentiful and rare--it covers 70% of the Earth's surface, yet only 1% is drinkable--water is the next frontier in the war between the Haves and Havenots.\nWater is the next great resource rush. Time to dive in.\nRight now, a treasure trove of water sits below the Mojave Desert, and at current water prices, it could be worth billions.  The water company that holds the rights to it sells for about $40 a share. The value of its assets are probably close to four times greater.\nFor investors like us, this is a huge opportunity. That's why it's so important that you read my revealing new report Water Rush.\nIn this free report, you'll discover every detail you need to know to invest intelligently, rapidly and fully in this innovative water company. \nYou can't go wrong by investing in this company. Also in your report, I can't resist giving the lowdown on three more water stocks for your portfolio. After all, water is the perfect business. Supplied by Mother Nature and in insatiable demand by billions of people, can you imagine a simpler business? The other water stocks I detail in your report also overflow with dividends. So--jump in!\n\n\n\n\n\nYoung's Intelligence Report\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tBuy List: Up 47%\n\n\n\nThe Next Oil \n\n\n\n \n\n3 year gains \n\n\n\nCalifornia Water Utility \n\n35% \n\n\n\nNortheastern Water Utility \n\n52% \n\n\n\nWestern Water Utility \n\n54%  \n\n\n\nAverage Gain: \n\n35% \n\n \n\n\nStep Eight: Every Investor's Best Friend\n \nA diamond may be forever, but they're gong like hotcakes today, and here is why you should jump on the bandwagon:\nChina's Middle Class Makes A New Friend\nA new middle class that has so recently witnessed a Mao-induced Great Depression of its own has created a surging demand for Harry Winston diamonds. A savings account in a China bank just doesn't measure up to three carats on the finger.\nThe growth rate in China for diamonds is 20% a year. Jewelry--especially diamonds--is now the third leading consumption item in China after housing and cars! \nFrom the American Arctic to a Shanghai shop window, with every phase between in the control of one company? It's a magnificent investment.\nIn your research report Diamond Rush, I show you how to stake your claim to this fascinating boom. The report is FREE--download it here. \nOur remarkably safe, big profit quest has taken us from the treacherous--oil and energy alternatives--and industrial--copper, gold and uranium--to the exotic world of diamonds. \nWe've made good progress, too, covering three doubles, two triples and a four-bagger. \nOur next two resource plays add some much needed ballast to this vessel. So let's see how the world's most common resource is about to become precious.\n\n\n\nThe Best Natural Resource Company\n\t\t\t\t\t\t\t\t\t\tOn The Face of the Planet\nIf you were to say to me, \"Dick, you've presented a lot of great opportunities here, but what's your top pick? If you could buy just one stock that you could sock away for ten years, what would it be?\"\nHere's what I'd say.\nIn ten years, $50,000 in this one stock has the potential to be worth half a million or more. That's a guess, obviously, but it is also a reasonable one.\nThis one resource stock is global in reach--but intensely conservative in nature. For example, it has recently sold off all its copper holdings in politically unstable Peru and is cutting back mining operations in Bolivia and Venezuela. It doesn't like renting mines.\nIf you can name a metal or energy source this company is leading it. All of the world's most vital resources, wrapped up in one highly-efficient package--perfect. Sales were up 38% in the first half of the company's fiscal year, with earnings up 59%. Oil revenue (up 24%), metals (up 149%), steel (up 61%), diamonds, coal, aluminum--all up, up, up.\nIt has quadrupled in the last three years but shares still trade at the low end of their historical range.\nThe New King of LNG\nHere's the kicker. The company has just won contracts to drill 36 new natural gas fields offshore near China. In a single move, this company has become the top exporter of clean Liquefied Natural Gas--right on the doorstep of China, Japan (the world's biggest importer of LNG), India and Korea!\nIf you wanted to buy just one natural resource stock--this is the one! Complete details in your report, The ONE Natural Resource STOCK, plus ONE FUND to buy, FREE when you accept a no-risk, money-back guaranteed subscription to Young's Intelligence Report. \n\n\n\n\n\n\"If I haven't seen it in Intelligence Report, I don't put money in it.\"\n\t\t\t\t\t\t\t\t\t\t\t-R. Ledlow, FL \n\n\n\"I Made You A Serious Promise:\n\t\t\t\t\t\t\tRemarkably safe, fast PROFITS.\n\t\t\t\t\t\t\tHow did we do?\"\nI began this Intelligence Report by making the case for commodities in your portfolio.\nI said that it is now timely and right for conservative investors to make room in their portfolios for natural resource stocks, because many of them are safer than the domestic stock market. \nAnd I hope I proved it to you that commodity-oriented stocks can be safe, especially if you avoid speculative oil patch plays and fuel cell gimmicks.\nChina's growth (Japan's too), the breaking of the old supply-demand see-saw, and the dangerous new era of vengeful wars between those who have resources and those who don't--all fuel this massive bull market.\nAnd will do for the next fifteen, possibly 20 years.\nYoung's Intelligence Report subscribers have been there from the very start. In the past three years, as I have shown you, the profits in our favorite resource plays have been huge:\nBy grasping the significance of this shift, and by following the explicit instructions published regularly in Young's Intelligence Report, you could have been sitting on a tidy pile of profits in the past three years.\nYou could have--but because you didn't, it now becomes imperative that you act now. As I said, we are but a few years into a 15-20 year bull market. The shortest bull market in commodities lasted 15 years, the longest 23 years. The periodic slumps will get very severe in the second half of this run, but right now the bull market in the resources I have talked about today is accelerating.\nI want you to make a remarkably safe, big profits in natural resources in the next three years. Begin with a risk-free subscription to Young's Intelligence Report and receive up to TWELVE FREE REPORTS by clicking here.\nJoin us today--we're an independent, somewhat hard-nosed group of wealthy individuals, and you'll fit right in.\nI want to make you ten very specific promises about Young's Intelligence Report. They amount to what I call...\n...The Young Million Dollar Promise\nOverall:\nI will provide the blanket of financial security you go to sleep under, the blanket of safety that you wake up under.\nI will provide the consistency you need--and the growth you crave.\nI will provide the simplicity that endures. \n\"It took me all my life,\" jazz trumpeter Dizzy Gillespie once said, \"to learn what notes not to play.\"\nI will provide you with the truth which you will sometimes find unpalatable and almost never find elsewhere.\nI will provide direct explanations that don't insult your intelligence or experience, in a form that gets to the point, so you don't waste time (and neither do I.)\nSpecifically\n1. You will win--by never losing.\nMy strategy is designed to capture big profits without endangering principal. You will invest in locked-in trends that cannot be reversed, derailed, impeded or thrown off course by any conceivable external force. Period. This approach has created considerable wealth for the last 32 years and has never once suffered a meaningful loss.\n2. You will hit 'em--where they ain't. \nYou will not zig and you will not zag. But you will not mind investing decisively in stocks that are \"overlooked\"--or even obscure. Trendy (meaning already overpriced, over-hyped and ripe for a fall) will cease to be of interest to you. When a company trades for half what it's worth and the business dominates a locked-in trend, it's safe and easy to pluck a 42% gain as we did with Caterpillar last year. And you will do this several times a year from now on.\n3. You will have a STRATEGY. \nNo more meatloaf portfolios! Your portfolio will be degreased...efficient...simple. You will know your stocks cold, and you'll track them once a month. Every year, from now on you will grow wealthier. You will laugh at manias, bubbles, busts and calamities. You will never be vulnerable and you'll never feel vulnerable. Ever again.\n\n\n\n\"Confidence\"\n\t\t\t\t\t\t\t\t\t\t\t\t\"There is no one in the investment world in whom I have more confidence.\"\n-lmer H. Furguson, MI \n\n\n4. You will have a PARTNER.\nInvesting--even for the very wealthy--can feel very lonely. Independent advice--advice that really has not been \"bought-and-paid for\" somewhere, somehow--is rare. Imagine, then, the advantage of having access to advice that you can trust. Access to 32 years of experience. Access to a successful professional investor and advisor who only works for you! That's exactly what you'll have, from this moment on.\n5. You will invest in SAFE-AND-CHEAP STOCKS. \nStocks with a thick coat of protective armor. Companies that are stripped of all cuteness. Companies that keep things radically simple. You've had a sampling of them here, so you already understand their potential. Enough said.\n6. Day and night your money will make money--RELENTLESSLY. \nWherever I go, even in the deepest wilderness or highest mountain peak, I carry a small dog-eared sheet of paper. In quiet moments, I unfold it and read with awe...a compounding table. Compound interest is, as Einstein said, mankind's greatest invention. Harness the power and begin to multiply your wealth and every tick of the clock. Do this and live richer now. Do this and build wealth that exceeds your ability to spend it!\n7. In three years, you'll be far richer than you could have imagined. \nI've laid out the specific steps, the specific resources, the specific stocks in this report. All the details are laid out in your free reports. And every month from now on, we'll review our progress, make adjustments. We'll stay focused stay on message--and we'll get this job done.\n8. You can join us--AT MY RISK. \nIf I fail to deliver on any of these promises, I will pay for your subscription. You get your money back. If I have over promised, in your opinion, just tell me within the first six months of your subscription term and I guarantee you a full 100% refund. All the issues, web downloads, reports--everything is yours to keep.\n9. Join us at my risk--AT ALL TIMES. \nEven after the first six months, if you are ever dissatisfied I'll send you a 100% refund for the balance of your subscription term. Again--no strings, no questions.\n\n\n\n\"I have fewer sleepless nights...my net worth has doubled.\"\n\t\t\t\t\t\t\t\t\t\t\t-R. Wegner, WI \n\n\n10. You will know something only the very WEALTHIEST people know. \nIt is no secret that we live in a naughty world. Your mailbox is full of stock touts. Your email is stuffed with spam. Hucksters abound. So let me prove myself to you. That's what my wealthiest clients insist on, and you should demand the same treatment, too. Just say, \"maybe.\" Give me the next six months. They will be crucial ones. If I haven't made you richer and earned your trust, then I don't deserve your money, either. You get it all back. So say \"maybe\" and judge for yourself a full six months from now.\n Yours sincerely,\n\nDick Young\nA Sure Path to Success\n--No Dreamers, Please!\n\n\n\n\n\n\nFREE GIFT #1\n\nSugar and many other agricultural  commodities slept through the recent commodities boom.  Now they’ve woken up—and are ready to hand  you a superb second chance to get rich in this super-cycle.\n\nHow to use new ETFs to get in on the agriboom of ’07 \nbest way to play timber, citrus, Argentinean ranches  and the booming global agribusiness that boosts farm yield\n\n\n\n\nFREE GIFT #2\nUranium is a commodity in desperate demand. Prices are already up 900% since 9/11 and could double from here. Fortunately, North America is rich in yellowcake. Here's the case for uranium--and the one mine you should buy now.  Consider it your first step in your million dollar quest.\n\n\n\n\nFREE GIFT #3\nOne key driver of uranium prices is oil--the true “dirty bomb” in this war between Haves and Havenots. Let's play oil safe with domestic winners:\n\nThe best U.S. refinery \nThe best global oil major \nThe best U.S. oil an gas pipeline company \nThe best domestic gas producer \nThe best oil, gas and CO2 transporter (6.0% yield, to boot) \nThe best U.S. gas partnership, now paying out 15 TIMES more in dividends than it did three years ago! \n\nAS WELL AS the low-down on the best tar sands producer and the best income trust.\n\n \n\n\n\nFREE GIFT #4\nIn Clean Coal And Other Alternatives I tell you how to make a fortune in the coal-to-diesel revolution. I'll also show you:\n\nHow to grab that 11.1% yield in our super-high grade coal trust. \nWhich traditional coal mines are the ExxonMobils of their industry. \nExactly how to play the new ethanol boom. \nTwo ways to play wind power--one very safe, one still speculative. \nHow to time your entry into a hydrogen fuel cell investment. The concept will change the entire outcome of World War III--but not yet. \n\nPLUS: Sugar, the most efficient renewable energy source. How to ride the sugar rush over the next three years.  \n\n\n\nFREE GIFT #5\nChina is about to QUADRUPLE its gold reserves--and this demand is driving gold prices to all time highs in the next three years. Discover:\n\nThe ONLY three gold mines you should even consider owning \nBest gold bullion fund \nBest gold collectibles \nBest way to buy gold low, sell high--absolutely fool-proof \n \n\n \n\n\n\n\n\n\n\n\nFREE GIFT #6\nCopper was up 40% in 2006--and the reason is, it turns on the lights. It's step one for the 50% of the world's population that desperately yearns to join the other half. Once more we've made our 230% in the last three years by playing it safe.\n\nFastest way to a copper windfall: play the merger mania going on between Canadian copper miners \nBest company using microorganisms to recover copper--a bonanza waiting to happen. \n \n\n\nFREE GIFT #7\nThere's a bull market in diamonds--and it's just beginning. A daring geologist, Eira Thomas, has turned the diamond cartel upside down with an amazing discovery of diamonds near the Arctic Circle. With a Harry Winston exclusive, these diamonds are retailing in the Far East at a huge mark up. Diamonds should play a significant role in our million dollar quest.\n \n\n\nFREE GIFT #8\nWater utilities for growth? You bet: shortages of water are becoming a way of life in the U.S. as much as elsewhere.  He who has the water holds the key to the development of vast tracts of land. And he who can pipe it into new developments has far greater power than more landowners. The fat dividends don't hurt, either. Here are five water stocks you should buy today. Make them an integral part of your natural resources portfolio.\n\n\n\n\nFREE GIFT #9\nThe armadillo is God's Sherman Tank, and your portfolio must possess the same qualities: It can take heavy blows, and it hunts with single-mindedness. Stripped of cuteness and complexity, it survives and thrives across generations. The principles of our Armadillo Strategy are laid out for you here for the first time in this report. Consider it.\n\n\n\n\n\nFREE GIFT #10\nWith real-life inflation at 5% or more--and headed higher--investors sense danger--and are clamoring for income.  With some hunting, yields of 6%, even 8% can indeed be found. Not only that, but often these yields go with 10%-15% growth. Here's your complete guide to the true happiness that results when you add 6.55% yield to 10% growth. \n\n\n\nFREE GIFT #11\nIf you could buy just ONE natural resource stock--what should it be? If you can name a metal or energy source, this company is leading it. Gold, uranium, coal, copper, aluminum, titanium, iron--it is a miner in all these areas. All of the world's most vital resources, wrapped up in one highly-efficient package--perfect. In ten years, $50,000 in this one stock will be worth between half a million and a million. That's a guess, obviously, but it is also a conservative one.\nPLUS: If you could buy just ONE FUND--this is the one! IF you want to get to a million in ONE step, use this one no-load, actively managed mutual fund. It may take a little longer than three years, but you'll sleep like a baby at night. \n\n\nFREE GIFT #12\nWhen commodities are in a bull market as they are today, stocks fall as surely as the sun goes down at day's end. Very few stocks are spared, but most vulnerable are high growth stocks with meager cash flows--which, right now, is almost every stock listed on the Russell 3000! Here's a comprehensive list of stocks with poor cash-flow. Run--do not walk-away from these stocks! YOURS FOR PROMPT RESPONSE!\n\n\n\n\n\n\n\n\n\n---------------------------------------------------------\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you. Please tell us if your email has changed by visiting here: http://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice from InvestorPlace advisors, you can let us know by visiting\nhttp://www.investorplace.com/u/?p=8BZ145-1&e=IPLACEREPORTS@SPEEDY.UWATERLOO.CA\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,\n\t\t\t\t\t\t\t2420A Gehman Lane\n\t\t\t\t\t\t\tLancaster, PA 17602\nCopyright (c) 2007 ACP Phillips Investment Resources, LLC.\n\t\t\t\t\t\t\tAll rights reserved.\n05/09/2007 09:02AM\n--------------------------------------------------------------------\nThank you for subscribing to InvestorPlace.com. Please note that we cannot be liable for any missed bulletins caused by overzealous spam filters. To ensure that you continue to receive this valuable part of your service please take a moment to add (RichardYoung@IntelligenceReport.com) to your address book. Click here for instructions:\nhttp://www.intelligencereport.com/whitelist.html?eml=RichardYoung@IntelligenceReport.com\n--------------------------------------------------------------------\nee==8BZ145\n\n\n\n\n\n\n\n"}