{"category": "spam", "to_address": "\"Harold Larry\" <theorize@plg.uwaterloo.ca>,\n   \"Spielas Jeffrey\" <mt@plg.uwaterloo.ca>,\n   \"Henry Frank\" <dmason@plg.uwaterloo.ca>,\n   \"Carl Scott\" <dziegler@plg.uwaterloo.ca>,\n   \"Arthur Eric\" <chortled@plg.uwaterloo.ca>", "from_address": "\"Maureen\" <Maureentos@aceydecy.com>", "subject": "Here's another message from Ms. Mclaughlin:)", "body": "TIRED OF THE SAME OLD ROUTINE?\n\nThis is just the solution you've been searching for- the Vibrating Ring has\nbeen specifically designed to increase both his and her pleasure. The\nsilicone rubber ring expands to comfortably fit all sizes, and will give you\nthe same incredible results every time. \n\nThe Vibrating Ring is a safe, user-friendly, pleasure-generating device\nthat not only stimulates her, but also allows him to maintain it longer and\nstronger. If it's an enjoyable, vigorous love-life you want, then try the\nVibrating Ring. \n\nVibrating Ring features include:\n- Raised tickler for her external massaging pleasure.\n- Long-life battery so the ring can give you satisfaction again and again\n- Non-toxic, silicone rubber for the everyone's comfort.\n\nRead on and see why the Vibrating Ring is taking the world's bedrooms by\nstorm!\n\nhttp://www.theultimatetoy.net\nSo get That Buzz back in the Bedroom! Fun! Fun! Fun!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nthat we can politically to run the the way we at present. To some, it will\nimpractical. Yet nothing is more than the attempt to impose future from\nabove. What was under industrialism may be realistic under what was\npractical be absurd. The encouraging fact is we now have the potential\nachieving tremendous breakthroughs in decision-making if we imaginative use\nof the new both \"hard\" and \"soft,\" that on the problem. Thus, advanced \nmean that participants in social assembly need not meet in room, but might\nsimply hooked into communications net that the globe. of scientists to\ndiscuss research for the future, or goals for quality, could draw\nparticipants from countries at once. An assembly steelworkers, unionists and\nexecutives, convened to discuss for automation and for the of work, itself,\ncould link up \nfrom many mills, offices and warehouses, no how scattered or remote. A\nmeeting of the community in New York or Paris artists and gallery-goers, and\nreaders, dramatists and audiences discuss appropriate long-range goals for\nthe development of the city could be through the use of recordings and other\nactual samples of the kinds of production under discussion, architectural\ndesigns for facilities, samples of new artistic made available by\ntechnological advance, What kind of \nlife should great city the future enjoy- What resources would needed to\nrealize given set goals- All social future assemblies, order to answer such\ncould and should be with technical staff to data on the social and economic\ncosts various goals, and to show the and benefits of trade-offs, so that\nparticipants would \nin position to make reasonably informed as it were, alternative futures. In\nthis way, each might arrive, in the not merely in vaguely expressed,\ndisjointed but at coherent of priorities for posed in that could be compared\nwith the goal of other groups. Nor these social future assemblies be\n\"talkfests.\" We are fast developing games and exercises whose chief beauty\nis\n\n\nCYA,\n\n\n\nMaureen\n\n\n"}