{"category": "spam", "to_address": "\"Woodrow Kim\" <ktwarwic@plg.uwaterloo.ca>", "from_address": "\"Theresa.\" <Theresagbufu@luukku.com>", "subject": "Yet another email from Theresa", "body": "Treat yourself and your woman to a marvelous, sensual experience.\n\nIntroducing the Vibration Ring \n\nIts patented design is both comfortable and washable. The Ring section\neasily stretches to fit any size and is made of non-toxic silicone rubber\nmaterial that is both soft and hygienic.\n\nThe Vibration Ring features a raised tickler with thinly sculptured ridges\nespecially designed to stimulate her c-spot and a micro vibration motor\nwhich produces pulsating sensations through the shaft promoting multiple\npleasures.\n\nIt's self-powered & has a switch to turn the device on and off as you\nchoose. So you're in control.\n\n\nhttp://www.unrivaledtoys.net\nGet rid of the Fizzle and grab the Sizzle! You will wonder how you did\nWithout!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nthe mate hooked another line to harpoon, they suddenly felt the boat\nbackward slightly, as if had been caught in the wake large passing ship.\nRemo the blue-and-white nylon line which had been to the shark limply drop\ninto water. \"Shit, shit and triple shit,\" shouted \"The sucker snapped the He\nshook his fist out at the The three barrels bobbed around the surface of\nwater, still connected by the \nto the shark. as if they had been attached to falling mountain of rock,\ndropped straight beneath the surface of the Remo and the mate stared long\nseconds as the barrels disappeared, then, as if they were corks released the\nbarrels rose again, shooting eight feet into the air, before hitting back\nwith string of three slap Above their heads, the cut the engines. \"We lost\nit, Remo called back. \"Good,\" said don't understand,\" Remo said. \"It giant. \nmaybe.\" \"This fish was very important to you caught it, would go back to\nour before am burned black this malevolent sun-\" \"Yes.\" \"I see,\" Chiun\nnudged Remo. \"He may come back. Sometimes do.\" The two men stood at the\nfront the boat, watching, eyes circling, but the was still. \"We're far away\nthe chum slick,\" said. \"Makes no difference,\" the mate \"When there's white\naround, the other make themselves scarce.\" Remo glanced back and that Chiun\nhad \nfrom his seat on the locker. was standing at rear of the boat. From he\nappeared to be his hands into the water. noticed him too. \"What's he doing-\"\nthe mate be surprised at anything,\" Remo they both looked toward the stern,\nsaw it. The giant shark came to the surface the water, directly behind boat.\nHe was only thirty away. He sped toward the boat at\n\n\nsee you next week\n\n\n\nTheresa\n\n\n"}