{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Affordable Healthcare \" <q1edw9y7j@crystalnoon.com>", "subject": "Get low cost affordable Health Insurance today ", "body": "\n\n\n<!--SAN JUAN, Puerto Rico - A Saudi Arabian detainee died Wednesday at Guantanamo Bay prison and the U.S. military said he apparently committed suicide. Critics of the detention center said the death showed the level of desperation among prisoners. \n\nADVERTISEMENT\n\n \nAlso Wednesday, a Canadian detainee fired his American attorneys, leaving him without defense counsel ahead of his trial, his former U.S. military attorney told The Associated Press. The detainee, Omar Khadr, is still to be arraigned and is one of only three of the roughly 380 Guantanamo prisoners to be charged with a crime.\n\nThe military did not identify the detainee who died or describe the manner of death. There are about 80 detainees from Saudi Arabia held at Guantanamo.\n\nGuards at the U.S. Naval Base in southeast Cuba found the detainee unresponsive and not breathing in his cell Wednesday afternoon, the U.S. military's Southern Command said in a statement.\n\n\"They tried to save his life but he was pronounced dead,\" said Mario Alvarez, a Miami-based spokesman for the command.\n\nLawyer Julia Tarver Mason, whose firm represents eight Saudi detainees at Guantanamo, said she has tried so far without success to learn from the government if the apparent suicide was by one of her clients.\n\n\"They are in the care of the United States government and that should mean that deaths should not occur,\" Mason said.\n\nIt would be the fourth suicide at Guantanamo since the prison camp opened in January 2002. On June 10, 2006, two Saudi detainees and one Yemeni hanged themselves with sheets.\n\nA spokesman for detention operations, Navy Cmdr. Rick Haupt, declined to comment, referring questions to the Miami-based Southern Command, which oversees U.S. military operations in the Caribbean and Latin America.\n\nDefense attorneys said the death was likely an act of desperation at a prison camp where detainees are denied access to U.S. civilian courts and isolated in their cells for up to 22 hours a day.\n\n--!>Visit here to find better Health Insurance Rates Today!      \n\n\n\n\n\n"}