{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "This Weekend on BBC Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJONATHAN DAVIES ON CHALLENGE CUP 5TH RND\nThe incentive to reach the Challenge Cup final is always immense, but there is an extra special reason to make it this year.\n\n\nRugby league's showpiece event returns to Wembley after an eight-year absence and it will be a very special occasion.\n\n\nClubs go into this weekend's games knowing they are just three wins away from stepping out to play at the fantastic new arena on 25 August.\n\n\nOn Saturday Leeds take on Wigan and I expect the Rhinos to make their home advantage count.\n\n\nWigan did narrowly win at Headingley in April, but they have been very up and down this season. \n\n\nThe Warriors have quality players who can hurt anyone, although I think Leeds are going well enough at the moment to progress.\n\n\nOn Sunday, out-of-form Wakefield have to contend with the might of the Bradford Bulls.\n\n\nThe Wildcats have taken some heavy beatings recently, losing five out of their last six games, but in coach John Kear they have a man who can motivate teams for the big matches.\n\n\nIt might just take a one-off game such as this cup tie to reinvigorate their season and get them back into the sort of form we saw at the start of the year.\n\n\nThat said, the Bulls will be rampant favourites to progress as they are such a strong unit.\n\n\nIn fact I would probably have them as my favourites to go all the way.\n\n\nThey won't have it easy as the way the draw has fallen this year has seen many of the Super League big guns kept apart.\n\n\nIf this weekend's games go to form we should have seven out of the current top eight teams in the league contesting the quarter-finals and that is exactly what we want and expect at this stage of the competition.\n\n\nJonathan Davies played rugby league for Great Britain and Wales. He will be part of the BBC commentary team for Leeds v Wigan and Wakefield v Bradford.\n\n\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nRUGBY LEAGUE\n bbc.co.uk/rugbyleague\nSaturday\nChallenge Cup fifth round, Leeds v Wigan (1430-1635, BBC ONE, BBC Sport website and Radio Five Live Sports Extra); Post-match forum (1630-1715, BBCi and website). \nSunday\nChallenge Cup fifth round, Wakefield v Bradford (1345-1545, BBC TWO and BBC Sport website).\n\n\n\n\n\n\nFOOTBALL ON THE BBC\n bbc.co.uk/football\nSaturday\nChampionship play-off semi-final commentary: Southampton v Derby (1200, Radio Five Live/online); Football Focus (1210, BBC ONE).\nSunday\nChampionship play-off semi-final commentary: Wolves v West Brom (1200, Radio Five Live/online); Score (1430, BBCi and BBC Sport website); Premiership commentary (1500, Radio Five Live/online); Final Score (1635, BBC ONE); Match of the Day (2220, BBC ONE).\n\n\n\n\n\n\nPARALYMPIC WORLD CUP\n bbc.co.uk/disabilitysport\nSunday\nParalympic World Cup (1545-1740, BBC TWO)\n\n\n\n\n\n\nMORE SPORT ON THE BBC\n bbc.co.uk/tvandradio\nSaturday\nMotorsport: F1 Spanish Grand Prix qualifying (0955-1100 and 1255-1400, Radio Five Live Sports Extra/online); Horse racing: Ascot and Haydock (1300-1430, BBC ONE and BBC Sport website); Rugby union: Guinness Premiership Final, Gloucester v Leicester (1430-1630, Radio Five Live/online)\nSunday\nInside Sport (1230-1315, BBC TWO); Motorsport: F1 Spanish Grand Prix (1300-1400, Radio Five Live Sports Extra/online); Rugby union: Premiership final highlights (1300-1345, BBC TWO).\n\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tWatch Inside Sport\n Download the best bits of the show\n\t\t\t\t\t\n\t\t\t\t\t\tBe a sports book reviewer\n We want your thoughts on the latest publications\n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}