{"category": "ham", "to_address": "\"Marco Pesenti Gritti\" <mpg@redhat.com>", "from_address": "\"edward baafi\" <edwardbaafi@gmail.com>", "subject": "Re: [sugar] [pyxpcom] PyXPCOM viability and OLPC", "body": "> I looked a bit into this, it seem pretty simple in theory. Then I tried\n> to compile pyxpcom and it fails to build on the trunk:\n>\n> https://bugzilla.mozilla.org/show_bug.cgi?id=375318\n>\n> The last patch there apply cleanly but doesn't solve the problem for me.\n> I didn't try the previous patches but bsmedberg think they are wrong\n> so...\n>\n> Pyxpcom looks pretty much unmaintained, which isn't promising :/\n\n\nTo be fair, I think people are confusing the state of the mozilla\nbeast with the state of pyxpcom..\n\nIf pyxpcom doesn't build, it usually means that someone else has\nbroken it.. Remember, mozilla is a beast and major revisions need to\nland before we jump from Firefox2 (gecko1.8.1) to Firefox3\n(gecko1.9)..  I haven't built the trunk in a while.. I might have some\ntime over the weekend to try to build it..  In the meantime:\n\n1) how are you trying to build pyxpcom: standalone, or as part of xulrunner?\n2) If you're building as part of xulrunner, can you build xulrunner\nwithout pyxpcom? (this is a prerequisite)\n3)What does your build environment look like? Are you doing anything\nlaptop.org specific?\n\nSome things to keep in mind:\n\n1) I'm a single developer who was able to navigate the mozilla beast\nto get some traction with xulrunner + pyxpcom on my own time.. This\nwas early when people were having trouble just building xulrunner so\nthis is definitely doable now, but you have to decide that you need\nthis technology first and just dive in..\n\n2) To decide that you need this technology, you only have to ask\nyourselves two questions:  a)Do we want a gecko based browser? b)are\nproper python bindings a must?\n\n3) I think once you're able to build xulrunner + pyxpcom, you should\nreally give some thought to using xul widgets as enabling them by\ndefault on the laptop allows people with web backgrounds to build\ncompelling UIs.. This doesn't break sugar's \"1 toolkit\" rule as you\ncan build xulrunner to use gtk/cairo:\nhttp://developer.mozilla.org/en/docs/Configuring_Build_Options#Graphics_Toolkit\n I also know that internationalization of text is an issue and olpc\nhas chosen pango.. What's interesting is that FC6 ships Firefox with\npango text rendering so this is also doable and you can get advice\nin-house: http://download.fedora.redhat.com/pub/fedora/linux/core/6/i386/os/RELEASE-NOTES-en_US.html#id321398\n\nBesides these issues, the only other issue I see (please let me know\nif there are more) is to make the xulrunner based browser a true sugar\n\"activity\"..  I don't know all this entails, but it would seem that\nall window switching, multi-user interaction, etc is done using some\npython modules.. Pyxpcom will probably help there..\n\n-Ed\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}