{"category": "spam", "to_address": "freecollegescholarships@flax9.uwaterloo.ca", "from_address": "\"Westwood College\" <Westwood_College@mail.vresp.com>", "subject": "Prospective Student Survey", "body": "Dear Greedy:Our records indicate that you recently requested information on Westwood College.  Your feedback is important to us, and we invite you to take a brief, anonymous survey to help us improve our programs and service to prospective students.  Please note, your responses will be anonymous and will remain confidential.To participate in the survey, please click on the link noted below.  Thank you in advance for your time and helpful feedback!\nPlease click here to start the survey In California, for accrediting purposes, Westwood College - Inland Empire Annex is a satellite campus of Westwood College - Inland Empire (Upland, CA), a branch of Westwood College - Denver North (Denver, CO). Westwood College - Anaheim (Anaheim, CA) and Westwood College - Houston South (Houston, TX) are also branches of Westwood College - Denver North (Denver, CO). Westwood College - Annandale Satellite (Annandale, VA) is a satellite campus of Westwood College - Arlington Ballston (Arlington, VA), a branch of Westwood College - South Bay (Torrance, CA) and has been certified to operate in Virginia by the State Council of Higher Education for Virginia (SCHEV). Westwood College - Chicago Loop (Chicago, IL) and Westwood College - River Oaks (Calumet City, IL) are branches of Westwood College - Los Angeles (Los Angeles, CA).  Westwood College - Fort Worth (Fort Worth, TX) and Westwood College - Atlanta Midtown (Atlanta, GA) are branches of Westwood College - DuPage (Woodridge, IL). Westwood College - Dallas, (Dallas, TX) and Westwood College - Atlanta Northlake (Atlanta, GA) are branches of Westwood College - O'Hare Airport (Chicago, IL). Westwood College - Denver North - Online Programs (Denver, CO) are not applicable in all states, e.g. TX, MA, and IL. Not all programs available at all campuses.If you no longer wish to receive these emails, simply click on the following link:  \nUnsubscribeWestwood College2000 S. Colorado #2-800Denver, Colorado  80222\nRead\n the VerticalResponse marketing policy."}