{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Scott Berry\" <sberry@northlc.com>", "subject": "Re: help with a bash script", "body": "That's right I remember that now Steve.  How does one get yum to cron then? \nIs it just a matter of setting chkconfig and the levels you want to run at?\n\nScott\n----- Original Message ----- \nFrom: \"Dawes, Stephen\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Wednesday, May 23, 2007 8:53 AM\nSubject: RE: help with a bash script\n\n\n> Scott,\n>\n> Yum works much better then apt in fedora. It is simply a case of\n> learning the syntax.\n> yum install  -- to install a package.\n> yum update -- to update the system\n> yum remove -- to remove a package.\n>\n> By default, yum is setup to automatically update the system through\n> cron. I think it is nightly, but I don't remember exactly, because I\n> changed my to run weekly.\n>\n> Steve Dawes\n> Phone: (403) 268-5527\n> Email: SDawes@calgary.ca\n>\n>\n> NOTICE -\n> This communication is intended ONLY for the use of the person or entity \n> named above and may contain information that is confidential or legally \n> privileged. If you are not the intended recipient named above or a person \n> responsible for delivering messages or communications to the intended \n> recipient, YOU ARE HEREBY NOTIFIED that any use, distribution, or copying \n> of this communication or any of the information contained in it is \n> strictly prohibited. If you have received this communication in error, \n> please notify us immediately by telephone and then destroy or delete this \n> communication, or return it to us by mail if requested by us. The City of \n> Calgary thanks you for your attention and co-operation.\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n>\n> -- \n> No virus found in this incoming message.\n> Checked by AVG Free Edition.\n> Version: 7.5.467 / Virus Database: 269.7.6/814 - Release Date: 5/21/2007 \n> 2:01 PM\n>\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}