{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Stewart Sheffield\" <pifcgikongew@cgikon.com>", "subject": "Join the Anatrim revolution", "body": "\nPounds down, mood up\n\n\n\n\n\nAnatrim – The newest and most enchanting lose flesh product is now readily available – As you could see on CNN\n\n\n\nDo you know superfluous body kilograms kill a plenty of people around the world? We believe that you hate the ugly look of people like those and the social bias against them. \n\nMoreover, you got no will to withstand an assault of your fatal eating habits. Does it all sound familiar? Then we have something for you!\n\n\n\n\n\nHere Anatrim comes, the later product for the elimination of your body’s extra weight. The astonishing thing about Anatrim is it improves the quality of your life by repressing your feeling of hunger and giving you better cheer. Here are some notes received from our customers:\n\n\n\n\n\n\"This is amazing! \n\n\nI stopped stuffing myself with food and watching TV continually \n\n\nI became keen on doing sport.\n\n\n\n\n\n\n Anatrim put me on the right track.\n\n\n I have a great figure now and there are lots of men around me!\"\n\n\n\n\n\n\nMaria H., Boston\n\n\n\n\n\n\n\"Passive weight burning was of little help to me. It was very hard for me to hold back and not to eat something just at hand. \n\n\nOne day I heard on Anatrim from my very best friend and I was really effected at the information.\n\n\n I had attempted taking it, and my wife said to me I had changed for the better since then, 3 months later. \n\n\n35 pounds have gone away and I continue to become slimmer! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nSerge Smith, Bellevue WA\n\n\n\n\n\nAnatrim helps you to realize that you doesn’t have such a great need for the constant eating. It raises your spirit up, gives you additional energy, and attacks unnecessary kilos. Especial thanks to its mighty original formula!!\n\n\n\nPry out more useful information!\n\n\n\n"}