{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Steve Langasek <vorlon@debian.org>", "subject": "Re: Final text of GPL v3", "body": "On Sun, Jul 01, 2007 at 12:22:08PM +0200, Francesco Poli wrote:\n\n> > > Clause 5d is definitely worse than the corresponding clause 2c in\n> > > GPLv2.\n\n> > No, it's different from GPLv2 2c only in that it's extended to\n> > \"interactive user interfaces\" instead of just programs that \"read\n> > commands interactively when run\".\n\n> Clause 2c of GPLv2 is already an inconvenience and border-line with\n> respect to DFSG-freeness.  This is, at least, my humble opinion on the\n> matter.\n\n> \"Border-line\" does not mean that it *fails* the DFSG, but that it's\n> *very close* to fail.\n\n\"Border-line\" implies that it could go either direction.  This is not true.\nRegardless of how you feel about this clause, the GPLv2 is recognized as a\nfree license under the DFSG.\n\n> Extending this clause from interfaces that \"read commands\n> interactively\" to every kind of \"interactive user interface\" is really\n> making things worse, which is exactly what I commented.\n\nIt is not a qualitative change.  I see no grounds for saying that it's worse\nthan the existing clause.\n\n> Compare with the obnoxious advertising clause of the 4-clause BSD\n> license: it's an inconvenience close to fail the DFSG, IMO.  But we\n> accept it as DFSG-free.  However, I would *not* be happy to see a\n> license that *extends* this restriction to a wider scenario.\n\nThe 4-clause BSD is also not \"close to failing the DFSG\".  It's fair to\npoint out that licenses with such clauses give less freedom to the user than\nlicenses without, but that does not mean they are \"close to failing\".  They\nare clearly permitted, and I don't think it's useful to talk about\n\"proximity\" to the line of DFSGness, because it's always possible to make\nthinner and thinner slices.  We can cite many examples of clauses that we\nconsider non-free because they take more freedom from the user, and that's a\nuseful exercise to indicate which are free and which are not; but to call\nsomething \"close to non-free\" is just an expression of your dislike for it,\nmasquerading as an objective judgement.\n\n> [...]\n> > > This clause is very close to fail DFSG#3.\n> > > Hence, this is possibly a Freeness issue.\n\n> > It's absurd to say that this requirement is permissible in the GPLv2\n> > but not in the GPLv3.\n\n> I didn't say that.\n> It's not exaclty the same requirement and I didn't say that it's\n> necessarily non-free. \n\n> Clause 2c of GPLv2 is close to fail the DFSG, but passes.\n> Clause 5d of GPLv3 is worse (since it's more restrictive, being extended\n> to more cases), and hence it's even closer to fail the DFSG.\n\nThere is no qualitative difference between the two clauses.  We have *never*\ntreated quantitative differences between licenses as relevant to freeness.\nWould you claim that the GPLv2's \"make the source available for three years\"\nrequirement is ok, but a clause saying \"make the source available for six\nyears\" is not?  If not, then why claim that \"display a copyright notice if\nyou create a CLI\" is ok, but \"display a copyright notice if you create a\nGUI\" is not?\n\nI challenge you to offer a reasonable bright line test by which we would say\nthe GPLv2 clause is free and the GPLv3 clause is non-free.  I believe you\nwill fail.\n\n> Whether it fails or passes is to be decided: I simply said \"possibly\",\n> you say it's OK.  Let's see what others think...\n\nYes, let's.  Preferably others who are actually Debian developers, instead\nof non-DDs who discourage developer participation on debian-legal through\nthe numerical superiority of their posts advancing outlandish\ninterpretations of the DFSG that are untempered by such trifles as reality.\n\n> > > This clause could be not enough to protect recipients from patent\n> > > lawsuits, and thus make the work fail several DFSG, when there are\n> > > actively enforced patents infringed by the work.\n\n> > Um, no.  The DFSG does not require indemnification against third-party\n> > claims; an actively-enforced patent may require us to *not distribute\n> > the work at all*, but that's not a question of DFSG-freeness of the\n> > work.\n\n> Mmmmh, if one cannot redistribute a work (because of patents or\n> whatever), I think it fails DFSG#1...\n\n> DFSG#1 says \"The license of a Debian component may not restrict [...]\",\n> so maybe one can argue that the copyright license cannot be blamed\n> for patent restrictions.\n> But DFSG#1 does not talk about \"copyright license\", merely about\n> \"license\".\n\nIt talks about the license *of a Debian component*.  A patent license is not\na license of a Debian component, it's a license to third-party \"intellectual\nproperty\".\n\n> If there are actively enforced patents, I not only need a copyright\n> license in order to redistribute, but also a patent license.  If the\n> patent license forbids me to redistribute, I think the work fails\n> DFSG#1\n\nNo, it does not.  Just as cryptographic works that we couldn't distribute\nfrom inside the US were never deemed \"non-free\", works that are subject to\nthird-party patents should not be.  They are not legally distributable, or\nthey are a danger to our users (and therefore distributing them may be\ncontrary to the social contract), but these are factors *external* to the\nwork in question.\n\n-- \nSteve Langasek                   Give me a lever long enough and a Free OS\nDebian Developer                   to set it on, and I can move the world.\nvorlon@debian.org                                   http://www.debian.org/\n\n\n"}