{"category": "spam", "to_address": "\"Leon Micheal\" <theorize@plg.uwaterloo.ca>", "from_address": "\"Dawn\" <Dawnwodaj@vitalita.com>", "subject": "Here's another message from Dawn:)", "body": "EVER DREAM OF MIND-BLOWING LOVE-MAKING THAT NEVER FAIL TO SATISFY?\n\nWell, you don't need to dream anymore. At last there is a solution to all\nyour bedroom setbacks. The Vibrating Ring is the latest toy taking the world\nby storm. It's fun, safe, easy-to-use, and it's available now. \n\nThe Vibrating Ring features a raised tickler to stimulate her externally,\nwhile the expandable silicone ring sends deep vibrations up the shaft for\nboth his and her pleasure. If you want unbeatable results every time, you\ncant go past this amazing new product. \n\nThe Vibrating Ring expands to fit any size and is designed to massage those\noften neglected areas. If you are ready to experience a fantastic love-life,\nthen this is the perfect product for you.\n\n\nGo ahead and sneak a peek, You will never Look Back!\nhttp://www.theultimatetoy.net\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nby 1980- What changes most probable in leisure urban government, race the\ninterconnectedness of disparate events trends, scientific futurists are\ndevoting increasing attention the social consequences of technology. The for\nthe Future is, other things, investigating probable social and cultural\neffects advanced communications technology. The group at Harvard concerned\nwith social problems likely to from bio-medical advances. Futurists in\nBrazil the probable outcomes of economic development policies. The rationale\nstudying probable futures is \nIt is impossible for an to live through single working day making thousands\nof assumptions about probable future. The who calls to say, \"I'll be home\nsix\" bases his on assumptions about the probability that the will run on\ntime. mother sends Johnny school, she tacitly assumes the school will there\nwhen he arrives. Just as pilot cannot steer ship projecting its course, we\ncannot steer \npersonal lives without continually making assumptions, consciously or\notherwise. Societies, too, construct architecture of premises about\nDecision-makers in industry, politics, and other sectors of society could\nfunction without them. periods of turbulent change, however, socially-shaped\nimages of the future become less accurate. The of control in society today\ndirectly linked to our \nimages of probable futures. Of course, no can \"know\" the future in any\nsense. We can only systematize deepen our assumptions and attempt to\nprobabilities to them. Even this difficult. Attempts to forecast the future\ninevitably it. Similarly, once is disseminated, the of dissemination (as\ndistinct from investigation) also perturbation. Forecasts to become\nself-fulfilling or self-defeating. the time horizon extended into the\n\n\ncatch you later\n\n\n\nDawn\n\n\n"}