{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Automotive Newsletter May 29, 2007", "body": "\nhowstuffworks® | automotive May 29, 2007\nRSS\n \n Subcompact Car Showdown  Growing concerns over rising fuel costs and the environment\nhave prompted many Americans to consider buying smaller, more fuel-efficient\ncars such as the Honda Fit, Suzuki SX4, Chevrolet Aveo and Toyota Yaris.\nConsumer Guide decided to put these pint-size players to the test and compare\ntheir pros and cons. Check out our test drive results. Also at HowStuffWorks\n \n\nHow Convertibles Work - A convertible car and a sunny day are a match made in\nheaven. See how a convertible top works, check out a retractable hardtop and\ntake a look at some of the challenges faced by designers of convertible cars.\n \n\nHow Mufflers Work - If you've ever heard a car engine running without a muffler,\nyou know what a huge difference a muffler can make to the noise level. Look\ninside a real car muffler and learn about the principles that make it work.\n \n\n2009 BMW M3 Review - For 2009, BMW completes the overhaul of its best-selling\nline with a new high-performance M3 featuring the model's first-ever V-8 power\nand many other modifications. Learn what sets the 2009 BMW M3 apart from its\n3-Series brethren.\n   \nThis Week's Video\n \n\nHow the Denso Navigation System Works - The 2007 Toyota Camry has a new and improved navigation\nsystem with a faster processor, touch-screen interface and voice activation.\nLearn what's new in auto navigation technology from parts manufacturer Denso.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved "}