{"category": "ham", "to_address": "GRAIN LB <lb@grain.org>", "from_address": "James Packard Love <james.love@keionline.org>", "subject": "Re: [Ip-health] \"breaking\" patents", "body": "--\n[ Picked text/plain from multipart/alternative ]\nThe term breaking was originally used by Brazil, maybe as early as\n2001, during their first threat to issue a CL.  It may be a language\nissue.  In some cultures or languages, a patent = a monopoly, so the\nCL \"breaks\" the monopoly.   It can be helpful to point this out, and\nto describe the action as leaving the patent intact, but \"breaking\"\nthe monopoly, by replacing the exclusive right with a remunerative\nright.  Jamie\n\n\nOn May 15, 2007, at 1:01 AM, GRAIN LB wrote:\n\n> Dear friends\n>\n> I don't work directly in drug patenting arena but on IPR as it affects\n> people's control over biodiversity. Still, it's extremely annoying how\n> the mainstream media are getting away with all this talk of \"breaking\"\n> patents to describe what the governments of Brazil and Thailand have\n> recently done through compulsory licensing. I'm not a lawyer but I\n> don't\n> understand how they can use this kind of terminology since the\n> possibility of such licensing is written into patent law not to\n> mention\n> the TRIPS Agreement. It's part of the deal when you get a patent. So\n> what is being broken?\n>\n> It reminds me of the campaign to instill the word \"piracy\" in our\n> minds,\n> to demonise people who copy (regardless of how people understand fair\n> use under copyright law or what they think is legitimate).\n>\n> Unless this term \"breaking\" patents is really correct, the media\n> should\n> be challenged and stopped from using it any further. No?\n>\n> thanks & kind regards\n> Renee Vellve\n> GRAIN\n>\n> --\n>\n> ________________________________________\n> GRAIN\n> Aurora Apts, Unit 1, Pearl St, Umali Sbd\n> College, Laguna 4031 | Philippines\n> Tel: +63 49 536.39.79 | Fax: +63 49 536.55.26\n> Web: http://www.grain.org\n>\n> _______________________________________________\n> Ip-health mailing list\n> Ip-health@lists.essential.org\n> http://lists.essential.org/mailman/listinfo/ip-health\n>\n\n----------------------------------------------\nJames Packard Love\nKnowledge Ecology International\nmailto:james.love@keionline.org\ntel. +1.202.332.2670 / U.S. mobile+1.202.361.3040, Geneva mobile\n+41.76.413.6584\n\n\"If everyone thinks the same: No one thinks.\" Bill Walton\"\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}