{"category": "ham", "to_address": "\"Uwe Ligges\" <ligges@statistik.uni-dortmund.de>", "from_address": "\"hadley wickham\" <h.wickham@gmail.com>", "subject": "Re: [R] Computing fundamental harmonics from a periodogram", "body": "On 4/11/07, Uwe Ligges  wrote:\n>\n>\n> hadley wickham wrote:\n> > On 4/11/07, Uwe Ligges  wrote:\n> >>\n> >>\n> >> hadley wickham wrote:\n> >> > Dear all,\n> >> >\n> >> > I'm trying to finding the fundamental harmonics (ie. peaks in a\n> >> > periodogram) from a time series (extracted from an mp3).  For example,\n> >> > if I look at\n> >> >\n> >> > spectrum(fdeaths, spans = c(3,3))\n> >>\n> >>\n> >> A heuristical procedure for finding fundamentals of a monophonic sound\n> >> can be found in package tuneR. For a short example how to use it, type:\n> >>\n> >> install.packages(\"tuneR\")\n> >> library(tuneR)\n> >> ?tuneR\n> >>\n> >>\n> >> For polyphonic sound, I do not know any method that is both sufficiently\n> >> fast (i.e. calculates results for a 1 minute sound in less than a day)\n> >> and accurate.\n> >\n> > Thanks Uwe, I have been using tuneR already, but I have been unable to\n> > extract the peaks out of the periodogram.  I'm trying to follow along\n> >\n> > @book{wieczorkowska:2005,\n> >     Author = {Wieczorkowska, Alicja and Synak, Piotr and Lewis, Rory and\n> > Ra{\\AA}, Zbigniew W.},\n> >     Publisher = {Springer},\n> >     Title = {Extracting Emotions from Music Data},\n> >     Year = {2005}}\n> > http://www.springerlink.com/index/LRC0995XXL5M12X4.pdf\n> >\n> > but need the harmonics to calculcate most of the variables they are using.\n>\n> Interesting! Printer is already working to make a hardcopy.\n>\n> To your problem:\n> Even voting which harmonics are for which fundamental is difficult,\n> since for polyphony, the problem is not identifiable (i.e. there is no\n> general unique solution; e.g. quints, octaves etc. do share some\n> partials) ...\n>\n> I know of some heuristics by a physician in our university who has\n> invented an algorithm (still unpublished) that extracts the partials\n> (and of course has the problems mentioned above for polyphony) on its\n> way to another target. We (i.e. a phd student rather than me) are in the\n> progress of trying to implement the algorithm - which appears to be\n> rather complicated  ...\n\nThanks Uwe, I had hoped that there would be something off-the-shelf I\ncould use.  It's not a big deal, I was just trying to generate an\ninteresting data set for a visualisation class that I'm teaching.  The\nvery simple statistics that I had been extracting with tuneR (energy,\nvariance, pureFF, etc) don't discriminate between difference genres of\nmusic (let alone artistcs) at all well.\n\nHadley\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}