{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 6/28/07 - The Farming Issue", "body": "June 28, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\nFCStone, A Company Outstanding In Its Field\n\nCNH, Tracing Its Roots Back To Cyrus McCormick\n\nAnd Finally, The Company That Builds Those Green Tractors\n\n-----\n\nOn Monday I mentioned my new bird-proof blueberry cage, and the bumper\ncrop of berries that is now developing inside.  It's going to be a great\nharvest, and if I'm lucky the money I spent on materials for the cage will\nbe offset by thousands of fresh berries in the years ahead.\n\nBut I'm not in this for the money.  I'm in it as a hobbyist, and that's a\ngood thing, because farming is a difficult business.  Last year, for\nexample, a very wet spring meant the bushes weren't even pollinated.  As a\nresult, there were almost no berries.\n\nIf I were a farmer I'd have starved.\n\nBut even the experts have a tough time making a living as farmers in\nMassachusetts.  What with the rocks, the hills, the short growing season,\nthe expensive labor and the high cost of land, it's no wonder the number\nof farms continues to shrink.\n\nOut in the Midwest, farming is a bit easier; the flat wide-open spaces -\nand no rocks - at least mean large machinery can be used productively. \nStill, Mother Nature is always a factor.  Any year's crop can be ruined by\nrain, drought, heat, cold, insects and more.\n\nAnd the impact of those unmanageable factors is felt all through the food\nchain, from the producers to the wholesalers to the retailers.\n\nHappily, the financial markets are increasingly providing ways for farmers\nand other participants in the industry to reduce that risk by hedging\ntheir exposure, in a multitude of ways, to the fluctuating prices that\nstem from these variables.\n\nAnd that, finally, brings me to today's stock, FCStone (FCSX), of Des\nMoines, Iowa.  Most investors have never heard FCStone, and with good\nreason; it's only been public since February.  But it earned a spot in\nCabot Top Ten Report this week, and editor Mike Cintolo liked it so much\nhe named it Editor's Choice.\n\nHere's what he said:\n\n\"FCStone, headquartered in Des Moines, Iowa, is a commodity\nrisk-management firm, which means it advises customers (mainly in the\ngrain industry) on how to reduce risk and improve profit margins by using\nfutures, options and other derivative instruments.  And the stock is\nstrong today because demand is growing for what the company provides.\n\nIn the grain area, growing demand for ethanol (along with speculation\nabout changes to government policies) has increased volatility.   \nFCStone was recently named the electronic market maker for the Chicago\nBoard of Trade's ethanol futures contract. Internationally, Brazil is a\ngrowth market.  And on the environmental side, the company just teamed up\nwith Argonne National Laboratory to quantify biofuel carbon credit\nreductions.\n\nThe firm also operates in forestry and currency exchange.  In the first\nquarter, it saw record volumes in derivatives contracts in both\nagriculture and energy, and that helped boost profit margins to a record\n1.7%.  In sum, we like all these trends.  We think the company has great\ngrowth potential ahead of it as these segments of the global economy\nexpand and demand the firm's services. And we think the company, now\ntrading at just 65% of revenues, is undervalued here.\n\nFCSX came public in February at 24, and has been in an uptrend since,\ninterrupted by a normal pullback in April and May.  Last week it hit new\nhighs at 62.  So where to buy?  On the downside, there's strong support\naround 50; if you're a bargain-hunter you could put in a buy order that\nmight be filled there.  Otherwise, anything 10% or more off the top seems\nreasonable.\"\n\nLooking a little deeper, I see that the firm works with some 900\ncommercial grain companies that collectively produce the majority of the\ncorn, wheat and soybeans harvested in the U.S.  84% of its business, in\nfact, is tied to grain merchandising.\n\nBeyond that, I see the firm operating in a growing number of smaller areas\nthat have the potential for great growth, assuming management plays its\ncards right.\n\nI see it serving the food industry, from producers to distributors to\ngrocery store chains to restaurants.\n\nI see it working with ethanol and bio-diesel producers to maximize\noperating profitability while minimizing the numerous risks that come with\na developing industry.\n\nAnd I see it serving oil producers, refiners and wholesalers, trucking\nfirms, municipalities and railroads, all with an eye to smoothing out the\neffects of volatile energy prices.\n\nThe bottom line is that anxiety over the increasingly volatile prices of\ngrain, oil, ethanol and more is driving more and more companies to\nFCStone.\n\nIn a way, the company operates like an insurance company; it promises to\nreduce the unpleasant shocks of unplanned events . . . for a price. \nHistorically, insurance companies have been great, dependable investments.\n And I think the same might be said about FCStone, too, in time.\n\nI also like it here because it's a relatively new stock, which means many\ninvestors have never heard of it before.  And that means there are more\npotential buyers than sellers!\n\n----- ADVERTISEMENT -----\n\nIncreased Profits For 13 Cents Per Day!\n\nWhen we could see that Apple Computer's earnings momentum was shooting\nthrough the roof in October 2004, we named it Stock of the Month. It was\nselling for a shockingly low $35 per share. Today, (adjusted for a 2-for-1\nsplit) it has turned a $10,000 investment into $43,000.\n\nThere are 16 more Stocks of the Month I could name that have handed us an\n88% average profit per stock over the past two years.\n\nJoin Cabot Stock of The Month and get in on the next stock that explodes,\nlike past picks Intuitive Surgical (up 600%), Broadvision (up 670%), and\nAmazon (up 1,290%). Sign up today and you'll get immediate access to all\ncurrent recommendations, along with the free bonus report, Sector of the\nYear.\n\nTo learn more, please visit this link:\nhttp://cabotmail.net/t/206434/13148861/86/0/\n\n-----\n\nSticking to the farming theme gives me a chance to feature another\nlittle-known stock.  It's CNH Global.  Again, the name probably doesn't\nring a bell.  What if I said, CNH stands for Case New Holland and it\nincludes Ford Tractor, International Harvester and more?  Then maybe you\nsay, \"Yeah, I remember those good old American names.\"\n\nBut CNH is based in the Netherlands now!\n\nHere's how it happened . . . starting at the beginning.\n\nIn 1842, Jerome Increase Case founded the Racine Threshing Machine Works.\n\nIn 1848, a man ten years older named Cyrus McCormick, who had developed\nthe mechanical reaper, founded the McCormick Harvesting Machine Company in\nChicago.\n\nFifty years later, his son, Cyrus H. McCormick, led the effort to create\nInternational Harvester, by bringing the Deering Harvester Company and\nthree smaller manufacturers into the fold.\n\nA company named New Holland was founded in Pennsylvania in 1895,\nspecializing in agricultural equipment.\n\nAnd twelve years later, Ford Motor in Detroit built the prototype of the\nworld's first mass-produced agricultural tractor.\n\nThroughout the 20th century, numerous other companies were formed in the\nU.S., Canada and Europe to manufacture farming equipment.\n\nBut as the century wore on, competitive pressures made life increasingly\ndifficult for these firms.\n\nThe manufacture of Ford tractors was moved first to England and then to\nBrazil.\n\nNew Holland was bought by Sperry Corporation in 1947.\n\nIn 1966 Fiat (Fabbrica Italiana Automobili Torino) started a Tractors and\nEarthmoving Machinery Division.\n\nIn 1984, Ford Motor acquired Sperry New Holland, merged it with Ford\nTractor, and renamed it Ford New Holland.\n\nAlso in 1984, Case bought the agricultural equipment division of\nInternational Harvester, creating Case IH.\n\nIn 1986, the remaining part of International Harvester was renamed\nNavistar.\n\nIn 1991, Fiat acquired Ford New Holland and named it N.H. Geotech.\n\nIn 1993, its name was changed to New Holland\n\nAnd in 1999, Case and New Holland joined together, becoming CNH Global,\nthough still majority-owned by Fiat.\n\nAs a result of all this buying and merging, CNH Global has become an\ninternational powerhouse in the agricultural equipment industry.  In\naddition to tractors, it makes plows, harrows, cultivators, seed drills\nand fertilizer sprayers.  And when it's time to get the crop in, it has\ncombines that can be optimized for corn, wheat, mustard, canola, barley,\nlentils, lupins, oats, peas, milo, flax, grass seeds, pinto beans,\nsafflower, alfalfa, millet, soybeans, rice, sunflowers and more.  It also\nmakes cotton-picking equipment, mowers, balers and rakes.\n\nAnd here's some 21st century technology!  Integrating GPS guidance systems\ninto tractors eliminates the need to steer in open fields, freeing the\noperator to focus on the task at hand.  It also makes the job easier in\nrain, dark, dust and fog.\n\nAll told, it's a very impressive package of assets, and you could easily\nconclude that as long as man needs to eat, CNH (or its next permutation -\nmaybe Daimler-CNH, to be creative) will prosper.\n\nBut it's not alone.  There's still one major competitor in the industry,\nleft untouched by all the consolidations of the past century-plus, and\nthat's the company with the green tractors, John Deere.\n\nIn a sense it was destiny.  John Deere (the man) was born in Rutland\nVermont in 1804 and became a blacksmith, but moved to Illinois in 1836 to\nescape his creditors.  While McCormick and Case were working on their\nthreshers and combines, Deere was manufacturing steel plows (ploughs, in\nthose days).  The expansion into tractors didn't come until 1912, but\nthrough capable management, the tractors eventually helped the company\nbecome the #1 agricultural company in the U.S. . . . and today, Deere is\nstill headquartered in Moline, Illinois.\n\nSo how do these two companies compare?\n\nCNH Global, headquartered in the Netherlands, has revenues of $13 billion,\nand gets 60% of its revenues from the agricultural division.\n\nDeere is bigger, with revenues of $23 billion, but gets only 40% of its\nrevenues from agricultural products.\n\nDeere gets a huge 72% of its revenues from the U.S., while CNH is a more\nglobal, getting just 40% from the U.S.\n\nDeere trades at a PSR (price to sales ratio) of 1.2.  CNH's PSR is 0.89.\n\nBut Deere's PE (price earnings) ratio is lower; it's 18 while CNH's is\n28.\n\nDeere's profit margin has averaged 6.7% over the past year, while CNH's\nhas averaged just 3.1%.\n\nCNH pays an annual dividend of 0.4% while Deere's is 1.5%.\n\nBut are they worthwhile investments?  The simple answer is yes, because\nbusiness is good now and the stocks are in uptrends.  There's growth\noutside the U.S., particularly in China and Brazil.  And inside the U.S.\nthe ethanol boom has revitalized the agricultural sector.\n\nYear to date, Deere (DE) is up 26% and CNH (CNH) is up 78%.\n\nBut a look at the long-term chart of Deere tells us this stock is likely\ncloser to a top than a bottom.  This is a cyclical business, and Deere's\ncurrent major uptrend has been in place since 2000, so it's looking rather\nextended.  (Yes, the time to buy tractors was when the Internet boom\ntopped.)  Now, that doesn't mean the stock will top here, or even in the\nnext few months, just that the advance is looking rather long in the\ntooth.\n\nBut CNH's chart is different.  It started trading in 1996, peaked in 1997,\nand then plunged into a five-year decline, finally bottoming - after\nlosing 96% of its value - early in 2003.  Since then the trend has been\nup, and that old peak is still far away.\n\nWe discovered this stock, interestingly, in Cabot Top Ten, where it earned\na spot twice in February (the first time it was selling at 34) and again\nin June, based solely on its strength.  In short, there's big money moving\ninto the stock, pushing it higher fast.  Some of these investors are\nbuying because of China, some because of Brazil, and some because of\nethanol . . .  or the exchange rate advantage or valuation or the\ncompany's increased research and development program.  But to me it\ndoesn't matter.\n\nWhat matters is that the stock is under accumulation, and that there are\nno signs of selling pressure yet, despite the recent weakness in the\noverall market.  Conclusion, CNH can run farther still.\n\n-----\n\nEditor's note:\n\nCNH is a perfect example of Cabot Top Ten Report's ability to find the\nstrongest stocks in the market regardless of their age or industry.  So if\nwhat you like is strong stocks, you owe it to yourself to check it out.  A\nno-risk trial subscription is very affordable, and will guarantee you a\nweekly dose of the ten strongest stocks, complete with fundamental and\ntechnical analysis . . . even recommended buy ranges.\n\nTo get started, simply click the link below.\n\nhttp://cabotmail.net/t/206434/13148861/81/0/\n\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n-----\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=206434&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}