{"category": "spam", "to_address": "info.jiangsu@chinatiantinyin.com", "from_address": "\"Jiangsu Tianyin Chemical Co, Ltd\" <info.chinatianyinvacancy@gesttajalkahji.net>", "subject": "=?US-ASCII?B?UmVwcmVzZW50YXRpdmVzL0FnZW50cyBOZWVkZWQgVXJnZW50bHku?=", "body": "Jiangsu Tianyin Chemical Industry Co., Ltd.\nNo. 19 Wunjing Road, Shanghai, China.\nwww.chinatianyin.com \n\nSOLICITING FOR AGENTS IN YOUR COUNTRY.\n\nI represent the above named firm based in China. My firm manufacture, supply and export Pharmaceutics,Agricultural, Textile and Chemical Engineering Products for world trade. We are searching for representatives who can help us establish a medium of getting to our customers in Europe \nand America as well as making payments through them as payment officers. \n\nIn our just concluded Annual General Meeting (AGM). I, Foreign Service Manager of this multinational firm have been directed to seek for a reputable individual/firm who might be willing to take the offer as our agent.That is why i am making this contact to you. Because of the communication problem faced by most of our Board Members, since many of them cannot read, speak or write English Language except Chinnese which is our official Language. In view of this you are expected to relate directly with me as the foreign service manager since I have been \nmandated to contact you and give them frequent update about our activities.\n\nMost of our customers pay out in cash, cheques or money orders and we do not have an account in U.S.A And Canada presently that will clear this money. It is upon this note that we seek your assistance to stand in as our agent in your country.Also, as our agent, you will receive (Five \npercent) of whatever amount you clear for the firm and the balance will be paid to the accounts officer.Complete this form below.\n\nNAME\nCOMPANY NAME:\nADDRESS:\nCITY:\nSTATE:\nCOUNTRY:\nTEL:\nFAX:\nEMAIL ADDRESS:\nWEBSITE:\nOCCUPATION:\nMARITAL STATUS: \nDATE OF BIRTH: .\nDATE:\n\nVery Respectfully, \n\nMr Robert Cheng,\nForeign Service manager.\nE-mail:rbcheng_jiangsutianyinfsm@yahoo.com.hk\n\n"}