{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nFriday, 18 May, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nNew Wembley rolls out red carpet\nWembley will stage a star-studded opening ceremony before Saturday's FA Cup final between Chelsea and Man Utd.\n\n\n\n \nFerguson fears Wembley shoot-out\nMan Utd manager Sir Alex Ferguson dreads the FA Cup final going to penalties.\n\n\n\n \nCup final referee wary of diving\nReferee Steve Bennett admits it will be a difficult task to spot incidents of diving in the FA Cup final.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nIrish Open leaderboard\nThe latest scores from the European Tour event at Adare Manor.\n\n\n\n \nDyson shares lead in Irish Open\nEngland's Simon Dyson shoots a 68 which leaves him in a four-strong group at the top of the Irish Open leaderboard.\n\n\n\n \nIrish Open hit by lure of US Tour\nGraeme McDowell says events such as this week's Irish Open are suffering because of the US Tour's strength.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nMosley steps up push for green F1\nFormula One boss Max Mosley is proposing a raft of changes to help accelerate the adoption of \"green\" technology.\n\n\n\n \nRally of Italy positions\nLeading positions from the World Rally Championship event.\n\n\n\n \nHamilton won't win title - Jordan\nFormer team boss Eddie Jordan says Lewis Hamilton is an \"extraordinary talent\" but will not be world champion this year.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nMosley steps up push for green F1\nFormula One boss Max Mosley is proposing a raft of changes to help accelerate the adoption of \"green\" technology.\n\n\n\n \nHamilton won't win title - Jordan\nFormer team boss Eddie Jordan says Lewis Hamilton is an \"extraordinary talent\" but will not be world champion this year.\n\n\n\n \nHamilton will set 'new standards'\nLewis Hamilton will \"create the new benchmark for Formula One\", according to three-time champion Jackie Stewart.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nUK to host landmark running event\nThe first-ever Commonwealth ultra running championships will be held in the UK in 2009.\n\n\n\n \nKenya star denied Manchester visa\nWorld half-marathon record holder Sammy Wanjiru will miss Sunday's Great Manchester Run after failing to obtain a visa.\n\n\n\n \nSprint stars set for Loughborough\nThree of the British squad that won the Olympic 4x100m gold in 2004 will compete at the Loughborough International on Sunday.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nBlackmail claim stuns Landis case\nFloyd Landis sacks his business manager after he allegedly tried to expose the fact Greg LeMond had been a victim of child abuse.\n\n\n\n \nLaverde grabs Giro stage victory\nColombia's Luis Felipe Laverde wins the sixth stage of the Giro d'Italia from Tivoli to Spoleto.\n\n\n\n \nFoerster races to Giro stage win\nRobert Foerster wins stage five of the Giro d'Italia but Danilo Di Luca retains the overall lead.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nReview of the week\nMovie legend to strip if team go up, as the hunt for Mourinho's dog goes on\n\n\n\n \nKP's rough guide to Britain\nListen to Pietersen spoof on new Radio 4 show Look Away Now\n\n\n\n \nComment: Blues up for the Cup\nRobbo backs Chelsea, providing there are no more dog dramas\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}