{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Kasey Ham\" <veccypresscommnos@cypresscomm.net>", "subject": "Summer is coming, time to tone up", "body": "\nMelt away pounds with Anatrim\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most attracting product for corpulent people is now easily available – As told on ABC.\n\n\nDo you recall all the situations when you plead to yourself to do anything for being delivered from this desperately growing number of kilos? Luckily, now no great price is to be paid. With Anatrim, the ground-breaking kilos-melting combination of elements, you can get naturally health mode of life and a really slender figure. Just look at what our customers say!\n\n\n\n\"I hate to admit it but I was an awful food addict. \n\n\nI devoured all this rubbish \n\n\nand could not stop. \n\n\n\n\nThis suffering stopped after I started course with Anatrim! \n\n\nHoly God,\n\n\n\n\n my inclination to eat constantly abated, \n\n\nspirits increased and I turned to the happiest person 17 pounds in 2.4 months. \n\n\n\n\nSo, I can tell you now I became the happiest person on the planet!\"\n\n\n\n\n\nAmelia B., Washington\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nYou can't even fancy how I detested being ridiculed at school. \n\n\n\n\nI detested my plumpness and I detested myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nIt literally pulled me out of this dreadful nightmare! A lot of thanks to you, fellows.\"\n\n\n\n\n\nSteve Doubt, San Diego\n\n\n\n\n\n\"Do you know what? My marriage was saved thanks to Anatrim! I got into the circle, depression – more eating – more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nOne of my friends pointed at your web site and I called for Anatrim at once. \n\n\nThe final result was excellent, my appetite came to admissible level, I was often in a good mood, and, of course, I became able to tighten my belt on some holes. And you know, the sex became fantastic, too!\"\n\n\n\n\n\nJack\n\n\n\n\n There many and many gratitudes delighted people leave after taking Anatrim. Don’t you gonna join the thousands and thousands of slim buyers and try this natural appetite-abating energy boosting product now!\n\n\nDon’t miss your chance!\n\n\n\n\n"}