{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"BEST FREE Adult Personals\" <qboee_2lp@fusilminium.com>", "subject": "Have a one night stand or fall in love ", "body": "The Best All New ADULT Dating Site on the Net - You have to check it out if you're SINGLE! Sign up today, and you'll enjoy a one night stand, or even a threesome this weekend with the most attractive SINGLES in your city!And best of all, No Credit Card is Required to get your membership! \n\nPRESS HERE TO JOIN FOR NO COST (MUST BE 18 and OLDER):No Credit Card Required:\n\nhttp://concorsuper.com/t/qboee_2lp/744164\n\nMore info: \nIf you want to have a FLING this weekend with an attractive SINGLE in your city, then we would like to offer you a FREE dating site membership just for this week only. If you don't sign up for your free membership as soon as possible then you'll have to pay for it in the future...so come and sign up while it's FREE! We have the BEST looking SINGLES around, and they joined our DATING Network just to have fun and explore their naughtiest side with other singles!\n\nPRESS HERE TO JOIN FOR NO COST (MUST BE 18 and OLDER):No Credit Card Required:\n\nhttp://concorsuper.com/t/qboee_2lp/744164\n\nWe also only have 337 FREE memberships to give out. So if you want to go on a DATE this weekend with a HOT SINGLE WOWAN or MAN that wants to get naughty with you, then you had better hurry and get your -FREE- membership now!\n\nPRESS HERE TO JOIN FOR NO COST (MUST BE 18 and OLDER):No Credit Card Required:\n\nhttp://concorsuper.com/t/qboee_2lp/744164\n\nCome on, you'll enjoy your life more than ever before once you start dating our SINGLES! You have nothing to lose and everything to gain!\n\n-----\nShould you wish to stop receiving these messages, you may opt-out at any time by\n\nhttp://concorsuper.com/t/qboee_2lp/744165 \n\nclicking here and updating your e-mail preferences. Alternatively, you may contact Singlesnet.com Customer Service directly: \nSinglesnet .com, \n13A Highland Cir, \nNeedham, MA, 02494-3031 \n\nor \ntelephone (617) 301-6210 9am-5pm EST Weekdays.\n \nHi Subscriber! You are receiving this solicitation because producttestpanel@speedy.uwaterloo.ca previously agreed to receive correspondence. If this service should fail to meet your expectations, feel free to disassociate yourself from our service.\nhttp://concorsuper.com/u/18a5/producttestpanel%40speedy.uwaterloo.ca/2\n\nShould you want to contact us via the United States Postal Service, our address is as follows:\n96 Linwood Plaza Suite 132 Fort Lee, NJ 7024\n\n\n"}