{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Grimbough <msmith@ebi.ac.uk>", "subject": "Re: [R] How to install R 2.5 with Synaptic in Ubuntu?", "body": "\nHi,I can't get this approach to work.  When I first added the repsitory line to/etc/apt/sources.list synaptic complained that it was a malformed line.  Ifixed thisby adding \"main\" to end of the entry making it:\n deb http://my.favorite.cran.mirror/bin/linux/ubuntu feisty main\nHowever after this it still complains that it can't find \"packages.gz\"\nIt appears to be looking in http://my.favorite.cran.mirror/bin/linux/ubuntu/distsfeistywhich isn't the directory structure of the cran repository, but I can see anyway to modify this behaviour.  Every other Ubuntu repositoyI have looked at contains the dists directory.\nAny suggestions for modifying this behaviour are gratefully recieved.Many thanks\nMike Smith\n\n\"Stefan Große\" wrote:> >>I'm using Ubuntu dapper, which only have R of Version 2.2.1.> >>Would anybody tell me how to install the latest version of R with > > > from the CRAN Ubuntu readme- works for synaptic as well:> > * UBUNTU> > R packages for Ubuntu on i386 are available. The plans are to support at> least the latest Ubuntu release and the latest LTS release. Currently> (April 2007), these are Feisty Fawn (7.04) and Dapper Drake (6.06),> respectively. Since Feisty was released very shortly before R 2.5.0,> binary packages *for this release of R* are also available for Edgy> Eft (6.10).> > To obtain the latest R packages, add an entry like> >   deb http://my.favorite.cran.mirror/bin/linux/ubuntu feisty/> > or> >   deb http://my.favorite.cran.mirror/bin/linux/ubuntu edgy/> > or> >   deb http://my.favorite.cran.mirror/bin/linux/ubuntu dapper/> > in your /etc/apt/sources.list file. See > http://cran.r-project.org/mirrors.html> for the list of CRAN mirrors. To install the complete R system, use> >   sudo apt-get update>   sudo apt-get install r-base> > Users who need to compile packages should also install the r-base-dev> package:> >   sudo apt-get install r-base-dev> > The R packages for Ubuntu should otherwise behave like the Debian ones.> For> more information, see the README file in> >   http://cran.R-project.org/bin/linux/debian/> > * SECURE APT> > The Ubuntu archives on CRAN are signed with the key of \"Vincent Goulet> \" with key ID E2A11821. You can fetch> this with> >   gpg --keyserver subkeys.pgp.net --recv-key E2A11821> > and then you feed the key to apt-key with> >   gpg -a --export E2A11821 | sudo apt-key add -> > Some people have reported difficulties using this approach. The issue> was usually related to a firewall blocking port 11371. An alternative> approach is to search for the key at http://keyserver.noreply.org/ and> copy the key to a plain text file, say key.txt. Then, feed the key to> apt-key with> >   sudo apt-key add key.txt> > > * ACKNOWLEDGEMENT> > The Debian R packages are maintained by Dirk Eddelbuettel and Spie Bates.> The Ubuntu packages are compiled for i386 by Vincent Goulet.> > > \t[[alternative HTML version deleted]]> > ______________________________________________> R-help@stat.math.ethz.ch mailing list> https://stat.ethz.ch/mailman/listinfo/r-help> PLEASE do read the posting guide> http://www.R-project.org/posting-guide.html> and provide commented, minimal, self-contained, reproducible code.> > \n-- View this message in context: http://www.nabble.com/How-to-install-R-2.5-with-Synaptic-in-Ubuntu--tf3998481.html#a11426235Sent from the R help mailing list archive at Nabble.com.\n______________________________________________R-help@stat.math.ethz.ch mailing listhttps://stat.ethz.ch/mailman/listinfo/r-helpPLEASE do read the posting guide http://www.R-project.org/posting-guide.htmland provide commented, minimal, self-contained, reproducible code.\n\n"}