{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"David Harvey\" <david@d-w-harvey.com>", "subject": "GRML 1.0 QUERY", "body": "Hello,\n\nIn class this morning I tried the RC of GRML 1.0.\n\nHowever when I typed\ngrml speakup_synth=dectlk\nmy synth failed to speak.  All cables were connected correctly.\n\nThanks\n\nDavid Harvey\n----- Original Message ----- \nFrom: \"Littlefield, Tyler\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Friday, May 18, 2007 4:23 PM\nSubject: Re: three hds? is this possible?\n\n\n> got it. It works awesome now, hdc now mounted in /personal/media/music, \n> with\n> all my music in the root which is about 9+gb. Took quite a load off of the\n> /hdb drive.\n> Thanks,\n>\n> ----- Original Message ----- \n> From: \"Spie Sutherland\" \n> To: \"Speakup is a screen review system for Linux.\" \n> \n> Sent: Thursday, May 17, 2007 7:17 PM\n> Subject: Re: three hds? is this possible?\n>\n>\n>> In the BIOS settings, there should be four settings, one master and\n>> one slave for each controller. If your BIOS allows for an AUTO\n>> setting try that and it should auto-detect the drives. On most of the\n>> older BIOS there was an auto detect function you could invoke\n>> by pressing a key like F8 or similar and it would detect the drives\n>> and set the BIOS properly, newer BIOS can auto-detect at boot\n>> time. If you know which slave slot is for CD and if there is a CD\n>> setting in the BIOS, use that setting, and check to make sure the\n>> CD drive is jumpered as slave.\n>>\n>> If drives are not showing up then usually they are either not\n>> jumpered correctly or the BIOS setting is not correct. There are\n>> two other possible pains with old BIOS, one is limitation of\n>> drive size, some older BIOS may not support the full capacity.\n>> Some drives have a special jumper setting for this which will\n>> limit the drive size for older BIOS. And in some rare cases\n>> you need to manually set the capacity, number of cylinders\n>> and tracks, although its becoming rare that you'd have to do\n>> that anymore.\n>>\n>> The most important thing is making sure the drives are\n>> jumpered correctly as one master and one slave on each\n>> cable and making sure the drive is enabled in BIOS, if\n>> there is an auto setting in BIOS try that, if the drive is\n>> still not working, the drive will be labeled with info for\n>> cylinder/track/capacity and you can set them manually.\n>> Hopefully you will not need to do this.\n>>\n>>   -- Spie\n>>\n>> _______________________________________________\n>> Speakup mailing list\n>> Speakup@braille.uwo.ca\n>> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}