{"category": "ham", "to_address": "Ian Bicking <ianb@colorstudy.com>", "from_address": "Marco Pesenti Gritti <mpg@redhat.com>", "subject": "Re: [sugar] [pyxpcom] PyXPCOM viability and OLPC", "body": "On Tue, 2007-05-08 at 10:35 -0400, Ian Bicking wrote:\n> edward baafi wrote:\n> > This is interesting.. I use PyXpcom along with Xulrunner and currently\n> > have a B2 XO for development..\n> \n> Well then, this may be leading in an obvious direction...\n> \n> > In terms of a stripped down Firefox vs. PyXPCOM, I don't see why this\n> > would be an either/or as Firefox can be built with PyXPCOM support..\n> > Of course you need a stripped down browser in terms of memory\n> > footprint (the B2 only has 128MB of ram and the production version\n> > should have 256) and you need to add extra functionality and tie it in\n> > as a \"Sugar Activity\" so you should of course use python..\n> > \n> > So you can build a stripped down Firefox with PyXpcom support and add\n> > features and tie into sugar with python, or you can build a Xulrunner\n> > based browser from scratch with PyXpcom support.. Actually these\n> > aren't too different as Firefox 3 was supposed to just be an app\n> > running on top of Xulrunner although this feature shows up as \"At\n> > Risk\" in the Firefox3 features list:\n> > http://wiki.mozilla.org/Firefox3/Product_Requirements_Document#Gecko.2FPlatform \n> > \n> > \n> > Given that there isn't much to the current \"Web Browser Activity\" on\n> > the XO, I would think that you could build a Xulrunner based version\n> > of that pretty quickly and then add features as needed (using PyXpcom\n> > if you like) rather than starting with all the features of Firefox and\n> > figuring out where to nip and tuck..  I like the Xulrunner plus\n> > PyXpcom approach as it would allow others to write Xul apps rather\n> > than use py/GTK which is probably too low level for many \"Activity\"\n> > developers..\n> \n> I think my mention of Firefox may have just been a subconscious threat \n> ;) -- the advantage of it is more in things like a clear extension \n> mechanism, and we need to extend the browser in *some* way.\n> \n> Even if PyXPCOM isn't terribly well documented and hard to build, that \n> doesn't seem like a blocker in itself.  At least in theory, we just have \n> to get it to build once or twice (or however many build systems there \n> are -- I guess there's two).  Actually having extension in Python will \n> make it a lot more accessible to many of the people who would actually \n> like to work on it now, since they are pretty much all familiar with \n> Python.\n> \n> But despite the fact that this seems like a good direction, it hasn't \n> happened yet because the setup is rather complex (as mentioned by you \n> and several other people).  Probably just reaching the level of Hello \n> World with PyXPCOM in the OLPC environment would be the biggest hurdle \n> (or at least from there there would be much more satisfying work to be \n> done).  Could you help get us to that point?\n\nGetting an hello world to work is probably not very complicated, there\nare even tutorials online.\n\nWhat we need to do for pyxpcom to be actually useful is to bridge it to\ngtkmozembed. In particular we need to be able to access nsIWebBrowser,\nwhich gtkmozembed exposes, as a python object. Someone in the epiphany\nteam might be able to give some guidance on this too.\n\nMarco\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}