{"category": "spam", "to_address": null, "from_address": "\"maryg10005@terra.es\" <maryg10005@terra.es>", "subject": "READ MY FAVORABLE BUSINESS OFFER!!", "body": "FROM: JAMES GEORGE.\nTEL: 01134 600 374 412.\n \nDear Good Friend,\nHow are you today? Hope you are doing great? I decided to write you because I have no other alternative since after the death of my father in the hands of the bad government of my country. It has been very difficult for me on how to safeguard box money my late father left for me with United Nations storage department New York before his death. My late father packaged this money inside a box as family artifact. So right I want you to act as the new beneficiary on my behalf and claim box of money. I will give you 30% of the total money. \n \nMy name is James George from Darfur Sudan in Africa. I and my mother and my two duaghters are presently in Spain in the Europe as an asylum seeker under Spanish Government. We fled out of my country after the bad government of my country killed my father due to my father was activist and opposition to the bad government of my country. \n \nSo if you accept to assist me claim the box of money out from United Nations storage department New York, please reply me back with your full name and your mailing address with your company name if you have, also include your home phone number and cell phone number when you are replying for easy communication. I will give you entire necessary documents to back you up, to enable you claim the box of money legally. Note the diplomat in charge of my box of money at United Nations storage department does not know that the box in their position contains money; therefore do not tell them when you start communicating with them. \n \nLastly if you claim the consignment and deposit the funds to checking account, we will then come over to your country to live for the rest of our life, and most importantly to invest our own share of the money in your country and for my duaghter to continue their Education. I am waiting eagerly to hear from you, God bless you and your family. \n \nSincerely,\nJames George.  \n\n\nAhora también puedes acceder a tu correo Terra desde el móvil.\nInfórmate pinchando aquí.\n"}