{"category": "ham", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "The Paceline <info@thepaceline.com>", "subject": "June Paceline Newsletter", "body": "\n\nJune Paceline Newsletter\n\nThis message contains graphics.  If you do not see the graphics, click here to view.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tA look at DC's 19 wins to date* in 2007:\nTour of California (3 wins): 2 stages and Levi Leipheimer GC triumph\nValencia (1): Alberto Contador stage win\nParis-Nice (4): 3 stages and Contador GC\nCastilla Leon (2): 1 stage and Contador GC\nDePanne (1): Stijn Devolder TT victory\nGeorgia (4): 3 stages and Brajkovic GC\nCatalunya (1): Allan Davis stage win\nBelgium (2): Gusev TT and GC wins\nSwitzerland (1): Gusev\n* - Through June 22\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStarting at the 2007 Tour de France, Mio Technology Europe -- one of the leading players in the mobile GPS industry -- is joining the Discovery Channel Pro Cycling sponsor family as the team's Official Personal Navigation Device.\n  \n\"Mio Technology supports the spirit of competition and is enthusiastic to be backing the impressive Discovery Channel Pro Cycling Team, which has proven itself time and time again,\" says Paul Notteboom, president of Mio Technology. Each of the 20 Team Cars following and taking care of the cycling team will be equipped with a Mio navigation device for the entire duration of the cycling season. Mio is making its mark both in delivering the team members and staff safely to their destinations worldwide, and via logo exposure on the team jersey as well.\nRead More\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAs Lance says, \"Eki is nails.\" Our Cathy Mehl catches up with pro peloton legend and current team director, Viatcheslav \"Eki\" Ekimov.\nRead More\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tWorkhorse Pavel Padrnos leads the Discovery Channel Challenge, which has raised more than $11,000 to benefit the Lance Armstrong Foundation.\nRead More\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tThe 2007 Tour de France is right around the corner and P.J. Rabice, Discovery Channel Pro Cycling communications director, will return shortly to be with the team as it makes final pre-Tour fine-tuning.\n\nSend him your team-, race- and/or cycling-specific inquiries, and he'll address them as the team enters final preparations for July and the 2007 Tour de France.\n\nSend brief questions to: pjdelivers@thepaceline.com\n\nRead More\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMerckx won 525 races; Lance stood atop the Tour podium seven times.\nBut they didn't have 1.3 billion potential fans. Meet the man who might just become the world's biggest cycling superstar.\nRead More\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tThanks to our partner Cycling.TV, and to our Paceline sponsors, effective immediately PacelineTV is now free, 24 hours a day, 7 days a week. Our sincere thanks to all for your continued support to the Discovery Channel Pro Cycling Team and ThePaceline.com! \nRead More\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nclick here to unsubscribe ¦ click here to subscribe\n\n\nCSE ¦ PO Box 42106 ¦ Austin, Texas 78704-0036\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}