{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "\"All Politics\" <mailings@mail.cnn.com>", "subject": "Politics E-Wire", "body": "\n\n\n\n\nCNN.com - Politics\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonday, April 30, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSenate OKs Iraq bill with pullout timetable\nSenators followed the lead of their defiant counterparts in the House on Thursday, passing a war-funding bill that sets a deadline for withdrawing combat forces from Iraq by next year and sets up a showdown with President Bush.\nFULL STORY\n\n•  Democrats, GOP look past Bush veto\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Situation Room, weekdays 4 p.m. & 7 p.m. ET\nWatch \"The Situation Room,\" anchored by Wolf Blitzer, for complete, up-to-the minute coverage of the day's events. Tune in to \"The Situation Room\" weekdays from 4 to 6 p.m. and from 7 to 8 p.m. ET.\n\nFor a daily sneak preview of the show and an early read on the day's political news sign up for \"The Situation Room\" daily email newsletter at http://www.CNN.com/situationroom.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCheney, Reid trade barbs over Iraq\nVice President Dick Cheney accused Senate Majority Leader Harry Reid of pursuing a defeatist strategy in Iraq to win votes. Reid said that didn't warrant a response.\nFULL STORY\n\n\n\n\n\n\nGonzales vows to stay on\nAlberto Gonzales, with a fresh vote of confidence from President Bush, vowed to remain as attorney general despite lingering questions over the firing of prosecutors.\nFULL STORY\n\n\n\n\n\n\nTenet: 'Slam dunk' comment distorted\nA former U.S. spy chief accused the White House of ruining his reputation by misusing a comment he made during a meeting ahead of the U.S.-led invasion of Iraq.\nFULL STORY\n\n\n\n\n\n\nNo blood, few jabs in first debate \nNo blood was spilled in the first debate in the 2008 presidential campaign and CNN's Candy Crowley says you had to listen hard for low-impact jabs.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the CNN AllPolitics E-Wire email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}