{"category": "ham", "to_address": "\"Shriramana Sharma\" <samjnaa@gmail.com>", "from_address": "ajdlinux@gmail.com", "subject": "Re: \"all rights reserved\" and GPL", "body": "On 6/28/07, Shriramana Sharma  wrote:\n> Hello. In the license header of a source file being licensed under the\n> GPL, there must be a copyright notice. Sometimes I see the usage of \"All\n> rights reserved\" in that notice:\n>\n> // Copyright (C) 2007, Company X. All rights reserved.\n>\n> 1) Is the usage of \"All rights reserved\" appropriate when a file is\n> being licensed under the GPL, or in fact under whatever license?\n>\n> 2) What is the purpose of its usage?\n>\n> 3) If it is that the licensor wants to say: \"Any rights I have not\n> explicitly given you, you do not have\"?\n>\n> 4) If so, would it not be necessary, strictly speaking, to say so, i.e.\n> \"All rights regarding this work, unless explicitly granted to the\n> licensee, are reserved by the licensor\"? \"All rights reserved\" seems to\n> be inappropriate, if not incorrect, when in fact all rights are *not*\n> reserved.\n>\n> 5) Is it *advisable* to use such a terminology in a copyright statement\n> in a file licensed under the GPL?\n\n\n\"The requirement to add a notice became obsolete and essentially\ndeprecated on August 23, 2000, as every country that was a member of\nthe Buenos Aires Convention (which is the only copyright treaty\nrequiring this notice to be used) is also a member of the Berne\nConvention which requires protection be granted without any formality\nof notice of copyright.\"\n\nAll rights reserved has pretty much no legal effect now.\n\n\n-- \nAndrew Donnellan <><\najdlinuxATgmailDOTcom (primary)    ajdlinuxATexemailDOTcomDOTau (secure)\n     http://andrewdonnellan.com    http://ajdlinux.wordpress.com\n         ajdlinux@jabber.org.au    hkp://subkeys.pgp.net 0x5D4C0C58\n            http://linux.org.au    http://debian.org\n        Spammers only === ajdspambucket@exemail.com.au ===\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}