{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Rosie Putnam\" <tyccellumtlsal@cellumtl.com>", "subject": "Anatrim will change your life", "body": "\nGet out of the obese crowd\n\n\n\n\n\n\nAnatrim – The latest and most attracting flesh loss product is now easily available – As were seen on CNN.\n\n\nCan you recall all the times when you appeal to yourself to do any thing for being rescued from this fastly growing pounds of fat? Luckily, now no great price is to be paid. Thanks to Anatrim, the ground-breaking kilos-melting mixture, you can achieve healthier life style and become really slimmer. Take a look at what people state!\n\n\n\n\"I hate to admit it but I was awfully addicted to food. \n\n\nI greedily devoured all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis ruinous passion stopped when I started taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite disappeared, \n\n\nspirits improved and I became the happiest person 17 pounds in 2.8 months. \n\n\n\n\nI can tell you now I became the happiest person!\"\n\n\n\n\n\nSilvia D., Bellevue WA\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nIt’s difficult to imagine how I detested being mocked at school. \n\n\n\n\nI detested my weight and I abhorred even myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nThis stuff literally pulled me out of this fearful nightmare! Thanks and thanks to you, my friends.\"\n\n\n\n\n\nCharley Mock, New York\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was saved! I got into this circle, depression – more eating – more depression. My wife had thought to leave the overweight psycho I was turning in. \n\n\nOne of my friends pointed to your site and I asked for my pack of Anatrim immediately. \n\n\nThe final result was magnficent, my appetite became normal, I was in good spirits oftener, and, of course, I went some belt holes back. And the sex became fantastic, too!\"\n\n\n\n\n\nFrank\n\n\n\n\n There is a lot of sincere gratitudes delighted people leave after taking Anatrim. Why don't you add yourself to the tens of thousands of slim customers and take this natural appetite abating power boosting product now!\n\n\nDo not decline the chance!\n\n\n\n\n"}