{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nThursday, 28 June, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nReal Madrid sack manager Capello\nFabio Capello is fired, just over a week after guiding Real Madrid to their first Spanish League title since 2003.\n\n\n\n \nSpurs set to snap up striker Bent\nSpurs are set to announce the signing of England striker Darren Bent from Charlton, BBC Sport understands.\n\n\n\n \nSissoko signs new Liverpool deal\nLiverpool midfielder Mohamed Sissoko has signed a new four-year contract at Anfield.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nFrench Open leaderboard\nThe first round is under way at the European Tour's French Open in Paris.\n\n\n\n \nMonty keen to silence his critics\nColin Montgomerie wants to prove his critics wrong by claiming a tour win before the Open begins in three weeks.\n\n\n\n \nIllness hampers Van de Velde bid\nJean van de Velde is battling a mystery illness which is threatening to undermine his chances of qualifying for next month's Open.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nHamilton confident for French GP\nLewis Hamilton says he has the momentum to clinch his third straight win at the French Grand Prix this weekend.\n\n\n\n \nKubica fit to race in French GP\nBMW Sauber's Robert Kubica will return at the French Grand Prix following a 180mph crash in Canada.\n\n\n\n \nRookie Kovalainen stays positive\nRenault driver Heikki Kovalainen says he never doubted his ability despite a slow start to his Formula One career.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nHamilton confident for French GP\nLewis Hamilton says he has the momentum to clinch his third straight win at the French Grand Prix this weekend.\n\n\n\n \nRookie Kovalainen stays positive\nRenault driver Heikki Kovalainen says he never doubted his ability despite a slow start to his Formula One career.\n\n\n\n \nKubica fit to race in French GP\nBMW Sauber's Robert Kubica will return at the French Grand Prix following a 180mph crash in Canada.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nPistorius to take on Olympic king\nDouble amputee Oscar \"Blade Runner\" Pistorius will race against Olympic 400m champion Jeremy Wariner in Sheffield in July.\n\n\n\n \nPickering continues winning run\nCraig Pickering maintains his superb run of recent form by winning the 100m at the Ostrava Grand Prix on Wednesday.\n\n\n\n \nGay to take on Don Valley clock\nThis season's fastest man, Tyson Gay, is lined up for the Norwich Union Grand Prix in Sheffield.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nKessler suspended by Team Astana\nGerman rider Matthias Kessler is suspended by his team after testing positive for excessive levels of testosterone.\n\n\n\n \nPetacchi protests his innocence\nAlessandro Petacchi denies doing \"anything illegal\" after returning a \"non-negative\" test for salbutamol at this year's Giro.\n\n\n\n \nWeather forces race postponement\nThe British Road Race Championships, due to be held in Yorkshire, are called off because of the weather.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nZombie Brown's alternative Cabinet\nRobbo picks the sporting icons who could do a job\n\n\n\n \nColin Montgomerie talks to Chris Evans\nColin Montgomerie tells Chris Evans about his quest for a major win at Carnoustie and the search for a new caddie. Evans and sidekick Jonny Saunders have a different sporting guest on their Radio 2 show every evening.\n\n\n\n \nQuotes of the Week\nThierry Henry is gunning for Barcelona, plus Jose Mourinho gets fruity\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}