{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] Bangkok Post interview with US Ambassador to Thailand", "body": "http://www.bangkokpost.com/News/22May2007_news18.php\n\nUS ENVOY WANTS TO HEAL RIFT\n\nBangkok Post\nMay 22, 2007\n\nThailand's issuing of compulsory licences to bypass patents on Aids and\nheart drugs has rattled the multi-billion dollar pharmaceuticals\nbusiness. The country has been closely watched, particularly by American\nfirms holding patents, and by the US administration.\n\nUS ambassador to Thailand Ralph Boyce reflected on the issue in an\ninterview with Apiradee Treerutkuarkul. Following are excerpts from the\ninterview.\n\nWhat is the US view of Thailand's announcement of compulsory licensing\n(CL)? We understand Thailand's rights under Trips [the agreement on\nTrade-Related Aspects of Intellectual Property Rights] to use compulsory\nlicensing. But it was meant to be the last measure. As far as the\nembassy is concerned, in terms of transparency, we did not have much\nadvance notice at all that Thailand was going to go ahead with\ncompulsory licensing. The public health minister said publicly that\nThailand had tried to get drug companies' attention for two years. That\nis the minister's statement, but all I can say is that we at the embassy\ndid not have any real warning that it was coming. And the spirit of the\nTrips agreement is that a compulsory licence is like the last option,\nand the preferred order of things is the country and the drug companies\n[first] try to negotiate a mutually acceptable price. Our preferred\noutcome [for the] US government is that Abbott [Laboratories] and the\nMinistry of Public Health come up with a mutually acceptable price,\nbecause the key here is finding the balance between the high cost of\nfinancing innovation and next-generation drugs and the need to be able\nto provide those drugs to poor people who are suffering from\nlife-threatening diseases. Compulsory licensing is one way to do that,\nbut it is hopefully the measure you use [after] trying everything else\nfirst.\n\nWhy was there doubt over the transparency of the process in the latest\nspecial 301 report of the Office of the US Trade Representative?\n\nAs for the special 301 report in which Thailand has been elevated to the\nPriority Watch List (PWL), what I want to make clear is that the\ndecision was based on the whole spectrum of intellectual property rights\n(IPR), not just on the CL issue. In fact, the CL issue was just one\namong many concerns ranging from DVDs, music CDs, books, software and\nbrand-name apparel. Had there not been a flap about CL, I suspect that\nThailand would have been elevated to the PWL anyway because we have been\nhearing from both Thai and American intellectual property rights holders\nin Thailand that the situation in terms of enforcement has been getting\nworse. The flap over CL caused most people to conclude that it must be a\nform of retaliation. It is a timing issue more than anything. I believe\nthat with the overall IPR problems in Thailand, even without CL there\nstill would have been a decision [to put Thailand on the] PWL.\n\nWhat is the stance of the US on balancing protection of intellectual\nproperty rights and humanitarian needs, especially on the issue of\naccess to drugs in developing countries, including Thailand?\n\nFrankly, there are extreme views on both sides. We all know about some\nof the publications like the Adelman article [in the Washington Times]\nin the US. Some charges and allegations have been made against the\npharmaceuticals industry here.\n\nAs usual, the truth lies somewhere in-between ... The humanitarian\nissues are important and the Clinton Foundation's announcement that it\nwould create a stockpile of drugs for 16 countries including Thailand,\nwhere they could make available expensive drugs for the poor, is a good\nexample of creativity that is very useful in finding that balance,\nbecause the companies have to spend massive amounts of money to create\nan innovation and come up with new drugs to help people who need them.\nAre they supposed to bear the full burden? Are their stock holders\nsupposed to bear the whole burden of the cost of the research, etc?\nThere is an issue of subsidies, and whether some of the medicines should\nbe subsidised by the governments of the countries. So there are a lot of\ndifferent ways to do this, rather than looking at it in just black and\nwhite.\n\nYou also had an opportunity to bring pharmaceutical companies to meet\nthe public health minister? What was that all about?\n\nThe role of the US government is to try to facilitate conversation and\nnegotiation, striking the balance, suggesting creative ideas, etc. The\nonly thing the embassy was doing in bringing some of the pharmaceutical\ncompanies to meet the previous minister [Phinij Jarusombat] was\nproviding the opportunity for the ministry to hear from the companies.\nThe role of the embassy was not advocacy on that particular issue, but\nsimply door-opening. We do this for a number of ministers and a number\nof different sectors.\n\nFacilitation of communication between American companies and the Royal\nThai Government in every sector is one of the most important roles of\nthe embassy. The more conversations and communication the better, as far\nas I am concerned.\n\nDo you think Thailand is doing enough in trying to communicate with\nWashington?\n\nThis issue has become such a hot, emotionally-charged issue. I certainly\nunderstand why that is, on both the Thai and the US sides. But [we\nshould] get away from the emotion and back towards the communication and\ntry to work together, which Thailand and the US have a great track\nrecord of doing for decades. It's important to recall that for the\nUnited States, some of our most emotional arguments are with our best\nfriends, usually over trade issues.\n\nWith either Japan or the EU, we have had some of the most challenging\nproblems with our closest friends over trade issues. That's because when\nwe get into a relationship, [it becomes] very sophisticated and\ncomplicated. This issue has captured people's attention because it is so\nrare for the US and Thailand to have a big flap. It's unusual.\n\nWhat is your view of the recent advertisement by USA for Innovation\nagainst the Thai policy on compulsory licensing?\n\nI would like to distance the US government from this organisation, which\nmost people had never heard of before. The content of the\n[advertisement] is insulting in many ways. It does not reflect the\ngovernment's view. I was surprised when I saw the advert in the\nnewspaper. The letter uses extremely strong words and made several\naccusations that certainly the US government does not agree with.\n\nWhat are the details of any plan of action?\n\nFirst of all, we don't have any plan of action ... The approach we are\ngoing to take is to sit down with the Commerce Ministry and discuss ways\nto get Thailand off the Priority Watch List, not hand a list of demands.\nThis is going to be about mutually exploring how to better enforce the\nexisting laws, and how the US might be able to provide any indoor\nequipment to facilitate that process.\n\nHow is the US going to follow up on Thailand's public health policy on\ncompulsory licensing?\n\nWe hope to get in close touch with the Public Health Ministry in the new\nyear, after the election. We are looking forward to meeting Dr Mongkol\nafter meetings in Geneva and Washington. I think it is safe for both\nsides to strive to find ways to avoid having any more compulsory\nlicences. We can't go back and undo what has already been declared. In a\ncouple of cases, they haven't actually imported generic drugs yet and\nthey're still talking with drug companies. So we want to encourage\ninformal talks to avoid formal announcements\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}