{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Zoe Poole <ark@grandarabian.com>", "subject": "Worry about your erection?", "body": "\n\nGoing to have sex with two ladies at the same time? You need a strong erection, or they will have to satisfy each other. You really need Viagra!\nOur pharmacy\nWe have only high-quality national medications at low prices. There is no need for someone to know about your sexual problems. \nGo to the site\nAbsolutely confidential and secure purchase.\nWith best regards,\nZoe Poole\n \n \nEgo guby slozhilis v zhestkoj usmeshke. Ego Nezachem nosit s soboj, chtoby oshchushchat ego silu. Eshche nemnogo, v beznadezhnom otchaianii bilas mysl, i eta tvar pokonchit so Mnoj odnim udarom. Poiavivshis zdes posle teleportacii i sleduia instinktu samosohraneniia, ia oshchupal Tolko ledianoe piatno. \nPobedit Zdes nevozmozhno. Ia reshil nachat s tebia i Dolzhen byl ubit srazu, no. Nevolno Vspomnilsia razgovor, sostoiavshijsia mezhdu mnoj i Kvinom zdes vsego chas nazad, Vspomnilsia doslovno: Ty sam-to ponial, chto proizoshlo? sprosil ia ego, kogda my ostanovilis Naprotiv etogo tunnelia, rastiagivaia mig pered tem, kak vojti. Na etu temu po Federacii guliala celaia Kucha borodatyh anekdotov, nastolko izbityh, chto oni uzhe schitalis Klassikoj, i dostatochno bylo proiznesti paru pervyh slov liubogo iz nih, Chtoby vyzvat u sobesednika ponimaiushchuiu uhmylku. A zatem skvoz rastopyrennye palcy ugliadel kakuiu-to vozvyshavshuiusia Nad zemlej i lesom temnuiu massu, medlenno vyrastavshuiu vperedi, v kotoroj, Prishchurivshis, daleko ne srazu raspoznal to, chem ona iavlialas. Ton, kakim eto bylo skazano, govoril ob obratnom. Ia otkrovenno skuchal po etomu Ogromnomu zubastomu parniu, svoim vidom napominavshemu gigantskuiu letuchuiu mysh, Nauchivshuiusia rashazhivat na zadnih lap!\nah, skuchal dazhe po ego vechno shokiruiushchej Ulybke, polnoj oranzhevyh pilovidnyh klykov, sposobnoj ispugat i mertveca, po Ego melodichnomu golosu, porazitelno bogatomu teplymi obertonami i chastenko Vydavavshemu sovsem nemuzykalnye vyrazheniia. Mertvee ne byvaet! Kvina priamo zatriaslo. \nBigman poperhnulsia i umolk, ne zakonchiv. Mag vdrug vybrosil ruki ladoniami vpered, slovno rezko ottolknul chto-to ot Sebia, i chto-to temnoe vyrvalos iz ladonej. Desiatki Vityh kristallicheskih zhal vpilis v telo Nori, probivaia naskvoz bedra, Zhivot, grud, vyshli iz gorla. U moria pogody, navernoe. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}