{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "2p 6/8 Update; Shuttle fueled for flight", "body": "\n\n\n\n\n2p 6/8 Update; Shuttle fueled for flight\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 25\nPosted: 1:58 PM, 6/8/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-23 (06/07/07): Weather improves to 80 percent 'go'\n   SR-24 (06/08/07): Shuttle Atlantis fueled for launch; weather 80 percent 'go'\n   SR-25 (06/08/07): Fueling complete; ECO sensors working normally; crew in final preparations\n\n=================================\n\n1:58 PM, 6/8/07, Update: Shuttle Atlantis fueled for flight; ECO sensors in good shape; crew preparing for launch\n\nThe shuttle Atlantis' external tank has been loaded with a half-million gallons of liquid oxygen and hydrogen rocket fuel. Engine cutoff sensors at the bottom of the hydrogen tank are operating normally and the launch team isn't working any significant technical issues.\n\nForecasters continue to expect good weather, saying they expect an afternoon sea breeze to set up as the day wears on, pushing clouds and showers away to the west. The five-minute \"in-plane\" launch window opens at 7:38:04 p.m.\n\n\"To go on the data, which I like to do, then you've got to be optimistic about launch,\" said NASA Administrator MIchael Griffin. \"The weather guys are saying 20 percent no-go, so 80 percent go, which is about as good as you're going to do around here this time of year and that time of day. So that's terrific. They're not working anything on the vehicle. Things can always come up ... but right now, I'm optimistic.\"\n\nIn a brief photo opportunity, commander Rick Sturckow, pilot Lee Archambault, flight engineer Steve Swanson, Patrick Forrester, Danny Olivas, Jim Reilly and space station astronaut Clay Anderson were relaxed and smiling as they sat around a dining table in crew quarters.\n\nThey plan to don their bulky pressure suits shortly and to head for launch pad 39A around 3:47 p.m. to strap in for launch.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}