{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Esmeralda Ackerman\" <laxcridecvew@cridec.com>", "subject": "Melt away fat easily", "body": "\nBecome fit and happy again\n\n\n\n\n\n\nAnatrim – The newest and most attracting product for over-weight people available – As told on CNN.\n\n\nCan you count up all the cases when you said to yourself you would do any thing for being delivered from this desperately growing number of kilos? Luckily, now no great price is to be paid. Thanks to Anatrim, the ground-shaking pound-melting medley, you can get naturally health life style and become really slimmer. Have a look at what our customers say!\n\n\n\n\"I hate to admit it but I was an awful food addict. \n\n\nI swallowed up all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis ruinous passion ceased when I started course of taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my inclination to eat constantly abated, \n\n\nmood increased and I turned to the happiest person 28 pounds in 2.7 months. \n\n\n\n\nI can tell you now I’m the happiest person in the world!\"\n\n\n\n\n\nSilvia D., Boston\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nYou can't imagine how I abhorred being derided at school. \n\n\n\n\nI abhorred my weight and I hated even myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nThis stuff literally pulled me out of this fearful nightmare! Thanks and thanks to you, fellows.\"\n\n\n\n\n\nCharley Mock, Chicago\n\n\n\n\n\n\"Do you know what? Anatrim saved my marriage! I got into this circle, depression – eating more – more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nOnce my friend pointed to your web page and I ordered Anatrim right away. \n\n\nThe result was excellent, my appetite came to normal level, I was in good spirits oftener, and, of course, I became able to tighten my belt on some holes. And you know, the bedroom became cool also!\"\n\n\n\n\n\nDave\n\n\n\n\n There are lots of sincere gratitudes happy people leave after trying Anatrim. Don’t you gonna join the thousands and thousands of slim men and women and take this all-natural appetite reducing power boosting product now!\n\n\nDon’t lose your chance!\n\n\n\n\n"}