{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nSunday, 29 April, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nAllardyce resigns as Bolton boss\nSam Allardyce has stepped down as manager of Bolton with immediate effect.\n\n\n\n \nBirmingham & Sunderland promoted\nDerby's defeat by Crystal Palace confirms Birmingham and Sunderland's promotion to the Premiership.\n\n\n\n \nArsenal 3-1 Fulham\nFulham remain a point above the Premiership relegation zone after losing out to two late Arsenal goals.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nSchwartzel claims title in Madrid\nEnglish duo Simon Dyson and Mark Foster have to settle for joint-fourth as South African Charl Schwartzel wins the Spanish Open in Madrid.\n\n\n\n \nByron Nelson leaderboard\nLeading scores from the Byron Nelson Championship.\n\n\n\n \nDonald clings on to lead in Texas\nBritain's Luke Donald retains his one-shot lead after the third round of the Byron Nelson Championship.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nToseland extends lead in Holland\nJames Toseland stretches his World Superbikes championship lead with a win and second place at the Dutch Grand Prix.\n\n\n\n \nButton 'wants to stay at Honda'\nJenson Button has no plans to leave struggling F1 team Honda, according to his manager.\n\n\n\n \nToyota team boss will stand down\nToyota team boss Tsutomu Tomita will stand down at the end of June and be replaced by Tadashi Yamashina.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nButton 'wants to stay at Honda'\nJenson Button has no plans to leave struggling F1 team Honda, according to his manager.\n\n\n\n \nToyota team boss will stand down\nToyota team boss Tsutomu Tomita will stand down at the end of June and be replaced by Tadashi Yamashina.\n\n\n\n \nRaikkonen urged to get technical\nKimi Raikkonen's former team boss hints the Finn could be even better if he paid more attention to his role outside the car.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nRadcliffe not in GB marathon team\nGB's marathon team for the World Athletics Championships is named but does not include Paula Radcliffe at this stage.\n\n\n\n \nYamauchi voices Osaka heat fears\nMara Yamauchi warns conditions in Osaka at the World Athletics Championships will be even tougher than during the London Marathon.\n\n\n\n \nRunner dies after London Marathon\nA 22-year-old runner who was taken ill after completing the London Marathon dies in hospital.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nWiggins welcomes Basso suspension\nBritish star Bradley Wiggins says the decision to suspend Ivan Basso is \"good news for cycling\".\n\n\n\n \nCooke misses out on Belgian win\nNicole Cooke loses out to main rival Marianne Vos in the Belgian stage of the World Cup, the Fleche Wallonne.\n\n\n\n \nTour of Britain route is revealed\nOrganisers unveil the route for this year's Tour of Britain, which will begin in London on Sunday, 9 September.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nHolloway column\n\"Alan Ball threw me the keys to his Merc and said: 'Come on, find us a caff'\"\n\n\n\n \nReview of the week\nMourinho comes out of the laundry basket and says what he thinks\n\n\n\n \nComment: Rooney steals the show\nRobbo says Wayne Rooney turned in the display of the week\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}