{"category": "spam", "to_address": "captains@flax24.uwaterloo.ca", "from_address": "\"Hubert Blake\" <cijemazarinejaq@emazarine.com>", "subject": "Stop being obese and unhappy", "body": "\nJoin the thousands of people who got slim\n\n\n\n\n\n\nAnatrim – The very up-to-date and most delighting product for over-weight people is now readily available – As you could see on BBC.\n\n\nCan you remember all the cases when you told yourself you would do any thing for being delivered from this desperately growing pounds of fat? Fortunately, now no major price is to be paid. With Anatrim, the ground-shaking weight-reducing medley, you can achieve healthier life style and a really slender figure. Have a look at what people say!\n\n\n\n\"I hate to acknowledge it but I was an awful food addict. \n\n\nI swallowed up all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis ruinous passion finished when I started course with Anatrim! \n\n\nGod,\n\n\n\n\n my craving for food disappeared, \n\n\nmood increased and I became the happiest person 19 pounds in 2.8 months. \n\n\n\n\nI can tell you now I became the happiest person!\"\n\n\n\n\n\nVictoria K., New York\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nIt’s pretty hard to imagine how I abhorred being ridiculed at school. \n\n\n\n\nI hated my stoutness and I detested even myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nIt literally took me out of this nightmare! Thanks and thanks to you, guys.\"\n\n\n\n\n\nDave Klark, New York\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was saved! I fell down into the circle, depression – eating more – even more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOnce my friend showed me web site and I ordered Anatrim as soon as it was possible. \n\n\nThe result was excellent, my appetite came to acceptable level, I was often in a good mood, and, of course, I became able to tighten my belt on some holes. And the bedroom became cool also!\"\n\n\n\n\n\nCharley\n\n\n\n\n There is a lot of testimonials delighted people leave after taking Anatrim. Why don't you add yourself to the tens of thousands of slim people and try this natural appetite-suppressing energy raising product now!\n\n\nDon’t decline your opportunity!\n\n\n\n\n"}