{"category": "spam", "to_address": "<ktwarwic@flax24.uwaterloo.ca>", "from_address": "\"The Bull Report\" <news@thebullreport.com>", "subject": "News updates on MBKR... Short position revealed", "body": "    To view this email as a web page, go    here.     \n\n\nThe Bull ReportMay 3rd, 2007\nMortgageBrokers.com Holdings, Inc. Receives ''Speculative Buy'' Rating from Analyst Howard N. Stillman\nSPECULATIVE BUY\nMORTGAGE BROKERS.COM\nOTCBB SYMBOL: MBKR\nSUMMARY & CONCLUSION\n\nMortgageBrokers.com (OTCBB: MBKR) has successfully launched its mortgage brokerage services operation getting excellent early results from its innovative business model. Initially conducting business in Canada, it attained annual revenues of $4 million for 2006. This was accomplished while management was just implementing strong broker affiliations with RE/MAX Ontario-Atlantic Canada Inc. and Maxwell Realty. Furthermore, it has set the stage to participate in all North American regions and the European Union. The Canadian real estate market has experienced record home sale activities in recent years and expected to maintain an annual pace moderately below the new sales peaks\n achieved of over 200,000 new housing starts and in excess of 460,000 residential re-sales. Moreover, company plans to carve out a larger share of the mortgage origination market are underway. This factor, along with unique marketing programs, high technology internal support efforts and strong mortgage connections with financial institutions bodes well for rapid future growth.\nRead the full release\nBUYINS.NET: MortgageBrokers.com, Inc. (MBKR) SqueezeTrigger Price is $1.52. Approximately 1 million Shares Shorted Since May 2005 According to Buyins.net Research Report\nBUYINS.NET, www.buyins.net, is initiating coverage of MortgageBrokers.com, Inc. (OTCBB: MBKR) after releasing the latest short sale data to April 2007. From May 2005 to April 2007 approximately 13.1 million total aggregate shares of MBKR have traded for a total dollar value of nearly $20 million. The total aggregate number of shares shorted in this time period is approximately 1 million shares. The MBKR SqueezeTrigger price of $1.52 is the volume weighted average short price of all short selling in MBKR. A short squeeze began when shares of MBKR closed above $1.52. To access SqueezeTrigger Prices ahead of potential short squeezes beginning, visit http://www.buyins.net.\n\nRead the full release\nMortgageBrokers.com Signs Revenue Licensing Agreements with 49 New Mortgage Brokerages since February 2007\n\nTORONTO--(BUSINESS WIRE)--MortgageBrokers.com, Inc. (OTC BB: MBKR - News) is pleased to announce that the Company has signed revenue licensing agreements with 49 mortgage brokerages and independent mortgage brokers between February and April of 2007 who will now operate under the universal domain name and brand of MortgageBrokers.com. The total mortgage origination production of these new affiliates is estimated to be in excess of CAD$862 million and the Company projects to capture up to an estimated CAD$8.6 million in gross revenues to be generated by these new affiliates. MortgageBrokers.com currently has 192 mortgage brokerages and independent mortgage brokers working under\n the MortgageBrokers.com umbrella and is receiving a record number of inquiries from prospective brokers.\n \nRead the full release\n\n\nAbout MortgageBrokers.comMortgageBrokers.com is an online lead generator and mortgage brand specializing in the mortgage brokerage sector. The Company is dedicated to re- branding the over 40,000 small and medium mortgage broker (SME) firms in North America while providing these entities scalability through a centralized, shared services platform. MortgageBrokers.com is designed to facilitate continued owners ship of these SME brokers while they work under the umbrella of one globally recognized brand.\n\nRead the full disclaimer Click here\n\n\n\n\n\n\n                                    This email was sent to:  ktwarwic@flax24.uwaterloo.ca\n\n\n\n\n                                                            This email was sent by: The Bull Report                                                                                                              \n                                                            1846 rosemeade 104 dallas, TX 75007 USA \n                                                            \n\n\n          \n                                    We respect your right to privacy - view our policy\n\n\n\n\n\n\n\n\n\nManage Subscriptions | \n                                    Update Profile | \n                                    One-Click Unsubscribe\n\n\n\n\n\n"}