{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nMonday, 04 June, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nGerrard & Carragher extend deals\nLiverpool duo Steven Gerrard and  Jamie Carragher agree new contracts which will run until 2011.\n\n\n\n \nAC Milan admit interest in Henry\nAC Milan coach Carlo Ancelotti confirms Arsenal striker Thierry Henry is among his transfer targets this summer.\n\n\n\n \nRanieri appointed Juventus coach\nClaudio Ranieri becomes the new coach of Juventus, dashing Manchester City's hopes of landing the Italian.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nClarke struggles in US qualifying\nDarren Clarke has a disappointing 75 in the first round of US Open qualifying.\n\n\n\n \nHowell targets US Open comeback\nDavid Howell says he will make his return from a back injury at this month's US Open.\n\n\n\n \nDredge pipped to Wales Open title\nSouth African Richard Sterne wins the Wales Open by a stroke from home favourite Bradley Dredge.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nMcGuinness triumphs in TT opener\nHonda rider John McGuinness claims his fourth straight Superbike victory at the Isle of Man TT on Monday.\n\n\n\n \nRea lands Donington MotoGP chance\nBritish Superbikes rider Jonathan Rea is given a MotoGP wildcard ride at the British Grand Prix.\n\n\n\n \nRossi claims sixth Italian GP win\nValentino Rossi wins the Italian MotoGP in Mugello for the sixth year in a row.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nValencia secures F1 street race\nValencia signs its contract to  host a Grand Prix around the Spanish city's streets from 2008.\n\n\n\n \nMcLaren cleared over Hamilton row\nMcLaren are cleared of any wrongdoing after an investigation into whether they illegally used team orders in the Monaco Grand Prix.\n\n\n\n \nStewart backs McLaren on Hamilton\nF1 great Sir Jackie Stewart says McLaren did the right thing in asking Fernando Alonso and Lewis Hamilton not to race in Monaco.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nPickering wins battle of Britain\nCraig Pickering wins the battle of the Brits as he storms home in the all-British 100m at the Glasgow Grand Prix.\n\n\n\n \nWeir leads strong British display\nDave Weir wins four races at the Swiss Open event in Ibach.\n\n\n\n \nGay misses out on sprint record\nTyson Gay wins the 100m in New York but is denied a world record as his run was wind-assisted.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nDi Luca seals home Giro victory\nDanilo di Luca ensures a home victory in the Giro d'Italia for the 11th year running as he cruises home in Milan.\n\n\n\n \nCooke finishes fifth in Montreal \nNicole Cooke maintains a healthy lead at the top of the World Cup standings despite coming fifth in Canada.\n\n\n\n \nDi Luca has sights on Giro prize\nItaly's Paolo Savoldelli wins the 20th stage of the Giro d'Italia, leaving Danilo di Luca almost certain to take the overall victory.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nComment: Time to rest Lampard\nRobbo believes Frank Lampard should be dropped by England\n\n\n\n \nReview of the week\nKieran Richardson's cousin on Big Brother as Ronaldo's mum spits feathers\n\n\n\n \nTen to Tackle\nTest your knowledge of the last seven days in sport\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}