{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Your Health Your Life \" <qa7cw9y7j@droporchid.com>", "subject": "One year FREE membership to Weight Watchers? ", "body": "\n\n\n  \n<!--WASHINGTON - A bipartisan immigration deal that would grant legal status to millions of people in the country unlawfully is drawing criticism from across the political spectrum. \n\nADVERTISEMENT\n \nThe bargain reached between key Democratic and Republican senators and the White House faces an uncertain future in the Senate, which is set to begin debating it Monday.\n\n\"I don't know if the immigration legislation is going to bear fruit and we're going to be able to pass it,\" said Senate Majority Leader Harry Reid (news, bio, voting record), D-Nev., who harbored \"serious concerns\" about the deal.\n\nEven if it were to survive what's certain to be a searing Senate battle, the measure would be up against long odds in the House. Speaker Nancy Pelosi (news, bio, voting record), D-Calif., acknowledging deep divisions on immigration among Democrats, says she won't bring it up unless        President Bush can guarantee he will produce 70 Republican backers — a tall order given GOP concerns that the bill is too lenient.\n\nThe agreement, which also mandates tougher border security and workplace enforcement, marked an extraordinary marriage of liberal and conservative goals that has the potential to bridge stubborn divides and ensure enactment of new laws this year.\n\nSen. Edward M. Kennedy, D-Mass., his party's lead negotiator on the deal, called it an example of the \"politics of the possible,\" while conservative Sen. Jon Kyl (news, bio, voting record), R-Ariz., said it was the \"best opportunity\" for a bipartisan solution to the nation's immigration problems.\n\nIt was soon under attack, however, from a set of lawmakers and interest groups as diverse as those that united to craft it. Their varying concerns and competing agendas — along with a challenging political environment — could be enough to unravel the painstakingly written agreement.\n\nTwo of the key players in the talks from each end of the political spectrum, Sen. Robert Menendez (news, bio, voting record), D-N.J., and Sen. John Cornyn (news, bio, voting record), R-Texas, walked away from the deal before it was announced.\n\nConservatives branded it \"amnesty,\" complaining that it would reward the nation's estimated 12 million illegal immigrants with a way of gaining legal status and staying in the U.S. permanently without being punished.\n\n\"What part of illegal does the Senate not understand? Any plan that rewards illegal behavior is amnesty,\" said Rep. Brian Bilbray (news, bio, voting record), R-Calif., chairman of the Immigration Reform Caucus.\n\nThe deal would allow illegal immigrants to come forward right away, but they could not get visas or begin a path to citizenship until the border security improvements and a high-tech worker identification program were in place.\n\nAfter that, illegal immigrants could obtain a renewable \"Z visa\" that would allow them stay in the country indefinitely. After paying fees and fines totaling $5,000, they could ultimately get on track for permanent residency, which could take between eight and 13 years. Heads of households would have to return to their home countries first.\n\nLiberals, on the other hand, are unhappy with the proposal because it makes a far-reaching change in the immigration system that would admit future arrivals seeking to put down roots in the U.S. based on their skills, education levels and job experience — limiting the importance of family ties.\n\n\"We have concerns about the historic shift away from family unification as the backbone of our immigration system,\" said Kevin Appleby of the U.S. Conference of Catholic Bishops.\n\nImmigrant advocacy and labor groups also oppose the terms of a new guest worker program in which low-skilled immigrants would be forced to leave the country after temporary stints and would have limited opportunities to stay and get on a path to permanent legalization.\n\n\"Without a real path to legalization, the program will exclude millions of workers and thus ensure that America will have two classes of workers, only one of which can exercise workplace rights,\" said John J. Sweeney, the AFL-CIO president.\n\nSen. Byron Dorgan (news, bio, voting record), D-N.D., announced Thursday that he will move to kill the guest worker program because it would hurt American workers\n--!>       \n\n\n\n"}