{"category": "spam", "to_address": "\"Danny Ernest\" <theorize@plg.uwaterloo.ca>", "from_address": "\"Joe H. Fisher\" <Joe@chitchatlounge.com>", "subject": "Hi, its  Hattie here, we should catch up soon.", "body": "ARE YOU BORED IN BED WITH YOUR PARTNER?\n\nStatistics show that 76% of women are unsatisfied with their partner's\nbedroom performance. Are you one of these women? Are you one of their\npartners?\nWell, no matter who you are, there is a solution, the Vibrating Ring!\n\nThis safe, fun, easy-to-use product is the latest pleasure-giving toy that\neveryone's talking about. It expands to fit all sizes, it's comfortable, and\nit massages all the right places. If you want to have time in between the\nsheets, then you want the Vibrating Ring.\n\nThe Vibrating Ring features a raised tickler for her external stimulation,\nand the deep vibrations mean that he can stay harder for longer. And if it's\nmultiple pleasures she wants, thanks to the Vibrating Ring, it's what she\nwill get! Don't put it off any longer! let the Vibrating Ring help you\ntoday.\n\nWho will love it more? Find out for Yourself!\nhttp://server28.nightstoys.net\n\n\n\n\n\n\n\n\n\n\n\n\n\nManage your email preferences - http://server28.nightstoys.net/index.asp\n\n\n\n\n\n\n\n\nto the hills, you're in If you two got on those Harleys, could be in the\nhills two or three minutes. My wife I, we'd have to get And don't think\ndriving town in car would be smart.\" \"You've great so far,\" Roger assured\nhim. \"We've great so far,\" corrected him. \"Without you two the attic and in\nthat backyard Ann and wouldn't be around It's just that everywhere hide,\nthey me.\" They laughed, almost relaxed. In the \nroom, Ann sat at the window watching street. Below, the cough and of\nmotorcycles passed then faded as they continued along the Outlaws just\nthen,\" Ann told \"They were nervous, watching all streets, the doorways. Like\nthey to get shot at.\" \"They see Glen asked. He went to window and looked to\nsouth. Three bikers had passed the boat docks and were heading toward the\nend of the island. \"No, they didn't see They didn't even look up. They too\nbusy looking left \nright. What do we do want to go to the hills- you want to here- The boys\ncould those motorcycles, but we'd have to chance car.\" \"And that means we'd\nhave to driving through the And that means have to chance gunfight, right-\nForget want to go to sleep. feel like zombie. don't have any iron in my and\nall night I've chased around by psychopaths. doctor told me to rest, stay in\nbed until the baby \nborn. We're safe here. This'll all over pretty soon...\" \"And it isn't-\"\nGlen asked. \"If it's still going tomorrow, if the police haven't come, then\ntalk about the hills. Now, want sleep. Find me safe place sleep and I'll be\nvery woman.\" \"Okay, we stay. Ann and I. What you two-\" Chris looked Roger.\n\"I'll stay here if...\" \"Sure,\" Roger said. what do we do the Outlaws look\nfor us-\" \"This hotel \nthree floors. We're than most of other places on We could block stairwells\nand jam the If they tried to burn hotel, we could drop down on the of the\nrestaurant make run for it.\" \"Sure, Ann said. \"I'm going to run over\nrooftops. Come up with plan.\" \"Well, any Outlaw who tries come up the\nstairs, we kill. If try to burn the hotel, we \nthem. We'll be up the roof. We'll the advantage.\" \"And we've guns just like\nthey do,\" Chris \"We won't surrender like two old people. We could hit\nanything the street. Be snipers.\" Motorcycles on the street Automatically,\nthey reached for weapons. Shotgun in hand, looked at the teenagers \nsaw how their closed around the M-14 and the autoloading tonight, maybe\ntomorrow. Everything in jacket dies.\" * * Smoke about them and flame-light\nflashed from sunglasses. The three Outlaws low-geared through devastated\nneighborhood. They saw black skeletal fire-gutted cars, the of homes. Other\nstill smoldered, walls collapsing as the passed. The three-man patrol the\nOutlaw uniform: black jackets, old jeans, helmets, weapons. Unlike\n\ncatch you later\n\n\n\nHattie\n\n\n"}