{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle and Bethea<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, I have important revelations about your immediate future...", "body": "\n\n\nMemo, I have important revelations about your immediate future...\n\n\n\n\n\n\n\n\n\n\n\n   \n\nMemo, the next 30 days could have important consequences in your near future!\nFind out right now:\n1) Which cards I've pulled,\n2) What they mean, and\n3) What they can bring you!\nDear Memo,\n    That's right -- the vibrations I'm sensing now are so strong, I pulled tarot cards. And what these cards taught me about the near future really intrigued me! \n    They confirm that the period between the First Quarter Moons, from May 23rd to June 22nd, could affect us a lot.\n    Judge for yourself, Memo!\n    Yes, it's true.  As always, I was thinking about you and current celestial energies, so I allowed myself to ask the cards these questions: \n\nIs everything going okay?\nAre the problems I've seen finally resolved?\n\n\n    When I ask these questions, it's not by chance. And if I ask these questions, it's because several days ago, I had an almost irresistible desire to pull the cards, and you know, Memo, I never do anything by accident.\n    I felt from the very depths of my being, that something exceptional was about to happen.  Something that could not be missed under any circumstance, something special.\n    So, I took my favorite deck and pulled the cards.  Believe me, Memo, I did well to listen to my sixth sense because the interpretation that I did enabled me to see that an exceptional period of 30 days would dramatically change the lives of a certain number of people, of which you may be a part...if you follow to the letter the simple advice that I will give you in a moment.\n    Since I'm a prudent person, I decided to consult the tarot cards a second time...not just to get confirmation of my first reading, but above all to find out if this beneficial period would offer something extraordinary.\n    And what these famous divinatory cards revealed to me about your immediate possibilities, really impressed me.  See for yourself!\nYour Cards of Luck\n    After making all necessary preparations and after concentrating for a long time, I pulled the tarot cards...exactly as I would if you were there, in front of me, in a personal consultation.  I pulled the cards and focused on their meaning.  I give you here what the cards showed me about what the future may bring you.\nATTENTION!\n    It's important to me to let you know that the cards I pulled on the whole were good cards.  However, we need to be cautious with certain cards, and I will explain the significance of this to you later in this letter.\nHERE ARE THE CARDS THAT I PULLED.\n    I'm sure you are wondering, \"What do these cards signify for me?\"  Are they good cards?  Or are they bad cards?  That's what we're going to find out for you now.\n\n\n\n\nYour Card #1: The Sun\n    Children playing and an enormous sun decorate this happiest of cards.  When I drew this for you, I whispered a silent thank you to the Universe.  All is well when the Sun appears in a reading and if you have been burdened with worries, especially about your finances, then you can breathe a huge sigh of relief as help is at hand.\n    Money is so often the cause of trouble, friction and disappointment but with the Sun as one of your cards, you can be sure that you are in for some kind of windfall or increase in your prosperity.  There are a variety sources where this extra money can come from during the 30 day lucky period so stay alert and aware and back your hunches.\n\n\nWith what I saw so far, in the preliminary reading, I really wanted to write you and tell you as much as I could...\n    But some active involvement by you will really help to make the picture complete.  Plus, I wanted to make sure to let you know that you have the power, right now, to bring out the very best possibilities and the greatest rewards the Empress card can signal for you.\n    In doing this, you can not only get answers to a good number of questions that are weighing on your mind...and that you are surely asking about your difficulties and existing problems, but above all, it can help you see what's ahead for you in your future, especially over the next 30 days.  And the cards can also tell you how to gain the greatest advantage from incredible opportunities as they present themselves to you.\nHere are some examples of the help the cards bring you.\n    You can find out things like:\n\n\nIf opportunities for generous money winnings are going to arise for you, and what you should be realistically hoping for;\nWhen you will meet your goal of paying off your debts and collecting money that is owed to you.\nIf your near future contains anything you need to watch out for and above all, how to avoid any pitfalls or obstacles in your path!\nIf love will finally find you and if it's the person who occupies your thoughts.\nIf you can finally look forward to getting everything in life that up until now has been unfairly refused to you: love, money, luck in everything and happiness beyond your wildest dreams. \n    Memo, you can finally begin to get answers on the subjects that cause you worry or bring you happiness by connecting with your own innate gifts of divination. Above all, I am happy to share with you my knowledge of this science, known as \"Cartomancy\" (the reading and interpretation of the tarot cards) so you can easily do this. Which brings us to the second card I will read for you...\n\n\n\n\nYour Card #2: Strength\n    Drawing Strength in a reading is a message that you must love and respect yourself.  It seems as though you may be going through a period of self doubt or perhaps even suffering a drop in confidence.  Perhaps you feel that the good luck and luxurious lifestyle that other folk enjoy has passed you by.\n    Well, that is not the case and although it is often said nothing is ever gained without a little effort in this life, right now you are poised to enjoy a period when the opportunities to make some wonderful gains will come to you.  All you have to do is believe that it is your turn to enjoy the kind of life that you deserve. \n\n\n\n\nSo that I can bring you more details and you can get the best outcome possible from each card reading, I want to offer you something absolutely indispensable.\n    With it, I can give you complementary information about these card readings.  I can then tell you, with greater exactitude, the influence that these cards may have on your future and also give you practical guidance on how to get the outcome that's absolutely ideal for you.\n    As I promised, I will now show you how we can use the cards together to bring you money, love, luck and happiness beyond your wildest dreams. \nTHE ORACLE CANDLE KIT\n    Like I've already told you, for us to continue together with this revealing journey, and to get the ideal outcomes that are in the cards for you, it's indispensable that you have these powerful tools and the secrets I will tell you.\n    You have a radiant personal power within you, and with your Oracle Candle Kit, you can charge up my tarot reading for you with positive energy...that will give you your best chance possible to get wealth, love, success, happiness...whatever you want the most.  With your Oracle Candle Kit, you will get:\n\n1. A Reading of the Tarot Cards for you\n    In this card reading, I will provide you with a complete interpretation of the cards pulled for you.  You will get the details on how the positive or negative potentials of each card will play out in your life -- your chances to gain wealth, personal power and luck or to encounter obstacles, setbacks and challenges. \n    Plus, I will give you practical guidance to help you avoid pitfalls that may hinder you, and I will tell you how to maximize your luck and bring in money, love and happiness.\n2. Instructions for Your Oracle Consultation Ceremony\n    Your Oracle Consultation Ceremony will unleash your radiant personal power, to help ensure the most generous and beneficial outcome that the Tarot Cards have in store for you.  I will provide you with easy-to-follow instructions for this ceremony.\n    Perform it in conjunction with the Tarot Card Readings I will give you, so you can channel overwhelmingly positive energy into your readings and empower the cards to transform your destiny.\n3. Your Oracle Candle with an embedded Sodalite\n    This large, round blue candle is central to your Tarot Reading and Oracle Consultation Ceremony.  But this is no ordinary candle!  Embedded within it is a genuine Sodalite, for you to keep and use after your Oracle Candle has melted around it.\n    Pure Sodalite possesses the remarkable ability to clear pollution and draw in only positive energy.  Sodalite is known to stimulate mental energy and intuition.  It allows you to release negative thought patterns that can hold you back and prevent you from achieving all that you want to.  Self-esteem and trust in your own judgment are boosted by Sodalite making it so much easier for you to fulfill goals and ambitions.\n    Use yours to harness the power of the Tarot Cards to speed the fulfillment of your wishes and dreams!\n4. Two Beeswax Spiral Wishing Candles\n    These unique candles are also extraordinary -- and like none you have ever seen before. They come as thin, flat squares of beeswax (the only natural existing wax on Earth) with a wick, which you can write on. Then just roll them up and light them to speed your wishes along the path to fulfillment.\n    These are special wishing candles because as a part of your Oracle Consultation Ceremony, you will write your wishes on these two candles so you can help to ensure that your reading and ceremony will bring your absolutely ideal outcome.\nAnd as my first FREE gift to you, I will give you3 Candle Holders and a Marking Pen\n    To make sure you'll have everything you need for your personal Tarot Readings and Oracle Consultation Ceremony, I am giving you 3 Candle Holders -- one large holder for your Blue Oracle Candle and 2 smaller holders for your Beeswax Spiral Wishing Candles.  These are my FREE gifts to you, as my way of thanking you for your friendship.\n    PLUS, I am providing you with a FREE Marking Pen, so you can easily write your wishes on your special Wishing Candles. But this marking pen that comes with your Oracle Candle Kit serves an even more important purpose.\n    As you may already know, writing is a powerful method for channeling energy, manifesting your will and transforming your destiny.  Writing on your Beeswax Spiral Wishing Candles will unleash the power of your dreams, almost like a magic spell! In this way, your Marking Pen will link you to the positive energy that will flow to you during your Tarot Reading and Oracle Consultation Ceremony and help you make your dreams and wishes come true.\nTo be prepared for the period of good fortune beginning May 23rd,we need to get started right away!\n    As soon as I hear from you, Memo, I will consult the tarot cards I've pulled for you and explain their meaning in detail.  All you have to do is click the button below, and I can get started right away...\n    And don't forget, my task does not limit itself to simply selecting the cards and telling you what they represent, but it also and above all consists of interpreting these cards to let you know what you can hope for or watch out for in your near future...and to give you all the useful advice you need to profit from the opportunities and avoid the problems that life will put in your path.\nAll of this and many other things will be revealed in thereading that I intend to send you\n    This Oracle Candle tarot reading will not only help you get answers to the questions that you're asking yourself about your near future, but also give you the big trends that await you for all the upcoming months...\n    I was very pleased to gather these powerful materials for you Memo, and because you are a dear friend, to make it as easy as possible for you to discover the power of this Oracle Candle Kit to bring good fortune into your life, you can examine and use it FREE and without committing to anything. \n    Then, only if you are completely satisfied, after 30 days, you will be billed at a special, completely risk-free price of only $19.95. That is a 30% discount and a savings of $10.00 for you. \n    And remember, Memo: You take no kind of risk when you request your Oracle Candle Kit.  You'll have as long as you want to use and enjoy it.  Because you'll always have the protection of my Unconditional Lifetime Moneyback Guarantee. If your Oracle Candle kit doesn't help you get the answers, money, luck and happiness you seek -- or if at any time, for any reason, you are unhappy with it -- simply write me a note, and I'll refund your payment in full, including the shipping and handling,... with no explanation necessary.\n     And of course, you can always keep your 3 Candle Holders and Marking Pen, as my FREE gifts to you. \nLet's join forces to help make the bestoutcomes in the cards come true for you.\n    Rest assured, you will not be obligated to leave your home or spend a lot of money in order to get answers to your questions and powerful guidance from the cards.  No, you can very well do this in your own home.  That's one of the number of unique aspects of what I have to offer you.\nSo, you see, there's nothing more simple in this world and still, this simple action could dramatically change what you get from life.\n     Memo, you have nothing to lose and everything to gain.  Above all, act immediately, because each moment lost could be the one that makes the difference in your future!  Just click the button below... \n     Believe me, your future, like your happiness is written in the cards, and you only need to discover it.\n        Your friend,                \n\n\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400.\n"}