{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Kristen Ritter\" <veqdelectablemagazinexod@delectablemagazine.com>", "subject": "Become fit and happy again", "body": "\nGetting thinner can be enjoyable\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most enchanting product for corpulent people is now available – As seen on ABC.\n\n\nDo you count up all the cases when you appeal to yourself to do any thing for being rescued from this fastly growing number of kilos? Luckily, now no major price is to be paid. With Anatrim, the ground-shaking pound-melting blend, you can get healthier lifestyle and become really slimmer. Have a look at what people say!\n\n\n\n\"I hate to admit it but I was a junk food addict. \n\n\nI greedily ate all this trash \n\n\nand could not stop. \n\n\n\n\nThis misery stopped after I started taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my craving for food abated, \n\n\nspirits improved and I turned to the happiest person 28 pounds in 2.3 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person in the world!\"\n\n\n\n\n\nMaria H., Boston\n\n\n\n\n\n\"I had weight problems since I was a boy. \n\n\nYou can't even fancy how I detested being derided at school. \n\n\n\n\nI hated my stoutness and I detested myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nIt literally took me out of this dreadful nightmare! A plenty of thanks to you, guys.\"\n\n\n\n\n\nCharley Mock, Boston\n\n\n\n\n\n\"You know what? Anatrim saved my marriage! I fell down into this circle, depression – eating more – just more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOnce one of my friends pointed to your web site and I called for Anatrim at once. \n\n\nThe final result was great, my appetite became normal, I was in a good mood oftener, and, certainly, I tightened my belt with no regrets. And the bed became cool, too!\"\n\n\n\n\n\nBob\n\n\n\n\n There is a lot of testimonials delighted people leave after trying Anatrim. Don’t you wanna add yourself to the thousands and thousands of slender buyers and take this original appetite reducing energy raising product now!\n\n\nDo not miss your opportunity!\n\n\n\n\n"}