{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 6, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESTB Patient: No One Said I Couldn't Travel\nThe globe-trotting tuberculosis patient now in quarantine insists that doctors told him he wasn't contagious. Not so, say\n                        health officials: He was told he was not highly contagious, but they told Congress they couldn't stop him from traveling. More...Watch: TB Patient: No Order To Stay\n• Missing Conn. Girl Found In Couple's Home• Turkish Officials: Troops Enter Iraq\n                     \t\t\t\t\t| Watch• Top Diabetes Doc Says Glaxo Threatened Him\n                     \t\t\t\t\t| WatchU.S.Missing Conn. Girl Found In Couple's Home\nA 15-year-old girl missing for nearly a year was found locked in a small hidden room under the staircase of a West Hartford\n                        home, police said. More...\n• Video May Have Clues In Missing Teen Case\n                     \t\t\t\t\t| Watch• Divorce American Style: Wife Gets $184M• Property Row Over Flight 93 Memorial Site• More StoriesWorldTurkish Officials: Troops Enter Iraq\nSenior Turkish security officials said Turkish troops crossed into northern Iraq in \"hot pursuit\" of Kurdish rebels. Turkey's\n                        foreign minister denied the report, while the Pentagon said there were \"no indications\" of any cross-border activity. More...Watch: Petraeus On Progress In Iraq\n• Israeli-Palestinian Summit Canceled• Man Tries To Jump Into Popemobile\n                     \t\t\t\t\t| Watch• Bush: \"Russia Is Not An Enemy\"\n                     \t\t\t\t\t| Watch• More StoriesPoliticsImmigration Deal Survives GOP Threat\nA bipartisan immigration bill narrowly survived a potentially fatal challenge when the Senate defeated a Republican bid to\n                        bar felons from legalization. Instead, it adopted an amendment that would keep out a more limited set of criminals. More...Watch: Immigration Reform Debate\n• Pardon Me?\n                     \t\t\t\t\t| Watch• GOP Debate Forecasts Stormy Days Ahead\n                     \t\t\t\t\t| Watch• TB Patient: No One Said I Couldn't Travel\n                     \t\t\t\t\t| Watch• More StoriesHealthGood News For Discouraged Dieters?\nFinally, some good news for disheartened dieters led to believe that the pounds they lose are destined to return. Far from\n                        being impossible, new research from the CDC suggests that maintaining weight loss is not all that uncommon. More...Watch: Which Diets Really Work?\n• Rolling Into The ER• Top Diabetes Doc Says Glaxo Threatened Him\n                     \t\t\t\t\t| Watch• Kids' Internet Safety Starts At Home• More StoriesSciTechStem Cell Breakthrough?\nThree teams of scientists say they have produced the equivalent of embryonic stem cells, at least in mice, without taking\n                        the controversial step of destroying embryos. More...\n• NASA Head Sorry For Global Warming Doubts• Brazil's Ethanol-Fueled Power Grab• Mass Evacuations As Cyclone Gonu Hits Oman• More StoriesBusinessFord Shines In Vehicle Quality Rankings\nFord supplanted Toyota as the leader of the pack in initial quality rankings, taking the top spot in five of 19 segments in\n                        the 2007 survey by J.D. Power and Associates, released Wednesday. More...\n• Four Ways To Lower Cooling Costs• Sirius, XM Hire High-Profile Lobbyists• Brazil's Ethanol-Fueled Power Grab• More StoriesEntertainmentTherapists Upset Over \"Sopranos\"\n\"The Sopranos,\" once lauded for its accurate portrayal of Tony's therapy sessions, is taking heat from members of the psychoanalytical\n                        community, saying last Sunday's episode broke with ethics. More...\n• Paris Hilton \"Crying\" Behind Bars• Gisele Bundchen Opposes Condom Ban• Jolie: Brad And I Want To \"Just Live\"• More StoriesOpinionTurning The Tables On Climate Change\nPresident Bush's announcement of a conference of greenhouse-gas emitters may head off a European attempt to cripple the American\n                        economy, which has succeeded in growing even as it pollutes less, says National Review Online. More...Watch: Bush Proposes G-8 Climate Pact\n• Serious Crime, Serious Punishment\n                     \t\t\t\t\t| Watch• Sometimes The Question Is Secondary\n                     \t\t\t\t\t| Watch• Harry Potter & The Continuous Exploitation• More StoriesCBS NEWS BROADCASTSThe Early Show: Emily Senay: Folic Acid Study Yields Unexpected Result\nFolic acid is a B vitamin that women take to prevent birth defects. Scientists have thought that folic assist might have some\n                        other benefits but as Dr. Emily Senay reports, new research in one area has not panned out. More...Watch: Pros & Cons Of Folic Acid \n• EARLY SHOW: Beware Of Internet Puppy Scam \n                     \t\t\t\t\t| Watch• EARLY SHOW: Will Vanessa Redgrave Win Another Tony?\n                     \t\t\t\t\t| Watch• 48 Hours: Love And Lies\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nDi Aide Is OK With DocumentaryOnly On The Web: Patrick Jephson, the former private secretary to Princess Diana, said he found nothing objectionable\n                                    about a new documentary about her tragic death.\nTOP VIDEOS\nGlobal Warming On G-8 Menu\nTen Tips To A Healthier Tan\nDiana Documentary Controversy\nSearch On For Missing Teen\nLagattuta's Notebook\nTB Patient: No Order To Stay\nMissing Girl's Parents Speak\nMan Leaps Into Popemobile\nRick Reilly On Cheerleading\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesHear from Dr. Jack Kevorkian, in his first post-prison interview with Mike Wallace. This Sunday, 7 p.m. ET/PT.48 Hou!\n rs Myste\nryLove And Lies:Murder exposes the secret lives of a suburban couple. Peter Van Sant reports, Tuesday, June\n                           5, at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}