{"category": "ham", "to_address": "\"General Copyright Discussions (questions, organizing, etc)\"\n\t<discuss@list.digital-copyright.ca>", "from_address": "Charles MacDonald <cmacd@telecomottawa.net>", "subject": "[d@DCC] Following up the item on \"IP rights\" from Russell's Blog", "body": "today one of Russell's online articles was about the report of a\nparlementary committe who wants to mix qand match more \"IP' rights,\nhaving been told these are a good thing by the RIAA canada, the MPAA\ncanada, Microsoft and Microsofts Astroturf squad.\n\nI do think that the trademark issue needs to be trated carfully.\n\nOn one hand thademarks are the one \"IP\" issue that had an upside for\nconsumers.  IF I see for example \"HP\" CDR disks, or \"panasonic\"\nbatteries, or \"NGK\" Sparkplugs, I can have some assurance that the goods\nwill probaly be of a quality that I have found acceptable for my use in\nthe past.\n\nMakers sometimes see simalar products in different markets at differing\nprices, and in most cases the underlying goods have the same technology.\n\nCrafty Business folks sometime take advantage of this and for example\nsell me \"reaL\" goods that were actually inteded to be sold in say\nBrazil, or perhaps Australia.  These are called \"grey Market\" imports\nand are generaly NOT appreceated by the Candian \"official\" importer.\n\nPerhaps - since the report seems to come close to attempting to lump\nthis market in with the real scum folks who would pass off JUNK as a\nbrand name product.  there may be an argument to point out that the\nadvice the committe has received was lead by the self interest of the\n\"witnewsses\" rather than the interest of thehLegitamate consumer.\n\nMy own personal opinion thought about and written at home on my own time\nand all that\n\n-- \nCharles MacDonald               Stittsville Ontario\n cmacd@TelecomOttawa.net        Just Beyond the Fringe\n        http://www.TelecomOttawa.net/~cmacd/\n   No Microsoft Products were used in sending this e-mail.\n\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}