{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@flax9.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "SatCon Receives over $2.8 Million in New Fuel Cell Inverter Orders", "body": "\n\n\n\n\n\n\n\n\nSatCon Receives over $2.8 Million in New Fuel Cell Inverter Orders\n\nBOSTON, Jun 26, 2007 (BUSINESS WIRE) --  SatCon Technology Corporation(R) (Nasdaq CM: SATC), a developer of power management and system architecture solutions for the alternative energy and distributed power markets today announced that it has received a purchase order in excess of $2.8 million for its PowerGate(R) inverters and electrical balance of plant equipment. The inverter power system is for use on DFC1500MA(TM) megawatt-class fuel cells designed and manufactured by FuelCell Energy, Inc. (NasdaqNM:FCEL). The DFC1500MA(TM) fuel cell currently has a nominal rating of 1.2 megawatts. Delivery of the PowerGate inverters is scheduled over the next four to nine months. FCEL is a world leading developer, manufacturer and supplier of ultra-clean fuel cell power plants that generate electricity with higher efficiency than other distributed generation plants of similar size. \"This order represents a clear sign that fuel cell power plants are a commercial reality, and we are pleased to be supporting FuelCell Energy with its commercialization program\", said Clemens van Zeyl, President of SatCon Power Systems. \"SatCon is committed to FuelCell Energy's commercialization program that includes continuous improvement in costs, delivery and reliability through new packaging concepts, global sourcing and manufacturing techniques.\" About PowerGate(TM) Inverters PowerGate(TM) inverters are designed for use with alternative energy power systems to generate distributed electrical power. Distributed, alternative energy power generation is a growing trend toward the production of clean, reliable power at the point of use. Alternative energy systems can alleviate congestion on highly loaded utility electrical distribution networks and offer an alternative to power line extensions in remote areas. Many alternative energy power systems require high-power, high-reliability inverters and controls to convert the power generated to useable AC power compatible with the electric power grid. About SatCon Technology Corporation SatCon Technology Corporation is a developer and manufacturer of power systems utilizing power electronics, advanced controls and generators/motors for the Alternative Energy, Power Delivery, Hybrid-Electric Vehicle, and Grid Support markets. SatCon also develops and manufactures High Reliability Electronics and Advanced Power Technologies. For further information, please visit the SatCon website at www.satcon.com. SATC-G Statements made in this document that are not historical facts or which apply prospectively are forward-looking statements that involve risks and uncertainties. These forward-looking statements are identified by the use of terms and phrases such as \"will,\" \"intends,\" \"believes,\" \"expects,\" \"plans,\" \"anticipates\" and similar expressions. Investors should not rely on forward looking statements because they are subject to a variety of risks and uncertainties and other factors that could cause actual results to differ materially from the Company's expectation. Additional information concerning risk factors is contained from time to time in the Company's SEC filings. The Company expressly disclaims any obligation to update the information contained in this release. SOURCE: SatCon Technology Corporation(R) SatCon Technology Corporation(R)\nDan Gladkowski, 617-897-2411\nVP, Administration\n\n\n\n\n\n\n\n\n\n\n You are subscribed to SatCon Technology Corporation Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n SatCon Technology Corporation \n 27 Drydock Ave. 6th Floor, South Boston, MA 02127\n Service provided by Shareholder.com \n\n\n\n\n\n"}