{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Bruce Ling <bruce.ling@stanford.edu>", "subject": "[R] Question of the impact of the pilot experiment on the\n\toveral\tstatistic interpretation of the subsequent work", "body": "Hi,\n\nI have a question regarding the impact of the pilot experiment on the\noverall statistic interpretation of the subsequent work.\n\nThe context is as following:\n\nIn a lab there are one Professor and three graduate students A, B, and\nC.  They are working on analysis of some disease to discover genes\ndifferentiate + and - categories like disease or non-disease.  Number of\nsamples of (+) is about m while that of the samples of (-) is n.  Both\nm, n are sufficiently large, e.g. bigger than 100.  \n\nPilot experiment:\nIn order to save efforts and resources, the Professor decided to pool\nthe samples in each category with equal amount such that he got only two\npooled samples of (+) and (-).  His argument is that if there is no\ndifference in the pooled samples then he would decide to abandon the\nproject.  Graduate student A did a microarray analysis of  the pooled\n(+) and (-) and found gene X, Y, Z have fold of change bigger than\n100.  \n\nProfessor thought this was interesting and encouraging based upon his\nbiological insight of gene X, Y and Z and the potential disease link of\nthese genes.  \n(1) He asked graduate student B to do a protein analysis, using a\ndifferent technique (western blot), of all the original samples (m, n)\nand found gene Y is truly differential.  Based upon the protein analysis\ndata, graduate student A calculated P value using t test to describe the\nstatistic significance of gene Y differentiating (+) and (-) categories.\n(2) Simultaneously, he also asked graduate student C to do a full scale\nmicroarray experiment using all m, n samples individually.  It is a very\nlaborious work but graduate student C finished everything and using some\noff the shelf microarray statistical packages, he calculated and found\ngene Y, Z and another un-identified gene W to be statistically\nsignificant.  He calculated the false discovery rate and P value of\nthese genes differentiating (+) and (-) categories.\n\nThe professor presented his students A, B, C's work including the\ncalculated statistics in a conference.  In the audience, statistician D\ncommented that professor has made a mistake here: because he is using\nthe SAME samples, whether pooled or individual, in both the pilot and\nsubsequent experiments, statistically the professor is \"cheating\" and\nhis students' calculated statistics are no longer valid.\n\nCan statisticians in this mailing list comment on this story? One thing\nI want to emphasize here is that nobody disputes that it is highly\ncritical to use a different set of samples to validate the discoveries.\nThe question here is that contingent on the pilot experiment of the\npooled samples, whether the subsequent full scale experiments using the\nSAME samples can yield meaningful statistics to describe the differences\nof the discovered features.\n\nThanks.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}