{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "\"Rochelle and Bethea\" <rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, here's your forecast for May 21st - May 27th", "body": "\n\n\n\n\n\n\n\n\nMemo, to ensure that your weekly forecasts are delivered correctly to your inbox, please add our email address Rochelle@myhealthwealthandhappiness.com to your address book.\n \n\nFirst Quarter Moon, May 23, 5:04 AM EST\n\n\n\n\n\n\n               \n\n\n\n\nDear Memo,\n\n    First of all, let me congratulate you as you continue moving forward creating the life of your dreams.  It's exciting to know that you (someone who deserves every happiness) are on the road to success.\n    As you persist on this path be aware of the positive energy that is surrounding you now.  You might only be able to catch glimpses of it, yet know that it is there supporting you.  And it will grow stronger and stronger as we continue in our work together.\n    This week I want you to embrace this thought:  Happiness is a journey, not a destination.  Think about this for a moment.  We've been taught that getting the job, the relationship, the house, or some other want will bring us happiness.  What often happens, once a dream is achieved, is that the happiness we longed to feel is fleeting at best, and then we quickly find ourselves thinking, \"What else can I get to make me happy?\"  This thinking doesn't serve us.  After all, how many times have we read tragic stories about the rich and famous, people who have money galore and every material desire, but still happiness eludes them.\n    So, the answer is not to stop dreaming and achieving our heartfelt desires, but rather to experience happiness on a more consistent basis -- to enjoy the journey.  Here's another secret how you can do this -- treat yourself to some small, harmless indulgence on a regular basis.\n    If you do this, you are saying \"yes\" to happiness right now, not tomorrow or the day after, or 10 years from now.  You are also expanding the positive energy around you.  When this happens, you begin attracting people, situations, and material wealth like a magnet right to your side.\n    When you have a happy and positive frame of mind, Memo, you set in motion opportunities that will enable you to achieve the things you want most of all.\n\n                      Until next week,                          \nP.S.  Give special attention to Bethea's Tarot Card Reading.  Make sure to read it through thoroughly and keep it close by for reference.  It should bring an added dimension to your forecast, Memo.\n\n\n\n\n\n\nThe 9 of Pentacles forMemo\n\n\n\n\n\n\n\n    Memo, I drew a card to see what the Tarot deck had to reveal to me about your life right now.  I chose the Nine of Pentacles, and that tells me that you are about to go through a period of introspection.  I have always been fond of this card, and I want you to know that it indicates that you are entering a period of satisfaction and bliss, but not the typical kind.  You should feel safe and contented with what you have in life, without longing for much more.  The universe works in strange ways.  One important life lesson that I'll share with you is that gratitude for our blessings makes even more abundance comes through for us.  The Nine of Pentacles tells me that you are apt to feel thankful for the good things in your life.  You can sit back now and enjoy the bountiful fruits of your labor, even if it's just emotional satisfaction that you feel for now.  You may not be surrounded by a lot of people at this moment, but you are not likely to feel lonely at all.  You can find your happiness within yourself right now, rather than looking outside of yourself for life's delights.\n\n \n\n\n\n\n\n                 \n\n\n    This week begins with a real burst of energy and ideas.  The Sun enters Gemini, joining Mercury, which in turn is linking up with both expansive Jupiter and unpredictable Uranus.  Expect the phone to ring off the hook, Memo, and to bump into folks who just love to chat each time you leave your home.  This is a time for planning rather than doing, as there's little practical help from the planets, because none of them are occupying earth signs.  But the Moon passing through Virgo on Thursday and Friday helps you get urgent chores done.\n\n\n\n\n\nMemo               May 21 - May 27               \n\n\n\n\n \n\n\n\n    Memo, I want you to take maximum advantage of the luck coming your way this week. From my calculations, Monday is going to be your lucky day for this period.  And your Lucky Numbers are 08, 13, 27, 19, 35, 46.  I hope you'll make the best of them.\n\n\n\n\n\n\n\n\n\n\n\nMay 21st for Memo\n\n\n\n\n\n\n\n\n\n    Social gatherings could head up your list of things to do today.  Plan on inviting friends in for a few hours.  Nothing fancy, just visit to catch up on what everyone is doing these days.\n\n\n\n\n\n\n\n    There are days when you feel like being alone.  This could be one of those times.  There's nothing wrong with taking the day off.  Curl up with your favorite book, movie, or TV shows.\n\n\n\n\n\n\n\n    You could discover a hidden talent quite by accident.  Be sure to develop this gift through classes and instruction.  You can't afford to let this ability go to waste.\n\n\n\n\n\n\n\n\n\n\n    A heavy work load could weigh you down.  Arrange to spend a quiet time by yourself this evening.  This will help you to recharge your batteries just when you need it most.\n\n\n\n\n\n\n\n    Remember to use your instincts when dealing with pending personal issues.  You have the power to resolve all matters happily.  Use your imagination to assist those you love.\n\n\n\n\n\n\n\n\n\n\n\n\nMay 22nd for Memo\n \n \n \n \n \n\n \n \n    This is a good time for you to do some research concerning your family ties and roots.  A book on genealogy should get you started.  Ask around and see if any of your friends can help.\n\n\n  \n \n \n    Renewed courage and self-confidence will allow you to get out of any rut you've been in recently.  This is a good time to promote your own interests.  Use common sense and caution in all you do.\n\n \n \n\n \n \n\n\n\n\n    Your ability to say the right thing at the right time could easily win someone over.  Seize this opportunity to ask for a favor of some sort. This person may be more than willing to grant it.\n \n \n  \n\n\n\n\n\n\n\n\nMay 23rd for Memo\n\n \n \n \n\n\n \n \n    This would be the perfect time to investigate exercises that include meditation.  Yoga and Tai Chi are very good and gentle ways to learn how to stretch both your mind and body.\n\n\n \n\n \n \n    This is a time when you might experience a moment of revelation perhaps through something that you see or read.  You may feel that you have a deeper understanding of life afterward.\n\n \n \n \n \n\n\n\n\n    Difficulties you encounter in your finances today will likely involve your family or domestic scene. Try to find ways to cooperate and elicit compromises from others. Don't allow outside interference.   \n\n\n\n\n\n\n\n\n\nMay 24th for Memo\n  \n \n\n\n\n \n \n    Your love of fun and excitement is contagious.  Don't be surprised if people want to be around you because they enjoy your energy level. Your enthusiasm is at its height, enjoy yourself.\n\n\n \n\n \n \n    You may be feeling as if the cat has got your tongue.  Your normal talkative self may suddenly be shy and not able to express how you feel.  Put off anything that may require careful wording.\n\n \n \n \n\n\n\n\n\n\n\n\nMay 25th for Memo\n  \n \n \n\n\n \n \n    This is a time when your creative energy is overflowing.  Especially when it concerns others.  Don't tell your best friend to get a different hairdo, but instead, give them a gift certificate.\n\n\n \n\n\n \n \n    Even if you disagree with current family goals, learn to let others find their own talents and self-expression.  Allow yourself some time to spend with those loved ones who are so special to you.\n\n \n\n\n \n\n\n\n\n\n    You enjoy the company of those who love you now.  Your home will be your refuge today.  In it you will feel secure, loved and needed.  It is possible you will entertain or enjoy being entertained.    \n\n \n \n\n\n    When it comes to romance, it will be so easy that you'll either be passing out numbers - like at the deli - or collecting them on cocktail napkins.  Either way, you can afford to be picky.\n  \n\n \n \n\n\n    If you feel as though you're giving so much to your loved ones that you have nothing left for yourself, take a break.  There's nothing selfish in serving yourself first, my friend.\n \n\n\n\n\n\n\n\nMay 26th for Memo\n  \n \n \n \n\n \n \n    Now is an excellent time to work on your personal records.  You'll be in the mood to track down any errors that have come up in the past. The bankers should beware of you today.\n\n\n \n \n\n \n \n    Communications with others, in general, can bring you favorable news or a particular bit of information you've long awaited.  Travel is probable now, as are business agreements or commitments.\n\n \n\n\n \n \n\n\n\n\n    Children may ask for your help with a school project.  If you're unsure of how to proceed, consult a neighbor who may have more experience in this area.  You could learn a lot.   \n\n \n \n\n\n    Why not find a partner and go take that course you've been so interested in trying.  If not a course, why not a short, informative trip?  We should never stop learning, my friend.\n \n \n\n\n\n\n\n\n\nMay 27th for Memo\n \n \n \n \n \n \n \n    This is a terrific time for you to get to know your neighbors better. Take along a small treat to share or just ask them over for refreshments.  You'll benefit from their friendship.\n\n\n  \n\n \n \n    Communications are more difficult today, especially when involving relatives, neighbors or close associates.  You tend to speak without careful thought.  Try not to get behind in your daily duties.\n\n\n  \n\n \n \n    Don't be disappointed if others don't immediately take to a proposal. They may need some time to mull it over.  Meanwhile, you might want to think about getting a change of scene.\n\n \n\n\n \n \n\n\n\n\n\n\n    Pursuing pleasure when you should be taking care of your domestic or work responsibilities could put you at risk.  Avoid being overly critical in your conversations and communications.  Travel is likely.\n \n \n\n \n \n\n\n    My intuition tells me you are in a strange state of mind  thinking and feeling intensely about vaguely spiritual matters that normally don’t bother you. Your thoughts are very deep today.   \n\n\n\n\n\n\n\n    Next week will be a good time to reach out to friends and family, Memo.  And with the fiery energy provided by a Sagittarian Full Moon, it could be time to party!\n\n                       Best Regards, \n                        \n\n\n\n\n    If at any time you no longer wish to receive your weekly forecast, you can simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400, and I will stop emailing them to you. It's as simple as that. My only desire is to help you, Memo.\n\n"}