{"category": "ham", "to_address": "perl6-language@perl.org", "from_address": "Darren Duncan <darren@DarrenDuncan.net>", "subject": "Re: [svn:perl6-synopsis] r14407 - doc/trunk/design/syn", "body": "At 4:40 PM -0700 5/29/07, Larry Wall wrote:\n>Hmm, maybe we should just rename Object to something more generic.\n>There are plenty of candidates:\n>\n>     Top\n>     Idea\n>     Noun\n>     Item\n>     Proto\n>     Thing\n>     Notion\n>     Concept\n>     Subject\n>     Reality\n>     Invocant\n>     Universal\n>     EveryThing\n>     Abstraction\n>     TheCosmicAll\n>     Life::Universe::Everything\n\nIf you are going to rename Object, I put my vote in for Universal.\n\nFor one thing, that is the/a term used in set theory to refer to set \nof everything (under consideration).  And \"universe\" in general means \nthe one that contains all.  We also have the advantage of continuity \nwith Perl 5, which calls its maximal data type UNIVERSAL.\n\nObject is inferior to this as, at least among computer people, Object \nsmacks as describing the implementation of a type rather than of its \nmeaning, and generally speaking types should be named after what they \nmean.  (Mind you, Hash very much smacks of describing implementation \ntoo, but there is less of a case to change that since Perl 5 people \nmay revolt.)\n\nUniversal also gets the huffmanizing stuff about right ... not too \nshort and not too long.\n\nActually, I hereby actively propose that Object be renamed to \nUniversal, assuming that Object is actually the maximal data type.\n\n>And in Perl 6, \"Any\" does not really mean \"any kind of whatever\".\n>\"Any\" is just short for \"any single bindable item\", and a Junction is\n>not a single bindable item, since it autothreads instead.  Note that\n>\"any\" is considered a singular noun in English, and so used in\n>junctional phrases like \"any of A, B, or C\", where it picks out\n>one or another of them semantically, which is basically the same\n>operation that autothreading a parameter does.  We're using \"any\"\n>more in that \"any of a restricted set\" sense than in the \"any of\n>the universal set\" sense.\n\nNow that I've heard the explanation of what Any means, I also have no \nobjection to continuing to use that, such that Any is the complement \nof Junction under Universal/Object.\n\n-- Darren Duncan\n\n"}