{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 22, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESSix Flags Closes More Rides After Accident\nAfter a 13-year-old girl had her feet chopped off at the ankle on a Superman Tower of Power in Kentucky, Six Flags and another\n                        company shut down eight more thrill rides around the country, including a ride at a North Carolina amusement park. More...Watch: Girl Loses Feet On Thrill Ride\n• Atlantis Aims For California Landing\n                     \t\t\t\t\t| Watch• Sheriff: Found Baby Isn't Missing Mom's\n                     \t\t\t\t\t| Watch• Nation's Firefighters Mourn Their Own\n                     \t\t\t\t\t| WatchU.S.Sheriff: Found Baby Isn't Missing Mom's\nA baby found on an Ohio doorstep does not belong to a missing pregnant woman, Wayne County Sheriff Thomas Maurer said. The\n                        baby was left outside a home about 45 miles from where Jessie Davis lived. More...Watch: Pregnant Mom Still Missing\n• U.S. May Move Detainees To Afghan Prison• Nation's Firefighters Mourn Their Own\n                     \t\t\t\t\t| Watch• \"Killer King\" L.A. Hospital In Peril• More StoriesWorldOfficial: Iran Open To Nuclear Compromise\nIran is ready to provide answers on past suspicious nuclear activities to the International Atomic Energy Agency within the\n                        next few months, the agency's head said after meeting with the country's top nuclear negotiator. More...\n• Air Strikes Kill 17 Iraq Al Qaeda Fighters\n                     \t\t\t\t\t| Watch• Lebanon Says Militants Defeated• Hamas Is Excluded From Mideast Peace Talks• More StoriesPoliticsBush Pushes Vietnam Leader On Human Rights\nAs hundreds of protestors across the street called for the release of political prisoners in Vietnam, President Bush voiced\n                        similar concerns at the end of his Oval Office meeting with Vietnamese President Nguyen Minh Triet. More...\n• Illinois Governor Has Pricey Commute• Nonprofit Kept Edwards In '08 Spotlight• Romney Staff Involved In 2 Investigations• More StoriesHealthFDA Cracks Down On Dietary Supplements\nThe FDA has announced that, for the first time, manufacturers of vitamins, herbal pills and other dietary supplements will\n                        have to test all of their products' ingredients. More...\n• Baby Formula Goes On Trial In Asia• New Scrutiny For Omega-3 Eggs• Study: First Born Have Higher IQs • More StoriesSciTechAtlantis Aims For California Landing\nSpace shuttle Atlantis headed for a landing at its backup location in California after rain and clouds over Florida ruled\n                        out a touchdown at the Kennedy Space Center. More...Watch: Storms Delay Shuttle Landing\n• \"Green\" Light Bulb Buying Guide• Control The TV With Your Mind• Video Game Addiction: A Medical Disorder?\n                     \t\t\t\t\t| Watch• More StoriesBusinessHow To Survive The Office Bully\nMany people caught in the clutches of the office tyrant decide to quit ... but not everyone has the freedom to do so.  More...\n• Tips For Hassle-Free Air Travel• Air Travel With Kids Made Easy\n                     \t\t\t\t\t| Watch• Planning Perfect Yard, Tag, Garage Sale\n                     \t\t\t\t\t| Watch• More StoriesEntertainmentHilton's New Passion: Helping Inmates\nIn the second part of her exclusive interview with Ryan Seacrest, Paris Hilton said she plans to build a \"transitional home\"\n                        to aid inmates after they complete their time in jail.  More...Watch: Neighbors Want Paris Evicted\n• Steve Carell Loves Birds. Really.\n                     \t\t\t\t\t| Watch• Hasselhoff Demands Apology From Tabloid• Angelina Jolie Tackles Daniel Pearl Story\n                     \t\t\t\t\t| Watch• More StoriesOpinionMichael Moore's Imperfect Diagnosis\nMichael Moore's tactics, including those used in his latest film, \"Sicko,\" may infuriate people on the right and left. But\n                        The New Republic says most of his arguments against the U.S. health care industry are deadly accurate. More...Watch: Moore, \"Sicko\" In Cannes\n• Bloomberg's Small-Time Tease\n                     \t\t\t\t\t| Watch• Is Vice President's Office Above The Law?• The Bloomberg Terminal\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Angelina Jolie Tackles Daniel Pearl Story\nWall Street Journal reporter Daniel Pearl was murdered by Islamic extremists in Pakistan in 2002. Now, Angelina Jolie portrays\n                        Pearl's widow Mariane in a new film titled \"A Mighty Heart.\" More...Watch: 'A Mighty' Angelina Jolie\n• EARLY SHOW: New Scrutiny For Omega-3 Eggs• EARLY SHOW: Planning Perfect Yard, Tag, Garage Sale\n                     \t\t\t\t\t| Watch• EARLY SHOW: \"Green\" Light Bulb Buying Guide\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nBig Blast At Wisconsin PlantCBS News RAW: A massive explosion at a Wisconsin chemical recycling company forced the evacuation of nearby homes and\n                                    businesses as a safety precaution. \nTOP VIDEOS\nFirst Look: 'Sicko' Effects\nNo Sign Of Missing Mom\n'A Mighty' Angelina Jolie\nGirl Loses Feet On Thrill Ride\nHonoring Fallen Heroes\nDave's Great American Vacation\nEye To Eye: 'Sicko'\nThe 'Almighty' Wanda Sykes\nCrooked X Takes Off\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMorley Safer talks to long-driving, hard-drinking golfer John Daly. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMurder On Lockhart Road:A mother and two kids are murdered. There are bizarre clues, eyewitnesses, blood drops,\n                           and a killer with a foot fetish. Saturday, 9 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}