{"category": "ham", "to_address": "\"Daniel O'Shea\" <dan.oshea@dnr.state.mn.us>", "from_address": "Spencer Graves <spencer.graves@pdf.com>", "subject": "Re: [R] nlme correlated random effects", "body": "      I haven't seen a reply to this, so I will offer a comment in case \nyou haven't already solved the problem. \n\n      Have you consulted the \"Mixed-Effects Bible for S-Plus / R\", \nPinheiro and Bates (2000) Mixed-Effects Models in S and S-Plus \n(Springer)?  If yes, have you worked through appropriate portions of the \nbook and the companion script files available with the standard R \ndistribution in \"~R\\library\\nlme\\scripts\"?  I just did \"grep 'pdB' *.*\" \nin that directory and found 5 uses of pdBlocked, 3 in ch04.R, and 1 each \nin ch06.R and ch08.R.  Also,  RSiteSearch(\"pdBlocked with 2 random \neffects\") produced 69 hits for me just now.  You may not find anything \nuseful there, but 69 does not seem to large a list to search, and there \nseems like a reasonable chance of finding something useful there. \n\n      Beyond this, a recommended approach to difficult questions like \nthis is to try to simplify it to the maximum extent possible.  For \nexample, it sounds to me like your question, \"can I use pdBlocked with \nonly 2 random effects\", could be answered without the complexity of \n'nlme'.  What phony data set can you generate with the minimum number of \nobservations and variables that could help answer this question?  The \nprocess of producing such a simplified example might produce an answer \nto your question.  If it doesn't, then you can submit that simple, \nself-contained example to this list.  Doing so will increase the chances \nof a useful reply. \n\n      I know this doesn't answer your question, but I hope it helps. \n      Best Wishes,\n      Spencer Graves\n\nDaniel O'Shea wrote:\n> I am examining the following nlme model.\n>\n> asymporig<-function(x,th1,th2)th1*(1-exp(-exp(th2)*x))\n> mod1<-nlme(fa20~(ah*habdiv+ad*log(d)+ads*ds+ads2*ds2+at*trout)+asymporig(da.p,th1,th2),\n>     fixed=ah+ad+ads+ads2+at+th1+th2~1,\n>     random=th1+th2~1,\n>     start=c(ah=.9124,ad=.9252,ads=.5,ads2=-.1,at=-1,th1=2.842,th2=-6.917),\n>     data=pca1.grouped)\n>\n> However, the two random effects (th1 and th2) which describe the asymptotic relationship between richness (fa20) and area (da.p) are correlated: -0.904 with approximate 95% ci of -0.99 to -.32.\n> I examined the anova of mod1 with both random effects and mod2 with just th1 and mod1 is preferred.  I also examined pdDiag(th1 + th2~1) for another model (mod3) and based on the anova the original mod1 is preferred.\n>\n> My question is can I use pdBlocked with only 2 random effects or should I and if so how I would specify that in the model or perhaps the 95% ci for correlation is wide enough to ignore???\n>\n> Dan\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}