{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Walter And The Whales", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nThe \n      Value – And Peril – Of Media CriticismOn Friday night, CBS \n      aired a special celebrating the life of Walter Cronkite. It was an \n      entertaining and informative affair, the kind of program that can't help \n      but lead one to reflect on where things stand in the media business today. \n      And not just because it was immediately followed by \"A Dr. Phil Primetime \n      Special: Caged?\" [+ Read More]\n\nA \n      Whale of a StoryThey snuck into America secretly, under our \n      very noses. The American government was forced to act. Quicker than you \n      could say “Lou Dobbs,” they’d become story of choice for the cable \n      networks. Of course, I’m talking about Delta and Dawn, who \n      are a pair of ... humpback whales. [+ Read More]\n\n\"No \n      Comment.\" Then Push Send.After a few minutes talking to a \n      reporter, two things can happen: (A) you get a little more relaxed, and \n      (B) you don’t want to repeat yourself, so you think of different ways to \n      get your points across. You might think that sounds like the recipe for a \n      Candor Cocktail, but actually it isn’t. That's when you start to ad lib, \n      and -- just like jazz musicians hit an occasional off-note -- this \n      rhetorical riffing can sometimes be way off-key. [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nThe \n      White House Is Watching\n \nOn \n      This Day In The \"Ultimate Spin Zone\"\n \nThe \n      Wal-Mart Question\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}