{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Zoe Wilson <cemyeits@grimmspump.com>", "subject": "Want to be the best with your girlfriend?", "body": "\n\nYou need to buy lots of meds, but you don't want to pay huge sums of money? \nOur shop\nUse licensed Viagra and Cialis pills from our drug store. You will be the best, you will have perfect sex in your life!\nClick here to have a nice dick\nYou can find all medications at our online drugs store.\nWith best regards,\nZoe Wilson\n \n \nOn nedoocenil Demona. Sily Zla, Bigman. NEDOLGOE ODINOChESTVO Snachala vernulos osiazanie, i eto oznamenovalos prishestviem zhutkogo, Ledeniashchego, pronizyvaiushchego do samyh kostej holoda. Tolko stoilo li? Kak by ia ne opozdal vovremia shvatitsia za Oruzhie. \nEgo vneshnij oblik i vognal atamana v Mgnovennyj stolbniak. Zolotoe bylo vremechko takzhe i dlia ne priznannyh v svoem Krugu magov, sogreshivshih ili ushchemlennyh v svoih eksperimentah, kotorym Obshchepriniatye pravila byli chto nozh po gorlu, kupcov, ne udovletvorennyh Sostoianiem torgovyh del, da i prosto vsiakogo sbroda avantiuristov, liubitelej Prikliuchenij (zhit sredi legendarnyh nubesov eto zhe ogo-go!), banditov i Obychnyh melkih prestupnikov, kotoryh zakon eshche ne pojmal za ruku, no vot-vot Sobiralsia eto sdelat Svoboda, priznanie, udacha, bogatstvo eti slova mnogie Gody ne shodili s ust liudej, vnezapno obretshih vozmozhnost pereselitsia i Oshalevshih ot nezhdannogo schastia. Zhelanie manilo, kak sotnicu neistrebimyh manili globuly siglajzera, i ia ne smog ustoiat. Srabotalo, da eshche kak. Esli ia sejchas ne pridumaiu, kak s Etim spravitsia, to ne pridumaiu etogo uzhe nikogda. Besplotnyj, Lork rval Mne gorlo, kromsal myshcy i suhozhiliia. Takogo Ved ne byva!\net ot prostyh prikosnovenij. Mne nuzhna Sila, kotoruiu mozhet poluchit ego Posledovatel. \nOgnennaia liniia potianulas za ego rukoj, Razgoraias nesterpimo iarkim zhelto-golubym svetom! Ia pospeshno zakryl lico Rukoj, no svet uzhe pogas i liniia zamknutogo kontura ischezla, ostaviv v Glazah slabye pliashushchie svetovye piatna. Mogla i ne govorit, i tak vse uzhe iasno. Oglushen i skovan. Ved Nkot skazal, chto na shelte razmeshchen ego energoreceptor, Slediashchij za mentalnoj aktivnostiu za granicami territorij. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}