{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Leila Feliciano\" <nifcomeoutandplaysaw@comeoutandplay.com>", "subject": "Watch your body change with Anatrim", "body": "\nWatch your body change with Anatrim\n\n\n\n\n\nAnatrim – The very up-to-date and most delighting flesh loss product is now readily available – As told on CNN\n\n\n\nDo you know that excessive body kilos kill more and more people around the planet? We believe that you hate the ugly look of those people and the social bias against them. \n\nOr, maybe, you can not resist a siege of your terrible eating habits. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nWe’re proudly introduce you Anatrim, the ultimate product for the elimination of your body’s extra weight. The greatest thing is that Anatrim raises the quality of your life by soothing the feeling of hunger and giving you better spirit. Here are some e-mails from our customers:\n\n\n\n\n\n\"This is great! \n\n\nI stopped watching TV and gorging anything close at hand \n\n\nI became rather more interested in doing exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I have a great figure now and there are lots of men in my way!\"\n\n\n\n\n\n\nAmelia B., New York\n\n\n\n\n\n\n\"I tried some passive weight reducing, you know, but to no purpose. This terrible hunger would just kick in and spoil everything. \n\n\nOne day I heard about Anatrim in the media advertisement and it brought a great influence on me.\n\n\n I had tried using it, and my wife said I’m not more a weighty man now, 4 months later. \n\n\n30 pounds have gone away and this is still far to an end! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nMichael Burns, Bellevue WA\n\n\n\n\n\nAnatrim helps you to realize you don't need that much food. It raises your mood up, gives you energy, and attacks needless kilos. Especial thanks to its mighty comprehensive formula!!\n\n\n\nWorm out latest news!\n\n\n\n"}