{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"Revolutions Medical News\"<William.Hurst@amanuenis.com>", "subject": "RMCP recent completion of Clear Image Acquisition Corp", "body": "\n\n\nRMCP recent completion of Clear Image Acquisition Corp\n\n\n\n\n\nRMCP recent completion of Clear Image Acquisition Corp\n\n\n\n Revolutions Medical Lays Out Its Plans For This Summer\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \n Revolutions Medical Lays Out Its Plans For This Summer\n\n\n\n \n\n\n\n \nMOUNT PLEASANT, S.C.--(BUSINESS WIRE)--Revolutions Medical Corp (OTC:RMCP) has set certain goals for this         summer that when completed should add value to its stock. These goals         should propel the company forward as it enters the sales and marketing         phase of its business plan. The company has been working towards 510K         FDA submission for its RevVac safety syringe for the past several         months. Its first goal is to complete and file this submission for all         sizes of its safety syringe including 1cc, 3cc, 5cc, and 10cc with the         FDA. \n\n \n\n\n\n\n \nRev Med has hired and announced the two companies that are handling         the submittal and the lab testing: Strategic Product Development and Son         Medical. This syringe uses vacuum technology to suck the needle into the         plunger after use. The syringe cannot be reused once the vacuum is         activated. Rev Med believes its safety syringe has many advantages over         its competition including price, ease of use, and safety. It should help         reduce accidental needle stick injuries and also aid in reducing the         spread of contagious diseases. You may view a video of the syringe in         use on are website at www.revolutionsmedical.com.         The company also believes that with the help of government regulation         initiatives, individual state laws, and the importance of world health         concerns, the safety syringe market will continue to have substantial         growth into the foreseeable future. \n With the recent completion of Clear Image Acquisition Corp, Revolutions         Medical now controls exciting new software for MRIs         and PACS. After securing this break through technology, Rev Meds         second goal is to have test sites using this new software. Revolutions         Medical will then be able to introduce this product to the imaging         industry at the RSNA show in Chicago this fall. Revolutions Medical         believes its software will enable doctors to see MRI images in color and         3D using automatic segmentation. These tools should help in quicker,         more reliable diagnosis which will lower expenses and reduce time. The         imaging market is in the billions and growing. Revolutions Medical         believes that it will continue to grow as more and more uses are found         for the MRI segment of this market. A video of this new software can         also be found on our company's website. \n About Revolutions Medical Corporation \n Revolutions Medical Corporation is committed to continually developing         and distributing new products and tools to the medical industry, whether         internally or through acquisitions. Its goals are to make health care         safer and less expensive by reducing risks and cutting time and         expenses. Its products include the RevVac safety syringe, safety blood         drawing device and safety IV catheter. The world market for         safety-engineered medical devices (SEMDs) is projected to exceed 2         billion this year and is forecasted to maintain a 20% annual growth rate         in the near term. Revolutions Medical also provides software solutions         and proprietary tools that are compatible with standard MRIs and         standard PACS. The software includes sorting of images, color, 3D, and         automatic segmentation of images. These tools will enhance the         physician's diagnostic confidence in an industry that is growing at 10%         - 15% (more than 25 million procedures) per year with a worldwide market         potential for these tools that exceed $3.5 billion. \n\n \n \n\n\n \n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}