{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Mickey Donovan\" <lazclubrecessbow@clubrecess.com>", "subject": "Summer is almost here, be ready", "body": "\nLook in the mirror and enjoy the new you\n\n\n\n\n\nAnatrim – The latest and most delighting product for weighty people is now readily available – As you could see on ABC\n\n\n\nDid you realize superfluous body kilograms kill a lot of people around the planet? We know that you hate the unattractive look of people like those and the social stigmata attached to them. \n\nOr, maybe, you can’t withstand a siege of terrible eating habits of yours. If it all sounds familiar, then we got something for your consideration!\n\n\n\n\n\nHere there is Anatrim, the ultimate product for the elimination of your body’s extra weight. The most amazing thing is that Anatrim raises the quality of your life, repressing your feeling of hunger and giving you joyful spirit. Here you may see some notes from our customers:\n\n\n\n\n\n\"This is outstanding! \n\n\nInstead of gorging anything close at hand and watching TV continually \n\n\nI became keen on doing sport.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I have a great figure now and there are lots of men around me!\"\n\n\n\n\n\n\nVictoria K., New York\n\n\n\n\n\n\n\"I tried some passive weight burning, but with little result. It was very hard for me to hold back and not to eat something just at hand. \n\n\nOne day I was told on Anatrim my very best friend by and I was really impressed at the information.\n\n\n I had tried to take it, and my wife said that I had changed for the better since then, 4 months later. \n\n\n28 pounds have gone away and this is still far to an end! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nSteve Doubt, Washington\n\n\n\n\n\nAnatrim helps your brain to realize that your body doesn’t need that much food. It raises your mood up, provides you with extra energy, and attacks unnecessary kilos. Great thanks to its powerful original formula!!\n\n\n\nWorm out more information!\n\n\n\n"}