{"category": "spam", "to_address": "Wisdom <wisdom@flax24.uwaterloo.ca>", "from_address": "Wendy Erickson <lois_hall@gifted-reader.com>", "subject": "Straining yourself when you are with a woman?", "body": "\n\nOnline pharmacy presents top products that will make you healthy! You do not need to go to your local drug store, you can buy here any pill that you need.\nOur shop\nWith Viagra from RX Online Drug Store you will have perfect sex.\nOur pharmacy\nSecure, confidential purchase!\nWith best regards,\nWendy Erickson\n \n \nEti dvoe nikuda ne toropilis. Esli by ne ispravno rabotaiushchij prizrak, na nas davno by uzhe obratili Vnimanie vse sidiashchie v zale, a tak narod prodolzhal zanimatsia svoimi delami. On Pospeshno vernul monetu chuzhaku: Eto on. Talant kukolnika voplotilsia v gigantskoj Konicheskoj voronke, zavertevshejsia vokrug cilindra i prevrativshej ego v Nagluho otrezannyj ot mira nepronicaemyj ostrovok. \nTut do Mihkaia doshlo, chto Vestnik uzhe nachal koldovat. Posle korotkoj zaminki vse bez iskliucheniia rvanuli sledom. Nizhnie vetvi Dereva, riadom s kotorym ia otdyhal, chernye i bezlistnye, vdrug ozhili, gibko Spustilis k zemle i vovsiu sharili po ee poverhnosti, vorosha listvu i moh, Oshchupyvaia pustye plastikovye upakovki. Vladyka ne liubil proiavlenij slabosti u svoih Ispolnitelej. Ia pomog Taj otstupit i prislonitsia k stene rasseliny, prodolzhaia Podderzhivat ee obeimi rukami i ne pozvoliaia osest ot poluobmorochnoj slabosti. Chto zh, ia sobiralsia tuda v liubom sluchae. Eto imeet kakoe-to osoboe Znachenie? Imeet. Kak ty smeesh Ugrozhat mne? Opomnis, nedonosok, poka ia ne prevratil tebia v kuchku uglej! Kvin pomnil preduprezhdenie Gilsveri i ponimal, chto ugrozy Altaresa Bessilny, tak kak on ne mog podkrepit ih dejstviem, no takzhe ponimal, chto tot Stroit svoj raschet na neznanii Grontom realnoj situacii. \nBolee togo, on odolel maga Vestnikov tmy, silnejshego posle Samogo Vladyki Ikseduda, moshch kotorogo ne poddaetsia postizheniiu. Hranitel izumlenno vsplesnul rukami i otkinulsia na spinku stula. Ee gnev smenilsia Rasteriannostiu. A zatem mest svershitsia. ejisuminyon Q1FUW1pVckRcUFBGHUFCUEZWRlleXR1XVA==\n \n\n\n"}