{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Travis Siegel <tsiegel@softcon.com>", "subject": "Re: Definitely unslung", "body": "Well, the plan is to port speakup to this evice.\nDemo units keep getting delayed from the manufacturer though, so  \nthere's been no work done yet to test to see if speakup can be put on  \nthe units or not.\nI don't know if I'll manage the funds to purchase a demo unit  \n(they're $350) but I'm hoping to sell my house in Delaware in the  \nnext couple months, and I was planning to purchase a couple units  \nfrom those  funds.\nThat way, I can keep one, and if necessary send one to Mr. Kirk for  \nassistance in the porting process.\nNow, whether that'll happen or not I don't know, but Derrek (the guy  \nrunning the current show) is willing and even eager to see speakup  \nworking on the devices, so it's possible he'll help out if possible.\nI of course don't know that for sure, mere speculation on my part,  \nbut I get the impression he wants this to work for as many as possible.\nPlus, how many mainstream devices can claim accessibility for the  \nblind out of the box?\nEspecially a device of this nature.\nI told him that if the $350 price tag sticks, he can expect to sell  \nquite a few units if speakup works on them out of the box.\nI just *know* the blind community would love to have a pda that costs  \nthe same for us as it does for everyone else.\n\n\nOn Jun 4, 2007, at 10:01 PM, Buddy Brannan wrote:\n\n> On Mon, Jun 04, 2007 at 09:49:54PM -0500, Travis Siegel wrote:\n>> Hey.\n>> There's an ebook reader that we're working on getting produced.\n>\n> Kick ass! Think I'll hold off and wait and not get a Bookport II :)\n>\n> So, what, will it have Espeak in, or some other speech engine?\n> -- \n> Buddy Brannan, KB5ELV\n> Email: buddy@brannan.name or phone 888-75-BUDDY\n> Get a free online mall and earn on 1000 stores:\n> http://www.powermall.us\n>> From Kitchen Disaster to Culinary Master, make meals and baking\n> easier and faster: http://www.tastyshop.net\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}