{"category": "ham", "to_address": "Robert Wilkins <irishhacker@gmail.com>", "from_address": "Frank E Harrell Jr <f.harrell@vanderbilt.edu>", "subject": "Re: [R] Tools For Preparing Data For Analysis", "body": "Robert Wilkins wrote:\n> As noted on the R-project web site itself ( www.r-project.org ->\n> Manuals -> R Data Import/Export ), it can be cumbersome to prepare\n> messy and dirty data for analysis with the R tool itself. I've also\n> seen at least one S programming book (one of the yellow Springer ones)\n> that says, more briefly, the same thing.\n> The R Data Import/Export page recommends examples using SAS, Perl,\n> Python, and Java. It takes a bit of courage to say that ( when you go\n> to a corporate software web site, you'll never see a page saying \"This\n> is the type of problem that our product is not the best at, here's\n> what we suggest instead\" ). I'd like to provide a few more\n> suggestions, especially for volunteers who are willing to evaluate new\n> candidates.\n> \n> SAS is fine if you're not paying for the license out of your own\n> pocket. But maybe one reason you're using R is you don't have\n> thousands of spare dollars.\n> Using Java for data cleaning is an exercise in sado-masochism, Java\n> has a learning curve (almost) as difficult as C++.\n> \n> There are different types of data transformation, and for some data\n> preparation problems an all-purpose programming language is a good\n> choice ( i.e. Perl , or maybe Python/Ruby ). Perl, for example, has\n> excellent regular expression facilities.\n> \n> However, for some types of complex demanding data preparation\n> problems, an all-purpose programming language is a poor choice. For\n> example: cleaning up and preparing clinical lab data and adverse event\n> data - you could do it in Perl, but it would take way, way too much\n> time. A specialized programming language is needed. And since data\n> transformation is quite different from data query, SQL is not the\n> ideal solution either.\n\nWe deal with exactly those kinds of data solely using R.  R is \nexceptionally powerful for data manipulation, just a bit hard to learn. \n  Many examples are at \nhttp://biostat.mc.vanderbilt.edu/twiki/pub/Main/RS/sintro.pdf\n\nFrank\n\n> \n> There are only three statistical programming languages that are\n> well-known, all dating from the 1970s: SPSS, SAS, and S. SAS is more\n> popular than S for data cleaning.\n> \n> If you're an R user with difficult data preparation problems, frankly\n> you are out of luck, because the products I'm about to mention are\n> new, unknown, and therefore regarded as immature. And while the\n> founders of these products would be very happy if you kicked the\n> tires, most people don't like to look at brand new products. Most\n> innovators and inventers don't realize this, I've learned it the hard\n> way.\n> \n> But if you are a volunteer who likes to help out by evaluating,\n> comparing, and reporting upon new candidates, well you could certainly\n> help out R users and the developers of the products by kicking the\n> tires of these products. And there is a huge need for such volunteers.\n> \n> 1. DAP\n> This is an open source implementation of SAS.\n> The founder: Susan Bassein\n> Find it at: directory.fsf.org/math/stats (GNU GPL)\n> \n> 2. PSPP\n> This is an open source implementation of SPSS.\n> The relatively early version number might not give a good idea of how\n> mature the\n> data transformation features are, it reflects the fact that he has\n> only started doing the statistical tests.\n> The founder: Ben Pfaff, either a grad student or professor at Stanford CS dept.\n> Also at : directory.fsf.org/math/stats (GNU GPL)\n> \n> 3. Vilno\n> This uses a programming language similar to SPSS and SAS, but quite unlike S.\n> Essentially, it's a substitute for the SAS datastep, and also\n> transposes data and calculates averages and such. (No t-tests or\n> regressions in this version). I created this, during the years\n> 2001-2006 mainly. It's version 0.85, and has a fairly low bug rate, in\n> my opinion. The tarball includes about 100 or so test cases used for\n> debugging - for logical calculation errors, but not for extremely high\n> volumes of data.\n> The maintenance of Vilno has slowed down, because I am currently\n> (desparately) looking for employment. But once I've found new\n> employment and living quarters and settled in, I will continue to\n> enhance Vilno in my spare time.\n> The founder: that would be me, Robert Wilkins\n> Find it at: code.google.com/p/vilno ( GNU GPL )\n> ( In particular, the tarball at code.google.com/p/vilno/downloads/list\n> , since I have yet to figure out how to use Subversion ).\n> \n> \n> 4. Who knows?\n> It was not easy to find out about the existence of DAP and PSPP. So\n> who knows what else is out there. However, I think you'll find a lot\n> more statistics software ( regression , etc ) out there, and not so\n> much data transformation software. Not many people work on data\n> preparation software. In fact, the category is so obscure that there\n> isn't one agreed term: data cleaning , data munging , data crunching ,\n> or just getting the data ready for analysis.\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n> \n\n\n-- \nFrank E Harrell Jr   Professor and Chair           School of Medicine\n                      Department of Biostatistics   Vanderbilt University\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}