{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] Boston Globe: Senate Bill Paves Way for Generic Biologics", "body": "http://www.boston.com/business/healthcare/articles/2007/06/23/senate_bill_paves_way_for_generic_biologics/\n\nSenate bill paves way for generic biologics - Compromise aims to speed\napproval, allay drug makers' fears\n\nBy Diedtra Henderson\nBoston Globe\nJune 23, 2007\n\nWASHINGTON -- The US Senate yesterday hammered out a long-awaited bill\nthat paves the way for generic versions of the world's most expensive\ndrugs, while providing a 12-year financial cushion for local\nbiotechnology leaders who worry that such lower-priced drugs would hurt\nsales of their name-brand products.\n\nStaffers for four key senators have met for weeks, finessing the details\nof legislation to give the Food and Drug Administration new powers to\napprove generic versions of biologics -- therapies based on living\norganisms .\n\nAlready, generics that are the chemical equivalents of name-brand drugs\nsave patients and the federal government billions annually.\n\nThe compromise bill unveiled yesterday represents a delicate balancing\nact, said Senator Edward M. Kennedy , Democrat of Massachusetts .\n\nIt would speed generic biologic drugs to market by requiring fewer\nclinical trials before approval, while maintaining financial incentives\nfor such biotechnology leaders as Cambridge's Genzyme Corp. and Biogen\nIdec Inc., which funnel revenue into development pipelines to produce\nmore biologic treatments.\n\n\"Congress has a responsibility to encourage the innovation that leads to\nthese new medical miracles, and to see that they are affordable for the\npatients who need them,\" Kennedy said in a statement. \"Our bipartisan\nlegislation also includes strong and responsible incentives to encourage\ndynamic new biotechnology companies to invest in the innovations that\nwill produce the cures of tomorrow.\"\n\nAmong the most contentious issues was how long of a safe haven to give\nbranded biologics before generics could compete for the same business.\n\nBiotech companies wanted 14 years of market exclusivity. A letter signed\nby AARP and others said that \"would unnecessarily\" limit access to\naffordable drugs and \"would actually have the perverse effect of\nreducing incentives to innovate.\" Generic manufacturers and their\nsupporters said five years was sufficient.\n\nIn the end, the Senate opted for 12 years, as was strongly advocated by\nSenator Orrin Hatch , Republican of Utah . The bipartisan bill's other\nsponsors are senators Hillary Rodham Clinton , Democrat of New York ,\nand Michael Enzi , Republican of Wyoming .\n\nBut generic manufacturers are still poised to save money on their\ndevelopment costs through a speedier path to market that leverages what\nthe FDA already knows about the safety and effectiveness of the branded\nversions of biologics.\n\nIn some cases, the FDA could waive clinical trials in humans prior to\napproval, according to Kennedy's office.\n\nAlready, Novartis AG is poised to seize on the opportunity. The drug\nmaker said yesterday that its generic version of a blood-building\ntherapy drug Epoetin alfa is close to reaching the market in Europe .\nThe anemia remedy is sold under the brand names Epogen and Procrit and\naccounts for such a staggering portion of federal pharmaceutical\nspending that congressional watchdogs have eyed their marketing and\nsales growth.\n\nBut generic manufacturers like Novartis would be subject to the same\nrisk management plans contained in FDA reform legislation that passed\nthe Senate and is pending in the House.\n\nThat legislation opens the door for generic manufacturers to conduct\npost marketing clinical trials after their products are made available\nfor sale.\n\nAnother sticking point in the senators' deliberation was how pharmacists\nshould handle prescriptions for the newest generics.\n\nNow, for instance, pharmacists can fill a prescription for the\ncholesterol drug Zoo with the generic version without first consulting\nthe physician. Pharmacists could one day do the same for generic\nbiologics, under the compromise bill.\n\nThe generic manufacturer would have to prove its drug is similar to the\nname version and the FDA would have to vouch that it had sufficient\nevidence that the two products produce the same clinical result.\n\nThe Senate measure is scheduled to clear a key committee on Wednesday .\n\nDiedtra Henderson can be reached at dhenderson@globe.com.\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}