{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nTonight we’ll continue our coverage of the\n  tragedy at Virginia Tech. Bob Orr will report new details on the\n  investigation into the life of the gunman, Cho Seung-Hui. In\n  college, Cho was so introverted that his own roommates barely knew\n  him. Sharyn Alfonsi will share her interview with one of the students who\n  lived closest to Cho. \n \nMeanwhile, Attorney General Alberto Gonzales was on\n  the hot seat in a Senate hearing on the firing of eight federal prosecutors\n  who some Democrats say were improperly dismissed. Jim Axelrod will have the\n  story. And we’ll have a new CBS News poll on the\n  subject. \n \nAnd Dr. Jon LaPook will share the results of\n  research that offers the strongest evidence yet that menopause hormones could\n  raise the risk of breast cancer. Rates of the cancer plunged in 2003 after\n  millions of women stopped taking hormones and breast cancer rates stayed at\n  the lame level in 2004, adding to the evidence against use of menopause\n  hormones.\n \nAnd one day after the Supreme Court affirmed the\n  legality of the Partial Birth Abortion Ban Act, our correspondent Wyatt\n  Andrews will take a look at the impact of the ruling. It's the start of\n  what is going to be a long, intense debate.\n \nFinally, Jerry Bowen will have the story of an\n  extraordinary man battling a crippling disease. So far, he’s winning:\n  Last week he crossed the finish line of the Boston Marathon. \n \nThanks, and I hope you’ll join us tonight.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}