{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "315p 5/30 Update: Spacewalk begins", "body": "\n\n\n\n\n315p 5/30 Update: Spacewalk begins\n\n\n\n=================================\n\nCBS NEWS Coverage of Breaking Space News\nPosted: 3:10 PM PM, 5/30/07\n\nBy William Harwood\nCBS News Space Consultant\n\nChanges and additions:\n\n   05/03/07 (01:00 PM): Schirra dies\n   05/25/07 (01:15 PM): Oefelein leaving NASA, agency confirms\n   05/30/07 (03:10 PM): Spacewalk begins\n\n=================================\n\n03:10 PM, 5/30/07, Update: Spacewalk begins\n\nExpedition 15 commander Fyodor Yurchikhin and Oleg Kotov, floating in the Pirs airlock module, opened an outer hatch today at 3:05 p.m. to officially kick off a spacewalk to install micrometeoroid shielding on the Zvezda command module. The spacewalk got started about 45 miniutes late because of minor communications problems.\n\nThis is the 82nd spacewalk devoted to station assembly since construction began in 1998, the fifth of 2007 and the first for the Expedition 15 crew. Going into today's EVA, 65 shuttle/station fliers representing seven partner nations had logged 498 hours and 3 minutes of spacewalk time building and maintaining the space station. It is the first spacewalk for Yurchikhin and Kotov, the 66th and 67th crew members to float outside.\n\nFor identification, Yurchikhin's call sign is EV-1 and his suit features red stripes. Kotov, wearing a suit with blue stripes, is EV-2. Astronaut Sunita Williams , a veteran of four spacewalks, will monitor today's excursion from inside the station.\n\n\"How is everything outside, guys, is everything fine?\" a Russian flight controller radioed as the Russians began setting up their tools and equipment.\n\n\"It's kind of cloudy,\" one of the spacewalkers joked. \"It's going to be raining probably. We didn't take an umbrella with us.\"\n\nThe goal of Russian EVA-18 is to install micrometeoroid debris panels on the forward section of the Zvezda command module. Six panels were installed in 2002 and Yurchikhin and Kotov plan to attach another five today. The panels measure about two feet by three feet, are about one inch thick and weigh between 15 and 20 pounds each. Twelve more panels will be installed during a spacewalk next Wednesday.\n\n\"These panels are to provide additional debris protection on the service module,\" said flight director Bob Dempsey. \"Some have already been installed on a previous spacewalk and we're going to complete this task on the next two spacewalks. This will provide additional debris protection on that (part) of the service module in the unlikely event some micrometeoroid debris should impact it.\"\n\nThe debris panels are mounted in three bundles on a pressurized mating adapter bolted to the Unity module's left-portal. Yurchikhin and Kotov will use a telescoping Russian boom to move the panels from Unity to the forward section of the Zvezda module. The cosmonauts also plan to work at the back of the command module to re-route a cable leading to a Global Positioning System antenna that eventually will provide navigation data to unmanned European Space Agency cargo ships.\n\nAt the Kennedy Space Center today, NASA managers kicked off a two-day flight readiness review to assess the status of work to prepare the shuttle Atlantis for blastoff June 8. A news conference to discuss the results and to announce an official launch date is planned for Thursday afternoon.\n\nIf all goes well, Atlantis' countdown will begin at 9 p.m. Tuesday, the station astronauts will conduct Russian EVA-19 the following day and two days after that, Atlantis will finally take off on a critical mission to deliver a new set of solar arrays. Launch originally was planned for March 15, but the flight was delayed by work to repair hail damage to the insulation on the ship's external fuel tank.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}