{"category": "spam", "to_address": "smiles@speedy.uwaterloo.ca", "from_address": "Mr.Edward.A@speedy.uwaterloo.ca, Lamptey <edwardclamptey@yahoo.fr>", "subject": "YOUR URGENT ASSISTANCE IS NEEDED", "body": "DEAREST,\n\nMY NAME IS MR.EDWARD LAMPTEY\n\nI AM WRITING IN RESPECT OF A FOREIGN CUSTOMER OF MY BANK PAUL PHILLIP,WHO PERISHED IN AN AUTO ACCIDENT WITH HIS ENTIRE FAMILY IN OCTOBER\n1999.\n\nSIR/MADAM, SINCE THE DEMISE OF PAUL PHILLIP, I PERSONALLY HAVE WATCHED\nWITH KEEN INTEREST TO SEE THE NEXT OF KIN BUT ALL HAS PROVED ABORTIVE AS NO\nONE HAS COME TO CLAIM HIS FUNDS OF USD12.5M,[TWELVE MILLION FIVE HUNDRED\nTHOUSAND UNITED STATES DOLLARS]HAS BEEN WITH OUR BANK HERE FOR A VERY LONG\nTIME.\n\nON THIS NOTE I DECIDED TO SEEK FOR WHOM HIS NAME SHALL BE USED AS THE\nNEXT OF KIN, AS NO ONE HAS COME UP TO PUT CLAIM AS THE NEXT OF KIN TO THIS\nFUNDS AND THE BANKING ETHICS HERE DOES NOT ALLOW SUCH MONEY TO STAY MORE THAN\nSEVEN YEARS, BECAUSE AFTER SEVEN YEARS THE MONEY WILL BE CALLED BACK TO THE\nBANK TREASURY AS UNCLAIMED BILL.\n\nIN VIEW OF THIS I GOT YOUR CONTACT THROUGH MY COUNTRY'S FOREIGN TRADE\nMISSION AFTER I WAS CONVINCED IN MY MIND THAT YOUR NAME/COMPANY COULD BE USED\nAS THE NEXT OF KIN TO THIS CLAIM. THE REQUEST OF THE FOREIGNER AS A NEXT OF\nKIN THIS BUSINESS IS OCCASIONED BY THE FACT THAT THE CUSTOMER WAS A FOREIGNER\nAND A GHANAIAN CANNOT STAND AS THE NEXT OF KIN TO A FOREIGNER.\n\nI AGREED THAT 30% OF THIS MONEY WILL BE FOR YOU AS A FOREIGN PARTNER IN\nRESPECT OF PROVIDING AN ACCOUNT WHILE 10% WILL TAKE CARE OF ANY\nEXPENSES THAT MIGHT BE INCURRED IN THE PROCESS OF TRANSFERRING THIS FUNDS AND\nTHE REST WILL BE FOR ME AND MY COLLEAGUE THEREAFTER I WILL VISIT YOUR COUNTRY\nFOR DISBURSEMENT AS I AM ALMOST DUE FOR RETIREMENT.\n\nUPON THE RECEIPT OF YOUR ACCEPTANCE, I WILL SEND YOU BY FAX OR E-MAIL A\nDRAFT APPLICATION OF CLAIM WHICH YOU WILL SEND TO THE BANK AS THE NEXT OF KIN\nAND THE NEXT STEP TO TAKE.\n\nI WILL NOT FAIL TO BRING TO YOUR NOTICE THAT THIS BUSINESS IS HITCH\nFREE AND THAT YOU SHOULD NOT ENTERTAIN ANY FEAR AS THE WHOLE REQUIRED\nARRANGEMENT HAS BEEN PERFECTED FOR THE TRANSFER.\n\nPLEASE SEND ME THE FOLLOWING INFORMATIONS:\n\n1, FULL NAME\n\n2, ADDRESSES\n\n3, PHONE NUMBER\n\n4, OCCUPATION\n\n5 DATES OF BIRTH\n\n\n\nHOPING TO HEAR FROM YOU.\n\nREGARDS,\nMR.EDWARD LAMPTEY\n\n\n\n"}