{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTUESDAY 10 APRIL 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello, \n\n\n\n\t\t\t\t\t\tToday's Quote for the Day:\n\n\n\"Raising children is like being taken hostage by midget terrorists\" -  Ben Elton.\n\n\nIn tonight's programme:\n\n\nIRAN\n\n\nIran seems set to be the big story of 2007. We're pursuing two strands tonight: who precisely decided what could be said by the Royal Navy personnel held by the Iranian regime? Is anyone likely to carry the can for the public relations fiasco? \n\n\nAnd - perhaps much more significant in the long run - given Iran's boast that it is now capable of industrial production of nuclear fuel, is it time to admit that the European strategy of engagement with the Islamic regime has failed? And if so - is there a Plan B?\n\n\nPAEDOPHILES \n\n\nI confess that despite reading and listening to commentaries about how the new pilot scheme on providing information on paedophiles is supposed to work, I am personally none the wiser. \n\n\nPerhaps enlightenment will set in by 10.30pm, but it is also possible that the scheme is incomprehensible. We'll try to find out. \n\n\nINTELLECTUAL PROPERTY\n\n\nThe new interim Thai Government, which is struggling with plunging popularity and the task of restoring democracy, has stunned its main trading partner, the US, by declaring war on the big pharmaceutical companies. \n\n\nThe Health Minister has issued Thailand's first compulsory licences, breaking the patents on two HIV/AIDS drugs and one heart drug, and is preparing to do the same with several other durgs in order to cut the country's healthcare costs. Will they get away with it?\n\n\nYOUTUBE\n\n\nWebsites such as YouTube have come under fire today for not doing enough to discourage cyber-bullies. In tonight's programme, we'll attempt to redress some of the negative press new technology has been getting. \n\n\nWe'll look at some of the creative efforts the technology has been unleashing, and the increasing craze on sites such as YouTube for posting re-enactments of famous scenes from films.\n\n\nAND FINALLY \n\n\nI'm indebted - I think that is the correct word - to Peter Walker for this Easter Joke Fit for an Eleven Year Old: \n\n\n...what do you get if you throw boiling water down a rabbit hole...?\n\n\n...you get a hot cross bunny...!\n\n\nNewsnight is at 10.30pm on BBC2.\n\n\nGavin \n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}