{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Police have preliminary ID of campus gunman", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApr 17, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nPolice have preliminary ID of campus gunman\n\n\n\n\n\nPolice have a preliminary identification of the man who methodically shot and\nkilled at least 30 people on the campus of Virginia Tech, but they are not yet\nready to release it.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOfficials thought killer left campus after first shooting\n\n\n\n\n\nOfficials at Virginia Tech said Monday that they thought the situation was\nunder control during the hours between two shootings that claimed 33 lives.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nStorm wallops Northeast for second day\n\n\n\n\n\nA menacing spring storm punished the Northeast for a second straight day\nMonday, dumping more than 8 inches of rain on Central Park and sending\nrefrigerators and pickup trucks floating down rivers in one of the region's\nworst storms in recent memory.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClosely-watched terror trial begins in Miami\n\n\n\n\n\nJury selection began Monday for the trial of alleged al Qaeda operative Jose\nPadilla and two co-defendants, with potential jurors questioned about their\nknowledge of Padilla's link to a purported \"dirty bomb\" plot.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPolice: Northwest pilot on cocaine, driving wrong way\n\n\n\n\n\nAn off-duty Northwest Airlines pilot was suspected of driving under the\ninfluence of cocaine when he headed the wrong way on an interstate to avoid\nthe U.S.-Canada border and led deputies on a chase, authorities said Sunday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPolice: Man faces murder charges for fire that killed 5 kids\n\n\n\n\n\nA man was arrested on charges of setting his cousin's house on fire in western\nIllinois early Sunday and killing her five children, authorities and a\nrelative said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nIraq dean, professor killed\n\n\n\n\n\nGunmen killed the dean of the Political Science College and a professor at\nMosul University's College of Arts on Monday, authorities said, topping a\nseries of violent incidents. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWitness survives by pretending to be dead\n\n\n\n\n\nA gunman who killed at least 30 people in one of two shootings on the campus\nof Virginia Tech was dressed \"almost like a Boy Scout,\" said a student who\nsurvived by pretending to lie dead on a classroom floor. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWar crimes trial opens for former Macedonian minister\n\n\n\n\n\nRami Jusufi was asleep when Macedonian police forced their way into his\nparents' yard on August 12, 2001. As he walked to his front door, still\nwearing his pajamas, he was shot in the stomach, U.N. prosecutors said Monday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n'Desperate' fears on BBC reporter\n\n\n\n\n\nThe parents of BBC reporter Alan Johnston, who was kidnapped last month in\nGaza, have appealed for news of his condition after an unknown militant group\nsaid it had killed him.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nThe surprising profits of student loans\n\n\n\n\n\nLate Sunday night, student loan giant Sallie Mae, or SLM Corp. as the company\nis officially known, became the latest major American corporation to succumb\nto the advances of private equity. Sallie will be sold to a consortium of two\nprivate equity firms - JC Flowers and Friedman Fleischer & Lowe - and two\nbanks that have their own student loan businesses - JP Morgan and Bank of\nAmerica - for some $60 a share, or $25 billion. That represents a premium of\nalmost 50 percent based on Sallie's stock price before word of the deal began\nto leak.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStocks soar on earnings, deals\n\n\n\n\n\nStocks rallied Monday, spurred by strong results in the financial sector,\nmerger activity and an economic report that underscored the resilience of U.S.\nconsumers.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nMarty Burns: Final Power Rankings of regular season\n\n\n\n\n\nThe 2006-07 regular season ends Wednesday. That means it's time to take a\nfinal look back at the season and see how the 30 teams stacked up. In other\nwords, it's time for the final edition of Power Rankings.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLightning stun Devils, take 2-1 lead in series\n\n\n\n\n\nTAMPA, Fla. (AP) -- Martin Brodeur made the tough saves. Keeping fluky shots\nout of the net was another matter.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nOn the road? Don't skip your workout\n\n\n\n\n\nEarly morning meetings and late-night business dinners make it almost\nimpossible for Trisha Curtin to fit in a workout on the road. \"It's been a\nhuge challenge to do any type of exercising other than walking from building\nto building,\" says Curtin, who works in planning and distribution for a\ndepartment store. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKids with head injury apt to have another\n\n\n\n\n\nChildren who suffer a head injury are quite likely to have a similar injury\nsubsequently, researchers report.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nVirtual vines grow on world wine web\n\n\n\n\n\nDavid Dain Smith lives in Missouri, but his California winery is just a click\naway, waiting to spring to life in the dim glow of his computer screen.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRobotic trio wins 'Super Bowl of Smarts'\n\n\n\n\n\nAfter six weeks of strategy and sweat, a coalition of high school teams from\nConnecticut, Massachusetts and Nevada took the top prize at the FIRST Robotics\ncompetition, otherwise known as the \"Superbowl of Smarts.\"\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nMcCarthy's 'Road' wins Pulitzer\n\n\n\n\n\nWarwic McCarthy, whose novel \"The Road\" was recently chosen by Oprah Winfrey\nfor her book club, has added another honor: \"The Road\" won the Pulitzer Prize\nfor fiction Monday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfter Imus storm, rap at the fore\n\n\n\n\n\nFighting in vain to keep his job, radio host Don Imus claimed that rappers\nroutinely \"defame and demean black women\" and call them \"worse names than I\never did.\"\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}