{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Ramiro Melvin\" <pifchallandgew@challand.org>", "subject": "Join the Anatrim revolution", "body": "\nWatch the pounds disappear\n\n\n\n\n\n\nAnatrim – The newest and most fascinating flesh loss product is now available – As you could see on Oprah.\n\n\nDo you count up all the cases when you asked yourself to do anything to get rid of this desperately growing number of kilos? Luckily, now no major sacrifice is expected. Thanks to Anatrim, the earth-shaking kilos-melting combination of elements, you can get naturally health mode of life and become really slimmer. Just look at what our customers state!\n\n\n\n\"I hate to confess but I was awfully addicted to food. \n\n\nI ate all this rubbish \n\n\nand could not stop. \n\n\n\n\nThis fatal passion passed away when I started course with Anatrim! \n\n\nOh, God,\n\n\n\n\n my craving for food vanished, \n\n\nmood improved and I turned to the happiest person on the planet 29 pounds in 2.1 months. \n\n\n\n\nI can tell you now I turned to the happiest person!\"\n\n\n\n\n\nAmelia B., New York\n\n\n\n\n\n\"Since my early childhood I was a weighty boy. \n\n\nYou can't even fancy how I abhorred being derided at school. \n\n\n\n\nI hated my stoutness and I detested even myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nThis stuff literally pulled me out of this terrible nightmare! Many and many thanks to you, fellows.\"\n\n\n\n\n\nSteve Burbon, San Diego\n\n\n\n\n\n\"Know what? Anatrim preserved my marriage! I fell down into this circle, depression – eating more – even more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nOne of my friends pointed to your web page and I ordered Anatrim at the time. \n\n\nThe results were great, my appetite became normal, I was in good spirits oftener, and, certainly, I tightened my belt with no regrets. And the sex became fantastic, too!\"\n\n\n\n\n\nFrancis\n\n\n\n\n There are lots of testimonials left by delighted people trying Anatrim. Why don't you join the thousands and thousands of slender women and men and take this natural appetite-abating power increasing product now!\n\n\nDo not miss your opportunity!\n\n\n\n\n"}