{"category": "spam", "to_address": "depositinfo@wapicode.com", "from_address": "\"depositinfo@wapicode.com\" <depositinfo@wapicode.com>", "subject": "FORFEITURE NOTICE", "body": "This is for your Attention\n \nI am Frank Pepple Attorney at Law and I have a proposal to discuss with you, concerning an abandoned fixed deposit which has remained \nUnclaimed Since 1999. I was informed by the Bank that the deposit will be converted to UNCLAIMED DEPOSIT and therefore forfeited if not \nclaimed before the end of this financial quarter, as is the practice and also indicated in the European Union banking guidelines.\nThe owner (My Client) died without a next of kin. I was the attorney to the Deposit when it was made and as at the last update, it \namounted to about $14.6 Million dollars in the year 2005.\n\nIf no one comes forward to claim before the end of this quarter, the funds shall be regarded as unclaimed deposit and therefore \nforfeited. I do not want this to happen hence, I am willing to share the inheritance with you on a 50/50 basis rather than lose \neverything. \n\nI now seek your understanding to present you as the new beneficiary to the amount since you share the same last Name. Do not be bothered, \nas we will carefully and legally work out all necessary documents in your favour and pursue the process within required local and \ninternational legal boundaries.\n \nAfter the sharing, you may assist me in investing part of my share in your line of Business and under your supervision.\nOn your acceptance of this deal, you should send a letter of acceptance on your company Letterhead either by fax or email to the numbers \nor email below with the following details which will be used to process the payment application in your favour. \n\n(1). Beneficiary Name and or Company Name (2). Contact Address, Office, and Home telephone and fax # (3). Age and Occupation\n \nI await your URGENT Response.\n\nRegards,\n\nFrank Pepple\nMiddlessex, UK\nTel./Fax:  +44 871 715 0539\n\n________________________________________________________________________\nView more information about \"depositinfo\" at http://depositinfo.wapicode.com\nAccess this mail at http://www.wapicode.com using your e-mail address to Login\n\n"}