{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "60 Minutes Newsletter <newsletter_sixty_minutes-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "60 Minutes E-mail Alert", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nGovernment incompetence in today's post-9/11 world is a serious \n      matter. That's why correspondent \n      Steve Kroft's lead report on a bungled $24 billion modernization \n      program for the U.S. Coast Guard is so important: the maritime force is \n      responsible for protecting 95,000 miles of shoreline and 361 ports against \n      terrorism. Five years into a project that was supposed to strengthen it by \n      more than 200 ships and boats, the Coast Guard fleet is smaller and less \n      able to perform its mission for the Department of Homeland Security, says \n      the chairman of the congressional committee with Coast Guard oversight. \n      Rep. Elijah Cummings (D-Md.) tells Kroft the program, dubbed \"Deepwater,\" \n      is a \"mess.\" It's a mess because the Coast Guard decided to let a joint \n      venture of defense contractors, which then hired its own companies, manage \n      Deepwater, says the former head of the Coast Guard's Logistics and \n      Engineering Department, retired Capt. Kevin Jarvis. \"People say that this \n      is like the fox watching the henhouse and it's worse than that,\" says \n      Jarvis. \"It's where the government asked the fox to develop the security \n      system for the henhouse, then told them 'By the way, we'll give you the \n      security code to the system and we'll tell you when we're on \n      vacation.'\"\n \nWatch an excerpt of \n      Kroft's report.\n \nOur \n      second story is hard to believe, yet advocates for the homeless say it's \n      been going on for years. In fact, it's happened so many times in Los Angeles that \n      cameras have been set up near homeless shelters to catch it on tape, \n      because it's illegal as well as immoral. It's called \"hospital dumping.\" \n      Hospitals put homeless patients in a van or a taxi and drop them on the \n      city's Skid Row, sometimes dressed in only a flimsy gown, even \n      if they're not healthy enough to fend for themselves. CNN's Anderson Cooper reports on one \n      especially egregious case of a paraplegic left off by an uncaring van \n      driver to crawl on his hands in the street. Says Los Angeles City Attorney \n      Rocky Delgadillo, \"These may be the perfect victims. Because a homeless \n      individual dumped on skid row disappears into the chaos of skid row within \n      minutes. It's hard for us to find them, and then get the evidence that we \n      need.\"\n \nWatch an excerpt of \n      Cooper's report. \n \nImagine every child, everywhere, owning a laptop computer. Well, \n      for MIT Prof. Nicholas Negroponte, it is a goal he admits he may not \n      achieve in total, but he's on his way as correspondent Lesley Stahl \n      reports in our third segment. He's raised the money from rich companies \n      like Google and has designed a cheap, child-proof laptop he's testing with \n      kids in places like Brazil. Negroponte thinks his \n      \"One Laptop Per Child\" project can make a difference, especially in \n      countries where half the kids don't even go to school. \"If they don't go \n      to school, this is school in a box,\" he says. \n \nWatch \n      Stahl's Reporter's Notebook.\n \nThese stories and Andy \n      Rooney's new ideas about old books on 60 Minutes.\n \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}