{"category": "ham", "to_address": "perl6-internals@perl.org, Allison Randal <allison@perl.org>", "from_address": "James E Keenan <jkeen_via_google@yahoo.com>", "subject": "Re: Is Parrot 1.0 too late?", "body": "Allison Randal wrote:\n> Nicholas Clark wrote:\n> \n>>\n>> I guess that the most obvious current thing that ties Parrot to the Perl\n>> community is that Parrot requires a copy of Perl to bootstrap, and all \n>> the\n>> build tools are written in Perl 5.\n> \n> \n> This is slated to change before the 1.0 release.\n> \n\nSince November I've been working on maintaining those of Parrot's \nconfiguration and build tools written in Perl 5.  Lately I've been \ntrying to recruit others to help in that process.  The discussion in \nthis thread suggests that at some future point some or all of the Perl \nscripts/modules I've been working on will be replaced with ... something \nelse.\n\nThis, of course, makes me wonder what I'm doing now and, more \nimportantly, makes me wonder what to say to other people with Perl 5 \nskills who want to help with the Parrot project.\n\nThis is not simply an ego thing on my part.  I've written very little of \nthe Perl 5 tools and taken on maintenance of a bit more, but one thing I \nrealize is how much of Parrot's source code is written in Perl 5.  How \nmuch of that must eventually be replaced?\n\nAnd who is going to maintain it?  In my experience Perl 5 programmers \nare relatively abundant while C programmers (these days) are rarer.  How \nmany people might actually learn the yet-to-be-designed HLL that would \npresumably replace a lot of the Perl 5 we currently use?\n\nSo, can someone draw a roadmap of:\n\n-- *which parts* of Parrot's configuration and build tools *need* to be \nreplaced with something else;\n\n-- *why* that replacement is necessary;\n\n-- *when* in the design process that replacement must take place; and\n\n-- *how* that replacement will be maintained going forward from there?\n\nIf this is already discussed in some of the design documents, I would \nappreciate a link.  Thank you very much.\n\nkid51\n\n"}