{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Edward Meadows\" <pytconferencecorkbaq@conferencecork.com>", "subject": "Achieve picture perfect weight and enjoy life", "body": "\nCheck out the wonders of pound melting\n\n\n\n\n\n\nAnatrim – The newest and most delighting flesh loss product is now readily available – As shown on Oprah.\n\n\nDo you hold in your memory all the situations when you said to yourself you would do any thing for being delivered from this desperately growing number of kilos? Luckily, now no major price is to be paid. With Anatrim, the ground-breaking pound-melting medley, you can achieve healthier mode of life and become really slimmer. Just look at what people say!\n\n\n\n\"It’s quite difficult to acknowledge it but I was an awful food addict. \n\n\nI ate all this trash \n\n\nand just could not stop. \n\n\n\n\nThis misery left off after I started taking Anatrim! \n\n\nGod,\n\n\n\n\n my inclination to eat constantly abated, \n\n\nspirits increased and I’m the happiest person 26 pounds in 2.9 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person!\"\n\n\n\n\n\nAmelia B., New York\n\n\n\n\n\n\"I had weight problems since I was a boy. \n\n\nYou can't imagine how I abhorred being mocked at school. \n\n\n\n\nI hated my stoutness and I detested even myself. \n\n\nAfter trying this and that I heard about Anatrim. \n\n\n\n\nThis stuff literally pulled me out of this fearful nightmare! Lots of thanks to you, guys.\"\n\n\n\n\n\nSteve Burbon, Chicago\n\n\n\n\n\n\"Do you know what? My marriage was saved thanks to Anatrim! I got into this circle, depression – more eating – more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nOne my best friend pointed to your web page and I ordered pack of Anatrim at the time. \n\n\nThe final result was excellent, my appetite came to acceptable level, I was often in a good mood, and, of course, I tightened my belt with no regrets. And you see me, the bed became cool also!\"\n\n\n\n\n\nSteve\n\n\n\n\n There is a great number of gratitudes happy people leave after trying Anatrim. Don’t you gonna join the thousands and thousands of slim clients and try this natural appetite-abating energy boosting product now!\n\n\nDon’t lose the chance!\n\n\n\n\n"}