{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "Were you re-engaged?", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWEDNESDAY 30 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tPETER BARRON, EDITOR\n\t\t\t\t\t\n\n\n\n\n\t\t\t\t\t\tTwo Shags' replacement? Well whoop-de-doo. Deprived of a leadership contest...the TV news people lined up a load of people we've never heard of and couldn't care less about...presumably to see who'd be best placed for a role that has no actual, er, role. (Read the rest of the blog here)\n\n\nThat was one view on the blogs this morning of Newsnight's Labour deputy leadership debate, but I must say it was very much in the minority. We'd debated among ourselves how much interest there'd be in a deputy leadership debate. Would an unmanageably large line-up of six contenders simply agree to agree on the key issues, the loser being the viewer?\n\n\nBut then we invited you to let us know questions you'd like Jeremy to ask, and hundreds of you obliged which you can read here. Thousands have already taken part in the post-match vote (click here to vote) and a healthy audience of more than a million watched the late-night debate from beginning to end (watch the podcast here).\n\n\nCould it be that the slightly unglamorous Labour deputy leadership debate is re-engaging the public's interest in politics?\n\n\nPeter Barron is editor of Newsnight\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}