{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] Reuters: Thailand to Override More Patented Drugs, Says Minister", "body": "http://www.alertnet.org/thenews/newsdesk/BKK226088.htm\n\nThailand to override more patented drugs-minister\n\nBy Chalathip Thirasoonthrakul\n\nBANGKOK, May 28 (Reuters) - Thailand, which has overridden international\npatents on three drugs in the past year, plans to issue two more local\nlicences this year for copycat versions of medicines, Health Minister\nMongkol na Songkhla said on Monday.\n\nThe new licenses would be for the country's top killing diseases,\nespecially cancer, Mongkol told reporters, but declined to name them.\n\n\"In the remaining six months I have left, we will do it on the drugs\nthat are needed to save the lives of the poor,\" said Mongkol, referring\nto the term of the interim army-appointed government due to expire after\nelections in December.\n\n\"Altogether, we will impose compulsory licensing on up to five necessary\ndrugs,\" said Mongkol, who failed to win a sympathetic ear from trade\nofficials in Washington last week.\n\nThailand is negotiating with French and American makers of two HIV/AIDS\ndrugs and a heart medicine to lower their prices after Bangkok overrode\npatents.\n\nThe compulsory licensing, which Thailand says is legal under the World\nTrade Organisation's rules, has drawn flak from global drug makers and\nWashington, but applause from HIV/AIDS advocacy groups.\n\nMongkol urged drug companies to charge a range of prices for one\nmedicine so that rich and poor would have the same access to the same drug.\n\n\"This is not a threat, but an appeal to the drug companies to have\nsympathy for the poor. One price for the rich and one price for the\npoor. At the end, it will be win-win for everyone.\"\n\nMongkol said there was progress in haggling with two makers of the three\ndrugs to get prices down closer to their generic equivalents, but not\nwith Abbott Laboratories , which makes the HIV/AIDS drug Kaletra.\n\nAbbott refused to budge on its offer of $1,000 per patient per year for\na heat-stable version of the drug during negotiations with Thai\nofficials this month.\n\nAluvia is needed badly in tropical Thailand because it does not require\nrefrigeration like Kaletra, eliminating the need for costly cold storage.\n\nAbbott recently cut its price for Kaletra and Aluvia to $1,000 per\npatient per year in 40 low- and middle-income countries, but Thailand\nsays it is still too expensive.\n\nMongkol said Thailand would not scrap compulsory licensing on the three\ndrugs even if the patent owners agreed to sell their products at prices\nclose to generic ones because the rules allowed Thailand to buy generic\nversions.\n\n\"We can't leave generic drugs out of our purchases. Without them,\npatented drug makers will put price pressure on us again,\" Mongkol said.\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}