{"category": "ham", "to_address": "<debian-desktop@lists.debian.org>", "from_address": "\"Shelton Langston\" <Monteyorke@madshenning.com>", "subject": "FW:  We Will Pay You ForT his", "body": "Hi Debian-desktop.\n\n\n\n sehr geehrte Herr/ Frau! Mein Name ist  Aleksandr Solomko, ich bin Geschaeftsfuerender Gesellschafter  (SoftJoin Co). \nWir spezialisieren uns auf angewandte Entwicklung,\nSystemintegration, korporativen Netze und andere Software fuer \nverschiedenen Loesungen der Geschaefts - und Finanzproblemen.\nMeine Geselslchaft wurde in Ukraine gegruendet, und jetzt oeffnen wir \neines neue Buero im Lettland. Wir haben mit vielen europaeschen und \nnordamerikanischen\nGesellschaften im Softwarebereich zusammengearbeitet, Unsere &nbs p;Gesellschaft hat einen gute Ruf. \n\n\nLeider haben wir einige Schwierigkeiten mit Zahlungserhalten fuer \nunseren Service. Gewoehnlich bekommen  wir Ihre Zahlungen in 20-30 \nTagen. Wir haben keine\nZeit, um jede Postanweisung anzunehmen, auch koennen wir keine Bankschecks und Ueberweisungen annehmen. Deswegen suchne wir Partner in \nIhrem Land, die uns\nhelfen koennen und diese Bezahlungen bearbeiten koennen.\n \n\n\nWenn Sie einen gute Nebenverdienst suchen, koennen Sie unseren \nVertreter  in Ihrem Land werden. Als unsere Partner bek ommen Sie 8% von \njede ausfuerenden\nArbeit.\nUnsere Partner muessen Postanweisungen, Ueberweisungen und Banksscheks \nannehmen und diese uns schicken. Unsere Vertreter haben bequemen \nArbeitsablauf-plan\nund einen gute Nebenverdienst.  Wir planen auch eine Eroeffnung des \nBueros in absehbarer Zukunft in Ihrem Land, und Sie haben einige \nVorrechte,\nhauptamtliche Arbeit ebkommen. Das muessen Sie entscheiden.\n\n\nWir freuen uns, wenn Sie sic hfuer unsere Business interessieren. \nSetzen Sie sich  bitte in Verbindung mit mir fuer& nbsp;zusaetzliche \nInformation.\nmailto:softjoincoua@aim.com\nSenden Sie bitte folgende Information:\n\n1.Vorname, Name ( fuer ihre Zusammenfassung ).\n2.Bildung.\n3.Ihre Adresse.\n4.Kontaktstelefonnummer/ Fax.\n5.Ihre Beschaeftigung momentan.\n6.Alter.\n\n\n\nAntworten Sie bitte uns, und wir gewaehren zusaetzliche Einzelheiten \nund Information ueber unsere Gesellschaft und wie Sie unsere Vertreter \nsein koennen.\nDiees Eingliederung zu uns und zu unseres Business ist heutzutage \nkostenlos, aber Sie bekommen eine Moeglichkeit Geld zu verdienen. Rasch \nund muehelos!\n \nWenn Sie verschiedenartige Fragen haben, sind Sie bitte nicht verlege n. \nSchreiben Sie uns, und wira ntworten sehr gerne.\n\n \nMit besten Gruessen!\nHochachtungsvoll,  Aleksandr Solomko.\n\n\n\nWed, 30 May 2007 05:12:31 +0700\n\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}