{"category": "ham", "to_address": "\"General Copyright Discussions (questions, organizing,\n\tetc)\" <discuss@list.digital-copyright.ca>", "from_address": "Darryl Moore <darryl@mfe.ca>", "subject": "Re: [d@DCC] Mixed feelings about \"DVD DRM row sparks user rebellion\"", "body": "Russell McOrmond wrote:\n> Darryl Moore wrote:\n>  > In particular, you think that what happened at Digg will only be of\n>  > value if it translates into some political action, without realizing\n>  > that what happened at Digg WAS A POLITICAL ACTION. It was the most basic\n>  > grass roots political action on earth. People were taking direct action\n>  > to influence policy that they felt strongly about.\n> \n>    It influenced the policy of Digg, a pretty modern and obviously\n> Web2.0 aware company, not the policy of the government.  Who a political\n> action is aimed at matters.\n> \n>  > Why do you think so many people flout\n>  > the law and download movies and music so openly?\n> \n>    Because they believe (IMHO correctly) that they are more likely to\n> get hit by lightning than get caught for this infringement.  They are\n> seen as doing it because they can get away with it, not because they\n> have something substantive to say about the underlying laws.\n> \n> \n\nBut if the people had any respect for the law they would obey it. So \nmany millions of people using p2p to acquire unauthorized works can't \nall be wrong.\n\nIn my community it is illegal to throw out recyclables. Trash gets \npicked up every week but recyclables only every other. It would be a lot \neasier to toss the recyclables and the risk of getting caught is \npractically nil, yet just about everyone recycles. Why? Because they \nagree with the law.\n\nSo yes, I agree they think the risk of getting caught is low, but they \nwould not even be taking that risk if they thought they were wrong to do \nit in the forst place.\n\nAlso, I still think your definition of \"political\" is too narrow. With \ncompanies gaining greater and greater control of so much social policy \nin the world, it is very important to recognize actions that influence \ncorporate policy are just as political as ones affecting government policy.\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}