{"category": "ham", "to_address": "\"Arne Brutschy\" <abr-r-project@xylon.de>", "from_address": "\"hadley wickham\" <h.wickham@gmail.com>", "subject": "Re: [R] Visualize quartiles of plot line", "body": "On 6/17/07, Arne Brutschy  wrote:\n> Hi,\n>\n> h> How about quantile regression? Have a look at\n> h> http://had.co.nz/ggplot2/stat_quantile.html for some examples of\n> h> what that might look like.\n> I tried the ggplot2 package, it seems to be quite powerful. But\n> documentation is only partially available, so I'm having some problems\n> creating the graphs at all.\n>\n> First of all, where can I find the diamonds and dsmall data? I cannot\n> recreate the samples given in the documentation.\n\nThe diamonds dataset is available from the ggplot2 package, and the\ndsmall dataset is usually created as needed - dsmall <-\ndiamonds[sample(1:nrow(diamonds), 1000), ]\n\n> I'm currently using a simple smoother to display the tendency of the\n> data and it's stderr. For some reason, it works only for simple\n> colors:\n>\n> p <- ggplot(data, aes(x=Problemsize, y=Fitness)) +\n>   geom_smooth(fill=alpha(\"blue\", 0.2), colour=\"darkblue\", size=2)\n>\n> This does only display a line, not the surrounding stderr. When I\n> change the fill atrribute to \"blue\" or \"grey80\" without the alpha, the\n> stderr gets displayed.\n\nAs I said in the other email, this is a known restriction of the\nwindows graphics device.\n\n> Additionally, I want to display three different models by this, each\n> with a differen curve/stderr fill color. How do I do that? I tried so\n> set color=Model, which yields only a single line.\n\nIt's hard to know without know more about the structure of your\ndataset.  Including colour=factor(Model) in the aes statement may do\nwhat you need.\n\n> On another plot, I want to use a single model to be displayed with\n> points colored by a gradient depending on a third property:\n>\n> p <- ggplot(data, aes(x=Problemsize, y=Fitness), color=DeltaConfig) +\n>   geom_smooth(size=1, color=\"black\", fill=\"grey80\")+\n>   geom_point(size=0.5)+\n>   scale_colour_gradient(limits=c(0,10), low=\"red\", high=\"white\")\n>\n> This does not work, I think the connection between goem_point and\n> DeltaConfig is not there. But when I try to set\n>\n>   geom_point(size=0.5, color=DeltaConfig)+\n\nColour needs to be inside the aes function - you are mapping colour to\nthe DeltaConfig variable, not setting colour to a fixed variable.\n\n> it complains about an unknown DeltaConfig object.\n>\n> Hmm, I guess I don't fully understand this 'grammar of graphics'\n> thing. But documentation is quite inconsistent. :( And, the coloring\n> thing seems to be a bug. BTW, I'm using R 2.5.0 on windows.\n\nYou might want to read the introductory chapters in the ggplot book,\navailable from http://had.co.nz/ggplot2, which will give you more of a\nbackground.  Please let me know places where you think the\ndocumentation is inconsistent so I can try and make them better.\n\nHadley\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}