{"category": "ham", "to_address": "Yuchen Luo <realityrandom@gmail.com>", "from_address": "Duncan Murdoch <murdoch@stats.uwo.ca>", "subject": "Re: [R] Setting up a blank table with column names in the hard drive", "body": "Yuchen Luo wrote:\n> Dear Friends.\n> Greetings!\n>\n> This should be a very common operation and I believe there should be a nice\n> way in R to handle it.  I couldn't find it in the manual or by searching on\n> line. I am wondering if I could ask for some help in this community.\n>\n>\n>\n> I am trying to record the results of my program to a csv file in the hard\n> drive so as to save memory space and also to read the results in excel after\n> running the program.  Every loop of my program will result in a list with\n> element belonging to different class. For example, things like\n>\n>\n>\n> a1 <- list(name=\"Fred\", wife=\"Mary\", no.children=3)\n> a2 <- list(name=\"Tom\", wife=\"Joy\", no.children=9)\n> a3 <- list(name=\"Paul\", wife=\"Alic\", no.children=5)\n>\n>\n>\n> I want the columns to have titles, in the example above, I want to see the\n> title \"name\", \"wife\" and \"no.children\" in the excel file.\n>\n>\n>\n> To set up the table in the csv file, I need to add at least one row in the\n> table up front. How ever, I do not have the first loop of the program\n> completed yet at that time. If I add a row that is meaningless, how may I\n> delete it after all the loops are completed and all the meaningful rows are\n> added to the table?\n>\n>   \nI'd use data frames rather than plain lists for the results, so \nwrite.csv will work.\n\nCreate a data frame with 0 rows, and write it out:  this will give you \nyour header line.\n\ne.g.\n\nblank <- data.frame(name=character(0), wife=character(0), \nno.children=numeric(0))\nwrite.csv(blank, 'file.csv')\n\nNow you can rbind new lines onto the data frame as you calculate new \nrecords and rewrite the whole thing, or just append them to the file \nwith append=TRUE and writing with col.names=FALSE.\n\nDuncan Murdoch\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}