{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Adam Salazar <heacock@goldgamers.net>", "subject": "Want to cure yourself?", "body": "\n\nLooking for an effective and cheap solution to have sex like you had 10 years ago?\nClick here to be the best lover in the world!\nLicensed Viagra and Cialis we are offering would improve your sexual life in few moments.\nClick here to have a nice dick\nYou don't need to look for a drug store in your area. We deliver high-quality pills worldwide.\nWith best regards,\nAdam Salazar\n \n \nTiazhelyj, vlastnyj golos Vladyki Koldena oshchutimo vskolyhnul zastoiavshijsia Vozduh Rodovyh peshcher. A ty? Ty smozhesh dobratsia sama? Ona slabo kivnula. Vot ono svidetelstvo, nemoe, no krasnorechivoe. Ne kazhdyj den! Ia ziabko Peredernul plechami. \nNo, po krajnej mere, v etot raz u Menia byla bolshaia stepen svobody, chem v proshlyj raz. No snachala ia koe-chto dodelaiu, zadumchivo prodolzhil Gront, snova Vzglianuv na Altaresa. Vremia ot vremeni budem Vygliadyvat naruzhu, vzmah v storonu arki, vyvodiashchej na ulicu, i Smotret, net li tvoej Nori. Bolee togo, on poshel eshche dalshe s pomoshchiu sheptunov vvel v umy sheltian Pravilo, pobuzhdaiushchee ih unichtozhat nedorazvityh srazu posle poiavleniia na Svet. A bylo vot chto. Net, starshomu pridetsia Dolozhit. Svetlye sily neba, potriaseno prosheptal ia, gliadia na uzhe nepodvizhnuiu Ravninu. Skvoz magicheskij cilindr k Nam vnutr zhar ne pronik, chto govorilo o neveroiatnoj moshchi zashchity, Zadejstvovannoj Nkotom Neveroiatnoj, smertonosnoj, bezzhalostnoj moshchi. \nZiabko ezhas v legkom kozhuhe ne tolko ot stylogo vetra, no i ot predchuvstviia Vstrechi s dal-roktami, Sevren neukliuzhe soskochil s topchana, na kotorom zadremal Pod monotonnyj shum livnia. I cvetovaia gamma stala bogache, chem v koridore, zdes vse Prostranstvo bylo napolneno prichudlivoj igroj raznocvetnyh blikov, tut i tam Vzryvalis kaskady iarkih iskr, probegali iazychki plameni, i zatejlivo Perekruchennye lenty ognia rozhdalis i umirali, slovno sverhnovye, iarkie Svetovye vspyshki. Ia pospeshno otoshel i tolknul tiazheluiu kamenitovuiu dver traktira, na vsiakij Sluchaj nabrosiv na sebia mentalnyj zontik s algoritmom prizraka, prezhde chem Okazatsia vnutri. Trans neopredelenno hmyknul, neskolko sekund pristalno, ispytuiushche Smotrel na menia, zastaviv oshchutit neponiatnoe bespokojstvo, zatem prishel k Kakomu-to neprostomu resheniiu i zvonko hlopnul ladoniami po tolstym liazhkam. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}