{"category": "ham", "to_address": "Giovanni Parrinello <parrinel@med.unibs.it>", "from_address": "Marc Schwartz <marc_schwartz@comcast.net>", "subject": "Re: [R] \"R is not a validated software package..\"", "body": "On Fri, 2007-06-08 at 16:02 +0200, Giovanni Parrinello wrote:\n> Dear All,\n> discussing with a statistician of a pharmaceutical company I received \n> this answer about the statistical package that I have planned to use:\n> \n> As R is not a validated software package, we would like to ask if it \n> would rather be possible for you to use SAS, SPSS or another approved \n> statistical software system.\n> \n> Could someone suggest me a 'polite' answer?\n> TIA\n> Giovanni\n> \n\nThe polite answer is that there is no such thing as 'FDA approved'\nsoftware for conducting clinical trials. The FDA does not approve,\nvalidate or otherwise endorse software.\n\nIf the pharma company in question has developed their own list of\nacceptable software applications that you must comply with, that is\ndifferent, but is independent of any FDA requirements.\n\nAs the saying used to be several decades ago, \"Nobody ever got fired for\nbuying IBM\".  In the clinical trials realm today, the same could be said\nfor SAS or Oracle Clinical. \n\nThat is a political, and perhaps a corporate legal counsel driven \"risk\naversion\" based issue, not a scientific one.  It is also a human\nbehavioral issue, as Bert noted, relative to fighting inertia, training\nor re-training issues and the pre-existing investment in internal\nprocesses and infrastructure.  This will change over time as more\nstatisticians, who have been trained in the use of R during their\nacademic years, enter into industry positions.\n\nAs others have noted, there is a PERCEPTION that somehow SAS is endorsed\nby the FDA or that it constitutes a 'gold standard' of sorts. This is a\nperception and not reality.\n\nThat being said:\n\nThere are a variety of relevant Guidance and Guideline documents that\nthe FDA has put forth to address these issues. Most recently, the FDA\napproved final guidance for the use of computerized systems in clinical\ninvestigations (May 2007):\n\nhttp://www.fda.gov/OHRMS/DOCKETS/98fr/04d-0440-gdl0002.pdf\n\nIn addition, there is a General Principles of Software Validation\ndocument:\n\nhttp://www.fda.gov/cdrh/comp/guidance/938.html\n\nThe majority of the 21 CFR Part 11 requirements (audit trails,\nelectronic signatures, etc.) are relevant to systems that manage \"source\nmedical records\". These would typically be database applications and\nmedical devices, not statistical applications. In our shop for example,\nour Oracle 10g server has been implemented in accordance with these\nrequirements.\n\nThere is a 21 CFR Part 11 guidance document here:\n\nhttp://www.fda.gov/ohrms/dockets/98fr/5667fnl.pdf\n\nThere are also all of the so-called FDA and ICH GxP (Good x Practice)\ndocuments:\n\n   http://www.fda.gov/oc/gcp/guidance.html\n   http://www.ich.org/cache/compo/475-272-1.html\n\nthat provide a framework for operations in a regulated environment and\nfor relevant statistical practice guidance. The 'x' above is replaced by\nwords such as \"Clinical\", \"Manufacturing\", \"Laboratory\", etc.\n\nThere is even a draft guidance document on the use of Bayesian\ntechniques for medical device trials:\n\nhttp://www.fda.gov/cdrh/osb/guidance/1601.html\n\n\nSome of the references in other posts have to do with software embedded\nin medical devices, which could be anything such as bedside ECG\nmonitoring stations, diagnostic imaging systems, radiation therapy\ninstrumentation and pacemakers. These are generally not relevant to this\ndiscussion.\n\nThe bottom line, is that while there is a burden on the part of the\n'software publisher' to utilize and document reasonable manufacturing,\nversion control, software maintenance and quality processes, the\noverwhelming burden is on the END USER to determine that their\nstatistical package is suitable for the application intended and to have\nwritten SOPs (Standard Operating Procedures) to define how they will\nvalidate their installation and use of the statistical software. \n\nThis goes to some of the comments that Cody had relative to IQ/OQ/PQ\ndocumentation, which refers to Installation Qualification, Operational\nQualification and Performance Qualification.\n\nFor example, in the context of R, the use of \"make check-all\" and the\nretention of the output subsequent to compiling R from source code can\nbe part of that documentation process. Bert referred to this in his\ncomments.\n\nBeyond that, the details of such documentation will be driven by a\nvariety of characteristics that are relevant to the nature of the\nenvironment (academic, commercial, clinical, pre-clinical, etc.) in\nwhich one is operating and related considerations.\n\nAs Frank noted, there will be a session at useR!2007:\n\n  http://user2007.org/\n\nentitled \"The Use of R in Clinical Trials and Industry-Sponsored Medical\nResearch\".  This session will take place on Friday, August 10 and I\nwould invite any interested parties to attend the meetings. I think that\nyou will find the subject matter quite enlightening.\n\nOne closing comment:  There is increasing use of R within the FDA itself\nand this will only further help to assuage the fears of prospective\nusers over time.\n\nBest regards,\n\nMarc Schwartz\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}