{"category": "ham", "to_address": "<Ip-health@lists.essential.org>", "from_address": "<msfh-india-medco-assist@field.amsterdam.msf.org>", "subject": "[Ip-health] Times of India editorial, IPR & Public Interest", "body": "This is a multi-part message in MIME format.\n--\n--\n[ Picked text/plain from multipart/alternative ]\nDear Moderator,\n\n\n\nKindly post the following Times of India editorial on Ip-health.\n\n\n\nLeena Menghaney\nProject Manager-India\nCampaign for Access to Essential Medicines\nMedecins Sans Frontieres - Holland (in India)\nC 106 Defence Colony, New Delhi 110 034\n\nTel: +91 11 24337225, Fax:  +91 11 24336834\nE-mail: msfh-india-medco-assist@field.amsterdam.msf.org\n\n\n\nTimes of India, Editorial, 5th April, 2007\nIntellectual propriety\nAnuradha Rajivan\nhttp://timesofindia.indiatimes.com/OPINION/Editorial/Intellectual_propriety/articleshow/msid-1858184,curpg-1.cms\n\n\nAs efforts are underway to revive World Trade Organisation (WTO) talks to bring the Doha Round to its logical conclusion there is an urgent need to take a fresh look at intellectual property rights (IPRs).\n\nThe debate has been driven largely by commercial interests. Public interest is equally, if not more, important. We need to understand that different situations may require different solutions balancing commercial interests with the public good.\n\nGlobal institutions like World Intellectual Property Organisation that specialise in intellectual property, together with the WTO agreement on Trade Related aspects of Intellectual Property Rights (TRIPS) are increasingly influencing the governance of intellectual work.\n\nShould intellectual work be subordinated to human well-being or to profit? Are the two necessarily contradictory? Is it logical to take different positions for different types of intellectual outputs?\n\nWhile the argument for property rights favours financial gain as the best incentive, the contrary view is that strong IPRs inhibit innovation and development of new technologies with implications for biodiversity and concerns for the poor making medicines more expensive or farmers' seeds ineffective.\n\nIPR issues are often seen as developed versus developing country positions the former with strong aggressive interests and the latter with more defensive interests. The balance of power is in favour of industrial lobbies in developed countries that have successfully increased the breadth and coverage of IPRs from trade secrets, utility models, and broadcasting rights to rights on data compilation.\n\nHowever, the positions can well be reversed as in the case of traditional knowledge. IPRs do not have to be all or nothing. It is possible to take differing positions depending on the 'public good' nature of the product. The challenge lies in finding ways to balance rewards to the innovator while facilitating wider access and dissemination to spur further innovation and newer applications.\n\nFor instance, biotechnologies are at the cutting edge - in the laboratory and commercially. The original species for this research comes mainly from tropical countries rich in biodiversity. Corporations patent these resources after getting them from poor communities.\n\nThe US patent on turmeric for healing wounds is an example. While most corporations in the business see it as bio-prospecting, and demand strong IPRs, for poor communities this is bio-piracy as they lose out on fees worth millions of dollars for prospecting rights.\n\nAdding value to traditional knowledge through geographical indications (GIs), is an excellent opportunity for developing countries to aggressively leverage commercial gains from IP. A GI identifies a good as originating in a specific region, with quality or characteristics attribu-table to its geographic origin.\n\nMost GIs are used for relative luxuries like wine, spirits and cheese. Traditional knowledge can push the use of GI beyond luxury goods and whole communities can benefit. Examples are basmati rice of India and Pakistan, tea from Sri Lanka, Phu Quoc fish sauce and Hunza apricots. Another idea not yet utilised is GI in services like Thai massages and Asian hospitality.\n\nA major area of concern is the implication for drug prices with the strengthening of IPRs in pharma-ceuticals. The cost of essential drugs is much lower in India than in neighbouring Pakistan - with different intellectual property regimes.\n\nIndia has historically had 'process' patents, not 'product' patents, allowing domestic pharmaceutical companies to produce low-priced copies of patented drugs. This simple provision in the original Indian Patents Act (1970) increased competition and put pressure on pharma-ceutical companies to keep prices low.\n\nIndia is the fourth largest producer of pharmaceuticals and a large supplier of low-cost generic drugs to other developing countries. As a signatory to the TRIPS agreement India was under pressure to modify its IP laws, to change to a 'product' patents regime. A 2004 amendment to the Indian Patents Act made the country WTO compliant but this was later reversed under intense domestic pressure.\n\nArts and entertainment is one area where the argument of public good for human well-being need not be an issue. Music, painting and film are the works of specific artists who should be compensated for the use of their work. Strong IPRs in these areas is less likely to compromise social good.\n\nThe writer is with UNDP.\n--\n[ attachments.zip of type application/x-zip-compressed deleted ]\n--\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}