{"category": "ham", "to_address": "Frank Gruman <fgatwork@verizon.net>", "from_address": "\"Stefan (metze) Metzmacher\" <metze@samba.org>", "subject": "Re: Samba4 TP5 as PDC with Win2k3 as BDC", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nHi Frank,\n\n> My first scenario was a Samba 4 PDC standalone.  This worked ok, but I\n> had some issues with speed of logins and general user maintenance.  But\n> it was GREAT for a pre-Alpha product.\n\nthanks!\n\n> The second scenario is where I am stuck - Samba 4 PDC with Win2k3 BDC.\n> I currently receive the following error when I try to create the server\n> as a BDC:\n> \n>         Failed to modify SPNs on\n>         cn=brokenbox,cn=computers,dc=myhome,dc=int: kludge_acl_change:\n>         attempted database modify not permitted. User MYHOME\\BROKENBOX$\n>         is not SYSTEM or an administrator\n\nAs stated in the release notes we have only very primitive access\nchecking...And that doesn't use ntSecurityDescriptor's yet...\n\n>         EPOLL_CTL_ADD failed (Bad file descriptor) - falling back to\n>         select()\n>         EPOLL_CTL_ADD failed (Bad file descriptor) - falling back to\n>         select()\n>         EPOLL_CTL_ADD failed (Bad file descriptor) - falling back to\n>         select()\n\nI wonder why this happens, does this also happen with other network\noperations?\n\n> The Windows server name is brokenbox and begins this process as a\n> non-domain server.  My Samba4 PDC is running on openSUSE 10.3 Alpha 4+.\n> I am logging in with the domain administrator account.  After the\n> installation has failed the server then belongs to the domain, but not\n> as a BDC.  If I start the wizard again, it performs the same steps and\n> fails with the same error.\n\nSamba4 doesn't support replicating *to* windows servers yet,\nit only has a very limited support for replication *from* windows servers...\n\nIf you would solve the above problem with the changing of the SPN\nyou would come to the next problem very fast. There's a lot more missing\nuntil a windows DC would run in a domain that was created using samba4.\n\nmetze\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.5 (GNU/Linux)\nComment: Using GnuPG with SUSE - http://enigmail.mozdev.org\n\niD8DBQFGboikm70gjA5TCD8RAksZAKC0NVEy2lUMcDr1Oy+4BznGoTLdwwCdHEZX\npnOVqvd+ZBnD+mfjYl6+htI=\n=/CmI\n-----END PGP SIGNATURE-----\n\n"}