{"category": "ham", "to_address": "=?ISO-8859-1?Q?ga=EBlle_krikorian?= <galk@free.fr>", "from_address": "Gaelle Krikorian <gaelle.krikorian@gmail.com>", "subject": "[Ip-health] =?WINDOWS-1252?Q?Merck_is_profoundly_disappointed=85?=", "body": "Merck & Co., Inc. Statement on Brazilian Government's Decision To\nIssue Compulsory License for Stocrin\n\nWHITEHOUSE STATION, N.J.--(BUSINESS WIRE)--May 4, 2007 - Merck & Co.,\nInc. issued the following statement today on the Government of\nBrazil's decision to issue a compulsory license for STOCRIN(TM)\n(efavirenz):\n\n\"Merck is profoundly disappointed by the decision of the Government\nof Brazil (GOB) to issue a compulsory license for STOCRIN(TM)\n(efavirenz), which would break Merck & Co., Inc.'s patent and make it\npossible for efavirenz to be produced by a generic manufacturer.\n\n\"Merck has attempted to negotiate in good faith with the GOB, but a\nfair offer on STOCRIN has been rejected. While we remain flexible and\ncommitted to exploring a mutually acceptable agreement with the\nBrazilian government to help the country achieve its objective of\nuniversal access to treatment, we believe their action is not in the\nbest interests of patients in Brazil and around the world.\n\n\"Merck continues to share with the GOB the common objective of\nimproving the health and welfare of those living with HIV/AIDS. In\nfact, Merck's global HIV pricing policy offers Brazil access to both\nSTOCRIN(TM) and CRIXIVAN(R) at the lowest price of any country with a\ncomparable wealth and disease burden.\n\n\"This expropriation of intellectual property sends a chilling signal\nto research-based companies about the attractiveness of undertaking\nrisky research on diseases that affect the developing world,\npotentially hurting patients who may require new and innovative life-\nsaving therapies.\n\n\"Research and development-based pharmaceutical companies like Merck\nsimply cannot sustain a situation in which the developed countries\nalone are expected to bear the cost for essential drugs in both least-\ndeveloped countries and emerging markets. As such, we believe it is\nessential to price our medicines according to a country's level of\ndevelopment and HIV burden, thereby ensuring equitable access as well\nas our ability to invest in future innovative medicines. As the\nworld's 12th largest economy, Brazil has a greater capacity to pay\nfor HIV medicines than countries that are poorer or harder hit by the\ndisease.\n\n\"This decision by the GOB will have a negative impact on Brazil's\nreputation as an industrialized country seeking to attract inward\ninvestment, and thus its ability to build world-class research and\ndevelopment.\n\n\"Merck hopes the government of Brazil will reconsider its stance in\nthe interests of HIV patients around the world.\"\n\nAbout Merck\n\nMerck & Co., Inc. is a global research-driven pharmaceutical company\ndedicated to putting patients first. Established in 1891, Merck\ncurrently discovers, develops, manufactures and markets vaccines and\nmedicines to address unmet medical needs. The Company devotes\nextensive efforts to increase access to medicines through far-\nreaching programs that not only donate Merck medicines but help\ndeliver them to the people who need them. Merck also publishes\nunbiased health information as a not-for-profit service. For more\ninformation, visit www.merck.com.\n\nForward-Looking Statement\n\nThis statement contains \"forward-looking statements\" as that term is\ndefined in the Private Securities Litigation Reform Act of 1995.\nThese statements are based on management's current expectations and\ninvolve risks and uncertainties, which may cause results to differ\nmaterially from those set forth in the statements. The forward-\nlooking statements may include statements regarding product\ndevelopment, product potential or financial performance. No forward-\nlooking statement can be guaranteed and actual results may differ\nmaterially from those projected. Merck undertakes no obligation to\npublicly update any forward-looking statement, whether as a result of\nnew information, future events, or otherwise. Forward-looking\nstatements in this statement should be evaluated together with the\nmany uncertainties that affect Merck's business, particularly those\nmentioned in the risk factors and cautionary statements in Item 1A of\nMerck's Form 10-K for the year ended Dec. 31, 2006, and in its\nperiodic reports on Form 10-Q and Form 8-K, which the Company\nincorporates by reference.\n\nContact\n\nFor Merck & Co., Inc.\nU.S. and Ex-Brazil Media:\nAmy Rose, 908-423-6537\nOr\nInvestors:\nGraeme Bell, 908-423-5185\nOr\nLocal (Brazil) Media:\nJoao Sanches, (55) 11-5189-7840\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}