{"category": "ham", "to_address": "Ip-health <ip-health@lists.essential.org>", "from_address": "Oliver Moldenhauer <Oliver.Moldenhauer@berlin.msf.org>", "subject": "[Ip-health] MSF statement for the NGO-Merkel-Meeting on the G8", "body": "--\nHi,\n\ntoday, Angela Merkel, the German Chancellor met representatives of 15\nNGOs, including MSF.\n\nHere's the statement that Tido von Schön-Angerer presented for MSF in\nEnglish and German and that we distributed to the German press.\n(http://www.aerzte-ohne-grenzen.de/Organisation/Aktuell/Statement-G8.php\nor below)\n\nFeel free to circulate.\n\nCiao,\n        Oliver Moldenhauer\n\n___________________________________________\nDipl. Phys. Oliver Moldenhauer\nCoordinator Access Campaign Germany\nÄrzte ohne Grenzen e.V. / Médecins Sans Frontières\nAm Koellnischen Park 1 - 10179 Berlin - Deutschland\nTel. +49-30-22 33 77 90 (Fax - 88)\nmail to Oliver.Moldenhauer@berlin.msf.org\nvisit us http://www.aerzte-ohne-grenzen.de\n\n---\n\nTreffen von Nichtregierungsorganisationen mit Bundeskanzlerin Merkel\nanlässlich des G8-Gipfels :\nStatement von Ärzte ohne Grenzen\nDie Bundeskanzlerin Angela Merkel hat am 14. Mai 2007 einige Vertreter von\nNichtregierungsorganisationen eingeladen, um über die Themen des\nG8-Gipfels zu sprechen. Ärzte ohne Grenzen wurde durch den Leiter der\nMedikamentenkampagne der Organisation, Tido von Schön-Angerer, vertreten.\nIm Folgenden lesen Sie die schriftliche Version seines Statements.\nSehr geehrte Frau Bundeskanzlerin,\n\nin den Programmen von Ärzte ohne Grenzen weltweit stellt Tuberkulose uns\nvor eine enorme Herausforderung, auf die wir gerne Ihre Aufmerksamkeit\nlenken möchten. Wir glauben, dass Tuberkulose die komplexe Beziehung\nzwischen Innovation, medizinischen Bedürfnissen und dem Zugang zu\nGesundheitsversorgung anschaulich macht.\n\nUnsere Patienten, die an Tuberkulose erkrankt sind, sterben: In der Hälfte\naller Fälle können wir die Krankheit nicht zuverlässig diagnostizieren;\ndie tödliche, allzu häufige Kombination von HIV/Aids und Tuberkulose ist\nschwer zu behandeln. Immer öfter kommen Patienten mit Resistenzen gegen\nmehrere Tuberkulose-Arzneimittel, was die Behandlung so erschwert, dass\nein Erfolg fast unmöglich ist.\n\nDie Hemmnisse, denen wir gegenüber stehen, beruhen auf unzureichenden\nmedizinischen Mitteln, auf die wir als Ärzte angewiesen sind. Wir\ndiagnostizieren die Patienten mit Hilfe der Mikroskopie - eine Methode,\ndie schon Robert Koch 1882 nutzte. Unsere bedeutendsten Waffen gegen die\nKrankheit sind Medikamente, die vor mehr als 40 Jahren entwickelt wurden.\n\nDie Einführung von Neuerungen wird im Falle von Tuberkulose dringend\nbenötigt: Mit den derzeitigen Mitteln schaffen wir es nicht, uns der Flut\nan Problemen durch die Infektionskrankheit entgegen zu stellen.\nDeutschlands Auftritt ist hierbei besonders enttäuschend: Innerhalb der\nohnehin schon geringen Ausgaben, die derzeit für die Bekämpfung der\nTuberkulose getätigt werden, belegt Deutschland den 13. Platz. Tuberkulose\nist jedoch nur ein Beispiel - es gibt viele Krankheiten von Menschen in\närmeren Ländern, in deren Forschung und Entwicklung zu wenig investiert\nwird.\n\nFrau Bundeskanzlerin, Sie haben Innovation zu einem der wichtigsten\nTagesordnungspunkte dieses G8-Gipfels gemacht. Und dennoch ist die einzige\nStrategie, die Sie zur Förderung des Fortschritts anbieten, der Schutz des\nGeistigen Eigentums.\n\nUnter bestimmten Bedingungen mag das Geistige Eigentum eine wichtige Rolle\nspielen. Jedoch ist weitgehend bekannt und dokumentiert (auch von der\nWeltgesundheitsorganisation), dass der Schutz des Geistigen Eigentums\nnichts dazu beiträgt, ausreichend Anreize für Innovation im Falle von\nKrankheiten der Armen zu schaffen. Solange es keinen Markt gibt, hilft\nauch der Patentschutz nicht, um Pharmakonzerne zum Investieren zu bringen.\nEs findet keine Innovation statt und Patienten wie diejenigen, die Ärzte\nohne Grenzen gegen Tuberkulose behandelt, werden ohne\nDiagnosemöglichkeiten und wirksame Medikamente allein gelassen. Zusätzlich\nführt Geistiges Eigentum zu Problemen beim Zugang zu Erzeugnissen, die\nbereits auf dem Markt sind.\n\nInnovationen für die Gesundheit sind bedeutungslos, wenn jene Menschen,\ndie Zugang zu diesen Produkten brauchen, ausgeschlossen werden. Doch\nignoriert Ihre Innovations-Agenda die Bedürfnisse der Menschen in armen\nLändern, obwohl Afrika ein Schwerpunkt beim G8-Gipfel ist.\n\nWo es keinen Markt gibt, werden neue Ansätze benötigt, die nicht darauf\nbasieren, dass die Innovation durch hohe Medikamentenpreise und Patente\nfinanziert wird. Es gibt aktuelle Anregungen für Mechanismen, um\nNeuerungen im Gesundheitsbereich zu fördern. Sie werden in der\nIntergovernmental Working Group on Public Health, Innovation and\nIntellectual Property (IGWG) der Weltgesundheitsorganisation geprüft.\nDieser Prozess bietet eine historische Gelegenheit, die derzeitige\nSituation zu ändern: die G8-Staaten sollten all\\u2019 ihre Kraft zur\nUnterstützung einsetzen.\n\nWir haben festgestellt, dass die G8-Staaten das Thema\nMedikamentenfälschungen diskutieren werden. Gefälschte Arzneimittel sind\neine Bedrohung für die öffentliche Gesundheit. Aber es ist notwendig, die\ngesamte Tragweite dieses Themas zu betrachten: Der Mangel an wirksamen,\nqualitativ hochwertigen Medikamenten, die zugleich für ärmere Menschen\nbezahlbar sind, schafft die Grundlage für Medikamentenfälschungen.\n\nDies ist der Punkt, dem sich die G8-Staaten zuwenden müssen.\n\nDie gegenwärtigen Patentstreitigkeiten in Thailand, Brasilien und Indien\nzeigen, dass die G8-Staaten nicht behaupten können, dass Geistiges\nEigentum das Rückgrat von Innovation darstellt.  Sie lassen dabei außer\nacht, welche enormen Probleme die gegenwärtige Patentpolitik mit sich\nbringt, wenn es um den Zugang zu Innovationen im Medikamentenbereich geht.\n\nDie steigenden Preise für patentierte HIV/AIDS-Medikamente sind hierbei\nsehr besorgniserregend. Ärzte ohne Grenzen behandelt mehr als 80.000\nMenschen mit HIV/Aids in mehr als 30 Ländern. Wir werden derzeit mit einer\nKostenexplosion konfrontiert. Möglicherweise kommt es zu einer\nVerdoppelung der Medikamentenkosten in den kommenden zwei Jahren, da immer\nmehr Patienten mit neueren Präparaten der zweiten Therapielinie behandelt\nwerden müssen. Auch andere Programme müssen sich auf diese Herausforderung\neinstellen. Wir glauben, dass dies schon bald viele Länder betreffen wird.\n\nDie G8 müssen das Recht von Staaten bekräftigen, die Flexibilitäten des\nTRIPS-Abkommens im Rahmen der Welthandelsorganisation zu nutzen. Dazu\ngehört das Instrument der Zwangslizenzen. Die G8-Staaten müssen darüber\nhinaus Initiativen zur Nutzung von Geistigem Eigentum im Sinne von\nGesundheitsfragen unterstützen, wie beispielsweise die Bildung von\nPatent-Poolen. Sie müssen sicherstellen, dass Patente keine Barriere für\nden Zugang zu lebensrettenden Medikamenten bilden.\n\nAbschließend ist es wichtig, dass die G8 eine angemessene finanzielle\nFörderung von Gesundheitsversorgung sicherstellen, wie beispielsweise\ndurch den Global Fund. Doch zusätzliche Quellen sollten sich nicht auf\nSubventionen für hochpreisige Produkte zur Gesundheitsversorgung\nbeschränken. Die Finanzierung von öffentlicher Gesundheit kann bei\ngeringeren Kosten für Medikamente einen wesentlich stärkeren Effekt haben.\n\n--\n[ Statement-Merkel-En.pdf of type application/octet-stream deleted ]\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}