{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "(Ted Harding) <ted.harding@nessie.mcc.ac.uk>", "subject": "Re: [R] Appropriate regression model for categorical variables", "body": "On 12-Jun-07 17:45:44, Tirthadeep wrote:\n> \n> Dear users,\n> In my psychometric test i have applied logistic regression\n> on my data. My data consists of 50 predictors (22 continuous\n> and 28 categorical) plus a binary response. \n> \n> Using glm(), stepAIC() i didn't get satisfactory result as\n> misclassification rate is too high. I think categorical\n> variables are responsible for this debacle. Some of them have\n> more than 6 level (one has 10 level).\n> \n> Please suggest some better regression model for this situation.\n> If possible you can suggest some article.\n\nI hope you have a very large number of cases in your data!\n\nThe minimal complexity of the 28 categorical variables compatible\nwith your description is\n\n  1 factor at 10 levels\n  2 factors at 7 levels\n 25 factors at 2 levels\n\nwhich corresponds to (2^25)*(7^2)*10 = 16441671680 ~= 1.6e10\ndistinct possible combinations of levels of the factors. Your\ntrue factors may have far more than this.\n\nUnless you have more cases than this in your data, you are\nlikely to fall into what is called \"linear separation\", in which\nthe logistic regression will find a perfect predictor for your\nbinary outcome. This prefect predictor may well not be unique\n(indeed if you have only a few hundred cases there will probably\nbe millions of them).\n\nTherefore your logistic reggression is likely to be meaningless.\n\nI can only suggest that you consider very closely how to\n\na) reduce the numbers of levels in some of your factors,\n   by coalescing levels together;\nb) defining new factors in terms of the old so as to reduce\n   the total number of factors (which may include ignoring\n   some factors altogether)\n\nso that you end up with new categorical variables whose total\nnumber of possible combinations is much smaller (say at most 1/5)\nof the number of cases in your data.\n\nIn summary: you have to many explanatory variables.\n\nBest wishes,\nTed.\n\n--------------------------------------------------------------------\nE-Mail: (Ted Harding) \nFax-to-email: +44 (0)870 094 0861\nDate: 13-Jun-07                                       Time: 00:23:49\n------------------------------ XFMail ------------------------------\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}