{"category": "ham", "to_address": "Rogerio Porto <rdporto1@terra.com.br>", "from_address": "Tim Churches <tchur@optushome.com.au>", "subject": "Re: [R] Awk and Vilno", "body": "Rogerio Porto wrote:\n> Hey,\n> \n>> What we should really compare is the four situations:\n>> R alone\n>> R + awk\n>> R + vilno\n>> R + awk + vilno\n>> and maybe \"R + SAS Data step\"\n>> and see what scripts are more  elegant (read 'short and understandable')\n\nI don't think that short and understandable necessarily go hand-in-hand.\nSometimes longer scripts which are more explicit and use less tricky\nsyntax shortcuts are much easier to understand a year or two later. Ease\nand speed of script writing (taking into account learning curve and time\ntaken to consult scripting language documentation) are important, as is\nthe ability to re-visit scripts or examine someone else's script and be\nable to work out what it does and how it works is vital, and speed of\nexecution also counts with large datasets. Also ubiquity of the tool,\nwhether it is freely available on many platforms, either pre-installed\nor in an easy-to-install form are also considerations.\n\n> what do you guys think of creating a R-wiki page for syntax\n> comparisons among the various options to enhance R use?\n> \n> I already have two sugestions:\n> \n> 1) syntax examples for using R and other tools to manipulate\n> and analyze large datasets (with a concise description of the\n> datasets);\n> \n> 2) syntax examples for using R and other tools (or R alone) to clean\n> and prepare datasets (simple and very small datasets, for didatic\n> purposes).\n\nThe ability of the tools to scale to large or very large datasets is\nalso a consideration, as is their speed when dealing with such large data.\n\n> I think this could be interesting for R users and to promote other\n> software tools, since it seems there is a lot of R users that use\n> other tools also.\n> \n> Besides that, questions on those two above subjects are prevalent\n> at this list. Thus a wiki page seems to be the right place to discuss\n> and teach this to other users.\n> \n> What do you think?\n\nYes, happy to contribute R + Python examples to such wiki pages. Please\npost the URL.\n\nTim C\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}