{"category": "ham", "to_address": "genomenet@gmail.com, r-help@stat.math.ethz.ch", "from_address": "\"Greg Snow\" <Greg.Snow@intermountainmail.org>", "subject": "Re: [R] {10,20,30}>={25,30,15}", "body": "To decide on which way to do a one tailed test, you should really ask a\nfew questions (before looking at the data) either of yourself, your\nclient, or other expert in the field.\n\nI would start by asking the 3 questions:\n\n1. What will I/you do if A is less than B?\n2. What will I/you do if A is equal to B?\n3. What will I/you do if A is greater than B?\n\nIf the 3 questions all have the same answer, then you really don't need\nto do the test.\nIf the 3 questions have 3 different answers, then you need to do a\ntwo-tailed test.\nIf the answer to question 2 matches with the answer to either 1 or 3,\nthen that tells you which combination of hypotheses to use.\n\nFor example, if A represents the current drug used to treat a certain\ncondition and B is a proposed new drug, and larger values are considered\nbetter, then the answer to question 1 is \"Switch to B\" and the answer to\n3 is \"Stay with A\", but the answer to question 2 depends on outside\nknowledge/opinions about the 2 drugs.\n\nIf we are happy with drug A, and want to stay with the status quo unless\nB is proven better, then the answer to question 2 is \"Stay with A\" and\nwe would use H0: A>=B and Ha: AB.\n\nThis is a general guideline and you should remember that you fail to\nreject the null, not accept it.  In these types of cases you should\nreally decide on what an important difference (practical significance)\nis (before looking at the data).  Then construct a confidence interval\nand see if the interval includes 0 and/or the important difference\nvalue.  If the interval does not include the important difference value\n(and does include values of 0 or in that direction), then you can go\nwith your question 2 answer above, because even if there is a\ndifference, it is too small to care about.  If your interval includes\nthe important difference amount, and not 0, then you can conclude that\nthere is a difference and respond accordingly.  If your interval\nincludes both 0 and the important difference (and probably more extreme\nvalues), then you don't have the data to make any conclusions and your\ndecision should be to collect more (and maybe better) data.\n\nHope this helps,\n\n\n\n-- \nGregory (Greg) L. Snow Ph.D.\nStatistical Data Center\nIntermountain Healthcare\ngreg.snow@intermountainmail.org\n(801) 408-8111\n \n \n\n> -----Original Message-----\n> From: r-help-bounces@stat.math.ethz.ch \n> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of \n> genomenet@gmail.com\n> Sent: Friday, May 18, 2007 12:07 PM\n> To: r-help@stat.math.ethz.ch\n> Subject: [R] {10,20,30}>={25,30,15}\n> \n> Hi There,\n> \n> Using t.test to test hypothesis about which one is greater, A or B?\n> where A={10,20,30},B={25,30,15}.\n> \n> My question is which of the following conclusions is right?\n> \n> #################hypothesis testing 1\n> \n> h0: A greater than or equal to B\n> h1: A less than B\n> \n> below is splus code\n> A=c(10,20,30)\n> B=c(25,30,15)\n> t.test(c(10,20,30),c(25,30,15),alternative=\"less\")\n> \n> output:\n> p-value=0.3359\n> \n> because p-value is not less than alpha (0.05), we cannot reject h0.\n> \n> so A greater than or equal to B.\n> \n> \n> #################hypothesis testing 2\n> \n> h0: A less than or equal to B\n> h1: A greater than B\n> \n> below is splus code\n> \n> A=c(10,20,30)\n> B=c(25,30,15)\n> t.test(c(10,20,30),c(25,30,15),alternative=\"greater\")\n> \n> output:\n> p-value=0.6641\n> \n> because p-value is not less than alpha (0.05), we cannot reject h0.\n> \n> so A less than or euqal to B.\n> #########################################\n> \n> Thank you very much.\n> Van\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide \n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}