{"category": "ham", "to_address": "\"\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"The Internet Patrol\" <info@theinternetpatrol.com>", "subject": "\n The Internet Patrol -  Blogger Freed from Jail After Providing and Posting Disputed Video", "body": "\n\n\nThe Internet Patrol\n\n\n The Internet Patrol\nhttp://www.theinternetpatrol.com\n\nBlogger Josh Wolf Freed from Jail After Providing and Posting Disputed Video\n\nBlogger Josh Wolf has been released from jail - from what is being called the longest contempt of court sentence in the history of U.S. journalism - after turning over a video which showed essentially nothing of interest, and answering a total of two questions for Federal prosecutors.  You can see the video and decide for yourself.\n\nRead more here: Blogger Josh Wolf Freed from Jail After Providing and Posting Disputed Video \n\nDo you know anybody participating in a run, walk, ride or other charity event \"..for the Cure\"?  Please check out our latest \"for the cause\" website at http://www.TheSiteForTheCure.com !  The Site for the Cure is a free community-based site where people participating in such events can put up their own page with a link to their \"sponsor me\" page, create their own blog, and participate in forums!  All free, all for the cause!  http://www.TheSiteForTheCure.com\n\nHere are some amazing deals we've found on the Internet for ourselves recently:\n\n\nSend Unlimited Newsletters to Your Customers, Friends, Family, and Others:  http://www.theinternetpatrol.com/the-perfect-way-to-send-email-newsletters\n\nUnlimited Calls to Any Phone in the U.S.:  http://www.theinternetpatrol.com/make-unlimited-phone-calls\n\nCheck out our online audio show, \"Three Things You Should Know\"!  http://www.ThreeThingsYouShouldKnow.com\n\n\nAnd check out the best collection of how to videos at http://www.LearnHowTo.TV !\n\n\nKnow somebody who would like to receive these alerts?  Forward this one to them and let them know\nthat they can sign up for free by sending email to \"internetpatrol@aweber.com\" with the \nword 'Subscribe' in the subject!\n\n\n\n\n\nThe Internet Patrol, \n302 W. El Camino Real, #411, \nSunnyvale, CA 94087, USA \n\n\n\nTo unsubscribe or change subscriber options visit:\nhttp://clients.suretymailings.com/z/r/?TBwMLMwctMzsTCxMTJzs\n\n\n"}