{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "Rob Myers <rob@robmyers.org>", "subject": "Re: [cc-community] Does BY-SA extend to a newspaper?", "body": "drew Roberts wrote:\n\n> Ah, nope, I don't think that fully covers the situation. While a derivative \n> work is a work that would attract its own copyright, it is not the only works \n> that might incorporate or contain a BY-SA work and not be a derivative.\n> \n> Have you missed the talk on collections? (Collective works or whatever the \n> correct terminology is.)\n> \n> A collective work canget a copyright on the collection. Right? Wrong?\n\nI think so but people don't seem to always assert it. Does the work get \nthis automatically? How does it interact with the underlying copyright?\n\nI can see the case that the collective work couldn't exist without the \nunderlying CC-licensed work so the condition for being allowed to claim \na collective copyright that covers the CC-licensed work is that the \ncollective work must be CC-licensed. I'm just very wary of it.\n\n> Is a newspaper on the whole copyrighted? Or only the individual articles? Is a \n> magazine copyrighted?\n\nAs a whole it is copyrighted by the publisher, there is usually a notice \non the contents page. Writers and illustrators and editors get \nattribution. I must admit I haven't thought about what kind of copyright \nthis is. Photos from agencies must have their own copyright originally \nand be licensed.\n\n> The problem is that we only seek to control derivatives and we could also \n> control copying and distribution where needed.\n\nStallman explicitly excluded collective works when drafting the GPL. \nThis was a tactical measure at least in part I believe, as no \nFreeware/Shareware CD would have accepted those terms.\n\nIt is also important to avoid anything that could be regarded as coercion.\n\n> Or am I totally off base.\n\nNo, I'm just very wary of collective copyright. Part of this is ethical, \npart of this is due to my not having the best understanding of it.  :-/\n\n> I agree with that, but if we can do it using copyright law itself, might not \n> that be better? Looking at this last paragraph, I think you might not fully \n> get what  Iam trying to say.\n\nI understand the collective copyright argument but I think unless it is \nused very precisely to enforce a particular part of a \"social contract\" \nit could be seen as coercive and harm distribution without increasing or \nprotecting copyleft works.\n\nI would be interested to see a study of how collective work copyrights \ncould interact with alternative copyright licenses though.\n\n- Rob.\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}