{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@flax9.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "SatCon Photovoltaic Inverters Installed at U.S. Government Facility", "body": "\n\n\n\n\n\n\n\n\nSatCon Photovoltaic Inverters Installed at U.S. Government Facility\n\nBOSTON, May 08, 2007 (BUSINESS WIRE) --  SatCon Technology Corporation(R) (Nasdaq CM: SATC), a developer of power management and system architecture solutions for the alternative energy and distributed power markets today announced that its PowerGate(R) commercial grade inverters have been installed as an integral part of a 375 kW building-integrated photovoltaic (BIPV) system at the Murphy National Archives and Records Administration (NARA) facility in Waltham, Massachusetts. The NARA facility demonstrates a completely integrated roof and solar system--the solar panels are the roof. The flexible, flat panel photovoltaic array is heat-welded into the roofing material and qualifies as a \"Cool Roof\" under the U.S. Environmental Protection Agency's EnergyStar program. Solar Integrated Technologies, Inc. provided the building's 143,000 square feet of integrated photovoltaic (BIPV) roofing system. SatCon's PowerGate(R) high-efficiency inverters are a critical component of the system, converting the sun's energy produced by the photovoltaic panels into alternating current electricity that is used to power the facility. To date, SatCon has shipped more the 30 MW of its industry leading commercial grade inverters in North America. \"SatCon is pleased to have been selected to supply the inverters for this PV installation at this US government facility \", said Clemens van Zeyl, President, SatCon Power Systems. \"Our PowerGate(R) Inverter series, ranging from 30 kW to 500 kW, continues to gain acceptance as the power conditioning system of choice driven by market leading efficiencies, simplicity of design and ease of installation \" added van Zeyl. \"As we provide and install BIPV roofing solutions for our U.S. customers, it is essential that we source inverters that reflect our 'no compromise' approach\", stated R. Randall MacEwen, President & CEO of Solar Integrated. \"We continue to be attracted to SatCon's PowerGate(R) inverter and their partnership approach to business.\" This is the second large commercial installation in Massachusetts using SatCon Inverters. Late last year, PowerGate(R) inverters were used in the largest solar energy system installation in New England, a 425 kilowatt photovoltaic system located on an environmentally remediated brownfield (brightfield) in Brockton, Massachusetts. Eventually the city of Brockton plans to increase the Brockton Brightfield's capacity to 1 megawatt (MW). About SatCon Technology Corporation SatCon Technology Corporation is a developer and manufacturer of electronics and generators/motors for the Renewable Energy, Hybrid-Electric Vehicle, Grid Support, High Reliability Electronics and Advanced Power Technology markets. For further information, please visit the SatCon website at www.satcon.com. (SATC-G) Statements made in this document that are not historical facts or which apply prospectively are forward-looking statements that involve risks and uncertainties. These forward-looking statements are identified by the use of terms and phrases such as \"will,\" \"intends,\" \"believes,\" \"expects,\" \"plans,\" \"anticipates\" and similar expressions. Investors should not rely on forward looking statements because they are subject to a variety of risks and uncertainties and other factors that could cause actual results to differ materially from the Company's expectation. Additional information concerning risk factors is contained from time to time in the Company's SEC filings. The Company expressly disclaims any obligation to update the information contained in this release. SOURCE: SatCon Technology Corporation SatCon Technology Corporation(R)\nDan Gladkowski, 617-897-2411\nVP, Administration\n\n\n\n\n\n\n\n\n\n\n You are subscribed to SatCon Technology Corporation Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n SatCon Technology Corporation \n 27 Drydock Ave. 6th Floor, South Boston, MA 02127\n Service provided by Shareholder.com \n\n\n\n\n\n"}