{"category": "spam", "to_address": "<gnitpick@speedy.uwaterloo.ca>", "from_address": "\"djmconsulting\" <djmconsulting@candoconsutling.info>", "subject": "Travel?  Military?  Save cellular airtime and listen to your voicemail", "body": "\n\n\n\n\n\n\n\n\n\n\n                          Have you ever wished you would have saved that important \n                          voicemail? Would you like to share your voicemails with \n                          family, friends or coworkers? With GotVoice, you can, \n                          for FREE!\n\nWhat \n                        is GotVoice?\n\nGotVoice \n                        retrieves voice messages from your existing home and cellular \n                        phones and delivers them directly to your Email inbox \n                        with a simple click of a button. \n                        What \n                          can I do with GotVoice?\n\n\nListen to your voice messages on your PC. \n                          Retrieve new and saved voice messages from your \n                            phones. \n                          Manage your voicemails just like email - listen \n                            to, forward, and save messages. \n                          Listen to your voicemail anywhere in the world - \n                            perfect for travelers or overseas military \n                          Uses your existing phone numbers \n                          Save cellular airtime! \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nEnjoy the convenience and flexibility of email \n                              with your voicemail! \n \n\n\n\n\n\n\nClick \n                                Here to sign up now!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Works with these carriers and more:\n\n\n\n\n\n \n\nWe hope you find these communications valuable. If you prefer to no longer receive promotional offers or research e-mails from GotVoice, click here to unsubscribe.\n\n To view our privacy policy, click here. \nSent from GotVoice,Inc., 10512 NE 68th Street, Kirkland, WA 98033, attn: Email Coordinator\n\n\n\n\n\n\n\n\n\n\nUse this link to be automatically removed from any future offers\n\n\nTake me off of your email list , please write us with your removal request.  Customer Service 560- A F ST #438 Grants Pass, OR 97528.Please note: It may take up to 3 days for your name to be removed from our list. \n\n\n\n\n\n\n"}