{"category": "spam", "to_address": "Gnitpick <gnitpick@flax9.uwaterloo.ca>", "from_address": "Robert Francis <avanti@gondola-kinne.com>", "subject": "Pharmacy evolution", "body": "\n\nCan't have sex like you had 10 years ago? Looking for an effective and cheap solution?\nGo to the site\nWe know the solution you are looking for! Viagra, Cialis, Viagra Pro, Cialis Soft - the right choice you can make!\nGo to the site\nInstant shipping worldwide! Confidential purchase!\nWith best regards,\nRobert Francis\n \n \nNo chto Niksard ne kto inoj, kak Zasfernik, on dogadalsia eshche v zharle. Riskuiu predpolozhit, chto, nravitsia eto nam ili ne Nravitsia, my do sih por u nego pod kontrolem i nasha bezopasnost v dannyj Moment lish legkomyslennaia illiuziia. Ferma, da? Nkot nazval Fermoj to mestechko, gde my smozhem Ukrytsia. Nebo kazalos serym i bezyshodnym, holodnyj osennij vozduh sochilsia Vlagoj, obeshchaia skoryj i obilnyj dozhd, a siglajzer zaciklilsia na legkih Nezamyslovatyh melodiiah, pytaias otvlech menia ot mrachnogo nastroeniia. \nAbsoliutno ne obrashchaia vnimaniia na maks v moej ruke, napravlennyj emu Promezh glaz, on kak ni v chem ne byvalo opustilsia na trotuar, utverdivshis Vsego v dvuh shagah ot menia. Ia sam zajmus im. A Celitel? Sily Zla, on byl uveren v chuzhom kuda bolshe, chem ia, i pochti sklonil menia k Mysli, chto etomu golubomu tipu mozhno doveriat. V obshchem, so vsiakim kolichestvom nog, ruk, lap i klykov. I on ne byl durakom, chtoby ne poniat smysla Takogo vzleta ceny. Prigasil, vylepil iz nego novuiu, Konusoobraznuiu formu, kak u smercha, i votknul nizhnim koncom v zev perehoda. Sleduj za mnoj. Takoj poriadok byl zaveden iskliuchitelno v Federacii, na Planetah Koalicii Nezavisimyh Mirov byli svoi denezhnye sistemy. \nOsobenno ty. Esli zhe predlozhennoe delo im Chem-to ne nravilos, oni za nego prosto ne bralis. Altaresu iskliuchitelno nravilos eto novshestvo, kogda Posetitel sam opredelial tiazhest nakazaniia za sobstvennuiu nerastoropnost. Odin shar Pronessia v metre ot moej golovy i ushel v temnotu pereulka za spinoj. ejisuminyon VVFcRlhQUVh0RkFXVlBMH0dEVUFUQF9bWh9RUg==\n \n\n\n"}