{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@flax9.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "SatCon Photovoltaic Inverters Installed at 1.1 MW SolarCraft Site", "body": "\n\n\n\n\n\n\n\n\nSatCon Photovoltaic Inverters Installed at 1.1 MW SolarCraft Site\n\nBOSTON, Jun 19, 2007 (BUSINESS WIRE) --  SatCon Technology Corporation(R) (Nasdaq CM: SATC), a developer of power management and system architecture solutions for the alternative energy and distributed power markets today announced that its PowerGate(R) commercial grade inverters have been installed as an integral part of a SolarCraft installed 1.1 Megawatt solar energy system at Paramount Farms, Inc., the world's largest vertically integrated supplier of pistachios and almonds. The installation, located in California's San Joaquin Valley, spans 8 acres and is reportedly one of the largest single-site, privately-owned solar energy systems in the United States. This solar system enables Paramount Farms to generate enough clean electricity each day to power 300 average homes. The new system will spare the air nearly 2,600 tons of harmful greenhouse gases annually. Over the next 30 years, the air pollution saved will be equivalent to driving over 176 million miles. SolarCraft, experts in solar system design and installation, was responsible for the design and construction of the Paramount Farms system. With over 4,000 commercial and residential installations to its credit, SolarCraft has installed more solar energy systems than any other company in California's North Bay. SolarCraft installs over 200 solar energy systems per year. \"SolarCraft selected SatCon for this job because we have had a great deal of success at many other commercial installations with this inverter brand.\" stated Chris Bunas, Vice President of SolarCraft's Solar Electric Division. \"SatCon has become our main choice for commercial inverters because of their high performance, ease of installation and smaller overall packaging. So far, the two 500 kW inverters at Paramount Farms have been performing beyond expectations.\" SatCon's PowerGate(R) Inverter series, ranging from 30 kW to 500 kW, continues to gain acceptance as the Photovoltaic Inverter system of choice. SatCon has delivered over 15MW of commercial grade inverters this calendar year and is experiencing significant demand for its inverter products. About SatCon Technology Corporation SatCon Technology Corporation is a developer and manufacturer of electronics and generators/motors for the Renewable Energy, Hybrid-Electric Vehicle, Grid Support, High Reliability Electronics and Advanced Power Technology markets. For further information, please visit the SatCon website at www.satcon.com. SATC-G Statements made in this document that are not historical facts or which apply prospectively are forward-looking statements that involve risks and uncertainties. These forward-looking statements are identified by the use of terms and phrases such as \"will,\" \"intends,\" \"believes,\" \"expects,\" \"plans,\" \"anticipates\" and similar expressions. Investors should not rely on forward looking statements because they are subject to a variety of risks and uncertainties and other factors that could cause actual results to differ materially from the Company's expectation. Additional information concerning risk factors is contained from time to time in the Company's SEC filings. The Company expressly disclaims any obligation to update the information contained in this release. SOURCE: SatCon Technology Corporation SatCon Technology Corporation(R)\nDan Gladkowski, 617-897-2411\nVP, Administration\n\n\n\n\n\n\n\n\n\n\n You are subscribed to SatCon Technology Corporation Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n SatCon Technology Corporation \n 27 Drydock Ave. 6th Floor, South Boston, MA 02127\n Service provided by Shareholder.com \n\n\n\n\n\n"}