{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Mabel Costello\" <lazclusterpulsebow@clusterpulse.org>", "subject": "Be leaner and slimmer by next week", "body": "\nAnatrim will change your life\n\n\n\n\n\n\nAnatrim – The very up-to-date and most delighting product for corpulent people is made available now – As seen on CNN.\n\n\nCan you hold in your memory all the situations when you told yourself you would do anything for being delivered from this fastly growing pounds of fat? Fortunately, now no big price is to be paid. Thanks to Anatrim, the ground-breaking kilos-melting blend, you can get healthier lifestyle and become really thinner. Just look at what people say!\n\n\n\n\"I hate to confess but I was an awful food addict. \n\n\nI ate all this trash \n\n\nand just could not stop. \n\n\n\n\nThis ruinous passion stopped when I started taking Anatrim! \n\n\nGod,\n\n\n\n\n my craving for food disappeared, \n\n\nspirits increased and I became the happiest person 18 pounds in 2.5 months. \n\n\n\n\nSo, I can tell you now I became the happiest person!\"\n\n\n\n\n\nLusia R., Bellevue WA\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nYou can't imagine how I detested being ridiculed at school. \n\n\n\n\nI hated my plumpness and I hated myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nIt literally pulled me out of this dreadful nightmare! The warmest thanks to you, guys.\"\n\n\n\n\n\nCharley Mock, Colorado\n\n\n\n\n\n\"Do you know what? Anatrim preserved my marriage! I went into the circle, depression – eating more – just more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOnce my friend pointed at your web page and I called for Anatrim as soon as it was possible. \n\n\nThe final result was splendid, my appetite came to normal level, I was in a good mood oftener, and, be sure, I became able to tighten my belt on some holes. And the bedroom became cool also!\"\n\n\n\n\n\nMikkey\n\n\n\n\n There is a lot of thanks left by delighted people trying Anatrim. Why don't you join the thousands and thousands of slim customers and take this all-natural appetite abating power lifting product now!\n\n\nDon’t miss your opportunity!\n\n\n\n\n"}