{"category": "ham", "to_address": "Andreas Fredriksson <deplinenoise@gmail.com>", "from_address": "simo <idra@samba.org>", "subject": "Re: [Samba] Guide to porting to non-unix like systems?", "body": "On Sat, 2007-04-28 at 00:43 +0200, Andreas Fredriksson wrote:\n> Hi,\n> I'd like to get a rough idea on how much work it would be to port\n> Samba to a non-unix platform. My plan was to use a slimmed-down samba\n> to read and write files on a particularly unfriendly piece of\n> proprietary hardware we use at work. I'm fine with a minimalistic\n> samba as this port would be for internal, single-developer use and not\n> intended for file serving in general.\n\nAndreas,\nthis kind of question would be served better if posted on\nsamba-technical@samba.org as it is about technical matters.\n\n> Here are some things I'm wondering about, given the background:\n> \n> 1) Is fork() required, or could it be emulated via threads?\n> \n> 2) Could nmdb and smbd share a single process w.r.t 1) or is even\n> possible to drop nmdb and just serve stuff slowly with a single smbd\n> process?\n> \n> 3) Is Samba very tightly tied to the POSIX file/directory APIs? My\n> intended target system has a rich I/O API (including async\n> capabilities and various bells and whistles) but the APIs are fairly\n> exotic and don't map well to e.g. DIR and file descriptors.\n> \n> 4) Is there a checklist somewhere of stuff a target system for\n> smbd/nmbd would have to support to make a port feasible?\n\nIf you don't have fork, and have a btter I/O API I'd direct you at\nlooking at samba4.\n\nSamba4 can run in a single process.\n\nSamba4 integrates the NBT functionality without requiring a second\ndaemon.\n\nIn Samba4 you can write NTVFS modules without necessarily using posix\nsemantics (like samba3 vfs layer require instead).\n\nWhile samba4 is still not released it should be ok for the kind of use\nyou have in mind.\n\nSamba4 can have a better memory footprint as well.\n\nSimo.\n\n-- \nSimo Sorce\nSamba Team GPL Compliance Officer\nemail: idra@samba.org\nhttp://samba.org\n\n"}