{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "5p 6/15 Update:Russians report possible computer breakthrough", "body": "\n\n\n\n\n5p 6/15 Update:Russians report possible computer breakthrough\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 63\nPosted: 4:55 PM, 6/15/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-60 (06/15/07): Russians shut down computers again for additional troubleshooting; no obvious 'smoking gun' in U.S. power\n   SR-61 (06/15/07): Astronauts gear up for spacewalk\n   SR-62 (06/15/07): Spacewalk begins; blanket repair work goes smoothly\n   SR-63 (06/15/07): Russians restart computers; faulty secondary power switch possible culprit; more troubleshooting planned\n\n=================================\n\n4:55 PM, 6/15/07, Update: Station computers brought to life after impromptu repair\n\nIn a possible breakthrough, space station commander Fyodor Yurchikhin and flight engineer Oleg Kotov used a jumper cable to bypass a suspect secondary power supply switch today and successfully activated four of six navigation and command computers that appeared to malfunction earlier this week, NASA officials said.\n\nDetails were not immediately clear, but two channels, or \"lanes,\" in the Russian central command-and-control computer appeared to operate normally after the improvised power supply repair, along with two of three lanes making up the station's guidance and navigation computer, known collectively as the terminal computer.\n\n\"Fyodor, go ahead and activate the central computer power... one, two, three,\" ground control called. A few moments later, after reviewing diagnostic data, a controller (speaking through an interpreter) radioed: \"Well, good news, it's good news that it's working.\"\n\nEach system includes three redundant computers that work in concert to avoid faulty data or incorrect results. The terminal computer system operates the station's Russian rocket thrusters to re-orient the lab complex as required to keep sunlight on solar arrays and to keep sensitive systems from getting too hot or too cold.\n\nThe central computer is used to control the Russian segment's Elektron oxygen generator, its Vozdukh carbon dioxide removal system and a variety of other critical functions. While both computer systems are triply redundant, the systems can safely operate the station with a single channel, or lane, in each computer.\n\nEarlier this week, around the time the Atlantis astronauts were installing a new solar power truss, the terminal computer crashed. An automated reboot procedure was then executed to shut down and restart all three terminal computer lanes and all three central computer channels. The reboot procedure didn't work, however, and engineers have been struggling ever since to restore the computer system to normal operation.\n\nAfter the power supply bypass surgery today, Russian flight controllers told their NASA counterparts lanes one and three were had been successfully repowered in the terminal computer, along with lanes two and three in the central computer. The systems then were shut down to close access panels and apparently restarted in self-test mode as planned. Controllers said they plan to operate the computers throughout the evening and to collect telemetry for additional analysis during passes over Russian ground sites early Saturday.\n\nEarlier this afternoon, U.S. flight controllers told spacewalker James Reilly to disconnect a power cable in a newly installed solar array truss to help engineers determine whether the cable might have played a role inthe computer malfunctions earlier this week. The miscues began right around the time the cable was connected Monday.\n\nBut late today, astronaut Megan McArthur radioed the crew from Houston saying that might no longer be necessary.\n\n\"They did have good fortune over there on the computers,\" she said.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}