{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "jamesrh <jamesrh@gmail.com>", "subject": "[R] heatmap and phylogram / dendogram ploting problem, ape package", "body": "I am having trouble displaying a dendrogram of evolutionary\nrelationships (a phylogram imported from the ape package) as the\nvertical component of a heatmap, but keeping the hierarchical\nclustering of the horizontal component.  The relationships of the\nvertical component in the generated heatmap are not that of the\ndendrogram, although the ordering is.\n\nIn more detail, I am attempting to generate a heatmap from a table\nthat contains the abundance of different bacteria at different\nlocations, with a dendrogram that groups the\nenvironments by the pattern of bacterial abundance.  This is easy, thanks to\na nice code snippet at the R Graph Gallery\n(http://addictedtor.free.fr/graphiques/RGraphGallery.php?graph=66):\n\nenv <- read.table(\"env.dat\")\nx  <- as.matrix(env)\nhv <- heatmap(x, col = cm.colors(256), scale=\"none\",\n              xlab = \"Environments\", ylab= \"Species\",\n              main = \"heatmap of species present in environments\")\n\nHowever, instead of a dendrogram that groups the rows (vertical axis)\nby the abundance pattern (as above), I would like to force it to order\nand display a dendrogram\nindicating their evolutionary relatedness.  I am using the excellent ape\npackage (http://cran.r-project.org/src/contrib/Descriptions/ape.html) to\nimport the evolutionary dendrograms.  I have already manipulated the\ndendrogram to be ultrameric, with branches all the same length, to\nprevent an error, although I would prefer not to have to do so:\n\nlibrary(ape)\nmytree <- read.tree(file = \"ultra.newick\", text = NULL, tree.names =\nNULL, skip = 0, comment.char = \"#\")\n#I then change them into a hclust:\ntree <- as.hclust(mytree)\n#and make this into a dendrogram\ndend <- as.dendrogram(tree)\n\nHowever, when I use this dendrogram as part of the heatmap, the relationships\nin the dendrogram that I'm loading are not preserved, although the order of\nbacteria in the heatmap changes:\n\nhv <- heatmap(x, col = cm.colors(256), scale=\"none\",\n        Rowv=dend, keep.dendro=TRUE,\n        xlab = \"Environments\", ylab= \"Species\",\n        main = \"heatmap of species present in environments\")\n\nIs there something obvious I am missing?  When I plot the hclust and\ndendrogram, they seem to preserve the relationships that I am attempting to\nshow, but not when the dendrogram is used in the heatmap.  I'm not sure I\nreally understand the datatype of R dendrogram objects, and this may\nbe the source of my\nproblems.  The heatmap documentation\n(http://addictedtor.free.fr/graphiques/help/index.html?pack=stats&alias=heatmap&fun=heatmap.html)\nis somewhat opaque to someone with my programing skills.  Would it be\nbetter to reorder the heatmap and then somehow add in the dendrogram\nwith add.expr command?\n\nIf anyone could suggest something, or point me in the right direction I would\ngreatly appreciate it.\n\n\n   jamesh\n\nHere are the contents of the two files used as examples above:\n\nenv.dat:\nsoil1 soil2 soil3 marine1 marine2 marine3\nOne 23 24 26 0 0 0\nTwo 43 43 43 3 6 8\nThree 56 78 45 23 45 56\nFour 6 6 3 34 56 34\nFive 2 17 12 76 45 65\n\n\n\n\nultra.newick:\n(((One:1,Four:1):1,(Three:1,Two:1):1):1,Five:3):0.0;\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}