{"category": "ham", "to_address": "Beginners List <beginners@perl.org>", "from_address": "\"Mumia W.\" <mumia.w.18.spam+nospam@earthlink.net>", "subject": "Re: Usenet messages are appearing on beginners@perl.org", "body": "On 06/05/2007 10:36 PM, Chas Owens wrote:\n> On 6/5/07, Mumia W.  wrote:\n>> A horrible thing has happened recently.\n>>\n>> Messages from usenet seem to be appearing here.\n> snip\n>> Some of the junk that\n>> goes on on usenet doesn't need to happen here.\n> snip\n> \n> The method of connecting to the list shouldn't matter.  We have\n> standards of conduct and those  who do not wish to follow them will be\n> asked not to post anymore.  Let's not go looking for trouble that\n> doesn't exist yet.\n> \n\nThe problem is the certain people have developed certain demeanors on \nthe Perl usenet newsgroups. Now whenever these people post to the Perl \nnewsgroup perl.beginners, their posts will be reflected here on \nbeginners[at]perl.org.\n\nThese people will never change, and I killfiled them a long time ago, \nbut they will still change the character of this mailing list, and that \nI don't want.\n\nThere are two problems with asking them to leave:\n\n1) They won't leave.\n\n2) Where do they go? They've been posting to the perl.beginners \nnewsgroup for ages, and when they post to that newsgroup, they should \nhave no expectation that they messages will be reflected to our mailing \nlist.\n\nThe problem is a gross misconfiguration somewhere that needs to be fixed \nASAP. I hope that Google is not involved. Google has been doing to \npretty weird things lately with mailing lists and moderators[at]isc.org \n(which presumably facilitates posting to moderated newsgroups).\n\nI understand that Google has a big presence on usenet, but I hope that \nthey haven't used that power to arbitrarily affect a major change to the \nstructures of usenet and the mailing lists.\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}