{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "\"Bi-Info (http://members.home.nl/bi-info)\" <bi-info@home.nl>", "subject": "Re: [R] Reasons to Use R", "body": "I certainly have that idea too. SPSS functions in a way the same, \nalthough it specialises in PC applications. Memory addition to a PC is \nnot a very expensive thing these days. On my first AT some extra memory \ncost 300 dollars or more. These days you get extra memory with a package \nof marshmellows or chocolate bars if you need it.\nAll computations on a computer are discrete steps in a way, but I've \nheard that SAS computations are split up in strictly divided steps. That \nalso makes procedures \"attachable\" I've been told, and interchangable. \nDifferent procedures can use the same code which alternatively is \ncheaper in memory usages or disk usage (the old days...). That makes SAS \nby the way a complicated machine to build because procedures who are \nsplit up into numerous fragments which make complicated bookkeeping. If \nyou do it that way, I've been told, you can do a lot of computations \nwith very little memory. One guy actually computed quite complicated \nmodels with \"only 32MB or less\", which wasn't very much for \"his type of \ncalculations\". Which means that SAS is efficient in memory handling I \nthink. It's not very efficient in dollar handling... I estimate.\n\nWilfred\n\n\n------------------------------------------------------------------\n\n\n\n\nCertainly true.  In particular, SAS was designed from to store\ndata items on disk, and to read into core memory the minimum\nneeded for a particular calculation.\n\nThe kind of data SAS handles is (for the most part) limited to\nrectangular arrays, similar to R data frames. In many procedures\nthey can be read from disk sequentially (row by row), which\nundoubtedly simplifies memory handling.  It seems logical to\nsuppose that in developing SAS, algorithms were chosen to\nsupport that style of memory management. Finally, the style of\nwriting programs in SAS consists of discrete steps of\ncomputation, between which nothing but the program need be held\nin core memory.\n\n\n\"Gabor Grothendieck\"  wrote:\n\n> I think SAS was developed at a time when computer memory was\n> much smaller than it is now and the legacy of that is its better\n> usage of computer resources.\n> \n> On 4/10/07, Wensui Liu  wrote:\n> > Greg,\n> > As far as I understand, SAS is more efficient handling large data\n> > probably than S+/R. Do you have any idea why?\n\n-- \nMike Prager, NOAA, Beaufort, NC\n* Opinions expressed are personal and not represented otherwise.\n* Any use of tradenames does not constitute a NOAA endorsement.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n\n-- \nNo virus found in this incoming message.\n\n\n22:44\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}