{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nMonday, 28 May, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nDerby 1-0 West Brom\nStephen Pearson scores the only goal as Derby win the Championship play-off final to secure a place in next season's Premiership.\n\n\n\n \nDavies delights as Rams cash in\nDerby boss Billy Davies looks forward to pitting his wits against the Premiership elite.\n\n\n\n \nKeane signs new deal at Tottenham\nTottenham striker Robbie Keane commits himself to the club for another five years.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nRose pulls out of Memorial event\nEngland's Justin Rose pulls out of this week's Memorial Tournament in America.\n\n\n\n \nDredge eyes home Wales Open win\nBradley Dredge is on a quest to become the first home winner of the Celtic Manor Wales Open.\n\n\n\n \nHansen snatches victory from Rose\nAnders Hansen edges a sudden-death play-off with Justin Rose to win the PGA Championship at Wentworth.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nMcLaren race victory to be probed\nFormula One's governing body will investigate McLaren for a possible breach of the rules in Sunday's Monaco Grand Prix.\n\n\n\n \nMcLaren deny anti-Hamilton bias\nMcLaren say Lewis Hamilton is free to race team-mate Fernando Alonso despite imposing team orders at the Monaco Grand Prix.\n\n\n\n \nScot Franchitti clinches Indy 500\nScotland's Dario Franchitti wins the Indianapolis 500 in front of 350,000 fans.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nMcLaren deny anti-Hamilton bias\nMcLaren say Lewis Hamilton is free to race team-mate Fernando Alonso despite imposing team orders at the Monaco Grand Prix.\n\n\n\n \nAlonso puts Hamilton in his place\nFernando Alonso beats McLaren team-mate Lewis Hamilton to win the Monaco Grand Prix and retake the championship lead.\n\n\n\n \nAs it happened: Monaco Grand Prix\nFernando Alonso triumphs for McLaren at the Monaco Grand Prix.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nDisgraced Chambers in drugs claim\nDwain Chambers claims there will always be athletes using performance-enhancing drugs because the scientists will remain one step ahead of the testers.\n\n\n\n \nSotherton javelin costs her dear\nAnother woeful performance with the javelin sees Kelly Sotherton finish seventh in her first\nheptathlon competition of the season.\n\n\n\n \nOkoro wins 800m race in Holland\nMarilyn Okoro clinches a thrilling 800m victory at the Thales FBK-Games in Hengelo, Holland.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nRicco toils to mountain stage win\nSaunier Duval rider Riccardo Ricco wins the gruelling 15th stage of the Tour of Italy.\n\n\n\n \nZabel admits to doping at Telekom\nGerman cyclist Erik Zabel becomes the latest cyclist to admit to using banned blood booster EPO while competing for Telekom in the 1990s.\n\n\n\n \nLandis hearing brought to an end\nFloyd Landis's doping hearing ends on Wednesday after nine days of legal arguments and dramatic testimony.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nReview of the week\nGraham Poll gets his air guitar out as the Liverpool parade bus stays in the garage\n\n\n\n \nFarewell West Jesmond\nBBC Sport's adopted team look back on their season\n\n\n\n \nQuotes of the Week\nLawro says what he thinks about the FA Cup final, plus Mourinho & Warnock\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}