{"category": "spam", "to_address": "undisclosed-recipients:;", "from_address": "\"Catherine Davis.\" <hellstone@bigpond.com>", "subject": "BELOVETH", "body": "\n\n4 Old Church Street,\nChelsea,SW3,\nEngland.\nEMAIL ADDRESS:madam_cdavis@yahoo.co.uk\n\nThough I have not considered this medium to be the  best manner to have\napproached you on this issue being that the Internet has been greatly\nabused over the recent years and is very unsecured for informations of\nvital\nimportance. I have decided to take the chance seeing that no other means\ncould have been faster and more efficient than the E-mail.\n\nHere writes Madam Catherine Davis,I am married to Engineer Davis an\nEnglishman who is dead. My husband was into private practice all his\nlife before his death.\n\nWhen my late husband was alive he deposited the sum of 3 Million\n (THREE Million Great Britain Pounds Sterling which were derived\nfrom his vast estates and investment in capital market with a security\ncompany here in UK. Presently, this money is still with the security\ncompany.\n\nMy Doctor told me that I have limited days to live due to the cancerous\nproblems I am suffering from. I have decided to donate this fund to\nyou and want you to use this gift which comes from my husbands effort\nto fund the upkeep of widows, widowers, orphans, destitute, the\ndown-trodden, physically challenged children, barren-women and\npersons who prove to be genuinely handicapped financially.\n\nAs soon as I receive your reply I shall give you the contact of the\nSecurity company in UK. I will also issue you a Letter of Authority that\nwill empower you as the original beneficiary of this fund. My happiness\nis that I lived a life worthy of emulation. Please always be prayerful\nall through your life. Please assure me that you will act just as I\nhave stated herein.\n\nHope to hear from you soon and God bless you and\nmembers of your family.\n\nGod bless you and members of your family.\nMadam Catherine Davis.\n\n----------------------------------------------------------------\nThis e-mail has been sent via JARING webmail at http://www.jaring.my\n\n"}