{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Anthony W. Youngman\" <debian@thewolery.demon.co.uk>", "subject": "Re: License question: GPL+Exception", "body": "In message <20070513100959.11875F7225@nail.towers.org.uk>, MJ Ray \n writes\n>Wesley J. Landaker  wrote:\n>> On Saturday 12 May 2007 16:01:25 Francesco Poli wrote:\n>> > You may not impose any further restrictions with respect to the *rights\n>> > granted by the GPL*.  But there are already such restrictions, and you\n>> > cannot remove them because you are not the copyright holder.\n>> > Hence you cannot comply with the license and the work is\n>> > undistributable.\n>>\n>> A licensee can't, but the copyright holder can. Their license is NOT the\n>> GPL, but GPL + exceptions & restrictions. That is perfectly valid, just not\n>> GPL compatible. The exception they have adds extra freedom, and I believe\n>> the one restriction they add is DFSG-free. [...]\n>\n>First, I think b is not an exception but a restriction.\n>\n>Adding any restrictions to plain GPL results in an invalid licence as in\n>http://lists.debian.org/debian-legal/2006/05/msg00303.html\n\nI think you're wrong here ... (certainly if the entire grant is by a \nsingle entity)\n\n>\n>That isn't much different to using the plain GPL with an OpenSSL-like\n>licence - both licences are DFSG-free, but we can't satisy both of them\n>simultaneously without additional permission on the GPL side.  Of course\n>a copyright holder of the entire work could still copy and distribute\n>and so on because they don't need a licence but we can't because we\n>can't satisfy both of those restrictions simultaneously.\n>\n>The copyright holder could make a new licence out of the GPL, as\n>permitted by the FSF, but they have not done so.  I think they should\n>use the plain GPL, because I dislike licence proliferation.\n\nAs, presumably, they do. Hence \"GPL plus restrictions\".\n>\n>I'm surprised that Red Hat have produced an inconsistent licence and I'm\n>surprised that GPL+restrictions isn't widely-known as non-free.\n>\n>Hope that explains,\n\nThing is, the licence, as granted by the !copyright holder! is not \n\"GPL\", but \"GPL plus restrictions\". The result can't be invalid, because \nit is granted by the copyright holder, and is clear as to what is \ngranted.\n\nA \"GPL plus restrictions\" is only invalid when the GPL is granted by one \nentity, and the restrictions imposed by a different one. I can't licence \nmy code as \"plus restrictions\" and mix it with \"pure GPL\" code by \nsomeone else.\n\nCheers,\nWol\n-- \nAnthony W. Youngman - anthony@thewolery.demon.co.uk\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}