{"category": "ham", "to_address": "Ip-health <ip-health@lists.essential.org>", "from_address": "James Love <james.love@keionline.org>", "subject": "[Ip-health] Merck loses Formulation Patent case, court cites KSR", "body": "Apparently, Merck has lost the first US post KSR decision on\npatentability of a drug formulation.\n\n*  Judge Pauley said:   \"Under KSR, 'the combination of familiar\nelements according to known methods is likely to be obvious when it\ndoes no more than yield predictable results.' The '340 patent does no\nmore than combine the predictable results of Davis and Wolfe with the\npredictable results of the '072 and '114 patents.\"\n\nhttp://biotech.seekingalpha.com/article/37659?source=feed\n\nMerck's Formulation Patent on Pepcid Complete Invalidated by District\nCourt\n\nPosted on Jun 7th, 2007 with stocks: MRK, PRGO\n\nAaron F. Barkoff submits: In an opinion released Tuesday, Judge\nWilliam H. Pauley III of the U.S. District Court for the Southern\nDistrict of New York ruled that Merck's (MRK) patent on the\nformulation for Pepcid Complete is invalid as obvious, clearing the\nway for Perrigo Co.(PRGO) to sell its own generic version of the\nmedication. The decision is one of the first pharmaceutical patent\ndecisions to rely on, and quote extensively from the Supreme Court's\nApril 30 decision in KSR v. Teleflex (TFX).\n\nThe patent-in-suit was Merck's U.S. Patent No. 5,817,340. Claim 1 of\nthe '340 patent recites a solid oral dosage form comprising\nimpermeably coated famotidine granules and aluminum hydroxide or\nmagnesium hydroxide. Pepcid Complete comprises coated famotidine\ngranules (to inhibit stomach acid secretion) and magnesium hydroxide\n(to neutralize stomach acid already present). The coating on the\nfamotidine granules is important; without it, magnesium hydroxide\nwould cause famotidine to degrade upon contact. Additionally, the\ncoating masks the bitter taste of famotidine.\n\nAccording to Judge Pauley's opinion, two prior art references,\n\"Davis,\" and \"Wolfe,\" had previously taught the use of famotidine\nwith magnesium hydroxide in a pharmaceutical composition. Moreover,\naccording to the opinion, two prior art patents, the '072 and '114\npatents, taught coating of famotidine granules in order to mask\nfamotidine's bitter taste.\n\nJudge Pauley began his analysis by referring to the \"teaching,\nsuggestion, or motivation\" test as follows:\n\n     Until recently, the Federal Circuit had employed an additional\ntest for determining the obviousness of combining prior art\nreferences.\" Then, after reviewing the scope and content of the prior\nart, he stated: \"Under KSR, 'the combination of familiar elements\naccording to known methods is likely to be obvious when it does no\nmore than yield predictable results.' The '340 patent does no more\nthan combine the predictable results of Davis and Wolfe with the\npredictable results of the '072 and '114 patents.\n\nJudge Pauley went on to imply that even pre-KSR, he would have found\nthe '340 patent invalid as obvious, since one of skill in the art\n\"would have been motivated to use impermeable coating to improve the\npalatability of a chewable tablet comprised of coated famotidine and\nantacids.\" Nonetheless, the decision is still informative of how\ndistrict courts are applying KSR to pharmaceutical formulation patents.\n\nOrtho-McNeil, a unit of Johnson & Johnson (JNJ), markets Pepcid\nComplete in partnership with Merck. Pepcid Complete is an over-the-\ncounter product intended for the treatment of heartburn, with annual\nretail sales of about $90 million. Perrigo reportedly plans to begin\nselling its generic version sometime next year, and expects to have\n180-day exclusivity when it does.\n\nRELATED READING:\n\n   # Perrigo press release\nhttp://www.perrigo.com/uploadedFiles/Investors/Press_Releases/\nFamotidine%20Patent.pdf\n\n\n------------------------------------\nJames Packard Love\nKnowledge Ecology International\njames.love@keionline.org\nWk +1.202.332.2670, US cell +1.202.361.3040, Geneva Cell +41.76.413.6584\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}