{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Yesenia Nieves\" <powclairehayekdeq@clairehayek.com>", "subject": "Healthy living with less fat", "body": "\nHealthy living with less fat\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most fascinating lose flesh product is now available – As could be seen on CNN.\n\n\nCan you count up all the times when you told yourself you would do any thing for being saved from this quickly growing number of kilos? Happily, now no great price is to be paid. With Anatrim, the earth-shaking pound-melting blend, you can get naturally health life style and become really slimmer. Have a look at what our customers say!\n\n\n\n\"It’s quite difficult to admit it but I was an awful food addict. \n\n\nI swallowed up all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis suffering stopped when I started course of taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my inclination to eat constantly abated, \n\n\nspirits increased and I’m the happiest person in the world 28 pounds in 2.6 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nLusia R., Colorado\n\n\n\n\n\n\"I had problems with over-weight since I was a boy. \n\n\nYou can't even fancy how I abhorred being ridiculed at school. \n\n\n\n\nI detested my plumpness and I hated myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nIt literally pulled me out of this terrible nightmare! Thanks and thanks to you, guys.\"\n\n\n\n\n\nSerge Smith, Boston\n\n\n\n\n\n\"You know what? Anatrim preserved my marriage! I got into the circle, depression – eating more – more depression. My wife had thought to leave the overweight psycho I was turning in. \n\n\nMy friend showed me web page and I called for my pack of Anatrim as soon as it was possible. \n\n\nThe results I achieved were magnficent, my appetite became normal, I was in a good mood oftener, and, certainly, I went some belt holes back. And you see me, the sex became fantastic also!\"\n\n\n\n\n\nDonald\n\n\n\n\n There is a great number of gratitudes happy people leave after trying Anatrim. Don’t you wanna add yourself to the thousands and thousands of slim clients and take this original appetite abating energy boosting product now!\n\n\nDo not lose the opportunity!\n\n\n\n\n"}