{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "215p 4/26 Update: Hawking eager for zero G", "body": "\n\n\n\n\n215p 4/26 Update: Hawking eager for zero G\n\n\n\n=================================\n\nCBS NEWS Coverage of Breaking Space News\nLast Updated: 02:15 p.m., 04/26/07 (all times Eastern)\n\nBy William Harwood\nCBS News Space Consultant\n\nChanges and additions:\n\n   04/21/07 (05:15 a.m.): Soyuz TMA-9 undocks from space station\n   04/21/07 (07:50 a.m.): Soyuz braking rockets fired\n   04/21/07 (09:15 a.m.): Soyuz lands in Kazakhstan\n   04/26/07 (02:15 p.m.): Hawking set for zero G flight\n\n=================================\n\n02:15 p.m., 04/26/07, Update: Hawking set for zero G flight\n\nPhysicist Stephen Hawking, the wheelchair-bound theorist known for his insights into the nature of gravity and black holes, said today he was thrilled at the prospect of enjoying a few moments of weightlessness during an airplane ride off Florida's East Coast.\n\nAttended by a team of physicians, nurses and supporters, Hawking expected to experience 20 to 25 seconds of weightlessness each time the Zero Gravity Corp.'s Boeing 727 jet crested the top of a parabolic arc. Passengers in such flights can enjoy a half-minute or so of weightlessness as they \"fall\" toward Earth inside the plane's foam-padded interior.\n\nAt the bottom of the arc as the nose of the plane is pulled up, passengers are subjected to about 1.5 times the normal force of gravity. Hawking, who suffers from amyotrophic lateral sclerosis, or ALS - Lou Gehrigs Disease - will be closely monitored throughout the afternoon flight.\n\n\"Many people have asked me why I am taking this flight,\" the renowned physicist told reporters earlier today at the Kennedy Space Center's Shuttle Landing Facility. \"I am doing it for many reasons. First of all, I believe that life on Earth is at an ever increasing risk of being wiped out by a disaster, such as sudden global warming, nuclear war, a genetically engineered virus or other dangers.\n\n\"I think the human race has no future if it doesn't go into space. I therefore want to encourage public interest in space,\" he said, speaking through a computer in his famously robotic \"voice.\" \"I have long wanted to go into space and the zero gravity flight is a first step toward space travel. I also want to demonstrate to the public that everyone can participate in this type of weightless experience.\"\n\nPeter Diamandidis, founder and CEO of Zero Gravity Corp., said the flight was organized to benefit four charities - Easter Seals, the Starlight Starbright Children's Foundation, Augie's Quest and the X Prize Foundation. Eight seats were auctioned off, raising some $150,000. Rides on the plane normally sell for $3,500 per passenger.\n\n\"We're really excited,\" Diamandis said. \"The entire team is pumped and ready to go to fulfill his dream of being weightless.\"\n\nTo ensure's Hawking's safety, the physicist will be closely monitored by his personal team of physicians and nurses. During a test flight Wednesday using an eighth grade student as a stand in, the team perfected the way they will gently lower Hawking to the padded floor after each parabola to make sure he remains comfortable during the half-minute or so when he will be subjected to 1.5 times the normal force of gravity.\n\n\"We've done a tremendous amount to ensure safety on this flight,\" Diamandis said. \"We feel we have an excellent safety plan.\"\n\nDiamandis said Hawking's doctors will assess blood pressure, oxygen levels and other factors after the first parabola to make sure it is safe to proceed. Diamandis said he would be happy with a single parabola, prompting Hawking to interject a computer-synthesized \"no!\"\n\n\"As you can imagine, I am very excited,\" Hawking said earlier. \"I have been wheelchair bound for almost four decades and the chance to float free in zero G will be wonderful.\"\n\nHawking is considered one of the world's leading authorities on quantum black holes and big bang cosmology. Along with his scholarly achievements, Hawking is the author of the popular bestseller \"A Brief History of Time.\"\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}