{"category": "ham", "to_address": "\"Richard M. Heiberger\" <rmh@temple.edu>", "from_address": "Duncan Murdoch <murdoch@stats.uwo.ca>", "subject": "Re: [R] shell.exec() on Windows, unexpected behavior", "body": "On 11/05/2007 7:37 PM, Richard M. Heiberger wrote:\n> I have Windows XP machines with different software configurations.\n> My laptop has Adobe Reader 8 and Adobe Acrobat 6.\n> My desktop has Adobe Reader 8 and does not have Adobe Acrobat.\n> \n> On both machines, PDF extensions are registered to Adobe Reader 8.0,\n> and double-clicking a pdf file in Windows Explorer opens Adobe Reader\n> 8.0.\n> \n> In R-2.5.0, with all Adobe windows closed, the command\n>   shell.exec('c:/Program Files/R/R-2.5.0/doc/manual/R-admin.pdf')\n> opens an Adobe window.\n> On the laptop, it opens Adobe Acrobat 6.0.\n> On the desktop, it opens Adobe Reader 8.0.\n> \n> When an Adobe window is aleady open, shell.exec() uses the already\n> open Adobe window.\n> \n> Neither machine has any Adobe directories in the shell(\"PATH\").\n> \n> I am puzzled by shell.exec() opening \"Adobe Acrobat\" when the file\n> extension is registered to \"Acrobat Reader\".  The documentation in\n> ?shell.exec says \"Opens the specified file or URL using the\n> application specified in the Windows file associations.\"\n\nshell.exec(\"foo.pdf\") does the same thing that \"start foo.pdf\" would do \nfrom a Windows command line.  Do you see the same behaviour there?  I \nthink this is also usually the same thing as a right click Open does, \nbut that may be changeable.\n\nWhat may be happening is that Acrobat has installed some fancy shell \nextension that doesn't execute an \"open\" on the file, it does something \nelse instead.\n\nDuncan Murdoch\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}