{"category": "spam", "to_address": "Wisdom <wisdom@flax24.uwaterloo.ca>", "from_address": "Barbara Reeves <cassidy@go2tw.com>", "subject": "Can you imagine?", "body": "\n\nIs there any reasons to pay more? Do you want to save your money? I bet you do! \nBuy medications at RX online drug store!\nLicensed Viagra and Cialis we are offering would improve your sexual life in few moments.\nClick here\nWe can help you anytime! Various medications for any case!\nWith best regards,\nBarbara Reeves\n \n \nIa triahnul golovoj, progoniaia iz soznaniia ostatki perezhitoj muti, Pokosilsia na svoih sputnikov. I Otshelnik sdelal. Esli zhe ty budesh s nami, to zhizn tvoia budet Podvergatsia opasnosti tak zhe, kak i ostalnyh. Uvy. \nPoetomu ia lezhal i prislushivalsia k boli, s kakim-to Lenivym osterveneniem terzavshej telo ot piat do makushki. Krome togo, sedousyj Govoril o kakoj-to tvari, chto sadilas na plecho molodogo, posle chego ego Povedenie izmenilos. Gilsveri etogo takzhe ne zametil. Grontu bylo ne do vialyh krasot prirody Nichejnyh zemel, skudnyh i na Rastitelnost, i na zhivotnyh. ) Tri skolziashchih shaga v storonu. Zhenshchina iarostno zakrichala i Obrushila na nego kosoj rubiashchij udar, vkladyvaia v nego vsiu silu obeih ruk. Ona Dejstvovala ne po svoej vole. U Biloka bylo kak-to osobenno priiatno posidet I poraskinut mozgami, razmyshliaia nad ocherednoj problemoj. \nPotomu chto na altare, obnazhennaia, kak i ia, Nepodvizhno lezhala Nori, gliadia na menia glazami, perepolnennymi dikim uzhasom. I ochen uzh uzkoj byla eta rasselina Shirinoj vsego v paru shagov, ona vesma nepriiatno smahivala na gigantskie Kamennye ladoni, postavlennye na rebro i gotovye v liubuiu sekundu ozhit i Somknutsia. Haski eto ne dal-rokty, ih Vneshnost ne privlekaet nichego vnimaniia v chuzhih makorah, da i poteriat ih ne Tak zhal. Da i ne mog on predstavit ni Odnogo iz etih chuzhakov-zasfernikov, ni proshlyh, ni nyneshnego, v roli Svetocha, Neistrebimogo, Izbavitelia Habusa. ejisuminyon Q1FUW1pVckRcUFBGHUFCUEZWRlleXR1XVA==\n \n\n\n"}