{"category": "ham", "to_address": "chrishold@psyctc.org", "from_address": "Barry Rowlingson <b.rowlingson@lancaster.ac.uk>", "subject": "Re: [R] Tools For Preparing Data For Analysis", "body": "Chris Evans wrote:\n\n> Thanks Ted, great thread and I'm impressed with EpiData that I've\n> discovered through this. I'd still like something that is even more\n> integrated with R but maybe some day, if EpiData go fully open source as\n> I think they are doing (\"A full conversion plan to secure this and\n> convert the software to open-source has been made (See complete\n> description of license and principles).\" at http://www.epidata.dk/ but\n> the link to http://www.epidata.dk/about.htm doesn't exactly clarify this\n> I don't think.  But I can hope.)\n> \n> Thanks, yet again, to everyone who creates and contributes to the R\n> system and this list: wonderful!\n\n  Perhaps what we need is an XML standard for describing record-oriented \ndata and its validation? This could then be used to validate a set of \nrecords and possibly also to build input forms with built-in validation \nfor new records.\n\n  You could then write R code that did 'check this data frame against \nthis XML description and tell me the invalid rows'. Or Python code.\n\n  This is the kind of thing that is traditionally built using a database \nfront-end, but keeping the description in XML means that alternate \ninterfaces (web forms, standalone programs using Qt or GTK libraries) \ncan be used on the same description set.\n\n  I had a quick search to see if this kind of thing exists already, but \ngoogle searches for 'data entry verification' indicate that I should \nreally pay some people in India to do that kind of thing for me...\n\nBarry\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}