{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Kayla Paige\" <dofcovenantopcgus@covenantopc.org>", "subject": "Melt away pounds with Anatrim", "body": "\nGet out of the obese crowd\n\n\n\n\n\n\nAnatrim – The newest and most attracting product for weighty people available – As were seen on Oprah.\n\n\nCan you count up all the situations when you plead to yourself to do anything for being rescued from this quickly growing pounds of fat? Happily, now no major sacrifice is expected. With Anatrim, the ground-breaking pound-melting blend, you can achieve naturally health life style and become really slimmer. Have a look at what our customers write!\n\n\n\n\"I hate to admit it but I was extremely addicted to food. \n\n\nI greedily ate all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis ruinous passion finished when I started course of taking Anatrim! \n\n\nGod,\n\n\n\n\n my craving for food abated, \n\n\nspirits increased and I’m the happiest person on the planet 22 pounds in 2.1 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person!\"\n\n\n\n\n\nLinda F., New York\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nYou can't fancy how I hated being mocked at school. \n\n\n\n\nI hated my weight and I abhorred even myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nThis stuff literally dragged me out of this terrible nightmare! Lots of thanks to you, guys.\"\n\n\n\n\n\nMike Brown, Las Vegas\n\n\n\n\n\n\"You know what? My marriage was saved thanks to Anatrim! I got into this circle, depression – more eating – just more depression. My wife had thought to leave the overweight psycho I was turning in. \n\n\nOnce one of my friends showed me site and I asked for Anatrim right away. \n\n\nThe final result was great, my appetite came to admissible level, I was often in a good mood, and, certainly, I went some belt holes back. And you see me, the bedroom became cool, too!\"\n\n\n\n\n\nFrancis\n\n\n\n\n There are lots of gratitudes left by delighted people trying Anatrim. Don’t you wanna join the tens of thousands of slim customers and take this all-natural appetite suppressing energy lifting product now!\n\n\nDo not decline the opportunity!\n\n\n\n\n"}