{"category": "ham", "to_address": "debian-devel@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Steve Langasek <vorlon@debian.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "On Tue, Jun 05, 2007 at 10:41:46PM +1000, Anthony Towns wrote:\n> On Tue, Jun 05, 2007 at 02:09:06AM -0700, Steve Langasek wrote:\n> > Why doesn't it matter?  If I've been sued because of something I've actually\n> > done that infringed the license, then surely the DFSG and Debian shouldn't\n> > be concerned with that (other than the question of whether what I've done is\n> > something that the DFSG requires of copyright holders); but if I'm being\n> > sued over something I *didn't* do, [...]\n\n> If you're going to be sued for something you didn't do, and lose because\n> in your absence you're assumed to have done it, why not go the whole\n> hog and just have them assert you've used/distributed a program you've\n> never actually used/distributed?\n\nIn a court where a choice of venue clause holds water, in all likelihood the\ncourt will not deem the normal jurisdictional rules to be overridden until\nthey're shown that you've *accepted* the license.  If the plaintiff can't\nshow this, the nuisance suit stops there.\n\nIf they *can* show this, you get the choices mentioned before.\n\nYou might still wind up with summary judgement against you in a foreign\ncourt if the copyright holder fools the judge and you don't have the\nresources to contest their claim; but that's more of a gamble, the copyright\nholder has to convince a judge both that you've accepted the license and\nthat you've violated it.\n\nYes, there is some risk of a nuisance suit when you haven't accepted the\nlicense, but that's our baseline which is unrelated to whether the license\nis free.  If distributing code under the license increases the\nodds/decreases the cost of a malicious copyright holder being able to pull\nthis off, and concommitantly increases the odds of a malicious copyright\nholder *trying* to pull this off, I don't think that should be ignored.\n\n> AFAICS this is an issue only when there's a not completely trivial\n> possibility that you have actually violated the license.\n\nI think it's also an issue when you have a malicious copyright holder who\nbelieves they can convince the /judge/ that there's a possibility.\n\n> >     * If I get sued in Oregon, I have a wide range of local resources at my\n> >       disposal to help me find appropriate legal representation; if I get\n> >       sued in Australia, I'm stretching my connections pretty thin to find\n> >       and evaluate legal counsel, and this process is going to cost more\n> >       time and money on my part (and may leave me with inferior legal\n> >       counsel anyway in the end due to logistical issues)\n\n> For Australia, assuming you were being sued over free software stuff\n> that you'd be doing in good faith, I think we could do a fairly good\n> job helping you out.\n\nIs that going to be the case for anyone who redistributes Debian or\ndistributes modified versions of packages received from us?\n\nShould a license problem be ignored on the grounds that we think the Free\nSoftware community will stick together in the event the problem clause is\ninvoked?\n\n> > As an analogy, suppose that a license included the following clause:\n> >   By distributing the covered work, you agree that the copyright holder can\n> >   compel you at any time to play in an on-line black jack tournament at his\n> >   website, geekblackjackstars.net, with an initial ante of $100.\n> > Should Debian consider this to be a free license because the clause won't\n> > necessarily be invoked and because some people win at blackjack?\n\n> Clearly not. BTW, that site doesn't seem to exist.\n\nAnd it still doesn't, a whole 10 days later?  Pff, doesn't anybody on these\nlists have a sense of entrepreneurship?\n\n> The difference between blackjack and choice of venue is that in one\n> case you're being compelled to do something, and in the other you're\n> pre-determining an argument. AFAICS that breaks that analogy.\n\nIn the blackjack case, you're only being compelled at the copyright holder's\nwhim.  In the choice of venue case, if there is no restriction preventing\nthe clause from being invoked on licensees who don't have a legal presence\nin the named district, you are also being compelled to appear in court.  The\nconsequences for refusing to appear in court are different than the\nconsequences for refusing to play blackjack, but to me they do seem\nanalogous in that a requirement is being conditionally imposed on the\nlicensee that has nothing to do with the software itself.\n\nIf Debian has competent legal advice to the effect that this choice of venue\nlanguage will only take effect for licensees that already have a legal\npresence in the named districts, then I withdraw my objection; but I don't\nthink that's the plain English reading of the clause at hand.\n\n> Two different analogous licenses might be:\n\n>   By distributing the covered work, you agree that the copyright holder\n>   can sue you for violations of the license.\n\n>   If you distribute the covered work, the licensor agrees not to sue you\n>   in any jurisdiction other than Berlin, Germany.\n\n> I'd consider both those to be clearly free. Choice of venue goes beyond\n> either of them, certainly. But I'm still not seeing a way in which it\n> goes so far beyond them as to become non-free.\n\n> Heck, is choice of venue actually different to the combination of those\n> clauses?\n\nYes, it's the \"if you distribute the covered work, you agree that the\nlicensor may sue you in Berlin, Germany\".\n\n> > > Simon Phipps' argument, presented at debconf last year, is (aiui) that\n> > > the clause only comes into play when both parties are organisations\n> > > that cross multiple jurisdictions anyway -- in which case they're both\n> > > presumed to have a presence in the given jurisdiction anyway, and could\n> > > reasonably be expected to be following its rules, afaics.\n> > Has this opinion been confirmed by a lawyer on *SPI's* payroll, not just by\n> > one on *Sun's* payroll? :)  \n\n> TTBOMK, no. ITYM \"acting on behalf of SPI\" rather than \"on SPI's payroll\"\n> btw. :)\n\nSure. :)\n\n-- \nSteve Langasek                   Give me a lever long enough and a Free OS\nDebian Developer                   to set it on, and I can move the world.\nvorlon@debian.org                                   http://www.debian.org/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}