{"category": "ham", "to_address": "samba-technical@samba.org, samba@samba.org, samba-announce@samba.org", "from_address": "Jeremy Allison <jra@samba.org>", "subject": "CIFS Engineering Workshop in Mountain View,\n\tCalifornia: September 26-28th 2007", "body": "CIFS Engineering Workshop: September 26-28th 2007.\n\nThe Samba Team  will be running a CIFS Engineering Workshop\nevent hosted at the Google Campus in Mountain View, California, USA\non September 26-28th 2007.\n\nThis event is intended for engineers working on any CIFS products\nand services, not just products based on the Samba codebase. We\nwelcome engineers from any implementers of the CIFS and SMB2\nprotocols, or from people shipping products based on these\nprotocols, or people with a deep interest in advancing the\nstandardization of these protocols.\n\nThis is not a marketing or customer focused event, the intent\nis that engineers will get together and discuss protocol details\nand implementation choices in an open and free environment, helped\nalong with free Google food and a gigabit network for testing. There\nwill be some arranged talks, but mostly this will be an interoperability\nevent.\n\nThere will be some restrictions on using information gathered at\nthe event for marketing purposes in the same way as the Connectathon\nevent restricts using any performance or defect data learned at the\nevent. The goal is for engineers from competing companies to feel free to\nwork together without fear of revealing information they wish to\nkeep secret.\n\nThere is no charge for attending, but as this event will be hosted\non the Google Campus space will be limited, so if you would like\nto attend or send engineers to this event please email :\n\ncifs-workshop@samba.org\n\nas soon as possible so we can get an idea of the numbers involved\n(and help Google with planning). If you'd like to present a talk,\nplease send a brief abstract to the same address. Currently the same\nreview board who accepts talks for SambaXP will review the abstracts,\nbut if this event is successful a more formal review process will\nbe adopted.\n\nFAQ:\n\nWhy a new event ?\n\nAttendance at the CIFS conference has fallen to such an extent that\nit has become a small interest group in the larger storage conference.\nThe Samba Team wishes to revive interest in a broader discussion of\nimplementation and standardization of the CIFS protocols, as well as\npromote an interoperability lab.\n\nWho decides who will be allowed to attend ?\n\nCurrently the same group who runs the SambaXP conference, mainly\nthe Samba Team, SerNet, and Google (who are hosting). The goal is\nto make this event as inclusive as possible, so initially we are\ntrying to gage interest to finalize the numbers we can host (this\nis where Google comes in).\n\nI don't use Samba, should I come ?\n\nCertainly ! Anyone who has an interest in working on, documenting\nor standardizing the CIFS and SMB2 protocols is welcome. This includes\nany proprietary vendors as well as vendors who OEM the Samba codebase.\nService vendors who implement and support CIFS networking with\nthird-party software are also welcome.\n\nWhat software will be available to test against ?\n\nAll versions of Samba, as well as any required versions of DOS\nand Windows products will be available on the test network. Other\nsoftware will depend on the participants bringing versions of their\nsoftware along. We hope to be able to get a varied mixture of CIFS\nimplementations for testing.\n\nMy company has signed the MCPP license with Microsoft, are we welcome ?\n\nYes, although of course we would expect that your attendees please\nrespect the MCPP licensing process and not divulge any information\nyou have learned from the MCPP documents. You are especially welcome\nto bring equipment running your CIFS implementation so we can test\nagainst each other's implementations.\n\nWhy is Google helping ?\n\nGoogle holds events on behalf of Open Source projects like Ubuntu,\nand has generously donated the use of facilities within their Mountain\nView Campus for this event.\n\nIs it free ?\n\nYes, although you will of course have to fund any travel and\naccommodation expenses yourself.\n\nWhat about a T-shirt ?\n\nCurrently we don't have a logo for this event, but the organizers are\ninvestigating making a T-shirt available for the participants.\n\nDo I get free food ?\n\nYes, this is a chance to try out the famous Google cuisine :-).\n\n"}