{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "60 Minutes Newsletter <newsletter_sixty_minutes-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "60 Minutes E-mail Alert", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nThe abuse of Iraqi prisoners \n      at Abu Ghraib, a story broken on 60 Minutes II a few \n      years ago, raised questions about the interrogation and treatment of \n      detainees in Iraq and \n      stained the image of the U.S. around the world. In \n      our first story, you will see how it has also changed the life of the man \n      who brought those infamous pictures to the authorities. CNN's \n      Anderson Cooper interviews Joe Darby, the former military policeman \n      who turned those pictures in, but who is paying a high price for it. No \n      longer able to return to his hometown because of threats – some of the \n      soldiers he turned in lived there, too – he now lives with his wife at an \n      undisclosed location. \"I worry about the one guy who wants to get \n      even with me, and that one guy could hurt me and my family,\" says Darby, \n      who would do it again because, he tells Cooper, the abusers committed a \n      crime. (OAD: Dec. 10, \n      2006)\n \nWatch an \n      excerpt.\n\n \nWe'll also look this week at a \n      new kind of American family. They're half-siblings conceived by the same \n      anonymous sperm donor, and they are connecting with each other on the \n      Internet. Correspondent Steve \n      Kroft meets two families that discovered they used sperm \n      from the same donor. They've begun to raise their respective children as \n      siblings.Their mothers talk frequently on the phone and they get together \n      every few weeks. One of the mothers, Robin Anderson, tells Kroft about the \n      children, \"They don't have the donor, the father; they have each other... \n      We're a great family match.\" Steve's story takes a surprising turn when he \n      sets out to find the donor. (OAD: March 19, \n      2006)\n \nWatch\nKroft's \n      reporter's notebook.\n\n \nOur third story involves those \n      bound by an experience that killed millions: Holocaust survivors.  Correspondent Scott Pelley talks \n      to three concentration camp survivors who touch and read their own \n      documents for the first time at the secret archive containing the records \n      of 17.5 million victims of Hitler's Reich. Kept in the German city of \n      Bad \n      Arolsen on 16 miles of shelving, the archive not \n      only serves as a powerful reminder of the horror we can never forget, it \n      offers a challenge to the naysayer. \"Those people who said the Holocaust \n      didn’t happen, like the president of Iran, if they have any questions \n      about it, please come to Bad Arolsen and check it out for themselves,\" \n      says one of the survivors, Miki Schwartz. (OAD: Dec. 17, \n      2006)\n \nWatch an \n      excerpt.\n\n\n \nThese stories and Andy Rooney \n      on a car quest, this Sunday, June 24, on 60 Minutes at 7 p.m. \n      ET/PT.\n \nFor an early look at this \n      week’s stories, please click \n      here.\n\n \n \n \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n \n"}