{"category": "ham", "to_address": "\"Prof Brian Ripley\" <ripley@stats.ox.ac.uk>", "from_address": "\"hadley wickham\" <h.wickham@gmail.com>", "subject": "Re: [R] possible bug in ggplot2 v0.5.2???", "body": "On 7/4/07, Prof Brian Ripley  wrote:\n> On Tue, 3 Jul 2007, hadley wickham wrote:\n>\n> > Hi Stephane,\n> >\n> > The problem is that the windows graphics device doesn't support\n> > transparent colours.  You can get around this in two ways:\n>\n> It certainly does!  Try col=\"transparent\" (and perhaps consult your\n> dictionary).  It was news to me that the windows() graphics device worked\n> on\n> Linux i586.\n\nWell my dictionary defines transparent as \"allowing light to pass\nthrough so that objects behind can be distinctly seen\" which I believe\napplies here (ie. stained glass windows and blue points with alpha 0.5\nare both transparent).  What does your dictionary say?\n\n> What it does not support as yet is translucent colours, and that is a\n> restriction imposed by Windows (translucency support was introduced for\n> Windows XP, and we still try to support older versions of Windows, unlike\n> the MacOS people).  I have been working on a workaround, so translucency\n> support is likely to be implemented in R 2.6.0 for users of XP or later.\n\nI am confused by your implication that windows (prior to XP) does not\nsupport translucency.  Perhaps it is not supported at the operating\nsystem level, but it has certainly been available at the application\nlevel for a very long time.\n\n> Given that neither of the two main screen devices and neither of the\n> standard print devices support translucency, the subject line looks\n> correct to me: the problem surely lies in the assumptions made in ggplot2.\n\nThe features of the windows and X11 devices clearly lag behind the\nquartz and pdf devices.  I can program for the lowest common\ndenominator or I can use modern features that support the tasks I am\nworking on.  I choose the later, and it is certainly your prerogative\nto declare that a bug in me.\n\nHadley\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}