{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Serious questions tonight about the safety of a popular diabetes drug. That's coming up on the CBS Evening News with Katie Couric.", "body": "\n\n\nCBSNews.com\n\n\n \n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\nQUOTE OF THE DAY\"I have such poor vision I can \n      date anybody.\" - Garry Shandling \n\nDID YOU KNOW?Australians consume 60% more coffee than \n      tea, a sixfold increase since 1940. \n\nTONIGHT ON THE CBS \n      EVENING NEWSHere is an early preview of what we \n      are planning for tonight's CBS EVENING NEWS from Anchor and Managing \n      Editor, Katie Couric... Hi everyone, A \n      prescription drug that's been taken by more than 6 million people has been \n      linked to a significantly higher risk of heart attack - and even death. \n      Wyatt Andrews will report on Avandia, and our medical correspondent \n      Dr. Jon LaPook will explain what this news means to families who \n      deal with type 2 diabetes. In other medical news, a new pill is \n      promising birth control with a boost. It could be relief for women from \n      the pains and inconveniences of their menstrual cycles. It is due to debut \n      tomorrow but, as Michelle Miller will report, its long-term safety \n      isn't clear. Gas prices have broken the record for high prices set \n      during the energy crisis of the early 1980s - when they are adjusted for \n      inflation - until now. Anthony Mason will report on how tight \n      refinery capacity is the latest cause of high prices at the pump, and \n      Byron Pitts will have the story of how gasoline costs are affecting \n      consumers. Tension in the Middle East can be another factor in \n      high gas prices and over the past two days violent urban warfare has \n      erupted in Lebanon. Intense fighting between Lebanese troops and Islamic \n      militants suspected of having ties to al Qaeda has killed dozens of \n      people. Mark Phillips will have the story. Some great \n      citizens of the country are being lauded for their valor in the wake of \n      Hurricane Katrina. Today one relatively unknown name is being added to the \n      list of John F. Kennedy \"Profile in Courage Award\" recipients, which \n      includes the likes of Kofi Annan and Gerald Ford. Her name is Doris \n      Voitier. Haven't heard of her? Correspondent Kelly Cobiella will \n      introduce you to this special woman tonight. I hope you'll \n      join us. Katie For more information on these \n      stories, please click on the following links: Diabetes Drug \n      Tied To Heart Risk In Study Click Here Lebanon's Fight With \n      Militants Heats Up Click Here And here's a look at \n      one of the stories we're working on for Tuesday's broadcast:\nThe City of Brotherly Love... We'll take you there when we \n      broadcast live from Philadelphia, Tuesday, on the CBS Evening \n      News. If you would like more \n      information on the broadcast, please click on the following address and \n      e-mail us: evening@cbsnews.com \n\nTONIGHT ON DAVID \n      LETTERMANDave sits down with Republican Presidential \n      Candidate Rudolph Giuliani AND the inventor of the \"Cra-Z-Boy Jet \n      Recliner\" Mike West. Plus, musical guests Jesus & Mary Chain! \n\nTUESDAY\nMORNING ON THE EARLY SHOWHarry \n      Smith, Hannah Storm, Julie Chen, and Russ \n      Mitchell anchor THE EARLY SHOW from New York. Dave \n      Price will bring us the weather. Along with the top news of \n      the day, we will also have the following stories: HAPPILY \n      EVER AFTER, PART 2: Remember your childhood crush, the schoolmate you \n      thought you'd marry someday? Chances are you've lost touch ages ago. Not \n      so for Darwin Hobbs... Tuesday morning we continue our week-long look at \n      true-life romantic couples in our series Happily Ever After. Darwin \n      of Grayson, Georgia, was so sure he'd marry his ten-year-old friend Traci \n      McCloud, he made sure everyone at school knew it. Nearly thirty years \n      later, they are together, living Happily Ever After. Through \n      hardships and struggles, they have stayed best friends. We'll hear their \n      story of love Tuesday morning. THE REAGAN DIARIES: The late \n      President Ronald Reagan was known as the great communicator. And now we \n      get to see why... On Monday, visitors to the Reagan Library lined up to be \n      the first to buy a new book made up of personal entries he kept almost \n      every day during his eight years in office. It is a very revealing account \n      of his presidency and his relationships with wife Nancy, his kids and the \n      American people.The book is called The Reagan Diaries and Spielas \n      Brinkley, CBS News Historian, is the book's editor. He will join us \n      from the Reagan Library in Simi Valley, California. TOM SELLECK \n      ON JESSE STONE: SEA CHANGE: Actor Tom Selleck is a man who needs no \n      introduction - except to say that the fourth installment of his popular \n      television movie series Jesse Stone, airs Tuesday on CBS. In \n      Jesse Stone: Sea Change, the popular small town police chief, tired \n      of writing tickets and still longing for his ex-wife and a bottle of \n      scotch, reopens a twelve year old cold case...hoping to give the unsolved \n      murder investigation, and even more so his life, a jump start. Tom Selleck \n      will join us Tuesday morning. KEOGHAN'S HEROES: The \n      Amazing Race may be taking the summer off, but host Phil Keoghan is \n      not. He is on assignment for THE EARLY SHOW, flying about \n      the country in a small plane, looking for great characters with \n      interesting stories. The first episode takes Phil to the Big Island of \n      Hawaii, where he met the heroes of hula. We'll have the story Tuesday \n      morning. SIMPLE SOLUTIONS: BOATING SAFETY: This is national \n      safe boating week--and this holiday weekend, more people than ever will be \n      hitting the water. But every year, boating accidents injure and kill \n      thousands of people. So how do you stay safe on the water? EARLY \n      SHOW Consumer Correspondent Susan Koeppen will join us from \n      Chelsea Piers in New York to talk about how to make boating both fun and \n      safe this summer. If you would like more information on any of \n      these stories or the broadcast, please click on the following address and \n      e-mail us: earlyshow@cbs.com \n      \n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}