{"category": "spam", "to_address": "smiles@flax9.uwaterloo.ca", "from_address": "Jerry Armstrong <mglonline001@sify.com>", "subject": "Employment Offer", "body": "Hello,\nMy name is Jerry Armstrong, The Ceo MICROLINKS FABRIC AND TEXTILES UK \ncompany.We supply Fabrics & textiles worldwide .We have reached big \nsales volume in the Europe and now are trying to penetrate the US\nmarket.Quite soon we will open representative offices or authorized \nsales \ncenters in the US and therefore we are currently looking for people who \nwill assist us in establishing a new distribution network there. The \nfact isthat despite the US market is new for us we already have regular\nclients.\nWHAT YOU NEED TO DO FOR US?\nThe international money transfer tax for legal entities (companies) in\nUK is 25%, whereas for the individual it is only 7%.There is no sense\nfor us to work this way, while tax for international money transfer\nmade by a private individual is 7% .That's why we need you! We need \nagents to receive payment for our tools in money orders,cheque or bank \nwire\ntransfers) and to resend the money to us via Money Gram or Western\nUnion Money Transfer.This way we will save money because of tax ccc\ndecreasing.\nJOB DESCRIPTION?\n1. Recieve payment from Clients\n2. Cash Payments at your Bank\n3. Deduct 10% which will be your percentage/pay on Payment processed.\n4. Forward balance after deduction of percentage/pay to any of the\noffices you will be contacted to send payment to(Payment is to\nforwarded either by Money Gram or Western Union Money Transfer).\nHOW MUCH WILL YOU EARN?\n10% from each operation! For instance: you receive 7000 USD via cheques\nor money orders on our behalf. You will cash the money and keep $700\n(10% from $7000) for yourself! At the beginning your commission will\nequal 10%,though later it will increase up to 12%!\nADVANTAGES\nYou do not have to go out as you will work as an independent contractor\nright from your home office. Your job is absolutely legal. You can earn\nup to $3000-4000 monthly depending on time you will spend for this job.\nYou do not need any capital to start.You can do the Work easily without\nleaving or affecting your present Job.The employees who make efforts\nand work hard have a strong possibility to become managers. Anyway our\nemployees never leave us.\nMAIN REQUIREMENTS\n18 years or older legally capable responsible ready to work 2-4 hours \nper week with PC knowledge e-mail and internet experience (minimal)and \nplease \nknow that Everything is absolutely legal.\nIf you are interested in our offer, please reply with your,\nNAME\nADDRESS\nCITY\nSTATE\nZIPCODE\nTELEPHONE NUMBERS\nAGE\nOCCUPATION\nMARITAL STATUS\nNAME OF BANK\nto microlinksfab@yahoo.de,\nThanks for your anticipated action.And we hope to hear back from you.\nRegards,\nJerry Armstrong.\nCEO MICROLINKS INC.\n14, Bell Lane London, E1 7LA.\nUnited Kingdom\n+44-701-114-0119\nmicrolinksfab@yahoo.de\n\n\n"}