{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\nPerformance \n\t\t\tBenchmarking For Energy Utilities\nSeattle, WA\n            May 23-24, 2007\n\nPandemic \n\t\t\tPreparedness For Utilities\nSeattle, WA\n            May 23-24, 2007\n\n\nCapacity \n\t\t\tMarkets\n\n\t\t\tWashington, DC\n\nJune \n4-6, 2007\n\nCoal-to-Liquids \n\t\t\tFinance and Development Summit\n\n\t\t\tNew York, NY\n\nJune \n4-6, 2007\n\n\nStrategies for \n\t\t\tBidding Ancillary Services in LMP Markets\n\nIndianapolis, IN\n\nJune 6-7, 2007\n\n\nIntro to Electric \n\t\t\tUtility Systems for Non Engineers\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nDistributed \n\t\t\tEnergy Resources-Emerging Business Models for Utilities\n\n\t\t\tAustin, \n\t\t\tTX\n\nJune 14-15, 2007\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for May 25, 2007  \n\n\n\nFirst Enercast Featured Articles for May 25, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 25, 2007 PowerMarketers Industry Publications\n\n\n\nGetting to the Mark: A Changing Industry With Changing Technology (UtiliPoint.com - May 24, 2007)\n\n\n\nUtiliPoint.com - May 24, 2007 - UtiliPoint International, an Official Media Partner of the CIS Week Conference, is pleased to take special note of the name change of the annual CIS Week Conference to CS Week.\n\n\nMay 25, 2007 PowerMarketers Industry Publications\n\n\n\nTHIS WEEK AT EIA (Volume 9, Issue 21) (May 18 - May 24, 2007)\n\n\n\nEIA - May 25, 2007 - THIS WEEK AT EIA is a list summarizing and providing URLs for every Energy Information Administration (EIA) product released during this week.\n\n\nMay 25, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 25, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 25, 2007\n\n\nMay 25, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nUtility scam strikes Danville: Officials say criminals are posing as city workers to gain access to homes.\n\n\n\nMay 24--DANVILLE -- Homeowners beware.  Thieves posing as utility workers are targeting residents across Danville and the surrounding area, said Joe King, assistant city manager for utilities. King said people claiming to be working on the behalf of Danville Utilities are knocking on doors and telling people that their utility or energy consumption is running unusually high.\n\n\nMay 24, 2007 Knight Ridder Tribune Business News\n\n\n\nTVA taps executive to head conservation effort\n\n\n\nMay 24--A generation after the Tennessee Valley Authority pioneered some of the nation's first utility-backed conservation programs, the agency again is looking at ways to limit the electricity it sells, at least during peak periods.  TVA has tapped one of its top leaders, Executive Vice President Kate Jackson, to serve in a new post to help improve the agency's energy conservation and use of ...\n\n\nMay 24, 2007 Knight Ridder Tribune Business News\n\n\n\nUtility faces record $2M fine over record-keeping violations\n\n\n\nMay 24--Puget Sound Energy faces a $2 million proposed fine for the actions of a contractor that allegedly falsified records of gas-line leak inspections.  The fine is sought by the staff of the Washington Utilities and Transportation Commission, which identified 209 alleged violations of Puget Sound Energy record-keeping rules between 2002 and 2005. Puget Sound Energy (PSE) is the state's ...\n\n\nMay 24, 2007 Knight Ridder Tribune Business News\n\n\n\nOrmat signs 20-year Nevada Power contract: This is the company's 13th contract with Sierra Pacific Resources.\n\n\n\nMay 24--Ormat Industries Ltd. (TASE: ORMT) subsidiary Ormat Technologies Inc. (NYSE: ORA) has signed a 20-year Power Purchase Agreement (PPA) with Sierra Pacific Resources Inc. NYSE:SRP) subsidiary Nevada Power Company for the sale of energy produced from the Grass Valley Geothermal Power Plant to be built in Lander County in northern Nevada. The PPA is subject to the approval of the Public ...\n\n\nMay 24, 2007 Knight Ridder Tribune Business News\n\n\n\nGovernor signs renewable energy bill\n\n\n\nMay 24--CEDAR FALLS -- Gov. Chet Culver on Wednesday marked his signing the Iowa Power Fund appropriations bill into law in separate media events at the University of Northern Iowa and Iowa State University.  Culver made renewable energy a top priority during his campaign, and has repeatedly said he intends to make Iowa the renewable energy capital of the world with the initiative.\n\n\nMay 24, 2007 Knight Ridder Tribune Business News\n\n\n\nPower supply for summer plentiful, utility officials say\n\n\n\nMay 25--Electricity shortages are unlikely for San Diego Gas & Electric customers this summer, the state power grid operator and the utility said yesterday.  Jim Detmers, vice president of the California Independent System Operator, said regional electric generation resources will be about 20 percent above expected demand, a level he characterized as \"good.\" It's also well above reserve margins ...\n\n\nMay 25, 2007 Knight Ridder Tribune Business News\n\n\n\nArgos acquires 2nd Roanoke utility company: The corporation said the management and organization of CEI Inc. will remain intact.\n\n\n\nMay 24--A corporation that formed last year with an eye to capitalizing on expected growth in utility-line construction in the Northeast has acquired its second company, Roanoke-based CEI Inc., with about 150 employees.  Argos Utilities Corp.'s first acquisition, in August 2006, also was a Roanoke company, Richardson-Wayland Electrical Co. CEI, known as Contracting Enterprises Inc., has a long ...\n\n\nMay 24, 2007 Knight Ridder Tribune Business News\n\n\n\nValero gets tax abatement deal\n\n\n\nMay 24--PORT ARTHUR -- Valero Energy Corp.'s proposed refinery expansion project won support Wednesday from Port of Port Arthur commissioners, who approved a 100 percent tax abatement agreement.  The nine-year agreement will give Valero a break as long as the company meets specified requirements such as making an effort to hire local labor and minority and subcontractors for the project.\n\n\nMay 24, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nNPPD studies more wind power\n\n\n\nThe Nebraska Public Power District is investigating the possibility of more than doubling its wind energy generation. Ron Asche, NPPD chief executive officer, said Wednesday that the utility would consider adding 100 megawatts in wind energy through a partnership with one or more private developers. After that, it would consider incrementally adding to its wind portfolio.\n\n\nMay 24, 2007 Omaha World-Herald\n\n\n\nGE unit to invest millions in Canadian hydroelectric plant\n\n\n\nFAIRFIELD, Conn. -- A Canadian affiliate of GE Energy Financial Services will invest millions of dollars in a hydroelectric project in British Columbia developed by Plutonic Power Corp., the companies announced Thursday. The affiliate will invest up to 112 million Canadian dollars (about $103.6 million U.S.) in equity investment and 400 million Canadian dollars (about $370 million U.S.) in debt ...\n\n\nMay 24, 2007 Hartford Courant\n\n\n\nTVA restarts nuclear reactor in Alabama\n\n\n\nBIRMINGHAM, Ala.  The Tennessee Valley Authority restarted the third and final reactor at its Browns Ferry Nuclear Plant early Tuesday, ending a 22-year shutdown prompted by safety concerns at what was once America's largest nuclear plant. TVA, the nation's largest public utility, said the restart capped an exhaustive program that brought the reactor up to modern standards.\n\n\nMay 24, 2007 Tennessean\n\n\n\nCalif takes another step in fight against global warming\n\n\n\n(05-24) 06:38 PDT Los Angeles (AP) -- California, with the strictest pollution laws in the nation, has taken another step in reducing its contribution to global warning. The California Energy Commission on Wednesday imposed new rules that forbid municipal utilities, including the Los Angeles Department of Water and Power, from signing new contracts with coal-fired power plants unless those plants ...\n\n\nMay 24, 2007 San Francisco Chronicle\n\n\n\nLeak forces shut down of newly restarted reactor at Browns Ferry\n\n\n\nBIRMINGHAM, Ala. (AP) - Operators shut down a newly restarted reactor at the Browns Ferry Nuclear Plant early today after a leaky pipe burst, spilling about 600 gallons of non-radioactive fluid inside a building housing generating turbines. The accident - which occurred just two days after the restart of the long-dormant Unit 1 reactor at Browns Ferry near Athens - did not pose a public safety ...\n\n\nMay 24, 2007 Tennessean\n\n\n\n\n\nEnerNOC Expands Clean Gen Demand Reduction Program with San Diego Gas & Electric\n\n\n\nSAN FRANCISCO--(BUSINESS WIRE)--EnerNOC, Inc. (NASDAQ: ENOC), a leading developer and provider of clean and intelligent power solutions, announced today that the company expanded its Clean Gen demand reduction program with San Diego Gas & Electric (SDG&E) from 25 MW to 50 MW. SDG&E filed the new agreement with the California Public Utilities Commission (CPUC) earlier this month.\n\n\nMay 24, 2007 Business Wire\n\n\n\nAmerican Stock Exchange Lists Morgan Stanley's 8% SPARQS Linked To Valero Energy Corporation\n\n\n\nThe American Stock Exchange(R) (Amex(R)) today began trading Morgan Stanley's 8% SPARQS Linked to Valero Energy Corporation. Priced at $18.6275 per unit with an initial offer size of 1,186,420 shares, this equity trades under the ticker symbol SVL and has a maturity date of June 20, 2008. The notes are issued by Morgan Stanley. The Amex specialist unit is AIM Securities.\n\n\nMay 24, 2007 PR Newswire\n\n\n\nOglethorpe Power Names Messersmith As Senior VP\n\n\n\nOglethorpe Power Corporation has named James A. (Jim) Messersmith as senior vice president, plant operations. He formerly served as vice president, plant operations. Messersmith is responsible for overseeing the management of all generating plants that Oglethorpe Power operates. Messersmith began work at Oglethorpe Power in 1991 as the assistant plant manager at the Rocky Mountain Hydroelectric ...\n\n\nMay 24, 2007 PR Newswire\n\n\n\nCon Edison Urges Customers to Sign Up for e*bill and Help Plant Trees\n\n\n\nAs New Yorkers continue to opt for  As New Yorkers continue to opt for environmentally friendly ways to live, Con Edison (NYSE: ED) is promoting a new incentive for customers to pay their utility bills online without the wasteful use of paper.  For every customer who enrolls Con Edison's e*bill program, the company will donate $1 to help plant trees in New York City and Westchester County.\n\n\nMay 24, 2007 Internet Wire\n\n\n\nPower Generators Volunteer Over 2,900 MW of New Generation to Tennessee Electrical Power Grid\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). Planned new generation in Tennessee accounts for only 8% of the planned 36,000 MW of new generation planned in the U.S. Southeast market region, which consists of Alabama, Florida, Georgia, Mississippi and Tennessee. For details, view the entire article at www.industrialinfo.com.\n\n\nMay 25, 2007 Internet Wire\n\n\n\nCOO Zibelman Leaving PJM for New Position\n\n\n\nAudrey A. Zibelman, executive vice president and chief operating officer, has announced she will be leaving PJM Interconnection to become president and CEO of Nodal Exchange, LLC, a new organization designed to establish a variety of forward, financial products for the power markets. 'Audrey has been instrumental in guiding PJM through a period of rapid change,' noted PJM President and CEO ...\n\n\nMay 24, 2007 PR Newswire\n\n\n\n\n\nCool summer news: Blackouts unlikely\n\n\n\nTwo controllers confer at the California Independent System Operator's offices in Folsom. The power authority keeps a sharp eye on the state's energy grid, adjusting the flow of electricity in real time. (D. Ross Cameron - Staff) BAY AREA RESIDENTS who sweated through last summer's scorching temperatures may have one consolation this year: experts say the likelihood of power outages is slim.\n\n\nMay 24, 2007 San Mateo County Times\n\n\n\nNew Texas laws would change relationship producers, pipes\n\n\n\nTwo bills recently passed in the Texas Legislature would change the relationship between natural gas producers and intrastate gas pipeline operators in the state if they become law. Both legislative houses have approved House Bill 1920 and House Bill 3273, both of which await Governor Rick Perry's signature. Krista Moody, Perry's spokeswoman, declined to say whether the governor planned to sign ...\n\n\nMay 24, 2007 Platts\n\n\n\nCalifornia lawmakers urge PUC to scrap review of direct access\n\n\n\nSan Francisco (Platts)--24May2007 A number of key California state lawmakers are urging the Public Utilities Commission to scrap plans to review whether it can and should again allow retail customers to buy electricity from providers other than their local utilities. In a Wednesday letter to PUC Chairman Michael Peevey the lawmakers said a decision about whether to reinstate customer choice, or ...\n\n\nMay 24, 2007 Platts\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nEnding India's energy drought\n\n\n\nIn most Indian cities, being middle class means owning your own power company. As summer temperatures approach 40 degrees Celsius (104 Fahrenheit), energy demand from electric fans and air conditioners is putting stretched utilities under stress. Against a peak demand of 104,000 megawatts last month, supply was 90,000 megawatts. That is a shortfall of 14 percent.\n\n\nMay 24, 2007 International Herald Tribune\n\n\n\nGuangdong Nuclear agrees to build Anhui plant\n\n\n\nBEIJING: China Guangdong Nuclear Power and its partners, including Shanghai-listed Shenergy, agreed to build a nuclear power plant in the central province of Anhui to cater to rising energy demand. Guangdong Nuclear, Shenergy, Shanghai Electric Power and Anhui Province Energy Group signed an agreement on May 20 to jointly invest in the first phase of the nuclear plant, Guangdong Nuclear said in a ...\n\n\nMay 24, 2007 International Herald Tribune\n\n\n\nIndia's Nuclear Industry Generates Heat From Uranium Reserves to Fuel Recycling\n\n\n\nResearched by Industrial Info  Researched by Industrial Info Resources (Sugar Land, Texas). India is moving \"very aggressively on uranium\" Anil Kakodkar, the country's Atomic Energy Commission secretary, said. New reserves are being looked at with the target of doubling total reserves over the next five years. For details, view the entire article by subscribing to Industrial Info's Premium ...\n\n\nMay 24, 2007 Internet Wire\n\n\n\nUranium Rich in Peru\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). Peru, the world's second-largest producer of silver and the sixth-largest producer of gold and copper, is also a uranium rich Latin American country which has attracted several multinational mining firms to explore one of the world's most important energy minerals frequently used in nuclear power ...\n\n\nMay 25, 2007 Internet Wire\n\n\n\nIran makes steep nuclear gains, U.N. says\n\n\n\nFrom the Los Angeles Times IAEA reports it is less able to monitor Tehran. U.S. begins naval exercises in the Persian Gulf. By Bob Drogin VIENNA  Defying the international community, Iran has sharply upgraded its capacity to enrich uranium in recent months while the outside world's access to and grasp of Tehran's nuclear program 'has deteriorated,' according to an unusually blunt report Wednesday ...\n\n\nMay 24, 2007 Newsday\n\n\n\nBSM Continues Successful Development and Growing Credibility in the Oil and Gas Sector, Sales of Over $400,000 in Past Month\n\n\n\nBSM Technologies Inc, (TSX VENTURE: GPS) (http://www.bsmtechnologies.com) a leading provider of GPS-based AVL secure vehicle and trailer fleet tracking and management solutions today announced that during the last month, BSM Wireless has received orders in excess of $400,000 that includes hardware and services revenue for the duration of the contract.  BSM Technologies Inc, (TSX VENTURE: GPS) ...\n\n\nMay 24, 2007 Internet Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}