{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"Investor Alert\"<Lucy.Nunemaker@marketsforce.com>", "subject": "U.S.Starcom files provisional Patent", "body": "\n\n\nU.S.Starcom files provisional Patent\n\n\n\n\n\nU.S.Starcom files provisional Patent\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nU.S. STARCOM FILES  PROVISIONAL PATENT\nAllows Pre-Paid Calling Card Customers  And Providers \n\nTo Convert Minutes Into Other Content\n\n\n\n\n \n\n\n\n \n\n                          Perth Amboy,  New Jersey: U.S. Starcom (Pink Sheets: USTA) announced today that it has filed  a provisional patent with the U.S. Patent office for the convertibility of  telecom minutes used on pre-paid calling cards into debit values that could be  used to pay for other content, such as music downloads and ringtones.  The purpose of the patent is to significantly  increase the profit margins on calling card products. The patent will be aimed  at strengthening the business focus of U.S. Starcom, which aims to incorporate\nmoney, music,  media and minutes into products and services especially aimed at the Latino  marketplace.\n\n \n\n\n\n\n \nAbout U.S. Starcom\n\n                      The company is a leader in providing value added services to enhance  communications and entertainment. With a sales distribution network extending  to thousands of urban locations, U.S. Starcom continues its rapid expansion  into the distribution of alternative communication products and services,  including music, media, international long distance, prepaid services, wireless  dial around applications, stored value services, remittances, money debit  cards, and internet service enhancements. U.S. Starcom provides access to the  latest entertainment offerings from the recording industry through strategic  alliances and joint distribution campaigns. The company provides product  development, distribution, and system installation through its three independent  subsidiaries, Sky Distribution, U.S. Starcom Technologies and Mundetel, as well  as money remittances and telecom services through its Bell Latino subsidiary.\n\nSafe Harbor Statement\n\n                      This release contains statements that constitute forward-looking  statements within the meaning of Section 27A of the Securities Act of 1933, as  amended, and Section 21E the Securities Exchange Act of 1934, as amended. These  statements appear in a number of places in this release and include all  statements that are not statements of historical fact regarding the intent,  belief or current expectations of the Company, its directors or its officers.  Investors are cautioned that any such forward-looking statements are not  guarantees of future performance and involve risks and uncertainties, many of  which are beyond the Company's ability to control, and that actual results may  differ materially from those projected in the forward-looking statements as a  result of various factors.\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}