{"category": "spam", "to_address": "<the00@plg2.math.uwaterloo.ca>", "from_address": "\"Gertrude K. Russell\" <igzqe@mbox4.singnet.com.sg>", "subject": "microbiology", "body": "\n\n\n\n\n\n\n\nThe  increase in our personal expectations. Well, \nwho doesn't want to be a skilled artist, whether in  the director's chair, the \nboardroom, on the factory floor, or even just in  dealing with life's everyday \nsituations?\nIn other words, it's a  top-down \nculture.\nLearning To Think    Plato, Socrates  and Aristotle \ncame up with our current thought software 2,400 years ago. Non-hierarchical Our  \nsecond observation is that leadership is non-hierarchical. Should the next England \nManager be English? They developed their own practical behaviour changes as well,  \nrecognising that as organisational leaders their work patterns influenced the  \nentire organisation.\nAbout the authors Rob Goffee is a Professor of \nOrganisational Behaviour at London Business School. For me, this book had a  high \nenergy throughout and the ideas discussed were useful and engaging. This is not a \nstrong foundation for a culture though,  because success always lessens the urgency \nthat everybody brings to a  turnaround. Although it may seem obvious to state that \ndifferent circumstances will  require different approaches, it is something that is \nblatantly ignored in many  books. The  balance between our planned life and our \nunplanned life. Some fundamental principles of  leadership do apply across the \nboard. As Amazon state, this is indeed no  mere self-improvement book!\nThere  are parallels in organisational life. How do \nwe recognise imbalance in ourselves?\nFor example, a  chief executive will ideally \npossess a very broad range of knowledge and  experience. The starting point is about \nbeginning to  take control. What are you hungry for?\nIt is even more essential to recognise the  \nsituations where design is demanded because the routine approaches have failed. \nGoffee and Jones point out that  good leaders seem able to accurately assess a \nsituation and adjust their  approach and behaviour accordingly. coal  for power, \nsteel for use in ship building, agriculture for food etc. But the Welch Effect has \nfailed to appear.\nI wondered as I  approached the book if I would \nfind their self-reflection arrogant and without  real application, however that was \nnot the case at all. Without it there can be no significant investment of trust on \neither  side. You can come up with all these ideas by using just one  random word. \nIndeed,  it could be argued that the qualities which take you to the top of \nlarge-scale  and often highly political organisations are not obviously the ones \nassociated  with leadership. They  needed this to prove that the heretics were \nwrong. \"Hunger\" is a good thing: It means one is awake to the possibility of  \nsomething more than simply existing.\nClearly, smaller companies  have something that \nlarge ones almost inevitably lose, as history shows.\n"}