{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "(Ted Harding) <ted.harding@nessie.mcc.ac.uk>", "subject": "Re: [R] power 2x3 exact test", "body": "On 10-May-07 15:07:10, Thomas Lumley wrote:\n> On Thu, 10 May 2007, ted.harding@nessie.mcc.ac.uk wrote:\n>>\n>> Given that you expect some cells to be small, it should not\n>> be a severe task to draw up a list of (a1,b1) values which\n>> correspond to rejection of the null hypothesis (that both\n>> ORs equal 1), and then the simulation using different values\n>> of the two odds-ratios will give you the power for each such\n>> pair of odds-ratios.\n>>\n>> The main technical difficulty will be simulation of random\n>> tables, conditional on the marginals, with the probabilities\n>> as given above.\n>>\n>> I don't know of a good suggestion for this.\n> \n> r2dtable().\n\nThanks for pointing this out! (And if I had astutely done\nhelp.search(\"marginal\") I would have found it).\n\n> If this is a power calculation, though, you probably want to\n> fix only one margin, which is a much simpler problem,\n\nThat is probably a fair point (real-life situations where both\nmargins are objectively fixed are probably sparse, to the point\nwhere it may almost be worth collecting them as an \"exhibition\").\n\nBut then Bingshan Li is faced with the issue that the power\n(given the odds-ratio) is then dependent on one of the cell\nprobabilities as a \"nuisance parameter\". This of course can\nbe eliminated by conditioning on the total number of successes\nover the dimension whose marginals are fixed; but then we are\nin effect back to the Fisher Exact Test, whose power is a function\nof the odds-ratio alone.\n\nI'm still with Duncan Murdoch, in that what's meant by \"power\"\nin this case depends very much on what you mean by \"alternative\nhypothesis\".\n\nBest wishes to all,\nTed.\n\n--------------------------------------------------------------------\nE-Mail: (Ted Harding) \nFax-to-email: +44 (0)870 094 0861\nDate: 10-May-07                                       Time: 18:01:13\n------------------------------ XFMail ------------------------------\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}