{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: The Havana Club  ", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nThe \n      Public Eye Chat With...Portia SiegelbaumDoes the average \n      Cuban's view of America echo the view put forth in the state run \n      media? \"On the one hand, they basically believe what the Cuban media \n      says, in general. I've heard people say to me, \"well it was in Granma,\" \n      which is the Communist Party daily newspaper, and so it was true. Because \n      it tends not to lie outright on international news. What it more commits \n      is the sin of omission.\"[+ Read More]\n\nThe \n      Hunt for a Red NovemberAnybody who tuned into HBO on Sunday \n      expecting to see “The Sopranos” -- but got “Bury My Heart At Bended Knee” \n      instead -- might have gotten a glimpse of the future. Fred Thompson – the \n      cause celebre celeb of current GOP politics – appeared in the drama \n      as President Ulysses S. Grant. [+ Read More]\n\nDemocrats \n      Dismiss Fox News DebateAmerica’s media landscape is already \n      polarized enough. Partisans listen to their own radio shows, watch their \n      own media outlets and generally seek out information that reinforces their \n      political leanings. The Democratic presidential candidates are missing out \n      on an opportunity to get their message out, confront the channel they view \n      as a foe, and define themselves in their own words, rather than letting \n      themselves be defined by what they see as Fox's mischaracterizations. \n      [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nProducer Portia \n      Siegelbaum On What It's Like Reporting From Inside Cuba\n \nAnother Look \n      Inside Cuba\n \nAn \n      Island In \n      More \n      Ways Than \n      One\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}