{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Morning HTML\" <cbsnews_weekday_morning_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 9, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESWildfire Threatens L.A. Landmarks\nFire officials say they're making progress on a fierce blaze sweeping through Los Angeles' Griffith Park, forcing evacuations\n                        and scorching more than 4,000 acres. The chief hopes an aggressive morning attack will bring the flames under control. More...Watch: Wildfire Burns Hollywood Hills\n• Cheney In Iraq To Push Reconciliation\n                     \t\t\t\t\t| Watch• FBI: Army Base \"Dodged A Bullet\"\n                     \t\t\t\t\t| Watch• Afghan: 21 Civilians Killed In Air StrikeU.S.FBI: Army Base \"Dodged A Bullet\"\nSix foreign-born Muslims were arrested and accused of plotting to massacre scores of U.S. soldiers at Fort Dix in New Jersey.\n                        The plot was foiled in part because a store clerk alerted authorities to a video of the suspects firing assault weapons. More...Watch: Fort Dix Terror Plot Foiled\n• Wildfire Threatens L.A. Landmarks\n                     \t\t\t\t\t| Watch• Fresno State Shooting Suspect In Custody\n                     \t\t\t\t\t| Watch• Flood Fears Rise As Rain Pounds Midwest\n                     \t\t\t\t\t| Watch• More StoriesWorldCheney In Iraq To Push Reconciliation\nVice President Dick Cheney is paying a surprise visit to Iraq to press rival factions to overcome their differences and end\n                        sectarian violence, stressing military action is not enough. Also, a bomb in the Kurdish city of Irbil has killed 14 people. More...Watch: Cheney In Iraq, Blast In Irbil\n• Afghan: 21 Civilians Killed In Air Strike• 4 Arrested For 2005 U.K. Bombings• Clinton Group Makes Cheap AIDS Drug Deal• More StoriesPoliticsHouse Democrats Pitch New Iraq Plan\nHouse Democratic leaders are unveiling a new proposal that would fund the Iraq war through July, then give Congress the option\n                        of cutting off money if conditions don't get better. The White House dismissed the approach as \"just bad management.\" More...Watch: Rangel: Change Course In Iraq\n• GOP Starting Off Slow\n                     \t\t\t\t\t| Watch• Senate Panel OKs 40% Boost In Fuel Economy• Cheney In Iraq To Push Reconciliation\n                     \t\t\t\t\t| Watch• More StoriesHealthStudy: Baby Aspirin Best For Heart\nBaby aspirin may be the best dose for heart health, research reviewers report in The Journal of the American Medical Association. More...\n• Clinton Group Makes Cheap AIDS Drug Deal• 100% Juice May Not Boost Kids' Weight• Farmed Fish Fed Tainted Meal• More StoriesSciTechScientists Plan \"Encyclopedia Of Life\"\nThe world's scientists plan to compile everything they know about all of Earth's 1.8 million known species and put it all\n                        on one Web site that will be open to everyone. More...Watch: The Encyclopedia Of Life\n• Cutting Edge Kitchen, Bath Products• Senate Panel OKs 40% Boost In Fuel Economy• U.N.: Biofuels Could Devastate Environment• More StoriesBusinessFed Expected To Keep Interest Rates Static\nIt's been nearly a year since the Federal Reserve last changed interest rates and there are no expectations the central bank\n                        is going to make any changes soon. Chairman Ben Bernanke is expected to hold the federal funds rate at 5.25 percent. More...\n• Warner Music's Losses Widen• Auto Loan Rates Higher For Blacks• Gas Prices Keep Climbing\n                     \t\t\t\t\t| Watch• More StoriesEntertainmentBilly Ray Cyrus Booted From \"Dancing\"\nCountry star didn't seem at all surprised that he was voted off \"Dancing with the Stars\" Wednesday night. More...\n• \"Free Paris Hilton!\" Petition Begs\n                     \t\t\t\t\t| Watch• Brittany Murphy Ties The Knot• BuzzCuts: New Music\n                     \t\t\t\t\t| Watch• More StoriesOpinionElizabeth II And George II\nGuess who's coming to a state dinner? It wasn't special contributor Lloyd Garver, so he speculates on what he might\n                        have overheard had he been seated near America's favorite monarch. More...\n• Why '08 Will Belong To The Democrats\n                     \t\t\t\t\t| Watch• Buying Into The Macho Myth\n                     \t\t\t\t\t| Watch• Sarkozy Won't Be Bush's French Poodle\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Danny Lipford: Cutting Edge Kitchen, Bath Products\nEarly Show home improvement maven Danny Lipford spotlights some that caught his eye at a huge tradeshow.\n                        He also discusses the latest trends in those items -- think green, multi-functional, and high-tech. More...\n• EARLY SHOW: \"Mindfreak\" Star Spills Beans On 40 Tricks• EARLY SHOW: Meet The \"Jakes\"• CBS Evening News: Doctors Vs. Executions In North Carolina\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nHappy To Be Alive In KansasStories of heroism are emerging in Greensburg, Kan. as residents of the town return to see what is left of their lives. Hari\n                                    Sreenivasan met some of the survivors.\nTOP VIDEOS\nThe Encyclopedia Of Life\nFlood-Forecasting Technology \nPlotting To Catch Terrorists\nDeath Penalty Problem In N.C. \nBaghdad's Orphaned Children\nFuture Uncertain After Tornado\nQueen's U.S. Trip Winds Down\nN. Ireland Comes Together\nFeds Break Up Army Base Plot \n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesDoes fiery CNN anchor Lou Dobbs consider himself a journalist? Lesley Stahl finds out, Sunday, 7 p.m. ET/PT.48 Hours!\n  Mystery\nPower, Passion And Poison:An ambitious politician meets a suspicious death. Troy Roberts reports, Saturday at 10\n                           p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}