{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Spie Sutherland\" <spie@proficio.ca>", "subject": "Re: Software speech opinions", "body": "I used to have resources for some R&D and did many things. One was\nto get a \"special\" keyboard designed for people with limited motor skills,\nto find out what was so special about it, and why it was so damn\nexpesive. Granted it was more expensive than a normal keyboard, had\nproximity sensors and audible feedback, and somebody had to write\nsome custom firmware, but at $450 for a keyboard that was an\nastounding sum. If you look beyond stuff like just software, to the whole\nassistive tech market in general, you see inflated prices that as I said, I\nconsider to be obscene.\n\nSoftware can be free, yes, but that doesn't solve many other needs. Much\nwork needs to be done and it can't all be free, or the advancement is\nlimited. As long as assistive tech is considered to be something that is so\nradically different that the only answer is \"there are grants for that\" then\nchoices are limited and some of the much needed R&D doesn't get done.\nI personally believe most people are missing something important, that\nsome of these assistive tech ideas are ones that many people need. Take\nspeech tech for example, people can't look at a computer screen while\nthey are driving, and not really efficiently while walking. They do not\nneed to be disabled in any way to benefit from speech and many other\nassistive technologies.\n\nWork on all of these things are more globally desireable than one would\nthink if you break them down into parts. Take a keyboard for example,\nthere should be multiple modalities available as the input to anything and\nthe output from everything in the long term. I'm all for open source but\nthen to expect everything to be free means, at least to some degree, you\nget what you pay for. People will pay for good tech, if it's fair priced.\nAt least part of what is happening, the part I don't like, is that for some\nthings, they are intentionally so expensive that nobody can afford them\nwithout some subsidy, grant, insurance, or some other bueroctratic\nprocess. More comptetition would actually drive prices down. More\npeople making products would be a good thing. If all assistive tech\nwas done for free then it would only ever be hobby activity, it will\nnever put food on the table of people who produce it.\n\n  -- Spie\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}