{"category": "spam", "to_address": null, "from_address": "\"Mrs. sara berkley\" <berkley.sara@berkley.com>", "subject": "Let Me have Your Consent on Time", "body": "FROM:Mrs. sara berkley\nEMAIL:berkley.sara@gmail.com\nEmail:misslarisa@katamail.com\n\n\nBeloved ,\n\nI am writing to solicit your help in a business venture.\nMy name is Sara Berkley, Confidential Secretary/Personal Assistant to  the\narrested Former Liberian President, Charles Ghankon Taylor who was \narrested on Thursday 30th March 2006 after our planed escaped from\nCustody where we had been for the past three Years failed.\nI narrowly escape from being arrested at Gamboru Boarder town on our way \nto Cameroun, but my boss was arrested and immediately flown to Sierra \nleone were he is now facing a trial for alleged war crimes.\n\nWHY CONTACTING YOU\n\nAt the Moment, I am still in a town in Cameroun with  documents related to\na certain deposit equivalent\nof ( Seventy Five Million Dollars )that was deposited with a Financial\nInstitution Abroad since 4 years\nago.\nI need your assistances (to Execute this  transaction since time to attain\nmy own financial majesty for this\nopportunity MAY never come my way again) by standing to receive this \nmoney on my behalf from the Finance House/company for investment in  your\ncountry.\n\nIf you know you are not going to betray the trust I am about to repose in \nyou, please send to me without delay, your name and address, phone and \nfax, so that I will send to you the details of how to go about  claiming\nthe deposit for save keeping pending when I will come over to your country\nfor my share and Investment. For your anticipated\nAssistance, you will be offered 30% of the total sum.\n\nNO risk involve, because I am not a wanted person, and with look of \nthings, there is no way my boss could free himself from a ten count \ncharges pressed against him now.  So that gave me the much-needed time  to\ntransfer the (Deposit) funds out from the Finance House/company.\nAll that is needed of you is your unflinching support and transparent \nhonesty.\n\nYour earliest response is needed.\nAll communication should be my email for now for security reasons and\nmy email address is: berkley.sara@gmail.com    or misslarisa@katamail.com\n\nI await your quick response.\n\nThanks.\n\nMrs. Sara Berkley\n\n"}