{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Cheapflights Travel Deals <cheapflights@list.cheapflights.com>", "subject": "United, Northwest; $81 U.S. Airfares, More", "body": "\n\nUnited, Northwest; $81 U.S. Airfares, More\n\n\n\n\n\n\n\n\n\n\n\n\n\nJune 14, 2007\n\n\n\n\n\n\n\n\n\nFrom: \nTo: \n\n  \n\n\n\n\n\n\n\n\n\n\n\n \nIN THIS ISSUE: Summer Bargains: Flights Under $200; 12 Top City Vacations, More\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCheap Flights From Your Local AirportBest airfares from your hometownAustin, TX Baton Rouge, LA Chicago, IL Cincinnati, OH Cleveland, OH Columbus, OH Corpus Christi, TX Dallas/Ft. Worth, TX Detroit, MI El Paso, TX Fort Wayne, IN Houston, TX Indianapolis, IN Kansas City, MO Lexington, KY Lincoln, NE Louisville, KY Madison, WI Memphis, TN Milwaukee, WI Minneapolis, MN Nashville, TN New Orleans, LA Oklahoma City, OK Omaha, NE St. Louis, MO San Antonio, TX Toledo, OH Tulsa, OK Wichita, KS Click herefor more city airfare deals.\n\n\n\n\n\n\nfrom $119 RTKayak\n\nUnited Airlines: U.S. Summer Savings United Airlines Fare Bargains Your favorite destinations all over the country; includes taxes, fees.\n\n\n\n\n\n\n\n\nfrom $83 RTMajor U.S. Airlines\n\nU.S. Summer Airfare Bargains Flight Savings to Top Destinations Book now for savings \u0097 and seats; includes all taxes, fees.\n\n\n\n\n\n \n\nClick-and-Compare Fares\nFrom Cheapflights\n\nDestination Spotlights \nTop Picks: Popular City Destinations \nCompare the best airfare bargains to:\n\n\nChicago\nSan Francisco\nSan Diego\nFt. Lauderdale\n\nOrlando\nDallas \nLondon\nAtlanta \nHonolulu \nNYC\nL.A.\n\n\t    Cancun\n\n\n\n\n\n\n\n\n\nPriceline Airfare Deals of the Week \nPriceline Summer Airfares Low fares to top destinations. No booking fee on flights booked by July 4. \n\n\n\n\n\n\n\n\nfrom $81 RTCheapTickets\n\nAirlines Match Southwest's Low Fares \nU.S. Late Summer/Fall Airfare Savings \n  United and other airlines are matching Southwest's low fares on flights to popular destinations.\n\n\n\n\n\n\n\n\n\n  Las Vegas \u0097 City Spotlight The Best of Las Vegas: Summer '07 The secrets of getting comped\u0085 hot pool parties and cool spas\u0085 deals, discounts and freebies\u0085 and much more \n\n\n\n\n\n\n\n\nfrom $294 /personExpedia\n\nJuly 4th  Getaway Deals of the Week \n3-Night Air/Hotel Packages Top destinations: U.S., Caribbean and Europe. Travel July 4 to 8.\n\n\n\n\n\n\n\n\nfrom $119 RTKayak\n\nNorthwest Airlines \u0097 Unadvertised Sale Fares U.S. Airfare Savings \nHundreds of cities all over the U.S.; includes taxes, fees\n\n\n\n\n\n\n\n\nfrom $103 RTTravelocity\n\nU.S. Summer Airfares Under $200 Summer Flight Savings Our deal hunters found these low fares, which include taxes and fees.\n\n\n\n\n\n\n\n\nUniversal Orlando® Resort Limited Time Offer: Unlimited Admission to Two Parks for $85.99/person! Explore two amazing theme parks for an entire week for less than the price of a Disney® 1-day ticket (with Park Hopper Option).\n\n\n\n\nEurope and Latin America\n\n\n\n\n\nfrom $330 RTTravelocity\n\nEurope Airfare Savings: Last  Day\nLate Summer/Early Fall Flight Bargains Save on Northwest's new nonstop flights to Brussels or Düsseldorf; nationwide departures. Travel between Aug 27 or Sept 3 and Oct 31. Purchase by June 14.\n\n\n\n\n\n\n\n\nfrom $381 /personExpedia\n\nLatin America Deals of the Week 4-Night Latin America Air/Hotel Packages Mexico City, Cancun, Los Cabos, Mazatlan; San Jose (Costa Rica) and more\u0085\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Tell a friend   Change \nyour profile  |  Unsubscribe\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nTRAVEL NEWS\n\n\n\nIn the Headlines\u0085 From Cheapflights.com's daily travel news and other sources: \u0095 Government eases Mexico, Canada & Caribbean passport rules thru September \u0095 AirTran will allow low-fare flyers to reserve seats in advance for a fee \u0095 Delta Air Lines cuts Mexico airfares \u0095 jetBlue partners with Google for new in-flight tracking maps \u0095 United Airlines Mexico sale offers one-way fares from $117 \u0095 New York/JFK airport opens cell-phone parking lot \u0095 DOT Report: Flight delays the worst in 13 years The Lighter Side of Travel \u0095 Are You Suffering From 'Vacation Dysphoria'? \u0095 Pack Your Umbrella If You're Headed to the Wettest U.S. Cities \u0095 SkyMaul Catalog Pokes Fun at SkyMall In-Flight Catalog Trip Planning & Destinations \u0095 Fathers and Sons Bond, Share Fun in Special Getaways \u0095 Dr. Beach Picks 2007 Best Beaches \u0095 Don't Let Storms, Hurricanes Spoil Your Vacation \u0095 Bon Appetit Picks the Top Places to Eat \u0095 Beer Lovers Hit the Trail for Brewery Hopping \u0095 L.L. Bean to Build Maine Adventure Park \u0095 Big Names Headline at 'Ultimate' Sports Fantasy Camp \u0095 Marriott and Nickleodeon to Build Upscale Resorts\n\n\n\n\n\n\n \n\n\n\n\n\n \nGETAWAY CALENDAR\n\n\n\nAspen (CO), June 21\u009624: Janus Jazz Aspen Snowmass festival Buffalo (NY), June 15\u009616: The Buffalo River Fest includes a river regatta and a classic-car show. Crested Butte (CO), June 25\u009630: Fat Tire Bike Week Le Mans (France), June 16\u009617: Le Mans 24 Hour Car Race London (UK), June 16: The Trooping of the Colour celebrates the Queen's birthday. New York City, June 16: Speedboats and cruisers ply the Hudson in the Powerboat Poker Run. Coming Soon: Dallas (TX), July 13\u009615: Taste of Dallas Detroit (MI), July 4\u00968: Comerica CityFest Houston (TX), July 5\u00968: CaribFest Montreal (Canada), June 28\u0096July 8: Montreal Jazz Festival Newport (RI), June 28\u0096July 8: Sunset Music Festival San Francisco (CA), June 30\u0096July 1: Fillmore Jazz Festival Sarasota (FL), June 29\u0096July 1: Suncoast Offshore Super Boat Grand Prix\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \nWant the \nlatest airline and related news? Visit Cheapflights.com Flights News\n\nFind \nthe best airfare deals on Cheapflights.com\n\n\n\n\n\n  From: \nTo: \n\n\n\n\n\n\n\nFlights\n| \nPrivacy Policy | \nContact us\n\n\n\nWould \nyou like to Unsubscribe? \n\n\nTerms \nand Conditions:\n\nCheapflights.com does not sell tickets, but publishes deals and displays \ninformation only. Prices do not include taxes and other fees unless \nstated.   We list deals that are correct when \npublished, but cannot guarantee accuracy or completeness. \n\nThe information provided in this e-mail may include inaccuracies and \ntypographical errors. Terms and Conditions apply to the above deals and \nthese deals may expire or be subject to change. Cheapflights.com (USA) \nInc., its subsidiaries & affiliates are not liable for any claims of \ndamages, loss or injury to persons or property arising out of this \nnewsletter. For more details on a specific deal, check with the agent or \ncompany selling the tickets.\n\n* \nTaxes, fees, and restrictions apply\n\n\nFor written correspondence please contact Cheapflights (USA) Inc. at 24 School \nStreet, Boston 02108.\n\n\n\n\n\n"}