{"category": "ham", "to_address": "Francesco Poli <frx@firenze.linux.it>", "from_address": "Florian Weimer <fw@deneb.enyo.de>", "subject": "Re: Final text of GPL v3", "body": "* Francesco Poli:\n\n>>     b) Requiring preservation of specified reasonable legal notices or\n>>     author attributions in that material or in the Appropriate Legal\n>>     Notices displayed by works containing it; or\n>\n> I strongly *dislike* the entire concept of allowing a limited set of\n> additional requirements to be added.  It's *against* the spirit of the\n> GPLv2 (where the FSF promised that new versions would \"be similar in\n> spirit to the present version\", see GPLv2, section 9.) and greatly\n> weakens the copyleft.\n\nBut the section (b) you have been quoted just spells out what we have\nbeen assuming and practicing all the time: the MIT and 3-clause BSD\nlicenses, which require the preservation of legal notices and credits,\nare compatible with the GPL, even though they are technically further\nrestrictions.\n\n> Especially, clause 7b is a permission to add a possibly non-free\n> requirement.  Actually: what exactly is a \"reasonable legal notice\"?\n\nWell, we can decide this on a case-by-case basis.  We already have to,\nbecause licenses which require certain notices to be preserved are\nvery common.\n\n> What exactly is an \"author attribution\"?\n\nAuthor attribution is a well-known concept in droit d'auteur copyright\nsystems, and I think the U.S. code knows about it, too.\n\n> These terms are not defined anywhere in the license.  I'm concerned\n> that they could be interpreted in a broad sense and allow people to\n> take a GPLv3'd work and add some sort of invariant long text that\n> nobody will ever be able to remove or modify...  This option could\n> make a work include unmodifiable & unremovable parts and thus fail\n> to fully grant the freedom to modify.\n\nYeah, but this is nothing any license can guard against.  People might\njust make an illegal derivative even if this is forbidden by the\nlicense.  Either way, we are free to reject to distribute it.\n\nVersion 3 certainly implements a weaker copyleft than version 2\n(possibly with the exception of patents), but I don't think we should\nworry too much about that.  Debian is sort of agnostic when it comes\nto the question whether free software licenses should be copyleft or\nnot.\n\n>>   13. Use with the GNU Affero General Public License.\n\nMy concern is that the \"you may sell yourself into slavery\" clause\nearlier in the license will encourage people to adopt the AGPL.\nCertainly not a good development.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}