{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"Law Watch\" <mailings@mail.cnn.com>", "subject": "Law Watch: Legal News and Analysis from CNN.com", "body": "\n\n\n\n\nCNN.com - Law Watch\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTuesday, May 29, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n'Dr. Death' to leave prison\nDr. Jack Kevorkian, also known as Dr. Death, is to be released from prison on Friday. The man who once dropped off bodies at hospital emergency rooms and dared authorities to stop him now says he won't break any laws or counsel anyone about assisted suicide once he's out of prison. \nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNANCY GRACE Airs on Headline PRIME, 8 p.m. ET\n\"Nancy Grace\" is television's only justice-themed interview and debate show. Nancy Grace challenges guests\non the most controversial and high-profile legal issues of the day by drawing on her unique perspective\nas a former violent crimes prosecutor and as a crime victim herself.  Send your questions and comments.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFamed forensics expert takes a hit\nTwelve years ago, the O.J. Simspon trial made forensic scientist Henry Lee famous. Now, at the same Los Angeles courthouse, the Phil Spector trial could hurt his reputation.\nFULL STORY\n\n\n\n\n\n\nLethal injection takes 10 tries\nDeath penalty opponents called on the state to halt executions after prison staff struggled to find suitable veins on a condemned man's arm to deliver the lethal chemicals.\nFULL STORY\n\n\n\n\n\n\nFake firefighter guilty of sex attack\nThe case of a man who impersonated a firefighter to attack and sexually abuse a fashion writer in her home came down to whether a jury believed he was too mentally ill to be held responsible.\nFULL STORY\n\n\n\n\n\n\nJury: Family killed for inheritance\nShawn Bentler, who was unemployed, - trembled as he was found guilty of killing his parents and three teenage sisters in what prosecutors said was a plot to get hsi hands on an inheritance.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Law Watch email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}