{"category": "ham", "to_address": "beginners@perl.org", "from_address": "Rob Dixon <rob.dixon@350.com>", "subject": "Re: Array of Array refs", "body": "Brian wrote:\n>\n> Paul Lalli wrote:\n>>\n>> Brian wrote:\n>>>\n>>> my variable names end with A for array and H for hash,\n>>\n>> Pointless.  Variable names in Perl identify what kind of variable they\n>> are.  @ for arrays, % for hashes.  [ ] for accessing an element of a\n>> hash, { } for accessing element of a hash.\n> \n> no, I disagree. Changing @ to $ is confusing... besides that, my \n> naming is consistent, and helps me understand what I'm writing. I\n> think you missed it on that one... its a disservice to beginners to\n> say 'pointless' like that..\n> \n> ( I may not respond in such detail in the future.. Its just that I'm \n> new here, - I'm surprised by all of this intensity over something\n> pretty mundane.)\n\nI agree with you Brian. I have been posting on this list for around four\nyears, and rarely have I seen 'help' that is expressed with such vitriol\nas Paul's has been. When Casey West envisaged perl.beginners back in 2001\nhis intent was to avoid this very attitude of muscle-flexing. He writes:\n\n~ It seems that the very thing we want to have happen, adding number to our \n~ ranks, is the first thing we fight against when beginners show their \n~ faces. Wielding our swords of \"RTFM\" and shields of \"killfile\" we smite \n~ the very programmers that will carry this language into the future. I \n~ have a co-worker who is known for saying, \"It's a good thing Perl is so \n~ powerful and cool, it barely makes up for the collective, childish \n~ 'elitism' displayed by its community.\" Collectively, this is a sad truth.\n\nI hope you will persist in posting requests for, and perhaps offers of\nhelp. All group members are valuable and I look forward to your input.\n\nRob\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}