{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for May 8, 2007  \n\n\n\nFirst Enercast Featured Articles for May 8, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 8, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 8, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 8, 2007\n\n\nMay 8, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nDuke plan: Boost rates, save energy: Program would save enough electricity to equal new power plant\n\n\n\nMay 8--Duke Energy filed an ambitious energy conservation plan Monday to cut electricity demand, reduce greenhouse gases and still allow the Charlotte utility to turn a profit.  The plan represents a turnaround for the company and chief executive Jim Rogers, who only months ago relegated energy efficiency to a smaller role. Under the proposal, customers would pay extra on their monthly bill for ...\n\n\nMay 8, 2007 Knight Ridder Tribune Business News\n\n\n\nUtility wants more: 15.6% higher electric rates sought under best-case scenario\n\n\n\nMay 8--Customers of We Energies, whose bills have risen by one-third since 2001, would see another 15.6% increase by 2009 under a request filed with state regulators Monday.  The state's largest electric utility wants consecutive increases of 7.5% per year. Bills for the typical residential customer now paying $81.51 a month would rise by more than $6 in January 2008 and again by more than $6.50 ...\n\n\nMay 8, 2007 Knight Ridder Tribune Business News\n\n\n\nIncentives make the turbines go round\n\n\n\nMay 7--There has been plenty of buzz surrounding North Dakota's wind energy industry recently. This morning, the Public Service Commission is holding a public hearing at the Cavalier County Courthouse regarding a $225 million, 159-megawatt wind farm near Langdon, N.D. The PSC will discuss the siting of 106 wind turbines and associated facilities with local residents as plans for the project move ...\n\n\nMay 7, 2007 Knight Ridder Tribune Business News\n\n\n\nMG&E wants increase in gas, electric rates\n\n\n\nMay 8--Madison Gas and Electric Co. on Monday asked state regulators for permission to raise its electric rates 5.7% on Jan. 1.  Local natural gas charges would rise 3.7%, the utility said. The increase would cover the cost of wind-power projects, energy efficiency programs, transmission upgrades and costs linked to the planned shutdown of the company's coal-fired power plant in downtown Madison. ...\n\n\nMay 8, 2007 Knight Ridder Tribune Business News\n\n\n\n10 years on river watch: Catawba Riverkeepers celebrate protecting Catawba, prepare for future\n\n\n\nMay 8--LAKE WYLIE -- After a decade dedicated to protecting the Catawba River, the \"handful of dreamers\" who started it all are back at it again. The next goal: 10 years of more participation and more advocacy than the river has ever seen.  The Catawba Riverkeeper Foundation, a nonprofit organization founded in 1997, begins its yearlong celebration of 10 years fighting for water and water users ...\n\n\nMay 8, 2007 Knight Ridder Tribune Business News\n\n\n\nPSC order on Langdon-area wind farm could come within weeks\n\n\n\nMay 7--LANGDON, N.D. The North Dakota Public Service Commission could issue an order within two to three weeks to allow construction to begin on the proposed 106-turbine Langdon Wind Farm, L.L.C.  The new wind farm would increase North Dakota's present wind energy output by about 50 percent, to more than 450 megawatts. The PSC heard no opposition to the project during a three-plus-hour hearing ...\n\n\nMay 7, 2007 Knight Ridder Tribune Business News\n\n\n\nRally at Capitol to push for new electric rate freeze\n\n\n\nMay 8--SPRINGFIELD -- More than 600 people are expected to fill the State Capitol Rotunda on Wednesday in an effort to breathe life into a stalled proposal for freezing electric rates again.  Among the crowd will be a contingent of people from the Metro East who have paid higher electricity bills since a 10-year rate freeze ended Jan. 1. The group hopes to lobby the Illinois Senate to approve the ...\n\n\nMay 8, 2007 Knight Ridder Tribune Business News\n\n\n\nEthanol facility near Bluffs gets tax incentives\n\n\n\nMay 8--COUNCIL BLUFFS -- A large ethanol project south of Council Bluffs was given tax abatements Monday that could be worth about $12 million.  The Pottawattamie County Board voted 3-0 to provide the tax incentives for the project, located just south of the MidAmerican Energy plant along Interstate 29 in southern Pottawattamie County. The plant will cost between $185 million and $300 million.\n\n\nMay 8, 2007 Knight Ridder Tribune Business News\n\n\n\nWind vs. the winged: Are bird deaths from the Altamont windmills disrupting the ecosystem?\n\n\n\nMay 7--The Altamont windmills spin fast this time of year. So, too, spin the minds of scientists charged with weighing the pros and cons of wind energy.  A congressionally mandated study released last week says that as more states attempt to harness the wind, government should control more closely where windmills are allowed to sprout -- perhaps saving birds and bats from being chopped up by ...\n\n\nMay 7, 2007 Knight Ridder Tribune Business News\n\n\n\nFinally _ power to the people: Utility rethinks customer service after news report\n\n\n\nNEW YORK _ A Canadian power company that jolted several New York businesses with confusing energy contracts has made amends with several businesses following a New York Daily News report.  Based on promised savings, shopkeepers in Queens and Brooklyn switched to U.S. Energy Savings but said in February that their electric bills actually soared. When they complained, they claimed they got the ...\n\n\nMay 7, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nCMS Energy withdraws from Illinois power plant deal\n\n\n\nST. LOUIS -- CMS Energy Corp. has bowed out as a key partner with Peabody Energy in developing and running a planned $2.5-billion, coal-fired power plant in southern Illinois, saying it could not find enough customers to justify its investment. Jackson-based CMS Energy said in a Securities and Exchange Commission filing last week that it withdrew last month 'because, at this time, it does not ...\n\n\nMay 7, 2007 Detroit News\n\n\n\nWal-Mart Starts Solar Power Test Program\n\n\n\nthat it has launched a program to test the use of solar power at some of its operations in Hawaii and California. Wal-Mart is purchasing solar power equipment from BP Solar, SunEdison LLC, and PowerLight, a subsidiary of SunPower Corp. The equipment will be installed in California and Hawaii in 22 locations, including Wal-Mart stores, Sam's Club warehouse stores and a distribution center.\n\n\nMay 8, 2007 Newsday\n\n\n\n\n\nPuget Energy and Puget Sound Energy Realign Senior Officers to Broaden and Focus Management Team\n\n\n\nBELLEVUE, Wash.--(BUSINESS WIRE)--Puget Energy (NYSE:PSD) and its utility subsidiary, Puget Sound Energy (PSE), today announced the elections, effective immediately, of Eric M. Markell, 55, to executive vice president and chief financial officer, Bertrand A. Valdman, 44, to executive vice president and chief operating officer, and Kimberly J. Harris, 43, to executive vice president and chief ...\n\n\nMay 8, 2007 Business Wire\n\n\n\nVeraSun Holds Groundbreaking Ceremony for Iowa Fuel Ethanol Plant\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). The nation's second largest ethanol producer and publicly traded company, VeraSun Energy Corporation (NYSE:VSE), held a ceremonial groundbreaking event last Thursday, marking the construction start on yet another ethanol plant in the company's growing renewable fuel development portfolio.\n\n\nMay 8, 2007 Internet Wire\n\n\n\nOtter Tail Corporation Announces First Quarter Earnings; Maintains 2007 Earnings Guidance\n\n\n\nFERGUS FALLS, Minn., May 7 /PRNewswire-FirstCall/ -- Otter Tail Corporation (Nasdaq: OTTR) announced financial results for the quarter ended March 31, 2007 with the following highlights: -- Record first quarter revenues of $301 million. -- Consolidated net income from continuing operations of $10.4 million for the first quarter of 2007 compared with $14.9 million for the first quarter of 2006.\n\n\nMay 7, 2007 PR Newswire\n\n\n\nPolyMet Announces Retirement of Warren Hudelson Receives Approval for Long Term Power Contract\n\n\n\nPolyMet Mining Corp. (TSX: POM)(AMEX: PLM) (\"PolyMet\" or the \"Company\") announced today that Warren Hudelson, Executive Vice President of its wholly-owned U.S. subsidiary Poly Met Mining, Inc. has decided to retire from his position as Executive Vice President and Director of the US subsidiary, Poly Met Mining, Inc. but will continue as an advisor to the Company in connection with permitting of ...\n\n\nMay 7, 2007 Internet Wire\n\n\n\n\n\nCanada's largest solar farm to be built near Sarnia\n\n\n\nTORONTO -- A California company will build Canada's largest solar farm near Sarnia, Ontario, installing more than 1 million panels on the ground to generate 40 megawatts of power that it will sell to the provincial government. The Canadian Press has learned OptiSolar plans to have the clean electricity on the Ontario power grid by 2010. Hayward, Calif.-based OptiSolar will be paid $.38 cents per ...\n\n\nMay 8, 2007 US Water News\n\n\n\nMGE seeks higher electric, gas rates\n\n\n\nWhat I Do: Window washer Mad City Broadband is sold Smokey Bones on West Side closes Menards upgrades bypass Madison stores TUE., MAY 8, 2007 - 12:53 AM MGE seeks higher electric, gas rates JUDY NEWMAN 608-252-6156 jdnewman@madison.com Madison Gas & Electric wants to raise its rates in 2008.Less than two weeks after the state Public Service Commission approved an interim rate boost to cover high ...\n\n\nMay 8, 2007 Wisconsin State Journal\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nChief executive of National Grid wants utilities to sell less power\n\n\n\n- The chief executive of National Grid, the UK energy group, has called for a change in the way energy markets are regulated to encourage suppliers to sell less gas and electricity. In an interview with the Financial Times, Steve Holliday said efforts to cut carbon emissions through energy efficiency would fail without major regulatory incentives. 'Energy companies have clearly been motivated by ...\n\n\nMay 8, 2007 Power Engineering\n\n\n\nDabhol to start production by late June\n\n\n\nFront Page&gt; UPI Page advertisement NEW DELHI, May 8 (UPI) --  State-run Gas Authority of India Ltd. says its Dabhol power plant will start production and receive gas from late June. GAIL is building a gas pipeline from the port town of Dahej, Gujarat state, to Dabhol, Maharashtra state, to supply liquefied natural gas to the Dabhol power plant from Petronet LNG's plant in Gujarat.\n\n\nMay 8, 2007 Washington Times\n\n\n\nEU, U.S. work to improve wind forecasting\n\n\n\nFront Page&gt; UPI Page advertisement MILAN, Italy, May 8 (UPI) --  The key to improving wind power production forecasts is in understanding and predicting large changes in the system, several forecast company officials say. 'Event-based forecasting is one of the most promising approaches,' said John Zack, of AWS Truewind, LLC, Albany, N.Y. Hourly wind power production is predicted using regional ...\n\n\nMay 8, 2007 Washington Times\n\n\n\nOutgoing RWE chief hits out at regulators\n\n\n\n- Harry Roels, the outgoing chief executive of German utility RWE, has hit out at moves by Germany and the European Union that could prevent the development of a continent-wide energy market and dent profits. Mr Roels told the London Financial Times that threatened price controls by Berlin plus confusion over carbon dioxide emission cuts and break-up plans for utilities from Brussels meant that ...\n\n\nMay 8, 2007 Power Engineering\n\n\n\nItaly faces wind opposition\n\n\n\nMILAN, Italy, May 7 (UPI) --  While most members of the European Union have joined in the push for wind energy, some, like Italy, face resistance. Anti-wind groups are pushing for a moratorium on new wind-power projects, claiming the wind turbines negatively affect the landscape and surrounding wildlife. They also say developers take advantage of residents in small towns with bad deals, and they ...\n\n\nMay 7, 2007 Washington Times\n\n\n\nPacific East Advisors, Inc. Announces $17 Million Funding, Name Change to Pacific Asia Petroleum, Inc. and Merger With Inner Mongolia Production Company LLC and Advanced Drilling Services, LLC\n\n\n\nCUPERTINO, Calif., May 8 /PRNewswire-FirstCall/ -- Pacific East Advisors, Inc. ('PEA'), a Delaware company whose shares are publicly quoted for sale on the Pink Sheets under the symbol 'PCAD.PK', today announced that effective May 7, 2007, (i) Advanced Drilling Services, LLC ('ADS'), a Delaware limited liability company, merged with and into DrillCo Acquisition, LLC ('DrillCo Merger Sub'), a ...\n\n\nMay 8, 2007 PR Newswire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}