{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "350p 6/15 Update: Spacewalk underway; blanket repair goes smoothly", "body": "\n\n\n\n\n350p 6/15 Update: Spacewalk underway; blanket repair goes smoothly\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 62\nPosted: 3:46 PM, 6/15/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-57 (06/14/07): Shuttle astronauts gear up for more solar array retraction work\n   SR-58 (06/14/07): NASA spaceflight chief, former station astronaut optimistic Russians will resolve computer snafu\n   SR-59 (06/15/07): Mixed results in initial attempts to restart Russian computers\n   SR-60 (06/15/07): Russians shut down computers again for additional troubleshooting; no obvious 'smoking gun' in U.S. power\n   SR-61 (06/15/07: Astronauts gear up for spacewalk\n   SR-62 (06/15/07): Spacewalk begins; blanket repair work goes smoothly; computer restart attempt on tap\n\n=================================\n\n3:46 PM, 6/15/07, Update: Spacewalk underway; blanket repair work goes smoothly\n\nAstronaut Danny Olivas, anchored to the end of the shuttle Atlantis' robot arm, carried out orbital surgery on the ship's heat shield today, using a medical stapler and stainless steel pins in a bid to secure a peeled-back insulation blanket on one of the orbiter's aft rocket pods.\n\nFellow spacewalker Jim Reilly, meanwhile, worked at the Destiny laboratory module to replace a water valve with a hydrogen vent valve that will be needed later when a U.S. oxygen generation system begins operation.\n\nTwo hours into the spacewalk, flight controllers told Reilly they had decided to have him disconnect an electrical cable he hooked up Monday during a spacewalk to activate a new solar array on the right side of the station's main power truss. The astronauts also were warned that Russian flight controllers planned to make yet another attempt to restart the stalled computers. Earlier in the day, NASA officials said no more restart attempts would be made today, but the Russians apparently decided otherwise.\n\nRussian navigation system and command and control computers, which are tied into the solar array electrical circuits, began malfunctioning shortly after the cable in question was connected. The cable is not currently in use and is intended to route power from a yet-to-be-launched set of arrays, known as S6, through the newly installed S3/S4 truss segments and on to electrical distribution boxes in the center of the power truss.\n\nEven though the cable is not carrying any sort of electrical load, engineers decided to have Reilly disconnect it just to make sure it wasn't part of any so-called \"sneak circuits\" or causing any grounding issues that might have played a role in the computer trouble.\n\n\"We have something for J.R. related to the troubleshooting that's ongoing for the SM computers,\" astronaut Megan McArthur radioed from Houston. \"We'd like to have him disconnect the P-12 connector that was connected during EVA-1. This will not be an impact until S6, so we're going to think about when to reconnect it. But for now, we'd like him to disconnect it. ... You guys can work it in as you see fit.\"\n\n\"OK, Megan, that sounds good,\" Pat Forrester replied from Atlantis.\n\nEarlier today, U.S. and Russian engineers disconnected U.S. electrical power from the Russian computer system on the theory that some sort of noise or change in the circuit after the new arrays were attached might have triggered the computer problems. But isolating the computers from U.S. power did not resolve the problem.\n\nRussian engineers are expected to send additional commands to the computers overnight that may indicate whether the P-12 cable could have played any role in the earlier computer glitches.\n\nToday's spacewalk began at 1:24 p.m. when the astronauts switched their spacesuits to internal battery power. This is the 86th EVA devoted to station assembly and maintenance since construction began in 1998, the ninth so far this year, the third overall for the Atlantis crew and the second this mission for Reilly and Olivas.\n\nOlivas began the blanket repair work by using his helmet camera to beam down close-up views of the torn insulation and surrounding blankets to help flight controllers assess the health of the system. The damage site showed up in sharp detail, with a 4-inch by 6-inch corner peeled back from an adjacent row of heat-shield tiles.\n\nThe damage was spotted during a routine payload bay survey shortly after launch last Friday. NASA's Mission Management Team decided earlier this week to extend the shuttle mission by two days and to add a fourth spacewalk, in part to accommodate a repair job. The team ultimately decided to add the blanket work to the third spacewalk today.\n\nOlivas had no problems gently tapping the peeled-back blanket down flat. And he had no problems using the stapler and later, inserting steel pins through the blanket and into nearby heat-shield tiles.\n\nTemperatures climb to between 700 and 1,000 degrees Fahrenheit on the upper surfaces of the rocket pods during re-entry and while the torn blanket did not appear to pose a threat to the crew, heat damage was possible to the graphite epoxy structure of the rocket pod. NASA managers decided to play it safe and order a repair.\n\nAfter the blanket and valve replacement work is complete, Reilly and Olivas will turn their attention to assisting the retraction of the P6 solar array extending to the right side of the station.\n\nThe P6 array was attached to the station in 2000 to provide power during the early stages of assembly. Now, NASA needs to move it to the left end of the station's main power truss to prepare the complex for the delivery of European and Japanese research modules later this year and early next.\n\nDuring retraction of the P6-4B array last December, the astronauts ran into major problems and ultimately had to stage an unplanned spacewalk to fold the blankets back in their storage boxes. This time around, the Atlantis astronauts have taken a more deliberate, step-by-step approach, retracting the array about 28 feet before a spacewalk Wednesday in which Pat Forrester and Steve Swanson manually cleared hangups and ultimately got the 115-foot-long array in about half way.\n\nToday, Reilly and Olivas plan to finish the job, although time is available in a fourth spacewalk Sunday if they run into any major problems.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}