{"category": "spam", "to_address": null, "from_address": "\"Onlineservice\"<onlineservice@paypal.com>", "subject": "Dear paypal customer!", "body": "\n\n\nPayPal\n\n\n\n\n\n\n\n\n\nMay 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear users of PayPal services,\n\t\t\t\n    Due to upcoming year 2007, and recent changes in PayPal's Service Agreement you need to submit additional details on your PayPal account. Starting from 2007 all PayPal accounts will come with complete detailed information!\n\n\t\t\tIdentity protection matters. And PayPal works day and night to help keep your identity safe. \n\n\n\n\n\n\nIdentity protection matters. Get Verified!\n\n\n According the new changes in Service Agreement any unverified account will be deleted from the system in 72 hours after receiving this letter.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Your Account\n\n\n\n\n\n\n\nTips to Protect Your Account \n\n\n\t\t\tPayPal's world class fraud investigators share \n\t\t\t5 important actions you can take to help prevent identity theft and protect your account.\n\t\t\t\n\n\nUpdate Your Profile\n\n\t\t\tIf you've closed a credit card or bank account recently, remember to go to PayPal's website \n\t\t\tto update your profile.\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Identity Protection Highlights\n\n\n\n\n\n\n\n\n\n\n\nNew spoof tutorial \n\n\t\t\tLearn how to spot and avoid fraudulent \"spoof\" emails and websites with PayPal's handy \n\t\t\t5-step spoof tutorial.\n\t\t    \n\n\n\n\n\n\n\n\n\n\nProtect yourself with tools\n\n\t\t\tGuard yourself against \"spoof\" emails with the SafetyBar, and against fraudulent websites \n\t\t\twith the eBay Toolbar.\n\t\t    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChecklist if you are a victim... \n\n\t\t\tWhen you suspect a problem with your identity, you have to act fast. Use PayPal's checklist \n\t\t\tfor what you should do.\n\t\t    \n\n\n\n\n\n\n\n\n Merchant Offers\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n\n\n\nFREE Norton AntiSpam download with purchase of Norton AntiVirus. \n\t\t\t\n\n\t\t\t\n Unlimited listening and downloading. All the music you want. FREE trial. \n\t\t\t\n\t\t\t\nLearn about and fund locally run social and environmental projects. \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nThank You for using PayPal!\n\n\n\n\n\n\n\t    This notification was sent to you by PayPal. To modify your notification preferences, \n\t    log in to your PayPal account, click the Profile sub-tab, then click the Notifications link under \n\t    Account Information. Changes may take up to 10 days to be reflected in our mailings. PayPal will \n\t    not sell or rent any of your personally identifiable information to third parties. For more information \n\t    about the security of your information, read our Privacy Policy at \n\t    https://www.paypal.com/privacy.\n\t    \n\n\n\n\n\n\t    Copyright © 2007 PayPal Inc. All rights reserved. Designated trademarks and brands are the property \n\t    of their respective owners. PayPal is located at 2211 N. First St., San Jose, CA 95131.\n\t\n\n\n\n\n\n\n"}