{"category": "ham", "to_address": "\"Inman, Brant A. M.D.\" <Inman.Brant@mayo.edu>", "from_address": "\"Stephen Weigand\" <weigand.stephen@gmail.com>", "subject": "Re: [R] Putting 2 breaks on Y axis", "body": "On 4/12/07, Marc Schwartz  wrote:\n> On Thu, 2007-04-12 at 13:41 -0500, Inman, Brant A. M.D. wrote:\n> > R plotting experts:\n> >\n> > I have a bivariate dataset composed of 300 (x,y) continuous datapoints.\n> > 297 of these points are located within the y range of [0,10], while 2\n> > are located at 20 and one at 55.  No coding errors, real outliers.\n> >\n> > When plotting these data with a scatterplot, I obviously have a problem.\n> > If I plot the full dataset with ylim = c(0,55), then I cannot see the\n> > structure in the data in the [0, 10] range.  If I truncate the y axis\n> > with ylim = c(0,10), then I cannot see the 3 outliers.  If I break the y\n> > axis from 10 to 20 (using plotrix functions), I still do not see the\n> > data optimally because of the white space from y=20 to y=55.\n> >\n> > What I would like to do is break the y axis at 2 points, roughly 10-20\n> > and 20-55. Is there a function that can break an axis in 2 places?\n> >\n> > Thanks in advance for any suggestions.\n> >\n> > Brant\n>\n>\n> Brant,\n>\n> I am not a particular fan of broken axes (though others will disagree),\n> much less two breaks.\n>\n> Presuming that your data might look something like this:\n>\n> http://www.itl.nist.gov/div898/handbook/eda/section3/scattera.htm\n>\n> A couple of thoughts:\n>\n> 1. Not being sure if your data range above actually includes 0, you may\n> want to consider a log scaled axis, if not.\n>\n> 2. I might be tempted to use two plots:\n>\n>   A. A first a plot of the entire data set, showing the 3 outliers\n>\n>   B. A second plot of the 297 pairs with axes constrained to the\n>      appropriate ranges to enable better visualization of the data\n>      structure.\n>\n> If number 2 is more appropriate, you could also use par(\"mfcol\") to set\n> up side by side plots. See ?par.\n>\n> HTH,\n>\n> Marc Schwartz\n>\n\nI was thinking plot the data without the outliers and include a\nsmaller inscribed plot in a corner showing all the data (the \"global\nview\"). But I couldn't figure out how to do this.\n\n(I think legend() works very hard to do this type of thing.)\n\nStephen\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}