{"category": "ham", "to_address": "r-help@stat.math.ethz.ch, \"Frank Liu\" <frankcsliu@gmail.com>", "from_address": "\"Paul Johnson\" <pauljohn32@gmail.com>", "subject": "[R] random effects in logistic regression (lmer)-- identification\n\tquestion", "body": "Hello R users!\n\nI've been experimenting with lmer to estimate a  mixed model with a\ndichotomous dependent variable.  The goal is to fit a hierarchical\nmodel in which we compare the effect of individual and city-level\nvariables.  I've run up against a conceptual problem that I expect one\nof you can clear up for me.\n\nThe question is about random effects in the context of a model fit\nwith a binomial family and logit link.  Unlike an ordinary linear\nregression, there is no way to estimate an individual level random\nerror in the linear predictor\n\nz_i = a + b*x_i + e_i\n\nbecause the variance of e_i is unidentified.  The standard deviation\nof the logistic is pi*s/3, and we assume s=1, so the standard\ndeviation is assumed to be pi/3 (just a bit bigger than 1, if you are\ncomparing against the Standard Normal).  The logistic fitting process\nsets the variance of the error and the parameters a and b are\n\"rescaled\" accordingly.\n\nAs a result, there is an implicit individual-level random effect\nwithin a logistic model.  There is a good explanation of this issue in\nTony Lancaster's textbook An Introduction to Modern Bayesian\nEconometrics.\n\nSo we usually end up thinking about a linear predictor in a logistic\nregression like so\n\nz_i = a + b*x_i\n\nRandom effects can be estimated for \"groups\" or \"clusters\" of\nobservations.  If j is a grouping variable, then we estimate\n\nz_i = a + b*x_i + u_j\n\nThe variance component here is, as far as I understand, measured on\nthe same scale as the logistic distribution's standard deviation.\n\nCurrently, I'm working on a project in which there are observations\ncollected in many cities, represented by a variable PLACE.  We are\ncomparing the effect of several variables on a response for each of\nthe values of a RACE variable.  RACE is dichotomized into \"White\" and\n\"Nonwhite\" by the people who collect the data.\n\nFor Nonwhites only, we can estimate the effect of individual level\npredictors (x) on the output (y).\n\nfm1 <- lmer( y ~ x + (1 | PLACE), data=dat, , family=binomial, subset=\nRace %in% c(\"Nonwhite\"))\n\nThe random effect in this model indicates the variance caused by a\nNonwhite's location on the response variable.\n\nRandom effects:\n Groups  Name        Variance Std.Dev.\n PLACE (Intercept) 0.047326 0.21754\n\nSuppose I estimate models for the 2 races in a combined model like this:\n\nfm1 <- lmer( y ~ -1 + Race / (x) + (-1 + Race | PLACE), data=dat,\nfamily=binomial)\n\nThis gives fixed effects estimates that are pretty easy for\nnonstatisticians to understand.  One can look and see the effect of a\nvariable x on people of different races.\n\nBut the random effect is a bit hard to understand.  Since the Race\nvariable is dichotomous, My aim was to see if the variance of the\nrandom effect is different for the 2 racial categories. Here are the\nestimates:\n\nRandom effects:\n Groups  Name                      Variance  Std.Dev. Corr\n PLACE RACE_ALLWhite      0.0095429 0.097688\n             RACE_ALLNonwhite 0.1286597 0.358692 1.000\n\nI can't quite grasp what the correlation means.  I BELIEVE the\nvariance values indicate that the experiences of whites are\nhomogeneous across cities, because the variance is negligible for\nthem, while the experiences of Nonwhites are much more city-dependent.\n\nWhat does it mean when the correlation is 1.0?  The correlation takes\non that value when there are no city-level variables in this model, so\nI GUESS that it means that all city-level variation is attributed to\nthe random effect. What do you think?\n\nIf i put in some city level predictors, then the estimates of the\nvariance components change--they essentially disappear to the minimum\nvalues--and the correlation is not 1.0 anymore.\n\nRandom effects:\n Groups  Name          Variance Std.Dev.   Corr\n PLACE  RACEWhite    5e-10    2.2361e-05\n          RACENonwhite   5e-10    2.2361e-05 0.001\n\nThis indicates that, after adding in the city level variables, the\nunaccounted for city-level  variation is very small.  Correct?\n\nNow, back to the idea that there is always an implicit individual\nlevel random effect in a logistic regression. Is it meaningful to ask\n\"is that individual level random effect different for people of\ndifferent races?\"  If so, How can I estimate that?  If e_i is the\nimplicit random error, can I ask for another random effect for\nNonwhites only, say u_iN, in a model like so:\n\nz_i = a + b*x_i + e_i + u_iN\n\nSuppose the unique respondent number is ID and we create a new variable\n\nNonwhiteID = 0 for Nonwhites\n                 = ID for Nonwhites\n\nHere's my idea about how to check to see if the individual level\nvariance component for Nonwhites is different from the \"baseline\" of\nWhites by fitting this:\n\nfm1 <- lmer( y ~ -1 + Race / (x) + (-1 + Race | PLACE) + (1 |\nNonwhiteID), data=dat, family=binomial)\n\nHere, again, I leave out the city-level variables.\n\nRandom effects:\n Groups  Name          Variance   Std.Dev.   Corr\n NonwhiteID (Intercept)   5.0000e-10 2.2361e-05\n PLACE RACEWhite       1.0575e-02 1.0283e-01\n         RACENonwhite        1.2880e-01 3.5889e-01 1.000\nnumber of obs: 6201, groups: NonwhiteID, 1736; PLACE, 33\n\nThe variance component estimated for NonwhiteID means that the\nvariance observed among Nonwhite respondents is not substantially\ndifferent from the implicit, unestimated individual level random\nerror.  However, it still appears that there is a substantial place\neffect, for Nonwhites only.\n\nDo I understand that right?\n\nWell, thanks in advance, as usual.\n\n-- \nPaul E. Johnson\nProfessor, Political Science\n1541 Lilac Lane, Room 504\nUniversity of Kansas\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}