{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Marina Marrero\" <naseasternsecuritypiv@easternsecurity.ca>", "subject": "Become fit and happy again", "body": "\nLook in the mirror and enjoy the new you\n\n\n\n\n\nAnatrim – The newest and most fascinating product for corpulent people available – As you could see on Oprah\n\n\n\nDid you realize that excessive body kilos kill more and more people for every new year? We believe you hate the ugly appearance of those people and the low status they obviously have in society. \n\nOr, maybe, you got no will to withstand a siege of your pernicious eating habits. If you see it sounds familiar, then we got something for your consideration!\n\n\n\n\n\nHere comes Anatrim, the later product for the elimination of your body’s extra weight. The most amazing thing is that Anatrim raises the quality of your life by soothing the feeling of hunger and giving you better cheer. Look at some e-mails from our customers:\n\n\n\n\n\n\"This is amazing! \n\n\nI stopped watching TV constantly and gorging everything easy to reach \n\n\nI became more interested in taking exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I have a great shape now and there are lots of men around me!\"\n\n\n\n\n\n\nVictoria K., Bellevue WA\n\n\n\n\n\n\n\"I tried some passive weight losing, but with no result. I could not restrain my ravenous hunger. \n\n\nOne day I heard on Anatrim in the media advertisement and I was really effected by the information.\n\n\n I had tried to use it, and my wife told me that I had changed for the better since then, 4 months later. \n\n\n32 pounds off and it is still far to an end! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nCharley Mock, Las Vegas\n\n\n\n\n\nAnatrim helps you to realize that your body doesn’t need that much food. It raises your spirit, gives you energy, and attacks useless kilos. Great thanks to its mighty original formula!!\n\n\n\nElicit latest intelligence!\n\n\n\n"}