{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@speedy.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "efficacious: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Tuesday, April 17, 2007\nefficacious \\ef-ih-KAY-shuhs\\, adjective:\nPossessing the quality of being effective; producing, or capable of producing, the effect intended; as, an efficacious law.\nLawyers make claims not because they believe them to be true, but because they believe them to be legally efficacious. -- Paul F. Campos, Jurismania\nHenri IV wrote to his son's nurse, Madame de Montglat, in 1607 insisting 'it is my wish and my command that he be whipped every time he is stubborn or misbehaves, knowing full well from personal experience that nothing in the world is as efficacious'. -- Katharine MacDonogh, Reigning Cats and Dogs: A History of Pets at Court Since the Renaissance\nPlagued by rats, the citizens of Hamelin desperately seek some efficacious method of pest control. -- Francine Prose, review of The Pied Piper of Hamelin, as retold by Robert Holden, New York Times, August 16, 1998\nEfficacious is from Latin efficax, -acis, from efficere, \"to effect, to bring about,\" from ex-, \"out\" + facere, \"to do or make.\"\nDictionary.com Entry and Pronunciation for efficacious\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9320351-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}