{"category": "spam", "to_address": "<ktwarwic@flax24.uwaterloo.ca>", "from_address": "\"The Bull Report\" <news@thebullreport.com>", "subject": "News update: SSPE Announces Steve Miller Joins Board of Directors", "body": "    To view this email as a web page, go    here.     \n\n\n\nThe Bull ReportMay 29th, 2007\nSun Announces Steve Miller Joins Board of Directors\nDALLAS, TX, May 29, 2007 (MARKET WIRE via COMTEX) -- SUN Sports & Entertainment Inc., (PINKSHEETS: SSPE) announced today that Global Sports Marketing Legend Steve Miller has joined the SUN Board of Directors.\n\nMr. Miller retired from NIKE as Director of Global Sports Marketing relations in 2000, after nine years with the company. While at NIKE, Miller held several positions including Director of Athletics, Director of U.S. Sports Marketing, Director of Sports Marketing for the Aisa Pacific region, and Director of NCAA Sports Marketing. From September 1991 to October 1994 Miller led his division to over 500 percent growth for the period. From June 1998 to September 2000, he oversaw NIKE's $100 million investment in the 2000 Olympic Games in Sydney, while directing the company's marketing investments and strategies throughout the Asia Pacific region.\n\nRead the full release on SSPE\nRead the full disclaimer Click here\n\n\n\n\n\n                                    This email was sent to:  ktwarwic@flax24.uwaterloo.ca\n\n\n\n\n                                                            This email was sent by: The Bull Report                                                                                                              \n                                                            1846 rosemeade 104 dallas, TX 75007 USA \n                                                            \n\n\n          \n                                    We respect your right to privacy - view our policy\n\n\n\n\n\n\n\n\n\nManage Subscriptions | \n                                    Update Profile | \n                                    One-Click Unsubscribe\n\n\n\n\n\n"}