{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 26, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESCops Charged In Slaying Of Elderly Woman\nA grand jury indicted three current and former police officers in the shooting death of an elderly Atlanta woman during a\n                        drug raid. An autopsy report revealed the 92-year-old woman was shot five or six times in the chest, arms, legs and feet. More...\n• Couple Uses MySpace In Hunt For Baby• Soldier Charged With Aiding Iraq Enemy\n                     \t\t\t\t\t| Watch• Iraq Withdrawal Bill Moves To Senate\n                     \t\t\t\t\t| WatchU.S.Inmate Out On \"Kidney Release\" Recaptured\nByron Keith Perkins was released in January 2006 to undergo tests to see if he could donate a kidney to his teenage son. Instead,\n                        he fled to Mexico. Now the convicted bank robber and pot dealer has been caught. His son says \"good.\" More...\n• Wildfire Continues To Burn Southern Ga.• Cops Find Body In Hideout After Standoff• Feds Arrest Mail Bombing Suspect\n                     \t\t\t\t\t| Watch• More StoriesWorldIraq Action May Elude Prince Harry\nA British newspaper reported that army chiefs were reconsidering their decision to allow Prince Harry to fight in Iraq with\n                        his army regiment. Media reports also cited unnamed sources who said Harry would quit the Army if he is not sent to Iraq. More...\n• Soldier Charged With Aiding Iraq Enemy\n                     \t\t\t\t\t| Watch• Putin: I Won't Run Again• Ukrainians Remember Chernobyl• More StoriesPoliticsExpectations Game Precedes Debate\nAs the Democratic presidential candidates prepare for their first debate tonight in Orangeburg, S.C., they are also immersed\n                        in an expectations game, building up rivals and playing down their own abilities. More...Watch: Political Roundtable \n• Iraq Withdrawal Bill Moves To Senate\n                     \t\t\t\t\t| Watch• The War In Iraq And The War At Home• Tenet Defends High Value Detainee Program\n                     \t\t\t\t\t| Watch• More StoriesHealthSurvey: Docs Wined, Dined By Drug Makers\nFour out of five doctors surveyed said they let drug and device makers buy them food and drinks despite recent efforts to\n                        tighten ethics rules and avoid conflicts of interest. More...\n• Panel Urges Junk Food Ban In Schools\n                     \t\t\t\t\t| Watch• China Bans Melamine, Rejects Pet Food Link\n                     \t\t\t\t\t| Watch• Keeping Kids Safe In Summer\n                     \t\t\t\t\t| Watch• More StoriesSciTechCouple Uses MySpace In Hunt For Baby\nA Michigan couple has turned to the popular online destination in search of a baby girl. Sherry and Karl Dittmar hope to find\n                        a birthmother willing to part with her baby through their posting on MySpace. More...\n• Hawking To Go Weightless In Flight• California To Sue EPA Over Air Standards• Crocodile To Be Set Up With Four Partners• More StoriesBusinessFord's 1Q Loss Narrows To $282M\nFord Motor Co. posted a first-quarter net loss of $282 million, which can be taken as good news for the automaker, which lost\n                        $1.4 billion in the same period last year, and $12.7 billion in all of 2006. More...\n• Nissan's Profits Plunge 54 Percent• Judge Approves Delta Bankruptcy Exit Plan• Dow Closes Above 13,000 For First Time\n                     \t\t\t\t\t| Watch• More StoriesEntertainmentRegis Philbin Returns To \"Live\"\nThe \"Live With Regis and Kelly\" audience cheered as Regis Philbin walked onto the set with co-host Kelly Ripa.\n                         More...Watch: Detecting Heart Disease\n• Al Gore Opens Tribeca Film Festival• Cops Cuff Grant In Baked Bean Brouhaha• Nobody Leaves This Week On \"American Idol\"\n                     \t\t\t\t\t| Watch• More StoriesOpinionProtesting \"Free\" Speech\nAfter the Imus farce and the Virginia Tech tragedy, Dick Meyer applauds efforts to scrutinize the First Amendment. More...\n• Iran's Nukes No Match For Sanctions\n                     \t\t\t\t\t| Watch• Give Progress A Chance In Iraq\n                     \t\t\t\t\t| Watch• Being No. 1 Is Over-Rated• More StoriesCBS NEWS BROADCASTSThe Early Show: Susan Koeppen: Keeping Kids Safe In Summer\nSusan Koeppen offers practical advice, starting with precautions to take in your backyard.  She covers three of the\n                        most common causes of hot weather injuries and deaths among kids: drowning, wheeled-sports accidents and window falls. More...Watch: Kids & Summer Safety \n• EARLY SHOW: Wedding In A Week\n                     \t\t\t\t\t| Watch• CBS Evening News: Reality Check: Baghdad Troop Surge\n                     \t\t\t\t\t| Watch• CBS Evening News: Healthy Snacks Make Healthier Kids\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nBill Passes, Showdown BeginsThe House passed a controversial war funding bill that sets a timeline for U.S. troop withdrawal from Iraq, despite President\n                                    Bush's promises to veto any such measure. Bill Plante reports.\nTOP VIDEOS\nRaising Healthy Puppies\nEating Healthier At School\nMcCain On Iraq & Campaign '08\nTenet Denies CIA Torture\nThe Perfect Wedding Menu\nSecrets Of Healthy People\nKids & Summer Safety \nProsecution Slams Spector\nLegal Analyst On Spector\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesEx-CIA Chief George Tenet defends the controversial High Value Program and denies to agency uses torture. Scott Pelley\n                           reports, Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryMurder In The Fast Lane:A sister fights for justice in the murders of her brother and his wife. Bill Lagattuta\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}