{"category": "ham", "to_address": "Steve Langasek <vorlon@debian.org>,\n   Debian-legal <debian-legal@lists.debian.org>", "from_address": "Gervase Markham <gerv@mozilla.org>", "subject": "Re: Final text of GPL v3", "body": "Steve Langasek wrote:\n> If I go to the effort of writing\n> \n>     This program is Free Software: you can redistribute it and/or modify\n>     it under the terms of the GNU General Public License version 3 as\n>     published by the Free Software Foundation, with the exception that the\n>     prohibition in section 7 of the license on additional restrictions does\n>     not apply and the permission in section 13 is not granted.\n> \n> then I have *explicitly addressed* the clause in GPLv3 which purports to\n> prohibit additional restrictions.  \n\nYes, you have. Note that this is not the situation we have been \nconsidering up to now in this thread; the situation we have been \nconsidering is one where there is just a simple additional restriction \n(e.g. \"if you redistribute you must send me a postcard\").\n\nYour above restriction also results in a consistent license. However, \nit's not GPLv3-compatible.\n\n> Which statement is going to take\n> precedence?  \n\nClearly, your explicit statement that section 7 does not apply. How \ncould one argue otherwise?\n\n> At best I've created a lawyer bomb because my intentions are\n> not clear; at worst I've succeeded in licensing my code in a manner that's\n> incompatible with the GPLv3.  But that's exactly the same problem that we\n> had with GPLv2, so what was the point of adding this clause?\n\nBecause most of the time, people just add additional restrictions \nwithout also adding your language about section 7 - often because they \ndon't realise they can't do that. This feature of the license combats \ncluelessness, not explicit intent.\n\nGerv\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}