{"category": "ham", "to_address": "heimdal-discuss@sics.se, Andrew Bartlett <abartlet@samba.org>", "from_address": "\"Henry B. Hotz\" <hotz@jpl.nasa.gov>", "subject": "Re: Does PAC Validation Require External Communication?", "body": "As I understand it, if you have access to the server's keytab, then  \nin principle you can forge credentials for anyone, including non- \nexistent users (but only for that server).  What you suggest would  \nprevent someone faking the PAC data in a credential, and from  \ninventing a fake user, but they could still fake the credential.\n\nIn other words it wouldn't stop John Jones from presenting a fake  \ncredential for Sam Smith that just happened to include the real PAC  \ndata that Sam would have had if it were really Sam.\n\nAm I missing something?\n\nOn May 14, 2007, at 2:59 PM, Andrew Bartlett wrote:\n\n> On Mon, 2007-05-14 at 13:34 -0400, Michael B Allen wrote:\n>> This link claims MS' PAC verification can require communication with\n>> the DC:\n>>\n>> http://blogs.msdn.com/spatdsg/archive/2007/03/07/pac-validation.aspx\n>>\n>> Is this true? If so, services will not be able to authenticate nearly\n>> as fast as they otherwise could.\n>\n> If you think that someone else (not root) has access to the local\n> kerberos keytab (or the machine account password), then that user  \n> could\n> spoof their way to any (CIFS) user via the PAC, because they could  \n> make\n> up a fake one.  Similarly, as always with kerberos, they could change\n> the principal in the ticket, etc.\n>\n> This can be worked around by validating the PAC to the KDC, but should\n> be of concern to anyone who shares that keytab too broadly (eg with\n> apache).\n>\n> On windows, I think a user could run a service, and unless the PAC was\n> validated with the KDC, they could use their password to fake their  \n> way\n> down to another more privileged user.\n>\n> Andrew Bartlett\n------------------------------------------------------------------------\nThe opinions expressed in this message are mine,\nnot those of Caltech, JPL, NASA, or the US Government.\nHenry.B.Hotz@jpl.nasa.gov, or hbhotz@oxy.edu\n\n\n"}