{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Paula Young <extremeboy@gothenburgstatebank.com>", "subject": "The way to become a perfect lover", "body": "\n\nYou want to save your money and get licensed medications? I bet you do!\nGo to the site\nUse licensed Viagra and Cialis pills from our drug store. Now you are the best, you have perfect sex in your life! That is Online Drug store with quality ED medications!\nClick here to be the best lover in the world!\nSecure, confidential purchase!\nWith best regards,\nPaula Young\n \n \nGront zhe byl masterom ne na slovah, a na Dele, i eti pochivshie nyne kosachi iz gabalassovoj stali, pochti nichem ne Ustupaiushchej viritovoj stali dal-roktov, prolili nemalo krovi u ego vragov. Kist plavnoj Dugoj skolznula pered licom Nkota. Za masharami moimi prismotrish, chtoby rabotali podolshe, da za Poriadkom v traktire, pomozhesh Puzatomu Bochonku pautinu iz uglov vymetat, A Teper, brys! Kliaksa snova svernulas v trubochku i porsknula na pod, momentalno Zaterialas v zapolnennom liudmi zale. Eto budet dusha drugogo tela, eto budesh Ne ty. \nPo telu pobezhali ledianye murashki. Dalshe oni nam Ne ponadobiatsia, rasselina byla slishkom uzka. Tak, na chem tam ia ostanovilsia? Iz tebia by vyshel prekrasnyj psihoanalitik, Nori. No osnovnoj dohod Gorod vse zhe poluchal, torguia oruzhiem, kotoroe Proizvodilos na oruzhejnoj fabrike shefira, kontroliruemoj im lichno. Ia byl uveren, chto v nedalekom budushchem u nas eshche budut Stychki s etim neplohim parnem Bigmanom, i bylo by neploho znat ego Vozmozhnosti nemnogo luchshe. Pochemu ty srazu Ne poehal s nim, eshche iz Siiaiushchego, poslav odnogo iz svoih liudej, i pochemu Vse-taki reshil poehat potom? Kaverznyj voprosik, nado skazat. Poniatno, Nori pozabotilas i ob etom. Ton, kakim eto bylo skazano, govoril ob obratnom. \nKak zhe oni budut peredvigatsia v takoj tme? Idi smelee, ia tebia vizhu. Ia reshil nemnogo pomechtat, vse ravno delat bolshe bylo nechego. Molot i Nakovalnia? Ili Smerch? A mozhet, Stihiia? A eshche Kleshchi, Molniia, Gejzer, Sekator, Maiatnik. Mashiny dvigaiutsia vyshe granicy izlucheniia mentalnogo polia Vraga, a Eta granica dolzhna sozdavat sverhu nepronicaemyj dlia chelovecheskih glaz Barer. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}