{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 97", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Handbook helps Jewish families claim stolen art\n      (Museum Security Network Mailing list)\n   2. Tableau de 100.000 euros vol? dans un mus?e ? Malines\n      (Museum Security Network Mailing list)\n   3. Lost altar masterpieces found in spare bedroom fetch ?1.7m\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Mon, 23 Apr 2007 13:40:46 +0200 (CEST)\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Handbook helps Jewish families claim stolen art\nTo: msn-list@te.verweg.com\nMessage-ID:\n\t<40018.195.35.173.109.1177328446.squirrel@klant.bhosted.nl>\nContent-Type: text/plain;charset=iso-8859-1\n\nHandbook helps Jewish families claim stolen art\n\nAFP, BERLIN\nMonday, Apr 23, 2007, Page 6\n\nIn the wake of sensational sales of art that was seized by the Nazis,\nGerman authors have published the first handbook to help Jewish families\nwin back masterpieces that are still in the wrong hands.\nThe 528-page tome Nazi Looted Art -- Art Restitution Worldwide is sold as\na do-it-yourself law manual for heirs of Holocaust victims hoping to\nconfront museums and collectors in different corners of the world in a bid\nto recover lost canvasses.\n\nCo-author Gunnar Schnabel makes an educated guess that \"there are still\nthousands of masterpieces and tens of thousands of lesser paintings that\nshould be returned to the rightful heirs.\n\n\"For example, some 30,000 art works were taken out of France, but 16,000\nnever resurfaced. It is the museums' policy to keep all of this top\nsecret. There are works in basements and vaults,\" Schnabel, a lawyer who\nhandles restitution claims, said.\n\nEven before it hit the shelves last month, the book he wrote with\nhistorian Monika Tatzkow was adding to pressure on the German government\nto return a painting from the Biedermeier era featured on its cover.\n\nThe work, Fiat Justitia by Carl Spitzweg, formed part of the German\ngovernment's art collection for decades after World War II.\n\nBut it originally belonged to Jewish trader Leo Bendel, who died in the\nBuchenwald concentration camp in 1940.\n\nIn February, as articles about the book appeared in most Austrian and\nGerman newspapers, the German finance ministry announced it would return\nthe painting to the Bendel heirs.\n\nSchnabel and Tatzkow said they hope to force museums to investigate the\nprovenance of their works and come clean on art they obtained thanks to\nthe Nazis' systematic seizure of Jewish collections that peaked in the\nearly 1940s.\n\nGerman museums panicked last year when Berlin's Bruecke Museum had to part\nwith Ernst Ludwig Kirchner's Berlin Street Scene, a prized Expressionist\npainting looted from a Jewish shoemaker.\n\nWhen the claimant let Christie's auction the work and it was bought by US\ncosmetics magnate Ronald Lauder for US$38 million, curators began bracing\nfor a flood of claims from heirs hoping for a windfall from a buoyant art\nmarket.\n\nLauder is famous for collecting restituted art and an obvious target for\ncriticism that a moral issue is being commercialized.\n\nHis first piece was a Van Gogh drawing discovered by Tatzkow which he\nbought for 7 million euros (US$9.5 million), but in 2005 he paid a record\nUS$135 million for Adele Block Bauer I, an iconic portrait by Secessionist\n-- the Austrian name for Art Nouveau -- artist Gustav Klimt, after it was\nrestituted to the sitter's niece.\n\n\"It's only about money and speculation,\" Martin Roth, the director of\nDresden's State Art Collection, complained recently.\n\nMuseums such as the Bruecke say they cannot afford to follow the example\nset by Vienna's Leopold Museum, which invited scrutiny of the origins of\nits unrivalled Egon Schiele collection.\n\nIt has also spent millions contesting a claim for the Austrian artist's\nPortrait of Wally.\n\nBut ahead of an international conference on looted art taking place in\nPotsdam near Berlin next week, historian Julius Schoeps said: \"I think the\nmuseums also lack the will.\"\n\nHe advised museums to loan out works to raise funds to pay out claimants\nas a way of keeping their collections intact.\n\nSchnabel thinks there \"is not enough money to buy back all the paintings\nthe Nazis stole,\" but said in his experience museums are not prepared to\npay even modest reparations.\n\n\"Initially, with the Kirchner painting, the granddaughter was happy to\naccept a sum below the market price but the museum refused,\" he said.\n\nTatzkow has accused museums of playing for time in the knowledge that the\ngeneration of Jews whose parents perished in the Holocaust will not be\naround forever.\n\n\"They are trying to sit the problem out, to wait for time to pass,\" she said.\n\n\"The story of a missing artwork will eventually get lost in a family. The\nchildren will know something but once they are dead, restitution becomes\nmore difficult,\" she said.\n\nPublished on Taipei Times\nhttp://www.taipeitimes.com/News/world/archives/2007/04/23/2003357875\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Mon, 23 Apr 2007 13:41:43 +0200 (CEST)\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Tableau de 100.000 euros vol? dans un mus?e ? Malines\nTo: msn-list@te.verweg.com\nMessage-ID:\n\t<40036.195.35.173.109.1177328503.squirrel@klant.bhosted.nl>\nContent-Type: text/plain;charset=iso-8859-1\n\nTableau de 100.000 euros vol? dans un mus?e ? Malines\nUn tableau du peintre malinois David Vinckboons a ?t? vol? vendredi au\nmus?e Hof van Busleyden, ? Malines. Sa valeur est ?valu?e ? quelque\n100.000 euros. Les voleurs ont agi en plein jour et ont disparu sans\nlaisser de trace, a indiqu? la police de Malines.\n\nLe conservateur du mus?e a constat? le vol vendredi apr?s-midi. L'oeuvre\ns'intitule \"Sc?ne de chasse dans un bois\" et date du d?but du dix-septi?me\nsi?cle. Elle mesure ? peine 15 centim?tres sur 20. Les voleurs ont disparu\nsans laisser de trace. Le mus?e Hof van Busleyden ne poss?de pas de cam?ra\nde surveillance.\n\nLa police cherche ? savoir si ce vol a un lien quelconque avec deux autres\nvols de tableau ? Malines. Il y a un mois, un vol a en effet eu lieu dans\nl'?glise du B?guinage. Un tableau avait ?t? subtilis? auparavant dans une\n?cole de la Melaan. (belga)\n\nhttp://www.7sur7.be\n\n\n\n------------------------------\n\nMessage: 3\nDate: Mon, 23 Apr 2007 13:44:35 +0200 (CEST)\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Lost altar masterpieces found in spare bedroom fetch\n\t?1.7m\nTo: msn-list@te.verweg.com\nMessage-ID:\n\t<40075.195.35.173.109.1177328675.squirrel@klant.bhosted.nl>\nContent-Type: text/plain;charset=iso-8859-1\n\nLost altar masterpieces found in spare bedroom fetch ?1.7m\n\nItalian ministry outbid by private buyer in Dorset sale of Fra Angelico\nsaints\n\nSteven Morris\nFriday April 20, 2007\nThe Guardian\n\nThey were discovered behind the door in a pensioner's spare room: two\nsmall panels depicting two saintly figures.\nYesterday, having been identified as the missing pieces of the San Marco\naltarpiece by the Renaissance master Fra Angelico, the pieces were sold\nfor ?1.7m, a record for a sale outside London.\n\nIn a former egg-sorting shed at Dorchester cattle market, telephone\nbidders pushed the price up. The Italian ministry of art and culture led\nthe charge, attempting to get back paintings that probably vanished from\nFlorence during Napoleon's occupation of Italy.\n\nBut the Italian ministry was pipped by an anonymous European bidder, and\nthe fear last night was that after having been lost for two centuries the\ndelicate paintings may once again disappear.\nThe paintings, peppered with woodworm holes, resurfaced after languishing\nfor the last few years on a wall at Oxford librarian Jean Preston's two\nup, two down house. She had found them in a box of odds and ends in\nAmerica in the 1960s.\n\nShe did not realise what they were, but thought them \"quite nice\" and\nmentioned them to her father, who was a collector. He paid a modest ?200\nand she inherited them when he died.\n\nMiss Preston, an expert on medieval texts, carried on living an unassuming\nlife, travelling everywhere by bus or on foot, buying her clothes from a\ncatalogue and eating frozen meals, not realising she had a fortune hanging\nbehind the door of her spare bedroom.\n\nIt was only after her death last year that the panels came to light, to\nthe shock of Miss Preston's family and the art world.\n\nThe main panel, which is still at San Marco in Florence, shows the Madonna\nand child. Eight smaller paintings of saints believed to have originally\nbeen positioned in two rows of four on either side of the central image\nwere dispersed. Six of the eight are known to be in collections and\ngalleries around the world: the missing two turned out to be Miss\nPreston's.\n\nYesterday they were to be found in the corner of Duke's saleroom in\nDorset's county town among more standard provincial auction fare:\nVictorian seascapes, paintings of kittens and pheasants, bits and pieces\nof dubious origin.\n\nThe bidding for Lot 150 started at ?450,000. It quickly hit the ?1m mark\nand kept climbing.\n\nThere was a hitch when contact was lost with one telephone bidder, who was\non a train in Kent. But applause broke out as the hammer went down at\n?1.7m.\n\nMiss Preston's nephew, Martin Preston, who is selling the panels, said he\nplanned to celebrate with a beer at his local pub and a week of skydiving.\nAfter tax and the lawyers' fees have been paid and the sum has been split\nbetween a large family, he insists he personally has not made a fortune.\n\nAs to what his aunt would have made of the sale, Mr Preston said: \"I don't\nthink it would have meant anything to her. She was not interested in money\nbut in the artistic worth of things. I just hope they will be seen by the\npublic. I think that is what Jean would have wanted.\"\n\nIt may be a forlorn hope. Simon Wingett, an art agent who bid in vain for\na private collector, said: \"It's been an extraordinary day. A pair like\nthis may never come up for sale again in our lifetime. And we may never\nsee them again. That's the reality.\"\n\nWithin an hour the saleroom was clear of the dealers, the agents, the\ngawping children and the two nuns who had provided just about the only\nnon-secular element to the sale.\n\nAnd then the paintings were whisked out of public sight. The two saintly\nfigures - one has now been identified as the Dominican missionary St\nVincent Ferrer - spent last night in a bank vault.\n\nThey may reappear again soon. But they may be lost for another two\ncenturies, or more.\n\nhttp://arts.guardian.co.uk/\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 97\n***************************************\n\n"}