{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "\"Rochelle and Bethea\" <rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, here's your forecast for June 25th - July 1st", "body": "\n\n\n\n\n\n\n\n\nMemo, to ensure that your weekly forecasts are delivered correctly to your inbox, please add our email address Rochelle@myhealthwealthandhappiness.com to your address book.\n \n\nFull Moon, June 30, 9:50 AM EST\n\n\n\n\n\n\n               \n\n\n\n\nDear Memo,\n\n    Had any messages today?  Now, I don't mean on your phone or email or written notes slipped under your door.  I'm talking about those \"messages\" that the Universe has for us that are all around, if only we took the time to pay attention to them.\n    If you're up on your weather lore, you know that nature has many kinds of signs that have been observed throughout the ages that are messages about a change in the weather.  Many old sayings like \"red sky at night, sailor's delight; red sky in the morning, sailor take warning\" or \"clear moon, frost soon\" have been found to be true indicators of changes in air pressure, humidity, or wind that affect weather conditions.  The behavior of animals and insects can also be indications of changes in the weather.\n    But besides weather indications, the natural world can be a source of personal messages from the Universe just waiting for you to pick up, Memo.  Here's a little exercise to help you \"tune in.\"  You don't need to live in the countryside to do this; any small park or other natural setting will do.\n    Choose a place outdoors where you can feel private and safe.  Stand still or sit down, if you choose, close your eyes and take a moment to relax and clear your mind (taking a few deep breaths in and out will help).  If you have a particular question or an issue that's been bothering you, bring it to mind now.  Or you could simply request some general guidance.\n    Open your eyes and note the first thing that comes to your attention.  It could be the first thing you see, or a sound, or a scent.  Make a note of what it is, and ask yourself what it reminds you of, or what it makes you think of.  Use your instincts about its significance for you, because this is your own personal message.\n\n                        Until next week,                            \nP.S. Don’t forget to add Rochelle@myhealthwealthandhappiness.com to your address book.  We want to make sure that you receive your weekly forecasts on time.\n\n\n\n\n                      \n\n\n\n\n\n\n\n                 \n\n\n    With the effects of the Scorpio Moon opposed by Mars in Taurus, don't even think about trying to change someone's mind on Monday, Memo, as you won't get anywhere near.  Mercury and the Sun combine on the 28th and contracts or paperwork could be revealing.  Remember, this is not the right time for binding commitments unless you have no choice or you have gone through it with a fine-tooth comb.  The Full Moon in Capricorn on the 30th could bring a welcome break in tension, as stubborn minds will now relax.\n\n\n\n\n\nMemo             June 25 - July 1             \n\n\n\n\n \n\n\n\n    Memo, I want you to take maximum advantage of the luck coming your way this week. From my calculations, Sunday is going to be your lucky day for this period.  And your Lucky Numbers are 01, 02, 06, 14, 22, 29.  I hope you'll make the best of them.\n\n\n\n\n\n\n\n\n\n\n\nJune 25th for Memo\n\n\n\n\n\n\n\n\n\n\n    Attachments to children or other young people may be strong today. They can remind you of your younger days and the fun you had in those \"good old days.\"\n\n\n\n\n\n\n\n    Family members and loved ones will appreciate your common sense approach to domestic matters.  You are capable of great patience and understanding now, as well.  Real estate ventures have potential now.\n\n\n\n\n\n\n\n\n\n\n    This is an excellent time for family planning sessions and for deep discussions on faith and the mysteries of life.  Your desire to be closer to a loved one will be granted through your own efforts.\n\n\n\n\n\n\n\n\n\n\n\n\n\nJune 26th for Memo\n \n \n \n \n \n\n \n \n    The stars tell me that your creativity is on a roll today, my dear. This can mean fun for you and for whomever is lucky enough to be entertained by your special talents.\n\n\n  \n \n \n    Children or young people may present you with a dilemma today.  Your creative ideas are not quite on target and will require some extra work and thought.  Avoid speculation now, my dear.\n\n \n \n\n \n \n\n\n\n\n    Taking up a new hobby could feel like a breath of fresh air.  It's important to cater to your curious side every now and then.  You've got unlimited potential, my dear; set some fresh goals.\n \n \n\n \n \n\n\n    A friend may seem a little demanding today.  Don't let it get to you, but don't feel you have to give in either.  Assert yourself and you will win their admiration for+B380 your self-respect.\n \n \n \n \n\n\n    Are there certain aspects of the social scene that make you uncomfortable?  You may feel inept when it comes to a particular relationship.  When you don't know what to say, be quiet.\n  \n\n\n\n\n\n\n\n\nJune 27th for Memo\n\n \n \n \n \n \n \n    The stars indicate that you can have fun in many ways today, and more so if you are with people you love and who make you smile.  I have every confidence in you.\n\n\n\n\n\n\n\n\n\n\nJune 28th for Memo\n  \n \n\n \n \n \n    The saying that \"nothing succeeds like success\" seems to apply to you today, my dear.  The stars indicate that good fortune can give your confidence a lift.\n\n\n\n\n\n \n \n    It may become necessary for you to give attention to the interests of the young today.  This can be a time for creative self-expression. You may also enjoy sports, outdoor activities or short distance trips.\n\n\n \n\n \n \n    Being too possessive with a loved one could drive a wedge between you. By encouraging this person to venture into new territory, you will cause your relationship to blossom and grow.  Try it.\n\n \n \n \n\n\n\n\n\n\n\n\nJune 29th for Memo\n  \n \n \n\n\n \n \n    Others may consider themselves fortunate to be able to work with you on a project, perhaps planning a surprise party, since you can organize the task in a way that makes good sense.\n\n\n \n\n\n \n \n    While this is likely to be a time for frolic and socialization, don't allow too much merriment, eating and drinking to negatively affect your health and personal well-being.  Be somewhat conservative.\n\n \n\n\n \n\n\n\n\n\n    Your energy level can be quite high now. Exercise can make you feel like doing more, and when you're finished you may feel much healthier. You'll also work with more zest.    \n \n\n\n\n\n\n\n\n\nJune 30th for Memo\n  \n \n \n \n \n \n    This is a wonderful day for beginning a new exercise program or a special health regimen which has been approved by your health care professional.  Look for ways to improve your efficiency at work.\n\n\n \n \n\n \n \n    If you feel your physical vitality or mental acuity is impaired, then perhaps you need to take stock of your personal agenda and rearrange some priorities today.  Put your health and well-being first.\n\n\n\n\n\n\n\n\n\n\nJuly 1st for Memo\n \n \n \n \n \n \n \n    Sometimes you just push yourself too far, because you are driven to accomplish as much as you possibly can.  Don't let yourself get over-exhausted today, dear one.  Take ample breaks.\n\n\n  \n\n \n \n    Offering a helping hand to a newcomer is a great way to start off your relationship.  It's so important to lend assistance to those in need. It makes the whole atmosphere seem lighter.\n\n\n\n\n\n\n\n\n\n    Next week, Memo, people could be a little touchy and overemotional.  You'll have to mind your P's and Q's!\n\n                       Best Regards, \n                        \n\n\n\n\n\n    If at any time you no longer wish to receive your weekly forecast, you can simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400, and I will stop emailing them to you. It's as simple as that. My only desire is to help you, Memo.\n\n"}