{"category": "ham", "to_address": "samba-technical@samba.org", "from_address": "\"Gerald (Jerry) Carter\" <jerry@samba.org>", "subject": "Samba 3.0.25rc2 Available for Download", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\n==============================================================\n               He has the most amazing ability to focus on the\n                             most mind-numbingly boring tasks.\n                                    -- mbp speaking about tpot\n==============================================================\nRelease Announcements\n=====================\nThis is the second release candidate of the Samba 3.0.25 code\nbase and is provided for testing only.  An RC release means\nthat we are close to the final release but the code may still\nhave a few remaining minor bugs.  This release is *not* intended\nfor production servers.  There has been a substantial amount\nof development since the 3.0.23/3.0.24 series of stable releases.\nWe would like to ask the Samba community for help in testing\nthese changes as we work towards the next significant production\nupgrade Samba 3.0 release.\n\nMajor features included in the 3.0.25 code base include:\n\n  o Significant improvements in the winbind off-line logon support.\n  o Support for secure DDNS updates as part of the 'net ads join'\n    process.\n  o Rewritten IdMap interface which allows for TTL based caching and\n    per domain backends.\n  o New plug-in interface for the \"winbind nss info\" parameter.\n  o New file change notify subsystem which is able to make use of\n    inotify on Linux.\n  o Support for passing Windows security descriptors to a VFS\n    plug-in allowing for multiple Unix ACL implements to running side\n    by side on the Same server.\n  o Improved compatibility with Windows Vista clients including\n    improved read performance with Linux servers.\n  o Man pages for IdMap && VFS plug-ins.\n\n\nOff-line Logons and AD Site Support\n===================================\n\nWinbind's capability to support offline logons has been greatly\nimproved with the 3.0.25 release including support for locating\ndomain controllers asynchronously using Active Directory Site\ninformation.\n\n\nNew IdMap Interface for Winbindd\n================================\n\nThe 3.0.25 release of Samba will include a rewritten IdMap interface\nfor winbindd which replaces the \"idmap backend\" parameter.  The\ninitial design document may be found at\n\n\thttp://www.samba.org/~idra/samba3_newidmap.pdf\n\nPlease refer to the \"idmap domains\" description in the smb.conf(5)\nman page for more details.\n\n\nDynamic DNS Updates\n===================\n\nThe \"net ads join\" command is now able to register the host's DNS\nA records with Windows 2000 SP4 and 2003 DNS servers.  This\nfeature must be enabled at compile time using the --with-dnsupdate\nwhen running the ./configure script.  There is also a related \"net\nads dns\" command for refreshing a host's records which could be\nlaunched from a dhcp client script when a new IP address is obtained.\n\n\nSupport for Additional ACL Modules\n==================================\n\nSamba's POSIX ACL support has been moved inside of the VFS layer\nwhich means it is now possible to support multiple ACL implementations\non the same server including NFSv4 and GPFS ACLs.\n\n\nVFS ReadAhead Plugin\n====================\n\nWindows Vista introduces pipe-lined read support for improved\nperformance when transferring files.  The new vfs_readahead plugin\nallows Linux file servers to utilize additional Kernel buffers\nfor caching files in order to avoid Disk I/O wait time when serving\nVista clients.  If you experience poor read performance between\nLinux servers and Vista clients, please test the vfs_readahead\nmodule by adding the following lines to the share definition\nin smb.conf:\n\n[file_share]\n\tvfs objects = readahead\n\nNote that this plugin will result in additional RAM requirements\ndue to the increased amount of kernel buffer caches used by smbd.\nPlease refer to vfs_readahead(8) for more information.\n\n\n================\nDownload Details\n================\n\nThe uncompressed tarballs and patch files have been signed\nusing GnuPG (ID 6568B7EA).  The source code can be downloaded\nfrom:\n\n\thttp://download.samba.org/samba/ftp/rc/\n\nThe release notes are available online at:\n\n\thttp://www.samba.org/samba/ftp/rc/WHATSNEW-3-0-25rc2.txt\n\nBinary packages will be made available on a volunteer basis from\n\n\thttp://download.samba.org/samba/ftp/Binary_Packages/\n\nOur Code, Our Bugs, Our Responsibility.\n(https://bugzilla.samba.org/)\n\n\t\t\t--Enjoy\n\t\t\tThe Samba Team\n\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.3 (GNU/Linux)\nComment: Using GnuPG with Mozilla - http://enigmail.mozdev.org\n\niD8DBQFGKzY5IR7qMdg1EfYRAob0AKDnWzLQHrUwr5nZE+gUe8DNv9POUACgvsy8\nZK4XOuzT/mj3I3FV4lLxMDA=\n=yC0T\n-----END PGP SIGNATURE-----\n\n"}