{"category": "spam", "to_address": "\"Subscriber\" <cruiseca@flax9.uwaterloo.ca>", "from_address": "\"Deeds 4 Profits\" <q_1du_vxp@qualityturtle.com>", "subject": "Seized Property Bargains In Your Town ", "body": "\n\n\n                <!--I was just able to get a few things,\" said Ed Stephan, 83, who helped his wife into their car as ashes fell from the sky. \"We're not too worried but want to get out of here and observe the law.\"\n\nAuthorities hoped residents would be able to return to their homes by evening.\n\nThe fire destroyed Dante's View, a trailside terraced garden on Mount Hollywood, said City Councilman Tom LaBonge.\n\n\"This is a very sad night for Los Angeles,\" he said.\n\nElsewhere in the region, a 300-acre fire near California State University at San Bernardino was 75 percent contained. There were no reports of damages or injuries.\n\nIn neighboring Orange County, a 140-acre fire in Featherly Regional Park and a 1,250-acre fire on a training range at Camp Pendleton were at least three-quarters contained.\n\nOn the East Coast, authorities evacuated about 300 homes in northern Florida as two fires totaling 130,000 acres — about 203 square miles — continued to rage on the Georgia-Florida line. Florida officials warned that they might soon need help if the blazes grow out of control.\n\nA 107,000-acre blaze in Georgia's Okefenokee National Wildlife Refuge was called the largest blaze in state history and was nearing part of the park that has served as a fire crew command post. Another fire 10 miles away covered 40,000 acres.\n\nThe smaller fire crossed into Florida on Tuesday and was threatening Taylor, a small town with one store and no cell phone coverage, said Baker County Sheriff Joey Dobson.\n\nIn the Midwest, a wildfire near the Canadian border in northeastern Minnesota had burned 16,266 acres since it was spotted Saturday. It destroyed around 40 buildings, including multimillion-dollar homes, and forced more than 100 people to evacuate. \n\nAuthorities said they believe it started at a campsite just outside the Boundary Waters Canoe Area. \n\n\"There are some houses up there where all there is left is the foundation,\" said Leif Lunde of the Cook County Sheriff's Department. No injuries were reported, but Lunde said about 30 of the burned buildings were homes or cabins. \n\n--!>   \n\n\n \n"}