{"category": "ham", "to_address": "debian-desktop@lists.debian.org", "from_address": "Rosaline Chan <enr@norcastonline.com>", "subject": "financier literal", "body": "CAON UP 45% In The Last Week!\n\nChan-On International Inc.\nSymbol: CAON\nClose: $0.80 UP\n\nCAON continues to climb daily. Up 45% in the last 7 days as investors\nare excited about this company's new direction. Read the releases,\nconsider the potential and get on CAON first thing Thursday!\n\n\" in which they provide several complete work environments for download.\n\nI mean really detailed, like to a point you can even get usage tips.\n\nAnd best of all you can save your customized preferences under a\nspecific user preference template that can even transfer from version to\nversion.\n\n\"Enhanced Navigator\" just shows the new tools. And the old bugs are\nstill there, unresolved.\n\nAll rights reserved worldwide.\n\nLooking forward to getting started with it.\nI was just wondering if there were particular bugs known to remain in v.\nWas something missing that I didn't see?\n\nHas anyone found a comprehensive list of changes - not the marketing\nlist of new features but something more comprehensive that would list\nbug-fixes? Looking forward to getting started with it. I've not had any\nproblems.\nThe best you can do is keep a look-out for problems via this forum.\n\nThe best you can do is keep a look-out for problems via this forum. I'll\nbe a brand new Archicad user after many years of autocad. Updates should\nbe the goal to address isssues brought up in the forums and version\nreleases should be issued only when new technology makes it useful to do\nso. This seems based on investor relations and not end-user needs.\n\" in which they provide several complete work environments for download.\n\nAnd the old bugs are still there, unresolved. Go to ArchicadWiki - the\nArchicad Knowledge Base History RSS  Etiquette FAQ Search Memberlist\nRegister Profile Log in to check your private messages Log in          .\nOf course if that doesn't suit you either, just change it!\n\nAnd best of all you can save your customized preferences under a\nspecific user preference template that can even transfer from version to\nversion. This seems based on investor relations and not end-user needs.\nThat's why they give you he options to customize it as you please and\nsee fit. That's the real use of a Wiki.\n\nHas anyone found a comprehensive list of changes - not the marketing\nlist of new features but something more comprehensive that would list\nbug-fixes? I ordered it last week and just got word that it was shipped\nout last night. I would currently stick with XP for production-use.\n\nArchiCAD-Talk :: View topic - v.\n\nAnd the old bugs are still there, unresolved. \" in which they provide\nseveral complete work environments for download.\n'Essential' new features can just as easily be interpreted as\nshortcomings of the previous version.\n\n\" in which they provide several complete work environments for download.\n\nWas something missing that I didn't see?\nI was just wondering if there were particular bugs known to remain in v.\n\nOf course if that doesn't suit you either, just change it! If you open\nthe pdf with Illustrator, Illustrator can not read the letters from PDF.\n\nI've looked at the Wiki as well but there seems to be little on v. AC\nshould encourage keyboard shortcuts since ultimately that will inprove\nthe end-users experience and productivity.\nI have been browsing and will continue to do so of course. \" in which\nthey provide several complete work environments for download. I have\nfound that Ben's enviroment is layout out much better.\n\nI have found that Ben's enviroment is layout out much better.\n\nWhat I hope AC doesn't turn into is something that only a specialist can\nfigure out. This seems based on investor relations and not end-user\nneeds.\n\nArchiCAD-Talk :: View topic - Will Nemetschek kill Archicad? AC should\nencourage keyboard shortcuts since ultimately that will inprove the\nend-users experience and productivity. Was something missing that I\ndidn't see?\nI've searched with no success.\n\nEverybody needs an excuse to stay out of the sun in summer. It is often\nthe most simple improvements that require the greatest amount of\nreprogramming. And best of all you can save your customized preferences\nunder a specific user preference template that can even transfer from\nversion to version.\n\nI hope that ArchiCAD does mature in a way that makes the interface\neasier to use.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}