{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Morning HTML\" <cbsnews_weekday_morning_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 18, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESVirginia Tech Bands Together To Heal\nThe Virginia Tech community spent Tuesday remembering the 32 victims of the deadliest shooting in U.S. history. As the campus\n                        paid tribute, gruesome details unfolded about the student gunman. More...Watch: Stories Of Survival\n• Guns Used In Rampage Traced To Va. Shops\n                     \t\t\t\t\t| Watch• More Charges Against Kidnapping Suspect• List Of Virginia Tech Shooting VictimsU.S.Tales Of Heroism, Death And Survival\nWhile authorities have not yet released a full list of the Virginia Tech victims, stories of survival, death, and also heroism\n                        are emerging. Cynthia Bowers reports. More...Watch: Stories Of Survival\n• Virginia Tech Bands Together To Heal\n                     \t\t\t\t\t| Watch• Gunman's Background Check Came Back Clean\n                     \t\t\t\t\t| Watch• Natural Balance Recalls Pet Food• More StoriesWorldS. Korea Remembers Cho Family\nSouth Korean President Roh Moo-hyun held a special meeting with aides Wednesday to discuss the Virginia Tech shooting, as\n                        the public expressed shame over a South Korean being identified as the gunman. More...Watch: How The Deadly Day Began\n• Missing Peace Corps Teacher Feared Dead• Murder Charges Against Marine Dropped• France Knew Of Hijack Plot Before 9/11• More StoriesPoliticsMore Gun Control? Don't Hold Your Breath\nIn the wake of the Virginia Tech shootings, a few Democrats renewed the call for gun control legislation, but there is a widespread\n                        perception among political strategists that the issue has been a loser in recent campaigns. More...Watch: Massacre Fuels Gun Debate\n• Bush Joins Mourners At Virginia Tech\n                     \t\t\t\t\t| Watch• New FEMA Hurricane Plan Won't Be Ready• N.J. Governor's SUV  Was Going 91 MPH• More StoriesHealthMarijuana May Fight Lung Tumors\nTHC, the active ingredient in marijuana, may help combat lung cancer, new research suggests. More...\n• First Bird Flu Vaccine For Humans OK'd• Aspirin May Protect Against Cancer• Natural Balance Recalls Pet Food• More StoriesSciTechProfessor's Webcam May Have Saved Lives\nAs a deadly gunman was firing at students and professors at Virginia Tech, one quick-thinking professor used a Webcam to give\n                        trapped students a view of the outside world. Harold Dow explains.  More...Watch: Professor Recounts Shooting\n• Text Messages Can Get The Word Out Fast• Digital Tributes Honor Virginia Victims\n                     \t\t\t\t\t| Watch• An Outpouring Of Online Grief\n                     \t\t\t\t\t| Watch• More StoriesBusinessNatural Balance Recalls Pet Food\nNatural Balance Pet Foods recalled two kinds of pet food after receiving reports of animals vomiting and experiencing kidney\n                        problems, the Food and Drug Administration said. More...\n• Financial Protections For U.S. Troops• Yahoo Expands Partnership With Newspapers• Internet Phone Service: Another Option• More StoriesEntertainmentParis Hilton Ordered Back To Court\nCity prosecutors in Los Angeles are seeking to revoke Paris Hilton's probation, which could result in a sentence up to 90\n                        days in jail. More...Watch: Paris' Not-So-Simple Life\n• Dave Chappelle Breaks Comedy Club Record\n                     \t\t\t\t\t| Watch• Bermuda Cut From O'Donnell's Gay Cruise• A New Epic Of Middle-Earth• More StoriesOpinionSeeing Through The Smoke\nSpecial Contributor Lloyd Garver pleads for compassion for a downtrodden, often overlooked minority, people who are\n                        often the victims of discrimination. All that's missing is the telethon. More...\n• Thinking About The Unthinkable\n                     \t\t\t\t\t| Watch• Fixing Campus Security\n                     \t\t\t\t\t| Watch• U.S. Military Dangerously Small\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTS48 Hours: Gunman's Background Check Came Back Clean\nErin Moriarty talks to the owner of the shop that sold one of the murder weapons used in the Virginia Tech massacre\n                        and finds out from a law enforcement official why that type of gun can be so lethal. More...Watch: The Weapon Cho Used\n• 48 Hours: Lessons Learned From School Shootings\n                     \t\t\t\t\t| Watch• 48 Hours: Virginia Tech: A Nation Mourns\n                     \t\t\t\t\t| Watch• CBS Evening News: Anatomy Of A Two-Hour Rampage\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nVa. Tech: Anatomy Of A RampageIn Full: In the wake of the deadliest shooting rampage in U.S. history, authorities are trying to establish a motive.\n                                    \"48 Hours\" has a special report on the Virginia Tech massacre.\nTOP VIDEOS\nStories Of Heroism Emerge\nCountry Mourns With Va. Tech\nWere There Warning Signs?\nAn Eyewitness To The Shooting\nA Sequence Of Monday's Events\nThe Weapon Cho Used\nNo Clear Motive For Killings\nRemembering Those We Lost\nProfessor Recounts Shooting\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesThe exonerated Duke lacrosse students give their first interview to Lesley Stahl, just days after all remaining charges\n                           against them were dropped. Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryThe Puppet Master:A couple is gunned down, the triggerman is known. But who was pulling the strings behind the\n                           scenes? Troy Roberts reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}