{"category": "ham", "to_address": "Ranjan Maitra <maitra@iastate.edu>", "from_address": "jiho <jo.irisson@gmail.com>", "subject": "Re: [R] displaying intensity through opacity on an image (ONE\n\tSOLUTION)", "body": "On 2007-May-19  , at 15:08 , Ranjan Maitra wrote:\n> On Sat, 19 May 2007 22:05:36 +1000 Jim Lemon   \n> wrote:\n>> Ranjan Maitra wrote:\n>>> ...\n>>> (we are out of R).\n>>>\n>>> And then look at the pdf file created: by default it is Rplots.pdf.\n>>>\n>>> OK, now we can use gimp, simply to convert this to .eps.  \n>>> Alternatively on linux, the command pdftops and then psto epsi on  \n>>> it would also work.\n>>>\n>>> Yippee! Isn't R wonderful??\n>>>\n>> Sure is. You could probably save one step by using postscript()  \n>> instead\n>> of pdf() and get an eps file directly. The reason I didn't answer the\n>> first time is I couldn't quite figure out how to do what you wanted.\n>\n> Thanks, Jim! Not a problem, But will postscript() work? I thought  \n> that help file said that only pdf and MacOSX quartz would work (at  \n> the time it was written).\n>\n> It certainly does not work for me on the screen.\n>\n> Btw, I made an error in writing the previous e-mail: the command to  \n> convert to .eps from .ps is ps2epsi.\n\nI haven't followed the discussion from the beginning but,  \nindependently of R, some image formats support transparency while  \nothers don't. PDF supports transparency but EPS and PS don't. So you  \ncan't expect R's postscript() device to support it (and you will  \nloose it when converting a pdf to and eps or a ps file). SVG support  \ntransparency beautifully and you'll be able to edit it with Inkscape  \n(which is cross platform). R can produce SVG thrhough the package  \nRSvgDevice.\nFurthermore, if you open a PDF (or any vector based format such as  \nEPS or PS) with Gimp it will \"rasterize\" it: convert the vector  \ninformation to pixels. You'll be able to save it to many formats but  \nit will still be pixel based (zooming on it will reveal pixels while  \nit's not true with vector based formats).\nhttp://en.wikipedia.org/wiki/Vector_Graphics\nhttp://en.wikipedia.org/wiki/Raster_graphics\n\nHope that helps.\n\nJiHO\n---\nhttp://jo.irisson.free.fr/\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}