{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Lifestyle Newsletter May 24, 2007", "body": "\nhowstuffworks® | lifestyle May 24, 2007\nRSS\n \n How \"Gracie\" Works  How far would you go to achieve a dream? Inspired by real\nevents in the lives of actors Elisabeth and Andrew Shue and directed by the Academy\nAward-winning director of \"An Inconvenient Truth,\" \"Gracie\" tells the\nstory of a teenage girl's struggle to play soccer at a time when there were no\nfemale soccer leagues. Watch exclusive behind-the-scenes videos of \"Gracie\" and\nmeet its cast and crew.\nAlso at HowStuffWorks\n \nHow Soccer \nWorks - Soccer, \"the \nbeautiful game,\" has been captivating fans for more than 100 years. Hundreds of \nmillions of people watch the World Cup, the greatest spectacle for the world's \nmost popular sport. In this article, learn some of soccer's rich history, the \nrules of the game and how soccer is enjoyed in other \ncountries.\n\n\n \n\nHow Sudoku Works - If you've been in a book store in the last six months -- or\nan airport, waiting room or college lecture class -- you've probably seen\nsomeone staring at a sudoku. The sudoku fad doesn't seem to be waning. Find out\nthe history of this surprisingly addictive math puzzle and how it works.\n \n\nHow Movie Download Services Work - Until recently, downloading movies usually meant breaking\ncopyright laws. But in the past year a spate of services has appeared offering\nmovie download services. In this article, learn how movie download services\nwork and find the right service for you.\n   \nThis Week's Video\n How PlayStation 3 Works - The PS3 boasts an incredible microprocessor, a brand-new\ngraphics processor and what may be some of the most phenomenal on-screen images\never. In this video from HowStuffWorks, learn all about PlayStation 3 and check\nout its incredible graphics.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved"}