{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 93", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. La pen?ltima, La ?poca de los ladrones cultos\n      (Museum Security Network Mailing list)\n   2. Investigan el robo de piezas de arte religioso en una iglesia\n      de Honduras (Museum Security Network Mailing list)\n   3. Roban biblia del siglo XVI de santuario en Honduras\n      (Museum Security Network Mailing list)\n   4. Government-backed company claims all Nazi loot from museums\n      (Museum Security Network Mailing list)\n   5. Reward Offered For Family Heirlooms Stolen From Nova Scotia\n      Residence (Museum Security Network Mailing list)\n   6. MyThings Launches Online Registry of Belongings in the US at\n      MyThings.com (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Tue, 17 Apr 2007 20:00:31 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] La pen?ltima, La ?poca de los ladrones cultos\nTo: Museum Security Network Mailinglist \nMessage-ID: <46250B3F.2010709@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n\n        La pen?ltima\n\n\n    La ?poca de los ladrones cultos\n\n------------------------------------------------------------------------\n*Enrique Naveda *\nEl 21 de agosto de 1911 Vincenzo Peruggia, un trabajador del Museo del \nLouvre, ocult? la Gioconda bajo su abrigo y atraves? satisfecho las \npuertas del edificio. En esos instantes, que lo convert?an en un \npersonaje legendario, tal vez pensaba en el agradecimiento que le deb?a \nal marqu?s de Valfierno, inductor y cerebro del plan, sin saber que este \nlo traicionar?a. La Mona Lisa apareci? dos a?os despu?s, pero el robo se \nconvirti? en uno de los m?s memorables de la historia del arte.\n\nA nivel mundial, el oficio de ladr?n de arte se ha vuelto la tercera \nactividad ilegal m?s lucrativa. Se calcula que el mercado negro maneja \nalrededor de US$5 millardos al a?o. Seg?n un estudio realizado por \nInterpol en 2000, solo el narcotr?fico y el trasiego ilegal de armas lo \nsuperan.\n\nM?xico, con 200 sustracciones anuales, seg?n su Instituto Nacional de \nAntropolog?a e Historia, es uno de los pa?ses que m?s lo padecen.\n\nEn lo que va del a?o, en Guatemala el Ministerio de Cultura y Deportes \nha conocido el robo de im?genes religiosas de la ?poca colonial, y en el \n?ltimo lustro la cifra asciende a 254 piezas sustra?das.\n\nSin embargo, la estad?stica no es completa, reconoce ?scar Mora, jefe de \nla Unidad de Prevenci?n y Control del Tr?fico Il?cito de Bienes \nCulturales de esa dependencia. Las fuentes de informaci?n y denuncia del \nente son precarias.\n\nEl mercado de bienes culturales guatemaltecos es variado, y en general \nlas piezas se reparten por Estados Unidos y Europa. Las posibilidades de \nrecuperar una pieza dependen mucho de su movimiento en el mercado negro, \nexplica Mora, y a?ade que hay obras que se recuperan en cinco d?as y \notras en cinco a?os.\n\nPero tambi?n hay unas terceras que no se recuperan nunca: los \ncoleccionistas, sean nacionales o extranjeros, mantienen la obra oculta, \nen su cat?logo privado y fuera del conocimiento p?blico.\n\nCuando eso ocurre es complicad?simo localizarlas. Aunque gran parte de \nlos intermediarios que se dedican a vender arte robado conocen a los \ncoleccionistas y eso facilita la transacci?n, muchas veces se ubican las \nobras en el momento en que se trata de venderlas o van a cambiar de manos.\n\nA escala internacional la Interpol es la responsable de coordinar la \nb?squeda. En los ?ltimos a?os se han reforzado las aduanas, se emplean \nlocalizadores satelitales y se cre? un registro de obras de arte \ndesaparecidas, el Art Loss Register, el cual sirve a museos, casas de \nsubastas, polic?a y coleccionistas para averiguar si la obra que se les \ntrata de vender es robada.\n\nEn Guatemala, cuatro personas est?n condenadas y una m?s espera \nsentencia. El C?digo Penal establece prisi?n de 6 a 15 a?os.\n\nLos coleccionistas, a menudo gente acaudalada con un nivel cultural \nalto, justifican muchas veces sus compras con el argumento de que ellos \nlas conservar?n mejor que un museo. Y seguramente es cierto, admite \nMora, se trata de bienes p?blicos que ellos vuelven privados, y por otra \nparte, robar arte o vestigios arqueol?gicos es sustraerle una pieza al \nrompecabezas de la memoria colectiva de un pa?s.\n\nRecientemente, un coleccionista reconoci? ante el Ministerio de Cultura \nhaber pagado Q25mil por un bien arqueol?gico. ?Estoy seguro de que esa \npieza en el mercado internacional habr?a alcanzado valores mucho m?s \naltos?, asegur? Mora.\n\nGuatemala, domingo 15 de abril de 2007\n\nhttp://www.elperiodico.com.gt\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Tue, 17 Apr 2007 20:01:43 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Investigan el robo de piezas de arte religioso en una\n\tiglesia de Honduras\nTo: Museum Security Network Mailinglist \nMessage-ID: <46250B87.4060702@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nhonduras-patrimonio\nInvestigan el robo de piezas de arte religioso en una iglesia de Honduras\nLas autoridades de Honduras investigan el robo de al menos media docena \nde objetos de arte religioso ocurrido el fin de semana pasado en un \ntemplo cat?lico del oeste del pa?s, informaron hoy fuentes judiciales.\n\nEl hecho se registr? en la comunidad de Macholoa, departamento de Santa \nB?rbara, unos 340 kil?metros al noroeste de Tegucigalpa, dijeron fuentes \ndel Ministerio P?blico, cuya Fiscal?a de Etnias y Patrimonio Cultural ha \nabierto la investigaci?n.\n\nLos saqueadores se llevaron la corona de plata, dos aretes y dos cadenas \nde oro de la virgen de Santa Luc?a, la patrona de Macholoa, as? como un \ncrucifijo tambi?n de oro.\n\nLas fuentes dijeron a Acan-Efe que no se ha confirmado si tambi?n fue \nrobada una biblia que, seg?n versiones de prensa, data de 1537.\n\nEl robo ocurri? en la noche del s?bado y fue descubierto el domingo en \nla ma?ana.\n\nPobladores de Machaloa dijeron a la prensa que el viernes lleg? a la \ncomunidad un hombre desconocido a bordo de un autom?vil y pregunt? d?nde \nquedaba la iglesia, y el s?bado aparecieron otros dos extra?os, quienes \ntomaron fotos del templo.\n\nSeg?n la prensa local, este es el tercer saqueo de objetos que se \nregistra en el mismo templo; en las dos ocasiones anteriores, los \nladrones se llevaron cuatro im?genes de santos y v?rgenes.\n\nLas autoridades hondure?as no han podido contener los robos de piezas de \narte religioso que frecuentemente se producen en el pa?s.\n\nSin embargo, en enero pasado la Fiscal?a y la Polic?a decomisaron, en \ndistintas operaciones ejecutadas en Tegucigalpa, 17 piezas religiosas \nsupuestamente robadas de varios templos.\n\n\nTerra Actualidad - EFE\n\nListado de fotograf?as\n\nFoto 1: /addon/img/feed/actualidad/20070417/72164cfa366d6p.jpg \nInvestigan el robo de piezas de arte religioso en EFE\n\nhttp://actualidad.terra.es/\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Wed, 18 Apr 2007 11:51:34 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Roban biblia del siglo XVI de santuario en Honduras\nTo: Museum Security Network Mailinglist \nMessage-ID: <4625EA26.2030009@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\n    Roban biblia del siglo XVI de santuario en Honduras\nmartes, 17 de abril del 2007 11:22\nUna biblia que est? escrita en lat?n y fue trasladada de Espa?a a \nHonduras en 1537 fue robada de un templo cat?lico en el oeste del pa?s \ncentroamericano, dijeron la polic?a y responsables del recinto religioso.\nEl asalto habr?a sido cometido por dos hombres la madrugada del domingo \nen Macholoa, unos 200 kil?metros al oeste de Tegucigalpa.\n\n\"Los sujetos llegaron el s?bado al pueblo y me pidieron que les mostrara \nla biblia... y lo hice\", dijo en rueda de prensa la encargada del templo \nAmparo Reyes. \"Y la Biblia ya no estaba al d?a siguiente en la urna de \nvidrio que la proteg?a\", agreg?.\n\nSeg?n Reyes, los individuos forzaron con una barra de metal la puerta \ntrasera del templo, se introdujeron al lugar, sustrajeron varios \nart?culos incluidos varios objetos de arte sacro y huyeron. Robaron \nadem?s una corona de plata de la patrona cat?lica Santa Luc?a, sus \naretes y un crucifijo de oro, as? como amplificadores de sonido y un \njuego de cortinas regaladas que estaban en una maleta.\n\nLa polic?a dijo en un comunicado que investiga de manera intensa la \nsituaci?n y se?al? que las reliquias sustra?das son vendidas a \ncoleccionistas extranjeros.\n\nEs la tercera vez en dos a?os que la iglesia de Macholoa es saqueada. \nLos sacerdotes del templo viven en comunidades cercanas y en el pueblo \nno hay polic?as.\n\nEl templo de Macholoa fue construido en 1537 por los conquistadores \nespa?oles. Desde el 2005 han sido saqueados al menos 30 templos \ncat?licos en seis provincias de Honduras: Santa B?rbara, Ocotepeque y \nLempira, al oeste; Francisco Moraz?n y Comayagua, en el centro, y El \nPara?so, al este del pa?s.\n\nwww.24horaslibre.com\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Wed, 18 Apr 2007 11:51:42 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Government-backed company claims all Nazi loot from\n\tmuseums\nTo: Museum Security Network Mailinglist \nMessage-ID: <4625EA2E.1030600@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nGovernment-backed company claims all Nazi loot from museums\n\nIf heirs cannot be found, the intention is to sell the works with \nproceeds going to Holocaust survivors\n\nBy Lauren Gelfond Feldinger | Posted 18 April 2007\nJERUSALEM. An Israeli Holocaust restitutions com?pany is asking museums \nin Israel to hand over all unclaimed Nazi-looted art and objects held in \ntheir collections, starting with the Israel Museum in Jerusalem.\n\nSince 1951, Israeli museums have held unclaimed works of art seized from \nEuropean Jews by the Nazis.\n\nBut survivors of the Holocaust and heirs of Nazi victims still do not \nknow the full extent of works held in Israeli institutions, says Avraham \nRoet, the director of the Company to Locate and Return Assets to \nHolocaust Survivors. ?It?s been 60 years; survivors are dying daily, how \nmuch longer can they fight [for the recovery of their property]?? asks \nMr Roet, himself a Holocaust survivor.\n\nSince the assets recovery company was launched in November, it has \nfocused on recovering land and money held by Israeli institutions but is \nnow also focusing on the restitution of art and objects.\n\nMr Roet says that once he is in possession of works handed over by \nIsraeli museums, his company is legally entitled to sell these to raise \nmoney for Holocaust survivors, if original owners or heirs cannot be \nfound. Financed by government loans, the assets recovery company is \nexpected to repay the loans in full using up to two percent of recovered \nassets, though it opposed this arrangement.\n\nIsrael Museum officials in Jerusalem say they were surprised to receive \na letter from the assets recovery company a few weeks ago, demanding \nevery unclaimed Holocaust-era object and work of art. ?We are now \nstudying the legislation,? says museum director James Snyder. He argues \nthat no organisation can preserve, exhibit and publish works of art \nbetter than a museum.\n\nSince its founding in 1965, the Israel Museum has held some 550 \npaintings, drawings and prints, and several hundred Judaica objects \nlooted by the Nazis from European Jews. These were shipped to Israel in \nthe early 1950s by the Jewish Restitutions Successor Organizations \n(JRSO), an umbrella organisation consisting of American, European and \nmandatory-Palestine Jewish associations. The JRSO was named custodian of \nunclaimed Nazi-looted properties at the 1946 Paris Reparations Conference.\n\nTwo hundred of the JRSO paintings and drawings at the Israel Museum were \noriginally in the collection of the Berlin Jewish Museum, destroyed \nduring the war, though the Israel Museum has placed many of these on \nlong-term loan to the new Jewish museum in Berlin, designed by Daniel \nLibeskind.\n\nOf the Israel Museum?s additional 350 Nazi-looted works of art with no \nownership records, the most important and best preserved paintings are \neither on display or on loan, including Egon Schiele?s Krumau-Crescent \nof Houses, 1915, and Marc Chagall?s Praying Jew, 1914. Fifty of the JRSO \nJudaica items are currently on display. According to the museum, most \nworks that are currently in storage arrived in poor condition and are of \nlittle art historical value.\n\n?It?s important for us to continue to hold these works. Museums are \nappropriate venues for such custodianships, and in this case we were \ncharged to be custodians,? says Mr Snyder. ?JRSO made a point of \ndistributing cultural property with no prior ownership records to be \nheld for the public good. The Egon Schiele, for example, belongs in a \nmuseum setting?especially in Israel?where it can be appreciated by the \npublic.?\n\nAccording to the Israel Museum, the arrival of the JRSO works in Israel \nwas publicised at the time and resulted in the restitution of some \nworks. To date, the museum has returned some 20 JRSO works to heirs of \nNazi victims.\n\nThe museum has also returned two works it had not received from JRSO: an \n1897 Pissarro painting and an 1898 Degas drawing.\n\nBecause of an Israeli law enacted in January 2006 to create the assets \ncompany, Mr Roet believes that the JRSO mandate has now been superseded \nand the Israel Museum must list and display all works which could be \nclaimed by Holocaust survivors or their heirs regardless of the works? \nvalue or condition before handing them over.\n\nLast month officials from the company and the Israel Museum met for the \nfirst time. The museum is continuing to catalogue its JRSO material, \nanticipating publication, and will share this information with the \ncompany, which will also make it public, says Mr Snyder.\n\nA company official says that an inventory of the works in the Israel \nMuseum would only be ?a first step?.\n\nhttp://www.theartnewspaper.com\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Wed, 18 Apr 2007 11:51:46 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Reward Offered For Family Heirlooms Stolen From Nova\n\tScotia\tResidence\nTo: Museum Security Network Mailinglist \nMessage-ID: <4625EA32.5070301@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nReward Offered For Family Heirlooms Stolen From Nova Scotia Residence\n\nMills Village, Queens Co., Nova Scotia, Canada:Up to $1,000 is being \noffered by the owners for information resulting in the arrest and \nconviction of individuals involved in the break-in of a residence here \nand the recovery of the substantial number of family antiques removed \nfrom the premises.\n\nThe break-in occurred some time between December 25 and March 1. The \ncrime is being investigated by the RCMP Queens Detachment.\n\nReported missing are: an oil painting of Joseph Currier in gold leaf \nframe; an oil painting of Katherine Currier Jones; a tiptop black table \nwith mother-of-pearl inlay; brass student oil lamp missing yellow shade; \nred glass vase; small black and white cow pitchers; large and small \nporcelain soup tureens of cows with flower garlands; large picture of \nAsenath Campbell under glass gold leaf frame 1870 photo portrait; family \nembroidered sampler by Asenath Mack Campbell; small ceramic figurine of \nlady; Chinese turquoise porcelain horse; brass lamp with two yellow \nshades originally oil converted to electric operation; and an Eskimo \ncarving gray soapstone.\n\nAlso reported missing is Inuit carving seal hunter; various porcelain \nitems; two red vases; mug; fishing boy figurine; birch bark moose call; \nVictorian ball and claw spindle top stool; Old Ironsides print framed \nbehind glass; framed old sampler: \"God is Love\"; several hooked rugs; \nCheticamp needlepoint rug; needlepoint view from Shelburne House by Lila \nWebb; framed envelope to C.H. Jones from Admiral Byrd; Masons member \ncertificate for John Campbell; mahogany framed mirror; medium sized \nmahogany writing chest; brass candleholder; lithograph print; \ncommemorative long leather strap with brass medallions (George VI, \nEdward VIII); and a pewter tea service.\n\nAnyone who has seen any of these items, please contact the RCMP Queens \nDetachment at 902-354-5721. File number is 2007-220959.\n\nhttp://antiquesandthearts.com/\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Wed, 18 Apr 2007 11:51:56 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] MyThings Launches Online Registry of Belongings in the\n\tUS at\tMyThings.com\nTo: Museum Security Network Mailinglist \nMessage-ID: <4625EA3C.8010500@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nMyThings Launches Online Registry of Belongings in the US at MyThings.com\n\n2007-04-17 21:09:14 -\n\nMENLO PARK, Calif., April 17 /PRNewswire/ -- MyThings, the global online \nregistry of belongings, today announced it has formally launched its \nconsumer website in the United States at MyThings.com. Introduced \ninitially in the UK in December 2006, MyThings is the only web service \nto provide a true one-stop shop for managing and protecting valuable \nbelongings.\n\n\"Say goodbye to your shoebox filled with receipts, warranties, and \nmanuals -- and say hello to a secure and free web service from \nMyThings,\" says MyThings CEO, Benny Arbel. \"We are thrilled to roll out \nthe MyThings service in the US. By collecting all their important \nownership information in one place, consumers get the control and peace \nof mind to enjoy the things they love most.\"\n\nBy creating a MyThings Portfolio on MyThings.com, consumers will be able \nto track the vital statistics of their belongings, as well as tap \nadditional member benefits ranging from finding accessories and \naccessing product information, to downloads, warranties, insurance, and \nfree valuations. These benefits help consumers manage and protect their \nvaluables so they can get the most out of what they own.\n\nOn MyThings, consumers will find: -- Community generated content\nThrough MyThings Valuation, a unique appraisal service, members can \nsubmit their fine arts, antiques, and collectibles to designated \nspecialists for free appraisal online-in effect, it's \"Antiques \nRoadshow(R) meets Web 2.0\". MyThings Valuation combines the informative, \nentertaining format of the television series with the power of community \non the web. In addition, users can exchange useful information about \ntheir things through comments, messaging, forums, and stories.\n\n-- Third party content\nMyThings also brings a wide range of content and services to its members \nand visitors through partnerships that support shopping, product \ninformation, and market value data. For example, Terapeak provides the \nprice of all items sold on eBay for the past 30 days; CNET Channel \nprovides product descriptions and images for consumer electronics; and \nBecome.com lists compatible accessories with online shopping and pricing \ninformation.\n\n-- MyThings inventory\nThe MyThings Portfolio is the easiest and fastest way for a consumer to \nbuild and track an inventory of their valuable belongings. At the online \npoint of sale, MyThings automatically enters product and purchase \ndetails into the member's portfolio. For items added directly by the \nconsumer, MyThings assists with content from product databases. Ongoing \nengagement is based on items within the portfolio, where consumers share \ncomments and MyThings partners offer relevant services and deals.\n\nSince December 2006, MyThings has been demonstrating consumer acceptance \nby pre-populating portfolios at the point of sale with major online \nretailers and OEMs in the UK, such as Tesco Direct, Casio, Halfords, \nJessops, and Goldsmiths. MyThings' API for partners allows direct \ninsertion of important purchase details like the item name, description, \nimage, brand, model, serial number, purchase location, date, and price. \nNot only do consumers benefit from having this information at hand \nwhenever it's needed, MyThings' partners also benefit from highly \ntargeted installed base marketing programs that drive customer loyalty \nand marketing ROI.\n\nToday's launch also kicks off the MyThings Show & Tell contest. The \ncontest showcases MyThings Valuation by selecting the most fascinating \nstory of an item submitted for valuation each week and featuring it on \nthe MyThings homepage. The best of the weekly winners will win the grand \nprize: a trip to London or New York City for two, accommodations at the \nFour Seasons Hotel, and a visit to a live auction at Christie's, \nSotheby's, Bonhams, or Phillip with one of the MyThings Valuers. The \nValuation feature and contest are available to users worldwide.\n\n\"Consumers are telling us that there is immediate value in populating \nportfolios automatically at the point of sale, as proven by the high \nconversion rates for new members who join us from our retail and OEM \npartners,\" continues Arbel. \"The utility of capturing a digital receipt \nonline is well-matched by the engaging elements of MyThings Valution, \nMarket Value Estimator, and of course, the Show & Tell contest. Who \ndoesn't have something hidden away in their attic or in plain sight with \na story to tell?\"\n\nAbout MyThings Inc.\nMyThings Inc. offers MyThings (MyThings.com) and Trace (Trace.com), two \nunique services designed to help people manage and protect their \nbelongings, giving them control and peace of mind. MyThings is a \nconsumer web service that provides secure online portfolios for managing \nbelongings, as well as relevant information and services, including \nvaluations, accessories, insurance, and warranties. MyThings serves as a \ntrusted intermediary between buyers and sellers, delivering desired \ninformation without compromising the privacy of consumers or subjecting \nthem to intrusive messages.\n\nTrace is MyThings' online database of lost and stolen valuables. It is \nalso the most diverse global registry of lost and stolen items, ranging \nfrom art and antiques, to jewelry, watches, and consumer electronics. \nTrace integrates information from over 50 sources, including local, \nnational, and international law enforcement, plus members of MyThings.\n\nFounded in 2004, MyThings has offices in Menlo Park, California; London, \nEngland; and Tel Aviv, Israel.\n\nNOTE: MyThings is a trademark and Trace a registered trademark of \nMyThings, Inc. Antiques Roadshow, Terapeak, CNET Channel, Become.com, \nTesco Direct, Casio, Halfords, Jessops and Goldsmiths are registered \ntrademarks of their respective companies.\n\nhttp://www.pr-inside.com\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 93\n***************************************\n\n"}