{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "10p 4/17 Update: NASA reassesses Williams' status", "body": "\n\n\n\n\n10p 4/17 Update: NASA reassesses Williams' status\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 10\nPosted: 09:00 p.m. EDT, 04/17/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-07 (04/05/07): NASA managers order shuttle propulsion system inspections\n   SR-08 (04/10/07): NASA hopes to launch Atlantis, with repaired fuel tank, around June 8\n   SR-09 (04/17/07): NASA updates shuttle manifest\n   SR-10 (04/17/07): NASA managers reassess Williams' status, mission duration\n\n=================================\n\n09:00 p.m., 04/17/07, Update: NASA managers reassess Williams' status\n\nNASA managers are reassessing whether to leave astronaut Sunita Williams aboard the international space station until August, a longer-than-planned stay because of a shuttle launch delay, or to bring her home aboard the Atlantis when fights resume in June, sources say.\n`\nWilliams was launched to the station aboard the shuttle Discovery in December. She originally planned to return to Earth aboard the shuttle Endeavour in June, after the flight of Atlantis in March. But Atlantis was grounded by hail damage to the ship's external tank and the March launch has been delayed to no earlier than June 8. As a result, Endeavour's launch has slipped to Aug. 9 and along with it, Williams' ride home.\n\nBill Gerstenmaier, NASA's chief of spaceflight operations, said during a news conference April 10 that barring major problems, Williams would come home in August aboard Endeavour as planned. He said the impact of additional exposure to space radiation was minimal.\n\nSources, however, said Tuesday NASA is revisiting the issue but a timetable for making a final decision was not known.\n\nFor her part, Williams said during an earlier interview she was not overly concerned about increased exposure to space radiation or any other aspects of a longer-than-planned stay in space.\n\n\"Well, you know, I've been in constant contact with my flight surgeon and he's keeping me up to date on the concerns we have,\" she told reporters during a news conference April 10. \"I think eight months is fine from all the indications I've heard, we're at a time right now where we're not getting too much extra radiation from activity on the sun. So I think right now, all indications say that's no problem.\"\n\nDuring an interview Monday evening, she was asked again whether she might come home early.\n\n\"I think, actually, the jury is out on that,\" she said. \"I think they are debating this week when to bring me home - on the next shuttle or the shuttle after that. So it is up in the air. That's just par for the course. I have a Navy background and been on deployments that have been extended and shortened. It's no big deal.\"\n\nWhatever happens, she said, \"I'm happy to stay, I'm happy to go home early and get Clay Anderson up here so that he can enjoy his time up in space. We'll just have to see what happens.\"\n\nAnderson is scheduled to launch aboard Endeavour in August to replace Williams. If a decision is made to bring her home aboard Atlantis in June, Anderson presumbably would be added to that crew and launched ahead of schedule. The impact of such a change on crew training, the sequence of spacewalks aboard the space station and whether NASA would add an astronaut to Endeavour's crew to replace Anderson is not yet known.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}