{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "robert weissman <rob@essential.org>", "subject": "[Ip-health] Embarrassing: Ken Adelman and USA for Innovation's Latest Untruths", "body": "Embarrassing: Ken Adelman and USA for Innovation's Latest Untruths\n\nRobert Weissman\nEssential Action\nMay 9, 2007\n\nKen Adelman and USA for Innovation are rapidly expanding from the\nterrain of the shameful to the simply embarrassing.\n\nToday, USA for Innovation has released what it calls ThaiLies #3.\n\nActually, they have switched from alleging that Thailand is \"lying\" to\nclaiming Thailand is spreading \"myths.\" The link to thailies.com still\nworks, but the operational site is now thaimyths.com. Perhaps the\nhypocrisy of Ken Adelman calling others liars was unsustainable.\n()\n\nIn any case, today's \"myth\" is that \"Thailand is just trying to lower\nthe cost of western medicines.\" The \"fact,\" according to USA for\nInnovation, is that \"Drug manufacturers have slashed the cost of drugs\nshipped to Thailand.\"\n\nIn particular, says USA for Innovation, Chicago drug giant Abbott cut\nits prices on the important HIV/AIDS drug Kaletra from $2200 to $1000.\n\nThose who have been following this controversy know that Abbott reduced\nits prices only AFTER Thailand issued the compulsory license. In fact,\none of the great benefits of the Thai compulsory license was that  low\nand low-middle-income countries around the world benefited almost\nimmediately, because it spurred the Abbott price reduction.\n\nAdelman and USA for Innovation are embarrassingly uninterested in\nanything resembling facts, however, despite their harsh rhetoric.\n\nThe USA for Innovation fact sheet asserts that Abbott's price reduction\npreceded Thailand's compulsory license, referencing a column written in\nthe Financial Times by conservative University of Chicago law professor\nRichard Epstein. The excerpt from USA for Innovation:\n\nA leading university of Chicago scholar pointed out that Abbott\nlaboratories cut its price on a cutting edge AIDS drug by over 50\npercent. \"[N]o drug company looks like an unreasonable hold-out when it\nhas already made significant price concessions, such as those made to\nThailand, where the price of an annual course of treatment for Kaletra\nhas dropped from $2,200 to $1,000, even before the recent showdown.\"\n(Richard A. Epstein, \"AIDS Drugs,\" FT.com, 5/7/07)\n\nHere are the actual relevant dates:\n\nJanuary 27, 2007. Thailand issues compulsory license on Kaletra.\n\nApril 10, 2007. Abbott announces its price reduction to $1,000 for low-\nand low-middle-income countries.\n()\n\nOne might at least expect USA for Innovation to check the Wall Street\nJournal editorial pages for clarity on such matters. The Journal\neditorial writers actually criticized Abbott for its price reduction, on\nthe very grounds that it came in response to the Thai compulsory\nlicense. \"Earlier this month, Thailand browbeat Abbott\nLaboratories into reducing the price of an HIV/AIDS drug, Kaletra, by\nthreatening to seize its patent.\" (Abbott's Bad Precedent, Wall Street\nJournal, April 30, 2007).\n\n--------\n\nToday's release from USA for Innovation --\n\nUSA For Innovation Launches Thai Myth #3\n\nWASHINGTON, May 9 /PRNewswire-USNewswire/ -- ThaiMyths.com\n(http://www.thaimyths.com/), a project of USA For Innovation, unveiled\nMyth #3 today to draw attention to the deceit in Thailand's decision to\nsteal American and European innovation.  Each business day for two weeks\nfrom May 7 -- May 18, ThaiMyths.com will release additional information\nregarding one of the ten recent myths by the Health Minister Mongkol na\nSongkhla.\n\n   Today's Myth: #3 of 10\n\n   Myth: Thailand is just trying to lower the cost of western medicines.\n\n\n\nFact: Thailand places high tariffs on prescription drugs and\npharmaceutical ingredients, while receiving fair prices for safe,\napproved western medicines.\n\nFACT: The Thai Government Places High Tariffs On Ingredients For\nPrescription Drugs As Well As Finished Pharmaceutical Products.\n\nAccording To A World Health Organization commission study, Thailand\nplaces a weighted average tariff rate of 18 percent on finished\npharmaceutical products. A study by WHO's Commission on Intellectual\nProperty Rights, Innovation and Public Health found that Thailand places\na weighted average tariff of 18% on finished pharmaceutical products --\na tariff that brought the Thai government over $67.2 million in revenue\nduring 2001 alone. (Commission On Intellectual Property Rights,\nInnovation And Public Health, Accessed 5/8/07)\n\nFACT: Drug manufacturers have slashed the cost of drugs shipped to Thailand.\n\nA leading university of Chicago scholar pointed out that Abbott\nlaboratories cut its price on a cutting edge AIDS drug by over 50\npercent. \"[N]o drug company looks like an unreasonable hold-out when it\nhas already made significant price concessions, such as those made to\nThailand, where the price of an annual course of treatment for Kaletra\nhas dropped from $2,200 to $1,000, even before the recent showdown.\"\n(Richard A. Epstein, \"AIDS Drugs,\" FT.com, 5/7/07)\n\nFACT: Not all countries abusing trade regulations do so for humanitarian\nreasons.\n\nThe University Of Chicago's Richard Epstein: \"Bargaining abuse is not\nthe unique preserve of nations. It can also originate in nations whose\nown economic houses may not be in order.\" (Richard A. Epstein, \"AIDS\nDrugs,\" FT.com, 5/7/07)\n\nAbout USA For Innovation and ThaiMyths.com\n\nUSA For Innovation is a non-profit organization dedicated to the\nprotection of intellectual property and continued innovation around the\nglobe. USA For Innovation educates decision makers, the media and\ngeneral public about threats to innovation. ThaiMyths.com is a project\nof USA For Innovation intended to expose the web of deceit by Thailand's\nHealth Ministry.  For additional information, please contact us at\n866-646-8668 or john@usaforinnovation.org.\n\nFirst Call Analyst:\nFCMN Contact:\n\n\nSource: USA For Innovation\n\n\nCONTACT:  USA For Innovation, +1-866-646-8668, john@usaforinnovation.org\n\nWeb site:  http://www.thaimyths.com/\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}