{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nWatts and Watt-hours (UtiliPoint.com - May 4, 2007)\n\n\n\nUtiliPoint.com - May 4, 2007 - In the past week several IssueAlert subscribers have contacted me about how to interpret the difference between watts and watt-hours and the number of homes served by certain generation devices.\n\n\nMay 5, 2007 PowerMarketers Industry Publications\n\n\n\nStoring Energy (EnergyBiz Insider - May 4, 2007)\n\n\n\nEnergyBiz Insider - May 4, 2007 - California's Solar Initiative is expected to drive an increase in photovoltaic installations across the state.\n\n\nMay 5, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 4, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 4, 2007\n\n\nMay 5, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for May 5, 2007  \n\n\n\nFirst Enercast Featured Articles for May 5, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 5, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nGoing NGV interest free\n\n\n\nMay 4--PTT Plc joined yesterday with Thanachart Bank, Krungthai Card Plc and Aeon Thana Sinsap (Thailand) Plc to offer interest-free loans to drivers seeking to install natural gas for vehicle (NGV) equipment.  The three financial institutions will offer the loans, with repayment terms from 10 to 36 months, until Sept 30. A motorist who modifies a car for NGV by paying cash at a PTT-certified ...\n\n\nMay 4, 2007 Knight Ridder Tribune Business News\n\n\n\nS.J. PG&E customers can save a cool buck by conserving: Company expands SmartAC program\n\n\n\nMay 3--MANTECA -- Pacific Gas and Electric Co. has launched the second phase of a San Joaquin Countywide program that lets the utility remotely turn air conditioning off and on in cycles during hot summer days when demand strains the power network.  A first phase in Stockton garnered 1,900 sign-ups -- and 900 equipment installations so far -- after a March 21 rollout, a good start for a program ...\n\n\nMay 3, 2007 Knight Ridder Tribune Business News\n\n\n\nVirginia State Corporation Commission now considering Appalachian Power's proposed rate increase\n\n\n\nMay 3--On the Web:  www.scc.virginia.gov www.appalachianpower.com After being deluged with public comment, the Virginia State Corporation Commission is now considering Appalachian Power's proposed rate increase. The utility, which provides electricity to about 500,000 customers in Southwest Virginia, got preliminary approval last year to raise its rates 25.4 percent.\n\n\nMay 3, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nDTE leader repeats call for new nuclear reactor in Michigan\n\n\n\nDETROIT -- DTE Energy Co. CEO Anthony Earley told shareholders today the company's cost containment strategy is on track and called for state lawmakers to revamp legislation that would help bring a new nuclear reactor to Michigan. Earley, speaking at the utility's annual meeting at its downtown headquarters, reported that DTE netted $95 million in annual cost savings in 2006.\n\n\nMay 4, 2007 Detroit News\n\n\n\nMore rules needed for wind power, study concludes\n\n\n\nWeb Tools: Appalachian states lack strong and detailed guidelines to regulate the continued growth of wind power facilities along the Mid-Atlantic highlands, according to a new study by the National Academy of Sciences. A team of academy experts concluded that wind power can help offset the greenhouse emissions caused by coal and other fossil-fuel energy sources, but the projected growth of wind ...\n\n\nMay 4, 2007 Charleston Gazette\n\n\n\nBoard rejects Xcel's bid for taller towers near Ruby Hill Park\n\n\n\nHome News Local Mountain views take precedence over power needs Kathleen MacKenzie says the power lines should be buried. STORY TOOLS  |  MORE STORIES By Daniel J. Chacon, Rocky Mountain News May 3, 2007 The Denver Planning Board dealt Xcel Energy a major blow Wednesday, rejecting the utility's request to build taller transmission towers near Ruby Hill Park.\n\n\nMay 3, 2007 Rocky Mountain News\n\n\n\nTall Xcel towers denied\n\n\n\nHome News Local City planning board turns down request near Ruby Hill Park STORY TOOLS  |  MORE STORIES By Daniel J. Chacon, Rocky Mountain News May 3, 2007 The Denver Planning Board dealt Xcel Energy a major blow Wednesday, rejecting the utility's request to build taller transmission towers near Ruby Hill Park. Xcel had sought a variance from the park's 'view plane' as part of a $19 million ...\n\n\nMay 3, 2007 Rocky Mountain News\n\n\n\n\n\nEarley Tells DTE Energy Shareholders Company is on Track\n\n\n\nDTE Energy's challenge for success is to readjust and evolve in response to a dynamic business environment, Chairman and CEO Anthony F. Earley Jr. said at the company's annual meeting of shareholders today. Earley and company President and Chief Operating Officer Gerard M. Anderson reflected on 2006 while outlining the issues facing the company's utility subsidiaries, Detroit Edison and MichCon, ...\n\n\nMay 3, 2007 PR Newswire\n\n\n\nWest Coast Leads the Nation in Planned Natural Gas Fired Unit Additions\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). In spite of a significant reduction in the number of natural gas fired unit additions planned in the U.S. since the bull days of the early 2000s, the industry is evaluating more than 45,000 megawatts (MW) of natural gas fired unit additions across the U.S. Natural gas represents only about 15% of ...\n\n\nMay 3, 2007 Internet Wire\n\n\n\nFitch Comments on NRG's Common Dividend Plan\n\n\n\nNEW YORK--(BUSINESS WIRE)--According to Fitch Ratings, NRG Energy Inc.'s (NRG; Issuer Default Rating (IDR) 'B', with a Stable Rating Outlook) announcement yesterday that it plans to pay a common dividend beginning 2008 through the creation of a holding company structure does not immediately affect the company's ratings or rating Outlook. As proposed, NRG would create a parent holding company that ...\n\n\nMay 3, 2007 Business Wire\n\n\n\nCMS Energy Reports First Quarter Results and Affirms Adjusted Earnings Guidance\n\n\n\nJACKSON, Mich., May 3 /PRNewswire-FirstCall/ -- CMS Energy announced today a net loss of $215 million, or $0.97 per share, for the first quarter of 2007 compared to a net loss of $27 million, or $0.12 per share, in the same quarter of 2006. CMS Energy's adjusted first quarter net income, which excludes impairment charges and other items, was $94 million, or $0.43 per share, compared to a net ...\n\n\nMay 3, 2007 PR Newswire\n\n\n\nAllegheny Energy Finalizes Contract for Scrubber Project at Fort Martin Power Station\n\n\n\nGREENSBURG, Pa.--(BUSINESS WIRE)--Allegheny Energy, Inc. (NYSE:AYE) today announced that it has signed an agreement for engineering and construction work related to the installation of flue gas desulfurization equipment (scrubbers) at the coal-fired Fort Martin Power Station. The scrubbers will reduce sulfur dioxide emissions by approximately 95 percent and significantly reduce mercury emissions ...\n\n\nMay 3, 2007 Business Wire\n\n\n\n\n\nFERC acts to remove barriers to renewable energy development in California\n\n\n\nThe Federal Energy Regulatory Commission (FERC) recently approved the California Independent System Operator's (CAISO) proposed mechanism for financing facilities to interconnect location-constrained renewable resources such as wind, geothermal and solar generation to the CAISO's transmission grid. The Commission found that the CAISO's proposal strikes a reasonable balance that addresses barriers ...\n\n\nMay 3, 2007 FMLink\n\n\n\nExperts report promise, perils of wind power\n\n\n\nWASHINGTON - Wind farms could generate as much as 7 percent of U.S. electricity in 15 years, but policymakers need to better consider the overall impacts, such as the threat spinning blades pose to birds and bats, a panel of the National Research Council reported Thursday.The towers appear most dangerous to night-migrating songbirds, bats and some hunting birds, but not enough about the risks is ...\n\n\nMay 3, 2007 MSNBC\n\n\n\nWind farms useful but may threaten birds\n\n\n\nWASHINGTON -- Wind farms could generate up to 7 percent of U.S. electricity in 15 years, but scientists want more study of the threat the spinning blades pose to birds and bats. The towers appear most dangerous to night-migrating songbirds, bats and some hunting birds such as hawks and eagles. The risk is not understood enough to draw conclusions, a National Research Council panel said Thursday ...\n\n\nMay 4, 2007 Seattle Post Intelligencer\n\n\n\nCoveted Econoburn Boilers Drawing Dealers' Attention\n\n\n\nThree new heating, plumbing and HVAC contractors and furnace dealers have lined up to add the Econoburn wood gasification boiler to their product offerings. The made in America boiler with a custom designed, high-technology refractory is energy efficient and enviornmentally friendly. With ASME certification and a ISO 2000-9001 certified manufacturing process, the Econoburn boiler is ...\n\n\nMay 3, 2007 PRWeb\n\n\n\nComverge reaches 126-MW demand reduction deal with Nevada Power\n\n\n\nComverge has entered into a demand-reduction agreement with Nevada Power that will supply the Las Vegas-based utility with a 'virtual peaking capacity' program of up to 126 MW, the East Hanover, New Jersey-based demand-response company said Thursday. As part of the two-year deal, Comverge will operate Nevada Power's existing 15-MW to 19-MW demand-response system, which comprises thermostats and ...\n\n\nMay 4, 2007 Platts\n\n\n\nEntergy New Orleans says it is ready to emerge from bankruptcy\n\n\n\nBirmingham, Alabama (Platts)--3May2007  Entergy New Orleans, which filed for Chapter 11 protection in September 2005 after its electricity and natural gas distribution systems were shattered by Hurricane Katrina, is prepared to emerge from bankruptcy immediately if the US Bankruptcy Court judge approves its reorganization plan at a Thursday hearing, the company said in documents filed with the ...\n\n\nMay 3, 2007 Platts\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nEuropean electricity prices could rise to record levels this summer\n\n\n\nLONDON: Electricity prices could reach record highs in Europe as forecasters predict a second straight summer of soaring temperatures. 'The chances are we will see significant increases in prices,' said Kim Keats, head of the power and fuels group at ICF International, a consulting firm in London. The price of baseload electricity for next quarter in Germany, the biggest European market, has ...\n\n\nMay 4, 2007 International Herald Tribune\n\n\n\nMajor Trends and Issues Facing the Energy Market: How to Exploit the Hydrogen and Build a Hydrogen Economy?\n\n\n\nLYON, France--(BUSINESS WIRE)--Reportlinker.com announces that a new market research report related to the worldwide energy market is now available to its catalogue. Hydrogen Economy Ed 1 2007 The energy sector of the world is on the cusp of immense change, but to what is it going to change? The worlds demand for energy is voracious and increasing. Our energy infrastructure is aging and large ...\n\n\nMay 4, 2007 Business Wire\n\n\n\nSuzlon announces 400 MW deal\n\n\n\n-- Suzlon Wind Energy Corporation, the US-based subsidiary of Suzlon Energy A/S of Denmark, has signed a contract for a total of 400 MW of wind turbine capacity with PPM Energy of Portland, Ore., one of the largest wind power developers in North America. The contract calls for delivery of 300 MW of turbine capacity in 2008 and 100 MW of capacity in 2009. Suzlon's S88-2.1 MW wind turbines will be ...\n\n\nMay 3, 2007 Power Engineering\n\n\n\nOil Prices Climb Above $64 a Barrel\n\n\n\nafter reports of more attacks on oil workers in Nigeria, Africa's largest oil producer, raised worries about supplies.Gunmen kidnapped at least 19 people in less than 24 hours in three attacks -- seizing people from a vessel managed by a subsidiary of Italian oil firm Eni SpA, from a South Korean company's power plant construction site and from a bar near an oil compound, officials and witnesses ...\n\n\nMay 3, 2007 Hartford Courant\n\n\n\nSynfuels plant once considered white elephant now a \"crown jewel\"\n\n\n\nBEULAH, N.D. - Once considered a white elephant and waste of taxpayers money, the  here is now hailed as pioneer of clean-coal technology. And its making money to boot. 'We do have a little bit of an I-told-you-so attitude here,' plant manager Bob Fagerstrom said. 'But its really been a struggle to get to this point.' After two decades of financial turmoil and fluctuating energy prices Great ...\n\n\nMay 4, 2007 Boston Herald\n\n\n\nRosneft subsidiary wins auction for major unit of bankrupt Yukos oil company\n\n\n\nMOSCOW: A subsidiary of state-controlled OAO Rosneft won the bidding for several Yukos units on Thursday with an offer of 175.7 billion rubles (US$6.8 billion; ,5 billion), the latest chapter in the piece-by-piece liquidation of the bankrupt oil company. Neft-Aktiv submitted the highest bid for Tomskneft and a bundle of other assets that once belonged to Yukos, whose bankruptcy has allowed the ...\n\n\nMay 3, 2007 International Herald Tribune\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}