{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 19, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESU.S. Troops Push Into Al Qaeda Haven\nAbout 10,000 U.S. soldiers northeast of Baghdad used heavily armored Stryker and Bradley fighting vehicles to battle their\n                        way into an al Qaeda sanctuary. Meanwhile, a truck bomb struck a Shiite mosque in the Iraqi capital, killing 78 people. More...Watch: Baghdad Blast Kills 75\n• \"A Tragedy Of Immense Proportions\"\n                     \t\t\t\t\t| Watch• Bush, Olmert Praise Palestinians' Abbas\n                     \t\t\t\t\t| Watch• Officials Confirm They Got Killer Bear\n                     \t\t\t\t\t| WatchU.S.Officials Confirm They Got Killer Bear\nOfficials in Utah say the bear tracked down and killed by wildlife officers was the one that killed an 11-year-old boy in\n                        the Utah wilderness. They also said the bear probably had harassed other campers in the same spot this past weekend. More...Watch: Aggressive Bear Killed In Utah\n• \"A Tragedy Of Immense Proportions\"\n                     \t\t\t\t\t| Watch• Coast Guard Searches For Cruise Passenger• At Least 5 Dead, 5 Missing In Texas Floods\n                     \t\t\t\t\t| Watch• More StoriesWorldIraqi Orphanage Nightmare\nIt was a shocking scene for U.S. soldiers to come across: barely alive young bodies strewn around a Baghdad orphanage. CBS\n                        News has obtained exclusive photographs of the scene, and Lara Logan spoke with some troops who were there. More...Watch: Orphans Left To Starve In Iraq\n• Bush, Olmert Praise Palestinians' Abbas\n                     \t\t\t\t\t| Watch• Road Rules: Vatican City• Splitsville For French Power Couple• More StoriesPoliticsFred Thompson Seeks Thatcher's Blessing\nAs his presidential campaign begins to take shape, Republican Fred Thompson is headed to Great Britain to visit former Prime\n                        Minister Margaret Thatcher with the hope of enhancing his credibility on foreign policy. More...Watch: Politico On Fred Thompson\n• Obama: \"Punjab\" Memo Was A \"Dumb Mistake\"• White House Budget Director Resigns• Democrats Court Anti-War Crowd\n                     \t\t\t\t\t| Watch• More StoriesHealthBabies Get More Than Secondhand Smoke\nBabies of smokers have higher urine levels of cotinine, a nicotine-related chemical, than babies of nonsmoking parents, a\n                        U.K. study shows. More...\n• Studying Alzheimer's With Motion Sensors• Enbrel Gives Long-Term Psoriasis Relief • New Web Site Rates Hundreds Of Sunscreens\n                     \t\t\t\t\t| Watch• More StoriesSciTechAtlantis Leaves Space Station For Earth\nThe space shuttle Atlantis undocked from the international space station for its trip back to Earth, concluding a nearly 10-day\n                        stay that included construction work and a computer meltdown. More...\n• Mining Revival: Uranium Boom In The West• Oil Industry Scales Back Expansion Plans • Wireless Technology Takes A Leap Forward• More StoriesBusinessFour Steps New Home Buyers Should Take\nOwning a home is a key to the American dream, but with foreclosure rates at a 50-year high in the U.S., it has never been\n                        more important to be a responsible buyer.  More...\n• Wal-Mart Hits Wall In California Cities• Boeing Gets A Wing Up On The Competition\n                     \t\t\t\t\t| Watch• Yahoo's Terry Semel Steps Down As CEO• More StoriesEntertainmentElisabeth On Rosie: We Aren't Friends\nElisabeth Hasselbeck says she and former co-host Rosie O'Donnell aren't on the best of terms nearly one month after their\n                        on-air dustup on \"The View.\" More...\n• Judge In Anna Nicole Custody Case Retires\n                     \t\t\t\t\t| Watch• Billboards Of Bald Britney Bounced• Paris' Prosecutor Apologizes For Accident• More StoriesOpinionDoing Time For Cyber-Crime\nThe Internet, and law enforcement agencies' ability to monitor people's behavior on it, is proving a great tool to catch criminals\n                        and would-be-criminals. Tucker Reals looks at some of the questions raised by locking up cyber-bad guys. More...Watch: Internet Pedophile Ring Busted\n• Iraq: A Problematic Partitioning\n                     \t\t\t\t\t| Watch• A U.N. Council's Hazy Future\n                     \t\t\t\t\t| Watch• Fatah's Fall\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Jess Cagle: When Weddings Get Crazy\nSome couples are spicing up their wedding day with some of their own personal flair. People magazine features memorable marriage\n                        moments in a special issue called Real Life Weddings, which is now on the stands.  More...Watch: People's Crazy Weddings\n• EARLY SHOW: \"Bridge to Terabithia\" Out On DVD\n                     \t\t\t\t\t| Watch• EARLY SHOW: New Web Site Rates Hundreds Of Sunscreens\n                     \t\t\t\t\t| Watch• EARLY SHOW: Preparing Seafood Beyond \"The Big Three\"\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nGuinness Certifies Oldest ManCBS News RAW: Japan's Tomoji Tanabe, 111, was certified as the world's oldest man by The Guinness Book of World Records.\n                                    He attributed his longevity in part to avoiding alcohol and smoking.\nTOP VIDEOS\nAtlantis Leaves Space Station\nFirst Look: Piloting Success\nAirbus 380 Soars At Air Show\nSearch On In Flood Aftermath\nHot Dog Queen\n'Tornado Of Flames' Kills 9\nBush, Olmert On Mideast Peace\nU.S., Israel Discuss Gaza\nPeople's Crazy Weddings\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMorley Safer talks to long-driving, hard-drinking golfer John Daly. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMurder On Lockhart Road:A mother and two kids are murdered. There are bizarre clues, eyewitnesses, blood drops,\n                           and a killer with a foot fetish. Saturday, 9 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}