{"category": "spam", "to_address": "producttestpanel@flax9.uwaterloo.ca", "from_address": "Gas Bonus <Montague@juxerlekbi.bestsportsmedia.com>", "subject": "Beat the Pumps - Enter to Win a Gas Card", "body": "You registered to receive this and similar offers from  on .\n\nThe Only Good News About GAS This Summer!\n\n5 Lucky Winners!\nFive lucky winners \ncan say \"fill-er up\"\nall summer!\nIf you're the Winner\nof $1000 in GAS!\n\nhttp://juxerlekbi.bestsportsmedia.com/t/l?g4-16ee-1-v9i-8jdp\n\nYou'll enjoy summer travel  without \npaying at the pump!  You will also receive \ngreat offers just for entering!\n\nEnter Here for a chance to Win $1000 in Gas!\n\nhttp://juxerlekbi.bestsportsmedia.com/t/l?g4-16ee-2-v9i-8jdp\n\n1. Enter your email and registration!\n2. Look at our fabulous offers!\n3. You may Win $1000 in Gas!\n\n\n\n\n\nTHIS IS AN INDEPENDENT OFFER FROM SweepstakesEveryday (tm)  AND IS NOT\nAFFILIATED OR ASSOCIATED WITH AND HAS NOT RECEIVED ANY CONSIDERATION\nFROM ANY OF THE ABOVE ENTITIES.  THIS OFFER MAY CONTAIN TYPOGRAPHICAL\nERRORS OR INACCURACIES AND THEREFORE WE RESERVE ALL RIGHTS.\n\nNO PURCHASE NECESSARY. A PURCHASE DOES NOT INCREASE YOUR CHANCES OF\nWINNING.  Void where prohibited.  Open only to legal residents of the 50\nUnited States and D.C., who are 18 or older. Ends at 11:59 p.m. ET on\n6/11/08.  Official rules available at our site:\nhttp://juxerlekbi.bestsportsmedia.com/t/l?g4-16ee-3-v9j-8jdp or by sending a\nSASE to: Official Rules 244 MADISON AVENUE, #238, NEW YORK,NY\n10016-2817. 8jdp You can also manage and control future correspondence from\nSponsor, by clicking this link:\n\nhttp://juxerlekbi.bestsportsmedia.com/t/l?g4-16ee-4-v9k-8jdp\n\nTHIS WILL NOT STOP YOU FROM RECEIVING COMMUNICATIONS FROM THE LIST OWNER\nWHO SENT YOU THIS EMAIL.  IF YOU WISH TO END YOUR PARTICIPATION THERE,\nYOU WILL NEED TO FOLLOW THEIR INSTRUCTIONS ON HOW TO UNSUBSCRIBE. DURING\nTHE REMOVAL PERIOD, YOU MAY RECEIVE SOME OFFERS THAT WERE ALREADY IN\nPROGRESS WHEN YOUR REQUEST WAS RECEIVED.\n\nIf you no longer wish to receive these commercial emails, you may remove yourself from our mailing list by clicking here http://juxerlekbi.bestsportsmedia.com/remove?r.Montague.25-93a2b01-5da4.speedy.uwaterloo.ca.-producttestpanel?r click here or by calling our unsubscribe hotline at 864-752-1051. Please note this phone number is used solely for unsubscribe requests. Please allow up to five business days for your request to be processed.\n\nYou may also contact us by writing to us at our postal address: Montague| 9600 Great Hills Trail, Suite 150 W| Austin, TX 28759\n\n\n\n\n"}