{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Ali Swenson\" <powclairdevuedeq@clairdevue.com>", "subject": "Obesity is dangerous, stop it", "body": "\nShed weight now and enjoy the process\n\n\n\n\n\nAnatrim – The newest and most fascinating product for weighty people is now readily available – As you could see on Oprah\n\n\n\nDid you realize that redundant body kilograms kill a plenty of people for every new year? We believe that you hate the ugly appearance of those people and the low status they obviously have in modern society. \n\nOr, maybe, you can’t withstand an assault of your terrible eating habits. If it sounds familiar, then we got something for your consideration!\n\n\n\n\n\nIntroducing Anatrim, the later product for the elimination of your body’s extra weight. The greatest thing is that Anatrim improves the quality of your life by repressing the feeling of hunger and giving you better spirit. Look at what people write to us about this product:\n\n\n\n\n\n\"This is amazing! \n\n\nI stopped watching TV continually and always glutting myself with food \n\n\nI became rather more interested in exercise.\n\n\n\n\n\n\n Anatrim set me on the right track.\n\n\n I am more fit now and there are lots of men in my way!\"\n\n\n\n\n\n\nAmely S., Bellevue WA\n\n\n\n\n\n\n\"Passive weight losing was of no help to me. This terrible appetite would just rush in and spoil everything. \n\n\nOne day I was told about Anatrim my very best friend by and it brought a great influence on me.\n\n\n I had tried to take it, and my wife said to me that I had changed for the better since then, 4 months later. \n\n\n35 pounds off and I keep losing them! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nSteve Doubt, Bellevue WA\n\n\n\n\n\nAnatrim helps your brain to understand that your body doesn’t need that much food. It raises your spirit up, provides you with additional energy, and attacks useless kilos. Especial thanks to its powerful distinguished formula!!\n\n\n\nElicit more information!\n\n\n\n"}