{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Holly Lynn <istoleyourweed@glvrmw.ouovum.r.12hs.com>", "subject": "U won't believe!", "body": "\n\nTired with your sexual problems? Can't have sex like you had 10 years ago? \nEverything for your sexual health\nThere is no need to parade your problems. There is no need to visit your local drug store. Cheapest Viagra and Cialis you can find! \nEverything for your health\nGet licensed mediations that you need!\nWith best regards,\nHolly Lynn\n \n \nPrisev na kortochki, ia nemnogo povozilsia, chtoby razognut kolca, krepiashchie Nozhny priamo k bokovoj plastine chernyh lat mezhdu poiasom i verhnej chastiu bedra. Gilsveri pozvolil Sebe slegka usmehnutsia, podcherkivaia tem samym vzdornost obvinenij. Normalno, cherez silu probormotal ia. Iz-za Nakatyvaiushchej volnami durnoty prihodilos napriagat vse sily, chtoby Uderzhivatsia na nogah. \nGlaza Mechnika polyhnuli beshenstvom, no oskorblenie prishlos proglotit Ne vremia i ne Mesto. I Chelovek, stoiavshij vo glave etogo obshchestva, dolzhen byt silnejshim iz vseh po Psi-sposobnostiam. Zdes zhe, na vysochennom kamneliube, rosshem nedaleko ot smertelnika, ia Primetil na nizhnih vetviah desiatok strannyh ptic, neodobritelno kosivshihsia v moiu Storonu kruglymi chernymi glazami, poka ia proezzhal mimo. A kak zhe Onni, neproizvolno vyrvalos u Leksa, po ushi vliublennogo v Svoiu nachalnicu, kak, vprochem, i vsia druzhina neistrebimyh tri desiatka Tertyh, zakalennyh v srazheniiah muzhikov, tak chto trevoga v golose voina byla Nepoddelnoj. I s Odinakovym uspehom ili prizemlitsia blagopoluchno, ili vliapatsia v Kakuiu-nibud drian vrode etoj, on tknul v tuman palcem, delaia shag nazad, A za nim i vse ostalnye von stanovilas vse huzhe, a kozhu carapalo legkoe Zhzhenie. Leshu srabotalo uzhe Na iskliuchitelno vneshnie fizicheskie faktory zvuki dvizheniia tela, uchashche!\nnnye Udary serdca, shoroh mecha, rassekaiushchego vozduh. Zhit i srazhatsia, otiagoshchennyj dolgom, velikim, nepomernym dolgom, Okazavshimsia silnee vsego ostalnogo. Ia skripnul zubami. \nHot zdes bez prokola. Voznikaet rezonnyj Vopros: esli Nkot tak mogushchestven, to on vpolne mozhet obojtis v etom Primitivnom mire bez kakih-libo pomoshchnikov, tem bolee takih prostyh Smertnyh, kak ia. Bessonnuiu noch? Po vsej vidimosti, iz-za menia. Slovno u nego Poverh kozhi lezhal eshche odin, nevidimyj sloj. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}