{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "bob@proulx.com (Bob Proulx)", "subject": "Re: Swap encryption (via LUKS) and Hibernation (disk suspend)", "body": "Frank Ursel wrote:\n> Gerardo Curiel wrote:\n> > Right now, just using uswsusp , with a encrypted swap partition, it\n> > works out of the box :D\n> > \n> > The initramfs-tools package contains the needed hooks to unlock the\n> > encrypted partition with cryptsetup.It works for me.\n> \n> Not for me. The initramfs was build upon install and it recognized my\n> encrypted swap, but after hibernation the correct device was not found.\n\nI recently installed Etch on two different laptops, one a T42 and the\nother a T43p.  On both the encrypted installation worked perfectly and\nboth were able to hibernate to encrypted swap and resume without\ntrouble.  It works for me.\n\nI think some of the factors that affect this are if the laptop's acpi\nbios is functional or not.  My previous laptop suffered from buggy\nacpi problems and I never got suspend to ram to work and I always had\nsuspend to disk problems with it.  I could only get my previous laptop\nto suspect to disk with swsusp2 and other patches.  (Using swsusp2 was\na lifesaver!)  The point here is that the problem may not be the Etch\ninstallation as such but rather it may be a problem on the specific\nmodel of machine it is being installed upon.  All other things being\nequal some models of laptop may work perfectly while other models of\nlaptops will have problems.\n\nThe other place that might cause pproblems is that it is not\ncompletely obvious how encryption should be installed.  First you do\nthis and then you do that.  It is possible to install the system with\na less than optimal configuration of encryption and that may also be\ncausing problems.\n\nLet me very tersely describe this process.  The first thing is to\ncreate a physical volume for encryption.  That enables a new option to\nconfigure encrypted filesystems.  Then what I think is best is to use\nlvm to manage all of the rest.  Therefore I create an lvm partition on\nthe newly created encrypted partition.  That enables a new option to\nconfigure lvm.  Then create (at least) two logical volumes, one for\nswap and one for everything else.  Then assign all of the partitions.\nThis creates both swap and filesystem partitions layered through lvm\nlayered through the encrypted partition.\n\nThis process enables one single encrypted partition and so a single\nLUKS password at boot time needs to be entered.  But it supports\nthrough lvm as many logical volumes as desired.  The Debian kernels\nand mkinitrd are configured to set up the initrd automatically with\nthe layers of drivers needed to make this work out of the box.\n\nIt works for me.  Your mileage may vary.\n\nBob\n\n\n-- \nTo UNSUBSCRIBE, email to debian-laptop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}