{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Credit Card Processor Soars on News\" <Stock.Tip.Radio@wallstreetreporting-info.com>", "subject": "FGBF Breaks out over $3.00 / New Target Price Set", "body": "\n\n \n\n\n\n\n\n\n\n\n\t\t\tWallStreetReporting.com\n \n\n\n\n\n\n\n\n\t\t\t\t\t\t\tFinancial Security... Before You Buy... Ask A \n\t\t\t\t\t\t\tProfessional  \n \n\n\n\n\n\n\n\n\t\t\t\t\t\t\tWallStreetReporting.com has highlighted 1st \n\t\t\t\t\t\t\tGlobal Financial , Inc (OTC / Other:FGBF) in a recent \n\t\t\t\t\t\t\treport and has placed a short \nterm \n\t\t\t\t\t\t\tprice target of $3.75 on the company then a \n breakout\nto $5.50.\n\t\t\t\t\t\t\tSend Report\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tNews | Market \n\t\t\t\t\t\t\t\t\t\t\tAdvisers | Analysts | SEC \n\t\t\t\t\t\t\t\t\t\t\tFilings | Insiders | Annual \n\t\t\t\t\t\t\t\t\t\t\tReport | Profile\n\n\n  Business:Credit \n\t\t\t\t\t\t\t\t\t\t\tCard Processing\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nResistance exists \n\t\t\t\t\t\t\tat the $3.00  level \nWatch for the volume \n\t\t\t\t\t\t\tto \n\t\t\t\t\t\t\tincrease shortly on breakouts above $3..50. Company's business \n\t\t\t\t\t\t\tis expected to expand dramatically \n\t\t\t\t\t\t\t We feel \n\t\t\t\t\t\t\tthe company merits your immediate attention\n                                \n\t\t\t\t\t\t\t\n\nUnsubscribe Click Here\n\n\n\n\n\n\nCompany \n\t\t\t\t\t\t\t\t\t\t\tReleases for 1St Global Financial \n\t\t\t\t\t\t\t\t\t\t\tCorp\n\n\n\n\nThursday, May \n\t\t\t\t\t\t\t\t\t\t\t10, 2007\n \n\n\n\n\n1st Global \n\t\t\t\t\t\t\t\t\t\t\tFinancial to Attend The Money Show \n\t\t\t\t\t\t\t\t\t\t\tMay 15th - 17th in Las Vegas \n\t\t\t\t\t\t\t\t\t\t\t- Market Wire\n\n\n6:04 PM\n\n\n\n\nTuesday, May \n\t\t\t\t\t\t\t\t\t\t\t08, 2007\n \n\n\n\n\n1st Global \n\t\t\t\t\t\t\t\t\t\t\tFinancial Signs New Merchant Account \n\t\t\t\t\t\t\t\t\t\t\tto Add More Than $8,000,000 in \n\t\t\t\t\t\t\t\t\t\t\tProcessing per Year \n\t\t\t\t\t\t\t\t\t\t\t- Market Wire\n\n\n4:22 PM\n\n\n\n\nFriday, April \n\t\t\t\t\t\t\t\t\t\t\t27, 2007\n \n\n\n\n\nMoneyTV, Week \n\t\t\t\t\t\t\t\t\t\t\tof 4/27 \n\t\t\t\t\t\t\t\t\t\t\t- Market Wire\n\n\n5:00 AM\n\n\n\n\nWednesday, \n\t\t\t\t\t\t\t\t\t\t\tApril 25, 2007\n \n\n\n\n\n1st Global \n\t\t\t\t\t\t\t\t\t\t\tFinancial Reports March Transactions \n\t\t\t\t\t\t\t\t\t\t\tIncrease 37% to Another Record High \n\t\t\t\t\t\t\t\t\t\t\t- Market Wire\n\n\n4:07 PM\n\n\n\n\nFriday, April \n\t\t\t\t\t\t\t\t\t\t\t20, 2007\n \n\n\n\n\n1st Global \n\t\t\t\t\t\t\t\t\t\t\tFinancial Corp Special Webcast \n\t\t\t\t\t\t\t\t\t\t\t- BusinessWire\n\n\n11:50 AM\n\n\n\n\nWednesday, \n\t\t\t\t\t\t\t\t\t\t\tApril 18, 2007\n \n\n\n\n\n1st Global \n\t\t\t\t\t\t\t\t\t\t\tFinancial Corp. Subsidiary Adds \n\t\t\t\t\t\t\t\t\t\t\tLarge Merchant Account With 50 New \n\t\t\t\t\t\t\t\t\t\t\tLocations \n\t\t\t\t\t\t\t\t\t\t\t- Market Wire\n\n\n4:01 PM\n\n\n\n\nWednesday, \n\t\t\t\t\t\t\t\t\t\t\tApril 11, 2007\n \n\n\n\n\n1st Global \n\t\t\t\t\t\t\t\t\t\t\tFinancial Corporation Hires Audit \n\t\t\t\t\t\t\t\t\t\t\tand Law Firms \n\t\t\t\t\t\t\t\t\t\t\t- Market Wire\n\n\n4:00 PM\n\n\n\n\n\n \n\n\n                             \n \n\n\n\n\n\n\n\t\t\t\t\t------------------------------------------------------------------------------------------------------------------------------------------\n Advertiser Address \nFred Ballou Editor \n\t\t\t\t\tTarget Publishing , Inc\n\t\t\t\t\t370 Lexington Ave \n\t\t\t\t\tNew York , New York 10017\n949-528-6636\n\n\nUnsubscribe Click Here\n\t\t\t\t\t.\n\n\n\n\nThis news release includes \nforward-looking statements within the meaning of Section 27A of the Securities \nAct of 1933 and Section 21E of the Securities Exchange Act of 1934, as amended, \nregarding, among other things, our plans, strategies and prospects, both \nbusiness and financial. Although we believe that our plans, intentions and \nexpectations reflected in or suggested by these forward-looking statements are \nreasonable, we cannot assure you that we will achieve or realize these plans, \nintentions or expectations. Forward-looking statements are inherently subject to \nrisks, uncertainties and assumptions. Many of the forward-looking statements \ncontained in this news release may be identified by the use of forward-looking \nwords such as: believe, expect, anticipate, should, planned, will, may, intend, \nestimated, and potential, among others. Important factors that could cause \nactual results to differ materially from the forward-looking statements we make \nin this news release include market conditions, the market performance of \nacquired business entities and assets and other factors such as, but not limited \nto, those set forth in reports or documents that we file from time to time with \nthe United States Securities and Exchange Commission. All forward-looking \nstatements attributable to \n\nCkrush, Inc  or a person acting \non its behalf are expressly qualified in their entirety \nby this cautionary language.\n\n\n\n\nDisclaimer\n\n\n\nSmallCapTimes.com \nfeature stock reports are intended to be stock ideas, \nNOT recommendations. Please do your own research before \ninvesting. It is crucial that you at least look at \ncurrent SEC filings and read the latest press releases. \nFor continuing coverage of our highlighted stocks please \nsign up for our free newsletter. Information contained \nin this report was extracted from current documents \nfiled with the SEC, the company web site and other \npublicly available sources deemed reliable. For more \ninformation see our disclaimer section, a link of which \ncan be found on our web site. This document contains \nforward-looking statements, particularly as related to \nthe business plans of the Company, within the meaning of \nSection 27A of the Securities Act of 1933 and Sections \n21E of the Securities Exchange Act of 1934, and are \nsubject to the safe harbor created by these sections. \nActual results may differ materially from the Company's \nexpectations and estimates. The information provided \nherein is not intended for distribution to, or use by, \nany person or entity in any jurisdiction or country \nwhere such distribution or use would be contrary to law \nor regulation or which would subject us to any \nregistration requirement within such jurisdiction or \ncountry.\n\n\n\n\n\n\n\nCopyright \nSmallCapTimes.com. All rights reserved. \nSmallCapTimes.com is not a Registered Broker/Dealer or \nFinancial Advisor, nor do we hold ourselves out to be. \nAll materials presented on our web site and individual \nreports released to the public through this web site, \ne-mail or any other means of transmission are not to be \nregarded as investment advice and are only for \ninformative purposes. Before making a purchase or sale \nof any securities featured on our web site or mentioned \nin our reports, we strongly encourage and recommend \nconsultation with a registered securities \nrepresentative. This is not to be construed as a \nsolicitation or recommendation to buy or sell \nsecurities. As with any stock, companies we select to \nprofile involve a degree of investment risk and \nvolatility. Particularly Small-Caps and OTC-BB stocks. \nAll investors are cautioned that they may lose all or a \nportion of their investment if they decide to make a \npurchase in any of our profiled companies. Past \nperformance of our profiled stocks is not indicative of \nfuture results. The accuracy or completeness of the \ninformation on our web site or within our reports is \nonly as reliable as the sources they were obtained \nfrom. The profile and opinions expressed herein are \nexpressed as of the date the profile is posted on site \nand are subject to change without notice. No investor \nshould assume that reliance on the views, opinions or \nrecommendations contained herein will produce profitable \nresults. SmallCapTimes.com may hold positions in \nsecurities mentioned herein, and may make purchases or \nsales in such securities featured on our web site or \nwithin our reports. In order to be in full compliance \nwith the Securities Act  of 1933, Section 17(b), \nSmallCapTimes.com will disclose in it's disclaimer, \nwhat, if any compensation was received for our efforts \nin researching, presenting and disseminating this \ninformation to our subscriber database and featuring the \nreport on the SmallCapTimes.com web site. \nSmallCapTimes.com was compensated \n\nThree\nthousand dollars  per month plus 10,000 restricted shares each month \n\n\n\n\n\nfor three months \nby the company commencing January of 2006 for its \nefforts in presenting this profile on its web site and \ndistributing it to its database of subscribers. SmallCapTimes.com may decide to purchase or sell shares \non a voluntary basis in the open market before, during \nor after the profiling period of this report. \nInformation presented on our web site and within our \nreports contain \"forward looking statements\" within the \nmeaning of Section 27A of the Securities Act of 1933 and \nSection 21E of the Securities Exchange Act of 1934. Any \nstatements that express or involve discussions with \nrespect to predictions, expectations, beliefs, plans, \nprojections, objectives, goals, assumptions or future \nevents or performance are not statements of historical \nfact and may be \"forward looking statements.\" Forward \nlooking statements are based on expectations, estimates \nand projections at the time the statements are made that \ninvolve a number of risks and uncertainties which could \ncause actual results or events to differ materially from \nthose presently anticipated. Forward looking statements \nin this action may be identified through the use of \nwords such as “expects’”, “will,” “anticipates,” \n“estimates, “believes, ” or that by statements \nindicating certain actions “may,” “could,” or “might” \noccur.  \n\nTHE READER SHOULD VERIFY \nALL CLAIMS AND DO THEIR OWN DUE DILIGENCE BEFORE \nINVESTING IN ANY SECURITIES MENTIONED. INVESTING IN \nSMALL CAP SECURITIES IS SPECULATIVE AND CARRIES A HIGH \nDEGREE OF RISK.\n\n\n\n\n\n\n\n \n\nemail: \n\n\neditor@smallcaptimes.com  \n\n\n\nweb: \n\n\nhttp://www.smallcaptimes.com  \n\n\n\n\n\n\n\nThis email was sent to \nyou from Target Publishing, Inc. If you wish to take \nyourself off from the subscription , please \n\nuse this link to cancel future deliveries. Thank you. \n \n\nThe Information in this Breaking News \nReport . is A PAID ADVERTISEMENT and is for the viewers information only \n\nCkrush, Inc\nhas agreed to pay a fee of $1500.00 in cash \nor Free Trading shares per month for \n\nthree\nmonths the company has ot paid to date. to have their  corporate information featured. The \ncorporate information is purely and solely the \nresponsibility of and it is neither commented upon, \nresearched, or in any manner the responsibility of \nTarget Publishing, Inc whose only function is as a \nsupplier of media facilities. Any information provided \nby the advertisers of Target Publishing, Inc., through \nits media services, is not to be construed as a \nrecommendation or suggestion or offer to buy or sell \nsecurities, but is provided purely as an informational \nmedia service. Target Publishing , Inc makes no \nwarranties or undertakings as to the accuracy or \ncompleteness of this information. All due diligence \nshould be done by the reader or their financial advisor. \nInvesting in securities is speculative and carries risk. \nPersons who wish to buy or sell securities should only \ndo so in consultation with their registered securities \nadvisers.  \n  \n\n\nBy: Target Publishing , Inc ,370 \nLexington Ave , NY, NY 10017 604-261-4466\n\n \n \n\n\n\n\n\n\n\t\t\t© Target Publishing , Inc  2006. All rights reserved. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t  Target Publishing , Inc530-S Federal Hwy - Deerfield Beach, Fl 33432 US\n\t  \n\n\n"}