{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Energy Seminars<Energy.Seminars@calcium.netcontentinc.net>", "subject": "FASB 133: Accounting for Derivatives  Apr 10 Atlanta; Apr 18 Houston;  May 8 Chicago", "body": "\n\n\n\n\n\n\nFASB 133\n\n\n\n\n\n\n\n \nFAS 133\nA Seminar on Accounting for Derivative Instruments and Hedging Activities\n  \n\n\n\n\nApr. 10, 2007 - \n      Atlanta, GA\n\n\nRegister Online\n\nRegister Online\n\nRegister Online\n\n\n\n\nApr. 18, 2007 - \n      Houston, TX\n\n\n\n\nMay 8, 2007 - Chicago, IL\n\n\n\n\n\n\n\n\nClick Here To Download \n      A Complete Conference Brochure and Order Form\nClick \n      Here To View A Complete List of Upcoming Conferences\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHow does EITF 98-10 tie in with FAS 133? \nIf FAS 133 says weather deals are not derivatives and don't fall \n        under 133, how should they be accounted for? \nFAS 133 applies to all entities, but not all companies need to \n        comply with it. Find out when and why compliance is optional. \nFind out why \"fair value hedges\" and \"cash flow hedges\" are \n        different, and which one can involve non-symmetric treatment of hedge \n        gains or losses. \nLearn how to properly document hedges, and to account for them as \n        they unfold. \nLearn how to test for effectiveness retrospectively and \n        prospectively, and which effectiveness method you should always choose.\n        \nSee how 133 works in the context of real-life energy deals using \n        futures, swaps and options. \nFind out the two methods FAS allows for testing the effectiveness of \n        hedging with options, and which method you should always use. \nLearn what you must disclose about hedging and derivatives use, and \n        how often you must do it.\n\n\n\n\n\n\n\n\n\n\nAnyone wanting or needing to \n      know how to make your shop and its derivative and hedging activities fully \n      FAS 133 compliant should attend this seminar. \n\n\n\n\n\n\n\n\nAttendees will receive and work with a \n      795-page guide to FAS Statement 133 and earn 8.0 hours of CPE \n      credit.\n\n\n\n\n\n\n\n\n\n\nClick Here To Download \n      A Complete Conference Brochure and Order Form\nClick \n      Here To View A Complete List of Upcoming Conferences\n\n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}