{"category": "spam", "to_address": "<iplacereports@flax9.uwaterloo.ca>", "from_address": "\"JohnLansing@Investorplace.com\" <JohnLansing@Investorplace.com>", "subject": "Trade Talk Weekly May 22: Take It or Leave It", "body": "\n\nTrade Talk Weekly Update\n\n\n\n\n\n\n\n\nMay 22, 2007\n“Take it or Leave it”\n\n\n\n\n\nTools of a Successful Trader\nWhen you’re not in the market, there’s nothing a trader can do, right?\nWRONG!\nAt Trending123, there are all kinds of things you can do when you’re not trading. The most important are probably 1) Research, 2) Learn, and 3) Wise up! That’s why we give you the Trending123 Trading Tools. Here’s what you get:\n\nStock Scanner Demo — Learn how to scan for chart patterns and trading setups automatically with the Recognia stock scanner\nFront Runners — 144 momentum front runner stocks\nStock Sector Performance — 240 sectors sortable by performance criteria\nIndices — 275 indices linked to their respective charts, plus an index chart lookup tool\nETFs — 168 ETFs linked to their respective charts, plus links to view all 286 ETFs or filtered subgroups (Broad-Based, Industry, International)\nTrading Wisdom — Wise up with a dose of Trading Wisdom every Friday from neuropsychological trading coach Dr. Janice Dorn, MD, PhD\n\nAnd that’s just a sampling of what we offer for free! Trending123 members get even more, with the full Recognia Stock Scanner, Message Boards, Trading Room—the list just doesn’t end. So stop sitting around on the sidelines and visit Trending123.com to start using the tools of a successful trader.\n\n\n\n\nIf Ed McMahon came a knockin’ on your door to deliver a big ole check with your name on it for a million dollars, my guess is you’d take it. Granted a million dollars isn’t what it used to be but I’m still betting you’d willingly oblige!\nIf only all decisions came that easily, right?\nFor us investors, the decision to sell is the most difficult. Not a snap decision to be sure. So how do you decide when to sell?\nA) A few shakes of the magic 8 ball \nB) Eeny Meeny Miny Mo\nC) Rock, paper, scissors\nGeez, I hope your answer is none of the above!\nThe only indicator that gives you the “all clear” is when you determine that the risk outweighs the reward.\nLet me illustrate.\nAs many of you know, I issued a series of sell alerts from April 25 to April 27 for all of the stocks that were then in the Trending123 portfolio. But the consensus in the markets was that there were more profits to be made. So who was right?\n\nTake a look at some of the stocks that we sold:\n\n\nTicker\nSold on\nReturn\nSince Sale\nReturn if Held\n\n\nGSS\n4/27/07\n37.15%\n-15.48%\n21.67%\n\n\nTGEN\n4/26/07\n29.13%\n-43.70%\n-14.57%\n\n\nALAN\n4/26/07\n27.05%\n-29.10%\n-2.05%\n\n\nONSM\n4/26/07\n11.20%\n-20.33%\n-9.13%\n\n\nID\n4/25/07\n14.91%\n1.45%\n16.36%\n\n\nOMG\n4/25/07\n9.13%\n5.95%\n15.08%\n\n\nANDE\n4/25/07\n28.24%\n-16.79%\n11.45%\n\n\nAs you can see, some of our gains would have been reduced, as with GSS. But others would have been turned into losses, e.g., TGEN and ALAN—and everyone knows that’s not smart trading.\nOf course, I’d be remiss not to point out the stocks that continued to rise, like ID and OMG. But are the extra couple of points of return worth the risk? I don’t think so. In fact, the average decline if we kept all of them would be -6.68%.\nThe bottom line is that even though a handful of the Trending123 portfolio stocks went higher, the majority of stocks we closed out dropped as much as 60-70% from the day the sell alert was issued!\nIf you aren’t a Trending123 subscriber yet, then you missed my entire update including the full list of portfolio stocks that we closed out in late April. You can watch the whole thing — just try my Trending123 service (at a reduced price, no less)!\nReady to learn all the ins and outs of technical analysis? I’ve got a lot to show you so please take a few minutes to learn exactly what you will get from becoming a Trending123 member. As a Trade Talk Weekly subscriber, you can SAVE $50 when you try it today.\n\nSincerely,\n\nJohn LansingTrending123\n\nP.S. The best offer I can give you is STILL on the table. Try out my Trending123 service at $50 OFF the regular price. If for any reason you’re not satisfied within the first 90 days — you get ALL your money back! Click here to give it a try today!\n\n\n\n\n\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you.   Please tell us if your email has changed by visiting here: http://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice from InvestorPlace advisors, you can let us know by visiting \nhttp://www.investorplace.com/u/?p=8BM235-1&e=iplacereports@speedy.uwaterloo.ca\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,2420A Gehman LaneLancaster, PA 17602\nCopyright © 2007 ACP Phillips Investment Resources, LLC.\nAll rights reserved.\n05/22/2007 7:27PM\n\nThank you for subscribing to InvestorPlace.com.   Please note that we cannot be liable for any missed bulletins caused by overzealous spam filters.   To ensure that you continue to receive this valuable part of your service please take a moment to add (JohnLansing@InvestorPlace.com) to your address book.   Click here for instructions:\nhttp://www.investorplace.com/whitelist.php?eml=JohnLansing@InvestorPlace.com\n\nee==8BM235\n\n\n\n\n\n\n"}