{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJuly 2, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESYemen Car Bomb Blast Kills 8 \nA car bomb exploded at the site of an ancient temple in Yemen's northeast province of Mareb, killing eight people and wounding\n                        at least seven, police said. Six of the people killed were tourists. More...\n• Jordanian Doc, 6 More Held Over U.K. Plot \n                     \t\t\t\t\t| Watch• Wary Eye On Southern Plains Rivers, Creeks\n                     \t\t\t\t\t| Watch• Homeland Security Chief: \"We Are Safe\"\n                     \t\t\t\t\t| WatchU.S.Wary Eye On Southern Plains Rivers, Creeks\nRivers swollen by days of heavy rain are creeping dangerously upward across the Plains, even after sunshine returned to southeast\n                        Kansas and southwest Missouri. Thousands have been evacuated from towns in Kansas, Missouri, Texas, and Oklahoma.  More...Watch: Floods Blamed For 12 Deaths\n• Homeland Security Chief: \"We Are Safe\"\n                     \t\t\t\t\t| Watch• Wildfire Kills Three In Utah\n                     \t\t\t\t\t| Watch• Green Card For Missing GI's Wife• More StoriesWorldJordanian Doc, 6 More Held Over U.K. Plot \nBritish authorities are now holding seven people in their investigation into a triple-car bomb terror plot, including a suspect\n                        who CBS News has learned is a doctor from Jordan and whose name appears on Internet postings critical of the West. More...Watch: Doctors Behind U.K. Attacks?\n• Yemen Car Bomb Blast Kills 8 • 7 Afghan Police Killed By Roadside Bomb• U.S. General Points Finger At Iran• More StoriesPoliticsObama Campaign Pulls In Big Money\nSen. Barack Obama reported raising at least $32.5 million for his presidential campaign from April through June, a record\n                        for a Democratic candidate. Clinton's campaign announced late Sunday that she had raised $21 million. More...Watch: Critical Week For '08 Hopefuls\n• Lugar: Change In Iraq Policy Can't Wait\n                     \t\t\t\t\t| Watch• Bush Defends Military Buildup In Iraq• Putin Visiting Bush In Maine\n                     \t\t\t\t\t| Watch• More StoriesHealthTrans Fats Ban Begins In NYC\nSunday was the start date of New York City's first-in-the-nation ban on the fats and the requirement that restaurants post\n                        calorie counts. But visits to many restaurants suggested they were in no rush to comply with the second rule.  More...Watch: Healthy Trans-Fat Substitutes\n• Doctor Heads To Iraq To Counsel Troops\n                     \t\t\t\t\t| Watch• Poison Ivy Getting Worse, Researchers Say\n                     \t\t\t\t\t| Watch• England Bans Smoking In Public Places• More StoriesSciTechCooking With The Sun\nSolar cookers were tried out by \"America's Test Kitchen,\" whose host, Chris Kimball, reported on the results on The\n                        Early Show. They promise delicious dishes without having to plug in a cord or light a match. More...Watch: Solar-Powered Cooking\n• Space Shuttle Leaves Calif. Atop Jumbo Jet\n                     \t\t\t\t\t| Watch• The iPhone ... Was It Worth The Wait?\n                     \t\t\t\t\t| Watch• Online Gambling Moneyman Pleads Guilty• More StoriesBusinessHappier Summer Travel\nSummer just started and already airline confusion is wreaking havoc on travel plans. iPhones or other high-tech devices can\n                        ease boredom, and Ray Hennessey Editor of SmartMoney.com, has some more tips for a happier summer.  More...Watch: Happy Summer Travel\n• Lunch With Warren Buffett? $650,100• Oil Futures Settle Above $70 A Barrel• Find Your Retirement Dream Job• More StoriesEntertainmentCriss Angel's Wife Surfaces, Wants Divorce\nIllusionist Criss Angel's wife, Joanne, says the magic is gone from their marriage and has filed for divorce. Angel has recently\n                        been linked with actress Cameron Diaz. More...\n• Finding The Secret To Success• The ShowBuzz Weekly Forecast• Old And New Mix At Concert For Diana\n                     \t\t\t\t\t| Watch• More StoriesOpinionDiversity and Equity Win Out\nNational Review Online says that the Supreme Court's ruling against allowing race to determine which school to place\n                        a child in is a positive step forward, but the ruling still has its downfalls.  More...Watch: Reading, Writing And Race\n• What Have They Done To Milk?\n                     \t\t\t\t\t| Watch• NFL Players' Union Gets Blitzed\n                     \t\t\t\t\t| Watch• Immigration Bill's Defeat Is Not A Victory\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Recipes: Cooking With The Sun\nSolar cookers were tried out by \"America's Test Kitchen,\" whose host, Chris Kimball, reported on the results on The\n                        Early Show. They promise delicious dishes without having to plug in a cord or light a match. More...Watch: Solar-Powered Cooking\n• EARLY SHOW: Finding The Secret To Success• EARLY SHOW: Poison Ivy Getting Worse, Researchers Say\n                     \t\t\t\t\t| Watch• EARLY SHOW: Shia LaBeouf Is On The Rise\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nFloods Blamed For 12 DeathsFlooding In Texas, Missouri, and Kansas has forced the evacuation of hundreds of residents and is being blamed for at least\n                                    a dozen deaths. Hari Sreenivasan reports.\nTOP VIDEOS\nPrinces Host Concert For Diana\nBush, Putin Meet In Maine\nExtreme Trans-Atlantic Rower\nBill Key In Hillary's Crusade?\nU.S. Security Tightened\nBoggs Has 'What It Takes?'\nVacation Education\nSolar-Powered Cooking\nHelping Troops Deal With PTSD\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesA Rwandan genocide survivor recalls her tale of survival. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMemory Of Murder:Cops say a mother implicated her son in a brutal murder; she says they are dead wrong. Tuesday,\n                           10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}