{"category": "ham", "to_address": "debian-devel@lists.debian.org", "from_address": "Sam Hocevar <sam@zoy.org>", "subject": "discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "   [Cc:ing -legal, but please try to follow-up on only one list]\n\n   I am having a chat tonight with people from the FSF. Despite the\ninevitable disagreements between Debian and the FSF, I am willing to\ncooperate in a constructive manner on as many topic as possible. Here\nare the topics we'll be discussing so far:\n\n    1. The GPLv3: the latest draft did not raise major objections from\n -legal and despite its concerns with the strategies developed in some\n sections, Debian does consider it DFSG-free. Debian will however not\n push for its adoption, mainly because we still have much software that\n is GPLv2-only in the distribution. We will discuss what role Debian\n could play in the official launch of the licence.\n\n    2. The GFDL: the Debian project does not consider the GFDL a free\n software licence as long as the work includes invariant sections. We\n decided (through a GR) that it was otherwise free, mainly because we\n expected the FSF to fix the (in our opinion) badly worded DRM clause.\n It is also not a licence we are willing to actively promote and we\n recommend double-licensing GFDL works under an additional free software\n licence such as the GPL.\n\n    3. Nexenta: Despite their incompatibility, Debian accepts both the\n CDDL and GPLv2 as valid free software licences and would welcome any\n solution to the distribution of a Debian system based on OpenSolaris. I\n have summarised Debian's concerns about the legality of distributing a\n system containing a CDDL libc and GPLv2 software such as Nexenta, and\n the FSF legal team is working on the issue and is going to answer us\n (it will take several weeks, though).\n\n   The timeframe is short but if you have additional topics to suggest\nI'll gladly bring them up. Also please correct me if what I have\ngathered does not seem to reflect the project's opinion.\n\nRegards,\n-- \nSam.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}