{"category": "ham", "to_address": "linux@vaneersel.eu", "from_address": "Luis Matos <gass@otiliamatos.ath.cx>", "subject": "Re: Proposal for a new CDD sub-project: Debian4Business", "body": "Hello there ...\n\n\n\nQua, 2007-04-18 às 15:24 +0200, linux@vaneersel.eu escreveu:\n> I would like to start a new sub-project called Debian4Business or perhaps\n> Debian-Office.I have a slight preference for the first name, but this is\n> discussable of course.\na bit of background.\nLast week i emailed debian-desktop list to propose as lenny release goal\nto add a task called \"enterprise-desktop\" and also one called\n\"enterprise-server\", names are not important. I am just giving my\nsupport to this.\n> \n> I have a small company, that provides legal services. About 6 months ago (I use\n> linux for more than 8 years already) all desktops are running Linux now. The\n> people using those desktops have no prior linux experience. I have tried several\n> distributions, but with every distribution I see problems appear with the people\n> that use it. These problem appear because no distribution is really focused on\n> business use within small and mid-sized companies.\n> \n> Of course there are some distro's with exactly this goal, however they are\n> usually commercial products/forks. Probably all very good distro's but also\n> awfully expensive, and that makes them not very interesting for small- and\n> mid-sized companies.\n> \n> I believe there is definetely a 'market' for a business oriented linux based on\n> open source/GPL/Debian social-contract, maintained for and by it's users instead\n> of a commercial base. The open source/GPL/DSC concept works for individuals, so\n> why it wouldn't/couldn't work for businesses?\n\nI think the majoraty of debian's instalations are in corportive\nenvironments, server And/or desktops. So i think that debian should have\nthe goal to give those users a better solution than the general one.\n> \n> My goal with this project is to create a CDD that provides it's users with the\n> tools they need to easily install and use the things a small and mid-sized\n> business needs in their working environment. This goes for both server and\n> desktop tasks. A small and mid-sized company often doesn't have a permanent\n> system manager, that's exactly why things have to be simple. Of course it should\n> also include the common office tools, like an office package (openoffice), email,\n> groupware, etc etc.\n\nMy first proposal was to create 2 tasks in tasksel. We have desktop\ntask, so we could add an enterprise-desktop task.\n\nMy point was to provide centralized authentication and information,\nhaving something like libpam-ldap and libpam-mount installed and\nconfigured by debconf's interface.\n\nFor -ldap is easy, just now, it just asks for the server, but -mount\nwould mount server partitions as well as user's desktop preferences.\n\nAlso, it would be given care to the tools and packages included.\n\nA cdd would be good for some first testing, but having it included in\ndebian would be great.\n> \n> I would very much like to hear the opinions of the developer community.\n> The first -and very important- step to be taken is to form a group of people that\n> support this goal and are willing to work on it.\n\ncount with me.\n> \n> If there are no major objections I will start to get things going.\n> \n> Regards,\n> \n>  \n> \n> Arjan van Eersel\n> ---- Dit bericht is verzonden via mijndomein.nl\n\nbest regards\n\nLuis Matos\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}