{"category": "spam", "to_address": "Wisdom <wisdom@flax24.uwaterloo.ca>", "from_address": "Aiden Macias <blanchard@gorvitovskiy.com>", "subject": "Crazy defoliator", "body": "\n\nLooking for an effective and cheap solution? Tired with your sexual problems? \nGo to the site\nBuy Licensed and Quality Viagra or Cialis at US Drug store now and you'll be at the top all night long!\nClick to visit us\nYou can find all medications at our online drugs store.\nWith best regards,\nAiden Macias\n \n \nRazrez v prostranstve, cherez kotoryj pronik Mag, medlenno zakryvalsia. Tak kak ne sobiralsia Zastrevat navechno v kakom-nibud neizvestnom mire, ne obladaiushchem mezhplanetnymi Sredstvami peremeshcheniia. Varsha, Lichnyj Znak Vlasti Hranitelia. Pod Plotnym i tiazhelym dorozhnym plashchom iz gruboj seroj shersti ugadyvalos krepkoe, Otlichno slozhennoe i iavno zakalennoe fizicheskimi uprazhneniiami telo, k tomu zhe, Nesmotria na surovyj obraz zhizni, vesma zhenstvennoe. \nTeper ono vyrazhalo gnev. Ono i verno, ne ta situaciia, chtoby pokazyvat norov, i horosho, Chto on eto ponimal. No menia, kak ia uzhe govoril, draka ne privlekala. Dve bezmolvnye statui s zastyvshimi glazami bez probleska mysli i ni Kapli krovi. Podozhdi, podozhdi, ne tak bystro, tolstiak protestuiushche vzmahnul rukami. Tfu na tvoiu golovu, podruga, razmechtalas dalshe nekuda. Tugoj hlopok lopaiushchegosia vozdushnogo shara. Mozhet byt, on tozhe Energeticheskij vampir, kak trans? Eshche cherez paru chasov, kogda glaza nachali protestovat boleznennym Zhzheniem, ia ostanovil mashinu i rastolkal Celitelia, vnutrenne udivliaias, Pochemu ia etogo ne sdelal ranshe. \nTot lezhal na spine i nenavidiashchim vzgliadom sledil za Ego priblizheniem. Nash razgovor s Celitelem zazvuchal u menia v golove tak Iavstvenno, slovno ia vernulsia vo vcherashnij den, k stenam Mezhkabaka: . Esli Ty hochesh dostavit mne nepriiatnosti, ty umresh. Vot eshche Ne hvatalo, pervyj raz, chto li. ejisuminyon Q1FUW1pVckRcUFBGHUFCUEZWRlleXR1XVA==\n \n\n\n"}