{"category": "spam", "to_address": "<the00@plg2.math.uwaterloo.ca>", "from_address": "\"Osmond Short\" <difiu@pg.com>", "subject": "They are currently on the receiving end of a particularly obnoxious set of \"shut them down without looking like we're trying too hard to shut them down\" state legislation.", "body": "\n\n\n\n\n\n\n\nphpA lot of the discussion surrounding healthy life \nextension focuses, understandably, on advances in medical science and how to best \nencourage funding and public understanding. We have already lost a great deal of \ntime in the path to developing real anti-aging medicine and cures for a wide range \nof age-related conditions.\nVisit the alert page to see how you can spend a few \nminutes to help out.\n\"I am a funeral director by trade and have seen \nmore than my share of death.\nFortunately, the community rallied round and the \nend result was close to the best success that anyone reasonably expected under the \ncircumstances.\nphpA great column at Madison.\nhtmlThe Weekend Australian reports from the ongoing \nInternational Conference on Longevity in Sydney.\nhtmlAt the root of it all, we recognize that \ncryonics is legitimate science - and we should defend legitimate science from those \nwho would try to ban everything unfamiliar and new. As you probably all know by now, \nI believe that a very important foundation to scientific progress is widespread \nsupport and understanding in society.\n\" If you're new to this whole stem cell business, \nread the introduction at InfoAging to see why this research is so vital to future \nhealth and longevity. How about the here and now, though? THE FUTURE OF OUR HEALTH \nLIES IN STEM CELL LINESWhy is the number of available stem cell lines so important \nto the future of our health and longevity? Preventative therapies to block the aging \nprocess will likely be far cheaper and more effective in the long run, but the \nscientific community has a long way to go to develop this sort of \ntechnology.\nThe winds of change are gusting, and people who \ndon't take note will be in for a series of rude awakenings down the line. I enjoy \ngood inspirational pieces like this; from the heart and with meaning.\nNew conferences, like new buildings, are signs of a \nhealthy, interested scientific community.\nPolitics, as a rule, isn't pretty or \nfair.\nSo drop by, or add us to your RSS aggregator. \" It \nis very gratifying to see that we, as a community, can make a real \ndifference.\n"}