{"category": "ham", "to_address": "Eric Thompson <ericthompso@gmail.com>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] error returned by \"make check\" in R-2.5.0", "body": "On Sat, 28 Apr 2007, Eric Thompson wrote:\n\n> Professor Ripley,\n>\n> Thank you for your comments.\n>\n> On 4/28/07, Prof Brian Ripley  wrote:\n>> How big is abs(lam - lam2[i])/Meps ?\n>\n> Here is the result on my system:\n>\n>> abs(lam - lam2[i])/Meps\n> [1] 60 18 17  0 12\n>\n> which is quite surprising to me that the maximum value exactly equals\n> the cutoff, so perhaps this is not such a big problem. I changed the\n> value to 61 in the reg-tests-1.R file, and then make check runs with\n> no errors.\n>\n>> This could be one of those cases where your system (which CPU, what\n>> compilers?) is unusually inaccurate, but Linux systems do not usually\n>> differ much in their accuracies on the same CPU.\n>\n> It is somewhat disconcerting that my system is unusually inaccurate.\n> I'm running Intel Xeon 3.20GHz CPUs and I've been using gcc 4.1.1 and\n> ifort to compile R (these are what the compile script choose by\n> default on my system). Perhaps it is a bad idea to mix the GNU and\n> Intel compilers?\n\nAh, ifort is less accurate than gfortran quite often, because it cares \nmore about speed.  It all depends on the version: on my Opteron x86_64 \nsystem and icc/ifort 9.1 the test passes, whereas on a i686 (older Xeons) \nwith icc/ifort 9.0 quite a few tests fail unless optimization is turned \ndown.  (I guess those Xeons could be either architecture.)\n\nWe will raise the limit a bit, as this seems a little too strigent.\n\n[...]\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}