{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Ralph W. Reid\" <rreid@sunset.net>", "subject": "Re: three hds? is this possible?", "body": "Do you know whether this third drive has been partitioned and\nformatted?  Are the jumpers on this drive set for master or slave?\nGenerally, each IDE controller can handle two devices--one master and\none slave.  This means that with two IDE controllers (sometimes\nsupplied directly on a mother board), you can have up to four IDE\ndevices in one system--as long as the power supply can handle them\nwithout overloading and burning out.  Here on my Slackware 11.0\nsystems, the IDE drives are listed under /proc/ide as 'hd?@', where\nthe question mark is 'a' or 'c' to designate either drive 'hda' or\n'hdc', and the trailing at sign (@) indicates that these are pointers\nto the actual directories where the drive info can be found.  If your\nnewly installed IDE drive is not listed in /proc/ide, then you might\nneed to change a jumper on the drive to change it to master or slave\nso that the system will see it.  Once the drive is found by the\nsystem, you will need to partition it with something like fdisk, and\nput a file system on it with mkfs or one of the more specialized\nprograms like mke2fs.  A little more info about your system (how many\nIDE cables do you have, which version of Linux are you working with,\netc.) might be helpful if fiddling with jumpers does not solve the\nproblem.\n\nHTH, and have a great day.\n\nOn Thu, May 17, 2007 at 10:25:31AM -0600, TheCreator wrote:\n> Hello list,\n> I read somewhere on google that it was possible to hook 3 hds up to a system with out the raid card.\n> It said that you could disconnect the cd drive, and use the IDE cable from that to hook up a hd.\n> My problem, is I'm running out of room. I've got like 38gb of music, and other files, and my hd is only 40 gb.\n> My idea was to move some folders that are expanding like the music folder to the other hd, and then mount it in media where the normal music folder was, and call it music.\n> Any help would be appriciated.\n> I tried hooking it up to the ide cable on the cd drive like it told me, and it didn't register it.\n> Thanks,\n> ~~TheCreator~~\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n-- \nRalph.  N6BNO.  Wisdom comes from central processing, not from I/O.\nrreid@sunset.net  http://personalweb.sunset.net/~rreid\n...passing through The City of Internet at the speed of light...\nCIRCLE AREA = _pi * r ^ 2\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}