{"category": "ham", "to_address": "ip-health <ip-health@lists.essential.org>, e-drug@healthnet.org,\n   thaifta lists <thaifta@lists.riseup.net>, aidsdrugs@lists.riseup.net", "from_address": "Kannikar KIJTIWATCHAKUL <kakablue@yahoo.com>", "subject": "[Ip-health] Health vs economic interests", "body": "Health vs economic interests\n\nWhy are the ministries of commerce and foreign affairs\ndoing nothing to explain to the outside world\nThailand's decision on compulsory licensing?\n\nBy APIRADEE TREERUTKUARKUL , Bangkok Post, 4 May 07\n\nIn a move that hopefully will instigate all developing\ncountries to step up their rightful fight for access\nto affordable medicine, the Thai government's bold\ndecision to bypass patent laws on three drugs for the\ntreatment of Aids and heart ailments is, however,\ncoming under increasing pressure from domestic as well\nas international politics.\n\n>From abroad, the United States' Office of the Trade\nRepresentative's downgrading early this week of\nThailand on its ''Priority Watch List'' of countries\nto be closely monitored for protection of intellectual\nproperty rights, is viewed as a punishment for\nThailand's announcement of compulsory licensing (CL)\nfor the Aids drugs Efavirenz and Kaletra and the heart\ndrug Plavix.\nThis downgrade could lead to a lifting of the\ngeneralised system of preferences (GSP) currently\nenjoyed by Thai exporters, particularly in the gems\nand jewellery sector whose trade volume is worth\naround 7.5 billion baht annually.\n\nDespite US ambassador to Thailand Ralph Boyce's\nstatement that the USTR's decision did not stem from\nthe compulsory licensing alone, the issue is the only\nnew reason cited in the Special 301 Report, the USTR's\nannual review of the global state of intellectual\nproperty rights protection and enforcement.\n\nPublic Health Minister Mongkol Na Songkhla, who\nspearheaded the daring policy to give wider access to\nimportant medicines for people who cannot afford\nexpensive drugs, and Department of Intellectual\nProperty chief Puangrat Assawapinit, were not really\nsurprised.\n\nDr Mongkol insists Thailand's move is lawful and fully\nwithin the framework allowed by the World Trade\nOrganisation's Agreement on Trade Related Aspects of\nIntellectual Property Rights (TRIPS) and that the Thai\npeople's health should come first.\n\n''We carefully considered the economic interest and\nthe matter of life and death of the people before\nannouncing the compulsory licensing. Economic\ninterests cannot be compared with saving human lives\nand protecting the public health,'' Dr Mongkol said.\n\nThe health minister said the latest response from the\nUnited States clearly demonstrates the clout American\npharmaceutical companies have on the USTR.\n\nThailand's issuing of CL has rattled the\nmulti-billion-dollar ''big pharma'' business from the\nvery start. Drug firms continue to claim that the move\nto forcibly substitute more expensive, patented drugs\nfor lower-priced generic versions would destroy the\npharmaceutical industry, and make patients happy for a\nday but produce long-term shortages.\n\nThanks to Thailand's implementation of the compulsory\nlicensing for the Aids drug Efavirenz last November,\nthe patent owner Merck announced a worldwide price cut\nto 725 baht from 1,500 baht per month per patient.\n\nIn addition, the announcement of the licences to\noverride patents for Aids and heart drugs Kaletra and\nPlavix in late January has led to radical changes in\nthe response from Kaletra's patent holder Abbott\nLaboratories.\n\nThe pharma giant at first declared it would not\nregister new drugs in Thailand but later changed its\ntone to offer a price cut for both Kaletra and its\nimproved version called Aluvia at an equal price of\n3,488.20 baht.\n\nAlthough the planned CL has not yet been implemented\nand the decision to buy either the original or generic\ndrugs will not be made until the existing stockpile of\nthese medicines runs low, probably in August, the\nmovement has evidently proven effective and beneficial\nto Thailand.\n\nIt has also offered hope for developing countries to\nfollow in this direction if they hope to have any\nbargaining power with the powerful pharmaceutical\nbusiness.\n\nThere is no doubt the drug companies including the\nUS-based Abbott will lobby their governments to put\npressure on Thailand for breaking their drug patents.\nThere is the question, however, that whether the Thai\nattempt to bypass patents _ an action permitted by the\nWTO _ so as to save millions of lives, should be tied\nto the illegal violation of property rights relating\nto entertainment or luxury products, leading to trade\nretaliation.\n\n''Unfortunately, most people affected by these\ndiseases are the poor who have neither power nor money\nto pay for lobbyists unlike the pharmaceutical giants.\n\n''For a small, low-income, developing country like\nThailand, even if what we've done is the right thing,\nit can turn out to look wrong in the eyes of big\ncountries like the United States,'' Dr Mongkol said.\n\nHe added that the United States itself had granted\ncompulsory licenses for several drugs.\n\nIn 2005, the Federal Trade Commission announced a\nconsent agreement which would protect competition and\nconsumers in several significant medical device\nmarkets.\nAbbott was awarded a compulsory licence for Boston\nScientific's patented stent technology that is now\npoised to generate huge profits for the firm, after a\nstudy showed the drug-coated stent was better at\ntreating clogged heart arteries.\n\nWith a per capita GDP of roughly one-sixteenth that of\nthe United States, the Thai health system is, on the\nother hand, under threat of going bankrupt: one of the\nbiggest expenses is the cost of medical treatment.\nA huge healthcare budget has been spent on providing\nfree drugs under the three health schemes for civil\nservants, employees of the private sector and the\nestimated remaining 47 million population.\n\nAmong these drugs are costly anti-Aids medicines and\nthose for chronic illnesses such as cancer and heart\ndisease which are the country's top three causes of\ndeath each year.\n\nTherefore, seeking the right to access cheaper drugs\nvia compulsory licensing seemed the last resort to\nsave the national health system.\n\nIs the Public Health Ministry the only Thai agency\nwhich sees the importance and necessity of breaking\nthe drug patents for the survival of its healthcare\nservices? And here comes the squeeze from within.\nSince the announcement was made several months ago, Dr\nMongkol seems to be the only minister defending the\naction. No support has come from such related agencies\nas the Commerce or Foreign Affairs portfolios.\n\nFormer Bangkok senator and health activist Jon\nUngpakorn pointed to the lack of unity among the\nrelevant ministries in pushing for the CL to succeed,\nas a possible flaw which Washington may have picked up\non before bringing in the trade retaliation.\n\n\nAfter this, the US can negotiate with Thai\ntrade-related authorities who are seen as being more\nkeen on commercial interests than on in-depth details\nrelated to access to affordable medicine.\n\n''The three involved authorities should have worked\ntogether as a team rather than deserting the Public\nHealth Ministry to handle the task alone. We're living\nin a world of capitalism in which everything, even the\nmatter of life and death of one person, can be turned\ninto profit and benefits for others,'' Mr Jon\ncommented.\n\n''The issue of CL is very important not only for\nThailand but also other developing nations. If\ninvolved authorities of this government fear to do the\nright thing for the nation simply because of a threat\nfrom a big country this time, don't even hope that we\nwill have a chance to fight for anything right in the\nfuture,'' Mr Jon said.\n\nAs executive secretary-general of the Aid Access\nFoundation, Mr Jon late last month participated in the\nannual meeting of Abbott Laboratories stakeholders\nheld in Chicago, and found there was a lot of\nmisunderstanding in the eyes of foreigners regarding\nThailand's decision to push for CL, mainly because of\nthe lobbyists for drug companies. Some claimed\nThailand was breaking the patents for up to 30 drugs.\n\nHe believed the Ministry of Foreign Affairs should be\nmore responsible in explaining the issue _ of\nThailand's necessity and needs _ to the global\ncommunity so that they will at least understand that\nthe action taken has been a lawful one.\n\nMeanwhile, Jiraporn Limpananont, an academic at\nChulalongkorn University's Faculty of Pharmaceutical\nSciences, said it was essential that the Commerce\nMinistry and the Department of Intellectual Property\nproceed cautiously and leave some room for the\nprotection of public health when amending the Patents\nAct.\n\nThe amendment was part of the US' proposal on the\nprotection of intellectual property (IP) rights, which\nwould be included in the still-to-be concluded Thai-US\nFTA pact. The US has demanded Thailand allow it to\npatent not only drugs but also diagnostic, therapeutic\nand surgical procedures for the treatment of humans or\nanimals, which would inevitably force Thais to\nshoulder high medical treatment costs.\n\nThe US has also called for a three- to 10-year\nextension of the patent protection on drugs and\nagricultural chemical products.\n\nMs Jiraporn foresaw that the Thai public welfare\nsystem, including the 30-baht healthcare scheme, would\ncompletely collapse if the government submitted to\nWashington's demands.\n\nHowever, according to the revised version of the\nPatents Act that was put to the scrutiny panel of the\nPrime Minister's Office and which awaits cabinet\napproval for the National Legislative Assembly's\nendorsement, the amendment includes an alteration to\nArticle 7 of the law to allow evergreening patents on\nplants and animals, which would enable the patent\nholder to extend their patent duration by declaring\nnew chemical substances.\n\nAnother concern is the proposed cancellation of the\npre-grant opposition system. It has been the practice\nto allow concerned people to oppose a patent\napplication before it is granted. However, the\nministry proposed a so-called ''post-grant\nopposition'' for the amendment, meaning they would\ngrant a patent first and listen to any opposition\nlater.\n\nMs Jiraporn also said that allowing the Commerce\nMinister to identify which illnesses are in line with\nthe language of the Doha Declaration, was highly\ninappropriate.\n\nBanyong Limprayoonwong, deputy director-general of the\nDepartment of Intellectual Property, said that health\nofficials could not do anything to the amended Patents\nAct since it had already passed the revision process.\nIt was now up to the cabinet's prerogative to either\naccept or reject the submitted draft before sending it\nto the National Legislative Assembly for endorsement.\n\nThough it may appear that Dr Mongkol and the Health\nMinistry have won this round in expanding access to\ndrugs at more affordable prices for the people, the\nbattle is proving to be longer and more arduous than\nanybody may have thought.\n\nWith continuing pressure from the United States and\nfrom our own Commerce Ministry to amend the Patents\nAct, it remains to be seen if public health will\ntriumph over commercial interests and win the war to\nmake drugs cheaper for everyone in the long run.\n\n\n\nKannikar KIJTIWATCHAKUL (Kar)\nMobile 66-85-0708954\nkakablue@yahoo.com\n\n\n\n____________________________________________________________________________________\nTV dinner still cooling?\nCheck out \"Tonight's Picks\" on Yahoo! TV.\nhttp://tv.yahoo.com/\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}