{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "Reliable Sources <reliablesrc@mail.cnn.com>", "subject": "This Week on Reliable Sources", "body": "\n\n\nCNN.com\n\n\n\n\n\n\n\n\n\n\nComing up this Sunday on Reliable Sources: \n\nD.C. Madam: The story that wasn't\n\nAfter\nweeks of pumping up the idea that the DC Madam's clientele list\nwas full of big beltway names, ABC's 20/20, which had exclusive\nrights to the list, didn't air any new names on the show this\nFriday.  So what was this hype all about? and did ABC do the\nright thing by releasing these names?\n\nThe GOP plays\n\"Hardball\"  \nIn their first nationally televised\ndebate, Republican presidential hopefuls squared off with\nMSNBC's Chris Matthews. Was he fair? Plus, how the media is\nhandling the political showdown over funding U.S. troops in\nIraq.\n\nMurdoch's Expanding Empire\n\nRupert Murdoch makes a play for the Wall Street Journal.\nWould the media moguls bid be good for the nation's largest\nfinancial newspaper, or is this a case of bigger isn't always\nbetter?\n\nPlus,  Imus may not be leaving CBS\nquietly.  The sharp-tongued media mogul's lawyer says he was\nwrongly dismissed for his slur against the Rutger's women's\nbasketball team, and a fight over $40 million dollars is\nbrewing.  All that and more, on this week's Reliable Sources!\n\nJoin us this Sunday and every Sunday at 10am ET /\n7am PT for our critical look at the media! \n\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the Reliable Sources list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=reliablesrc\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}