{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Irilenia Nobeli <irilenia.nobeli@kcl.ac.uk>", "subject": "[R] Question on RandomForest in unsupervised mode", "body": "Hi,\n\nI attempted to run the randomForest() function on a dataset without  \npredefined classes. According to the manual, running randomForest  \nwithout a response variable/class labels should result in the  \nfunction assuming you are running in unsupervised mode. In this case,  \nI understand that my data is all assigned to one class whereas a  \nsecond synthetic class is made up, which is assigned to a second  \nclass. The online manual suggests that an oob misclassification error  \nin this two-class problem of ~40% or more would indicate that the x- \nvariables look like independent variables to random forests (and I  \nassume that in this case the proximities obtained by the randomForest  \nwould not be informative for clustering).\n\nWhen I run randomForest() in the unsupervised mode my first problem  \nis that I get NULL entries for the confusion matrix and the err.rate,  \nbut I suppose this is normal behaviour. My only information (apart  \nfrom the proximities of course), seems to be the votes, from which I  \ncan deduce whether the variables are meaningful or not. The second  \nproblem is that, in my case, all my observations seem to have about  \n20-40% of the votes from class 1 and the rest from class 2 (i.e.  \nclass 2 \"wins\" always). Assuming that class 1 was assigned to my  \noriginal data, I'd say this is rather surprising.\nInitially I thought this was simply a problem of my data not being  \nmeaningful, but I repeated simply the forest with the \"iris\" example  \ndata and I get more or less the same result.\nI did simply:\n\niris.urf <- randomForest(iris[,-5])\niris.urf$votes\n\nand I got again most of the votes coming from class 2, although here  \nvote percentages are slightly more balanced than with my data  \n(approximately 40 to 60% most of the time).\n\nHas anyone got experience with unsupervised randomForest() in R and  \ncan explain to me why I'm observing this behaviour? In general, any  \nhints about pitfalls regarding random forests in unsupervised mode  \nwould be very much appreciated.\n\nMany thanks in advance,\n\nIrilenia\n\n-----------------------------\nIrilenia (Irene) Nobeli\nRandall Division of Cell and Molecular Biophysics\nNew Hunt's House (room 3.14)\nKing's College London, Guy's Campus\nLondon, SE1 1UL\nU.K.\nirilenia.nobeli@kcl.ac.uk\n+44(0)207-8486329\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}