{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Rogelio Hale\" <maccbcintldoc@cbcintl.org>", "subject": "You'll love the new, non-obese you", "body": "\nObesity is dangerous, stop it\n\n\n\n\n\nAnatrim – The very up-to-date and most enchanting product for over-weight people is now readily available – As were told on BBC\n\n\n\nDid you understand that excessive body kilograms kill very much people around the planet? We know you hate the unsightly look of people like those and the low status they have in modern society. \n\nOr, maybe, you can not withstand pressure of ruinous eating habits of yours. If it sounds familiar, then we got something to propose to you!\n\n\n\n\n\nHere Anatrim comes, the recent product for the reduction of your body’s extra weight. The most astounding thing is that Anatrim improves the quality of your life, repressing the feeling of hunger and giving you better spirit. Read what people write about this product:\n\n\n\n\n\n\"It’s outstanding! \n\n\nInstead of watching TV and eating anything close at hand \n\n\nI became keen on exercise.\n\n\n\n\n\n\n Anatrim set me on the right path.\n\n\n I have a great figure now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nMaria H., Colorado\n\n\n\n\n\n\n\"I tried some passive weight burning, but to no purpose. This terrible hunger would just rush in and spoil everything. \n\n\nOnce I heard about Anatrim in the commercial and I rather liked the information.\n\n\n I had tried using it, and my wife said that I look very good now, 3 months later. \n\n\n29 pounds off and this is still far to an end! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nMikkey Fox, San Francisco\n\n\n\n\n\nAnatrim gives you an opportunity to realize that you don't need that much food. It improves your spirit, provides you with additional energy, and attacks useless kilos. All thanks to its mighty newly-elaborated formula!!\n\n\n\nPry out more useful information!\n\n\n\n"}