{"category": "ham", "to_address": "\"avcavc\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"AccuWeather.com Alert\" <inbox@messaging.accuweather.com>", "subject": "AccuWeather.com Alert(tm) Advisory  (avcavc)", "body": "\n\nAccuWeather.com Alert[TM]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSevere Watches and Warnings for BEVERLY HILLS \n\n\n\n\n\n\n\n\n\n\n\n\n\nLOXCFWLOX\r\nWHUS46 KLOX 270321\r\nCFWLOX\r\n\nCOASTAL HAZARD MESSAGE\r\nNATIONAL WEATHER SERVICE LOS ANGELES/OXNARD CA\r\n821 PM PDT THU APR 26 2007\r\n\n..HIGH SURF EXPECTED ON EXPOSED WEST FACING SHORES...\r\n\nHIGH SURF WILL CONTINUE AND STRONG RIP CURRENTS WILL PERSIST\r\nTHROUGH MUCH OF TONIGHT ALONG EXPOSED WEST FACING SHORES. A LARGE\r\nNORTHWEST SWELL WILL BRING THE HIGHEST SURF CONDITIONS TO THE\r\nCOASTAL AREAS OF SAN LUIS OBISPO AND WESTERN SANTA BARBARA\r\nCOUNTIES. DUE TO THE LONGER PERIOD OF THE SWELL...SOME OF THIS\r\nENERGY WILL SPREAD INTO THE INNER COASTAL WATERS...RESULTING IN\r\nHIGHER THAN NORMAL SURF CONDITIONS ACROSS WEST FACING BEACHES OF\r\nLOS ANGELES AND VENTURA COUNTIES.\r\n\nCAZ034-035-270930-\r\n/O.EXT.KLOX.SU.Y.0007.000000T0000Z-070427T1000Z/\r\nSAN LUIS OBISPO COUNTY CENTRAL COAST-\r\nSANTA BARBARA COUNTY CENTRAL COAST-\r\n821 PM PDT THU APR 26 2007\r\n\n..HIGH SURF ADVISORY NOW IN EFFECT UNTIL 3 AM PDT FRIDAY...\r\n\nTHE HIGH SURF ADVISORY IS NOW IN EFFECT UNTIL 3 AM PDT FRIDAY.\r\n\nBREAKERS BETWEEN 10 AND 12 FEET WILL CONTINUE OVERNIGHT...WITH\r\nHIGHEST SURF CONDITIONS ON WEST AND NORTHWEST FACING BEACHES. THE\r\nSURF IS EXPECTED TO BEGIN SUBSIDING LATER TONIGHT.\r\n\nA HIGH SURF ADVISORY MEANS THAT HIGH SURF WILL AFFECT BEACHES IN THE\r\nADVISORY AREA...PRODUCING STRONG RIP CURRENTS AND LOCALIZED BEACH\r\nEROSION. ALL PERSONS SHOULD BE AWARE OF THE RISKS ASSOCIATED WITH\r\nWATER RELATED ACTIVITIES AND USE EXTREME CAUTION WHEN ENTERING THE\r\nOCEAN. WHEN IN DOUBT...JUST STAY OUT.\r\n\n$$\r\n\nCAZ040-041-270930-\r\n/O.EXT.KLOX.CF.S.0006.000000T0000Z-070427T1000Z/\r\nVENTURA COUNTY COAST-\r\nLOS ANGELES COUNTY COAST INCLUDING DOWNTOWN LOS ANGELES-\r\n821 PM PDT THU APR 26 2007\r\n\n..HIGHER THAN NORMAL SURF EXPECTED TO CONTINUE...\r\n\nHIGHER THAN NORMAL SURF EXPECTED TO PERSIST AT THE LOS ANGELES AND\r\nVENTURA COUNTY BEACHES OVERNIGHT. BREAKERS BETWEEN 4 AND 6 FEET\r\nWITH LOCAL SETS TO 8 FEET CAN BE EXPECTED ACROSS WEST FACING\r\nBEACHES. THE SURF WILL START TO DIMINISH LATE TONIGHT.\r\n\nTHE HIGHER THAN NORMAL SURF CONDITIONS WILL LIKELY PRODUCE STRONG\r\nRIP CURRENTS. ALL PERSONS SHOULD BE AWARE OF THE RISKS ASSOCIATED\r\nWITH WATER RELATED ACTIVITIES AND USE EXTREME CAUTION WHEN ENTERING\r\nTHE OCEAN. WHEN IN DOUBT...JUST STAY OUT.\r\n\n$$\r\n\nSIRARD\n\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChoose another forecast:\n\t\t\t\t\t\t\t\t\t\tEnter a zipcode, or a city, state\n  \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n©2007\n\t\t\t\t\t\t\tAccuWeather, Inc. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}