{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CNN Student News <CNNStudentNews@cnn.com>", "subject": "May 18, 2007", "body": "CNN.com Student News Newsletter\n\n\n\n\n\n\n \nFriday, May 18, 2007 \n\n\n\n Watch and Learn\nA report on a new immigration bill leads off our last broadcast of the week. Then, we review the week's top stories. And we travel to New York City, where officials from around the globe met to discuss climate change.\n\n New Fla. law requires P.E. in elementary schools\nElementary school students must have at least a half-hour of physical education each day under a bill signed Thursday by health-conscious Gov. Charlie Crist. \n\n May 21, 2007 - Grady's Anatomy\nWarning to educators: Please preview this program as it contains content that might be inappropriate for some students.Grady's Anatomy chronicles the challenges and pressures faced by Dr. Sanjay Gupta and four residents at Grady Memorial Hospital in Atlanta, Georgia, as they care for patients in an inner city hospital and juggle 80-hour workweeks with their personal lives. Record the commercial-free CNN Classroom Edition every Monday between 4:00 am and 5:00 am ET. Educational materials for the episodes are available at CNN.com/EDUCATION. Please note that CNN Classroom Edition may be pre-empted at any time for coverage of breaking news.\n\n Week of May 14\n1. Jamestown, Virginia2. Saudi Arabia3. Jerry Falwell4. subsidies5. Georgia, Florida6. Prince Harry7. Al Anbar8. New York9. Armed Forces Day10. AlaskaAccess this week's Newsquiz here!\n\n\n\n\n \nCNN Student News is a 10-minute, commercial-free news program that airs on CNN Headline News at 3:12 a.m. EST as well as on CNN.com/EDUCATION. Created by a team of journalists and educators, the program provides the top stories of the day, segments that encourage student participation, and in-depth special reports. In addition, CNN Student News provides free curriculum at CNN.com/EDUCATION to accompany each program's content. CNN Student News, along with CNN Classroom Edition, is Turner Broadcasting's contribution to Cable in the Classroom.\n Forward this to a friend\nYou have received this email because you have signed up to receive the CNNStudent News newsletter. Click here to unsubscribeEdit your profile here  \n"}