{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's Newsnight and Newsnight Review", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tFRIDAY 1 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM KIRSTY WARK\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nALAN JOHNSTON\n\n\nToday the world saw a video of the missing BBC journalist Alan Johnston - seen for the first time since his capture in Gaza more than two months ago. \n\n\nIn the video, released by the Palestinian jihadist group The Army of Islam, Alan Johnston said he was fit and well, and spoke about the \"suffering\" of the people in the Palestinian territories, Iraq and Afghanistan, before an unidentified man speaking in Arabic called for the release of \"our prisoners.\"  So how much more do we now know about his captors and what their demands might be?\n\n\nCHILD PORNOGRAPHY\n\n\nAlso tonight, there has been strong reaction to the argument put forward today by a chief police officer in charge of child protection. Jim Gamble, the Chief Executive of the Child Exploitation and Online Protection centre, said that not all paedophiles should necessarily be sent to prison and they should be offered treatment in the community.  \n\n\nHe suggested offenders who have committed crimes such as viewing child pornography, rather than sexual assault, could be dealt with this way. Mr Gamble described it as adopting a \"much more intelligent posture\" and \"engaging with the predator\". Tonight a man convicted and imprisoned for downloading child pornography - and a woman who was abused by several paedophiles - debate. \n\n\nBLAIR IN SOUTH AFRICA\n\n\nTony Blair's Farewell World Tour hit South Africa today where he spoke to Thabo Mbeki about Zimbabwe - praising the South African president's efforts. It was his big chance to lay it on the line over Robert Mugabe.  So why didn't he?\n\n\nENGLAND FRIENDLY\n\n\nAnd ... Beckham's back to play in the first England international at the new Wembley stadium.  We'll review the big friendly with Brazil.   \n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nAFGHAN FURY\n\n\t\t\t\t\t\t\tAlastair Leithead joins Afghanistan's President Karzai in an area which claims it lost many civilians to US bombs\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\nnewsnight review\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tPRESENTED BY KIRSTY WARK\n\t\t\t\t\t\nDAMIEN HIRST SPECIAL\n\n\nAnd then on a special edition of Newsnight Review, an in depth exclusive interview with the man who today produced a diamond and platinum skull expected to fetch 50 million pounds. At nine o'clock sharp this morning, the artist Damien Hirst revealed the most expensive piece of art by a living artist, at his latest and largest exhibition - Beyond Belief - at the White Cube Galleries in London. \n\n\nFor The Love of God - the name he has given to a platinum cast of a human skull set with more than 8000 diamonds, cost an astonishing 14 million pounds to make and is expected to fetch 50 million dollars. We have extraordinary pictures of the skull which you might call beautiful, obscene, or morbid according to your point of view. \n\n\nThroughout his career Damien Hirst has been the object of intense scrutiny, and knows how to make a splash. It began with Freeze, the 1988 show he curated while he was still a student at Goldsmiths in London. That show put Hirst and his fellow students - Sarah Lucas, Gary Kemp and Angus Fairhurst - on the map.\n\n\nHirst created some of the iconic art works that defined the 1990s including his series of animals in formaldehyde, and his series of spots, spins, butterflies and animals in vitrines. Much of it was bought by the collector Charles Saatchi whose patronage of young British artists led to what was known as Brit art. \n\n\nHirst won the Turner Prize in 1995 and he became the self styled enfant terrible of the art world - his legendary excess drew as much if not more attention than his art. \n\n\nAround him is a team of more than a hundred people who produce his artworks, and oversee his many business projects, from restaurants to his pursuit of a world class art collection - which include some of his artistic heroes Bacon, Warhol and Koons, as well as contemporaries and emerging artists.\n\n\nHirst calls his new show a collection of greatest hits - there are butterflies and vitrines including the terrifying St Sebastian as well as two series of paintings - the brand new biopsy paintings of cancer cells and the fact paintings featuring the birth by caesarean section of Damien's third son Cyrus.\n\n\nBut the piece that has attracted all the media attention is For the Love of God.\n\n\nTune in to see it at 11pm.\n\n\nKirsty\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}