{"category": "ham", "to_address": "november-d@november.org", "from_address": "Richard Lake <rlake@mapinc.org>", "subject": "Nov-D: US: Employers Grapple With Medical Marijuana Use ", "body": "Newshawk: Educators For Sensible Drug Policy: http://www.efsdp.org\nPubdate: Tue, 17 Apr 2007\nSource: USA Today (US)\nPage: B1, Front Page of the Money Section\nWebpage: http://www.usatoday.com/printedition/money/20070417/1a_cover11.art.htm\nCopyright: 2007 USA TODAY, a division of Gannett Co. Inc\nContact: editor@usatoday.com\nWebsite: http://www.usatoday.com/printedition/news/index.htm\nDetails: http://www.mapinc.org/media/466\nAuthor: Stephanie Armour, USA TODAY\nCited: Marijuana Policy Project http://www.mpp.org\nCited: Americans for Safe Access http://www.safeaccessnow.org\nBookmark: http://www.mapinc.org/mmj.htm (Marijuana - Medicinal)\nBookmark: http://www.mapinc.org/people/Irvin+Rosenfeld\nBookmark: http://www.mapinc.org/people/Donald+Abrams\nBookmark: http://www.mapinc.org/people/Robert+Washburn\n\nEMPLOYERS GRAPPLE WITH MEDICAL MARIJUANA USE\n\nEthical, Liability Issues Rise As More States Make It Legal\n\nOn a typical weekday, stockbroker Irvin Rosenfeld has a marijuana \ncigarette before work, then goes to his firm's smoking area for \nanother after he gets to the office. By day's end, he usually has \nsmoked more than a half-dozen joints -- and handled millions of \ndollars' in clients' holdings.\n\nThere's nothing illegal about it. Rosenfeld, 54, of Fort Lauderdale, \nhas a condition that causes benign tumors in the long bones of his \nbody. After trying to control pain by taking narcotics such as \nDilaudid, he persuaded the U.S. government to put him in a test \nprogram that gives marijuana to people with certain illnesses. His \npain is now manageable, he says.\n\n\"I've smoked 10 to 12 marijuana cigarettes a day for 25 years,\" says \nRosenfeld, adding he gets no euphoric effect from the drug. \"All my \nclients know I use it. Without it, I wouldn't be able to work.\" His \nfirm, Newbridge Securities, supports his use of marijuana and says it \nhasn't hurt his performance.\n\nIn Florida, Rosenfeld is an exception to state law that bans \nmarijuana's use in any situation. But at a time when the use of \nmedical marijuana is expanding -- this month, New Mexico became the \n12th state to allow it -- the issue is raising a range of ethical and \nliability questions for employers across the nation.\n\nSome companies, wary of marijuana's impact on employee performance, \ncontinue to fire those who test positive for the drug, even when its \nuse is sanctioned by their state for medical purposes.\n\nThose companies include Columbia Forest Products, a manufacturer of \nhardwoods based in Oregon, one of the states that allows medical \nmarijuana. Even as the company maintains its zero-tolerance policy \ntoward drug use, it has faced legal action because its company rules \nconflict with Oregon's medical marijuana law.\n\nA few companies, such as Newbridge Securities, have embraced the \nnotion of employees using medical marijuana at work.\n\nMeanwhile, there are questions about whether medical marijuana laws \nwould offer any protection to employers if a worker who used \nmarijuana to treat pain ended up injuring others or making a mistake \non the job. It's unclear whether such an incident has occurred.\n\n\"The rights of an employer to ensure productivity and safety around \nmachinery and on the job has to take precedence,\" says Mark Levitt, a \nlabor and employment lawyer in Tampa. \"The use of marijuana has an \neffect on employees' ability to perform. That's a big concern for employers.\"\n\nMarijuana's effectiveness as a pain reliever is widely debated, and \nthe Food and Drug Administration has not approved it for medical use. \nIt's used by patients with a variety of ailments, including cancer, \nglaucoma, AIDS or HIV, Crohn's disease, hepatitis C and multiple \nsclerosis, says the Marijuana Policy Project, a Washington, \nD.C.-based non-profit organization that supports easing restrictions \non the drug.\n\nThe FDA considers marijuana a controlled substance with a very high \npotential for abuse and says that the drug has no accepted medical \nuse and that there is a lack of accepted safety data for use under \nmedical supervision. The American Medical Association doesn't support \nmarijuana's medical use but has urged further studies on its effectiveness.\n\nSome doctors, however, see a treatment role for the drug.\n\nDonald Abrams, chief of hematology and oncology at San Francisco \nGeneral Hospital, said in an e-mail: \"As a cancer doctor, every day I \nsee patients with nausea from their chemotherapy, loss of appetite, \npain and depression. As I am a physician in California,\" which allows \nmedical marijuana, \"I can advise these patients that they might \nconsider trying marijuana for relief of all of these symptoms.\"\n\nAbrams says the key ingredient in marijuana, THC, is available in \npill form. But he says smoking marijuana is more effective because it \nleads to a more potent concentration of the drug in a user's system. \nHe says it's unusual for patients to smoke as much as Rosenfeld, but \nthe drug supplied by the U.S. government has relatively low potency.\n\nHe also says marijuana smoking is associated with a lower risk of \ndeveloping lung cancer. Marijuana costs $35 to $75 for 1/8 of an \nounce, according to Americans for Safe Access (ASA), a non-profit \nbased in Oakland, that has pushed for greater acceptance of medical \nmarijuana. Still, most patients must pay for their own marijuana \nbecause it usually is not covered by medical insurance.\n\nAn estimated 300,000 people in the USA use medical marijuana, based \non estimates from data on registered medical users from ASA.\n\nAs the number of states allowing its use increases, employers are \nstarting to grapple with how to deal with the issue. Few disputes \nabout medical marijuana's impact on the workplace have made it to \ncourt, but many employers say they would have concerns if a worker \nneeded marijuana treatments.\n\nAlthough Oregon is among the states allowing medical marijuana, \nHunter-Davisson, a mechanical contracting firm in Portland, maintains \na drug-free policy, conducts drug tests and says it would not allow \nan employee to use the drug as a pain reliever.\n\n\"To let anyone work impaired is not anything you would want to be \nresponsible for,\" says Dave McCotter, safety manager at Hunter. \"We \ncouldn't have them driving our trucks.\"\n\nEven in New York and other states that do not allow medical \nmarijuana, companies are beginning to debate the issue.\n\nMelek Pulatkonak, president and chief operating officer of Hakia, a \nfledgling Internet search engine company in New York City, says that \n\"our concern would be: How does an employee (using medical marijuana) \nreally focus? We would have to be sure their mind is clear.\"\n\nPulatkonak says the company might consider flexible work hours to \naccommodate an employee's marijuana use in such an instance.\n\nNone of the states with medical marijuana laws requires employers to \nmake accommodations for the use of the drug in the workplace, says \nBruce Mirken, spokesman for the Marijuana Policy Project.\n\nYet, there are legal gray areas for companies, say employment lawyers \nsuch as Richard Meneghello of Portland, Ore., who does seminars for \ncompanies on the topic.\n\nHe says many employers remain uncertain about whether they can fire \nor deny employment to users of medical marijuana, or whether to \naccommodate them by allowing use only at home or in an area at work \nwhere they can smoke.\n\n\"It's almost an untenable situation. Employers are screaming for \nanswers,\" Meneghello says. \"We know they're looking for clear \nanswers, and there's not one out there right now. There's a lot of \nuncertainty. Employers are living in a dangerous situation.\"\n\nEfforts to legalize the use of marijuana for medical reasons gained \nmomentum in the 1980s as the AIDS epidemic took hold, and \nAIDS-related organizations pushed governments to allow the drug to be \nused to alleviate symptoms such as loss of appetite.\n\nIn 1996, California passed a ballot initiative legalizing marijuana's \nuse for some medical reasons. Alaska, Colorado, Hawaii, Maine, \nMontana, Nevada, New Mexico, Oregon, Rhode Island, Vermont and \nWashington state have adopted similar legislation.\n\nResidents with state permits to grow or use medical marijuana \ntypically are given cards identifying them as participants in such \nprograms. New Mexico's law, which takes effect July 1, will let \nresidents use medical marijuana for ailments such as cancer and \nHIV/AIDS. The marijuana would be provided by the state Health Department.\n\nIn 1978, the U.S. government began a trial distribution program to up \nto 13 patients with various medical ailments. The program was closed \nto new participants in 1992. Rosenfeld, an outspoken supporter of \nusing medical marijuana in the workplace, gets marijuana legally from \nthe federal government as one of five remaining participants in the program.\n\nIn some states with medical marijuana laws, the drug is available at \nspecial dispensaries. Others use authorized caregivers to grow a \nlimited number of marijuana plants. Some patients have obtained their \nmarijuana on the black market, according to the Marijuana Policy Project.\n\nFederal law continues to ban marijuana use for any reason. It's rare \nthat medical marijuana users are prosecuted, but those licensed by \nstates to grow or use marijuana for medical purposes still can be \narrested by federal officials, a conflict in the law that has led to \nlegal wrangling and confusion.\n\nPatients usually aren't drawn into the fray, but a three-judge panel \nof the U.S. Court of Appeals in California ruled in March that Angel \nRaich, who uses marijuana with a doctor's approval because of a \nterminal brain tumor and ailments, isn't immune from federal \nprosecution. She sued the U.S. government pre-emptively to try to \neliminate concerns of being arrested.\n\nRosenfeld's employer, Newbridge Securities, is resolute in its \nsupport of his on-the-job use of medical marijuana. Company officials \nsay they aren't concerned about legal liability issues because they \nsay Rosenfeld's use of the drug doesn't have an impact on his ability \nto work. He also discloses to every client that he uses the drug.\n\n\"He's a quality stockbroker, and he does a great job,\" says Phillip \nSemenick, executive vice president and branch manager. \"But there is \na stigma to it. Some people are going to look at it and say, 'Here's \na guy smoking pot at work? How can he do that?' \"\n\nRosenfeld's marijuana use also has led to moments that Semenick and \nRosenfeld have found comical. Marijuana \"has a distinct smell,\" \nSemenick says. \"The mailman or someone coming into the building will \nstop and notice.\" He adds that the company is not concerned about how \nthe smell of marijuana in its office might affect its image.\n\nRosenfeld says he has been pulled over by state police when he was \ncarrying marijuana, but showed officers his federal paperwork to \nexplain his situation.\n\nOther employers haven't been as flexible when workers have used \nmedical marijuana.\n\nIn 2001, Columbia Forest Products fired millwright Robert Washburn \nafter he repeatedly failed urine tests for drug use. He was enrolled \nin a state medical marijuana program to try to manage his leg spasms. \n\"He was never impaired at work,\" says Philip Lebenbaum in Portland, \nwho was Washburn's attorney when he sued the company over the firing.\n\nBut the company argued that Washburn's use of medical marijuana \nviolated its drug policy, even though Washburn had not used the drug \non the job. Oregon's Supreme Court ruled last year that Columbia did \nnot have to accommodate Washburn's off-duty marijuana use because he \nwas not disabled.\n\nScott Seidman, a Portland lawyer who represented Columbia, says the \ncompany had to maintain its drug-free workplace policy because it is \na federal contractor. \"They felt obligated also for safety reasons,\" \nSeidman says.\n\nLike Rosenfeld, other users of medical marijuana have found support \nfrom their employers.\n\nJoseph Kintzel, 41, of Golden, Colo., is a respiratory therapist who \nevaluates and treats patients. He has his own business but also works \nfor medical organizations that are aware of his use of medicinal \nmarijuana for back problems.\n\nKintzel says he had four back surgeries for 10 herniated discs in \n1996 and 1997, and has 32 pieces of titanium holding his spine \ntogether. He still has painful muscle spasms. Kintzel says that in \n2000, after trying painkillers such as morphine, Percocet and Vicodin \nand being out of work for two years, he used marijuana bought on the \nblack market. He says it was a more effective pain reliever.\n\nIn 2002, after getting a doctor's authorization, he began using \nmarijuana regularly. Within six weeks, Kintzel says, he was off the \nnarcotics and began riding a bike. A few months later, he was back at \nwork. He says he gets no euphoric effect from marijuana.\n\nA state-authorized caregiver now provides him with the drug. Like \nother registered medical marijuana users in Colorado and elsewhere, \nKintzel carries a card that identifies him as an authorized user. \nInsurance doesn't cover his marijuana costs, Kintzel says, so he buys \nabout an ounce at a time, which lasts for 10 days. An ounce costs $200 to $250.\n\nKintzel, a married father of two boys, says the use of medical \nmarijuana has helped, not impaired, his ability to work. \"I work 60 \nto 65 hours a week,\" he says. \"I've had one sick day in the last four years.\"\n\n"}