{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTUESDAY 22 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER CAROL RUBRA\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nLITVINENKO\n\n\nAndrei Lugovoi should be charged and stand trial in Britain for the murder of Alexander Litvinenko by poisoning, according to the Director of Public Prosecutions.\n\n\nThe Foreign Secretary, Margaret Beckett, has told the Russian Ambassador that she expects Russia's \"full co-operation\". This seems unlikely. Russia says it cannot agree to the extradition.\n\n\nSo what will this do to the already strained diplomatic relations between the UK and Russia?\n\n\nSusan Watts, one of the first reporters to link the Polonium trail to Andrei Lugovoi, has been looking at the evidence.\n\n\nAnd Mark Urban will be exploring the diplomatic implications.\n\n\nJUSTICE\n\n\nThe head of the judiciary, Lord Phillips, has struck out against the newly created Ministry of Justice, calling it a \"serious constitutional problem\".\n\n\nLord Phillips told the Constitutional Affairs Select Committee that negotiations between the judges and the government to put in constitutional safeguards had not resulted in agreement.\n\n\nAre the judges now set on an unavoidable collision course with the government? Michael Crick is on the case. \n\n\nHIPs\n\n\nWith less than two weeks to go until they were due to be made compulsory for anyone selling a home, the government has announced that Home Information Packs will be delayed until August, and then only phased in.\n\n\nWhy has the government been so slow to react to the problems?\n\n\nETHICAL MAN GOES GLOBAL\n\n\nIn a temporary reincarnation, Newsnight's one-time Ethical Man, Justin Rowlatt, travels (somewhat unethically by plane) to India - the fourth biggest producer of greenhouse gases on earth.\n\n\nCan he persuade middle class families enjoying new found wealth there to consider giving up their recently acquired cars and reduce their CO2 emissions?\n\n\nNewsnight is on BBC2 at 10.30pm.\n\n\nCarol\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nGREENWICH'S NEW PLANETARIUM\n\n\t\t\t\t\t\t\tA new planetarium and astronomy education centre is set to open in Greenwich later this week.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}