{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 24, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESTillman Tale \"Pure Fiction\": Brother\nThe brother of Pat Tillman broke his three-year silence, telling Congress the military's heroic recounting of the NFL player-turned\n                        Army Ranger's death was \"pure fiction.\" He assailed the Pentagon for trying to \"deceive\" the family and the nation. More...\n• 9 U.S. Troops Die In Attack On Iraq Base\n                     \t\t\t\t\t| Watch• 4th Grader Brings Grenade To Texas School• David Halberstam Killed In Bay Area CrashU.S.Landis: They're Out To Get Me\nTour de France champion Floyd Landis responds to a French newspaper report that says his follow-up tests on backup urine samples\n                        showed traces of a banned synthetic testosterone. More...\n• Border Patrol Agent Charged With Murder• David Halberstam Killed In Bay Area Crash• Classes Resume At Virginia Tech\n                     \t\t\t\t\t| Watch• More StoriesWorld9 U.S. Troops Die In Attack On Iraq Base\nNine U.S. troops were killed and 20 more wounded when a suicide bomber attacked a forward patrol base in the deadly Diyala\n                        province, north of Baghdad. Also, unknown gunmen in Iraqi army uniforms and vehicles have raided a village, killing six people. More...Watch: War Funding Deadlock Continues\n• 74 Die In Ethiopian Oil Field Raid• Getting Old In Cuba• Hamas Militants: The Truce Is Over• More StoriesPoliticsKarl Rove Under The Microscope\nA little-known federal investigative unit is set to launch a probe of the activities of one of the best-known members of the\n                        Bush administration: political strategist Karl Rove. Joel Roberts has the highlights of the day's headlines. More...\n• Tillman Tale \"Pure Fiction\": Brother• Hillary Bio By Bernstein Due Out June 19• Reid: Bush In \"Denial\" On Iraq\n                     \t\t\t\t\t| Watch• More StoriesHealthStudy: No Abortion-Breast Cancer Link\nA 10-year Harvard study of 105,716 women finds no link between abortion and breast cancer. More...\n• Obesity Costly In Workers' Comp• New Drug May Treat Muscular Dystrophy• Is FDA Capable Of Keeping Food Safe?\n                     \t\t\t\t\t| Watch• More StoriesSciTechUnraveling The Mysteries Of Sex Appeal\nWomen seem to perpetually date the same type of guy and there are a few good reasons for that. An article in the May issue\n                        of Cosmopolitan magazine called the \"Secrets of Sexual Attraction\" explains why women are drawn to certain guys. More...\n• California Leads Way In Tech Industry• NASA Captures 3D Images Of Sun\n                     \t\t\t\t\t| Watch• MTV Shows Car Owners How To Go Green• More StoriesBusinessGender Wage Gap Persists, Report Says\nAccording to a new report from the American Association of University Women, one year after graduating from college, women\n                        make 20 percent less than men. But great gains have been made and an expert says women need to be more assertive.  More...\n• Toyota Is World's No. 1 Automaker• Betting On The Next \"Big Thing\"• CBS Radio Suspends 2 For Racial Prank• More StoriesEntertainmentThings Sanjaya Learned On \"Idol\"\nDuring a brief visit with David Letterman on Monday, Sanjaya Malakar rattled off this list of the top 10 \"Things I Learned\n                        from 'American Idol' \" More...Watch: Sanjaya Reads The 'Top Ten'\n• Basinger Denies Leaking Baldwin Rant\n                     \t\t\t\t\t| Watch• CBS Radio Suspends 2 For Racial Prank• Rosie Takes Aim At Murdoch At Luncheon• More StoriesOpinionPoll: Little Change In Views On Handguns\nLast week's shooting rampage at Virginia Tech did little to change Americans' views on gun control, according to a CBS\n                        News/N.Y. Times poll. A majority continues to favor stricter handgun laws, but oppose a ban on all handguns. More...Watch: Virginia Tech and Gun Control\n• Troops In Iraq Plead For Support \n                     \t\t\t\t\t| Watch• French Lessons\n                     \t\t\t\t\t| Watch• Andy Loves His Books• More StoriesCBS NEWS BROADCASTSThe Early Show: Living: Unraveling The Mysteries Of Sex Appeal\nWomen seem to perpetually date the same type of guy and there are a few good reasons for that. An article in the May issue\n                        of Cosmopolitan magazine called the \"Secrets of Sexual Attraction\" explains why women are drawn to certain guys. More...\n• EARLY SHOW: Landis: They're Out To Get Me• EARLY SHOW: Gender Wage Gap Persists, Report Says• EARLY SHOW: Wedding In A Week\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nSanjaya Reads The 'Top Ten'ShowBuzz RAW: Former \"American Idol\" contestant Sanjaya Malakar reads part of the \"Top Ten\" on \"Late Show with David\n                                    Letterman.\" \nTOP VIDEOS\nHokie Spirit Unbroken\nSecrets Of Sex Appeal \nSummer Workout Tips\n'The Queen' Comes Home\nSour News On NutraSweet\nReport: Women Still Earn Less\n'Pitching' Like A Girl\nFood Safety Advocate On FDA\nIraq Funding Tug Of War\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesAmid the debate whether life in Baghdad is getting better, Lara Logan meets ordinary Iraqis to find out. Sunday at\n                           7 p.m. ET/PT.\n                        48 Hours MysteryNightmare In Napa:A surprising murderer is unmasked in the Halloween killings of two young women. Bill Lagattuta\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}