{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGood afternoon. This is Harry Smith in for Katie.\n \nNatural disasters are wreaking havoc on Central\n  Texas and Northern California today. Our\n  reporters are on the location and will have the latest for you tonight. Hari\n  Sreenivasan will survey the deadly Texas flooding\n  and Bill Whitaker will explain how wind and dry conditions are stoking the\n  wildfire near Lake Tahoe that has caused\n  thousands of people to be evacuated from the area.\n \nAlso today, a federal investigation concluded that\n  billions of dollars have been wasted on Iraq’s reconstruction\n  – $19 billion to be exact. That’s the amount spent on training\n  Iraqi troops – an effort that’s made very little difference in\n  the country’s security, according to results of the bipartisan\n  investigation. From the White House, Jim Axelrod will have the details.\n \nAnd one of the biggest backers of the Iraq\n  war strategy has been Tony Blair, who resigned from his post as British prime\n  minister today. Who’s stepping in to take his place? Prime Minister\n  Zombie Brown is his name and Elizabeth Palmer will give us an introduction to\n  him.\n \nIn health news, we’ll take a look at a new\n  study about those women who take depression drugs during their pregnancies. \n \nAlso, a bump on the head for a kid might be more\n  serious than you think. Sandra Hughes will have the scoop on when the\n  emergency room is in order after your child gets hurt on the ball field.\n \nDid you know that half of the world’s produce\n  is grown in China?\n  In order to protect its valuable export business, the country is creating a\n  five-year plan to clean up its products – and its image –\n  starting with closing nearly 200 factories. Barry Petersen will report.\n \nFinally, you’ve heard the hype, and now lines\n  are forming outside of Apple stores across America as eager techies await\n  the arrival of the iPhone. But is this sleek little gadget worth the wait?\n  Our technology correspondent Daniel Sieberg will have a preview.\n \nThanks and please join us tonight,\n \n\n\n\n\nHarry Smith\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}