{"category": "spam", "to_address": "<IPLACEREPORTS@flax9.UWATERLOO.CA>", "from_address": "\"BryanPerry@Changewave.com\" <BryanPerry@Changewave.com>", "subject": "The most powerful wealth strategy I've ever known", "body": "===============================================================\n   We love giving our InvestorPlace.com members benefits like \n               access to this timely message.  \n\n    In order to ensure you keep receiving special alerts \n   and offers like this one, please take a moment to click \n         the link in this message to reconfirm that \n     this is the email address where you want to receive \n               emails from InvestorPlace.com.\n===============================================================\n\n\nMay 2, 2007\n\nFellow Investor,\n\nI have a short video for you to watch that could literally \nchange your life.\n\nThis video details the most powerful wealth strategy I've \never known.  As you'll see, it literally saved a friend of \nmine, and her three children, from financial ruin.\n\nPeople all over America are using this strategy to triple \ntheir retirement income; fund extensive travel; pay the costs \nof college education for their children or grandchildren; and \nafford quality long-term care for their parents.\n\nBest of all, these people - people who I'm sure are like you \nin many ways - are building a rock-solid fortress of wealth \nand a rich cash flow to last the entire lives.\n\nSo if you need income...\n\nIf you're approaching retirement...\n\nOr if you simply want to invest some of your portfolio in \nsomething more certain in this uncertain world, then I urge \nyou to watch this short video presentation.\n\nIt will only take 2 minutes.  But it tells a tremendously \nempowering story of how anyone can become cash-rich, \nwith all the income you'll ever need.\n\nClick here to view it now: \nhttp://confirm.investorplace.com/c/conf?CRCWSIMPWS-3317975-8CK123-8CK123\n\nSincerely,\n\nBryan Perry\nChangeWave's 25% Cash Machine\n\n\n\n---------------------------------------------------------\nMANAGE YOUR INVESTORPLACE ACCOUNT:\n\nWe hope this timely investing advice is valuable to you.\nPlease tell us if your email has changed by visiting here:\nhttp://investorplace.com/ipi/e/\n\nIf you would rather not receive actionable investing advice from\nInvestorPlace advisors, you can let us know by visiting\n\nhttp://www.investorplace.com/u/?p=8CK123-1&e=IPLACEREPORTS@SPEEDY.UWATERLOO.CA\n\nWe will honor your request within 7-10 days.\n\nACP Phillips Investment Resources, LLC,\n2420A Gehman Lane\nLancaster, PA 17602\n\nCopyright (c) 2007 ACP Phillips Investment Resources, LLC.\nAll rights reserved.\n\n \n\n05/02/2007 4:31PM\n\n--------------------------------------------------------------------\nThank you for subscribing to InvestorPlace.com. Please note that \nwe cannot be liable for any missed bulletins caused by overzealous \nspam filters. To ensure that you continue to receive this valuable \npart of your service please take a moment to add (BryanPerry@Changewave.com)\nto your address book. Click here for instructions: \nhttp://www.changewave.com/whitelist.html?eml=BryanPerry@Changewave.com\n--------------------------------------------------------------------\n\nee==8CK123\n\n"}