{"category": "ham", "to_address": "love-hounds@gaffa.org", "from_address": "bob kosturko <bkosturko@beacon.org>", "subject": "[LH] Re: Conclusion (Bill Kawalec)", "body": "\n--  \nBob Kosturko\nBoston, MA 02108\nbkosturko@beacon.org\n--\n \n> ----------------------------------------------------------------------\n> \n> Message: 1\n> Date: Fri, 18 May 2007 00:56:30 -0400\n> From: \"Bill Kawalec\" \n> Subject: Re: [LH] Conclusion\n> To: rec-music-gaffa@moderators.isc.org\n> Message-ID: \n> \n> \n> \"Donny Bravo\"  wrote in message\n> news:donnybravo-6C5D73.00321316052007@[66.250.146.154]...\n>> In article <9d4443a2087dbc61d7cc054eea22ab7b@vispa.com>,\n>> boolbar@gaffa.vispa.com (Boolbar) wrote:\n>> \n>>> I agree there isn't enough good material to justify a double CD and some\n>>> of\n>>> it is bland.\n>>> I think that some of the material is among the best that Kate has ever\n>>> done\n>>> and some of it among the worst. We have 4 great tracks, 4 reasonable\n>>> tracks, 3 decent linking pieces, 4 varying but ultimately bland tracks\n>>> and\n>>> one of the least decent Kate singles ever. Overall her 4th best album,\n>>> just\n>>> about nudging The Sensual World into 5th place.\n>>> (If KOTM, HTBI, SIB were removed for B-sides and Pi & Nocturn given a\n>>> good\n>>> kicking then this would have been so much better.)\n>> \n>> Well, now, let's get this discussion rolling along.\n>> \n>> What are your 4 great tracks? Your 4 reasonable tracks? Your 4 bland\n>> tracks?\n>> \n>> I can't agree about KOTM. I find it to be one of the more redeemable\n>> songs on the set. If it were given a SIYL treatment, it would have been\n>> that much better.\n>> \n>> And, looking back, TSW might just be my favorite KB album, taken as a\n>> whole. HOL is half-great, but, oh, what a half. I also love TD and NFE.\n>> So those are the big 4 long-players for me.\n> \n> \n> \n> hmmm, well, I think HoL is more than \"half greaat,\" and I have played it a\n> lot maore than I have played TSW, but, I still feel that TSW is Kate's best\n> work. NFE may still be the one I've played the most.\n\nAe is not the hoped for \"Big Comeback\", rather it is \"The Great\nDisappointment\" (Look up 'Millerites' if you don't know what I'm referring\nto). It's merely another CD and a fairly bland one at that, albeit a bland\nKate CD. \n\nKate's masterpieces, IMHO, are the breakthrough \"TD\" and the marvelous\n\"HoL\". Having said that, I too, play \"NFE\" much more than all her other\nalbums. There's something special about that one I can't quite put my finger\non.\n\nOf course your mileage may vary . . .\n\nBob K\n\n"}