{"category": "ham", "to_address": "submit@bugs.debian.org", "from_address": "Don Armstrong <don@debian.org>", "subject": "Bug#431883: dcraw license does not give permission to distribute modified versions or source alongside", "body": "Package: dcraw\nVersion: 7.02-1\nSeverity: serious\n\nOn Thu, 05 Jul 2007, Steve King wrote:\n> However I would appreciate it if the assembled masses of legal\n> experts could confirm that they agree that this is the case.\n\nThere's actually an even more fundamental problem with dcraw.c:\n\n/*\n   dcraw.c -- Dave Coffin's raw photo decoder\n   Copyright 1997-2007 by Dave Coffin, dcoffin a cybercom o net\n\n   This is a command-line ANSI C program to convert raw photos from\n   any digital camera on any computer running any operating system.\n\n   No license is required to download and use dcraw.c.  However,\n   to lawfully redistribute this code, you must either (a) include\n   full source code* for all executable files containing RESTRICTED\n   functions, (b) remove all RESTRICTED functions, re-implement them,\n   or copy them from an earlier, unrestricted Revision of dcraw.c,\n   or (c) purchase a license from the author.\n\n   The functions that process Foveon images have been RESTRICTED\n   since Revision 1.237.  All other code remains free for all uses.\n\n   *If you have not modified dcraw.c in any way, a link to my\n   homepage qualifies as \"full source code\".\n\n   $Revision: 1.387 $\n   $Date: 2007/06/24 00:18:52 $\n */\n\n\nYou'll notice that we have no permission to distribute modified\nversions of dcraw.c as required by the DFSG. Secondly, it appears that\nwe must include full source code if we've modified dcraw.c, but we\ndon't do that. We distribute source alongside.\n\nIf you could get Dave Coffin to explicitely dual license under the\nGPL, that'd clarify this entire problem. [He seems to want a copyleft,\nwhich the GPL would grant.]\n\nText like:\n\nAlternately, you can redistribute and/or modify this work under the\nterms of the GNU General Public License as published by the Free\nSoftware Foundation, either version 2 of the License, or (at your\noption) any later version.\n\nwould do the trick.\n\n\nDon Armstrong\n\n-- \nIf everything seems to be going well, you have obviously overlooked\nsomething.\n -- Steven Wright\n\nhttp://www.donarmstrong.com              http://rzlab.ucr.edu\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}