{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGood afternoon,\n \nHarry Smith here filling in while Katie’s on assignment.\n  \n \nAfter a week of floods and fires across the United States, Catalina Island off Los Angeles has become\n  the latest wildfire victim. Throughout the night, thousands of residents and\n  visitors fled the island’s main town, which was under evacuation order.\n  Bill Whitaker will report on the devastating blaze and citizens’\n  dramatic nighttime escapes. \n \nMeanwhile, Sharyl Attkisson is on Capitol Hill with\n  some exclusive information about what might be the best chance for all sides\n  to work out a last-ditch immigration reform deal.\n \nOn the state level, legislation is being considered\n  in several states that could affect the lives of teens and the\n  tech-dependent. Sandra Hughes will report that Washington\n  state and New Jersey\n  could both ban text messaging while driving. Considering the statistics\n  – teenagers say text messaging is their biggest driving distraction\n  – more states could follow suit. \n \nIt is graduation day at Virginia Tech, and\n  today’s ceremonies will be part commencement and part remembrance.\n  Sharyn Alfonsi is on campus and will have the story.\n \nThere is also a unique graduation story at Fort Hays State University\n  in Kansas. For\n  Assignment America, Steve Hartman will introduce you to one student there who\n  followed the advice “it’s never too late to follow your dreams.”\n  Now – at more than 90 years old – she’s becoming the\n  country’s oldest person to be graduated by a college. \n \nJoin us tonight for this and more.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}