{"category": "spam", "to_address": "Smiles <smiles@flax9.uwaterloo.ca>", "from_address": "Nicole Gallegos <adrian@greatgaysex.com>", "subject": "Read carefully to make your girlfriend happy", "body": "\n\nGoing to have sex with two ladies at the same time? You need a strong erection, or they will have to satisfy each other. You really need Viagra!\nVisit us\nAbsolutely legal, licensed and CHEAP pills at your choice. Confidential purchase. Instant shipping\nClick here\nThere is no need to have a prescription, just visit our store and buy the pills you want.\nWith best regards,\nNicole Gallegos\n \n \nCelitel, a mentaty? nervno shepnul ia. Konchiki volos sotnicy, vygliadyvaiushchie iz-pod nizko Nadvinutoj shliapy-kolokola (shlemnik, shepnul emlot) byli zheltovatymi, kak suhoj Rechnoj pesok, a gladkaia kozha lica i shei otlivala svetlo-zheltym iantarem. Nedolgo, vprochem. Skoruiu i besposhchadnuiu. \nUdar. Ty vdrug stal chem-to moshchnym, obladaiushchim Ogromnoj siloj. Sheptuny shefira uchat ih Povinoveniiu s pomoshchiu svoih griaznyh metodov. Ia zazhal palcami nos, staraias rezhe Dyshat. Tot iz vas, kto vyjdet pobeditelem, prozhivet, kak ponimaesh, dolshe. Iskusstvo Mobra moglo by mne pomoch bez ustali perestavliat Nogi sutki, esli by u menia byla hotia by minutka, chtoby ostanovitsia i Sosredotochitsia dlia aktivizacii Kliucha. Ustraivaet? nedoverchivo sprosil ia. Ia pozvolil sebe slegka rasslabitsia. \nA zatem Spokojno uselsia priamo Dosu na grud, ispolzovav ego kak skamejku. Taj v otvet vozmushchenno fyrknula: Donik, ty horoshij paren, no ia plachu tebe ne za to, chtoby ty dumal, Osobenno o moih lichnyh delah. To li ne Pridaval etomu bolshogo znacheniia (psihologiia chuzhih potemki), to li prosto Ne derzhal zla, ponimaia, chto vybora u menia osobogo ne bylo. Vypleskivaia svoj gnev, Initoks prishporil i tak Nesushchegosia vo ves opor charsa, znaia, chto voiny ego otriada tut zhe povtoriat ego Dvizhenie. ejisuminyon Ql9aWFBCckBEUFRWShpARlNHUUddXVwaVlA=\n \n\n\n"}