{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 155", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Argentina. Ofrecen $ 20.000 de recompensa por el reloj de\n      Belgrano (Museum Security Network Mailing list)\n   2. US. Musician's rare violin taken from NYC subway station is\n      recovered (Museum Security Network Mailing list)\n   3. US. Stolen fraternity statue worth thousands\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Thu, 05 Jul 2007 07:00:18 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Argentina. Ofrecen $ 20.000 de recompensa por el reloj\n\tde\tBelgrano\nTo: Museum Security Network Mailinglist \nMessage-ID: <468C7AE2.6040404@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nOfrecen $ 20.000 de recompensa por el reloj de Belgrano\nLo anunci? el secretario de Cultura\nMi?rcoles 4 de julio de 2007\n\n En un intento adicional por recuperar el reloj que perteneci? al general Manuel Belgrano, robado anteayer del Museo Hist?rico Nacional, el secretario de Cultura de la Naci?n, Jos? Nun, anunci? el pago de una recompensa de 20.000 pesos para quien aporte informaci?n fehaciente que posibilite su recuperaci?n.\n\nComo anticip? LA NACION en su edici?n de ayer, la Secretar?a de Cultura inform? que el incentivo responde al valor que representa el reloj para el acervo nacional. A tal efecto, dicha Secretar?a dispuso una l?nea telef?nica (4346-5752) para aquellos que puedan ofrecer datos seguros.\n\nPese a los esfuerzos del Gobierno por recuperar la reliquia, fuentes de la investigaci?n informaron a LA NACION que no son optimistas sobre el resultado de las pesquisas. Ayer, la Divisi?n Robos y Hurtos de la Polic?a Federal, encargada de la investigaci?n, realiz? un allanamiento pero, se inform?, no arroj? resultados positivos.\n\nAdem?s, el juez a cargo de la investigaci?n, Octavio Ar?oz de Lamadrid, realiz? una inspecci?n en el museo, que cuenta con un patrimonio de 1500 piezas hist?ricas, para conocer los detalles de c?mo fue el robo.\n\nLa pieza fue arrancada de una vitrina ubicada en la sala de la Independencia del museo situado en Defensa al 1600, en San Telmo.\n\nSeg?n pudo conocer LA NACION, los ladrones habr?an dejado un trozo de vidrio del escaparate en el auditorio Carranza.\n\nEl director del museo, Jos? Antonio P?rez Goll?n, entreg? anteayer a la Justicia una copia de la filmaci?n, de muy baja resoluci?n, en la que se ver?a al ladr?n en el momento en que forz? la vitrina, arranc? el reloj, que estaba atado con una tanza, y se escap? sin que ning?n guardia de seguridad advirtiera lo ocurrido.\n\nEl reloj de bolsillo con cadena de oro y esmalte, de estilo L?pine, que el pr?cer entreg? a su m?dico en el lecho de muerte como una forma de pagarle sus servicios, es una pieza de un enorme valor hist?rico, que atesoraba el centenario museo.\n\nValuado en 400.000 euros\n\nLa pieza, que seg?n algunos especialistas consultados por LA NACION valdr?a en remate unos 400.000 euros, tiene bordes ondulados, la esfera de esmalte blanco y marca la hora con n?meros latinos. Otra particularidad es el aro cincelado, que est? unido a una cadena con cuatro eslabones, que lleva a un pasador. Tambi?n tiene otro aro, m?s grande, donde se encuentran dos llaves, una de las cuales lleva una amatista, y en el centro tiene grabado el busto del general Lafayette.\n\nAnte la denuncia en la comisar?a 14a., se alert? a la Aduana y, a su vez, a todas las aduanas del mundo que integran la red de intercambio de informaci?n (Oficina Regional de Enlace de Inteligencia, RILO, seg?n sus siglas en ingl?s), para evitar una venta en el exterior. Adem?s se notific? a la Asociaci?n de Anticuarios de San Telmo y, tambi?n, se inform? que estar?n bajo vigilancia las joyer?as de la calle Libertad. \n\nhttp://www.lanacion.com.ar/\n\n\n\n------------------------------\n\nMessage: 2\nDate: Thu, 05 Jul 2007 07:00:23 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. Musician's rare violin taken from NYC subway\n\tstation is\trecovered\nTo: Museum Security Network Mailinglist \nMessage-ID: <468C7AE7.7040803@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nMusician's rare violin taken from NYC subway station is recovered\nJuly 4, 2007, 2:12 PM EDT\n\nNEW YORK -- The owner of a rare 20th-century violin that went missing after he fell asleep on a hot subway train has been reunited with his precious instrument.\n\n\"I just want to quickly tell you that my violin was recovered late last night/early this morning ... I'm of course overjoyed!!!,\" Tom Chiu, a Juilliard School graduate and founder of the avant-garde ensemble Flux Quartet, wrote Wednesday in an e-mail message about his Scarampella violin.\n\nThe violin and his backpack were stolen June 27.\n\nChiu said it was raining that night and he went into the hot and humid subway station and fell asleep. When he awoke, he said, his bags were gone.\n\nChiu, who calls his violin his \"heart and soul for the last 13 years,\" said in a statement that the violin and the backpack and its contents were \"turned into the MTA Transit Lost-and-Found, and an MTA official contacted\" Chiu late Tuesday evening.\n\nThe contents included a violin bow that Chiu has used since childhood.\n\nNYC Transit did not immediately return a call seeking details about the recovery.\n\nAt the time of the theft, Chiu said the violin and bow \"all have great sentimental value to me and are completely irreplaceable. I hope the person who has my violin will return it to me. I would be forever grateful.\"\n\nChiu did not say what the violin was worth but said it had originally belonged to his parents.\n\nThe violin was made by Stefano Scarampella, one of the most highly regarded violin makers from the early 20th century in Italy.\n\nhttp://www.newsday.com\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Thu, 05 Jul 2007 07:00:28 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] US. Stolen fraternity statue worth thousands\nTo: Museum Security Network Mailinglist \nMessage-ID: <468C7AEC.3090402@bruggemansolutions.com>\nContent-Type: text/plain; charset=UTF-8; format=flowed\n\nStolen fraternity statue worth thousands\n\nBy Gwyneth Gibby\nGazette-Times reporter\n\nWho would, or could, steal a cumbersome bronze statue from a house in the middle of the night, heft it out through an open window and then disappear?\n\nSomeone did, when a statue of Vulcan, god of fire, vanished from the Delta Chi fraternity house in Corvallis on the night of June 10. Estimated to be between 2 1/2 and 3 feet tall, made of bronze and weighing as much as 100 pounds, the statue could not have been easy to snatch ? not to mention then whisk away and stash, leaving no witnesses.\n\nAccording to the Corvallis Police Department report, a fraternity member woke shortly after 2:30 a.m., when he heard someone open a door to the sleeping porch and call out ?Hey guys!? When he went downstairs, no one was there, but the statue was missing. A window on the south side of the house was open.\n\nPolice responded to the scene and searched the area, believing it would be difficult for the thief or thieves to get far with such a heavy object, but they saw no one.\n\nThe statue of Vulcan, known in Greek mythology as Hephaestus, has special significance to the Oregon State University chapter of Delta Chi. In October 1926, a recent graduate and a member of the chapter, Charles Rosenkrans, died in an accident. Rosenkrans? parents donated the artwork to the house in his memory shortly after his death. It has been there ever since.\n\nIn 1945, the Rosenkrans family also established a scholarship fund that still exists and generates about $40,000 a year to help Delta Chi members complete their education.\n\nA mystery surrounds the origin and value of the Delta Chi sculpture. Vulcan was the god of fire and metal working, and he married Venus, the goddess of love. His forge was under Mount Etna, the Sicilian volcano, where he made weapons for the gods. His leather apron, hammer and shield are his identifying traits. He has been immortalized in many paintings and sculptures, including the world?s largest cast-iron statue, which stands in Birmingham, Ala.\n\nBut the artist and provenance of the Delta Chi piece are unknown, although the house president estimated the value to be between $100,000 and $250,000. Police have circulated a photo of the piece to artists and dealers in the region hoping for some information. One Oregon artist who works in bronze said it could be worth over $100,000 depending on the artist and the age.\n\n?The value is much more to the men of Delta Chi,? said Bill Love, Alumni Board chairman.\n\nFor 80 years members have grown familiar with Vulcan and the story of Charles Rosenkrans ? until it vanished in the middle of a June night.\n\nPOLICE REQUEST\n\nAnyone with information about the whereabouts or the origin of the statue is asked to contact Detective Mike Wells at the Corvallis Police Department, 766-6924.\n\nhttp://www.gazettetimes.com/\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 155\n****************************************\n\n"}