{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Benj. Mako Hill\" <mako@debian.org>", "subject": "Re: Final text of GPL v3", "body": "\n> On Sun, Jul 01, 2007 at 11:20:25AM -0400, Benj. Mako Hill wrote:\n> > \n> > > I'm no fan of Affero, but permitting linking with it is certainly not a DFSG\n> > > issue.\n> > The new Affero is *much* better than the old Affero IMHO. \n> \n> Ha, speaking on behalf of your new paymasters already, I see! ;)\n\nI am biased, but not because I'm on the FSF board. I'm biased because I\nhelped come up with the new AGPL *before* I was on the FSF board. :)\n\nDuring the GPLv3 revision process, the AGPL compatibility clause was my\npet issue. The general feeling (between Don Armstrong and others on\ncommittee-D and from the bulk of comments summitted as part of the\nprocess) was that we wanted compatibility with a license that tried to\ndo what the AGPL did but in a different way. The old method (i.e.,\nbarriers to modification of the software) seemed problematic for a few\nreasons. I helped come up with the current methods in the AGPLv3.\n\n> > If you have a problem with what it's trying to do, you won't like it\n> > (the goal is unchanged). If you have a problem with how it did it\n> > (the position that I, and most commenters on earlier drafts) were\n> > in, you will probably be much happier.\n> > \n> > In any case, a new version of the AGPLv3 draft is due up soon.\n> > Please look at the old one and comment on the new one when it's up.\n> \n> Will it have an actual diff against GPLv3? I get the impression it's\n> meant to be GPLv3 with minor changes to achieve that goal, but\n> actually seeing if there are just minor changes or other things as\n> well was hard when the first draft came out.\n\nSure. We can make this.\n\nAFAIK, there is one added subsection and one swapped section (the\nsection that talks about compatibily with the AGPLv3 in the GPLv3). I'll\npush to release a diff.\n\nRegards,\nMako\n\n-- \nBenjamin Mako Hill\nmako@debian.org\nhttp://mako.cc/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}