{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "\"Peter O'Brien\" <mrpeterobrien@googlemail.com>", "subject": "Re: [cc-community] Obtaining and releasing documentary interview\n\tfootage under 3.0 Attribution?", "body": "Thanks Jon, please do update us with any progress or findings.  It´s great there has been some progress already and it´d be awesome if such a release form does become available.\n \nThanks for the information Elliot - you blog entry and your cc + documentary page are very helpful and informative - great collection of links too.  Will be sure to check out your presentation when at my own computer\n\n \nOn 5/30/07, elliott bledsoe <elliott@creativecommons.org.au> wrote:\n\nhello allwe at ccau don't have a release form or anything like that. and the issue of documentary filmmakers releasing films via mainstream mediums (such as television, cinemas and dvd) has come through our office on a few occasions.\ni did presentation at the australian international documentary conference (http://2007.aidc.com.au) in february this year. the presentation covered the cc licences, and looked four potential uses of cc for the documentary film sector:\n1 as a viral distribution tool (digital + offline);2 as a way of opening up access to your raw footage;3 as a collaboration platform; and4 as content to include in your film.you can have a look at the presentation @ \nhttp://creativecommons.org.au/aidc and it is under an australian attribution 2.5 licence so feel free to reuse it too ^_^\nthanks\n\n\n \n \n\n \n \n_elliott\n \n \n \n \nelliott bledsoe\nproject officer\n\n\n\n[ Creative Commons Australia ]\npart of the Creative Commons international initiative\n \n+61 7 3138 9597\n0433328462\n \nelliott@creativecommons.org.au\n\nhttp://creativecommons.org.au\n\n \n \n\nCreative Commons in Australia is part of the funded research under theAustralian Research Council Centre of Excellence for Creative Industries and Innovation.The ccClinc is part of the Creative Workforce research program and the CC + OCL models\nresearch stream is part of the Legal and Regulatory Impasses and Innovations research program.\nwww.cci.edu.au\nJon Phillips wrote: \nOn Tue, 2007-05-29 at 11:45 +0200, Peter O'Brien wrote:\n  \nDear list,\n \nCould anybody guide me as to obtaining and releasing interviewee\nfootage under Creative\nCommons 3.0 Attribution Licence(http://creativecommons.org/licenses/by/3.0/ ) ?\n \nIs it even possible to do this?  Is there a release form in existence\nthat I could use, for interviewees to sign, that broadcasters would be\nable to accept from any projects using any of the footage?  Are there\nany projects out there doing this already - with this license? \nIm british and my first desire would be for the footage to be able\npass British broadcasters legal obligations however a global passing´,\nor as much of one as possible, would of course be much more desirable.\n    Heya, let me get back to you on this...I think this is a great idea, and\nthere have been some efforts wrt to this...I'm checking with CC's GC,\nand others on best practices...\n\nuntil then, from the archives:\nhttp://lists.ibiblio.org/pipermail/cc-community/2006-December/001406.html\n\n\nJon\n\n  \nAny answers, advice or referals would be greatly appreciated.\n\nMany Thanks,\nPeter O´Brien\n\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n    _______________________________________________cc-community mailing list\ncc-community@lists.ibiblio.orghttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}