{"category": "spam", "to_address": "<iplacereports@flax9.uwaterloo.ca>", "from_address": "\"JohnLansing@InvestorPlace.com\" <JohnLansing@InvestorPlace.com>", "subject": "Trade Talk Weekly June 26: Look Out Below", "body": "\n\nTrade Talk Weekly Update\n\n\n\n\n\n\nJune 26, 2007\n“Look Out Below”\nAny daredevils out there? Enjoy jumping out of planes or  going bungee jumping in your spare time?\nWell then, my daring friends, this will be a week for you!  I’m expecting this week to be the most volatile week we have seen year to date.\n\n\n\n\n\nADX: The Weakest Link\nUnlike a lot of indicators, the Average Directional Index  (ADX) doesn’t tell you whether a trend is bullish or bearish. Instead, it measures  the trend’s strength on a scale of 0 to 100, where 100 is strongest and 0 is  weakest. The method for calculating it is complicated to explain, so just  remember that readings below 20 are considered weak and readings above 40 are  considered strong.\nOn June 15, the ADX for the QQQQ hit 13.81, and Trending123's alarm bells started going off—after all, that’s well below the “weak” threshold  of 20. But get a load of this: the NASDAQ composite just hit 10.82 in the ADX.  That’s not just weak, that’s in critical condition.\nSo if you thought the gains in the NASDAQ since March have  been strong—you’re right. But if you thought the trend has been strong—well, when the string of gains snaps,  boy, are you in for a surprise. With the ADX as low as it is, anyone trying to go  long now is reaching for the weakest link. Trending123 can help you find the investments that are safe in this type of volatile  market.  Click here to join Trending123 now.\n\n\nIt all started last Friday when the S&P 500 slid so far  that it clocked its second highest sell-side volume day in over a decade.  Contemplate the magnitude of the word I just used: decade!\nThough the cheerleaders out there may be spinning a  different tale, managing not to speak of the day in quite so fantastic a  fashion, I’m here to deliver the truth. And not the truth as I see it but the  truth as it really is. For, as I’ve said many times before, we simply can’t mold  this market into what we want it to look like. It is how it is!\nGo Away in May – It Really Works!\nThere’s an old bit of Wall Street that goes “Sell in May and  go away” referring to the fact that the stock market’s weakest season runs from  May 1st through October 31st.  Many financial advisers will try to steer you away from  going away in May, telling you that it’s not a phrase to trade by. Well, they  just want to make sure you stay with them. \nWhat better way to keep you on-board then to “guarantee” you  more money, in the way of new buys? Well, there is no real guarantee and what  might seem like a bucket of bargains could very well lead you to  Loserville—where the gains are marginal but the losses are great. And who wants  those odds?!\nI certainly would never bog you down with absolutes when it  comes to investing your hard-earned money. You’re gonna win some with me (click here to learn about some of Trending123’s past gains)  and you’re gonna lose some. \nBut I’ll be darned if I’m going to keep you in this market  when I can see with my own two eyes that it’s crumbling! To me, that’s just  insane.\nI got everyone out at the end of April because the charts  told me everything I needed to know. And ever since then, the charts have  continued to paint the same disturbing picture. \n\nExample:  the Utility index. For this month alone, the utility index is down 7% -- it’s  now at lows not seen since March of this year! When did it top? Back in May.\n\nYou might not think that the Utility index is a major  player. But I assure you, those with deep pockets, invest their money in  diversified portfolios – portfolios that don’t just include the RIMMs and the  Apples and the Googles. You can bet that serious investors are playing across  all sectors and that the utility index is front and center on their scorecards. \nLet me tell you something else you may not have known: this  index is one of, if not, THE most interest-rate sensitive sectors. Why? Because  they have the most debt on their balance sheets. And when we are in an environment  that has increasing interest rates, it costs them more to have a balance sheet  that is saddled down with debt – it eats away at their earnings and in turn,  their dividends. It creates a nasty snowball effect. So rising rates are not  considered bullish among these types of interest-rate sensitive groups.\nThe utility index, the S&P 500 and the DOW all have one  thing in common – they all topped in May. \nThe only (safe) way to play the market right now is through  inverse funds. We have a couple we are playing at Trending123 right now – click here to find out what they are.\nIf you are ready to see the complete picture – the one that  the cheerleaders of this market aren’t allowing you to see – then I highly  encourage you to check out what I have been telling my Trending123 subscribers. My job and my joy  are the same: I want to help as many people as will listen to invest  wisely…meaning that I want you to secure as many profits as possible while  deterring the losers that will get you nowhere but in the red.\nPlease join me today—this special  offer takes $50 off the usual price—to discover what Trending123 can do for you.\nSincerely,\n \n  John Lansing\nTrending123\nP.S. What kind of gains have my Trending123 subscribers experienced? How  about: Hansen Natural Corp—up 23.95% in 4 days, Berry Petroleum—up 27.20% in 6  weeks and Zoll Medical—up 109.91% in 4 months? Good looking gains in short  periods of time – that is our aim. Click here to find  out how Trending123 can help you toward 10%-30% gains in a matter of weeks (and  sometimes days)!\n\n\n\n\n\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you.   Please tell us if your email has changed by visiting here: http://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice from InvestorPlace advisors, you can let us know by visiting \nhttp://www.investorplace.com/u/?p=8FP233-1&e=iplacereports@speedy.uwaterloo.ca\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,2420A Gehman LaneLancaster, PA 17602\nCopyright © 2007 ACP Phillips Investment Resources, LLC.\nAll rights reserved.\n06/26/2007 6:54PM\n\nThank you for subscribing to InvestorPlace.com.   Please note that we cannot be liable for any missed bulletins caused by overzealous spam filters.   To ensure that you continue to receive this valuable part of your service please take a moment to add (JohnLansing@InvestorPlace.com) to your address book.   Click here for instructions:\nhttp://www.investorplace.com/whitelist.php?eml=JohnLansing@InvestorPlace.com\n\nee==8FP233\n\n\n\n\n\n\n"}