{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 129", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Ethiopia wants British Queen to return royal bones\n      (Museum Security Network Mailing list)\n   2. insider theft. A former curator at the Rockland County\n      Historical Society was arrested Thursday and charged with\n      stealing the society's $60, 000 antique U.S. atlas.\n      (Museum Security Network Mailing list)\n   3. Find Whitey: the hunt for the man with a $1m price on his\n      head. UK expert on the trail of godfather suspected of\n      masterminding $350m art heist. (Museum Security Network Mailing list)\n   4. Italy-Japan (Miho Museum). Witness fingers Japanese museum in\n      Italian art-trafficking case (Museum Security Network Mailing list)\n   5. Austria-Canada. THE director of the Austrian museum from\n      where a diamond brooch was stolen nearly a decade ago said\the's\n      relieved to know the heirloom is in safe hands -- even\tif he\n      wasn't aware it had been recovered in Winnipeg.\n      (Museum Security Network Mailing list)\n   6. Ethiopia's president has sent Queen Elizabeth II a formal\n      request for the remains of a prince who died in Britain more\tthan\n      a century ago. (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Sun, 3 Jun 2007 19:55:40 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Ethiopia wants British Queen to return royal bones\nTo: \nMessage-ID: <003901c7a608$65cf44a0$316dcde0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nEthiopia wants British Queen to return royal bones\nSun 3 Jun 2007, 9:01 GMT\n \n[-] Text [+] By Andrew Heavens\n\nADDIS ABABA (Reuters) - Ethiopia has called on Britain's Queen Elizabeth to\nreturn the bones of an orphan prince buried at Windsor Castle after he was\nspirited from his homeland by British soldiers nearly 140 years ago.\n\nPrince Alemayehu was just seven in 1868 when his father, Emperor Tewodros\nII, committed suicide after being defeated by British troops at the Battle\nof Magdala. The prince was placed on a ship to Britain and enrolled in\nboarding school.\n\n He died aged 18 of suspected pleurisy, a lung condition, in the northern\ncity of Leeds, after years of loneliness.\n\nIn the latest Ethiopian drive to reclaim stolen artefacts and relics, the\ngovernment in Addis Ababa has written to Britain's queen, asking her to send\nhome Alemayehu's remains.\n\nMulugeta Aserate, second cousin of Ethiopia's last emperor Haile Selassie,\nwho helped organise the appeal, said it was time the wrongs of the last\nmillennium were put right.\n\n\"The prince was a prisoner of war,\" he told Reuters. \"His return would ease\nthe minds of lots of Ethiopians who believe his rightful resting place\nshould be here with his father.\"\n\nA Buckingham Palace spokeswoman declined to discuss the request. \"We never\ncomment on private correspondence to the queen and any response that may\nhave been given,\" she said.\n\nThe prince -- who claimed a bloodline stretching back to King Solomon and\nthe Queen of Sheba -- was seized by a British force that invaded to free\nEuropean diplomats, missionaries and adventurers jailed by Emperor Tewodros.\n\n\"NO HAPPY LIFE\"\n\nThe emperor took his own life as the troops stormed his mountain fortress in\nMagdala. Alemayehu's ailing mother, Queen Terunish, died a few days later as\nthe soldiers moved to the Red Sea coast with the rest of the royal family.\n\nAfter studying at Rugby School in the British Midlands, the prince began\nofficer training at Sandhurst military academy. He died in November 1879 at\nthe home of one of his tutors.\n\nQueen Victoria had befriended the boy before his death.\n\n\"It is too sad!,\" she wrote in her journal at the time. \"All alone in a\nstrange country, without a single person or relative belonging to him ...\nHis was no happy life.\"\n\nThe young prince was buried in the crypt of St George's Chapel at Windsor\nCastle.\n\nThe letter is the latest in a string of requests by Ethiopia for the return\nof human remains and hundreds of illuminated manuscripts, gold crowns and\nother artefacts stolen by British troops during the 1868 expedition.\n\nThe National Army Museum in London still has a lock of Emperor Tewodros'\nhair, cut from his corpse as a souvenir by an army artist. Queen Elizabeth's\nown library in Windsor Castle holds six sacred illuminated manuscripts that\nwere taken from Magdala before it was burned to the ground.\n\nFor years, Ethiopia fought a war of words to win back a 1,700-year-old\nobelisk that was carried to Rome by Italian fascist invaders in the 1930s.\nIt was returned in April 2005.\n\nIn his letter to Queen Elizabeth, Ethiopian President Girma Wolde-Giorgis\nasked for the prince's bones to be sent home before his country's millennium\ncelebrations this September.\n\nEthiopia observes an archaic calendar that is seven years behind most of the\nworld -- so the year 2000 will not arrive until September 12, 2007.\n\nhttp://africa.reuters.com/\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Mon, 4 Jun 2007 05:48:16 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] insider theft. A former curator at the Rockland County\n\tHistorical Society was arrested Thursday and charged with\tstealing the\n\tsociety's $60, 000 antique U.S. atlas.\nTo: \nMessage-ID: <008801c7a65b$2f39f270$8dadd750$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nSurrender in Theft of 1823 Atlas\nAssociated Press 05.31.07, 3:22 PM ET\n\n \nA former curator at the Rockland County Historical Society was arrested\nThursday and charged with stealing the society's $60,000 antique U.S. atlas.\n\nRebecca Chen, 50, of Highland Park, N.J., complied with a prearranged\nsurrender at Clarkstown police headquarters and was arraigned in Town Court\non a charge of second-degree larceny, said Detective Robert Schine.\n\nPolice reported last week that the book had been recovered and a suspect\nidentified, but her name was not made public until Thursday.\n\nSchine said that on April 22, Chen took the 1823 book, \"A New American\nAtlas,\" from a storage area at the Historical Society in New City, where she\nhad worked for several years until last fall.\n\n\"She basically just walked out with it,\" the detective said.\n\nThe atlas, published by Henry Tanner, is one of the earliest American\natlases with large maps of the separate states.\n\nOnce the theft was noticed, dealers in antiquarian books were notified.\nChristopher Lane of the Philadelphia Print Shop called police when he\nreceived an e-mail from Chen about the atlas.\n\n\"He was a great help,\" Schine said.\n\nPolice asked Lane to arrange a viewing of the book, and when Chen came to\nthe shop with it, the Clarkstown detective was there to confront her.\n\n\"She seemed a little surprised,\" Schine said Thursday. Asked whether she\nexpressed any regret for the theft, he said, \"Whenever you get caught, you\nregret it.\"\n\nHe said he did not know of any particular motive for the theft.\n\nChen was currently employed at the William Trent House Museum in Trenton,\nN.J., the detective said. She was allowed to surrender because she did not\nseem to be a flight risk and arresting her in Philadelphia would have meant\nextradition proceedings, he added.\n\n\"She cooperated with us and we decided we would let her turn herself in,\" he\nsaid.\n\nChen did not have a lawyer in court Thursday and no plea was entered, Schine\nsaid. She was ordered held on $5,000 bail for another court appearance\nMonday, by which time a public defender was to be assigned to the case.\n\nhttp://www.forbes.com/\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Mon, 4 Jun 2007 05:48:16 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Find Whitey: the hunt for the man with a $1m price on\n\this\thead. UK expert on the trail of godfather suspected of\n\tmasterminding $350m art heist.\nTo: \nMessage-ID: <008901c7a65b$304213a0$90c63ae0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nFind Whitey: the hunt for the man with a $1m price on his head\n\n\nUK expert on the trail of godfather suspected of masterminding $350m art\nheist \n\nSandra Laville in Las Palmas\nMonday June 4, 2007\nThe Guardian \n\n\n\"No, the legs are wrong. The walk is wrong. He'd be wearing a hat, and\nsunglasses, always sunglasses.\"\nAlong the two-mile promenade of Playa de las Canteras, elderly men with\nwhite hair and skin the colour of worn leather pass the time of day with\nfriends. Some walk purposefully along the beach skirting the surf line,\nbaseball hats pulled down on their heads. Others sit on benches smoking\ncigarettes.\n\nSecreted here, amid the sweep of hotels, facades of broken-down buildings\nand surfers' haunts, is a British art crime investigator working under the\npseudonym Chris Roberts to protect his anonymity. Nearing 60, he is a loner,\nwith strong contacts in the criminal underworld and a reputation for finding\nwhat he seeks. He is convinced he will know the man he wants when he sees\nhim. The legs will be distinctive, strong and significantly bowed, lending\nan unmistakeable sway to the walk. The face will be chiselled, the arms\nmuscular despite his 77 years and the blue eyes hidden behind aviator\nsunglasses. He will be carrying a knife.\n\nFor 12 years James \"Whitey\" Bulger has evaded capture. The violent and\nfeared godfather of the Irish mob in Boston, Massachusetts, Whitey fled the\nUS in 1995 after being tipped off by a corrupt FBI agent, John Connolly,\nthat an indictment was heading his way. With Connolly now in jail in the US,\nWhitey, so named because of his slick of white hair, is wanted for 19\nmurders, violating the laws against organised crime, extortion, drug dealing\nand money laundering, all committed from the early 1970s to the mid-80s.\nConsidered armed and extremely dangerous, he ranks in the top 10 of the\nFBI's list of most-wanted villains and carries a $1m (?500,000) bounty.\nIn 12 years the FBI's Bulger taskforce has searched England, Ireland,\nFrance, Italy, Thailand and Brazil for Whitey - the man on whom Martin\nScorsese is said to have modelled Frank Costello, played by Jack Nicholson\nin the Oscar-winning film The Departed.\n\n\nWhat might appear to be a search for a needle in a haystack has recently\nfocused on Spain. The US attorney in Boston, Michael Sullivan, will not\ncomment on the investigation but it is understood a Spanish arrest warrant\nhas been issued for Bulger and investigators from the justice department\nhave recently travelled to the Canary Islands in the hunt for him.\n\nWhat brings Roberts, one of Britain's leading specialist art crime\ninvestigators, to Gran Canaria dates back to 1990 in Boston, a city where\nnothing moved in the underworld without the Irish godfather knowing about\nit.\n\nIn the early hours of March 18, as Boston's St Patrick's Day celebrations\ndrew to a close, two thieves, dressed in ill-fitting police uniforms,\ncarried out one of the biggest art heists in history.\n\nThirteen paintings worth $350m - including Rembrandt's only seascape, The\nStorm on the Sea of Galilee, The Concert by Jan Vermeer, Landscape with an\nObelisk by Govaert Flinck, five Degas drawings and a Manet portrait - were\nstolen from the Isabella Stewart Gardner Museum.\n\nThe thieves handcuffed and bound the guards and ripped the canvases from the\nframes, leaving the ragged edges of the masterpieces protruding from the\nsmashed glass and splintered wood.\n\nThe crime may have taken place 17 years ago, but the hunt for the paintings\ncontinues. Many investigators believe Bulger was the mastermind. \"Find\nWhitey and you find the paintings,\" said Roberts.\n\nArmed with tips from informants, Roberts treads the beaches of Gran Canaria\nscanning the groups of old men in their 70s, watches the ferry port and sits\nscouring hotel lobbies, a digital camera and a notebook in his pocket. \"It's\nlike a painting, it tells you whether it's real or not if you know what you\nare looking for and look closely,\" he said.\n\nRoberts's success in recovering masterpieces for museums and private\nindividuals during his 30-year career belies the hard work and tedium of the\ntraditional gumshoe. Hunting for a fugitive requires good informants,\npatience, instinct, tenacity and an ability to take repeated, crushing\ndisappointments. Investigators immerse themselves in the lives of their\nsubject in an attempt to get inside their minds. In Bulger's case the FBI\nlists his predilections as walking on beaches, exercise, historical\nbuildings, libraries and a love of animals.\n\n\"He will be in a place away from the tourists, somewhere with a slightly\nseedy edge, where he can walk along the beach unnoticed and have control\nover his surroundings,\" said Roberts. \"What he won't want is to draw\nattention to himself. He is very proud of his physique, so will be keeping\nfit. He has to be in a place where he can escape quickly, not some small\nvillage where he would stand out and could be trapped.\"\n\nRoberts is one of at least two British experts trying to crack one of the\nart world's greatest mysteries. Other freelance bounty hunters are also\nlooking for the paintings, attracted by the $5m reward for the safe return\nof the works.\n\nUnlike most crimes, where the trail goes cold the longer the investigation\ncontinues, when it comes to high-value art thefts, the years that pass make\na breakthrough more likely. \"You are not looking for the thieves. It is the\nhandlers you want, the people who have hold of the art and have laid it down\nto await further instructions,\" Roberts said.\n\nContacted last year by the US attorney in Boston, he has visited Spain and\nthe Canaries four times in his search. In October last year he believed he\nhad spotted the fugitive in a rundown part of Alicante, exercising in the\nearly morning on the seafront. \"When I saw him I took pictures, and went\nback and watched again. It was his walk that gave him away, I was convinced\nit was him.\"\n\nHe took several photographs, contacted the lead investigator from the US\nattorney's justice department in Boston and sent off the pictures. \"It took\nseven weeks for them to turn up in Spain,\" he said. A return visit by\nRoberts during a wet, cold November drew a blank. \"By then I think he was\nlong gone.\"\n\nAccusations abound that the FBI and the US attorney's justice department\nhave been leaden-footed in the 12-year manhunt, fuelled by the history of\nthe mobster's relationship with the bureau. For nearly two decades Bulger\nwas a top-tier secret FBI informant and as such was given protection by his\ncorrupt handler, Connolly, from prosecution by other agencies, including the\npolice. The allegation is that the last thing many within the FBI want is to\nfind Bulger and stir memories of the rampant corruption within the agency in\nthe city.\n\nAs for the paintings, sources within the art crime underworld and the Garda\nbelieve they have been laid down in a secret hideaway in the west of\nIreland, a result of strong links between Bulger's Irish mafia in Boston and\nsenior figures within the IRA leadership at the time.\n\n\"If Bulger is caught there is no need for those who hold the paintings to\nhang on to them,\" said Roberts. \"That is the moment you are likely to have a\nbreakthrough. At the moment it is not worth the lives of those holding the\nart to do anything differently from what they have been told by the people\nwho are supporting Whitey's fugitive status.\"\n\nA security source within the art world said the paintings may be used as a\nbartering tool by known criminals. \"Art thefts in general are often carried\nout not for actual cash but for collateral for drugs or bartering your way\nout of charges,\" said the source. \"People steal art, store it away and hold\non to it. When they get into trouble, they use it as a means of trying to\nget out of trouble.\"\n\nIt is known that before he fled America, Bulger travelled to Ireland, the UK\nand elsewhere in Europe, leaving money and other possessions in deposit\nboxes as a means of support when on the run. Scotland Yard became involved\nin the case, the Guardian understands, when one of the many boxes deposited\nby Bulger was found in the security vaults of a bank near Piccadilly Circus.\nInside, officers found $50,000 and the key to another deposit box in Dublin.\nIn Boston, the head of security at the Gardner museum, Anthony Amore,\nbelieves the $5m reward will eventually attract vital information.\"There are\na number of investigations going on,\" said Mr Amore. \"Primarily, the FBI has\nthe jurisdiction, and they are heading up the investigation into the theft.\n\n\"From our perspective I will walk over broken glass to get the paintings\nback. We are optimistic. There are a number of very good people who are\ninvestigating the theft and issues around it,\" he said. He went on to name\nRoberts and another Briton.\n\nBut for Roberts the hunt ended in Gran Canaria, albeit temporarily, in\ndisappointment and a trail gone cold. His continued conviction, however,\nthat Bulger holds the key to finding the art comes as no surprise to museum\nstaff.\n\n\"He was the main crime boss in Boston at the time, he knew everything that\nwent on,\" said a museum source. \"No one really knows what the FBI are up to,\nthey don't tell us, but his name certainly cannot be ruled out.\"\n\nToday, the empty frames of the paintings still hang on the museum walls. A\nnotice next to the space where once Vermeer's The Concert hung reads: \"On\nthe night of March 18 1990 thieves stole 13 priceless works of art including\nThe Concert and The Storm on the Sea of Galilee. Anyone with information is\nasked to contact the FBI.\"\n\nMr Amore often pauses to stare at the empty frames. \"We like to look at\nthose empty frames as place holders for our art,\" he said. \"They are not\nthere to mourn the loss of the paintings, but to hold a place for those\nimportant pieces which we are sure will one day be returned to the Gardner\ncollection.\"\n\nRelated articles: http://www.guardian.co.uk/crime/article/0,,2094678,00.html\n01.03.2007: Prized works stolen from granddaughter of Picasso\n03.02.2006: Mansion art haul may be Britain's biggest\n02.02.2006: ?20m art theft riddle solved in court\n02.02.2006: Stealing beauty \n28.01.2006: Artful dodgers\n\nIn pictures: http://www.guardian.co.uk/crime/article/0,,2094678,00.html \nMissing masterpieces: a virtual gallery, by Jonathan Jones\n\nSpecial reports: http://www.guardian.co.uk/crime/article/0,,2094678,00.html\nArt theft\nCrime\n\nUseful links: http://www.guardian.co.uk/crime/article/0,,2094678,00.html\nThe world's most wanted art\nArt Loss Register\nInvaluable\nObject ID: international standard for describing art\nSotheby's\nChristie's\nMetropolitan police\nSwift-find: online registry of valuables\nCarabinieri: searchable database of looted art (in Italian)\n\n\n\n------------------------------\n\nMessage: 4\nDate: Mon, 4 Jun 2007 05:53:46 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Italy-Japan (Miho Museum). Witness fingers Japanese\n\tmuseum in\tItalian art-trafficking case\nTo: \nMessage-ID: <009301c7a65b$f3dc6310$db952930$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nWitness fingers Japanese museum in Italian art-trafficking case\nKazuki Matsuura / Yomiuri Shimbun Correspondent\n\nThe expert witness for the prosecution in a trial in Italy over the\ntrafficking of stolen art objects to the United States has claimed a\nJapanese museum is housing items unearthed illegally in Italy. \n\nAs the witness named the Miho Museum in Koka, Shiga Prefecture, the Italian\nprosecutors likely will begin a full-scale investigation into possible\ntrafficking of stolen items into Japan, sources said. \n\nThe expert, who has been investigating trafficking connected to the J. Paul\nGetty Museum in Los Angeles, named the museum in an effort to shed light on\nthe practice of art objects being illegally dug up and passed on to museums\nin countries other than the United States. \n\nAccording to the expert, some artwork housed in the Miho Museum, including a\ndecorative sculpture of marble from ancient Rome, known as an oscilla, were\nidentified from pictures of stolen items seized from a smuggling syndicate\nby the prosecutors. \n\nThe prosecutors have been investigating the smuggling ring, which has sold\nantiques illegally unearthed from archaeological sites and other places and\nshipped them to museums in Japan, the United States and other countries\nsince the mid-1990s. The investigation led prosecutors to the United States.\n\n\nThe J. Paul Getty Museum is believed to have obtained many antiques from a\nsyndicate based in Switzerland, and a curator and an American antique art\ndealer were charged with smuggling as they are believed to have cooperated\nwith the syndicate. The trial is taking place in a Rome criminal court. \n\nThe Italian prosecutors have also confirmed a Japanese antique art dealer\nwas involved in dealing between the syndicate and Japanese museums, sources\nsaid. \n\nThe investigators are said to be trying to match seized pictures with\nsuspicious items housed in several Japanese museums. \n\nNobuo Tsuji, director of the Miho Museum, said: \"I don't think all artwork\nhoused in our museum has a legal problem. But if the Italian government\nofficially asks us to return certain items, we'll consider how to proceed\nthen.\" \n\n(Jun. 4, 2007)\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Mon, 4 Jun 2007 05:53:46 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Austria-Canada. THE director of the Austrian museum\n\tfrom\twhere a diamond brooch was stolen nearly a decade ago said\the's\n\trelieved to know the heirloom is in safe hands -- even\tif he wasn't\n\taware it had been recovered in Winnipeg.\nTo: \nMessage-ID: <009401c7a65b$f531b9e0$df952da0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nPalace ecstatic queen's gem recovered\n\n\nSun Jun 3 2007\n\nBy Gabrielle Giroday\n\n \n \nTHE director of the Austrian museum from where a diamond brooch was stolen\nnearly a decade ago said he's relieved to know the heirloom is in safe hands\n-- even if he wasn't aware it had been recovered in Winnipeg. \n\"We've had a few calls all these years where people claimed to have found\nit, and it came to nothing,\" said Franz Sattlecker, the director of\nSchonbrunn Palace, where the diamond-encrusted brooch belonging to a\nlegendary queen named Empress Elisabeth disappeared during a daylight\nrobbery in 1998. \n\nHe said he had no clue the brooch had been found by Winnipeg police. \n\n\"Every two or three years we got some offers from different people who\nwanted to sell it to us,\" said Sattlecker. \"We just accepted the fact the\nstar had been stolen.\" \n\nThe brooch had been on loan to the museum from a private collector for an\nexhibit and kept in a glass container with an alarm. \n\n\"We are happy that it's back,\" he said. \"It is an important piece, and it\nwas very unpleasant (when we lost it)... it was such a long time ago.\"    \nSchonbrunn is now a UNESCO World Heritage Site where fans of 'Sisi' --\nElisabeth's nickname -- can visit. \n\nThe brooch was one of about 30 hairpins the dramatic queen of Austria, who\nreigned from 1854 to 1898, wore in her hair for portrait sittings, he said. \n\nThe missing pin was recovered in Winnipeg last week in a modest St. James\nhome as part of a far-reaching investigation by police officers across\nCanada. \n\nOn Friday, investigators announced charges against an alleged criminal ring\nthat participated in \"millions and millions\" of dollars of global robbery\nand fraud. \n\nPolice released the names of eight people, aged 21 to 83, charged in\nconnection with an alleged string of bank robberies, credit card fraud, and\nmortgage fraud. \n\nNone of the charges has been proven in court. \n\nGerald Daniel Blanchard, the 35-year-old Vancouver man who is alleged to be\nthe leader of the 'Blanchard gang', is facing 41 charges. \n\nHe's been in custody at Headingley Correctional Centre since January. He was\ncharged last week with conspiracy to kidnap and murder his one-time\ngirlfriend, Lynette Tien of Vancouver, one of the eight people charged in\nconnection with the ring. Blanchard grew up in Omaha, Neb., and has a\ngrandmother who lives in Winnipeg, whom family members said he visited\nperiodically. Police searched her home in St. James earlier this year, the\nFree Press reported Wednesday. \n\nBlanchard's lawyer Danny Gunn did not say whether the St. James house where\npolice say the brooch was seized is the same house where Blanchard's\ngrandmother lives. \n\n\"The family's been pretty much ripped apart by all of this,\" said Gunn, who\ncalled the charges against his client \"ludicrous.\" \n\n\"It's been very difficult for them.\" \n\ngabrielle.giroday@freepress.mb.ca \n\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Mon, 4 Jun 2007 05:53:46 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Ethiopia's president has sent Queen Elizabeth II a\n\tformal\trequest for the remains of a prince who died in Britain more\n\tthan a century ago.\nTo: \nMessage-ID: <009801c7a65b$f7449450$e5cdbcf0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nEthiopia seeks prince's remains \nBy Elizabeth Blunt \nBBC News, Addis Ababa  \n\n\n\nEthiopia's president has sent Queen Elizabeth II a formal request for the\nremains of a prince who died in Britain more than a century ago. \nThe royal household at Windsor Castle, where Prince Alemayehu was buried, is\nsaid to be considering the request. \n\nPresident Woldegiorgis Girma hopes the prince's bones can be reburied for\nmillennium celebrations in September. \n\nEthiopia has been waging a lively campaign to get back historic treasures\nlooted during the last two centuries. \n\nFather's suicide \n\nIts most striking success has been in recovering a massive stone obelisk\nfrom Axum, carried off to Rome by Mussolini's army. \n\nBut the campaign now has a new impetus. \n\nEthiopia's calendar is more than seven years behind that of the rest of the\nworld - here, it is still 1999 and Ethiopians are planning to mark what they\nbelieve is the 2000 anniversary of the birth of Christ with big celebrations\nin September. \n\n\n [Prince Alemayehu] was buried at Windsor Castle, with Queen Victoria\ndescribing as \"too sad\" his short life and early death \n \n\nNow the Ethiopian president has put in a formal request for the return of\nthe remains of Prince Alemayehu. \n\nHis father, the Emperor Tewodros II, committed suicide after his defeat by\nthe British at the Battle of Magdala in 1868. \n\nThe young boy was taken to Britain and sent to boarding school and officers'\ntraining school at Sandhurst, but died at the age of 18. \n\nHe was buried at Windsor Castle, with Queen Victoria describing as \"too sad\"\nhis short life and early death. \n\nThe Ethiopian embassy in London says Windsor is now considering their\nrequest. \n\nThe young prince was not the only thing the British took from Magdala - they\nreportedly needed 15 elephants and nearly 200 mules to carry away the\ntreasures that Tewodros had accumulated. \n\nMany of them are still in Britain and the Queen has some of them - notably\nsix of the very finest illuminated manuscripts, which are part of the royal\ncollection in Windsor Castle. \n\nStory from BBC NEWS:\nhttp://news.bbc.co.uk/go/pr/fr/-/2/hi/africa/6716921.stm\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 129\n****************************************\n\n"}