{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Robert Coulter\" <paxenjoytoztuf@enjoytoz.it>", "subject": "Watch your body change with Anatrim", "body": "\nSummer is coming, time to tone up\n\n\n\n\n\n\nAnatrim – The very up-to-date and most fascinating product for over-weight people available – As were seen on BBC.\n\n\nDo you remember all the cases when you told yourself you would do anything for being delivered from this desperately growing pounds of fat? Happily, now no big sacrifice is demanded. With Anatrim, the earth-shaking weight-reducing mixture, you can get naturally health life style and a really slender figure. Take a look at what our customers say!\n\n\n\n\"I hate to acknowledge it but I was an awful food addict. \n\n\nI ate all this rubbish \n\n\nand could not stop. \n\n\n\n\nThis misery left off when I started course of taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my craving for food disappeared, \n\n\nmood increased and I turned to the happiest person on the planet 20 pounds in 2.6 months. \n\n\n\n\nI can tell you now I became the happiest person!\"\n\n\n\n\n\nSilvia D., New York\n\n\n\n\n\n\"Since the very childhood I was a weighty boy. \n\n\nIt’s difficult to imagine how I hated being ridiculed at school. \n\n\n\n\nI hated my plumpness and I detested myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nThis stuff literally pulled me out of this horrible nightmare! Many and many thanks to you, guys.\"\n\n\n\n\n\nDave Klark, Las Vegas\n\n\n\n\n\n\"You know what? Anatrim saved my marriage! I went into the circle, depression – eating more – even more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce my friend showed me site and I asked for Anatrim as soon as it was possible. \n\n\nThe results were splendid, my appetite came to acceptable level, I was in a good mood oftener, and, certainly, I tightened my belt with no regrets. And the bed became cool, too!\"\n\n\n\n\n\nCharley\n\n\n\n\n There many and many sincere gratitudes left by happy people taking Anatrim. Don’t you wanna join the tens of thousands of slender women and men and try this natural appetite-reducing power lifting product now!\n\n\nDon’t miss the chance!\n\n\n\n\n"}