{"category": "ham", "to_address": "samba-cvs@samba.org", "from_address": "sfrench@samba.org", "subject": "svn commit: samba-web r1106 - in trunk: .", "body": "Author: sfrench\nDate: 2007-04-27 13:24:18 +0000 (Fri, 27 Apr 2007)\nNew Revision: 1106\n\nWebSVN: http://websvn.samba.org/cgi-bin/viewcvs.cgi?view=rev&root=samba-web&rev=1106\n\nLog:\nUpdate cifs client home page to indicate new version numbers\n\nModified:\n   trunk/Linux_CIFS_client.html\n\n\nChangeset:\nModified: trunk/Linux_CIFS_client.html\n===================================================================\n--- trunk/Linux_CIFS_client.html\t2007-04-25 12:19:28 UTC (rev 1105)\n+++ trunk/Linux_CIFS_client.html\t2007-04-27 13:24:18 UTC (rev 1106)\n@@ -1,90 +1,114 @@\n-\n-\n-\n-Linux CIFS Client\n-\n-\n-\n-\n-\n-\n- \n-LATEST UPDATES - cifs vfs version 1.45 is accepted into mainline kernel (2.6.18) and includes full posix byte range locking support to current Samba servers, and also has much improved posix locking support to other servers, even those which do not support the CIFS POSIX protocol extensions.  cifs 1.45 also includes much improved support for legacy servers including OS/2 and Windows 9x.  A backported version of cifs 1.45 which builds on old kernel versions is also available. cifs vfs 1.46 is current in the cifs-2.6.git tree.\n-\n-  \n-  \n-  \n-    \n-      \n-      \n-      CIFS VFS - \n-      \n-      \n-      Advanced Common Internet File System for \n-  Linux \n-      \n-      \n-    \n-    \n-      \n-      \n-      Questions to developers \n-      \n-        Search for open bugs in bugzilla \n-        Download\n-        CIFS Testing\n-        Suggested test plan (under construction)\n-        Installation \n-        Todo list \n-        SNIA \n-        CIFS Specification \n-        Authors/Thanksr\n-      \n-      \n-      \n-      The CIFS VFS is a virtual file system for Linux to allow access to servers\n-      and storage appliances compliant with the SNIA CIFS Specification version\n-      1.0 or later.    Popular servers such as Samba, Windows\n-      2000, Windows XP and many others support CIFS by default.   The\n-      CIFS VFS provides some support for older servers based on the more\n-      primitive SMB (Server Message Block) protocol (you also can use the Linux filesystem\n-      smbfs as an alternative for accessing these).   CIFS VFS is designed to take\n-      advantage of advanced network filesystem features such as locking, Unicode (advanced\n-      internationalization), hardlinks, dfs (heirarchical, replicated name space),\n-      distributed caching and uses native TCP names (rather than RFC1001, Netbios\n-      names).  Unlike some other network filesystems all key network function\n-      including authentication is provided in kernel (and changes to mount and/or\n-      a mount helper file are not required in order to enable the CIFS VFS).\n-      With the addition of upcoming improvements to the mount helper (mount.cifs)\n-      the CIFS VFS will be able to take advantage of the new CIFS URL specification\n-      though.   The Todo list includes some of the other features being\n-      planned for future releases.   The CIFS VFS has been tested with\n-      Linux 2.4.14 and later as well as regular testing on Linux 2.6 (and has\n-      been in the kernel source starting with Linux kernel 2.5.42. The CIFS client\n-      is no longer considered \"expiremental\" in Linux versions after\n-      2.6.7 (cifs version 1.19) or later. Testing has been done on various hardware\n-      architectures including x86 and even big endian zSeries hardware.  \n-      The cifs and smbfs filesystems can coexist on the same system and do not\n-      conflict. \n-       \n-      The current version of the CIFS VFS has been backported to compile on 2.4 kernels, not just older 2.6. kernel versions).  To download replacement files for the\n-      fs/cifs directory which includes a relatively recent version of the cifs\n-      vfs click 1.45 for 2.6 kernels (released August 2nd, 2006).CIFS VFS is licensed under the GNU General Public License \n-      version 2 or later. \n-      \n-    \n-    \n-      \n-      Thanks to SNIA, IBM and the Samba Team\n-        \n-      for their assistance \n-      and support.\n-    \n-  \n-\n-\n-\n+\n+\n+\n+\t\n+\tLinux CIFS Client\n+\t\n+\t\n+\t\n+\t\n+\t\n+\t\n+\n+\n+  \n+\n+LATEST UPDATES \\u2013 cifs user's guide documentation is now\n+available on samba.org.  cifs vfs version 1.48 is accepted into\n+mainline kernel (2.6.21) which includes spectacularly better write\n+performance for some common small sequential write workloads. cifs\n+1.49 includes support for ipv6 and also much better mkdir performance\n+to Samba 3.0.25 (which leverages the newest CIFS POSIX protocol\n+extensions). A backported version of cifs 1.48 which builds on old\n+kernel versions is also available.  cifs vfs 1.49 is current in the\n+cifs-2.6.git tree.\n+\n+\t\n+\t\t\n+\t\t\tCIFS VFS - \n+\t\t\tAdvanced Common Internet File System for Linux \n+\t\t\n+\t\n+\t\n+\t\t\n+\t\t\t\n+\t\t\tQuestions to developers \n+\t\t\t\t\t\t\n+\t\t\t\n+\t\t\t\tDocumentation\n+\t\t\t\t(CIFS Users Guide)\n+\t\t\t\tSearch\n+\t\t\t\tfor open bugs in bugzilla \n+\t\t\t\t\n+\t\t\t\tDownload\n+\t\t\t\t\t\t\t\t\n+\t\t\t\tCIFS\n+\t\t\t\tTesting \n+\t\t\t\t\n+\t\t\t\tSuggested test plan (under\n+\t\t\t\tconstruction) \n+\t\t\t\t\n+\t\t\t\tInstallation \n+\t\t\t\t\t\t\t\t\n+\t\t\t\tTodo\n+\t\t\t\tlist  \n+\t\t\t\t\n+\t\t\t\tSNIA\n+\t\t\t\tCIFS Specification  \n+\t\t\t\t\n+\t\t\t\tAuthors/Thanksr\n+\t\t\t\t\t\t\t\t\n+\t\t\t\n+\t\t\n+\t\t\n+\t\t\tThe CIFS VFS is a virtual file system for Linux to allow access\n+\t\t\tto servers and storage appliances compliant with the SNIA CIFS\n+\t\t\tSpecification version 1.0 or later.    Popular\n+\t\t\tservers such as Samba, Windows 2000, Windows XP and many others\n+\t\t\tsupport CIFS by default.   The CIFS VFS provides\n+\t\t\tsome support for older servers based on the more primitive SMB\n+\t\t\t(Server Message Block) protocol (you also can use the Linux file\n+\t\t\tsystem smbfs as an alternative for accessing these).  \n+\t\t\tCIFS VFS is designed to take advantage of advanced network file\n+\t\t\tsystem features such as locking, Unicode (advanced\n+\t\t\tinternationalization), hardlinks, dfs (hierarchical, replicated\n+\t\t\tname space), distributed caching and uses native TCP names (rather\n+\t\t\tthan RFC1001, Netbios names).  Unlike some other network file\n+\t\t\tsystems all key network function including authentication is\n+\t\t\tprovided in kernel (and changes to mount and/or a mount helper\n+\t\t\tfile are not required in order to enable the CIFS VFS). With the\n+\t\t\taddition of upcoming improvements to the mount helper (mount.cifs)\n+\t\t\tthe CIFS VFS will be able to take advantage of the new CIFS URL\n+\t\t\tspecification though.   The TODO list includes some of\n+\t\t\tthe other features being planned for future releases.  \n+\t\t\tThe CIFS VFS has been tested with Linux 2.4.14 and later as well\n+\t\t\tas regular testing on Linux 2.6 (and has been in the kernel source\n+\t\t\tstarting with Linux kernel 2.5.42. The CIFS client is no longer\n+\t\t\tconsidered \"expiremental\" in Linux versions after 2.6.7\n+\t\t\t(cifs version 1.19) or later. Testing has been done on various\n+\t\t\thardware architectures including x86 and even big endian zSeries\n+\t\t\thardware.   The cifs and smbfs file systems can coexist\n+\t\t\ton the same system and do not conflict.   \n+\t\t\t\n+\t\t\tThe current version of the CIFS VFS has been backported to\n+\t\t\tcompile on 2.4 kernels, not just older 2.6. kernel versions). To\n+\t\t\tdownload replacement files for the fs/cifs directory which\n+\t\t\tincludes a relatively recent version of the cifs vfs which has\n+\t\t\tbeen backported to build on various earlier kernels click cifs\n+\t\t\t1.48a for 2.6 kernels (released April 4th, 2007).\n+\t\t\tCIFS VFS is licensed under the GNU\n+\t\t\tGeneral Public License version 2 or later. \n+\t\t\n+\t\n+\t\n+\t\t\n+\t\t\n+\t\t\tThanks to SNIA, IBM and the Samba Team \n+\t\t\tfor their assistance and support.\n+\t\t\n+\t\n+\n+\n+\n+\n+\n\\ No newline at end of file\n\n"}