{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (May 2, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 2, 2007\n\n\nMay 2, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for May 2, 2007  \n\n\n\nFirst Enercast Featured Articles for May 2, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 2, 2007 PowerMarketers Industry Publications\n\n\n\nOne Stop Shopping (EnergyBiz Insider - May 2, 2007)\n\n\n\nEnergyBiz Insider - May 2, 2007 - It's hard to know whether vendor innovations are driving utility decisions or whether utility demand is pushing software vendors to innovate.\n\n\nMay 2, 2007 PowerMarketers Industry Publications\n\n\n\nEuropean Energy Trading and Risk Management IT Benchmarking Study (UtiliPoint.com - May 2, 2007)\n\n\n\nUtiliPoint.com - May 2, 2007 - UtiliPoint International is conducting an examination of information technology utilized by utilities, energy marketers, and energy producers in Europe. \n\n\nMay 2, 2007 PowerMarketers Industry Publications\n\n\n\nKermitology (Roger Feldman - May 2, 2007) \n\n\n\nRoger Feldman - May 2, 2007 - That the tipping point in national belief in global warming&#8217;s existence has occurred is not news.\n\n\nMay 2, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nWisconsin Energy net income declines: But natural gas profits up on higher rates, cold\n\n\n\nMay 2--Higher natural gas rates and cold winter weather helped boost profit from sales of natural gas by $28 million in the first quarter, Wisconsin Energy Corp. said Tuesday.  But those higher rates weren't enough to offset the $44 million in higher costs of electricity the company's utility business, We Energies, had to buy when its power plants were out of service for maintenance.\n\n\nMay 2, 2007 Knight Ridder Tribune Business News\n\n\n\nClimate experts to devise new clean air protocols\n\n\n\nMay 2--The governor's climate experts will meet with environmentalists to work out a new clean air plan to supersede one that has been gathering dust for about two years.  Roger Smith, Connecticut Climate Coordinator, said government agency representatives will sit down with business leaders, environmental groups, academicians and others in the next few days to jump-start the state's Climate ...\n\n\nMay 2, 2007 Knight Ridder Tribune Business News\n\n\n\nNapocor to bid out Pagbilao coal supply\n\n\n\nMay 2--NATIONAL Power Corp. (Napocor) is bidding out the coal supply contract of the Pagbilao power plant at a cost of a billion pesos.  Documents obtained from the state-run power-generation company show that it has invited seven prequalified bidders for five shipments worth P1.24 billion. The approved budget for the contract is about P249 million per shipment at a reference price of $67 a ...\n\n\nMay 2, 2007 Knight Ridder Tribune Business News\n\n\n\nGovernor's mansion going green: Installating solar panels first step toward cutting power usage at official residence\n\n\n\nMay 2--ALBANY -- Solar panels should start showing up at the Executive Mansion this summer under an effort to make it the nation's first \"green\" residence for a governor.  The goal is to meet about 40 percent of the mansion's electrical needs from the sun by next year, First Lady Silda Wall Spitzer said Tuesday. \"Starting today, the mansion will also function as a sustainable building,\" she said. ...\n\n\nMay 2, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nCalvert Cliffs is UniStar's new site\n\n\n\nBALTIMORE, May. 1 (UPI) --  Maryland's Calvert Cliffs nuclear plant is the site for UniStar Nuclear's first new license application, which the company says will pave the way for more. UniStar Nuclear, a joint venture between Constellation Energy and Areva Inc., notified the U.S. Nuclear Regulatory Commission Monday it is interested in building a new reactor adjacent to the Lusby, Md., plant, ...\n\n\nMay 2, 2007 Washington Times\n\n\n\nStates move to curb greenhouse emissions\n\n\n\nFront Page&gt; UPI Page advertisement WASHINGTON, May. 1 (UPI) --  Nearly half of U.S. states, including Maryland, Minnesota and Washington, are taking steps to curb the greenhouse gases that cause global warming. The states are utilizing at least one of three strategies aimed at lowering fossil fuel consumption: cleaning up smokestacks at power plants, lowering automobile exhaust and harnessing ...\n\n\nMay 1, 2007 Washington Times\n\n\n\nNorth Country lawmakers want more power lines\n\n\n\nLANCASTER, N.H. - Lawmakers from northern New Hampshire say the region needs more power lines to handle the output from future power projects. The legislative delegation from Coos County sent a resolution to Gov. John Lynch asking him to promote upgrading transmission lines so any new power generated by wind or wood power plants, for instance, can move into the regional power grid.\n\n\nMay 1, 2007 Boston Herald\n\n\n\n\n\nCMS Energy Completes Sale of Venezuelan Electric Utility and Related Assets to Petroleos de Venezuela S.A.\n\n\n\nJACKSON, Mich., May 1 /PRNewswire-FirstCall/ -- CMS Energy completed today the sale of its interest in Sistema Electrico de Nueva Esparta, C.A. (SENECA), including an 88 percent stake, certain associated generating equipment, and other assets to Petroleos de Venezuela S.A., which is owned by the Bolivarian Republic of Venezuela, for $105.5 million. SENECA is an electric utility that serves the ...\n\n\nMay 1, 2007 PR Newswire\n\n\n\nEnergy Savings Income Fund Receive Favourable Tax Ruling and Completes Internal Reorganization\n\n\n\nEnergy Savings Income Fund (TSX: SIF.UN) (the \"Fund\") announced today it received a favourable advance income tax ruling dated March 30, 2007 from the Canada Revenue Agency which enabled it to complete on April 30, 2007 an internal corporate reorganization of the Fund and certain of its affiliates (the \"Reorganization\"). The Reorganization was approved at the Fund's June 29, 2005 Annual and ...\n\n\nMay 1, 2007 Internet Wire\n\n\n\nDominion Signs Contract with GE Energy for Long-Lead Nuclear Components\n\n\n\nRICHMOND, Va., May 1 /PRNewswire-FirstCall/ -- Dominion (NYSE: D), one of the nation's largest energy companies, announced Tuesday that it has signed a contract with GE Energy to secure components for a possible new nuclear- powered electric generating unit. (Logo: http://www.newscom.com/cgi-bin/prnh/20000831/DLOGO Under terms of the contract, which are confidential, GE Energy would provide ...\n\n\nMay 1, 2007 PR Newswire\n\n\n\nWashington Gas Customers, Area Residents Can Now Call 811 Before They Dig\n\n\n\nWashington Gas customers and residents in the District of Columbia, Maryland and Virginia today have a new, convenient telephone number to call prior to engaging in any project that requires digging. That number is 811. Individual and professional excavators are required by law to call before they dig so underground utility lines can be marked and avoided. Before the national 811 number, D.C. ...\n\n\nMay 1, 2007 PR Newswire\n\n\n\nTECO Energy Publishes Corporate Social Responsibility Report\n\n\n\nTAMPA, Fla.--(BUSINESS WIRE)--TECO Energy (NYSE:TE) today released a report outlining its corporate social responsibility efforts. The report details the companys involvement and engagement with its key stakeholder groups: investors, customers, its team members, the communities in which it operates, and the environment. Chairman and CEO Sherrill Hudson said, TECO Energys vision is to be a company ...\n\n\nMay 1, 2007 Business Wire\n\n\n\nARSC Subsidiary American Wind Power Corporation Inks Wind Turbine Deal\n\n\n\nHOUSTON--(BUSINESS WIRE)--American Security Resources Corporation (OTCBB:ARSC) President and COO, Bob Farr, announced today, Late yesterday evening we signed the agreement giving our new subsidiary the exclusive right to develop and commercially market a residential scale version of the patented Noble Wind Turbine. Farr continued, We have formed a subsidiary, American Wind Power Corporation, to ...\n\n\nMay 1, 2007 Business Wire\n\n\n\nHistoric Agreement Results in Major Energy and Water Savings\n\n\n\nToday the Association of Home Appliance Manufacturers (AHAM) along with a nationwide coalition of energy and water efficiency supporters announced an historic agreement that will establish new mandatory federal energy and water efficiency standards, new EnergyStar levels and manufacturer tax credits for the production of super- efficient clothes washers, dishwashers, refrigerators and ...\n\n\nMay 1, 2007 PR Newswire\n\n\n\nRoyal Utilities Income Fund 2007 Annual Meeting\n\n\n\nRoyal Utilities Income Fund (the \"Fund\") (TSX: RU.UN) will hold its Annual Meeting on Wednesday, May 23, 2007 at Roy Thomson Hall, 60 Simcoe Street, Toronto, Canada. This meeting will begin at 2:00 p.m. EDT.  Royal Utilities Income Fund (the \"Fund\") (TSX: RU.UN) will hold its Annual Meeting on Wednesday, May 23, 2007 at Roy Thomson Hall, 60 Simcoe Street, Toronto, Canada.\n\n\nMay 1, 2007 Internet Wire\n\n\n\n\n\nTurning On the Juice in the Big Easy\n\n\n\nEntergy New Orleans wins approval of its reorganization plan; for months after its grid was destroyed by Hurricane Katrina, the utility was left with few paying customers. Stephen Taub , CFO.com Creditors of Entergy New Orleans approved a bankruptcy reorganization plan, according to the Associated Press, which cited an attorney for the electricity and natural gas utility.\n\n\nMay 1, 2007 CFO.com\n\n\n\nRange plan to boost stake in Virginia gas field wins antitrust OK\n\n\n\nWashington (Platts)--30Apr2007  Range Resources' proposal to pay Pittsburgh-based Equitable Resources $315 million to increase its stake in the Nora natural gas field in southwest Virginia poses no antitrust concerns, the US government said Monday.      In an early termination notice under the Hart-Scott-Rodino Antitrust Improvements Act, the Federal Trade Commission said neither it nor the ...\n\n\nMay 1, 2007 Platts\n\n\n\nBroadband Over Power Lines - Is It for Real?\n\n\n\nWhile broadband services have penetrated a large portion of the United States, many rural communities still have few options beyond dial-up. Forty-four percent of dial-up subscribers live in rural areas. Only 23 percent of rural residents subscribe to broadband services. This low broadband penetration is not due to lack of demand. Barracuda Networks' high-end, low-cost Spam Firewalls and Web ...\n\n\nMay 1, 2007 E-Commerce Times\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nU.S. and China criticize climate report calling for action\n\n\n\nBANGKOK, Thailand: The European Union called on developing countries Tuesday to take action to reduce greenhouse gases, as delegates worked to finalize a report detailing measures needed to save the planet. The draft report from the Intergovernmental Panel on Climate Change being debated in Bangkok says the world must quickly embrace energy efficiency and shift away from fossil fuels to help keep ...\n\n\nMay 1, 2007 International Herald Tribune\n\n\n\nEU asks developing nations to reduce greenhouse gases\n\n\n\ncalled on developing countries to take action to reduce greenhouse gases, as delegates worked to finalize a report detailing measures needed to limit global warming. The draft report from the Intergovernmental Panel on Climate Change being debated in Bangkok says the world must quickly embrace energy efficiency and shift away from fossil fuels to help keep the temperature increase to 2 degrees ...\n\n\nMay 1, 2007 International Herald Tribune\n\n\n\nMosenergo begins construction of new power unit in Moscow\n\n\n\n- Russian electricity provider Mosenergo has started constructing a new power unit at its CHPP-26 power station in Moscow, according to state power firm Unified Energy System (RAO UES). The unit will use fourth-generation combined-cycle technology to help significantly improve the plant's performance. RAO UES said that the new power unit would have an efficiency of 59 per cent, which will save ...\n\n\nMay 1, 2007 Power Engineering\n\n\n\nMirant Completes Sale of Six U.S. Gas Plants\n\n\n\nATLANTA, May 1 /PRNewswire-FirstCall/ -- Mirant Corporation (NYSE: MIR) announced today that it has completed the sale of six U.S. natural gas fired plants to Broadway Generating Company, LLC, a member of the LS Power Group. The net proceeds to Mirant from the sale, after paying transaction expenses and retiring $83 million of project-related debt, were $1.306 billion. The following U.S.\n\n\nMay 1, 2007 PR Newswire\n\n\n\nGE to Supply Additional 600 Megawatts of Wind Turbines to Invenergy\n\n\n\nATLANTA--(BUSINESS WIRE)--GE Energy (NYSE:GE), the leading supplier of technology and services for the U.S. wind industry, will provide an additional 600 megawatts of wind turbines to Invenergy Wind LLC for 2008 projects in the United States and Canada. Invenergy previously announced the purchase of 600 megawatts of GE Energy wind turbines for 2007 projects.\n\n\nMay 1, 2007 Business Wire\n\n\n\nTaiwan Power Shortage May Be Bigger Threat Than China Missiles\n\n\n\n4:41 PM tdworld.com An impending power shortage could cause blackouts in Taiwan within three years and weaken the nation's economy, according to a Bloomberg report. Power production is failing to keep pace with demand because of a ban on new nuclear plants and delays in completing projects already underway, said Jeffrey Bor, a fellow at the Chung-hua Institution for Economic Research, which ...\n\n\nMay 1, 2007 Transmission & Distribution World\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}