{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (May 3, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 3, 2007\n\n\nMay 3, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for May 3, 2007  \n\n\n\nFirst Enercast Featured Articles for May 3, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nMay 3, 2007 PowerMarketers Industry Publications\n\n\n\nTHIS WEEK AT EIA (Volume 9, Issue 18) (April 27 - May 3, 2007)  \n\n\n\nEIA - May 3, 2007 - THIS WEEK AT EIA is a list summarizing and providing URLs for every Energy Information Administration (EIA) product released during this week.\n\n\nMay 3, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nWestar's new president aims to keep the lights on, the public happy\n\n\n\nMay 3--Westar Energy's turning point came encased in ice in January 2005. An ice storm flattened a third of the company's electric grid, doing $42 million in damage and leaving 211,000 customers without power.  That's the price Westar paid for a chance to turn the page from seven years of financial problems and scandal while proving its mettle as a responsive electric utility, said Bill Moore, ...\n\n\nMay 3, 2007 Knight Ridder Tribune Business News\n\n\n\nXcel recruiting welders for power plant\n\n\n\nMay 2--Xcel Energy needs a few good welders.  The Denver company is building a new 750 megawatt power plant southeast of Pueblo and was in Greeley earlier this week recruiting employees from welding classes at Aims Community College. The plant, when it comes on line in 2009, will provide enough power for 750,000 homes. Mike Hernandez, the company's director of labor and community relations , ...\n\n\nMay 2, 2007 Knight Ridder Tribune Business News\n\n\n\nTECO Energy Increases Dividend As It Completes Turnaround\n\n\n\nMay 3--TAMPA -- Before meeting with shareholders at its annual meeting Wednesday, TECO Energy boosted its quarterly dividend by 2.6 percent, the first increase in five years and a sign the company has completed its climb out of a financial hole.  The Tampa-based energy company increased the quarterly dividend paid to shareholders to 19.5 cents a share, or 78 cents a share each year.\n\n\nMay 3, 2007 Knight Ridder Tribune Business News\n\n\n\nFirm hints to bring back uranium mill\n\n\n\nMay 2--It operated only for a few months a quarter century ago, but the rising price of uranium has prompted a Canadian mining company to buy the Shootaring Canyon Uranium Mill north of Lake Powell.  U.S. Energy Corp. said Tuesday it sold the mothballed mill near Ticaboo, along with 38,000 acres of mineral claims and leases, to sxr Uranium One Inc. The mining parcels include the Sage Mine in San ...\n\n\nMay 2, 2007 Knight Ridder Tribune Business News\n\n\n\nCity embraces solar power\n\n\n\nMay 2--LOMA LINDA -- With the flip of a switch, the city on Tuesday formally ushered in the solar power era.  City officials fired up a solar-powered message board in a demonstration of the 267-kilowatt solar power system that became fully operational last week. \"This is a new opportunity for the city of Loma Linda to go green, take advantage of new technology and, in the long term, lower our ...\n\n\nMay 2, 2007 Knight Ridder Tribune Business News\n\n\n\nPGE takes on utility tax law\n\n\n\nMay 2--Ratepayer advocates are voicing concerns about what they see as an attempt by Portland General Electric Co. to turn back the clock to tax accounting machinations employed by Enron and subsequently outlawed by Oregon legislators.  Filings PGE and customer groups made to utility regulators in the past week could, in fact, presage a legal challenge to a controversial tax law commonly referred ...\n\n\nMay 2, 2007 Knight Ridder Tribune Business News\n\n\n\nChesapeake reports '06 compensation\n\n\n\nMay 2--Chesapeake Energy Corp.'s two founding executives received $51 million in compensation in 2006, the Oklahoma City company disclosed in a filing with the U.S. Securities and Exchange Commission.  Chairman and Chief Executive Officer Aubrey McClendon earned a salary of $975,000 plus a bonus of $1.6 million, in addition to company stock and options awards of $19.9 million, Chesapeake reported ...\n\n\nMay 2, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nNatural gas begins flowing into Florida\n\n\n\nthrough a new 167-mile pipeline that will bring up to 220 million cubic feet per day into Florida. Southern Natural Gas Company, a subsidiary of El Paso Corporation, said the Cypress Pipeline runs from Elba Island, near Savannah, Ga., into northern Florida near Jacksonville. It will interconnect with the Florida Gas Transmission system. \"We are pleased to deliver this project and its important ...\n\n\nMay 2, 2007 Florida Today\n\n\n\nStart-up company pursues plan for nuke plant near Bruneau\n\n\n\nBut Alternative Energy Holdings' proposal faces some big hurdles, including money, permits, public concerns Edition Date: 05/02/07 On a rainy day, Don Gillispie looks over a remote hay field southwest of Mountain Home. He has a grand plan for this field. Gillispie hopes that by 2015, this farmland, with its sweeping vistas of the Owyhee Mountains, will be home to the nation's largest nuclear ...\n\n\nMay 3, 2007 Idaho Statesman\n\n\n\nPepsiCo Claims Top Spot For Renewable Energy Purchases\n\n\n\n-- PepsiCo announced on April 30 a landmark 3-year purchase of renewable energy certificates (RECs) which is comprised of more than 1 billion kilowatt-hours annually. Based on national average emissions rates, the U.S. EPA estimates PepsiCo's purchase is the same amount of electricity needed to power nearly 90,000 average American homes annually. This is the largest REC purchase to da; the ...\n\n\nMay 3, 2007 Industry Week\n\n\n\nTECO Energy Increases Dividend As It Completes Turnaround\n\n\n\nSkip directly to the full story. By RUSSELL RAY  Published: May 3, 2007  More from this channel: This feature requires the Macromedia Flash Plugin. Please visit http://www.macromedia.com/go/getflashplayer to download this plugin. Search for more information:   |  TAMPA - Before meeting with shareholders at its annual meeting Wednesday, TECO Energy boosted its quarterly dividend by 2.6 percent, ...\n\n\nMay 3, 2007 Tampa Tribune\n\n\n\nSouth Texas nuke adds 50 MW after outage\n\n\n\n-- The South Texas Project nuclear power plant's Unit 2 reactor resumed full-power operation following a refueling and maintenance outage. In addition to refueling, several major equipment components were upgraded in 34 days? surpassing previous outages with similar scopes of work by six days. STP's Unit 2 reactor now produces 1,400 MW of electricity. Unit 2's three low-pressure turbines and main ...\n\n\nMay 3, 2007 Power Engineering\n\n\n\n\n\nGreat Plains Energy Announces First Quarter Financial Results\n\n\n\nKANSAS CITY, Mo.--(BUSINESS WIRE)--Great Plains Energy Incorporated (NYSE:GXP) today announced first quarter 2007 reported earnings of $23.0 million or $0.28 per share, compared to a first quarter 2006 loss of $1.5 million or $0.02 per share. Core earnings, which exclude net mark-to-market gains and losses on energy contracts and other items, were a loss of $11.0 million or $0.13 per share in the ...\n\n\nMay 2, 2007 Business Wire\n\n\n\nAtmos Energy Declares Regular Quarterly Dividend\n\n\n\nDALLAS--(BUSINESS WIRE)--Atmos Energy Corporation (NYSE:ATO) said today that its Board of Directors declared a quarterly dividend on the companys common stock of 32 cents a share. The indicated annual dividend is $1.28. The dividend will be paid on June 11, 2007, to shareholders of record on May 25, 2007. This is the companys 94th consecutive dividend. Atmos Energy, headquartered in Dallas, is ...\n\n\nMay 2, 2007 Business Wire\n\n\n\nEnergy West, Incorporated Announces Earnings for the Third Quarter Ended March 31, 2007\n\n\n\nGREAT FALLS, Mont., May 2 /PRNewswire-FirstCall/ -- ENERGY WEST, INCORPORATED (Nasdaq: EWST), a natural gas, propane, and energy marketing company serving the Rocky Mountain states, today released unaudited earnings for the third quarter ended March 31, 2007. Consolidated net earnings for the quarter were $1,929,313, or $0.64 per share, which is an improvement of approximately 17% when compared ...\n\n\nMay 2, 2007 PR Newswire\n\n\n\nAGL Resources Board of Directors Declares Quarterly Dividend; Shareholders Elect Directors\n\n\n\nATLANTA, May 2 /PRNewswire-FirstCall/ -- The Board of Directors of AGL Resources Inc. (NYSE: ATG) today declared a quarterly dividend of $0.41 per share on the company's common stock. The dividend will be paid June 1, 2007 to shareholders of record at the close of business on May 18, 2007. This marks the 238th consecutive quarterly dividend the company has paid since 1948.\n\n\nMay 2, 2007 PR Newswire\n\n\n\nNighthawk Systems Announces Sales to Washington Electric District\n\n\n\n07:00 AM Eastern Daylight Time Nighthawk Systems Announces Sales to Washington Electric District SAN ANTONIO--(BUSINESS WIRE)--Nighthawk Systems, Inc. (OTCBB: NIHK), a leading provider of intelligent wireless power management and emergency notification solutions, today announced that it has received a second order for CEO700 whole house disconnect units from Chelan County Public Utility District ...\n\n\nMay 3, 2007 Business Wire\n\n\n\nHurricane - Force Winds Cut Power to More than 300,000 Texans\n\n\n\nOncor Electric Delivery crews worked through the night after storms with straight-line winds in excess of 75 miles per hour ripped across North Texas. The winds caused about a dozen transmission towers to fall southeast of Cleburne and also caused entire trees to fall into power lines. The extensive damage could mean that some residents could be without power for up to a week.\n\n\nMay 3, 2007 PR Newswire\n\n\n\n\n\nFitch: U.S. DOE NIETC Designations Will Improve Reliability\n\n\n\nNew York - Fitch Ratings has published a report on the U.S. Department of Energy's (DOE) two draft designations of National Electric Transmission Corridors (NIETC). The DOE created these designations on April 26, 2007. The draft NIETCs cover two separate geographic areas: the Mid-Atlantic Area National Corridor and the Southwest Area National Corridor. Plans for large multi-state transmission ...\n\n\nMay 2, 2007 Power Online\n\n\n\nAquila Investors Voice Opposition to Proposed Sale at Shareholders Meeting\n\n\n\nAquila Investors Voice Opposition to Proposed Sale at Shareholders Meeting David Twiddy May 2, 2007 - 9:39 p.m. BLUE SPRINGS, Mo. (AP) - Aquila Inc. on Wednesday continued to make its case for shareholders to support its proposed acquisition by Great Plains Energy Inc. and Black Hills Corp. later this year. But shareholders speaking at the utility's annual meeting largely criticized the idea, ...\n\n\nMay 3, 2007 Canadian Business Magazine\n\n\n\nRegulator says public will have say on tariff hikes\n\n\n\nTHE National Energy Regulator of SA (Nersa) confirmed yesterday that it had received a detailed submission from Eskom to back up its application for a tariff hike. The regulator said, however, it was not negotiating the requested hike. It has been reported that Eskom would seek electricity rate hikes of up to 18% to help fund its investment programme to increase generating capacity.\n\n\nMay 3, 2007 Business Day\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nShifting winds (Alan Zibel)\n\n\n\nFew worries about the environment, technology advances and tax break extensions are empowering European wind energy companies to try their luck in the United States. The United States has led the world in installing new wind turbines for the past two years, but it still ranks behind Germany and slightly below Spain in wind power production, according to the Global Wind Energy Council.\n\n\nMay 2, 2007 Washington Times\n\n\n\nBritish Energy to restart in May Hunterston B and Hinkley Point B reactors\n\n\n\n- British Energy expects the Hunterston B nuclear reactors and the two Hinkley Point B nuclear reactors, which were shut in late 2006 as a result of boiler tube safety fears, to restart later this month. British Energy revealed that in order to complete the periodic safety reviews (PSRs) the company has agreed to undertake a work program at both of the nuclear generation sites.\n\n\nMay 3, 2007 Power Engineering\n\n\n\nEnergy Bill Calls for Ethanol to Replace Gasoline, Prompts Debate Over Coal As Motor Fuel\n\n\n\nGraphic shows annual corn production and ethanol use; 1c x 3 inches; 46.5 mm x 76 mm WASHINGTON (AP) - Senators moved ahead Wednesday on legislation to replace one-quarter of the nation's gasoline with ethanol and set a goal of cutting gasoline consumption nearly in half by 2030. Coal-state lawmakers tried to promote liquefied coal as a motor fuel substitute, but their effort stalled amid a ...\n\n\nMay 3, 2007 Omaha World-Herald\n\n\n\nCleantech Venture Network Announces European Cleantech Award Winners for 2007\n\n\n\nSir Nicholas Stern; Marcel Brenninkmeijer, founder and CEO, Good Energies, Inc.; Acciona Energa and the Renewable Energy Corporation will be Honored at Cleantech Forum XIII, Frankfurt, May 14-16, 2007 Cleantech Forum XIII LONDON--(BUSINESS WIRE)--The Cleantech Venture Network, a Cleantech Group company, announced today the winners of its European Cleantech Awards for 2007.\n\n\nMay 3, 2007 Business Wire\n\n\n\nCMS Energy Completes Sale of Business Interests in the Middle East, Africa, and India\n\n\n\nJACKSON, Mich., May 2 /PRNewswire-FirstCall/ -- CMS Energy completed today the sale of its ownership interests in businesses in the Middle East, Africa, and India to the Abu Dhabi National Energy Company (TAQA) for $900 million. Proceeds from the sale of the company's CMS Generation subsidiary will be used to retire part of CMS Energy's parent company debt and for general corporate purposes, ...\n\n\nMay 2, 2007 PR Newswire\n\n\n\nJapan's oil future: Locking into a good deal?\n\n\n\nGovernments around the world that are waking up to the urgency of environmentally responsible policy-making - for now, that doesn't include George W. Bush's global-warming-denying gang - the search for non-polluting, alternative fuels is seriously under way. Still, no one has completely given up on petroleum products. Not yet. In fact, when Japanese prime minister Shinzo Abe touched down in Abu ...\n\n\nMay 2, 2007 San Francisco Chronicle\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}