{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"CNN Political Ticker\" <politicalticker@cnn.com>", "subject": "CNN Political Ticker AM, Monday, June 4, 2007", "body": "For the latest, breaking political news, check for updates throughout the day on the CNN Political Ticker\nhttp://www.cnn.com/ticker. All politics, all the time.\n\nCompiled by Stephen Bach (stephen.bach@cnn.com)\nCNN Washington Bureau\n\nMaking news today...\n\n* \"[T]he eight contenders shed some of the collegiality of their previous group appearances\" at last night's\nCNN/WMUR/Union Leader Democratic Presidential Debate, \"and made direct challenges to the votes and positions of their\nopponents on matters ranging from healthcare to energy policy.\" (Boston Globe)\n\nIt was \"a wide-ranging, often heated debate that promised to test their appeal among influential New Hampshire Primary\nvoters.\" (New Hampshire Union Leader)\n\nThe event \"brought the top three Democratic contenders into close proximity and gave them their first real chance to\njoust in public.\" (Washington Post)\n\nIn \"one of several striking exchanges - arguably the sharpest of the Democratic campaign\" - Obama said to Edwards, \"The\nfact is that I opposed this war from the start. So you're about four and a half years late on leadership on this\nissue.\" (New York Times)\n\n\"Clinton, standing between them, happily stayed out of the crossfire.\" (New York Daily News)\n\nBe sure to check out The Ticker's extensive coverage and live-blogging of the debate at cnn.com/ticker, and keep\nreading for post-debate headlines from around the country!\n\n* PROGRAMMING NOTE: Tonight at 7 pm ET, CNN will serve as the exclusive broadcaster of a presidential candidate forum\non faith, values and politics during the Sojourners \"Pentecost 2007\" conference in Washington, D.C.\n\nThe Rev. Jim Wallis of Sojourners, author of the best selling book\n\"God's Politics: Why the Right Gets It Wrong and the Left Doesn't Get It,\" has invited Democratic presidential\ncandidates Hillary Clinton, John Edwards and Barack Obama to share their ideas and proposals about pressing social\nissues with a special emphasis on poverty.\n\nCNN's Soledad O'Brien will moderate the event, live from The George Washington University's Lisner Auditorium.\n\nFor more information: http://www.sojo.net/index.cfm?action=action.P07&item=pentecost07_candidates_forum\n\n* Hillary Clinton \"holds a solid lead over her rivals for the Democratic presidential nomination\" in the latest\nWashington Post/ABC News poll.\n\nRudy Giuliani \" remains the leader in the GOP race, but the poll suggests that the surge in support he received after\ndeclaring his candidacy has stalled and that his backing of abortion rights and gay rights has caused more Republicans\nto turn away from him.\" (Washington Post)\n\n* And can you \"provide documented evidence of illicit sexual or intimate relations\" with a high-ranking government\nofficial?  If so, Larry Flynt may have $1 million with your name on it.\n\nFind out why in Hot Topics below!\n\nPresident's Schedule:\n\n* President Bush departed the White House this morning at 7 am ET for Prague, Czech Republic.  Later this week, the\nPresident and Mrs. Bush travel to Germany for the G-8 summit.\n\nAlso on the Political Radar:\n\n* Sen. Hillary Clinton (D-NY) attends a \"Women for Hillary\" town hall breakfast with Billie Jean King at the Hilton New\nYork at 8 am ET.\n\n* Elizabeth Edwards participates in the opening of the John Edwards' campaign HQ in Concord, New Hampshire, at 8:15 am\nET.\n\n* Sen. John McCain (R-AZ) gives a 10 am ET \"major policy address\" on immigration to the Greater Miami Chamber of\nCommerce at the Biltmore Hotel in Coral Gables, FL. Media avail at 10:30 am ET.\n\n>From advanced excerpts of his speech:\n\n\"It is a hard problem, and I understand that.  But the choice is between doing something, imperfect but effective and\nachievable, and doing nothing.\tI would hope that any candidate for President would not suggest doing nothing.\tAnd I\nwould hope they wouldn't play politics for their own interests if the cost of their ambition was to make this problem\neven harder to solve. To want the office so badly that you would intentionally make our country's problems worse might\nprove you can read a poll or take a cheap shot, but it hardly demonstrates presidential leadership.\"\n\n* NM Gov. Bill Richardson addresses the Rainbow/Push Coalition Forum at 10:30 am ET in Chicago.  He holds an 11 am ET\npress avail with Jesse Jackson.\n\n* GOP Presidential Candidate Rep. Ron Paul (R-TX) appears on \"The Daily Show with Jon Stewart.\"\n\n* Rep. Jan Schakowsky (D-IL) appears on \"The Colbert Report.\"\n\n* The Senate Radio-Television Correspondents' Gallery Daybook: http://www.senate.gov/galleries/radiotv/list.htm\n* The House Radio-Television Correspondents' Gallery Daybook: http://radiotv.house.gov/news-events.aspx\n\n=================================================================\nThe Reviews are In\n\nNashua Telegraph: Iraq votes dominate debate, as expected\nhttp://www.nashuatelegraph.com/apps/pbcs.dll/article?AID=/20070604/NEWS02/70604001\n\nBoston Globe: War, Clinton are targets in debate\nhttp://www.boston.com/news/local/new_hampshire/articles/2007/06/04/war_clinton_are_targets_in_debate/\n\nNew York Times: Iraq Is the Flash Point as 8 Democratic Rivals Clash\nhttp://www.nytimes.com/2007/06/04/us/politics/04debate.html\n\nBloomberg: Edwards, Clinton, Obama Skirmish on Iraq, Health Care in Debate\nhttp://www.bloomberg.com/apps/news?pid=washingtonstory&sid=aTW4PPRMIWLA\n\nWashington Post: Democrats Focus on Iraq In Contentious Second Debate\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/06/03/AR2007060301349.html?hpid=topnews\n\nWashington Times: Democrats take off gloves in debate http://washingtontimes.com/national/20070604-123002-6666r.htm\n\nThe Hill: Obama, Edwards exchange salvos on Iraq during CNN debate\nhttp://thehill.com/leading-the-news/obama-edwards-exchange-salvos-on-iraq-during-cnn-debate-2007-06-03.html\n\nNew York Daily News: It's bloody as Dems clash over Iraq vote\nhttp://www.nydailynews.com/news/wn_report/2007/06/04/2007-06-04_its_bloody_as_dems_clash_over_iraq_vote_.html\n\nNewsday: Dems spar over War on Terror http://www.newsday.com/news/nationworld/nation/ny-usdems0604,0,6566533.story\n\nChicago Tribune: Iraq takes center stage in debate; Democratic candidates let the blame fly\nhttp://www.chicagotribune.com/news/local/chi-debate_monjun04,1,399137.story\n\nHartford Courant: Delicate Discourse http://www.courant.com/news/politics/hc-demdebate0604.artjun04,0,355530.story\n\nLos Angeles Times: Democrats debate politely -- except on the war\nhttp://www.latimes.com/news/politics/la-na-demdebate4jun04,0,7270096.story\n\n=================================================================\nPolitical Hot Topics\n(Today's top political stories from news organizations across the country)\n\nGOP WILL \"GET NO BREAK FROM THE WAR OVER THE SUMMER\": Democratic congressional leaders, whose efforts to force a\nwithdrawal from Iraq were stymied last month, plan a summer of repeated Iraq-related votes designed to force Republican\nlawmakers to abandon the White House before the fall. At the same time, antiwar groups are expanding their campaign to\npressure GOP incumbents in their home states. Both efforts seek to ensure that anxious Republican lawmakers - many of\nwhom have said they want to wait until September to assess President Bush's Iraq strategy - get no break from the war\nover the summer. Los Angeles Times: Democrats plan a Capitol barrage over Iraq\nhttp://www.latimes.com/news/politics/la-na-congress4jun04,0,5769671.story\n\nIMMIGRATION BILL BACKERS \"OPTIMISTIC\": After a week at home with their constituents, the Senate architects of a\ndelicate immigration compromise are increasingly convinced that they will hold together this week to pass an overhaul\nof the nation's immigration laws, with momentum building behind one unifying theme: Today's immigration system is too\nbroken to go unaddressed. Congress's week-long Memorial Day recess was expected to leave the bill in tatters. But with\na week of action set to begin today, the legislation's champions say they believe that the voices of opposition,\nespecially from conservatives, represent a small segment of public opinion. Sen. Jon Kyl (R-Ariz.), who led\nnegotiations on the bill for his party, said the flood of angry calls and protests that greeted the deal two weeks ago\nhas since receded every day. Washington Post: Backers of Immigration Bill More Optimistic\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/06/03/AR2007060301455.html\n\nGINGRICH: BUSH FALLS SHORT: Newt Gingrich described the Bush administration as dysfunctional and its unpopularity as\nhazardous to those in the Republican Party. \"The government is not functioning. It's not getting the job done,\" said\nthe former House speaker, who is considering a run for the Republican presidential nomination. \"Republicans need to\nconfront this reality.\" Gingrich said in a broadcast interview he believes Bush \"means very, very well\" but falls short\nwhen it comes to putting his goals in place and running the government. \"All you have to do is look at the examples\nI've given you today where the government simply fails,\" said Gingrich, citing the administration's handling of the war\nin Iraq, its immigration policies and response to Hurricane Katrina. AP via Yahoo! News: Gingrich takes Bush White\nHouse to task http://news.yahoo.com/s/ap/20070604/ap_on_el_pr/on_the2008_trail\n\n\"FIREWORKS\" OVER NEXT JUDICIAL NOMINEE? After six months of steadily approving President Bush's top-tier judicial\nnominations, Senators this week may be headed for their first partisan battle over the bench this Congress when the\nJudiciary Committee votes to install Leslie Southwick to the 5th U.S. Circuit Court of Appeals. Southwick is highly\nregarded in GOP circles, but his record on civil and human rights issues has raised concerns recently among some\nDemocrats and left-leaning organizations who view him as too incendiary for a lifetime appellate court spot. And while\nthat unease may not be enough to sink Southwick's Senate confirmation entirely, it may be just enough to spark some\nattention-getting fireworks when the Judiciary panel considers his appointment on Thursday. Roll Call: Nominee to Spark\nShowdown http://www.rollcall.com/issues/52_133/news/18729-1.html\n\nHOW FAST CAN THOMPSON RAISE SOME SPIEH? As a late entry into the crowded, expensive, presidential campaign, Fred\nThompson's first big test of viability will be his ability to raise money quickly. A major part of the former Tennessee\nsenator's strategy is a heavy reliance on the Internet to get his message out and to raise funds. He is also trying to\ntap into the large number of well-heeled Republican financiers who have yet to commit to a 2008 hopeful, amid\nwidespread disaffection among party loyalists with the current field. Yet a late start and signs that Mr. Thompson may\nadopt an unconventional campaign style -- limiting in-person appearances by making extensive use of blogging and online\nvideo -- could crimp the television actor's ability to raise money over the long haul. Wall Street Journal: Thompson's\nFirst Test: Raising Funds Fast http://online.wsj.com/article/SB118092036898223344.html?mod=blogs\n\n\"CLINTON'S LEAD REMAINS STEADY\": Sen. Hillary Rodham Clinton of New York holds a solid lead over her rivals for the\nDemocratic presidential nomination, while the contest for the Republican nomination appears even more unsettled than it\ndid when it began five months ago, according to a new Washington Post-ABC News poll. Clinton's lead remains steady over\nher two principal challengers, Sen. Barack Obama of Illinois and former senator John Edwards of North Carolina, and the\npoll contains troubling news for both. Obama's support has softened noticeably, highlighting the challenge he faces in\nturning high interest in his candidacy into votes. Edwards, meanwhile, has lost ground nationally over the past few\nmonths. Former New York mayor Rudolph W. Giuliani remains the leader in the GOP race, but the poll suggests that the\nsurge in support he received after declaring his candidacy has stalled and that his backing of abortion rights and gay\nrights has caused more Republicans to turn away from him. Washington Post: Clinton, Giuliani Maintain Leads, But GOP\nShows Signs of Shifting http://www.washingtonpost.com/wp-dyn/content/article/2007/06/02/AR2007060201255.html\n\nMITT'S BAIN BACKGROUND: Mitt Romney owes his nearly $350 million fortune and his political career to a delicate\nnegotiation with his boss in the summer of 1983. His boss, Bill Bain, founder of the Boston consulting firm Bain &\nCompany, called Mr. Romney into his corner office to say that the partners had picked him to start an investment fund\nto cash in on the huge gains their clients were making in the stock market. To Mr. Bain's surprise, Mr. Romney, then\n36, seemed wary. He worried about giving up his comfortable salary for a venture that might fail and, later, that\ninvesting would pose conflicts for a consulting firm. Mr. Bain had been determined not to cede any control of the\ninvestment fund, but over months of talks Mr. Romney persuaded him to do just that. New York Times: Romney's Political\nFortunes Tied to Riches He Gained in Business http://www.nytimes.com/2007/06/04/us/politics/04bain.html\n\nENTERING THE \"GOOGLEPLEX\": In presidential campaigns, some classic settings -- the New Hampshire pancake breakfast, the\nIowa school auditorium, the South Carolina church hall -- have served as the stage for candidates hoping to deliver\ntheir message up close and personal. It may be time to add a new one -- the shiny new Silicon Valley auditorium filled\nwith 1,000 multitasking tech types, laptops ablaze, cell phones on stun and fingers at the ready to research questions\nand a candidate's answers in real time... With four candidates having already made the pilgrimage -- Richardson,\nEdwards, McCain and New York Sen. Hillary Rodham Clinton -- and the rest of the pack invited, Google's unusual\npresidential \"job interview\" town halls highlight how candidates are searching for new and effective venues to lay out\ntheir agendas in the competitive and crowded 2008 contest. San Francisco Chronicle: Presidential hopefuls star on\nGoogle's stage http://www.sfgate.com/cgi-bin/article.cgi?file=/c/a/2007/06/04/MNGH6Q71MJ1.DTL\n\n\"THE MAN WHO WOULD TAKE AWAY YOUR GUNS\": In New York, Michael R. Bloomberg is known as the billionaire media mogul who\nbecame mayor. But in many parts of the country, he is the man who would take away your guns. An editorial writer in\nHarrisburg, Pa., accuses him of \"ranting\" about illegal firearms. A conservative publication in Florida, NewsMax,\nasserts: \"Bloomberg's hatred of guns has twisted roots.\" And on the Web site of The Wichita Eagle, one writer wonders\nwhy a New York mayor is \"telling the people of Kansas what to do.\" In towns large and small across the country, Mr.\nBloomberg, a Republican, has emerged as the face of gun control in America. Under his guidance, a coalition called\nMayors Against Illegal Guns has grown in little more than a year from a skeletal group of 15 into an organization of\n225 leaders of towns and cities - many of them Democrats - who are pursuing legal, political and media strategies to\nstem gun crime. New York Times: Bloomberg Cast as Enemy No. 1 of Gun Rights Advocates\nhttp://www.nytimes.com/2007/06/04/nyregion/04guns.html\n\nPELOSI HIGHEST-RANKING U.S. OFFICIAL TO VISIT GREENLAND: A couple of weeks ago, \"Who is [Speaker] Nancy Pelosi\n[D-Calif.]?\" was the correct answer - actually, question - in the final category of an episode of \"Jeopardy!\" But while\nthat \"Jeopardy!\" question - or rather, answer - concerned a quote from Pelosi's inaugural speech as Speaker, maybe the\nanswer should have been, \"This Speaker recently became the highest-ranking American ever to visit Greenland.\" Yes,\nPelosi now holds that honor. Rep. Ed Markey (D-Mass.) dropped that bombshell at a press conference Friday with Pelosi\non global warming issues. \"We were told by officials in Greenland, that as they look back at their records, that\nSpeaker Pelosi is the highest-ranking American official to ever visit Greenland,\" Markey said. \"The significance of\nthat cannot be reinforced enough.\" Roll Call: She's Also Huge in Belgium\nhttp://www.rollcall.com/issues/52_133/hoh/18733-1.html\n\n\"LOVED YOU IN MALLRATS\": When DeLay signed books last week at a conference organized by Campaigns & Elections magazine,\na colleague of Affleck's swung by and asked DeLay if he'd sign a copy of \"No Retreat, No Surrender\" for the Hollywood\nactor (Affleck was in town Friday to deliver the commencement address at Falls Church High School). At first DeLay\npondered how exactly to dedicate a conservative book to a liberal die-hard. Would something like \"Hope you see the\nlight soon\" work? But, just then, DeLay realized that he'd actually just watched a movie with Affleck, but he couldn't\nquite place the name. The staff around him served up the options... \"Mallrats\"? \"Yes!\" DeLay exclaimed... Suddenly,\nDeLay's inscription for Affleck (and his wife, Jennifer Garner) seemed to write itself: \"Ben and Jen - Loved you in\nMallrats, this book is kind of like that. Keep the Faith - Tom DeLay.\" Examiner: Delay, Affleck's Worlds Collide\nhttp://www.examiner.com/blogs/Yeas_and_Nays/2007/6/4/Delay-Afflecks-Worlds-Collide\n\nFLYNT OFFERS $1 MILLION FOR DIRT ON POLS: Hustler magazine publisher Larry Flynt offered $1 million Sunday to anyone\nwho could provide proof of an illicit sexual encounter with a high-ranking government official. In a full-page\nadvertisement in The Washington Post, Flynt asked for \"documented evidence of illicit sexual or intimate relations with\na Congressperson, Senator or other prominent officeholder.\" He said he would pay up to $1 million for material that\ncould be verified and published in Hustler. Flynt ran a similar ad in October 1998, during the height of the Monica\nLewinsky scandal that led to the impeachment of President Clinton. AP via Yahoo! News: Flynt hunts for political sex\nscandal http://news.yahoo.com/s/ap/20070603/ap_on_go_ot/larry_flynt\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings go to\nhttp://audience.cnn.com/services/cnn/memberservices/member_auth.jsp?url=http%3A%2F%2Faudience.cnn.com%2Fservices%2Fcnn%2Fmemberservices%2Fregwall%2Fmember_profile.jsp%3Fsource%3Dcnn\n\nTo unsubscribe from the CNN Political Ticker list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=morninggrind\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n(c)2007 Cable News Network.\nA Time Warner Company.\nAll Rights Reserved.\n\n"}