{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Robin Pike\" <mawcheluvegasfig@cheluvegas.com>", "subject": "Become fit and happy again", "body": "\nEnd the annoying obesity now\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most enchanting product for weighty people is now available – As could be seen on Oprah.\n\n\nCan you recall all the situations when you said to yourself you would do any thing for being rescued from this quickly growing pounds of fat? Happily, now no major sacrifice is expected. With Anatrim, the ground-breaking kilos-melting medley, you can get healthier mode of life and become really thinner. Just look at what people state!\n\n\n\n\"It’s rather difficult to admit it but I was an awful food addict. \n\n\nI greedily devoured all this rubbish \n\n\nand was unable to stop. \n\n\n\n\nThis suffering stopped when I started course of taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my appetite decreased, \n\n\nmood improved and I’m the happiest person 28 pounds in 2.7 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nAmely S., Bellevue WA\n\n\n\n\n\n\"I had weight problems since I was a boy. \n\n\nIt’s difficult to imagine how I abhorred being ridiculed at school. \n\n\n\n\nI abhorred my plumpness and I abhorred myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nThis stuff literally took me out of this terrible nightmare! Thanks and thanks to you, guys.\"\n\n\n\n\n\nSteve Burbon, Colorado\n\n\n\n\n\n\"Do you know what? Thanks to Anatrim my marriage was happily saved! I got into this circle, depression – eating more – more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce my friend showed me web site and I asked for Anatrim right away. \n\n\nThe results were excellent, my appetite came to admissible level, I was often in good spirits, and, of course, I became able to tighten my belt on some holes. And you know, the bedroom became cool, too!\"\n\n\n\n\n\nFrank\n\n\n\n\n There are lots of gratitudes delighted people leave after taking Anatrim. Don’t you wanna add yourself to the tens of thousands of slender buyers and take this all-natural appetite reducing power raising product now!\n\n\nDon’t decline your chance!\n\n\n\n\n"}