{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "Michael <codejodler@gmx.ch>", "subject": "Re: Recommended Maintenance Laptop (IBM/Lenovo)", "body": "Michelle Konzack :\n\n> Hello Michael,\n> \n> Am 2007-04-30 04:32:51, schrieb Michael:\n> > Hi Michelle\n> > \n> > > Now I like to buy a new Lenovo Laptop maybe in the size of a R60 but I do\n> > > not know which one...\n> > TP60 is small and light with good SXGA (1400 × 1050)\n> \n> Is this the R60e? (Intel Core2 Duo T5600)\n\nNo, this is 14'' screen thinkpad T series. Ships with dualcore Intel T5500 - T7200 processors. \nFor desktop usage, 2x2GHz/32bit should really be sufficient. Speed-bottlenecks for desktops usually are (1) harddisk (2) RAM including graphics card.\n\nIf you buy a machine with 1G and want to add another 1G make sure it's exactly (!) identical, to get BIOS enabling the dual-channel mode. Seriously, consider it rather soon, since it will get more  difficult in the future. If you ask a reliable vendor to throw a 1G into the shipping box (to assemble yourself) you may be able to return it if it doesn't work as expected.\n\nYou may have a look into the Z series too.\n\nI seem to remember you're speaking german, so\n\n\nPeople tend to see ATI as disadvantage, and for good reasons, but yet the free fglrx driver runs fine, GL, DRI, suspend... except i can't switch between X and textconsole. (Which may be solvable i just didn't try.) \n\nWell, you said 'maintenance'. There are many good and comparable inexpensive multimedia  machines from other brands today. In the past, IBM notebooks were solidly manufactured with  some quality of components. I can't tell how Lenovo is trying to position today. In the old days,  however, IBM was not aiming at the multimedia market.\n\nIf you look at \n\n\n\nyou'll note two things:\n\n(1) They have lots of (old) thinkpads up in the spacestation.\n(2) Russians easily get bored and begin to play with the equipment.\n\n> I have seen, that you can not change the WiFi Card...\nIBM and now Lenovo also use to have a certification agreement where the BIOS is checking a whitelist. (I seem to remember it can be cirumvented though) But solid vendors can order on-demand customized machines for you, where exchanged 'original' components still are under Guarantee. That's not the cheapest but the safest bet. And you can always plug something into the cardbus of course.\n\n> This mean, I have to buy BIGGER Laptop-Bag.\n\nGranted.\n\nBut what do you want to plug in, anyway ? Are you sure you don't need a roof rack ?\n\n> But such Batterie will not be shiped wit the Laptop right?\nCustomized orders.\n\n> Whats the price for it?\nOriginal components ? \n1024 MB PC2-5300 CL5 NP DDR2 SDRAM 120.-\nThinkPad Essential Port Replicator 115.-\nThinkPad Advanced Ultrabay Battery 160.-\nThinkPad 9 Cell Li-Ion Battery 160.-\nThinkPad 100 GB SATA HDD 7200rpm 375.-\nseen on some business site\n\n..I'm not sure if it's correct to talk about prices on this list.\nI hope it's ok considering that these are too expensive, anyway.\nThey will encourage you to go for another brand ;)\n\n> This is, WHY I need two PCMCIA/CARDBUS slots.\n\n.... eth1000 and routed ? \nBut granted. I'll just believe you need more interfaces :)\n\n> What are the biggest 2\"5 Drives?  -  160 GByte?\nLooks like. \nThere are PSU ones up to a Terabyte, at only silghtly more bucks. Anyway, you probably would not buy the cheapest one, if you're going to store sensible business data.\n\n> Hmmm, the R60e (Intel Core2 Duo T5600) with 2 x 512 MByte, 100 GB\n> SATA, DVD+-RW, Bluetooth, ATI 128MB, WLAN, GBit, Modem, 3x USB with\n> a crappy Professionel Closed Source OS is around 1378 Euro...\n\n...and that has also eth100 and SXGA+ right.\n\n m°\n\n\n"}