{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "\"Claude Almansi\" <claude.almansi@bluewin.ch>", "subject": "Re: [cc-community] Q. about license metadata in <span> element and\n\tXHTML validation", "body": "Thank you so much for the info, Jon and Mike.\nJon, the code with the  element came from\nMike, re:\nOn 6/3/07, Mike Linksvayer  wrote:> On Sat, 2007-06-02 at 23:57 +0200, Claude Almansi wrote:> > I.e. the code you get for a \"general\" license (without registering the> > work) puts the \"dc\" metadata about the type of license in a > > element,>> The type/format of work you mean.  Do not specify work format, you don't> get that element.\nInteresting suggestion, but isn't specifying the format meant to helppeople search for a given kind of content?\n>> > which the W3C code validator http://validator.w3.org/ doesn't> > accept. Whereas if you register a work under a license, the metadata> > (which also include author, right holder, title, description ecc) are> > in a  element, which the W3C code validator accepts.>> I don't know what you're referring to.  CC doesn't run a registration> service.\nSorry: I  meant  code like this:\nicontenuti di questo podcast sono pubblicati sotto una licenzaCreative Commons.\nwhich I got from the creativecommons site last Autumn - though I can'tfind the page where it got generated  anymore, to my shame. Ishouldn't have used the word \"register: it wasn't like registering awork's copyright, It was a possibility to put it  in a list ofavailable content under CC>> >(...)>> See http://wiki.creativecommons.org/RDFa for background on what we're> using now.  It doesn't validate now, but is otherwise the least bad> option available.Thanks a lot for the reference: I'm reading it now>> > It's not just a matter of being able to put a> > http://www.w3.org/Icons/valid-xhtml10 button on a site - but valid> > code makes general access possible.>> Father son holy ghost amen.\n:D I was being sanctimonious, sorry\nClaude_______________________________________________cc-community mailing listcc-community@lists.ibiblio.orghttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}