{"category": "spam", "to_address": "undisclosed-recipients:;", "from_address": "\"Mark. Aide\" <letsmailme@officemaximum.com>", "subject": "JOB OFFER", "body": "\n\n\nMark Aide\nManager,\nKarton Craft Company Ltd\nmarsielle, France.\nTelephone: +447024039777, +33491332060\nhttp://www.karton.free.fr/\n\nImportant Message: If interested please reply only to\nmark.aide2007@yahoo.co.uk\n\nDear Friend,\nKarton Craft Company is a firm based in France. We produce and\ndistribute Craft works such as Metal Craft, Pottery, Ceramic and other  \nartworks\nworldwide. We have reached big sales volume of Craft Works in the\nEurope and now are trying to penetrate the US market. Quite soon we will open\nrepresentative offices or authorized sales centers in the US .\nPresently, Our company needs US representative/Assistance in Payment\nCollections and in establishing a new distribution network there. The\nfact is that despite the US market is new for us ,we already have regular\nclients who are reacting positively to our products. We have made some  \nsupplies\nto\nthe US.\n\nBut we have problems collecting money for the already supplied works.\nThe problem is that ; The international money transfer tax for legal\nentities (companies) in France is 20%, whereas for the individual it is\nonly 4%. So my lawyer advice that instead of we making company\ntransfers, we should employ someone in the US that would work as our Financial\nCoordinator. By so doing, we will only be paying 4% in tax. That's why\nwe need you! We need agents/representatives to receive payment for our\ncrafts( in money orders,check or bank wire transfers) from our clients\nin the US ,and resend the money to us via Money Gram or Western Union\nMoney Transfer.\n\n\nThe work is simply you receiving payments from our Clients which will\nbe made cashable to you at your Bank. After cashing,the funds will be\ntransferred via Money Gram or Western Union Money Transfer according to our\ninstructions. As your income,you will be getting 10% of any amount\nyou collect and process. You will be deducting the income before funds\nare transferred. You will be working as an Independent Contractor right from\nyour home\nor office. This job wont interrupt your daily activities and its\nabsolutely legal. You can earn up to $3000 - 4000 monthly during the\ntime you will spend working with us. You do not need any capital to start. An\nemployee who make efforts and work hard have a strong possibility to\nbecome managers when we commence our representative offices or authorized\nsales centers in the US and you are assured of an excellent work\ncondition.\n\nIt's Legitimate Transactions between our Customers and our Company\nRepresentatives and there is no legal risk.\n\nI would be glad if you accept my proposal. Prospective finance\nco-coordinator should forward the following info immediately:\n1. Full Name:\n2. Contact Phone\n3. Full Physical Address:\n4. Age & Sex\n5. Nationality:\n6. Occupation:\n7. Any photo ID (If any)\n8. Work experiences (If any)\n\nThank You!\nMark Aide\n\n\n"}