{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Gunmen raid Fatah official's home, killing 6", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMay 16, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nGunmen raid Fatah official's home, killing 6\n\n\n\n\n\nHamas gunmen fatally shot six bodyguards from the rival Fatah movement and\nfired a barrage of rockets at southern Israel on Wednesday, apparently\nattempting to draw Israel into the fierce Palestinian infighting as Gaza slid\nfurther into chaos.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoathed by liberals, Falwell was force among right-wing\n\n\n\n\n\nThe son of an alcoholic who sold bootleg whiskey during Prohibition, Jerry\nFalwell was the father of a movement to restore America as God's country. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nToddler swept away in Denver flash flood\n\n\n\n\n\nDivers searched the South Platte River on Tuesday for a 2-year-old boy swept\naway in his stroller and a young man who disappeared in flash flooding during\na sudden thunderstorm. Both were presumed dead, authorities said.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nCrews report progress fighting Georgia-Florida fire\n\n\n\n\n\nFirefighters were making progress on containing a wildfire that has charred\n390 square miles along the Georgia-Florida border, even though the blaze\njumped a containment line, authorities said Tuesday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGOP presidential debate turns feisty\n\n\n\n\n\nUnder pressure from their rivals, the leading Republican presidential\ncontenders defended their conservative credentials on abortion, gun control\nand tax cuts in a feisty debate Tuesday night.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRev. Jerry Falwell dies at age 73\n\n\n\n\n\nThe Rev. Jerry Falwell, the television minister whose 1979 founding of the\nMoral Majority galvanized American religious conservatives into a political\nforce, died Tuesday at age 73.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCrying infants hidden by childcare worker,  officials say\n\n\n\n\n\nThe state has closed a day care facility after a worker allegedly hid crying\ninfants in a storage room during an unannounced inspection, possibly to\ndisguise inadequate staffing, officials said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nWolfowitz pleads case before board\n\n\n\n\n\nEmbattled World Bank President Paul Wolfowitz Tuesday pleaded to the World\nBank Executive Board for fairness in deciding his fate and promised changes in\nhis management style in an effort to hold on to his job.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTroop kidnapping was 'planned snatch,' official says\n\n\n\n\n\nU.S. forces searching for three soldiers abducted in a Saturday attack south\nof Baghdad believe the troops were kidnapped in a \"planned snatch,\" involving\nat least 10 insurgents, a senior U.S. military official said.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNGO source: Aid workers freed in Somalia\n\n\n\n\n\nTwo foreign aid workers kidnapped by gunmen last week in northern Somalia's\nsemi-autonomous Puntland region have been freed by their captors, an aid\nagency source said on Tuesday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBrazilian rancher guilty in American nun's murder\n\n\n\n\n\nA Brazilian rancher was convicted Tuesday of ordering the killing of an\nAmerican nun and rain forest defender in a case seen as an important test of\njustice in the largely lawless Amazon region. A judge sentenced him to 30\nyears in prison.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nThe bubbles that built America\n\n\n\n\n\nHere's a question you might ponder as you Google, on your wi-fi-enabled\nlaptop, for a YouTube video. Without the debacles of Global Crossing,\nWorldcom, Webvan, Etoys, and a hundred other dot.com flame-outs, would there\nbe a Google today? Or wi-fi? Or YouTube?\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWith a little innovation, who needs outsourcing?\n\n\n\n\n\nThe shop floor at specialty blades smells like machine oil, but nary a drop of\nthe greasy glop can be seen. The bright, airy room is so quiet that the few\nscattered workers chat between stations without raising their voices. The\nrobotic cutting machines gleam, the racks on the metal shelves are neatly\nlabeled, the floor is pristine. Since when does the gritty world of small\nmanufacturing look like this?\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nHasek, Wings roll past Ducks, grab 2-1 lead\n\n\n\n\n\nANAHEIM, Calif. (AP) -- Tomas Holmstrom finished with two goals, an assist and\n13 stitches.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTom Verducci: There's no doubt Milwaukee is legit\n\n\n\n\n\nThere's a little parlor game sweeping baseball, particularly now that\nMilwaukee, now playing the varsity portion of its schedule, has dropped three\nof its past four games after a 24-10 start. The game is to guess, Are the\nBrewers for real? Most teams that play .700 baseball for the first 34 games,\nas Milwaukee did, would be exempt from such talk, but we're talking about a\nfranchise that clinched its last winning season with Robin Yount and Paul\nMolitor in the lineup, which hasn't played a playoff game in a quarter of a\ncentury, which hasn't put together back-to-back winning months in six years,\nfeatures barley in its logo and a pack of running sausages that may be the\nmost nationally recognizable players on the team.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nPack extra nutrition into every bite with these expert tips\n\n\n\n\n\nIn 2005, the government's revised Dietary Guidelines for Americans introduced\nthe term \"nutrient density,\" which sounds complicated but simply refers to how\nmuch nutrition a food provides. For example, a slice of 100 percent\nwhole-grain bread is loaded with vitamins, minerals, and fiber, while a slice\nof regular white bread is lower in all three.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnxiety increases death risk in heart patients\n\n\n\n\n\nAnxiety appears to increase the risk of heart attacks and death in patients\nwho have coronary artery disease, U.S. researchers report.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nMySpace removing sex offenders from service\n\n\n\n\n\nMySpace.com is checking its membership against a sex offender database and\nremoving any matches, the Web site said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVirtual travel: Around the world in 80 minutes\n\n\n\n\n\nThe tour was a whirlwind: dancing at a beachside disco in Spain surrounded by\nscantily clad women, grabbing a seat at a lively pub in Dublin, flying in a\nsmall aircraft above a lush, tropical forest.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nLinkin Park goes in a new direction\n\n\n\n\n\n\"Hands Held High,\" one of the most powerful songs on Linkin Park's new album,\nincludes lyrics about bombs blowing up mosques, a bumbling leader, high gas\nprices and general world confusion -- an obvious missive against President\nBush and the war in Iraq.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChesney wins country entertainer of the year\n\n\n\n\n\nKenny Chesney collected his third consecutive entertainer of the year trophy\nTuesday as the Academy of Country Music also paid tribute to a youngster and\nsome oldsters.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}