{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Wolfowitz to resign as World Bank chief", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMay 18, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nWolfowitz to resign as World Bank chief\n\n\n\n\n\nEmbattled World Bank President Paul Wolfowitz agreed to resign after weeks of\ncontroversy over his handling of a pay package for his girlfriend, a bank\nemployee, the institution's board of directors announced. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImmigration breakthrough could pave way for citizenship\n\n\n\n\n\nThe estimated 12 million undocumented immigrants living in the United States\ncould be put on the path to citizenship under a new immigration bill agreed\nupon Thursday by a bipartisan group of senators.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nWind plays tricks with tamed N.J. wildfire\n\n\n\n\n\nUnpredictable winds played tricks with firefighters trying to extinguish a\nonce-massive wildfire, tamed the night before by a driving rain.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nTwo deputies killed, one wounded hours after memorial\n\n\n\n\n\nA gunman shot and killed two deputies and wounded another before he was shot\nThursday, hours after the officers participated in a memorial to honor peace\nofficers slain in the line of duty, authorities said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHey whales, they're playing your song\n\n\n\n\n\nThe recorded siren songs of humpback whales played from a Coast Guard cutter\nThursday as biologists tried to lure an injured whale and her calf out of a\nshipping channel and back toward the Pacific Ocean, 90 miles away.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n4 charged in probe of guns used in Utah mall shooting\n\n\n\n\n\nFour people, including a U.S. Army soldier, were indicted Thursday in\nconnection with a teenage Bosnian immigrant's February shooting rampage that\nleft five people dead at a shopping mall.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHarmless object prompts LAX evacuation\n\n\n\n\n\nA terminal at Los Angeles International Airport was partially evacuated\nThursday when an item found in luggage triggered a security alert. The object\nturned out to be a sprinkler pipe.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nIsrael launches new strikes against Hamas\n\n\n\n\n\nIsrael launched another round of airstrikes against a militant target in Gaza\nearly Friday -- a day after the Israeli military began targeting Hamas in\nretaliation for dozens of Qassam rockets fired from Gaza into Israel over the\nlast five days, the Israel Defense Forces said.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSoldiers comb 'Triangle of Death' for comrades\n\n\n\n\n\nExhausted soldiers tread carefully through the dirt looking and hoping for\nsigns of their missing comrades being alive.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUK in talks for release of reporter abducted in Gaza\n\n\n\n\n\nBritain's Foreign Office has been holding talks in London with the attorney of\na jailed Jordanian associate of Osama bin Laden in a bid to secure the release\nof kidnapped BBC reporter Alan Johnston, officials said Thursday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNigerian labor unions call for strike to protest elections\n\n\n\n\n\nLabor leaders in Nigeria called a two-day nationwide strike on Thursday in\nprotest at last month's elections, to coincide with the inauguration of a new\ngovernment on May 29.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nWhy gasoline prices are rising while oil isn't\n\n\n\n\n\nLast summer when oil traded at a record high near $79 a barrel, gas at the\npump went for about $3.03 a gallon. Today, crude's about $65 a barrel and a\ngallon of regular unleaded costs $3.10\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWolfowitz to leave World Bank in June\n\n\n\n\n\nEmbattled World Bank President Paul Wolfowitz will step down from the position\nby June 30, according to a joint statement released Thursday by the bank and\nWolfowitz.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nMarty Burns: Bulls need to find inside scorer\n\n\n\n\n\nCHICAGO -- Bulls center Ben Wallace threw a white baseball cap over his bushy\nafro, turned it around backward and actually smiled a little.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDon Banks: Twelve QB situations to watch closely this offseason\n\n\n\n\n\nNothing gets chewed over more every NFL offseason than quarterback questions.\nOnly Indianapolis and New England seem immune to the constant pattern of\nchange, speculation and potential controversies at this position.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nLawmakers push for change in food safety oversight\n\n\n\n\n\nSpurred by deadly outbreaks of E. coli and other food-borne pathogens, a group\nof U.S. lawmakers is pushing to put all food safety oversight under a single\nfederal agency.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCDC: Heavy stroke burden in South\n\n\n\n\n\nStrokes are most common in Mississippi and other Southern states and least in\nConnecticut, according to a report providing the first U.S. state-by-state\naccounting of the third-leading cause of American deaths.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nGoogle unifies search results\n\n\n\n\n\nGoogle Inc. said on Wednesday it is combining its different Web search\nservices into one \"Universal Search\" service that will present Web sites,\nnews, video and other results on one page.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIs it time to crack down on the blogosphere?\n\n\n\n\n\nI blog, therefore I am: the Internet has become the place where \"citizen\njournalists\" broadcast their thoughts to all. This haven of free speech is\ntreasured by thousands of online writers, each ready to leap onto their\nvirtual soapbox and broadcast to the world.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nReview: 'Shrek' continues genial hit-or-miss ways\n\n\n\n\n\nThe monstrously popular but desperately hit-and-miss \"Shrek\" series continues\non its merry way in its inevitable third installment, even if the ogre himself\nis in danger of being sidetracked altogether.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nParis Hilton drops appeal\n\n\n\n\n\nParis Hilton won't appeal the 45-day jail term she was sentenced to earlier\nthis month for violating probation, according to court documents filed\nThursday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}