{"category": "ham", "to_address": "", "from_address": "\"Joana Ramos\" <jdr@ramoslink.info>", "subject": "[Ip-health] A Genetic Test for the Dogs", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nVery hard to read for those of us involved with trying to improve access to needed cancer care, including blood & marrow transplants, for underserved populations. Not only are there  severe disparities in the existing donor pool ( needed as only 25% of patients find a donor in their biological family) but often there is no coverage, or too-limited coverage, for donor testing.  Feel free to contact me for more info on  equity issues int he BMT field.\n\nJoana Ramos, MSW\nCancer Resources & Advocacy\nSeattle WA USA\nhttp://ramoslink.info/\nwww.cancersurvivorsproject.org\nwww.healthyskepticism.org\n\n---------------------------------------------------------------------\n\nA Genetic Test for the Dogs\n\nhttp://www.fhcrc.org/about/pubs/center_news/2007/may/art2.html\n\nCurious about the ancestry of your mixed-breed dog? This summer, Mars\nInc. will launch a dog-DNA test developed by former Center researchers\nDrs. Elaine Ostrander and Leonid Krugylak. The Wisdom Panel MX could\nbecome one of the Center's biggest licensing deals to date.\n\n\nGiven that more than 3 million mixed-breed dogs are born every year in\nthe United States, they calculated a possible annual market of $75\nmillion, Weissman said.\n\n\nHow research on the genetics behind cancers common to dogs and humans\nbecame a commercial breed-test product is itself a unique story of\ntechnology transfer at the Center. The process from bench to dog\nbedside was relatively fast and has already proven profitable to the\nCenter.\n\n\"the Center\" refers to Fred Hutchinson Cancer Research Center in Seattle\n\n\n--\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}