{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 6/21/07 - Lawyers Guns and Money", "body": "June 21, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\nToo Many Lawyers\n\nBang Bang\n\nZap Zap\n\n-----\n\nLong ago I read an article that reported on the correlation between a\ncountry's economic growth rate and the percentage of lawyers in that\ncountry.  The conclusion: a country with too few lawyers lacks the legal\nstructure that enables open markets and the flow of capital to wherever\nit's treated best.  Contrarily, a country with too many lawyers finds\nitself bogged down by excessive lawmaking and red tape.  Somewhere in the\nmiddle, the author argued, was an optimum level.\n\nOf course, economics is an exceedingly complex business, and there are\nnumerous factors that are even more important than the number of lawyers.\n\nBut a fair amount of evidence suggests that the U.S. now has more lawyers\nthan it needs.\n\nFor example, two-thirds of the world's lawyers are now found in the U.S.,\nand law schools continue to produce some 40,000 more every year.  Because\nsupply exceeds demand, not all of them end up in the legal profession, and\nno doubt that's a good thing.\n\nBut enough of them get there to cause trouble, like the fellow who's suing\nhis dry cleaner for $54 million over the loss of a pair of pants.  That he\ntarnishes both his profession and his own reputation in the process is a\ngiven.  Anyone with half a brain can see that $54 million is a\nridiculously inappropriate number.  Yet the plaintiff carries on,\nconfident that the potential reward outweighs the certain costs of time,\nmoney and loss of reputation and proving, in the process, the old saw that\nthe lawyer who represents himself has a fool for a client.\n\nI wonder what his mother thinks.\n\n-----\n\nSticking to lawyers (assuming that most politicians are lawyers) and\nbegging your indulgence, I'll descend for a spell into the morass of\nnational politics, where poll numbers and a good haircut matter more than\nideas and honesty.\n\nNormally, I steer clear of politics in these letters.  I know you're\nreading this for investment ideas (they're coming), and I know from\nexperience that some people can get touchy when it comes to political\nopinions.  But I can't resist commenting on this week's development.\n\nIn short, New York City mayor Michael Bloomberg announced that he had\ndropped out of the Republican Party and is now unaffiliated with any party\n.  My response, in the word of Teddy Roosevelt: \"Bully!\"  The only thing\nbetter would be to have Hillary and Mitt and Barack and Rudy do the same,\nso we can have a chance to learn what they, as true individuals, really\nthink, and not what they think their respective parties want to hear.\n\nAnd I know I'm not alone.  After all, between 30% and 40% of voters\nnationally belong to neither the Republican nor the Democratic Party.  In\nAlaska, the percentage is 60%, in New Jersey 59% and in Massachusetts 50%.\n These people are sick of the two-party system in which each party's\nbiggest priority is self-perpetuation.  They want politicians who can work\ntogether to do the right thing in solving our country's problems.  They\nwant less influence by lobbyists and special interest groups and more\nattention paid to what's right for the country as a whole.  And given the\nright candidate, they'll vote for him or her.\n\nNow, technically, Bloomberg is not running for President.  But that's part\nof the game.  Given his fortune, legally earned by serving the needs of\ninvestors, he can afford to delay an official entry into the race.\n\nAnd if he does declare, I wish him luck.  I appreciate a man (or woman)\nwho can break from the party ranks to stand alone for ideas that he (or\nshe) believes in.  I like Lieberman for breaking free from the Democrats\nin Connecticut.  I like Schwarzenegger for daring to be a different kind\nof Republican in California.  And hey, I even appreciate that old\nsocialist from Vermont, Bernie Sanders, just because he's neither a\nDemocrat nor a Republican!\n\n-----\n\nSo now on to guns, where I have both a traditional and a \"space-age\"\ninvestment idea.\n\nOf course, guns, like politics, tend to incite passions.  But this\nsection's not about my opinions; it's about the stocks themselves.  I\nlearned long ago that the market is always right, and because the stocks\nof both these companies are going up, I think they're both worth writing\nabout . . . and perhaps investing in.\n\nOn the traditional side, there's Smith & Wesson Holding Corp (SWHC), which\ntraces its roots back to 1852.  Smith & Wesson, in fact, is the #1 maker\nof handguns in the U.S.  Its manufacturing facilities are in Springfield,\nMassachusetts and Houlton, Maine.\n\nIn 1987, the company was bought by Tomkins PLC, a British conglomerate,\nfor $112 million, and things went okay for while.  Then in 2000 the\ncompany signed an agreement with the Clinton administration (in order to\navoid lawsuits) saying it would add safety features to all its products. \nBut the resulting boycotts from gun clubs and gun rights groups so damaged\nsales that the company was sold a year later to Saf-T-Hammer - run by a\nformer Smith & Wesson executive who had previously left Tomkins - for just\n$15 million.\n\n>From today's perspective, that was a huge bargain!  The market has now\naccepted the safety features in Smith & Wesson guns and today, six years\nlater, the company is valued by the market at $640 million!\n\nCredit good management for the turnaround.  Smith & Wesson has introduced\nnew models of handguns to the market, targeted to both the law enforcement\nand sporting markets.  No longer restricting itself to revolvers, it's\nbranched out into pistols, and with them it's fast winning new law\nenforcement contracts.  It's increased its use of plastics, thus lowering\nboth weight and cost.  It's revamped its sporting goods sales force so\nthat it's comprised entirely of employees instead of manufacturers'\nrepresentatives.  And it's partnered with companies like Walther to\nco-manufacture handguns.\n\nAnd now it's getting into the long-gun business!  In January Smith &\nWesson spent $102 million to buy Thomson/Center Arms, a New Hampshire\nmanufacturer of hunting rifles and black powder muzzleloaders.  And it's\nintroduced its own line of shotguns.  In short, it's using the venerable\nSmith & Wesson name, and the cash from its IPO, to grow through both\ndiversification and acquisition.  More acquisitions are likely.\n\nBut perhaps the biggest growth could come from the U.S. government.   \nSmith & Wesson's new pistols have won the company four orders from the\nDepartment of Defense in recent years; some are for firearms in\nAfghanistan.  But there's been nothing big yet; orders from the federal\ngovernment account for just $5 million per quarter.  Looking ahead though,\nthere's hope that the government will replace its 9-millimeter pistols\nwith more powerful sidearms, like Smith & Wesson's new .45 caliber pistol.\n If so, that would really light a fire under the stock.\n\nNot that it's doing badly now.  Smith and Wesson (SWHC) has earned a spot\nin Cabot Top Ten Report five times in the past ten months, most recently\nin April.  And readers who bought on any one of those recommendations -\nand held on - are happy today, as the stock is hitting new highs.  If you\nchoose to buy, try to do so during a corrections.\n\n\n ----- Advertisement -----\n\nOur Next 10 Stocks Could Put You On Easy Street!\n\nEven when the market is weak, there are always some stocks going up, and\nthe best way to find them, and to learn why they're so strong, is to read\nCabot Top Ten Report, which every Monday shoots an email to your inbox\ndetailing the fundamental and technical facts behind the ten strongest\nstocks in the market. Mike's momentum-based stock-picking system has no\nbiases. It doesn't dislike commodities, or chip sectors, or housing\nstocks. If a stock is leading the market upward, Mike Cintolo will sniff\nit out.\n\nTo learn more visit the link below.\n\nhttp://cabotmail.net/t/201594/13148861/81/0/\n\n-----\n\nMy other gun story - the space-age one - is about Taser (TASR).\n\nA Taser (an acronym of Thomas A. Swift Electric Rifle) is technically not\na gun.  It doesn't shoot projectiles.  It shoots darts that remain\nattached to the hand-held Taser by small wires that then deliver pulses of\nelectricity to the target, effectively incapacitating him (it's almost\nalways a him) by disrupting neuromuscular function.\n\nBack in 2003-2004, the Cabot Market Letter's Model Portfolio owned Taser\nand rode it to a profit of 296%.  Why did we sell?  Because the stock\nturned down.\n\nAnd why did the stock turn down?  Because of growing fears by both\ninvestors and police departments (the main buyers of Tasers) of the\ngrowing number of lawsuits against the company.  The fears by police\ndepartments led to shrinking revenues, and the fears by investors led to a\ntumbling stock price.  Top-to-bottom, Taser lost 84% of its value!\n\nBut the bottom did come.  Police departments did resume ordering.   \nTasers are now in use or in tests by 4,300 law enforcement agencies in the\nU.S. and Canada.  And the company recently completed its 50th successful\ndefense against a wrongful death or injury lawsuit.  In fact, the company\nhas never lost a product liability lawsuit!\n\nThe conclusion, as we believed years ago, is that Tasers are safe.   \nMore important, they reduce injuries and deaths of both law enforcement\nofficers and suspects, and that leads to a raft of benefits for all\nparties.\n\nTaser actually makes models for both professionals and consumers.   \nThe professional models use wires that are 35 feet long, while the\nconsumer model uses wires that are just 15 feet long.  In a shoot-out\ninvolving a professional and consumer, the professional wins.\n\nThere's growing interest from international customers; last week the\ncompany announced that a foreign international law enforcement agency had\nordered 1,375 units.  And there's talk that the new law-and-order\npresident of France, Nicolas Sarkozy, would like to arm all of France's\n250,000 police officers with Tasers.\n\nFinally, coming on July 7 is the official introduction of the company's\nlong-awaited extended range electronic projectile (XREP).   \nExpelled from a 12-gauge shotgun, the new product will dispense with wires\nand use \"microprocessor-controlled intelligent electrode selection\ntechnologies\" in a self-contained projectile.\n\nThe company is keeping a tight lid on the details until then, but we know\nit has been tested by the U.S. military \"at ranges up to 30 meters.\" \nFurthermore, \"Mr. Stephen Kunich, representing the Air Force Air Combat\nCommand Security Forces, volunteered for a five-second exposure . . .\nAfter the exposure, Mr. Kunich commented, \"The effect locked up muscles\nand totally overwhelmed the senses.  I was completely incapacitated. \nAdditionally, I was amazed at the instantaneous physical recovery.  There\nisn't much doubt of full compliance after exposure to a TASER weapon like\nXREP.\"\"\n\nThere's investment risk, of course. At $12, this is still a fairly\nlow-priced stock, and that means volatility is a given.  Furthermore, the\nstock has gained 50% in the past two months, so a correction that gives\nsome of that back would not be unusual.\n\nBut long-term, we expect the move to non-lethal weapons to continue to\ngrow.  We like the fact that this is a global business. We like the\ncompany's patents, and the fact that they're the leader in the industry. \nAnd because the company has penetrated roughly 20% of the domestic\nlaw-enforcement market and less than 5% of the worldwide market, there's\nclearly terrific growth potential.\n\nIf you're attracted to it as an investment, I suggest that you buy\ncarefully, ideally on a pullback, and that you be careful to keep losses\nsmall.\n\n-----\n\nEditor's note:\n\nThe Cabot Market Letter recommended Taser this week, but didn't add it to\nits portfolio . . . yet.  The Model Portfolio is already loaded with\nstocks . . . and it's up 19% year-to-date.  But in the future, anything\ncould happen.  To stay abreast of all the Cabot Market Letter's\ntop-performing stocks (like Crocs, up nearly 200% since its\nrecommendation), consider a no-risk trial subscription today.  To get\nstarted, simply click on the link below.\n\nhttp://cabotmail.net/t/201594/13148861/101/0/\n\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n-----\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=201594&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}