{"category": "ham", "to_address": "Don Hopkins <dhopkins@DonHopkins.com>", "from_address": "Martin Sevior <msevior@physics.unimelb.edu.au>", "subject": "Re: [sugar] [OLPC India] xbook : pdf viewer in $100 laptop", "body": "On Thu, 2007-04-19 at 21:14 -0700, Don Hopkins wrote:\n> Hello, Kumar. \n> \n> I will write some stuff to the wiki page about the ebook reader, to\n> describe what I've been working on and where we could take it. \n> \n> I agree, it would be great to have a voice synthesizer read the text\n> out loud! \n> \n> There's a great, fast, small open source speech synthesizer called\n> \"flite\" from CMU:\n> \n> http://www.speech.cs.cmu.edu/flite/\n> \n> A commercial version of flite and a bunch of voices (and demos) are\n> available from Cepstral:\n> \n> http://www.cepstral.com\n> \n> Cepstral develops commercial quality voices, including US English, UK\n> English, Italian, German, Canadian French, Americas Spanish, and\n> Woofing Dog (which is the most universally recognized international\n> language by far). \n> \n> The difficult part about speech synthesis on the OLPC is that it\n> requires a huge amount of meticulous production work to make a voice\n> for any particular language, and the OLPC is intended to support many\n> different languages. \n> \n> I asked how much it cost to produce a custom voice, and they estimated\n> the production work would cost about $10,000 for an English voice, and\n> more for voices in other languages (especially if they haven't done\n> the language before), but less for animals like dogs and cats ;-). \n> \n> It would be way cool if Cepstral could donate some of the voices\n> they've developed for other languages, for use by kids on the OLPC! \n> \n> There are some good free English voices, of course, so we could\n> certainly ship an English speech synthesizer. \n> An English voice would be helpful for teaching English, but making\n> voices for all the different languages the OLPC will support is an\n> enormous task. \n> \n> A good low-tech approach for now would be for the eBook reader to\n> enable recording and playing back an audio voice-over of a real person\n> reading each page. \n> \n\nMaybe OLPC can team up Project Gutenberg for audio book production.\n\nhttp://www.gutenberg.org/wiki/Gutenberg:The_Audio_Books_Project\n\nCheers\n\nMartin\n\n>     -Don\n> \n> \n> Samuel Klein wrote: \n> > Hi Kumar, \n> > \n> > Thanks for the suggestions.  If you want to help with development,\n> > we could use help developing xbook / pdf viewing so that runs\n> > quickly on the laptops.  Don Hopkins has also been looking into\n> > this, and thinking about a feature wishlist for an ideal viewer.\n> > Please add to the ideas here: \n> > http://wiki.laptop.org/go/Talk:Books#Bookreader_features\n> > \n> > You might send these kinds of notes to sugar@laptop.org  as well,\n> > where there is a discussion underway about how to improve the\n> > bookreading experience.\n> > \n> > SJ\n> > \n> > On 4/19/07, Kumar Pritam  wrote: \n> >         Hi everybody,\n> >          I am very glad and enthusiastic about this project(OLPC).\n> >         It's really a project which is gonna revolutionize the\n> >         education system and make it easy to learn. \n> >          As far as pdf viewer is concerned, i would like u to\n> >         consider adding these functionalities also. \n> >          1. Full screen View(no options, just d keyboard interface\n> >         to navigate, only contents will be shown on the display)\n> >          2. What about \"a reader(a voice : text to speech\n> >         conversion)\" to read the document.\n> >         \n> >         Please let us know more about how can we be more helpful in\n> >         making the OLPC projetc a success. It can be anything\n> >         related to development or promotion.\n> >         \n> >         Thanks a lot.\n> >         With regards:\n> >         -- \n> >         Kumar Pritam \n> >         NIE Mysore\n> \n> _______________________________________________\n> Sugar mailing list\n> Sugar@laptop.org\n> http://mailman.laptop.org/mailman/listinfo/sugar\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}