{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 21, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESJimmy Carter To Bush: Never Mind\nFormer President Jimmy Carter called his remarks \"careless or misinterpreted\" when he said the Bush administration was the\n                        \"worst in history\" for its impact around the world. Mr. Carter said he only meant to compare President Bush with Nixon. More...Watch: Carter Bashes Bush\n• Midwest Bracing For Cicada Invasion• Lebanon's Fight With Militants Heats Up• Historic 19th Century Ship Burns In London\n                     \t\t\t\t\t| WatchU.S.Idaho Rampage Still A Mystery\nIt appears the gunman fired into the Moscow, Idaho, emergency dispatch center to draw out officers, then picked them off as\n                        they emerged. The sniper then retreated into a church. One officer is dead, along with the church sexton and gunman. More...\n• Midwest Bracing For Cicada Invasion• Major Progress On Wildfires Nationwide• Dumped On Skid Row\n                     \t\t\t\t\t| Watch• More StoriesWorldLebanon's Fight With Militants Heats Up\nLebanon's army opened fire with tanks and artillery on a refugee camp, in its battle with a militia run by a self-professed\n                        disciple of Osama bin Laden. Lebanon's police commander scoffs at the al Qaeda link. \"This is imitation al Qaeda.\" More...\n• Historic 19th Century Ship Burns In London\n                     \t\t\t\t\t| Watch• Bomb Kills 7, Search For GIs Continues\n                     \t\t\t\t\t| Watch• Israel Continues Air Strikes On Gaza• More StoriesPoliticsGOP Losing Battle Of The Internet\nDemocrats have taken a big early edge over Republicans in one of the key arenas where the 2008 presidential contest will be\n                        played out: the Internet.\n                        Joel Roberts has the highlights of the day's headlines. More...\n• Jimmy Carter To Bush: Never Mind\n                     \t\t\t\t\t| Watch• Clinton Proposes Pre-K Access For All Kids• Immigration Battle Begins In Senate• More StoriesHealthWhen \"Senior Moments\" Begin\nOn The Early Show, an expert on aging tells whether to be concerned, and how to keep your memory sharp as you\n                        progress through middle-age. More...Watch: Improving Your Memory\n• Teen Slims Down With Gastric Bypass• Sick Infant In Life Support Debate Dies• Lobbying Kills Mandatory Cancer Vaccine\n                     \t\t\t\t\t| Watch• More StoriesSciTechMidwest Bracing For Cicada Invasion\nThe Midwest is about to get noisy. \"Brood XIII\", the next generation of the 17 year cicada, is about to take over the trees,\n                        air and ground. Dogs have a big snack to come, but some outdoor events planners have a major headache on their hands. More...\n• Wayward Whales Headed Back To Sea\n                     \t\t\t\t\t| Watch• Alltel Acquired For $27.5B• GOP Losing Battle Of The Internet• More StoriesBusinessAlltel Acquired For $27.5B\nInvestment firms TPG Capital and GS Capital Partners have agreed to acquire Alltel Corp., the fifth-biggest U.S. wireless\n                        company and owner of the nation's largest geographic network, in a deal worth $27.5 billion. More...\n• Gas Prices Hit An All-Time High\n                     \t\t\t\t\t| Watch• James Dyson Keeps Innovating• Money Saving Tips\n                     \t\t\t\t\t| Watch• More StoriesEntertainmentBrangelina Takes On Cannes\nAngelina Jolie, Marianne Pearl and Brad Pitt, the movie's co-producer, were at the Cannes Film Festival on Monday for the\n                        premiere of \"A Mighty Heart,\" about Daniel Pearl's abduction and murder in Pakistan in 2002. More...Watch: Brangelina Arrives At Cannes\n• Three Could Be Charm Twice For Bloom\n                     \t\t\t\t\t| Watch• McCartney: I Don't Read Divorce Coverage• Australia Fines Sly For Toting Hormones• More StoriesOpinionThompson Doing Things His Way\nFred Thompson wasn't at last week's Republican presidential debate, but he still managed to be relevant, the Weekly Standard\n                        says, thanks to the former senator's innovative pre-campaign strategy. More...Watch: Republicans Take Jabs\n• John And Rudy's New York Revue\n                     \t\t\t\t\t| Watch• Andy Pays A Visit To The Book Fair• Dems Better On Energy, But Not By Enough\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Celeb Spot: Three Could Be Charm Twice For Bloom\nThe third movie in the \"Pirates\" trilogy comes out this week, to go along with his \"Lord of the Rings\" trilogy. \"Pirates of\n                        the Caribbean: At World's End\" is expected to rack up the same mega-numbers its predecessors did. More...Watch: Bloom's 'Pirate' Success\n• EARLY SHOW: Teen Slims Down With Gastric Bypass• EARLY SHOW: Katrina Heroes Honored With Courage Award\n                     \t\t\t\t\t| Watch• EARLY SHOW: Ponytails Key \"Beat-The-Heat\" Hairstyles\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nDoggy Mama Nurses Tiger CubsCBS News RAW: Three newborn tiger cubs who were rejected by their mother at birth are being nursed by a surrogate dog\n                                    mother at a zoo in the eastern Chinese province of Shandong. NO AUDIO\nTOP VIDEOS\nViolence Flares In Lebanon\nNotebook: Amelia Earhart\nBrangelina Arrives At Cannes\nMissing GIs Might Be Alive\nUsing Rewards To Motivate Kids\nFamous British Ship Burns\nTeen Scales Seven Summits\nDumping On Skid Row\nSunken Treasure Worth Millions\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMike Wallace profiles GOP presidential hopeful Mitt Romney, this Sunday, 7 p.m. ET/PT.48 Hours MysteryDeath Of A Dream:An aspiring Broadway dancer is murdered. Did her secrets contribute to her death? Erin Moriarty\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}