{"category": "ham", "to_address": "HGAPALLIES@LISTSERV.CRITPATH.ORG, aidsdrugs@lists.riseup.net,\n   ip-health@lists.essential.org, <thaifta@lists.riseup.net>", "from_address": "B.Baker@neu.edu", "subject": "[Ip-health] US Action Plan for Thailand comes straight from Pharma", "body": "\nUS Action Plan for Thailand comes straight from Pharma\n\nMay 9, 2007\n\nAfter placing Thailand on its 2007 301 priority watch list for an alleged\n\"lack of transparency and due process\" in issuing compulsory licenses and\n\"its weakening respect for patents,\" the USTR has shown its true colors in\nits reported May 8 \"Action Plan\" for Thailand.  Because the U.S. cannot\nback up its claim that Thailand violated the international TRIPS agreement\nor Thai law and because it cannot even explain how Thailand's repeated\nnegotiations with drug companies and publication of a 100-page rationale\nfor its compulsory licenses violated any known norms of transparency and\ndue process, the USTR has turned to its true agenda - acting as a bullyboy\nfor Big Pharma in imposing even stronger patent and data-related monopolies\non Thailand.  In a truly ironic twist, the USTR has failed to publicly\ndisclose its Action Plan in advance of its meeting with the Commerce\nMinistry on May 14, showing how strongly it values the alleged principle of\n\"transparency.\"\n\nThe US previously sought similar \"action\" terms in its free trade agreement\nnegotiations with Thailand.  At that time, in February of 2006, AIDS\nactivists and others protested vigorously against the USTR's pro-Pharma\nagenda and temporarily halted trade negotiations in Chang Mai.  Now,\nfifteen months later, the US has dressed up its FTA demands and repackaged\nthem as an \"Action Plan,\" where Thai acquiescence is allegedly necessary to\nremove Thailand from the priority watch list and from the escalating threat\nof US trade sanctions.\n\nA close look at the alleged details of the Action Plan shows how the USTR\nis carrying water for Big Pharma.\n\nFirst, the USTR seeks patent term extensions for regulatory delays in\nissuing patents or in registering medicines.  Although patent terms already\nrun for a long 20 years, more is better for drug companies like Abbott and\nMerck that would like to have the right to charge monopoly prices and\nexclude generic competitors for an even longer period of time.\n\nSecond, the USTR is seeking a five-year period of \"data exclusivity\",\nduring which the Thai Food and Drug Administration would be prevented from\nrelying upon data previously filed by the innovator in order to validate\nthe safety and efficacy of equivalent generic products.  Instead, as the\nUSTR and Pharma are fond of saying, the generic companies would be \"free\"\nto conduct costly, time-consuming, and ultimately unethical clinical trials\nto prove through other means what is already provable - namely that a\ngeneric that proves its therapeutic equivalence is just as safe and\nefficacious as an already marketed product.  Not satisfied with just five\nyears of data exclusivity, the USTR/Pharma team is demanding that Thailand\nto add on another three years any time a drug company submits new clinical\ndata to register a new formulation or a new use of an existing product.\nData exclusivity is especially important to Pharma because sometimes drug\ncompanies do not even bother to file patent application on unproven medical\ninnovations in smaller and poorer countries.  They would rather wait until\nthe product is fully developed and marketable to have another monopoly\nsystem beside patents to exclude generic competition.  That other system is\ndata exclusivity.\n\nRelated to data exclusivity is the third restriction provision,\npatent/registration linkage, which turns the Thai Food and Drug\nAdministration into a patent enforcement agency by requiring it to prevent\nregistration of a follow-on generic product if a prior registrant claims\nthat its patent(s) would be violated.  Although the FDA is in no position\nto confirm the merits of the drug company's patent claims, it assumes the\nburden of protecting patents even though the patent holder already has full\nmeans to protect its patent claims via infringement proceedings.\n\nFourth, the USTR wants to limit the grounds upon which compulsory licenses\ncan be granted to national emergencies, competition cases, and public,\nnon-commercial use.  This restriction is ironic in the current environment\nwhere both Abbott and the US are retaliating against Thailand for having\nactually issued one of the US-preferred licenses - those for public,\nnon-commercial use.  Clearly, Thailand and other countries can and should\nissue licenses on these three grounds, but they should also be free to\nissue compulsory licenses on other grounds as confirmed both by the TRIPS\nAgreement and by the Doha Declaration on the TRIPS Agreement and Public\nHealth.  They should also be free to make clear that their compulsory\nlicenses override the monopoly bars posed by data exclusivity and\npatent/registration linkage provisions described above.\n\nFifth, the USTR is seeking to expand the required subject matter of patents\nby requiring that Thailand grant licenses on \"plants and animals,\" on\n\"diagnostic, surgical and medical procedures,\" and on \"new uses of existing\nproducts.\"  In addition to now requiring that Thailand give up patent\nsubject exclusions that are permissible under TRIPS, the USTR is pursuing\nPharma's agenda of being able to evergreen patents by claiming successful\nnew uses of existing medicines.\n\nSixth, the USTR is seeking to prevent the use of pre-grant opposition\nprocedures that help forestall the granting of weak or frivolous patents by\nallowing other interested parties to provide relevant information to the\nThai patent office.  These procedures are currently being used to good\neffect in India both by generic companies and civil society activists.\n\nThe USTR, acting as the handmaiden for Big Pharma, is seeking to restrict\nThailand's right to use TRIPS- and Doha-compliant flexibilities for\naccessing more affordable medicines to sustain its comprehensive,\npublic-sector supported health care program.  Simultaneously, the USTR is\nseeking to punish Thailand for using one of the few flexibilities, public\nnon-commercial use licenses, that the USTR would theoretically leave on the\ntable.\n\nMake no mistake - Abbott, Merck, Pfizer and the other big drug companies\ndon't want an even playing field, they want monopolies so that they can\nsell high-price drugs to rich people in poor countries even if the non-rich\nmust go without.  Rather than stand up for the human right of access to\nmedicines, the USTR has once again chosen the side of the hugely\nprofitable, transnational pharmaceutical industry.\n\nTo counteract this pressure, Thailand, its Commerce Ministry, and its\npeople must stand firm against the US's hypocrisy and coercion. They must\nalso continue to be supported by other developing countries and activists\nand by opinion leaders such as former President Clinton who just yesterday\ndefended Thailand's right to issue compulsory licenses.\n\nProfessor Brook K. Baker, Health GAP\nNortheastern U. School of Law\nProgram on Human Rights and the Global Economy\n400 Huntington Ave.\nBoston, MA 02115\n617-373-3217 (office)\n617-259-0760 (cell)\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}