{"category": "ham", "to_address": "r-help <r-help@stat.math.ethz.ch>", "from_address": "Lisa Solomon <lisas@salford-systems.com>", "subject": "[R] Free Webinar: Vendor Neutral Intro to Data Mining for Absolute\n\tBeginners, May 23, 2007", "body": "ONLINE VENDOR NEUTRAL INTRO TO DATA MINING FOR ABSOLUTE BEGINNERS\n(no charge)\n\nA non-technical data mining introduction for absolute beginners\nMay 23, 2007, 10AM - 11AM PST\nFuture Sessions (June 14, Sept 7)\n\nTo register for the webinar \n------------------------------------------------------- \n1. Go to https://salford.webex.com/salford/onstage/g.php?d=928318845&t=a \n2. Click \"Enroll\". \n3. On the registration form, enter your information and then click \"Submit\".\n\nOnce you have registered, you will receive a confirmation email message with instructions on how to join the event, as well as audio and system requirements.  Please read this confirmation email carefully!\n\nThis one-hour webinar is a perfect place to start if you are new to data mining and have little-to-no background in statistics or machine learning. \n\nIn one hour, we will discuss:\n\n**Data basics: what kind of data is required for data mining and predictive analytics; In what format must the data be; what steps are necessary to prepare data appropriately \n\n**What kinds of questions can we answer with data mining\n\n**How data mining models work: the inputs, the outputs, and the nature of the predictive mechanism \n\n**Evaluation criteria: how predictive models can be assessed and their value measured \n\n**Specific background knowledge to prepare you to begin a data mining project.\n\nPlease do not hesitate to contact me if you have any questions.\n\nSincerely,\nLisa Solomon\nlisas@salford-systems.com\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}