{"category": "spam", "to_address": "adf adf <funnyreign@flax9.uwaterloo.ca>", "from_address": "\"PaidSurveyProgram \" <pam@rustypromdress.com>", "subject": "Make $25 in just 7 minutes", "body": " \nHi adf,\n\nI stopped what I was doing to let you know about this right away. So I'll cut \nright to the chase. Someone is making MORE money than us and I don't like it! \nWhile we are spending all day marketing our websites he is doing hardly any \nwork and making INSTANT CASH.\n\nI've got a secret source where I get 'high ticket' software products that I \ncan buy each month. I've never wanted to share with you this resource because \nit's been so valuable to me.\n\nBut this weekend I found out that the owner (James Thompson) has been making \nMORE money than me just by filling in on line surveys. \n\nhttp://rustypromdress.com/c/892550/opytzwxz4:fzomttrrqUCKarpoosyvwXCKasstwv4 \n\nAs you can see from the site, all that James is doing, is filling out surveys \non line and getting paid $5-$10 each. Which isn't a lot, so until now I never \nreally investigated it. This weekend I did take a look over his site and joined. I spent the last 3 hours working solid to see exactly how much money he was making. In the last 3 hours I have made: $477.83. \n\nI paid $97 to get this program, which although I have made alot of money today \nis a big outlay for anyone. By me sending out this e-mail James is going to \nmake even more because you and I are going to buy the list of surveys to \ncomplete online. I spoke to James just now and have demanded that if he wants \nto sell any of these products to my Web Site Community then he must reduce the \nprice to $39.95 for the next 24 hours. (This is you guys!)\n\nIf you go to the site and its still $97 do not buy it. I wanted to tell you \nabout this offer anyhow, its up to James if he wants to reduce the price. \n(If he does then its a steal, you only need to complete 3 surveys from the list \nof about 10,000 he gives you to make your money back!) If he doesn't reduce it \nI will keep e-mailing him until he does for you to buy it cheap. \n\nhttp://rustypromdress.com/c/892550/opytzwxz4:fzomttrrqUCKarpoosyvwXCKasstwv4 \n\n\nSee you there, \nMember Services \n\n\n\nIf you want to unsubscribe, please send an email to unsubscribe@paidsurveys.com\n526 Wooster Road North, Barberton, OHIO 44203 \n\n\n\n\nNo longer wish to be on this list, just send a reply email.\n\n\n\nPlease send comments and inquiries to\nRustyPromDress, 364 East Main Street, #302\nMiddletown, DE 19709\n\nCopyright 2007 RustyPromDress.com\n\n\nfunnyreign@speedy.uwaterloo.ca from 24.57.130.245\n\n"}