{"category": "spam", "to_address": null, "from_address": "Stephen Clark <stephenclark019@hotmail.com>", "subject": "PRIVATE BUSINESS PROPOSAL", "body": "\n\n\n\n\nFrom The Desk of BarristerStephen Clark. Telephone: +44 7045726415\n \nDear Friend,\n \nSTRICTLY A PRIVATE BUSINESS PROPOSAL\n \nThis is a proposal in context but actually an appealsoliciting your unreserved assistance in consummatingan urgent transaction requiring maximum confidence.Though this approach appears desperate, I can assureyou that whatever questions you would need to ask orany other thing you will need to know regarding thisproposal will be adequately answered to give you a clearer understanding of it, so as to arrive at a successful conclusion.I am Barrister Stephen Clark, a London based Attorney and a Solicitor.\nTHE PROPOSITION: My late client, An American, Mr. BobWilliams, (a loner and an anti-socialist in nature) who was an Oil consultant with CPL Petroleum had in a Bank the sum of GBP 11,550,000.00 in a domiciliary account who died on plane crash of Alaska Airlines Flight 261 which crashed on January 31,2000,including his wife leaving nobody to claim the money. Information:http://archives.cnn.com/2000/US/02/01/alaska.airlines.list/index.htmlHe named his wife as the next of kin; unfortunately,two of them died in the plane crash. He had a closingbalance worth 11,550,000.00 (Eleven Million FiveHundred and Fifty Thousand British Pounds Sterling)with a bank in my country (United Kingdom). Since thetragic incident involving late Bob Williams and hiswife, the bank has waited for close to six years for anext of kin as beneficiary with no success.Valuable efforts have been made by the bank'smanagement and myself to get in touch with any of hisDirect or Extended family Members but I personallyfound out that he died with his wife. Since it is the Law in Great Britain that at theexpiration of Seven (7) years, such funds will bemarked unclaimable and reverted to the ownership ofthe British Government if nobody applies to claim thefunds. I am taking this advantage in order to bettermy life and that of my family. I am now seeking yourpermission and assistance to have you stand as next ofkin to late Bob Williams, so that the money isreleased to you as the next of kin. All informationand proof to enable you get this fund will becarefully worked out by me because all are in mycustody.I am assuring you that this transaction and itsprocedures is 100% legal and risk free involvement.Your share stays while the rest will be for me. Thesharing of the funds between the two of us will be asfollows: 30% of the total sum will go to you for youreffort and commitment to the success of thistransaction. 65% will be for me, and the balance of 5%for the settlement of all local and foreign expensesincurred in the course of this Transaction.Upon the successful completion of this transfer, Iwill come to meet with you for disbursements in theratio stated above, and probably invest my share inany lucrative Business in your country subject to yourkind advice.As soon as I receive an acknowledgement of the receiptof this message in Acceptance, I will immediatelystart up with the process of claim. If this proposalis acceptable by you, kindlyreply me immediately you get this mail.I want you to also furnish me with the followinginformation:1. Your private telephone/fax or preferably yourmobile numbers.2. Your full names and address.3. Your Full Banking Details where the Funds will betransferred to.Thank you in advance for your anticipatedco-operation. I shall give you more details on what weare to do to claim the Funds without any hitch.\nNote: This transaction must be kept STRICTLYCONFIDENTIAL and TOP SECRET because of its nature.I look forward to receiving your prompt response.\n \nYours Truly,Barrister Stephen Clark.Connect to the next generation of MSN Messenger   Get it now! \n"}