{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Shawn Casey the Millionaire\" <qkqee_2lp@divertlorn.com>", "subject": "I was dared to do this tonight ", "body": "Okay, let me catch my breathe while I type this because you're not going to believe this...First off, thank you so much for taking a minute to read this, my name is Shawn Casey, and I'm a millionaire that was dared to do something insane tonight and tomorrow morning, and if you're interested in knowing what it is then read below, but you'll need to hurry because you may only have a few minutes to take advantage of this:\nAs part of an insane marketing test, I''m giving away an in-depth Internet \"Business-In-A-Box\" to 250 people today. I should be selling this for $497, but...I''m flat out giving it away. Your cost is zero... zip... zilch! \n\nPress here before you become the 251st person:\n\nhttp://strickenjuggle.com/t/qkqee_2lp/749748\n\nYou probably think I''ve lost my mind - and maybe I have - but just visit this site right now and in 5 minutes you''ll have this awesome $497 Internet business training kit as my gift to you. No kidding! \nPress here to Grab it quick - right now - before I change my mind... \n\nhttp://strickenjuggle.com/t/qkqee_2lp/749748\n\nWhy am I giving this away?\nI finally got so sick and tired of watching fakers and bigmouths sell wrong information about how to make a fortune online... that I''ve decided give away my awesome Internet Business Training System so I can help people finally get the truth! \nSee... I''ve made a fortune online and I''ve helped over 100,000 customers to unlock the secrets to getting started online - the right way. \nPress here to Grab it quick - right now - before I change my mind... \n\nhttp://strickenjuggle.com/t/qkqee_2lp/749748\n\nNow, I''m giving away my $497 Internet Business-In-A-Box so you can get the inside secrets about how to make your own Internet fortune. But you must grab this right now because I''m only promising to do this for the next 250 people that visit this site. \nPress here before you become the 251st person:\n\nhttp://strickenjuggle.com/t/qkqee_2lp/749748\n\nThank you so much for your time!\nShawn \n\n------------------------------------------------------------------------------- \nMining Gold Corporation \n20533 Biscayne Boulevard, No. 484 \nAventura, FL 33180 \n\nTo stop receiving email from Mining Gold Corporation, please visit :\n\nhttp://strickenjuggle.com/t/qkqee_2lp/749749 \n\n--------------------------------------------------------------------------------\nHi Subscriber! You are receiving this solicitation because producttestpanel@speedy.uwaterloo.ca previously agreed to receive correspondence. If this service should fail to meet your expectations, feel free to disassociate yourself from our service.\nhttp://strickenjuggle.com/u/18fa/producttestpanel%40speedy.uwaterloo.ca/2\n\nShould you want to contact us via the United States Postal Service, our address is as follows:\n96 Linwood Plaza Suite 132 Fort Lee, NJ 7024\n\n\n"}