{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Joe Smith\" <unknown_kev_cat@hotmail.com>", "subject": "Re: [long] Last call draft of GPL v3", "body": "\n\"Francesco Poli\"  wrote in message \nnews:20070602175021.465f387a.frx@firenze.linux.it...\n\n>Hi all,\n>a new \"Last Call Draft\" of the GNU GPL v3 has been published on 31 May\n>2007 by the FSF.\n>The full text of this fourth draft can be read at\n>http://gplv3.fsf.org/comments/gplv3-draft-4.html\n>\n>My comments on the draft follow.\n>I will send them to the FSF public consultation system RSN (since they\n>are accepting comments for only 30 days, starting on 31 May).\n>\n>The usual disclaimers: IANAL, IANADD.\n>\n>\n> [snip]\n>\n\n>:::: Bad: too restrictive\n>\n>Clause 5d is now simpler and clearer than in the previous drafts: as a\n>consequences, its issues are more apparent!  ;-)\n>\n>This clause is worse than the corresponding clause 2c in GPLv2... :-(\n>\n>[snip]\n>\n>I would like to see clause 5d dropped entirely.\n>\n>Or, at least, it could be modified so that it only applies to cases\n>where the original Program is also interactive.\n>Something like:\n>\n>| d) If the Program has interactive user interfaces which display\n>| Appropriate Legal Notices, this feature must be preserved in each\n>| interactive interface that is also present in the work.\n\n\n\nIt is one thing to require preservation of the Appropriate legal notices \nfeature in existing interactive user interfaces.\nIt is entirely different to compel users to include such a feature in any \nnewly created interactive interfaces. This is far worse than the equivalent \nclause in GPL v2. People WILL ignore this requirement, and assume it merely \nmandates preservation of the feature in existing interfaces. This is a \n*critical* problem with the license IMHO.\n\nFurther there is no exception for interactive user interfaces where it is \n*impossible* to\nmeet the definition of \"displays 'Appropriate Legal Notices'\". Cases like an \naudio-only\ninteractive interface could not possibly include \"a convenient and \nprominently *visible* feature\",\nand might not be able to tell \"the user [..] how to view a copy of this \nLicense\". It might not be\npossible to tell the user how to view the licence. Especially if the device \nhas no means of visual output,\nin which case there is no way to \"view\" the licence. The program could \nperhaps give instructions\non how to request to have the licence read to them, but that is not what is \nrequired.\n\n>:::: Kills copyleft: are these the cousins of GFDL's Invariant Sections?\n>\n>What exactly is a \"reasonable legal notice\"?  What exactly is an \"author\n>attribution\"?  It seems that these terms are not defined anywhere in the\n>license.  I'm concerned that they could be interpreted in a broad sense\n>and allow people to take a GPLv3'd work and add some sort of invariant\n>long text that nobody will ever be able to remove or modify...  This\n>option could make a work include unmodifiable & unremovable parts and\n>thus fail to fully grant the freedom to modify.  I would rather avoid\n>introducing such options in the GPLv3!\n>\n>===> this option could make the work fail DFSG#3, when exercised\n\nHmm... reasonable legal notice will at least include a copyright statement.\nSome further guidence could be useful. Can a mandate to include an entire\nlicence (talking abiout one of the short licences, like BSD, Expat, etc. \n[obviously a modified version of the licence,\nwith a mandate to include the licence text in the Appropriate Legal\n Notice]) be considered a resonable notice? It almost seems reasonable,\nbut on the other hand it is somewhat long, which may be unreasonable, \nespecially in certain\ntypes of interactive interfaces. \n\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}