{"category": "ham", "to_address": "<cc-community@lists.ibiblio.org>", "from_address": "\"Kevin Phillips (home)\" <tacet@qmpublishing.com>", "subject": "Re: [cc-community] Multinational Profit Day", "body": "\n\n\n\n\n\n\nAs much as I'm always wary of \nthe Sony marketing spin machine, I have to agree this could be positive for \nCC.  \n \nHowever, there's still something odd \nabout some of their comments in the press, it appears they are using CC as a \nclarification tool to distance themselves from copyright issues associated with \nYT.  The CC license is default, and there's a clear warning not to upload \n(c) materials.\n \nFor instance here's a post I noticed \nthe other day on a PS3 news site : \nhttp://www.pspsps.tv/2007/04/sony_hops_on_youtube_bandwagon_1.html\n \nThis isn't a direct crit, like \neveryone else I'm just curious as to where this goes and intrigued as to the \npossible cc-goals of one of the big-4 content corporations.  It \ncould be they have a real interest and wish to encourage artists \nto switch to CC licenses.  It could be just a marriage of \nconvenience and a mechanism to justify tight content \ncontrol. \n \nKev\n \n----- Original Message ----- \nFrom: David Berry\n\nTo: cc-community@lists.ibiblio.org \n; UK FreeCulture Discuss List\n\nSent: Sunday, April 29, 2007 11:18 AM\nSubject: [cc-community] Multinational Profit Day\n\n\n\n\nSony’s YouTube competitor - CC licensed\nSony has launched its YouTube competitor - eyeVio. By default, uploads \n  are licensed under a Creative Commons Attribution (CC-BY) license. You can \n  read about it here. We in the CC community will be celebrating about it around \n  the world tonight. Yesterday was IP Day (really, no joke). Today is Sony \n  Day!\nposted by Lessig on http://www.lessig.org/blog/archives/003756.shtml\n\n\n\nI would like to ask everyone on the list to raise a cheer for yet another \nmultinational capitalist corporation's co-option of the free culture movement. \nTruly the valorization of the hard-earned work of millions of unpaid, free \ncreators across the world should be celebrated for contributing yet again to the \nprofit margins of the world largest, richest and most powerful corporations. \nToday should be recognised as a breakthough for creative commons moving from a \ngrass-roots organisation committed to the creativity of everyone, to becoming \nthe trusted advisor and advocate to capital for implementing a new form of IP \npolicy that encourages 'sharing' --- well, sharing as long as it is the \noutput of *us*, rather than anything that the multinational might produce (then \nclearly it is criminal and it is piracy). \nHurrah \nfor SONY DAY!\n\n(One can only hope that one day, in the future, everyday will be named \nafter a giant multinational corporation!)\n\n\n\n\n\n_______________________________________________cc-community mailing \nlistcc-community@lists.ibiblio.orghttp://lists.ibiblio.org/mailman/listinfo/cc-community\n"}