{"category": "spam", "to_address": "undisclosed-recipients: ;", "from_address": "\"Mr. Gianni Mattioli\" <webinfo_fondazionedivittorio@yahoo.it>", "subject": "NOTIFICATION FOR CASH AID.", "body": "\n--\n                         Fondazion Di Vittorio\n                        _______________________\n\n\n\nFoundation's Officer,\nFondazion Di Vittorio,\nITALY.\nhttp://www.fondazionedivittorio.it/\n\n\nNOTIFICATION FOR CASH AID.\n\nThis is to notify you that you have been chosen By the Board\nof trustees of the above International charity organization\nbased in the Italy as one of the final recipients of a Cash\nGrant/Donation for your own personal,education and business\ndevelopment Fondazione Di Vittorio as established 1977\nby the Multi-Milliongroups was conceived with the objective\nof Human Growth, Educational and Community development.\nIn line with the 28 years anniversary program this year\n\nthe Vittorio Foundation in conjunction with the Economic\ncommunity for West African States (ECOWAS) , United Nations\nOrganization (UNO) and the European union, is giving out a\nyearly donation of One Hundred Million\n\nUnited States Dollars as specific Donations/Grants to 150\nlucky international recipients worldwide in different\ncategories for their personal Business development and\nuplift of their environment. These funds are freely given\nto you to use for your business educational and personal\ndevelopment, and at least 30% to be used by you to develop\na part of your environment, as this is a yearly program,\nwhich is a measure of universal development strategy, and\neradication of poverty. Please kindly note that you are not\nthe only beneficiary in your country this year, and your\ncountry is not the only country that is benefiting from this\ndonation, as beneficiaries have been chosen from countries\nfrom all continents. The idea of this donation is that within\nten years from now, there will be notable richness among\nmany unusual people around the world. This will give many\npeople the opportunity to get their lives to a stage where\nthey had always wanted. Kindly note that you will only be\nchosen to receive the donation once, which means that\nsubsequent yearly donation will not get to you again, so its\nyour choice to spend the donation wisely on something that\nwill last you a long time. And please do not bother following\nup this email, if you have benefited from this donation in\nprevious years.\n\nBased on the random selection exercise of internet websites\nand millions of Super market cash invoices worldwide you\nwere selected among the lucky recipients to receive the\naward sum of US$850,000.00 (eight hundred and fifty thousand\nUnited states Dollars) as charity donations/aid from the\nVittorio Foundation, ECOWAS and the UNO in accordance with\nthe enabling act of Parliament. (note that your email was\nselected from either the internet, after absolute viewing\nof your profile or a Shop's cash invoice around your area\nin which you might have purchased something from).\n\nYou are required to expeditiously Contact the Executive\nSecretary below for qualification documentation and\nprocessing of your claims, between the hours of\n8.00am - 7.30pm on Monday through Sunday. On contact\nwith this officer, you'll be given your donation pin number\nwhich you will use in collecting the funds. You are to\ncontact back this email when you have collected your\n$850,000.00. Please endeavor to quote your Qualification\nnumbers (N-222-6747, E-900-56) in all discussions.\n\nExecutive Secretary- Mr. Carlo Ghezzi,\nEmail: carlo.ghezzi@yahoo.it\n\nPlease note that this donations/Grants are strictly\nadministered by \"ECOWAS\" under delegated powers from the\nUNO. you are by all means hereby advised to keep this whole\ninformation confidential until you have been able to collect\nyour donation, as there have been many cases of double and\nunqualified claim, due to beneficiaries informing third\nparties about his/her donation.\n\nFinally, all funds should be claimed by their respective\nbeneficiaries, not later that 15 days after notification, as\nfailure to do so will be to that particular beneficiary \ncancelled and its donation reserved for next years \nrecipients.\n\nOn behalf of the Board kindly accept our warmest\ncongratulations\n\nYours faithfully,\nMr. Gianni Mattioli.\n(Foundation officer)\n\n\n\n________________________________________________\nVHCS Webmail\n\n\n"}