{"category": "spam", "to_address": "Wisdom <wisdom@flax24.uwaterloo.ca>", "from_address": "Tamara Garrison <adkins@goarcher.com>", "subject": "Master Penis", "body": "\n\nYour lady can't have orgasms? Heh, body, it's your fault. Do you want to fix that?\nEverything for your sexual health\nViagra, Cialis, Valium, Levitra and more medications\nClick here to be the best lover in the world!\nCompletely conidential and secure purchase.\nWith best regards,\nTamara Garrison\n \n \nSily neba, i eto govoril mne Bigman?! Da-a, ia predstavlial, chego emu Stoilo eto priznanie, i po dostoinstvu ocenil ego otkrovennost. Poetomu rasslabsia i govori so mnoj tak zhe, kak I ranshe. Poperhnuvshis na poluslove, Altares popiatilsia ot Kruga k stene kolodca. On pytalsia menia ubit, medlenno i vniatno povtoril ia. \nSotni glaz raspolozhivshihsia vozle sten portovikov s pohotlivoj zavistiu eli Strojnye, obnazhennye do beder nogi zhenshchiny, sleduia za nej kak namagnichennye Po mere ee prodvizheniia, no ona ne obrashchala na eto ni malejshego vnimaniia. Oshchushchenie bylo moshchnym, vnezapnym i shokiruiushchim. A eshche mne ne daval pokoia vopros: zachem traktirshchik pytalsia otniat u menia Zhizn? Vecherom, po privychke skaniruia v zale vseh podriad, ia ne zametil v nem ni Malejshej agressivnosti. Znaesh, chto vydaet tebia bolshe vsego? Ia uznala by v tebe chuzhaka, dazhe Esli by ty perekrasil volosy i smenil odezhdu. Kak vizhu, chuzhoj eshche ne poiavlialsia? Otshelnik otodvinul oto rta gorlyshko fliagi rovno nastolko, chtoby eto Ne pomeshalo emu korotko kivnut v znak soglasiia, a zatem prisosalsia snova. Po Krajnej mere, oshchushchenie bylo imenno takim. Ia nikomu nichego ne dolzhen, a pered otcom Ostina Valigasa ia i tak otchitaius. Prizrachnaia stal razrezala pryguna kak nozh m!\naslo, slovno ne vstretivshis ni S odnoj kostiu, i lezvie vyskochilo mezhdu nog. \nMozhet byt, primesh eto v kachestve platy? Ty mogla by vziat za nih horoshuiu cenu U proezzhih puteshestvennikov. Gilsveri tozhe vstal. Predsmertnyj rev gibnushchih voinov eshche stoial v ushah, a pered vnutrennim Vzorom na styloj zemle vse eshche dymilas goriachaia krasnaia krov, ochen pohozhaia na Chelovecheskuiu. Kukolniki, letuny i pryguny, podhvatil Celitel, soglashaias so Mnoj. ejisuminyon Q1FUW1pVckRcUFBGHUFCUEZWRlleXR1XVA==\n \n\n\n"}