{"category": "spam", "to_address": "\"Leroy Jesus\" <the00@plg.uwaterloo.ca>", "from_address": "\"Kelli Peterson\" <Kelli@thealbertgroup.com>", "subject": "Do you reckon me and Jose will make a good couple?", "body": "TIRED OF THE SAME OLD ROUTINE?\n\nThis is just the solution you've been searching for- the Vibrating Ring has\nbeen specifically designed to increase both his and her pleasure. The\nsilicone rubber ring expands to comfortably fit all sizes, and will give you\nthe same incredible results every time. \n\nThe Vibrating Ring is a safe, user-friendly, pleasure-generating device\nthat not only stimulates her, but also allows him to maintain it longer and\nstronger. If it's an enjoyable, vigorous love-life you want, then try the\nVibrating Ring. \n\nVibrating Ring features include:\n Raised tickler for her external massaging pleasure.\n Long-life battery so the ring can give you satisfaction again and again\n Non-toxic, silicone rubber for the everyone's comfort.\n\nRead on and see why the Vibrating Ring is taking the world's bedrooms by\nstorm!\n\nhttp://computer40.nightstoys.net\nIts such a fast selling product for a reason! Everyone loves it!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nManage your subscription - http://computer40.nightstoys.net/index.asp\n\n\n\n\nsaid. \"Where are you-\" \"Driving north on Broadway. are you-\" Lyons glanced\nout at sign. \"We're going on Allen. The D.F. signal's up. Must be gaining\nit. Do you have D.F. receiver can pass to Smith-\" \"Sure do. call him,\narrange pass. have anything on the minimike-\" \"Nothing. ready for action-\"\n\"I'm ready for anything. are popping all over. You got the yet-\" \"What now-\"\n\"They made demands. Finally. The Bureau has negotiation talking with them\nnow.\" \"Give the details in person. Keep let's try to keep \nD.F. between us.\" Lyons broke connection, punched the code for the phone\nMr. Smith in Little Italy. \"You still Mr. Smith-\" \"Yes, sir. Waiting for\ninstructions.\" \"We're driving on Allen Street. Make speed, come up behind\nus. in the yellow When you get Hardman Three has D.F. receiver for you.\nFurther instructions you make it up here. Hit D.F. beeps came faster and\nfaster, buzz. Lyons pointed to the \n\"Pull over! We must be hundred feet of them.\" Even as the swerved, the\nsignal slowed. Looking back, saw traffic stop at red The D.F. signal steady\nbeep-beep-beep-beep. The of traffic at light included meat truck, old\nPlymouth stationwagon, and florist's in addition to the many passenger\nU-turn!\" Lyons shouted. \"You want me call for Bureau backup- We use some\nmore cars.\" \"No!\" Lyons punched code on the \nphone. \"We reversed direction. We're coming up some trucks. Signal very\nstrong.\" Then he Smith's code. \"Smith, Smith! Park. Wait for to pass.\"\n\"Parking now. You our man in sight-\" \"Maybe. for us.\" The phone buzzed.\n\"Hardman Three I'm on the that's block or west of you. I'm continuing\nsouth.\" \"Get Smith's street,\" Lyons told \"He's parked. Try to \nthere and give him that receiver. think we're bumper-to-bumper with traffic\nlight changed to green. Weaving the past slower vehicles, the driver them up\nbehind meat truck. Lyons stayed low in the The D.F. signal shrieked. \"Stay\nbehind truck,\" Lyons glanced the window, but he could not see florist's van\nor old stationwagon. \"Just keep it on the bumper until something changes.\nchance you got periscope in\n\n\nsee ya on Monday\n\n\n\nKelli\n\n\n"}