{"category": "ham", "to_address": "sugar@lists.laptop.org, Devel List <devel@lists.laptop.org>", "from_address": "=?UTF-8?Q?Ivan_Krsti=C4=87?= <krstic@solarsail.hcs.harvard.edu>", "subject": "[sugar] security status and important milestone reached", "body": "Things have been very quiet about the progress of the Bitfrost  security implementation. Due to a very complex chain of  implementation dependencies, we've had to wait until recently to be  able to kick the security work into high gear. I'm happy to report  that this has now happened and things are moving along quickly.\n11 days ago, we merged our FRS containerization solution into a  branch of our kernel tree:     http://dev.laptop.org/git.do?p=olpc-2.6;a=shortlog;h=vserver\nThis branch will get other development updates and is slated, barring  unforeseen problems, to become the build branch for Trial-2, meaning  the Trial-2 build will run a container-enabled kernel by default. A  few days ago, Mitch Bradley reported having successfully integrated  our BIOS cryptography code into Open Firmware, and he and I will be  spending part of the next week hammering out the details of this  integration.\nOn behalf of the security team, I am particularly pleased to announce  we've just reached a very important milestone: we have integrated  automatic containerization with Sugar on build 472 (based on Fedora  Core 7) through the Rainbow userspace security service, and with only  a trivial patch to Sugar (http://dev.laptop.org/~krstic/sugar- rainbow.patch). Concretely, we have an XO in the office where  clicking an activity icon shows the activity as usual, but the  loading machinery in the background automatically launched the  activity in a container. No restrictions are yet imposed on the  containers -- that's where our work will turn now, as well as towards  working with the Sugar team to bring this functionality soon to a  Sugar near you. I hope to also announce working secure activation  (delivery chain protection) code soon.\nCheers,\n--Ivan Krsti\\u0107  | GPG: 0x147C722D\n_______________________________________________Sugar mailing listSugar@lists.laptop.orghttp://lists.laptop.org/listinfo/sugar\n\n"}