{"category": "ham", "to_address": "Thomas Lumley <tlumley@u.washington.edu>", "from_address": "Frank E Harrell Jr <f.harrell@vanderbilt.edu>", "subject": "Re: [R] help comparing two median with R", "body": "Thomas Lumley wrote:\n> On Tue, 17 Apr 2007, Frank E Harrell Jr wrote:\n> \n>> The points that Thomas and Brian have made are certainly correct, if \n>> one is truly interested in testing for differences in medians or \n>> means.  But the Wilcoxon test provides a valid test of x > y more \n>> generally.  The test is consonant with the Hodges-Lehmann estimator: \n>> the median of all possible differences between an X and a Y.\n>>\n> \n> Yes, but there is no ordering of distributions (taken one at a time) \n> that agrees with the Wilcoxon two-sample test, only orderings of pairs \n> of distributions.\n> \n> The Wilcoxon test provides a test of x>y if it is known a priori that \n> the two distributions are stochastically ordered, but not under weaker \n> assumptions.  Otherwise you can get x>y>z>x. This is in contrast to the \n> t-test, which orders distributions (by their mean) whether or not they \n> are stochastically ordered.\n> \n> Now, it is not unreasonable to say that the problems are unlikely to \n> occur very often and aren't worth worrying too much about. It does imply \n> that it cannot possibly be true that there is any summary of a single \n> distribution that the Wilcoxon test tests for (and the same is true for \n> other two-sample rank tests, eg the logrank test).\n> \n> I know Frank knows this, because I gave a talk on it at Vanderbilt, but \n> most people don't know it. (I thought for a long time that the Wilcoxon \n> rank-sum test was a test for the median pairwise mean, which is actually \n> the R-estimator corresponding to the *one*-sample Wilcoxon test).\n> \n> \n>     -thomas\n> \n\nThanks for your note Thomas.  I do feel that the problems you have \nrightly listed occur infrequently and that often I only care about two \ngroups.  Rank tests generally are good at relatives, not absolutes.  We \nhave an efficient test (Wilcoxon) for relative shift but for estimating \nan absolute one-sample quantity (e.g., median) the nonparametric \nestimator is not very efficient.  Ironically there is an exact \nnonparametric confidence interval for the median (unrelated to Wilcoxon) \nbut none exists for the mean.\n\nCheers,\nFrank\n-- \nFrank E Harrell Jr   Professor and Chair           School of Medicine\n                      Department of Biostatistics   Vanderbilt University\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}