{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "Did you wait for Howard?", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tDID YOU WAIT FOR HOWARD?\n\n\n\t\t\t\t\t\tFROM NEWSNIGHT EDITOR, PETER BARRON \n\t\t\t\t\t\n\n\n\n\n\t\t\t\t\t\tWhat is it about Michael Howard and Newsnight? \n\n\nThe former Conservative leader already holds the accolade for the greatest-ever Newsnight moment with, of course, that interview with Jeremy in 1997 in which he failed to answer the same question 12 times in a row (watch it here). \n\n\nLast night he made a renewed bid for YouTube immortality in an extraordinary moment of theatre involving his old adversary Alastair Campbell. Howard and Campbell were live in Newsnight's studio discussing Blair's legacy, and as midnight hovered into view something of the night seemed to overtake Mr Howard. He launched a savage and sustained attack on Campbell's modus operandi, effectively blaming him for the ills of the Blair years and accusing him of using lies as a weapon of government. \n\n\nIn case you'd already gone to bed, click here for another chance to enjoy.\n\n\nPeter Barron is editor of Newsnight\n\n\nCLICK HERE TO COMMENT ON THIS COLUMN\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}