{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Arnoud Engelfriet <arnoud@engelfriet.net>", "subject": "Re: Logo trademark license vs. copyright license", "body": "Francesco Poli wrote:\n> On Tue, 17 Apr 2007 09:09:11 +0200 Arnoud Engelfriet wrote:\n> > \"The sign X, registered as a trademark under number $NUM in\n> > $REGION,...\"\n> \n> I don't know if Debian logos are actually *registered* marks.\n> Possibly, they are just unregistered trademarks...\n> Does anybody know for sure?\n\nI didn't think of unregistered marks. Yes, in that case it\ngets more tricky. This is a mostly-US problem; the other\njurisdictions I know of simply do not recognize trademark\nrights unless registered.\n\n> Anyway, how do you propose to keep the current role distinction between\n> the two logos?\n\nTINLA but I don't think that is necessary. Since the license\nis \"do whatever you want as long as it doesn't confuse people\nwith us\", you simply argue differently when you think there\nis confusion.\n\nFor the open use logo, you would say there is confusion only\nwhen people try to indicate endorsement by Debian.\n\nFor the official use logo you would say there is confusion\nalso when people pretend whatever they have is Official Debian.\n\nYes, these are vague criteria but that is to a certain extent\ninherent in trademark law. You don't know what people will do\nand how that can affect your trademark.\n\n> > When you describe what the mark covers, you also describe what\n> > the mark does not cover. If three years later your mark has\n> > expanded to cover new things, this license will limit you.\n> \n> That is to say: restrictions won't expand?\n\nI don't know what you mean by that. \n\nThe wording with X and Z seems to suggest that you mean that\nX can only be a trademark for Z (\"representing Z\"). So there\ncan only be confusion when people use X representing Z, right?\n\nNow suppose three years from now X also becomes known to\nrepresent T. With your license, can you still argue that\nX is being misused when people use it to represent T, falsely\npretending affiliation with X? I'm not sure, because the license\nsays that X only represents Z.\n\n> I'd rather avoid the latter, even at the cost of risking the former!\n\nI understand that. It's difficult to allow other people to do\nthings with your trademark, because it is easy to permit too much\nand that can kill your trademark. It's not like copyright where\na too-liberal license means someone can use it in a way you don't\nlike; there you still have your free original. \n\nArnoud\n\n-- \nArnoud Engelfriet, Dutch & European patent attorney - Speaking only for myself\nPatents, copyright and IPR explained for techies: http://www.iusmentis.com/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}