{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 87", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. The Restitution Law of Unintended Consequences\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Thu, 12 Apr 2007 15:08:47 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The Restitution Law of Unintended Consequences\nTo: \nMessage-ID: <005801c77d03$b5356de0$1fa049a0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\n\n \n\nhttp://www.forward.com/articles/the-restitution-law-of-unintended-consequenc\nes/ \nThe Restitution Law of Unintended Consequences \nOpinion \nMarilyn Henry | Fri. Apr 13, 2007 \n  \nIn late 2005, the Knesset passed Israel's first Nazi-era restitution law.\nThe legislation was the work of the Parliamentary Inquiry Committee for the\nLocation and Restitution of Assets of Holocaust Victims, which had been set\nup by Knesset member Colette Avital after reports that Israeli institutions\nheld bank accounts and real estate belonging to Jews who perished in the\nHolocaust. \n  \nTo ensure that no Nazi victims' assets would be overlooked, the Knesset\nrestitution law broadly defined property to include real estate, financial\ninstruments and other \"movables.\" By default, the definition includes\nartworks, ceremonial objects, books and artifacts. \n  \nEarlier this year, an important provision of the law went into effect - with\nunintended consequences, thanks to that vague definition of property. \n  \nThe provision mandated an independent company to locate the owners or heirs\nof all assets in Israel that had belonged to Jews last known to have been in\nEurope in 1945. As of January 26, ownership of these Holocaust assets\nbelongs to the company, which operates under the lengthy name of the Hevra\nfor Locating and Returning Assets of Those Who Perished in the Holocaust.\nAny heirless assets are now to be sold by the company to aid survivors and\nto assist Holocaust memorial and documentation centers. \n  \nHaving failed to exclude artworks and artifacts from the definition of\nproperty in the 2005 restitution law, the Knesset transferred ownership of\nthese assets to the new company - a result that Avital herself admits was\nnot intended by the law. \n  \n\"During almost five years of work, no one brought up the issue of artworks,\nbecause the terms of reference of the committee covered only property\nacquired in Israel, or bank accounts opened in Israel,\" Avital said. \"To the\nbest of our knowledge, Jews in Europe did not send their art collections to\nPalestine.\" \n  \nThis, however, is a specious distinction. The underlying basis of\nrestitution laws, including the Israeli law, is very simple: European Jews\nowned properties before the Holocaust. Through theft, displacement or\nabandonment caused by the owner's persecution or death, Jewish properties\nwent unclaimed or became heirless. \n  \nIt does not matter how the assets arrived in Israel. Whether they were\ndeposited or purchased by European Jews before World War II, or donated to\nthe Israel Museum, or acquired by Yad Vashem, they are all legitimate\ncandidates for restitution. \n  \nThe Israel Museum - which received artworks both from donors and from the\nJewish Restitution Successor Organization, the predecessor to the Claims\nConference - was astonished to find some of its treasures now owned by the\nnew company. And Yad Vashem could in theory find itself compelled to\nrelinquish artifacts of destroyed Jewish communities on the grounds that\nthese pieces of documentary evidence last belonged to Jews in Europe in\n1945. \n  \nSuch developments clearly call for a revisiting of the restitution law. Some\nare already calling on the Knesset to amend it to exclude artworks and\nartifacts. \n  \nInadvertent as it may have been to include artworks within the framework of\nthe new law, however, it would be a grave mistake - indeed, it would\ncompound the original one - to exclude them by amendment. \n  \nOne cannot cherry-pick which Jewish properties should be restored. The State\nof Israel should not imply through its legislation that restitution should\nbe limited to bank accounts and real estate and that cultural properties are\noff limits. It would send the message that Holocaust survivors are entitled\nto recover their bank account but not the painting that hung in their family\nhome. \n  \nInstead, the Knesset should take this opportunity to encourage Israeli\nmuseums to do what every other museum in the world has been prodded to do by\nIsrael and Jewish organizations: Undertake systematic provenance research\nabout their collections, with every effort made to find owners or heirs of\nplundered properties. \n  \nIf the Knesset amends the new restitution law, it should make provisions to\nretain in museums those Holocaust artworks and artifacts whose owners and\nheirs cannot be identified. Otherwise, we could face an unfortunate irony:\nThe Knesset-mandated independent company may one day take custody of\nartworks and artifacts in Yad Vashem and other Israeli museums, auction the\nheirless assets - and then give back the proceeds to Yad Vashem and other\nHolocaust memorials. \n  \nMarilyn Henry is the author of \"Confronting the Perpetrators: A History of\nthe Claims Conference\" (Vallentine Mitchell).\n\n \n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 87\n***************************************\n\n"}