{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Power Marketing Association<Power.Marketing.Association@calcium.netcontentinc.net>", "subject": "Intro to Natural Gas/Natural Gas Transactions May 15-17  Dallas", "body": "Campaign Manager\n\n\n\n\n\n\n\n\n\nOATT Reform\n\n\n\n\n\n\n\n\nIN-DEPTH INTRODUCTION TO THE NATURAL GAS INDUSTRYNATURAL GAS TRANSACTIONS, TRADING & ORIGINATION FOR NON-TRADERS\n  \nMay 15 – 17, 2007 Dallas, Texas \nClick Here \n            To Download A Complete Conference Brochure\n Click Here For A Complete Listing\n              Of Upcoming Conferences\n\n\n\n\n\n\n\n\n\n\n\nOverview:\n       \n\nIN-DEPTH INTRODUCTION TO THE NATURAL GAS INDUSTRY   May 15 - 16, 2007\n\nThis in-depth introductory course is designed for those with limited knowledge of the natural gas industry. It provides an overview of the industry focusing on fundamentals of this form of energy, its history, and the typical assets, markets, and regulatory systems it\ntakes to produce and deliver natural gas to its end uses. Specifi c examples and actual market data are used to illustrate basic principles\nand ideas. This seminar uses several approaches to elicit participation from attendees including group exercises and a gas market\nsimulation in which participants buy, sell and transport gas over the course of the seminar under various market rules and conditions.\nParticipants will have plenty of opportunities to ask questions and discuss issues of special interest. Extensive and comprehensive\ncourse notes are provided to each attendee.\n\n\nNATURAL GAS TRANSACTIONS, TRADING & ORIGINATION FOR NON-TRADERS   May 16 - 17, 2007\n\nThis in-depth course is designed for those interested in learning how others structure gas trades, mid-market and long-term transactions.\nOften these transactions are designed to hedge the commodity risks of infrastructure projects such as production development,\npipelines and power plants. This course includes material about recognizing project needs for complex transactions involving multiple\ndiscrete risks. Specifi c examples and actual market data are used to illustrate basic principals and ideas. This seminar uses several\napproaches to elicit participation from attendees including group exercises. Participants will have plenty of opportunities to ask questions\nand discuss issues of special interest. Extensive and comprehensive course notes are provided to each attendee.\n\n \n\n\n\n\n\nRegister today!\n\n\n\n\nClick\n        Here To Download A Complete Conference Brochure\n\n\n\nUpcoming \nConferences\n  EPRI - \n  Forward Price Forecasting Workshop\n  March 21-23, 2007\n  Residence Inn Orlando/Seaworld\n  Orlando, FL\n   Spatial Electric Load Forecasting: Forecasting and Justifying Demand \n  Targets for T&D Planning\nScottsdale, AZ\n    March 26-27, 2007\n   Introduction to Electric Utility Systems for Non-Engineers\nDenver, CO\n  March 28-29, 2007\n  Emergency \n  Preparedness and Service Restoration For Utilities\n  March 28-30, 2007\n  Wyndham New Orleans\n  New Orleans, LA\n   The Real Story on AMI: From Conception to Completion, Learning From \n  Those Who Have Lived It\nBreckenridge, CO\n    March 29-30, 2007\n    The 7th Annual National Multicultural Business Conference\nLas Vegas, NV\n  April 11-13, 2007\n   Wall \n  Street Green Trading Summit VI\nNew York, NY\n  April 16-17, 2007\n \n\n\n\n\n\n\n\n\n\nIntro to Natural Gas/Natural Gas Transactions May 15-17  DallasPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}