{"category": "ham", "to_address": "Daniel Nordlund <res90sx5@verizon.net>, r-help@stat.math.ethz.ch", "from_address": "John Kane <jrkrideau@yahoo.ca>", "subject": "Re: [R] importing sas datasets", "body": "\n--- Daniel Nordlund  wrote:\n\n> > -----Original Message-----\n> > From: John Kane [mailto:jrkrideau@yahoo.ca]\n> > Sent: Friday, April 20, 2007 5:11 PM\n> > To: Daniel Nordlund; a.martino@crismaitalia.it;\n> r-help@stat.math.ethz.ch\n> > Subject: Re: [R] importing sas datasets\n> > \n> > Hi Anna,\n> > \n> > I'm the sas.get problem man.\n> > \n> > I still have not gotten it to work but I think\n> that is\n> > because I have some slightly dodgy SAS files.\n> > Assuming that the sas.get problem is what was\n> > described in the earlier thread it appears to have\n> > been fixed.  You might want to do an update to R\n> to\n> > get the most recent Hmisc.\n> \n> I have been wrong before, I will be wrong again in\n> the future, but as far as I can tell sas.get is\n> still broken in the Windows version of Hmisc.  The\n> work around that has been described several times\n> does solve the problem.\n\nCould well be.  I was going by the work-around\ndescribed earlier where one line of code needed to be\nmodified. Line 127 ?\n\nA recent update of Hmisc appears to have this mod.\n> \n> > \n> > An alternative in Hmisc that Frank Harrell pointed\n> out\n> > is to do a SAS export file and a special version\n> of\n> > the format file.\n> > \n> > It is described in the Hmisc reference manual See\n> > sasxport.get . It worked just fine for me on a\n> couple\n> > of test files. I don't remember but I think you're\n> > stuck with the 8 character variable names though.\n> > \n> \n> If the sasxport.get function works for your\n> purposes, go for it.  But if you have access to SAS\n> and have SAS datasets that you want to use in R, I\n> would rather import them directly than to go to the\n> extra step of creating a sas xport file and then\n> importing that. \n\nMe too, but I had not used SAS in about 10-12 years\nand all my experience is with it on mainframes so I\nwas willing to take whatever I could get.  The last\ntime I moved a large SAS dataset it was on tape and I\ncarried it myself. \n\nExcept for losing the variable labels I'd much prefer\njust to get it in csv. Unfortunately we have about\n1800 variables with incomprehensible names. Whoever\nset up the file stuck to the 8 character name\nconvention from the old days.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}