{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "60 Minutes Newsletter <newsletter_sixty_minutes-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "60 Minutes E-mail Alert", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nHe has claimed to \n      have assisted in the suicides of 130 people, flouting authorities until he \n      ultimately dared them and ignited a ferocious national debate by coming on \n      60 Minutes with a videotape \n      he'd made of himself lethally injecting a patient. Dr. Jack Kevorkian \n      finally went to jail based on that tape and interview. Correspondent Emeritus Mike \n      Wallace was there with him in 1998, and he's there again in Sunday’s \n      lead story to talk to Kevorkian upon his release from a Michigan prison after more than eight \n      years. Has prison time and a parole agreement dulled the 79-year-old \n      pathologist’s passion to fight for legalization of physician assisted \n      suicide? Wallace gets to the heart of that and more when Dr. \n      Kevorkian comes on 60 Minutes once again to push \n      an agenda some call mercy killing and others, including the law in 49 \n      states, call murder.\n \nIn our second story you will \n      hear from another passionate voice from the past who is up to new things \n      but still has the old fire. Up for a Tony Award for her solo \n      performance in a play based on the Joan Didion best-selling book “The Year \n      of Magical Thinking,” Vanessa Redgrave talks to Wallace for the first time \n      since 1979, when she appeared on 60 Minutes at the peak of her \n      political activism. After 28 years, she's still feisty - and so is \n      Wallace.\n \nFor our third story, it gets \n      even feistier when 60 Minutes re-broadcasts parts \n      of the exclusive and rare interview Wallace did last year with Iranian \n      President Mahmoud Ahmadinejad.  Now that U.S.-Iranian diplomatic \n      relations have been re-established for the first time in three decades and \n      with the question of an Iranian nuclear weapon still in an issue, \n      Wallace’s interview is as timely as ever. \n \nSee this Mike Wallace tour de force and a \n      special Andy Rooney tribute to \n      Wallace, this Sunday, June 3, on 60 Minutes at 7 p.m. \n      ET/PT.\n\n \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n \n"}