{"category": "ham", "to_address": "R-help@stat.math.ethz.ch", "from_address": "(Ted Harding) <ted.harding@nessie.mcc.ac.uk>", "subject": "Re: [R] Open source community help-desks", "body": "On 22-Apr-07 20:51:09, Jeffrey Miller wrote:\n> I read the reply earlier in which Nima was \"naughty-naughty\"'d\n> for calling us a Help Desk. And, I have to admit that I agree.\n\nWell, we're not a Help Desk of the kind that puts you on hold,\nlistening to the Free Software Song[1] round and round ... but ...\n\n> But then, an open-source listserv is, in essence, a help desk\n> ....well, maybe not a desk, but we do help each other.\n\n... well, exactly! And I can accept \"help desk\" as a metaphor.\n\n> My conflicting feelings about this are better left for a therapist\n> but, in the meanwhile, perhaps we need a revision of Ayn Rand's\n> \"Virtue of Selfishness\" and how it may or may not extend to the\n> open-source community.\n\nAyn Rand's concept of \"selfishness\" is of course not the standard\none (gratifying oneself in disregard for others), and can (if I\nhave it right) well embrace ensuring that the self is well looked\nafter while extending one's resulting strength, vigour and\nsurvival to the benefit of others. And I think this may be a good\nanalogy of the way the Open Source community works.\n\n> All in fun,\n\nHmmm, slightly serious fun ... ?? !!\n\nBest wishes to all,\nTed.\n\n[1] http://www.gnu.org/music/free-software-song.au\n\nor other variants which may be found at\n\n    http://www.gnu.org/music/free-software-song.html\n\n--------------------------------------------------------------------\nE-Mail: (Ted Harding) \nFax-to-email: +44 (0)870 094 0861\nDate: 23-Apr-07                                       Time: 00:38:23\n------------------------------ XFMail ------------------------------\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}