{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "robert weissman <rob@essential.org>", "subject": "[Ip-health] Sign-On: Drug Companies Should Disclose Charitable and Educational\n Contributions", "body": "- Please Forward -\n\nDear Friends,\n\nAs you may have seen, Eli Lilly announced in May that it is now\ndisclosing its charitable and educational contributions, at least in the\nUnited States. Disclosure of pharmaceutical industry funding to\ncharitable and educational organizations is by no means a complete cure\nfor the problems related to such sponsorships, but it is a start.\n\nI am writing to ask you to join a sign-on letter asking all other major\npharmaceutical companies to follow Lilly's lead, but to disclose all\ncontributions on a global basis. (We will also ask PhRMA and the IFPMA\nto adopt policies recommending member companies make such disclosures;\nand for Lilly to broaden its policy to the entire world (which it says\nit is considering).)\n\nFor background material on the issue, please see our website, at\n.\n\nThe sign-on letter is reproduced below. To add your name to the call,\nsend your organization's name (or your name and organizational\naffiliation, if any, if you would like to sign as an individual), your\nmailing address and email address to:  or\n. Please send your endorsement no later than\nJune 20, 2007.\n\nBest,\n\nRobert Weissman\nEssential Action\n202-387-8030\nrob@essential.org\n\n*     *     *\n\nDear [Company],\n\nWe are writing to urge you to publish a complete list of all of the\ncharitable and educational grants and gifts made by [Company], its\nsubsidiaries, affiliates and associated foundations. This list should be\nmade available on your company website, include the amounts of each\ngrant and the recipient, and cover grants and gifts made on a global\nbasis. Such a system of disclosure would impose minimal burdens on your\ncompany, since it must already compile this information, but the\ndisclosures would have significant public benefits.\n\nThere is quite extensive evidence that pharmaceutical industry\ncharitable and educational grants have been abused to influence public\nhealth and public policy decisions improperly. For example:\n\n* Purportedly educational programs sponsored by industry may improperly\npromote drugs for off-label uses.(1)\n\n* Policy think tanks and advocacy groups that receive funding from the\npharmaceutical industry often weigh in on important policy debates --\nfor example, in op-ed pieces -- without disclosing their industry ties.(2)\n\n* Patient organizations receiving industry support often tout products\nsold by corporate donors, but fail to highlight safety concerns. These\ngroups may also over-promote diseases and drug treatments sold by their\ncorporate donors.(3) They may lobby for inclusion of products on\ngovernment formularies without disclosing their industry ties, and favor\nthe products of corporate sponsors over others.(4)\n\n* Charitable organizations may be used as a conduit to fund doctors or\ntheir research, circumventing normal disclosure requirements and rules.(5)\n\nDisclosing industry funding to charitable and educational organizations\nis by no means a complete cure for these and related problems -- many of\nus support much stronger restrictions or outright bans on many industry\nsponsorship practices -- but it is a start.\n\nThe industry has begun to make some modest moves in the direction of\ndisclosure. As you know, one major pharmaceutical company, Eli Lilly,\nrecently began publishing its charitable and educational contributions,\nat least in the United States. And the Association of the British\nPharmaceutical Industry's code of practice requires disclosure of\nsupport for patient groups, though not disclosure of the amounts.\n\nIt is time now for each company to fully disclose charitable and\neducational contribution information, on a global basis.\n\nWe look forward to your response.\n\nSincerely,\n\nEssential Action,\nWashington, DC, USA\n\nAlliance for Human Research Protection\nNew York, USA\n\nHealth Action International Africa\nNairobi, Kenya\n\nHealth Action International Asia Pacific\nColombo, Sri Lanka\n\nHealth Action International Europe\nAmsterdam, The Netherlands\n\nHealth Action International Latin America\nLima, Peru\n\nInitiative for Medicines, Access & Knowledge\nDelhi, India/New York, USA\n\nIntegrity in Science Project, Center for Science in the Public Interest\nWashington, DC, USA\n\nKnowledge Ecology International\nWashington, DC, USA\n\nNational Women's Health Network,\nWashington, DC, USA\n\nPharmedOut\nWashington, DC, USA\n\nPublic Citizen,\nWashington, DC, USA\n\n\n\n\n(1) See, e.g., \"Warner-Lambert to Pay $430 Million to Resolve Criminal &\nCivil Health Care Liability Relating to Off-Label Promotion,\" U.S.\nDepartment of Justice news release, May 13, 2004 (\"The company also\nsponsored purportedly 'independent medical education' events on\noff-label Neurontin uses with extensive input from Warner-Lambert\nregarding topics, speakers, content, and participants\"). For a fuller\ndiscussion of this issue, see \"Use of Educational Grants by\nPharmaceutical Manufacturers,\" Committee Staff, Committee on Finance,\nU.S. Senate, April 2007.\n\n(2) See, for example, Philip Shenon, \"On Opinion Page, Lobby's Hand is\nOften Unseen,\" New York Times, December 23, 2005.\n\n(3) Tinker Ready, \"Divided Loyalties?; Nonprofit Health Advocacy Groups\nLike to Portray Themselves as Patients' Allies. Can They Serve Corporate\nBenefactors at the Same Time?.\" Washington Post, February 7, 2006.\n\n(4) Thomas Ginsberg, \"Donations tie drug firms and nonprofits: Many\npatient groups reveal few, if any, details on relationships with\npharmaceutical donors,\" Philadelphia Inquirer, May 28, 2006.\n\n(5) Reed Abelson, \"Charities Tied to Doctors Get Drug Industry Gifts,\"\nNew York Times, June 28, 2006.\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}