{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"maillist@michaelmoore.com\" <maillist@michaelmoore.com>", "subject": "'SiCKO' Sneaks Across America This Saturday!", "body": "\n'SiCKO' Sneaks Across America This Saturday!\n\n\nThursday, June 21st, 2007\n\n\nFriends,\n\n\nWould you like to go to a sneak preview of my new film, \"Sicko,\" before it opens on June 29th? Well, if you live anywhere near the 32 cities listed below, this Saturday night, June 23rd, our movie studio is going to hold sneak screenings of \"Sicko\" in 43 theaters across the country. I'd love for you to be one of the first to see it so, if you'd like, you can click here and order tickets now. We'd love to see you there. \n\n\nAlso, if you live in the New York City area we are opening the film tomorrow (Friday, June 22) exclusively at one theater, the AMC Lincoln Square for a first week run. The interest in the film is very high and theaters have been asking us to open it as soon as possible. Alright, already! It opens tomorrow in NYC, the sneak previews are Saturday around the country, and we open nationwide next Friday, the 29th.\n\n\nLast night we screened \"Sicko\" for the members of Congress and the Senate in Washington, D.C. Earlier in the day we testified during a briefing in Congress called by the Chairman of the Judiciary Committee, Rep. John Conyers, Jr. I brought with me some of the people who appear in the film to tell their stories -- and it was a powerful moment.\n\n\nI will write again next week, before \"Sicko\" opens nationwide on the 29th. I'm so excited, after spending the last couple of years working on this film, that you all will finally be able to see it.\n\n\nYours,\nMichael Moore\nMichaelMoore.com\n\n\nP.S. Catch the sneak preview of \"Sicko\" in these cities this Saturday night, June 23rd:\n\n\nPhoenix, AZ\nSacramento, CA\nSan Diego, CA\nSan Francisco, CA\nDenver, CO\nWashington, D.C.\nMiami, FL\nTampa - St. Petersburg, FL\nAtlanta, GA\nChicago, IL\nIndianapolis, IN\nKansas City, KS\nBaltimore, MD\nBoston, MA\nDetroit, MI\nFlint, MI\nMinneapolis - St. Paul, MN\nSt. Louis, MO\nLas Vegas, NV\nAlbuquerque, NM\nAlbany, NY\nCleveland, OH\nColumbus, OH\nPortland, OR\nPhiladelphia, PA\nPittsburgh, PA\nAustin, TX\nDallas, TX\nHouston, TX\nSeattle, WA\nTacoma, WA\nMilwaukee, WI\n\n\nOrder tickets online here: http://www.michaelmoore.com/sicko/about/sneak/\n\n\n\n\n---\nYou are currently subscribed to Mike's Message as: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe click on the link below:\n\nhttp://go.netatlantic.com/u?id=52827208F&l=michaelmoore\n\n\n"}