{"category": "spam", "to_address": "ktwarwick@plg.uwaterloo.ca", "from_address": "\"Ramiro Lawrence\" <paxenkoplantuf@enkoplan.de>", "subject": "Look in the mirror and enjoy the new you", "body": "\nWomen will love your new figure\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most exciting product for weighty people is now readily available – As told on BBC.\n\n\nCan you recall all the cases when you asked yourself to do anything for being saved from this desperately growing pounds of fat? Happily, now no great price is to be paid. With Anatrim, the ground-shaking kilos-melting blend, you can achieve naturally health life style and become really thinner. Just look at what people state!\n\n\n\n\"I hate to confess but I was an awful food addict. \n\n\nI devoured all this rubbish \n\n\nand could not stop. \n\n\n\n\nThis torment stopped after I started course with Anatrim! \n\n\nHoly God,\n\n\n\n\n my craving for food disappeared, \n\n\nmood increased and I became the happiest person in the world 24 pounds in 2.6 months. \n\n\n\n\nI can tell you now I turned to the happiest person on the planet!\"\n\n\n\n\n\nAmely S., Boston\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nIt’s pretty hard to imagine how I abhorred being ridiculed at school. \n\n\n\n\nI detested my weight and I hated even myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nIt literally pulled me out of this awful nightmare! Lots of thanks to you, my friends.\"\n\n\n\n\n\nSteve Burbon, New York\n\n\n\n\n\n\"Do you know what? Anatrim preserved my marriage! I went into the circle, depression – eating more – just more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nMy best friend pointed to your web site and I called for Anatrim at once. \n\n\nThe final result was excellent, my appetite came to normal level, I was in a good mood oftener, and, of course, I went some belt holes back. And the sex became fantastic, too!\"\n\n\n\n\n\nJack\n\n\n\n\n There is a great number of gratitudes happy people leave after trying Anatrim. Why don't you add yourself to the thousands and thousands of slim men and women and try this original appetite reducing energy lifting product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}