{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Santiago Byrne\" <macccctndoc@ccctn.net>", "subject": "You'll love the new, non-obese you", "body": "\nBe leaner and slimmer by next week\n\n\n\n\n\n\nAnatrim – The newest and most delighting lose flesh product is now easily available – As could be seen on CNN.\n\n\nCan you remember all the situations when you appeal to yourself to do any thing for being saved from this quickly growing pounds of fat? Luckily, now no major offering is necessary. With Anatrim, the ground-shaking weight-reducing mixture, you can achieve healthier lifestyle and become really slimmer. Just look at what people say!\n\n\n\n\"It’s difficult to confess but I was exceedingly addicted to food. \n\n\nI swallowed up all this garbige \n\n\nand just could not stop. \n\n\n\n\nThis misery ceased when I started course with Anatrim! \n\n\nOh, God,\n\n\n\n\n my inclination to eat constantly disappeared, \n\n\nspirits improved and I became the happiest person 23 pounds in 2.3 months. \n\n\n\n\nSo, I can tell you now I became the happiest person in the world!\"\n\n\n\n\n\nLusia R., Chicago\n\n\n\n\n\n\"I had problems with over-weight since I was a boy. \n\n\nIt’s difficult to fancy how I hated being mocked at school. \n\n\n\n\nI abhorred my plumpness and I hated myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nIt literally pulled me out of this horror! The greatest respect to you, my friends.\"\n\n\n\n\n\nMike Brown, Las Vegas\n\n\n\n\n\n\"Do you know what? Thanks to Anatrim my marriage was luckily saved! I got into this circle, depression – eating more – more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nOne my best friend showed me web page and I ordered up Anatrim right off. \n\n\nThe final result was excellent, my appetite came to normal level, I was in a good mood oftener, and, be sure, I tightened my belt with no regrets. And you know, the sex became fantastic, too!\"\n\n\n\n\n\nLuis\n\n\n\n\n There is a lot of testimonials left by happy people taking Anatrim. Don’t you wanna join the thousands and thousands of slim men and women and take this natural appetite-suppressing energy increasing product now!\n\n\nDo not decline the chance!\n\n\n\n\n"}