{"category": "ham", "to_address": "Debian-legal <debian-legal@lists.debian.org>", "from_address": "Gervase Markham <gerv@mozilla.org>", "subject": "Re: First draft of AGPL v3", "body": "Francesco Poli wrote:\n> The restriction in the GPL is about the act of conveying copies of the\n> work.\n> The restriction in the AGPL is about *using* the modified work: there's\n> a cost associated with *use*...\n\nBut surely the entire point in question is whether presenting the UI to \nsomeone across the network is conveying or not? GPLv3 says it isn't, \nAGPL says it is.\n\nPerhaps it would be better (in respect of this particular question) if \nthe AGPL extra clause said simply:\n\n\"Notwithstanding any other provision of this License, if a user \ninteracts with the program remotely through a computer network, then \nthat is considered an act of conveying.\" (i.e. change the definition of \nconveying in section 0.)\n\n>>> This is ultimately a use restriction (from the point of view of\n>>> whoever runs the modified version of the Program) \n>> What does it prevent you using the Program for?\n> \n> If the source doesn't fit in the server the modified version runs on\n> (think of small embedded systems, for instance), I have to set up a\n> separate server to provide source to remote users.\n\nBut that doesn't prevent you *using* the modified version in your small \nembedded system. It might perhaps be inconvenient, but as Anthony Towns \n(I believe) said recently, not every obligation a license puts upon you \nis a \"cost\".\n\n> In order to *run* the modified version of the Program!\n\nOr to convey it, depending on your point of view :-)\n\n> As I said above, the GPL restricts the act of conveying, the AGPL also\n> restricts the use of modified versions of the Program.\n\nWell, those who would use the Affero GPL would see the use you are \nreferring to as a form of conveying.\n\nGerv\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}