{"category": "ham", "to_address": "Frank E Harrell Jr <f.harrell@vanderbilt.edu>", "from_address": "Marc Schwartz <marc_schwartz@comcast.net>", "subject": "Re: [R] Read SAS data into R", "body": "On Fri, 2007-05-11 at 13:43 -0500, Frank E Harrell Jr wrote:> kseefeld wrote:> > Kim\\u2019s EZ Recipe for\\u2026.> > > > SAS TO R, perfectly formatted table with no loss of data> > > > \\u2022\tIn SAS: Export SAS DB as access db> > \\u2022\tIn R go to directory where access db is stored> > \\u2022\tUse package RODBC> > > > #R code> > #Create connection object (Can set up DSN but I\\u2019m too lazy to)> > c<-odbcConnectAccess(\"x.mdb\")> > #Create table object, store db in object> > x<-sqlFetch(c, \"test\")> > #Close connection object> > odbcClose(c)> > > > > > That doesn't help people who don't have SAS.> > Note that an upcoming release of the Hmisc package has a new Access > import function for users who have access to the mdbtools package on > their operating system (e.g., linux).\nmdbtools is also being used by the OO.org folks:\n  http://dba.openoffice.org/drivers/mdb/index.html\n\nJust to follow up on Frank's prior post regarding the SAS System Viewer,that does work well under Wine on Linux, with the caveat that Franknotes.\nI also use DBMS/Copy under Wine and that works quite well.\nOne of the advantages of DBMS/Copy versus the System Viewer is widersupport for the proprietary SAS formats from various OSs. We recentlywere in receipt of SAS datasets that were generated on a 64 bit Unixplatform. The SAS System Viewer choked on them, but DBMS/Copy had noproblem.\nThe SAS System Viewer is a free download, whereas DBMS/Copy is not, soit places an emphasis on either getting SAS datasets from Windows basedinstallations or ensuring that the entity generating the datasetsoutputs SAS Transport format files instead.\nHTH,\nMarc Schwartz\n______________________________________________R-help@stat.math.ethz.ch mailing listhttps://stat.ethz.ch/mailman/listinfo/r-helpPLEASE do read the posting guide http://www.R-project.org/posting-guide.htmland provide commented, minimal, self-contained, reproducible code.\n\n"}