{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "Elizabeth Purdom <epurdom@stat.berkeley.edu>", "subject": "[R] Problem opening connections to removable hard drive", "body": "Hi,\n\nI have my files and R session on a portable hard drive to be able to \nwork across computers since I have some extremely large files. I have \njust started doing this and generally it works as I expect. But after a \nwhile of using my R session, certain types of calls to open connections \non the hard drive don't work. But I experience no problems \nopening/saving files on the portable hard drive using other programs.\n\nIn particular, if I explicitly call the entire folder path to the hard \ndrive, I can save an object to file, for example. But if I just want to \nsave it in the current working directory, without explicitly naming the \nentire path, then I have problems (I show an example below). I am using \na package that assumes a certain file structure from the current working \ndirectory in order to find/write output, which is why I want to be able \nto rely on not explicitly calling the whole path. Furthermore, I was \nexperimenting just now, and when I changed the current directory to \nanother one, and then back to the removable hard drive, everything gets \n'reset' somehow and opening connections works again, just like when I \nfirst started up my session.\n\nI am on Windows XP, R 2.4.0.\n\nThanks,\nElizabeth Purdom\n\nexample:\n > getwd()\n[1] \"I:/ICBP/Exon Array/Data\"\n#explicit call to hard drive works...\n > save(x,file=\"I:/ICBP/Exon Array/Data/tmp.rdata\")\n#unexplicit call relying on knowing working directory doesn't...\n > save(x,file=\"tmp.rdata\")\nError in gzfile(file, \"wb\") : unable to open connection\nIn addition: Warning message:\ncannot open compressed file 'tmp.rdata'\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}