{"category": "spam", "to_address": "Gnitpick <gnitpick@flax24.uwaterloo.ca>", "from_address": "Crystal Floyd <anbirano@goldenshowerpiss.com>", "subject": "Can't stand sex all night long?", "body": "\n\nCan't have sex like you had 10 years ago? Tired with your sexual problems?\nClick here to have a nice dick\nOnline Medications drug store gives you the opportunity to recover your health. Do it now!\nGo to the shop\nInstant shipping worldwide!\nWith best regards,\nCrystal Floyd\n \n \nTy ved ispugalsia, cyplenok? Tebe strashno. Da eshche plius k etomu vtoroe dyhanie ne toropilos na Pomoshch, a pervoe uzhe kovyrialos v boku malenkim ostrym nozhichkom. Ochen uzh daleko k nemu bylo ezdit Cherez ves Kordos, da eshche bolshoj otrezok nichejnyh zemel v pridachu. Kvin zamer. \nSzhalis. Ha! Avtoritet ego, estestvenno, vzletit do samoj Sfery, i dazhe starshie ucheniki posle etogo stanut prislushivatsia k ego slovam i Interesovatsia ego mneniem. No serdce moe Trevozhno szhalos, tak kak ia uzhe znal, chto umenie kontrolirovat sebia vneshne V etom Gorode ne garantiruet bezopasnosti. Kak-to dazhe ne Ukladyvalos v golove, chto podobnoe skoro mozhet proizojti i so mnoj. Dvigatel vzrevel. Mne vse eshche kazalos neveroiatnym, Chto sudba v kotoryj raz tak stremitelno povernulas ko mne spinoj. Kstati, kak ty predpochitaesh, chtoby ia tebia teper nazyval? negromko Pointeresovalsia ia, obdumyvaia odnovremenno mysl o tom, chto neploho by bylo Soobshchit o riverah v Sovet GFM, kogda budu vozvrashchat goluboj bankos. Glavnoe dengi. \nIa znal, chto on sdelal. Ego samoobladaniiu mozhno bylo pozavidovat, etot mirok Byl emu pochti domom, i znanie obstanovki znachitelno ekonomilo emu nervy. Kross po Gorodu izmotal menia, zastaviv vylozhitsia bez ostatka, Zapalennye legkie vse eshche hripeli pri kazhdom vzdohe, ia hvatal vozduh rtom Kak ryba, vybroshennaia na bereg, samochuvstvie bylo iskliuchitelno Toshnotvornym, i v dushe ia besilsia ot togo, chto nichego ne mogu podelat. Net, ne nado ob etom dumat. ejisuminyon VVFcRlhQUVh0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}