{"category": "spam", "to_address": "producttestpanel@flax9.uwaterloo.ca", "from_address": "AscendClick <AscendClick@ascendclick.com>", "subject": "Get Funds Fast", "body": "\n\n\n\n\n\n\nIf you are unable to view this important page, please Refresh this.\n*For Outlook users, if the below images are not viewable, right click on the\nimage and select, 'Add Sender to Safe Senders List'.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCash Advance\nOur cash advance offers provides consumers with a fast and easy way to receive a payday advance of\n\tup to 1500 USD. A cash advance, or a payday loan, can help you if you are in a bind by using your\n\tupcoming paycheck as a guarantee for repayment. The short application form is completely safe and\n\tconfidential and requested funds are deposited directly into their bank account within 24 hrs. Our\n\tservice is a quick way for people to get the money they need for unexpected expenses and emergencies such as:\n\nA bill that is due that can risk hurting ones credit rating.\nBeing in danger of bouncing a check and avoiding overdraft fees.\nAn emergency medical bill that must be paid.\nRent, groceries and other necessities.\n\nA cash advance is a short-term, unsecured loan, usually granted for a smaller sum of money\n\t(less than 1500 USD). Taking out a cash advance is faster for a smaller amount of cash because\n\tthere is no paperwork and approval process involved with which you would have to deal with longer-term\n\tbank loans. In the past, this can usually be done at a small check-cashing outlet or a pawnshop,\n\tbut recently, more and more online lenders are getting involved with cash advance services. To\n\texplain how this works, the borrower first promises to repay the loan from his or her next paycheck.\n\tThe loan is then made when the borrower either gives the lender a check or a debit authorization for\n\tthe amount borrowed plus the finance charge. The lender consents to hold the check or authorization\n\tuntil the borrower's next payday. When payday comes, the lender may either cash the check, or the\n\tborrower may get his or her check back by paying the full loan amount and finance charge. \nPlease visit our site where you can receive further information and learn more about our services.\nThank you\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}