{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJuly 5, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESFireworks Spark Deadly Shootings\nPolice in Cleveland say a man apparently angry about fireworks at a noisy Fourth of July party shot three people to death\n                        and wounded two others. Another man was shot to death during an argument at a fireworks celebration near Seattle. More...Watch: Fireworks: What Not To Do\n• West Still Sizzles Under Record Heat\n                     \t\t\t\t\t| Watch• Scores Of Children Rescued Off Irish Coast• U.K. Police Probe Alleged Bomb-Making Home\n                     \t\t\t\t\t| WatchU.S.14 Hurt In Colorado Building Collapse\nA 14-story building under construction in a Denver suburb collapsed, seriously injuring four workers, a fire department spokesman\n                        said. Ten others suffered minor injuries. More...\n• Will 7/7/07 Be Your Lucky Day?• Third Child Pulled From Submerged Van Dies• West Still Sizzles Under Record Heat\n                     \t\t\t\t\t| Watch• More StoriesWorldScores Of Children Rescued Off Irish Coast\nThe Irish Coast Guard rescued about 110 children from the sea after a sudden squall hit their flotilla of dinghies, Irish\n                        officials said. More...\n• Explosions Rock Besieged Pakistani Mosque• U.K. Police Probe Alleged Bomb-Making Home\n                     \t\t\t\t\t| Watch• Al Qaeda Deputy Defends Iraqi Insurgents\n                     \t\t\t\t\t| Watch• More StoriesPoliticsBush Spokesman: Clintons Have \"Chutzpah\"\nThe White House took a shot at former President Clinton and his wife, Sen. Hillary Rodham Clinton, for criticizing President\n                        Bush's decision to commute the prison sentence of former aide \"Scooter\" Libby. More...\n• Cost Of Edwards' Haircut Hits $1,250• Meditating Iowans At Peace With Obama• Al Gore's Son Released From Jail\n                     \t\t\t\t\t| Watch• More StoriesHealthPanama Links Deaths To Contaminated Meds\nA top Panamanian prosecutor says tests show at least 94 people have died from taking medicine contaminated with diethylene\n                        glycol since July 2006. Another 293 deaths are under investigation. More...\n• The Losing Fight Against Childhood Obesity• Screening May Lower Fertility For Some\n                     \t\t\t\t\t| Watch• China To Bolster Toothpaste Rules\n                     \t\t\t\t\t| Watch• More StoriesSciTechWho's The Chattier Sex?\nThose who think women talk and talk and talk when compared to men should think again. New research suggests that when you\n                        actually count the words, there isn't much difference between the sexes. More...\n• Tahoe Fire May Hurt Lake's Health\n                     \t\t\t\t\t| Watch• China To Deny Bank Loans To Polluters\n                     \t\t\t\t\t| Watch• Turtles Test New Wireless Technology• More StoriesBusinessWorried Over A Possible Job Relocation?\nSo your employer has asked you to move to another job in another city. Resist saying yes immediately. It's easy to underestimate\n                        the adjustment that a move will require. More...\n• Senate Bill Tries To Revamp U.S. Tourism• Is Your Home Underinsured?\n                     \t\t\t\t\t| Watch• \"Hot Fuel\" Costing Consumers Big Bucks?\n                     \t\t\t\t\t| Watch• More StoriesEntertainmentBritney Explains Umbrella Attack\nBritney Spears says she whacked a paparazzi's car with an umbrella a few months ago because she was preparing for a movie\n                        role. More...\n• Longoria-Parker Wedding Under Wraps• Aguilera Reportedly Expecting First Child\n                     \t\t\t\t\t| Watch• Mandy Moore Balances Music And Movies\n                     \t\t\t\t\t| Watch• More StoriesOpinionBoys Should Be Girls\nCBS' Dick Meyer notes that women do better in college and right after it, and suggests that the Life Potato Syndrome\n                        may be to blame. It's only the gender gap that has men earning more than women later in life.  More...\n• Can Bush Raise His Ratings?• Supreme Uncertainty\n                     \t\t\t\t\t| Watch• Growing Out Of Control\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Recipes: Chefs Cook Up Firefighters' Fundraiser\nThey hope Sunday's dinner and auction will raise $300,000 for the families of the firefighters lost in the blaze in a Charleston\n                        furniture showroom last month. One of the chefs, Bob Waggoner, discussed the effort on The Early Show. More...Watch: S.C. Fire Fundraiser Recipes\n• EARLY SHOW: Curbing Teen Driver Risks\n                     \t\t\t\t\t| Watch• CBS Evening News: Full Swing In Iowa\n                     \t\t\t\t\t| Watch• CBS Evening News: Something Fishy At Fishing Tournaments\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nAl Gore's Son Arrested Al Gore III, son of the former vice president, was charged with possession of marijuana and pharmaceutical drugs for which\n                                    he did not have prescriptions. Michelle Miller reports.\nTOP VIDEOS\nTerror Ruled Out In Derailment\nScorching Heat Out West\nU.K. Reduces Threat Level\n'Big Brother's' Big Night\nGeorgian Sets World Record\nIs Santa's Workshop In China?\nMobile Review: Goo Goo Dolls\nRains Continue To Plague Texas\nHousekeeping 101\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesJoin Scott Pelley, as he gets a glimpse of India's diminishing wild tiger population. This Sunday, 7 p.m. ET/PT.48 H!\n ours Mys\nteryDouble Feature:\"A Knock On The Door,\" beginning at 9 p.m. ET/PT. Then at 10 p.m. ET/PT, \"Searching\n                           For Secrets.\"\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}