{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "\"Richard Lyons\" <richard@the-place.net>", "subject": "Re: Etch on a Thinkpad T23", "body": "On Sun, May 6, 2007 04:58, Jonathan Yavner wrote:\n>> Well, I for one would be interested if I had a T22.\n>\n> Where would you look for such a product?  How would a seller of such a\n> product find you without offending you with his crass commercialism?\n\nThat is a good question.  Probably the answer is that Debian needs a wiki\nspecific to items like this and users' crib-sheets on how various hard-\nware-specific issues have been solved.  It could be indexed by hardware\nname and any useful crossindexing.  By using a wiki, the community would\nbe able to keep it indexed and up-to-date.\n\n>\n>> the sound system and modem\n>\n> I haven't tried etch on my 600E, but to make sound work under Fedora\n> Core 2 I had to put these in /etc/modprobe.conf:\n>     alias snd-slot-0 snd-cs4236\n>     alias snd-card-0 snd-cs4236\n>     options snd-cs4236 port=0x530 irq=5 dma1=1 dma2=0 mpu_port=0x330\n> mpu_irq=7 cport=0x538 fm_port=0x388 isapnp=0\n\nThanks for that.  I am going to try it when I get a moment.\n\n> I haven't bothered with the modem, but ThinkWiki says there is a driver:\n>     http://www.thinkwiki.org/wiki/MWave_MDSP3780\n\nThat is different from the one I tried. Still, modems are history now\nunless I want to run hylafax. Actually the 600E spends most of its time\nin a house with no landline. And Fax is history too, anyway.\n\n>> if someone had a DVD that would solve any or all of  those problems, I\n\n> I'm underemployed right now and can afford to spend some time to create\n> such a disk for Etch on a 600E, but I'd like to get several hundred\n> dollars for such work, which means I would need to find a bunch of\n> customers to share the cost.  The 600E is so old now that I doubt I\n> could find enough buyers to make it worthwhile.  Also, my 600E is\n> failing (which is why I bought the T23).  Only one of the RAM slots is\n> still working--Fedora runs poorly with only 96 MB!\n\nHehe, yes.  They are getting old.  IMO, your talents would be better\nused on something more current.  I was not really thinking it through\nwhen I epressed keenness on the idea.  It is worth doing for reasonably\nrecent kit, but the 600E, for all that it has a better keyboard than any\nother laptop I have tried, is geriatric now.\n\n> Would you be willing to take a \"dumb installer\" that erases your hard\n> drive and installs a tuned copy of Etch?  That would require backing up\n> all your personal data beforehand and restoring after.  Also, the 600E\n> usually shipped with a CD-ROM drive, not DVD-ROM, which is too small\n> for even the basic set of packages, so some disk-swapping would be\n> needed.\n\nThat's true.  Yes, that could be a route.  Backing up via nfs over\nethernet will work easily enough. But even that sounds like a waste\nof your time unless there are a lot of us dinosaurs around.  On balance,\nI'll go with trying the modprobe configuration and let the rest slip. I\nuse the Acer Aspire 1640Z for almost everything now, so I'd better\nconcentrate on solving _it's_ sound and the intractable pppd/dhclient\nincompatibility.\n\nThanks for your help.\n\n-- \nrichard\n\n\n\n-- \nTo UNSUBSCRIBE, email to debian-laptop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}