{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Anthony W. Youngman\" <debian@thewolery.demon.co.uk>", "subject": "Re: Final text of GPL v3", "body": "In message <20070630010521.61eed939.frx@firenze.linux.it>, Francesco \nPoli  writes\n>>   A patent license is \"discriminatory\" if it does not include within\n>> the scope of its coverage, prohibits the exercise of, or is\n>> conditioned on the non-exercise of one or more of the rights that are\n>> specifically granted under this License.  You may not convey a covered\n>> work if you are a party to an arrangement with a third party that is\n>> in the business of distributing software, under which you make payment\n>> to the third party based on the extent of your activity of conveying\n>> the work, and under which the third party grants, to any of the\n>> parties who would receive the covered work from you, a discriminatory\n>> patent license (a) in connection with copies of the covered work\n>> conveyed by you (or copies made from those copies), or (b) primarily\n>> for and in connection with specific products or compilations that\n>> contain the covered work, unless you entered into that arrangement,\n>> or that patent license was granted, prior to 28 March 2007.\n>\n>This date is arbitrary.  It limits the effectiveness of the protection\n>against \"discriminatory\" patent licenses.\n\nThis date is NOT arbitrary. It is AFTER this clause was first discussed.\n\nThere are two reasons for this. Firstly, many jurisdictions implicitly \nor explicitly forbid retro-activeness. Without this date, there's a good \nchance the clause would be declared legally invalid.\n>\n>This clause fails to protect recipients from patent lawsuits, whenever\n>the related \"discriminatory\" patent license was granted, or the related\n>nasty arrangement was in place, prior to 28 March 2007.  In those cases,\n>the work fails several DFSG, if the patent licensed in a\n>\"discriminatory\" manner is actively enforced and infringed by the work.\n>It's not a Freeness issue, unless and until there are actively enforced\n>patents infringed by the work and licensed in a \"discriminatory\" manner\n>prior to 28 March 2007.\n>\nIt isn't meant to protect recipients. It's intended to stop \ndistributors.\n\nIf you are a party to a \"discriminatory\" agreement, YOU are liable to \nprotect downstream, or YOU CAN'T DISTRIBUTE. THAT is the point of that \nclause - if you want to distribute, you have the responsibility to make \nsure downstream can distribute too. You can't negotiate protection for \nyourself (or your customers) and leave everybody else at risk.\n\nPatents are a risk factor for Americans. This clause just says you have \nto share the risk equally, if a distributor negotiates unequal \nprotection then it's a violation of v3.\n\nCheers,\nWol\n-- \nAnthony W. Youngman - anthony@thewolery.demon.co.uk\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}