{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Littlefield, Tyler\" <compgeek13@gmail.com>", "subject": "Re: switching from amd to p3", "body": "got it. thanks for the help. :)\nThanks,\n~~TheCreator~~\n[My programs don't have bugs; just randomly added features]\nmsn:\ncompgeek13@gmail.com\naim: st8amnd2005\nskype: st8amnd127\nvertigo head coder\nweb: tysdomain.com\n----- Original Message ----- \nFrom: \"Scott Berry\" \nTo: \"'Speakup is a screen review system for Linux.'\" \n\nSent: Sunday, June 17, 2007 10:19 AM\nSubject: RE: switching from amd to p3\n\n\n> Just one more thing to add Tyler.  Some of the more modern Bios also can \n> use\n> f2 to enter the bios setup.\n>\n> Scott\n>\n>\n> -----Original Message-----\n> From: speakup-bounces@braille.uwo.ca \n> [mailto:speakup-bounces@braille.uwo.ca]\n> On Behalf Of Spie Sutherland\n> Sent: Sunday, June 17, 2007 12:07 AM\n> To: Speakup is a screen review system for Linux.\n> Subject: Re: switching from amd to p3\n>\n> Tyler, I believe disk boot failure is a BIOS error, not a linux error.\n> It can happen if there is no drive, or the drive is not bootable, it\n> could also happen if the BIOS boot options are not set properly,\n> usually listed as boot priority, you usually want something like\n> floppy, cdrom, ide0, ide1 boot priority. If the cables all seem\n> okay I the next thing to check would be if the BIOS is seeing\n> the drive. On modern BIOS the drives will usually be set to\n> auto but if you press F8 it will detect the drives and show you\n> them in BIOS (may be a different function key for a different\n> BIOS). Confirm that BIOS is seeing the drive, and showing it\n> as master, then check the boot priority settings in BIOS to\n> make sure IDE0 is in the boot priority list. There are also\n> settings in BIOS for the hard drive DMA mode, the lowest\n> mode being PIO0, which is original IDE. If still not booting\n> try setting that the lowest possible mode. The highest mode\n> is probably PIO5 or Ultra DMA, or UDMA 133.\n>\n> At this point, after checking BIOS, if it sees the drive as\n> master, IDE0 is in the boot list, the DMA mode is lowest\n> PIO0, and it still won't boot, I would suggest putting it\n> back in the original machine and making sure it boots.\n>\n> If it doesn't boot there I would check the partition table\n> using fdisk or cfdisk or similar, check the bootable flag and\n> make sure a partition is marked as bootable, and it's the\n> correct partition, the one with grub installed. You can do\n> this by booting from a linux CD and running fdisk -l or\n> cfdisk.\n>\n> If BIOS on target system is seeing the drive as master and\n> the drive will boot in original machine, then I'd say its time\n> to try a different drive in target motherboard to make sure\n> the IDE controller is working okay.\n>\n>  -- Spie\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n>\n> -- \n> No virus found in this incoming message.\n> Checked by AVG Free Edition.\n> Version: 7.5.472 / Virus Database: 269.9.0/852 - Release Date: 6/17/2007\n> 8:23 AM\n>\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}