{"category": "spam", "to_address": "\"Mike Craig\" <the00@plg.uwaterloo.ca>", "from_address": "\"Bernice\" <Bernice@qatarvoice.com>", "subject": "So you asked for another email from Ms. Patrick, yeah?", "body": "EVER DREAM OF MIND-BLOWING LOVE-MAKING THAT NEVER FAIL TO SATISFY?\n\nWell, you don't need to dream anymore. At last there is a solution to all\nyour bedroom setbacks. The Vibrating Ring is the latest toy taking the world\nby storm. It's fun, safe, easy-to-use, and it's available now. \n\nThe Vibrating Ring features a raised tickler to stimulate her externally,\nwhile the expandable silicone ring sends deep vibrations up the shaft for\nboth his and her pleasure. If you want unbeatable results every time, you\ncant go past this amazing new product. \n\nThe Vibrating Ring expands to fit any size and is designed to massage those\noften neglected areas. If you are ready to experience a fantastic love-life,\nthen this is the perfect product for you.\n\n\nLoads of fun, so easy to use, will Bring a Smile every time.\nhttp://www.nightsoffun.com\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nright, and don't want chit-chat. You want to we'll talk tomorrow. Trust me,\nit'll be that way.\" He turned and started go. Peer LaRue jumped toward him\nbehind. Remo took the man's knife away threw it deep into the of big spruce\nten feet up from ground, catching the back collar Peer LaRue's shirt, and\nthe squirming, roaring, angry tree-yanker to the tree. * Brack was sitting\nan overstuffed chair in of the roaring fireplace when \ngot back to the A-frame at Camp. He looked up as Remo in through the front\nwell, well,\" he \"The tree reclamation technician. How's it going- find any\ntrees to reclaim-\" \"Brack, I'm to let that go this Remo said. \"You got\nworking for you Dock LaRue or something that-\" \"Dock- No, Piere. Right. He's\nour He calls himself Remo said. \"What about he's stuck to tree \nabove the copa-ibas, and somebody ought to him down before freezes to\ndeath. And somebody off the gasoline engines. don't how long those can live\nin the but guess you want to fix was already rising his chair. \"Joey,\" he\ncalled. Joey came out of her room. She was fully dressed. \"Trouble up at \ntree site,\" Brack said. better go.\" They moved to coat on the wall and down\nheavy plaid jackets. \"Thanks, O'Sylvan,\" called back. \"My pleasure.\" Brack\nand Joey went to the door, said, \"One other thing.\" Brack turned. \"Yeah-\"\n\"There's two guys up there. think Stacy ought to run an identity on them.\nThey're the two turned off the heaters.\" \"Dead- How-\" Remo didn't feel\nexplaining. \"A suicide\n\n\ncheck you later.\n\n\n\nBernice\n\n\n"}