{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Alex Snow <alex_snow@gmx.net>", "subject": "Re: three hds? is this possible?", "body": "Modern BIOS's (past 10 years or so) are pretty good at autodetecting \nhardware.  If all else fails, make sure all the ide devices in the \nbios are set to audo, or do a CMOS clear to make it redetect \neverything.  Also some bios's (award comes to mind) have an option \ncalled hdd autodetect that you should run.\nOn \nThu, May 17, 2007 at 06:02:53PM -0600, Littlefield, Tyler wrote:\n> ok. I got my 20 gb set to master. For the bios settings, do I just set it\n> under cd? or where do I need to change it at?\n> Thanks,\n> ----- Original Message ----- \n> From: \"Spie Sutherland\" \n> To: \"Speakup is a screen review system for Linux.\" \n> Sent: Thursday, May 17, 2007 7:01 PM\n> Subject: Re: three hds? is this possible?\n> \n> \n> > On most IDE motherboards you have two IDE controllers,\n> > each can support one master and one slave on a single cable.\n> > You may need to set jumpers on the actual drives to get them\n> > set up correctly, one jumpered as master, one jumpered as\n> > slave on each controller.\n> >\n> > The jumper setting info will be labeled on the drives.\n> > You may also need to check the BIOS settings and make\n> > sure that all four drives are enabled, and on older BIOS you\n> > may need to set them to the correct setting for the drive,\n> > while on newer BIOS usually setting them all to AUTO will\n> > auto-detect the drives and configure the BIOS appropriately.\n> >\n> >   -- Spie\n> >\n> > _______________________________________________\n> > Speakup mailing list\n> > Speakup@braille.uwo.ca\n> > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n-- \n> I've hacked the Xaw3d library to give you a Win95 like interface and it\n> is named Xaw95. You can replace your Xaw3d library.\nOh God, this is so disgusting!\n\t-- seen on c.o.l.development.apps, about the \"Win95 look-alike\"\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}