{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Google Alerts <googlealerts-noreply@google.com>", "subject": "Google Alert - bush", "body": "\nGoogle News Alert for: bush\n\n\nBLOG BITS: Bumpy ride for McCain; Bush on terrorism\nKansas City Star - MO,USA\nI know it depends upon where \"home\" is, but, still, shouldn't recent\nevents have demonstrated that this is an idiotic argument for Bush\nto make?\n\nSee all stories on this topic\n\n\nWhat Was Bush Thinking?\nWashington Post - United States\nBy Dan Froomkin President Bush apparently doesn't feel that the\nAmerican public deserves a detailed explanation of why he chose to commute\nformer vice ...\n\nSee all stories on this topic\n\n\nReleasing Libby protects Bush & Cheney\nSeattle Post Intelligencer - USA\nBy commuting Scooter Libby's sentence, President Bush is also\nprotecting himself and Vice President Dick Cheney. I asked former\nAmbassador Joe Wilson what ...\n\nSee all stories on this topic\n\n\nIraq like historic US war, says Bush\nSydney Morning Herald - Sydney,New South Wales,Australia\nTHE US President, George Bush, has compared the war in Iraq with the\nUS war for independence in his Fourth of July speech. Like the\nrevolutionaries who ...\n\nSee all stories on this topic\n\n\nPRO-CON: Should Bush have commuted Libby's sentence? YES\nKansas City Star - MO,USA\nPresident Bush on Monday commuted the 30-month sentence handed down\nto Lewis \"Scooter\" Libby, which allows the former vice presidential\nchief of staff to ...\n\nSee all stories on this topic\n\n\nAnti-Bush 'Impeachment Center' opens in Los Angeles\nSan Jose Mercury News - CA, USA\nAP LOS ANGELES--A storefront \"impeachment headquarters\"\nemblazoned with American flags opened July 4 with a mission to remove\nPresident Bush and Vice ...\n\nSee all stories on this topic\n\n\nPresidents' men get off the hook\nStuff.co.nz - Wellington,New Zealand\nBut what is clear is why United States President George W Bush this\nweek commuted Lewis \"Scooter\" Libby's sentence. In the US\nthere are two types of ...\n\nSee all stories on this topic\n\n\nBush's white lie about Putin\nInternational Herald Tribune - France\nAfter fishing off Kennebunkport, dining on Maine lobster, and discussing a\nwide range of issues, President George W. Bush and President\nVladimir Putin of ...\n\nSee all stories on this topic\n\n\nBush's supreme moment\nTrinidad & Tobago Express - Port-of-Spain,Trinidad and Tobago\nGeorge W Bush had a terrible, horrible, no good, not-so-bad week.\nI'm riffing, in case you haven't had the pleasure of reading it, on\nthe children's book ...\n\nSee all stories on this topic\n\n\nBush's Iraq strategy suffers new GOP defection\nLos Angeles Times - CA,USA\nBy Noam N. Levey, Times Staff Writer WASHINGTON -- President\nBush's Iraq strategy suffered a new Republican defection\nThursday as New Mexico Sen. ...\n\nSee all stories on this topic\nGoogle Blogs Alert for: bush\n\n\nCNN's Romans called George HW Bush \"judicious with pardons ...\n\nBush's decision to commute former vice presidential chief of staff I. Lewis \"Scooter\" Libby's 30-month prison term, CNN correspondent Christine Romans asserted that President George HW Bush \"was judicious with pardons\" because he ...\n\n\nMedia Matters for America - http://mediamatters.org/\n\n\n\nBush's Revolutionary War\n\nBush sought to introduce a more rousing historical analogy on July 4th when he evoked America's War of Independence in a speech to National Guard troops. \"Like those early patriots, you're fighting a new and unprecedented war -- pledging ...\n\n\nTIME: The Ag - http://time-blog.com/theag/\n\n\n\nAnother GOP Senator breaks with Bush on Iraq\n\nBy Joe Sudbay (DC)(John Aravosis (DC))\n\nNew Mexico's Republican Senator, Pete Domenici, publicly broke with George Bush over Iraq today. He wants a new strategy immediately. Like Dick Lugar who broke with Bush last week, Domenici is one of the Republican old-timers: ...\n\n\nAMERICAblog: A great nation deserves... - http://www.americablog.com/\n\n\n\nHalberstam: Bush is No Truman\n\nBy Devilstower\n\nVanity Fair is this month publishing an article written just before Halberstam's demise, in which the journalist-historian tackles the last refuge of the Bush loyalist: the idea that Bush will be vindicated by history. ...\n\n\nDaily Kos - http://www.dailykos.com\n\n\n\nTin-Plated Liberal Morality\n\nBy Mark Noonan\n\nThis is what passes for courage and morality amongst our liberal friends: NEW HAVEN, Conn. (AP) - When the United States invaded Iraq more than four years ago, war opponent David Gross asked his bosses for a radical pay cut,...\n\n\nBlogs for Bush: The White House... - http://www.blogsforbush.com/\n\n\n This as-it-happens Google Alert is brought to you by Google.\n \nRemove this alert.\n  Create another alert.\nManage your alerts.\n\n"}