{"category": "ham", "to_address": "ip-health@lists.essential.org, healthgap@critpath.org,\n   aidsdrugs@lists.riseup.net, thaiFTA@lists.riseup.net, e-drug@healthnet.org", "from_address": "B.Baker@neu.edu", "subject": "[Ip-health] Bangkok Post, Specious Arguments on Thailand's Compulsory Licensing", "body": "\nBangkok Post, April 27, 2007\n\nOPINION / SPECIOUS ARGUMENTS ON THAILAND'S COMPULSORY LICENSING\n\nWorld's premier law firm goes to bat for Abbott\n\n\nBy Brook K Baker, Sean Flynn And Judit Rius Sanjuan\n\n\nBaker & McKenzie proclaims itself as the world's leading global law firm,\nso it is no surprise that this 3,400-attorney firm with US$1.5 billion in\nannual billings would go to bat for another big enterprise, Abbott\nLaboratories, now locked in an intense battle with Thailand over the\nlegality and propriety of a government-use licence issued for\nKaletra/Aluvia (lopinavir/ritonavir), a key Aids medicine, issued on Jan\n24, 2007, as seen in the article Compulsory drug licences violate world\ntrade treaty by Peerapan Tungsuwan and William McKay published in\ntheBangkok Post on April 23, 2007.\n\n\nContrary to its reputation, and more likely for the benefit of its Big\nPharma clients including Abbott, Aventis, Pfizer, Bristol-Myers Squibb, and\nEli Lilly, the Baker & McKenzie attorneys have misread and misrepresented\nthe WTO TRIPS Agreement and wrongfully concluded that Thailand's licences\nare unlawful.\n\n\nThe authors make four TRIPS-related arguments, all of which mischaracterise\nthe law.\n\n\nMs Peerapan and Mr McKay first challenge the proposition that Thailand is\njustified in issuing compulsory licences on the grounds that \"public health\ninterest must come before commercial interests\", belittling those grounds\nas comparable to acquiring beds in private hospitals.\n\n\nThe authors are fully capable of reading Article 31 of the TRIPS Agreement,\nwhich contains no express limitation whatsoever on the grounds upon which a\ncompulsory licence can be granted. The primacy of public health and public\nhealth's validity as a ground for licensing, for cost-saving reasons or\notherwise, was confirmed in the Doha Declaration on the TRIPS Agreement and\nPublic Health of November 2001, especially in paragraph 5(b) which reads:\n\"Each Member has the right to grant compulsory licences and the freedom to\ndetermine the grounds upon which such licences are granted.\"\n\n\nThus, if Thailand wants to conserve resources in its world-renowned\nHIV/Aids treatment programme, that decision is 100% lawful.\n\n\nNext, the two Baker & McKenzie lawyers argue that Thailand's government-use\nlicences are not for \"public, non-commercial use\" because they have been\ngranted to the Government Pharmaceutical Organisation, a publicly-owned\nmanufacturer and drug distribution agency. Since the licence is allegedly\nnot for public, non-commercial use, the authors argue that Thailand was\nrequired to negotiate on commercially reasonable terms with the patent\nholder before issuing the licence and that it failed to do so.\n\n\nIn making this argument, they acknowledge, as they must, that prior\nnegotiations are not required for public, commercial use licences; they\nfail to acknowledge, however, that Thailand had in fact engaged in\nfruitless discussions with patent holders since 2005.\n\n\nContrary to the authors' argument, the \"public, non-commercial use\"\nlanguage of Article 31(b) of the TRIPS Agreement is focused on the \"use\"\nmade of the licensed product, not who the manufacturer or distributor is.\n\n\nHere, the use is clear _ Thailand will only use the licensed\nlopinavir/ritonavir within its national public health insurance schemes.\n\n\nIndeed, Abbott will retain its exclusive rights to sell in Thailand's small\nprivate sector where it can continue to charge its exorbitant monopoly\nprices. As apologists for Abbott, the authors would have us believe that\nlicensees such as the GPO cannot make medicines for profit (not true), or\nthat it is cheating when a locally-owned public manufacturer makes or\nimports a licensed product from abroad (nothing could be further from the\ntruth). The compulsory licensing provisions of Article 31 permit licences\nto be granted to public or private, and domestic or foreign entities.\n\n\nThe author's third argument is that the .05% royalty rate is unlawful\nbecause it is not adequate and because it does not take into account the\n\"economic value of the authorisation\". The authors continue with a truthful\nobservation that customary royalty are higher elsewhere. While it is true\nthat royalty must be set fairly, TRIPS merely requires a review remedy if\nthe patent holder feels the royalty is inadequate.\n\n\nSection 51 of the Patent Act provides for such an appeal, and in fact\nThailand has invited Abbott to several meetings to discuss the royalty.\nInstead of appealing, however, Abbott has now decided to boycott royalty\nrate setting discussions.\n\n\nThe authors' final argument about the \"individual merits\" of licences is\nplainly preposterous. Once again arguing that prior negotiations are\nrequired, the high-powered lawyers argue that Thailand cannot consider any\nlicence on its individual merits if it has not engaged in \"prior\nconsultations with the affected party\".\n\n\nContrary to their claim, Thailand unsuccessfully engaged in such\ndiscussions for several years. More to the point, however, the TRIPS\nAgreement expressly permits issuance of licences for emergencies, matters\nof extreme urgency, and public, non-commercial use without prior\nnegotiations (Article 31(b)). Pursuant to this international standard and\nin compliance with its own law, 28 US C sec 1498(a) and US Executive Order\n12889 , the US and its contractors routinely issue public, non-commercial\nuse licences without prior notice or negotiation, for example to military\nhardware patents for its favoured defence contractors Lockheed-Martin and\nHalliburton.\n\n\nThese highly skilled lawyers are not stupid and they do know how to read.\nThey must be well aware of the authoritative scholarly interpretations of\nthe TRIPS Agreement, which clearly do not support their specious arguments.\n\n\nHowever, high fees can buy twisted logic. Here, the false arguments\nthreaten to obscure the legality of Thailand's compulsory licences and by\nnecessary extension threaten access to life-saving medicines.\n\n\nIn the US legal system, we have sanctions for frivolous arguments. Here the\nauthors are seeking to mislead the court of public opinion rather than a\njudicial tribunal. That may make their offence even worse.\n\n\nProfessor Brook K Baker is with Health GAP (Global Access Project),\nNortheastern University School of Law; Sean Flynn is Associate Director of\nthe Programme on Information Justice and Intellectual Property, Washington\nCollege of Law; and Judit Rius Sanjuan is with Knowledge Ecology\nInternational (KEI) in Washington DC. Professor Brook K. Baker, Health GAP\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}