{"category": "ham", "to_address": "Ron Goral <beginner.perl@uponthemountain.com>", "from_address": "\"Mumia W.\" <mumia.w.18.spam+nospam@earthlink.net>", "subject": "Re: Leaving this list.", "body": "On 06/05/2007 06:47 AM, Ron Goral wrote:\n> I am leaving this list even though I've been here for several years. While I\n> find the information and ideas exchanged very helpful, I am fully disgusted\n> by the amount of spam I receive. Over this last weekend, of 172 emails I\n> received from this list, 52 were spam. That's nearly 1 in every 3. I am told\n> that I get this spam simply because I sent a couple emails to the list and\n> that exposed this exclusive address to these spammers. Well, say what you\n> will, but I feel it is the list manager's job to protect me from this crap.\n> Since they either can't or won't, I'm signing off and deleting this mailbox.\n> \n> \n> \n\nI almost never get spammed to the address I use for this list. Spammer's \ndon't like to send to e-mail addresses that have certain words in them, \nand my address has them both.\n\nAnyway, I must disagree with you when you say it's the list-manager's \nresponsibility to protect you from spam. No, your mailbox is your \nresponsibility.\n\nUnsubscribing deleting the mailbox and resubscribing with a better \naddress is the smart option.\n\nThere are several things you can do as part of your responsibility to \nprotect your mailbox from spam:\n\n1) Use a mailbox that's specifically set up to receive mail only from \nthis list. It's filters would send any message that doesn't have \n\"List-Id: \" to the trash.\n\n2) Subscribe with an e-mail address that spammers don't like to \nspam--like I do.\n\n3) Use a mailreader that has better junk filters such as Mozilla \nThunderbird. You can obtain it from here: http://www.mozilla.com/\n\n4) Unsubscribe.\n\nWhatever you do, you don't use an \"exclusive e-mail address\" to post to \na publicly accessible mailing list that's archived on the web.\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}