{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Elvis Stanton\" <wuferoticaondemandpab@eroticaondemand.com>", "subject": "Get out of the obese crowd", "body": "\nLess weight - more pleasure and joy\n\n\n\n\n\nAnatrim – The very up-to-date and most exciting product for corpulent people is made available now – As you could see on CNN\n\n\n\nDo you understand that redundant body kilograms kill a plenty of people every year? We believe that you hate the unsightly appearance of people like those and the social bias against them. \n\nOr, maybe, you’ve not the will to resist a pressure of baneful eating habits of yours. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nIntroducing Anatrim, the new product for the elimination of your body’s extra weight. The most amazing thing is that Anatrim raises the quality of your life, repressing your feeling of hunger and giving you joyful spirit. Read what people write about this product:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of watching TV and gorging everything close at hand \n\n\nI became keen on exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I have a great shape now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nRita R., San Diego\n\n\n\n\n\n\n\"I tried some passive weight burning, you know, but all came in vain. I was rather difficult for me to restrain my ravenous appetite. \n\n\nOnce I heard on Anatrim in the media advertisement and it brought a great influence on me.\n\n\n I had attempted taking it, and my wife told me that I had changed for the better since then, 4 months later. \n\n\n28 pounds have gone away and I keep still losing them! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nRikky Martin, Bellevue WA\n\n\n\n\n\nAnatrim gives you an opportunity to understand you doesn’t have such a great need for the constant eating. It lifts your mood up, gives you extra energy, and attacks needless kilos. Great thanks to its mighty newly-elaborated formula!!\n\n\n\nWorm out latest news!\n\n\n\n"}