{"category": "spam", "to_address": "smiles@speedy.uwaterloo.ca", "from_address": "Online Cyber <onlinecyber@ig.com.br>", "subject": "FINAL PAYMENT RELEASE.", "body": "Dear Winner\n\nWe Apologies, for the delay of your payment and all the\nInconveniences and Inflict that we might have indulge\nyou through.\n\nHowever, we were having some minor problems with our\npayment system, which is Inexplicable, and have held us\nstranded and Indolent, not having the Aspiration to\ndevote our 100% Assiduity in accrediting foreign\npayments.\n\nWe apologies once again from the Records of\noutstanding winners due for payment with {ONLINE CYBER\nPROMOTION}your name and particular was discovered as\nnext on the list of the outstanding winners who have not yet received \ntheir payments.\n\nEmails were selected anonymously through a computer ballot system from over 35,000 companies and 70,000 individual e-mail addresses all over the world and your e-mail address emerged as the winner of the 11 selected email address. It is promoted and sponsored by Orient software corporation (Orient Networks) in collaboration with the Online Cyber International.\n\nI wish to inform you now that the square peg is now in\nsquare whole and can be voguish for that your payment\nis being processed and will be released to you as soon\nas you respond to this letter.\n\nAlso note that from our record in our file, your outstanding winning payment is US$950.215.00 (NINE HUNDRED AND FIFTY THOUSAND,TWO HUNDRED AND FIFTEEN OLLARS).Payment will be made to you in a certified bank draft or wire transfer into a nominated bank account of your choice, as soon \nas you get in touched with.\n\nMr.John Nicole\nE-mail: mr.johnnicole@yahoo.co.uk\n\nProvide him with the following details, as this will\nenable him to process and release of your cash prize\nwithout any delay.\n\nYour\nFull\nName:..................................\nTelephone and fax\nNumbers:...........\n..............\nResidential\nAddress:...............................\n\nYour urgent reply Mr.John Nicole\nvia e-mail:mr.johnnicole@yahoo.co.uk\nwill effect the speedy release of your cash prize to\nyou within 48hours.\n\nYours Sincerely,\n\nMrs.Jane Philips\n\nVice President.\n\n\n\n"}