{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@speedy.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "circumspect: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Tuesday, April 24, 2007\ncircumspect \\SUR-kuhm-spekt\\, adjective:\nMarked by attention to all circumstances and probable consequences; cautious; prudent.\nWhen the evidence is plentiful and the theories well confirmed, we can be more confident of the historical scenarios we propose; when theories are weak or evidence scarce, we ought to be more circumspect. -- Robert J. Richards, \"You Can't Get There From Here\", New York Times, February 27, 2000\nOne had the feeling, indeed, that he rather enjoyed being mysterious, for although he regularly granted interviews to scholars and journalists after leaving the State Department, he was always circumspect and often cryptic in what he said. -- John Lewis Gaddis, \"Dean Rusk's Personal Truce\", New York Times, July 1, 1990\nSadie is the gracious one, as if being the elder requires that she be circumspect and observe the manners. -- Vincent Canby, \"A Visit With Two Indomitable Sisters,\", New York Times, April 7, 1995\nCircumspect comes from the past participle of Latin circumspicere, \"to look around, to consider carefully,\" from circum-, \"around\" + specere, \"to look.\" The noun form is circumspection.\nDictionary.com Entry and Pronunciation for circumspect\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9406600-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}