{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Anthony W. Youngman\" <debian@thewolery.demon.co.uk>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "In message <200706031700.44488.wjl@icecavern.net>, Wesley J. Landaker \n writes\n>On Sunday 03 June 2007 14:46:12 Anthony W. Youngman wrote:\n>> In message <20070603194630.GE23796@grep.be>, Wouter Verhelst\n>>  writes\n>> >That's wishful thinking, at best. Common knowledge defines \"fee\" as\n>> >\"something involving the transfer of money\". If it isn't, then the GPL\n>> >is also non-free, by the very same rationale: the fact that you are\n>> >required to produce source when so asked if you do distribute binaries\n>> >from source under the GPL means that you are giving up a right (\"the\n>> >right not to distribute any source\") which you might otherwise have,\n>> >which could be considered to be a fee.\n>>\n>> And what about societies without money? \"fee\" does NOT equal \"money\".\n>> Your \"common knowledge\" is not my understanding ...\n>\n>Okay, now I'm really curious. Exactly which \"societies without money\" are\n>you talking about?\n>\nThere's groups of friends who do each other favours.\n\nThere's people who are so poor they have to barter - you're aware, of \ncourse, that in Eastern Europe that was quite normal - cash was \nworthless. Even between businesses and governments - there was a \nthriving barter market worth millions of pounds without any money \nchanging hands at all...\n\nThere's plenty of \"societies\" where I live (England) who have a system \n(yes I know it's like money) where you earn points and trade them.\n\nAnd one only has to look close to home at the world of Free Software, \nwhere code and respect are the items of currency, not money :-)\n\nCheers,\nWol\n-- \nAnthony W. Youngman - anthony@thewolery.demon.co.uk\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}