{"category": "ham", "to_address": "Chas Owens <chas.owens@gmail.com>", "from_address": "Mike Lesser <exceptions@earthlink.net>", "subject": "Re: Paths, Spaces, Getopt::Long", "body": "\nOn Jun 3, 2007, at 1:59 PM, Chas Owens wrote:\n\n> On 6/3/07, Mike Lesser  wrote:\n> snip\n>> I have to assume that paths can be converted easily for use in shells\n>> and such, without resorting to RegEx. Any ideas?\n> snip\n>\n> Aside from the multi argument version of system that Tom has already\n> mentioned, the bigger question is \"Why are you running code outside of\n> Perl?\"  Often people think they need to say things like\n>\n> system \"rm -rf $path\";\n> system \"mkdir $path\";\n> system \"chmod 666 $path\";\n>\n\nMy intent is to keep it within Perl, but I seem to be going further  \noutside of it due to this problem. I'm involved in all sorts of Perl- \nunrelated nonsense.\n\nI've taken another look at HTML::Tidy, and it appears that there are  \nsome critical issues with the version of tidylib that's on Mac OS X,  \nincluding the version number. Tidy's included, which is nice, but  \nfink is intent on keeping the same (old) version.\n\nI figure, get the latest from CVS, but there's been some problems  \nthere (probably due to me having never used it before). Rebuilding a  \nnew version of the lib hasn't been successful yet due to a variety of  \nproblems (but I may solve them tonite). Thus writing an Xsub to it  \n(another thing for me to learn) seems excessive. Now I'm really far out!\n\nRoadblocks everywhere!\n\nI'm thinking that a little RegEx might just serve me better even  \nthough it's reinventing the wheel. This script is intended for use  \nwith a file from a specific vendor, which has it's own quirks (it  \nlooks like someone set it an exporter 10 years ago and then left the  \ncompany) that make no sense. It's not _so_ bad to make some custom  \ncode, is it? Yuck.\n\n\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}