{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"Trade Alert DHNA\"<steve.shults@thisdark.com>", "subject": "DHNA announces 1st time use of Cameras providing a 24/7 overview of mining ", "body": "\n\n\nDHNA announces 1st time use of Cameras providing a 24/7 overview of mining \n\n\n\n\n\nDHNA announces 1st time use of Cameras providing a 24/7 overview of mining \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nDhanoa Minerals Steps Up Modernization Project with \n                              Completed Installation of Satellite Points for Security Cameras\n\n\n\n \n\n\n\n \n\n\n                          Top Tier Security Team Hired to Monitor \n                          Bonanza Mining Properties  24/7 \nTORONTO--(BUSINESS WIRE)--Dhanoa Minerals Ltd. (OTCBB:DHNA - News; FWB:D7Z) announces today that as  part of its modernization program, the company has completed the  installation of satellite points on the company's properties in the  Bella Rica region of southern Ecuador.\n\n \n\n\n\n\n \nWith all the satellite dishes now in place, and operational,  Dhanoa can install security cameras that will enhance security and  efficiency. Lee Balak, President of Dhanoa Minerals, stated, \"Cameras  provide 24-hour streamline visuals of the property while providing  first rate security measures for the company's mining properties. As  far as I know, this is the first time cameras have been used to  provide a 24/7 overview of mining operations which allow shareholders  to view the pouring of gold and silver bars.\"\nThe company also hired a team of security experts to monitor the  gold production, and ensure that the company's refined gold and silver  are properly accounted for. The security team will live on-site to  provide 24/7 surveillance of the properties. \"We keep a close watch on  our properties,\" stated Mr. Balak. \"The addition of on-site security  provides safety measures which will assist us in meeting production  goals, and will ensure that our properties continue to operate  smoothly.\"\nDhanoa Minerals values transparency of operations through  modernization efforts such as these, which will provide a direct  benefit to operations, and production, which will benefit all  shareholders.\nAbout Dhanoa Minerals Ltd.\n'Dhanoa' is a production stage company formed to acquire, explore,  and develop natural resource properties. Activities include  implementation of the Company's business plan and raising capital. The  Company has recently initiated a new program to acquire producing  properties as an addition to its mineral portfolio.\n\n \n \n\n\n \n\n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}