{"category": "spam", "to_address": "<smiles@flax9.uwaterloo.ca>", "from_address": "\"LOTTO Rheinland-Pfalz\" <infolrp2@genevaboards.com>", "subject": "LOTTERY PROMO NOTIFICATION-Contact Your Claims Agent.", "body": "LOTTO Rheinland-Pfalz\nFerdinand-Sauerbruch-Strasse 2\nDE-56073 Koblenz,\nRheinland-Pfalz,\nGermany.\n\nReference Number: LRP/19-DE/9317\nBatch: LRP/06/41\n\nDear Winner,\n\n         LOTTO RHEINLAND-PFALZ WIN NOTIFICATION\n\nWe are pleased to inform you of the result of the just concluded\nannual final draws of the LOTTO Rheinland-Pfalz Program. LOTTO\nRheinland-Pfalz draws was conducted from an exclusive list of\n25,000,000 e-mail addresses of individual and corporate bodies\npicked  by an advanced automated random computer ballot search from\nthe internet as part of our international promotions program which\nwe conduct every year. No tickets were sold.\n\nAfter this automated computer ballot, your e-mail address attached\nto serial number 76-2006 drew the lucky numbers 3-24-1-10-49-17\nwhich consequently emerged you as one of first fifty (50) lucky\nwinners in this category.\n\nYou have therefore been approved for a lump sum payout of\nEUR 1,000,000.00 (One Million EURO) in cash credited to file LRP/19-DE/\n9317. This is from a total cash prize of €50,000,000 (Fifty\nMillion) Euro shared amongst the first fifty (50) lucky winners in\nthis category.\n\nThis year Lottery Program Jackpot is the largest ever for LOTTO\nRheinland-Pfalz. The estimated €50 million jackpot would be the\nsixth-biggest in Europe history. The biggest was the €363\nmillion jackpot that went to two winners in a Febuary 2000 drawing\nof The Big Game Mega Millions' predecessor.\n\nYour fund is now deposited in an offshore bank with a hardcover\ninsurance. Due to the mix up of some numbers and names, we advice\nthat you keep this award from public notice until your claim has\nbeen processed and your money remitted to you as this is part of\nour security protocol to avoid double claiming or unwarranted\ntaking advantage of this program by the general public.\n\nPlease note that your lucky winning number falls within our\nEuropean booklet representative office in London. In view of this,\nyour €1,000,000.00 (One Million Euro) would be released to you\nby our affiliate bank in Europe. Our agent will immediately\ncommence the process to facilitate the release of your funds to you\nas soon as you make contact with him.\n\nTo begin your claim please contact your claims agent:\n\nMr.Wilson Gart\nForeign Services Manager,\nInformation and Payment Bureau.\nLondon Representative Office.\nPhone: 00 44 702 403 5806\nFax:   00 44 870 479 4098\nEmail: info@lrpwilsongart.vossnet.co.uk\n\nYour claims agent will assist you in the processing and remittance\nof your prize funds into your designated bank account.\n\nNote that all prize funds must be claimed not later than One month.\n\nAfter this date all funds will be returned to the LOTTERY TREASURY\nas unclaimed. In order to avoid unnecessary delays and\ncomplications, please endeavor to quote your Reference (LRP/19-DE/\n9317) and Batch numbers (LRP/06/41) in every correspondence with\nyour agent. Furthermore, should there be any change in your\naddress, do inform your claims agent as soon as possible.\n\nCongratulations once again from staff of LOTTO Rheinland-Pfalz.\n\n\nYours faithfully,\nHans-Peter Schossler\nManaging Director\nLOTTO Rheinland-Pfalz.\n\n"}