{"category": "ham", "to_address": "Duncan Murdoch <murdoch@stats.uwo.ca>", "from_address": "\"Adam D. I. Kramer\" <adik@ilovebacon.org>", "subject": "Re: [R] Automatic paren/bracket closing in 2.5.0?", "body": "Many thanks, Duncan. I did not expect this to be an OS-specific issue, and\nfigured it must be the new \"default\" and thus configurable from within the\nprogram, though indeed I am using MacOS.\n\n--Adam\n\nOn Mon, 18 Jun 2007, Duncan Murdoch wrote:\n\n> On 18/06/2007 12:30 AM, Adam D. I. Kramer wrote:\n>> Hello,\n>>\n>>  \tJust upgraded to 2.5.0, and found that R now includes an rparen\n>> (right parentheses) or rbracket whenever I enter in an lparen. While I can\n>> see the use of this function, it doesn't mesh well with my personal style \n>> of\n>> using R (e.g., using the up arrow, adding an rparen, jumping to the\n>> beginning of the line, and then wrapping a summary, for instance).\n>> \n>> Some 10 minutes of google searching has failed to come up with a solution\n>> for turning this feature off--any suggestions from the list?\n>\n> You don't say your OS.  If it's MacOSX (which I think is the only platform \n> with this feature), then see the R-sig-mac list, and in particular Simon \n> Urbanek's posting on May 23:\n>\n>> On May 23, 2007, at 3:55 PM, Roberto Osorio wrote:\n>> \n>>> > I can't find a preference to disable brace completion in the  > console \n>>> in R 2.5.0 GUI 1.19.\n>> \n>> Unfortunately it didn't make it to the Preferences UI, so you have to \n>> paste this in Terminal:\n>> \n>> defaults write org.R-project.R auto.close.parens NO\n>> \n>> If you want to revert back to the default you can use:\n>> \n>> defaults delete org.R-project.R auto.close.parens\n>> \n>> \n>\n> Duncan Murdoch\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}