{"category": "spam", "to_address": "Smiles <smiles@flax9.uwaterloo.ca>", "from_address": "Patricia Gutierrez <ryeiter@golfing.co.nz>", "subject": "Hymen eliminator", "body": "\n\nTired with your sexual problems? Looking for an effective and cheap solution?\nBuy medications at RX online drug store!\nWe have only high-quality national medications at low prices. Viagra, Cialis, Levitra, Valium, Phentermine, Tramadol, Xanax, HGH you can find them here.\nClick to visit us\nAnd no one will know that you have some problems.\nWith best regards,\nPatricia Gutierrez\n \n \nLovchij mag ne uslyshal otgoloska Posmertiia ego otriada, potomu chto shvatka proizoshla na territorii makora nubesov. Chuzhie nadezhdy Spustia minutu my vse uzhe stoiali vokrug zolotistogo kruga, osveshchavshego nashu Odezhdu i lica svoim zheltovatym svetom. On uzhe Ne napadal, a tolko zashchishchalsia. Ni sil, ni zhelaniia Shevelitsia ne bylo, hotia vse myshcy zatekli ot nepodvizhnosti. \nOn podoshel blizhe. Blednye, bystro vrashchaiushchiesia kolca energii, nanizannye na os iz Pustoty, vozniknuv iz niotkuda, vtianuli menia v sebia, slovno truba pylesosa, i Okruzhaiushchuiu temnotu prorezali tusklye vspyshki holodnogo prizrachnogo sveta. Za kamennymi stenami karaulki on chuvstvoval sebia v polnoj Bezopasnosti i ne nameren byl dat sebia zapugat kakomu-to bezrodnomu chuzhaku. Otlichno. Nu chto Zh, ne vsem zhe byt takimi umnymi, kak ia. sheptun chuzhoj? nastorozhilsia ia. Sverkaiushchie klinki skreshchivaiutsia i Otletaiut drug ot druga v snopah zheltyh iskr, sobravshiesia vokrug zevaki chto-to Krichat, podbadrivaia srazhaiushchihsia. Ochen mnogoe sejchas Postavleno na kartu. \nGlaza i rost eto moj imidzh. Prikosnovenie myslechuvstv k etim sledam zhglo, zhglo nevedomoj siloj, ne prisushchej, Nikak ne prisushchej magam etogo mira, ne govoria uzhe o prostyh prezrennyh haskah. Tolko recept izgotovleniia kakogo-to Opredelennogo sorta derzhitsia v strozhajshem sekrete. Ia vse-taki zhutko ustal. ejisuminyon Ql9aWFBCckBEUFRWShpARlNHUUddXVwaVlA=\n \n\n\n"}