{"category": "ham", "to_address": "Andy Greenwood <greenwood.andy@gmail.com>", "from_address": "divya <r.divya@einfochips.com>", "subject": "Re: Unable to store the output of a command", "body": "Hi Andy,\n\nThanks for the reply.\n\nI tried it out, but still not able to store error msgs.\n\nWhat does 2>&1 mean?\n\nIs there any other way out.\n\nThanks,\n\nDivya\n\n\nAndy Greenwood wrote:\n\n> On 5/18/07, divya  wrote:\n>\n>> Hi,\n>>\n>> I want to store the output of following command:\n>> \"vcover merge outfile in1 in2\"\n>>\n>> I tried :\n>> 1) @result = `vcover merge outfile in1 in2`;\n>> 2) system(\"vcover merge outfile in1 in2 > @result\");\n>>\n>> I can see some error displays on the screen. But these are not getting\n>> stored in @result.\n>\n>\n> backticks (``) will direct the STDOUT of the command to the array.\n> However, your STDERR will not be directed normally. If you want those\n> errors directed into your array, try something like\n>\n> @result = `vcover merge outfile in1 in2 2>&1`;\n>\n>>\n>> Kindly please suggest some way to store it.\n>>\n>> NOTE : script runs on linux m/c\n>>\n>> Thanks,\n>> Divya\n>>\n>>\n>\n>\n\n\n\neInfochips Business Disclaimer:\nThis message may contain confidential, proprietary or legally Privileged information. In case you are not the original intended Recipient of the message, you must not, directly or indirectly, use, Disclose, distribute, print, or copy any part of this message and you are requested to delete it and inform the sender. Any views expressed in this message are those of the individual sender unless otherwise stated. Nothing contained in this message shall be construed as an offer or acceptance of any offer by eInfochips Limited and/or eInfochips Inc(\"eInfochips\") unless sent with that express intent and with due authority of eInfochips. eInfochips has taken enough precautions to prevent the spread of viruses. However the company accepts no liability for any damage caused by any virus transmitted by this email.\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}