{"category": "spam", "to_address": "Manager <manager@flax9.uwaterloo.ca>", "from_address": "Robert Morton <istorama@greatlakestech.net>", "subject": "Say \"NO\" to erectile dysfunction!", "body": "\n\nDo you want to save your money and get high-quality pills?\nBuy medications at RX online drug store!\nViagra, Cialis, Levitra, Valium, Phentermine - they are all licensed and are the best quality!\nOrder now!\nSwitch on your penis!\nWith best regards,\nRobert Morton\n \n \nPytalsia najti vyhod iz zamknutogo kruga beznadezhnoe zaniatie. Za to, chto pozabotilsia obo mne, kogda dogovarivalsia s chuzhim, so Snishoditelnoj ulybkoj poiasnila Nori. Trans stal zelenet! Glaza ego Zakatilis v ekstaze udovolstviia, rot priotkrylsia, obnazhiv melkie ostrye Zubki. Ono prosto sbivalo s tolku. \nIa lezhal na Polu, kogda Linlan nanes udar, i zalp proshel nado mnoj. Iz ladonej Shordoka vyrvalis sharovidnye sgustki sinego plameni i ustremilis dal-roktu v Lico, rastianuv dlinnye, neterpelivo vibriruiushchie hvosty. On skazal daleko ne vse, El. Da, podozritelno legko. Bros, nebrezhno usmehnulsia Ketram Plameborodyj. Ne Uderzhavshis, sostril: Zaderzhalsia na shelte, chtoby osmotret mestnye Dostoprimechatelnosti, i, nado otdat dolzhnoe, vasha planetka podhodiashchee Mestechko nabivat shishki na zadnice. A Esli i poiaviatsia, to popugaiut gorozhan da v storonu otvernut, gorod v pokoe Ostaviat. Esli Initoks ne sumeet perehvatit demona na granice, to I tysiachnoe vojsko ne pomozhet spravitsia s makorom nubesov. \nIa ne upomianu v nem o vashih Novyh sposobnostiah, a mentalnaia zashchita u menia dostatochno prochna, chtoby on Ne smog vyiasnit u menia eto sam. Stranno razmyvshiesia na mig ochertaniia uzkogo Lica, pokazavshegosia zverinym, ostroe mnogoriade klykov, vlazhno blesnuvshih vo Rtu, net, v ogromnoj pasti. Vo-vtoryh, eta Operaciia proizvedet na sheltian ogromnoe vpechatlenie i ostavit neizgladimyj Sled v ih soznanii. Prokliatie. ejisuminyon XFNdVVJUQHNHRVRXV00bREVSQFBDXlxbG1JT\n \n\n\n"}