{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Ben Finney <bignose+hates-spam@benfinney.id.au>", "subject": "Re: SNMP++ license", "body": "Pau Garcia i Quiles  writes:\n\n> ATTENTION: USE OF THIS SOFTWARE IS SUBJECT TO THE FOLLOWING TERMS.\n> Permission to use, copy, modify, distribute and/or sell this software\n> and/or its documentation is hereby granted without fee.\n\nAll the necessary freedoms are specified here; good.\n\n> User agrees to display the above copyright notice and this license\n> notice in all copies of the software and any documentation of the\n> software.\n\nSo long as \"display [the notice] in all copies of the software\" means\nto have the text of the notice in the source code, this is fine.\n\nIf it could mean \"cause the program to display the notice when\nexecuted\", that's a non-free restriction. I don't think such an\ninterpretation is valid though.\n\n> User agrees to assume all liability for the use of the software;\n\nPossibly problematic. If Support Company FooBar sells the software and\noffers a warranty, then requiring the user (meaning \"recipient of this\nwork\", I suppose) to accept all liability is a non-free restriction.\n\nIt would be best if this phrase wasn't in the terms at all, because\nthe immediately-following disclaimer is perfectly clear without\nplacing any restrictions.\n\n> Hewlett-Packard and Jochen Katz make no representations about the\n> suitability of this software for any purpose. It is provided \"AS-IS\"\n> without warranty of any kind, either express or implied.\n\nFine; the copyright holders are disclaiming any warranty.\n\n> User hereby grants a royalty-free license to any and all derivatives\n> based upon this software code base.\n\nToo vague. The user must grant \"a royalty-free license\" under what\nterms? The terms of this license, like the GPL? Any license terms they\nchoose, like the 3-clause BSD license? Something else? These terms\ndon't make this clear.\n\nMy verdict: It's probably intended to grant the freedoms required for\nDFSG-freedom, and mostly does so, with a few vague points. The Debian\nftp-masters would probably consider it good enough.\n\nIANAL, TINLA.\n\n-- \n \\           \"He who allows oppression, shares the crime.\"  -- Erasmus |\n  `\\                             Darwin, grandfather of Charles Darwin |\n_o__)                                                                  |\nBen Finney\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}