{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "J Spieherty <jwd@surewest.net>", "subject": "[R] JGR starter problems", "body": "I'm running R 2.4.1 on SuSE Linux 10.2.  My system is an AMD based PC with 2 \nGigs of ram and abundant HD space. \n\nI have always run R from the console without problems, but in the interests of \nbroadening R's user-base, and reducing the complexity of my computing \nenvironment, I am hoping to convince my PTB that R is a viable alternative to \nExcel under Windows - heh.  Since they like pretty pictures I'm experimenting \nwith graphic interfaces for R in linux.  The Windows interface is fine, but I \nwould prefer to stick to linux if at all possible.  I've been trying the JGR \nenvironment and so far it loads and looks nice but it doesn't seem to be able \nto find the key libraries such as \"base.\"  There are two errors that appear \nin the initial messages - one being that JGR can't load .../stats.so, and \nthat R_GlobalEnv is an undefined symbol.  And the other is that \noptions(\"defaultPackages\") is not as shown below.  I presume this is probably \na compilation error on my part and would like to know what I've done wrong.  \nThe initial messages when JGR loads are below.\n\nThanks, JWSpieherty\n\nError in dyn.load(x, as.logical(local), as.logical(now)) : \n\tunable to load shared library '/usr/local/lib/R/library/stats/libs/stats.so':\n  /usr/local/lib/R/library/stats/libs/stats.so: undefined symbol: R_GlobalEnv\nLoading required package: JavaGD\nLoading required package: iplots\nCreating per-session help links...\nLoading required package: grDevices\nDuring startup - Warning message:\npackage stats in options(\"defaultPackages\") was not found\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}