{"category": "ham", "to_address": "<R-help@stat.math.ethz.ch>", "from_address": "\"Theis, Winfried\" <Winfried.Theis@unilever.com>", "subject": "[R] nlsList problems: control option does not effect output and\n\tstrange environment search", "body": "Dear R-helpers,\n \nI'm using R 2.5.0 under Windows and am trying to use nlsList from nlme\n3.1-80 with the selfstart function for the four parametric logistic\nfunction. My first test went well, but now I'm trying to do some more\nsophisticated things and it does not work anymore. \n \nI simulate my data from a five parametric logistic function like this:\n\nY<-as.data.frame(apply(params,1,function(x){\nY<-x[1]+(x[2]/(1+x[3]*exp(-1*x[4]*(1:240-x[5])))^(1/x[3]))+rnorm(240,0,s\nderror) \nreturn(Y)}))\n\nparams contains different parameters for 200 persons in 4 groups. Next I\nsample for each person five observations one at the start, one at the\nend and three randomly in between. Now I get the following error\nmessages:\ntestnlslist2<-nlsList(SSfpl,groupedData(Y~Time|group, datset))\nError in nls(y ~ cbind(1, 1/(1 + exp((xmid - x)/exp(lscal)))), data =\nxy,  : \n        step factor 0.000488281 reduced below 'minFactor' of 0.000976562\nError in nls(formula = formula, data = data, control = control) : \n        singular gradient\n\nFor the first error it could be that this is due to the fact that this\ngroup is simulated as a kind of placebo and therefore it may be hard to\nfit. To solve this I tried to specify controls like this:\ntestnlslist2<-nlsList(SSfpl,groupedData(Y~Time|group,\ndatset),control=nls.control(minFactor=1/4096))\n\nbut it led to the same error as the first. So it looks like the control\nparameter is not evaluated. Any other ideas how to get the function\nrunning? \n\nThe second strange thing I encountered is that nlsList does not seem to\nanalyse the environment from which it is called. I did try to use it\nwithin a function in apply and I got the error that the dataset I gave\nwas not found, but the function grouped.data worked well within the\nfunction. Any idea what I could have done wrong?\n\nRegards,\nWinfried Theis\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}