{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Brianna Phillips\" <nexcannonballfineartwod@cannonballfineart.com>", "subject": "Achieve picture perfect weight and enjoy life", "body": "\nBe leaner and slimmer by next week\n\n\n\n\n\n\nAnatrim – The newest and most enchanting lose flesh product is made available now – As you could see on Oprah.\n\n\nDo you retain all the times when you told yourself you would do any thing for being delivered from this fastly growing pounds of fat? Luckily, now no great sacrifice is expected. Thanks to Anatrim, the ground-breaking weight-reducing combination of elements, you can achieve healthier lifestyle and become really slimmer. Take a look at what people write!\n\n\n\n\"It’s unbearably difficult to confess but I was exceedingly addicted to food. \n\n\nI greedily devoured all this garbige \n\n\nand just could not stop. \n\n\n\n\nThis ruinous passion passed away when I started taking Anatrim! \n\n\nGod,\n\n\n\n\n my appetite decreased, \n\n\nmood increased and I became the happiest person on the planet 20 pounds in 2.9 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person in the world!\"\n\n\n\n\n\nLusia R., Texas\n\n\n\n\n\n\"I had weight problems since a boy. \n\n\nYou can't imagine how I detested being ridiculed at school. \n\n\n\n\nI hated my plumpness and I abhorred myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nThis stuff literally pulled me out of this horror! Lots of thanks to you, guys.\"\n\n\n\n\n\nRikky Martin, New York\n\n\n\n\n\n\"Do you know what? Anatrim kept my marriage intact! I fell down into this circle, depression – more eating – just more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nMy best friend showed me web page and I ordered my pack of Anatrim at the time. \n\n\nThe results were great, my appetite came to acceptable level, I was often in good spirits, and, be sure, I tightened my belt with no regrets. And the bed became cool, too!\"\n\n\n\n\n\nMike\n\n\n\n\n There many and many gratitudes happy people leave after taking Anatrim. Why don't you join the thousands and thousands of slender men and women and take this natural appetite abating energy raising product now!\n\n\nDo not lose the chance!\n\n\n\n\n"}