{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "(Ted Harding) <ted.harding@nessie.mcc.ac.uk>", "subject": "[R] [OT] 'gv' and fractional points", "body": "Hi Folks,\n\nThis is off-topic R-wise, but it may be close to\nthe heart of many R-users, so I think it may be\nthe best place to ask!\n\nUsers of 'gv' (the \"front end\" to ghostscript) will\nbe aware of the little window which gives you the\nx-y coordinates (in points = 1/72 inch) of the position\nof the \"cross-hair\" mouse cursor. These coordinates\nare those of the corresponding position on the printed\npage, relative to some origin.\n\nI have often used this to extract numerical values\nfor data from graphs in Postscript files (also PDF\nfiles, after you have converted them to PS). Then\n(veering back on topic ... ) you can submit the\nnumerical data to R and try your own analyses on\nthese data, and compare with what the article does.\n\nHowever, this little window only gives the numbers\nin whole points. Say a smallish graphic may print\nout 3 inches wide or high. Then you get precision\nof 1/216 per 3 inches or 0.4% of full scale. This\ncan be adequate on many occasions, but can be on\nthe coarse side on other occasions.\n\nEven for a 6-inch-wide/high graph, you only get down\nto 0.2% of full scale.\n\nIf it were possible to induce 'gv' to display these\ncoordinates in tenths of a point, then much greater\nprecision (as adequate as one can expect to hope for\nwhen, in effect, \"measuring off the graph\") could be\nobtained.\n\nDoes anyone know:\na) Whether it is possible to persuade 'gv' to give\n   this display in fractional points (my own search\n   of the documentation has not revealed anything);\nb) Of any alternative to 'gv' as PS viewer which would\n   provide this capability?\n\nWith thanks, and best wishes to all,\nTed.\n\n--------------------------------------------------------------------\nE-Mail: (Ted Harding) \nFax-to-email: +44 (0)870 094 0861\nDate: 15-Jun-07                                       Time: 16:13:21\n------------------------------ XFMail ------------------------------\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}