{"category": "spam", "to_address": "<manager@speedy.uwaterloo.ca>", "from_address": "\"Shea H. Andrew\" <vkbfw@tinet.ie>", "subject": "Sikh", "body": "\n\n\n\n\n\n\n\nProvide data exchange between MF and J2EE via VSAM \nfiles.\nBut it is the right basic idea.\nAny benchmarks or road blocks you are aware \nof?\nThere is progress to be made, even now. Any \nbenchmarks or road blocks you are aware of? I wonder if that could be a nice feature \nfor Java7.\nI see Ajax as a band-aid.\nyou're saying that the programing paradigm and \nsyntax of Java needs fixing.\nThe form definition has all the details and \nmetadata about the fields and what not. After spending a few minutes on the web \nsite, it is not apparent how one would determine licensing costs for Nexaweb \nproducts, which is quite a turn off.\nHowever, I am talking \"cages\" more in terms of what \nYOU CAN DO with the language. 0 roadmap Submit a story   Vote on new stories Forum \nControls Reply to this Thread Search Forum Back to Thread List Whos Online: 171 \nguest(s), 26 user(s). We have been delivering a XML-based RIA technology that uses \nJava as its platform since 2003.\ncom, the catalyst of the Java blogging community. I \nwould go the messaging way, it has the benefit of tracing what goes and when. I am \nthe chief architect for a company called Nexaweb.\nTry out the latest member of the Javalobby Network \nand host your project with Subversion at JavaForge!\nAt 1:32 PM on Apr 20, 2007, asj2007 wrote:   Reply \nRe: Why chose Java?\nlike the other thread mentioned, there ARE old java \nbigots, but these are divided into many kinds of old biddies. I see Ajax as a \nband-aid. ) Java has a number of trumps: they will also run on Mac OS X, Linux and \nother Operating Systems, the technology has gone through its teething problems and \nis now stable.\nJoin over 8000 other developers and technologists \nat JRoller.\nMy system uses two components: the form definition, \nand the form value.\nI don't thing you can say that XAML is entirely \nbased upon Microsoft tecnologies, from what I've seen it borrows heavily from things \nlike SVG.\nThere used to be a 20K limit on the buffer size, \nthus sometimes requirement to use MQ (not saying anyone should use such large \nmessages to begin with), but newer CTG supports much larger, 1MB? To me, that's like \nriding a bike at a 45 degree angle.\nI agree with you in 3D point. Can you bring a more \nspecific example?\nXAML is Windows only and proprietary, and I don't \nthink it is the right solution for this internet age. At 10:40 PM on Apr 18, 2007, \nDaniel Murley wrote:   Reply Re: Web Presentation Frameworks; How flexible are they? \nI truly believe that if Java falls down in this area, it will fade \naway.\n"}