{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "graham wideman <gwa@grahamwideman.com>", "subject": "Re: [R] Concepts question: environment, frame, search path", "body": "Duncan:\n\nThanks for taking a stab at my questions -- in following up I discovered the root of my difficulties -- I had not noticed document R-lang.pdf (\"R Language Definition\").  This clarifies a great deal.  \n\nFWIW, it seems to me that a number of things I was hung up on (and which you discussed) revolved around:\n\n1. Confusion between \"frame\" and \"data.frame\". R-lang.pdf has several sections that touch on each of these, from which it's more clear (though not explicit) that these are not the same things. (Problematic: frame is mentioned first, is a more fundamental concept, yet has no entry in the Table of Contents, while data.frame does have an entry). (And the converse is true of the index!).\n\n2. Ambiguity in the docs regarding environment, frame (and also regarding closely-related concepts closure and enclosure).\n\nAnyhow, I'm now in a much happier state :-).\n\nRegarding your questions:\n\n>> 1.  data.frame:\n>> Ref[m]an p84: 'A data frame is a list of variables of the same length with \n>> unique row names, given class \"data.frame\".'\n\n>Which manual are you looking at?  The \"reference index\" (refman.pdf)?\n>[...] that statement may not be present in the current release\n\nYes, the doc titled \"R: A Language and Environment for Statistical Computing Reference Index\". This is in section I \"The base package\", subsection \"data.frame\", which was on page 84 of refman.pdf (which I downloaded yesterday, but now don't know where from) or on page 86 of fullrefman.pdf (downloaded today -- ie: current release). \n\n(And point understood on the suggestions about reporting doc issues -- though tracking them down to line numbers in the SVN is a bit optimistic, not to mention a moving target :-)\n\n-----------\n\nAnyhow, thanks again for the response.\n\nGraham\n\n---------------------------------------------------\nGraham Wideman\nResources for programmable diagramming at:\nhttp://www.diagramantics.com\n\nBrain-related resources:\nhttp://wideman-one.com\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}