{"category": "ham", "to_address": "debian-laptop <debian-laptop@lists.debian.org>", "from_address": "\"Selim T. Erdogan\" <selim@cs.utexas.edu>", "subject": "Re: helpme with my rt2500 (airmong-ng start)", "body": "On Fri, May 04, 2007 at 02:15:21PM -0700, Joe Emenaker wrote:\n> javier melendez wrote:\n> >hi i need help. i have a paroblem with my drivers (native) of the debian \n> >etch. I try to work in mode monitor with \"airmong-ng start\" but when i put \n> >to run aireplay the mode monitor change to mode managed. what is the \n> >problem?.  thanks....\n> >  \n> None of the stock drivers in the kernel, according to the aircrack site, \n> support injection (ie, the thing that aireplay does). You've got a few \n> choices here:\n> 1 - Download the BackTrack2 live CD (which has patched drivers for \n> everything), or\n> 2 - Go to the aircrack site and follow their instructions for getting \n> the right drivers for your card. Also, while you're there, you should \n> get the development version of aircrack, which now has an \"injection \n> test\" mode (option -9). Some cards I've tested support some tests (like \n> ARP replay) and fail on tests like the fragmentation attack.\n\nThis driver is not a stock driver from the kernel.  One needs to get \nit separately and install it (either from the rt2500-source package \nor directly from upstream).  \n\nI played around with using rt2500 with aircrack in the past.  It worked \nfine in monitor mode but I don't remember if I tried injection.\n\nThe rt2500 driver is no longer being actively developed and it may lack \ncertain features.  (Though it's fine unless you're looking for really \nspecific things.  I still use it.)\n\nNowadays efforts are directed towards a more general driver called \nrt2x00 and this supports certain things the rt2500 doesn't.  (I think it\nmight have injection.  There's a package rt2x00-source which you can try \nout but make sure to check out\nhttp://rt2x00.serialmonkey.com/wiki/index.php?title=Main_Page\nbecause there is a lot of development going on and the debian packages \nwill not be the very latest.\n\nSelim T. Erdo\\u011fan\n\n\n-- \nTo UNSUBSCRIBE, email to debian-laptop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}