{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Newton Quintero\" <lazclresourcesincbow@clresourcesinc.net>", "subject": "Obesity is dangerous, stop it", "body": "\nLosing weight has never been so easy\n\n\n\n\n\nAnatrim – The newest and most attracting product for corpulent people is now available – As told on CNN\n\n\n\nDo you see excessive body kilograms kill a lot of people around the planet? We know that you hate the unattractive look of those people and the social stigmata attached to them. \n\nMoreover, you got no will to resist a siege of your pernicious eating habits. This all sounds familiar? Then we have something for you!\n\n\n\n\n\nWe’re proudly introduce you Anatrim, the recent product for the reduction of your body’s extra weight. The astounding thing about Anatrim is it raises the quality of your life by making you crave food less and giving you better mood. Here you may see what people say to us on this product:\n\n\n\n\n\n\"It’s great! \n\n\nI stopped watching TV continually and always glutting myself with food \n\n\nI became more interested in taking exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I’m more fit now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nRita R., Chicago\n\n\n\n\n\n\n\"I tried some passive weight reducing, but all came in vain. I could not restrain my ravenous hunger. \n\n\nOnce I heard on Anatrim in the commercial and I was really effected by the information.\n\n\n I had tried to use it, and my wife told me I'm a different person now, 5 months later. \n\n\n34 pounds have gone away and I keep still losing them! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nSteve Doubt, Chicago\n\n\n\n\n\nAnatrim helps you to understand you doesn’t have such a great need for the constant eating. It improves your mood, provides you with energy, and attacks unnecessary kilos. Especial thanks to its powerful distinguished formula!!\n\n\n\nPry out latest news!\n\n\n\n"}