{"category": "ham", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "The Paceline <info@thepaceline.com>", "subject": "May Paceline Newsletter", "body": "\n\nThePaceline.com\n\nThis message contains graphics.  If you do not see the graphics, click here to view.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGet the latest from Italy regarding Popo, Chechu, George and the boys.The latest on The Giro from PJ Rabice\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFRS is a new antioxidant health drink that can help athletes train better, increase their mental focus and recover faster. It also provides a great healthy energy boost for fast-paced lifestyles. Lance has recently partnered with FRS by serving on the company’s board of directors and has become a regular FRS user. Find out more about FRS and get your free trial (+ shipping & handling) at www.FRS.com.\n\n\n\n\n\n\n\n\n\n\n\n\n\nFrom Lance and Johan’s official online homes to the official blogs and fan sites of eight current DC riders (in their native tongues), ThePaceline now links to them all.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThrough April Stijn Devolder is the new leader in 2007 miles logged for ThePaceline's Team Discovery Channel Challenge, our charitable project benefiting the Lance Armstrong Foundation (LAF).\nStijn’s busy spring in the classics pushed him to 3,525 miles, overtaking previous leader Tomas Vaitkus now second at 3,261, and Vladimir Gusev  with 3,122. (Goose took top honors for April, logging 1,210 miles during the month).\nStijn, his teammates and last, but certainly not least, the LAF, need your support. Click here to join Team Discovery Channel to help send cancer survivors to the annual Ride for the Roses in Austin. Cool prizes, too --for more info go to the site.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTired of expert advice that doesn't work?\n\nGot an unresolved issue -- a conflict in business, romance or cycling, or anything else? Then Discovery Channel's resident advice-giver, the ever-informative Aussie Matt \"Whitey\" White -- wants to help in his new Paceline advice column, “Dear Whitey.”\n\nWhether it’s family, careers or l’amour, Matt can help you with these and a wide range of other vexing topics. Send your concise, polite queries to dearwhitey@thepaceline.com. \nTell Whitey Here\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nclick here to unsubscribe ¦ click here to subscribe\n\n\nCSE ¦ PO Box 42106 ¦ Austin, Texas 78704-0036\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}