{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nIs \"Efficiency\" the New \"Reliability\"? (EnergyBiz Insider - Apr. 16, 2007)\n\n\n\nEnergyBiz Insider - Apr. 16, 2007 - Utility representatives and state regulators joined a who's-who of federal energy administrators in Washington to discuss transmission-related topics like regional planning, cost recovery and siting.\n\n\nApr 16, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Apr. 16, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 16, 2007\n\n\nApr 16, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for April 16, 2007  \n\n\n\nFirst Enercast Featured Articles for April 16, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nApr 16, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nSelling wind energy no breeze\n\n\n\nApr. 16--LINCOLN -- A wind energy bill is blowing through the halls of the State Capitol, and it may help jump-start Nebraska's lagging development of wind power.  The measure has generated debate on several points, including how best to allow private entities to generate wind power in a public power state such as Nebraska, and who should ultimately own the wind farms.\n\n\nApr 16, 2007 Knight Ridder Tribune Business News\n\n\n\nTwo-prong rate relief strategy in works: Either a freeze or voluntary credits\n\n\n\nApr. 16--Since February, lawmakers have pursued a two-pronged strategy for providing rate relief to electric customers hit hard by soaring electricity rates.  One plan calls for a rate freeze and the other seeks credits for customers. State lawmakers, who reconvene at noon Tuesday after a two-week recess, are expected to place both measures at the top of their agenda.\n\n\nApr 16, 2007 Knight Ridder Tribune Business News\n\n\n\nenergy that grows back: Burning wood considered carbon neutral\n\n\n\nApr. 15--With greenhouses gases and global warming capturing everyone's attention these days, people who promote burning biomass to generate electricity note that wood is a carbon-neutral fuel, at least in the long run.  Wood combustion spews carbon into the air, contributing to the buildup of gases most scientists say is spurring global warming. But the new trees that grow where the cut tree had ...\n\n\nApr 15, 2007 Knight Ridder Tribune Business News\n\n\n\n'Green' startups move to city: Menlo Park's research and development district attracts alternative energy companies\n\n\n\nApr. 15--Menlo Park, a small city known for its venture capital firms, feisty politics and abundance of trees, is also becoming a hub for alternative energy innovation.  In the past six months, a handful of companies have moved to eastern Menlo Park's research and development district. The area has the space, proximity to venture capital cash and is a good location from which to scout local ...\n\n\nApr 15, 2007 Knight Ridder Tribune Business News\n\n\n\nLocals fight global warming: Palo Alto joins cities for National Day of Climate Change Action\n\n\n\nApr. 15--A group of concerned residents held a festival-like event at Mitchell Park on Saturday to highlight the need to reduce carbon emissions.  The group, Step It Up Silicon Valley, is urging Congress to find ways to reduce carbon emissions by 80 percent by the year 2050. The Palo Alto rally was one of some 1,400 National Day of Climate Change Action events held around the country, according ...\n\n\nApr 15, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nGiving the green light to earth-friendly bills\n\n\n\nPage 1 of 2 next  | Email | Print | Subscribe ASSOCIATED PRESS ANNAPOLIS -- From the soap used to wash dishes to the cars driven to work, Marylanders will feel large and small effects from the recent legislative session some have called the most environmental in years. Democrats this year celebrated their stronger grip on state government and their return to the governor's mansion with a spate of ...\n\n\nApr 15, 2007 Washington Times\n\n\n\n\n\nMultiple Nuclear Outages Prompt Increased Scrutiny\n\n\n\nResearched by Industrial Info Resources (Sugar  Researched by Industrial Info Resources (Sugar Land, Texas). Nearly 37,000 megawatts (MW) of nuclear generation is expected to be offline for the month of April in the U.S. The Nuclear Regulatory Commission (NRC) is keeping a close watch on plants to ensure plants are up to code and are free of any potential hazards.\n\n\nApr 16, 2007 Internet Wire\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nRussians plan UK power stations\n\n\n\nGazprom is considering teaming up with UK energy producers to build gas-fired power stations in this country. The Russian energy group, the world's largest producer of gas, is looking to form joint-ventures that would allow it to build power stations and supply gas to them, in return for taking electricity output and selling it on through its trading business.\n\n\nApr 15, 2007 Observer\n\n\n\nIran seeks offers to build two new nuclear power plants\n\n\n\nannounced it is launching a tender for offers to build two new nuclear power stations in the southern city of Bushehr, a top nuclear agency official said. 'Iran is launching two tenders for the construction of two nuclear power stations of between 1,000 and 1,600 megawatts capacity in Bushehr,' the director of production of nuclear energy, Ahmad Fayaz Bakhsh, told reporters.\n\n\nApr 15, 2007 New African\n\n\n\nOrascom Construction Industries Signs EGP 760 million Power Plant Contract in Egypt\n\n\n\nNEWS RELEASE  NEWS RELEASE  OCI Signs EGP 760 million Power Plant Contract in Egypt  OCI Construction Group signs new construction order valued at EGP 760 million for the civil works package on the El Tebbin 2 x 350 MW Thermal Power Plant in Egypt  Cairo, Egypt - 15 April 2007:  Orascom Construction Industries (OCI) announced that it has signed an EGP 760 million contract with the Cairo ...\n\n\nApr 16, 2007 Internet Wire\n\n\n\nArab states seek nuclear power\n\n\n\nTwo years ago, the leaders of Saudi Arabia told international atomic regulators that they could foresee no need for the kingdom to develop nuclear power. Today, they are scrambling to hire atomic contractors, buy nuclear hardware and build support for a regional system of reactors. Turkey is preparing for its first atomic plant. Egypt has announced plans to build one.\n\n\nApr 16, 2007 Press Democrat\n\n\n\nNissan Aims To Be Number One In Electric Cars\n\n\n\n-- Japan's Nissan Motor Co., seeking to catch up with rivals such as Toyota in energy-saving motoring, said April 13 it aimed to become a leader in electric vehicles through a joint venture with NEC Corp. Nissan and NEC said they would invest 490 million yen (US$4.1 million) in the 50-50 joint venture, to be named Automotive Energy Supply Corp. (AESC), in the aim of mass production of lithium-ion ...\n\n\nApr 16, 2007 Industry Week\n\n\n\nVenezuela, Brazil at odds on ethanol before ...\n\n\n\nCARACAS, Venezuela (AP) -- President Hugo Chavez not long ago was embarking on ambitious plans to produce ethanol as the eco-fuel of choice. But within the past two months, the biofuel has suddenly become a villain for him and a major point of friction with Brazilian leader Luiz Inacio Lula da Silva. Their dispute, raised in part by a U.S.-Brazil ethanol agreement, threatens to overshadow a South ...\n\n\nApr 16, 2007 Washington Times\n\n\n\nSiberian Energy Retains The Global Consulting Group as Strategic Communications Counsel\n\n\n\nSiberian Energy Group, Inc. (OTCBB: SIBN)  Siberian Energy Group, Inc. (OTCBB: SIBN) announced today that it has retained The Global Consulting Group as the Company's strategic investor and media relations counsel.  David Zaikin, Chairman and Chief Executive Officer of Siberian Energy, stated, \"We selected The Global Consulting Group based on its reputation and proven track record of enhancing ...\n\n\nApr 16, 2007 Internet Wire\n\n\n\nCash Minerals Begins Drilling at Odie Property (IOCG-U TARGET), Wernecke Uranium District, Yukon\n\n\n\nCash Minerals Ltd. (TSX VENTURE: CHX) today announced that two drills have started drilling IOCG-U targets on the Odie property, located in the Wernecke Uranium District, Yukon. The Odie property is one of nineteen properties under the Yukon Uranium project, a partnership between Cash Minerals and Mega Uranium Ltd (TSX: MGA). The targets were identified using ground geophysical data completed by ...\n\n\nApr 16, 2007 Internet Wire\n\n\n\nVenezuela, Brazil at odds over ethanol ahead of South American energy summit\n\n\n\nAP Business Writer CARACAS, Venezuela (AP) -- Not long ago, President Hugo Chavez was embarking on ambitious plans to produce ethanol as the eco-fuel of choice. But within the past two months, the biofuel has suddenly become a villain for him and a major point of friction with Brazilian leader Luiz Inacio Lula da Silva. Their dispute, raised in part by a U.S.-Brazil ethanol agreement, threatens ...\n\n\nApr 16, 2007 Charleston Gazette\n\n\n\nAnalysis: Uranium price surge to continue\n\n\n\nFront Page&gt; UPI Page advertisement UPI Energy Correspondent WASHINGTON, April 13, 2007 (UPI) --  The price of uranium has jumped nearly 19 percent since April 2 in a rush led by supply instability, constant and planned increase in demand, and investors looking to gobble up supply before the price spikes again. The nuclear industry isn't worried its fuel stock will price them out of competition ...\n\n\nApr 15, 2007 Washington Times\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}