{"category": "spam", "to_address": "\"omo wa ise\" <joboffer@peteradams.co.uk>", "from_address": "\"Peter Adams Ltd\" <joboffer@peteradams.co.uk>", "subject": "Job Offer", "body": "\n\n\n\n\n\nHello,Would you like to work online from home and get paid without \naffecting your present job if you have one?Peter Adams Limited,a company \nbased in the United Kingdom,needs an individual in the United States of \nAmerica/Canada who will be working for the company and we shall be paying for \nevery transaction, which wouldn't affect your present state of work.The \nindividual shall be receiving payments on our behalf from our customers in the \nUnited States of America/Canada. These payments are in form of money \norders or cashiers checks and it will be made payable to your name.All you need \nto do is cash the money orders or cashiers checks, deduct your 10% and wire the \nrest back to the company's accountant via Western Union Money \nTransfer.We run a Premier Furnishing Company based in the United Kingdom \nand we need someone to work for the company as arepresentative in the United \nStates of America/Canada.We specialise in making all kinds of \nfurnishings,demonstrating creative ideas,colors, textures and styles for every \nroom, orthopaedic chairs and high seats. We offer a high degree of \npersonal service, on everything from individual items to complete interior \ndesign schemes, which has really expanded that we furnished overseas now. \nOur reputation as a premier furnishing store has been achieved by \nsearching throughout the UK and Europe for the best ranges available. We \nhave found unusual and original pieces from traditional French farmhouse \nfurniture to clean Scandinavian design plus leading UK brands to suit every \nlifestyle. We have been selling our furnishings for the last four years \nand we have also sold in showrooms and private collectors from all around the \nworld. We are always facing serious difficulties when it comes to \nselling our furnishings to people in the United States of America as some of our \ncustomers offers to pay with money orders or cashiers checks, which is difficult \nfor us to cash here in United kingdom.So we need someone in the United \nStates of America/Canada to work as our representative and assist us in \nprocessing the payments from our clients and we shall also pay on every \ntransaction.JOB DESCRIPTION:1. Receive payments from Clients2. \nCash the Payments3. Deduct 10% which will be your percentage/pay on every \npayment processed.4. Forward balance after deduction of 10% to our company's \naccountant in the United Kingdom via Western Union Money Transfer.It \nwouldn't cost you any charges.You are to receive payments from my clients, which \nwould come in form of money orders or cashiers checks,cash it and send the rest \nto the company's accountant via Western Union Money Transfer.All transfer fees \nshould be deducted from the payments.If you are interested send the \nfollowing information to peteradams_rep@yahoo.co.uk:FULL \nNAME:.........................................................HOME ADDRESS \n(NO P.O. \nBOX):..........................................................CITY:.........................................................STATE:....................................................ZIP \nCODE:..............................................COUNTRY:.............................................PHONE \nNUMBER(S):..........................GENDER:...............................................MARITAL \nSTATUS:.............................AGE:........................................................CURRENT \nJOB:...................................WHAT IS YOUR BEST MEANS OF \nCOMMUNICATION:......................................................Thanks \nfor your anticipated cooperation. Best Regards,Blair ChrisHuman \nResources ManagerPeter Adams Limited,United \nKingdompeteradams.co.ukNB: Reply to peteradams_rep@yahoo.co.uk\n\n\n"}