{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "Didier Raboud <didier@raboud.com>", "subject": "Re: Get wirless working", "body": "geoff wrote:\n\n> On Tue, 2007-05-15 at 12:43 -0700, DavidDutch1964 wrote:\n>> I love debian. I guess we all do here.\n>> \n>> Recently, thoguh, I had to switch to Kubuntu =only= because wireless on\n>> my laptop JUST WORKED.\n>> \n>> I have an HP zt3000 with one of those Intel PRO/Wireless 2200BG wireless\n>> cards built in. It has been horrible to try to get working despite any\n>> instructions found on the Internet. The instruction on the site for this\n>> (http://ipw2200.sourceforge.net/) was tricky as it only focused on\n>> getting that one piece working and not networking as a whole.\n>> \n>> DistroWatch (http://distrowatch.com/) has had ubuntu at the top of their\n>> list going back to 2005 - its ashame when I know that debian is really\n>> the heart and soul of dopey ubuntu.\n>> \n>> Im sure debian would shoot to the top of the list if a few more things\n>> (like wireless) \"just worked\" like it does with my Kbuntu.\n>> \n>> Couldn't someone work on this problem for debian - or talk to the ubuntu\n>> people to get a copy to be included in the next release and apt sources?\n>> \n>> Somethings I don't mind figuring out and there is a great sense of\n>> accomplishment; but getting wireless working is not one of them.\n>> \n>> ~david (and many other debian users I talk to)\n> Noob 1st time poster: I too love Debian and use it as my main OS on my\n> box. I also had Etch running on my IBM T43 and actually got the ipw2200\n> working till a kernel upgrade came through and then I lost wireless and\n> being a noob I couldn't get it going again :-) I tried Linux Mint\n> (Cassandra) and only one click got my wireless working. All the Beryl\n> things work out of the box too. And the T43 doesn't have Nvidia. Regards\n> Geoff\n\nEverything is true, but never forget : Debian is ROCK-solid. Such cannot be\nsaid about Ubuntu...\n\nRegards, \n\nDidier\n-- \nGmane\n\n\n-- \nTo UNSUBSCRIBE, email to debian-laptop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}