{"category": "spam", "to_address": "<elaastic@speedy.uwaterloo.ca>", "from_address": "\"Greene\" <bob@schulershook.com>", "subject": "Stating the company would follow a uniform pricing policy across India, he said the base model 3 series petrol version will cost Rs 26.", "body": "CDPN Moves To Corners GPS Market In China!\n\nChina Datacom Corp.\nSym: CDPN\nClose: $0.065\n\nCDPN announced Friday that is has acquired all outstanding shares of\nGeneral Link Information Systems, Chinas only GPS vehicle monitoring and\nmanagement system. GPS systems are huge; controlling that market is even\nbigger. Read the news and get on CDPN first thing Monday!\n\nThe car will boast of the smallest of the engine configurations ever to\nbe seen in India having an engine size of more than 1 litre or 1000cc.\nThis tax holiday is coming to an end,\" HSCI Senior General Manager\nJnaneswar Sen said.\n\"CRV is sold in India through the completely built unit route and hence\nwe are not tinkering with its prices,\" the official said. \"We don't feel\nwe are late in entering India, but we also do not want to waste time.\nThe company has now said that they are going to launch a diesel Santro\nvariant sometime next year.\nThey help us measure and define what is in reality a very open-ended\nactivity. Maruti has announced that they would be hiking the prices of\ntheir car starting from March 15.\nSo, we anticipate this will have a strong hold in our sales, going\nforward.\nContact me with as much info as you care to leave including what topics\nyou cover, your climbing background, and what climbing areas you\nfrequent. It is taller, offers more boot space and superior air\nconditioning.\n20 2007: Japanese auto major Nissan launched  its luxury sedan Teana in\nDelhi, Bangalore and Chennai.\nExperts believe it to be priced higher than its competition. I like your\nnew site.\nFor most of its proposed lineup, the car maker is expected to maintain a\n55:45 ratio between diesel and petrol.\nFor most of its proposed lineup, the car maker is expected to maintain a\n55:45 ratio between diesel and petrol. UPDATE: Although this was a\nrather short post on my part, the comments have taken off and provide a\ngreat conversation on this story. The one thing I can say about Aron,\nthat he is sharing in a positve way what he learned from is awefull\nordeal.\n\n"}