{"category": "ham", "to_address": "\"Marco Pesenti Gritti\" <mpg@redhat.com>", "from_address": "\"Erik Blankinship\" <erikb@mediamods.com>", "subject": "Re: [sugar] embedding mozilla into an activity", "body": ">         > Is there an example of embedding the mozilla rendering>         engine into a\n>         > sugar activity?>         >>>         sugar/tests/test-browser.py>>         What are you doing with it?>>         Marco>>> I am wondering if it might be easier to design layouts for activities\n> with html and css (instead of pycairo), but want to ensure I will be> able to inter-operate with sugar completely ( e.g., drag and drop).That sounds like a bad idea. We are going to build controls that will\nmake it easy to get the the visual appearance and the interactionspecified in the HIG. Throwing another graphic system in the game isjust going to cause duplication, inconsistencies and confusion.\nPerhaps there is a different approach to this...  can I run a local http server on the xo that can function as a cgi and kids can interact with the html it produces through the browser activity?  What would the path to that server be?  It is possible that the local library activity might benefit from such a server to augment/complement the static html.\nRegardless of how this might be implemented, for the custom rendering of certain components (that lie outside of the HIG (e.g., a videogame)), using javascript & canvas & html might reduce many developers' time.  Also, for applications that are going to run on both the xo locally and the school server, being able to use the same rendering engine might be helpful (maintaining a consistent look and feel across all platforms).\n\n"}