{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Lee Craft\" <powclairvoyantvisionsdeq@clairvoyantvisions.com>", "subject": "Make yourself more attractive to others", "body": "\nShed weight now and enjoy the process\n\n\n\n\n\nAnatrim – The latest and most exciting product for corpulent people is made available now – As seen on Oprah\n\n\n\nDid you know superfluous body kilos kill more and more people for every new year? We know that you hate the ugly look of people like those and the low status they have in society. \n\nOr, maybe, you can’t resist an assault of your fatal eating habits. This all sounds familiar? Then we have something for you!\n\n\n\n\n\nHere Anatrim comes, the ultimate product for the reduction of your body’s extra weight. The greatest thing is that Anatrim improves the quality of your life by repressing the feeling of hunger and giving you better spirit. Here you may read what people write to us about this product:\n\n\n\n\n\n\"It’s outstanding! \n\n\nInstead of watching TV constantly and eating anything close at hand \n\n\nI became more interested in taking exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I feel as fit as a fiddle now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nAmelia B., Chicago\n\n\n\n\n\n\n\"Passive weight losing was of no help to me. This terrible appetite would just kick in and spoil everything. \n\n\nOne day I was told about Anatrim my very best friend by and I rather liked the information.\n\n\n I had tried to take it, and my wife said to me that I'm a different person now, 4 months later. \n\n\n27 pounds off and it is still far to an end! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nSteve Doubt, Chicago\n\n\n\n\n\nAnatrim helps your mind to realize that you got no such great need for that much food. It improves your mood, gives you extra energy, and attacks useless kilos. Great thanks to its powerful distinguished formula!!\n\n\n\nWorm out latest intelligence!\n\n\n\n"}