{"category": "ham", "to_address": "\"Giovanni Petris\" <GPetris@uark.edu>, r-help@stat.math.ethz.ch", "from_address": "\"Liaw, Andy\" <andy_liaw@merck.com>", "subject": "Re: [R] Suggestions for statistical computing course", "body": "I really like John Monahan's Numerical Methods of Statistics (Cambridge\nUniversity Press).  \n\nAs to running/editing R scripts, you may want to look into JGR.  The\nbuilt-in editor is not as \"smart\" as ESS in some respect, but \"smarter\"\nthan ESS in others.  The only thing that keep me from using it regularly\nis the fact that it won't take arguments to R itself (at least on\nWindows):  I need the --internet2 argument to be able to access the net\nfrom R.\n\nAndy\n\nFrom: Giovanni Petris\n> \n> Dear R-helpers,\n> \n> I am planning a course on Statistical Computing and Computational\n> Statistics for the Fall semester, aimed at first year Masters students\n> in Statistics. Among the topics that I would like to cover are linear\n> algebra related to least squares calculations, optimization and\n> root-finding, numerical integration, Monte Carlo methods (possibly\n> including MCMC), bootstrap, smoothing and nonparametric density\n> estimation. Needless to say, the software I will be using is R.\n> \n> 1. Does anybody have a suggestion about a book to follow that covers\n>    (most of) the topics above at a reasonable revel for my audience? \n>    Are there any on-line publicly-available manuals, lecture notes,\n>    instructional documents that may be useful?\n> \n> 2. I do most of my work in R using Emacs and ESS. That means that I\n>    keep a file in an emacs window and I submit it to R one line at a\n>    time or one region at a time, making corrections and iterating as\n>    needed. When I am done, I just save the file with the last,\n>    working, correct (hopefully!) version of my code. Is there a way of\n>    doing something like that, or in the same spirit, without using\n>    Emacs/ESS? What approach would you use to polish and save your code\n>    in this case? For my course I will be working in a Windows\n>    environment. \n>    \n>    While I am looking for simple and effective solutions that do not\n>    require installing emacs in our computer lab, the answer \"you\n>    should teach your students emacs/ess on top of R\" is perfecly\n>    acceptable.\n>    \n> \n> Thank you for your consideration, and thank you in advance for the\n> useful replies.\n> \n> Have a good day,\n> Giovanni\n> \n> -- \n> \n> Giovanni Petris  \n> Department of Mathematical Sciences\n> University of Arkansas - Fayetteville, AR 72701\n> Ph: (479) 575-6324, 575-8630 (fax)\n> http://definetti.uark.edu/~gpetris/\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide \n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n> \n> \n> \n\n\n------------------------------------------------------------------------------\nNotice:  This e-mail message, together with any attachments,...{{dropped}}\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}