{"category": "spam", "to_address": "\"Minh Barnes\" <theorize@plg.uwaterloo.ca>", "from_address": "\"Adam Cooper\" <nzezlidl@kurita.co.jp>", "subject": "pervuiu menia", "body": "\n\n\n\n\n\n\nDon't want to expose your private life? \nEverything for your health\nWe have pills for any disease: ED, Weight loss, Antibiotics etc. Instant shipping, perfect support!\nEverything for your health\nCompletely conidential and secure purchase.\nWith best regards,\nAdam Cooper\n \n \nPosle etoj predsmertnoj ulybki Ia uzhe ne somnevalsia v tom, chto, po svedeniiam emlota, lysuny obladali zachatkami Razuma. Probudivshis zhe, genij vzial upravlenie srazheniem v svoi Ruki. Na mgnovenie soedinil podsoznanie s soznaniem, vyvel vo Vneshniuiu sredu nakoplennyj v techenie zhizni informacionnyj shlak. Sama Onni ne videla, no ot starikov slyhat dovodilos (ne pri ee korotkoj zhizni eto Proizoshlo, ved Gilsveri uzhe vtoroj vek dozhival). \nEsli za nami budut Ohotitsia, to radi kakoj by raboty on nas ni nanial, vypolnit ee my budem ne V sostoianii. Altares mog pozvolit sebe desiatki, a pri osobom zhelanii i sotni Raznoobraznejshih, izyskannejshih bliud, kotorye vmig by dostavili slugi so vseh Koncov makora, i dazhe iz sosednih. Shel tretij chas nochi. Taj. \n  V rukah Nkota, vyprygnuv iz niotkuda i razognav na metr sumrak vokrug Sebia, bezzvuchno polyhnul prizrachnyj Klinok, igraia blednymi ottenkami alogo i Golubogo. v iavnom smiatenii kivnul Kvin, i na etom razgovor Byl zakonchen, Gilsveri volnovali uzhe bolee nasushchnye problemy sam Krut Prichastiia. Gront molcha brosil na stol kozhanyj meshochek, Pri udare o kamenit izdavshij harakternyj zvon. \n  V tot zhe moment Bigman shvyrnul mne odin iz dvuh shestov. Sovsem ego za nesmyshlenysha prinimaet, chto li? Neuzheli ona do sih por Dumaet, chto on ne dogadalsia, kto takoj etot Niksard? . Eto bezvozvratno. Kak okazalos, ego syn kakim-to obrazom Razvil v sebe sposobnost upravliat zagadochnymi i nepostizhimymi dlia podavliaiushchego Bolshinstva razumnyh obitatelej Galakticheskoj Federacii Mirov artefaktami Drevnej, tysiacheletiia nazad ischeznuvshej rasy i razrabatyval kakuiu-to sviazannuiu s Nimi legendu. \n  Tiazhelovato, no nichego, nesti mozhno. Posle chego etim zaklinaniem mozhno polzovatsia, cherpaia energiiu iz Samogo kamnia s liubogo rasstoianiia (v predelah makora, estestvenno, zakony Vnutrennego Kruga nikto ne otmenial), a svoiu silu berech.  deremorinoli Y3N0aGVvcnlAcGxnLnV3YXRlcmxvby5jYQ=\n \n\n\n"}