{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "\"Peter O'Brien\" <mrpeterobrien@googlemail.com>", "subject": "Re: [cc-community] Obtaining and releasing documentary interview\n\tfootage under 3.0 Attribution?", "body": "Hi guys... reference a release form for a documentary interview under cc by 3.0 licence I would be grateful for any feedback on the following.The INTERVIEW RELEASE FORM will consist of, in the following order:\n====Print out of:http://creativecommons.org/licenses/by/3.0/\nPrint out of:http://creativecommons.org/licenses/by/3.0/legalcodeFollowed by:\nI hereby confirm and agree that I have consented to contribute my interview under the terms set out by the \"Creative Commons By 3.0 Licence\", with the licensor being {project name}.I am aware that my contribution will be recorded on film and that it may, all or in part, be made freely available to anyone throughout the world, for further sharing, or for broadcast over any medium throughout the world, and that it may be edited freely in any such use.\nMy contribution has, to the best of my knowledge, been truthful and honest.  I have not deliberately sought to conceal any relevant factsYours faithfully,\u001b$B!D!D!D!D!D!D!D!D!D!D!D!D!D!D!D!D!D!D!D!D!D\u001b(B       Date:    [\u001b$B!|\u001b(B]\n[\u001b$B!|\u001b(B]===Thanks,PeteOn 5/31/07, Peter O'Brien <mrpeterobrien@googlemail.com\n> wrote:Thanks Jon, please do update us with any progress or findings.  It\u001b$B!-\u001b(Bs great there has been some progress already and it\u001b$B!-\u001b(Bd be awesome if such a release form does become available.\n\n \nThanks for the information Elliot - you blog entry and your cc + documentary page are very helpful and informative - great collection of links too.  Will be sure to check out your presentation when at my own computer\n\n \nOn 5/30/07, elliott bledsoe <elliott@creativecommons.org.au\n> wrote:\n\nhello allwe at ccau don't have a release form or anything like that. and the issue of documentary filmmakers releasing films via mainstream mediums (such as television, cinemas and dvd) has come through our office on a few occasions.\ni did presentation at the australian international documentary conference (http://2007.aidc.com.au) in february this year. the presentation covered the cc licences, and looked four potential uses of cc for the documentary film sector:\n1 as a viral distribution tool (digital + offline);2 as a way of opening up access to your raw footage;3 as a collaboration platform; and4 as content to include in your film.you can have a look at the presentation @ \nhttp://creativecommons.org.au/aidc and it is under an australian attribution 2.5 licence so feel free to reuse it too ^_^\nthanks\n\n\n \n \n\n \n \n_elliott\n \n \n \n \nelliott bledsoe\nproject officer\n\n\n\n[ Creative Commons Australia ]\npart of the Creative Commons international initiative\n\n \n+61 7 3138 9597\n0433328462\n \nelliott@creativecommons.org.au\n\nhttp://creativecommons.org.au\n\n\n \n \n\nCreative Commons in Australia is part of the funded research under theAustralian Research Council Centre of Excellence for Creative Industries and Innovation.The ccClinc is part of the Creative Workforce research program and the CC + OCL models\nresearch stream is part of the Legal and Regulatory Impasses and Innovations research program.\nwww.cci.edu.au\nJon Phillips wrote: \nOn Tue, 2007-05-29 at 11:45 +0200, Peter O'Brien wrote:  \nDear list, Could anybody guide me as to obtaining and releasing intervieweefootage under CreativeCommons 3.0 Attribution Licence(\nhttp://creativecommons.org/licenses/by/3.0/ ) ? Is it even possible to do this?  Is there a release form in existencethat I could use, for interviewees to sign, that broadcasters would beable to accept from any projects using any of the footage?  Are there\nany projects out there doing this already - with this license? Im british and my first desire would be for the footage to be ablepass British broadcasters legal obligations however a global passing\u001b$B!-\u001b(B,or as much of one as possible, would of course be much more desirable.\n    Heya, let me get back to you on this...I think this is a great idea, andthere have been some efforts wrt to this...I'm checking with CC's GC,and others on best practices...\nuntil then, from the archives:http://lists.ibiblio.org/pipermail/cc-community/2006-December/001406.html\n\n\nJon\n\n  \nAny answers, advice or referals would be greatly appreciated.Many Thanks,Peter O\u001b$B!-\u001b(BBrien_______________________________________________cc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n    _______________________________________________cc-community mailing list\n\ncc-community@lists.ibiblio.orghttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n\n"}