{"category": "ham", "to_address": "icommons@lists.ibiblio.org, cc-community@lists.ibiblio.org,\n   cc-uk@lists.ibiblio.org,\n   \"UK FreeCulture Discuss List\" <fc-uk-discuss@lists.okfn.org>,\n   \"Discussion of Free Culture in general and this organization in  particular\" <discuss@freeculture.org>,\n   fc-london-discuss@lists.ibiblio.org,\n   okfn-discuss <okfn-discuss@lists.okfn.org>,\n   \"Open Rights Group open discussion list\" <org-discuss@lists.openrightsgroup.org>,\n   openlab@lists.pawfal.org, dorkbotlondon-blabber@dorkbot.org,\n   CADE@jiscmail.ac.uk", "from_address": "\"Tim Cowlishaw\" <tim@timcowlishaw.co.uk>", "subject": "[cc-community] CC-Salon London to launch in June", "body": "Hi all,Apologies for the cross-list spamming.Myself and the folks from the Open Rights Group are in the process of organising a monthly CC-Salon event to take place in London, with the first planned for Thursday June the 28th.\n\nThe CC Salon is a monthly event focused on building a community of artists and developers around Creative Commons licenses, standards, and technology, and have been running with great success in other cities around the world, including San Francisco, Berlin and Johannesberg. All are welcome, especially anyone interested in Creative Commons, copyright, Free Culture, Open Source, Art, Media, and Music.\nIf you'd like to take part, whether by performing or exhibiting your work, giving a talk or presentation, providing sponsorship or other support, or by getting involved in the running of the event, we'd love to hear from you, Please drop me a line if this sounds like you! We'd be especially keen to hear from artists, musicians and anyone else who publishes creative work under an open license, or anyone whose cultural practice involves appropriation, quotation, remixing, sampling and collage. Do get in touch if you'd like the opportunity to show off your work!\nPlease do pass this message on to anyone else who may be interested.Many thanks,Tim\n\nhttp://wiki.creativecommons.org/Salon\n\nhttp://www.openrightsgroup.org\nhttp://www.freeculture.org.ukhttp://ccsalon-london.org.uk\n"}