{"category": "ham", "to_address": "\"Frans Pop\" <elendil@planet.nl>", "from_address": "\"=?ISO-8859-1?Q?Andr=E9_Luiz_Rodrigues_Ferreira?=\" <andrelrf@gmail.com>", "subject": "Re: A common Debian style for Debian Installer and the desktop", "body": "2007/6/12, Frans Pop :\n> Hi,\n>\n> Before the release of Etch there were some proposals [1] to change the\n> theme of the graphical version of Debian Installer to match the theme\n> developed for the desktop. As D-I release manager, I rejected those\n> proposals, basically for two reasons:\n> 1) because it was just plain too late in the release process for such\n>    changes\n> 2) because IMNSHO the proposals were just not good enough and certainly\n>    not an improvement over the current D-I theme\n>\n> It was certainly not because I don't support the goal of a common style\n> for Debian. With this mail I hope that there will be a good enough\n> proposal that can be implemented for Lenny.\n>\n> I'd like to mention that I actually do know a bit about this stuff as my\n> father worked as a copywriter in advertising and also did quite a bit of\n> graphical design and layout work related to that.\n>\n>\n> So, let me explain why I feel that the designs proposed so far are not\n> good enough.\n>\n> Basically my complaint is that the proposals so far have tried to force\n> the desktop theme on the installer instead of developing a proper theme\n> for the installer itself. Also, the proposals have focussed too much on\n> just replacing the banner, and developing a full theme involves a bit\n> more than that.\n>\n> Note that I used the term \"style\" in the title of this mail, and not\n> \"theme\". There is a huge difference between the two. A style is the\n> general concept, while a theme is an implementation of the style for a\n> particular purpose.\n> A common style means all themes derived from it contain common elements,\n> not that all themes are basically the same.\n>\n> The current desktop theme is fine for the desktops. For the desktop a\n> theme basically has a background function and should not be too\n> intrusive. It also has to fit with the style of the desktop itself (i.e.\n> GNOME or KDE).\n>\n> The installer is totally different: it is a completely separate piece of\n> software and is also probably the only thing in Debian that is totally\n> and uniquely \"Debian\". As such it needs a much stronger identity.\n\nYeap...\nCongratulations to d-i team for this theme.\n\nBut, I think the pallet color (used by gtk theme and upper bar image)\nis different of used by default desktop, creating a failure on visual\nidentity of system. :(\n\n>\n> * The light blue of the desktop theme really is too weak for the\n> installer, especially in combination with the grey general background.\n> The contrast between the blue and grey is just not strong enough and this\n> makes the whole user interface look weak.\n> * As the installer is so uniquely Debian, it needs a much stronger tie\n> with the official Debian logo. That means that it needs to include the\n> *red* swirl and the *red* \"dot\" on the i in \"Debian\" (and in the correct\n> font).\n> * A theme for the installer needs to fit the constraints for the\n> installer. These include low memory usage (avoid too complex graphics,\n> keep file sizes low and no unnecessary icons), the resolution and color\n> depth it is run in, and the fact that info text can be displayed in the\n> banner area (for example in rescue mode).\n>\n>\n> So, my challenge to you is to design a theme for the installer that allows\n> it to maintain its strong identity and still allows users to recognize\n> that it fits in the same style as the desktop theme.\n> Unless that happens you will continue to find me opposed to changing the\n> current theme, especially as I've only seen very positive comments in\n> reviews about D-I's current theme. People very easily identify it with\n> Debian.\n>\n> To get a proposal considered, you will have to present a _complete_\n> proposal. This includes at the very least:\n> - a banner\n> - a background or background color\n> - a color scheme for gui elements like the progress bar\n\nCan we prepare an other GTK theme, using other gtk2 engine?\n\n> - icons\n> - patches :-)\n> - a netboot-gtk (gtk-miniiso) image built using all these that d-i people\n>   can try to evaluate the proposal (this is not as hard as it sounds,\n>   AFAIK there are plenty of people involved in debian-desktop who have the\n>   skills needed to build a modified image)\n\nYeap.. I can help with it...\n\nAbout the images/icons, the artists of DebianArt can help and we can\ncreate a contest on DebianArt for receive ideas...\n\n>\n> Cheers,\n> FJP\n>\n> [1] http://wiki.debian.org/DebianDesktopArtwork/DebianInstallerEtch\n>\n>\n\n\n-- \nAndre Luiz Rodrigues Ferreira (si0ux) \n *******************************************************************\nOrlandia - SP - Brazil\n\n\"Unix is user friendly... It's just selective about who its friends are.\"\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}