{"category": "ham", "to_address": "<ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Automotive Newsletter April 24, 2007", "body": "\nhowstuffworks® | automotive April 24, 2007\nRSS\n   How the Caparo T1 Works\n  The Caparo T1 is a two-seat, open-wheel supercar with a higher horsepower-to-weight ratio than any previously available production model. Find out how the \nCaparo T1 compares to race cars, how it travels so fast and why, even though it's as fast as a race car, it's still street legal. \nAlso at HowStuffWorks\n\nHow Selling a Car Works - Are you ready to bid goodbye to your old car? If\nyou follow some simple guidelines, finding a buyer and closing the deal can\nactually be pretty easy. Find out how to sell your car successfully.\n \n\nHow E85 Ethanol Flex Fuel Works - E85 ethanol flex fuel is made up of 85 percent ethanol and\n15 percent conventional gasoline. Learn how that translates into lower air\npollution and what it means for your pocketbook.\n \n\nHow Superchargers Work - A great way to give a normal-sized engine more power is to\nforce more air into the combustion chamber by means of a supercharger. Learn\nabout superchargers and how they add horsepower to an engine.\n   \nThis Week's Video \n\nReview of 2008 Chrysler Group Minivans - While other automakers are moving away from the minivan in\nfavor of crossover-type vehicles, the Chrysler Group has chosen to stick with\nits winning formula and add newly standard features to its popular \"family\nrooms on wheels.\" Take a look at the redesigned Dodge and Chrysler\nminivans introduced at the 2007 Detroit Auto Show.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click here.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved\n "}