{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "Tonight on CNN <mailings@mail.cnn.com>", "subject": "Rev. Al Sharpton Sets the Record Straight on Paula Zahn Now!", "body": "\n\n\n\nTonight On CNN Email\n\n\n\n\n\n\n\nMay  9, 2007\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n8 p.m. ET\n\n\n \n\nPaula Zahn Now:  Rev. Al Sharpton\n\n\nThe Rev. Al Sharpton is being criticized for controversial statements against a Presidential candidate. Tonight, he sets the record straight. Watch 8 p.m. ET.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRelated:• Sharpton Accused of 'bigotry' after remark on faith\n\n\n\n\n\n\n\n \n \n\n\n\n\n\n \n\n\n\n\n6:00 a.m. ET\n\n\n \n\nAmerican Morning\n\n\nWe're live in areas hardest hit by severe flooding.  How residents plan to get back to homes surrounded by water.\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n6:00 p.m. ET\n\n\n \n\nLou Dobbs Tonight\n\n\nSpecial Report: China admits sending contaminated products to the U.S. Only 2% of food imports from China are FDA inspected.\n\n\n\n\n\n\n\n7:00 p.m. ET\n\n\n \n\nThe Situation Room\n\n\nWhat will be the next move in the battle over Iraq war funding?  The top House Republican, and a powerful committee Chairman - join Wolf in the Situation Room.\n\n\n\n\n\n\n\n8:00 p.m. ET\n\n\n \n\nPaula Zahn NOW\n\n\nRev. Al Sharpton is being criticized for controversial statements against a Presidential candidate.  Tonight, he sets the record straight.\n\n\n\n\n\n\n\n9:00 p.m. ET\n\n\n \n\nLarry King Live\n\n\nThe one and only Jane Fonda.  The living legend is still outspoken on politics, plastic surgery, working with Lindsay Lohan, and  more.\n\n\n\n\n\n\n\n10:00 p.m. ET\n\n\n \n\nAnderson Cooper 360\n\n\nA teenager with a terminal illness and thousands of people rooting for him.  People he's met and inspired online.\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n\nSend us your feedback >  |  CNN's full program schedule >  |  E–mail sign up >\n\n\n\n\n \n \n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network LP, LLLP.\nA Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us. \n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the Tonight on CNN list, click here. \n\n\n\n\n\n\n\n"}