{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nTonight we’ll\n  begin our broadcast with the story of a deadly attack directed at the Iraqi\n  government. A suicide bomb exploded inside what is supposed to be the most\n  protected area of Baghdad\n  – the heavily fortified Green Zone. A bomber blew himself up in the cafeteria\n  of the Iraqi parliament, killing at least eight people, including several\n  lawmakers. Martin Seemungal will have the story.\n \nToday in Afghanistan, U.S.-led forces\n  bombed weapon-filled caves killing an estimated 35 militants. The strikes\n  happened as the war in Afghanistan\n  is reaching a critical point: The Taliban are expected to launch a spring\n  offensive. Chief Foreign Correspondent Lara Logan reports from the frontlines\n  on how NATO plans to strike first.\n \nPressure is mounting against embattled radio host\n  Don Imus, whose broadcasting fate depends on the next move of the CBS\n  Corporation now that MSNBC has stopped simulcasting his morning program.\n  Nancy Cordes will have details about the pressure from advertisers and politicians\n  to dump Imus.\n \nAnother career hanging in the balance is that of Durham County district attorney Mike Nifong.\n  Yesterday’s announcement that charges against the Duke lacrosse players\n  were dropped also brought increased scrutiny against Nifong, whose\n  investigation into the sexual assault accusation was called a “tragic\n  rush to accuse.” Kelly Wallace will have an update.\n \nA legend in American writing died today. Known for\n  countercultural novels such as “Cat’s Cradle” and\n  “Slaughterhouse-Five,” Kurt Vonnegut was a legendary social\n  critic who also wrote dozens of short stories, essays and plays. Richard\n  Schlesinger will take a look at the life of this writer and his influence on\n  20th Century literature.\n \nFinally, we’re going to introduce you to a\n  poet whose services reach an unusual market: the supermarket. Zach Houston hawks his wares –\n  commissioned poems – outside of grocery stores in Berkeley, California.\n  He may not be a Wordsworth, but what comes out of this wordsmith’s\n  typewriter just might surprise you. John Blackstone will have the story.\n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}