{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] Kaiser News: Thailand Will Maintain Compulsory Licenses for Kaletra,\n Efavirenz, Despite Companies' Drug Price Reductions, Health Minister Says", "body": "http://www.kaisernetwork.org/daily_reports/rep_index.cfm?DR_ID=44254\n\nThailand Will Maintain Compulsory Licenses for Kaletra, Efavirenz,\nDespite Companies' Drug Price Reductions, Health Minister Says\n\nKaiser News Network\nApr 16, 2007\n\nThailand will maintain compulsory licenses for Abbott Laboratories'\nantiretroviral drug Kaletra and Merck's antiretroviral Efavirenz,\ndespite both companies' decision to reduce the cost of both drugs, Thai\nHealth Minister Mongkol Na Songkhla said on Thursday, Reuters Health\nreports (Wong-Anan, Reuters Health, 4/12). Mongkol in January signed the\ncompulsory license, which allows Thailand to produce a lower-cost\nversion of Kaletra, into law. Abbott in March announced that it had\nwithdrawn applications to sell seven new drugs in Thailand in response\nto the compulsory license. The company on Tuesday said it plans to\nreduce the cost of Kaletra in Thailand and more than 40 low- and\nlow-middle-income countries by more than half. The company said it will\nprovide Kaletra in the countries for $1,000 per patient annually, which\nis less than the cost of generic versions of the drug, instead of the\ncurrent price of $2,200. Kaletra costs more than $7,500 per patient\nannually in the U.S., and Abbott provides the drug at a cost of $500 per\npatient annually in 69 of the poorest developing countries, including\nall of Africa (Kaiser Daily HIV/AIDS Report, 4/11). Merck also offered\nto reduce the price of its antiretroviral Efavirenz to $23 per bottle,\nbut the government can purchase a generic version of the drug from\nIndia-based drug makers for about $20 per bottle (Kaiser Daily HIV/AIDS\nReport, 3/28). Many countries -- including Brazil, Indonesia, Malaysia,\nMozambique and Zambia -- have broken or have threatened to override\npatents on antiretrovirals and drugs for other infectious diseases, the\nInternational Herald Tribune reports.\n\nComments\n\nThai officials said Wednesday that the government had not yet decided if\nthe price reduction of Kaletra would forestall compulsory licensing\n(Fuller, International Herald Tribune, 4/11). \"Compulsory licensing is\nthe only way we could attract them to sit down and talk with us over\nprice reduction,\" Mongkol said, adding, \"We will continue to talk with\nthem until we reach the point where we can optimize the accessibility of\nthe drugs to the Thai people\" (Reuters Health, 4/12). Jennifer Smoter, a\nspokesperson for Abbott, said, \"Thailand has chosen to break patents on\nnumerous medicines, ignoring the patent system,\" adding, \"As such, we've\nelected not to introduce new medicines there\" (International Herald\nTribune, 4/11). Some AIDS advocates said Abbott will have to go beyond\nits offer to reduce the price of Kaletra to the governments of more than\n40 low- and low-middle-income countries. Paul Cawthorne, head of mission\nof the Medecins Sans Frontieres, said the company had not included in\nits offer an updated version of Kaletra, called Aluvia, which does not\nrequire refrigeration. \"Abbott has to do more,\" Cawthorne said, adding,\n\"What we need to see are these new heat stable Aluvia tablets going into\npeople's mouths, and then we will be happy\" (Reuters Health, 4/12).\n\n\n\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}