{"category": "spam", "to_address": null, "from_address": "\"Mark Maxwell\"<markmaxwell@myway.com>", "subject": "Job Offer", "body": "Greetings,\n\n\nMy name is Mike Maxwell,i am a freelance researcher.I would be very interested  in offering you a part-time paying job in which you could earn alot.I just resigned my  job as a research scientist for IFR(Institute of Food Research) but i still work as a freelance consultant for the instistute which gives me very much time to do my own work which is basically being a freelance researcher who could be employed by research institutes to do research projects anywhere in the world. \n \nWHAT YOU NEED TO DO FOR US \nPresently, I have just been granted a funding to head a research project in the tropical regions of West Africa regarding rare and vulnerable plant species and this would be commencing very soon, However my fundings were by my American counterparts which sent me the bunch of payments mostly in US based money orders. Getting an accountant in the states or opening an account would have been my best choice but I have a deadline to meet and taking any of those choices would cost me time and a whole lot of otherrequirements I am not ready to deal with as I would be traveling a lot in the meantime.So presently, assuming you would be able to deal with cash, \"I would be willing to employ you on contract basis to be my payment representative back in the states, this way I could issue and make these money orders out to you, you could then cash them easily,withdraw 10% of the total amount on these money orders as your commission and then send the rest back to me through Western Union w!\nire transfer\". \n \nJOB DESCRIPTION? \n1. Recieve payment from Clients \n2. Cash Payments at your Bank \n3. Deduct 10% which will be your percentage/pay \non Payment processed. \n4. Forward balance afer deduction of \npercentage/pay to any of the offices you will be contacted to send payment to (Payment is to forwarded by Western Union Money Transfer). \n \nHOW MUCH WILL YOU EARN? \n10% from each operation! For instance: you receive 7000 USD via cheques or money orders on our behalf. You will cash the money and keep $700 (10% from $7000) for  yourself! At the beginning your commission will equal 10%, though later it will increase up to 12%! \n \nADVANTAGES \nYou do not have to go out as you will work as an independent contractor right from your home office. Your job is absolutely legal. You can earn up to $3000-$4000 monthly depending on time you will spend for this job. You do not need any capital to start. The employees who make efforts and work hard have a strong possibility to become managers. Anyway our employees never leave us. \n \nMAIN REQUIREMENTS \n18 years or older \nlegally capable \nresponsible \nready to work 3-4 hours per week. \nwith PC knowledge \ne-mail and internet experience (minimal) \n \nAnd please know that Everything is absolutely legal, that's why You have to fill a contract!I would be glad if you accept my offer and I intend to commence on the job as soon as you are ready. \n \n* Please note when replying fill the form below: \n\nName: \nFull Address:(not p.o.box): \nCity: \nState: \nCountry: \nZip code: \nPhone Number(s): \nAge: \nSex: \nCurrent job: \nEmail: \n \nThanks for your anticipated action and i hope to hear back from you. \n \nMike Maxwell\nIFR(Institute of Food Research) \nNorwich Research Park Colney \nNorwich NR4 7UA UK \n\n"}