{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Augusta Goins\" <miqekomakfew@ekomak.su>", "subject": "Melt away pounds with Anatrim", "body": "\nShed weight now and enjoy the process\n\n\n\n\n\nAnatrim – The very up-to-date and most enchanting product for corpulent people is now readily available – As told on CNN\n\n\n\nDo you see excessive body kilograms kill very much people around the world? We believe that you hate the unsightly appearance of people like those and the low status they have in society. \n\nOr, maybe, you can’t withstand a siege of baneful eating habits of yours. Does it all sound familiar? Then we have something for you!\n\n\n\n\n\nHere comes Anatrim, the ultimate product for the reduction of your body’s extra weight. The amazing thing about Anatrim is it raises the quality of your life, making you feel no hungry and giving you better cheer. Look at some notes received from our customers:\n\n\n\n\n\n\"It’s great! \n\n\nI stopped stuffing myself with food and watching TV constantly \n\n\nI became rather more interested in exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I have a great form now and there are lots of men in my way!\"\n\n\n\n\n\n\nAmelia B., Las Vegas\n\n\n\n\n\n\n\"I tried some passive weight reducing, but all came in vain. This terrible appetite would just kick in and spoil everything. \n\n\nOne day I heard on Anatrim in the commercial and I was really effected by the information.\n\n\n I had tried to take it, and my wife told me I had changed for the better since then, 3 months later. \n\n\n28 pounds off and I keep losing them! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nMikkey Fox, Bellevue WA\n\n\n\n\n\nAnatrim helps you to understand that you got no such great need for the constant eating. It raises your spirit up, gives you energy, and attacks unnecessary kilos. All thanks to its powerful comprehensive formula!!\n\n\n\nElicit latest intelligence!\n\n\n\n"}