{"category": "ham", "to_address": "Jeff Pang <pangj@earthlink.net>", "from_address": "Paul Johnson <paul@pjcj.net>", "subject": "Re: Leaving this list.", "body": "On Tue, Jun 05, 2007 at 07:55:01PM +0800, Jeff Pang wrote:\n> Ron Goral \\u5199\\u9053:\n> >I am leaving this list even though I've been here for several years. While \n> >I\n> >find the information and ideas exchanged very helpful, I am fully disgusted\n> >by the amount of spam I receive. Over this last weekend, of 172 emails I\n> >received from this list, 52 were spam. That's nearly 1 in every 3. I am \n> >told\n> >that I get this spam simply because I sent a couple emails to the list and\n> >that exposed this exclusive address to these spammers. Well, say what you\n> >will, but I feel it is the list manager's job to protect me from this crap.\n> >Since they either can't or won't, I'm signing off and deleting this \n> >mailbox.\n> >\n> \n> Are you sure?I'm pretty sure that I didn't receive even one spam from \n> this list.If that's the fact for you,maybe yor email provider has too \n> worse antispam ability then.:)\n\nI very much suspect that the spam you are receiving comes not from this\nlist, but directly to the address you use (exclusively?) for this list.\nThere is very little (read nothing) the list manager can do about this.\nYou have effectively publicised an email address to the world, and the\nspammers have found it.\n\nMight I suggest you install spamassassin, which I have found to be very\ngood at all but eliminating the spam which ends up in my inbox.  (It's\nalso written in perl.)  I also recommend procmail.  It would probably be\nfairly simple to create a rule to drop all mail to the address you use\nhere unless it has actually come from the list.\n\nSpam is a problem.  It is not going away in the near future.  I think\nyou'll find life much easier if you can find a (partial) solution to the\nproblem.  I'm sure you receive spam on other addresses you use too.\nI use my real mail address for everything and receive oodles of spam,\nbut spamassassin and procmail do an acceptable job for me.\n\n-- \nPaul Johnson - paul@pjcj.net\nhttp://www.pjcj.net\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}