{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nSecretary of State Condoleezza Rice is in Sharm el Sheik, Egypt,\n  at an international conference on Iraq. There’s been one\n  significant development already – debt relief for that war-torn country.\n  But the even bigger news might be the rare contact today between U.S. officials and those from Syria.\n  Sheila MacVicar is there and will have more.\n \nOur national security correspondent David Martin will\n  report on the diplomatic talks going on in Sharm el Sheik. And Elizabeth\n  Palmer will report from the Tehran\n  stock exchange, where investors are hoping the meeting could open the way to greener\n  financial pastures.\n \nEighteen months before the 2008 election, 10\n  Republican presidential contenders will take the stage at the Ronald Reagan\n  presidential library outside of Los\n    Angeles for their first debate. Sandra Hughes is\n  there.\n \nAnd Secret Service protection is being given to one\n  of the Democratic Presidential candidates: Barack Obama. It is the earliest in\n  a presidential campaign that protection has ever been authorized for a\n  candidate.\n \nDue to what Menu Foods is calling possible\n  cross-contamination, the pet food maker expanded its recall today. This news\n  comes as a study shows it might not be the melamine in food itself that is\n  harmful, but the combination of certain chemicals. Nancy Cordes will have\n  this and more.\n \nThousands of people jammed Capitol Square in Richmond, Virginia,\n  today hoping to get a glimpse of Queen Elizabeth. She and her husband, Prince\n  Philip, began their six-day stay in the United States today – their\n  first in 16 years. Mark Phillips will report.\n \nDo you have a favorite to win the Run for the Roses?\n  Sharyn Alfonsi will give you a peek at some of the horses competing in this\n  Saturday’s Kentucky Derby. You’ll also meet a young woman who\n  paid $9,000 for a horse that will be pitted in that race against\n  million-dollar thoroughbreds. \n \nAnd today we lost a pioneer, astronaut Wally\n  Schirra. I’ll tell you about his amazing life.\n \nThanks,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}