{"category": "ham", "to_address": "Beginners List <beginners@perl.org>", "from_address": "\"Mumia W..\" <paduille.4061.mumia.w+nospam@earthlink.net>", "subject": "Re: xterm fonts", "body": "On 05/15/2007 04:38 PM, Deboo ^ wrote:\n> I installed a minimal X sysetm with fluxbox and xterm and two other\n> terminal emulators: eterm and mrxvt. But all three of them give very\n> small fonts. WIth xterm, I was able to get a reasonable font with the\n> HUGE option in the right-click menu but I need bigger fonts. How do\n> you exactly specify bigger fonts with xterm? I am aware it's possible\n> with -f or -fn option but what comes after that? Say I wan a 10x20\n> font? it doesn't work just by typing -f 10x20\n> \n\nI use rxvt, so I'd use this:\nrxvt -fn 10x20\n\nBack when I was using Eterm, I think I did this:\nEterm -F 10x20\n\n> And how do you incorporate the custom xterm options in the default\n> fluxbox menu? Is there something to edit the menu commands?\n> \n\nFluxbox is based on blackbox, and blackbox menu file is in \n~/.blackbox/menu, so you might have to edit ~/.fluxbox/menu. I don't \nknow of a menu editing utility for blackbox/fluxbox; just edit the text \nmenu file.\n\n> Also how to use the dektop icons that DSL is able to use with fluxbox?\n> I already installed fbdesk but it seems of no use at all or is it\n> buggy?\n> \n> Regards,\n> Deboo\n> \n\nI don't know anything about the icons.\n\nFor setting fonts in terminal emulators, read the associated manual \npages and the documentation in /usr/share/doc/. You can get a \nlist of fonts that should work properly by typing \"xlsfonts | less\".\n\nYou probably don't need to modify the menu to get mrxvt to change its \nlook. If it's anything like rxvt, you can use X resources to configure it:\n\n\nmrxvt*font:10x20\n\n\nExecute this before starting mrxvt:\nxrdb -merge ~/.Xdefaults\n\n\nI hope this helps.\n\n\n\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}