{"category": "ham", "to_address": "love-hounds@gaffa.org", "from_address": "\"Adj.\" <darthkitten@gmail.com>", "subject": "[LH] Re: Love-Hounds Digest, Vol 52, Issue 6", "body": "Y'all are effing hilarious!!!!\n\nOn 5/12/07, love-hounds-request@gaffa.org  wrote:\n> Send Love-Hounds mailing list submissions to\n>         love-hounds@gaffa.org\n>\n> To subscribe or unsubscribe via the World Wide Web, visit\n>         http://gaffa.org/mailman/listinfo/love-hounds\n> or, via email, send a message with subject or body 'help' to\n>         love-hounds-request@gaffa.org\n>\n> You can reach the person managing the list at\n>         love-hounds-owner@gaffa.org\n>\n> When replying, please edit your Subject line so it is more specific\n> than \"Re: Contents of Love-Hounds digest...\"\n>\n>\n> Today's Topics:\n>\n>    1. And on the Tori front... (Spielas Alan)\n>    2. Re: And now for something completely different (Ted Jacobs)\n>    3. Re: Kate Bush -- Bad Neighbor! (more details) (ianm@brick.net)\n>\n>\n> ----------------------------------------------------------------------\n>\n> Message: 1\n> Date: Fri, 11 May 2007 19:28:40 -0400\n> From: Spielas Alan \n> Subject: [LH] And on the Tori front...\n> To: love-hounds@gaffa.org\n> Message-ID: <200705112328.l4BNSeRT007845@space.mit.edu>\n>\n> ... she proudly proclaims to be a MILF in her new video.\n>\n> I guess I can't argue with that.\n>\n> |>oug\n>\n>\n> ------------------------------\n>\n> Message: 2\n> Date: Fri, 11 May 2007 20:13:35 -0400\n> From: \"Ted Jacobs\" \n> Subject: Re: [LH] And now for something completely different\n> To: love-hounds@gaffa.org\n> Message-ID: <200705120013.l4C0DZfe017723@smtpserver1.Princeton.EDU>\n> Content-Type: text/plain;       charset=\"US-ASCII\"\n>\n> >>>For posting that...\n> May a vampire make you undead and strap you in a chair for all\n> enternity to watch that.<<<\n>\n> Yeah I'm a stinker.\n> But that is one of Eurovision's finest moments.\n> Well, next to\n>\n> http://www.youtube.com/watch?v=Sc9oT_ZmZoA\n>\n> How can you *not* share that!\n> :-D\n>\n>\n>\n> ------------------------------\n>\n> Message: 3\n> Date: Sat, 12 May 2007 00:35:53 -0500 (CDT)\n> From: ianm@brick.net\n> Subject: Re: [LH] Kate Bush -- Bad Neighbor! (more details)\n> To: love-hounds@gaffa.org\n> Message-ID: <3041.66.167.102.28.1178948153.squirrel@66.167.102.28>\n> Content-Type: text/plain; charset=iso-8859-1\n>\n> Dear Donny,\n>\n> I don't normally get drawn into these kinds of things, but for the sake of\n> argument, you should probably hear these things.  Let's address your\n> cookie-cutter \"talking points,\" one by one.\n>\n> 1) You stated \"I will never agree that carbon dioxide is pollution. In\n> fact, without carbon dioxide, there's no photosynthesis and we all die.\"\n> Of course, we all need copper in our bodies, or we would die.  However,\n> too much copper will kill you.  Too much copper in the soil, trouble  We\n> all need water in our bodies, or we would die.  However, too much water\n> can kill you (water intoxication, check it out, or, hey, drowning).\n> There's all kinds of things that are necessary in the proper balance, or\n> terrible things result.  Too much of a good thing.  Hell, too much\n> nitrogen wouldn't be good, and all of the protein in your body contains\n> it.\n>\n> Of course, you already know that.  You're just using a bad analogy to\n> support your argument.  If you wish to be intellectually honest, you may\n> NEVER use that as a talking point, ever again, in any discussion, with\n> anyone.\n>\n> 2) Global Cooling - Your statement was that \"not a single scientist\" was\n> able to answer \"Why did we have global cooling through the 1950s, 1960s\n> and half of the 1970s?\"  This is correct, in so far as a single scientist\n> did not answer it.  More accurately, several scientists HAVE answered it.\n>\n> Let's have a quick tour of global cooling, shall we?  Global cooling, that\n> brief cooldown around the 70's, back when we first started keeping really\n> accurate data, was mostly due to the release of sulfate aerosols, which we\n> have since ceased to do.  Sulfate aerosols have a large cooling effect.\n> Since you like Wikipedia, check out\n> http://en.wikipedia.org/wiki/Attribution_of_recent_climate_change#Attribution_of_20th_century_climate_change.\n>  Notice the light purple line in the chart, for the negative contribution\n> of sulfate emissions.  You can see that the modeled temperatures follow\n> the observed ones pretty well - that means that our science is getting\n> more accurate.  The Global Cooling article on Wikipedia has a heck of a\n> lot of info.  Check it out.\n>\n> You have now been informed on this topic, since your stance was that no\n> scientist has ever answered it before.  They have.  If you wish to be\n> intellectually honest, you may NEVER use that as a talking point, ever\n> again, in any discussion, with anyone.\n>\n> 3 & 4) Optimum recommendations of temperature and carbon dioxide levels.\n> Aside from medical science, scientists do not make \"optimum\n> recommendations.\"  They made predictions based on past data and explain\n> observations.  The question might be better phrased as \"optimum\n> recommendations in order to do ... what?\"  Well, if you want a lot of\n> storms and some new coastlines, yeah, let's let it cook for a while\n> longer.  The dinosaurs liked it nice and toasty, too.  We can look at\n> historical data, obtained from as many sources as we can get, and make\n> some fairly educated calculations.  Clearly, nobody wants to jack up the\n> surface albedo so high that we get another little ice age.\n>\n> Science isn't going to answer the question for you, \"How hot do you like\n> your room?\"  You'll have to figure that out for yourself, based on the\n> consequences.  Scientists haven't determined a favorite color, either.\n>\n> It boils down to something very simple ... we have precisely one (1)\n> planet upon which we may experiment.  We don't get another one if we screw\n> it up (unless you believe in The Rapture).  This leads me, personally, to\n> err on the side of caution.  We are already powerful enough to make\n> species go extinct, make new species, divert entire rivers for our\n> transportation needs, poison areas and make them uninhabitable, turn\n> deserts into oases, and so forth.  We have those abilities.  It's not a\n> stretch to think we could affect the atmosphere, too.\n>\n> Now, you probably will keep using that global cooling thing, and the bit\n> about needing carbon dioxide, but, since I have called you on it, just\n> remember that you now know better, every time you use it.\n>\n> Of course, I have a sneaking suspicion that, as someone from\n> jesusanswers.com, you figure that the Second Coming will just take care of\n> any messes people make.\n>\n> > In article <3YidnXU4GN0x7dnbnZ2dnUVZ_h2pnZ2d@giganews.com>,\n> >  yellowmatter@gmail.com (yellowmattercustard) wrote:\n> >\n> >> Donny Bravo wrote:\n> >>\n> >> > Global Warming is not about pollution. It's about carbon\n> >> > dioxide...supposedly.\n> >> >\n> >> > I will never agree that carbon dioxide is pollution. In fact, without\n> >> > carbon dioxide, there's no photosynthesis and we all die.\n> >>\n> >> Fucking hopeless.\n> >>\n> >> It's like talking to a brick wall.\n> >\n> > A brick wall with the truth written on it.\n> >\n> > But, hey, if \"fucking hopeless\" is the best you can come up with to\n> > answer my questions, you pretty much prove my point.\n> >\n> > Thanks!\n> >\n> > - Donny\n> >\n> >\n> >\n> > ................................................................\n> >        Posted via TITANnews - Uncensored Newsgroups Access\n> >              >>>> at http://www.TitanNews.com <<<<\n> > -=Every Newsgroup - Anonymous, UNCENSORED, BROADBAND Downloads=-\n> >\n> >\n>\n>\n>\n>\n> ------------------------------\n>\n> _______________________________________________\n> Love-Hounds mailing list\n> Love-Hounds@gaffa.org\n> http://gaffa.org/mailman/listinfo/love-hounds\n>\n>\n> End of Love-Hounds Digest, Vol 52, Issue 6\n> ******************************************\n>\n\n"}