{"category": "ham", "to_address": "James Peach <jpeach@samba.org>", "from_address": "Jeremy Allison <jra@samba.org>", "subject": "Re: [PATCH 1/4] Make sure groups[0] is the effective gid on FreeBSD.", "body": "On Fri, Jun 08, 2007 at 09:01:44AM -0700, James Peach wrote:\n> \n> There's 2 related issues in this patch set. The first is the BSD-style  \n> changes for setgroups, the second is the Darwin-specific changes to  \n> the order of credential operations.\n\nIf it's Darwin specific then I want it split into a Darwin-specific\nchange.\n\n> The current code intertwines these two parts in two places,  \n> set_sec_ctx() and pop_sec_ctx(). I felt that splitting the credential  \n> switch into a separate function made this a lot clearer. There is  \n> exactly one place where the credential is switched and the credential  \n> switching code is not mixed with the security context stack management  \n> code. The result is credential switching code that is easier to read,  \n> audit and log.\n\nSez you. The existing code works, and works well on all\nbut one class of broken systems (*BSD).\n\nPlease do not modify existing working code, just fix\nthe specific problem. Don't get creative here.\n\n> Yep, I have a tree with a similar patch, but the Darwin initgroups  \n> wrapper needs to be passed the UID you are switching to. Additionally,  \n> for Darwin the order of operations in the credential switch is  \n> important. This means that I can't hide all of this behind  \n> sys_setgroups().\n\nThat's a Darwin bug (IMHO). Their credentials system is now\nnon-POSIX and now non-standard.\n\nWhen are they planning to fix that ?\n\n> I would be very happy to split apply_unix_token into a separate Darwin  \n> implementation, if you would prefer that better. Perhaps it is poorly  \n> named, maybe it should be:\n> \n> \tBOOL switch_to_credential(const UNIX_USER_TOKEN *ut)\n\nNo, I want the change I asked for - a modified\nsys_setgroups that works for *BSD.\n\nIf Darwin is broken after that, then let's push for\nthem to fix their code.\n\nJeremy.\n\n"}