{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for May 1, 2007  \n\n\n\nFirst Enercast Featured Articles for May 1, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories  \n\n\nMay 1, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Apr. 30, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 30, 2007\n\n\nMay 1, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (May 1, 2007)\n\n\n\nNatural Gas Intelligence summudles for May 1, 2007\n\n\nMay 1, 2007 PowerMarketers Industry Publications\n\n\n\nNational Renewable Portfolio Standard (RPS)for Renewable Energy Credits (RECs)? (UtiliPoint.com - Apr. 30, 2007) \n\n\n\nUtiliPoint.com - Apr. 30, 2007 - As an international renewable energy developer utilizing certified emission reductions (CERs) that mandate specific procedures under Clean Development Mechanism (CDM) of the Kyoto Protocol, we find the system for Renewable Energy Credits (RECs) in the United States lacking a single national standard.\n\n\nMay 1, 2007 PowerMarketers Industry Publications\n\n\n\nRockies Project: Laying the Groundwork (EnergyBiz Insider - Apr. 30, 2007)\n\n\n\nEnergyBiz Insider - Apr. 30, 2007 - Federal regulators have given the thumbs up to one of the largest natural gas pipeline projects in recent years. The so-called Rockies Express-West line will carry gas supplies from the Rockies through the Midwest and into the eastern United States. \n\n\nMay 1, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nDTE's 1st-quarter earnings due May 2\n\n\n\nApr. 30--DTE Energy said it will host its annual shareholders meeting May 3 at the company's headquarters in Detroit.  It will announce its first-quarter earnings figure May 2, after the market closes. DTE is the parent company of Detroit Edison, which has 2.2 million customers in southeast Michigan. The state's largest power company is also the parent company of Michigan Consolidated Gas Co., ...\n\n\nApr 30, 2007 Knight Ridder Tribune Business News\n\n\n\nGas bills up again\n\n\n\nMay 1--The good news is, you probably spent less to stay warm during the winter of 2006-07.  The bad news is, the lower gas prices that saved you money are going up. National Fuel Gas Distribution Corp. has announced a 4.3 percent gas-price increase that takes effect today, bumping the bill of a typical resident, who uses 120,000 cubic feet a year, from $113.49 a month to $118.30.\n\n\nMay 1, 2007 Knight Ridder Tribune Business News\n\n\n\nWind power\n\n\n\nMay 1--PINE BLUFFS -- Business in Pine Bluffs is booming thanks to the construction of a 274-turbine wind farm south of the eastern Laramie County town.  Restaurants in town are packed in the evenings, an auto parts dealer has seen a boost in business, and every rental property in the town of Pine Bluffs is rented. \"They have used all the local resources possible to meet their needs, and we ...\n\n\nMay 1, 2007 Knight Ridder Tribune Business News\n\n\n\nAmeren says everything is on the table in talks except for rate freeze and rollbacks\n\n\n\nMay 1--ORLANDO -- Ameren Corp. says everything but a price freeze and rollback are on the table as the electric rate crisis in Illinois comes down to the wire. Speaking at an industry conference in Orlando on Monday, Ameren's top executives said they are engaged in wide-ranging and intensive discussions with lawmakers who are faced with addressing the state's sky-high electricity prices before ...\n\n\nMay 1, 2007 Knight Ridder Tribune Business News\n\n\n\nHRT bus spills 100 gallons of diesel fuel: About 35 gallons of gas leaked into storm drains after a road work sign in the street damaged the fuel tank.\n\n\n\nMay 1--HAMPTON -- Nearly all of the 100 gallons of diesel fuel that spilled from the ruptured gas tank of a Hampton Roads Transit bus Monday morning was cleaned up by the afternoon.  Crews from Hampton's fire department and an environmental waste company managed to contain most of the fuel in a vacuum truck and prevented it from flowing into local waterways and water tanks.\n\n\nMay 1, 2007 Knight Ridder Tribune Business News\n\n\n\nKentucky American seeks 29% rate rise: RESIDENTIAL BILLS WOULD GO UP $5.81\n\n\n\nMay 1--Kentucky American Water asked for a rate increase yesterday that would boost most residential customers' water bills by 29 percent.  The company filed the rate request with the Kentucky Public Service Commission, which must approve such rate changes. The PSC historically has granted Kentucky American about 50 to 60 percent of what it requests. Kentucky American says the higher rate would ...\n\n\nMay 1, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nTennessee Voices: By TOM KILGORE: Your views, concerns wanted on TVA Strategic Plan\n\n\n\nAt a time when many residents of our region are sprucing up their yards and homes for spring, we at TVA are taking a fresh look at our business and updating our Strategic Plan for the next decade. Now through May 9, we invite you to review a preliminary draft of the 2007 TVA Strategic Plan and share your comments. Developed at the direction of the TVA Board and executive leadership, the plan is a ...\n\n\nApr 30, 2007 Tennessean\n\n\n\nSPINCYCLE: Power struggle on state energy panel\n\n\n\nA charge of undue coercion, leveled by a state utility board member against a high-ranking state aide, threatens to short-circuit Gov. Eliot Spitzer's energy policy goals for weeks or months to come, insiders say. State Public Service Commission member Cheryl Buley, a patronage appointee of former Gov. George Pataki, publicly accused Spitzer's top energy adviser of improperly trying to influence ...\n\n\nApr 30, 2007 Newsday\n\n\n\nCompany wins plant contract\n\n\n\nMontgomery-based Destin Energy has been awarded a $4 million contract to supply equipment and raw materials to what will be the world's largest wood-fuel pellet plant now under construction near Selma. Destin Energy is delivering wood-burning equipment and wood-based raw materials to Dixie Pellets. As a result of securing the work, Destin has hired eight workers and opened a production facility ...\n\n\nApr 30, 2007 Montgomery Advertiser\n\n\n\n\n\nWestmoreland's Beulah Mine Wins Lignite Energy Council Safety Award\n\n\n\nAM Eastern Daylight Time Westmorelands Beulah Mine Wins Lignite Energy Council Safety Award COLORADO SPRINGS, Colo.--(BUSINESS WIRE)--Westmoreland Coal Company (AMEX: WLB) announced today that Dakota Westmoreland Corporations Beulah Mine has received the Lignite Energy Councils Distinguished Safety Award for power plants and mines. The Beulah Mine had an exceptional safety record in 2006, ...\n\n\nApr 30, 2007 Business Wire\n\n\n\nDevelopment of New Coal-Fired Generation Sources Exceeds 88 Gigawatts\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). Electric power producers are finding themselves challenged to produce the most reliable, efficient and environmentally friendly forms of energy as global demand for electricity increases to record levels. One of the most plentiful fuels available for power plant usage is coal.\n\n\nApr 30, 2007 Internet Wire\n\n\n\nutility.net Announces Commercial Broadband Rollout in Michigan with Potential to Reach One Million Customers in Coming Years:\n\n\n\nutility.net, a Los Angeles, CA based Broadband over Power Line (BPL) network provider (http://www.utility.net) , in cooperation with Consumers Energy (http://www.consumersenergy.com), which provides electric or natural gas service to 6.5 million of Michigan's 10 million residents, announces the next phase of a project to deploy Broadband-over- power lines (BPL) commercially in central Michigan. ...\n\n\nApr 30, 2007 PR Newswire\n\n\n\nRoyal Utilities Income Fund Reports 2007 Q1 Earnings\n\n\n\nRoyal Utilities Income Fund (TSX: RU.UN) -  Royal Utilities Income Fund (TSX: RU.UN) -  - Quarterly revenue from continuing operations increased to $128.0 million from $119.7 million in the first quarter of 2006  - Distributable cash from operations of $25.1 million  - Boundary Dam and Bienfait achieved three years or 2.3 million exposure hours without a recordable lost-time incident Financial ...\n\n\nMay 1, 2007 Internet Wire\n\n\n\nMidwest Renewable Energy Progressing Nebraska Ethanol Plant Expansion With More Work on the Way\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). Cooperative owned Midwest Renewable Energy LLC (Sutherland, Nebraska) is progressing with construction and expansion activity in Sutherland, Nebraska on a corn processing plant that was originally built some sixteen years ago.  For details, view the entire article by subscribing to Industrial ...\n\n\nApr 30, 2007 Internet Wire\n\n\n\nPuget Energy CEO Steve Reynolds to Present at AGA Financial Forum on May 1\n\n\n\nPM Eastern Daylight Time Puget Energy CEO Steve Reynolds to Present at AGA Financial Forum on May 1 BELLEVUE, Wash.--(BUSINESS WIRE)--Stephen P. Reynolds, chairman, president and chief executive officer for Puget Energy (NYSE:PSD), will speak at the American Gas Association 2007 Financial Forum in Orlando, Fla., on Tuesday, May 1, 2007, at 10:10 a.m. ET. A live webcast of the company's ...\n\n\nApr 30, 2007 Business Wire\n\n\n\nMarina Energy Partnership Enters Agreement to Provide Energy Services for Echelon in Las Vegas\n\n\n\nEnergy Partnership Enters Agreement to Provide Energy Services for Echelon in Las Vegas    April 30, 2007 06:30 AM Eastern Daylight Time Energy Partnership Enters Agreement to Provide Energy Services for Echelon in Las Vegas FOLSOM, N.J.--(BUSINESS WIRE)--Marina Energy LLC, a subsidiary of South Jersey Industries (NYSE:SJI), and DCO Energy have entered into a 25-year contract to develop, design, ...\n\n\nApr 30, 2007 Business Wire\n\n\n\n\n\nExelon executive leaving for Philadelphia Television Network\n\n\n\nto become chairman and CEO of cross-cultural programmer Philadelphia Television Network. Glanton has been senior vice president of corporate development at Exelon since May 2003, and was a board member at Peco Energy Co. of Philadelphia before it merged with Unicom to form Exelon (NYSE:EXC) of Chicago. Prior to joining Exelon, Glanton was a partner in the Philadelphia law offices of ...\n\n\nApr 30, 2007 Philadelphia Business Journal\n\n\n\nNuclear power should be last resort: Flannery\n\n\n\nClimate change scientist and Australian of the Year Tim Flannery says nuclear power should only be a last resort for tackling global warming. The Federal Government is planning to lift bans on nuclear power and remove impediments to uranium mining and exports. Dr Flannery has been a long-time critic of the Federal Government's climate change policies. He says there are many undesirable attributes ...\n\n\nApr 30, 2007 ABC Online\n\n\n\nPepsiCo going all renewable energy\n\n\n\nPURCHASE, N.Y., April 30 (UPI) --  PepsiCo announced the largest purchase of renewable energy certificates ever Monday, matching electricity used by all U.S. company facilities. PepsiCo's reported three-year purchase includes more than 1 billion kilowatt-hours annually, the estimated amount of electricity needed power nearly 90,000 U.S. homes each year. The move puts the soft drink and snack food ...\n\n\nApr 30, 2007 UPI\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nRenewable Energy Law Powering the Growth of the Chinese Renewable Energy Markets\n\n\n\nIn a significant move to enhance energy security and protect the environment, the Chinese Government is stepping up efforts to accelerate the development of renewable energy, so as to lift the share of high quality and clean energies in the total energy mix. The Renewable Energy Law, which came into effect on January 1, 2006, is a decisive move in this direction and requires power grid operators ...\n\n\nApr 30, 2007 PR Newswire\n\n\n\nTokyo Electric to aid South Texas nuke expansion\n\n\n\n-- NRG Energy, Inc. signed an agreement with The Tokyo Electric Power Co. to support South Texas Project's planned two-unit expansion. TEPCO owns and operates two Advanced Boiling Water Reactor (ABWR) nuclear units in Japan. NRG has proposed building two ABWR units at the STP site to bring an additional 2,700 MW of nuclear power to Texas. The agreement calls for TEPCO to consult on the design, ...\n\n\nApr 30, 2007 Power Engineering\n\n\n\nEDF Energies Nouvelles: A 24 MW Wind Farm Enters into Service in the UK\n\n\n\nAM Eastern Daylight Time PARIS--(BUSINESS WIRE)--Regulatory News: EDF Energies Nouvelles (Paris:EEN) has announced the entry into service of the Red Tile wind farm in the UK. Located in the Fenlands of east England, this new facility comprises 12 REpower MM82 wind turbines, each with a unit capacity of 2 MW. The Red Tile wind farm, which is wholly-owned by EDF Energies Nouvelles, has 24 MW in ...\n\n\nApr 30, 2007 Business Wire\n\n\n\nEnvironment-Friendly Renewable Energy Market Exhibits Considerable Development in Australia and New Zealand\n\n\n\nPM Eastern Daylight Time DUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c55260) has announced the addition of the Frost & Sullivan report: ANZ Renewable Energy Markets to their offering. This Frost & Sullivan research service titled ANZ Renewable Energy Markets provides a comprehensive study of the various types of renewable energy technologies ..\n\n\nApr 30, 2007 Business Wire\n\n\n\nAlcan and Ma'aden sign heads of agreement for proposed US$7 billion \"mine-to-metal\" joint venture\n\n\n\nFully integrated project to include bauxite mine, alumina refinery, power plant and aluminum smelter in Saudi Arabia     RIYADH, Kingdom of Saudi Arabia, April 30 /PRNewswire-FirstCall/ -     Project Highlights: ------------------     - 90 Mt bauxite reserve - representing a potential 30 years of mining     - 1.6  Mt/y alumina refinery     - Power plant delivering 1,400 MW to ...\n\n\nApr 30, 2007 PR Newswire\n\n\n\nRWE and RAO UES to increase efficiency of TGC-4 power plants\n\n\n\n- German utility RWE and the Energy Carbon Fund of Russian energy player RAO UES have agreed to develop a project that is aimed at increasing the energy efficiency of the Territorial Generation Company-4 (TNC-4) power plants. During the first phase of the TNC-4 joint project, RWE's experts will assess the potential for reducing greenhouse gas emissions at the plants and for improving the ...\n\n\nApr 30, 2007 Power Engineering\n\n\n\nDuPont Introduces Thermal Mass Innovation for Sustainable Construction\n\n\n\nDuPont(TM) Energain(R) Reduces Air Conditioning & Heating Costs up to 35 Percent WILMINGTON, Del., April 30 /PRNewswire-FirstCall/ -- DuPont (NYSE: DD) has introduced DuPont(TM) Energain(R), an innovative concept in thermal mass that provides a long-term sustainable solution to reduce energy consumption and greenhouse gas emissions in public, commercial and residential buildings.\n\n\nApr 30, 2007 PR Newswire\n\n\n\nSolar EnerTech's Production Increases to Meet Demand\n\n\n\nSolar EnerTech Corp. (OTCBB: SOEN) (the  Solar EnerTech Corp. (OTCBB: SOEN) (the \"Company\") is pleased to announce that during the month of April, it received six new purchase orders from Spain, Malaysia, Turkey and South Africa, as well as from domestic buyers.  The Company is accelerating its manufacturing capacity, to meet this demand by formally launching a two-shift work schedule for its ...\n\n\nApr 30, 2007 Internet Wire\n\n\n\nMachineTalker Electrifies Energy Audit Market, Introduces GreenTalkers(TM)\n\n\n\nMachineTalker, Inc. (OTCBB: MTKN),  MachineTalker, Inc. (OTCBB: MTKN), developer of smart wireless security networks and tracking systems, announces that the company has successfully tested and demonstrated three versions of its GreenTalker(TM) line of intelligent wireless mesh networked sensors.  The combined set of Talkers&#174; monitors electrical Current, Pressure and Flow, and maintains a ...\n\n\nMay 1, 2007 Internet Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}