{"category": "ham", "to_address": "Damian Conway <damian@conway.org>", "from_address": "Mark Overmeer <mark@overmeer.net>", "subject": "Re: Referring to source code within Perldoc: the new A<> code", "body": "* Damian Conway (damian@conway.org) [070621 08:07]:\n> Mark Overmeer wrote:\n> [...yet another honest and heartfelt plea for Pod 6 to be something\n> entirely different from what it is currently designed to be.]\n\n> The solution is simple, you know, Mark. Why not just write up your own\n> alternate S26, redesigning Pod 6 the way you think it should work, and\n> then publish your proposal for consideration here?\n\nYou may remember that I repeatedly asked @Larry not to forget the\ndocumentation aspect in the redesign of Perl, in person during various\nYAPCs and Workshops.  Then, when you finally took the challenge, I have\nsend you a extensive email showing various alternative syntaxes for\ncondensed, integrated documentation strategies. (2 nov 2005)\n\nThose design examples are far from a detailed design, because that\ntakes weeks, not hours.  Besides, there are a few good alternatives\nwhen the code/doc separation doctrine is left.  For instance, Juerd's\n\"is documented\" traits.\n\nI have already proven that adding some simple logical markup to the POD(5)\nsyntax can simplify the documentation process enormously, with my OODoc\n(::Parser::Markov).  As I already reported in one of the initial messages\nof this (long) thread, the tool saved me to type 700.000 characters of\n(needed dupplicated) text for my MailBox suite alone.  That was a simple\ngain within the classical POD dogma; with real integration, we can\nreduce our documentation efforts much further.\n[Shall I give a lightning talk on OODoc in action, at upcoming YAPC::EU?]\n\n> After all, Larry's track record is clear: he's never once allowed\n> someone's reputation or status (even his own!) to deter him from\n> replacing an existing design with someone else's superior one.\n\nTrue.  However, when the common @Larry believe is that POD6 should build\non POD(5) ideas of orthodox orthogonalism, then it is a waste of my\nsparse time.  I am not afraid to take such challange, opposit of that:\notherwise this discussion probably had died out days ago.  But I do have\na number of large Perl(5) projects on my hands already.\n-- \n               MarkOv\n\n------------------------------------------------------------------------\n       Mark Overmeer MSc                                MARKOV Solutions\n       Mark@Overmeer.net                          solutions@overmeer.net\nhttp://Mark.Overmeer.net                   http://solutions.overmeer.net\n\n"}