{"category": "ham", "to_address": "R-help@stat.math.ethz.ch", "from_address": "elvis@xlsolutions-corp.com", "subject": "[R] Course***New R course by Dr Bill Venables: Traditional and\n\tModern Approaches to Statistical Modelling with R /\n\tWashington, DC July 12-13", "body": "XLSolutions Corporation is proud to announce our July 12-13, 2007\nTraditional and Modern Approaches to Statistical Modelling with R  - in\n Washington, DC by Dr Bill Venables.\nhttp://www.xlsolutions-corp.com/RStatsBV.htm\n\n\n**** Washington DC, July 12-13, 2007\n\nReserve your seat now at the early bird rates! Payment due AFTER\nthe class\n\nCourse Description:\n\nR and R+ offer a large choice of facilities for classical and modern\napproaches to statistical modelling. Dr Bill Venables will present R as\na complete data analysis and graphics environment and will focus on R\nprogramming strategies for handling standard and non-standard\nstatistical modelling problems with the following outline:\n\n- Statistical modelling in R: Modelling strategies, purposes, R tool and\noperating paradigms\n- Trellis graphics for data presentation and inspection.  \n- Classical linear models: regression and analysis of variance, \n- Model fitting - choice of variables, use of the AIC and competitor\ncriteria for model selection, stepwise methods and their hazards\n- Diagnostics and transformations.  \n- Robust and resistant methods.  \n- Generalized linear modelling, Logistics regression, Log-linear models,\nNegative binomial and Multinomial models.  \n- Classical and bootstrap methods for confidence intervals. Bayesian\nbootstrap.  \n- Non-linear and smooth regression: Least squares non-linear regression,\nmodel, fitting and diagnostics. Alternative algorithms.  \n- Penalized likelihood methods: Additive and generalized additive\nmodels: fitting, display and prediction. ACE and AVAS exploratory\ntechniques.  \n- Linear mixed effects models. Model fitting and diagnostic inspection.\nEstimation and prediction.  \n- Generalized linear mixed effects models: fitting procedures and\ndiagnostic checking.  \n- Non-linear mixed effects models. Fitting procedures and key examples. \n\n- Generalized estimating equations (GEE) methods .  \n- Tree-based models for regression and classification. Implementation\nwith tree and rpart fitting functions. Pruning and model selection by\ncross-validation.  \n- Bootstrap aggregation and prediction.  \n- Classification: linear and quadratic discriminant analysis, Projection\npursuit regression. \n- Neural netorkds for classification with extended examples.  \n- Hands-on Examples.  \n\n\n\nEmail us for group discounts.\nEmail Sue Turner: sue@xlsolutions-corp.com\nPhone: 206-686-1578\nVisit us: www.xlsolutions-corp.com/training.htm\nPlease let us know if you and your colleagues are interested in this\nclassto take advantage of group discount. Register now to secure your\nseat!\n\nInterested in R/Splus Advanced course? Coming up in San Francisco and\nSeattle  - July 2007 - email us.\n\n\nCheers,\nElvis Miller, PhD\nManager Training.\nXLSolutions Corporation\n206 686 1578\nwww.xlsolutions-corp.com\nelvis@xlsolutions-corp.com\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}