{"category": "ham", "to_address": "\"Doran, Harold\" <HDoran@air.org>", "from_address": "Jean-Baptiste Ferdy <Jean-Baptiste.Ferdy@univ-montp2.fr>", "subject": "Re: [R] degrees of freedom in lme", "body": ">> This is such a common question that it has a an \"FAQ-like\" response from Spie Bates. Google \"lmer p-values and all that\" to find the response. \n>Isn't this a different question, though, since Jean-Baptiste is using>nlme. \n>Details on the calculation of DF in nlme can be found in chapter 4 of>the book by Pinheiro and Bates \"Mixed Effects Models in S and S-PLUS.>Using the formula provided, I get denDF of 10 for level 1 and 32 for>level 2. I'm not sure why lme is using the denDF estimated at level 2 in>this example ...\nMy question was more on the fact that anova.lme seems to behave differently when called on a two way ANOVA than when called on an ANCOVA. I am sure that DenDF is estimated with the same procedure in the two situations and, I as already said, I understand there is a real issue with calculating dfs and p-values in this kind of situation. \nBut again I thought this issue was serious only in the case of unbalanced data sets. When data are balanced my guess was that lme and the traditional strata approach would give essentially the same answer. This is indeed what happens in the case of an ANOVA (and that's what Pinehiro and Bates say in section 2.4 of their book) but not in the case of an ANCOVA.\nDoes all this mean that we should forget the F-test provided by lme and turn to the approach used in lme4??-- Jean-Baptiste FerdyInstitut des Sciences de l'Évolution de MontpellierCNRS UMR 5554Université Montpellier 234 095 Montpellier cedex 05tel. +33 (0)4 67 14 42 27fax  +33 (0)4 67 14 36 22\n______________________________________________R-help@stat.math.ethz.ch mailing listhttps://stat.ethz.ch/mailman/listinfo/r-helpPLEASE do read the posting guide http://www.R-project.org/posting-guide.htmland provide commented, minimal, self-contained, reproducible code.\n\n"}