{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Michael Pobega <pobega@gmail.com>", "subject": "Re: The GPL and soundfonts", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nOn Mon, Jun 04, 2007 at 06:20:27PM -0300, cascardo@minaslivre.org wrote:\n> On Mon, Jun 04, 2007 at 03:41:29PM -0400, Michael Pobega wrote:\n> > > Although I would agree with that, the main matter here is not whether\n> > > this WAV file would be appropriate for main or contrib, but whether it\n> > > is distributable at all, since the GPLv2 requires complete source code,\n> > > which includes \"the scripts used to control compilation and installation\n> > > of the executable\".\n> > > \n> > > Regards,\n> > > Thadeu Cascardo.\n> > > \n> > > \n> > \n> > In that case then I believe that the WAV would be undistributable, since\n> > the program used to create/compile it (Depending upon how you look at\n> > it) is undistributable under the GPL. So would that throw the WAV file\n> > in non-free?\n> > \n> \n> No! Non-free is for distributable software. Non-distributable means you\n> would infringe someone's copyright if you ever distributed the work.\n> There are those software which are distributable (in the sense that, in\n> some conditions, you could distribute it), but those conditions are not\n> appropriate for distributing in Debian (even in non-free). For example,\n> if Debian had to pay a fee for each copy made by a user.\n> \n> The solution here would be to ask the MIDI author to distribute it under\n> another license.\n> \n> IANADD,\n> Thadeu Cascardo.\n> \n> \n\nOh, wow, I can't believe I didn't notice that. I must not have been\nthinking when I said non-free, sorry. And yeah, the best thing to do\nhere is to ask the original MIDI author to distribute it other another\nlicense, otherwise I think you're stuck.\n\n- -- \nhttp://digital-haze.net/~pobega/ - My Website\nIf programmers deserve to be rewarded for creating innovative\nprograms, by the same token they deserve to be punished if they\nrestrict the use of these programs. \n - Richard Stallman\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGZIcdg6qL2BGnx4QRAgqgAJ4rcxJpNmUR2MMA9aUlCLdBNi4c8gCglMHL\ngRZLyNZpsbrzTOaBk5x1nMM=\n=MiNF\n-----END PGP SIGNATURE-----\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}