{"category": "ham", "to_address": "\"Roshan Sumbaly\" <rsumbaly@gmail.com>", "from_address": "sj <ssj1364@gmail.com>", "subject": "Re: [R] Help in ARIMA", "body": "Sounds more like you would want to explore the use of some sort of Queueing\nmodel. A quick search of R help did not yield any packages that could be\nused to develop such models, but I think that modeling simple queuing\nsystems and estimating wait times is pretty straight forward and could be\nprogrammed in R. Hopefully someone out there will have more/better advice.\n\nGood luck,\n\nSpencer\n\n\nOn 6/19/07, Roshan Sumbaly  wrote:\n>\n> I am working on a data set which has the waiting times taken of jobs\n> running\n> on a cluster. I need to come up with a method to use this historical data\n> to\n> come up with a prediction for the future. Even probably try simulating the\n> full history (as in I have history of the job submission time and running\n> time,etc). So I can run through the actual history and at every job\n> submission, depending on the status of the cluster, try to predict the\n> waiting time. Can I do this using any of the models used in R?\n>\n> Particularly \"forecast\"...Can I used ARIMA or ARMA for this? ...The\n> problem\n> is I don't think I'm dealing with time series because the measurements of\n> waiting times (at a particular state i.e. job submission) ain't done at\n> regular intervals. Could anyone please suggest a model for this?\n>\n> Thanking you,\n> RS\n>\n>         [[alternative HTML version deleted]]\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide\n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n\t[[alternative HTML version deleted]]\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}