{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Zachary Kline\" <Z_kline@hotmail.com>", "subject": "Re: gentoo dropping speakup support", "body": "Hello,\n    I agree.  It is simply not going to work if it is forced into user \nspace.  The fact I have a supported hardware synthesizer means that I'm able \nto read everything as it comes up, debug things that don't, etc.  I couldn't \ngo back to even software speech, because with software speech you don't get \nthat, and the reason is user space.  Speech-dispatcher and speechd-up and \nsuch are userspace programs, and so if the machine doesn't get to a point \nwhere they can launch we're dead in the water.  I for one am going to be \nattending a university in the fall, and don't look forward to having to ask \na sighted person to tell me what the kernel panic says or how the FSCK is \ncoming.\nPlease, if possible reconsider this decision.  It is extremely unproductive \nin the longterm.  Any problems Speakup may have building with 2.6.22 will be \nfixed in due course.\nThank you,\nZachary Kline.\n\n----- Original Message ----- \nFrom: \"Travis Siegel\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Sunday, June 17, 2007 7:20 PM\nSubject: Re: gentoo dropping speakup support\n\n\n>I have to strongly disagree here as relates to bootable messages.\n> Speakup makes linux the *only* os where blind users can see the boot\n> up as it happens.  Even dos can't do that, and I have more than once\n> managed to fix a machine with linux because of the speakup capability\n> to speak *all* bootup messages.  Dumping them to a logfile, booting\n> with a live cd, then reading the log may work for users who are\n> advanced enough to figure it out, (or are lucky enough to have simple\n> enough configurations this can be done) but by doing so, you're\n> basically saying that those who want to troubleshoot their own boxes\n> w/o sighted assistance are sol.\n> And, if the hd is bad, then your logging isn't going to work anyhow.\n> Not to mention, this isn't a process that can be done w/o sighted\n> assistance.\n> While I'm more of a slackware user than anything else, having speakup\n> work out of the box is something I've enjoyed almost since speakup\n> was released, and I for one would be extremely sorry (not to mention\n> irritated at the lack of access it would mean) to have it removed\n> into user space.  There's already programs for user space access\n> (yasr anyone) and while those work for normal usage, they aren't\n> usable for troubleshooting and/or fixing a broken machine.  I've been\n> doing my own technical support since 1990 (or thereabouts) and having\n> this capability now removed would be the equivalent of moving to\n> vista before any screen readers were specifically targeted to it.\n> Sure, you could use the system, but you're not going to get anywhere\n> near the full use out of your system you'd otherwise get.\n>\n> I don't have a 64-bit machine, so can't help fix this problem, nor\n> are my C skills up to the task (likely) but I'd strongly urge those\n> with the capability, to *not* abandon speakup working as it does now.\n> I will of course help where I can, but yanking it entirely out of the\n> boot sequence is just asking for additional problems.\n> Don't do it.\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}