{"category": "ham", "to_address": "Ip-health <ip-health@lists.essential.org>", "from_address": "James Packard Love <james.love@keionline.org>", "subject": "[Ip-health] Compulsory licence debate comes to the Philippines", "body": "http://www.managingip.com/?ISS=23713&PUBID=34&Page=10&SID=682672&TYPE=20\n\nCompulsory licence debate comes to the Philippines\nHechanova Bugay & Vilchez, Manila\n\nPending before the Philippine Congress and certified as urgent by\nPresident Gloria Macapagal Arroyo are two bills or proposed laws:\nHouse Bill No. 6035 and Senate Bill No. 2263. Both have the objective\nof providing cheaper medicines, and are expected to be approved in\nthe coming session of the Congress in June 2007. One common subject\nmatter tackled in these bills is the amendment of Section 74 of the\nIntellectual Property Code (IP Code, RA 8293) referring to compulsory\nlicensing of a patented invention by the government. Under RA 8293,\nthe use by the government or a third person authorized by the\ngovernment may be done without the agreement of the patent owner in\ntwo instances. First, if there is a public interest requirement, or\nsecondly, if a judicial or administrative body has determined that\nthe exploitation by the patent owner is anti-competitive, but subject\nto compulsory licensing. The terms and conditions of the licence are\ndetermined by the Bureau of Legal Affairs of the Intellectual\nProperty Office in an action for compulsory licensing.\n\nHB 6035 seeks to introduce a new chapter into the IP Code with the\ntitle Non-Patentable Inventions, Parallel Importation, Early Working\nProvisions, and Government Use of Drugs or Medicines. The salient\npoints of this new chapter are:\n\nTo allow the government or a third person authorized by the\ngovernment, without the agreement of the patent owner, to exploit the\ninvention of a drug or medicine in cases of national emergency or\nother circumstances of extreme urgency, or where there is public non-\ncommercial use of the patent by the patentee without a satisfactory\nreason.\n\nThe control, supervision and determination of the use or exploitation\nof the invention is lodged with the Secretaries of the Department of\nHealth and Department of Trade and Industry, which means the\nrequirement for the filing of an action for compulsory licensing is\ndone away with.\n\nThe determination of the Secretaries of the Department of Health and\nDepartment of Trade and Industry is immediately executory and is not\nsubject to any temporary restraining order or preliminary injunction\nor other provisional remedies that will prevent the implementation of\nthe decision.\n\nIn the case of SB 2263, by simply notifying the patent holder within\na reasonable period, in situations of national emergency or other\ncircumstance of extreme urgency, public non-commercial use, the use\nor other exploitation of drugs or medicines by the government or\nthird person authorized by the government shall be subject to the\nexclusive determination of the president of the Republic of the\nPhilippines and shall be immediately executory, and can only be\nrestrained or enjoined by the Supreme Court.\n\nIn both HB 6035 and SB 2263, the requirement for the filing of an\naction for compulsory licensing has been eliminated, the\ndetermination of the government to use or exploit the invention or\ndrug is immediately executory and cannot be subject to a temporary\nrestraining order, preliminary injunction and other provisional\nremedies, and instead notices to the patent holders shall apply, to\nenable the government to deliver cheaper medicines or drugs in public\nhealth emergency situations.\nEditha R Hechanova\n\n----------------------------------------------\nJames Packard Love\nKnowledge Ecology International\nmailto:james.love@keionline.org\ntel. +1.202.332.2670 / U.S. mobile+1.202.361.3040, Geneva mobile\n+41.76.413.6584\n\n\"If everyone thinks the same: No one thinks.\" Bill Walton\"\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}