{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 23, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESEx-Gonzales Aide Denies Role In Firings\nThe Justice Department's former White House liaison denied playing a major role in the U.S. attorney firings and blamed the\n                        Deputy Attorney General Paul McNulty for misleading Congress about the dismissals, calling his explanation \"not fully candid.\" More...Watch: Ex-Gonzales Aide On Firings\n• House Takes Aim At Gas Price Gougers\n                     \t\t\t\t\t| Watch• U.N.: Iran Enriching More, Closing Doors• Bush: Bin Laden Had Iraq PlanU.S.Millionaire Couple Charged With Slavery\nA millionaire couple accused of keeping two Indonesian women as slaves in their luxurious Long Island home and abusing them\n                        for years have been indicted on federal slavery charges. More...\n• Lost Katrina Dogs Returned To Owner• Washington Girl Wins Geography Bee• Porn Star Rats Out Cop Over Roadside Tryst• More StoriesWorldIndia Wall Collapse Kills At Least 27 \nA wall collapsed at a bar in southern India after being lashed by heavy rains. A news agency reports at least 27 people were\n                        killed. More...\n• U.N.: Iran Enriching More, Closing Doors• U.S. Works To ID Body Found By Iraqis\n                     \t\t\t\t\t| Watch• Truce Holds, Refugees Flee Lebanon Camp\n                     \t\t\t\t\t| Watch• More StoriesPoliticsBush's Consumer Safety Nominee Bows Out\nPresident Bush's pick to head the Consumer Product Safety Commission withdrew his nomination amid strong opposition from some\n                        Senate Democrats because of his career as a manufacturers' lobbyist.\n                         More...\n• House Takes Aim At Gas Price Gougers\n                     \t\t\t\t\t| Watch• Could McCain Be Burned By A Fiery Temper?\n                     \t\t\t\t\t| Watch• Bush: Bin Laden Had Iraq Plan• More StoriesHealthNew Treatments Battle Cellulite Bumps\nWhether you're plus-size, petite, a couch potato or an athlete, most women have lumps and bumps called cellulite. Now there\n                        are some treatments that can reduce the unsightly fat many women battle. More...Watch: Combating Cellulite\n• Philadelphia's Maternity Ward Crunch\n                     \t\t\t\t\t| Watch• Period-Free Birth Control Pill Approved\n                     \t\t\t\t\t| Watch• Darth Vader's Psyche: What Went Wrong?\n                     \t\t\t\t\t| Watch• More StoriesSciTechMaking A Raucous Noise Unto The Whales\nMarine scientists hope banging on pipes may herd two wayward humpback whales back down the Sacramento River toward the Pacific\n                        Oean. So far, it hasn't worked.  More...Watch: Setback In Whale Rescue\n• Shark Gives Birth Without A Father • New Summer Danger For Kids: Too Much Media• California Pushes EPA On Emissions Laws• More StoriesBusinessU.S. Flights To China Will Double By 2012\nDaily passenger flights between the United States and China will more than double by 2012 and air cargo companies will have\n                        virtually unlimited access to China as part of a new aviation agreement. More...\n• FAA Expands Flight Flexibility• How The Web Can Make You A Smart Shopper• Ex-Coke Secretary Gets 8 Years In Jail• More StoriesEntertainmentTensions Erupt On \"The View\"\nThe bubbling political and personal tension between Rosie O'Donnell and Elizabeth Hasselbeck came to a head on \"The View\"\n                        today when the two resurrected their fight about O'Donnell's comments on the U.S. troops in Iraq and terrorists. More...\n• Jessica Alba Is A Bad, Bad Girl\n                     \t\t\t\t\t| Watch• Jordin Or Blake?• Oprah \"Stunned\" By Dad's Plan For Book\n                     \t\t\t\t\t| Watch• More StoriesOpinionPolarized Polls\nPartisan politics have led to a sharp rise in polarized respondents over the past 20 years as people answer poll questions\n                        in a way that suggests they know what's expected of them, writes CBS News director of surveys Kathy Frankovic. More...\n• If Gonzales Won't Leave, Force Him Out\n                     \t\t\t\t\t| Watch• Nothing For Everyone\n                     \t\t\t\t\t| Watch• After-Words• More StoriesCBS NEWS BROADCASTSThe Early Show: Fla. Governor Takes On Gas Prices\nGas prices have reached record highs and people are reaching their breaking points. Florida Gov. Charlie Crist has joined\n                        forces with 21 other governors to ask Congress to investigate why oil companies are reaping such huge profits. More...Watch: Florida Governor On Gas Prices\n• EARLY SHOW: New Treatments Battle Cellulite Bumps\n                     \t\t\t\t\t| Watch• EARLY SHOW: Swimsuits For Any Shape\n                     \t\t\t\t\t| Watch• EARLY SHOW: Student Loan Payback Strategies\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nOrangutan Rampage In TaiwanCBS News RAW: An escaped orangutan went on a rampage at a public park in Kaohsiung, Taiwan. The 10-year-old ape was\n                                    pursued for two hours, before being tranquilized by agricultural officials.\nTOP VIDEOS\nCapitol Bob On '08 Candidates\nFirst Look: Insurance Expose\n'Pirates' Stars In Tokyo\nTarantino On 'Death Proof'\nCraig, Green In Fantasy Movie\nMissing U.S. Soldier Found?\nEx-Gonzales Aide On Firings\nTarantino, Russell At Cannes\nCombating Cellulite\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMike Wallace profiles GOP presidential hopeful Mitt Romney, this Sunday, 7 p.m. ET/PT.48 Hours MysteryDeath Of A Dream:An aspiring Broadway dancer is murdered. Did her secrets contribute to her death? Erin Moriarty\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}