{"category": "spam", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "\" Shirley\" <xrmcaalouj@nbczvamzwmrz.com>", "subject": "Can you afford to lose 300.000 potential customers per year!?", "body": "Can you afford to loose 300,000 potential customers per year ?\n\nHow would You like to divert 1000s of fresh,\nnew visitors daily to Your web site or affiliate web site from\nGoogle, Yahoo, MSN and others At $0 cost to you...?\nNever seen before! Brand new for 2007!\n\nVisit my website:\nhttp://www.promote-biz.net/instantbooster/\n\nIf you don't try this incredible software, you are just plain off your rocker.\n..iNSTANT BOOSTER diverts 1000s of fresh,\nnew visitors daily to Your web site or affiliate\nweb site from Google, Yahoo, MSN and others\nat $0 cost to you!\n\n..No matter what you are selling or offering -\nINTSANT BOOSTER will pull in hordes of potential customers to your website - instantly!\n..Automatically Get 1000's of other High Ranking web\nsites eagerly linking to your web site no questions\nasked.\n\n..your web site will quickly achieve Ultra High Link\nPopularity on the Major Search Engines\n..you'll get 1000's of Highly Targeted visitors to your\nweb site or affiliate web site overnight\n\nVisit my website:\nhttp://www.promote-biz.net/instantbooster/\n\niNSTANT BOOSTER WILL:\n----------------------\n--Instantly boost your website's traffic\n--Instantly boost your sales\n--Instantly boost your income\n\nFeeling desperate by the lack of traffic coming to your site ?\n\nTried every imaginable \"guaranteed traffic\" system ?\nIf your sales are lagging, you could score a success for your business by\nimplementing iNSTANT BOOSTER.\n\nVisit my website:\nhttp://www.promote-biz.net/instantbooster/\n\nThe truth is you do NOT need 30 different systems bringing a hand full of traffic\nto your site - you only need ONE surefire method that\nwill bring thousands of potential customers to your site.\n\nWell, I've got great news for you.\n\nOne day I had an idea. An amazing idea actually.\nWhat if you could drive 1000s of customers to your website from the major\nsearch-engines that are exclusively looking for your product/offer for free ?\nWhat about an instant number one ranking for your keywords, for free ?!\nI have developed a program that will automatically do this for you\n\n- it's called iNSTANT BOOSTER.\n\nUnlike any other advertising software iNSTANT BOOSTER will\ninstantly divert 1000s of fresh new visitors daily to your web site or\naffiliate web site from Google, Yahoo, MSN and others - FOR FREE!\n\nVisit my website:\nhttp://www.promote-biz.net/instantbooster/\n\n\n\nUnsubscribe by sending email:\nwebmaster@promote-biz.net\n\n\n\n\n"}