{"category": "ham", "to_address": "Andreas Barth <aba@not.so.argh.org>, Florian Weimer <fw@deneb.enyo.de>,\n   431109@bugs.debian.org, Santiago Vila <sanvila@unex.es>,\n   debian-legal@lists.debian.org", "from_address": "Robert Millan <rmh@aybabtu.com>", "subject": "Re: Bug#431109: [PROPOSAL] Disambiguate of Section 12.5, Deprecate GPL/LGPL symlinks", "body": "On Sun, Jul 01, 2007 at 12:49:58PM +0200, Andreas Barth wrote:\n> * Florian Weimer (fw@deneb.enyo.de) [070630 10:16]:\n> > * Santiago Vila:\n> > \n> > > +         file.  Packages should not refer to GPL and LGPL symlinks in\n> > > +         that directory since different, incompatible versions of these\n> > > +         licenses have been published by the Free Software Foundation,\n> > > +         hence using the symlinks could lead to ambiguity.\n> > >\n> > > I disagree with this. It should be ok to point to the latest version\n> > > of the GPL if the program says \"Version X or later\". Many programs\n> > > do that, and we should not need to change them.\n> > \n> > But do we really want to license everything which is \"GPL version 2 or\n> > later\" under the GPL version 3?\n> > \n> > And how do we discriminate between \"GPL version 2 or later\" and \"GPL\n> > version 3 or later\"?\n> \n> If it says \"version N or later\", we should of course point to the\n> *earliest* version to give users the choice which version they want.\n\nThere's nothing about the earliest giving user more choice than the\nlatest.  If instead of GPL 2 and GPL 3, we call them GPL Foo and GPL Bar,\nwe get:\n\n  - Program is licensed under either GPL Foo, GPL Bar, or future versions\n  that don't exist yet.\n  - Since both Foo and Bar are DFSG-free [1], we are allowed to distribute it\n  under the terms of either.  This doesn't take away freedom from our users,\n  who are still able to use it as per the terms of Foo or Bar.\n\nAISI, the reason for using the unversioned link is that it means less work\nfor maintainers (and the work *is* significant when it comes to lots of\npackages) who have to update the copyright file every time license changes.\nMost GPL programs out there are 2-or-later, so we are always allowed to\ndistributed as per the latest GPL.  The opposite does not apply.\n\n[1] Even if DFSG-freeness of GPL 3 were to be disputed, this proposal is\n    completely agnostic about that.\n\n-- \nRobert Millan\n\nMy spam trap is honeypot@aybabtu.com.  Note: this address is only intended\nfor spam harvesters.  Writing to it will get you added to my black list.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}