{"category": "ham", "to_address": "GCompris developpers list <gcompris-devel@lists.sourceforge.net>,\n   Joshua N Pritikin <jpritikin@pobox.com>", "from_address": "bruno.coudoin@free.fr", "subject": "Re: [sugar] [gcompris-devel]  More than 10 Activities Solution?", "body": "Selon Joshua N Pritikin :\n\n> On Fri, May 25, 2007 at 09:51:05AM +0200, Marco Pesenti Gritti wrote:\n> > Mike Sloman wrote:\n> > > I have browsed through the mail lists and the HIG docs but have found no\n> > > mention for a scheme to cope with more than 10 Activities in the Actions\n> > > section of the frame.\n> >\n> > All the activities will be accessible from the Journal. Kids will be\n> > able to add/remove them from the frame (also the bottom panel of the\n> > frame will be \"scrollable\").\n>\n> I don't think only scrollable will work so well with GCompris. Currently\n> GCompris organizes activities into a tree. There are 8 top-level\n> activity categories and lots of activities beneath each category.\n>\n> As you know, GCompris is being ported to the sugar environment so we\n> need to think about a proper solution.\n\nThe way I see it, each GCompris activity will provide it's own control bar so\nit's not necessary to have it at Sugar level.\n\nTo explain it better, Sugar will let you run each individual GCompris activity,\nand thus it replaces our internal menu.\n\nSome news on our side, we are moving slowly but surely to an architecture that\nsuits the Sugar environment. Our latest trunk no more use SDL_Mixer but use\ngstreamer instead for the audio backend and we integrated the gnomecanvas as a\nstatic library to remove the dependancy burden.\n\nWe have created a gcomprixo branch in our svn to continue the modification\ntowards a Sugar friendly GCompris. Yesterday, we integrated the Sven's libccc\ncanvas library based on cairo. We plan to use it to move to the cairo path.\n\nBruno.\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}