{"category": "ham", "to_address": "dave@kanecap.com", "from_address": "Terry Therneau <therneau@mayo.edu>", "subject": "Re: [R] Showing NAs when using table()", "body": "Rephrasing David Kane's example\n\n> b <- c(1,1,1,1,1, NA, 2,2,2,2)\n> d <- factor(c(rep(c(\"A\",\"B\",\"C\"), 3), NA))\n> table(b, d, exclude=NULL)\n      d\nb      A B C\n  1    2 2 1\n  2    1 1 1\n   0 0 1\n\nWhy are only 9 observations instead of 10 listed in the table?\n\n This is a long-standing bug in Splus and R.  Peter Dalgaar suggests\nrecoding the factor variable so that \"NA\" is a level, rather than a \"missing\".\nThis works, but it does not address the bug: for most of my factor variables\nI want missing to be missing so that omission works as expected in modeling.\nThe exclude argument in table() should do what it says it does, which is to\nlist ALL data in the table when exclude=NULL.\n\n  At Mayo, we have replaced the table command to work around this (in place for\n5+ years now).  It has two additions: a method for factors that correctly\npropogates the exclude argument, and a change to exclude=NULL as the\ndefault.  Table() is used, 99% of the time, to look at data on screen, and\nthe number of missing is often the first question I'm asking; so we found the\ndefault to be, shall we say, non-intuitive.  \n   We argued these points with Insightful many years ago and got nowhere, the\nreplys being a mix of a) it's not really broken and b) if we change it it might\nbreak something.  We had not carried the argument forward to the R community,\nand just fix it ourselves.  The revised version just works better day to day.\n\n   In R, the manual page has been revised to state that the exclude argument\nis something different for factors, so I expect to remain in the minority.\n(I can't think of a time I would ever have wanted the actions of the new\nversion of exclude, which for factors is a means only to exclude more things,\nrather than the usual use of keeping more in the table).  \n\n\tTerry Therneau\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}