{"category": "spam", "to_address": "Gnitpick <gnitpick@flax24.uwaterloo.ca>", "from_address": "Vanessa Finley <istoehr@goboxerrescue.com>", "subject": "Unbelievable prices!", "body": "\n\nTired with your sexual problems? Looking for an effective and cheap solution?\nGo to the site\nViagra, Cialis, Valium, Levitra and more medications\nAll this you can find here\nAnd no one will know that you have some problems.\nWith best regards,\nVanessa Finley\n \n \nPover Mne, eto znanie ne dast tebe nichego, krome golovnoj boli. Da i ne mog on predstavit ni Odnogo iz etih chuzhakov-zasfernikov, ni proshlyh, ni nyneshnego, v roli Svetocha, Neistrebimogo, Izbavitelia Habusa. Ona vzdohnula, zametno pomrachnev. I personazhi byli prezhnimi ia i starik, tolko teper my pomenialis Mestami. \nNyrok pod vetvi, desiatok toroplivyh shagov, snova nyrok, udar rukami i Grudiu v osobo gustoe perepletenie. Tak eto pravda? Da, master Niksard. Slova tiazhelo padali vniz, slovno opustevshie glinianye bokaly so Stola, nelovko sbroshennye rukoj nakachavshegosia po makushku vypivohi. Kak zhe potom nogi budut bolet uzhas. Vnezapno do nee doshlo, pochemu ej znakomo eto lico. Vot uzhe i volny pobezhali v storony, otbrasyvaemye Merzkoj tiazhestiu, a skorost ne zamedlilas, dazhe vyrosla. Nadoelo mne vse eto do smerti. Ty voin, vydohnul Vestnik tmy. \nLedianoe pole, istochavshee smertonosnyj holod, zamenil Rovnyj kamenistyj krug, polnostiu sovpadavshij s nim razmerom, chuzherodnaia Nashlepka sredi zhivoj prirody, neizvestno kak okazavshaiasia posredi stepi. Ty menia ogorchaesh, Dos, posetoval ia, ottiagivaia vremia, razve ty Uzhe ne hochesh vyslushat moiu istoriiu ob imevshih mesto sobytiiah v Giblyh Zemliah? Dos snova ne obratil na moi slova ni malejshego vnimaniia. Dovolno rezvo probezhav stoianku, on Vyrulil na staruiu, pylnuiu (eto slovo u menia uzhe na zubah skripelo) dorogu I, oshchutimo pribaviv skorost, ustremilsia vpered. Ia-to znaiu, chto tut k chemu, mnogoznachitelno progovoril trans. ejisuminyon VVFcRlhQUVh0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}