{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Computers & Electronics Newsletter June 14, 2007", "body": "\nhowstuffworks® | computers & electronics June 14, 2007\nRSS\n  \n How Boolean Logic Works  Have you ever wondered how a \ncomputer can do something like balance a checkbook, play chess or spell-check a \ndocument? These are things that, just a few decades ago, only humans could do.  Boolean logic lies at the heart of the digital revolution. Find out all about Boolean gates and how by combining them you can create any digital component! \nAlso at HowStuffWorks\n It's Not Too Late to Get Dad the Perfect Digital Camera\n - Digital cameras are a popular gift for Father's Day, but most busy dads don't have time to adjust a lot of manual camera settings in order to get the best photo quality. A digital camera can make a lot of automatic adjustments, but in the end, photo quality comes down to how light hits the camera's sensor. Learn how to take better pictures with a digital camera and get some helpful tips for printing and sharing digital photos. \n \nHow 3-D PC Glasses Work - PC gamers can now play incredible 3-D games using high-tech glasses that give the game environment more depth than ever. They're designed to convince your brain that your monitor is showing a real, three-dimensional object.  Check out how this state-of-the-art technology works. \n \nHow Joysticks Work - Video games are amazing creations, but the fact remains -- if you can't input, you can't play. With a good joystick, the translation is so flawless that you completely forget about it. Take a look inside the quintessential game controller and see how it has evolved over the years. \n   This Week's Video\n \nHow to Install a Graphics Card - The images you see on your monitor are made of tiny dots called pixels.  The graphics card enables your computer to play games and movies. In this HowStuffWorks video\n, you'll learn how to install a graphics card yourself.    This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved "}