{"category": "spam", "to_address": "captains@flax24.uwaterloo.ca", "from_address": "\"Mudle Segura\" <coseuroparegionsviw@europaregions.com>", "subject": "Check out the wonders of pound melting", "body": "\nObesity is dangerous, stop it\n\n\n\n\n\nAnatrim – The very up-to-date and most delighting product for over-weight people is made available now – As were seen on CNN\n\n\n\nDo you realize that excessive body kilos kill more and more people around the world? We believe you hate the unsightly look of people like those and the social bias against them. \n\nMoreover, you have not the will to withstand an assault of your fatal eating habits. If it all sounds familiar, then we got something for your consideration!\n\n\n\n\n\nHere Anatrim comes, the recent product for the reduction of your body’s extra weight. The most amazing thing is that Anatrim raises the quality of your life by making you eat less and giving you better spirit. Look at some notes received from our customers:\n\n\n\n\n\n\"It is outstanding! \n\n\nInstead of eating any food close at hand and watching TV continually \n\n\nI became rather more interested in taking exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I feel fit as a fiddle now and lots of men stare hard at me!\"\n\n\n\n\n\n\nAmelia B., San Diego\n\n\n\n\n\n\n\"I tried some passive weight burning, but all came in vain. It was rather difficult for me to hold back and not to eat something just at hand. \n\n\nOne day I was told on Anatrim my very best friend by and I was really effected at the information.\n\n\n I had attempted using it, and my wife said that I look very good now, 4 months later. \n\n\n32 pounds have gone away and I keep still losing them! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nSteve Doubt, Chicago\n\n\n\n\n\nAnatrim helps your brain to understand that your body doesn’t need that much food. It raises your spirit, supplies you with energy, and attacks needless kilos. Especial thanks to its mighty original formula!!\n\n\n\nFind out latest news on this great product now!\n\n\n\n"}