{"category": "ham", "to_address": "avcooper@speedy.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 4/9/07 - The Thin Veneer of Civilization", "body": "April 9, 2007\n\nSalem, Massachusetts\n\nBy Paul Goodwin \n\n-------------------\nFeaturing: \n\nGive Me the Simple Life ... But Not Too Simple  \n \nThe Chinese Entrepreneurial Spirit\n \nA Very Attractive Play on Solar Cells \n \n-------------------\n\n\nSometimes, when the pace of the modern world gets to be too much, you hear\npeople talk about how they'd like to scale things back, slow down and get\nin touch with a simpler reality.  I've even thought about that myself,\nfrom time to time, although I'm also quite fond of the conveniences of\nmodern life.  \n\nBut that was before the storm last Wednesday that dropped six inches of\nwet, Spring snow on southern New Hampshire.  By the time my wife and I\nwoke up on Thursday morning, our power was out, and our home phone service\nwas another casualty.   \n\nThis isn't all that uncommon here in New England, and in Dover, New\nHampshire where we live, it's usually a matter of a few hours before power\nis restored.  But the powers that be didn't get our power back on until 45\nhours later, thus giving me the taste of the simpler life that I may have\nbeen yearning for without knowing it.   \n\nWhen I got home Thursday night, my wife had brought in wood from the\nwoodshed and had the wood stove in our basement and the fireplace on the\nfirst floor blazing merrily away.  We declined the opportunity to dirty\ndishes that we couldn't wash and went out to eat in a part of town that\nwas still blessedly electrified.  \n\nThere followed a picturesque evening with us reading and doing crossword\npuzzles by candlelight while sipping tea (since we could still light the\ngas range with matches).  All very lovely.  \n\nFriday morning, after 45 minutes of hauling a day's worth of wood from the\nwoodshed (and noticing the huge fallen pine limbs that illustrated where\nthe power had gone) and washing my hair with a pitcher of water heated on\nthe stove, it all seemed a little less idyllic.  I missed my water heater,\nmy iBook, my electric lights and my steam heat.  This life may be simple,\nbut I'm not stupid.  \n\nAnyway, given my position as editor of the Cabot China & Emerging Markets\nReport, this got me to thinking about people living in mud brick homes out\nin the provinces of China who have been living like this for centuries,\nwithout even the running water and flush toilets that have kept the veneer\nof civilization intact back home in Dover.  \n\nThe communist revolution in China made a huge difference in the lives of\nmany city dwellers.  But for many peasants, life stayed pretty much the\nway it had always been.  Maybe a People's Army medic would be available\nand eventually the village might get a TV, but not much else changed.   \n\nThen came the post-Mao era, the unleashing of the Chinese entrepreneurial\nspirit and the new Chinese saying \"To get rich is glorious!\"  In other\nwords, The People's Republic of China became the People's [capitalist]\nRepublic.  And in less than a decade, cell phones, TVs, Internet cafes and\ncomputers began spreading throughout the Middle Kingdom.  \n\nThe real lesson here is that while the communist revolution may have been\npowerful, the most powerful force in the world is the revolution of rising\nexpectations.  Once people get a taste of modern life, they like it.  And\nonce they have it, they usually want more. \n\nIn part, of course, it's the way that magazines, newspapers, movies and\nthe Internet show you the world of possibilities for the stuff you could\nhave.  But even more important are the images that modern media give you\nabout how you could live.  There are more people now living in freedom\nbecause they kicked out their own leaders than there are people who were\nfreed from their leaders by outside forces.  If the communist party in\nChina knows what's good for it, it won't make a habit of standing in the\nway of the Chinese people's desire to do what they want.  But I don't want\nto get into politics.  \n\nTo bring this little disquisition around to investing, I'd like to point\nout something from an earlier era that I really am nostalgic for ... clean\nair.  Many of the best things in the modern world depend on electricity,\nand most electricity is generated by burning stuff.  And almost every car\non the road is doing just the same thing.  Steel mills and other\nfactories, ditto. \n\nThe answer to the riddle about how to have what we love about the modern\nworld, but without fouling our air, has been out there since the 19th\nCentury, but it's about to come into its own.  Photovoltaic cells, the\nlittle slabs of doped silicon that power our calculators and keep remote\nhighway signs alight, are steadily moving toward the tipping point at\nwhich the power that they produce - renewable, non-polluting power - will\nrival the cost of power that comes from coal-fired generators. \n\nOn the consumer side, this process is being helped along by countries like\nGermany, Italy and Spain, and U.S. states like California that are\noffering generous subsidies and rebates to encourage the use of clean\nphotovoltaic electricity.  And on the manufacturing side, different\nmanufacturers are using all kinds of strategies to lower costs, including\ntechniques to make thinner silicon cells, using alternative materials and\nstreamlining the manufacturing process. \n\nOne of the stocks leading this charge found its way onto the recommended\nlist of my Report last week.  It's not First Solar, a U.S. manufacturer\nwe've written about before that's making cells that use less silicon. \nInstead, it's a Chinese solar cell manufacturer that's working on a number\nof fronts to get the cost per kilowatt moving toward that long-sought\nbreak-even point.   \n\nThe company is called Trina Solar (TSL), and it has the kind of innovative\nmanagement that will be needed if the cost per kilowatt is going to keep\nheading down.  Consider the company's approach to its silicon feedstock. \nBoth the solar cell industry and the semiconductor industry use the same\nhighly purified silicon as their basic material.  There's a lot of waste\nin the process, including broken and contaminated wafers, machining\nwastage and the like.  Most companies don't have the capability of\nrecycling that waste, but Trina Solar does.  And given the persistent\nshortage, that's a major advantage.  Trina Solar is also on the way to\nbeing a totally vertically integrated operation, with every step in\nmanufacturing under the company's direct control on one site.  Some day\nthere may come a huge breakthrough in the solar industry that will vault\nsome company into undisputed leadership in the industry and send its stock\ninto orbit.   But for now, it's Trina Solar and companies like it making\nsmall improvements and finding small advantages that are winning the\nbattle to get electricity from the sun cheaply enough to make a\ndifference. \n\n\n============================\nEditor's Note:  To get updates on Trina Solar and the other\nrecommendations in the Cabot China & Emerging Markets Report portfolio,\nconsider a risk-free trial subscription. The Report's BRIC (Brazil,\nRussia, India and China) strategy gives subscribers news and\nrecommendations from the hottest large economies on earth.  Just click on\nthe link below to get started. \n\nRated #1 Top Performing Newsletter for 2006 by The Hulbert Financial Digest\n\nhttp://mail.cabot-online.com/t/150605/13148861/84/0/ \n============================\n\nJust by way of contrast, you might want to take a look at Evergreen Solar\n(ESLR), an American manufacturer of solar cells that takes a unique\napproach to saving silicon.  Evergreen melts its silicon, then runs two\nspecialized strings through the liquid, creating a film of silicon between\nthe strings like a flat soap bubble.  The cooled film of silicon can be\nused to make very thin solar cells without the wasteful process of sawing\nwafers.  ESLR took a big hit when the company lost its supply of silicon,\nfalling from 17 a year ago to 7 in January, but it has rebounded to near\n11 on good contract news, and may have turned the corner.  \n\nBy way of contrast with Trina Solar, it's interesting to look at Solarfun\nPower Holdings (SOLF), another Chinese solar cell maker.  The company's\nstock came public last December and roared from 10 to 17 in just a couple\nof months.  But the company issued disappointing projections on gross\nmargins in early March, and the stock dropped quickly back toward 12.  Our\npreference for Trina Solar is only partially based on the company's\ntechnological advantages.  It's also based on the importance that we\nattach to positive momentum in a stock's price.  There are lots of\ncompanies whose stock should be going up because of some great patent or\ntechnological edge.  But in the world of aggressive growth investing, we\nthink there's no substitute for a stock price that indicates that\ninvestors are actually signing on.  So we'll stick with Trina Solar, for\nnow.  From innovative sources of silicon feedstock to a totally integrated\nmanufacturing facility, this young company, and its even younger stock,\nmake for a very attractive play on turning sunlight into electricity and\nmaking the planet happy to boot.  \n\n=====ADVERTISEMENT==============\n\nIntroducing Cabot Stock of the Month\n\nA revolutionary investment advisory that brings you Wall Street's top\nopportunity on a monthly basis, directly from the editors of Cabot Market\nLetter, Cabot Top 10 Report, Cabot China & Emerging Markets Report, and\nCabot Benjamin Graham Value Letter.\n\nTry It Risk Free for the Next 12 Months - Grow 50% or Pay Nothing!\n\nTo learn more, please visit this link:\nhttp://mail.cabot-online.com/t/150605/13148861/86/0/\n\n==============================\n\nAnd as for my family's personal energy crisis, I'm pleased to report that\nmy wife and I are once again hearing the ice maker rumble, watching the\nbest that cable TV has to offer and e-mailing our friends and family about\nour unexpected (and not completely unpleasant) trip back in time to a\nsimpler style of life.\n\n\nPaul Goodwin\nFor Cabot Wealth Advisory\n\n---------------\n\nPaul Goodwin is the editor of Cabot China & Emerging Markets Report. Rated\n#1 Top Performing Newsletter for 2006 by The Hulbert Financial Digest.\n\nCheck out the explosive profits of the fast-growing opportunities Paul\nrecommends. See how $5,000 can soar to $10,000, $15,000, $25,000-or\nmore-over the next two to three years.\n\nLearn more here\nhttp://mail.cabot-online.com/t/150605/13148861/84/0/\n\n******************\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=150605&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}