{"category": "spam", "to_address": "<ELAASTIC@flax9.UWATERLOO.CA>", "from_address": "<AG2007@iiis-info-cyber.org>", "subject": "Academic Globalization Project and Info-CybernEthics 2007", "body": "\n============================================================================\nPlease consider to contribute and participate in an\n\nAcademic Globalization Project: Call for abstracts/articles and participation. http://www.iiis-cyber.org/wmsci2007/ag.asp\n\nand/or in Info-CybernEthics 2007: Call for abstracts/articles and participation: http://www.iiis-cyber.org/wmsci2007/ice.asp\n============================================================================\nDeadlines for both:\n\nSubmissions:  May 25th, 2007\nAcceptance notification: A maximum of 10 days after submission's date\nCamera-ready for Pre-Conference Proceedings: June 10th, 2007\nCamera-ready for the Post-Conference volume of the Proceedings: July 12th, 2007.\n============================================================================\nThe Academic Globalization Project would include plenary keynote addresses, structured and non-structured conversational face-to-face sessions, electronic sessions, e-conferences, virtual and/or face-to-face panels, 3 kinds of publications (hard copy proceedings, CD proceedings, Web) and 4-5 publication for best articles, which will also be published in a multiple-author book and/or in the JSCI journal.\n\nThese events will be linked to each other and their aggregated output would be input to 2008 events, and so on for next conferences, in an integrated multiple-year and multiple-event project.  More details about these events and their integrative links are provided at http://www.iiis-cyber.org/wmsci2007/ag.asp\n\nInfo-CybernEthics 2007 will include similar processes, products and publications, as well as the integrative links among them.\n============================================================================\nPlease consider to distribute this email to appropriate colleagues and groups.\n\nThank you,\nConference Organizing Committee\n============================================================================\n\nIf you wish to be removed from this mailing list, please send a reply email with REMOVE MLINFOCYNETHICS and/or REMOVE MLAGP07 in the subject line.\nStreet Address: Torre Profesional La California, Av. Francisco de Miranda, Caracas, Venezuela.\n\n"}