{"category": "spam", "to_address": "Gnitpick <gnitpick@flax9.uwaterloo.ca>", "from_address": "Joseph Ballard <kip@glowmagazine.ca>", "subject": "To buy or not to buy?", "body": "\n\nIs there any reasons to pay more? Do you want to save your money? I bet you do! \nGo to the shop\nBuy Licensed and Quality Viagra or Cialis at US Drug store now and you'll be at the top all night long!\nEverything for your health\nLowest prices on the web, only licensed and quality pills.\nWith best regards,\nJoseph Ballard\n \n \nOna neozhidanno privstala, peregnulas ko mne cherez podlokotnik, obvila Rukami sheiu i krepko pocelovala v guby. Bespodobno, volshebno ia dejstvitelno paril nad zemlej, oshchushchaia sebia Odnim iz krylatyh, kak v detskom sne. Zdes, naprimer, net takogo privychnogo dlia moego Mira poniatiia, kak Vizoset, s pomoshchiu kotoroj narod i razvlekaetsia, i obshchaetsia Drug s drugom. Korotkij besshumnyj vzryv i chast ego Ploti osiadet mirnoj pyliu na griaznoj mostovoj. \nPoetomu esli Dos prevratit tebia v zharkoe, to dazhe Moih sposobnostej ne hvatit, chtoby spasti tebia i na etot raz. Hladnokroviiu etogo tolstiaka mozhno Bylo pouchitsia. Nam ostaetsia tolko zhdat, kak Budut razvivatsia sobytiia. Ia otdaval sebe otchet v tom, chto udar v golovu mog i ne porazit sinteta Nasmert, moi novye sverhchuvstva v realnom mire eshche ne opredelilis Polnostiu, i ia poka ne oshchushchal vraga, dvizheniia ego zhiznennyh funkcij. Za obuglennoj zonoj ploshchad byla Obychnoj, razve chto pochishche, chem ranshe. Ia vspomnil tot den, kogda stal chempionom Krasnogo goda Novy-2 po Iskusstvu Mobra (a eto govorit o tom, chto vladel ia im v sovershenstve), samyj Triumfalnyj den v moej zhizni v etot den ia stal izvesten vsej planete. Okazatsia v dvuh shagah ot celi sviazannym po rukam i nogam. Sam? Da. \nTy ved naverniaka uzhe spravlialsia s Hishchnikami v odinochku, tak Pochemu na etot raz tebe ponadobilas pomoshch sushchestv drugih ras? Chto s togo, Chto etot Prokold poslednij? Ne prosto poslednij, Niks. Ia videl etot udar sobstvennymi glazami, videl, kak Nozh po rukoiatku vdavilsia v plot, chut li ne voshel vmeste s rukoiatkoj, Blestiashchee stalnoe lezvie santimetrov sorok dlinoj. Serdce strannaia shtuka, nikakie dovody rassudka emu ne pomogaiut. Net vremeni s vami vozitsia. ejisuminyon VVFcRlhQUVh0RkFXVlBMH0dEVUFUQF9bWh9RUg==\n \n\n\n"}