{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "540p 6/16 Update: Two more computers revived; spacewalk on tap Sunday", "body": "\n\n\n\n\n540p 6/16 Update: Two more computers revived; spacewalk on tap Sunday\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 67\nPosted: 5:37 PM, 6/16/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-63 (06/15/07): Russians restart computers; faulty secondary power switch possible culprit; more troubleshooting planned\n   SR-64 (06/15/07): Spacewalkers begin solar array retraction effort\n   SR-65 (06/15/07): Spacewalk ends; solar array successfully retracted; news briefing; combining takes\n   SR-66 (06/16/07): Russians activate revived computers; continue tests and troubleshooting\n   SR-67 (06/16/07): Two more computers recovered after additional bypass work\n\n=================================\n\n5:37 PM, 6/16/07, Update: Two more space station computers revived\n\nHoping for the best, space station commander Fyodor Yurchikhin and flight engineer Oleg Kotov hot wired two computers aboard the international space station today that engineers had feared were victims of fatal power supply failures. To everyone's delight, the machines promptly booted up and appeared to be running normally, two more successes in an improbable recovery from crippling computer crashes last week.\n\nTwo of the three computers making up the Russian segment's guidance, navigation and control computers, along with two of three central control computers, were successfully revived Friday when Yurchikhin and Kotov used jumper cables to bypass suspect surge protectors in secondary power supply circuits.\n\nThe redundant so-called soft switches were designed to shut off power to their respective computers in the event of surges or spikes in the incoming electricity. Engineers now believe the installation of a new solar power truss last Monday triggered a subtle change in the station's power grid that somehow caused the secondary power supply switches to respond, preventing their computers from booting up.\n\nRussian engineers believed four of the six primary computers were healthy and victims of the overly sensitive switches. When the switches were bypassed Friday, the four computers, two in each system, booted up normally. After a thorough checkout, one machine in each chain was put back in control of critical station functions.\n\nRussian engineers believed the other two computers were victims of power supply hardware failures and no attempt was made to start them on Friday. But today, Yurchikhin and Kotov installed jumper cables on the off chance the computers were, in fact, healthy and both started up normally.\n\n\"Overnight, our Russian colleagues conferred with us and confirmed that, in fact, all six computers are working,\" said Mike Suffredini, space station program manager at the Johnson Space Center in Houston. \"In fact, with the modification they did on the four I told you about last night, they did that modification on those last two, they brought all six computers up and confirmed they were all operating nominally. Then they went back down to a four-computer set again and continued to check out the computers.\n\n\"Currently, they have all six computers up while we do some additional troubleshooting to understand the environment and how it might affect the computers.\"\n\nIn the meantime, the Russians have decided to leave one computer in each system on standby to serve as an operational backup should any other problems crop up.\n\nThe bottom line, Suffredini said, is that \"it appears to everyone the command-and-control-type computers are functioning just fine. In addition to that, we're doing our planning to test the attitude control system. Once we have confirmed the attitude control system can work, that will confirm not only that the guidance, navigation and control set of computers is working but also that the guidance, navigation and control computers can talk to the command-and-control computers. ... So when that test is complete, we will consider that the computers are up and healthy. At that point, we will confer with our shuttle colleagues on a departure date.\"\n\nAtlantis astronauts Pat Forrester and Steve Swanson plan to stage a six-and-a-half-hour spacewalk Sunday to finish the activation of a powerful rotary joint designed to slowly turn the newly installed S4 solar arrays to keep them roughly face-on to the sun. A variety of other station assembly get-ahead tasks are planned as well.\n\nIf all goes well, the astronauts will seal hatches between the station and the shuttle on Monday and undock Tuesday for a return to Earth next Thursday.\n\n\"So things are looking up very well,\" Suffredini said. \"If all goes according to plan and the checkout goes well, we will transfer as much oxygen as our shuttle colleagues can afford to give us and then we will ... close the hatch Monday evening and have the shuttle depart on Tuesday.\"\n\nEngineers still don't know what changed in the space station's electrical system that might have affected the operation of the secondary power supply surge protectors. Suffredini said attention now is focusing on the electrically charged plasma environment the station flies through and how that electrical environment changes as the lab complex grows.\n\n\"We've had a lot of discussions with our Russian colleagues, who seem to concur with our assessment that this is probably due to this potential, the plasma environment we fly through, that as the station gets bigger this potential will continue to grow,\" Suffredini said. \"We've been collecting a lot of data, we have instruments that measure this potential. The Russians are very interested in that data. They have noted some changes in their systems as we have grown. ... I think we're going to find there's some sensitivity to the noise that is created as we change the space station.\"\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}