{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "60 Minutes Newsletter <newsletter_sixty_minutes-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "60 Minutes E-mail Alert", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nIn the worst shooting \n      in U.S. \n      history, we know 33 people, including the shooter, are dead. But we don't \n      really know exactly why Cho Seung-Hui went on a rampage on the campus of \n      Virginia Tech. For our first story, correspondent Scott Pelley talks \n      to Secret Service intelligence officers, whose exhaustive research into \n      the minds of potential assassins and school shooters will provide valuable \n      insights. Pelley is speaking with the officers today, April 20, and \n      will report this story over the weekend, for what will perhaps be the \n      freshest look yet at the mind of this mass killer.\n\n \n \nThis past week was also the \n      deadliest in Baghdad – over 200 Iraqis were killed in \n      a single day.  It has become a living hell for citizens of Baghdad just trying \n      to get through an average day, as correspondent Lara Logan reports \n      in our second story. How does one live in such a place?  Very \n      carefully, reports Logan, and often with \n      the protection of a weapon, or in the case of Dr. Quoresh al-Kasir, the \n      U.S. military. Nearly 200 \n      doctors have been murdered in Iraq by insurgents intent on \n      destroying Iraqi society. Soon after bullets began to crash through \n      his windows, Dr. Quoresh heard a hopeful sound. \"We heard the \n      helicopters starting to come to the area. My sons and daughter said, 'Oh, \n      Baba, the Americans started to reach the area.'\"\n \nWatch Logan's Reporter's \n      Notebook.\n \n \nThe firing of Don Imus for \n      uttering racially charged and misogynistic words black rap stars routinely \n      use in their lyrics has shifted the spotlight to hip-hop culture and its \n      dark messages.  As you’ll see in our third piece, CNN's Anderson Cooper discovers that \n      one of the rappers’ popular messages, \"stop snitchin',\" does not help the \n      police, but has actually confounded investigators' efforts to solve \n      crimes, especially murder, and has now created some lawless \n      neighborhoods.  Says Geoffrey Canada, educator and anti-violence \n      advocate from New York City’s Harlem neighborhood, \"It’s like we’re saying to the \n      criminals, 'You can have our community….Do anything you want and we will \n      either deal with it ourselves or we’ll simply ignore \n      it.'\"\n \nWatch Cooper's Reporter's \n      Notebook.\n \n \nThese stories, and Andy Rooney's love affair with \n      books, this Sunday, April 22, on 60 Minutes at 7 p.m. \n      ET/PT.\n\n \nFor an early look at this \n      week’s stories, please click \n      here.\n \n       \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n \n"}