{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "\"K.A.\" <avimova@gmail.com>", "subject": "Re: Anybody using a Dell Inspiron 8500/8600 with the ATI card?", "body": "Hello!\n\nOn Fri, Feb 23, 2007 at 12:31:36AM -0800, Joe Emenaker wrote:\n> I've got a I8600 with the NVidia card in it. In the two years since I've \n> had it, I've learned to *never* put it into suspend-to-ram mode. If you \n> do this, everything suspends just fine... but, upon waking, the display \n> doesn't turn back on.\n\nWell, I have T43 with i810 card, but still. I have familiar problem (kernel 2.6.20) that\ncan be worked around in such a way: after resuming change the console to\nthe 1st and then to the 7th (chvt 1; chvt 7) one more time. May be it will help.\n\n\n> The machine still *works* in this state (I can type commands blindly and \n> see the hard disk working... I can even ssh into the laptop and run \n> commands that way), but nothing I've ever tried has gotten the screen to \n> come back on after a suspend-to-ram.\n> \n> I've read countless forums, but nobody seems to have the magic bullet. \n> I've tried using \"chvt\" to switch to a console before suspend, I've \n> tried killing/restarting X to wake up the screen, I've tried writing \n> various values to /proc/acpi/video/VID/lcd, and I've tried playing with \n> \"xset dpms force on|off\". Nothing has worked.\n> \n> Then, I had a moment of inspiration. By most accounts I've read, this \n> only happens to the Dells with NVidia cards in them. So, it occurred to\n> me that I could get an ATI card for the I8600 on eBay and install it. \n> However, I wanted to make sure that I'm not setting myself up for \n> heartache, here. So, I have a few questions:\n> \n> 1 - Can the ATI drive the 1920x1200 WUXGA screen that I've got? The ones \n> I see on eBay are all 32MB cards, and I'm not sure what the RAM is on my \n> NVidia. My calculations tell me that 32MB should be *far* more than what \n> I need.... but I just want to be *sure* that someone's got it working.\n> \n> 2 - Are you able to use suspend-to-ram and wake it and get the screen back?\n> \n> 3 - Any ideas on how I can figure out how much ram my NVidia has?\n> \n> - Joe\n\n\n\n-- \nK.A., enfant terrible\n\n\n-- \nTo UNSUBSCRIBE, email to debian-laptop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}