{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Contenders clash on Iraq, immigration, health care", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJun  4, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nContenders clash on Iraq, immigration, health care\n\n\n\n\n\nDemocratic presidential hopefuls traded barbs over the war in Iraq Sunday\nnight in New Hampshire, with former Sen. John Edwards blasting two rivals for\nnot taking the lead on a recent war spending bill.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCandidates weigh in on their first 100 days as\tpresident\n\n\n\n\n\nThe last question posed to the eight Democratic candidates at Sunday night's\ndebate came from Ivy Merrill, a substitute elementary school teacher.  \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nBarry's remnants to bring heavy coastal rain\n\n\n\n\n\nThe remnants of Tropical Storm Barry were expected to creep up the Southeast\ncoast toward the Mid-Atlantic on Sunday, spreading heavy rain throughout the\nregion.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\n4 charged with terror plot at JFK airport\n\n\n\n\n\nFour men have been charged with conspiring to blow up jet fuel supply tanks\nand pipelines at John F. Kennedy International Airport.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMayor: 'unbelievable heroism' when car plowed into crowd\n\n\n\n\n\nNeighbors and rescue personnel threw children out of the path of a speeding\ncar that plowed through a crowded street festival, preventing more serious\ninjuries than the 40 people struck, Mayor Adrian M. Fenty said Sunday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStorm brings needed rain\n\n\n\n\n\nTropical Storm Barry weakened into a tropical depression as it moved through\nTampa Bay on Saturday, bringing nearly 7 inches of rain to parts of the\ndrought-parched region.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n'Monster pig' was a not-so-wild gift named Fred\n\n\n\n\n\nThe huge hog that became known as \"Monster Pig\" after being hunted and killed\nby an 11-year-old boy had another name: Fred.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nSomali prime minister survives bomb attack\n\n\n\n\n\nSomalian Prime Minister Ali Mohamed Gedi survived a suicide vehicle bomb blast\nthat heavily damaged his home Sunday, his spokesman said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTaylor boycotts war crimes trial\n\n\n\n\n\nFormer Liberian President Charles Taylor, accused of orchestrating unspeakable\natrocities during neighboring Sierra Leone's bloody civil war, said Monday he\ndid not believe he would receive a fair trial and boycotted its opening.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPakistan blocks TV channel\n\n\n\n\n\nThe Pakistani government has blocked the transmission of the Geo News TV\nchannel, a company official said Sunday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nU.S. military: 14 U.S. soldiers killed over weekend\n\n\n\n\n\nFourteen U.S. soldiers were killed by bombs and small-arms fire in Iraq over\nthe weekend, the U.S. military said Sunday, as factional violence continued to\nravage soldiers and civilians alike. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nBull run faces test\n\n\n\n\n\nA three-month stock rally could hit some June gloom, as bulls step aside\nbefore resuming the run.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReport: Veteran dealmaker starts pro football league\n\n\n\n\n\nWilliam Hambrecht, the renowned dealmaker whose made a career of challenging\nWall Street norms, is starting a professional football league where fans could\none day be part-owners, according to a news report.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nJohn Donovan: Feisty Weaver holds court on the art of the ejection\n\n\n\n\n\nOnce, back in the waning days of the 1985 season, the dean of disputatious\nbig-league managers, Earl Weaver, was thrown out of both games of a\ndoubleheader in Yankee Stadium. The second time it happened, he barely made it\nto home plate for the pregame exchange of lineup cards before he was run.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMichael Farber: Pronger's suspension alters Stanley Cup finals\n\n\n\n\n\nMaybe if the referees had given Chris Pronger a five-minute elbowing penalty\nand a game misconduct in Game 3 instead of blindly missing his malfeasance\nearly in the third period, he would be playing in Game 4 of the Stanley Cup\nfinals Monday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nReport: TB patient maintains he is married\n\n\n\n\n\nRejecting earlier claims made by a local Greek official, tuberculosis patient\nAndrew Speaker said he did marry his fiancee in a small Greek town during his\ntrans-Atlantic trip.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFDA: Throw away toothpaste made in China\n\n\n\n\n\nThe government warned consumers on Friday to avoid using toothpaste made in\nChina because it may contain a poisonous chemical used in antifreeze.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nThe Google 'ick' factor\n\n\n\n\n\nGoogle Inc. bills the latest twist on its online maps as \"Street View,\" but it\nlooks a bit like \"Candid Camera\" as you cruise through the panorama of\npictures that captured fleeting moments in neighborhoods scattered across the\ncountry.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPatients worldwide reap benefits of shrinking technology\n\n\n\n\n\nWhen doctors in a remote African town warned a 20-something pregnant woman she\nwas well past her due date, the Liberian patient agreed to have labor induced.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nSinking 'Pirates' ship is still No. 1 at box office\n\n\n\n\n\n\"Pirates of the Caribbean: At World's End\" hit an ebb tide in its second\nweekend but still had enough buoyancy to hold the No. 1 spot at the box\noffice.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReview: 'Knocked Up' a top-rank comedy\n\n\n\n\n\nIn a summer set for domination by inflated franchise movies in exhausting (and\noften exhausted) mega-mode, \"Knocked Up\" is a designated sleeper, the little\nmovie that could -- and should -- clean up.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}