{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"ace\" <ace@talkingirc.net>", "subject": "Re: lynx links and forms in speakup", "body": "One thing with which I struggled when browsing in *nix is that there is no \nvirtual browse mode.  You are pretty much viewing the screen as a sighted \nperson would see it; exactly as the web author intended for it to appear. \nThis is why your arrow keys do not work.  Also, this is why we prefer to \nnumber links because it is often difficult to tell where the links are. \nWhen you are confronted with a new site, read it in its entirety, which is \nwhat you should do anyways, then go back to the top and search for what you \nneed with the / (slash) key.\n\n----- Original Message ----- \nFrom: \"Michael Weaver\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Sunday, June 10, 2007 3:04 AM\nSubject: lynx links and forms in speakup\n\n\n>I have set the cursor on, forms and links for numbers, user mode to\n> advanced and underlined links to on so why am I having problem with\n> links being read out on a line when I use the standard up and down\n> arrow keys, links being repeated and for example when I go to google,\n> the form for search isn't announced as if there is no number for the\n> edit field when doing a search or am I missing something in settings\n> which is making it more difficult to focus which why I am having\n> difficulty scrolling down web pages using up and down arrow?\n> Do I perhaps need to use the speakup keystrokes for navigating through\n> pages more than I would normally when using a web browser in Windows\n> where I can go up and down pages with the standard arrow keys and it\n> reads either text or links depending on where you are on a page rather\n> than trying to put all the links together and maybe causing a problem\n> when navigating?\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n> __________ NOD32 2321 (20070610) Information __________\n>\n> This message was checked by NOD32 antivirus system.\n> http://www.eset.com\n>\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}