{"category": "ham", "to_address": "speakup@braille.uwo.ca", "from_address": "Alex Snow <alex_snow@gmx.net>", "subject": "Re: Definitely unslung", "body": "Would personally rather something that's not x86 if I was going to put \ntogether a sub-laptop linux machine.  Seems the smaller/slower \nimbedded processors like strongarm are far better on heat and power \nconsumption.  Especially since it would most likely just run a simple \nconsole maybe with a menu system thrown on top the slower processor \nwouldn't matter so much.\nOn Mon, Jun 04, 2007 at 07:54:40PM -0500, C.M. \nBrannon wrote:\n> \"Georgina Joyce\"  writes:\n> \n> > no more mods on this one.  But I'm still looking for a way of\n> > building my own Linux portable PC that I can use as a mp3 player if\n> > I choose, a note taker, or diary manager.  While the slug has 2 USB\n> > ports and a Ethernet connection I really need to be able to add\n> > further boards such as Bluetooth and wireless B/G.  So if anyone\n> > else is meddling in such areas please let me know.\n> \n> Hi,\n> I've been hoping for an affordable portable Linux system for some\n> time, especially if it has wireless networking and ethernet.  I hate\n> lugging a laptop; the dead weight of a screen is especially irksome.\n> PDAs with speech are overpriced.  Most seem to run Windows, with one\n> exception (the Pappenmeier device).\n> \n> There's a group of people who are trying to turn a Linksys router into\n> a talking portable.  See www.louderlinux.net.  I wish them luck.\n> \n> Does your \"slug\" device use an x86 processor?  That would make it\n> especially attractive.\n> \n> -- Chris\n> \n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n-- \nThere are no threads in a.b.p.erotica,  so there's no  gain in using a\nthreaded news reader.\n\t-- unknown source\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}