{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Advertisers pull sponsorship of Imus' show", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApr 11, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nAdvertisers pull sponsorship of Imus' show\n\n\n\n\n\nTwo advertisers have pulled their sponsorship of Don Imus' radio show to\nprotest his racially charged comments about the Rutgers women's basketball\nteam.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBirkhead named baby's dad; Stern won't fight for custody\n\n\n\n\n\nFormer boyfriend Larry Birkhead was declared the father of Anna Nicole Smith's\nbaby Tuesday, and Howard K. Stern, listed as Dannielynn's father on the birth\ncertificate, said he would not fight for custody.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nCold snap damages fruit crops across Southeast\n\n\n\n\n\nFrigid weekend weather caused frost that damaged crops across the Southeast,\nraising fears that peach, apple, blueberry, strawberry and wine grape crops\nwere harmed.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nRutgers coach builds winners despite life full of adversity\n\n\n\n\n\nAfter a 2-4 start, C. Vivian Stringer's Rutgers University team hardly looked\nlike a squad capable of reaching the NCAA women's basketball tournament.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCourt papers: Arrested astronaut had bondage photos\n\n\n\n\n\nA police search of former astronaut Lisa Nowak's car turned up bondage photos\non a computer disk, British currency and pills, according to documents\nreleased Tuesday by prosecutors.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFire destroys Johnny Cash home\n\n\n\n\n\nJohnny Cash's longtime lakeside home, a showcase where he wrote much of his\nfamous music and entertained U.S. presidents, music royalty and visiting fans,\nwas destroyed by fire on Tuesday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n'Girls Gone Wild' founder surrenders to marshals\n\n\n\n\n\nThe founder of the \"Girls Gone Wild\" video empire surrendered to federal\nmarshals early Tuesday to face a contempt of court citation after initially\ndefying a federal judge.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nFive dead after Casablanca raid\n\n\n\n\n\nThree suspected members of a terrorist group blew up themselves, and police\nshot a fourth after a chase in Casablanca's al Fida neighborhood, security\nservices said, according to Morocco's state-run news agency, Maghreb Arabe\nPresse.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIran vows to expand nuclear plans\n\n\n\n\n\nA day after Iran announced it had begun production of nuclear fuel on an\n\"industrial level,\" the head of the country's atomic energy organization said\nIran had plans to greatly expand its nuclear program.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nU.S. to send $59 million to Palestinians' Abbas\n\n\n\n\n\nNearly $60 million in U.S. aid to the Palestinians has been cleared for\ntransfer to Palestinian Authority President Mahmoud Abbas, the State\nDepartment said Tuesday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGoogle Earth maps out Darfur atrocities\n\n\n\n\n\nIf you Google the word Darfur, you will find about 13 million references to\nthe atrocities in the western Darfur region of Sudan -- what the United States\nhas said is this century's first genocide.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nRisky loans - alive and well\n\n\n\n\n\nOption ARMs remain an option. Despite problems in the mortgage market, brokers\nsay lenders are still willing to make risky loans - including those that allow\nborrowers to make monthly payments that don't even cover the interest\n(so-called \"option ARMs\").\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCoolest new car colors\n\n\n\n\n\nAs I drove north on the New Jersey Turnpike recently, a Mary Kay cosmetics\nsaleswoman in a Cadillac DTS passed me on the right, her big car's paint job\nhitting me like a punch in the eye from the Pink Panther.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nPeter King: Goodell delivers statement NFL needed\n\n\n\n\n\nRoger Goodell had a big decision to make Tuesday morning, but in the end it\nwas a fairly easy one. Other than Tennessee miscreant Pacman Jones and his\nagent, who in the football world thought Jones didn't deserve a major\nwhacking? Even Chris Henry, known more for getting arrested than for his\nconsiderable receiving talent in Cincinnati, knew he had a major suspension\ncoming.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSI.com's NHL experts pick every series, Cup winner\n\n\n\n\n\nWho will skate with Lord Stanley's Cup this season? We'll find out in two\nmonths. But for now, all we can do is speculate -- and that's what our NHL\nexperts have done, as they predict every series in every round, leading up to\ntheir picks for this year's Stanley Cup winner. \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nWhen modern life pumps up the volume, give your ears some TLC\n\n\n\n\n\nWhoever's rocking your iPod today, do yourself a favor and turn it down. Those\ntiny earbuds pump music directly into the ear canal, making it easier to do\npermanent damage. Live music or sports, power tools, and even hair dryers can\nspell trouble for your hearing, too.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nType I diabetics live without insulin in stem cell experiment\n\n\n\n\n\nThirteen young diabetics in Brazil have ditched their insulin shots and need\nno other medication thanks to a risky, but promising treatment with their own\nstem cells -- apparently the first time such a feat has been accomplished.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nFirst Amendment extends to MySpace, court says\n\n\n\n\n\nA judge violated a juvenile's free-speech rights when he placed her on\nprobation for posting an expletive-laden entry on MySpace criticizing a school\nprincipal, the Indiana Court of Appeals ruled.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNew 3-D movies more than a gimmick\n\n\n\n\n\nBy the end of the decade, Darth Vader could be rattling sabers with his\nenemies above the heads of moviegoers, and Buzz Lightyear could be flying off\nthe screen on his way to infinity and beyond.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nWhat's new about the Imus controversy?\n\n\n\n\n\nDoes the Don Imus controversy have an echo quality to it? \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSnoop Dogg charged with gun, drug counts in California \n\n\n\n\n\nSnoop Dogg was charged Tuesday with felony gun and drug counts, Los Angeles\nCounty prosecutors said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}