{"category": "ham", "to_address": "debian-vote@lists.debian.org, debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: Request for GR: clarifying the license text licensing /   freeness issue", "body": "Francesco Poli  asked:\n> Are there many other greynesses in how the SC and the DFSG are\n> interpreted?\n\nAmazingly few, but yes, as some of it is based on guessing how\nstill-changing legal systems are developing, or how particular licensors\nwill react to our actions.\n\nAt least twice, licensors have reacted in surprising ways.  Does that\nmean we made the wrong decision, or broke the SC or DFSG?  And if it does,\nwould it have been reasonable to reject unknowns?\n\nOther times the law changes (by legislation or precedent or ...) and\nmaybe that makes things break the DFSG.  Some may remember that I'm\nwary of licences that contain 'lawyerbombs' - things which look strange\nor confusing and the licensor or licence author refuses to clarify,\nwaiting for law changes.  That's another type of greyness.\n\nLicences are another type of greyness: unlike Mozilla's software, it's\nvery easy to produce a modifiable licence from the GPL by removing\none component.  Should the preamble be regarded as part of the name?\n\n\nNathanael Nerode  wrote: [...]\n> Alternate suggested GR text: [...]\n> We wish to clearly inform our users of this temporary exception [...]\n\nIt says temporary, but the termination 'no major licenses' event is\nunlikely to happen automatically by consensus: the maintainer of a\npackage under the Gnarly Public Licence is going to consider that a\nmajor licence.  Also, it should try to stop the problem getting worse,\nby refusing future unmodifiable licences.\n\n[...]\n> Frankly I'd be happy with any honest solution.  Currently the promise made in the \n> Social Contract is very stark, very bold, and also untrue.  The DFSG are very \n> stark and bold about this as well.  Lots of \"must\", \"never\" and \"100%\", which \n> simply isn't what's going on.\n\nClarity is a feature, not a bug.  I feel the correct way to improve\nclarity is to help debian live up to its promise clearly as soon as\nreasonable.  Bring things from the grey area inside the border - don't\nchange the promise to move a grey area inside.\n\n\nCharles Plessy  wrote: [...]\n> the fact that some licences are not modifiable has probably a reason,\n> and I think that it would be wiser to find, understand, and discuss it\n> before voting on the sole fact that being modifible can have some\n> advantages.\n\nAs far as I have been told, it's about branding, as with the hypothesis.\nIt only hurts the brand's friends: bad people will publish a GNU Genial\nPublic Licence even if it breaks the law.  Friendly people like the\ndebian project have to choose between their promises to support free\nsoftware and the branding.  Which is more important: free software or GNU\nbranding?\n\nRegards,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}