{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Rose\"<rose.lee@hushmail.com>", "subject": "Welcome to visit funnygadget.com", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat is funnygadget.com ?\n\n\nFunnygadget.com can provide you the latest news of technology Gadget news and reviews. Also, it can provide you the latest Computer Hardware Price. More over, you can change your idea of computer technology with other visitors. \n\n\nNews in funnygadget.com\n\n\n\nUFO in the Pool! The water cannon is exactly in the shape of UFO. The difference is that it can only “fly” on the water but not the sky. This is remote controlled by a simple radio, easy for kids to command to move forward, backward, or spin in circles. Look, there’s a nozzle. It can be moved up and down, while the stream of water bursts as high as 10 inches. That’s powerful! A good gadget to annoy your friends in or near the pool and whatever water environment. Powered by 4 AA battaries, and retails for $129. But I think there is still room of improvement for it: make it dive in the water.by www .funnygadget.com\n\n\n\nConcept Glass Car! A real eye-catcher. This fabulous concept car will be shown up in the near future. It’s made to celebrate Rinspeed’s 30th birthday. The most attractive features include, firstly, most part of the car is made of non-metal material such as plastic and synthetic materials; secondly, the shinning transparent design. Don’t question about its quality and function. It’s “transparent high-tech plastic” , as Ian Paterson, the member of the Bayer Material Science Board of Management said. The plastics experts from BMS with their Makrolon polycarbonate are in charge of the transparency of the eXasis. The eXasis is powered by incredible lightweight (the car weighs only 750kg), 150 bhp Weber engine driven by CO2-emission-reducing bioethanol. The tires are Pirelli’s 22-inch High-Performance P Zero.by www .funnygadget.com\n\n\nRecommendation of funnygadget.com (By Other Websites) \n\n\n\n\nLatest Technology Gadget News and Reviews\n\n\n\nFunnygadget.com\n\n\nFunnyGadget.com, Premium source of world's latest news of technology gizmos and gadgets. With most updated computer hardware price list, you could clearly know how much it cost for your dream PC. Get a quote for your dream PC now and share with others .by BlogExplosion.com\n\n\nIf you like to read and see some of the funniest and oddest gadgets around, Funny Gadget is the place to check them out. I went over and visited the site and I really like the \"One touch pressing Robots for your Pants.\" That could be a huge help for many a pastor and missionary. Definitely something I would want and I'm sure that my wife would too! Be sure to make the jump and give them a look-see. They offer a English and a Spanish version, too.by burdicks.blogspot.com\n\nWelcome come to visit http://www.funnygadget.com/ \n\n"}