{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle and Bethea<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, because of August 8th, I had to write to you one final time about this...", "body": "\n\nMemo, because of August 8th, I had to write to you one final time about this...\n\n\n\n\n\n\n\n\n\n\n\n \n\nMemo, your August 8, 1972 birth date means you can tap into the power of this pure silver and gold Archangel Michael Medallion...\nCast in Solid Sterling Silver and Pure 24 karat Gold, The Archangel Michael Medallion\nDear Memo,\n    After looking over your charts, it became astonishingly clear to me why I want you to have this in your hands as soon as possible. Because you were born on August 8, 1972 in Edmonton, you are truly someone with the ability to achieve all of your dreams, yes, every last one...you just need a little help.\n\n\n\n    That's why I was taken aback, shocked that after 2 letters, you still hadn't taken advantage of Bernard's offer. Luckily, there's still time! \n    The Archangel Michael Medallion acts as a \"special angelic key\" to enhance your unique talents and abilities so you can open portals to connect with the Archangel Michael, the angel of miracles, and receive his blessings. With the Archangel Michael Medallion aiding you, Memo, I am certain you can get the miracles you need to increase your wealth, protection and good fortune.\n     Please reach out to help me help you and do not, again, pass up this amazing chance! Don't let this opportunity go by, Memo. The angels want to bless your life, but you have to allow them to, you just have to reach out and open the door for them.\n    With this Medallion,  you are telling them that you want their help and are ready to live the life you've always dreamed of and deserve, the one you were always destined for. \n    Just take a look at what Bernard has to say. \n    Your friend,       Bethea\n\nDear Memo,\n    I often get chills down my spine when someone tells me about a birth coincidence like yours.\n    This is because when I learned you were born in Edmonton on August 8, 1972, I realized you are one of the people who could use the amazing \"Angelic Key\" I discovered (a medallion with mysterious ancient symbols and incredible power) made of pure 24 karat Gold and pure Sterling Silver, to open a \"Portal\" to The Archangel Michael.\n    My friend, this is a truly rare and magnificent piece that is as beautiful as it is mysterious and magical.  It is a medallion that is directly linked to the bible itself...a magical object without peer, and one that until recently has been nearly impossible to obtain.\n    Now let me tell you why this medallion and Archangel Michael, the most powerful of angels, can deliver the miracles, protection, guidance and love you need to change your life so you can live your dreams. (Not many people can ever hope to be given a chance like this, so please listen carefully.)\n    First, your medallion will create a \"Portal\" (a connection) to the Archangel Michael, who is considered the greatest, most powerful of all angels by each of the world's 3 great religions... Judaism, Christianity and Islam. His power is so great that it is stated in the scriptures in each of these 3 great religions, \"that those lucky enough to have Archangel Michael in their lives will receive the blessings and miracles they need to enjoy a better, happier, richer life.\"\n    This is why, for example, since ancient times the Archangel Michael was renowned all over Europe and Russia for his ability to produce miracles. In fact, there was not a city in Russia, where there is not a church or chapel dedicated to the Archangel Michael for this very reason.\nA piece with extraordinary powers crafted inPure 24 karat Gold and Pure Sterling Silver!\n    As I hope you can now see, this is no ordinary Medallion.  And as you can imagine the materials from which it is made are befitting a piece of this magnitude... Pure 24 karat Gold and Pure Sterling Silver! The 2 most magically powerful and pure metals in the world!\n    First, 24 karat Gold is considered the purest and most magically potent of all metals and has been since the dawn of man. In fact, it has been known throughout history that when priests, shamans or magi wear pure gold, it greatly enhances their magical and spiritual powers.\n    Additionally, it is thought of as the most protective, since pure 24 karat Gold is one of the basic elements and cannot be corroded or corrupted in any way. It is for these reasons, as well for its incredible beauty, that through the ages Gold was the material of choice for crafting sacred objects, such as chalices and crosses as well as jewelry. This is why it has been, and continues to be, worn and used in religious ceremonies to this day.\n    But perhaps the greatest reason for acquiring Gold over the last four thousand years is that people wear Gold to increase their own personal power, courage, confidence and will power. It also has the power to attract wealth. (Ever heard the expression, \"money attracts money?\" Well before there was money it was believed that Gold attracted Gold. This is the reason it has been so sought after and hoarded.)\n    For all these reasons Solid 24 karat Gold was essential for this incredible piece.\n    Second, Pure Sterling Silver was used because it is the most powerfully mysterious and spiritually absorbing material on Earth. It is also the second most protective metal. In fact, because of Silver's amazing ability to protect and heal, hospital dressings containing silver are used on burns to prevent infections.\n    But that is only the tip of the iceberg, because Pure Sterling Silver also enhances and empowers psychic abilities and intuitive perception. What's more, Silver's relaxed, reflective energy magnifies the powers of the Pure 24 karat Gold.\n    This means your Medallion of the Archangel Michael, which was cast in pure Sterling Silver, will magnify the Pure 24 karat Gold's magical properties many times over! (Can you now begin to see how truly wonderful, beautiful and powerful this piece is?)\n    But there's more! A lot more, because this exquisite piece contains some of the most powerful symbols ever created for a Medallion or any other religious or magical piece...\nThe Power behind your Archangel Michael Medallion\n\n\n\n    First, if you look at the medallion you will see the secret angelic prayer inscribed in 24 karat Gold around its perimeter. It is written in Enochian, the language of angels, so no one but you will be able to use it. I will send you this secret prayer with your medallion. You must recite it three times.  This will charge your medallion and open a \"Portal\" to the angels. (Please keep this a secret.)\n\n\n\n\n\n\n    Second, notice Archangel Michael's flaming swords. These are symbols of righteousness, which he will use to protect you from all forms of negative entities. There is one in each quadrant of your Medallion. These quadrants represent the 4 points on a compass. This will protect you from harm from any direction as well as attract good fortune and opportunity from any direction.\n\n\nThird, in the very center of this incredible piece is the Sun. The Sun represents the power of the Archangel Michael to lead the souls of his believers into the Eternal Light of love and good fortune.\n\n\nNext, you'll notice the interlacing patterns at the top of each quadrant.  These are ancient keltoi knot patterns taken from \"The book of Kells\". They have been used for 1000's of years to trap powerful energies and when grouped with the other elements, they make it possible to \"magically\" summon spiritual entities, such as the Archangel Michael, for help, direction, companionship and miracles. (Which is why I want you to keep your Medallion with you at all times.)\n\n\nLastly, you will notice the Gold \"Ley\" lines. (\"Ley\" is the old Saxon word for \"cleared path.\") These are \"lines of power,\" as we call them today. They are identical to the lines found on Neolithic monuments in England. These lines have been used for 1000's of years to guide ancient man to the invisible pathways of energy that connect spiritual powers (like angels) to human beings.\n    Note: Right after \"charging\" your medallion with the secret invocation, you could experience a tingling sensation, and notice light glistening and glancing off the surface of this amazing talisman. What's more, if you're like others, you will get an incredible feeling of security and warmth.\n    Additionally, after the initial \"charging\" when you feel the need to open a \"Portal\" to the angels or to Michael himself,  just \"power-up\" your Medallion by reciting the secret Enochian prayer again.\n    For example, if you ever find yourself feeling threatened or uneasy, or if you feel you are lacking the proper commitment, motivation or direction, or you are at a place where you truly need a miracle to solve a problem, or overcome an obstacle that is standing between you and your dreams, just grasp your medallion in your hand and recite the prayer.\n    Similarly, should you need to call on the medallion's amazing powers for luck, courage, direction, energy, vitality or if you need to attract money, just recite the prayer. Most importantly, you should keep your medallion with you at all times. \n    And so you know you are acquiring a genuine Archangel Michael Medallion, made from Pure 24 karat Gold and Pure Sterling Silver, yours will arrive with it's own Certificate of Authenticity.\n    And since I want you to do this so you'll have the ability to benefit from this connection and your incredible happenstance, anywhere, any place, any time, I believe it would be best if you could keep the power of Archangel Michael as close to you at all times, so I would like you to have...\n\n\n\n\n\nYour First FREE Gift!A 22\" 18 karat Gold plated Rope Chain\n    This is an extraordinary FREE Gift. Exquisitely crafted in 18-karat Gold, this shimmering, liquid gold like 22\" long, rope chain necklace is the perfect complement to your medallion. For security, this magnificent chain proudly features a large, easy to use \"lobster claw\" clasp.\n    Unquestionably displaying your magnificent and extremely powerful medallion on a chain of this caliber is not only the best way to keep it close to you at all times, but also the best way for you to display it as the piece of fine jewelry that it is.\n    But that is not all...\n\n\n\nYour Second Free Gift!A Black Crocodile Embossed Presentation Case\n    This startling handsome, crocodile embossed, presentation case is satin lined and features a precisely angled, felt covered \"display stand\" that has been custom fitted to your Medallion.  This feature allows you to dramatically show off this finely crafted work of art, when you are not wearing it.\n    In addition, it has a spring-loaded hinge that instantly snaps shut with a distinctive muffled click, so you can keep this masterpiece safe and totally secure.\n    But there's more...\n\n\n\nYour Third Free Gift!The Secrets, History and Uses of The Archangel Michael Medallion\n    First, this richly detailed guide will give you a full understanding and appreciation of Archangel Michael. For example, you will learn that the first Angel created was Michael and that he is the leader of all the Archangels as well as all the guardian angels and is responsible for the protection, courage, strength, truth and integrity of all the people who are able to contact him.\n    Additionally, you'll hear how Archangel Michael's involvement with mankind is also seen in other ways, including his protection of Jacob from the wrath of his brother Esau over a matter of inheritance. The Scriptures also tell us that it was Michael who battled the Devil for the soul of Moses following the death of the founder of the Israeli nation.\n    Second, it shows you how lucky you are to be able to contact him and other angels.\n    But most importantly, your guide will give you examples of how the Archangel has helped others and explain the secrets of using your medallion effectively to get the guidance, direction, energy and miracles you need to make every area of your life better.\n    (Please, just click on the box below to see each of your FREE Gifts.)\nA Rare Opportunity To Turn Your Life Completely Around\n    There is an awesome power in this unique piece, which is fueled by ancient symbolism -- and magnified by the Pure Sterling Silver and Pure 24K gold.  The \"Medallion of the Archangel Michael\" is truly a rare and remarkable work of art, as well as a magical object without peer, and one that will be revered and appreciated by all those who cast their eyes upon it. \n    Moreover, because you were born at 053N33 latitude and 113W28 longitude on August 8, 1972 I am sure as it has for others, it will help bring you the opportunities, guidance and miracles you need to turn your life completely around.\nJust Pay For The Shipping and Handling\n    Not many people will ever be able to avail themselves of the chances you have now been given, so in order to get this piece into your hands as quickly as possible, just pay for the shipping, handling and insurance ($6.95) and we'll send you the \"Medallion of the Archangel Michael\" so you can use it Obligation Free for 30 days.\n    If after those 30 days, you choose to keep your \"Medallion of the Archangel Michael,\" your credit card will be billed in four easy installments of only $14.95. \n    However, because you are a friend of Bethea, Memo and because I know you are one of the people who can really take advantage of the Medallion's incredible power, I will make it almost impossible for you to say no, with my forever guarantee...\n    Use, wear and enjoy your Medallion for as long as you like...be it a month, two months, one year, ten years or more. If you are not 110% satisfied with this magnificent piece, or if you feel it didn't attract the love, guidance, directions and opportunities I said it would, or even if you just change your mind, just return your Medallion of the Archangel Michael to either myself or Bethea, and I will make sure you get a complete refund, including the cost of shipping and handling...immediately!\n    Now I hope I've made it impossible for you to turn down this opportunity, because I know it would be a totally great thing for you to do.\n    Sincerely,        Bernard de Buhem\n\n\n\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400.\n"}