{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "robert weissman <rob@essential.org>", "subject": "[Ip-health] US Senate language critical of compulsory licensing", "body": "It seems that PhRMA was able to insert language in the Prescription Drug\nUser Fee Amendments of 2007 (S.1082, the Food and Drug Administration\nRevitalization Act) critical of other countries' compulsory licensing\nefforts. PDUFA is the system by which drug company user fees pay a\nsubstantial portion of the Food and Drug Administration budget; the key\ndebates around the bill relate to drug safety concerns.\n\nThailand, Brazil and other countries' efforts to improve access to\nmedicines is not directly related to the substance of the bill, but\nPhRMA evidently was able to get language inserted on this topic\nnonetheless. There's a good chance that many or most Senate offices had\nno idea that this language was included in the bill.\n\nHopefully members of the House of Representatives, alerted to the\npresence of this language in the Senate bill, will insist that it be\nremoved.\n\nThe relevant text follows below. To see the full bill text, go to:\nhttp://thomas.loc.gov\n\nRobert Weissman\n\n--\n\nSEC. 516. SENSE OF THE SENATE REGARDING CERTAIN PATENT INFRINGEMENTS.\n\n       (a) Findings- The Senate makes the following findings:\n\n             (1) Innovation in developing life-saving prescription drugs\nsaves millions of lives around the world each year.\n\n             (2) The responsible protection of intellectual property is\nvital to the continued development of new and life-saving drugs and\nfuture growth of the United States economy.\n\n             (3) In order to maintain the global competitiveness of the\nUnited States, the United States Trade Representative's Office of\nIntellectual Property and Innovation develops and implements trade\npolicy in support of vital American innovations, including innovation in\nthe pharmaceutical and medical technology industries.\n\n             (4) The United States Trade Representative also provides\ntrade policy leadership and expertise across the full range of\ninteragency initiatives to enhance protection and enforcement of\nintellectual property rights.\n\n             (5) Strong and fair intellectual property protection,\nincluding patent, copyright, trademark, and data protection plays an\nintegral role in fostering economic growth and development and ensuring\npatient access to the most effective medicines around the world.\n\n             (6) There are concerns that certain countries have engaged\nin unfair price manipulation and abuse of compulsory licensing.\nAmericans bear the majority of research and development costs for the\nworld, which could undermine the value of existing United States\npharmaceutical patents and could impede access to important therapies.\n\n             (7) There is a growing global threat of counterfeit\nmedicines and increased need for the United States Trade Representative\nand other United States agencies to use available trade policy measures\nto strengthen laws and enforcement abroad to prevent harm to United\nStates patients and patients around the world.\n\n       (b) Sense of the Senate- It is the sense of the Senate that--\n\n             (1) the United States Trade Representative should use all\nthe tools at the disposal of the Trade Representative to address\nviolations and other concerns with intellectual property, including\nthrough--\n\n                   (A) bilateral engagement with United States trading\npartners;\n\n                   (B) transparency and balance of the annual `Special\n301' review and reviews of compliance with the intellectual property\nrequirements of countries with respect to which the United States grants\ntrade preferences;\n\n                   (C) negotiation of responsible and fair intellectual\nproperty provisions as part of bilateral and regional trade agreements; and\n\n                   (D) multilateral engagement through the World Trade\nOrganization (WTO); and\n\n             (2) the United States Trade Representative should develop\nand submit to Congress a strategic plan to address the problem of\ncountries that infringe upon American pharmaceutical intellectual\nproperty rights and the problem of countries that engage in price\nmanipulation.\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}