{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "730a 6/18 Update: Critical computer test on tap", "body": "\n\n\n\n\n730a 6/18 Update: Critical computer test on tap\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 72\nPosted: 7:34 AM, 6/18/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-69 (06/17/07): Spacewalk begins\n   SR-70 (06/17/07): Spacewalk ends; all major objectives accomplished\n   SR-71 (06/17/07): Flight director pleased with mission\n   SR-72 (06/18/07): Critical SARJ, attitude control tests on tap\n\n=================================\n\n7:34 AM, 6/18/07, Update: Final tests on tap to verify computer recovery, SARJ operation\n\nGround controllers tested a new solar array rotation system overnight in preparation for switching over to normal sun-tracking mode. Russian ground controllers, meanwhile, are gearing up for a critical test of the revived computers in the Russian segment of the space station to make sure they can control the lab's orientation with rocket thrusters as required after the shuttle Atlantis departs.\n\nIf all goes well, NASA's Mission Management Team is expected to give shuttle commander Rick Sturckow and his crewmates permission to seal the hatches between the station and the orbiter late today in preparation for undocking Tuesday.\n\nHere is a schedule of today's activities (in EDT and mission elapsed time; includes rev. N of the NASA television schedule):\n\nDATE/EDT...DD...HH...MM...EVENT\n\n06/18/07\n\n07:38 AM...09...12...00...STS/ISS crew wakeup\n10:08 AM...09...14...30...Crew off duty\n10:28 AM...09...15...50...Russian attitude control test\n12:00 PM...09...16...22...NASA Video File on NTV\n02:08 PM...09...18...30...Crew meal\n03:08 PM...09...19...30...Crew off duty\n03:38 PM...09...20...00...Post EVA transfer and reconfig\n05:18 PM...09...21...40...Oxygen transfer system teardown\n06:03 PM...09...22...25...Transfer tagup\n06:23 PM...09...22...45...Farewell ceremony\n06:38 PM...09...23...00...Shuttle crew departs station\n07:08 PM...09...23...30...Hatch closed\n07:38 PM...10...23...00...Rendezvous tools checkout\n07:38 PM...10...00...00...Leak checks\n10:08 PM...10...02...30...Station crew sleep begins\n10:38 PM...10...03...00...Shuttle crew sleep begins\n11:00 PM...10...03...22...Daily video highlights reel on NTV\n\n06/19/07\n\n06:38 AM...10...11...00...Crew wakeup\n07:30 AM...10...11...52...Flight director update on NTV\n10:42 AM...10...15...04...Atlantis undocks from space station\n\nThe primary goal of year's first shuttle mission was to install a new set of solar arrays, known as starboard, or S4, arrays on the right side of the station's main power truss, along with a solar alpha rotary joint, or SARJ, designed to rotate the huge panels like a giant paddle wheel to keep them roughly face-on to the sun. An identical SARJ and another set of solar arrays - P4 - were attached to the left side of the power truss last September.\n\nEach SARJ uses two redundant motors called drive lock assemblies, or DLAs, to turn a large gear, which in turn rotates the outboard solar arrays at up to 4 degrees per minute. The DLAs were moved from their launch positions and engaged with the drive gear during spacewalks by the Atlantis astronauts. Overnight, the DLAs were powered up and briefly tested.\n\n\"We powered up and looked at both drive lock assemblies, there are two of them, and we have what we call a string one (command chain) and then a second string that's redundant,\" said station Flight Director Holly Ridings. \"We have separate boxes and commands for redundancy requirements.\n\n\"So we looked at both of those drive lock assemblies, moved them around to different positions. Of course, we can't see them, but they're physically moving and we get telemetry feedback and so we checked out those DLAs on both strings and made sure they were all working properly. And they were, so that was good news. After that, we actually moved the SARJ just a little bit, 5 degrees, again on each string.\n\n\"We were looking at the video really closely and it's pretty slight, you can't really see it, but we've got telemetry feedback. We were looking at our momentum and you could see the change in momentum, it was between 4 and 5 degrees, which corresponded with the (commanded) 5 degrees, so we knew that it was working properly.\n\nLater today, flight controllers plan to initiate auto-track mode in which the U.S. computer system computes the position of the sun relative to the space station as the lab circles the Earth and drives the solar arrays to keep them properly oriented.\n\n\"That will be a big step,\" Ridings said. \"You'll obviously be able to see that. We're really excited about that.\"\n\nAfter that, ground controllers will test a so-called switch-over program to \"move from one string over to the second redundant string if something goes wrong. We want to make sure that works.\"\n\nBut the most critical test of the day comes later this morning. The space station's orientation will be changed by U.S. control systems to properly orient the combined shuttle-station vehicle for a water dump by Atlantis. At that point, flight controllers plan to switch attitude control over to the Russian terminal computers and rocket thrusters to put the station back in its normal orientation.\n\nThe station uses a combination of control systems - shuttle thrusters, U.S. control moment gyroscopes and Russian thrusters to control its orientation. During normal operation between shuttle visits, the CMGs provide stability and pointing control. But large adjustments require the Russian thrusters, which are controlled by so-called terminal computers in the Russian segment of the station.\n\nLast week, the command module's three terminal computers and three central command-and-control computers crashed when something affected the operation of secondary power supply surge protectors. After three days of around-the-clock troubleshooting, Russian engineers came up with a fix and asked station commander Fyodor Yurchikhin and flight engineer Oleg Kotov to use jumper cables to bypass the suspect power supply switches. The repair worked, and the computers were reactivated Friday and Saturday.\n\nToday, the flight control team will carry out a final major test to verify the attitude control system is working properly.\n\n\"We're going to go to orbiter vernier (thruster) control in order to do a water dump and then after that, we'll hand over to what we call RS (Russian segment) thruster control where we're firing those thrusters and our terminal computer in the Russian segment of the service module is using the algorithms in order to fire them in the correct sequence,\" Ridings said. \"And so, that's a big step in our checkout of the computers to make sure everything's working correctly, one of the things we really want to see before we go and undock the next day.\n\n\"After that, we're going to do another little step, which is called U.S. thruster only, where we still use the Russian thrusters but instead of the terminal computer being the brains of the operation, we're actually going to have the U.S. GNC (guidance, navigation and control) computer being the brains of the operation. And that's a mode we spend a lot of time in nominally.\n\n\"So we're going to go from Russian thruster control to USTO and then we'll have satisfied ourselves the thrusters are working properly, talking directly to the (terminal computer) and then talking through the (terminal computer) over to our GNC. And then we should be good and ready to undock.\"\n\nWhile the SARJ is activated and the attitude control system is checked out, the Atlantis astronauts will enjoy a half-day of off-duty time before saying farewell to their space station colleagues in a brief ceremony scheduled for 6:23 p.m. After that, hatches between the two spacecraft will be closed in preparation for undocking Tuesday.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}