{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "tiabynoedgejef@womeninmusic.com", "subject": "Brigance Madalene", "body": "MIME Ver: 1.74\nX-OriginalArrivalTime: Tue, 19 Jun 2007 13:24:22 +0300 5:05(UTC) FILETIME=[914:37164117]\n\nTheorize\nDedicate to your lover \n\nThe male protection organization of the world recommends to you :\n \nhttp://htgbsw.dmafcu.com\n\nWe advise you to use: 6 BOTTLES OF XTRASIZE+ + 3 FREE BOTTLES \nThat is the best course of treatment, and there are discounts! \n\nWe would like to thank John from FL, USA and Dan from Australia for sending us before and after photos and also letting us show them on our website.\n\nDid you know... MegaDik was featured in leading mens magazines such as FHM, MAXIM, plus many others, and rated No.1 choice for penis enlargement... Also seen on TV\n\nA breakthrough in herbal Science has created a pill that has been designed specifically for penis enlargement. The tests that took place over a 6 month period showed that out of the 5,000 Males from around the world who participated, the average gain after 5 months of taking MegaDik pills was 3.02 Inches! Amazing, PERMANENT RESULTS that will last.\n\n? Gain 3+ Inches In Length. \n? Increase Your Penis Width (Girth) By upto 20%.\n? Help Stop Premature Ejaculation! \n? Produce Stronger, Rock Hard Erections. \n? 100% Safe To Take, With NO Side Effects.\n? Fast Shipping WorldWide. \n? Doctor Approved And Recommended.\n? No Pumps! No Surgery! No Exercises! \n? Very discrete shipping and billing\n? 100% Money Back Guarantee. \n? *3 FREE Bottles Of MegaDik !! \n? Highly secure 128bit order processing \n\nWe offer a FULL MONEY BACK GUARANTEE if you are not completely satisfied with the results of MegaDik, you have nothing to lose, just a lot to gain!\n\nOrder MegaDik Now!\nhttp://iugbcw.mutw.net\nX58860800108\n\nany futureto request stop,\nof discontinuing,if you want also on\nIf you cant Order or move your postbox, please give me a mail \ndavid_mailserver@yahoo.com\n\n\n"}