{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Power Marketing Association<Power.Marketing.Association@calcium.netcontentinc.net>", "subject": "Power Delivery Planning/Distribution Engineering Fundamentals  April 17-20  Atlanta", "body": "\n\n\n\n\n\nIn\n\n\n\n\n\n\n\n\nPower Delivery Planning I: \nGetting the Basics Right\nApril 17 - 18, 2007  Atlanta, GA\nClick Here \n        To Download A Complete Conference Brochure\nFundamentals of Distribution Engineering  \nApril 19 - 20, 2007,  Atlanta, GA\nClick Here \n          To Download A Complete Conference Brochure\n\n\n\n\n\n\n\n\nClick Here For A Complete Listing\n        Of Upcoming Conferences\n\n\n\nOverview:\n\nThis course is appropriate for new utility employees and those new to the planning department, as well as supervisors and managers who need a quick overview on the entire planning function and how it is done by other utilities. \nIt will familiarize the attendee with modern power distribution and service planning concepts and practices and the way their job fits into the overall utility. \nThe course covers the basic steps in planning and how they integrate with other functions, data sources and processes within the larger organization. Goals and steps in planning are covered. \nBasic tools and methodology for planning are reviewed as are traditional, modern, and “asset management” approaches to planning. \nAll processes involved in development of the work plan, from the initial load forecasts to the final project implementation and approval are covered.\n\n \n\n\n  Register today!\n  Click\n    Here To Download A Complete Conference Brochure\n\n\n\nOverview:\n\nThis course is designed to provide an in depth overview of all areas of systems, components, and calculations relevant to distribution engineering. \nIt is perfect for anyone needing a thorough review of theory and calculations used in their day to day work and is suitable for engineers of all experience levels. \nThere is a strong focus on real-life problems which are used to teach the various methods and concepts. Each topic is concluded with practical application methods and principles that can be used in day to day work.\nWhat You Will Learn\nYou will be presented with the theories behind the various calculations used and are then left with practical, simplified methods and rules of thumb that yield accurate results.\nTopics include:\n\n\nSystem Design Principles\n\nEquipment Loading Practices\n\nTransformer Connections\n\nPower Flow, Voltage Drop and Fault Calculations\n\nSystem Protection and Coordination\n      Reliability\n\nApplication of Capacitors\n\nVoltage Regulation\n\nElectrical Losses\n\n\n\n  Register today!\n  Click\n    Here To Download A Complete Conference Brochure\n\n\n\n\n\n \n\n\n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}