{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Littlefield, Tyler\" <compgeek13@gmail.com>", "subject": "Re: switching from amd to p3", "body": "It's in the right way, and it's master...\n\nThanks,\n~~TheCreator~~\n[My programs don't have bugs; just randomly added features]\nmsn:\ncompgeek13@gmail.com\naim: st8amnd2005\nskype: st8amnd127\nvertigo head coder\nweb: tysdomain.com\n----- Original Message ----- \nFrom: \"Spie Sutherland\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Saturday, June 16, 2007 9:03 PM\nSubject: Re: switching from amd to p3\n\n\n> Tyler said:\n> The cables are ok. do I just move it around on the cable?\n>\n> The disk boot error is severe, and I would think that needs\n> to be solved even if you want to do a network boot. It is\n> hard to say without trying some things, but I would check\n>\n> Is the IDE cable inserted the right way up in the drive.\n> Some drives will only let you insert it one way, others\n> will let you do it upside down.\n>\n> Is the IDE cable inserted into the first IDE controller\n> port on motherboard. Best way to check is in BIOS,\n> you should see the drive as master.\n>\n> Is the power cable inserted in the drive.\n>\n> If more than one drive on same cable, one must be\n> set as master, one as slave, done by jumpers using\n> the label on drive as guide. As suggested before if\n> there already is another drive, try removing it and\n> boot with just the newly setup drive.\n>\n> If all the physical connections seem okay, the next\n> thing I would do is boot from a CD or floppy and\n> do what I said before, at the boot prompt enter\n>\n> kernel-name root=/dev/hda1 noinitrd ro\n>\n> where kernel-name is the name of kernel on the\n> removable media, and the kernel is a \"bare\" one,\n> not specific to hardware, ie its 386 and generic\n> controllers. On slackware its called bare.i but\n> there should be an equivalent on debian. And\n> make sure the root= points to the right drive\n> letter and number of the partition with the root\n> file system.\n>\n> You could also try loading a generic kernel on\n> the AMD, making sure it boots there, then\n> moving the kernel over. You'll have to check\n> the debian docs to find out which kernel to use.\n> I haven't use debian in a while.\n>\n> > How hard are these floppies to get for deb?\n>\n>\nhttp://http.us.debian.org/debian/dists/etch/main/installer-i386/current//images/floppy/\n> http://www.debian.org/releases/stable/i386/ch04s03.html.en\n>\n>   -- Spie\n>\n>\n>\n>\n>\n>\n>\n> > Thanks,\n> > Thanks,\n> > ~~TheCreator~~\n> > [My programs don't have bugs; just randomly added features]\n> > msn:\n> > compgeek13@gmail.com\n> > aim: st8amnd2005\n> > skype: st8amnd127\n> > vertigo head coder\n> > web: tysdomain.com\n> > ----- Original Message ----- \n> > From: \"Spie Sutherland\" \n> > To: \"Speakup is a screen review system for Linux.\"\n> \n> > Sent: Saturday, June 16, 2007 7:03 PM\n> > Subject: Re: switching from amd to p3\n> >\n> >\n> > > If you're getting disk boot failure then probably something\n> > > is not right with the physical connection, the IDE cable or\n> > > possibly the BIOS needs to be tweaked to recognize the\n> > > hard drive. If there is more than one drive in the system\n> > > make sure the one you are moving in is on the first IDE\n> > > port so it's drive A, also make sure there are no conflicts\n> > > if you have two drives in there ie make sure one is set as\n> > > master by jumper and the other is set as slave.\n> > >\n> > > I think you can get disk boot error even if there is no disk\n> > > at all, so start by checking the physical connections and\n> > > jumpering of drives.\n> > >\n> > > The other thing that sometimes happens when moving\n> > > drives around is that what was drive a becomes drive\n> > > c for example, in that case you will get a kernel panic\n> > > with message stating no root file system found. If this\n> > > happens, then the other procedure I mentioned will\n> > > work, booting from cdrom or floppy, loading the\n> > > kernel from removable storage with the boot param\n> > > root= pointing to the proper location of root file system\n> > > (follow that with noinitrd ro) and then once booted you\n> > > can rebuild the kernel and update the bootloader.\n> > >\n> > > What you are doing is definitely possible, I have done\n> > > it many times, building an entire system on on PC then\n> > > then moving the drive to a mobile system.\n> > >\n> > >   -- Spie\n> > >\n> > > _______________________________________________\n> > > Speakup mailing list\n> > > Speakup@braille.uwo.ca\n> > > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> >\n> > _______________________________________________\n> > Speakup mailing list\n> > Speakup@braille.uwo.ca\n> > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}