{"category": "ham", "to_address": "ted.harding@manchester.ac.uk", "from_address": "Jim Lemon <jim@bitwrit.com.au>", "subject": "Re: [R] to draw a smooth arc", "body": "(Ted Harding) wrote:\n> This thread prompts me to ask about something I've\n> been pondering for a while, as to whether there's an\n> implementation somewhere ticked away in the R resources.\n> \n> So far, people have been responding to the original query\n> in terms of increasing the numbers of points, and joining\n> these by lines.\n> \n> However, if you're using PostScript output, you can draw\n> really smooth curves by exploiting PS's \"curveto\" operator.\n> This draws a cubic-curve segment in the following way:\n> \n> ...\n> Anyway. The Question: is there a general function for the\n> above kind of smooth curve-drawing?\n> \nHi Ted,\nMy experience with this some years ago was in anti-aliasing visual \nstimuli presented on a PC monitor. The intended line was calculated \npixel by pixel and the each pixel that the line touched was assigned a \nvalue based on a sawtooth function. The peak of the function was always \nexactly on the intended line and the luminance of the pixel was a linear \nfunction of the distance of its center along a perpendicular to the \nline. We used the width of a pixel as the lateral extent of the function \nwith adequate success. The lines appeared smooth until the viewer could \nresolve the individual pixels. Wider lines used a trapezoidal \ndistribution of luminance with the same slope on the limbs. I must note \nthat we did not have to create our stimuli in real time, and this method \nmight be too slow. However, I am fairly certain that if the function \nknew about the characteristics of the output device, one could base a \ncurveto function on this.\n\nJim\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}