{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nToday marks the first\n  time since 1963 that the U.S.\n  government has quarantined one of its citizens. The patient under quarantine\n  – an unidentified Georgia\n  man – is infected with a rare and dangerous form of tuberculosis, and\n  may have exposed passengers and crew of two trans-Atlantic flights. Nancy\n  Cordes will have the story and our Dr. Jon LaPook will tell you more about\n  how tuberculosis could be having a dangerous comeback.\n \nAs we honored America’s\n  fallen soldiers on Memorial Day, violence in Iraq\n  killed at least 10 U.S.\n  troops, making May the deadliest month for our soldiers in Iraq this\n  year. Lara Logan will report on the recent violence and have an exclusive\n  interview with Iraqi Prime Minister Nuri al-Maliki.\n \nAnd attacks on U.S. forces could be on the rise by\n  the end of summer. David Martin will have an update on the troop surge in Iraq\n  and what that could mean for the violence there.\n \nMeanwhile, extremely dry conditions are straining\n  the Southeast United States – causing\n  neighbors to turn in neighbors for violating water restrictions and prompting\n  churchgoers to pray for rain. But what’s behind this suddenly severe\n  drought? Kelly Cobiella will explain.\n \nIn certain parts of the Midwest,\n  trees are pulsing with the rhythm of hundreds of thousands of cicadas. Chicago’s suburbs\n  are in the midst of the reawakening of a certain brood of cicadas that only hatches\n  once every 17 years. Michelle Miller is there, and will have the story of the\n  moment these cicadas have been waiting for.\n \nAnd tonight we’ll have a special report from\n  correspondent Kimberly Dozier, who is making her return to the CBS Evening\n  News by reporting on the new crop of Iraq war wounds and the suffering\n  they’re causing patients. And later tonight, Dozier will be telling the\n  story of the attack that hit her CBS News crew one year ago.\n  “Flashpoint,” a one-hour special, will air tonight on CBS at 10\n  p.m. ET/PT. Also, check out the special “Flashpoint”\n  section at CBSNews.com.\n \nI hope you had a great Memorial Day weekend.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}