{"category": "spam", "to_address": "<kedda@flax24.uwaterloo.ca>", "from_address": "\"BioStem Trading Alert\"<Genie.Gonzales@findscustomers.com>", "subject": "BTEM completed tax filings show first year of profitability", "body": "\n\n\nBTEM completed tax filings show first year of profitability\n\n\n\n\n\nBTEM completed tax filings show first year of profitability\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nBioStem\n                                (BTEM) Announces: Cryobanks Experiences Remarkable\n                                  \n                                  Growth of Over 300 Percent in Four Years; Completed\n                                  \n\n                                  Tax Filings Show First Year of Profitability\n\n\n\n \n\n\n\n \n\n\nCompany Celebrates Entrance to 14th Year of Business \nATLANTA, GA--(MARKET WIRE)--May 21, 2007 -- BioStem,\n                              Inc. (OTC BB:BTEM.OB - News)\n                              announced today that Cryobanks International, Inc.\n                              (Cryobanks), which has agreed to be acquired by BioStem,\n                              Inc., has experienced remarkable growth as its organization\n                              announces an increase of over 300 percent in the\n                              past four years. Cryobanks additionally celebrates\n                              two monumental milestone as tax filings are completed\n                              which result in its first year of profitability,\n                              as well as an entrance into its 14th year of business\n\n\n \n\n\n\n\n \nThe\n                        Cryobanks Company has seen its business grow all over\n                        the world in a short period of time, establishing licensees\n                        in Athens, Greece and Delhi, India. Eight additional\n                        facilities are under contract, including one in Bangkok,\n                        Thailand, which will open within the next 60 days.  \n                    \n\"While we've had tremendous success, we also want the\n                        cord blood industry to continue to grow,\" says Dwight\n                        C. Brunoehler, Founder and President of CI.   \"Public\n                        education will be the key to ensure growth and an understanding\n                        of the overwhelming benefits of cord blood donation at\n                        delivery.\"  \n                      \nWith one of the largest cord blood inventories\n                        in the country and a growing presence nationally and\n                        internationally, CI has become a leader in the industry.\n                        Accredited by the American Association of Blood Banks,\n                        the Company is one of 13 cord blood banks worldwide that\n                        form the National Marrow Donor Program's Center for Cord\n                        Blood, providing physicians and their patients access\n                        to the most diverse inventory of cord blood units in\n                        the world. Its inventory of more than 9,700 units of\n                        cord blood donations is part of international registries\n                        available to anyone who needs a transplant. That inventory\n                        has grown by more than 50 percent over the last four\n                        years.\n\n \n\n\n \n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}