{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nSaturday, 26 May, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nDunfermline 0-1 Celtic\nJean-Joel Perrier Doumbe nets a late winner to take the Scottish Cup to Celtic Park.\n\n\n\n \nStrachan relishes Celtic Double\nCeltic manager Zombie Strachan enjoys watching his players having fun after their 1-0 victory over Dunfermline in the Scottish Cup final at Hampden.\n\n\n\n \nLennon leaves Celtic on high note\nNeil Lennon is delighted to be leaving Celtic with a Scottish Cup winners medal.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nBroadhurst and Fisher share lead\nRoss Fisher birdies five of the last seven holes to join Paul Broadhurst at the top of the PGA Championship leaderboard.\n\n\n\n \nPGA Championship leaderboard\nJustin Rose continues his challenge at the PGA Championship at Wentworth.\n\n\n\n \nCabrera moves to challenge Rose\nAngel Cabrera joins Justin Rose at the top of the leaderboard at the PGA Championship at Wentworth.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nAlonso eclipses Hamilton for pole\nFernando Alonso edges out McLaren team-mate to pole position for Sunday's Monaco Grand Prix.\n\n\n\n \nBayliss secures Silverstone pole\nTroy Bayliss beats James Toseland to pole position for Sunday's World Superbikes race at Silverstone.\n\n\n\n \nMonaco qualifying as it happened\nMcLaren and Ferrari renew their battle for pole in rainy conditions in Monte Carlo.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nAlonso eclipses Hamilton for pole\nFernando Alonso edges out McLaren team-mate to pole position for Sunday's Monaco Grand Prix.\n\n\n\n \nMonaco qualifying as it happened\nMcLaren and Ferrari renew their battle for pole in rainy conditions in Monte Carlo.\n\n\n\n \nDennis backs 'good guy' Hamilton\nMcLaren boss Ron Dennis says  Lewis Hamilton does not need to be ruthless to become Formula One world champion.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nBenjamin ready to launch comeback\nBritish 400m runner Tim Benjamin is targeting a return to his best form under new coach Colin Jackson.\n\n\n\n \nKenyan trio to miss World Champs\nWorld record holder Paul Tergat is one of three Kenyan marathon stars unavailable for August's World Championships in Osaka.\n\n\n\n \nPavey races to Manchester victory\nBritain's Jo Pavey produces a world-class performance to win the Great Manchester Run.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nRiis told to return yellow jersey\nCycling's governing body calls on 1996 Tour de France champion Bjarne Riis to return his yellow jersey after the Dane confesses to doping.\n\n\n\n \nZabel admits to doping at Telekom\nGerman cyclist Erik Zabel becomes the latest cyclist to admit to using banned blood booster EPO while competing for Telekom in the 1990s.\n\n\n\n \nLuca regains Giro d'Italia lead\nItaly's Danilo di Luca wins the 12th stage of the Giro d'Italia to take the overall leader's pink jersey.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nReview of the week\nGraham Poll gets his air guitar out as the Liverpool parade bus stays in the garage\n\n\n\n \nFarewell West Jesmond\nBBC Sport's adopted team look back on their season\n\n\n\n \nQuotes of the Week\nLawro says what he thinks about the FA Cup final, plus Mourinho & Warnock\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}