{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Wall Street Journal: Gates Grant Targets Health Gauges Gift of $105 Million Is Made to Measure", "body": "\n\n----------\n\n\n\nThe new institute will be headed by Christopher Murray, a professor at\nthe University of Washington, who previously served as director of a\npublic-health program at Harvard University and as an official at the\nWorld Health Organization. The institute's missions will include\ncollecting and analyzing data on health trends, such as the prevalence\nof major diseases and the availability of health services, as well as\nconducting independent evaluations of the effectiveness of health\nprograms.\n\n\n\nThe institute will have an oversight board of independent directors\nheaded by Julio Frenk, Mexico's former minister of health, as well as\nan advisory panel of scientists. It will have 130 employees within two\nyears, officials said.\n\n------------------------------------------------\n\nGates Grant Targets Health Gauges\nGift of $105 Million\nIs Made to Measure\nImpact of Programs\nBy ROBERT A. GUTH\nJune 5, 2007; Page A8\n\nThe Bill & Melinda Gates Foundation has given a $105 million grant to\nthe University of Washington to measure the impact of public-health\nprograms globally, part of a broader effort by the foundation to better\ntrack private money spent on health.\n\nUnder the plan, the 10-year Gates grant will be combined with $20\nmillion from the university to set up and operate the Institute for\nHealth Metrics and Evaluation in Seattle.\n\nThe new institute will be headed by Christopher Murray, a professor at\nthe University of Washington, who previously served as director of a\npublic-health program at Harvard University and as an official at the\nWorld Health Organization. The institute's missions will include\ncollecting and analyzing data on health trends, such as the prevalence\nof major diseases and the availability of health services, as well as\nconducting independent evaluations of the effectiveness of health\nprograms.\n\nThe plan reflects the Gates foundation's strategy of using statistical\nmeasures to determine the effectiveness of its grant-giving. The\ninstitute will disseminate the information it gathers about global\nhealth issues, programs and giving, officials said.\n\nInstitute officials pointed to the dearth of available statistics in\nglobal health, contrasting that to business, which runs on clear\nresults. \"It would seem strange that we would need an institute like\nthis,\" Dr. Murray said. But in public health, \"we're so far behind the\nnorm in other sectors.\"\n\nAs an example of the institute's possible work, Dr. Murray pointed to\nchild mortality, which has historically been tricky to measure, he\nsaid. The institute expects to collect census and other data to create\na more accurate understanding on child mortality today, as well as past\nand future trends, he said. The institute would cull data and\ninformation from Unicef and government agencies around the world, he\nsaid.\n\nThe grant is the second major one given by the Gates foundation to\nmeasure health. In 2005 the foundation donated $50 million to create\nthe Health Metrics Network with the World Health Organization to fund\nprograms that generate information on health in developing countries.\n\nIt is unclear whether the institute might face resistance from\ngovernments and organizations that would prefer to evade close scrutiny\nof their health practices and programs. Tachi Yamada, president of the\nBill & Melinda Gates Foundation's Global Health Program, said the\nresearch isn't designed to be a \"public report card\" on health-care\nprograms. Institute officials said they are counting on a recent move\ntoward more transparency by governments about their health challenges.\n\nThe institute will have an oversight board of independent directors\nheaded by Julio Frenk, Mexico's former minister of health, as well as\nan advisory panel of scientists. It will have 130 employees within two\nyears, officials said.\n\nWrite to Robert A. Guth at rob.guth@wsj.com1\n   \tURL for this article:\nhttp://online.wsj.com/article/SB118099405948724225.html\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}