{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: The Man (Not) In The Bubble", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nThe \n      Public Eye Chat With .... Jim Axelrod\"I’ve got three kids. I spend a lot of \n      time on soccer fields and in coffee shops, elementary schools. I talk to \n      people, my friends across the country in different businesses; have civic \n      obligations; belong to a synagogue. I’m not in a bubble. I’m a very \n      regular guy who spends 8, 10 or 12 hours at an office that’s either in the \n      White House or right across the street from the White House. But that’s \n      not where I’m living my life.\"[+ Read More]\n\nMacVicar \n      Discusses Iran Sabotage ReportBecause Shelia MacVicar's exclusive \n      story on Iran's nuclear program \n      discussed \"covert\" tactics against Iran's nuclear program, I \n      asked her if she had concerns \n      that airing it could have national security implications. \"It was made very clear to me that the Iranians \n      are extremely aware of foreign sabotage,\" MacVicar told Public \n      Eye. She also said that there was information that she kept out of \n      the report. [+ Read More]\n\nTV \n      News' Ratings LustI’m sure you’ve noticed it. We’ve \n      all noticed it. The women reporting the news seem to get easier on \n      the eyes every year. “The Daily Show” even did an inspired segment on the \n      rise of ”NILF”s last week. (As for my trend-spotting self, I first noticed \n      the trend a few years back, when I actually stayed on Telemundo for a few \n      moments, despite not speaking a lick of Spanish.) Even today’s New York \n      Post, in reporting on CNN’s Paula Zahn contract status, adds “attractive \n      anchor-babes are lined up like dominoes to fill the resulting vacancies.” \n      [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nThe \n      Public Eye Chat With…Sharyn Alfonsi\n \nThe \n      Public Eye Chat With…Linda Mason\n \nThe \n      Public Eye Chat With…Jeff Greenfield\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}