{"category": "ham", "to_address": "\"Lhachimi, Stefan\" <Lhachimi@demogr.mpg.de>", "from_address": "\"jim holtman\" <jholtman@gmail.com>", "subject": "Re: [R] Importing an Excel file that has merged cells", "body": "I think this does what you want using the 'na.locf' function is zoo:\n\nx <- read.csv('/tote.csv', header=FALSE, skip=4)\n# fill blanks in name column with NAs\nis.na(x$V2) <- x$V2 == \"\"\n# load the 'zoo' library for the function na.locf\nrequire(zoo)\nx$V1 <- na.locf(x$V1)  # key\nx$V2 <- na.locf(x$V2)  # name\nhead(x,30)\n\n\n\nOn 6/30/07, Lhachimi, Stefan  wrote:\n>\n> Dear all,\n>\n> I have a problem with importing an excel file into R. I can open the\n> file easily (either saving it as a CSV or using RODBC). But the\n> original file is using merged cell in its first column, which gives\n> the name of the observation. (I am dealing with repeated measurements\n> for the same observation)\n> So when I open the dataframe in R it looks like this\n>\n> Col1    Col2 Col3\n> name1 val1 val2\n>      val3 val4\n> ....\n> name2  val5  val6\n>       val7  val8\n>\n> Everything is fine, except that the name of the observation is on the\n> first line and the following rows are empty. Until a new observation\n> starts, where a new name appears in the respective row and the\n> following rows are empty and so on.\n>\n> The number of rows is fixed for each observation. How can I fill the\n> column with the proper name (eg take the first string in this column\n> until you hit a row with a new string, then take this string and go on\n> until the next string).\n>\n> Or read the excel file in such a way, that when cells are merged that\n> when importing it to R all cells created from this merged cell should\n> have the same content.\n>\n> Unfortunately, I cannot change the lay-out of the original excel file\n> as it comes from an commercial data-base and I will have to use it\n> quite often.\n>\n> I have the gut feeling that there might be an easy solution out there\n> as it does not seem to be an uncommon problem.\n>\n> So if you have  hint or a solution I greatly appreciated it.\n> Thanks and a nice weekend,\n>\n> Stefan\n>\n>\n> ----------\n> This mail has been sent through the MPI for Demographic Rese...{{dropped}}\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide\n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n\n\n-- \nJim Holtman\nCincinnati, OH\n+1 513 646 9390\n\nWhat is the problem you are trying to solve?\n\n\t[[alternative HTML version deleted]]\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}