{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "\"CNN Political Ticker\" <politicalticker@cnn.com>", "subject": "CNN Political Ticker AM, Thursday, April 12, 2007", "body": "For the latest, breaking political news, check for updates throughout the day on the CNN Political Ticker\nhttp://www.cnn.com/ticker. All politics, all the time.\n\nCompiled by Stephen Bach (stephen.bach@cnn.com)\nCNN Washington Bureau\n\nMaking news today...\n\n* Fred Thompson's \"dramatic and very public revelation Wednesday that he was diagnosed with cancer in 2004 is another\nsign that the former U.S. senator representing Tennessee may end up running for president, supporters and political\nobservers said.\" (The Tennessean)\n\nThompson, \"who has yet to announce his candidacy, is ahead of a slumping John McCain\" in the latest LA Times/Bloomberg\npoll. (Bloomberg)\n\nIn the poll, Rudy Giuliani leads with 29% of probable Republican primary voters surveyed, followed by Thompson with 15%\nand McCain with 12%. Mitt Romney had 8%.\n\n\"The Arizona senator's showing in the poll is his lowest in any national survey to date, marking a new benchmark in his\nflagging fortunes.\" (Los Angeles Times)\n\nFULL POLL RESULTS: http://www.latimes.com/media/acrobat/2007-04/28985341.pdf\n\n* \"[S]truggling to reinvigorate his foundering presidential campaign, [McCain] delivered a robust defense of the war in\nIraq on Wednesday, declaring that President Bush and the conflict's supporters are on the right side of history in the\nstruggle against terrorism and extremism.\" (Washington Post)\n\nAlso, McCain's \"troubled presidential campaign is eliminating some non-senior staff positions and cutting some\nconsultants' contracts.\" (AP)\n\n* PROGRAMMING NOTE: Elizabeth Edwards joins CNN's Larry King tonight for her first live primetime interview since the\nrecurrence of her cancer. LKL, 9 pm ET.\n\n* In Rep. Duncan Hunter's (R-CA) formal FEC filing \"making his bid official, Hunter misspelled 'president,' mangling\nthe name of his committee as 'Hunter for Prseident Inc.'\" (Roll Call)\n\n* \"It was about the strangest medical contraption I've seen since the Dark Ages.\" - Witness on Sen. Tom Carper's (D-DE)\n\"super-duper-bizarro splint,\" the \"Roll-A-Bout\" (manufactured in Delaware). He broke a bone in his foot in a\nhalf-marathon last month. (DC Examiner)\n\nThe \"Roll-A-Bout\" in action: http://www.rollcall.com/images_rollcall_acm/carper041207.jpg\n\n* And how is the environmental movement comparable to the bodybuilding movement, according to CA Gov. Arnold\nSchwarzenegger? Find out in Hot Topics below!\n\nPresident's Schedule:\n\n* President Bush participates in a 9:55 am ET meeting on No Child Left Behind Reauthorization in the Roosevelt Room at\nthe White House.\n\nAlso on the Political Radar:\n\n* The House is not in session this week.\n\n* Sen. Christopher Dodd (D-CT) holds kitchen table events on education at a private home in Des Moines (10:30 am ET)\nand at Iowa State University in Ames, IA (1 pm ET). At 2:30 pm ET, Dodd will get a tour of ISU's Center for Crops\nUtilization Research.  At 5 pm ET, he addresses the Iowa State Education Association Delegate Convention in Ames.\n\n* DNC Chairman Howard Dean joins Denver Mayor John Hickenlooper for a Community Celebration of the Denver 2008\nDemocratic National Convention. Denver Convention Center, 1 pm ET.\n\n* Mitt Romney holds a 2:25 pm ET presser at the Hilton Suites Chicago in Chicago, IL.\n\n* John Edwards attends a 7 pm ET \"Special Community Gathering\" at Florida Community College of Jacksonville.\n\n* Elizabeth Edwards officially opens the IA HQ of the John Edwards for President campaign in Des Moines at 1 pm ET.\nShe later addresses the IA State Education Association Delegate Convention in Ames at 4:30 pm ET.  She appears on CNN's\nLarry King Live at 9 pm ET.\n\n* Sen. John McCain (R-AZ) attends the Southeast Michigan Ronald Reagan Memorial Dinner at 5:50 pm ET in Bloomfield, MI,\nand the Ottawa County Lincoln Day Dinner at 7:55 pm ET in Holland, MI.\n\n* Sen. Sam Brownback (R-KS) meets and greets Myrtle Beach and Conway Republicans at the Sidewheeler Restaurant, 7 pm ET\nin Conway, SC.\n\n* House Speaker Nancy Pelosi appears on \"The Tonight Show with Jay Leno.\"\n\n* The Senate Radio-Television Correspondents' Gallery Daybook: http://www.senate.gov/galleries/radiotv/list.htm\n\n=================================================================\nPolitical Hot Topics\n(Today's top political stories from news organizations across the country)\n\nARMY EXTENDS TOURS TO 15 MONTHS: The military announced Wednesday that most active duty Army units now in Iraq and\nAfghanistan and those sent in the future would serve 15-month tours, three months longer than the standard one-year\ntour. Secretary of Defense Robert M. Gates, who announced the change at a news conference at the Pentagon, said that\nthe only other way to maintain force levels would have been to allow many soldiers less than a year at home between\ncombat tours. Mr. Gates said the problem was evident even before President Bush ordered an increase in troops for Iraq\nthis year. Officials said the change became inevitable as the numbers of extra troops that were needed - and, most\nlikely, the time the extra forces would have to stay - increased. New York Times: U.S. Is Extending Tours of Army in\nBattle Zones http://www.nytimes.com/2007/04/12/world/middleeast/12military.html\n\nPELOSI AND REID WILL GO THE WHITE HOUSE: Democratic leaders last night accepted President Bush's offer to discuss the\nwar-funding standoff, capitulating to the White House request after a day of alternately snubbing the invite and\nproposing meetings on their own turf. \"We will be at the White House on Wednesday to talk with the president,\" House\nSpeaker Nancy Pelosi and Senate Majority Leader Harry Reid said in a joint statement released last night. \"We will\nlisten to his position, but in return we will insist that he listen to concerns of the American people that his\npolicies in Iraq have failed and we need to change course,\" they said. Washington Times: Democrats will meet Bush on\nwar funds http://www.washingtontimes.com/national/20070412-121631-1149r.htm\n\nBUSH RENEWS VETO THREAT AS SENATE PASSES STEM CELL BILL: For the second time in nine months, the Senate yesterday\npassed a bill that would loosen President Bush's restrictions on human embryonic stem cell research -- but once again\nfell short of the two-thirds majority needed to override a promised veto. Nineteen Republicans joined 44 Democrats and\nindependents to pass, 63 to 34, the Stem Cell Research Enhancement Act, which would allow federally funded studies of\nstem cells isolated from embryos slated for disposal at fertility clinics... With the House having passed a similar\nbill in January, the two chambers are now set to work out compromise wording and send the legislation to Bush. But\ntheir victory promises to be short-lived. Yesterday, the president voiced his intention to veto the bill -- just as he\nhad last July when nearly identical language passed the Senate, 63 to 37. Washington Post: Stem Cell Bill Easily Clears\nSenate But Lacks Votes to Override a Veto\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/04/11/AR2007041101736.html\n\nOFFICIALS' RNC-ACCOUNT EMAILS MAY BE LOST: Political advisers to President Bush may have improperly used their\nRepublican National Committee e-mail accounts to conduct official government business, and some communications that are\nrequired to be preserved under federal law may be lost as a result, White House officials said Wednesday. Of the 1,000\nWhite House officials with political duties, 22 - including Karl Rove, the chief political strategist - have Republican\nNational Committee accounts that are supposed to be used only for campaign-related work. But recent revelations that\nsome officials have used those accounts for Bush administration business, including discussions of a plan to dismiss\nUnited States attorneys, has prompted a Congressional investigation... \"This sounds like the administration's version\nof the dog ate my homework,\" said Senator Patrick J. Leahy, Democrat of Vermont and chairman of the Senate Judiciary\nCommittee, which is investigating the dismissal of the prosecutors. New York Times: Bush Advisers' Approach on E-Mail\nDraws Fire http://www.nytimes.com/2007/04/12/washington/12emails.html\n\nCLOSE WALTER REED \"AS SOON AS POSSIBLE,\" SAYS PENTAGON PANEL: A top-level Pentagon review panel has concluded that\nWalter Reed Army Medical Center should be closed as soon as possible, following revelations of poor care that the panel\nblamed on a \"perfect storm\" of failed leadership, flawed policies and overwhelming casualties. In a preliminary report\nreleased yesterday, the panel appointed by Defense Secretary Robert M. Gates recommended accelerating the closure of\nthe Northwest Washington hospital but improving conditions there in the meantime. Under defense realignment decisions\nmade two years ago, the hospital's facilities were scheduled to move to the National Naval Medical Center in Bethesda\nby 2011. Washington Post: Panel Calls for Closing Walter Reed Sooner\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/04/11/AR2007041101234.html\n\nSTEELE SIGNS UP WITH LAW FIRM: Michael Steele, Maryland's 2006 Republican Senate candidate, announced Wednesday that he\nis joining LeBoeuf, Lamb, Greene & MacRae LLP. \"The synergies are right,\" said Steele. \"The firm has taken innovative\nrisks in the past with business and law. That is what I have done in the past with my own business and politics.\"\nSteele will be a partner in the New York law firm's Washington office. The former Maryland Lt. Governor expects to help\nelected officials and corporate executives prepare for congressional investigations under the new majority on Capitol\nHill. \"We want to send the word out to these individuals who are subpoenaed that we are there to help and can help\nnetwork and provide solid counsel,\" said Steele, who is also looking forward to working with telecom and bioscience\ncompanies in Africa. The Hill: Steele joins top law firm\nhttp://thehill.com/business--lobby/steele-joins-top-law-firm-2007-04-11.html\n\n\"RETIREMENT RUMORS\" FOR NM'S DOMENICI: The past two months have not been easy for Sen. Pete Domenici, the six-term\nRepublican from New Mexico accused of pressuring his state's former U.S. attorney on a political corruption\ninvestigation. Some have even speculated the trouble might force the 74-year-old to retire in 2008. Domenici's campaign\nfundraising tally, however, may quiet speculation, at least for now, that his retirement is imminent. Domenici\nannounced he raised $393,786 since January, giving him $541,116 in the bank. That is roughly comparable to what he had\nraised during the same period last time he was up for election, in 2001. It indicates he is on track for a strong\nre-election bid, said his campaign fundraiser, Heidi Fuller. Still, questions continue to be raised about his future.\nAP via Yahoo! News: Sen. Domenici faces retirement rumors\nhttp://news.yahoo.com/s/ap/20070412/ap_on_el_ge/prosecutors_domenici_s_future\n\nARNOLD COMPARES ENVIRONMENTAL MOVEMENT TO BODYBUILDING: Gov. Arnold Schwarzenegger urged environmentalists to shed\ntheir past image as \"serious tree huggers\" and begin a new movement that doesn't make people feel guilty for driving\ntheir SUVs, but instead focuses on building more fuel-efficient SUVs. \"For too long the environmental movement has been\npowered by guilt,\" Schwarzenegger said in a keynote speech Wednesday at a global warming conference at Georgetown\nUniversity. \"You know the kind of guilt I'm talking about: Smokestacks belching pollution and powering our Jacuzzis and\nour big-screen TVs and, in my case, powering my private airplanes. It's too bad for us that we can't live the lives of\nBuddhist monks in Tibet, but you know something, it doesn't happen.\"... Schwarzenegger compared the environmental\nmovement to his beloved bodybuilding movement in early 1970s, which was seen as full of fanatics working out in\n\"gymnasiums that were like dungeons.\" He said it took a public relations blitz to convince people that bodybuilding was\nlinked to better health. San Francisco Chronicle: Schwarzenegger's guiltless green\nhttp://www.sfgate.com/cgi-bin/article.cgi?file=/c/a/2007/04/12/MNG6FP74D61.DTL\n\nEAGLE PAC WILL RAISE CASH FROM MORMONS: A new congressional campaign group could piggyback on Mitt Romney's apparent\nsuccess in rounding up political cash from first-time Mormon contributors. Neither the website nor filing papers for\nthe Eagle Political Action Committee, or Eagle PAC, mentions Mormons. But those familiar with the PAC say one of the\nreasons Rep. Chris Cannon (R-Utah), a Mormon, created it this year was to solicit money from Mormons for distribution\nto Republican congressional candidates. That has never been tried before, said Cannon's congressional chief of staff,\nJoe Hunter, who registered the group as a leadership PAC with the Federal Election Commission on his own time. The\nPolitico: Mormon-Run PAC Aims to Broaden Its Reach http://www.politico.com/news/stories/0407/3504.html\n\nROMNEY WILL BE FIRST AT THE PLATE IN YOUTUBE'S EXPERIMENT: YouTube, the popular video Web site, wants you to have a\nlittle face time with the presidential candidates. Virtually speaking, that is. Starting Wednesday, White House\ncontenders from both parties will take turns posting videos on YouTube's News and Politics site, and YouTube watchers\nwill get to post their own video responses. The experiment is an outgrowth of YouTube's \"You Choose '08\" initiative\nthat kicked off in February to let candidates showcase their campaigns on the Web site through their campaign videos.\n\"Interactivity is what really fuels the engine on YouTube and candidates and users were striving for ways to\ncommunicate with each other,\" said Steve Grove, head of news and politics for YouTube. AP via Yahoo! News: Candidates\nto post videos on YouTube http://news.yahoo.com/s/ap/20070412/ap_on_hi_te/campaign_videos\n\nWILL CANDIDATES SPEND MILLIONS ON SUPER BOWL ADS? Drink beer, eat candy, buy a car. Now add a new pitch to next year's\nlineup of Super Bowl television ads: Vote for me. Politics? On Super Bowl Sunday? As states line up to hold\npresidential primudles on the first Tuesday in February, the Feb. 3 Super Bowl could look super inviting and super\nexpensive to presidential campaigns eager to deliver a knockout punch. \"That is a very ripe and timely target,\" said\nMark McKinnon, chief media strategist for President Bush in 2000 and 2004 and now an adviser to Sen. John McCain's\npresidential campaign. \"It would reach a huge audience at a very critical time. I think campaigns will look very\nclosely at that.\" AP via Yahoo! News: Campaigns may consider Super Bowl ads\nhttp://news.yahoo.com/s/ap/20070412/ap_on_el_pr/campaign_media\n\nTHOMPSON CANCER REVELATION \"ANOTHER SIGN\" HE'S RUNNING: Actor Fred Thompson's dramatic and very public revelation\nWednesday that he was diagnosed with cancer in 2004 is another sign that the former U.S. senator representing Tennessee\nmay end up running for president, supporters and political observers said. \"There is no other reason to reveal this\ninformation,\" said John Geer, a political scientist at Vanderbilt University. \"The fact he's putting it out now is a\nsign that he is giving it serious consideration.\" Bob Davis, chairman of the Tennessee Republican Party and a friend of\nThompson's, said the disclosure shows Thompson is honest. \"That's the kind of leadership that America is thirsting\nfor,\" he said. \"This shows that he's serious about considering a run.\" The Tennessean: Thompson cancer disclosure tests\nwater http://tennessean.com/apps/pbcs.dll/article?AID=/20070412/NEWS01/704120380\n\nCLINTON: \"SO WHAT, PEOPLE ARE GOING TO SAY SOMETHING BAD ABOUT ME?\" Sen. Hillary Rodham Clinton says the pain and\nturmoil of her White House years don't discourage her in the least as she wages a campaign she hopes will bring her\nback to 1600 Pennsylvania Avenue. \"I've decided this country is worth fighting for,\" she said, adding she is\n\"distraught\" about the last six years under President Bush. In a half-hour interview this week at the home of the\nArmy's 10th Mountain Division, Clinton discussed her revised approach to health care reform and her daughter's view of\nher presidential aspirations. She also talked of why, after eight tumultuous years as first lady, she wants to return\nto the White House. Contemplating possible slings and arrows on the campaign trail, she said, \"So what, people are\ngoing to say something bad about me?\" She burst out laughing. \"I mean really. I mean look. I understand how contentious\nAmerican politics is. And why? Because there are big things at stake.\" USA Today: Clinton: Attacks won't scare me off\nhttp://www.usatoday.com/news/washington/2007-04-11-hillary_N.htm\n\nIRAQ WAR \"IS NECESSARY AND JUST,\" SAYS McCAIN: Sinking in polls and struggling to reinvigorate his foundering\npresidential campaign, Sen. John McCain (R-Ariz.) delivered a robust defense of the war in Iraq on Wednesday, declaring\nthat President Bush and the conflict's supporters are on the right side of history in the struggle against terrorism\nand extremism. Dismissing public opinion polls as offering nothing but \"temporary favor\" to the war's opponents, McCain\ndirectly confronted the biggest obstacle to his White House ambitions: his unyielding support of a war that more than\ntwo-thirds of the country has turned against. Washington Post: McCain Calls War 'Necessary and Just'\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/04/11/AR2007041100203.html\n\nMcCAIN WON'T TAKE DONATIONS FROM TRIBES: Sen. John McCain (R-Ariz.) is refusing to accept campaign contributions from\nAmerican Indian tribes for his presidential campaign in an effort that tribal representatives believe is intended to\ndistance him from the Jack Abramoff lobbying scandal. Lobbyists for American Indian tribes say McCain's refusal is part\nof a broader stigma that has adhered to the tribes since it was revealed that Abramoff was converting millions of\ndollars of tribal money into campaign contributions and donations to charities in support of his lobbying activities.\nMcCain has not turned down money from other controversial interest groups, including some he has investigated in the\nSenate. For example, the Arizonan accepted several thousands of dollars from the office of the commissioner of Major\nLeague Baseball as he was leading the charge to force baseball to adopt tougher policies against steroids.  Roll Call:\nMcCain Refuses Tribal Money http://www.rollcall.com/issues/52_107/news/17948-1.html\n\nSLIPS TO THIRD PLACE: Sen. John McCain, once considered the front-runner for the Republican presidential nomination,\nhas fallen to third place in a new Los Angeles Times/Bloomberg poll, and is running behind Fred Thompson, an actor and\nformer senator who has not even entered the race. Former New York Mayor Rudolph W. Giuliani leads the crowded field of\nannounced and potential contenders with support from 29% of probable Republican primary voters surveyed, followed by\nThompson with 15% and McCain with 12%. Mitt Romney, the former Massachusetts governor and a fundraising powerhouse, had\n8%. The Arizona senator's showing in the poll is his lowest in any national survey to date, marking a new benchmark in\nhis flagging fortunes. The surge of interest in Thompson is a sign of conservative dissatisfaction with the established\nfield of candidates and underscores just how unsettled the Republican race remains. Los Angeles Times: Poll: McCain\nfalling behind with GOP voters http://www.latimes.com/news/politics/la-na-poll12apr12,1,5992585.story\n\nMAKING \"MINOR ADJUSTMENTS\" TO STAFF: Sen. John McCain's troubled presidential campaign is eliminating some non-senior\nstaff positions and cutting some consultants' contracts. The Arizona senator's campaign characterized the moves as\n\"minor adjustments\" that are part of an overall effort to revamp its fundraising office and budgeting operation. McCain\nordered a financial overhaul after he reported raising only $12.5 million from January through March, third behind his\ntop GOP rivals, Mitt Romney and Rudy Giuliani. \"A campaign is a dynamic organization like a business, and we have to\ntake the necessary steps to ensure it's as efficient and effective as possible,\" said Brian Jones, a campaign\nspokesman. AP via Yahoo! News: McCain campaign to cut back on staff\nhttp://news.yahoo.com/s/ap/20070412/ap_on_el_pr/mccain_campaign\n\nPROOFREAD, PROOFREAD, PROOFREAD: Even little 8-year-old Susie Flynn can spell \"president,\" something that the\narchitects of Rep. Duncan Hunter's (R-Calif.) run for the title of commander in chief apparently can't manage. In the\nCalifornia Republican's formal Federal Election Commission filing making his bid official, Hunter misspelled\n\"president,\" mangling the name of his committee as \"Hunter for Prseident Inc.\" On the bright side, although the field\nof candidates for the presidency is a bit crowded, Hunter is uncontested to be prseident. His signature song? \"Hail to\nthe Cheif.\" Roll Call: Heard on the Hill http://www.rollcall.com/issues/52_107/hoh/17951-1.html\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings go to\nhttp://audience.cnn.com/services/cnn/memberservices/member_auth.jsp?url=http%3A%2F%2Faudience.cnn.com%2Fservices%2Fcnn%2Fmemberservices%2Fregwall%2Fmember_profile.jsp%3Fsource%3Dcnn\n\nTo unsubscribe from the CNN Political Ticker list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=morninggrind\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n(c)2007 Cable News Network.\nA Time Warner Company.\nAll Rights Reserved.\n\n"}