{"category": "ham", "to_address": "<michelle.childs@keionline.org>, <ip-health@lists.essential.org>", "from_address": "<K.Shadlen@lse.ac.uk>", "subject": "RE: [Ip-health] Abbott cuts price Brazil pays for AIDS drug", "body": "The first imports of generic efavirenz, supplied by the Indian firm\nAurobindo, have arrived. See announcement from Brazilian embassy:\nhttp://www.brazil.org.uk/newsandmedia/pressreleases_files/20070703.html\n\n-------\nGeneric AIDS medicine arrives in Brazil\n\nJul 03 2007\n\nThe Ministry of Health today received the first batch of the generic\nformulation of the antiretroviral drug Efavirenz, which is used more\nthan any other medicine in the treatment of AIDS in Brazil.\nApproximately half of the Brazilian AIDS patients who receive free\nantiretroviral drugs from the government use it as part of their\n'cocktail' of medicines.\n\nThe first batch of generic Efavirenz is from the Aurobindo laboratory in\nIndia. Brazil is due to import a total of eight batches by January 2008,\nfour of which will be from the Indian company Ranbaxy.\n\nThe purchase of generic Efavirenz was made possible in May this year\nwhen President Lula decreed the compulsory licensing of the drug. The\ngeneric pills will cost only about a third as much as non-generic\nEfavirenz.\n\nThe pharmaceutical company Merck Sharp & Dohme holds the patent for the\ndrug, and will receive royalty payments of 1.5% from the Brazilian\ngovernment.\n\nSource: Agencia Brasil & Embassy of Brazil in London\n------------------\n\n-----Original Message-----\nFrom: ip-health-admin@lists.essential.org\n[mailto:ip-health-admin@lists.essential.org] On Behalf Of Michelle\nChilds\nSent: 05 July 2007 12:30\nTo: ip-health@lists.essential.org\nSubject: [Ip-health] Abbott cuts price Brazil pays for AIDS drug\n\n--\n[ Picked text/plain from multipart/alternative ]\nAbbott cuts price Brazil pays for AIDS drug\n\nLast Updated: 2007-07-04 15:00:33 -0400 (Reuters Health)\n\nBRASILIA (Reuters) - Abbott Laboratories Inc. said on Wednesday it\nwill cut the price it charges Brazil for its Kaletra AIDS drug by\n29.5 percent as part of a strategy to lower costs for developing\nnations.\n\nThe lower price for Kaletra, a combination of the drugs lopinavir and\nritonavir, will help Brazil supply free drugs for its globally\nrecognized AIDS treatment program.\n\n\"This accord saves Brazil's program more than $10 million a year and\ncreates a reserve for more patients with HIV,\" Abbott Vice President\nfor Latin America Heather Mason said at a press conference in Brasilia.\n\nIn May, President Luiz Inacio Lula da Silva authorized Brazil to\nbreak the patent on an AIDS drug for the first time after price talks\nbroke down with Merck & Co. <MRK.N. Brazil now imports a cheaper\ngeneric version of efavirenz, Merck's Stocrin, from India.\n\n\"The difference between the two cases was that Abbott sought an\nunderstanding with the Brazilian government,\" said Health Minister\nJose Temporao, seated next to Abbott executives.\n\nUnder WTO rules, countries can issue a \"compulsory license\" to\nmanufacture or buy generic versions of patented drugs deemed critical\nto public health.\n\nDrug makers often cut prices to keep developing countries as clients\nand avoid compulsory licenses.\n\n\"It would be very promising if Abbott's example were to be followed\nby other laboratories,\" Temporao said.\n\nBrazil has provided free universal access to AIDS drugs, condoms and\nsyringes for two decades as part of a prevention program lauded by\nthe United Nations.\n\nThe program helped Brazil slow infection rates and avoid what experts\nsaid could become an AIDS epidemic. Infection rates among adults have\nstabilized at levels similar to those in the United States.\n\nBut government spending on anti-retroviral drugs doubled in four\nyears to nearly 1 billion reais (US$495 million) in 2005, according\nto a Brazilian report for the United Nations.\n\nTemporao, a fiery new health minister who took office in March, has\nbeen outspoken in his criticism of high-priced drugs. He has also\nslashed prices on birth control pills, told men to get more\nvasectomies and angered Roman Catholic leaders by calling for a\nreferendum on whether Brazil should legalize abortion.\n\nOn Wednesday he said price talks were ongoing with many\npharmaceutical companies and that Brazil would like to produce more\ndrugs domestically.\n\nAbbott cut the price for Kaletra tablets, which currently have no\ngeneric equivalent, from a previously agreed $1.04 per pill to 73\ncents per pill this year and 63 cents in 2008.\n\nMason said the move was part of a strategy to cut prices for the\ntablets, which do not require refrigeration, for some four dozen\nmiddle-to-lower-income developing nations.\n\n\"It's a win-win situation,\" she said.\n\nBrazil will start offering Kaletra tablets to some 32,000 patients in\nSeptember, phasing out the use of capsules.\n\n\n---------\nMichelle Childs\nHead of European Affairs\nKnowledge Ecology International\nmichelle.childs@keionline.org\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\nPlease access the attached hyperlink for an important electronic communications disclaimer: http://www.lse.ac.uk/collections/secretariat/legal/disclaimer.htm\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}