{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@flax9.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "Napster to Present at the Bear Stearns 18th Annual Technology, Communications and Internet Conference", "body": "\n\n\n\n\n\n\n\n\nNapster to Present at the Bear Stearns 18th Annual Technology, Communications and Internet Conference\n\nLOS ANGELES, June 5, 2007 /PRNewswire-FirstCall via COMTEX News Network/ --  Napster (Nasdaq: NAPS) today announced that management will present to investors at 10:30am ET on Tuesday, June 12, 2007 at the Bear Stearns 18th Annual Technology, Communications and Internet Conference, being held at the Grand Hyatt New York Hotel in New York, NY.  An audiocast of the presentation will be made available from the \"Events\" page of the Company's investor relations website at http://investor.napster.com/ About Napster Napster, the pioneer of digital music, offers the ultimate in interactive music experiences, creating better ways to discover, share, acquire and enjoy music -- anytime, anywhere.  The company's offerings include \"Napster\" (http://www.Napster.com) -- the most popular on demand music subscription service in the world; \"Freenapster\" (http://www.freenapster.com) -- a unique Web experience offering free on demand music legally; and \"Napster Mobile\" -- one of the industry's fastest growing mobile music platforms.  Headquartered in Los Angeles, Napster's services are available in markets across North America, Europe and Japan. Copyright (C) 2007 Napster, LLC. All rights reserved. Napster is a registered trademark of Napster, Inc. or its subsidiaries in the United States and/or other countries. All other trademarks are owned by their respective owners. SOURCE  Napster Investors, Alex Wellins, alex@blueshirtgroup.com, or Jennifer Jarman,\njennifer@blueshirtgroup.com, both of The Blueshirt Group, +1-415-217-7722, for\nNapster\nhttp://www.Napster.com\n\n\n\n\n\n\n\n\n\n\n You are subscribed to Napster Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n Napster \n 461 S. Milpitas Blvd. , Milpitas, CA 95035\n Service provided by Shareholder.com \n\n\n\n\n\n"}