{"category": "ham", "to_address": "a2k discuss list <a2k@lists.essential.org>,\n   Ip-health <ip-health@lists.essential.org>", "from_address": "James Packard Love <james.love@keionline.org>", "subject": "[Ip-health] The Mandatory CL under Article 37 of the TRIPS", "body": "Article 37 of the TRIPS is an interesting way to implement an\nintellectual property right.  It pertains to layout-designs of\ncomputer chips.\n\n1.  Under this article, it is not unlawful to incorporate an \"an\nunlawfully reproduced layout-design or any article incorporating such\nan integrated circuit,\" if \"the person performing or ordering such\nacts did not know and had no reasonable ground to know\" that it was\nunlawful.\n\n2.  Once you find out that you have acquired an unlawful chip, *a\nmandatory* compulsory license kicks in, as follows:\n\n\"Members *shall* provide that, after the time that such person has\nreceived sufficient notice that the layout-design was unlawfully\nreproduced, that person may perform any of the acts with respect to\nthe stock on hand or ordered before such time, but shall be liable to\npay to the right holder a sum equivalent to a reasonable royalty such\nas would be payable under a freely negotiated licence in respect of\nsuch a layout-design.\"\n\n\n\nSECTION 6:  LAYOUT-DESIGNS (TOPOGRAPHIES) OF INTEGRATED CIRCUITS\n\nArticle 37:  Acts Not Requiring the Authorization of the Right Holder\n\n1. Notwithstanding Article 36, no Member shall consider unlawful the\nperformance of any of the acts referred to in that Article in respect\nof an integrated circuit incorporating an unlawfully reproduced\nlayout-design or any article incorporating such an integrated circuit\nwhere the person performing or ordering such acts did not know and\nhad no reasonable ground to know, when acquiring the integrated\ncircuit or article incorporating such an integrated circuit, that it\nincorporated an unlawfully reproduced layout-design.  Members shall\nprovide that, after the time that such person has received sufficient\nnotice that the layout-design was unlawfully reproduced, that person\nmay perform any of the acts with respect to the stock on hand or\nordered before such time, but shall be liable to pay to the right\nholder a sum equivalent to a reasonable royalty such as would be\npayable under a freely negotiated licence in respect of such a layout-\ndesign.\n\n2. The conditions set out in subparagraphs (a) through (k) of Article\n31 shall apply mutatis mutandis in the event of any non-voluntary\nlicensing of a layout-design or of its use by or for the government\nwithout the authorization of the right holder\n\n\n----------------------------------------------\nJames Packard Love\nKnowledge Ecology International\nmailto:james.love@keionline.org\ntel. +1.202.332.2670 / U.S. mobile+1.202.361.3040, Geneva mobile\n+41.76.413.6584\n\n\"If everyone thinks the same: No one thinks.\" Bill Walton\"\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}