{"category": "ham", "to_address": "IP-Health <ip-health@lists.essential.org>", "from_address": "Benjamin Krohmal <ben.krohmal@keionline.org>", "subject": "[Ip-health] Thai FDA: \"no more CLs\"", "body": "--\n[ Picked text/plain from multipart/alternative ]\nhttp://pharmalot.com/2007/05/thai_fda_no_more_broken_patent.php\n\nMay 7, 2007\nThailand: No More Broken Patents, For Now\n\nA contrite-sounding secretary general of Thailand's FDA says his\ncountry is through with issuing compulsory licenses for\npharmaceuticals, at least for now. \"At this moment, no other drugs\nwill come up for CL from the ministry of public health,\" Siriwat\nTiptaradol, told a sparsely attended press conference at the BIO\nconvention in Boston this afternoon.\n\nHe also says Thailand hopes to meet on May 14 with Abbott Labs to\ndiscuss the row over Kaletra, the AIDS med for which Bangkok has\nissued a compulsory license. That move prompted the drugmaker to\nretaliate by refusing to sell new meds to the country, although\nAbbott did offer to lower the price of a new, heat-resistant Kaletra\nif the license is dropped.\n\nThe controversy is now an international issue. Last week, the US\nTrade Rep placed Thailand on its Priority Watch List for failing to\n\"provide an adequate level of intellectual property rights protection\nor enforcement, or market access for persons relying on intellectual\nproperty protection.\" While acknowledging Bangkok hasn't violated\nworld trade rules, the US cited a \"lack of transparency and due\nprocess,\" which was called \"a serious concern.\"\n\nTiptaradol, who was on hand with more than a dozen other Thai\nofficials to discuss investment opportunities with biotech companies,\nalso said his government is \"this close\" to resolving disagreements\nwith Merck and Sanofi-Aventis. Bangkok already announced plans to\nissue compulsory licenses for a Merck AIDS drug and a Sanofi heart med.\n\n\"They have reduced their prices and we very close. If the price is\nreasonable and competes with price from India and China, we don't\nhave to use compulsory licenses,\" said Tiptaradol, adding that \"we\nhave to have a price that is reasonable to the consumer.\"\n\nYongyuth Yuthavong, the Thai minister of science and health, made a\npoint of noting that, during the anthrax scare in the US several\nyears ago, some politicians in Washington were quick to push for a\ncompulsory license for Bayer's Cipro antibiotic. \"This is something\neach country must do to look after its own citizens.\"\n\nThe patent issue dominated the 30-minute session, which attracted\nonly a handful of the 20,000 or so BIO attendees who are in Boston\nthis week. The controversy has clearly scared off biotech companies,\nwho Thai officials hoped to woo with a presentation on the merits of\ninvesting in Thailand. Instead, the nearly 20 Thai government reps\noutnumbered the tiny crowd of about a half dozen attendees.\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}