{"category": "ham", "to_address": "\"Francesco Poli\" <frx@firenze.linux.it>", "from_address": "\"Miriam Ruiz\" <little.miry@gmail.com>", "subject": "Re: Dual licensing", "body": "2007/5/11, Francesco Poli <frx@firenze.linux.it>:\nHi!  :)Thanks for your reply :) What do you mean by \"announcement clause\"?]\nDo you mean the Obnoxious Advertising Clause (OAC, hereinafter)?See[1] for more information about the OAC.[1] http://www.gnu.org/philosophy/bsd.html\nYep, I mean that one. Not my choice, but upstream's I did't searched hard in the list archive, but I think we can draft an\nappropriate permission notice, starting from the Perl one...    Copyright (c) [yyyy]  [author list]    This work is free software; you can redistribute it and/or modify    it under the terms of either:\n    a) the GNU General Public License as published by the Free Software       Foundation; either version 2, or (at your option) any later       version, or    b) the \"4-clause BSD license\" which is quoted below.\n    This work is distributed in the hope that it will be useful,    but WITHOUT ANY WARRANTY; without even the implied warranty of    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the    GNU General Public License, or the \"4-clause BSD license\" below for\n    more details.    You should have received a copy of the GNU General Public License    along with this work; if not, write to the Free Software Foundation,    Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA\n    The text of the \"4-clause BSD license\" follows:    Redistribution and use in source and binary forms, with or without    modification, are permitted provided that the following conditions\n    are met:     * Redistributions of source code must retain the above copyright       notice, this list of conditions and the following disclaimer.     * Redistributions in binary form must reproduce the above\n       copyright notice, this list of conditions and the following       disclaimer in the documentation and/or other materials provided       with the distribution.     * All advertising materials mentioning features or use of this\n       software must display the following acknowledgement: This       product includes software developed by the University of       California, Berkeley and its contributors.     * Neither the name of the copyright holders nor the names of\n       its contributors may be used to endorse or promote products       derived from this software without specific prior written       permission.    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n    \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT    LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS    FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\n    COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,    INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,    BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\n    LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT    LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN\n    ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE    POSSIBILITY OF SUCH DAMAGE.Of course, the usual disclaimers: IANAL, IANADD.Corrections and/or improvements from other debian-legal contributors are\nwelcome!Thanks, I'll suggest it to upstream, it seems good to me :) \nP.S.: I recommend you against the use of Google Gmail.      It's harmful for your own and your correspondents' privacy.      See the following links for more details:      \nhttp://www.eff.org/deeplinks/archives/001398.php      http://www.epic.org/privacy/gmail/faq.html      http://www.gmail-is-too-creepy.com/\nThanks for the advice, at some point in the future I'll probably switch out to it, but right now It's much better for me to be using a webmail, and yahoo, the other one in which I have an account, works like hell lately.\nGreetings and thanks,MiryPS: I'm not subscribed to the list, so please CC me in your answers\n"}