{"category": "ham", "to_address": "Cody_Hamilton@edwards.com, r-help@stat.math.ethz.ch", "from_address": "\"Greg Snow\" <Greg.Snow@intermountainmail.org>", "subject": "Re: [R] R vs. Splus in Pharma/Devices Industry", "body": "In my case, the MS word users know just enough about statistics to know\nthat they need a statistician (me or one of my group), so it is usually\nme that sets up the template.  This is generally for a set of\ngraphs/tables that will be included in a paper or presentation.  They do\nmost of the initial writing then I send them the graphs and tables that\nthey can cut and paste into the word document, then that gets passed\naround to the various authors for editing (I usually end up doing the\nstats methods and conclusions as well).\n\nBefore the odfWeave package, I would usually generate graphs one at a\ntime, copy and paste them into a word document, then create the tables\nin a matrix, use write.table('clipboard', sep='\\t') and paste that into\nexcel, then copy and paste that into word.  A real pain.\n\nNow I can set up an open office document for the plots and tables, run\nit through odfWeave, convert the output document to word and send it to\nthem, they usually copy and paste from the document I send to one they\nare working on.\n\nIf someone has an existing word document that you would like to turn\ninto a template, just use open office to convert it to an .odt file,\nthen replace any output that you want to be able to regenerate with the\nsweave/R statements and run it.  It works pretty well.\n\nI do work indirectly with some other statisticians that have to produce\nmonthly reports (that are essentially the same from month to month with\nupdated data).  I am working on converting them to using R/sweave.\nThese reports are usually put out as internal webpages for various\npeople in the organization to look at, so we could either go the\nodfWeave approach and generate pdf files (not as automated as I would\nlike), or use the R2HTML approach and have the template files and\nresults as html.\n\nHope this helps,\n\n-- \nGregory (Greg) L. Snow Ph.D.\nStatistical Data Center\nIntermountain Healthcare\ngreg.snow@intermountainmail.org\n(801) 408-8111\n \n \n\n> -----Original Message-----\n> From: r-help-bounces@stat.math.ethz.ch \n> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of \n> Cody_Hamilton@edwards.com\n> Sent: Thursday, June 14, 2007 2:19 PM\n> To: r-help@stat.math.ethz.ch\n> Subject: Re: [R] R vs. Splus in Pharma/Devices Industry\n> \n> \n> Greg,\n> \n> This is very interesting.  Perhaps something similar could be \n> worked out here.  Do you have to get MS Word users to work \n> only with the template you provide, or can they provide you \n> any old MS Word document?\n> \n> Regards, -Cody\n> \n> Cody Hamilton, PhD\n> Edwards Lifesciences\n> \n> But sweave is expanding.  There is a driver for HTML sweaving \n> in the R2HTML package and the odfWeave package allows you to \n> sweave with open office docs (which can be converted to/from \n> MS word).  I personally like using LaTeX and the original \n> sweave, but I work with people who want everything in MS word \n> or similar, so for them I will create a template file in open \n> office, odfWeave that, convert to MS word and send that to them.\n> \n> I think the offset is more that S-PLUS 8 is supposed to \n> implement many of the things that R does now (I don't know \n> which, I'm waiting for my copy of 8), so soon it may be \n> possible to sweave in both.\n> \n> --\n> Gregory (Greg) L. Snow Ph.D.\n> Statistical Data Center\n> Intermountain Healthcare\n> greg.snow@intermountainmail.org\n> (801) 408-8111\n> \n> \n> \n> > -----Original Message-----\n> > From: r-help-bounces@stat.math.ethz.ch \n> > [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of \n> > Cody_Hamilton@edwards.com\n> > Sent: Wednesday, June 13, 2007 4:07 PM\n> > To: r-help@stat.math.ethz.ch\n> > Subject: Re: [R] R vs. Splus in Pharma/Devices Industry\n> >\n> >\n> > I should have also noted that Sweave is available for use with R.  \n> > This is offset, however, by the fact that I will probably never be \n> > able to convince anyone to use Latex.  This is a pity as I \n> often find \n> > myself admiring reports done in Latex as opposed to the ones I have \n> > worked on in MS Word.\n> >\n> > Cody Hamilton, PhD\n> > Edwards Lifesciences\n> >\n> > As always, I am speaking for myself and not necessarily for Edwards \n> > Lifesciences.\n> \n> \n> \t[[alternative HTML version deleted]]\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide \n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}