{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGood afternoon,\n \nKatie’s on assignment today. This is Anthony\n  Mason filling in.\n \nCBS News reported today that the patient with\n  extreme drug-resistant tuberculosis is 31-year-old Atlanta lawyer Andrew Haley Speaker. In a strange\n  twist, Speaker’s new father-in-law is a government scientist who has\n  studied tuberculosis – but he says there’s no connection to his\n  son-in-law’s infection. Kelly Cobiella will have the very latest on\n  this evolving story and will also tell us how the public is reacting. Also, the\n  ease in which the patient crossed the country’s border has exposed\n  cracks in the national security system. Nancy Cordes will look at what this\n  case can illustrate about our country’s preparedness.\n \nIn Iraq,\n  the troop surge has reached full strength. But does it have a chance of\n  succeeding by September? David Martin will talk with one lieutenant general\n  who is not optimistic.\n \nMeanwhile, President Bush prepared to clash with\n  other world leaders at the upcoming G-8 summit by announcing his own plan for\n  battling climate change. Who’s backing it and who’s calling it\n  just another smoke screen? Jim Axelrod will have the answers.\n \nThe environmental impact of 9/11 is still potentially\n  being felt by tens of thousands of Americans: those who worked on rescue and\n  cleanup after the attacks. Now, as Kelly Wallace will report, a third-wave of\n  Ground Zero-related illnesses is appearing – in the form of cancer.\n \nHate e-mail Spam? You might be seeing a little bit\n  less of it. Robert Alan Soloway, now known as one of the world’s top\n  spammers, was arrested today. Bill Whitaker will tell you how this could\n  affect your in-box.\n \nAlso tonight, we’ll take you inside where a\n  sophisticated form of drug dealing takes place – and it looks just like\n  a doctor’s office. It is one of thousands of “pill mills” across\n  the United States.\n  They are the subject of a CBS News investigation, which reveals the ease with\n  which prescription drugs can be purchased – without a prescription. Chief\n  investigative correspondent Armen Keteyian will report.\n \nFinally, Byron Pitts will give you a look at the\n  library dedicated today to Rev. Billy Graham. I hope you’ll join us for\n  this and more,\n \n\n\n\n\nAnthony Mason\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}