{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 126", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. New Acropolis Museum in Athens will be issued with extremely\n      powerful long-range 'art binoculars' to enable them to view\tthe\n      Parthenon Marbles in London... (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Thu, 31 May 2007 13:39:22 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] New Acropolis Museum in Athens will be issued with\n\textremely\tpowerful long-range 'art binoculars' to enable them to view\n\tthe Parthenon Marbles in London...\nTo: msn-list@te.verweg.com\nMessage-ID:\n\t\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\n\nThursday, May 31, 2007\n'Elgin' Marbles will be visible from Athens, say experts\n\nlinks to photos at:\nhttp://www.artnose.co.uk/\n\n\nVISITORS to the New Acropolis Museum in Athens, due to open in 2008,\nwill be issued with extremely powerful long-range 'art binoculars'\n(left) to enable them to view the Parthenon Marbles in London when\nstanding on a specially designed viewing platform hundreds of feet up\non the top floor of the new museum. High-altitude breathing apparatus\nwill also be provided.\n\nFaced with age-old intransigence from the British Museum, whose\ndirector Neil MacGregor refuses to let his marbles go back to Athens,\nthe Greeks needed a novel solution. \"This is the only way we can allow\nour visitors to see the Marbles,\" said Greek Culture Minister Dave\nPraxiteles. \"It's true, they're not exactly reunited, but at least\nthis way if you screw up your eyes and stand on tiptoe and look\nreally, really hard, you can just see the left ear of the Horse of\nSelene over there in Bloomsbury. We're ecstatic.\"\n\nEarlier this week British Museum director Neil MacGregor mesmerized\nvisitors to the Hay Fever Festival in Middle England with his\nevangelical vision of, \"A glorious New Enlightenment with the British\nMuseum at its epicentre, a cornucopia overflowing with the world's\ncultural treasures, including my Elgin Marbles owned by Lord Elgin and\nnever by the Greeks because the Turks sold them to us legitimately, so\nthere.\"\n\nMeanwhile, the sensational art journalist Martin 'Gor' Blimey, who\nwrites every story in The Mart Newspaper each month, has reported that\nthe remaining marbles on the Acropolis (left) will be covered in\nbubble-wrap and rolled down the hill to their new home in the\nAcropolis Museum.\n\n\"The Mart Newspaper can report,\" wrote Mr Blimey, \"that this highly\ndangerous and incredibly risky and hugely irresponsible operation has\nbeen adopted with absolutely no forward planning and is a terrible way\nto treat the surviving masterpieces of one of the world's greatest\nmonuments and not what the British Museum would have done, but this is\njust what we would expect from a barbarous nation such as the Greeks.\"\n\nMrs Fredi Mercouri is 108\n\nPosted by Tom Flynn at 2:57 AM 0 comments Links to this\npost:http://www.artnose.co.uk/\nhttp://www.artnose.co.uk/\n\n-- \nTon Cremers\nhttp://www.museum-security.org/\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 126\n****************************************\n\n"}