{"category": "ham", "to_address": "<cc-community@lists.ibiblio.org>", "from_address": "<p.hatzopoulos-alumni@lse.ac.uk>", "subject": "[cc-community] Wiki politics 2", "body": "New online journal Re-public < www.republic.gr/en  >  has just published the second part of its special issue \"Wiki politics\". The issue explores how the use of new collaborative tools (wikis, blogs, forums, mailing lists, podcasting, and videos) can transform the ways politics are practiced . Articles include:  \n \nWard Cunningham - Wiki and the rise of gift economies   < http://www.re-public.gr/en/?p=141  >\nCreator of wiki software, Ward Cunningham, argues that the proliferation of wikis has proved that the for-pay economy is not the only way to create value. \n  _____  \nPete Ashdown -Open source politics  < http://www.re-public.gr/en/?p=145  >Being the first politician to to use a wiki to develop his campaign platform for the 2006 US Senate election in Utah, Pete Ashdown makes the case for open source politics.   _____  \nPaul Hartzog - Panarchy and the wiki-fication of politics  < http://www.re-public.gr/en/?p=148  > Hartzog introduces the concept of panarchy, a sociopolitical field that emerges when connective technologies enable cooperative peer-to-peer production \\u2013 of knowledge, of tools, of power.   _____  \nAustralian bill of rights initiative: Collaborating on public policy < http://www.re-public.gr/en/?p=142  >Wiki politics are put into practice. This article focuses on the development and the rationale behind ARBI  , an online project aimed at promoting awareness and discussion of human rights through the collaborative development of a bill of rights for Australia. \n  _____  \nAll articles of Re-public are published with a Creative Commons license and can be re-printed freely, by acknowledging their source. \n\t\n\nPlease access the attached hyperlink for an important electronic communications disclaimer: http://www.lse.ac.uk/collections/secretariat/legal/disclaimer.htm_______________________________________________cc-community mailing listcc-community@lists.ibiblio.orghttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}