{"category": "spam", "to_address": "<theorize@plg.uwaterloo.ca>", "from_address": "\"Reggie Q. Cleveland\" <ukw@sify.com>", "subject": "As ever, the sooner you book, the more likely you are to secure the cheapest seats.", "body": "\n\n\n\n\n\n\n\nThomson Fly's European destinations from Coventry \ninclude Amsterdam, Barcelona, Faro, Naples, Paris and Salzburg.\nBut in this case it's refreshing to see that Air \nService Plus has given no reason at all for the special offer which, oddly enough, \nonly applies to flights on the 29th December.\n(What's an RSS newsfeed?\nThis is a clearance sale, so expect the promotional \nfares to be few and far between - especially on the most popular routes. Remarkably \nthough - and none of us in this office understand how this works - EU Jet has also \nmanaged to arrange a two for one deal on the airport taxes.\nVisit the relevant carrier's website for full offer \ndetails - including small print.\nThe offer is valid on selected winter flights to \nand from Cologne Bonn and Stuttgart in western Germany between the start of December \nand the middle of March 2005. The good news is that, unlike the standard germanwings \nCrazy Night promotions, this one doesn't end at 07:00 or 08:00 in the morning - it \nonly ends when all 10,000 flights on offer have been sold. Additionally, InterSky is \noffering one-day return flights from Friedrichshafen in southern Germany to Vienna \nin Austria on Sunday, December 26th. I've never even seen RyanAir do something that \nextreme.\n(What's an RSS newsfeed? Though whether you'll find \nany bargains left on those flights is anyone's guess.\nHowever, we think there's probably enough of a good \ntime to be had in Venice, Lyons or Salzburg without even heading off for the \nmountains.\nbmi baby will fly to some or all of these \ndestinations from each of its bases at Nottingham East Midlands, Birmingham, \nManchester and Cardiff airports.\nTo take advantage of the offer you'll have to book \nyour flight before midnight on Wednesday, 3rd November. Additionally, InterSky is \noffering one-day return flights from Friedrichshafen in southern Germany to Vienna \nin Austria on Sunday, December 26th.\n"}