{"category": "ham", "to_address": "hadley wickham <h.wickham@gmail.com>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] possible bug in ggplot2 v0.5.2???", "body": "On Wed, 4 Jul 2007, hadley wickham wrote:\n\n> On 7/4/07, Prof Brian Ripley  wrote:\n>> On Tue, 3 Jul 2007, hadley wickham wrote:\n>> \n>> > Hi Stephane,\n>> >\n>> > The problem is that the windows graphics device doesn't support\n>> > transparent colours.  You can get around this in two ways:\n>> \n>> It certainly does!  Try col=\"transparent\" (and perhaps consult your\n>> dictionary).  It was news to me that the windows() graphics device worked\n>> on\n>> Linux i586.\n>\n> Well my dictionary defines transparent as \"allowing light to pass\n> through so that objects behind can be distinctly seen\" which I believe\n> applies here (ie. stained glass windows and blue points with alpha 0.5\n> are both transparent).  What does your dictionary say?\n\nNot quite the same, but even by your definition col=\"transparent\" is \ntransparent.  In this context\n\nhttp://en.wikipedia.org/wiki/Transparency_%28graphic%29\n\nseems more pertinent.\n\n>> What it does not support as yet is translucent colours, and that is a\n>> restriction imposed by Windows (translucency support was introduced for\n>> Windows XP, and we still try to support older versions of Windows, unlike\n>> the MacOS people).  I have been working on a workaround, so translucency\n>> support is likely to be implemented in R 2.6.0 for users of XP or later.\n>\n> I am confused by your implication that windows (prior to XP) does not\n> support translucency.  Perhaps it is not supported at the operating\n> system level, but it has certainly been available at the application\n> level for a very long time.\n\nReally? It's hard to reply to unspecific assertions.  But remember XP has \nbeen out since 2001, almost as long as PDF has supported translucency.\n\nOne possibility is that you are talking about game-type applications, \nwhich have had alpha-blending for a long time via DirectX.  However, that \nwas an add-on for a long time, is a function of the graphics card and is \nnormally done on the GPU.\n\nThe standard Windows way of plotting is GDI, which is a vector painting \nlanguage like postscript.  Like postscript, it also supports bitmaps but \nusing them loses a lot of the flexibility.  Alpha blending of bitmaps was \nadded for Windows 98, 2000 and later, but not for all devices: in \nparticular not for metafiles and optionally for printers (and none of the \nprinter drivers I have support it).  GDI+ (introduced with XP) adds \ntranslucency, but how widely it is supported is unclear to me.\n\nFor example, Cairo internally uses alpha-blending of bitmaps, but excludes \nWindows 98 as too buggy.  I've chosen to support Win2000 and later in \nwindows().\n\n>> Given that neither of the two main screen devices and neither of the\n>> standard print devices support translucency, the subject line looks\n>> correct to me: the problem surely lies in the assumptions made in ggplot2.\n>\n> The features of the windows and X11 devices clearly lag behind the\n> quartz and pdf devices.  I can program for the lowest common\n> denominator or I can use modern features that support the tasks I am\n> working on.  I choose the later, and it is certainly your prerogative\n> to declare that a bug in me.\n\nI think to make undocumented assumptions about the environment is unkind \nto your would-be users.  Ideally the graphics devices would detect and \nreport that, but that is not how support for semi-transparency was added. \nAs a by-product of adding limited translucency support on the windows() \nfamily of devices, they do now warn.\n\nYou also need to check that the extra features work correctly.  I found \nsome problems with all the devices I tried that support translucency (or \nat least with device+viewer combinations for pdf and svg).  Issues include \nwhether translucent fills are rendered at all, blending translucent \ncolours with transparent backgrounds, and the model used (is it the light \nintensity or the perceptual colours that are being blended?).\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}