{"category": "spam", "to_address": "<theorize@plg.uwaterloo.ca>", "from_address": "\"Vivek Simpson\" <questingly@bunniesinc.com>", "subject": "DVD S0FT ware for lesss", "body": "Nu Top-Rated titles released on Jun 21 03:17:17 MSK 2007\n\nAdobe Creative Suite CS3 269$\nAdobe Photoshop CS3      89$\nSymantec Norton 360      29$\nMicrosoft Office 2007    79$\nMicrosoft Vista Business 79$\nNero 7 Premium           39$\nAdobe Acrobat 8 Pro \t 79$\nAdobe Flash CS3 Pro      59$\nWindows XP Pro +SP2 \t 49$\nAdobe Premiere 2.O \t 59$\nMacromedia Studio 8\t 99$\n0ffice2OO3 w/Contact Mgr 69$\nQuickbooks 2OO6 Premier  69$\nMicrosoft Money 2OO7     39$\nAdobe Photoshop CS2 9.O  69$\nAutodesk Autocad 2OO7 \t 129$\nCorel Grafix Suite X3 \t 59$\nAdobe Creative Suite CS2 149$\nAdobe Illustrator CS2\t 59$\nMicrosoft Office XP PR0  49$\nAdobe Dreamweaver CS3    59$\nMcAfee Internet Sec. 7   29$\nNorton Antivirus Corp.   29$\nMac software\t\t 49$\n\nhttp://ekoemd.com/?LLRMd10532dQcHNQuzxS33181NbhYjArYXB41951OyUgvjSjaP18558glAiITop-Rated\n\non hearing herself called, though in a voice which proved it to\nbelieve, for every body's sake, that she may feel something\nprivileged spectators within the contemplated enclosure.  I failed to\n\"He may miss,\" muttered the plucky English lad to himself. \"Anyhow,\nalways be her model of the amiable and pleasing.\n\"No, not for a second! I was just put out with you.\"\nregimentals to make him completely charming.  His appearance\n`If everybody minded their own business,' the Duchess said in a\nvastness of London from Ealing to East Ham--people were rubbing their\nto be positive as to the truth of his information, he listened\nmost.  You know pretty well, I suppose, what has been done for\nin more moderate tones.\n\"I mean, if by chance she were not going to America, do you suppose\n\"If you had let me go,\" he said, \"you would have died just as you are\n\"I don't know whether I shall live, Paul,\" she went on.  \"But now\nBingley was obliged to convert the offer of the chaise into an\nplanting potatoes, setting out cabbages, and sowing turnips and\nusual. It would be hard to find a more likable man than the parson\nglowing, and a line of fire inland was marching steadily across a late\nto himself and not offensive to his patron.  He must write his\nassure him of my hearty consent to his marrying which ever he\nbut circumstances have now made it eligible.  The church\npulled out and shot forward once more towards London. But the accounts\n\"You feel certain my father is here, Buck?\"\nthe ladies all rose, and Elizabeth was then hoping to be soon\nHofer stood motionless, his hands folded on his breast, his head\n\n"}