{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Genesearch <enews@genesearch.com.au>", "subject": "Repair DNA for PCR; New NEB Catalog available", "body": "\nYou're receiving this email because of your relationship with Genesearch. Please confirm your continued interest in receiving email from us and/or refine your areas of interest.  You may unsubscribe if you no longer wish to receive our emails.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNew England Biolabs eNews\n\n\n\n\n\n\n\n\n\nRepair DNA for PCR Plus New NEB Catalog\nJune 2007\n\n\n\n\n\n\n\n\nIn This Issue\n\n\nPreCR Repair Mix\n\nPreCR Results\n\nPreCR Features\n\n\n\n\n\nIntroducing the NEB 2007-08 Catalog & Technical ReferenceAvailable in Australia in July!\n New England Biolabs has released its 2007-08 Catalog & Technical Reference. The new catalog contains many new reagents for PCR, cloning, expression and purification, as well as up-to-date technical charts and protocols to aid in your experimental design.Highlighted products include:11 new restriction enzymes17 restriction enzyme unit size increasesA new Competent Cell chapterA new Epigenetics chapterA growing line of DNA PolymerasesPreCR Repair Mix for damaged DNA templateDNA Ladders in convenient formatsA selection of expression systems (yeast, mammalian and E. coli)High efficiency transfection reagentsMany new reagents for RNA research \n\n\n\n\n\nQuick Links\nTechnical Info on PreCRGenesearch\nNew England Bioloabs\nAustralian Price List\n\n\n\n\n\n\n\n\n\n\nPreCR™ Repair MixRepair damaged DNA prior to PCR, microarrays or other technologies.The PreCR Repair Mix is an enzyme cocktail formulated to repair damaged template DNA prior to its use in the polymerase chain reaction (PCR), microarrays or other DNA technologies. This product comes with easy-to-use protocols and does not damage template DNA.DNA is susceptible to many types of damage resulting from exposure to a variety of chemical or environmental reagents, manipulation or simply aging, which prevent the further manipulation of DNA. The PreCR Repair Mix is a blend of recombinant proteins designed to repair damaged template DNA prior to its use in the polymerase chain reaction (PCR), microarrays or other DNA technologies. PreCR is active on a broad range of DNA damage, including those that block PCR (e.g. apurinic/apyrimidinic sites, thymine dimers, nicks and gaps) and those that are mutagenic (e.g. deaminated cytosine and 8-oxo-guanine). In addition, it will remove a variety of moieties from the 3´ end of DNA leaving a hydroxyl group. However the PreCR Repair Mix cannot repair fragmentation or protein-DNA crosslinks.\n\n\n\n\n\n\n\n\n \n\t\t\tPreCR ResultsThis gel illustrates repair of different types of DNA damage with the PreCR Repair Mix. The gel shows trial ampliﬁcations from damaged DNA that was either not treated (-) or treated (+) with the PreCR Repair Mix. Type of DNA damage is shown. Note: heat treated DNA is incubated at 99°C for 3 minutes. Marker M is the 2-log DNA Ladder (NEB #N3200). \n\n\n\n\nPreCR FeaturesEasy-to-use protocols. Amplification can be done directly on the repair reaction, or, if the polymerase being used is not active in ThermoPol Buffer, a sequential reaction protocol is provided. Does not harm template DNACan be used in conjunction with any thermophilic DNA Polymerase.A typical reaction involves a 15-20 minute incubation at 37°C with the supplied components. In some cases, to achieve maximum amplicon yield optimization of the PreCR reaction may be required. This involves varying the amount of template and incubation temperature. Template concentration does not appear to be a limiting factor in this reaction. Each PreCR reaction can repair anywhere from 0.01 ng to 1 µg of damaged DNA. \n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nAbout GenesearchGenesearch is an Australian company founded in 1980. In addition to our own research and development we are the Australian distributor for New England Biolabs products for molecular biology; Cell Signaling Technology signal transduction antibodies; Finnzymes enzymes and equipment for PCR; Gene Codes' Sequencher, the premier software for DNA sequence assembly and analysis; and CLC bio, providers of complete software and hardware bioinformatics solutions\n\n\n\n\n\nFurther InformationFor further information, pricing and orders contact Genesearch on 1800 074 278 or email us at info@genesearch.com.auBest RegardsGenesearch\n\n\n\n\n\n\n\n\n\n\n\nForward email\n\n\n\n\nThis email was sent to ktwarwic@speedy.uwaterloo.ca, by enews@genesearch.com.au\nUpdate Profile/Email Address | Instant removal with SafeUnsubscribe™ | Privacy Policy.\n\n\nEmail Marketing by\n\n\n\nGenesearch | 14 Technology Dr | Arundel | 4214 | Australia\n\n\n\n\n"}