{"category": "spam", "to_address": "\"Kirk Johnnie\" <gnitpick@speedy.uwaterloo.ca>", "from_address": "\"April Bryant.\" <Apriloweua@inroadstech.com>", "subject": "You have a new message from Peter.", "body": "ARE YOU BORED IN BED WITH YOUR PARTNER?\n\nStatistics show that 76% of women are unsatisfied with their partner's\nbedroom performance. Are you one of these women? Are you one of their\npartners?\nWell, no matter who you are, there is a solution, the Vibrator Ring!\n\nThis safe, fun, easy-to-use product is the latest pleasure-giving toy that\neveryone's talking about. It expands to fit all sizes, it's comfortable, and\nit massages all the right places. If you want to have time in between the\nsheets, then you want the Vibrator Ring.\n\nThe Vibrator Ring features a raised tickler for her external stimulation,\nand the deep vibrations mean that he can stay harder for longer. And if it's\nmultiple pleasures she wants, thanks to the Vibrator Ring, it's what she\nwill get! Don't put it off any longer! let the Vibrator Ring help you today.\n\nWho will love it more? Find out for Yourself!\nhttp://www.mytoysdirect.com\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nproblems of social integration. bonds of education, politics, culture must\nwe to tie the order together into functioning Can this be accomplished-\n\"This writes Bertram M. Gross of Wayne State \"must be based certain commonly\naccepted or some degree of perceived interdependence, not mutually\nacceptable objectives.\" A society fragmenting at the level of values life\nstyles challenges all the old integrative and cries out for totally new for\nreconstitution. We \nby no means yet found basis. Yet if we face disturbing problems social\nintegration, we shall confront more agonizing problems of integration. For\nthe multiplication of life styles our ability to hold the self together.\nWhich of many selves shall we to be- What sequence of serial selves describe\nus- How, in must we deal with overchoice at the most intensely personal and\nemotion-laden of all- In headlong rush for variety, choice \nfreedom, we have not yet begun examine the awesome implications of\ndiversity. When diversity, converges with transience and novelty, we the\nsociety toward historical crisis of adaptation. We an environment so\nephemeral, unfamiliar complex as to threaten with adaptive breakdown. This\nis future shock. Part Five: THE LIMITS ADAPTABILITY Chapter 15 FUTURE SHOCK:\nTHE PHYSICAL ago the shrinking seas millions of unwilling aquatic onto the\nnewly beaches. Deprived of their familiar environment, died, gasping and\nclawing for additional instant of \nOnly fortunate few, suited to amphibian existence, survived the shock\nchange. Today, says sociologist Lawrence Suhm the University of Wisconsin,\n\"We going through as traumatic as the evolution of man's from sea creatures\nland creatures ... who can adapt those who can't will either go surviving\nsomehow at lower of development or will perish washed up on \nshores.\" To assert that man must adapt seems He has already shown himself\nto be the most adaptable of forms. He has survived Equatorial summers and\nwinters. He has survived Dachau Vorkuta. He has walked the surface. Such\naccomplishments give to the glib that his adaptive capabilities \"infinite.\"\nYet nothing could be further from truth. For despite all his heroism\nstamina, man remains biological \"biosystem,\" and all systems operate within\ninexorable limits. Temperature, \ncaloric intake, oxygen and dioxide levels, all set absolute boundaries\nwhich man, as constituted, cannot venture. Thus when we man into outer\nspace, surround him with an exquisitely microenvironment that maintains all\nthese factors within limits. How strange, that when we hurl man into the\nfuture, we take pains to protect him from the shock \nchange. It is though NASA had shot Armstrong and Aldrin into the cosmos. It\nis the thesis this book that there are discoverable to the amount change\nthat the human can absorb, and that by endlessly change without first\ndetermining these we may submit masses of men demands they simply cannot\ntolerate. We the high risk of throwing them into peculiar state that have\ncalled shock. We may define future\n\nsee you tommorow\n\n\n\nApril\n\n\n"}