{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "flagitious: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\nFind out how to release your inner genius and ace your exams\nin Teresa Bolen's epochal book, MASTER PLAN TO MASTER EXAMS:\nHOW TO DISCOVER YOUR HIDDEN ABILITIES TO CREATE THE SUCCESS YOU DESIRE.\nYou'll get a package of wonderfully empowering F-R-E-E Bonus Gifts from\nsome of the world's leading success and learning experts -- take action NOW.\nRelease Your Inner Genius Abilities Today\nADVERTISEMENT\nWord of the Day for Thursday, May 17, 2007\nflagitious \\fluh-JISH-uhs\\, adjective:\n1. Disgracefully or shamefully criminal; grossly wicked; scandalous; -- said of acts, crimes, etc.\n2. Guilty of enormous crimes; corrupt; profligate; -- said of persons.\n3. Characterized by enormous crimes or scandalous vices; as, \"flagitious times.\"\nHowever flagitious may be the crime of conspiring to subvert by force the government of our country, such conspiracy is not treason. -- Ex parte Bollman & Swartwout, 4 Cranch 126 (1807)\nThe Grinch, a nefarious, flagitious, sly, nasty, troublesome, bad-tempered, intolerant and foul-smelling character who, for reasons never fully explained, lives in a cave above the town. -- Robin Greer, \"Carrey Christmas\", News Letter, December 1, 2000\nThese men were reported to be heretics . . . , seducers of youth, and men of flagitious life. -- Isaac Taylor, History of the World\nDuring the Whiskey Rebellion 200 years ago, a preacher declared: \"The present day is unfolding a design the most extensive, flagitious and diabolical, that human art and malice have ever invented . . . If accomplished, the earth can be nothing better than a sink of impurities.\" -- George Will, \"Paranoiac Terrorism Is Part of American History\", Newsday, April 25, 1995\nBreak heart, drop blood, and mingle it with tears, Tears falling from repentant heaviness Of thy most vile and loathsome filthiness, The stench whereof corrupts the inward soul With such flagitious crimes of heinous sins As no commiseration may expel, But mercy, Faustus, of thy Saviour sweet, Whose blood alone must wash away thy guilt. -- Christopher Marlowe, The Tragical History Of Doctor Faustus\nFlagitious comes from Latin flagitiosus, from flagitium, \"a shameful or disgraceful act,\" originally, \"a burning desire, heat of passion,\" from flagitare, \"to demand earnestly or hotly,\" connected with flagrare, \"to blaze, to burn.\"\nDictionary.com Entry and Pronunciation for flagitious\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9622435-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}