{"category": "spam", "to_address": "Theorize <theorize@plg.uwaterloo.ca>", "from_address": "Violet Watts <diane@giac.ca>", "subject": "Tasty Viagra", "body": "\n\nCan't have sex like you had 10 years ago? Looking for an effective and cheap solution?\nVisit us\nU can restore your health right now. Doesn't matter what the problem is - we pills to cure everything. Erection Dysfunction, Weight loss, Anti-Depressant, Antibiotics and even more! Fantastic low prices! \nGo to the site\nYou can find all medications at our online drugs store.\nWith best regards,\nViolet Watts\n \n \nKto zh so zdorovogo uma porozhniakom tuda-siuda goniat budet? Sploshnoj ubytok i imushchestvu i prestizhu. Takih vo vsej Federacii bylo raz, dva i obchelsia, i obychno oni ne afishirovali svoih Sposobnostej ili prosto ne bralis za podobnye avantiury. Slugi isparilis, ostaviv ukazannoe. Ne veriu svoim glazam! izumlenno voskliknul Leks, osadiv drakha i Ustavivshis na stroenie Valigasa, kogda ono vnezapno vyroslo iz-za skalnogo Vystupa dlinnoj kamennoj griady, uzhe bolshe chasa tianuvshejsia k Ushcherbnym goram s Togo momenta, kak my pokinuli Razvilku, i nakonec vyvedshej nas k celi. \nchem ia zanimaius. Prokliatyj! Drahub ne mog zabyt, kak chudovishchnyj i nevidimyj Udar vyrval ego iz sedla, smiav sverhprochnyj viritovyj pancir, slovno detskaia Ruka tonko vydelannuiu kozhu, i shvyrnul na Altar Zveria. chto s nim? Sbrosiv moiu ruku, ona rvanulas v kolodec, i ia ne stal ee uderzhivat. Privyk. Parenek toroplivo proshel mimo Gronta i zaglianul v komnatu, iz kotoroj tak Stremitelno vyshel Niksard Aga, Bochonok vse-taki zdes! Traktirshchik nepodvizhno stoial vozle pustoj posteli, tesak valialsia na polu Vozle ego nog. Tolstiak nemedlenno nazhal na tormoz, i mashina zamerla tochno posredi Ploshchadi, budto Nkot, ne otkryvaia glaz, tem ne menee videl vse, chto vokrug Nego proishodilo. Poniatiia ne imeiu. Vragu ne pozhelal by ostatsia v takom totalnom odinochestve, v kakom ostalsia Nkot. \nRazum, pitaiushchijsia myslitelnoj deiatelnostiu razumnyh sushchestv, vytiagivaiushchij Iz nih vse zhiznennye sily bez ostatka. I poka ia Smotrel vsled Nori, menia ne ostavlialo smutnoe oshchushchenie bezvozvratno Upuskaemogo schastia, a vnutri kopilas neponiatnaia pustota. Chto takoe chelovechestvo? Inertnaia Bezlikaia massa. Zashchitu? Vo mne vdrug prosnulsia gnev. ejisuminyon UkFHXFBeQEp0RV1VHUFCUEZWRlleXR1XVA==\n \n\n\n"}