{"category": "spam", "to_address": "\"Rudy Horace\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"Vickie P Strickland\" <Vickiehpuxv@rightsidemarketing.com>", "subject": "New Voice Message received from Gus.", "body": "ARE YOU BORED IN BED WITH YOUR PARTNER?\n\nStatistics show that 76% of women are unsatisfied with their partner's\nbedroom performance. Are you one of these women? Are you one of their\npartners?\nWell, no matter who you are, there is a solution, the Vibration Ring!\n\nThis safe, fun, easy-to-use product is the latest pleasure-giving toy that\neveryone's talking about. It expands to fit all sizes, it's comfortable, and\nit massages all the right places. If you want to have time in between the\nsheets, then you want the Vibration Ring.\n\nThe Vibration Ring features a raised tickler for her external stimulation,\nand the deep vibrations mean that he can stay harder for longer. And if it's\nmultiple pleasures she wants, thanks to the Vibration Ring, it's what she\nwill get! Don't put it off any longer! let the Vibration Ring help you\ntoday.\n\nEverything about this screams Fun. Literally!\nhttp://www.wannalove.net\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nabout production in all the today, and especially the States, is that goods\nare increasingly designed yield psychological \"extras\" for the consumer.\nmanufacturer adds \"psychic load\" his basic product, and the gladly pays for\nthis benefit. A classic example is the case of appliance or auto\nmanufacturer adds buttons, knobs or dials to the panel or dashboard, even\nwhen these have no significance. The manufacturer has learned that the\nnumber of gadgets, up to point, gives the operator \nthe machine the sense of controlling complex device, and feeling of\nincreased mastery. This psychological is designed into product. Conversely,\npains are taken not deprive the consumer an existing psychological Thus\nlarge American food proudly launched labor-saving, add-wateronly mix. The\ncompany amazed when women rejected product in favor of mixes that extra\nlabor the addition of an along with the water. By inserting egg in the\nfactory, the company \noversimplified the task the housewife, depriving her the sense of\ncreatively participating in cake-baking process. The powdered was hastily\neliminated, and women went back to cracking their own eggs. again product\nmodified to provide psychic benefit. Examples like these can be endlessly in\nalmost any major industry, soap and cigarettes to dishwashers diet colas.\nAccording to Emanuel Demby, president of Motivational Programmers, research\nfirm employed in the States and Europe by such corporations as General\nElectric, Caltex and IBM, \nengineering of psychological factors manufactured goods will be hallmark\nproduction in the future only in consumer goods, in industrial hardware.\n\"Even the cranes and derricks built today this principle. Their cabs are\nstreamlined, like something out of twenty-first century. Caterpillar,\nInternational Harvester, all of Why- These mechanical don't dig better hoist\nbetter because the cab \naesthetically improved. But the contractor who buys likes it better. The\nmen who on them like it better. The customers like it So even the\nmanufacturers of equipment begin to pay to non-utilitarian i.e., factors.\"\nBeyond this, Demby asserts, manufacturers are more attention to reducing\ntensions that the use of certain Manufacturers of sanitary napkins, for\nexample, know women have fear of stopping up toilet when disposing of them.\nnew product has been developed,\" he says, \ninstantly dissolves on contact with water. doesn't perform its basic any\nbetter. But it relieves some the anxiety that went with it. This\npsychological engineering if ever there was consumers are willing and able\npay for such As disposable income rises, they progressively less concerned\nprice, progressively more insistent on they call \"quality.\" For many\nproducts \ncan still be measured the traditional terms of workmanship, durability\nmaterials. But for fast-growing class products, such differences virtually\nundetectable. Blindfolded, the consumer cannot distinguish from Brand\nNevertheless, she often fiercely that one is to another. This paradox\nvanishes once the component of production is taken into account. even when\nthey otherwise identical, there are likely to be psychological differences\nbetween one product and another.\n\nciao..\n\n\n\nVickie\n\n\n"}