{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tFRIDAY 11 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM KIRSTY WARK\n\t\t\t\t\t\n\t\t\t\t\tDear viewers,  \n\n\n\nZOMBIE BROWN PM?\n\n\nHow quickly the caravan moves on. Tony Blair may still be at Number 10 but he is yesterday's PM. Today Zombie Brown travelled around a series of English marginal constituencies launching his leadership campaign. His cry is \"new ideas for a new time\", and Michael Crick has been watching him all day on his slightly shambolic tour, divining what will both be the substance of his almost inevitable leadership, and how the style will differ from Tony Blair. \n\n\nZombie Brown has told Newsnight he wants a government of all the talents. Might there be a signal that he is planning a revolutionary move? And how would Zombie Brown signal a change of direction while sticking to the New Labour path?  We look at his biggest challenges at home and abroad. The Chancellor says he wants to lead a government \"humble enough to know its place\" But is the Chancellor himself humble enough? Newsnight's specially commissioned poll suggests not.   \n\n\nHe is seen as more arrogant and less in touch with voters than Tony Blair and David Cameron, scoring 30% to the prime minister's 34% and David Cameron's 40% of the vote. When the 1,001 people polled were asked whether he was trustworthy, less than a third replied yes for Zombie Brown, who is on 31%, compared with 38% for the Tory leader and 41% for the Liberal Democrat leader.  \n\n\nWe hope to be joined by a leading member of the Brown campaign team. And we'll bring together our Newsnight political panel, Danny Finkelstein, Olly Grender and Peter Hyman to read the runes.  \n\n\nDo join us. \n\n\nKirsty\n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nTONY BLAIR SPECIAL\n\n\t\t\t\t\t\t\tAn extended analysis of Tony Blair's ten years as PM\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\nnewsnight review\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tPRESENTED BY HARDEEP SINGH KOHLI\n\t\t\t\t\t\n\nJoin me at 11 when my guests this week on Review will be Germaine Greer, Paul Morley, Lionel Shriver and Kwame Kwei-Armah\n\n\nJINDABYNE\n\n\nOne of my favourite Australian films is the brooding and brilliant Lantana. Director Ray Lawrence managed to create a film with excellent performances that was beautifully paced and engaged the viewer more deeply with every scene. His latest work, \"Jindabyne\" is similarly brooding, with equally good central performances. \n\n\nBased on a Raymond Carver short story and transposed in the  Australian town of Jindabyne, the narrative unfolds around a disastrous fishing trip which uncovers the freshly murdered body of a young aboriginal girl. Issues of life and death, race and gender, innocence and guilt all conspire to dissolve the already fragile relationship of Gabriel Byrne's Stewart and Laura Linney's Claire.  \n\n\nFALLING MAN\n\n\nOn the other side of the planet we find ourselves in Manhattan. While the world of global politics may still be coming to terms with the attack on the twin towers six years ago, it seems the world of the arts is trying somehow to begin to make some sense of it. Paul Greengrass's United 93, Oliver Stone's World Trade Center and Jay McInerney's The Good Life; many creatives have offered their version of events, with varying degrees of critical acclaim. \n\n\nHaving eschewed the opportunity to comment on 9/11, save for a short essay, Don DeLillo, the 70 year old heavyweight of the American Litterati now offers his enigmatic tale of life after the Towers. Falling Man focuses on estranged husband Keith and his wife Lianne. It's a troubled and troubling book, starting in the very dust, blood and rubble of the attack and spinning out into the once ordinary lives of once ordinary people. \n\n\nVERNON GOD LITTLE\n\n\nWhat do you do if your debut novel wins the Man Booker Prize, the chair of the judges likening it to one William Shakespeare? Naturally, you have it adapted for the stage. And so we welcome DBC Pierre's prophetic Vernon God Little to London's Young Vic. (DBC is an acronym for Dirty But Clean, a reference to the years of debauchery and subsequent therapy and rehab the writer endured.) \n\n\nHis novel has been adapted by Tanya Ronder and directed by the award winning Rufus Norris of Festen fame. The play is fairly honest with regard to the narrative of the book, starting with the aftermath of a school yard serial killing, a killing exacted by Jesus, Vernon's best friend. Written before the Columbine massacre and made more poignant still by recent events at Virginia Tech, questions raised by the writing couldn't be more of the zeitgeist. Colin Morgan, still a drama student in my home town of Glasgow, stars as the eponymous anti-hero and the play starts with him being hauled in for questioning after his best friend's fatal and ultimately suicidal gun spree... \n\n\nGAVIN AND STACEY\n\n\nWhen actors James Corden and Ruth Jones were waiting to be weighed in a scene for Kay Mellor's \"Fat Friends\" the pair cooked up an idea to write and star in their own comedy series. The result is \"Gavin and Stacey\", BBC3's newest sitcom, showing the channel's insatiable appetite for the 20 to 30 year old market. \n\n\nIt has an all-star cameo cast, including Rob Brydon, Alison Steadman and Larry Lamb. Stellar! Having never met, Gavin, Matt Horne, and Stacey, Joanna Page have nurtured a six month phone romance. The only thing that separates them is the M25, the M4 and a couple of minor A roads. But as we all know, love will conquer all. The question is whether this is comedy drama or dramatic comedy. One thing I am sure of...it's very sweet! \n\n\nJoin us at 11. \n\n\nHardeep \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}