{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nWe’ll be broadcasting another hour-long\n  special edition of the CBS Evening News tonight from the campus of Virginia\n  Tech, where President Bush and the first lady today joined students, faculty\n  and the extended university community in mourning the dozens who died in\n  yesterday’s horrifying massacre. \n \nBob Orr will tell you more about Cho Seung-Hui, the\n  23-year-old English major responsible for killing 32 people before turning a\n  gun on himself. Officials haven’t yet put together a full picture of\n  Cho, saying only that “he was a loner.” But there are some clues\n  that might shed light on his motivation, and we’ll share those with\n  you.\n \nThe identities of the victims are still being\n  released, but it is already clear that Cho’s bullets cut across a diverse\n  swatch of the campus population. The dead range from bright college freshmen\n  to a 76-year-old internationally renowned engineering professor. Cynthia Bowers\n  will bring you portraits of those murdered.\n \nAlso, Sharyn Alfonsi will report on what happened in\n  the critical two hours when Cho eluded police.\n \nThalia Assuras will chronicle the grieving process\n  on campus.\n \nAnd our technology correspondent, Daniel Sieberg,\n  will take a look at social networking online in the wake of the tragedy.\n \nI hope you’ll join us tonight, and be sure to\n  tune in at 10 p.m. EST to a special edition of 48 Hours this evening called\n  “Anatomy of a Rampage.” \n \nThanks,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}