{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "drew Roberts <zotz@100jamz.com>", "subject": "Re: [cc-community] Does BY-SA extend to a newspaper?", "body": "On Monday 23 April 2007 09:23 am, rob@robmyers.org wrote:\n> Quoting drew Roberts :\n> > For all of this contains, mere aggregation, use and the like, what is\n> > wrong with the concept I put forth which is \"if a copyright arises\" -\n> > that is, copyright law may already have the answer. If the work under the\n> > CC SA license is used in a work where a new copyright comes into being,\n> > that is what we should concern ourselves with. If no new copyright comes\n> > into existence, it is not a problem.\n> >\n> > Is this not a reasonable way to look at it? Strenghts? Weaknesses?\n>\n> I think that is how it currently works. A derivative work is a work\n> that would attract its own copyright. So having derivation as the\n> copyleft trigger fits copyright law perfectly.\n\nAh, nope, I don't think that fully covers the situation. While a derivative \nwork is a work that would attract its own copyright, it is not the only works \nthat might incorporate or contain a BY-SA work and not be a derivative.\n\nHave you missed the talk on collections? (Collective works or whatever the \ncorrect terminology is.)\n\nA collective work canget a copyright on the collection. Right? Wrong?\n\nIs a newspaper on the whole copyrighted? Or only the individual articles? Is a \nmagazine copyrighted?\n\nThe problem is that we only seek to control derivatives and we could also \ncontrol copying and distribution where needed.\n\nOr am I totally off base.\n>\n> There seem to be two major cases where this does not fit people's\n> expectations: the use of a piece of music in a film soundtrack and the\n> use of a photograph as a magazine illustration. The former has been\n> worked into the CC licenses as a special case where copyleft is\n> triggered by something other than derivation, the latter has not.\n>\n> So I don't think that we can say that the licenses should only concern\n> themselves with how copyright law works; there are already examples of\n> where they do not do this (NC is another).\n\nI agree with that, but if we can do it using copyright law itself, might not \nthat be better? Looking at this last paragraph, I think you might not fully \nget what  Iam trying to say.\n>\n> - Rob.\n\nall the best,\n\ndrew\n\n-- \n(da idea man)\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}