{"category": "ham", "to_address": "hadley wickham <h.wickham@gmail.com>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] possible bug in ggplot2 v0.5.2???", "body": "On Tue, 3 Jul 2007, hadley wickham wrote:\n\n> Hi Stephane,\n>\n> The problem is that the windows graphics device doesn't support\n> transparent colours.  You can get around this in two ways:\n\nIt certainly does!  Try col=\"transparent\" (and perhaps consult your \ndictionary).  It was news to me that the windows() graphics device worked \non \nLinux i586.\n\nWhat it does not support as yet is translucent colours, and that is a \nrestriction imposed by Windows (translucency support was introduced for \nWindows XP, and we still try to support older versions of Windows, unlike \nthe MacOS people).  I have been working on a workaround, so translucency \nsupport is likely to be implemented in R 2.6.0 for users of XP or later.\n\nGiven that neither of the two main screen devices and neither of the \nstandard print devices support translucency, the subject line looks \ncorrect to me: the problem surely lies in the assumptions made in ggplot2.\n\n> * export to a device that does support transparency (eg. pdf)\n> * use a solid fill colour : + stat_smooth(method=\"lm\", fill=\"grey50\")\n>\n> Hadley\n>\n> On 7/3/07, Stephane Cruveiller  wrote:\n>> Dear R-Users,\n>>\n>> I recently gave a try to the nice package ggplot2. Everything  went\n>> well until I tried to add a smoother (using lm method for instance).\n>> On the graphic device the regression line is displayed but not confidence\n>> intervals as it should be (at least on ggplot website). I tried to do\n>> the job on\n>> both MS winXP and Linux i586: same result. Did anyone encountered this\n>> problem? Did I miss something?\n>>\n>>\n>> My R version is 2.4.1.\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}