{"category": "spam", "to_address": "jonessmith000@yahoo.com", "from_address": "jones smith <jonessmith000@yahoo.com>", "subject": "Dearest In Christ, ", "body": "Dearest In Christ,    It is with Heavy Heart i am reaching you regarding the death of my late client. I am Barrister Jones Smith, the legal adviser to late MR. MIKE & CAROL HALL,  a very Wealthy Couple that lived here in the United Kingdom, before their Death on the 26th of December 2004 during the Tsunami disaster.These couple served God as very dedicated Christians,they so dedicated their life to God but they had no child till they died. They acquired a lot of landed properties like lands, Stocks/Bond,house properties, etc. As their legal adviser, before their death, the husband Mr. Mike & Carol Hall instructed me to write his WILL because they had no child, they dedicated their wealth to God.    According to the\n WILL, their assets should be given out to a ministry for the work of God. As their legal adviser, all the documents for the assets that are deposited with the security company are in my care. He gave me the authority to give out the funds to theMinistries for the work of God. As instructed by MR. MIKE HALL before his death. As a matter of fact the total amount of money that is contained in the two trunk Boxes is $10,000,000.00 ,They did not want the management of the Security Company to know the content of the consignments, therefore they registered the content of the  consignments as Gold Bars. Now, the security companybelieves that what They deposited with them were Gold Bars.    As a born again Christian,I have been reading my bible and I have to do what is lawful and right in the sight of God by giving out the fund to the chosen ministry for the purpose of God's work as instructed by the  owner before his\n death.After my fasting and prayers Today, I asked God to make his choice and direct me to an honest Christian or the chosen ministry that deserves this fund by his Grace.  I then came across your address on the Internet as Iwas browsing through a Christian site.I appeal to you for the fund to be used wisely for things that will glorify the name of God. I have just notified the Security Company where they deposited the consignments that contained the fund, that I am moving the consignment abroad, and the security company is awaiting my authority to move the consignment out ofthe shores of my country.    Dear child of zion, if you know that you will use this fund honestly and wisely for things that will glorify God's name, then do contact me with the above mentioned information via my home email(jones_smith110@yahoo.com.hk)Your prompt response will be highly appreciated.    Yours in Christ.   BARRISTER Jones Smith\nNever miss an email again!Yahoo! Toolbar alerts you the instant new Mail arrives. Check it out."}