{"category": "ham", "to_address": "\"Sarah Goslee\" <sarah.goslee@gmail.com>", "from_address": "\"Y G\" <gatemaze@gmail.com>", "subject": "Re: [R] help interpreting the output of functions - any sources of\n\tinformation", "body": "On 24/04/07, Sarah Goslee  wrote:\n>\n> Hi,\n>\n> If you look at the documentation for the function you are interested\n> in, in this case ?cor.test, it will generally give you an explanation\n> of the return values (often brief, and not too helpful if you aren't\n> already familiar with the test), but also one or more references\n> that you can turn to for further information.\n>\n> Most likely, though, you'll want to absorb a general\n> introductory stats book before you delve into the\n> gory details of many of those references.\n>\n> Sarah\n\n\nThanks for the hint, that will do...\n\nOn 4/24/07, Y G  wrote:\n> > Hi,\n> >\n> > I am looking for documentation, reference guides, etc. that explain the\n> > output of functions... For example using cor.test(....,\n> method=\"pearson\")\n> > with Pearson's corr coeff the output is:\n> >\n> >\n> >     Pearson's product-moment correlation\n> >\n> > data:  a and b\n> > t = 0.2878, df = 14, p-value = 0.7777\n> > alternative hypothesis: true correlation is not equal to 0\n> > 95 percent confidence interval:\n> >  -0.4355690  0.5514366\n> > sample estimates:\n> >        cor\n> > 0.07669612\n> >\n> >\n> > What are all these? Apologies but I am new in R and statistics in\n> > general.... but a textbook I was looking at, regarding SPSS, explains\n> only\n> > the r coeff and the conf interval.... Any help with sources I can refer\n> to?\n> > Particularly in a broader context as it would not be nice to post all\n> the\n> > time such questions...\n> >\n> > Thanks in advance,\n> > GM\n> >\n>\n> --\n> Sarah Goslee\n> http://www.functionaldiversity.org\n>\n\n\t[[alternative HTML version deleted]]\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}