{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nThe Middle East is plunging deeper into chaos as\n  clashes continue between rival Palestinian groups in Gaza. Today, as Israel\n  launched explosive air strikes, the harshest Palestinian infighting took\n  place outside Gaza\nCity’s pro-Hamas\n  Islamic University. Allen Pizzey will report and David Martin will have more\n  about the United States’\n  role in this new explosion of violence – it is backing and training\n  fighters from Hamas’ rival group, Fatah.\n \nA battle of a different kind is going on in the United States.\n  A group of gun owners has a message for New York City\n  mayor Mike Bloomberg: don’t pick on Virginia. They’re hosting what\n  they’ve dubbed a “Bloomberg Gun Giveaway,” a publicity\n  stunt that’s already garnered national attention. Sharyn Alfonsi will\n  report.\n \nThere’s an important update on the\n  investigative story our chief investigative reporter Armen Keteyian broke\n  earlier this week. He reported that FEMA trailers that house displaced\n  hurricane Katrina survivors are unleashing toxic fumes on their residents.\n  Now, action is being taken. For more updates, check out our investigative\n  blog, Primary\n  Source, at CBSNews.com.\n \nYou may have heard about the pair of humpback whales\n  that are stranded in the Port\n   of Sacramento, more\n  than 90 miles from the ocean. Marine scientists’ most recent attempt to\n  lure them out to sea hasn’t been successful. Sandra Hughes will tell\n  you about their Plan B.\n \nFinally, the story our viewers chose this week for\n  Assignment America – and to call it a success story of the American\n  Dream would be an understatement. We will introduce to you a brain surgeon know\n  by his patients as Dr. Q. But once upon a time he was crossing the southern\n  border of the United\n    States and laboring here as an illegal\n  immigrant. Steve Hartman will share the story.\n \nAlso during the broadcast tonight, we’ll give\n  you a special preview of our retrospective tonight of Walter Cronkite’s\n  life and career as he turns – can you believe it – 90 years old.\n  It was a pleasure working on this program about such talented and\n  inspirational journalist. I hope you’ll join us.\n \nHave a great weekend,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}