{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Arnoud Engelfriet <arnoud@engelfriet.net>", "subject": "Re: Logo trademark license vs. copyright license", "body": "Francesco Poli wrote:\n> On Fri, 13 Apr 2007 22:28:15 +0200 Arnoud Engelfriet wrote:\n> > If the Mark qualifies as an original work of authorship under\n> > copyright law, then the above license includes the right to use, copy,\n> > modify, merge, publish, distribute and sell the Mark or any derivative\n> > work thereof, again subject to the above exception.\n> \n> Sounds good, except for one aspect that concerns me: we are trying to\n> write a good *trademark* license; I would not complicate things further\n> by trying to write a trademark *and copyright* license.\n> I would rather avoid mixing those two areas of law.\n\nI'm not sure that is possible. When we're talking about the logo,\nit is protected both by copyright and by trademark. I can't copy\nand distribute the logo unless I am licensed under both.\n\nYou could of course separately license the two. But then you run\nin exactly the problem I tried to solve with the conditional \ncopyright grant.\n\n> What concerns me most is making the copyright grant of permission\n> conditional on the no-confusion condition.\n\nI did that to ensure that people couldn't take the logo, change a\nfew pixels and then use the derivative logo in a confusing way.\nIf the copyright license doesn't tie in to the trademark license,\nbut instead says \"do whatever you want with your derivative\", people\ncould argue the copyright license trumps the trademark restriction.\n\n> Suppose I derive a new image from the Debian swirl logo, and assume that\n> my derivative work is sufficiently different that it's not confusingly\n> similar to the original logo.  It is my understanding that I would not\n> need any trademark license to use my heavily modified image (not even\n> for commercial use).  Is this correct?  I would instead need a copyright\n> license to create and distribute my derivative work.\n\nIf the derivative image isn't confusingly similar to the trademark logo,\nthen the no-confusion condition does not apply. I don't think this is\nan issue.\n\nThe only string attached to the derivative image is that it can't be\nused in commerce in a way that creates confusion with the original\nDebian logo. That is importing a trademark rule into a copyright\nlicense, true. But this is also _the default_ under trademark law.\n\nYou are not allowed to use any sign in commerce that creates confusion(*)\nwith someone's trademark logo. It doesn't matter if your sign is a\nderivative work of the logo under copyright law. I could be completely\nignorant of your mark, fiddle a bit with the Gimp and produce a swirl that\naccidentally looks like the Debian logo. Copyright says I'm fine, but I\nstill can't put that swirl on CD-ROMs with an operating system and sell\nthose.\n\nSo I can't imagine a situation where the trademark restriction\naffecting the copyright license would be a problem. \n\n> In summary, I think that enforcing trademark-like restrictions through\n> copyright would be possibly harmful...\n\nThis isn't a _trademark-like_ restriction, it is an actual\ntrademark restriction. There's a difference. In some copyright\nlicenses people try to create a pseudo-trademark by saying\n\"you can't use our name for anything except to refer to our\nproduct\". That goes beyond what trademark law allows you to do.\n\nIn essence, the trademark license I suggested (but TWNLA) says\n\"you are forbidden from doing what trademark law forbids you\".\nSo this stays exactly within the bounds of trademark law.\n\nAn alternative would be to drop the exception on the copyright\nlicense, and modify the trademark license to say\n\n\"The Mark Holder hereby licenses you to use the Marks *or\na modified version thereof* in any way...\nYou are not authorized to use the Marks *or a modified version\nthereof* ...\"\n\nThat makes it clear you are not licensed under the trademark\nto use derivatives in a confusing way. It's not as clear\nas what I previously suggested, because now you have to figure\nout which wins: the copyright license that says you can do\nanything, or the trademark license that says you cannot do\nthis one thing?\n\nArnoud\n\n-- \nArnoud Engelfriet, Dutch & European patent attorney - Speaking only for myself\nPatents, copyright and IPR explained for techies: http://www.iusmentis.com/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}