{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: License question: GPL+Exception", "body": "Wesley J. Landaker  wrote:\n> On Saturday 12 May 2007 16:01:25 Francesco Poli wrote:\n> > You may not impose any further restrictions with respect to the *rights\n> > granted by the GPL*.  But there are already such restrictions, and you\n> > cannot remove them because you are not the copyright holder.\n> > Hence you cannot comply with the license and the work is\n> > undistributable.\n> \n> A licensee can't, but the copyright holder can. Their license is NOT the\n> GPL, but GPL + exceptions & restrictions. That is perfectly valid, just not\n> GPL compatible. The exception they have adds extra freedom, and I believe\n> the one restriction they add is DFSG-free. [...]\n\nFirst, I think b is not an exception but a restriction.\n\nAdding any restrictions to plain GPL results in an invalid licence as in\nhttp://lists.debian.org/debian-legal/2006/05/msg00303.html\n\nThat isn't much different to using the plain GPL with an OpenSSL-like\nlicence - both licences are DFSG-free, but we can't satisy both of them\nsimultaneously without additional permission on the GPL side.  Of course\na copyright holder of the entire work could still copy and distribute\nand so on because they don't need a licence but we can't because we\ncan't satisfy both of those restrictions simultaneously.\n\nThe copyright holder could make a new licence out of the GPL, as\npermitted by the FSF, but they have not done so.  I think they should\nuse the plain GPL, because I dislike licence proliferation.\n\nI'm surprised that Red Hat have produced an inconsistent licence and I'm\nsurprised that GPL+restrictions isn't widely-known as non-free.\n\nHope that explains,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}