{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "\"heeseob nam\" <hurips@gmail.com>", "subject": "[Ip-health] Summary of Korea-US FTA based on SKG press release", "body": "This summary is based on the press release of South Korean Government\n(SKG) on the conclusion of FTA negotiations with US. The released\nmaterials by SKG are all in Korean, and thus my translations of some\nterminologies and expressions may be different from the actual English\ntext.\n\n1. Drug Pricing and Reimbursement System under National Health Insurance\n\nDemands of US include assurance of the minimum price (such as A-7\naverage price) of new drugs; introduction of price negotiation process\nfor generic drugs; future adjustment of reimbursement price in\nconsideration of inflation; withdrawal of SKG's plan to lower the\nprice of off-patent drug to 80%; and putting off evaluation of\ncost-effectiveness of drug.\n\nSKG said it denied all of the demands and the final text does not\ncontain such demands. However, I do not know how the positions of SKG\nare reflected in the text.\n\nAs I know, general principles include \"to recognize the value of\npatented medicine [actual English text may have different\nexpression].\" What I am concerned is that the meaning of \"value of\npatented medicine\" is unclear and the pharmaceutical companies may\nargue the value of patented drugs is ignored when Korean government\ncuts the price in the negotiation process between SKG and the\npharmaceutical companies.\n\n2. Transparency\n\n2-1. Independent review process\n\nIt is agreed to accept the US demand to establish an independent\nreview process in which a body independent from a national health\norganization reviews decisions of the organization regarding the price\nand reimbursement. SKG argues that the independent body has no\nauthority to overturn the original decision.\n\nHowever, as I heard, there is no written agreement on the \"no\nauthority to overturn the original decision.\"\n\n2-2. Dissemination of Information\n\nIt is agreed to permit a pharmaceutical company to disseminate\ninformation regarding its pharmaceutical through the Internet linked\nto the company's website.\n\n3. Pharmaceutical and Medical Devices Commission\n\nSKG uses the term \"commission\" rather than working group. The mandate\nof the commission includes review of the implementation of agreement\nand promotion of mutual understanding of the agreement.\n\n4. Intellectual Property Rights\n\n4-1. Patent Term Extension Due to Approval Delay\n\nIt is agreed to provide a patent term extension to compensate for\ndelays in drug approval process. When the drug is imported drug, the\ndelay in exporting country may be excluded.\n\nHowever, it is not clear if the exporting country includes US and\nKorea. And there is no limitation on the maximum period of the\nextension.\n\n4-2. Patent Term Extension Due to Delay in Granting Patent\n\nIt is agreed to allow a patent term extension in case of delays in\ngranting patent more than three years from the request of patent\nexamination.\n\n4-3. Data Exclusivity\n\nUS demanded the market exclusivity on data submitted for approval. SKG\naccepted this demand as SK has provided 6-year protection for new drug\nsince 1995.\n\nAs I know, the data exclusivity covers \"same and similar product\" in\nboth 5-year and 3-year exclusivity and the languages are quite similar\nto the AU-US FTA.\n\n4-4. Compulsory License\n\nThere is nothing with respect to the grounds of compulsory license of\npatented invention. I heard that US withdrew its demand to narrow the\ngrounds.\n\n4-5. Approval and Patent Linkage\n\nIt is very likely that the agreed text on the linkage is quite similar\nto AU-US FTA.\n\nAccording to the explanation of SKG, US demanded the inclusion of\nautomatic stay of approval of generic manufacturer's application in\ncase of a patent infringement action by a patent holder, but SKG\ndenied. [I can not understand this position.] SKG further explains\nthat SKG may introduce an automatic 9-month or 4-month stay rather\nthan 30-month stay in US law. The 9-month or 4-month stems from the\ntime span from the filing of preliminary injunction to a court\ndecision. However, SKG has no data on the average period in court\ndecisions in civil actions (not the preliminary injunction) of\npharmaceutical patent infringement.\n\n4-6. Bolar Provision\n\nAs I know, the Bolar provision included in the FTA text does not\nreplace or exclude the broader exception for research and experimental\nuse of a patented invention under current Korean Patent Act.\n\n--\nHeeSeob Nam\nIPLeft (www.ipleft.or.kr)\nTel.: +82 2 6050 1621\nMobile: +82 11 470 1180\nFax: +82 2 6050 1700\nhurips@gmail.com\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}