{"category": "ham", "to_address": "zotz@100jamz.com, cc-community@lists.ibiblio.org", "from_address": "\"Matt Hanson ^ V.I.A.\" <matt@visint.tv>", "subject": "Re: [cc-community] A Swarm of Angels media release form", "body": "Drew, thanks for the comments.\n\n> So, has A Swarm of Angels decided to go with a CC license that would \n> be the\n> art equivalent of the OSD? (less any source code requirements) If so, \n> I think\n> I would like to contribute.\n>\n\nMost of the work will be under CC-BY-NC. With some footage etc under a \nSampling Plus license.\n\nWe had a discussion on our forums about it, and stopped short of CC-BY \nto protect the overall work from predatory commercial use. So that's \nnot quite the OSD art equivalent. It allows us the flexibility to \nprotect and sell some commercial rights, and the Swarm have already \nvoted the project as non-profit distributing, so any profits from the \nfeature will be rolled into the next one, and building the community.\n\nOther than that, we're going to be as liberal as possible with the \nlicensing hence the Sampling Plus license for things like footage \ngenerated (so for example VJs or short filmmakers can utilise video \nfootage in commercial performance works).\n\n> I thinkthe license might be a bit confusing. The confusion might arise \n> due to\n> names for the two (one?) projects.\n>\n> If there are indeed two projects:\n> ASWAM: A Swarm of Angels Movie\n> ASWAD: A Swarm of Angels Documentary\n>\n> Then I think you could clear up the possible confusion by beaing clear \n> which\n> is which in the text.\n\nOK, this helps. This media gather is for the documentary about the \nproject. Not the movie itself. But the next one may well see footage to \nbe included in the movie. So I'll be explicit about both these media.\n\nThe call for video is here:\nhttp://www.aswarmofangels.com/2007/04/call-for-video-swarm-documentary/\n\nThanks for the feedback, Matt\n\n\n//  Matt Hanson / Director\n//  A Swarm of Angels. Remixing cinema\n//  http://www.aswarmofangels.com\n\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}