{"category": "spam", "to_address": "<iplacereports@flax9.uwaterloo.ca>", "from_address": "\"JohnLansing@Investorplace.com\" <JohnLansing@Investorplace.com>", "subject": "Trade Talk Weekly May 15: Investors Beware!", "body": "\n\nTrade Talk Weekly Update\n\n\n\n\n\n\n\nMay 15, 2007\n“INVESTORS BEWARE”\n\n\n\n\n\nThe Tell-Tale Charts\nIt’s hard not to be bullish when the market has shot back up after every pullback recently.   But when everyone says it’s going to the moon, that’s when we need to look under the hood and see if a rally is really healthy.   Right now, all the indicators are pointing south.\n\nThough prices have risen, the MACD histogram shows negative buying pressure.   That’s a sign they won’t be rising much longer.\nThe Average Directional Index (ADX) which measures the strength of a trend on a scale of 0 to 100, is at 13.29.   That’s not just weak, it’s in critical condition!\nStocks that led the rally up, like CTSH, ISRG, MIDD, TTEC, are tanking.   So who’s leading the rally now?\n\nAll of this and more shows the market is topping.   Remember, as technical traders, we don’t trade the top 10% or the bottom 10%.   We only trade the middle.   That means at times like this, we take a step back and limit ourselves to inverse funds and start working on a list of shorts.   Join Trending123, and you can make money no matter which way the market is going.\n\n\n\n\nA fever is spreading across Wall Street.   A fever that is causing false hope in its victims.\nYou may, in fact, be one of them.\nBut don’t blame yourself for believing in the market façade.   It’s perfectly natural to want to see the best.   After all, it is springtime.   Flowers are blooming, birds are a chirpin’ and the warm sun is a shinin’.\nNow I hate to be the storm cloud blocking your sunny disposition here, but everything isn’t as lovely as they’d have you believe.\nThere are so many indications that this market is more sour than sweet that it’s more than a little baffling that I seem to be one of the very few people talking about it.   Repeatedly.   And I will continue to shout about the real story until more people start paying attention.\nLook, I’m not just spouting off ideas and assumptions just to hear myself talk.   I’m looking at real-time charts that are the true indicators of everything you’d ever need or want to know about how the market performed in the past, how it is performing right now and how I see it unraveling in the near future.   Look at the most recent charts with me — try Trending123 with this special offer today.\n\n\n\n\n\n\nWHEN THE STORM HITS…\nWill your portfolio plummet or will you be in the stocks that profit?\nAll the market charts — from the NASDAQ’s “QQQQ” to the S&P 500, and so on — point to an impending calamity for most investors.   The Dow could drop as much as 2,000 points from here.\nBut if you give me just a few minutes of your time — I could save you many thousands of dollars.\nSo far this year, at Trending123, we have closed 67 short-term trades and 78% of them have been winning trades.   On an annualized basis, we’re averaged 114% gains on each one of those trades!\nProtect your portfolio—and learn how to profit—click here to watch this important video message.\n\n\n\n\n\n\nPerception Vs Reality\nOkay, look, let me explain what I mean about the market.\nImagine the market is a used car.\nSo there it is on the lot — brightly polished, everything in its place.   Just about perfect to the naked eye.\n\nBut as anyone who has ever bought a used car will tell you, you must look under the hood. One look under there and what once seemed like your perfect car may have just become a junker that you’re grateful you didn’t purchase!\nNow look at the market as if it were this used car. Catch my drift?\nThis market can appear like nothing at all is wrong “under the hood” but that my friends, would be a terribly wrong assumption to make.\nWe are experiencing a Frontrunner Collapse!\nMany frontrunner stocks are practically flashing their crumbling states in bright neon.   And yet no one seems to be paying attention.\n\nTake these 6 as examples:\n\nCognizant Technology Solutions Corp. (CTSH) — a frontrunner in a complete freefall (currently falling below the 200 EMA)!\nIntuitive Surgical Inc. (ISRG) — It broke out of its rising wedge pattern on bearish divergence.   Indicators are pointing straight down.\nMiddleby Corp. (MIDD) — This has gone from the 146 mark down to 125 over the past few weeks while the market is supposedly holding up well. What??!!\nMillicom International Cellular SA (MICC) — Indicators are pointing down on bearish divergence…this one could roll over at any moment.\nTeleTech Holdings Inc. (TTEC) — Back in April, this was topping but now it’s taking a serious nosedive on massive volume.\nAmgen Inc. (AMGN) — I can’t even talk about this one.   It’s just too scary!\n\n\nOkay, now you have seen behind the magic curtain.   You know what is really happening in the market.   Do not turn a blind eye or a deaf ear any longer.\nPay attention.   Don’t just see what “they” want you to see.   See more of the truth right now — try my Trending123 service at a special rate.\n\nSincerely,\n\nJohn LansingTrending123\n\nP.S. Want the chance to try an experienced trading service — one that can show you how to earn sudden profits — 10%–30% gains (and sometimes higher), often in a matter of weeks, or even days?   Get in before the newest stocks—set to profit from a potential correction—are chosen!\n\n\n\n\n\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you.   Please tell us if your email has changed by visiting here: http://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice from InvestorPlace advisors, you can let us know by visiting \nhttp://www.investorplace.com/u/?p=8BM195-1&e=iplacereports@speedy.uwaterloo.ca\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,2420A Gehman LaneLancaster, PA 17602\nCopyright © 2007 ACP Phillips Investment Resources, LLC.\nAll rights reserved.\n05/15/2007 8:14PM\n\nThank you for subscribing to InvestorPlace.com.   Please note that we cannot be liable for any missed bulletins caused by overzealous spam filters.   To ensure that you continue to receive this valuable part of your service please take a moment to add (JohnLansing@InvestorPlace.com) to your address book.   Click here for instructions:\nhttp://www.investorplace.com/whitelist.php?eml=JohnLansing@InvestorPlace.com\n\nee==8BM195\n\n\n\n\n\n\n"}