{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Morning HTML\" <cbsnews_weekday_morning_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 19, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESKiller's Video Reveals Deep-Seated Rage\nTwo days after the worst killing spree in modern U.S. history, videos and photographs of an armed Cho Seung-Hui stunned the\n                        university community where he killed 32 people before committing suicide. \"Now you have blood on your hands,\" he said. More...Watch: 'You Forced Me Into A Corner'\n• More Carnage As Iraqis Mourn\n                     \t\t\t\t\t| Watch• New Pet Food Worry: Contaminated Rice• \"American Idol\" Says So Long, Sanjaya!\n                     \t\t\t\t\t| WatchU.S.New Pet Food Worry: Contaminated Rice\nThe FDA says the industrial chemical previously found to have contaminated wheat bran and caused the recall of over 100 pet\n                        food brands is now believed to have contaminated rice protein concentrate, also imported from China. More...\n• Killer's Video Reveals Deep-Seated Rage\n                     \t\t\t\t\t| Watch• Gunman's Cyber World To Be Revealed\n                     \t\t\t\t\t| Watch• Group Plans To Picket Va. Tech Funerals\n                     \t\t\t\t\t| Watch• More StoriesWorldMore Carnage As Iraqis Mourn\nAs Iraqis filed into morgues across the country to collect the bodies of their loved ones, killed Wednesday in attacks which\n                        left more than 230 dead, a suicide bomber killed at least 11 more people in a Shiite neighborhood of the capital city. More...Watch: Has The Troop Increase Helped?\n• Turkey Detains 5 In Bible Shootings• Crucial Iraq Oil Law Set For Parliament• At Least 183 Dead In Baghdad Bombings\n                     \t\t\t\t\t| Watch• More StoriesPoliticsHigh Court Upholds Ban On Some Abortions\nIn a 5-4 ruling, the Supreme Court upheld the federal ban on a controversial abortion procedure, handing a major victory to\n                        abortion opponents. More...Watch: Major Abortion Ruling\n• Bush Threatens Sudan Over Darfur Bloodshed• Pure Horserace: It's All In The Timing• Why The NRA Gets Its Way\n                     \t\t\t\t\t| Watch• More StoriesHealthDoes Cervical Cancer Vaccine Benefit Last?\nTwo vaccines for preventing cervical cancer, one that is already available and another that is undergoing FDA review, continue\n                        to offer nearly 100% protection five years following administration, new research shows. More...\n• New Pet Food Worry: Contaminated Rice• Hormone Use Linked To Higher Cancer Risk• Possible Aid For Alzheimer's: Satellites• More StoriesSciTechAntwerp Zoo: Don't Stare At That Chimp\nNew rules have been posted at the Antwerp Zoo urging visitors, especially regulars, not to form a bond with a male chimp named\n                        \"Cheetah.\"  He was raised by humans, and zookeepers are now nudging him into forming social ties with other apes. More...\n• Gunman's Cyber World To Be Revealed\n                     \t\t\t\t\t| Watch• Possible Aid For Alzheimer's: Satellites• BlackBerry Outage Leaves Thumbs Idle• More StoriesBusinessBlackBerry Outage Leaves Thumbs Idle\nMost of it happened outside \"work\" hours, but the nature of mobile e-mail meant plenty of dismay as BlackBerry service went\n                        down across North America from Tuesday evening to Wednesday morning. More...\n• New Pet Food Worry: Contaminated Rice• TurboTax Trouble• Clear Channel Accepts $19 Billion Bid • More StoriesEntertainment\"American Idol\" Says So Long, Sanjaya!\nThe reality show's unlikely star was finally voted off the show this week. More...Watch: Simon Cowell Gets Judged\n• Kitty Carlisle Hart Dies At 96• Governor Mulls Pardon For Jim Morrison  • Jam Master Jay Suspect Named• More StoriesOpinionMaking No Sense Of It All\nAs more details emerge about Cho Seung-Hui and the circumstances surrounding Monday's massacre at Virginia Tech, many questions,\n                        but no answers, have surfaced. National Review Online writes about the guilt, emotion and evil of this crime. More...Watch: Killer's Profile Analyzed\n• Iraq On Edge\n                     \t\t\t\t\t| Watch• Seeing Through The Smoke• Thinking About The Unthinkable\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSVirginia Tech Massacre: Wounded Student: I Forgive Gunman\nVirginia Tech senior Garrett Evans was saved by heroic classmates from possible death, after being hit in the leg. Evans says\n                        he bears no malice toward Cho Seung-Hui, and only wishes someone had reached out to Cho before he went on his rampage.\n                         More...Watch: 'You Forced Me Into A Corner'\n• CBS Evening News: One Room Away: A Student's Story\n                     \t\t\t\t\t| Watch• CBS Evening News: Gunman's Cyber World To Be Revealed\n                     \t\t\t\t\t| Watch• EARLY SHOW: Three Va. Tech Friends Mourn Together\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\n'You Forced Me Into A Corner'The Virginia Tech shooter's chilling and defiant video to NBC reveals his lack of self-worth and need for recognition. Bob\n                                    Orr reports.\nTOP VIDEOS\nWatch Cho's Video Manifesto\nMajor Abortion Ruling\nHas The Troop Increase Helped?\nHi-Tech Sleuthing\nShooter Seen As Unstable\nWhen Did The Shooter Snap?\nStudent Recounts Deadly Day\nEmotions Fragile At Va. Tech\nA Brother's Pain\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesThe exonerated Duke lacrosse students give their first interview to Lesley Stahl, just days after all remaining charges\n                           against them were dropped. Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryThe Puppet Master:A couple is gunned down, the triggerman is known. But who was pulling the strings behind the\n                           scenes? Troy Roberts reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}