{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nTonight we’ll be broadcasting from Philadelphia, home of the Independence Hall, the Liberty\n  Bell and a vibrant population that is the sixth-largest in the United States.\n  Philly is also known as the city where American democracy was born –\n  and tonight we’ll have a cultural and historical view of a city that\n  has contributed so much to our country’s history.\n \nThis city, which was home to the country’s\n  first hospital – founded by Benjamin Franklin in 1751 – now is\n  having a health-care crunch that’s particularly acute for pregnant\n  women and the care they’re getting when it counts. I’ll take a\n  closer look at this story for you.\n \nBefore that, the news of the day. To start out our\n  broadcast, David Martin will have an exclusive report on Pentagon planning\n  and the war in Iraq.\n  Meanwhile, are Democrats blinking first on the prospect of a withdrawal\n  deadline? Sharyl Attkisson will fill you in.\n \nA different kind of debate is heating up on the\n  streets – and on the Web. An anti-informant “stop\n  snitching” campaign now has a high-tech edge. And this is infuriating\n  federal prosecutors, Bob Orr will explain.\n \nAs Hurricane season approaches, National Weather\n  Service forecasters warn that they expect between 13 and 17 tropical storms\n  this year, with at least seven of them becoming hurricanes. Is the Gulf Coast\n  ready? Hari Sreenivasan will examine New\n    Orleans’ levee system and whether it is\n  equipped to survive a major storm.\n \nWe’ve been following the story of the two whales\n  stranded 60 miles up the Sacramento River in California. Sandra Hughes will tell you\n  about the obstacles still in their way en route to their ocean home –\n  and the hope spectators have for their safe return.\n \nFinally, we’ll come back to Philadelphia, where we will settle down\n  with a cheesesteak and channel some memories from decades past in The City of\n  Brotherly Love.\n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}