{"category": "ham", "to_address": "Roger Bivand <Roger.Bivand@nhh.no>", "from_address": "Matthew Neilson <matt@gneilson.plus.com>", "subject": "Re: [R] Unwanted white borders on semi-transparent polygons?", "body": "Hi Roger,\n\nYes, that's the FAQ to which I was referring in my original email. Unfortunately, turning off smoothing for line art (as suggested in the FAQ) did not work for me.\n\nMany thanks,\n\n\n-Matt\n\n\n\nOn Fri Apr 27 12:32 , Roger Bivand  sent:\n\n>Matt:\n>\n>Is this by any chance a version of FAQ 7.36, which turned out to be the \n>smooth line art flag in Adobe Reader?\n>\n>Roger\n>\n>\n>\n>On Fri, 27 Apr 2007, Matthew Neilson wrote:\n>\n>> Thanks for your fast response.\n>> \n>> I'm using R version 2.1.1 on OS X 10.3.9 to create the pdfs. I have tried viewing the pdf output in both Acrobat 6 and 7 (both display a white border around each polygon) as well \nas \n>> Preview (displays fine). I have emailed the pdf file to some correspondents running Windows, and they also see white borders when viewing with Acrobat (version unspecified).\n>> \n>> I have tried using R version 2.4.0 on a G5 machine (which I can access remotely) running OS X 10.4.8, but the resulting pdf renders incorrectly (i.e. with a white border around \neach \n>> polygon) in both Acrobat *and* Preview. So it would appear that the combination of R 2.1.1 and OS X 10.3.9 gives slightly better results - although plots still appear incorrect \nwhen \n>> printed or viewed in Acrobat.\n>> \n>> Unfortunately, I don't have access to a Windows machine to test this out. Even if I did, many of my scripts include various Unix system calls so I don't think that would be a viable \n>> solution. Could this be a bug in the OS X pdf driver?\n>> \n>> Many thanks,\n>> \n>> \n>> -Matt\n>> \n>> \n>> \n>> On 27 Apr 2007, at 06:42, Prof Brian Ripley wrote:\n>> \n>> >What version of R, what OS, what version of Acrobat?\n>> >\n>> >I don't see this in 2.5.0 on Windows (using Acrobat 7: Acrobat does not \n>> >exist on Linux, AFAIK).  And reading the PDF produced shows no sign of an \n>> >extra object for the border.\n>> >\n>> >On Fri, 27 Apr 2007, Matthew Neilson wrote:\n>> >\n>> >> Hey all,\n>> >>\n>> >> I'm trying to create a plot of two semi-transparent regions. The reason they need to be partially transparent is so that I can see if there's any overlap. Here's some example \ncode:\n>> >>\n>> >> # BEGIN\n>> >>\n>> >> pdf(file=\"test.pdf\",version=\"1.4\")\n>> >> plot(0,0,type=\"l\",ylim=range(-3,3),xlim=range(-1,5))\n>> >> polygon(c(0,1,2,3,4,3,2,1,0), c(0,1,2,1,0,-1,-2,-1,0), col=rgb(1,0,0,0.5),\n>> >> border=NA)\n>> >> polygon(c(1,2,3,4,5,4,3,2,1), c(0,1,2,1,0,-1,-2,-1,0), col=rgb(0,0,1,0.5),\n>> >> border=NA)\n>> >> dev.off()\n>> >>\n>> >> # END\n>> >>\n>> >> The problem with this is that, despite setting \"border = NA\", I get a \n>> >> big white border surrounding each polygon!! Funnily enough, setting the \n>> >> alpha channel equal to 1 (as opposed to 0.5) *doesn't* give the border, \n>> >> but an alpha channel of 1 produces an opaque polygon! :S\n>> >>\n>> >> I have read the FAQ, and (unfortunately) turning off line-art smoothing \n>> >> does not give the desired effect. Furthermore, my pdfs print with a \n>> >> white border surrounding each transparent polygon.\n>> >>\n>> >> Now, here comes the really bizarre part. Whilst Adobe Acrobat displays \n>> >> the unwanted white border, Apple Preview respects the \"border=NA\" \n>> >> argument and shows the two diamonds as they are intended. However, \n>> >> opening up the pdf in Illustrator CS reveals that there is in fact a \n>> >> transparent (according to Illustrator) border *on top* of each diamond. \n>> >> Deleting these two borders (one for each polygon) and re-saving the pdf \n>> >> appears to correct the issue. So the obvious question is: how did the \n>> >> surrounding borders get there in the first place? A bug in the polygon \n>> >> function, perhaps?\n>> >>\n>> >> Does anyone have any ideas for preventing these unwanted borders around \n>> >> semi-transparent polygons (without having to resort to Illustrator)? Has \n>> >> anyone else even come across this problem?\n>> >>\n>> >> Many thanks,\n>> >>\n>> >>\n>> >> -Matt\n>> >>\n>> >\n>> >-- \n>> >Brian D. Ripley,                  ripley@stats.ox.ac.uk\n>> >Professor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\n>> >University of Oxford,             Tel:  +44 1865 272861 (self)\n>> >1 South Parks Road,                     +44 1865 272866 (PA)\n>> >Oxford OX1 3TG, UK                Fax:  +44 1865 272595\n>> \n>> ______________________________________________\n>> R-help@stat.math.ethz.ch mailing list\n>> https://stat.ethz.ch/mailman/listinfo/r-help\n>> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n>> and provide commented, minimal, self-contained, reproducible code.\n>> \n>\n>-- \n>Roger Bivand\n>Economic Geography Section, Department of Economics, Norwegian School of\n>Economics and Business Administration, Helleveien 30, N-5045 Bergen,\n>Norway. voice: +47 55 95 93 55; fax +47 55 95 95 43\n>e-mail: Roger.Bivand@nhh.no\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}