{"category": "spam", "to_address": "<IPLACEREPORTS@flax9.UWATERLOO.CA>", "from_address": "\"RobertHsu@InvestorPlace.com\" <RobertHsu@InvestorPlace.com>", "subject": "Flash Alert: The June Surprise", "body": "\n\nFlash Alert: The June Surprise\n\n\n\n\n\nWe love giving our InvestorPlace.com members benefits like access to this timely message. \n\n In order to ensure you keep receiving special alerts and offers like this one, please take a moment to click on any of the links in this message to reconfirm that this is the email address where you want to receive emails from InvestorPlace.com   \n     \n\n\n\nURGENT INVESTOR ALERT \n“First, Panic In Shanghai…\n\nThen A Head-Spinning Recovery…\n\n          Now Get Ready For\nTHE JUNE SURPRISE!”\n\nShanghai  fell apart on Tuesday, February 27.   The 9% overnight melt-down shook every market across the planet over the  next 12 hours.\nHad  you followed my instructions, issued via a special email Flash Alert on  Wednesday morning, you would have today, 10 weeks later…\n…gains  of 48% in Aluminum Corp. of China\n…gains  of 30% in Apple\n…gains  of 29% in both China Petroleum and Suntech Power\n…gains  of 27% in China Life\n…gains  of 24% in The9 Limited\n…gains  of 22% in both Comtech and CTrip\nThat’s  2- 3 Years Of Profit—\nIn  10 Weeks!\n The February Surprise may never be satisfactorily  explained, but the subsequent April Dash, in which the Shanghai market roared  back 45% is more important to understand:\n\nA  vast economy growing at over 11% pulls stocks along with it as surely as  day follows night.  It's just inevitable.\n\nHi—Robert Hsu here  and I am sending you this urgent Flash Alert today because, for the THIRD TIME inside a few months, you  are about to be totally BLINDSIDED by China.\nFIRST by the  shocking Shanghai melt down in February…\nSECOND by the  surprising melt UP this spring by China stocks…\nAND NOW comes The  June Surprise.\nAre  You Ready\nThis  Time?\n Please listen to me  carefully.  The gains of 22% - 48%  my subscribers made this spring were made possible because we were ready.\nWe  knew that, on Wednesday morning, February 28, we had to buy and buy with both  hands.  We scooped up profits in  that one move that gave us 2 or 3 years’ worth of profits in just 10 weeks.\nThis  week I have told my subscribers: GET READY FOR THE JUNE SURPRISE.  It’s a doozy, my friend, and when I  tell you about it, you will have a stark  and urgent choice.\nIGNORE  ME AGAIN—OR PREPARE TO ACT.\nIn  this short message I will do everything in my power to convince you that you must prepare.   Please—just hear me out.   Then decide for yourself.\nWhat  No One Is\nTelling  You\n The world is changing faster than most of us can  even grasp, my friend. \nJust  ask the CEOs of Alcoa and Alcan.   The pending merger of these archrivals in a $30 billion deal is happening  because China’s headlong economic growth will DOUBLE the demand for aluminum in  the next few years.  If Alcoa and Alcan don’t put aside  their differences, they’ll simply vanish—swallowed whole by a Russian or  Chinese rival.\nEven  if they do merge, they could still be  taken over.\nThis  was unthinkable, even a few years ago.   But from Chrysler to Kodak, from The Wall Street Journal to Winnebego,  from Alcoa to IBM, you can see for yourself the ground splitting, you can hear  the roar, you can feel the icons rattling and crashing…as a massive China  economy, bulging and growing at an 11% rate, pulls the world as we know it into  a new shape.\nThe  profits you make from this Chinaquake over the next few years will far exceed  all the money you’ve made in a lifetime of work and investing.\n\nPROOF: While Alcoa and Alcan were figuring out how to  mate, Aluminum Corp of China soared 48% for my subscribers.  That’s 5 years’ of profit—in just 10  weeks!\n\nWhich brings us to  the coming JUNE SURPRISE.\nIt’s Inevitable—\nAnd Totally Unforeseen\nI laughed so hard  at breakfast, my family looked worried.\nOn February 28,  after the 9% drop in the Shanghai Index, guru after guru appeared on my morning  TV, trying to tell me that the China market was—and I quote—due for a breather.  Needed some steam taken out.  \nLike this was a  horse—or a boiler.  \nI dashed my Flash  Alert to my subscribers in the next few minutes.\nListen to me on  this, please:\n\nAN ECONOMY—ESPECIALLY ONE AS BIG AS CHINA’S—GROWING AT  11% A YEAR—MAKES ALL VALUATION ARGUMENTS WORTHLESS AS SOON AS THEY ARE MADE!\n\nSure,  an economy chugging along, as the U.S.  economy is, at a steady 3%, will be accompanied by a market that runs ahead,  stops, drops behind, runs around in circles—and offers value investors  reasonable opportunities to target nice opportunities.\nBut  an economy pounding ahead at 11% or more  (I suspect more, by the way) makes this mornings’ valuation of a company out  of date by tonight!\nTake  our Aluminum Corp example.  It  doesn’t even POSSESS a relevant valuation metric.  It’s a well-run company in a market that’s doubling, in an  economy that will twice today’s size in  2015.  \nSo  the 48% we made in the last 10 weeks was neither a lot…nor a little… because  there are simply no guideposts for this.\nAnd while Wall  Street gurus confidently look forward to a traditional market slowdown,  beginning in June, guess what will happen to China stocks.\n\nTHEY’LL POUND AHEAD—leaving investors behind…again!\n\nRight  now in China, a billion people are just arriving back at work after a long  holiday.  The Olympics are only a  year away.  Beijing is flooding the  system with cash.\nAnd  well-run companies like China Life, CTrip, Mindray Medical, Suntech Power and  Focus Media will  continue to soar 5%, 10%, 15% a day.\nYes, a day.\nIn  June, when Wall Streeters are day-dreaming about how to beat the rush to Long  Island beaches this summer…\n…stock  after stock on today’s Buy List will be crashing through 52-week highs.\nI  Want You To Be\nReady  For This\n Let Wall Street slumber.  You and I need to get busy making money.\nPositions  carefully built in the next 10-15 days, following my explicit instructions, can  be expected to rise as much as 25% by the July 4 holiday.\nPositions  established now in the 5 top Buys named in today’s issue of China Strategy could be 50%, maybe 70% higher by Labor Day…and  could be doubles for you by year end.\nThis  list of stocks for immediate accumulation is available instantly here.\nYou  Know This\n You already know this: The last time there was an  economy growing at this rate, men like Morgan, Carnegie and Rockefeller  bestrode the land.  People like you  and me could only grab scraps of the immense wealth being created in those days.\nIt’s  different this time. Draw up a chair and dig in.\nIf  you’re not quite sure how, try China Strategy.  Our China stocks are  doubling and the reason is: we get out there and kick over some rocks.\nMe and my team of  analysts, my hand-picked team of mini-Peter Lynches, if you like, looking at  what’s working, what’s not, in inland cities and outlying suburbs all over  China.  Asking questions—and  discarding the lies, which make up an astoundingly high volume of the answers.\nNo one else does  this.  I know because I  checked.  \nDon’t  miss The June Surprise.  The China  economy is NOT going on summer break!   I expect positions established now in our 5 top China stocks could be  25% higher by July 4th, 50% higher by Labor Day—and doublers by year  end.\nGet in now.\n\n        Robert Hsu, Editor\nChina Strategy\nProfiting from The China Miracle\nP.S. DON’T GET BLINDSIDED  AGAIN.  Establish your positions  now and you won’t miss out again on the huge gains my China Strategy subscribers are getting.  Don’t ignore me this time.  Click here. \n\n\n\n\n---------------------------------------------------------\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you.\n        Please tell us if your email has changed by visiting here:\nhttp://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice from InvestorPlace advisors, you can let us know by visiting http://www.investorplace.com/u/?p=8BX249-1&e=IPLACEREPORTS@SPEEDY.UWATERLOO.CA\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,\n        2420A Gehman Lane\n        Lancaster, PA 17602\nCopyright (c) 2007 ACP Phillips Investment Resources, LLC.\n        All rights reserved.\n05/23/2007 6:26PM\n--------------------------------------------------------------------\n        Thank you for subscribing to InvestorPlace.com. Please note that we cannot be liable for any missed bulletins caused by overzealous spam filters. To ensure that you continue to receive this valuable part of your service please take a moment to add (RobertHsu@InvestorPlace.com) to your address book. Click here for instructions: \nhttp://www.investorplace.com/whitelist.php?eml=RobertHsu@InvestorPlace.com \n        --------------------------------------------------------------------\n    ee==8BX249\n\n\n \n\n\n\n\n"}