{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 5/26/07 - Where We Are, Where We're Headed", "body": "May 26, 2007\n\nSalem, Massachusetts\n\nBy Mike Cintolo\n\n==\n\nFeaturing Mike's Musings:\n\nThe End of the Beginning\n\nBlack Gold Makes a Comeback\n\nSpotting a Possible Big Winner\n\n==\n\nEditors Note: On this beautiful Saturday (at least in Massachusetts),\nI'm pleased once again to be \"replaced\" by Mike Cintolo, the editor of\nCabot Top Ten and co-editor of Cabot Market Letter.  Mike's our\nleading student of the market, meaning he's the expert chart-reader\nand market pulse-taker on the staff, and I know you'll enjoy what he\nhas to say.\n\nAs for me, I'll be back to you on Monday with the Memorial Day issue.\n- Timothy Lutts.\n\n==\n\nWell, in the past two months I've taken an amazing trip to Orlando (stayed\nat Portofino Bay, a great place to get engaged, or anything romantic, for\nthat matter) and another to California's wine country.  But due to those\nexcursions, I'm left with the following equation:\n\n2007's vacation allowance - two trips in two months = Mike is typing like\na fiend the Friday before Memorial Day!  So I'm penning this Friday\nafternoon, for your enjoyment on Saturday.  As always, give me a shout at\nmike@cabotwealth.com with any questions or comments.\n\nWithout further ado, let me get right into it - let's discuss my market\noutlook.\n\nWe're nearly five months through 2007, and the markets have served enough\ntwists and turns to give us all motion sickness.  There was a good, ol'\nfashioned ramp up in the later part of January, the sickening Shanghai\nShakeout, and the spectacular two-month levitation act since late March. \n\n\nOf course, right before every one of those twists, most investors believed\nthe exact opposite would happen - investors were out-and-out bullish in\nmid-February, for instance, and were also convinced China would drag down\nthe world economy in late March.  The market, remember, serves to fool the\nmajority, and it's certainly earning its keep this year.\n\nBut that's all history.  What's on the horizon?  I feel that another twist\nis right around the corner ... in the near-term, anyway. \n\nI've written here before how bullish I am for the rest of the year, even\ninto 2008; some longer-term indicators (9:1 volume up days, record high\nNYSE short interest, Presidential Election Cycle, etc.) tell us the\ncurrent bull move should be more powerful than those seen in recent years.\nAnd that view is unchanged; looking out six to twelve months, I believe\nthe odds are in favor of the market being 10%, 15% or 20% higher.  So if\nyou're heavily invested in your 401(k), you should do just fine.\n\nBut for those of you who invest based on the intermediate-term like me, I\nbelieve the market is nearing what I'm calling (with respects to Winston\nChurchill) The End of the Beginning - the end of this tremendous blast-off\nphase of the past two months, which itself is probably just the first\ncouple of innings of this bull move.  Translation:  The market's likely to\nform a trading range for a few weeks or more before pushing meaningfully\nhigher.\n\nI say this for a few reasons.  First, the market itself has become a bit\nragged of late; while the Dow exploded a few hundred points higher during\nmid-May, the Nasdaq and the broad market struggled.  (Strike one.) \nSecond, sentiment amongst the masses has become quite optimistic; we're\ngetting compliments left and right these days, a stark contrast to\nFebruary and March, when we could do no right.  (Strike two.)  And third,\nvery simply, most leading stocks have already broken out to the upside and\nstaged handsome moves ... something that usually precedes profit taking. \n(Strike three.)\n\nPut it together, and I see no reason the Dow and S&P 500 can't carve out a\ntrading range for a while.  That's no reason to panic and sell everything;\nin fact, the good news (especially if you're underinvested in top stocks)\nis that any pause should serve as a new launching pad, offering you the\nopportunity to buy top stocks as they pull back toward support.  (More on\nthat below.)\n\nBut, in the meantime, taking your foot off the accelerator a bit is\nprobably a good idea.  If you own a couple of laggards ... stocks you\nbought a few weeks ago, but really haven't gone up much even during the\nrally ... don't hesitate to sell out of them. You'll probably be able to\nput that money to work in better stocks in the weeks to come.\n\nSo what stocks should you be eyeing if we do see some weakness?  Believe\nit or not ... and this kills me, as I've always looked at cyclical stocks\nwith a frown ... oil stocks appear as if they have begun their next big\nupmove.  Really, the larger, longer-term picture of the group as a whole\nappears very bullish.  \n\nHere's what I mean:  Sometime in late-2003, when investors had \"learned\"\nfor the past decade that energy and cyclical stocks were bad investments,\noil stocks took off.  You're probably familiar with the leaders -\nHalliburton, Valero, Ultra Petroleum, Southwestern Energy and so on.  And\nthese stocks didn't stop going until the spring of last year ... many of\nthem up 500% or more from their original breakouts.  Sadly, I missed much\nof that move - count me among the many that disregarded oil stocks back\nthen.\n\nBut I won't make the same mistake twice.\n\nAfter a tedious decline and consolidation phase from early 2006 through\nthe first two weeks of 2007, oil stocks have entered into powerful new\nuptrends, in effect continuing their \"big picture\" uptrend that started in\n2003.  One of the stocks I'm spying:  Transocean Offshore (RIG), the\ngranddaddy of offshore, deepwater oil drillers.  Crude oil prices,\nremember, aren't any higher today than they were 20 months ago.  But they\ndo remain elevated (above $60), and that means exploration firms are\ndrilling everywhere they can to find black gold.\n\nThat's good news for Transocean, both now and in the future.  Despite\nhaving already seen their business mushroom the past couple of years,\nmanagement expects the current drilling cycle to last well into the next\ndecade.  And they're taking advantage of it!  The firm's backlog (due to\nlonger-term contracts for its rigs) stands at a monstrous $2.1 billion for\nthe remainder of 2007 ... $3.8 billion for 2008 ... $3.7 billion for 2009\n... $2.7 billion for 2010 ... and $1.6 billion beyond that.  Imagine! \nThis backlog allows tremendous predictability of earnings - analysts\nestimate $8 per share this year and $11.60 in 2008.  All this for a stock\nthat trades south of 100.\n\nBetter yet, because the company's rolling in the spieh, it's buying back\nits own stock hand over fist (it repurchased $400 million worth in the\nfourth quarter) and is considering instituting a regular dividend, or\nperhaps declaring a larger one-time payout.\n\nStill, the real story here is the changing perception of the oil patch. \nIt used to be that, if the price of oil slid, so would the group.  But\nnow, even as oil prices remain steady, oil stocks like RIG are being bid\nup, as investors are coming to realize exploration and drilling activity\nwill stay hot for some time to come.  I think RIG is one of the leaders of\nthe oil patch; I'm looking to buy it on any weakness.\n\n\n----- Advertisement -----\n\nHow to Invest Safer, Smarter and Better\n\nMarket timing gets little attention when the market is heading ever\nhigher, but now that a splash of cold water has hit investors in the\nface, many are remembering that Wall Street is not a one-way street.\n\nSo if you're looking for a time-tested, award-winning system  as well\nas coverage on our Two-Second and Volume Blast-Off Indicators --\nconsider giving the Cabot Market Letter a look. We not only tell you\nthe market's current condition, but we'll use that to get you in to\n(and eventually out of) the market's best stocks via our concentrated\nModel Portfolio.\n\nYou could easily see a $10,000 investment mushroom into $15,000 in six\nmonths...into $20,000 in a year...into $35,000 in 18 months.\n\nTo learn more please visit this link:\nhttp://cabotmail.net/t/187655/13148861/78/0/ \n\n==\n\nOK, so RIG (and oil stocks in general) is a good, longer-term idea.  But,\nwith a market capitalization north of $25 billion, Transocean isn't\nexactly a nimble spring chicken.  You might be looking for a smaller, more\ngrowth-y long-term story that you can pick up on the cheap should the\nmarket give some ground.  \n\nWhen looking for big ideas, I lean on three main criteria.  First, of\ncourse, you want to see fast sales and earnings growth; I'm not a big fan\nof buying unprofitable firms and hoping things will turn.  95% of all big\nwinners have big bottom-line growth before they make their upmoves.\n\nSecond, I want a firm that sells to a true mass market.  Medical firms are\nnice, as are oil stocks or defense contractors.  But they sell to a rather\nlimited customer base.  Historically, most of our big winners of\nyesteryear (Summit Technology, American Power Conversion, Home Depot, XM\nSatellite Radio, Amazon.com, Qualcomm, etc.) have sold their wares to\nliterally hundreds of millions of potential customers.  A mass market is\nalways a plus.\n\nThird, I'm looking for something new - new management, new product or\nservice, maybe even a whole new industry (like solar stocks).  That\nnewness usually builds a competitive advantage for the company, allowing\nits growth to continue unimpeded.\n\nOne firm that meets all these criteria:  Chipotle Mexican Grill (CMG), a\nrelatively recent spin-off of McDonalds.  Maybe you've eaten at one ... I\nhaven't.  The firm has only recently made its way into Massachusetts, and\neven that in a very limited way.  But it did make its way into Cabot Top\nTen Report a couple of weeks ago, and here's what we had to say about it:\n\n\"Chipotle opened its first restaurant in 1993, and today it operates over\n600 stores in 26 states, offering high-quality casual food made from\nfresh, raw ingredients. The menu is simple, burritos, tacos and burrito\nbowls. But what makes the restaurant stand out is its commitment to \"Food\nwith Integrity.\" Translated, that means food not only \"from fresh\ningredients, but ingredients that are sustainably grown and naturally\nraised with respect for the animals, the land, and the farmers who produce\nthe food.\" Clearly, consumers like the food; the chain saw revenues grow\n26% in the first quarter while earnings soared 40%. More impressively, the\ncompany opened 26 restaurants in the first quarter and says it plans to\nopen at least 120 in the whole year. What many diners don't know is that\nChipotle was bought by McDonalds in 1998 - a deal that allowed rapid\ngrowth from 14 restaurants to 480 at the end of 2005 - and then it was\nspun off from McDonalds in January 2006. Today it has no debt, a proven\nexpansion method, and good profit margins, all of which suggest that in\nthe long run, this chain could be a big winner.\"\n\nThe stock gapped up on its first quarter earnings report back on May 2,\nand has inched higher since.  Actually, CMG has been hovering just north\nof 90 in a very tight range, suggesting institutions are still\naccumulating shares.  That's good.\n\nEven better is the company's long-term outlook.  Ask yourself:  How many\nstores could Chipotle open in the years ahead?  Hundreds?  Thousands? \nManagement has certainly proven itself capable of growing the business\nfrom $68 million in sales in 2000 to $823 million last year.  Earnings are\nalso swinging higher; from $0.19 to $0.53 to $1.28 to $1.71 per share the\npast four years.  CMG has a legitimate shot to follow in the footsteps of\nsome of the big retail winners of years past, and I think you could buy a\nlittle on any pullback, and then add shares on the way up.\n\nHope you have a terrific holiday weekend!\n\nThanks for reading,\n\nMike Cintolo\nFor Cabot Wealth Advisory\n\nEditor's note: Mike Cintolo is the Editor of the Cabot Top Ten Report,\nand Vice President of Investments, for Cabot Heritage Corporation.\n\nEven when the broad market is weak, there are always some stocks going up,\nand the best way to find them, and to learn why they're so strong, is to\nread Cabot Top Ten Report, which every Monday shoots an email to your\ninbox detailing the fundamental and technical facts behind the ten\nstrongest stocks in the market.  Mike's momentum-based stock-picking\nsystem has no biases. It doesn't dislike commodities, or chip sectors, or\nhousing stocks. If a stock is leading the market upward, Mike Cintolo will\nsniff it out.\n\nTo learn more visit the link below.\n\nhttp://cabotmail.net/t/187655/13148861/81/0/\n\n==\n\n \nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=187655&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}