{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Anthony W. Youngman\" <debian@thewolery.demon.co.uk>", "subject": "Re: Final text of GPL v3", "body": "In message <200707021917.59165.skellogg@gmail.com>, Sean Kellogg \n writes\n>On Monday 02 July 2007 01:57:07 pm Anthony W. Youngman wrote:\n>> Are you saying that somebody has decided to give the US government the\n>> right to rule the world?\n>\n>No, but the US government has the right to enforce its laws and other\n>countries have the right to respond in kind.  Germany, for example, has\n>claimed universal jurisdiction for the purposes of human rights violations...\n>of course, the U.S. would never turn over one of it's citizens to such a\n>court.  Are you sure your government will stand up for you if the U.S. comes\n>calling?  Is it worth the risk?\n\nActually, I KNOW they won't :-(\n>\n>> I don't give a monkeys about American criminal law, because I don't live\n>> there. And I have no desire to visit there.\n>\n>Well, that's all fine and good.  However, if you were to pass yourself off as\n>a lawyer and give legal advice to Americans from your home country, I would\n>think it would only be a matter of time before Interpol would come looking\n>for you with a one-way extradition ticket to the U.S.\n>\n>> And what would you do about the Sklyarov affair? What he did was\n>> criminal under US law, I agree. But under Russian law (the law of his\n>> local jurisdiction) it was MANDATORY!\n>\n>Ah, but Sklyarov chose to do what he did from American soil, so not really a\n>great example.  For the record, I protested in front of the Seattle Adobe\n>building when that all went down, so don't think I'm some sort of corporate\n>suit wearing dude here.\n>\nOOPPSS !!! You're WRONG here.\n\nSklyarov did what he did AT HOME IN RUSSIA. It was the company he worked \nfor that marketed it in America.\n\nCheers,\nWol\n-- \nAnthony W. Youngman - anthony@thewolery.demon.co.uk\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}