{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 19, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIES9 Firefighters Killed In Charleston Blaze\nNine firefighters died in a blaze that swept through a furniture warehouse, the mayor of Charleston, S.C., said. Witnesses\n                        said the store's roof collapsed, throwing debris over about two-dozen rescue workers. Onlookers were hit with flying ash. More...Watch: 9 Firefighters Killed In Blaze\n• Bush, Olmert Praise Palestinians' Abbas• Officials Confirm They Got Killer Bear\n                     \t\t\t\t\t| Watch• Iraqi Orphanage Nightmare\n                     \t\t\t\t\t| WatchU.S.Officials Confirm They Got Killer Bear\nThe bear tracked down and killed by wildlife officers yesterday was the one that killed an 11-year-old boy in the Utah wilderness,\n                        officials said. They also said the bear probably had harassed other campers in the same spot this past weekend. More...Watch: Aggressive Bear Killed In Utah\n• 9 Firefighters Killed In Charleston Blaze\n                     \t\t\t\t\t| Watch• Cops: Indiana Teen Shoots Cops, Kills 1• At Least 5 Dead, 5 Missing In Texas Floods\n                     \t\t\t\t\t| Watch• More StoriesWorldBlast Near Baghdad Mosque Kills 75\nAt least 75 people have been killed by a truck bomb blast near a mosque in Baghdad just two days after a curfew aimed at preventing\n                        such attacks ended in the capital. Meanwhile, about 10,000 U.S. troops are hunting down al Qaeda insurgents in Diyala. More...Watch: Blast At Baghdad Mosque\n• Iraqi Orphanage Nightmare\n                     \t\t\t\t\t| Watch• Splitsville For French Power Couple• Cuba's \"First Lady\" Dead At 77• More StoriesPoliticsObama: \"Punjab\" Memo Was A \"Dumb Mistake\"\nDemocratic presidential contender Barack Obama disavowed a memo criticizing rival Hillary Rodham Clinton's financial ties\n                        to India, blaming his campaign staff for a \"dumb mistake.\" The memo was headlined \"Hillary Clinton (D-Punjab).\" More...\n• Bloomberg Slams D.C., Avoids '08 Questions\n                     \t\t\t\t\t| Watch• Panel: Missing RNC E-Mails May Violate Law• Bush, Olmert Praise Palestinians' Abbas• More StoriesHealthNew Web Site Rates Hundreds Of Sunscreens\nThe Environmental Working Group tells how well they ward off various harmful rays. The EWG's research head explained, on The\n                        Early Show. More...Watch: Sunscreens Ranked & Rated\n• Splitting Pills May Help Medication Costs• Soy Compound May Bolster Women's Bones• Steep Drop In Death Among Diabetic Men• More StoriesSciTechOil Industry Scales Back Expansion Plans \nA push from Congress and the White House for huge increases in biofuels, such as ethanol, is prompting the oil industry to\n                        scale back its plans for refinery expansions. That could keep gasoline prices high, possibly for years to come. More...\n• Space Station's Computers Seem A-OK• Wireless Technology Takes A Leap Forward• Global Pedophile Ring Busted\n                     \t\t\t\t\t| Watch• More StoriesBusinessBoeing Gets A Wing Up On The Competition\nWith better fuel efficiency and a roomier interior, the 787 \"Dreamliner\" is giving Boeing a wing up on the competition. Nancy\n                        Cordes reports on how the 787 could catapult Boeing past archrival Airbus for the foreseeable future. More...Watch: Boeing's 'Dreamliner'\n• Yahoo's Terry Semel Steps Down As CEO• Former Enron Broadband Exec Sentenced• Dubai Company Buys QE2 Ocean Liner • More StoriesEntertainmentParis' Prosecutor Apologizes For Accident\nLos Angeles City Attorney Rocky Delgadillo's wife crashed his city-issued vehicle while driving on a suspended license in\n                        2004. More...\n• Tiger Woods And Wife Have A Girl• Danza To Play \"The Producers\" In Vegas• Michael Jackson Settles $48M Lawsuit\n                     \t\t\t\t\t| Watch• More StoriesOpinionFatah's Fall\nThe New Republic says that with the rise of Hamas in Gaza, the Bush administration must alter its tactics and make\n                        a more concerted effort for peace in the Middle East.  More...Watch: Escaping Hamas-Ruled Gaza\n• Lieberman Takes Heat For Iran Warnings\n                     \t\t\t\t\t| Watch• Andy's Personality Quiz\n                     \t\t\t\t\t| Watch• Maybe There Should Be A Third Party\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Jess Cagle: When Weddings Get Crazy\nSome couples are spicing up their wedding day with some of their own personal flair. People magazine features memorable marriage\n                        moments in a special issue called Real Life Weddings, which is now on the stands.  More...Watch: People's Crazy Weddings\n• EARLY SHOW: New Web Site Rates Hundreds Of Sunscreens\n                     \t\t\t\t\t| Watch• EARLY SHOW: Preparing Seafood Beyond \"The Big Three\"• EARLY SHOW: Tips For Rookie Home Buyers In Down Market\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nGuinness Certifies Oldest ManCBS News RAW: Japan's Tomoji Tanabe, 111, was certified as the world's oldest man by The Guinness Book of World Records.\n                                    He attributed his longevity in part to avoiding alcohol and smoking.\nTOP VIDEOS\nIraq's Hidden Shame\nNotebook: Jimmy Carter\nFirst-Time Home Buying Tips\nAggressive Bear Killed In Utah\n'Bridge To Terabithia' On DVD\nPeople's Crazy Weddings\nFlaring Up Fish Recipes\nSunscreens Ranked & Rated\nFirefighters On Flood Rescue \n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesMorley Safer talks to long-driving, hard-drinking golfer John Daly. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMurder On Lockhart Road:A mother and two kids are murdered. There are bizarre clues, eyewitnesses, blood drops,\n                           and a killer with a foot fetish. Saturday, 9 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}