{"category": "ham", "to_address": "Jeni Zundel <jenizundel@mac.com>, Perl Beginners <beginners@perl.org>", "from_address": "Nigel Peck <nigel@miswebdesign.com>", "subject": "Re: Diff on a database structure", "body": "\nHi Jen,\n\nThanks for your suggestion, I don't have a master build script, I do it \nbe hand through phpMyAdmin and then use the backup feature of that if I \nwant to move it.\n\nI'm really looking for something that I can say to: \"compare this \ndatabase with this one and tell me what the differences are\" and it can \ngive me something like:\n\ntable.column has type VARCHAR(255) in DB1 but type TEXT in DB2\ntable.column is indexed in DB1 but not in DB2\ntable.column_2 does not exist in DB2\ntable_2 does not exist in DB2\n\nAnd also possibly a machine readable output format so I can process \nmaking DB2 the same as DB1 automatically, although I think I may prefer \nto still make the change manually. Not sure of details yet but need \noptions first :)\n\nObviously I may end up writing some or all of it myself but it seems \nlike something someone else has probably done and it would save me time \nif it's out there somewhere or at least a starting point such as the \ndiff analysis.\n\nCheers,\nNigel\n\nJeni Zundel wrote:\n> Nigel - \n> \n> Do you have a master build script for building the db structures?\n> \n> We used to do this at a software company I worked at; where we had to do reasonably frequent builds and changes to the db structure, so we needed a build process to be fairly streamlined:\n> \n> We would have separate create scripts for our db objects - like tables, triggers (rarely used, but still), indices, tablespaces, etc.; then, we would have a master script that would invoke each of the object scripts.  \n> \n> If you had it set up like this, you could probably run a fairly quick diff on your object scripts using a glob with perl to find your diffs.  If you set it up to have a directory structure to sort scripts by db object type (c:/tables, c:/tablespaces, c:/ views, etc.) then you can diff by subdir & only run what you need to rebuild for an update.  \n> \n> I don't know if this helps or if this was already obvious to you.\n> \n> Thanks,\n> Jen\n>  \n> On Monday, May 07, 2007, at 09:14AM, \"Nigel Peck\"  wrote:\n>> Hi,\n>>\n>> When I'm developing web applications I have a dev version of the \n>> scripts, modules and database and a live version. Nothing new there.\n>>\n>> I'm trying to automate the process of moving the dev site to the live \n>> site (the dev sites are on a Fedora server on my desk and the live sites \n>> on a Redhat server in a data centre 200 miles away).\n>>\n>> I've written scripts to copy the scripts and modules (and other \n>> associated files) to my local machine and ftp them to the live server \n>> and these work fine.\n>>\n>> However the final stage is to be able to bring the database structures \n>> into sync. Currently I keep a list of all the fields/tables/changes I've \n>> made and do this manually. I also check the table strcutres by hand to \n>> be sure I didn't miss anything.\n>>\n>> I'd like to find a way of comparing the two MySQL database strcutures \n>> and getting a list of the differences, anyone know of any \n>> modules/methods for doing this?\n>>\n>> Thanks in advance,\n>>\n>> Nigel\n>>\n>> --\n>> MIS Web Design\n>> http://www.miswebdesign.com/\n>>\n>> MIS Web Design Limited is registered in England and Wales with company \n>> number 04561623. Our VAT Registration Number is 803-939-126.\n>>\n>>\n>> -- \n>> To unsubscribe, e-mail: beginners-unsubscribe@perl.org\n>> For additional commands, e-mail: beginners-help@perl.org\n>> http://learn.perl.org/\n>>\n>>\n>>\n>>\n> \n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}