{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"Health Week\" <mailings@mail.cnn.com>", "subject": "This Week in Health", "body": "\n\n\n\n\nCNN.com - Health Week\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFriday, May 25, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Diabetes drug Avandia linked to heart risks\nA widely used diabetes pill raises the risk of heart attacks and possibly death, according to a scientific analysis that reveals what some experts are calling another Vioxx-like example of the government failing to protect the public from an unsafe drug.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudy: Smoking forbidden in most U.S. homes\nSmoking is forbidden in nearly three out of four U.S. households, a dramatic increase from the 43 percent of homes that prohibited smoking a decade ago, the government reports.\nFULL STORY\n\n\n\n\n\n\nFDA OKs birth-control pill that ends periods \nThe first birth-control pill meant to put a stop to women's monthly periods indefinitely won federal approval Tuesday. Called Lybrel, it's the first such pill to receive approval for continuous use.\nFULL STORY\n\n\n\n\n\n\nWeight-loss drug pitch stresses diet, exercise\nYou will not lose weight in your sleep or shed pounds  while eating anything you want -- that's the sobering message from the maker of a weight loss pill poised to hit shelves next month.\nFULL STORY\n\n\n\n\n\n\nVitamin use may be linked to advanced prostate cancer\nA new study suggests high-dose multivitamins may harm the prostate, the latest among confusing reports on whether vitamins really help a variety of conditions or are harmful.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Health Week email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}