{"category": "ham", "to_address": "\"Tom Schenk Jr.\" <tomschenkjr@gmail.com>", "from_address": "Duncan Murdoch <murdoch@stats.uwo.ca>", "subject": "Re: [R] Sweave and size10.clo", "body": "On 06/05/2007 2:23 AM, Tom Schenk Jr. wrote:\n> Using Sweave on Windows (MikTeX 2.5 and R 2.4.1), I've ran into a bit of a\n> problem with the tex -> DVI process.\n> \n> First, I've corrected the common \\usepackage error by using\n> \\usepackage{\"C:/Program Files/R/R-2.4.1/share/texmf/Sweave\"} to get around\n> the spacing problem. That is, LaTeX is finding the Sweave.sty, which has\n> been a common problem in past postings here.\n> \n> However, my problem comes with running the latex command. The output is\n> shown below:\n> \n> This is pdfeTeX, Version 3.141592-1.30.6-2.2 (MiKTeX 2.5)\n> entering extended mode\n> (test.tex\n> LaTeX2e <2005/12/01>\n> Babel  and hyphenation patterns for english, dumylang, nohyphenation,\n> ge\n> rman, ngerman, french, loaded.\n> (\"C:\\Program Files\\MiKTeX 2.5\\tex\\latex\\base\\article.cls\"\n> Document Class: article 2005/09/16 v1.4f Standard LaTeX document class\n> (\"C:\\Program Files\\MiKTeX 2.5\\tex\\latex\\base\\size10.clo\"))latex: Windows API\n> err\n> or 123: The filename, directory name, or volume label syntax is incorrect.\n> \n> The problem seems to be the size10.clo file and is only a problem for me\n> with the use of Sweave.sty. Any ideas?\n\nAre you sure that's the problem?  You have two closing parens after that \nfile is listed; I think that succeeded, and the error happened afterwards.\n\nI'd be suspicious of the Sweave \\usepackage line.  Perhaps MiKTeX now \nrequires backslashes instead of forward slashes, or maybe the quotes are \ncausing problems.   (Your \\usepackage line worked fine here, but I'm \nusing MikTeX 2.4.  MikTeX has a habit of making incompatible changes.)\n\nDuncan Murdoch\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}