{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTHURSDAY 3 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER SIMON ENRIGHT\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nLOCAL ELECTION SPECIAL\n\n\nIt's been called \"Super\" Thursday - with voting in England, Wales and Scotland - so tonight we devote the programme to an extended UK election special. \n\n\nDavid Grossman is travelling from north Wales to the central belt of Scotland, via the north west of England, to gauge reaction from voters. Jeremy Vine will be outlining the results of a specially commissioned Newsnight opinion poll from his virtual reality studio. Gavin Esler is at Alex Salmond's count in Aberdeen. Will Mr Salmond be Scotland's new first minister? \n\n\nOne man who already holds that title for Northern Ireland is Ian Paisley - he'll be telling us just how he expects to get on with his Sinn Fein deputy first minister. \n\n\nAnd it will all be hosted by Jeremy Paxman.  He'll be quizzing the politicians from the BBC Election studio - or that is where he'll start the programme.  He'll finish in another studio entirely.  It's worth watching just to see if he makes it - or whether for the first time ever, Jeremy \"empty chairs\" himself delayed, in a BBC corridor.  \n\n\nYou really can't miss this one.\n\n\nSimon\n\n\n\n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nFRENCH CULTURE\n\n\t\t\t\t\t\t\tIs it time for the French to be more self-critical?\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}