{"category": "ham", "to_address": "R-help@stat.math.ethz.ch", "from_address": "\"Alan Gibson\" <alan.gibson@gmail.com>", "subject": "Re: [R] Percentage area of a distribution", "body": "let me amend my previous message to remove a silly mistake:\n\nI have a (non-normal) distribution S that is a mixture of two normal\ndistributions C and C-bar. I need to find the percentage of the area\nof S that both C and C-bar occupy.\n\nThanks again,\nAlan Gibson\n\nOn 5/1/07, Leeds, Mark (IED)  wrote:\n> What do you mean by a normal distribution made up of to normal\n> distributions ? A mixture of two\n> Normals with different variances doesn't result in a normal distribution\n> so I'm not sure what you\n> Nean but maybe someone else does. No offense intended but, if noone\n> replies,\n> That means that noone else understood either.\n>\n>\n> -----Original Message-----\n> From: r-help-bounces@stat.math.ethz.ch\n> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Alan Gibson\n> Sent: Tuesday, May 01, 2007 8:02 PM\n> To: R-help@stat.math.ethz.ch\n> Subject: [R] Percentage area of a distribution\n>\n> It seems like this should be pretty straight forward, but for some\n> reason the answer escapes me.\n>\n> I have a normal distribution S made up of two normal distributions C and\n> C-bar. I need to find the percentage of the area of S that both C and\n> C-bar occupy.\n>\n> Any suggestions?\n>\n> Thanks in advance,\n> Alan Gibson\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide\n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n> --------------------------------------------------------\n>\n> This is not an offer (or solicitation of an offer) to buy/sell the securities/instruments mentioned or an official confirmation.  Morgan Stanley may deal as principal in or own or act as market maker for securities/instruments mentioned or may advise the issuers.  This is not research and is not from MS Research but it may refer to a research analyst/research report.  Unless indicated, these views are the author's and may differ from those of Morgan Stanley research or others in the Firm.  We do not represent this is accurate or complete and we may not update this.  Past performance is not indicative of future returns.  For additional information, research reports and important disclosures, contact me or see https://secure.ms.com/servlet/cls.  You should not use e-mail to request, authorize or effect the purchase or sale of any security or instrument, to send transfer instructions, or to effect any other transactions.  We cannot guarantee that any such requests received vi!\n a e-mail will be processed in a timely manner.  This communication is solely for the addressee(s) and may contain confidential information.  We do not waive confidentiality by mistransmission.  Contact me if you do not wish to receive these communications.  In the UK, this communication is directed in the UK to those persons who are market counterparties or intermediate customers (as defined in the UK Financial Services Authority's rules).\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}