{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "Showbiz Tonight <showbiz@mail.cnn.com>", "subject": "TONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT", "body": "\n\n\nCNN.com - Showbiz Tonight\n\n\n\n\n\n\n\n\n\n\nTONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT\n\nPARIS HILTON IS IN JAIL!\nParis Hilton is\nbehind bars, after getting an early start on her 23-day\nsentence for violating her probation. She says she's trying to\nbe strong, but will the experience actually change her? That's\ntonight on TV's most provocative entertainment news show.\n\nPARIS HILTON: THE PROVOCATIVE QUESTIONS\nHow will\nParis adjust to life in jail? What will life be like for her\nbehind bars? Will it change her? Is she getting special\ntreatment? Will Paris profit from her time in jail? And why is\nshe still a role model? Showbiz Tonight has all the bases\ncovered in a Showbiz Special Report: Paris in jail!\n\nLINDSAY LOHAN -- OUTRAGEOUS PHOTOS!\nLindsay is in rehab, but we're just now getting an idea of\nhow out-of-control the young starlet was! Absolutely\nunbelievable photos have surfaced of her playing with knives.\nPlus, is Lindsay's mom going to get her own tv show? The latest\non Lindsay, tonight!\n\nSHOWBIZ TONIGHT QUESTION OF\nTHE DAY:\nParis in jail: Do you think it will change\nher?\nVOTE AT CNN.COM/SHOWBIZ TONIGHT. \n\nSEND US\nA VIDEO EMAIL!\nSend your response to the Question Of\nThe Day on video. Look into your camera and tell us what you\nthink. Responses must be no longer than 30 seconds. To send\nyour video email, go to cnn.com/showbiztonight.Watch your video\nresponses on \"Showbiz Tonight\" at 11 p.m. ET/PT on CNN Headline\nPrime.\n\n\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the Showbiz Tonight list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=showbiz\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}