{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Raphael Dawkins\" <hoqdatendomizilmac@datendomizil.de>", "subject": "Check out the wonders of pound melting", "body": "\nJoin the Anatrim revolution\n\n\n\n\n\n\nAnatrim – The very up-to-date and most delighting lose flesh product available – As were told on ABC.\n\n\nDo you retain all the cases when you told yourself you would do anything for being rescued from this desperately growing pounds of fat? Happily, now no big sacrifice is expected. With Anatrim, the earth-shaking pound-melting blend, you can get healthier life style and a really slender figure. Have a look at what our customers write!\n\n\n\n\"I hate to admit it but I was an awful food addict. \n\n\nI swallowed up all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis fatal passion ceased after I started course with Anatrim! \n\n\nOh, God,\n\n\n\n\n my craving for food vanished, \n\n\nmood improved and I turned to the happiest person in the world 27 pounds in 2.3 months. \n\n\n\n\nSo, I can tell you now I became the happiest person!\"\n\n\n\n\n\nVictoria K., Boston\n\n\n\n\n\n\"Since the very childhood I was a weighty boy. \n\n\nIt’s pretty hard to imagine how I detested being mocked at school. \n\n\n\n\nI detested my weight and I abhorred even myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nThis stuff literally took me out of this terrible nightmare! Many thanks and a great respect to you, guys.\"\n\n\n\n\n\nCharley Mock, Las Vegas\n\n\n\n\n\n\"Do you know what? My marriage was saved thanks to Anatrim! I fell down into this circle, depression – eating more – more depression. My wife had thought to leave the overweight psycho I was turning in. \n\n\nOnce my friend showed me site and I called for Anatrim at the time. \n\n\nThe final result was great, my appetite came to admissible level, I was often in a good mood, and, be sure, I became able to tighten my belt on some holes. And you see, the bed became cool, too!\"\n\n\n\n\n\nRikky\n\n\n\n\n There is a great number of testimonial letters left by delighted people taking Anatrim. Don’t you wanna join the tens of thousands of slim customers and take this natural appetite-reducing energy lifting product now!\n\n\nDon’t decline your opportunity!\n\n\n\n\n"}