{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "robert weissman <rob@essential.org>", "subject": "[Ip-health] Ken Adelman's (New) Lies", "body": "1. Ken Adelman's (New) Lies\n2. USA for Innovation News Release: USA for Innovation Launches ThaiLies.com\n\nKen Adelman's (New) Lies\nBy Robert Weissman\nMay 7, 2007\nhttp://www.huffingtonpost.com/robert-weissman/ken-adelmans-new-lies_b_47864.html\n\nOne would think that an operation run by Ken Adelman -- infamous for\nproclaiming that U.S. forces would enjoy a \"cakewalk\" in Iraq* -- would,\nat least, be a little bit hesitant to label anyone a \"liar.\"\n\nBut that would suggest something resembling humility and a conscience.\n\nAmong other posts, Ken Adelman now runs something called USA for\nInnovation. This organization has launched a massive campaign against\nThailand, which has taken the noteworthy decision to prioritize public\nhealth concerns over multinational corporate interests, and authorize\ngeneric competition for several important drugs while they remain on patent.\n\nUSA for Innovation's latest release announces that it has created a\nwebsite, Thailies.com, \"to draw attention to the deceit in Thailand's\ndecision to steal American and European innovation.\"\n\nThe group says that \"today's lie\" is that Thailand is a poor country\nthat cannot afford Western medicines. To prove that Thailand is not so\npoor, the website cites economic data showing that the Thai economy is\nfast growing (which it is).\n\nWhat the website does not do is provide the single most relevant\nstatistic to determine the country's relative ability to pay the\nsky-high prices charged by brand-name drug monopolists: per capita income.\n\nAccording to the World Bank, Thailand's per capita income is $2,720\n-- roughly one-sixteenth U.S. per capita income.\n\nOne of the products for which Thailand issued a \"compulsory license\" --\nan authorization of generic competition for a product that remains on\npatent -- was Kaletra, an important combination HIV/AIDS drug made by\nthe Chicago drug giant Abbott Laboratories. Abbott's \"discount\" price\nfor Thailand before it issued its compulsory license: $2,200.\n\nThailand maintains a public health service that aims to provide\nuniversal access to needed medicines. But the government's healthcare\nbudget faces constraints, and it is unable to provide universal access\nto important medicines. The government has been very clear that the\nsavings it obtains from generic competition will be used exclusively to\nprovide greater coverage for the medicines it has compulsory licensed.\nThe government says just the initial price reductions for the HIV/AIDS\ndrug efavirenz (the patented version of which is marketed by Merck) will\nenable it to provide access to the drug to an additional 20,000 people;\nthe initial price reductions for the generic versions of the Abbott\nproduct Kaletra will enable the country to quadruple the number of\npeople receiving this lifesaving drug; and the price reduction for\nclopidogrel (sold by Sanofi-Aventis as Plavix) will enable Thailand to\nprovide it in the public sector. In sum, says the government, the\npurpose of its compulsory licenses is \"to increase access to patented\nessential drugs, rather than to save budget\" expenditures.\n\nWhy is Ken Adelman working so hard to denounce Thailand's public health\ninitiatives?\n\nAdelman says he serves as senior counselor at Edelman Public Relations\nWorldwide.\n\nAmong its largest clients, Edelman lists Abbott Laboratories and Merck.\nHalf of the fourteen companies Edelman lists as its largest clients are\ndrug makers. Besides Abbott and Merck, these are AstraZeneca, Johnson &\nJohnson, Novartis, Pfizer and Schering-Plough. (To see the firm's\nbrochure with the top client list, go to:\nhttp://www.edelman.com/about_us/welcome/ and click on \"corporate\nbrochure\" under the \"about us\" header.)\n\nThere are life-and-death stakes in the deception campaign run by\nAdelman, USA for Innovation and Big Pharma more generally. Through its\ncompulsory licensing program, Thailand is going to keep people alive who\nwould otherwise die, and avoid needless suffering. Adelman, Big Pharma,\net. al. would prefer that the country follow the norm, which is to\nchoose to let people die and suffer rather than offend multinational\ncorporate interests. Adelman and Big Pharma's top priority with their\npressure campaign is to send a message to other countries: Don't dare to\nfollow the Thai example.\n\nUnfortunately for Big Pharma, but fortunately for people in developing\ncountries and anyone who cares about global public health, Brazil on\nFriday announced it would follow Thailand in issuing a compulsory\nlicense on an important HIV/AIDS drug. Big Pharma's grip may be\nloosening -- which means there's every reason to expect stepped-up\nattacks from the industry and its allies.\n\n---\n\n* Among Adelman's other claims about Iraq:\n\n\"Hussein constitutes the number one threat against American security and\ncivilization\" (Ken Adelman, \"Cakewalk in Iraq,\" Washington Post,\nFebruary 13, 2002).\n\nAfter the anthrax scare in Washington, D.C.: \"I think the most likely\nsource of this is Iraq.\" He went on to say, \"But to tell you the truth,\nI don't think we have to show evidence beyond a reasonable doubt that\nIraq is behind a lot of the terrorism right now. Listen, this is not a\ncourt of law that we need this kind of evidence. It is war we're talking\nabout.\" (Fox News, October 25, 2001)\n\n-------------------------------------------\n\n\n\n\nUSA for Innovation Launches ThaiLies.com\n\nWebsite Highlights Deceit by Thailand's Minister of Health\n\nWASHINGTON, May 7 /PRNewswire-USNewswire/ -- ThaiLies.com\n(http://www.thailies.com/), a project of USA for Innovation, was\nunveiled today to draw attention to the deceit in Thailand's decision to\nsteal American and European innovation.  Each business day for two weeks\nfrom May 7 - May 18, ThaiLies.com will release additional information\nregarding one of the ten recent lies by the Health Minister Mongkol na\nSongkhla.\n\n   Today's Lie\n   Is Thailand a poor country that cannot afford Western medicines?\n\n\n\nIn fact, just the opposite is true.  Thailand has the 21st largest\neconomy in the world when measured by gross domestic product (GDP)\nderived from Purchasing Power Parity (PPP) calculations. According to\nthe CIA World Fact Book 2007, Thailand's economy is more productive than\nover 200 countries -- placing Thailand among the top ten percent of\nrichest countries in the world.\n\nEarlier this month USTR noted that Thailand continues to suffer from\n\"widespread commercial IPR counterfeiting and piracy.\"  The new Thai\nmilitary regime, which assumed power by coup last September, has now\nintroduced direct government theft of American innovation into the\nquickly deteriorating U.S.- Thailand relationship through its theft of\nthe intellectual property of three drugs produced by American and\nEuropean companies.\n\n   #1 of 10\n   Lie: Thailand is a poor country and cannot afford Western medicines.\n   Fact: Thailand Has One Of The Largest Economies In The World.\n\n\nThailand has the 21st largest economy in the world when measured by\ngross domestic product (GDP) derived from Purchasing Power Parity (PPP)\ncalculations. Many experts believe analyzing economic activity using PPP\nis the most accurate method because it allows comparisons in living\nstandards by taking into account the relative cost of living and the\ninflation rates of the countries. According to the CIA World Fact Book\n2007, Thailand's economy is more productive than over 200 countries --\nplacing Thailand among the top ten percent of richest countries in the\nworld.\n\n(CIA Fact Book, Accessed 5/3/07)\n\nFact: Thailand's Economy Is Growing Faster Than Over 100 Countries\nAcross The Globe.\n\nIn 2006, Thailand's economy grew at a 4.8 percent clip -- ahead of 106\nother countries around the world. Among the countries whose growth were\noutpaced by Thailand were the United States (3.4%), Switzerland (2.9%)\nand the United Kingdom (2.7%).\n\n   (CIA Fact Book, Accessed 5/3/07)\n\n   Fact: Thailand Has The 17th Lowest Unemployment Rate In The World.\n\n\nAccording to the CIA World Fact Book, in 2006 Thailand's unemployment\nrate was only 2.1 percent -- over half the rate of the United States\n(4.8%) and about one-third the unemployment rate in Canada (6.4%).\n\n(CIA Fact Book, Accessed 5/3/07)\n\nFact: Thailand's Exports Total Over $123 Billion -- Ahead Of Almost 200\nCountries In The World.\n\nIn 2006, it is estimated that Thailand exported $123.5 billion, ahead of\nAustralia ($117 billion) or India ($112 billion).\n\n(CIA Fact Book, Accessed 5/3/07)\n\nFact: Thailand's Industrial Production Is Growing At A Faster Rate Than\nThe European Union, Japan, And 100 Other Countries.\n\nIn 2006, Thailand's industrial output grew six percent -- double the\ngrowth of industrial production worldwide. Thailand's output was well\nahead of Japan's 3.2 percent growth and the European Union's 2.6 percent.\n\n   (CIA Fact Book, Accessed 5/3/07)\n\n   About USA for Innovation and ThaiLies.com\n\n\nUSA For Innovation is a non-profit organization dedicated to the\nprotection of intellectual property and continued innovation around the\nglobe. USA For Innovation educates decision makers, the media and\ngeneral public about threats to innovation. ThaiLies.com is a project of\nUSA for Innovation intended to expose the web of deceit by Thailand's\nHealth Ministry.  For additional information, please contact us at\n866-646-8668 or john@usaforinnovation.org.\n\nFirst Call Analyst:\nFCMN Contact:\n\n\nSource: USA for Innovation\n\n\nCONTACT:  USA for Innovation, +1-866-646-8668, john@usaforinnovation.org\n\nWeb site:  http://www.thailies.com/\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}