{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Democratic leaders, Bush set to meet after Iraq veto", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMay  2, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nDemocratic leaders, Bush set to meet after Iraq veto\n\n\n\n\n\nPresident Bush's veto of a war-spending bill calling for the withdrawal of\nmost U.S. troops sparked a new round of finger-pointing and renewed talks\naimed at forging a compromise.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThousands of immigration marchers rally across U.S.\n\n\n\n\n\nDemonstrators descended on city centers across the country Tuesday to press\nCongress to give the estimated 12 million people in the United States\nillegally a path to citizenship.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nHigh fire risk seen for West, Southeast\n\n\n\n\n\nThe West and Southeast face an increased wildfire risk this year because of\nongoing drought and an expected hotter than average summer, the National\nInteragency Fire Center reported Tuesday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nReport: Command to open fire heard on Kent State tape\n\n\n\n\n\nA static-filled recording of war protesters yelling, followed by a voice and\ngunfire, was released Tuesday by a survivor of the Kent State University\nshooting who claims the tape proves a military order was given to fire on\ndemonstrators.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFather, relative charged in 10-year-old's scalding death\n\n\n\n\n\nA 10-year-old disabled girl severely burned by scalding bath water died after\ngoing more than a week without medical treatment, authorities said Tuesday.\nHer father and a female relative were charged in her death.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFDA: Contaminated feed could affect farms nationwide\n\n\n\n\n\nMore farms across the United States will likely be affected by animal feed\ntainted with recalled pet food, federal health officials said Tuesday, after\nan investigation of Indiana chicken farms found the contaminated feed in more\nthan three dozen facilities that raise poultry for human consumption.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTrapeze artist plunges to his death during show\n\n\n\n\n\nThe fatal plunge of a Mexican circus trapeze artist during a show packed with\nchildren is under investigation by the state's workplace safety division,\nofficials said Tuesday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nShadowy Iraq office accused of sectarian agenda\n\n\n\n\n\nIraq's prime minister has created an entity within his government that U.S.\nand Iraqi military officials say is being used as a smokescreen to hide an\nextreme Shiite agenda that is worsening the country's sectarian divide.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTurkey faces possible early polls\n\n\n\n\n\nTurkey turned its attention to the prospect of early elections on Wednesday\nafter Prime Minister Recep Tayyip Erdogan said he would seek national polls\nwithin two months to end a stand-off with the country's secular elite.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBritish sailors detained by Iran are back in Persian Gulf\n\n\n\n\n\nSeven of the 15 British Royal Navy personnel held captive by Iran are back in\nthe Persian Gulf searching for smugglers, Britain's military said Tuesday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTurkish presidential vote annulled\n\n\n\n\n\nTurkey's highest court halted a parliamentary vote Tuesday that looked certain\nto install an Islamist president.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nMurdoch's bold bid for the Journal\n\n\n\n\n\nNews Corp. has made an unsolicited $5 billion bid to buy Dow Jones & Co. - an\noffer that could prove tough for the Bancroft family that controls the\npublisher of The Wall Street Journal to turn down, industry analysts said\nTuesday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDow hits record again\n\n\n\n\n\nThe Dow industrials surged to an all-time high Thursday, ending at a new\nrecord for the fourth time in the last five sessions as stocks found some\nmomentum at the end of a choppy day on Wall Street.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nRangers beat Sabres 2-1 again, tie series\n\n\n\n\n\nNEW YORK (AP) -- This no-goal got the New York Rangers even with the Buffalo\nSabres in more ways than one.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPeter King: Catch of a Lifetime?\n\n\n\n\n\n\"I've got to be the Godfather today,\" Lions president Matt Millen said last\nSaturday morning, sitting in the living room of his town house in the Detroit\nsuburb of Dearborn. He sounded full of hope and anticipation. In an hour\nMillen, a man who badly needed a good day, expected to be fielding calls from\nthree or four clubs and hoped -- in a role reversal for Don Corleone -- that\nsomeone would make him an offer he couldn't refuse in exchange for the No. 2\npick in the NFL draft. \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nWhat your child's doctor wishes you knew \n\n\n\n\n\nAt the end of every appointment with a patient, I usually feel one of two\nways: \"Wow! We really accomplished a lot in 15 minutes.\" Or: \"Wow. Where did\nit all go wrong?\" \n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHeart attack death rate in hospitals cut in half in 6 years\n\n\n\n\n\nIn just six years, death rates and heart failure in hospitalized heart attack\npatients have fallen sharply, most likely because of better treatment, the\nlargest international study of its kind suggests.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nSome HDTVs wearing old-fashioned rabbit ears\n\n\n\n\n\nBuying an antenna for a high-definition television seems as out of place as\nusing a rotary phone to make a call.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGoogle expands personalization with iGoogle\n\n\n\n\n\nGoogle Inc. is stepping up efforts to allow its users to personalize how they\nsearch the Web, moving beyond the one-size-fits-all approach to search it\nalready offers.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nWould-be sleepers take on summer blockbusters\n\n\n\n\n\nSequels to \"Shrek,\" \"Spider-Man\" and \"Pirates of the Caribbean\" aren't the\nonly movies coming out this summer. It only seems that way. Beneath the\nHollywood's behemoth franchise flicks, a few less-heralded gems sneak in to\nbecome niche hits and sometimes $100 million smashes.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTom Poston, TV's clueless everyman, dead at 85\n\n\n\n\n\nTom Poston, the tall, pasty-faced comic who found fame and fortune playing a\nclueless everyman on such hit television shows as \"Newhart\" and \"Mork and\nMindy,\" has died. He was 85.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}