{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nSome extraordinary events came out of the G-8 Summit\n  today. Russian President Vladimir Putin proposed a radical alternative to\n  President Bush’s plan to install new missile systems in Europe. The missiles are a sore point for the Russians,\n  but surprisingly, President Bush called the idea \"interesting.\"\n  Also, German chancellor Angela Merkel hailed a global warming plan she and\n  the other leaders agreed upon as a \"huge success.\" The goal is to\n  cut greenhouse gases in half by 2050. But will the plan actually hold\n  countries accountable? Jim Axelrod will have the story. \n \nMeanwhile, our chief foreign correspondent Lara\n  Logan is in Baghdad.\n  She'll have a look at U.S.\n  efforts to suppress violence in the Shiite stronghold of Sadr City.\n  This comes as its influential leader Muqtada al Sadr spoke to an Iraqi state\n  television station just two weeks after he showed up in public to condemn the\n  U.S.\n  presence.\n \nAlso, David Martin will tell us about the\n  discouraging new progress report on Iraq that emerged during\n  confirmation hearings for President Bush’s pick for war czar. \n \nIn health news, new stem-cell research is making\n  waves. Could the discovery that scientists reported this week be enough to\n  break the political logjam over the issue? Dr. Jon LaPook will take a look.\n \nFinally, our Richard Schlesinger met some old\n  friends down in Kentucky.\n  Two of them are named Sunshine Forever and Swan's Way and they're unlike any\n  other retirees you've ever met.\n \nI hope you'll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}