{"category": "ham", "to_address": "\"'Prof Brian Ripley'\" <ripley@stats.ox.ac.uk>", "from_address": "\"John Fox\" <jfox@mcmaster.ca>", "subject": "Re: [R] Windows Vista issues", "body": "Dear Brian,\n\nI don't yet have a Vista machine, but it occurs to me that some of these\nproblems might be avoided if R installed by default into c:\\R rather than\nc:\\Program Files\\R. Is that the case?\n\nThank you, by the way, for pursuing these issues.\n\nJohn\n\n--------------------------------\nJohn Fox\nDepartment of Sociology\nMcMaster University\nHamilton, Ontario\nCanada L8S 4M4\n905-525-9140x23604\nhttp://socserv.mcmaster.ca/jfox \n-------------------------------- \n\n> -----Original Message-----\n> From: r-help-bounces@stat.math.ethz.ch \n> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Prof \n> Brian Ripley\n> Sent: Saturday, April 14, 2007 1:57 AM\n> To: R-help@R-project.org\n> Subject: [R] Windows Vista issues\n> \n> It seemed FUD [*] has been prevailing here and elsewhere on \n> Vista security features.\n> \n> I asked our sysadmins to set up a Vista box for me on which I \n> have access to all levels of accounts.  Many of the issues I \n> found were covered by earlier answers and all in the upcoming \n> rw-FAQ (currently available at \n> http://www.stats.ox.ac.uk/pub/R/rw-FAQ.html and in the 2.5.0 \n> pre-releases) but a quick reprise may help.\n> \n> Most of my testing was of 2.5.0 beta, but I did some quick \n> tests of 2.4.1.\n> \n> \n> 1) The R installer and uninstaller are from an 'unidentified \n> publisher' \n> and you may have to agree that you trust them.  This is a \n> problem of the Inno Setup installer kit we use.  An \n> ultra-cautious sysadmin could configure Vista to stop you \n> installing via such a program.\n> \n> \n> 2) Permission problems:\n> \n> If you install R as an ordinary user (into your own file \n> space) you should see no permissions problems.  (There would \n> have been problems, including under XP, with some recent \n> daily binary builds as the installer kit had changed one of \n> its defaults to disallow non-administrator installs, but \n> these have been fixed.)\n> \n> I also encountered no problems installing R under the \n> Administrator account (normally hidden) and installing \n> packages under the same account.\n> \n> Things are more complicated if you use an account which is in \n> the local administrator group (but is not Administrator \n> itself).  Such accounts are no longer (by default) equivalent \n> to Administrator, and run programs as ordinary user accounts. \n> They need to 'Run as Administrator' to do things in the \n> system area such as C:\\Program Files.  You will be asked if \n> you want to run as administrator if you try to install \n> software such as R, but you will not be asked if you try to \n> install packages in the main R library (since asking is \n> something that applies to a program, not part of a particular \n> session).  One simple solution is to elevate your credentials \n> when running an R session to install packages in the same way \n> that you needed to when installing R.  (Unix and MacOS X \n> users will recognize a somewhat automated reincarnation of 'sudo'.)\n> \n> It looks like the best practice will be to change the (full) \n> ownership of the R installation to the account used to \n> install it, something which would be standard practice in the \n> Unix world.  Also, we are encouraging people as from 2.5.0 to \n> install packages into a site or personal library where these \n> permission issues should not arise (except when updating \n> recommended packages).\n> \n> \n> 3) The most worrying problem is that Vista is reporting quite \n> incorrectly file permissions through the POSIX interfaces \n> used by file.info() and file.access(), and furthermore \n> allowed me as a standard user to create directories in areas \n> over which it says I do not have write permission. We will \n> look further into possible solutions, but it seems the Win32 \n> API functions are giving the same answers.\n> \n> Problems with 'access' (the C call underlying file.access()) \n> mean that the MinGW compilers do not currently run on Vista \n> without a lot of hoop-jumping.\n> \n> \n> [*] http://en.wikipedia.org/wiki/Fear,_uncertainty_and_doubt\n> \n> -- \n> Brian D. Ripley,                  ripley@stats.ox.ac.uk\n> Professor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\n> University of Oxford,             Tel:  +44 1865 272861 (self)\n> 1 South Parks Road,                     +44 1865 272866 (PA)\n> Oxford OX1 3TG, UK                Fax:  +44 1865 272595\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide \n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}