{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Ezra Terrell\" <coseuromaccviw@euromacc.pl>", "subject": "Losing weight has never been so easy", "body": "\nDoctors and Celebrities endorse Anatrim\n\n\n\n\n\n\nAnatrim – The very up-to-date and most exciting product for weighty people is now easily available – As seen on Oprah.\n\n\nCan you recall all the cases when you said to yourself you would do any thing for being rescued from this fastly growing pounds of fat? Happily, now no major offering is expected. With Anatrim, the ground-shaking kilos-melting medley, you can achieve naturally health lifestyle and become really thinner. Just look at what people write!\n\n\n\n\"It’s unbearably difficult to admit it but I was a junk food addict. \n\n\nI greedily ate all this garbige \n\n\nand could not stop. \n\n\n\n\nThis torment ceased when I started course of taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my appetite abated, \n\n\nmood improved and I became the happiest person 21 pounds in 2.1 months. \n\n\n\n\nSo, I can tell you now I became the happiest person in the world!\"\n\n\n\n\n\nSilvia D., Boston\n\n\n\n\n\n\"I had weight problems since I was a boy. \n\n\nIt’s pretty hard to imagine how I hated being derided at school. \n\n\n\n\nI hated my weight and I hated even myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nIt literally took me out of this fearful nightmare! Lots of thanks to you, fellows.\"\n\n\n\n\n\nCharley Mock, Bellevue WA\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was happily saved! I fell down into the circle, depression – eating more – more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce my friend showed me web page and I ordered up Anatrim at the same time. \n\n\nThe results were excellent, my appetite became normal, I was in a good mood oftener, and, certainly, I tightened my belt with no regrets. And the sex became fantastic, too!\"\n\n\n\n\n\nMichael\n\n\n\n\n There many and many testimonials left by delighted people taking Anatrim. Don’t you wanna add yourself to the tens of thousands of slender customers and try this natural appetite reducing power boosting product now!\n\n\nDo not decline the chance!\n\n\n\n\n"}