{"category": "spam", "to_address": null, "from_address": "postmaster@kjhjhihikkhhkkh.nl", "subject": "THE COCA COLA COMPANY / CHELSEA OFFICIAL PRIZE NOTIFICATION !!!", "body": "THE COCA COLA COMPANY AND CHELSEA FOOTBALL CLUB\nPROMOTION/PRIZE AWARD DEPARTMENT\nCOCA COLA AVENUE,STAMFORD BRIDGE        \nLONDON. SW1V 3DW  \nUNITED KINGDOM                                                         \nPROMOTION / PRIZE AWARD DEPARTMENT         \n\n\n\n               THE COCA COLA COMPANY / CHELSEA OFFICIAL PRIZE \nNOTIFICATION !!! \n\n         We Are Please to inform you of the release of email balloting \nheld on the 3st MARCH 2007, by Coca Cola and Chelsea Football Club In \ntheir Recent Lottery Promotion That Was Held In Respect on it's 100 \nYears anniversary As we will want you to Note that This Lottery is The \nfirst time ever That the Management of COCA COLA COMPANY WILL COME IN \nCONJUNTION WITH CHELSEA FOOTBALL CLUB To decide And celebrate This 100 \nYears anniversary by awarding $300,000 (THREE HUNDRED THOUSAND POUND \nSTERLING) each to 30 lucky winners who were selected through a \ncomputer ballot system drawn from only Microsoft users from over \n30,000.00 companies and 5,000,000 individual email addresses and names \nfrom all over the world. Including Users Of Western Union Money \nTransfer and Money Gram Transfer \n\n     However this Two Company has been good at celebrating special \nanniversaries. The year 2001 saw The Biggest Anniversary and Lottery \naward By the Coca Cola Company Saw them reach the major milestone of \n95 years-old. What better way was there to mark the centenary than by \nbecoming the Best Soft Drink Makers In the World as they were Giving \nThat Award As Chelsea Became the champions of England for the second \ntime in their Existence That Same Year 2001 As Coca Cola Is One of the \nMajor Sponsor to Chelsea Football Club As this Golden jubilee had been \nsimilarly honored. \n\n   The Two Company and Club side have won Golden Award in the 1960s, \nthe 70s, the 90s and at the turn of the new millennium, but 1955 was \nthe year when Chelsea finished above all other teams in the League for \nthe first time. It was also Chelsea earliest major trophy. The first \nfive decades had seen the club develope into an integral part of \nsporting life in England capital city with famous players and a large, \noften full stadium. Chelsea were popular, but achievement fell a long \nway short of that now enjoyed by Joss Moorish Team Manager team that \nbegan the second 100 years of Chelsea history as the best in the land \nand the biggest football story throughout the world\n\n  However, the results were released on 28st DECEMBER, 2006 and your \nemail was among the 20 Lucky winners who won $300,000 each on the 100 \nanniversary of the COCA COLA COMPANY AND CHELSEA FOOTBALL CLUB, and \nyour email was attached to ticket number RR38844240 and ballot number \n00147\n\n   In other to claim your $300,000 Prize winning, which has been \ndeposited in a designated bank. However, you will have to fill the \nform below and send it to the Promotion manager of Promotion Lottery \nAward for verification and then you will be directed to the bank where \na cheque Or Cash will Be Giving to you After Proper Arrangement For \nthe $300,000.As It Has already been deposited in your favor As One of \nthe Lucky Winner Among 30 Winner\n\n This is part of our precautionary measure to avoid double claiming \nand unwarranted abuse of this program. Please be warned.\nEndeavour to email/fax him your full names, email address, telephone \nand fax numbers immediately As You are to Contact the Promotional \nAgent Mr Williams Miller With Details Below for Process of your Claims \nAs he will assist you In all Process to you will get the $300,000 \nPounds \n\nName: Mr. WILLIAMS MILLER\nTel +44 703  194  6171\n      +44 702  406 2476\nFax:+44 870 478 8219\nE-mail:   uknational_lott8@yahoo.co.uk\n \n    FILL OUT THE WINNERS VERIFICATION FORM BELOW: And send them Over \nVia Email Or Fax to Mr Williams Miller as He will Look Into Your \napplication for the claim of lottery winning prize will be duly \nprocessed and settlement made upon certification he will send you the \ndetails to Proceed Hence, carefully fill in the appropriate \ninformation in the space provided below for record purposes to \nfacilitate our immediate commencement of your claims process. Please \nyou are advised to complete the form and send it immediately to our \nPromotion manager through email for prompt collection. \n\n*Name of Beneficiary:-------------------\n*Address:------------------------------\n*City/State:----------------------------\n*Nationality:---------------------------\n*Country Of Residence:-------------------\n*Sex:----------------------------------\n*Email Address: -------------------------\n*Tel: ----------------------------------\n*Fax:----------------------------------\n*Occupation:----------------------------\n*Next of Kin:---------------------------\n*Age: --------------------------------\n*AMOUNT WON:-----------------------\n*In Figures: -----------------------------\n\nGood luck and congratulations from Coca Cola Company and members And \nstaff Of Chelsea Fc\nAny breach of confidentiality on the part of the winners will result \nto disqualification. You are to keep all lotto information away from \nthe general public especially your ticket number and ballot number. \n(This is important as a case of double claims will not be \nentertained). \n*Staff of Coca-Cola Company And Chelsea Football Club are not to \npartake in this Lottery Even if their Email Has been selected .\n\n\nYours faithfully,\nMs. Cynthia Parker/ Information Officer \n \n\n"}