{"category": "spam", "to_address": "<the00@plg.uwaterloo.ca>", "from_address": "\"Henson\" <fiu@planet.nl>", "subject": "Skype is strikt genomen geen VoIP omdat het op het openbare internet een eigen gesloten protocol gebruikt voor haar communicatiediensten.", "body": "\n\n\n\n\n\n\n\nn komen ze nooit alleen, dus er zal vast wel iemand \nzijn met hetzelfde idee.\nVorig jaar werden telefoontjes daar na ? Vorig jaar \nwerden telefoontjes daar na ? Klanten willen vooral goed worden geholpen? Het is \ngoed mogelijk dat orders tijdens de zomerperiode minder zijn. Na telefonisch \ncontact, dat door 66 procent van de respondenten als eerste genoemd wordt, is e-mail \nhet populairst (25 procent).\nVooral in de zorgsector zullen de banen toenemen, \nbijvoorbeeld bij thuiszorg-organisaties en huisartsenposten. Aanbieders van VoIP \nvoor bedrijven zijn er van klein tot groot.\nEen van hen had een eigen internetbelbedrijf en \nloodste zijn klanten op een sluwe manier over het netwerk van \nNet2Phone.\nVervolgens kunnen succesvolle doorverwijzingen \nworden beloond door het bedrijf. Het netwerk moet dus zo ingericht worden dat spraak \naltijd voorrang krijgt boven zaken als e-mail en het verzenden van \nprintopdrachten.\nVanwege schaalvoordelen (voor alle vestigingen nog \nmaar ?\nHet Japanse uitzendconcern People Staff verhuurt \nKitty-achtige robots aan ondernemers die bezuinigen op hun receptie.\nReputatieHet is niet verwonderlijk dat bedrijven \nnaast reputatieschade ook financi?\nMaar liefst 46 procent van de managers geeft aan \nreputatieschade op te lopen als hun bedrijf een dag niet over de telefoon kan \nbeschikken. Outsourcing naar landen met een andere taal dan die van de opdrachtgever \nblijkt vaak een probleem.\nEen programma als VoipBuster maakt wel gebruik van \neen gestandaardiseerd en openbaar protocol.\n, aldus Van Zonsbeek. Te warm om te werken? Het \nnieuwe bedrijf biedt een platform dat ? Onveranderd slecht is de bereikbaarheid van \nPackard Bell.\nDit is een geheel eigen pagina met logo, \nbedrijfsactiviteiten, nieuws etc. Ook als haast geboden is, vertrouwelijke \ninformatie gedeeld wordt, duidelijkheid gewenst is of als de ander overtuigd moet \nworden, is de telefoon het middel dat wordt ingezet.\nMaar liefst 46 procent van de managers geeft aan \nreputatieschade op te lopen als hun bedrijf een dag niet over de telefoon kan \nbeschikken.\nr inhoudelijke eisen gaan stellen aan de \ndienstverlening door bedrijven.\nEn via internet bellen naar het buitenland is leuk \nvoor consumenten maar 'minder geschikt voor ondernemers'. In de eerste plaats een \nnetwerk met voldoende capaciteit.\nMaar deze voordelen zijn vooralsnog geen reden voor \nveel bedrijven om over te stappen op BPO, getuige de 10 procent waar hierboven naar \nwerd verwezen. Nog belangrijker is dat de klant weet dat medewerkers of uzelf op \nvakantie zijn.\nHet snelst is KPN Nummerinformatie. Het onderzoek \ntoont aan dat zowel persoonlijk bezoek als telefonisch contact de voorkeur genieten \nvoor het maken van werkelijk contact. Een goed beveiligd netwerk met encryptie van \nde (spraak)data beperkt de kans op een geslaagde kraak \naanzienlijk.\n"}