{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Discover the Jackal\" <q8mee_2lp@maidtrousers.com>", "subject": "Millionaire =?UTF8?Q?=22?=Jackal=?UTF8?Q?=22?=Reveals Jealous Guarded Money Secrets ", "body": "He's coming out swinging The fur is a fly'n I've never seen ANYTHING like this EVER!There's a new 'Robin Hood' on the scene in the business world and his message is loud and clear His video's are getting pounded on You Tube and some of the BIG name advocates are raving about his Expose Well all I can say is there are going to be many of the \"gurus\",so-called experts, and Johnny-come-latelys who claim to be \"the best\" who are going to be downright spitting mad!Because those 2-3 videos are *TAME* compared to what this Jackal character has gone and done now!Just wait until you see the *full-length*video and expose report that's just come out now First it will *shock* you...\n\nhttp://launch.roirocket.com/z/17697/CD8114/0626-WM-27-Njbr-ROI-WAH\n\nthen it will probably make you very angry (because of the dirty tricks they've pulled on you for years then it might even make you laugh.(or cry)\nA bit because when you see the truth exposed, you realize just how ridiculous it's all become It's gotten out of hand!\n\nAll of us over hear are cheering this Jackal Dude(tte) on because he (or she) has pulled out all the stops  to EXPOSE the truth to us all.             \nBut it's not just huge \"bashing\" (which I appreciate because who wants to know how bad you're getting worked over without knowing the solution for how you can stop it, right?)...            \n\nThat's why, while the ride may start out bumpy, I think you're going to be very happy with where it drops you off at because I think it just may be THE answer you have been desperately searching for to finally break the evil cycle on.\n\nThat's why I suggest you get in on this while the getting is good.\n(who knows how long it will be around once the punches start being thrown).\n\nThe viral activity is going crazy.\n\nYou may have thought the Secret was huge, wait until you see this here's how you can get a leg up over every-one else:\n\nhttp://launch.roirocket.com/z/17697/CD8114/0626-WM-27-Njbr-ROI-WAH\n\ni just checked and it's still active so it should work for you if you jump on it right away.\n\nBest of success,-Larry KeeneP.S.  something in the Jackal's classified report (the one with the *FULL* uncut video at the top of it) really stood out for me!\nIt's the section that starts with\"Duck! Because Here it comes!\"\n         \nSo be sure you scroll down and check it out because I think it shatters all the\ndirty tricks they've been pulling on you!Hope you're ready...\n\nhttp://launch.roirocket.com/z/17697/CD8114/0626-WM-27-Njbr-ROI-WAH\n\n--------------------------------------------------------------------\nThis is an advertisement.\nIMMG LLC 3116 S. Mill Ste #119  Tempe, AZ.  85282\nFollow this link for removal:\n\nhttp://www.workathomemanifesto.com/b-bye.html\n-----------------------------------------------------------------\n\n\nHi Subscriber! You are receiving this solicitation because producttestpanel@speedy.uwaterloo.ca previously agreed to receive correspondence. If this service should fail to meet your expectations, feel free to disassociate yourself from our service.\nhttp://taxisboom.com/u/187a/producttestpanel%40speedy.uwaterloo.ca/2\n\nShould you want to contact us via the United States Postal Service, our address is as follows:\n96 Linwood Plaza Suite 132 Fort Lee, NJ 7024\n\n\n"}