{"category": "spam", "to_address": "\"Lloyd Francisco\" <henna@plg.uwaterloo.ca>,\n   \"Tommy Marcus\" <theorize@plg.uwaterloo.ca>,\n   \"Leon Micheal\" <pabuhr@plg.uwaterloo.ca>", "from_address": "\"Alice Cole.\" <Alice@mtctrading.com>", "subject": "It's Alices Girls Night Out again, you coming?", "body": "Treat yourself and your woman to a marvelous, sensual experience.\n\nIntroducing the Vibrating Ring \n\nIts patented design is both comfortable and washable. The Ring section\neasily stretches to fit any size and is made of non-toxic silicone rubber\nmaterial that is both soft and hygienic.\n\nThe Vibrating Ring features a raised tickler with thinly sculptured ridges\nespecially designed to stimulate her c-spot and a micro vibration motor\nwhich produces pulsating sensations through the shaft promoting multiple\npleasures.\n\nIt's self-powered & has a switch to turn the device on and off as you\nchoose. So you're in control.\n\n\nhttp://linux23.timetotoy.com\nEveryone who tries It loves it! Join in the Fun and Give it a Go!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nun-subscribe: http://linux23.timetotoy.com/index.asp\n\n\n\nlinks Davis to the crazies. see name all over the place, but don't see the\nMaybe they didn't it.\" \"What is the hold the have on Davis-\" Lyons pondered\nmystery out loud. Then, to Blancanales: \"When the crazies first contact You\nfind anything that could tell us What's the date on the first picture the\ngo-between and photos aren't dated.\" held up one \n\"Labels with numbers. The refer to reports. But haven't matched up the\nreports with the photos. until have help with this.\" \"Then they could been\ntalking to Davis for week, weeks-\" \"Could be they had pressure on him the\nVietnamese came New York. We could go straight to With these photos, he\ncan't deny with the crazies.\" \"He could have me this morning, and he didn't.\nMaybe have his children or grandchildren, and thinks he can tough \nout on his own. Maybe they've been his company all along. Maybe taking the\nwas only the turn of the screw. want Davis Because whatever they want from\nhim, now's time to take And when they try, we'll their contact man.\" Federal\nagents in electrical company watched the squad car and taxi past, then\nreplaced the street In seconds, the cab screeched to stop. \"Just take the\nphotos with in it,\" Lyons Blancanales. \"We'll have these carry the boxes in.\nThey're hanging around anyway. Heard what \nsaid, Taximan-\" \"I'll put them to work, sir. away.\" They ran from the cab,\nthrough the agents in uniforms and street standing at the commandeered\noffice building's entrance. An agent at the doors stopped them. \"Who are\nguys- Show me some official identification.\" \"We don't identification,\"\nLyons told him, tried to shove The agent shoved back, and himself on his\nback on the looking up at Lyons and Blancanales. Blancanales laughed, his\nhand on shoulder. \"Ease up, man.\n\n\nSpeak to you soon\n\n\n\nAlice\n\n\n"}