{"category": "ham", "to_address": "Andrew <ktwarwic@flax9.UWATERLOO.CA>", "from_address": "\"Organic Consumers Association\" <ronniecummins@organicconsumers.org>", "subject": "Organic Bytes: Sneak Attack Update, Ethanol Hoax, & Big Brother Ag", "body": "\n\nOrganic Bytes #112: Sneak Attack Update, Ethanol Hoax, & Big Brother Ag\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHello Andrew,\nORGANIC \n                          BYTES #112\n                          Health, Justice and Sustainability News Tidbits with \n                          an Edge!\n\n6/27/2007\n\nWritten \n                        and edited by Craig Minowa and Ronnie Cummins\n\nSafe \n                        Unsubscribe: \n                        http://organicconsumers.org/unsuborganicbytes.cfm \n                        \n                        You are subscribed as: ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n \n\n\n\n\n\n\n\nIN \n                        THIS ISSUE\n\nALERT: \n                          USDA IGNORES PUBLIC REJECTION OF PROPOOSAL TO ALLOW \n                          38 NON-ORGANIC INGREDIENTS & TOXIC FISH OIL IN FOODS \n                          LABELED AS \"USDA ORGANIC\"\nDIALING \n                          FOR ORGANIC DOLLARS\nQUICK \n                          FACTS OF THE WEEK: CORN-BASED ETHANOL ADDS TO \n                          GLOBAL FOOD CRISIS\nQUOTE \n                          OF THE WEEK:\nSOLUTION \n                          OF THE WEEK: FEED THE HUNGRY AT THE GAS PUMP\nNAIS \n                          ALERT: KEEP 'BIG BROTHER' OUT OF FARM BILL\nWEB \n                          VIDEO OF THE WEEK: SOIL IS ONE SECRET SOLUTION \n                          TO GLOBAL WARMING\nWEB \n                          FORUM: YOUR ONLINE ORGANIC COMMUNITY HAS ARRIVED\n\n\n\n\n\n\n\n\n\n___________________________________\n\n\n\n\n\n\n\nALERT:\n                USDA IGNORES PUBLIC REJECTION OF PROPOOSAL TO ALLOW 38 NON-ORGANIC \n                INGREDIENTS & TOXIC FISH OIL IN FOODS LABELED AS \"USDA \n                ORGANIC\"\nBasically \n                ignoring more than ten thousand emails and letters from consumers \n                and farmers opposing the latest industry-sponsored attack on organic \n                standards, the USDA has approved a proposal allowing 38 new non-organic \n                ingredients to be allowed in products bearing the \"USDA Organic\" \n                seal. But the agency says this may just be interim approval, and \n                has offered to extend the public comment period another 60 days \n                (the original public comment period was only 7 days). The USDA's \n                controversial proposal will result in the following:\n\nAnheuser \n                  Busch will be allowed to sell its \"Organic Wild Hops Beer\" \n                  without using any organic hops at all.\nSausages, \n                  brats, and breakfast links labeled as \"USDA Organic\" \n                  will be allowed to contain intestines from factory farmed animals \n                  raised on chemically grown feed, synthetic hormones, slaughterhouse \n                  waste, and antibiotics.\nProducts \n                  labeled as \"USDA Organic\" and containing fish oil \n                  may contain toxins such as PCBs and mercury.\n\n\nLearn \n                more and take action: http://www.organicconsumers.org/articles/article_5225.cfm\n\n\n\n\n\n___________________________________\n \n\n\n\n\nDIALING \n              FOR ORGANIC DOLLARS\n              Each year, Working Assets Long Distance (WALD) Company donates a \n              portion of its revenue to national non-profitsdoing front line work \n              on progressive issues, such as the Organic Consumers Association \n              (OCA), . If you are a current Working Assets customer, you can help \n              the OCA receive a portion of these funds by sending a quick online \n              letter, nominating the OCA for donations. Thanks! \nWALD customers vote for OCA here: http://www.workingassets.com/voting/\n\n\n\n___________________________________\n\n\n\n\n\nQUICK \n                FACTS OF THE WEEK:\n                CORN-BASED ETHANOL ADDS TO GLOBAL FOOD CRISIS\n\nIn \n                  the past 12 months, the global corn price has doubled. \nBecause \n                  corn is the most common animal feed, this affects the price \n                  of milk, cheese, eggs, meat, as well as corn-based sweeteners \n                  and cereals.\nIn \n                  the U.S., milk prices have nearly doubled.\nButter \n                  prices in Europe have spiked by 40%. \nPork \n                  prices in China are up 20%.\nIn \n                  Mexico there have been riots in response to a 60% rise in the \n                  cost of tortillas.\nIn \n                  six of the past seven years, global grain consumption has exceeded \n                  production. As a result world grain reserves have dwindled to \n                  57 days. This is the lowest level of grain reserves in 34 years.\nWhile \n                  the UN lists 34 countries as needing food aid, 30% of next year's \n                  grain harvest in the U.S. will be converted to ethanol to fuel \n                  cars.\n\n\n\n\n\n\n__________________________________\n \n \n\n\n\n\n\nQUOTE \n                OF THE WEEK:\n                \"The stage is now set for direct competition for grain between \n                the 800 million people who own automobiles, and the world's 2 \n                billion poorest people.\"\nLester \n                Brown from the Earth Policy Institute speaking at a briefing to \n                the US Senate two weeks ago. \n\n\n\n\n___________________________________\n\n\n\n\n\n\n                image parody\n\n\nSOLUTION \n                OF THE WEEK:\n                FEED THE HUNGRY AT THE GAS PUMP\n\nAutomakers \n                  roughly doubled the fuel economy of cars between the 1970s and \n                  the late 1980s. In other words, the \"know-how\" \n                  has been here for a long time.\nOver \n                  the past 20 years, automakers have used advancements in technology \n                  to add more than 800 pounds to the average vehicle and nearly \n                  double horsepower, while fuel economy has declined. Be smart \n                  about what you drive.\nThe \n                  grain required to fill a 25 gallon gas tank with ethanol would \n                  feed one person for a year. Every time you fill your tank, think \n                  about biking, walking, mass transit or just relaxing at home. \n                  Live simply so that others may live. \nNext \n                  year, 30% of U.S. corn will be used for ethanol. Instead, the \n                  same amount of fuel could be saved by increasing average fuel \n                  efficiency by just three miles per gallon. Let your Representatives \n                  and Senators \n                  know that you support strong fuel efficiency standards and a \n                  wholesale conversion of U.S. transportation, utilities, and \n                  agriculture to renewable sources of energy..Take part in OCA's \n                  Farm Bill alert below.\n\n\n\n\n\n__________________\n\n\n\n\n\nimage \n                parody\n\n\nALERT:THE \n                2007 FARM BILL\n                SUSTAINABLE AGRICULTURE OR CORPORATE WELFARE\n                Congress is currently drafting a new Farm Bill, legislation that \n                will determine agriculture policy for the next five years. Will \n                it be more corporate welfare for polluting agribusiness or new \n                incentives for farmers to provide healthy and affordable food \n                while protecting farmworkers and the environment? Unfortunately, \n                the bill that the House Agriculture Committee is working on is \n                looking a lot more like the former. \nPlease write Congress in support of sustainable \n                agriculture: http://www.organicconsumers.org/articles/article_5813.cfm\n\n\n\n\n\n___________________________________\n\n\n\n\n\nimage \n                parody\n\n\nNAIS \n                ALERT:\n                KEEP 'BIG BROTHER' OUT OF FARM BILL\n                Industrial agriculture lobbyists have been pushing for a National \n                Animal Identification System (NAIS) for several years. The proposed \n                NAIS program would require every person who owns a farm animal, \n                even if it's just one chicken or a pet horse, to register their \n                \"property\" with the federal government, identify each \n                animal (in most cases with implanted microchips or other electronic \n                identification), and report their movements on a national database. \n                This program would impose particularly heavy burdens on family \n                farmers who raise animals on pasture, while giving further competitive \n                advantage to factory farms. The House Committee on Agriculture \n                is considering a provision in the massive 2007 Farm Bill that \n                would implement NAIS. The House Committee on Agriculture will \n                vote on the bill July 12, so time is of the essence. \nLearn more and take action: http://www.organicconsumers.org/rd/nais.cfm\n\n\n\n\n\n__________________\n\n\n\n\nNONE \n                OF THIS WORK WOULD BE POSSIBLE \n                WITHOUT YOUR DONATIONS\n                We need your support today to help us continue our work to safeguard \n                organic standards and to promote fair trade, health, and sustainability. \n                Please donate now.\n\n\n\nhttp://www.organicconsumers.org/donations.htm\n\n\n\n\n\n\n_______________________________\n\n\n\n\n\nWEB \n                VIDEO OF THE WEEK: \n                SOIL IS ONE SECRET SOLUTION TO GLOBAL WARMING\n                Can organic farming fight climate change? Yes. And we're not just \n                talking about food miles. Research from the Rodale Institute shows \n                that sustainably-farmed soil absorbs 30% more carbon than conventional \n                agriculture, and switching our farmland to organic would cut greenhouse \n                emissions by 10% in the US (20% in Canada and most of the rest \n                of the world). For a concise explanation of how organic farming \n                could be a major tool in the fight against climate change check \n                out the 10 minute online video \"SOIL: The Secret Solution \n                to Global Warming,\" featuring Canadian farmer Percy Schmeiser. \n                The website includes an online petition calling on world leaders \n                to switch subsidies from conventional to sustainable farming practices.\nLearn more and watch: http://www.quantumshift.tv/v/1181028043/\n\n\n\n\n\n__________________\n\n\n\n\nWEB \n              FORUM:\n              YOUR ONLINE ORGANIC COMMUNITY HAS ARRIVED\n              Thanks to hundreds of you who responded to our invitation to join \n              OCA's new web forum. We have just added a new blog feature to the \n              forum, so feel free to go in and set up your own dedicated blogs. \n              The OCA website receives over six million hits each month, so we're \n              excited about the potential for discussion and networking this forum \n              can provide. Of course, a forum isn't any good without its users, \n              so even if you're a newbie and have never used a forum, please follow \n              this link and get involved. \nhttp://organicconsumers.org/forum/index.php\n\n\n\n\n___________________________________\n\n\n\n\nNONE \n                OF THIS WORK WOULD BE POSSIBLE \n                WITHOUT YOUR DONATIONS\n                We need your support today to help us continue our work to safeguard \n                organic standards and to promote fair trade, health, and sustainability. \n                Please donate now.\n\n\n\nhttp://www.organicconsumers.org/donations.htm\n\n\n\n\n\n\n________________________________\n******** support our \n        supporters*********\n\n\n\n\n\n\n\n\n\n\nCitizens \n                      of the nation: We are cows from Organic Valley, \n                      a farmer-owned cooperative of independent family farms. \n                      We live on the land, grazing abundant pastures, free from \n                      the influence of synthetic hormones, pesticides and corporate \n                      overlords. Our movement is strong. Our cause is just. And \n                      our milk is undeniably delicious.\nVisit \n                       www.organicvalley.coop \n                      to learn about our farmers in your region. Join Farm Friends \n                      to support our movement and receive an inspirational kit \n                      with coupons.\n\n\n\n-------------------------------\n\n\n\n\n\n\nGREAT \n                      ORGANIC WINES\n Savor \n                      delicious, award-winning wine varieties from Frey Vineyards \n                      - California’s oldest organic winery… Appreciate \n                      layers of vibrant flavors not masked by the added sulfites \n                      found in most other wines.\n\nLearn \n                      more about Frey’s special offer here!\n\n\n\n\n\n\n\n \n\n\n\n\nPlease \n                forward this publication to family and friends, place it on websites, \n                print it, duplicate it and post it freely. Knowledge is power!\n__________________________________\nNOTE \n                TO CO-OP AND NATURAL FOOD STORE SUBSCRIBERS:\n                Organic Bytes is a great tool for keeping your staff and customers \n                up to date on the latest issues. Feel free to forward this email \n                to your staff and print for posting on bulletin boards and staff \n                break tables. You are also welcome to use this material for your \n                newsletters. There's an attractive print-friendly PDF version \n                of this available for free download at http://www.organicconsumers.org/organicbytes.cfm\n\n_________________________________\nORGANIC \n                BYTES is a publication of:\n                ORGANIC CONSUMERS ASSOCIATION \n                6771 South Silver Hill Drive\n                Finland, Minnesota 55603\n                Phone: (218)- 226-4164 Fax: (218) 353-7652\n__________________________________\nSubscribe: \n                http://www.organicconsumers.org/organicbytes.htm\nSafe \n                Unsubscribe: \n                http://organicconsumers.org/unsuborganicbytes.cfm \n                \n                You are subscribed as: ktwarwic@SPEEDY.UWATERLOO.CA \nChange \n                your subscription settings to receive Organic Bytes as plain \n                text here:\nhttp://www.organicconsumers.org/campaign.cfm \n                \n__________________________________\n  \nxaxa1014138\n\n\n\n\n \n \n \n\n\n\n\n\n"}