{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Crystal Winters <c_madgad@glengall12.fsnet.co.uk>", "subject": "Don't have time to visit the local drug store?", "body": "\n\nDo you want to save your money and get high-quality pills?\nVisit us\nYou will have sex all night long. You won't think about erectile dysfunction anymore.\nGo to the site\nSecure and confidential purchase. We are verified by VISA!\nWith best regards,\nCrystal Winters\n \n \nNe toropis, zhestko osadil Nkot. Kak nadoevshaia kompiuternaia Igra, kotoruiu posle pobedonosnogo zaversheniia v zapale nachinaesh prohodit s Samogo nachala i vdrug osoznaesh, chto ona uzhe stala neinteresnoj. No eshche Bolshe, chem rost, porazhala voobrazhenie ego vneshnost. Granicy vlasti sushchestva, obladaiushchego podobnym predmetom, prosto trudno Predstavit. \nChestno govoria, v dannyj moment moim edinstvennym Zhelaniem bylo kuda-nibud svalitsia i zabytsia chasikov etak na desiat, i ia Prikinul, kak by mne etu shtuku obojti. My tut poka svoi dela obsudim. Oshibka Zhe vozmozhna, esli Osvoboditeliu, vybrannomu Volshebnym Zverem, ne hvatit sil dlia Osushchestvleniia svoej missii. Vyderzhka emu nakonec izmenila. Bolshoe silnoe telo kukolnika Kazalos celym i nevredimym, esli by ne odna strashnaia otmetina ego glaza Byli vyzhzheny. Prosto shevelni Myslishkoj i otpusti etalonchiki na moj schet. Zdes vse svoi. Da net, mne moia rabota nravitsia, eto ia tak, radi Trepa. \nProsto ia hochu znat kak mozhno bolshe, tak mne budet legche planirovat Predstoiashchie dejstviia. Zver shumno Vzdohnul, kak plovec, vynyrnuvshij iz glubiny iz poslednih sil, otkryl ogromnye Antracitovo-chernye glaza i v dva priema vskochil na nogi chernaia gromadina Neveroiatnoj sily. Davno on priehal? Tolko chto. Ne ostanavlivaia charsa, Drahub nizko naklonilsia s sedla, zacherpnul rukoj Polnuiu gorst beloj poroshi i iarostno raster lico, slovno pytaias izbavitsia ot Zapaha goreloj zemli i ploti haskov, dazhe s takogo rasstoianiia vse eshche Presledovavshego ego chutkoe obonianie. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}