{"category": "ham", "to_address": "\"\" <ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"The Internet Patrol\" <info@theinternetpatrol.com>", "subject": "\n The Internet Patrol - The Surprising Portable Computer Backup Appliance - You\n 're Going to Want One!", "body": "\n\n\nThe Internet Patrol\n\n\n\nThe Internet Patrol\n\nhttp://www.theinternetpatrol.com\n\n\nInternet Safety, Windows Updates, Internet News, and More\n\n\n\nThe Surprising Portable Computer Backup Appliance - You're Going to Want One! - 2007-06-19 22:10:18-04\n\n\nYou know you should have a data backup solution to ensure that you have a harddrive backup - and in fact you may already have one or more backup solutions in place.  But what about portable backup solutions - what about if you are on a trip, and your hard drive fails (as mine did last week?)  Consider an iPod video for your portable backup data storage!\n\n\n Here are some amazing deals we've found on the Internet for ourselves recently: \n\nYou Can Backup Your Computer Now for Free!  Use the Same Online Backup Service that We Do!\n Get gadget insurance for your cell phone, PDA and all your electronic gadgets, to protect against los or theft!  http://www.theinternetpatrol.com/get-your-stuff-back-with-stuffbak-pdas-laptops-cell-phones-protect-them-all\n\n Send Unlimited Newsletters to Your Customers, Friends, Family, and Others:  http://www.theinternetpatrol.com/the-perfect-way-to-send-email-newsletters\n Unlimited Calls to Any Phone in the U.S.:  http://www.theinternetpatrol.com/make-unlimited-phone-calls\n Check out our online audio show, \"Three Things You Should Know\"!  http://www.ThreeThingsYouShouldKnow.com\n And check out the best collection of how to videos at http://www.LearnHowTo.TV ! \n Know somebody who would like to receive these alerts?  Forward this one to them and let them know that they can sign up for free by sending email to internetpatrol@aweber.com with the  word 'Subscribe' in the subject! \n\n\n\nThe Internet Patrol, \n302 W. El Camino Real, #411, \nSunnyvale, CA 94087, USA\n\n\n\n\nTo unsubscribe or change subscriber options visit:\nhttp://clients.suretymailings.com/z/r/?TBwMLMwctMzsTCxMTJzs\n\n\n\n"}