{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "robert weissman <rob@essential.org>", "subject": "[Ip-health] Thailand: Plans to Import Generic Aluvia", "body": "Bangkok Post\nApril 19, 2007\nhttp://www.bangkokpost.com/News/19Apr2007_news11.php\n\nGovt seeking new generic imports\n\nAPIRADEE TREERUTKUARKUL\n\nThailand wants to import a generic version of the anti-Aids drug Aluvia,\nin tablet form, from makers in India. The move comes after the patent\nholder, Abbott, withdrew its introduction of the medicine to the country\nafter the government announced compulsory licensing.\n\nA source said the Public Health Ministry was looking for generic drug\nproducers of the new tablet form of the protease inhibitor\nlopinavir/ritonavir in India. Thus would offer HIV-positive people with\nresistance to first-line drugs such as the locally-made GPO-VIR access\nto a superior regimen of the second-line Aids drug.\n\nThe decision was made after the US-based company opposed the\ngovernment's decision to go for compulsory licensing and threatened to\nwithhold the introduction of new drugs in Thailand, including Aluvia\nwhich is an improved version of Kaletra, the source said.\n\nIt was possible that the government would receive cooperation from\ninternational organisations, including the Clinton Foundation, to help\nnegotiate the price with the generic drug makers in order to ensure that\nthe price of Aids drugs would be affordable for Thai people living with\nHIV/Aids, the source said.\n\nThe objective of the Clinton Foundation HIV/Aids Initiative (Chai) is to\nmake treatment for HIV/Aids more affordable and to implement large-scale\nintegrated care, treatment and prevention programmes.\n\nVirat Poorahong, head of the Thai Network of People Living with\nHIV/Aids, said the generic version of Aluvia costs about 4,000 baht per\nmonth. However, this improved version of Kaletra could be reduced to\nbelow 2,000 baht to compete with the Kaletra price offered by Abbott.\n\nAbbott has decided to lower the price of Kaletra to 3,488.20 baht in\nThailand. However, it is unclear whether the ministry will accept the\noffer or proceed with its plan to import the generic version from India\nunder the compulsory licensing.\n\nHIV-positive Thais with resistance to first-line drugs spend up to\n11,850 baht per month to buy such medicine.\n\nLast year, Abbott announced that it would sell Aluvia at a price of\n$2,200 (71,000 baht) a year in developing and middle-income countries\nincluding Thailand.\n\nHowever, the drug firm decided last month to withdraw its introduction\nof the medicine and other new drugs in Thailand in opposition to the\ngovernment's compulsory licensing decision, which allows the state to\noverride drug patents to import or produce cheaper versions of the\nmedicine for emergency use.\n\nMr Virat said he and former Bangkok senator and health activist Jon\nUngphakorn were also invited by a group of shareholders in Abbott\nLaboratories to attend the annual stockholders meeting in Chicago on\nApril 27 and address the necessity of adopting compulsory licencing to\ngive Thai people access to affordable medicine.\n\nPublic Health Minister Mongkol na Songkhla and his special adviser Suwit\nWibulpolprasert will also be going to Washington to defend the decision\nto use compulsory licencing. They say it does not contradict the World\nTrade Organisation's agreement on Trade-Related Aspects of Intellectual\nProperty\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}