{"category": "spam", "to_address": "Gnitpick <gnitpick@flax9.uwaterloo.ca>", "from_address": "Waylon Beard <muniz@gobrandid.com>", "subject": "For Your Eyes Only", "body": "\n\nThe differences between men and women is that women are always ready for sex, but men need an erection. Let us remove this difference by offering you Viagra!\nGo to the shop\nErectile Dysfunction is one of the most serious problems that a man can get in his life. The best cure nowadays are Viagra and Cialis.\nVisit us\nLicensed medications you can by right now!\nWith best regards,\nWaylon Beard\n \n \nPreodolev pristup beshenstva, prygun snova dvinulsia po krugu. Chereda podobnyh pochkovanij i obrazovyvala staiu, iavliaiushchuiusia, po Suti dela, edinym celym krovenosnaia i nervnaia sistemy u galtov stali Obshchimi. 2. Ia uzhe gotov byl svernut transu golovu za vsiu etu boltovniu, no tut Nado eto priznat on menia ogoroshil. \nEto predstavlenie ukrepilo menia v moem namerenii Zabrat etu devushku s soboj. Sdublirovat signal dlia menia ne predstavlialo nikakoj slozhnosti. Da, osevoj, poslushno povtoril ia. Tak chto, skoree vsego, kazhdyj ostanetsia pri svoem, i nichego tut ne Podelaesh. U shefira ostalsia tolko odin dorriks, on ne stanet im tak riskovat posle Smerti pervogo. Na pervyj vzgliad sedlo kazalos dostatochno udobnym dlia chelovecheskogo Sedalishcha i prosto izobilovalo kozhanymi petliami, k kotorym udobno priviazyvat Raznye prichindaly. On ne obrashchal na nih vnimaniia, ne zhelaia otvlekatsia na stol Prezrennye melochi Edinstvennym stoiashchim protivnikom dlia nego byl shor-dok. Kak on ee eshche v zale vzgliadom. \nNazovi svoiu cenu. Ia imel nekotorye navyki, Pozvoliaiushchie pri neobhodimosti nezametno manipulirovat chuzhim soznaniem protiv Ego voli, no udovolstviia podobnye manipuliacii mne ne dostavliali. Razumno. V chem delo, paren? Chto zamolchal? Chto-to neladno? Natknuvshis na vnimatelnyj, izuchaiushchij vzgliad zheltyh glaz Celitelia, ia Napriazhenno kivnul: Da. ejisuminyon VVFcRlhQUVh0RkFXVlBMH0dEVUFUQF9bWh9RUg==\n \n\n\n"}