{"category": "spam", "to_address": "<elaastic@speedy.uwaterloo.ca>", "from_address": "\"Kramer Adrian\" <aalx@gmail.com>", "subject": "For myself, I thought it was great to play a Nazi mechanic selling guns illegally.", "body": "\n\n\n\n\n\n\n\nKiyoshi Kurosawa: At the time, I didn't even know \nabout the film. Again, I was on set for quite a while and had a good character that \nI could work with. Kiyoshi Kurosawa: Loft is completed, but it hasn't been released \nin Japan yet. Why is it that so many Japanese filmmakers are so prolific - you \nyourself make two or three films a year - while in the U. DVD Talk: There's a \nsuicide scene in Pulse where a woman jumps from a water tower.\nDVD Talk: Fangoria reported that you shoot some \nfurther material for different markets for Incident, material that was not included \non the Anchor Bay DVD release.\nWe're struggling a bit to find the appropriate \nrelease. He bowled two 300 games in tournament play. I try to portray the \nincomprehensible as non-human, unlike America, where you anthromorphosize inanimate \nobjects through human intentions, but I think this can be true of human beings as \nwell.\nDVD Talk: Can you talk a little about your current \nproject, Loft (Shi no otome)? \"  He also mentored his crew especially Sam Taylor, to \nget the guys who were writers and make them into directors so they would move along \nin their career. \" They found that very strange and odd. The animal trainers I \nselected were replaced. One explains a lot about our heroine, Ellen and the other \nshows the villain, Moonface, doing some dastardly things to the recently deceased. \nIan -  How do you feel about being remember as one of the most notorious cinematic \nvillains of all time?\nSo, although the narrative is important, the \ncritical question in the film is whether a single tree will be chopped down, i. DVD \nTalk: There's a suicide scene in Pulse where a woman jumps from a water \ntower.\nI try to portray the incomprehensible as non-human, \nunlike America, where you anthromorphosize inanimate objects through human \nintentions, but I think this can be true of human beings as well. Again, I was on \nset for quite a while and had a good character that I could work with.\nLuckily I was very fortunate to have New Line \nembrace it, really step to the plate and allow me to have a pretty free hand in \nproducing this package. Although Dario Argento is a terrific substitute for the \nItalian team! There was an illegitimate German DVD release of the workprint of \nPhantasm II.\nWhat were you trying to do with the movie that you \nweren't able to do? I thought it was fairly faithful to the original \nnovel.\nDon Coscarelli: He just asked.\nDVD Talk: How did you like working on the shorter \nshooting schedule and having to bring in the project at under an hour?\nKiyoshi Kurosawa: I don't think there's any mystery \nto that. Again, is this going to happen?\nDVD Talk: Is there any plans to have a U. He took \nover 300,000 3-D photographs.\nDVD Talk: With both Incident On And Off A Mountain \nRoad and Bubba Ho Tep finished, do you have any plans to adapt anymore of his \nwork?\nGunnar -  I prefer writing. How did that falling \nout change you as a filmmaker and what influence has that had on your current \nwork?\nYou are truly one of the best filmmakers in the \nworld.\n"}