{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "60 Minutes Newsletter <newsletter_sixty_minutes-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "60 Minutes E-mail Alert", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nOur lead story on Sunday's 60 \n      Minutes comes just as battlefield casualties are increasing in \n      Iraq due to the recent surge \n      and correspondent Scott Pelley's timely report demonstrates why \n      more of those soldiers are surviving even catastrophic \n      injuries. 60 Minutes cameras take you onto the \n      helicopters outfitted like emergency rooms and into the trauma centers, \n      where courageous medics and surgeons are winning the fight against \n      battlefield deaths. Improved equipment and better logistics enable these \n      medical warriors to save more battlefield casualties than ever \n      before. Personnel from all over the world are deployed and no expense \n      is spared in these Herculean efforts that can sometimes utilize a dozen \n      aircraft and a thousand service members. \n      (OAD: Oct. 29, 2006)\n \nWatch Scott Pelley's reporter's \n      notebook. \n \nOur second story reminds us \n      that the genocidal ethnic cleansing in Sudan is \n      neither the first nor probably the last such human \n      nightmare. Correspondent Bob Simon finds a story from \n      another African horror 13 years ago that recalls the old terror but, \n      incredibly, offers some new hope. Immaculee Ilibagiza and six other women \n      hid in a 4-by-3-foot bathroom for three months to escape the horrible \n      deaths that befell 800,000 fellow Tutsi tribe members, including her \n      entire village and family. Ilibagiza now tells her story from the \n      Rwandan massacre not just to verify it, but to forgive her would-be \n      killers and aid in a nation's healing process. (OAD: Dec. 3, 2006)\n \nWatch\nBob Simon's \n      reporter's notebook.\n \nWhen temperamental Oscar \n      winner Russell Crowe sits down for an interview, he starts things off on a \n      hard note, expressing frustration that 60 Minutes will be in \n      total control because of the editing process. Correspondent Steve \n      Kroft then digs into the Australian actor who never loses his edge but \n      warms to the questions with the straight talk he’s known for. \"Got to tell \n      the truth,\" says Crowe, as he gives Kroft an earful about the press, the \n      U.S. justice system, \n      Hollywood \n      and how having a temper like his is a healthy thing. Oh, that incident \n      where he threw the telephone at a hotel clerk that he absolutely regrets? \n      \"Minor,\" Crowe tells Kroft. \"Where I come from…[it]would be settled with a \n      handshake and an apology.\" (OAD: Nov. 5, 2006)\n \nWatch an excerpt of Kroft's \n      interview. \n \nThose stories and Andy \n      Rooney’s problems with packaging, this Sunday, July 1, on 60 Minutes at 7 p.m. \n      ET/PT.\n \nFor an early look at this \n      week’s stories, please click \n      here.\n \n \n \n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n \n"}