{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Zachary Kline\" <Z_kline@hotmail.com>", "subject": "Re: dropline-gnome accessibility", "body": "Hiya,\n    I read somewhere today actually that VMWare server didn't actually \nrequire PAM, that it was a common misconception?  I confess I can't remember \nthe article I read that in, but I'll try to find it and get back to you.\nThanks,\nZack.\n\n----- Original Message ----- \nFrom: \"Spie Sutherland\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Thursday, June 28, 2007 7:52 PM\nSubject: Re: dropline-gnome accessibility\n\n\n>I went through a pam install from source on slackware recently\n> because the new free vmware server will not work without it.\n> It was annoying to get working initially because the pam config\n> provided by vmware was not compatible with the pam built\n> from source. Apparently most distros have pam but slack does\n> not. Not sure how much it complicates thing altogether but for\n> getting vmware working, once it was configured properly it\n> was not a problem at all for me. PAM is an authentication\n> system, so yes it does complicate authentication. Vmware\n> uses it for authenticating access to those vmware processes\n> over that funky local network it creates. More info on pam\n> here\n>\n> http://www.kernel.org/pub/linux/libs/pam/\n>\n> I don't know much about gnome because I've been very\n> interested in it.\n>\n>  -- Spie\n>\n>\n> Zach wrote:\n> I've heard some technical complaints about Dropline.  One of those\n> seems to be that it installs PAM, which isn't really something I'm\n> familiar with.  From what I gather, it complicates traditional ways of\n> doing things considerably.\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}