{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "John Logsdon <j.logsdon@quantex-research.com>", "subject": "Re: [R] Unix-like permissions to allow a user to update recommen", "body": "R-ists\n\nWhen you move from version to version of R a completely new directory tree is \ninstalled so in principal if you *know* that a package is not updated you can \nre-install it from the old tree or copy it to your new tree and install it.\n\nMaybe an 'import packages from previous versions' could be included which \nwould search  for other installations, offer a choice if >1 and automatically \npick out the list of old packages again offering the user to check/uncheck \neach package.  Then the action would import or download updated versions as \nappropriate...\n\nWhat would be more useful (and I don't really think this is the right list) is \nto have permissions and a date stamp attached to each object and to extend \nthe ls() command to be able to select or sort on these aspects of an object, \nalso the size - just like Unix in fact (perhaps with more comprehensive \npermissions although the group/world structures are not needed).\n\nThis is because as memory increases, I guess many people do what I do and \ncreate all their objects in the workspace - then forget when we wrote and \nwhen!\n\nOn Monday 18 June 2007 21:27:56 Patrick Connolly wrote:\n> On Mon, 18-Jun-2007 at 11:53AM +0100, Ted Harding wrote:\n> |> On 18-Jun-07 10:11:43, Patrick Connolly wrote:\n> |> > I installed R from the tar.gz file (as root) in a directory under\n> |> > /usr/local.  The recommended packages are installed in a library in\n> |> > that directory whereas additional packages I install in a directory\n> |> > under the /home directory as a user.\n> |> >\n> |> > Updating the additional packages is very easy with update.packages()\n> |> > as a non-root user, but the recommended packages cannot be done so\n> |> > readily because of file permissions.\n> |> >\n> |> > My question is how do I set the permissions or ownerships in the\n> |> > /usr/local/R-2.5.0 directory so that everything necessary can be\n> |> > writable by a user?  Should I make a group for R users (total of one\n> |> > member) or is it simpler than that?\n> |>\n> |> Since you have root access, do you need to segregate the additional\n> |> packages to a particular user?\n>\n> It's handy to not have to reload packages that don't change between\n> versions of the basic installation.\n>\n> |> Though I don't run R as root for general use, I always install/update\n> |> by running R CMD as root. This makes all of R (\"recommended\" and also\n> |> any extras) available system-wide, and no pemission problems arise.\n> |>\n> |> This of course does not stop you from setting up a special .Rprofile\n> |> for each user, since this by definition lives in the user's home\n> |> directory.\n> |>\n> |> Does this help? Or are there issues you haven't mentioned which make\n> |> such an approach not feasible?\n>\n> I don't exactly have issues.  It's not a huge problem I'm dealing\n> with.  It's simple enough for me to use update.packages() as a user\n> which will download the appropriate packages.  Though they won't be\n> installed, they are all in the one place in the /tmp/ directory from\n> where I can install them as root.  I just thought there must be a more\n> elegant way to set permissions so that users could write to the\n> subdirectories under /usr/local/R-2.xxx/.  So much of the installation\n> process of R and its packages is so elegant, I'd like to retain some\n> of that elegance.\n>\n> best\n\n\n\n-- \nBest wishes\n\nJohn\n\nJohn Logsdon                               \"Try to make things as simple\nQuantex Research Ltd, Manchester UK         as possible but not simpler\"\nj.logsdon@quantex-research.com              a.einstein@relativity.org\n+44(0)161 445 4951/G:+44(0)7717758675       www.quantex-research.com\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}