{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Littlefield, tyler\" <compgeek13@gmail.com>", "subject": "Re: Slackware 11 aliases, anyone?", "body": "what does sendmail have to do with the aliases?\nI am not sure, but source may not be your only solution.\nAlso, if you're getting the default aliases file back, I think bash creates \nthat with other files in ~, when you start it if it's not there already.\nThis is at login, or after I should say, when the shell is invoked.\n----- Original Message ----- \nFrom: \"Gaijin\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Saturday, June 23, 2007 9:35 PM\nSubject: Slackware 11 aliases, anyone?\n\n\n>     Hi again all,\n>\n>     Well, Slack11 is working great.  The BSD init setup is strange\n> after working in System V.  I have a really strange problem.  I saved a\n> few of my own aliases in a file called .aliases, and then made and added\n> the lines to .bashrc:\n>\n> echo 3 > /proc/speakup/rate\n> source ~/.aliases\n>\n>     It didn't work, so I unaliased all of my aliases and tried again.\n> That didn't work either, so I deleted every single file in the home\n> directory, deleted every alias, logged out, logged vack in, and guess\n> what?  The stoopid default aliases were back!  wtf?  Is Windows haunting\n> my Linux drive now?  Anyone know how to get rid of the default aliases\n> and add my own?  .bashrc doesn't seem to work in Slack for some odd\n> reason, and yeah, I'm using bash.  Ran Debian for over two years, so I'm\n> not TOO stupid.   Thank the gods I'm running sendmail.  Best\n> news I've had since January.  I wonder if there's a way to generate an\n> installed  package list.\n>\n>         Michael\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}