{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "james.love@keionline.org", "subject": "[Ip-health] What do Democrats.com have against poor people in Thailand getting\n affordable medicines? | The Huffington Post]", "body": "http://www.huffingtonpost.com/james-love/what-do-democratscom-hav_b_46779.html\n\nApril 25, 2007\nThe Huffington Post\n\nWhat do Democrats.com have against poor people in Thailand getting\naffordable medicines?\n\nOn Tuesday Ellen Shaffer, a public health activist, was send a message\nfrom Bob Fertik, from Democrats.com, a group that supposedly supports\nthe democratic party and liberal causes. It called upon Ellen and\nthousands of others who received the same message to \"Stop the\nOutsourcing of US Jobs to Thailand,\" saying \" Thailand has been taken\nover by a military regime hostile to good American jobs in our science\nindustries,\" and then linked to this page, which sends anti-Thailand\nemails to Congress.\n\nApparently Bob Fertik is the latest of an army of democrats and\nrepublicans being paid to push Thailand onto the U.S.T.R. 301 list for\nnot having high enough intellectual property right standards.\n\nWhat did Thailand do that got Democrats.com, the front group U.S.A. for\nInnovation, the New America Foundation's James Pinkerton, the Progess\nand Freedom Foundation James Delong, Ken Adelman and others employed?\n\nThailand issued compulsory licenses on three overpriced drugs, including\ntwo drugs for AIDS and one for heart disease. Thailand did this to\nobtain access to less expensive generic products. Thailand did this in\ncompliance with WTO rules, and the patent owners are free to negotiate\nwith the Thailand government on the royalties for those compulsory\nlicenses. But instead, they want to protect their ability to price\nproducts very high, and are lobbying the U.S. Congress and the Bush\nadministration to put pressure on Thailand.\n\nTo put things in perspective, Thailand has a per capita income less than\n7 percent of the U.S. Three months ago, Abbott was charging nearly\n$4,000 per year for a single AIDS drug (Abbott dropped the price to\n$1,000 after Thailand's action), and Sanofi was charging a price for a\nheart disease drug that was too high for 80 percent of the population.\nThe actions of the Thailand Ministry of Health have been endorsed by\nDoctors without Borders, Oxfam, the Clinton Foundation, HealthGap,\nEssential Action, Knowledge Ecology International, Third World Network,\nand hundreds of other groups and experts.\n\nApparently with the change in the Congress, the efforts by the highly\nregarded health authorities in Thailand provide a big business\nopportunity for lobbyists with good democratic credentials, like Bob\nFertik and Democrats.com. This reminds me why people think Washington,\nD.C. is a corrupt place. It is.\n\n------------------------\nBog Fertik's letter follows:\n\nFrom: Democrats.com\nSubject: Stop the Outsourcing of US Jobs to Thailand\nDate: Tue, 24 Apr 2007 11:26:04 -0400\nReply-To: activist@democrats.com\n\nDear Ellen,\n\nThailand has been taken over by a military regime hostile to good\nAmerican jobs in our science industries. The government is now stealing\nthe inventions of American workers to pay for inflated salaries and new\ntoys for the military.\n\nWorse, the Thai military is now trying to convince other nations to\nfollow its lead. The Minister of Health will be in the U.S. this week to\nconvince policymakers, academics and the press that these new spending\npriorities are more important than the jobs of the American innovators\nwho are working to save lives.\n\nTake action today to let your representative officials know that theft\nof American property by the Thai government and threats to American jobs\nmust be stopped!\n\nBob Fertik\n\n-------------------------\nFor real information on this dispute, see the CPTech web page on Thailand,\nwhich is maintained by Michael Palmedo, here:\nhttp://www.cptech.org/ip/health/c/thailand/\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}