{"category": "spam", "to_address": "<theorize@plg.uwaterloo.ca>", "from_address": "\"Hugh Ballard\" <belh@pacbell.net>", "subject": "Researchers have been looking into this, but - as for most areas in aging research - there is comparatively little funding for these sorts of studies.", "body": "\n\n\n\n\n\n\n\nThat is the question that scientists are currently \nattempting to answer; there are a number of good theories on the go. \" This article \nserves as a reminder of the dangers posed to the future of medical research, healthy \nand longevity by people like Leon Kass. If the latter, however, telomere research \nmight yield untold dividends. As I've been saying for a while, the scientific side \nof progress towards a cure for aging and age-related degenerative diseases is \nsure-footed.\nInvestors are scared away by political threats to \nfundamental technologies like therapeutic cloning.\n\" Given the cancer link, telomere research is \nimportant in any case. htmlThe in-house health media at the AARP are starting to \nshow an interest in healthy life extension, as well they might. \"But while they may \nnot be investing in the companies themselves, venture capitalists haven't completely \nabandoned stem-cell work.\nIs Demography Destiny? Transhumanist groups have \nlong played an important part in the healthy life extension community. We should all \nbe thinking about such things, but this piece only covers half of the \ntopic.\nIt is one of the great accomplishments of the past \ncentury.\nHere is one other thing to bear in mind: rather \nthan chasing supplements that may add a few healthy years to our lives, shouldn't we \nbe calling for faster progress towards a cure for aging?\nphpWhile meandering the web, as I often do on \nSundays, I came across a promising article from Harry Moody, one of the many \nbioethics-oriented folks affiliated with the International Longevity Center. UN Ban \nOn Therapeutic Cloning Likely?\n\" Biogerontologist Aubrey de Grey makes the case \nthat \"eventually\" can - with public support and better funding - be within twenty \nyears.\n"}