{"category": "spam", "to_address": "\"Dustin Tommy\" <gnitpick@speedy.uwaterloo.ca>,\n   \"Pedro Leon\" <manager@speedy.uwaterloo.ca>,\n   \"Derrick Derek\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"Heather H. May\" <Heatherfal@uscertifiedletters.com>", "subject": "So you wanted another message from Ms. May, yeah?", "body": "Treat yourself and your woman to a marvelous, sensual experience.\n\nIntroducing the Vibrator Ring \n\nIts patented design is both comfortable and washable. The Ring section\neasily stretches to fit any size and is made of non-toxic silicone rubber\nmaterial that is both soft and hygienic.\n\nThe Vibrator Ring features a raised tickler with thinly sculptured ridges\nespecially designed to stimulate her c-spot and a micro vibration motor\nwhich produces pulsating sensations through the shaft promoting multiple\npleasures.\n\nIt's self-powered & has a switch to turn the device on and off as you\nchoose. So you're in control.\n\n\nhttp://www.theultimatetoy.net\nTell your friends, they and their Partners will love you Forever!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJimmy-Joe Jepson. Plus assorted attorneys. But they on the list. lawyers\nwere bonus he give Smith for free, just part of annual contribution to the\ngood of republic. By the time he reached the seventeenth the roadway leading\nfrom Speer's house was full, so Remo took Tim-Tom Tucker his lawyer in the\nbefore they even started their car. Remo at his list again. one of them. He\nhad them \nHe snapped his index finger the list with satisfaction. \"There,\" said. \"Now\nnobody can about that.\" He walked to the door of the house, unlocked even\nthough the crime rate in the was the highest in the nation, wasn't crime\nthat place in houses. It was generally just violence that Remo thought out\nof streak of viciousness ran deep through Southern character. It exploded in\nsaloons parking lots and street corners, but it \nrarely premeditated so no ever had to lock their doors. was glad he did not\nhave to in the South. Angry violence annoyed him waste of strolled inside\nthe house and found Speer in the living room, pouring the of bottle\nchampagne into an oversized brandy snifter. \"Who you-\" Speer asked as turned\nto face name is Remo.\" \"What do want-\" \"What want is some off to go\nfishing,\" Remo said. \"But got is to you.\" \"Not chance, Buddy,\" Speer said. \nreached inside his jacket, quickly for such big man, pulled .38 caliber\nrevolver shoulder holster. Remo his head. He frowned. \"Don't waste my with\nthat,\" he said. Speer the gun at Remo and squeezed trigger. He blinked his\neyes at the sound the report. When he opened them, was not standing in front\nof Nor was he on the floor in bloodied heap. \"You're not nice person,\" he\nRemo say. \"Just because you're\n\n\nuntil tommorow\n\n\n\nHeather\n\n\n\n"}