{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "All charges are dropped in the Duke Lacrosse case--we have an exclusive with one of the families.  That's tonight on the CBS Evening News with Katie Couric", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n \n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening \n            News | 48 Hours | 60 Minutes | The Saturday Early \n            Show | CBS Sunday \n            Morning | Face The \n            Nation\n\n\n\n\nCBS) QUOTE OF THE DAY\n“Indeed, history is nothing more than a tableau of crimes and \n      misfortunes.” - Voltaire \n\nDID YOU KNOW? The Atlantic Ocean is saltier than the \n      Pacific Ocean. \n\nTONIGHT ON THE \n      CBS EVENING NEWS Here's an early \n      look at what we are working on for tonight's broadcast of the CBS EVENING \n      NEWS from Anchor and Managing Editor Katie Couric... Hi \n      everyone, I’ll be anchoring tonight’s broadcast from North \n      Carolina, home of Duke University, where the sensational case of three \n      lacrosse players accused of sexual assault has unfolded. Now comes \n      redemption for the accused former college students, Reade Seligmann, David \n      Evans and Collin Finnerty. Prosecutors have decided to drop all criminal \n      charges against the young men, saying the athletes were victims of a \n      “tragic rush to accuse” by District Attorney Mike Nifong – who himself is \n      now under scrutiny. I’ll have that story and my colleagues will be \n      with me in North Carolina covering all the angles. The rape \n      accusation last spring has had widespread ramifications --- it has stoked \n      racial tensions in the Raleigh-Durham community, scarred three families \n      and tarnished the reputation of one of the country’s top universities --- \n      but, as Bob Orr will report, the legal case really was no case at \n      all. Despite that, the parents of the three accused men, who are \n      now 20, 21 and 24 years old, spent an estimated $3.5 million on lawyers. \n      All three are now vindicated, but are still victims. Byron Pitts \n      will take a look at how the accusation has changed the lives of the \n      accused young men and will tell us where they are now. Another \n      reputation tarnished by the accusations was that of one of the country’s \n      top higher education institutions: Duke University. Kelly Wallace \n      will take a look at the media glare that focused on Duke and its lacrosse \n      team for the past year and assess the impact of the accusation on the \n      campus and community. And then we’ll turn to the controversy over \n      on-air comments made by Don Imus about the Rutgers women’s basketball \n      team. The radio host was suspended for two weeks after making the remarks, \n      but it is yet to be seen whether he will stay in his position. But how \n      much is he worth to his broadcasters and advertisers? Anthony Mason \n      will have the story. Finally, I sat down with the family of \n      Reid Seligmann, one of the accused Duke lacrosse players. I’ll \n      share our conversation with you tonight. I hope you’ll join \n      us. Katie For more on two of the stories noted above, \n      please click on the following links: All Duke Lacrosse \n      Charges Dropped Click Here Two Major Sponsors \n      Drop Imus Click Here Here's an early look \n      at one of the stories we are working on for Thursday's broadcast of the \n      CBS Evening News: NATO forces in Afghanistan have launched their \n      spring offensive. Lara Logan is with them during a fierce assault on a \n      major Taliban stronghold. That story, and MUCH more, Thursday on the CBS \n      Evening News. If you would like more information on any of these \n      stories or the broadcast, please click on the following address and e-mail \n      us: evening@cbsnews.com \n\nTONIGHT ON DAVID LETTERMAN Join Dave tonight on \n      The Late Show with actor Alec Baldwin \n      AND Debbie Parkhurst and her dog, Toby, who performed the Heimlich \n      Maneuver on her… Plus, musical guests LCD Soundsystem! \n\nTHURSDAY MORNING ON THE EARLY SHOW Hannah Storm, \n      Julie Chen, and Russ Mitchell anchor THE EARLY \n      SHOW from New York. Harry Smith will \n      anchor from Raleigh, NC. Dave Price will bring us the weather. \n      Along with the top news of the day, we will also have the \n      following stories: ARCOXIA: BEFORE THE FDA: On \n      Thursday, the Food and Drug Administration will hold a meeting at which \n      non-agency arthritis experts are expected to vote on whether the drug \n      Arcoxia should be approved. Arcoxia, a pain-relieving drug in the same \n      class of the more familiar Vioxx and Bextra, could be approved for use in \n      patients with arthritis. If approved, Arcoxia would be the first in the \n      same class of drugs as Vioxx and Bextra to gain United States approval \n      since those drugs were pulled from the market after showing links to heart \n      attack and stroke in 2004 and 2005. The agency is not required to follow \n      the panel's recommendation, though it often does. We’ll have details \n      Thursday morning. MONEY MATTERS: LAST MINUTE TAX TIPS: With \n      the dreaded April 17th deadline looming, what can you do to keep Uncle Sam \n      happy? Before you file your tax returns, we’ll have important tax tips you \n      won’t want to miss. So how can you avoid paying outrageous fees? If you \n      don’t follow the rules, you could lose your refund. Our financial expert \n      Ray Martin will join us to help you maximize your savings. \n      DAVE’S ALL ACCESS HIGHLIGHTS: Amazingly, it's been \n      two weeks since we wrapped up our latest series of All Access \n      travels around the world. We had so many amazing adventures on the road \n      over the past two months that it was impossible to show you everything \n      that happened along the way. So we decided to take a look at some of the \n      funnier moments of our All Access trips that you may not have seen \n      yet. We’ll have all the highlights… and the lowlights, Thursday morning! \n      YOUNG AT HEART: BOOMERS AND BUSINESS: While boomers are \n      reaching what some say is the better part of their lives. So how common is \n      it for boomers to start their own businesses? The answer may surprise you. \n      More and more, boomers are becoming successful entrepreneurs. Thursday \n      morning, we’ll have some tips on how an eye for possibility and a take \n      charge attitude can achieve business gold. Nancy Perry Graham, Deputy \n      Editor AARP The Magazine, will join us with her advice. \n      ROSE MCGOWAN ON GRINDHOUSE: Actress Rose McGowan \n      made a name for herself in dark teen comedies such as Scream and \n      Jawbreaker. She then starred in the bewitching Charmed for \n      five years, playing Paige Matthews on the show about three sisters \n      battling the forces of evil. Now, McGowan stars in Grindhouse, a \n      double-bill of thrillers that pays homage to its dual filmmakers' favorite \n      exploitation films. In Quentin Tarantino’s slasher film, Death \n      Proof, the killer pursues his targets with a vehicle rather than with \n      a knife. Robert Rodriguez contributes Planet Terror, in which he \n      explores an alien world similar to ours. The combination of the two films \n      results in an action-packed film unlike anything you have seen before. \n      McGowan plays Pam in Death Proof and Cherry in Planet \n      Terror. She will join us Thursday morning to talk about her experience \n      during the project and her love of the finished product. \n      WILLIAMS SONOMA CREPES: Many people love a certain French \n      dish but find it intimidating to make at home. It is the crepe. Americans \n      think of the crepe as a \"thin\" pancake. . . but as it turns out, it is an \n      incredibly versatile foundation for both sweet and savory flavors. So how \n      can you wow your breakfast guests with a crepe that is surprisingly easy \n      to prepare? Cookbook author Tori Ritchie will join us to demystify this \n      delicious treat so that we can easily enjoy it at home. If you \n      would like more information on any of these stories or the broadcast, \n      please click on the following address and e-mail us: earlyshow@cbs.com \n\n\nTO SUBSCRIBEClick here to subscribe to \n      the Inside Scoop.TO UNSUBSCRIBEUnsubscribe information \n      is included in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, \n      click here.Contact: Email Administrator, \n      CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n      10019Help | Advertise | Terms of \n      Service | Privacy \n      Statement©MMVII, CBS \n      Interactive Inc. All Rights Reserved. \n\n"}