{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Andrew Leonard in Salon: Democrats.com's strange neocon bedfellow", "body": "http://www.salon.com/tech/htww/2007/04/25/ken_adelman/index.html\n\nDemocrats.com's strange neocon bedfellow\n\nWhy is Democrats.com co-founder Bob Fertik endorsing arch neo-con Ken\n\"Iraq will be a cakewalk\" Adelman's campaign to protect the profits of\ntransnational pharmaceutical companies?\n\n\"Stop the Outsourcing of U.S. Jobs to Thailand\" screamed the\nDemocrats.com \"Activist Alert\" message sent out Wednesday, and signed\nby Fertik. \"Thailand has been taken over by a military regime hostile\nto good American jobs in our science industries.\"\n\nHuh?\n\nBeneath Fertik's name, the message continued with a screed from the\nWashington-based lobbying organization USA for Innovation:\n\n     The military has stolen money from Americans through the imposition\nof capital controls, has passed new discriminatory business laws\nagainst Americans working in Thailand, and is now stealing American\nmedical innovations -- a direct attack on hundreds of thousands of\nAmerican scientists, doctors, teachers and researchers....\n\nUSA for Innovation is a non-profit advocacy group whose primary purpose\nis to lobby for maximum strength intellectual property protection for\nAmerican corporations. Its founder and executive director is Ken\nAdelman, a current member of the Defense Policy Board and long time Don\nRumsfeld crony.\n\nUSA for Innovation's beef has to do with the decision by Thailand's\nMinistry of Health to issue compulsory licenses breaking the patents on\na couple of AIDS drugs made by multinational pharmaceutical companies,\nincluding Merck's Efavirenz and Abbott Laboratories' Kaletra. The\nshowdown has nothing at all to do with the outsourcing of jobs; it is,\ninstead, ground zero in a globally intensifying struggle over making\nstate-of-the-art drugs affordable for sick people in developing\ncountries. Abbott Laboratories was initially so enraged by Thailand's\neffrontery that the company has threatened to stop introducing any of\nits new drugs in Thailand, but it has since backed down and offered to\nsell Kaletra at a greatly reduced price.\n\nA good argument can be had over exactly what kind of intellectual\nproperty protections are necessary to ensure that research and\ninnovation in the pharmaceutical industry continues forward, while at\nthe same time ensuring that poor sick people in the developing world\ncan afford the medicines they need to stay alive. One can also be\nrightfully leery of what direction Thailand's military junta is taking\nthe country. But that doesn't make it any less bizarre to see\nDemocrats.com jumping on the Adelman bandwagon, and aligning itself\nwith the reactionary views of the Wall Street Journal's editorial page.\nIndeed, Democrats.com is setting itself against the Democratic Party's\nmost recently unveiled trade platform, which includes a plank\nadvocating fairly priced drugs for developing nations. And to give this\nwhole incongruous spectacle a final scoop of irony on top, consider\nthis: the democratically elected government of Premier Thaksin\nShinawatra was the pro-globalization regime anxious to sign exactly the\nkind of free-trade deal with the U.S. that Democrats are traditionally\nuncomfortable with, and spent a good part of the last election cycle\nsuccessfully bashing Republicans for pushing.\n\nThe most charitable explanation one could make for Fertik's endorsement\nof Adelman's corporate front group propaganda is that he just wasn't\npaying attention, and bought into the bogus framing of the issue as a\n\"outsourcing\" outrage. If so, he might want to think about sending out\na follow up. Whose side does he want the Democratic Party on? Doctors\nwithout Borders, and poor people suffering from AIDS, or Ken Adelman,\nBig Pharma, and the Wall Street Journal's editorial page writers?\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}