{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Best Investment Advice in the Industry with a 29.9% gain.", "body": "Dear Cabot Wealth Advisory Reader,\n\nIf you've been following my commentary in Cabot Wealth Advisory in recent\nmonths, then it will come as no surprise to you to learn that Chinese\nstocks continue to be among the strongest in the world.\n\nAs a result, Cabot China & Emerging Markets Report remains the\ntop-performing investment letter over the past 12 months (according to the\nHulbert Financial Digest), with a gain of 29.9%.\n\nLast year it was the top-performing advisory letter in the country, with a\ngain of 76%!   And over the past three years it boasts a 19.98% annualized\nreturn vs. 13.31% for the dividend-reinvested Wilshire 5000.\n\nOver the next three years . . . who knows?  My bet is that Cabot China &\nEmerging Markets Report will continue to beat the Wilshire simply because\nit invests in faster-growing countries.\n\nWe all know the Chinese economy is screaming along at an incredible rate,\nas productivity improves and millions of previously under-used citizens\nfind gainful employment.\n\nBut China is not alone.  While the U.S. struggles to grow at a 4% rate,\nBrazil, Russia and India are all making up for lost time, and the best\nstocks in these countries are soundly trouncing American stocks!\n\nCheck out these recent winners:\n\nCtrip.com, up 130%\nFocus Media, up 91%\nChina Mobile, up 51%\n\nNot all of the stocks recommended are high-risk stocks.  For example,\nCabot China & Emerging Markets Report recently recommended a Russian\ntelecom (call it the AT&T of Russia), a Russian food company and a\nBrazilian energy company.\n\nIf your investments have been limited by a focus on American stocks, I\nsuggest you add a little spice to your portfolio by investing in China and\nother fast-growing economies.\n\nIn the long run, the prospects for growth are much better in those\ncountries.  It's as simple as that.\n\nSo try it out today!  I've arranged a special offer for readers of Cabot\nWealth Advisory, and you can access it by clicking the link below.\n\nhttp://cabotmail.net/t/183832/13148861/92/0/\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n\nP.S.  There's no time like the present . . . especially when you're\ndealing with investments.  Please visit \nhttp://cabotmail.net/t/183832/13148861/92/0/ and sign up today.\n\n==\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=183832&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}