{"category": "ham", "to_address": "Robert A LaBudde <ral@lcfltd.com>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] bivariate normal distribution in likelihood", "body": "On Tue, 1 May 2007, Robert A LaBudde wrote:\n\n> At 11:32 PM 4/30/2007, Deepankar wrote:\n>> Hi all,\n>>\n>> I am trying to do a maximum likelihood estimation. In my likelihood\n>> function, I have to evaluate a double integral of the bivariate\n>> normal density over a subset of the points of the plane. For\n>> instance, if I denote by y the y co-ordinate and by x, the x\n>> co-ordinate then the area over which I have to integrate is the\n>> following set of points, A:\n>> A = {x>=0 & y < 3x+10}\n>>\n>> I have used the following code to calculate this double integral:\n>>\n>> x <- rmvnorm(100000, mean=me, sigma=sig)\n>> c <- nrow(x)\n>> x1 <- x[ ,1]\n>> x2 <- x[ ,2]\n>> e1 <- as.numeric(x2 < 3*x1 + 10 & x1>0)\n>> p1 <- sum(e1)/c\n>>\n>> In this code, I provide the mean and covariance while drawing the\n>> bivariate random normal variables and get \"p1\" as the required\n>> answer. The problem is that I have to draw at least 100,000\n>> bivariate random normals to get a reasonable answer; even then it is\n>> not very accurate.\n>>\n>> Is there some other way to do the same thing more accurately and\n>> more efficiently? For instance, can this be done using the bivariate\n>> normal distribution function \"pmvnorm\"? Also feel free to point our\n>> errors if you see one.\n>\n> Simple random sampling is a poor way to evaluate an integral\n> (expectation). It converges on the order of 1/sqrt(N).\n\nWhich is no worse than other general schemes in high dimensions or \nwithout smoothness assumptions on the integrand.\n\n> Stratified random sampling would be better, as it converges on the\n> order of 1/N.\n\nYour reference for this result, please.  (As stated it is untrue, so I \npresume the stratification scheme depends on N and there are smoothness \nassumptions.)  (BTW, the reference for the results I quote is 'Stochastic \nSimulation' (1987).)\n\nWe have not been told 'me' and 'sig', and depending on their values it is \nquite possible that importance sampling would do a great deal better than \nsampling from the specified bivariate normal.\n\n> Even better is product Gauss-Hermite quadrature which will give a\n> very accurate answer with a few dozen points.\n\nThis is a correlated bivariate normal, and product quadrature methods can \nbe arbitrarily bad for such integrals (as people find out for mixed linear \nmodels).\n\nWhat you can do is transform to a pair of uncorrelated normals, and for a \nset of the form A as given this transforms to a similar form.  And for \nthat an iterated integral can be done easily as the inner integral over y \nwill just be a call to pnorm.\n\nSpecifically, there is another normal z such that x and z are independent \nand y = z + a*x for some a.  Then A = {x > 0 & z < (3-x)*x + 10} can be \nintegrated over z conditional on x and then over x.\n\n\n> ================================================================\n> Robert A. LaBudde, PhD, PAS, Dpl. ACAFS  e-mail: ral@lcfltd.com\n> Least Cost Formulations, Ltd.            URL: http://lcfltd.com/\n> 824 Timberlake Drive                     Tel: 757-467-0954\n> Virginia Beach, VA 23464-3239            Fax: 757-467-2947\n>\n> \"Vere scire est per causas scire\"\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}