{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "\"Tahir Amin\" <tahirmamin@gmail.com>", "subject": "[Ip-health] Doubts over India's Aids figures", "body": "--\n[ Picked text/plain from multipart/alternative ]\n Doubts over India's Aids figures\n* Current estimates for the number of people in India with the HIV/Aids\nfigures could be greatly exaggerated, a leading Aids worker says. *\n\nThe UN says 5.7 million people in India have the HIV virus, the highest\nnumber in the world.\n\nBut Ashok Alexander, of the anti-Aids Avahan organisation says figures due\nout soon could be \"substantially lower\", the Associated Press reports.\n\nThe BBC has learned that the figure could be as low as three million.\n\nExperts say that the discrepancy between 5.7 million and three million could\nonly be explained by errors in the methods of calculating the numbers of\npeople with the HIV virus.\n\nIndia is about to embark on a new and expanded phase of its Aids control\nprogramme, with increased funding from the government and from international\ndonors.\n\n* 'Substantially lower' *\n\n\"The actual number we've come up with in aggregate is likely to be lower,\nand perhaps substantially lower,\" Ashok Alexander, director of Avahan, the\nIndian programme of the Bill and Melinda Gates Foundation, said, the\nAssociated Press news agency reports.\n\n  Mr Alexander said the new estimates were likely to be more accurate\nbecause they came from pre-natal clinics, high risk groups and from the\ngovernment's National Family Health Survey.\n\nHe said that this was a far more accurate way of collating the figures than\nprevious estimates which only relied on details provided by pre-natal\nclinics.\n\nMr Alexander declined to speculate on what the new total would be, pointing\nout that data is still being assessed and exact details will not be\navailable for a few more weeks.\n\n* Backward *\n\nLast week, India health officials said they were alarmed by the growing\nnumbers of pregnant women infected with HIV/Aids in the northern states of\nUttar Pradesh (UP) and Bihar.\n\nThey are among India's most backward, with huge populations but poor\nliteracy and health services.\n\nOfficials say workers who migrate to cities in search of work bring the\ninfection back to the states with them.\n\nThey said that unless the state governments got serious about tackling the\ndisease, there could be an Aids epidemic.\n\n Story from BBC NEWS:\nhttp://news.bbc.co.uk/go/pr/fr/-/2/hi/south_asia/6735155.stm\n\nPublished: 2007/06/08 16:17:51 GMT\n\n(c) BBC MMVII\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}