{"category": "ham", "to_address": "\"Liserio, Martin (RBC Dain)\" <Martin.Liserio@rbcdain.com>,\n   samba-technical@lists.samba.org", "from_address": "William Jojo <jojowil@hvcc.edu>", "subject": "Re: Currently on 3.0.10 and want to upgrade\n to 3.0.25a", "body": "\n\n---- Original message ----\n>Date: Tue, 26 Jun 2007 12:52:22 -0400\n>From: \"Liserio, Martin (RBC Dain)\"   \n>Subject: Currently on 3.0.10 and want to upgrade to 3.0.25a  \n>To: \n>\n>First, can I make a jump that far? Second, when I untar'd the\n>opt-samba-3.0.25a-AIX.tar I only got one .bff file. Is this all there\n\nYou need the base too.\n\n>is? Seems to me to be a big jump. Does 25a have all of the changes\n\nYup.\n\n>needed between 10 and 25a? I've never installed samba and don't know\n>much about it. Do I need to remove 3.0.10 first. I didn't see that on\n\nYou can remove the old version *AFTER* you've performed the upgrade. If you're looking for continuity between versions, you'll need\n\nsmbpasswd\nsecrets.tdb\nwinb*.tdb\naccount_policy.tdb\ngroup_mapping.tdb\n\nUnless, of course, you're setup for LDAP, then you should only need:\n\nsecrets.tdb\naccount_policy.tdb\n\nBut don't throw anything away until you know that your environment is still working as expected.\n\nYou may also want to review the release notes on the Samba site since a *lot* has changed over the last 15+ updates. :-)\n\n>the instructions. I'm all set to install on a test box, but, I'm afraid\n>to pull the trigger. \n> \n\n\"You know what to do with that gun, Doc.\" :-)\n\n\nCheers,\n\nBill\n\n\n>Thanks for your help,\n>\n>Martin Liserio\n>\n>RBC Dain Information Services\n>\n>Assoc. Unix Admin.\n>\n>martin.liserio@rbcdain.com  >\n>\n>Work 612-607-8862\n>\n> \n>_______________________________________________________________________\n>\n>RBC Dain Rauscher does not accept buy, sell or cancel orders by\n>e-mail, or any instructions by e-mail that would require your\n>signature. Information contained in this communication is not\n>considered an official record of your account and does not supersede\n>normal trade confirmations or statements.  Any information provided\n>has been prepared from sources believed to be reliable but is not\n>guaranteed, does not represent all available data necessary for making\n>investment decisions and is for informational purposes only.\n>\n>This e-mail may be privileged and/or confidential, and the sender does\n>not waive any related rights and obligations.  Any distribution, use\n>or copying of this e-mail or the information it contains by other than\n>an intended recipient is unauthorized.  If you receive this e-mail in\n>error, please advise me (by return e-mail or otherwise) immediately.\n>\n>Information received by or sent from this system is subject to review\n>by supervisory personnel, is retained and may be produced to\n>regulatory authorities or others with a legal right to the information.\n\n"}