{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Lifestyle Newsletter May 31, 2007", "body": "\nhowstuffworks® | lifestyle May 31, 2007\nRSS\n  \n How Pirates Work\n In \"Pirates\nof the Caribbean,\" Johnny Depp shows us a\ncomical view of piracy, but pirates are actually a real menace that have\nexisted throughout maritime history. Today pirates are a threat to merchant\nships, cargo vessels, cruise lines and even private boats enjoying some time on\nthe water. Discover the seedy world of piracy, learn some pirate history and find\nout whether anyone really was made to walk the plank.\nAlso at HowStuffWorks\n \n\nBreast\nCancer In-Depth - Breast\ncancer affects more than 200,000 women in the United States every year, though it\ncan even be found in men. In this article, learn everything you need to know\nabout breast cancer, including facts about about early diagnosis, risk factors and options\nfor treatment.\n \n\nHow\nHomeschooling Works - Up to 2\nmillion children may be homeschooled in the United States, but it's a subject\nthat we don't often hear about. It's also a practice that's been gaining\npopularity in recent years. Find out how homeschooling works and the methods\nused by parents in educating their children.\n \n\nHow\nFreemasons Work - George\nWashington was one. So were Benjamin Franklin, Paul Revere and Henry Ford. All\nof these illustrious and influential men were Freemasons (or Masons) --\nprivileged members of the world's oldest and largest fraternity. Learn about\nthe Freemasons, an enigmatic society with 5 million members worldwide.\n\n\n\nThis Week's Video\n\nBeer\nMyths - Beer\nbefore liquor makes you sicker? Just another myth that's been spread to tarnish\nbeer's good name. In this video from HowStuffWorks, watch as we dispel some\ncommon myths about beer.  This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved "}