{"category": "ham", "to_address": "Andy Spieherty <spiehera@lafayette.edu>,\n   Perl 6 Internals <perl6-internals@perl.org>", "from_address": "Allison Randal <allison@perl.org>", "subject": "Re: [perl #42619] t/stm/llqueue_2.pir sometimes hangs", "body": "Andy Spieherty wrote:\n> On Thu, 19 Apr 2007, chromatic via RT wrote:\n> \n>> On Thursday 19 April 2007 11:35, Andy Spieherty wrote:\n>>\n>>> While trying to run 'make test' today, t/stm/llqueue_2.pir hung and had\n>>> to be killed manually.  Trying it again, I got an out-of-memory error\n>>> The hanging behavior appears to be intermittent.  I haven't been able\n>>> to identify conditions under which it reliably occurs.  I realize this\n>>> is a TODO test, but it shouldn't hang.  Perhaps it should just be skipped.\n>> Probably so.  I have an idea what it is, but I haven't quite fixed it yet.\n>>\n>> Does the attached patch make the test pass, or at least not take up so much \n>> memory?\n> \n> [ turning on gc]\n> \n> Alas, no.  Today I couldn't get stm/llqueue_2.pir to hang.  It just exited \n> with a \"PANIC:  Out of mem\" error with or without your suggested patch.  \n> I have no idea what that means.  And if I can't pin it down any better \n> than that, I don't exepct there's much you can do, unless it's failing for \n> you too.\n\nIt fails for me too (MacOSX 10.4.9, Intel Core 2 Duo), but it was marked \nas TODO for the release.\n\nt/stm/llqueue............................ok 1/2 \n      #     Failed (TODO) test (t/stm/llqueue.t at line 59)# \ngot: ''#     expected: 'sum is 4950# '# './parrot -D40 --gc-debug \n\"/Users/allison/projects/svn/parrot/t/stm/llqueue_2.pir\"' failed with \nexit code [SIGNAL 11]\n\nchromatic, your patch does seem to fix the problem for me, but then so \ndoes running 'make realclean'. (I've been getting intermittent test \nhangs with STM on various different tests for a few weeks now, and they \nalways go away when I run 'realclean'. And, when I set out to track them \ndown, they disappear.)\n\nAllison\n\n"}