{"category": "ham", "to_address": "\"Zombie V. Warwick\" <ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"IRS e-News for Small Businesses\" <sbse@lists.qai.irs.gov>", "subject": "IRS e-News for Small Businesses", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ne-News for Small Businesses                                                                      May 9, 2007\n\n\n\n\nTax Resources for Small Businesses\nSmall Business and Self-Employed One-Stop Resource\nSmall Business Forms and Pubs\nSmall Business Events\ne-File for Businesses and Self-Employed\nBusinesses with Employees\nSmall Business Products\nSelf-Employed Individuals\nS Corporations\n\nOther Resources\nFind it Fast!\nAll Forms and Pubs\nElectronic IRS\nFederal Tax Gap\nRetirement Plans\nTax Information for Charities and Other Non-Profits\nState Links\nOther Agencies\nSSA/IRS Reporter\nBack to Top\n\n\n\n\n\nIssue Number:    2007-16\nInside This Issue\n\n\nIRS Clarifies Form 2290 Issue\nSelf-Employment Tax Topics on IRS.gov\nDo You Know How to Claim Business Use of Your Vehicle?\nNew Publication for Green Card Holders Explains U. S. Taxes\nTax Relief in Disaster Situations\nRecent IRS Announcements for Small Businesses\n\n\n\n\n\n  1.  IRS Clarifies Form 2290 Issue\n\n\n\nThe IRS has received several inquiries about Form 2290, Heavy Highway Vehicle Use Tax, in the case of vehicles used and subsequently sold in the same tax period of July 1 through June 30. \nThe person acquiring the vehicle during the tax period is required to report and pay the tax due for the remaining months of the tax period and is not required to provide the previous owner's Schedule 1 to the IRS. \nThe current owner's receipted Schedule 1 is used as proof of payment when registering a vehicle with the State. Related Link:\n\nForm 2290 instructions  \n\n\nBack to Top\n\n  2.  Self-Employment Tax Topics on IRS.gov\n\n\n\n IRS.gov covers self-employment tax topics, including:\n\nWhat is self-employment tax?\nHow to pay self-employment tax\nEstimated taxes\nWho must pay self-employment tax\nAre you self-employed?\n\n\nBack to Top\n\n  3.  Do You Know How to Claim Business Use of Your Vehicle?\n\n\n\n There are two methods for claiming business vehicle expenses: actual expenses or the standard mileage rate.\nBoth begin with complete and accurate mileage records such as a written travel log for each business use of your car or truck. \nYou can use the records to compute the percentage of business use and apply that against the total car operating expenses for the year.\nOr, you can use the records to compute the deduction using the standard mileage rate. The 2007 standard mileage rate for the use of a car (including vans, pickups, or panel trucks) is 48.5 cents per mile for business miles driven.\nIf you do not have a clear and accurate business mileage record, the IRS may disallow the deduction.\nRelated Links:\n\nPublication 463, Travel, Entertainment, Gift, and Car Expenses\nPublication 535, Business Expenses\nFS-2006-26, Car and Truck Expense Deduction Reminders  \n\n\nBack to Top\n\n  4.  New Publication for Green Card Holders Explains U. S. Taxes\n\n\n\n Publication 4588, Basic Tax Guide for Green Card Holders, addresses the tax issues of resident aliens (Green Card Holders). Resident aliens are lawful permanent residents of the U.S. They are treated as U.S. residents for income tax purposes and, with certain exceptions, pay tax on worldwide income, no matter what the source  Related Link:\n\nBasic Tax Guide for Green Card Holders: Understanding Your U.S. Tax Obligations \n\n\nBack to Top\n\n  5.  Tax Relief in Disaster Situations\n\n\n\n No one wants to experience a disaster, such as the recent Kansas tornado, but worse than a disaster is not being prepared for one. \nSpecial tax law provisions may help taxpayers recover financially from the impact of a disaster, especially when the President declares their location to be a major disaster area. \nIRS offers several publications to help you understand the tax relief available in disaster situations:\n\nPublication 2194B, Disaster Losses Kit for Businesses\nPublication 584B, Business Casualty, Disaster, and Theft Loss Workbook\nPublication 547, Casualties, Disasters and Thefts   \n\n\nBack to Top\n\n  6.  Recent IRS Announcements for Small Businesses\n\n\n\n IR 2007-94, IRS Draft Form 1120-F and New Schedule M-3 (1120-F) Now Available for Public Comment\nNew Electronic Filing Requirement for Small Tax-Exempt Organizations\n\n\nBack to Top\n\n\nThank you for subscribing to this IRS e-mail service.\nThis message was distributed automatically from the mailing list e-News For Small Businesses. Please Do Not Reply To This Message. To unsubscribe from this list, send a blank e-mail to Unsubscribe.\n\n\n\n\n\n"}