{"category": "ham", "to_address": "<cc-community@lists.ibiblio.org>", "from_address": "\"Kevin Phillips (home)\" <tacet@qmpublishing.com>", "subject": "Re: [cc-community] Strayform - where artists and fans connect\n\ttofund and distribute new creative works", "body": "\n----- Original Message -----\nFrom: \"drew Roberts\" \nTo: \nSent: Tuesday, May 15, 2007 9:16 PM\nSubject: Re: [cc-community] Strayform - where artists and fans connect\ntofund and distribute new creative works\n\n\n> On Tuesday 15 May 2007 03:19 pm, dream dream wrote:\n> > I am the founder of a new company, Strayform.  The goal of\n> > the site is provide an alternative means for musicians,\n> > programmers, movie producers, and authors to fund,\n> > publicize, and distribute their works.  I would like to\n> > get feedback on the concept and the site itself.\n> >\n> >\n> >\n> > – The Philosophy –\n> >\n> > Historically publishing companies provided many useful\n> > services for creative producers.  They provided equipment\n> > and facilities, funded artists, developed worldwide\n> > distribution channels, and publicized and advertised on\n> > artists\n> > \u001b$B!G\u001b(B behalf.  But as time went on the industry became\n> > bloated and corrupt.  Artists have been forced into\n> > restrictive contracts, lost control of the copyrights, and\n> > given small cuts of the revenue.  Consumers have been\n> > forced to pay exorbitant prices and suffer DRM and nasty\n> > lawsuits.\n> >\n> >\n> >\n> > But the industry has undergone massive change.  In the\n> > Internet age, the functions of the media industry are\n> > being taken over by consumers and artists themselves.  The\n> > price of equipment has dropped so that individuals can now\n> > create professional quality productions independently.\n> > Fans now use blogs, messengers, and e-mail to spread the\n> > word about what they like.  There is no longer a need to\n> > ship CDs, books, or DVDs as File sharing services offers a\n> > costless distribution method.\n> >\n> >\n> >\n> > The only missing piece now is \u001b$B!H\u001b(Bfunding\u001b$B!I\u001b(B.  While file\n> > sharing is great, the result of unchecked piracy will\n> > leave artists with no way to make money and therefore no\n> > incentive to produce new media.\n>\n> If you want more support, you might want to consider rewording this piracy\n> theme for one.\n>\n> Also, even if artists do not make money from\nproducion/copying/distribution,\n> that does not leave them with no way to make money. (It may restrict their\n> options, but it does not leave them with no options at all.) You don't\nneed\n> to overstate the case.\n\nI very much agree with Drew's statements here.  It's the recording\nindustry's favourite smoke and mirrors trick to cut hobo shaped silhouettes\nfor musicians on the assumption that if they can't afford studio time then\nthey can't afford to eat.\n\nI know a whole bunch of musicians personally who release free music in\nvarious license forms (some copyright, creative commons, even PD) who have\nno delusion that they're going to pay their mortgage from the royalties.\n\nMike's post about the Chinese situation was spot on, they're ahead of the\ngame because of the \"lost cause\" nature of the target market.  Yet artists\nthere still continue to make a good living in such a cd-hostile environment.\n\n> > It is time for the\n> > funding model to evolve.\n>\n> Experiments welcome here.\n\nI've looked into several possibilities here in the UK.  There's a number of\nprojects which gain government funding for \"charitable work\", or \"community\nwork\" which benefits others at reduced or no cost.  We have a community\nstudio locally for instance, I could record stuff there cheaply, or continue\nto do as I do now and record stuff in my own home setup.  I'm not sure if a\nband could run as a registered charity, though it's an interesting concept\n;)\n\n> > Historically, bundled into the\n> > cost of each CD or book is the cost of production and\n> > distribution.  But now with the internet distribution is\n> > nearly costless.  Let\n> > \u001b$B!G\u001b(Bs move the payment forward to the point of creation.\n>\n> That is one option. Worth an experiment in my book.\n\nThere's a band called The Crimea who are doing something like this already,\nthey offer the CD for those folks who want something tangible (or high\nquality), but also offer their latest album for download completely free of\ncharge.\n\nhttp://www.thecrimea.net/\n\nThey're smart enough to realise it'll benefit them in the longrun, as far as\ngigs and promotion goes.  Much like the Chinese situation.\n\n> > Recording companies pay artists upfront to create\n> > something new and then charge the consumers per copy; let\n> > \u001b$B!G\u001b(Bs have fans pay the artists directly and give them the\n> > freedom to use and share.  They will use this freedom to\n> > distribute and promote, providing a valuable service to\n> > artists.  The end result would be lower total costs, more\n> > freedom and control for artists and consumers, and new\n> > communities with strong ties between artists and fans.\n\nFans do pay the artists directly, every time they turn up to a gig or buy a\nt-shirt, or a high-def DVD surround sound limited edition recording.\nThere's no reason for the fans to pay for recordings anymore, as The Crimea\npoint out. The costs associated with writing and recording are a fraction of\nwhat they used to be, and the opportunities for the band to claw back the\ninvestment with merchandising and in the commercial space are massive.\n\n> > – The Site –\n> >\n> > With actualizing this vision in mind, I created\n> > www.strayform.com.  It works like a social network for\n> > artist and fans with specialized features to promote,\n> > fund, and distribute new media.  A library of CC licensed\n> > media leads to you to discover new artists.  Becoming fans\n> > of these artists and selecting media as one of your\n> > favorites allows us to rank and provide recommendations,\n> > while giving you specialized privileges and notifications.\n> >  People with similar interests surfing your pages use\n> > these connections and find new favorites and artists as\n> > well.  These massive connectivity provides a network that\n> > funnels interest into Proposals.  Proposals are artists\n> > \u001b$B!G\u001b(B offers to create new CC licensed media funded by fans.\n>\n> Unless htis is for BY and BY-SA works, I am not too interested. To me the\n> works are still mostly gonna be useless and pollution.\n\nThere was another website in the news recently which looked a lot like yours\nin concept, I forget the name.  This other website was making a song and\ndance (almost literally) about their first artist making a CD from monies\npledged by myspace fans.  I say great, whatever works.  Though when they\nfinally make their recording it wasn't clear if they'd then give the\nrecording away for free or start to charge for it.\n\nI've also heard of other schemes where funders are effectively investors.\nSo the whole thing becomes like the stock market with share values for\nartists etc.\n\nI would suggest building into your plan somehow the \"beyond music\" strategy\nof the Chinese, so artists using your site don't expect to make money from\nthe fans for the music directly.  There should be something else,\nmerchandising or signed pictures or whatever.\n\nMy 2p for what it's worth :)\n\nBest of luck with the venture Brandt! :D\n\nKevin\n\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}