{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "Showbiz Tonight <showbiz@mail.cnn.com>", "subject": "TONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT", "body": "\n\n\nCNN.com - Showbiz Tonight\n\n\n\n\n\n\n\n\n\n\nTONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT\n\nPARIS HILTON -- OUT OF JAIL!\nParis Hilton\nis out of jail; but what happens now? She isn't out of the\nwoods yet -- she is still on probation, and everyone is waiting\nto see if she really is a changed woman! Was Paris treated\nunfairly in jail? And given the cost and the media circus,\nShowbiz Tonight is asking: Was this all worth it? The answers\nto all these questions and more, tonight on TV's most\nprovocative entertainment news show.\n\nPARIS HILTON\n-- THE FIRST INTERVIEW!\nOn Wednesday,\nParis will do her first post-jail interview on CNN's \"Larry\nKing Live.\" What are the tough questions she needs to be ready\nto answer? Going forward, what image does she need to portray\nto repair her image? Showbiz Tonight rounds up the experts for\nadvice for Paris.\n\nPARIS HILTON -- THE TEACHER!?\nParis has received a million-dollar offer -- to be a\nteacher! What could she possibly be qualified to teach, and\nshould she take the gig? The inside story tonight on Showbiz\nTonight.\n\nSHOWBIZ TONIGHT QUESTION OF THE DAY:\nParis Hilton out of jail: Do you think she learned her\nlesson?\nVOTE AT CNN.COM/SHOWBIZ TONIGHT. \n\nSEND\nUS A VIDEO EMAIL!\nSend your response to the Question\nOf The Day on video. Look into your camera and tell us what you\nthink. Responses must be no longer than 30 seconds. To send\nyour video email, go to cnn.com/showbiztonight.Watch your video\nresponses on \"Showbiz Tonight\" at 11 p.m. ET/PT on CNN Headline\nPrime.\n\n\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the Showbiz Tonight list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=showbiz\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}