{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nA legendary figure of the religious right has passed\n  away. The Rev. Jerry Falwell died this afternoon. The cause of his death wasn’t\n  immediately disclosed, but he’s had a history of heart trouble. \n \nIn his life, he was seen as a visionary to some\n  conservatives and an archenemy to liberals. Falwell leaves a legacy of\n  founding the Moral Majority, bolstering the evangelical community and\n  sculpting it into a major political force. Our Richard Schlesinger will tell\n  the story of this influential man’s life.\n \nWe’ll also have a slate of in-depth interviews\n  with religious leaders, academics and public figures about Rev. Falwell’s\n  impact on religion and politics in America.\n \nIn other news, the search continues for information\n  about three U.S. soldiers\n  feared captured by an al Qaeda group during a weekend ambush in Iraq.\n  Troops have detained 11 people and questioned hundreds in connection with the\n  attack.  Sharyn Alfonsi is at Fort\n    Drum, New York,\n  where the troops killed and kidnapped last weekend were based. \n \nOne of the savviest ways companies are reaching kids\n  is through the Internet. But forget old-fashioned pop-up ads. What’s\n  targeting your children is fun for them and highly profitable for the\n  advertisers – it’s called “advergaming,” and John\n  Blackstone will report on the phenomenon for tonight’s installment of\n  “Gotta Have It: The Hard Sell To Kids.”\n \nPlease join us tonight for these stories and more.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}