{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Darren Winston\" <mawchekohomesfig@chekohomes.com>", "subject": "Melt away pounds with Anatrim", "body": "\nCheck out the wonders of pound melting\n\n\n\n\n\n\nAnatrim – The newest and most enchanting product for weighty people is now readily available – As seen on BBC.\n\n\nDo you remember all the times when you told yourself you would do any thing for being delivered from this fastly growing pounds of fat? Fortunately, now no big price is to be paid. With Anatrim, the ground-shaking pound-melting combination of elements, you can get naturally health life style and become really slimmer. Have a look at what our customers write!\n\n\n\n\"It’s unbearably difficult to acknowledge it but I was dreadfully addicted to food. \n\n\nI greedily swallowed up all this trash \n\n\nand just could not stop. \n\n\n\n\nThis suffering stopped after I started course with Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite decreased, \n\n\nspirits increased and I turned to the happiest person 19 pounds in 2.2 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person!\"\n\n\n\n\n\nLusia R., Las Vegas\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nYou can't even fancy how I abhorred being derided at school. \n\n\n\n\nI abhorred the weight and I detested even myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nIt literally pulled me out of this nightmare! Lots of thanks to you, guys.\"\n\n\n\n\n\nSteve Doubt, Las Vegas\n\n\n\n\n\n\"Know what? Thanks to Anatrim my marriage was happily saved! I fell down into the circle, depression – more eating – just more depression. My wife had thought to leave the overweight psycho I was turning in. \n\n\nOne of my friends showed me web page and I called for pack of Anatrim at the same time. \n\n\nThe results were excellent, my appetite came to normal level, I was often in good spirits, and, of course, I became able to tighten my belt on some holes. And you know, the bed became cool also!\"\n\n\n\n\n\nFrancis\n\n\n\n\n There is a great number of gratitudes happy people leave after taking Anatrim. Don’t you wanna join the tens of thousands of slim women and men and take this natural appetite-decreasing power increasing product now!\n\n\nDon’t lose your chance!\n\n\n\n\n"}