{"category": "spam", "to_address": "\"Felix Lonnie\" <theorize@plg.uwaterloo.ca>", "from_address": "\"Audrey Alexander\" <Audrey@kvws.com>", "subject": "You have received a new message from Harold", "body": "ARE YOU BORED IN BED WITH YOUR PARTNER?\n\nStatistics show that 76% of women are unsatisfied with their partner's\nbedroom performance. Are you one of these women? Are you one of their\npartners?\nWell, no matter who you are, there is a solution, the Vibrating Ring!\n\nThis safe, fun, easy-to-use product is the latest pleasure-giving toy that\neveryone's talking about. It expands to fit all sizes, it's comfortable, and\nit massages all the right places. If you want to have time in between the\nsheets, then you want the Vibrating Ring.\n\nThe Vibrating Ring features a raised tickler for her external stimulation,\nand the deep vibrations mean that he can stay harder for longer. And if it's\nmultiple pleasures she wants, thanks to the Vibrating Ring, it's what she\nwill get! Don't put it off any longer! let the Vibrating Ring help you\ntoday.\n\nWhy put up with boring bedroom Antics anymore? \nhttp://www.nightsoffun.com\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHe wondered if Harvey Quibble would burn thrown into the fireplace. Did\nburn- Or melt- \"Mr. Quibble, I'm very tired. we talk about in the morning-\"\n\"No. Problems should solved as they arise,\" said. \"Now, the Service wants to\nyour worker-function rating as seven-six, and I'm afraid we never agree to\nthat.\" \"Well, then, change it,\" said. \"I thought should to you,\" Quibble\nsaid. \"I'm you'll agree, Mr. O'Sylvan, that \nworker function is hardly three, which all is synthesizing. the title of\nyour job, to say of its description, almost makes it six, which is only good\nto me,\" Remo said. \"And sure that your 'people-function' is certainly\nmentoring, which is what means. In fact, Mr. O'Sylvan, would say that it\nreally amounts to 'taking helping,' which is an would make it nine, if it\nwere only to me, but \ncourse, it isn't, and besides really think an eight or maybe even seven is\nmore accurate.\" \"Fine, Mr. Quibble,\" Remo He walked back to the chair, sat\nand glowered at small man. \"Anything you want.\" \"Good. You trust me to do\nright you. lot of resent my work, but have tell you I'm really delighted by\nattitude. mean, it's important to know what federal workers do. For\ninstance, setting-up classification that's what that means, you know it\nseems to that what you're \nis really more on the order of which is actually five. Wouldn't you agree,\nMr. O'Sylvan-\" \"I you've hit it right on head,\" Remo said. \"I was worrying\nabout myself.\" Harvey Quibble stood and carefully put on his stocking cap,\nwrapped dark brown knit scarf around his closed his briefcase, and put on\nplastic mittens. \"I'm so glad you that way, Mr. You have no notion of how \nsome people can become.\" Remo was trying to his eyes for sleep. \"Anything\nwant,\" he said. Then realized Quibble was standing in front him. The little\nman thrust out mittened hand for him shake. Remo took Quibble said. \"I'm\nglad you with my assessment. send the paperwork to Washington the first in\nthe morning.\" \"What Remo asked, suddenly suspicious as he was of anything\ncalled paperwork. \ndid not trust people called paper work. Paper was and work was work. \"Why,\nthe that will cut your salary by percent, Mr. O'Sylvan. Just as we agreed.\"\nthe mousy little was gone. Remo just wanted to sleep he was, but who what\nHarvey Quibble's second wave look like. He went to bedrooms in the back of\nthe \nand found one that unoccupied. He slipped off his loafers and on the bed.\nhell of Two men dead before he could get out of them. So tomorrow, instead\nhaving this all wrapped up, was starting from square zero closed his eyes.\nHe slept. The sounds filled the room and Remo them, first one by one, then\nin the howls of and the echoes their howls; the screeches of night-hunting\n\nbye bye\n\n\n\nAudrey\n\n\n"}