{"category": "spam", "to_address": "<the00@plg2.math.uwaterloo.ca>", "from_address": "\"survival\" <zlgfo@simpletech.com>", "subject": "This greenfield assembly line is the first plant of Skoda Auto outside Europe.", "body": "CDPN Starts Huge Campaign! Watch For News!\n\nChina Datacom Corp.\nSym: CDPN\nPrice: $0.08\n\nCDPN, in the news 8 months ago for purchasing Supremacy International\nand entering the new G3 Market, is beginning a huge marketing campaign.\nWatch for the news and get ready for the ride! Get on CDPN firs thing\nFriday!\n\n\"Even customers who have not received mailers, can avail of this\nfacility.\nIf techie cute is what gets your adrenalin pumping, hop across to the\nAudi corner which stars two delightful debutantes.\nApache is a 15occ motorcycle and comes powered by a 13.\nThe stately Merc gets a snazzier look with a new S Class model.\nHonda's GM (marketing) Rajive Saharia said the volume segment will turn\nout to be significant for all auto firms in the time to come. They had\nindicated that time that another hike was possible before the end of the\nyear. The company recently launched Suzuki Swift in the Indian market\nand saw a tremendous response from the Indian customer.\nBut sales have been sluggish this year due to a cyclical slowdown. If\ntechie cute is what gets your adrenalin pumping, hop across to the Audi\ncorner which stars two delightful debutantes. \"The owners need not\nnecessarily sell off their Qualis.\nThe entry-level notchback will be smaller than the Chevrolet Optra.\nBut the continuous escalation in input costs and logistics are\ncompelling us to plan a price increase on our models very soon.\nBowing to a price-sensitive market, GM is scaling down its Corsa output\nand offering huge price cuts on its slow selling models (1.\nThe auto crowd will be watching this delegation closely.\nWhile the production of the 100,000th vehicle was achieved in four years\n(1999-2003), the second lakh came in around two years' time, the company\nsaid in a statement here today.\nThe powertrain is modern with VGIS (Variable Geometry Intake System)\ntechnology and has been fine tuned to provide class leading fuel economy\nalong with amazing drivability.\nBut the continuous escalation in input costs and logistics are\ncompelling us to plan a price increase on our models very soon.\nThe new look car with VTEC engine, offers undisputed combinationof power\n(over 100 bhp) and fuel efficiency in the segment. Hyundai Motor India\npresident, BVR Subbu, also said the firm has decided to go for more\ndirect contact programmes with prospective buyers.\n\n"}