{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Sean McMahon\" <smcmahon@usgs.gov>", "subject": "Re: Thinkpad Saga Continues", "body": "Glad to hear you got it working Beth!  Just out of curiosity, shouldn't the \nparticianing software for your linux system have found your Windows partician \nand created a new partician for linux?  I'm curious because I, one day, want to \nhave a duel-boot system and thought from the docs I read that you could just \nhave the linux particianer resize the particians for you so Bill and the penguin \ncould live happily?\n----- Original Message ----- \nFrom: \"Beth Hatch\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Thursday, April 12, 2007 8:46 AM\nSubject: Thinkpad Saga Continues\n\n\n>\n>\n> Hi everyone,  Because so many of you kindly posted on this list and\n> privately to me concerning getting Linux on my Thinkpad, I figured I\n> would update you all on what has happened in case it saves some of you\n> the trouble and annoyance I have been experiencing lately.  I'm\n> sure those of you more knowledgeable than myself on this may have been\n> able to resolve it better and quicker, but I'm still learning, as you\n> will soon see.\n>\n>\n>\n>    My machine came with a 120 gigabyte hard drive with a 30 gigabyte\n> rescue partition containing the computer's recovery files, the other\n> partition was taken up by Windows XP and various Thinkpad and Windows\n> applications.\n>\n>    First, I tried to hook up the docking station and install Fedora\n> using the docking station's serial port to have Speakup talk for me.\n> Speakup could not be found when I specified my Dectalk express as the\n> synthesizer, whether I specified a tty port by naming it specifically as\n> suggested by Janina or by having Speakup find it without specifying the\n> tty port.  Consequently, in order to do my class assignments, I decided\n> to have my instructor assist me in installing Fedora and together we\n> got Gnome and Orca up and running.\n>\n>    When we tried to install Windows XP to set up the dual boot system,\n> my XP disk kept hanging at the hardware inspection portion of the\n> installation.  Believe me, if I didn't need this laptop for school which\n> requires Windows and Linux, I would just keep a Linux system!!\n> Lenovo tech support said on its web site to turn off the dual core\n> processor support in the bios temporarily to allow Windows XP to install\n> properly.  I had a friend assist me and we turned off the dual core as\n> directed.  We still couldn't install XP, same problem, XP hanging at the\n> hardware inspection process.\n>\n>    Just for grins, a fellow geek  friend who agreed to help me disabled\n> just about everything in the bios, just to get XP running, no go with\n> that either, same problem.  She tried a Windows 2000 disk, just to see\n> if she could see my Linux partition, and voila! Windows 2000 at least\n> figured out that Linux lived on my system and found the rescue\n> partition.  She nuked those partitions for me, and we are starting from\n> scratch!!  It seems that Linux and grub will see my Windows partition if\n> I install Windows *before* Windows, but Windows XP gets cranky and won't\n> see my Linux partition if I install Linux first and then try to install\n> Windows afterwards.  I realize that this sounds strange, so let me\n> clarify.  Since there were only two partitions, I had to break the\n> larger one to install Linux and the one for the rescue partition wasn't\n> big enough for Fedora with all of the other applications and data in the\n> rescue partition.  I didn't have access to something like partition\n> magic to rebuild the partitions, so we had to take this crazy route\n> instead.  This appears to be what happens at school with all of the dual\n> boot systems where XP and Fedora 6 are involved, Windows seems to be\n> happy being installed first, then Linux and grub set up the dual boot\n> properly.  XP is now on my machine, and I am going to try again to\n> install Linux.\n>\n>    Word to the wise, if you have a Thinkpad, the serial port appears to\n> be disabled by default in the bios.  We turned it on, and now I'm going\n> to try\n> again and see how it goes.  I'll keep you posted, unfortunately this\n> thing isn't over yet.\n>\n> Thanks for listening,\n>\n> Beth\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}