{"category": "spam", "to_address": "dziegler@plg.uwaterloo.ca", "from_address": "\"Lacy Calderon\" <powcincinnatimediadeq@cincinnatimedia.com>", "subject": "End the annoying obesity now", "body": "\nStop the painful craving for more food\n\n\n\n\n\n\nAnatrim – The very up-to-date and most exciting product for over-weight people is now available – As seen on Oprah.\n\n\nCan you count up all the situations when you said to yourself you would do anything to get rid of this desperately growing pounds of fat? Fortunately, now no great offering is expected. With Anatrim, the ground-shaking kilos-melting mixture, you can achieve healthier lifestyle and become really thinner. Have a look at what our customers write!\n\n\n\n\"It’s unbearably difficult to acknowledge it but I was a junk food addict. \n\n\nI swallowed up all this rubbish \n\n\nand was unable to stop. \n\n\n\n\nThis suffering ceased when I started course with Anatrim! \n\n\nOh, God,\n\n\n\n\n my appetite vanished, \n\n\nspirits improved and I’m the happiest person 29 pounds in 2.1 months. \n\n\n\n\nI can tell you now I’m the happiest person in the world!\"\n\n\n\n\n\nAmely S., Bellevue WA\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nIt’s pretty hard to imagine how I detested being ridiculed at school. \n\n\n\n\nI detested my stoutness and I abhorred myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nThis stuff literally pulled me out of this horror! A lot of thanks to you, my friends.\"\n\n\n\n\n\nRikky Martin, San Diego\n\n\n\n\n\n\"Know what? Anatrim kept my marriage intact! I got into this circle, depression – more eating – more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nMy best friend showed me web site and I ordered pack of Anatrim at once. \n\n\nThe final result was magnficent, my appetite came to normal level, I was often in a good mood, and, certainly, I became able to tighten my belt on some holes. And the bedroom became cool also!\"\n\n\n\n\n\nCharley\n\n\n\n\n There is a lot of sincere gratitudes happy people leave after taking Anatrim. Why don't you join the tens of thousands of slender men and women and try this original appetite-reducing power raising product now!\n\n\nDo not decline the opportunity!\n\n\n\n\n"}