{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Lenny Eldridge\" <laxctalumnivew@ctalumni.org>", "subject": "Achieve picture perfect weight and enjoy life", "body": "\nAchieve picture perfect weight and enjoy life\n\n\n\n\n\nAnatrim – The very up-to-date and most fascinating product for weighty people is now available – As were seen on CNN\n\n\n\nDo you see redundant body kilos kill more and more people around the planet? We know that you hate the unsightly appearance of people like those and the low status they have in society. \n\nMoreover, you have not the will to withstand pressure of ruinous eating habits of yours. If it sounds familiar, then we have something for you!\n\n\n\n\n\nHere Anatrim comes, the ultimate product for the elimination of your body’s extra weight. The astounding thing about Anatrim is it improves the quality of your life by soothing your feeling of hunger and giving you better cheer. Pay you attention to some notes received from our customers:\n\n\n\n\n\n\"It’s outstanding! \n\n\nInstead of watching TV continually and stuffing myself with food \n\n\nI became keen on taking exercise.\n\n\n\n\n\n\n Anatrim got me on the right path.\n\n\n I’m in a great fit now and lots of men fix their eyes on me!\"\n\n\n\n\n\n\nMaria H., Boston\n\n\n\n\n\n\n\"Passive weight reducing was of no result to me. It was difficult for me to hold back and not to eat something just at hand. \n\n\nOnce I was told about Anatrim my very best friend by and I was really impressed at the information.\n\n\n I had tried taking it, and my wife told me that I'm a different person now, 4 months later. \n\n\n35 pounds off and it’s not a limit! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nCharley Mock, Boston\n\n\n\n\n\nAnatrim helps you to understand that you got no such great need for that much food. It raises your mood up, provides you with energy, and attacks needless kilos. All thanks to its powerful distinguished formula!!\n\n\n\nWorm out more information!\n\n\n\n"}