{"category": "spam", "to_address": "<the00@plg.uwaterloo.ca>", "from_address": "\"Bradley Patterson\" <dreeszen@moldovatourist.info>", "subject": "Lotto Tickets from 50 countries around the world", "body": "\n\n\n\n\n\n\n\nLotteryagent (TM) is the only online service that enables you to actively and immediately \nparticipate in the biggest lottery games from around the world, providing you the opportunity to\nwin millions of dollars !Lotteryagent (TM) provides a wide variety of unique benefits:\nGlobal Service: buy lotto tickets from over 80 lotteries from all over the world\nFast and Easy: Buy the tickets and thelotter.com will check the results for you and notify you of\nyour winnings, which are directly transferred to the payment option of your choice.\nCredibility: thelotter.com has been providing the unique service for over 10 years, supervised by\none of the top international firms, and world-renown for its accurate and user-friendly service.\nSpecial Services: save your lucky numbers to make the purchasing process much easier and faster.\nIncludes all Leading Lotteries:\nPowerballMegaMillionsEuroMillionsUK National LotteryLotto 6/49And more...\nLotteryagent (TM) is the leading lottery service online, combining all the advantages and comfort \nof the internet with the exciting worldwide lottery opportunities.\n\nEuroMillions is a lottery game played weekly on Friday by millions of players from across Europe. \nThe game has participants from nine countries, including Austria, Belgium, France, Ireland, Luxembourg,\nPortugal, Spain, Switzerland, and the UK.  The prize pool is put together from stakes generated from\neach of the nine countries, and the main jackpot prize starts at 15 Million Euros.  If the jackpot is not won\nduring a specific week, the prize pool is 'carried over' to the following week.  The record for a single\nwinner is 115 Million Euros, and the highest jackpot ever was 183 Million Euros.  These huge jackpots have\nturned the EuroMillions Lottery into one of the most lucrative and exciting lotteries in the world.\n\nThe MegaMillions is one of the biggest lottery drawings in the United States, with a huge multi-state\naudience.  MegaMillions has a jackpot that starts at 12 Million Dollars, with additional prizes reaching up to\n250,000 Dollars.  The lottery can be played from 12 states at this stage, including: , Georgia, Illinois, Maryland,\nMassachusetts, Michigan, New Jersey, New York, Ohio, Texas, Virginia and Washington.  Mega Millions\ndrawings are held Tuesday and Friday nights at 11:00 p.m. eastern time by the Georgia Lottery in Atlanta.\n\nPOWERBALL is considered the leading lottery game in the United States, currently played in 31 States,\nand operated by the Multi-State Lottery Association (MUSL).\nPowerball is a lotto game that combines a large jackpot and a regular cash game, and is held every\nWednesday and Saturday night at 10:59 p.m. Eastern Time.   The prizes include the jackpot, and\ninclude additional winners ranging from 3 Dollars to 200,000 Dollars (second place). \nJackpots have reached over 200 Million Dollars in the past\n\nThe California Super Lotto is one of the most popular lottery draws in the United States, with jackpots\nstarting at 7 Million Dollars, and having reached 193 Million Dollars in the past. \nThe draw is held twice a week on Wednesday and Saturday, and the jackpot, if not claimed, is\ncarried over to next week, allowing it to grow to huge numbers.\n\nWelcome to Lotteryagent and good luck !\n\n \nIf you want to\nunlist your email click here...\n\n"}