{"category": "ham", "to_address": "\"=?ISO-8859-2?Q?Ivan_Krsti=E6?=\" <krstic@solarsail.hcs.harvard.edu>", "from_address": "\"Yeong Haur Kok\" <yeonghaur@gmail.com>", "subject": "Re: [sugar] Using Git / downloading activities and Memory problems", "body": "Hi Ivan,\n \n> are preloading an array of 26 images ~32K each and this crashes on the> olpc.Please provide more details. Memory allocation shouldn't *crash* the\nmachine under any (reasonable set of) circumstances; the OOM killermight kick in and destroy a few processes, however. In your case, you'reallocating less than a meg, so something is certainly wrong if it's\ncrashing. What kind of crash are you getting? Can you post the code andthe images somewhere where we can test this?\nThe program runs when images are scaled to 600 x 250 (using the gtk scale_simple function) or smaller. When we try to scale up to larger dimensions - e.g. 800 x 400 - it crashes. The application simply exits on it own.\n\n \nI tried replacing the images (to be loaded into the array) with smaller size (~19k) black and white images and the program runs alright. But when these are replaced with color images of similar size, the same problem occurs.\nHere's the relevant part of code, KEY_X and KEY_Y are the image dimensions we're trying to scale up (default 600 x 250):\n \n \n        self.dict_pixbuf = {}        alphastring = \"abcdefghijklmnopqrstuvwxyz\"                for i in range(len(alphastring)):            letter = alphastring[i]\n            self.dict_pixbuf[letter] = gtk.gdk.pixbuf_new_from_file(IMAGE_SOURCE + os.sep + \"keypress\" + os.sep + letter.upper() + \".gif\").scale_simple(KEY_X, KEY_Y, gtk.gdk.INTERP_BILINEAR)\n\n \nAny suggestions would be appreciated! Thanks!\n \n \nyh\n \nOn 6/22/07, Ivan Krstiæ <krstic@solarsail.hcs.harvard.edu> wrote:\nHi Aneto,Aneto Okonkwo wrote:> I have been having difficulty installing git on windows.  Does anyone\n> have any instructions I can use to download and set it up?Git still relies on a mudball of shell and Perl scripts, so getting itrunning under Windows proper is an uphill battle. The recommended way to\ndo it is to first set up Cygwin, which might be more trouble than you'rewilling to go through. Even then, it'll run quite slowly because ofcertain FS ops being substantially slower on Windows than on Linux.\n> Alternatively is there anyway to use git on the olpc itself, does anyone> have those instructions?As root, 'yum install git-core' should do it.> are preloading an array of 26 images ~32K each and this crashes on the\n> olpc.Please provide more details. Memory allocation shouldn't *crash* themachine under any (reasonable set of) circumstances; the OOM killermight kick in and destroy a few processes, however. In your case, you're\nallocating less than a meg, so something is certainly wrong if it'scrashing. What kind of crash are you getting? Can you post the code andthe images somewhere where we can test this?--Ivan Krstiæ <\nkrstic@solarsail.hcs.harvard.edu> | GPG: 0x147C722D\n"}