{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "Tonight on Newsnight & Newsnight Review", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tFRIDAY 25 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tToday's Quote for the Day:\n\n\n\"Russia, a country where you never hear of the gangsters of the Russian Mafia   any more. Why? Because they are now all in office.\" - Best-selling writer   Frederick Forsyth. \n\n\nIn tonight's programme:\n\n\nImmigration\n\n\nA clear majority of British people have told a BBC opinion poll that they agree with the Trade and Industry Minister Margaret Hodge in her controversial comments about immigration. She said \"British citizens should always get priority for social housing ahead of immigrant families.\" Her Labour colleague the Education Secretary Alan Johnson accused Ms Hodge of using the language \"of the BNP.\" \n\n\nNewsnight's Paul Mason has been hearing the views from the heartland of England - Nottinghamshire - about immigration, and we'll debate the issue with the Labour MP Keith Vaz and the leader of the BNP, Nick Griffin.\n\n\nIdentity Theft\n\n\nAt one time thieves targeted jewels or cash as the most lucrative form of crime, but nowadays information can prove just as attractive. Data theft is a growing criminal problem and one which is of increasing concern to the regulators. But very little is known about how stolen data is used. \n\n\nMartin Shankleman recently uncovered such a scam, and set out to see what happened next. We've also been asking about your experiences of identity theft. Have you been a victim? Do you think those who hold your details do enough to stop this kind of theft happening? Join the debate here. \n\n\nCLICK HERE TO POST YOUR COMMENTS\n\n\nNewsnight Deputy Leadership Debate\n\n\nAnd we are also looking for your help with a special programme Jeremy Paxman is hosting on Tuesday. He will cross examine the six candidates for the deputy leadership of the Labour Party in a Newsnight special. \n\n\nWe're giving you the whole bank holiday weekend to think about the questions you'd like Jeremy to put to them. Post your thoughts here and we'll arm him with the best ones on Tuesday night.\n\n\nCLICK HERE TO POST YOUR COMMENTS\n\n\nAnd finally...\n\n\nYou probably noticed that the Jokes Fit for an Eleven Year Old this week from Newsnight staff member \"Peter C\" were truly execrable. Here's one from another Newsnight staff member whom we'll call \"Peter B.\"  \n\n\nDid you hear about the explosion at the Roget's Thesaurus factory?\n\n\nOnlookers were shocked, amazed, stunned, taken aback...\n\n\nNewsnight will have our Thesaurus at the ready at 10.30 on BBC2.\n\n\nGavin \n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nHOW GREEN IS BLAIR?\n\n\t\t\t\t\t\t\tTony Blair has hinted the Bush administration might be won over at next month's G8 summit over climate change.  He gave an exclusive interview to Newsnight's environment analyst Roger Harrabin.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\nnewsnight review\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tNEWSNIGHT REVIEW FROM CANNES\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tNewsnight Review is at the 60th Cannes Film Festival this week and among the films our posse of Julie Myerson, Mark Kermode and John Harris have been to see are Persepolis, Iranian director Marjane Satrapi's full length tale of growing up during the Islamic Revolution. Deathproof, Quentin Tarantino's slasher movie, featuring Kurt Russell as Stuntman Mike on a mad killing spree. And Julian Schnabel's beautiful film, The Diving Bell and the Butterfly - Le Scaphandre et Le Papillon - which is based on the autobiographical novel by Jean-Dominique Bauby. I think it's a good bet for the Palme D'Or.\n\n\nOutside the competition there's the sole Brit at the festival, Michael Winterbottom's A Mighty Heart, based on the abduction and murder of US journalist Daniel Pearl and Control, Anton Corbijn's film about the death of Joy Division frontman, Ian Curtis. And I've spoken to Martin Scorsese about his World Cinema Foundation, Mick Jagger and sex.\n\n\nWe're broadcasting from a beachside pavilion, hoping the threatened thunder and lightning doesn't materialise but I'm sure they'll be plenty of sparks on the programme. \n\n\nJoin us to find out. \n\n\nKirsty\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}