{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@flax9.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "SatCon Joins Green Grid Consortium", "body": "\n\n\n\n\n\n\n\n\nSatCon Joins Green Grid Consortium\n\nBOSTON, May 02, 2007 (BUSINESS WIRE) --  SatCon Technology Corporation(R) (Nasdaq CM: SATC), a developer and supplier of power management and system architecture solutions for the alternative energy and distributed power markets today announced that it has recently joined The Green Grid as a contributing member. The Green Grid is a consortium of information technology companies and professionals seeking to lower the overall consumption of power usage in data centers around the globe. \"As technology industry leaders like SatCon continue to join our organization, we can more effectively provide insight to data center managers to help them reduce power consumption,\" said Roger Tipley, a director of The Green Grid. \"We're pleased that companies like SatCon continue to join The Green Grid, as power management solution providers are at the forefront of the effort to help the industry meet the need for energy efficiency standards.\" \"We are pleased to be a Contributor Member to The Green Grid,\" stated Clemens van Zeyl, President of SatCon Power Systems. \"Their focus on DC power distribution is a good fit for us with our history of high-power DC applications and their emphasis on energy efficiency is an excellent complement to our renewable energy product portfolio.\" SatCon, through its wholly owned Canadian subsidiary, was the first company in the world to supply high-power DC power electronics using IGBT power transistor technology. DC power distribution based on power transistor technology is recognized for its high efficiency and power quality, and is also a key feature in SatCon's alternative energy inverter products. To date, SatCon has supplied over 450 MW of high-power DC power distribution equipment utilizing IGBT technology, more than any other company in the world. SatCon's PowerGate(R) inverter brand is currently one of the leading inverter products for large commercial fuel cell and photovoltaic applications in North America. SatCon's rigorous focus on power management and overall efficiency is a significant reason why the PowerGate(R) is one of the most efficient inverter products available on the market. \"Our legacy of large, highly efficient power systems has finally come around full circle,\" said Elbert L. McDaniel, Vice President of Sales & Marketing for SatCon Power Systems. \"SatCon is truly one of the leaders in green power - and we are very pleased that we can be a part of The Green Grid and participate in their mission by applying our technology to one of the fastest growing energy sectors - the data center.\" About SatCon Technology Corporation SatCon Technology Corporation is a developer and manufacturer of electronics and generators/motors for the Renewable Energy, Hybrid-Electric Vehicle, Grid Support, High Reliability Electronics and Advanced Power Technology markets. For further information, please visit the SatCon website at www.satcon.com. (SATC-G) Statements made in this document that are not historical facts or which apply prospectively are forward-looking statements that involve risks and uncertainties. These forward-looking statements are identified by the use of terms and phrases such as \"will,\" \"intends,\" \"believes,\" \"expects,\" \"plans,\" \"anticipates\" and similar expressions. Investors should not rely on forward looking statements because they are subject to a variety of risks and uncertainties and other factors that could cause actual results to differ materially from the Company's expectation. Additional information concerning risk factors is contained from time to time in the Company's SEC filings. The Company expressly disclaims any obligation to update the information contained in this release. SOURCE: SatCon Technology Corporation SatCon Technology Corporation(R)\nDan Gladkowski, 617-897-2411\nVP, Administration\n\n\n\n\n\n\n\n\n\n\n You are subscribed to SatCon Technology Corporation Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n SatCon Technology Corporation \n 27 Drydock Ave. 6th Floor, South Boston, MA 02127\n Service provided by Shareholder.com \n\n\n\n\n\n"}