{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "Showbiz Tonight <showbiz@mail.cnn.com>", "subject": "TONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT", "body": "\n\n\nCNN.com - Showbiz Tonight\n\n\n\n\n\n\n\n\n\n\nTONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT\n\nTHE PROBLEM WITH PARIS!\nWhy do so many\npeople love to hate Paris Hilton? Is Paris's claim she has\nbecome spiritual just an act or the real thing? And are her\nparents to blame for the situation she is in right now? Do not\nmiss this special report on TV's most provocative entertainment\nnews show, Showbiz Tonight. \n\nLESSONS FOR PARIS!\nWhat can Paris Hilton learn from former\nHollywood bad girls who have turned it all around? From Drew\nBarrymore to Angelina Jolie to Courtney Love, we're taking a\nlook at former wild child types who have completely changed\ntheir image, to see how they did it.\n\nANNE HECHE'S\nCUSTODY FIGHT\nA judge deals Anne Heche a blow in the\nnasty custody battle over her son. Why has her soon-to-be ex\nhusband received custody, and what are the outrageous charges\nthey're making against each other? Find out tonight on Showbiz\nTonight!\n\nSHOWBIZ TONIGHT QUESTION OF THE DAY:\nParis Hilton finds God: Do you believe her?\nVOTE AT\nCNN.COM/SHOWBIZ TONIGHT. \n\nSEND US A VIDEO\nEMAIL!\nSend your response to the Question Of The Day\non video. Look into your camera and tell us what you think.\nResponses must be no longer than 30 seconds. To send your video\nemail, go to cnn.com/showbiztonight.Watch your video responses\non \"Showbiz Tonight\" at 11 p.m. ET/PT on CNN Headline Prime.\n\n\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the Showbiz Tonight list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=showbiz\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}