{"category": "ham", "to_address": "langa3@flax9.uwaterloo.ca", "from_address": "\"Windows Secrets\" <Editor@WindowsSecrets.com>", "subject": "Practice \"safe surfing\" with public Wi-Fi signals [Newsletter Comp Version]", "body": "\n\nPractice \"safe surfing\" with public Wi-Fi signals\n\n\n\n\n\n\nIf your software garbles this newsletter, read \nthis issue \nat WindowsSecrets.com.\n\n\n\n   \n\n\n\n\n\n\n \n\n\n\n\nYOUR NEWSLETTER PREFERENCES\n Change\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nLocale: United States 90210\nReader number: 83107-13329\n\n\n   \n\n\n\n\n\n   \n\n\n\n\n Home \n Newsletter \n WinFind \n Reviews \n Polls \n Contact \n \n\n\n\n\n This issue \n Past issues \n Upgrade \n Prefs \n Unsubscribe \n \n\n\n\n\n   \n\n\n\n\n\n   \n\n\nWindows Secrets Newsletter • \nIssue 111 • \n2007-06-14 • \nCirculation: over 270,000\n\n   \n\n\n\n\n\n\n   \n\n\n\n \nContents\n\nTOP STORY: Practice \"safe surfing\" with public Wi-Fi signals\nKNOWN ISSUES: Connecticut teacher gets a second chance\nWACKY WEB WEEK: E-cards for any odd occasion\nPC TUNE-UP: VMware is a superior alternative to Virtual PC\nOVER THE HORIZON: IE patched again, but is still insecure\nPATCH WATCH: MS slyly installs WGA via updates, again\nYOUR SUBSCRIPTION: How to change your address or unsubscribe\n\n   \n\n\n\n\n\n\n\n   \n\n\nFor links to every topic in this issue, scroll down to the \nIndex\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nRemotely monitor your PC from anywhere\nSnoopStick is a USB device that allows you to securely monitor activity on your PC from any Windows-based computer, anywhere. Monitor IM, browser activity, e-mail, and control access to Internet services. Great for parents and employers.\nwww.snoopstick.com\n\n\n\n\n\n\n\n\n\n \n\nForget Vista, make your XP system faster\nPC Pitstop's Optimize Scan 1.5 is easy-to-use software  that will automatically diagnose problems with your PC and give you a custom report detailing issues that are hurting your PC's performance. Run this free scan now!  \nwww.pcpitstop.com\n\n\n\n\n\n\n\n\n\n \n\nDeep Six anti-spam appliance for SMBs\nPatented technology stops spam at the network edge. Designed for SMBs: the DS200 is the lowest cost, most accurate solution available. Easy to install and maintain. Recent firmware release features new Management GUI and enhanced tools. Try it risk-free.\nwww.tyrnstone.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\n\nTOP STORY\n\n\n\nPractice 'safe surfing' with public Wi-Fi signals\n\n\n\n\n\n\n\n\n\nBy \nScott Dunn\n\nYou see them everywhere your Wi-Fi laptop goes: unprotected wireless signals \noffering \"Free Internet Access\" or \"Free \nPublic Wi-Fi.\"\n\nBut connect to them and you'll be disappointed. In a few cases, \nyou may even have your computer hacked. Here's the scoop on how to protect \nyourself.\n\n\n\n\n\n\n\n\nWhat are these mystery wireless networks?\n\n\n\nMany laptop users have seen unsecured access points like \n\"Free Internet Service\" show \nup in their list of available wireless networks. They appear to be especially \ncommon at airports. Attempts to connect to these networks usually don't result \nin any Internet access. What is the source of these cyber chimeras?\n\nThe answer is that the majority of these access points are not \nInternet-accessible networks, but merely peer-to-peer or \"ad-hoc\" \nnetworks connecting one \ncomputer to another. Their ubiquity stems from the fact that when a Windows \nwireless computer connects to a network, it remembers the name or Service Set \nIdentifier (SSID) of that network. The next time you use your laptop, your \ncomputer will broadcast that same SSID to other computers, and the users may \nconfuse your signal for a legitimate Internet access point. In this way, names \nlike \"Linksys\" or \"Free Public Wi-Fi\" are pollinated from \nuser to user.\n\nIn most cases, attempts to connect to these networks only result in the user \ngetting frustrated at the lack of an Internet connection and disconnecting. But, \naccording to an advisory  paper from Nomad Mobile Research Centre, \nthe feature can be used by attackers to learn a victim's IP address and directly \naccess the computer. The risk is especially high if you have file sharing turned \non. In addition, if an attacker uses this method to plant malware on your \nlaptop, you could place your company's network at risk the next time you connect \nto the network at your job.\n\nAnother hacker ploy is to set up an \"evil twin\" \nsignal that broadcasts a site \nresembling a respectable hotspot such as an airport Wi-Fi service. You may enter \ncredit-card information — thinking you're only buying a few hours \nof Internet access — but you are actually turning over your \naccount numbers to a cyber criminal.\n\n\n\n\nHow to protect your wireless laptop\n\n\n\nSo, how can those of us with wireless laptops and networks protect ourselves \nfrom the kind of mistakes the security pros were making? Fortunately, you can \ntake several steps to avoid undesired peer-to-peer access and limit your \nrisks when connecting to a wireless hotspot in a public place.\n\nBefore going any further, however, make sure your own Wi-Fi system is using the \nlatest encryption standard, WPA2 (Wi-Fi Protected Access 2). For \ndetails on these and other basics of Wi-Fi security, see Brian Livingston's Top \nStory in the May 26, \n2005, issue.\n1. Turn off Wi-Fi when not in use\n\nThe first and most basic way to limit your risk is to turn \noff your system's Wi-Fi feature when you're \nnot using it. Many laptop computers have a physical switch to toggle the \nwireless capabilities.\n\nIf you don't have a physical switch, you can turn off Wi-Fi in XP \nby right-clicking the wireless icon in the taskbar \"tray\" \n(the area near the \nclock) and choosing Disable. To turn it back on, go to Control Panel and \nopen the Network Connections window. Right-click the Wireless Network Connection \nicon and choose Enable.\n\nIn Vista, go to Control Panel and launch the Network and Sharing Center. Click\nManage network connections on the left. Then, right-click the Wireless \nNetwork Connection icon and choose Disable. Click Continue \nif prompted by User Account Control. To reverse this setting, return to this \nwindow, right-click the same icon, and choose Enable. As before, click Continue \nif prompted by User Account Control. Then use the Network and Sharing Center to \nconnect to a network.\n2. Install and enable a firewall\n\nMake sure you have a firewall enabled on your \nlaptop. If you don't have a third-party firewall, you can turn on Windows \nbuilt-in firewall by opening Control Panel and launching Windows Firewall. If \nyou have XP Service Pack 2 or Vista, the firewall should be enabled \nby default.\n3. Know the difference\n\nThe best way to avoid potential attacks via \npeer-to-peer connections is simply to refuse to connect to an unknown ad-hoc \nnetwork. Fortunately for XP users, the Wireless Network Connection window \nclearly distinguishes between the two types of networks. Each ad-hoc network is \nlabeled as a \"computer-to-computer network.\" Infrastructure networks \nare labeled as \"wireless networks.\"\n\nIn addition, XP uses distinctive icons to differentiate between the two types of \nnetworks: Ad-hoc network icons show two computers, while infrastructure network \nicons show an antenna (see Figure 1).\n\nFigure 1: XP shows peer-to-peer networks as two computers, but access points \nas an antenna.\n\nVista, however, is a lot less clear on this point. The display of available \nnetworks doesn't offer any description to distinguish between ad-hoc and \ninfrastructure networks. The user is forced to rely solely on inscrutable \nicons. Ad-hoc networks are depicted with three computers connected by green \nlines, while infrastructure networks are shown as two computers sitting \non a network cable (see Figure 2).\n\nFigure 2: In Vista, peer-to-peer network icons show three computers, while \naccess point network icons show only two.\n4. Clean up your network list\n\nIn XP, use Windows Control Panel to open the Network \nConnections window. Right-click Wireless Network Connection and choose \nProperties. Click the Wireless Networks tab, which displays (among other \nthings) a list of preferred networks (those you have connected to in the past). \nWhile you're there, select any suspicious-looking networks (like \"Free \nPublic Wi-Fi\") and click Remove.\n\nIn Vista, use Control Panel to open the Network and Sharing Center. Click \nManage Wireless Networks in the task pane on the left. Right-click any \nsuspect networks and choose Remove Network.\n\nIn addition, you should set all of your preferred networks to manual so your \nsystem doesn't automatically connect to a rogue network with a matching name. To \ndo that, follow these steps:\nStep 1. Select any network in the list with \"(Automatic)\" \nafter its name (XP) or displaying Automatic mode (Vista).\nStep 2. Click Properties. \nStep 3. Click the Connection tab.\nStep 4. Uncheck Connect when this network is in range.\nStep 5. Click OK.\nStep 6. Repeat for each automatic connection in the list.\n5. Turn off ad-hoc networking in XP\n\nWhile you're in the Wireless Network Connection dialog box (XP only), \nyou may want to take the advice of the \n Nomad advisory paper, which recommends that users turn off \nad-hoc networking:\nStep 1. In the Wireless Network Connection Properties dialog \nbox, with the Wireless Networks tab selected, click the Advanced button \nnear the bottom of the dialog.\nStep 2. In the Advanced dialog box, select Access \npoints (infrastructure) networks only. Also, make sure there is no checkmark \nnext to Automatically connect to non-preferred networks.\nStep 3. Click Close.\nUnfortunately, changing this setting does not stop ad-hoc networks from \nappearing in the list of available wireless networks in the Wireless Network \nConnection window. Nor does it prevent you from connecting to them manually. \nIt does, however, filter out ad-hoc networks from appearing in the list \nof preferred networks.\n\nThis setting is not in Vista, which always requires manual connections to ad-hoc \nnetworks.\n6. Turn off file sharing\n\nIf you're going to be connected to a public \nnetwork, such as an airport hotspot, you can reduce the risk of mischief \nby turning off file sharing:\nStep 1. In XP, launch Windows Explorer and right-click the folder \nor drive that's shared.\nStep 2. Choose Sharing and Security, and turn off sharing for \nthat folder.\nStep 3. Click OK.\n\nThings are much easier in Vista. When you connect to a \nWi-Fi network for the first time, you are prompted to designate the network as \nprivate or public. Selecting Public automatically turns off file sharing. If you \nhave already connected to the network, you can change this setting by going to \nControl Panel and launching Network and Sharing Center. Click Customize on the \nright. Select Public, click Apply, and follow the remaining prompts \non screen.\n7. Turn off network discovery in Vista\n\nAnother risk-reducer with public Internet \nconnections is to make your computer invisible on the network you joined. If you \ndesignated the connection in Vista as Public, as described above, that's \nalready done for you. If not, you can change that setting independently in \nthe same Network and Sharing Center window. Under Sharing and Discovery, \nclick the On button or the down arrow to the right to display more \noptions. Select Turn off network discovery and click Apply.\n8. Use a Virtual Private Network (VPN)\n\nPerhaps the best way to protect your wireless \ncommunications when using a public network or hotspot is through virtual private \nnetworking. For tips on doing so, see the discussion of VPNs in our\n May 26, 2005, issue.\n\n\n\t\t\t\tReader, please rate the above article:\n1: Poor \n\t\t\t\t2: Fair \n\t\t\t\t3: Good \n\t\t\t\t4: Great  5: Superb\n\n\n\nScott Dunn is associate editor of the Windows Secrets Newsletter. He is \nalso a contributing editor of PC World Magazine, where he has written a \nmonthly column since 1992, and co-author of \n 101 Windows Tips & Tricks (Peachpit) with Jesse Berst and Charles Bermant.\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nLearn to use Vista like a pro\nMaster Vista with 19+ hours of video training that covers everything. Step-by-step instruction guides you through what's new in Vista, Installation, Group Policy, Security, Networking, Administration, IE7, and lots more. View our free demo now!\nwww.TrainSignal.com\n\n\n\n\n\n\n\n\n\n \n\nBack up just got easier with Backup4all\nWhat happens when your hard disk dies? Will your business survive if your documents are lost? What about losing those precious photos of your children growing up? Back up with Backup4all to avoid such risks! Windows Secrets readers get a 25% discount\nwww.backup4all.com\n\n\n\n\n\n\n\n\n\n \n\nBackup your data with ZipBackup\nFinally, a backup program that is easy to use.  ZipBackup's Wizard makes backups a snap for beginners. Filtering,  scheduling, and disk spanning make it a powerful tool for experts. For a limited time, Windows Secrets readers receive 25% off.\nwww.zipbackup.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\n\nKNOWN ISSUES\n\nConnecticut teacher gets a second chance\n\n\n\n\n\n\nBy \nScott Dunn\n\nYou all know the story of how adult pop-ups almost sent a substitute teacher \nto jail for 40 years.\n\nIn a follow-up to his original \n\nFeb. 22 story, our contributing editor Ryan Russell reports on a \npossible reprieve.\n\n\n\n\n\n\n\nNew trial ordered for Julie AmeroRussell gives \nus this update on Connecticut teaching assistant Julie Amero, who was convicted \nin January of four counts of \"risk of injury to a minor\" \nbecause adult material \nkept popping up on a computer in her classroom:\n\n\n\n\"I am extremely pleased to be able to bring you good news. After several \nsentencing delays, on June 6 Judge Strackbein granted Julie a new trial. As \nquoted by Greg Smith in his \n\narticle for the Norwich Bulletin, the judge said, 'The jury may have relied, \nat least in part, on that false information,' referring to the evidence \npresented by the prosecution's expert. In short, as I had said in my original \narticle, the prosecution had bad evidence. Smith's article has a PDF of the \nmotion, if you would like to read the whole thing.\n\n\"She's not out of the woods yet. A new trial could go the wrong way \nas well. However, Rick Green, writing for the \n Hartford Courant, speculates that she may not be tried again. He writes, \n'Today, [prosecutor] Smith said state would take no position on [defense \nattorney] Dow's motion for a new trial, making it unlikely she will be tried \nagain.' I hope that will be the outcome.\n\n\"I have had some limited contact with Julie's family, and when I asked \nspecifically, I was told that they are still accepting donations for her defense \nfund. You can find the link to donate on the \n Julie Amero blog.\n\n\nWindows Secrets will continue to report on this story as it develops.\n\n\n\nMany users never have a chance to see a EULA\n\n\n\nRegarding my\nJune 7 story on \nEULAs (end-user license agreements) and interview with expert Ed Foster, \nreader Chip Burkitt indicates that many \nsoftware users never even get to read the EULA:\n\n\n\n\"My experience is that most people installing software pay no attention \nto the EULA. It is merely an extra click on the way to installing the \nsoftware. I don't know much about legal challenges to the enforceability \nof EULAs, but I know that often the end user never even sees it.\n\n\"For example, I work for a software and services company as a field \nservices technician. One part of my job is to install our software on our \nclients' systems. Do you think I pause the installation when I get to the EULA \nand invite the user to read through and agree to it before continuing? Of course \nnot. I just do what most users do. I click 'Agree' and continue with the \ninstallation.\n\n\"So precisely who has agreed to the EULA in this case? I represent the \ncompany whose software is being installed. So, the company agrees to its own \nEULA, and the client never sees it. I doubt very much that any \nprovisions of a EULA agreed to under such circumstances would be legally \nenforceable.\"\n\n\nIt does seem odd that the user should be saddled with one-sided requirements \nsimply because they, or someone they hire, clicks an \"I Agree\" \nradio button. Unfortunately, as Ed Foster has pointed out in his\ncolumn, \nat least some courts these days are doing just that.\n\nReader Jay Garden points out another common problem with EULAs:\n\n\n\n\"One aspect of some EULAs that I particularly hate is when you \ncannot print, \ncopy, or otherwise access them later on (but of course the vendor can). You \nrarely get a chance to see the EULA until you have paid for the product and have \nit half-installed.\n\n\"Maybe they should have to put the EULA on the outside of the box (or \nin clear \nsight on the e-shop Web page) in 100 words or less (and reasonable font size) \nfor it to be legal? That way we could make an informed choice \nbefore we select and buy.\"\n\n\nJay isn't the only reader to suggest the EULA appear outside the packaging. \nReader Marat Bandemer makes the same suggestion, adding, \"Who wants to \npay $50 to $500 (or more) for software only to find that they disagree with \nthe EULA, but now the box has been opened and they can't return the \nsoftware?\"\n\nReader A.B. Di Cyan has a similar complaint:\n\n\n\n\"Can we see a list of known good and known bad EULAs for programs \npeople may be \nlikely to download? I use the EULAlyzer too and I agree it is not enough, but \nthe alternative is to spend all one's time reading legalese.\n\n\"For example, browsers: There are differences among the EULAs of IE, \nNetscape, Opera, and Firefox. I'm suspicious enough of Netscape's not to \ndownload their browser. Are my suspicions justified? How about QuickTime or \nproducts from Adobe or Real Networks? What media players, weather programs, \ntoolbars carry snakes in the grass? Experts know the answers, and we need to \nhear from them.\"\n\n\nFor now, your best bet for checking out EULAs before purchase remains a Web \nbrowser and a search engine. For example, many major software companies have \nEULAs available on their Web sites, including\n Netscape, \n Adobe, and others.\n\nFor another reader (who asked to remain anonymous), the \narticle on EULAs brought to mind a legendary EULA from many years back. The \nfollowing is an alleged excerpt from the HavenTree Software Company's EasyFlow \nprogram, as found in a\n Word document on the \nCandadian Department of Justice Web site:\n\n\n\n\"If EasyFlow doesn't work: tough. If you lose millions because \nEasyFlow messes \nup, it's you that's out the millions, not us. If you don't like this disclaimer: \ntough. We reserve the right to do the absolute minimum provided by the law, up \nto and including nothing. This is basically the same disclaimer that comes with \nall software packages, but ours is written in plain English and theirs is in \nlegalese. We didn't want to include any disclaimer at all, but our lawyers \ninsisted.\"\n\n\nThis bit of candor is so memorable that someone enshrined the story in a\n Wikipedia entry.\n\n\n\nZoneAlarm's 'Vista Ready' label is criticized\n\n\nThe newsletter's \n\nWSN Security Baseline recognizes the ZoneAlarm Internet Security \nSuite as the security package currently holding the greatest number of \neditor's choice awards, as described in our \nMay 4 issue. More \nthan one reader, however, was dismayed at the product's misleading label. \nHere's reader Jack Freeman's experience:\n\n\n\n\"I purchased ZA Internet Security Suite (retail) because it clearly stated \n'Vista Ready' on the packaging. Yet when I tried to install it, I got an error \nmessage that the product is not supported by the OS. When I tried to take it \nback, the retail store refused to refund the price but did state that the phrase \non the package meant it would install on Vista OS.\n\n\"I then tried ZA support. All I got there was a referral to customer \nservice, \nwho stated they would 'consider' a refund only if I returned all packaging with \nthe product and sales receipt. If I do that, then I have no proof of the false \nadvertising on the package. I had to go with another antivirus suite or use no \nantivirus at all, which left me no choice but to buy another \nsuite.\"\n\n\nSorry to hear of your bad experience, Jack. If you are considering legal action, \nyou may want to hang onto the box, receipts, and any other documentation you \nhave. Otherwise, keeping a photocopy of these materials should be a sufficient \nbackup when pursuing a refund.\n\nAnother reader, Lance Druger, had a similar experience. In his case, however, \nthe ZA rep offered to extend his subscription free of charge for five months \nin deference to the delay in updating the product for Windows Vista.\n\n\n\nWhen is a repair an upgrade?\n\n\n\nIn our\nlast issue, we \nreported that users of OEM software don't need to obtain a new license if they \nreplace a defective computer component, but must do so if they upgrade their \nsystems with newer parts. Reader Leisha Wharfield finds this \ndisturbing:\n\n\n\n\"Who would actually acquire a new Windows license just for a simple \nupgrade like more memory? We would go broke if we did that. I'm shocked by \nthis requirement, even for system builders.\"\n\nAs it turns out, this is one of those areas in which Microsoft has given \ncontradictory advice. Microsoft's PDF document on the subject, called the \n Channel Discussion Guide, clearly includes \"adding to \nthe memory\" as a change that requires a new license (see page 2). \nYet a number of postings from the Microsoft OEM System Builder Licensing \nTeam (compiled on the \n Michael Stevens Tech Web site) indicate that the only upgrade that \nrequires a new software license is the replacement of the motherboard. \nEven a new hard drive does not require a new license, as long as the software is \nremoved from the old hard drive before being installed on the new one, according \nto this source. So the answer apparently depends on which source you \nbelieve.\n\nA stickier question comes from reader Mike, who points out that if a component \nfails after a few years, it may not be possible to get an identical replacement. \nAnd, the new replacement may be faster and possibly considered an upgrade or a \n\"refurbishing.\" In that case, are you obligated to buy a new copy \nof your OEM \nsoftware? Or can you consider it covered by the defect policy?\n\nOne could always \nattempt to contact the Microsoft legal department in these cases. But, I suspect \nmost users just follow their own judgment on whether to keep or reinstall their \nOEM product.\n\n\nContents\n Index\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nNew add-on for parental control software\nNew software is a great addition to any parental control suite. BuyBlock prevents kids from shopping, filling out registration forms, and signing onto social networks. No setup or monitoring required. Get your risk-free trial here!  \nwww.buyblock.com\n\n\n\n\n\n\n\n\n\n \n\nGet your product seen by 270,000 readers\nDoes your company offer a product or service? Now you can place an ad in the Windows Secrets Newsletter and be seen by more than 270,000 active buyers of PC hardware and software. Bid as much or as little as you like to get the ideal ad placement.\nwww.WindowsSecrets.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\nTELL A FRIEND\n\nHow you can share this information\nWe love it when you send your friends links to our articles. But please don't \nforward your copy of our e-mail newsletter to people, which subjects us to spam \ncomplaints. Instead, simply suggest that your friends visit this issue's permanent \nWeb address, shown below. A complete index at the bottom of the\nWeb page provides you with hyperlinks to any article you'd like to recommend.\n\nThe address of this issue is http://WindowsSecrets.com/comp/070614\n\n   \n\n\n\n\n   \n\n\n\n\n\nEDITOR'S BOOKSHELF\n\n\n\n \n\n\n\nGet the tips you need about Windows Vista\n\n\n\nThe all-new Windows Vista Secrets helps novices \nand experts alike understand Microsoft's latest operating system. \n\"To really appreciate what is in Vista, you almost \nneed to read through the leading book on the product, Windows Vista \nSecrets, by Brian Livingston and Paul Thurrott,\" writes Rob Enderle, \nprincipal analyst of the Enderle Group, in TechNewsWorld. \"It's 595 \npages of things you can do with this product — most of which \nyou probably wouldn't have discovered for some time, let alone right \nat first.\" Check the book out now for tips you can use.\nMore information:\n United States / \n Canada / \n Elsewhere\n\n \n\n\n\nSpam-Proof Your E-Mail Address, 2nd Ed.\n\n\n\nThis 32-page e-book by Brian Livingston gives you step-by-step instructions that \ncan prevent 97% of the spam that would otherwise clog an e-mail\naccount. You could call it \"Livingston's Spam Secrets.\" The PDF e-book\nis the result of months of experiments and tests we conducted. We now\nreceive little or no spam to the addresses we used as guinea pigs. These tests\nshow that you can make your e-mail addresses invisible to spammers,\nnot just battle an ever-growing flood. The methods we describe\nwork with Windows, Apple, and Linux and don't require any filters or block\nlists — but you can use those in addition to the book's techniques,\nif you wish. \n\nMore info\n\n   \n\n\n\n\n\n   \n\n\n\nContents  \nIndex\n\n   \n\n\n\n\n   \n\n\n\n\n\nWACKY WEB WEEK\n\n\n\nE-cards for any odd occasion\n\n\n\n\n\n\n\n\n\n\n\nEverybody needs a way to mark those special occasions — birthdays,\nweddings, graduations, nervous breakdowns... And, of course, there are \nplenty of e-card Web sites to help you send just the right message, \nusually for a fee.\n\nBut sometimes you yearn for something a little edgier that you just \ncan't find in the standard Hallmark offerings. Check out the\nfree e-card site, SomeEcards.com. You'll find just the right \n(or wrong) message to convey whatever bizarre, offbeat, or kinky mood \nyou're in. Please be aware that some cards at this site use adult language.\n\nMore info\n\n\n\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n\n   \n\n\n\n\nINDEX\n\n\n\nThe following topics appear in the free version\n\n\n\n\n\nTOP STORY  \nPractice \"safe surfing\" with public Wi-Fi signals\n\n \nWhat are these mystery wireless networks?\n\n \nHow to protect your wireless laptop\n\n \n \n\n\nKNOWN ISSUES  \nConnecticut teacher gets a second chance\n\n \nNew trial ordered for Julie Amero\n\n \nMany users never have a chance to see a EULA\n\n \nZoneAlarm's 'Vista Ready' label is criticized\n\n \nWhen is a repair an upgrade?\n\n \n \n\n\nWACKY WEB WEEK  \nE-cards for any odd occasion\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou get all of the following in the paid version\n\n\nPC TUNE-UP  \nVMware is a superior alternative to Virtual PC\n\n \nVMware Player goes where Virtual PC doesn't\n\n \nOpenOffice: a free alternative to Microsoft Office\n\n \nYoggie Pico: complete security on a USB stick\n\n \nHow to make Firefox start up where it left off\n\n \n \n\n\nOVER THE HORIZON  \nIE patched again, but is still insecure\n\n \nIE is vulnerable to cross-domain attacks\n\n \nIE 6 allows spoofing of address bar\n\n \n \n\n\nPATCH WATCH  \nMS slyly installs WGA via updates, again\n\n \nManually patch and you get WGA update\n\n \nIE cumulative update may have fewer problems\n\n \nOutlook Express patch causes .mht warnings\n\n \nSSL connections can be used for attacks\n\n \nWindows API routines cause security issues\n\n \nVisio diagrams can threaten your networks\n\n \nVista permissions need patching\n\n \nServer 2003 SP2 is now on auto-updates\n\n \nSvchost fixes should now be on your systems\n\n \n \n\n\n\nPaid subscribers can access all old and new paid newsletter content\nMake a contribution to support our research into Windows and you'll immediately\nbe able to read and search through scores of valuable articles. In addition,\npaid subscribers are entitled to download valuable content that we license for\nyou at least once every calendar quarter.\nTo upgrade, simply make a contribution of any amount you choose.\nIf you do this by June 20, 2007, \nyou'll instantly be sent the full, paid version of today's newsletter.\n\nTo upgrade to the paid version of the Windows Secrets Newsletter, please visit our \n upgrade page.\n\nThanks in advance.\n\n\n   \n\n\n\n\n\n   \n\n\n\nContents\n Index\n\n\n   \n\n\n\n\n\n   \n\n\n\nYOUR SUBSCRIPTION\n\nThe Windows Secrets Newsletter is published weekly on \nthe 1st through 4th Thursdays of each month, plus occasional news updates. \nWe skip an issue on any 5th Thursday that occurs, plus Thanksgiving Week \nand the last two weeks of August and December.\nPublisher: WindowsSecrets.com LLC, Attn.: #120 Editor, 1700 7th Ave., \nSuite 116, Seattle, WA 98101-1323 USA. Vendors, please send no unsolicited \npackages to this address (readers' letters are fine).\nEditorial Director: Brian Livingston. Editor-at-Large: Fred Langa. Associate \nEditor: Scott Dunn. Contributing Editors: Susan Bradley, Mark Edwards, Woody \nLeonhard, Chris Mosby, Ryan Russell. Research Director: Vickie Stevens. \nProgram Director: Brent Scheffler. Managing Editor: Jody Braverman.\nTrademarks: Microsoft and Windows are registered trademarks of Microsoft \nCorporation. The Windows Secrets series of books is published by\nWiley Publishing Inc. The Windows Secrets Newsletter,  \nWindowsSecrets.com, LangaList, LangaList Plus, WinFind, Security Baseline, Patch Watch, \nPerimeter Scan, Wacky Web Week, the Logo Design (W, S or road, and Star), and the \nslogan Everything Microsoft Forgot to Mention all are trademarks and service \nmarks of WindowsSecrets.com LLC. All other marks are the trademarks or service \nmarks of their respective owners.\n\n\nYOUR SUBSCRIPTION PREFERENCES\n(change \nyour preferences):\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nCountry: United States\nZIP or postal code: 90210\nReader number: 83107-13329\nBounce count: 0\n\nYour bounce count is the number of times your server has bounced a newsletter back to us\nsince the last time you visited your preferences page. We cannot send newsletters to you\nafter your bounce count reaches 3, due to ISP policies. If your bounce count is higher\nthan 0 or blank, please visit your\npreferences page.\nThis automatically resets your bounce count to 0.\nTo change your preferences: Please visit your \npreferences  page.\nTo access all past issues: Please visit our\npast issues page.\nTo upgrade your free subscription to paid: Please visit our \nupgrade  page.\nTo resend a missed newsletter to yourself: If your mail server filtered \nout a\nnewsletter, you can resend the current issue to yourself. To do so, visit your\npreferences page\nand use the Resend link.\nTo get subscription help by e-mail (fastest method): Visit our \ncontact page.\nSubscription help by facsimile:\n206-282-6312 (fax). Emergency subscription help by phone: 206-282-2536 (24\nhours).\n\nHOW TO SUBSCRIBE: Anyone may subscribe to this newsletter by visiting our \nfree signup page.\nWE GUARANTEE YOUR PRIVACY:\n\n1. We will never sell, rent, or give away your address to any outside party, ever.\n2. We will never send you any unrequested e-mail, besides newsletter updates.\n3. All unsubscribe requests are honored immediately, period.  \nPrivacy policy\nHOW TO UNSUBSCRIBE: To unsubscribe\nlanga3@speedy.uwaterloo.ca\nfrom the Windows Secrets Newsletter,\nUse\nthis 2-click\nUnsubscribe\nlink; or\nSend\na blank e-mail to\nunsub@WindowsSecrets.net\nwith leave langa3@speedy.uwaterloo.ca\nas the Subject line; or\nVisit our \nUnsubscribe page.\n\n\nCopyright © 2007 by WindowsSecrets.com LLC. All rights reserved.\n\n\nContents\n Index\n\n\n\n\n\n\n   \n\n\n\n\n\n"}