{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nPresident Bush is pressuring Congress to salvage the\n  immigration overhaul deal which was stalled last week after broad Republican\n  opposition. Tonight Sharyl Attkisson will report that the President made a\n  rare visit to the Capitol to nudge GOP senators on the bill. She’ll\n  also explain how members of Congress are reacting to the pressure.\n \nAlso on Capitol Hill today, some military families\n  testified before Congress about cancer and other illnesses they blame on\n  drinking toxic tap water at their military base. Over three decades, the\n  water at Camp Lejeune contained toxins at up to 40\n  times the safety limit, federal investigators say. David Martin will have\n  details.\n \nIt’s been more than a year since the\n  allegations against Duke’s lacrosse team surfaced. But today, Durham County district attorney Mike Nifong\n  was back in court – he’s been accused of violating rules of\n  professional conduct, and if convicted, Nifong could be disbarred. Byron\n  Pitts will have the story.\n \nAn FDA panel is set to meet tomorrow to decide\n  whether an experimental diet drug should be sold in the United States. I’ll ask our\n  Dr. Jon LaPook about the drug rimonabant, which would be sold under the name\n  Zimulti.\n \nCan’t wait to retire? You might have to wait\n  longer than expected – and retire with less money than previous\n  generations did. Nancy Cordes will look at the surprise that may be in store\n  for the aging baby boomer population.\n \nAnd Anthony Mason will have some details on the\n  lavish perks – from stock options to bonuses – some executives\n  rake in along with their salaries.\n \nFinally, there’s a growing threat to the\n  forests of mid-Atlantic states. And even though the villain is small, the\n  damage can be enormous. Michelle Miller will have the story.\n \nI hope you’ll join us for this and more,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}