{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTHURSDAY 10 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER LIZ GIBBONS\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\t\"I may have been wrong - that's your call... I did what I thought was right for our country\" Tony Blair said today. \n\n\nTonight, in an extended programme, Jeremy will be joined by guests including Alastair Campbell, Michael Howard, Charles Kennedy and David Hare for the definitive assessment of the Prime Minister's time in office.\n\n\nWith the help of Michael Crick in London, David Grossman in Sedgefield, and retrospectives by Martha Kearney - we'll assess what impact the Blair decade has made on Britain, and how it changed the face of politics. Will the Iraq war dominate his legacy, or will history judge that his reforms to public services have irreversibly changed this country?\n\n\nDo join Jeremy for what's certain to be a fascinating show.\n\n\nYou can watch Martha's films right now. Click on the links below:\n\n\nChanging Britain\n\n\nThe world stage\n\n\nLiz\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nZIMBABWEAN EXILES 'IN LIMBO'\n\n\t\t\t\t\t\t\tSome Zimbabwean opposition figures and their children who fled to England have found themselves caught in limbo.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}