{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] AP on Edwards' health plan", "body": "http://www.sfgate.com/cgi-bin/article.cgi?f=/n/a/2007/06/14/politics/p085407D53.DTL&type=politics\n\nEdwards Lays Out Health Care Plan\n\nBy SVEN GUSTAFSON\nAssociated Press\nThursday, June 14, 2007\n\n\nDemocratic presidential candidate John Edwards on Thursday proposed\ncutting health care costs by overhauling the patent process for\nbreakthrough drugs and requiring health insurance companies to spend at\nleast 85 percent of their premiums on patient care.\n\nThe former North Carolina senator offered details of a universal health\ncare proposal he released in February during an appearance at the East\nRiverside Health Center, a federally funded community clinic.\n\nEdwards' plan would offer cash payments in place of long-term patents\nfor companies that develop certain breakthrough drugs and then reap\nlarge profits because of the monopolies those patents provide.\n\nHe said offering cash incentives instead would allow multiple companies\nto produce generic and other versions of those drugs to drive down\nprices. Campaign officials said the payments could be voluntary for drug\ncompanies and would be aimed at spurring the development of drugs that\ncure diseases.\n\n\"Dealing with the health care crisis is about more than just about\ncoverage,\" Edwards said. \"Our health care system is entirely too\nexpensive. We put more money into health care than any country in the\nindustrialized world and we get one of the worst products out in the\nother end.\"\n\nHe also said his plan would require health insurance companies to spend\nat least 85 percent of the premiums they collect on patient care, adding\nthat 30 percent of insurance premiums currently go toward administrative\nexpenses and profit. He said New York, Minnesota, New Jersey, Florida\nalready impose similar requirements.\n\n[snip]\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}