{"category": "spam", "to_address": "undisclosed-recipients:;", "from_address": "\"Mrs.Alice Bunnet.\" <mr.eric_wright111@yahoo.fr>", "subject": "Contact Mr.Eric Wright For Your Compensation.", "body": "\n\n\n-- \nCOMPENSATION HEAD OFFICE.\n\nGOOD NEWS!!!\n\nDear Friend,\n\nHow are you today? Hope all is well with you and your family? I hope this\nmail meets you in a perfect condition. I am using this opportunity to\nthank you for your great effort to our unfinished transfer of fund into\nyour account due to one reason or the other best known to you.\n\nBut I want to inform you that I have successfully transferred the Cheque\nout of the company to someone else who was capable of assisting me in this\ngreat venture .\n\nDue to your effort, sincerity,courage and trust worthiness you showed at\nthe course of the transaction I want to compensate you and show my\ngratitude to you with the sum of 500,000.00(five hundred thousand United\nStatesDollars) in addition to your lottery winnings of $2.5m now amounting\nto $3,000,000.00(three million United States Dollars).\n\nI have authorized the finance house where I deposited my money to issue\nyou International Certified Bank Draft cashable at your bank. My dear\nfriend I will like you to contact the finance house for the collection of\nthis international certified bank draft.\n\nThe name and contact address of the Person with your Cheque Mr.Eric Wright\nis as follows.\n\nCOMPENSATION OFFICER\nCONTACT AGENT Mr.Eric Wright\nEMAIL:mr.eric_wright111@yahoo.fr\n\nAt the moment, I am very busy here because of the investment projects\nwhich myself and my new partner are having at hand.\n\nFinally, remember that I have forwarded instruction to the finance house\non your behalf to send the bank draft to you as soon as you contact them\nwithout delay.\n\nPlease I will like you to accept this token with good faith as this is\nfrom the bottom of my heart.\n\nThanks and God bless you and your family.Hope to hear from you soon.\n\nBest Regards,\nMrs.Alice Bunnet.\n\n\n"}