{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle Zombie<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, by your 36th birthday, a miracle could change your life", "body": "\n\n\n\n\nMemo, by your 36th birthday, a \nmiracle could change your life\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMy dear \nMemo, by the time you turn 36, you could see a miracle \nhappen in your life!\n\n\n\n\n\n\n\nYes, \nMemo! Since your birth in 1972, an invisible Divine \nBeing has chosen to bestow you with a Secret Power that will give you Joy, \nHealth and more Money.\nAnd, to help you connect with this divine being -- your Spirit Animal Helper -- \nI want you to have this free gift:\nYOUR \"POWER CRYSTAL\" CHARM\n\n\n\n\n\n\n\n\n\n\n    This extraordinary crystal charm is not only beautiful, \nit also has the power to help you contact your Spirit Animal Helper. Crystal \nhas been prized for centuries because it can put us in touch with the Spirit \nWorld.    \n\n\n\n    If you carry or wear this Charm \nevery day, you will always feel the presence of your Spirit Animal Helper. You \nwill feel protected and guided by its Divine wisdom and power. Cherish your \nCrystal Charm, and it will attract to you all the wonderful blessings you \ndesire!\nI want to show you how to call on your\nSpirit Animal Helper for all kinds of help.\n    Don't worry, you don't have to be a Shaman or a psychic \nto do this. In fact, you don't need any special skills whatsoever! All you need \nis faith in the love of your Spirit Animal Helper, and a little knowledge of \nhow he \"works,\" so you can work with him.\n\n    Even if your Spirit Animal Helper has strayed from your \nside, I'm going to tell you how to bring him back.\n\n    It's very simple...and all the information you need is \nin a special study,\"YOUR SPIRIT ANIMAL HELPER:\nTHE DIVINE GUARDIAN OF YOUR HAPPINESS\"\n    With this easy-to-follow instruction guide in your \nhands, you will finally be reunited with your Spirit Animal Helper -- the \nloving companion who has been beside you all your life. And you'll probably be \nsurprised at how much comfort and peace of mind your Spirit Animal can bring \nyou once you make contact with him. Some people say it's like finding\na long-lost, very powerful friend!\n\n    The first thing you need to know is which Spirit Animal \nHelper was \"assigned\" to you when you were born, and the special traits and \ntalents this Spirit Animal lends you. This will show you\nhow to discover your Spirit Animal.You'll \nalso find out how to get the protection\nyou need from your Spirit Animal Helper.\n    He will watch over your home, family, pets and other \nprecious possessions -- all you have to do is ask!\n\n    With \"Your Spirit Animal Helper: The Divine Guardian of \nYour Happiness,\" you will understand the personal messages that your Spirit \nAnimal Helper is sending you. For example:\n\nDo you know what it means when a bird builds a nest near your home? (It could \nmean a baby is coming into your family!)\n\n\nOr when a chipmunk scampers by? (It may be warning you to conserve your energy \nor money.)\n\n\nOr when you see a spider in your house? (Spiders mean hope, and often wealth!)\n\n\nOr when you see a dolphin or meditate on its image? (It can help you find your \nway when you feel lost or stranded.)\n\n\nOr when a ladybug lands on your hand? (Make a wish! It means you're beginning a \nnew and lucky period in your life.)\n    Once you understand these signs, it will \nbe as if you're receiving secret messages from the Spirit World!\n\n\n\nTrust the power of your Spirit Animal Helper,\nand your whole life will be completely\ntransformed before your next birthday!    Personally, \nI would like nothing better than to see you accept such a wonderful change, \nbecause YOU REALLY DESERVE TO BE HAPPY! That's why I hope you'll send for a \ncopy of \"Your Spirit Animal Helper\" TODAY.\n\n\n\n    And I managed to get you a \ndiscount of over 60%\n    And because I don't want you to wait any \nlonger for the joy and fulfillment you could be experiencing right now, I've \narranged for you to have this book for $9.95, a 60% discount. You'll save more \nthan $15.00 off the regular price.\nAs always, you have my Lifetime Money Back Guarantee\n    And, the magic of your\nSpirit Animal Helper comes to you Absolutely\nRisk-FREE! That's right, because if at any time you're not 100% convinced\nthat the secret information contained in \"Your Spirit Animal Helper: The Divine \nGuardian of Your Happiness\" has helped bring a miraculous sense \nof Security and Well-Being into your life...all you have to do is return the \nbook to me and I WILL REFUND YOUR PAYMENT IN FULL, including the shipping and \nhandling charge, immediately.Your Spirit Animal Helper is \nWaiting for You!\n    No matter how much help you need, Memo, your \nSpirit Animal Helper is ready and waiting to serve you and turn your worries \nand difficulties into SECURITY, SUCCESS, and REAL, LASTING JOY!\n\n    Memo, you will be amazed at the abundance \nyour Spirit Animal will bring into your life. That is why it is so important \nfor you to have this book. After all, your Spirit Animal is with you, right \nnow, ready to help. Don't waste another minute, Memo, it's risk-free! \nYou have nothing to lose and everything to gain!\n\n    Simply click the button below, \nand by the time you turn 36, you will have at your side\nthe most loving, powerful friend you've\never dreamed of...for life.\n\n    Sincerely,\n\n\n    \n\n\n\n\n\n\n\n\n\n\nP.S. -- Please, Memo, don't delay. Your Spirit Animal and I both have \nwonderful gifts to give you as soon as you respond!\n\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may use the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for offers and discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you’ve asked to be deleted from one kind of email from me, I’m required to stop contacting you completely. So, Memo,if you wish to no longer receive any emails from me, simply visit here or send a letter to me at 167 Cherry St. PMB 292, Milford CT 06460-3400.\n\n\n\n\n\n"}