{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Shirley Hogue\" <powcjurdeq@cjur.com>", "subject": "Melt away fat easily", "body": "\nSummer is coming, time to tone up\n\n\n\n\n\nAnatrim – The newest and most enchanting product for weighty people available – As seen on BBC\n\n\n\nDo you realize that excessive body kilograms kill very much people for every new year? We know that you hate the unattractive appearance of those people and the low status they have in modern society. \n\nMoreover, you can’t resist a siege of your fatal eating habits. This all sounds familiar? Then we have something for you!\n\n\n\n\n\nHere there is Anatrim, the new product for the elimination of your body’s extra weight. The astonishing thing about Anatrim is it improves the quality of your life by repressing your feeling of hunger and giving you joyful spirit. Here are some e-mails from our customers:\n\n\n\n\n\n\"This is amazing! \n\n\nI stopped watching TV continually and always glutting myself with food \n\n\nI became keen on doing exercise.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I feel as fit as a fiddle now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nVictoria K., Boston\n\n\n\n\n\n\n\"Passive weight burning was of no result to me. It was difficult for me to hold back and not to eat something just at hand. \n\n\nOne day I heard on Anatrim in the commercial and it brought a great influence on me.\n\n\n I had tried to take it, and my wife said to me that I look very good now, 3 months later. \n\n\n28 pounds off and it’s still far to an end! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nCharley Mock, Las Vegas\n\n\n\n\n\nAnatrim helps you to realize you doesn’t have such a great need for that much food. It improves your mood, gives you additional energy, and attacks unnecessary kilos. Great thanks to its mighty newly-elaborated formula!!\n\n\n\nPry out latest news!\n\n\n\n"}