{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 140", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Italian police have recovered an ancient Greek temple dug up\n      in southern Italy by a construction crew who had dumped or\tlooted\n      the prized artifacts and begun to pour cement over the ruins.\n      (Museum Security Network Mailing list)\n   2. Saratoga. The mirrored mosaic horse sculpture that was in\n      front of Bonacio Construction Co.'s offices on Excelsior and\tEast\n      avenues fell victim to vandals. (Museum Security Network Mailing list)\n   3. Museum of Antigua & Barbuda robbed of historical data.\n      (Museum Security Network Mailing list)\n   4. Algiers. Pour vol de pi?ces arch?ologiques du Tassili, cinq\n      personnes condamn?es ? une peine de 3 ? 20 ans de prison ferme.\n      (Museum Security Network Mailing list)\n   5. USA. Museum theft. Thief Sails off with Museum's Whaling\n      Artifacts, Sextant (Museum Security Network Mailing list)\n   6. A painting by a Dutch master has reportedly been stolen from\n      the Art Gallery of NSW. (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Wed, 13 Jun 2007 07:34:38 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Italian police have recovered an ancient Greek temple\n\tdug up\tin southern Italy by a construction crew who had dumped or\n\tlooted the prized artifacts and begun to pour cement over the ruins.\nTo: \nMessage-ID: <03e101c7ad7c$88c28d70$9a47a850$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nItalian Police Recover Ancient Temple\n \nBy ARIEL DAVID\nAssociated Press Writer\n\nJune 12, 2007, 12:14 PM EDT\n\nROME -- Italian police have recovered an ancient Greek temple dug up in\nsouthern Italy by a construction crew who had dumped or looted the prized\nartifacts and begun to pour cement over the ruins, authorities said Tuesday.\n\nAfter receiving information about the discovery during construction work on\na tourist resort on the coast of southern Calabria, police used helicopters\nto locate the site near the town of Crotone, said art squad officials from\nthe Carabinieri paramilitary police.\n\nMore than 50 artifacts, including columns and mosaics, had been excavated\nfrom the site and used to decorate another hotel complex nearby, while other\npieces had been placed in a dump to be reused as construction material.\n\nWhen police located the site last week, workers were preparing to lay the\nfoundations of the resort hotel on the remaining ruins, said Gen. Giovanni\nNistri, the head of the art squad.\n\n\"It would have been the final tombstone for this temple,\" Nistri told a news\nconference in Rome.\n\nPolice identified two suspects for possible prosecution for failing to alert\nauthorities about the find, damaging the site and for illegal possession of\narchaeological artifacts, Nistri said. The two were not arrested.\n\nItaly is full of archaeological treasures -- many undiscovered -- and\ndevelopers are required to report any finds. Countless public and private\nworks have been scrapped or delayed over the years as state archaeologists\ndescended on building sites, and it is not uncommon for developers to fail\nto report a discovery and plow through ancient treasures.\n\nIn Rome, plans to build a third subway line have been delayed for decades,\nand in 1999, the construction of a parking garage caused outrage after\nworkers sliced through a Roman villa during hurried preparations for the\nHoly Year celebrations and mosaics and ceramics from the ruins turned up in\na garbage dump on Rome's outskirts.\n\nThe discovery of the Greek temple is of \"extraordinary historic and artistic\nvalue\" and experts believe it may be part of a larger ancient settlement,\nthe Carabinieri said in a statement.\n\nThe ruins are \"one big puzzle\" for scholars, as the area was previously\nthought to be devoid of such important public buildings, said archaeological\nsuperintendent Giovanni Guzzo.\n\nThe temple mixes two styles of Greek architecture, combining the austere\nDoric with the more graceful decorations of Ionic. It was probably built\nbetween the fourth and third centuries B.C. by the Bruzii, an Italic\npopulation that lived under Hellenistic influence, which at the time\nextended across southern Italy, Guzzo said.\n\nHe said that over the next months archaeologists will work to enlarge the\n165-by-65-foot dig. They will also try to reconstruct how the original\ntemple must have looked by piecing together the remains scattered and\ndamaged by the developers.\n\n\nhttp://www.newsday.com/\n\n\n\n------------------------------\n\nMessage: 2\nDate: Wed, 13 Jun 2007 07:34:38 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Saratoga. The mirrored mosaic horse sculpture that was\n\tin\tfront of Bonacio Construction Co.'s offices on Excelsior and\tEast\n\tavenues fell victim to vandals.\nTo: \nMessage-ID: <03e201c7ad7c$8a18cea0$9e4a6be0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nFirst horse falls to vandals \nBy JIM KINNEY, The Saratogian\n06/12/2007\nEmail to a friendPost a CommentPrinter-friendly\nSARATOGA SPRINGS - \"Giddy Up\" is down for the count - for now.\n\nThe mirrored mosaic horse sculpture that was in front of Bonacio\nConstruction Co.'s offices on Excelsior and East avenues fell victim to\nvandals Friday night, said Joel Reed, executive director of the Saratoga\nCounty Arts Council.\nHe said it was tipped over and broken, but whoever did the damage left the\nrest behind. Bonacio's employees are repairing it, and the artists who\ncreated it - Dana Rudolph and Ronda Jeffer - are going to touch it up\ncosmetically. He expected \"Giddy Up\" would be back on display sometime next\nweek. \nGiddy Up is one of 34 uniquely decorated horses featured in \"Horses:\nSaratoga Style,\" a public art event sponsored by the Arts Council and area\nbusiness groups.\nGiddy Up's sudden disappearance had passersby and fans thinking it's been\nstolen. Reed said he didn't announce the vandalism so as not to encourage\ncopycats.\n\"When we first started talking about this months ago, people were talking\nabout the vandalism that happened last time,\" he said, referring the first\n\"Horses: \nSaratoga Style\" project in 2002.\nIn 2002, a Skidmore College student was arrested after passersby saw him\nhauling half of a horse sculpture down Broadway to his apartment. Three\nAmsterdam-area residents also pleaded guilty to taking another sculpture and\ndumping it in the Schoharie Creek along the New York state Thruway.\nThat horse, \"La Petite Fleur,\" was missing for weeks before kayakers found\nit floating in the Schoharie.\n\"It seems like all the publicity - 'help us look out for these sculptures' -\ndidn't help us much last time,\" Reed said. \nReach Jim Kinney at jkinney@saratogian.com or call 583-8729, ext. 216.\n\nhttp://www.saratogian.com/\n\n\n\n------------------------------\n\nMessage: 3\nDate: Wed, 13 Jun 2007 07:34:38 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Museum of Antigua & Barbuda robbed of historical data.\nTo: \nMessage-ID: <03e301c7ad7c$8a2d8f20$9e88ad60$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nMuseum robbed of historical data \n \nTuesday June 12 2007\n \nby Afeefah Beharry\n\n\nBandits made off with tons of historical and research material which were\nstored on jump drives when they broke into the Museum of Antigua & Barbuda\nsometime between Sunday evening and early yesterday morning.\n\nThe burglars also reportedly stole a number of items from the Museum gift\nshop.\n\nExecutive Director of the Historical Society Michele Henry told the Antigua\nSun it appeared as though the bandits broke into the building between 10\np.m. Sunday and 7 a.m. yesterday. \n\nShe said the staff noticed the break in about 7:30 a.m. when they turned up\nfor duties.\n\n\"This is a heavy blow to the society and the people of Antigua & Barbuda,\"\nshe said.\n\nShe said the thieves broke the windows to gain entry to the building and\ndamaged three artefact doors which would be very costly to repair as the\nmaterials are not available today.\n\nThe bandits reportedly took five jump drives, miniaturised electronic\nstorage devices, containing important research project material which Henry\nsaid she was working on to submit to a regional agency for funding.\n\nBesides that, Henry said that they made off with over $1,000 worth in\nreproduction of historical postcards. Maps of Antigua & Barbuda and handmade\njewellery were also stolen. \n\n\"It appears as though these people are petty thieves,\" Henry said.\n\nShe told this newspaper that she was in the process of reviewing the\nsecurity system of the museum with a team from the Public Works Department.\n\nHenry added that the museum, one of the oldest non-profit organisations on\nthe island, does not have funding to employ security guards.\n\nShe said this was the first time something of that magnitude has happened to\nthe museum and she is appealing to individuals who are being approached to\npurchase used jump drives to report it to the police who are investigating\nthe matter.\n\nhttp://www.antiguasun.com/\n\n\n\n------------------------------\n\nMessage: 4\nDate: Wed, 13 Jun 2007 12:50:16 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Algiers. Pour vol de pi?ces arch?ologiques du Tassili,\n\tcinq personnes condamn?es ? une peine de 3 ? 20 ans de prison ferme.\nTo: \nMessage-ID: <020d01c7ada8$a0839f40$e18addc0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nPour vol de pi?ces arch?ologiques du Tassili, cinq personnes condamn?es ?\nune peine de 3 ? 20 ans de prison ferme \n\nLa Tribune (Algiers) \nACTUALIT?S\n12 Juin 2007 \nPubli? sur le web le 12 Juin 2007 \n\nBy Farida Belkhiri\n\n\nLe tribunal criminel d'Illizi a condamn?, samedi dernier, cinq personnes\naccus?es de vol et revente de pi?ces arch?ologiques ? des peines allant de 3\n? 20 ans de prison ferme. Selon une source judiciaire, deux des accus?s ont\n?t? condamn?s chacun ? trois ans de prison ferme et les trois autres ? sept,\ndix et vingt ans de prison. \n\nIls sont tous condamn?s pour ?constitution d'association de malfaiteurs, vol\nqualifi?, escroquerie et tentative d'?coulement de pi?ces arch?ologiques du\npatrimoine culturel du Tassili?, ajoute la source. \n\nSelon l'Office national du parc du Tassili (ONPT), partie civile dans cette\naffaire, les pi?ces arch?ologiques, une centaine, avaient ?t? vol?es par ces\nmalfaiteurs au mois de janvier. Ces derniers avaient tent? de les exp?dier ?\nl'?tranger. \n\nAu cours de ce m?me mois, rapporte le quotidien El Watan dans un article\nparu le 25 avril dernier, des pi?ces arch?ologiques avaient disparu du mus?e\ndu Parc national du Tassili. \n\n64 pi?ces de grande valeur, des bifaces, des hachereaux, des nucl?us, des\np?doncul?s, des lames, des pointes de fl?che et des foliac?es, auraient ?t?\nvol?es par des individus qui se sont introduits au mus?e par effraction.\n?Rien qu'en janvier dernier, 250 objets de la m?me valeur ont ?t? r?cup?r?s\nsur des touristes et remis pour expertise ? l'Office du parc national de\nl'Ahaggar. Les douanes d'Illizi totalisent de 2003 ? 2006, un record de 1\n401 pi?ces arch?ologiques saisies. Un trafic qui ne s'attaque pas uniquement\nau mat?riel arch?ologique mais aussi ? la flore : 948 plantes prot?g?es ont\n?t? retrouv?es dans les paquetages des touristes?, rapporte El Watan. Par\nailleurs, les douanes alg?riennes avaient annonc? la saisie, au mois de\nd?cembre de l'ann?e derni?re, de pr?s d'une centaine de pi?ces\narch?ologiques, du Tassili pour la plus part, dissimul?es dans des bagages\nde touristes. \n\nLa brigade de Tamanrasset aurait saisi durant la m?me ann?e, lors de\ncontr?les effectu?s ? l'a?roport Aguenar, 2 300 pi?ces arch?ologiques sur\nune cinquantaine de vols ? destination de l'?tranger. \n\nEnfin, rappelons l'affaire des cinq touristes allemands qui avaient vol? des\npi?ces arch?ologiques prot?g?es et condamn?s en janvier 2005 ? deux mois de\nprison ferme par le tribunal de Djanet. \n\nhttp://fr.allafrica.com/\n\n\n\n------------------------------\n\nMessage: 5\nDate: Wed, 13 Jun 2007 12:50:16 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] USA. Museum theft. Thief Sails off with Museum's\n\tWhaling\tArtifacts, Sextant\nTo: \nMessage-ID: <020e01c7ada8$a1b9ae40$e52d0ac0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nThief Sails off with Museum's Whaling Artifacts, Sextant \nBy Al Campbell | Published  Today | General News   \n \n \nThief Sails off with Museum's Whaling Artifacts, Sextant\nSWAINTON - Six historic whaling implements, with a total value of $3,500\nwere stolen from the Cape May County Historical Museum some time between\nJune 2 at 2 p.m. and the morning of June 5.\nAccording to Curator Pary Woehlcke, Middle Township police haven't gotten\nany leads on the theft thus far.\n\"In 75 years, this is the second time someone has stolen whaling\nimplements,\" she said as she showed the whaling implement case, where the\nvintage weapons were displayed.\nAccording to Woehlcke, who spoke with former curator Somers Corson, a\nsimilar incident occurred about 20 years ago when a burglar entered the barn\nlocated behind the museum on Route 9, and took whaling implements.\nThe difference between then and now, someone in the nursing home, just east\nof the barn, spotted that thief and alerted Middle Township police, who\ncaught the culprit with the stolen goods in his car on Stone Harbor\nBoulevard.\nNo such luck this time.\nWoehlcke said police continue to check various Internet auction sites, where\nunsuspecting villains sometimes fence such stolen gear.\nIt's theorized the thugs knew what they wanted, leaving many other valuable\nitems untouched.\nAmong the most highly valued of the stolen items was a sailor's sextant in a\nwooden case. It was removed from a glass display case without breaking the\nglass.\nAlso stolen were:\n* Toggle Iron, for use in a darting gun.\n* Single fluted harpoon\n* Bomb lance\n* Darting gun with bomb lance.\n* Darting gun without a bomb lance\n* Sailor's sextant\n* Sailor's palm thimble, used by Humphrey Cresse to mend canvas sails.\nWoehlcke said that the stolen items were all marked with small white dot\nstickers on which identifying numbers were written.\nThose stickers had been on the items so long, she said it is likely that the\nmetal underneath would be somewhat brighter than the surrounding metal.\nThe harpoons were about 2.5 to 3 feet in length. The darting gun resembled a\nshotgun, and was used to fire a lance with a charge on it, to kill the whale\nquicker.\nThose harpoons were \"rather common,\" Woehlcke said, and others, quite\nsimilar to them were untouched by the thief.\nThe barn's two doors, in which the whaling implements were exhibited, are\nroutinely left open when the museum is in operation.  Tours are then taken\nthrough.\nSince there is a door close to a driveway leading to the nursing home,\nWoehlcke said it would have been possible for a thief to pull in there, take\nthe items, and exit without being seen.\n\"We think that whoever did it cased the collection and knew exactly what\nthey wanted,\" she said.\nAnyone with information about the theft is asked to contact Middle Township\npolice at (609) 465-8700.\n\nContact Campbell at (609) 886-8600 ext 28 or e-mail: al.c@cmcherald.com\n\nhttp://www.capemaycountyherald.com/\n\n\n\n------------------------------\n\nMessage: 6\nDate: Wed, 13 Jun 2007 12:50:16 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] A painting by a Dutch master has reportedly been stolen\n\tfrom\tthe Art Gallery of NSW.\nTo: \nMessage-ID: <021901c7ada8$a40488a0$ec0d99e0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nDutch painting 'stolen from NSW gallery'\n13th June 2007, 16:48 WST \n\nA painting by a Dutch master has reportedly been stolen from the Art Gallery\nof NSW.\n\nNeither the Art Gallery of NSW nor the NSW Police Force would confirm the\nChannel Nine report of the theft.\n\n\"I don't have any comment,\" gallery spokeswoman Claire Martin said.\n\nHowever, she said a joint press conference with police was scheduled for\nThursday morning.\n\nIn its one-line report, Channel Nine did not name the artwork nor the\npainter.\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 140\n****************************************\n\n"}