{"category": "ham", "to_address": "<r-packages@stat.math.ethz.ch>", "from_address": "\"John Fox\" <jfox@mcmaster.ca>", "subject": "[R] [R-pkgs] Rcmdr 1.3-0 and RcmdrPlugins.TeachingDemos", "body": "I'd like to announce a new version, 1.3-0, of the Rcmdr package. The Rcmdr\npackage provides a basic-statistics graphical user interface (GUI) to R. \n\nBeyond small changes and additions, this new version of the package makes\nprovision for \"plug-ins\" that permit extension of the Rcmdr GUI without\naltering and rebuilding the Rcmdr source package or modifying the installed\npackage. An R Commander plug-in is an ordinary R package that (1) provides\nextensions to the R Commander menus is a file named menus.txt located in the\npackage's etc directory; (2) provides call-back functions required by these\nmenus; and (3) in optional Log-Exceptions: and Models: fields in the\npackage's DESCRIPTION file, augments respectively the list of functions for\nwhich printed output is suppressed and the list of model objects recognized\nby the R Commander. The menus provided by a plug-in package are merged with\nthe standard Commander menus. \n\nPlug-in packages given in the R Commander plugins option (see ?Commander)\nare automatically loaded when the Commander starts up. Plug-in packages may\nalso be loaded via the Commander \"Tools -> Load Rcmdr plug-in(s)\" menu; a\nrestart of the Commander is required to install the new menus. Finally,\nloading a plug-in package when the Rcmdr is not loaded will load the Rcmdr\nand activate the plug-in. \n\nAn illustrative R Commander plug-in package, RcmdrPlugin.TeachingDemos\n(providing a GUI to some of Greg Snow's TeachingDemos package), is now\navailable on CRAN. (I suggest using this naming convention -- RcmdrPlugin.*\n-- so that plug-in packages will sort immediately below the Rcmdr package on\nCRAN. This assumes, of course, that other people will be interested in\ncreating Rcmdr plugins!)\n\nBecause this is a new feature of the Rcmdr, feedback and suggestions would\nbe appreciated.\n\nI'd like to acknowledge Richard Heiberger's suggestions for the design of\nthis plug-in facility.\n\nJohn\n\n--------------------------------\nJohn Fox, Professor\nDepartment of Sociology\nMcMaster University\nHamilton, Ontario\nCanada L8S 4M4\n905-525-9140x23604\nhttp://socserv.mcmaster.ca/jfox\n\n_______________________________________________\nR-packages mailing list\nR-packages@stat.math.ethz.ch\nhttps://stat.ethz.ch/mailman/listinfo/r-packages\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}