{"category": "ham", "to_address": "James Keenan <jkeen@verizon.net>", "from_address": "Allison Randal <allison@perl.org>", "subject": "Re: Odd failure in t/postconfigure/02-revision_no_DEVELOPING.t", "body": "To answer the questions for 03-revision.t:\n\nJames Keenan wrote:\n> \n> 1.  Can you say a bit more about the context in which you ran this \n> test?  'make test'?  'prove t/postconfigure/*.t'?  In particular, did \n> you run it *before* running Configure.pl or *afterwards*?\n\nI ran Configure.pl a while ago (with several intervening runs of 'make' \nand 'make test'), ran 'svn update', 'make', and 'make test'.\n\nI don't run Configure.pl every time I update the repository. That \nregenerates the Makefile, and so recompiles all of Parrot. I rarely need \nto go that far.\n\n> 2.  If you do 'make clean', then 'svn update', then re-run the test, do \n> you still get the error?\n\nThat fixes the error. Until the next time I run 'svn update' and rerun \nthe test.\n\n> 3.  This test was tricky, and, in the course of developing it, I got \n> this same error several times.  The trickiness arises from the fact that \n> the underlying code being tested, lib/Parrot/Revision.pm, has the name \n> of a file in the Parrot distribution hard-coded into its major subroutine:\n> \n> sub __get_revision {\n>     return 0 unless ( -e 'DEVELOPING' );\n>     ...\n> }\n> \n> In my never-ending quest for complete code coverage, I had to devise a \n> way to test both branches in that return statement, i.e., test under \n> circumstances in which 'DEVELOPING' both does and -- here's the tricky \n> part -- does not exist.  The only way I could do the latter was to copy \n> the relevant files into a temporary directory and, for certain tests, \n> not copy 'DEVELOPING' along with them.  It's very hackish, but it did \n> enable me to get to full coverage of that statement.\n\nCould you take a step back and explain what you're testing? At first \nglance, I don't see why we would test the revision number. Just to be \nsure that Parrot::Revision got some value during the configure process?\n\nAllison\n\n"}