{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Elsie Dupree\" <laxcsipromosvew@csipromos.com>", "subject": "Losing weight has never been so easy", "body": "\nDoctors and Celebrities endorse Anatrim\n\n\n\n\n\nAnatrim – The very up-to-date and most delighting product for corpulent people is now easily available – As were told on BBC\n\n\n\nDo you realize that redundant body kilos kill very much people around the world? We know you hate the unsightly appearance of people like those and the social stigmata attached to them. \n\nOr, maybe, you have not the will to resist a siege of terrible eating habits of yours. If this sounds familiar, then we got something to propose to you!\n\n\n\n\n\nHere there is Anatrim, the new product for the elimination of your body’s extra weight. The most astonishing thing is that Anatrim improves the quality of your life, making you eat less and always cheering you up. Pay you attention to what people write on this product:\n\n\n\n\n\n\"This is amazing! \n\n\nI stopped gorging any food easy to reach and watching TV constantly \n\n\nI became more interested in doing sport.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I am more fit now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nSilvia D., Chicago\n\n\n\n\n\n\n\"I tried some passive weight reducing, you know, but all came in vain. It was difficult for me to hold back and not to eat something just at hand. \n\n\nOnce I heard on Anatrim in the media advertisement and it brought a great influence on me.\n\n\n I had attempted taking it, and my wife said that I'm a different person now, 4 months later. \n\n\n26 pounds off and this is not a limit! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nSteve Burbon, Boston\n\n\n\n\n\nAnatrim gives you an opportunity to understand that you got no such great need for that much food. It raises your spirit up, gives you extra energy, and attacks useless kilos. All thanks to its mighty original formula!!\n\n\n\nPry out latest news!\n\n\n\n"}