{"category": "ham", "to_address": "\"R-help\" <r-help@stat.math.ethz.ch>", "from_address": "\"Greg Snow\" <Greg.Snow@intermountainmail.org>", "subject": "[R] my.symbols and zoomplot functions now available in\n TeachingDemos package", "body": "\nIn February (2/26) Jonathan Lees asked a question about plotting symbols\nwhose shape/aspect ratio is independent of of the user coordinate\nsystem.  A couple of other posts have also been made asking about\nplotting symbols of a given fixed size/aspect ratio.\n\nThe latest version of the TeachingDemos package (1.5) now has a function\ncalled my.symbols that is similar to the symbols function except that it\nallows you to specify your own symbols.  Your symbol can be a matrix or\nlist with x and y coordinates (on the range -1, 1) that specify the\nshape of the symbol (to be connected with lines), or it can be a\nfunction (additional arguments are passed to this function) that plots\nyour symbol.  The my.symbols function will then place your symbols at\nthe designated x,y coordinates at the specified size with the aspect\nratio independent of the user coordinates.  Some example symbol\nfunctions are also provided and the help page shows several examples of\npotential uses.  Hopefully others will find this useful.\n\nThere have also been several questions recently about changing the range\nof a plot after the plot has been created.  TeachingDemos now also\ncontains a function zoomplot that will do this (either zooming into a\nsection of the existing plot, or zooming out to show parts that were\npreviously clipped).  This function is a quick and dirty hack and should\nnot replace properly defining the ranges for serious graphs, but may be\nhelpful for quick exploring.\n\nOn a similar note, there is also a new function (plot2script) for\ncreating a script file to recreate the current plot that can then be\neditted and rerun to make minor changes.  \n\nThese functions have only been tested on windows (R versions 2.4.1 and\n2.5.0beta), so I would appreciate if someone could try them on other\nplatforms and let me know if they work or not.\n\nHope these are useful to others out there,\n\n\n\n-- \nGregory (Greg) L. Snow Ph.D.\nStatistical Data Center\nIntermountain Healthcare\ngreg.snow@intermountainmail.org\n(801) 408-8111\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}