{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHappy Fourth of July, everyone. This is Russ\n  Mitchell filling in for Katie.\n \nA record number of Americans are celebrating the\n  holiday today away from home. And transportation security is extra tight after\n  the thwarted terror attacks in the U.K. Nancy Cordes will look at the security\n  – and the celebrations – on the land, at sea and in the sky\n  tonight.\n \nBut extreme weather in some parts of the United States\n  is putting barbeques and fireworks on hold. Alabama,\n  Mississippi and Tennessee are in a serious drought, and\n  rivers are so low barges are having trouble getting through. But Kansas, Oklahoma and Texas have the\n  opposite problem: major flooding – and an oil spill is complicating\n  matters. Sandra Hughes and Hari Sreenivasan will have these stories tonight.\n \nTurning our attention overseas, the investigation\n  into the U.K.\n  terror plot continues, and our Sheila MacVicar will have the latest details.\n \nIt was literally a day to celebrate freedom for\n  British reporter Alan Johnston – he was released after nearly four\n  months in captivity in the Gaza Strip. Johnston, a BBC reporter, said it was\n  “fantastic” to be free from the jihadi group called Army of Islam.\n  Elizabeth Palmer will have the story.\n \nOn a lighter note, there’s something fishy\n  going on in some of the country’s finest lakes. Sharyn Alfonsi will set\n  the record straight.\n \nAnd we’ll leave you tonight with a touching story\n  about the healing power of animals. \n \nHave a wonderful holiday,\n \n\n\n\n\nRuss Mitchell\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}