{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 18, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESOfficials: Gunman Left \"Suicide Note\"\nThe search of the Virginia Tech gunman's apartment produced eight pages of notes which law enforcement sources characterize\n                        as a \"suicide note,\" reports CBS News correspondent Bob Orr. They say the writings \"appear to be a manifesto.\" More...Watch: Cho Was On Campus Police Radar\n• High Court Upholds Ban On Some Abortions\n                     \t\t\t\t\t| Watch• At Least 183 Dead In Baghdad Bombings\n                     \t\t\t\t\t| Watch• BlackBerry Outage Leaves Thumbs IdleU.S.Preacher's Wife Heard \"Boom\" Of Shotgun\nA preacher's wife accused of murdering her husband testified Wednesday that she doesn't remember picking up the shotgun or\n                        pointing it at her husband, and did not pull the trigger. But she heard a \"boom\" as the shotgun fired.\n                         More...\n• IRS Chief To Lead Red Cross • Rescuers Search For 2 Missing Coal Miners• Officials: Gunman Left \"Suicide Note\"\n                     \t\t\t\t\t| Watch• More StoriesWorldAt Least 183 Dead In Baghdad Bombings\nFour large bombs exploded in mostly Shiite areas of Baghdad, killing at least 183 people in the deadliest day in the city\n                        since the U.S. troop surge began nine weeks ago. Nationwide, the number of people killed or found dead in Iraq was 233. More...Watch: Deadly Bombs Rip Baghdad\n• Missing Peace Corps Teacher Found Dead• Bush Threatens Sudan Over Darfur Bloodshed• U.S. Eyes Connection Between Iran, Taliban\n                     \t\t\t\t\t| Watch• More StoriesPoliticsHigh Court Upholds Ban On Some Abortions\nIn a 5-4 ruling, the Supreme Court upheld the federal ban on a controversial abortion procedure, handing a major victory to\n                        abortion opponents. More...Watch: White House On Abortion Ruling\n• Pure Horserace: It's All In The Timing• Bush Threatens Sudan Over Darfur Bloodshed• Why The NRA Gets Its Way\n                     \t\t\t\t\t| Watch• More StoriesHealthStudy: Whole-Grain Oats Cut Cholesterol\nEating a diet rich in whole-grain oats may help lower cholesterol in people at risk for heart disease, an analysis shows. More...\n• Does Cervical Cancer Vaccine Benefit Last?• Warning Signs Abounded\n                     \t\t\t\t\t| Watch• Aspirin May Protect Against Cancer• More StoriesSciTechPossible Aid For Alzheimer's: Satellites\nThe British minister for science and innovation told a parliamentary hearing today that seniors suffering from dementia could\n                        have their movements tracked by a system of satellites, to monitor their whereabouts more effectively.  More...\n• BlackBerry Outage Leaves Thumbs Idle• TurboTax Trouble• Text Messages Can Get The Word Out Fast• More StoriesBusinessHong Kong Diners Face Fines For Leftovers\nIn Hong Kong, restaurant owners are starting to sound like your mother. They are putting little signs on tables that threaten\n                        to fine diners who leave food on their plates.  More...\n• TurboTax Trouble• BlackBerry Outage Leaves Thumbs Idle• Clear Channel Accepts $19 Billion Bid • More StoriesEntertainmentClyde No Longer \"Dancing With The Stars\"\nHe was known as \"The Glide\" on the basketball court, but Clyde Drexler did not have the same magic on the dance floor. He\n                        was eliminated from ABC's \"Dancing With the Stars\" Tuesday. More...\n• Cowell Denies Disrespecting Virginia Tech• Birkhead Hopes To Leave Drama Behind Him\n                     \t\t\t\t\t| Watch• Madonna Visits Malawian Kids' Center\n                     \t\t\t\t\t| Watch• More StoriesOpinionMaking No Sense Of It All\nAs more details emerge about Cho Seung-Hui and the circumstances surrounding Monday's massacre at Virginia Tech, many questions,\n                        but no answers, have surfaced. National Review Online writes about the guilt, emotion and evil of this crime. More...Watch: Killer's Profile Analyzed\n• Iraq On Edge\n                     \t\t\t\t\t| Watch• Seeing Through The Smoke• Thinking About The Unthinkable\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Three Va. Tech Friends Mourn Together\nAfter looking for him, friends of Jeremy Herbstritt learned that he was one of the 33 people killed at Virginia Tech. They\n                        talk to The Early Show co-anchor Harry Smith about losing him. More...Watch: Students Mourn Lost Friend\n• EARLY SHOW: A Brother's 'Indescribable' Pain\n                     \t\t\t\t\t| Watch• EARLY SHOW: Signs Were There, Was Security In Place? \n                     \t\t\t\t\t| Watch• EARLY SHOW: Warning Signs Abounded\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nA Brother's PainReema Samaha, a victim in the Virginia Tech massacre, grew up about a mile from the gunman. Her brother Omar reminisces with\n                                    Harry Smith about the sister he deeply loved.\nTOP VIDEOS\nCourt Upholds Abortion Ban\nFirst Look: Abortion Ruling\nBombs Kill Over 150 In Baghdad\nWorking Through The Trauma\nStretch Eases 'Runner's Heel'\nMadonna Welcomed In Malawi\nWhite House On Abortion Ruling\nProfessor Saw Warning Signs\nA Professor's Story Of Heroism\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesThe exonerated Duke lacrosse students give their first interview to Lesley Stahl, just days after all remaining charges\n                           against them were dropped. Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryThe Puppet Master:A couple is gunned down, the triggerman is known. But who was pulling the strings behind the\n                           scenes? Troy Roberts reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}