{"category": "ham", "to_address": "\"Gerald (Jerry) Carter\" <jerry@samba.org>", "from_address": "Jelmer Vernooij <jelmer@samba.org>", "subject": "Re: Comparision of Git & Bzr [was Re: Short HOWTO on using git for\n\tSamba development]", "body": "On Tue, Jun 26, 2007 at 09:27:07AM -0500, Gerald (Jerry) Carter wrote:\n> Jelmer Vernooij wrote:\n> I mentioned this before but I'm curious, do people\n> consider win32 support a requirement for our SCM?\nNo, I don't think it is. People with Windows already have a SMB\nserver. Also, git does work on Windows, it just can't be as fast as it\nis on Linux.\n\n> >> * What would the resulting size be?\n> > I think it was about half the size of the Samba Subversion \n> > repository last time I tried it.  Obviously, it would be a\n> > lot less when lazy repositories would be supported.\n> Really ?  Does the revision sharing in a repository gain\n> you that much? My SAMBA_4_0.bzr diff/patch mirror from svn is\n> 312MB alone.  And the entire Samba svn repo is only about\n> 550MB.\nThat's odd, I recall my just-Samba 4 import into bzr was around 200 Mb\nlast I tried (but that's a while ago now).\n\n> Help me to understand something about repositories.  The way\n> I read things, \"bzr init-repo\" just gives me a way of sharing\n> revision history between branches but does not provide a way\n> to do the equivalent of \"git-clone\" where I get the entire\n> repo and branches.  I can only \"bzr clone\" a single branch\n> at a time.\n\n> So a repo is a nice for a single developer or a shared\n> repository where people do checkouts, but not as a means of\n> publicaly sharing branches in a project.\n\n> Am I right?\nRight. Shared repositories are just a storage optimization. They're\nnot a UI thing (yet). I've heard people talking about allowing you to\npush repositories and all the branches in them at once, but haven't\nseen any actual implementations.\n\nOn Tue, Jun 26, 2007 at 10:01:15AM -0500, Gerald (Jerry) Carter wrote:\n> Jelmer Vernooij wrote:\n> I would be very concerned about scaling a bzr repo with our\n> existing number of svn commits.  Granted that we coud drop\n> the svn history and that a DSCM system may not see the same\n> high number f commits as the \"svn-commit-to-save\" pattern\n> we have here, but long term this could be a real problem.\nBazaar is working on getting better performance, it's just not there\nyet. It will work with large trees in the future, just not yet. I also\ndon't think we should adopt it (even by truncating history) until it\ncan handle the larger histories.\n\n> I don't want to start out with performance issues.\n> And I don't see rsync as a valid means of initial branching.\n> bzr should stand on its own without alternative means of\n> obtaining the initial tree.\nAgreed.\n\nCheers,\n\nJelmer\n\n-- \nJelmer Vernooij  - http://jelmer.vernstok.nl/\n\n"}