{"category": "spam", "to_address": "<gnitpick@speedy.uwaterloo.ca>", "from_address": "\"Emm\" <ongec@wave.hicv.net>", "subject": "Transfers are included in your package price.", "body": "CDPN Starts Huge Campaign! Watch For News!\n\nChina Datacom Corp.\nSym: CDPN\nPrice: $0.08\n\nCDPN, in the news 8 months ago for purchasing Supremacy International\nand entering the new G3 Market, is beginning a huge marketing campaign.\nWatch for the news and get ready for the ride! Get on CDPN firs thing\nFriday!\n\nFront Desk Postage stamps, telecommunications, express mail, courier\nservices, safe deposit facilities and general information are available\nat the front desk. Our distinctive restaurant and administration complex\nis centrally located for guest convenience and serves as a social hub\nbefore and after dives.\nThe front desk can change small amounts of US dollars for you. Wander\nonto the bridge and have a look at our route maps and a chat with our\ncaptain.\nSingapore is the main gateway city for most of our guests and has a\nreputation as a world class airport. On the wide-open grasslands you can\ntravel through huge herds of Zebra, Giraffe, Gazelle, and Topi.\nFine diving also means that our dive guides can help you find and\nphotograph the elusive animals that you have only dreamt about seeing.\nHowever, we also have many other excellent dives available. The 12\ncabins have individual air-conditioning units and bathrooms, are teak\nwood-paneled and furnished using locally crafted wall hangings and\nartifacts from throughout the Indonesian Archipelago. 3 million\nWildebeest together into a single massive herd. If you require transfers\nat other times, a surcharge will apply.\nWander onto the bridge and have a look at our route maps and a chat with\nour captain. At Kungkungan Bay Resort we want our guests to be\ncomfortable during their stay and casual attire is acceptable for all\nmeals.\nThe cabins provide a welcome sanctuary after a day filled with exciting\ndives where one can kickback and annotate dive logs or just catch up on\na good novel. 53 species of birds of prey have been recorded. Each\ntender is manned by two competent crew members whom are familiar with\nthe dive sites, diving and emergency First Aid.\nBe sure your passport has full 6 months validity from your date of\ndeparture to Indonesia, and it has at least 6 fully blank pages before\nentering the country. Silk Air nonstop flights from Singapore to Manado\ninternational airport are four days a week. Host Jackson Looseyia\nSeasons We are open all year round except April, May and November when\nwe close for the rains. The warmest time of year is December, January\nand the coolest is June, July.\nThis is the best place in all of Kenya to see Lions. 3 million\nWildebeest together into a single massive herd.\nKungkungan Bay Resort has developed a reputation for pioneering a\nconcept called FINE DIVING.\n3 million Wildebeest together into a single massive herd. Check Out Time\nCheck out time is 12 noon. Emergencies In case of an emergency please\ncontact the manager via the front desk.\nDrying racks are provided in each room and at the dive shop. Fishing\nFishing is not allowed at Kungkungan Bay. We have ice-cold beer (local\nand imported) wine from Australia, and tropical drinks with local fruit\njuices. The trip starts in Bima and ends in Bali and offers unlimited\ndaily diving.\nOn the wide-open grasslands you can travel through huge herds of Zebra,\nGiraffe, Gazelle, and Topi. The Mara is part of a massive ecosystem,\ncontiguous with the plains of the Serengeti, which stretches across the\nborder into Tanzania. As a part of our Fine Diving program we have\nscheduled photo and fish experts at various times throughout the year.\nThe camp is set up seasonally (June through October, December through\nMarch) and caters for between four and twelve guests. Fast on its feet,\nreaching speeds of up to 15 mph, their mouths carry virulent bacteria\nwhich eventually immobilize the Komodo dragon's prey once bitten.\nEach year the promise of rain and fresh life giving grass in the north\nbrings more than 1.\nThe seating capacity fits 8 divers comfortably. It offers breathtaking\nviews (seen in the film 'Out of Africa', much of which was filmed here)\nan extraordinary density of animals including the \"Big Five\" and many\nvarieties of game.\nScuba divers often encounter a new species while diving in the Komodo\nNational Park. Emergencies In case of an emergency please contact the\nmanager via the front desk.\nThe dive deck's 300 litre x 300 bar (5000 psi) air bank system and\nensures that tank filling is done with speed. 50 m unsinkable aluminum\ntenders.\nWildlife viewing at Rekero is either on foot guided by experienced Il\nDorobo and Masai trackers, or in custom built four wheel drives, which\nallow intimate yet unobtrusive access to the animals. A visa extension\nof 15 days is allowed upon payment of an additional fee.\nPlease check your visa on arrival status carefully as people have been\nturned away at the airport since the new regulations came into force.\nSpare parts are also for sale on board.\nThe Komodo National Park is one of the worlds most diverse and\ninteresting marine and wildlife parks with a total land area of 75,000\nhectares. Food in the rooms will attract various critters which are\nunwelcome as overnight guests. Apart from the seasonal migration, game\nviewing is excellent year round.\nKomodo Dragons The infamous, Komodo dragon is a land-dwelling, carnivore\nand the planet's largest lizard.\nThis great range of natural habitats means that there is plenty to\nexplore, and plenty of species to encounter.\nClothing Light cotton clothing is most comfortable in the area. There is\nno extra charge for children under 12 years sharing accommodation with\nparents. A two-pronged round plug fits into a recessed opening.\n\n"}