{"category": "ham", "to_address": "speakup@braille.uwo.ca", "from_address": "Gregory Nowak <greg@romuald.net.eu.org>", "subject": "Re: Anyone found problems with 2.6.21.5 kernel speakup and mrproper?", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nI remember seeing this at least since 2.6.19, and probably earlier, it's\nbeen like that for a good while. I always assumed it was a problem\nwith the kernel source itself, rather than the speakup patch, since I\nnever bothered running mrproper on a clean source, as I mentioned in\nanother thread here earlier. \n\nSince everything compiles and works fine anyway, I just ignored it,\nand didn't worry about it, or bother mentioning it.\n\nGreg\n\n\nOn Wed, Jun 20, 2007 at 11:32:16PM +0100, Georgina Joyce wrote:\n> Hi\n> \n> Here's a strange thing, after patching a fresh source of the 2.6.21.5 tar ball I get the error shown below.  I've tried as a standard user and as root.  I don't understand why that the patching of speakup is causing this error when issuing the mrproper command.  Because the file named in the error isn't part of the tar ball in the first place.  The mrproper command doesn't produce this error until the kernel has been patched with speakup.  I've downloaded and checked out with fresh tar balls and the results are the same.\n> \n> I proceeded with the build which was successful, without errors and the kernel came up talking.\n> \n> Kirk are you aware of this?  I've built speakup into the kernel, oh thinking about it, the only speakup module is the software synth.  Which I haven't attempted to run.  It's occurred on a debian etch and also on a nearly complete lfs installation.\n> \n> make mrproper\n> awk: cmd. line:1: fatal: cannot open file `/usr/src/linux-2.6.21.5/include/linux/version.h' for reading (No such file or directory)\n> \n> Regards\n> \n> Gena\n> \n> Amateur Call: M 0 E B P\n> \n> VOIP / IM: gena1959uk\n> \n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n- -- \nweb site: http://www.romuald.net.eu.org\ngpg public key: http://www.romuald.net.eu.org/pubkey.asc\nskype: gregn1\n(authorization required, add me to your contacts list first)\n\n- --\nFree domains: http://www.eu.org/ or mail dns-manager@EU.org\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGebZ+7s9z/XlyUyARAnZwAKCYQCf6xZhdZnwNzcVKxn+xdLIsgwCglCKE\nmUgSfekWh7vn1/ovdLV8SO4=\n=C8om\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}