{"category": "ham", "to_address": "MSF Michel Lotrowska <access@msf.org.br>", "from_address": "=?ISO-8859-1?Q?Ga=EBlle_Krikorian?= <gaelle.krikorian@gmail.com>", "subject": "Re: [Ip-health] G8 document on PROMOTING INNOVATION - PROTECTING INNOVATION -  In the document GROWHT AND RESPONSIBILITY IN THE WORLD ECONOMY", "body": "pure industry language, isn't it. in writing this document the G8\ndoes not seem to have been under too many different influences. gaelle\n\nOn Jun 8, 2007, at 4:51 AM, MSF Michel Lotrowska wrote:\n\n> This is a multi-part message in MIME format.\n> --\n> [ Picked text/plain from multipart/alternative ]\n> PROMOTING INNOVATION - PROTECTING INNOVATION\n>\n> 30. Science, research and innovation today more than ever form the\n> basis of\n> economic growth and prosperity. Political and economic strategies\n> to foster\n> innovation are therefore key elements for the future development of\n> industrialised countries,\n> emerging economies and developing countries alike. We will\n> undertake to bring forward\n> an international economic and political environment that promotes\n> and protects innovation.\n>\n> Innovation for Sustainable Growth\n>\n> 31. Forward looking innovation policy is geared towards promoting the\n> research community\n>\n> and towards translating ideas, the product of the research process,\n> into\n> innovative\n>\n> products and services. Whereas the promotion of research involves\n> education\n> and\n>\n> higher-education policy, economic policy can play a crucial role in\n> promoting the translation\n>\n> of research into innovative products and in fostering an innovation-\n> friendly\n> business\n>\n> environment. Both tasks benefit from the engagement of national\n> governments.\n> International\n>\n> cooperation and exchanges can supply a substantial impetus in the\n> shaping of\n>\n>\n> national policy. Cooperation between advanced and developing\n> countries in\n> research\n>\n> activities in the field of science and technology should also be\n> strengthened.\n>\n> 32. Because we strive to provide scientific and technical\n> leadership we also\n> recognize\n>\n> our responsibility for a long-term oriented research initiative\n> that will\n> focus on concentration\n>\n> of scientific research and improved technological capacity in order\n> to be\n> able to react\n>\n> most effectively to future global challenges. We recognize the\n> increasing\n> significance\n>\n> of many emerging economies in science and research and invite them to\n> actively\n>\n> participate in this process by reinforcing already existing\n> cooperative\n> efforts in the\n>\n> OECD building also on the results of ongoing work promoted inter\n> alia by the\n> relevant\n>\n> UN bodies.\n>\n> 33. In this respect we support the engagement of the OECD to work on\n> proposals for\n>\n> topical international collaborative efforts. Based on the work of\n> the Global\n> Science Forum\n>\n> (GSF), we recognize the value that the GSF will bring as the\n> moderator of\n> this\n>\n> process. We also support the sharing of information among the G8 and\n> emerging\n>\n> economies on national research endeavours in order to identify\n> priorities\n> that could be\n>\n> enhanced by collaborative research efforts, joint initiatives and\n> programmes\n> on areas of\n>\n> common interest. Possible areas of cooperation could be sustainable\n> use of\n> water and\n>\n>\n>\n>\n>\n>\n> 10\n>\n> land and research in the field of energy efficiency as well as the\n> promotion\n> of environmentally-\n>\n> related innovations both in the public and in the business sector.\n> We will\n> work\n>\n> together to achieve more effective coordination and cooperation in our\n> research efforts\n>\n> in these fields.\n>\n> Intellectual Property Protection as the Backbone of Innovation\n>\n> 34. A fully functioning intellectual property system is an\n> essential factor\n> for the sustainable\n>\n> development of the global economy through promoting innovation. We\n> recognize\n>\n>\n> the importance of streamlining and harmonizing the international\n> patent\n> system in order\n>\n> to improve the acquisition and protection of patent rights world-wide.\n>\n> 35. The benefits of innovation for economic growth and development are\n> increasingly\n>\n> threatened by infringements of intellectual property rights\n> worldwide. We\n> therefore\n>\n> strongly reaffirm our commitment to combat piracy and\n> counterfeiting. Trade\n> in pirated\n>\n> and counterfeit goods threatens health, safety and security of\n> consumers\n> worldwide,\n>\n> particularly in poorer countries. In this regard we welcome work on\n> the WHO\n> initiative to\n>\n> implement the International Medicinal Products Anti-Counterfeit\n> Taskforce\n> (IMPACT).\n>\n> Our common efforts in this combat are therefore in the interest of all\n> countries at all levels\n>\n> of development.\n>\n> 36. We commit to strengthen cooperation in this critical area among\n> the G8\n> and other\n>\n> countries, particularly the major emerging economies, as well as\n> competent\n> international\n>\n> organizations, notably the World Intellectual Property Organization\n> (WIPO),\n> WTO,\n>\n> the World Customs Organization (WCO), Interpol, the World Health\n> Organization\n>\n> (WHO), the OECD, APEC, and the Council of Europe. We invite these\n> organizations to\n>\n> reinforce their action in this field.\n>\n> 37. We welcome the joint Declaration of the business communities of\n> all G8\n> countries\n>\n> on \"Strategies of G8 Industry and Business to Promote Intellectual\n> Property\n> Protection\n>\n> and to Prevent Counterfeiting and Piracy\" which highlights actions\n> companies\n> are taking\n>\n> to secure their intellectual property rights at home and abroad and\n> to keep\n> their global\n>\n> supply chains free of pirated and counterfeit goods - from\n> producers and\n> distributors,\n>\n> retailers and merchandisers. Industry and business have an\n> essential role to\n> play in protecting\n>\n> innovation, and we will engage our respective private sectors on\n> effective\n> solutions\n>\n> with regard to both the supply and the demand side of piracy and\n> counterfeiting.\n>\n> We also welcome educational campaigns with the help of business\n> communities\n> in our\n>\n> countries directed at raising awareness of consumers with regards\n> to the\n> negative effects\n>\n> of counterfeiting and piracy.\n>\n> 38. In light of the urgency to implement concrete measures which will\n> improve and\n>\n> deepen cooperation among G8 partners and deliver real enforcement\n> results,\n> we decide\n>\n> to undertake the following:\n>\n>\n>\n>\n>\n>\n> (a) We endorse the Guidelines for Customs and Border Enforcement\n> Cooperation\n> designed\n>\n> to strengthen cooperation and coordination among our national\n> customs and\n> law\n>\n> enforcement administrations. In this context we especially welcome the\n> development of\n>\n> an effective information exchange system - where appropriate -in close\n> association\n>\n> with the WCO which will lead to improved cooperation among the\n> relevant\n> enforcement\n>\n> authorities worldwide.\n>\n> (b) We endorse new Guidelines for Technical Assistance on intellectual\n> property rights\n>\n> protection to interested developing countries, as well as a\n> mechanism to\n> better coordinate\n>\n> and leverage existing G8 assistance to such countries with a view to\n> building the\n>\n> capacity necessary to combat trade in counterfeited and pirated\n> goods to\n> strengthen\n>\n> intellectual property enforcement. In partnership with certain\n> developing\n> countries we\n>\n> agree to launch technical assistance pilot plans with a view to\n> building the\n> capacity necessary\n>\n> to combat trade in counterfeited and pirated goods to strengthen\n> intellectual\n>\n> property enforcement. The progress on these pilot plans will be\n> reviewed by\n> the G8 in\n>\n> 2008.\n>\n> (c) We endorse the recommendations aimed at improving G8 member\n> countries'\n> cooperative\n>\n> actions to combat serious and organized intellectual property\n> rights crimes\n> and\n>\n> the further work on their basis to facilitate structured international\n> cooperation regarding\n>\n> the investigation and prosecution of those crimes.\n>\n> (d) While appreciating the information contained in the OECD report\n> estimating the economic\n>\n> impacts of counterfeiting and piracy on national economies and right\n> holders, as\n>\n> well as public health and safety, we will encourage the OECD to\n> work with\n> member\n>\n> states to further identify and target in its report specific areas for\n> concrete actions.\n>\n> (e) We recognize the need for continued study by national experts\n> of the\n> possibilities of\n>\n> strengthening the international legal framework pertaining to IPR\n> enforcement.\n>\n> (f) We consider the establishment of an IPR Task Force focusing on\n> anti-counterfeiting\n>\n> and piracy to look together at how best to improve the working of the\n> international IPR\n>\n> protection and enforcement, and produce recommendations for action\n> including\n> improved\n>\n> peer review. The issue will also be considered in the Heiligendamm\n> Process.\n>\n>\n>\n>\n> 12\n>\n> A New Dialogue on Innovation and Intellectual Property Protection\n>\n> 39. Lively interaction between science and business, strong\n> protection and\n> enforcement\n>\n> of intellectual property rights, and the combination of market-based\n> entrepreneurship\n>\n> and science-based research are increasingly decisive factors in\n> promoting\n> economic\n>\n> growth and development around the world. We invite the major emerging\n> economies to\n>\n> a follow up process using the OECD as a platform with the aim of\n> establishing a new\n>\n> international dialogue on innovation and intellectual property\n> protection as\n> part of the\n>\n> Heiligendamm Process. Such a dialogue will provide a forum for the\n> positive\n> exchange\n>\n> on topics critical for growth of successful knowledge economies and\n> the\n> promotion of an\n>\n> innovation-friendly business environment also taking into account\n> the needs\n> of small and medium sized enterprises, including: (a) the crucial\n> role and economic\n> value of intellectual property protection and implementation as a\n> central framework condition for\n>\n> the development of a future-oriented economy based on technological\n> progress\n> and innovation; (b) effective market incentives for innovation and\n> the diffusion\n> of knowledge at the national level taking into account recent\n> developments in technology\n> markets;\n>\n> and (c) the crucial importance of efficient innovation value chains\n> that\n> promote business commercialization of patented research results and\n> exploit licensing as a\n> major driver for the international transfer of technology. The\n> dialogue could\n> furthermore ascertain measures the industrialized countries and\n> major emerging economies can take\n> to achieve fully effective implementation and protection of\n> intellectual\n> property rights within their own territory. Fully respecting the\n> mandate, function and role of the\n> competent multilateral organizations, in particular the WTO and the\n> WIPO, participants\n> in the dialogue may also discuss initiatives aimed at strengthening\n> intellectual property\n> rights protection which should then be addressed in the appropriate\n> international fora. The G8 Summit 2009 will take stock of the\n> progress made by that date.\n>\n>\n>\n> --\n>\n> _______________________________________________\n> Ip-health mailing list\n> Ip-health@lists.essential.org\n> http://lists.essential.org/mailman/listinfo/ip-health\n>\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}