{"category": "ham", "to_address": "Steve French <smfrench@austin.rr.com>", "from_address": "\"Christopher R. Hertel\" <crh@ubiqx.mn.org>", "subject": "Re: cifs vs. nfs \"chattiness\"", "body": "Steve French wrote:\n> There is an oft-repeated comment that cifs is \"chattier\" than nfs (e.g.\n> http://searchstorage.techtarget.com/expert/KnowledgebaseAnswer/0,289625,sid5_gci1113518,00.html)\n> \n> Any idea why such a perception?\n>\n> I assume it has to do with one or more of the following:\n> \n> 1) NFSv3 does not send open/close (which is a good news ... bad news\n> story for nfs users of course - there is a good reason that NFSv4\n> finally added an open call) while cifs does\n> \n> 2) Windows Explorer does lots of inefficient repeated requests (which\n> the MS cifs client dutifully send over the wire)\n\nYou are correct that this is an application-level problem, but folks who\ncasually watch the wire don't really care that it's the application rather\nthan the protocol making this mistake.\n\n> 3) CIFS Unix Extensions require three to four operations for\n> create/mkdir while NFS presumably can do it in one fewer).\n\nI would add NBT to your list.  The Name Service and the Browse Service both\nadd to the perception of chattiness, particularly with people who do not\nunderstand the purpose or workings of those services.\n\nChris -)-----\n\n> But with NFSv4 vs. the current Unix/POSIX extensions it seems NFS is at\n> least as chatty as cifs (or at least should be) - NFS sends access calls\n> (which seem chatty to me).  NFS sends a lookup for every path component\n> (not really required for cifs).   I would not be surprised if a simple\n> \"ls\" like operation in a desktop would have to generate more traffic in\n> NFSv4 than CIFS but presumably is worth diving into when the next POSIX\n> extensions patches are added to Linux and MAC cifs clients.\n\n-- \n\"Implementing CIFS - the Common Internet FileSystem\" ISBN: 013047116X\nSamba Team -- http://www.samba.org/     -)-----   Christopher R. Hertel\njCIFS Team -- http://jcifs.samba.org/   -)-----   ubiqx development, uninq.\nubiqx Team -- http://www.ubiqx.org/     -)-----   crh@ubiqx.mn.org\nOnLineBook -- http://ubiqx.org/cifs/    -)-----   crh@ubiqx.org\n\n"}