{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "MASSACRE AT VA TECH: The shooter and the victims. In an hour-long special, we continue live from Blacksburg on the CBS EVENING NEWS with Katie Couric", "body": "\n\n\nCBSNews.com\n\n\n \n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nQUOTE OF THE DAY\"Hollywood is a place where \n      they'll pay you a thousand dollars for a kiss and fifty cents for your \n      soul.\" - Marilyn Monroe \n\n\n\nDID YOU KNOW?By age sixty, most people have lost \n      half of their taste buds. \n\n\n\nTONIGHT ON THE CBS EVENING NEWSHere is \n      an early preview of what we are planning for tonight's CBS EVENING NEWS \n      from Anchor and Managing Editor, Katie Couric... Hi \n      everyone, We'll be broadcasting another hour-long special edition \n      of the CBS Evening News tonight from the campus of Virginia \n      Tech, where President Bush and the first lady today joined students, \n      faculty and the extended university community in mourning the dozens who \n      died in yesterday's horrifying massacre. Bob Orr will tell \n      you more about Cho Seung-Hui, the 23-year-old English major responsible \n      for killing 32 people before turning a gun on himself. Officials haven't \n      yet put together a full picture of Cho, saying only that \"he was a loner.\" \n      But there are some clues that might shed light on his motivation, and \n      we'll share those with you. The identities of the victims are \n      still being released, but it is already clear that Cho's bullets cut \n      across a wide swatch of the campus population. The dead range from bright \n      college freshmen to a 76-year-old internationally renowned engineering \n      professor. Cynthia Bowers will bring you portraits of those \n      murdered. Also, Sharyn Alfonsi will report on what happened \n      in the critical two hours when Cho eluded police. Thalia \n      Assuras will chronicle the grieving process on campus. And our \n      technology correspondent, Daniel Sieberg, will take a look at \n      social networking online in the wake of the tragedy. I hope \n      you'll join us tonight, and be sure to tune in at 10 p.m. ET to a special \n      edition of 48 Hours this evening called Anatomy of a \n      Rampage. Thanks, Katie For more \n      information on these stories, please click on the following links:\nVirginia Tech Remembers Click \n      Here Gun Used In Rampage Traced To Roanoke Shop Click \n      Here And here's a look at one of the stories we're working \n      on for Wednesday's broadcast: We'll continue to follow the \n      tragic Virginia Tech story - as more victims are identified and more \n      information emerges. We will have more on this developing story, Wednesday \n      night, on the CBS Evening News. If you would like \n      more information on the broadcast, please click on the following address \n      and e-mail us: evening@cbsnews.com \n\n\nTONIGHT ON DAVID \n      LETTERMANCraig Ferguson, host of CBS' The Late Late \n      Show with Craig Ferguson will join Dave tonight along with \n      \"Vote for the Worst\" website creator Dave Della Terza... Plus, musical \n      guest Avril Lavigne! \n\n\n\n \nWEDNESDAY\nMORNING ON THE EARLY SHOWHarry \n      Smith and Kelly Wallace will anchor THE EARLY \n      SHOW from Blacksburg, VA. Russ Mitchell anchors from New \n      York. Dave Price will bring us the weather. Hannah Storm and \n      Julie Chen are off. We will continue to focus on the \n      \"MASSACRE AT VIRGINIA TECH.\" We will have the latest on the \n      alleged shooter, the victims, and how the community is healing following \n      such a devastating tragedy including: THE SHOOTER: CBS News \n      Correspondent Sharyl Attkisson will take an in-depth look at the \n      alleged gunman, Cho Seung-Hui. What drove him to release fire on his \n      fellow students? GOVERNOR KAINE: Governor Tim Kaine has \n      spoken out on the horror at Virginia Tech. We will speak to him Wednesday \n      about the devastating shootings. OMAR SAMAHA: Omar's \n      sister, Reema, was killed Monday. He and his family drove to Blacksburg to \n      find solace in the community. We will speak with Omar Wednesday morning. \n      GRIEVING ONLINE: We'll take a look at how people are \n      finding solace in online communities. If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: earlyshow@cbs.com \n\n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}