{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"maillist@michaelmoore.com\" <maillist@michaelmoore.com>", "subject": "An Awesome First Night for \"Sicko\"", "body": "\nAn Awesome First Night for \"Sicko\"\n\n\nSaturday, June 30th, 2007\n\n\nFriends,\n\n\nThank you so much to the hundreds of thousands of you who went to see my movie last night and this afternoon. The studio tells me that we are on track to have the second largest opening weekend for a documentary in the history of the movies! (\"Fahrenheit 9/11\" was first.) Many theaters have been selling out.  The Bush administration's investigation of this movie is certainly not keeping people away. Thanks for all the pictures you sent me of people packing in to see \"Sicko!\"\n\n\nThe movie is making impact big and small. I thought you would enjoy this story about a family that Aetna was forcing to pay a $65,000 hospital bill that the insurance company was supposed to cover! Check it out.\n\n\nThe critics, too, have been more than kind. Can I show you what a few of them said?\n\n\n\"It's as uplifting and heart-rending a thing as you will see at the movies all year. And it speaks of Moore's enduring faith -- his angry, nettled, exasperated belief that 'despite all our differences, we sink or swim together.' \" -- Amy Biancolli, Houston Chronicle\n\n\n\"The weight of evidence Moore marshals for taking the profit motive out of medicine is overwhelming. In a summer of dumb, shameless drivel, Moore delivers a movie of robust mind and heart. You'll laugh till it hurts.\" -- Peter Travers, Rolling Stone\n\n\n\"'Sicko' is a beyond brilliant, nonpartisan expose' on American politics that should be mandatory for every student in America. Some rich person -- like maybe Angelina Jolie -- should sponsor a program where DVDs are sent to families or free screenings are held at local churches.\" -- Caroline Kepnes, E!\n\n\nFor more of this, click here.\n\n\nThere's a moment in \"Sicko\" when the former British MP, Tony Benn, says, \"If we have the money to kill people (with war), we've got the money to help people.\" That line always gets the loudest applause in the theater. It is estimated that, before Bush's War is over, we will have spent two trillion dollars on it. Let me say this: I NEVER want to hear again from ANY politician that we \"don't have the money\" to fix our schools, to take care of the poor, to provide health care for every American. Clearly, the money IS there when we want to illegally invade another country and then prolong a disastrous occupation. From now on, we have to demand that our tax dollars be there for the things we need, not the things that make us one of the most detested countries on earth. \n\n\nIf you haven't seen \"Sicko,\" go see it tonight. I want this film to have as much impact as it can. How well it does in terms of attendance this first weekend will determine how many other towns get to see it. It's all about the \"first weekend box office\" with the studios these days. If it does well in the 400 theaters it's in, they will put it in more theaters next weekend. And trust me, the White House and their friends in the pharmaceutical and health insurance industries know this, too. It's no surprise to me that an original master of \"Sicko\" was stolen and widely distributed on the internet before the film's release. I'm one of the few people in the movie business who doesn't believe in prosecuting teenagers who want to share music or films (although I make my movies to be seen on a big screen and that's how I hope people see them!). I called up Mr. Bush's FBI last week. I wanted to know if they had asked themselves the first question any cop would ask about this particularly unique theft: \n\n\n\"Who has a vested interest in destroying the first weekend of Michael Moore's new film by stealing his movie's master copy and placing it on the internet?\"\n\n\nNeedless to say, they showed little interest in investigating who's behind this. That's ok. I realize what's at stake for them and I accept that this is a battle with serious consequences. The drug and insurance companies have dumped over a half billion dollars in the pockets of Congress and the White House in the last 10 years. This movie may end up being their worst nightmare.\n\n\nBut here's the good news: There's more of us than there are of them. So, it's up to the rest of you to help me help this movie have a great opening weekend. If over a half million people come out to see it by tomorrow night, the studio will take that to mean it should be in more cities and more theaters. Let's make that happen. And I promise you, if you go, you'll see a movie unlike any other you've seen this year. Last night, the industry polled the people coming out of \"Sicko.\" 93% said they would \"strongly recommend 'Sicko'\" to their friends and family. The pollster said he'd never seen a number that high (the norm for most movies is about 45%). It was a heartening piece of news.\n\n\nThanks again and see ya tonight at the movies!\n\n\nYours,\nMichael Moore\nmmflint@aol.com\n\n\n\n\n---\nYou are currently subscribed to Mike's Message as: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe click on the link below:\n\nhttp://go.netatlantic.com/u?id=52827208F&l=michaelmoore\n\n\n"}