{"category": "spam", "to_address": "\"Torsten\" <gnitpick@speedy.uwaterloo.ca>", "from_address": "\"Olga\" <mattwojtowicz@hrsconsulting.com>", "subject": "Re[1]:  maybe your lady", "body": "Hello, Torsten\n\nSpeaking about attention do you know that some women think that the more man loves the more gifts he make? Well, of\ncourse everything depends on how big his salary is, but anyway \"real love\" is not a twig of lilac, but a million of\nroses. Let's think about this a diamond of the first water doesn't mean a love of the first water. Any girl feels by\nintuition if the gift was done right from the heart. Or this is just a formality on the occasion of some holiday?\nLease for the lack of attention? Let her get her \"toy\" and leave you alone? Kickshaw, but the one you mentioned once\nand he kept it in mind - this is what dearly! A surprise, even if it's not\ndue to some huge financial expanses, is priceless!\nA person who really loves will never waste words here and there, showing his real love exactly this way. It's only in\nthe movies, when a husband calls his wife from work and ends the phone\nconversation with \"I love you\". Modern men keep silence about this but this absolutely doesn't mean that they don't\nlove us. \nBut the main is time your man spends with you, to the prejudice of his rest\nfrom work, his friends, family. If my man will spend hours and days on me, and not minutes (on the phone, in letters\n- doesn't matter) - I think here it is possible to speak about love.\nSo, what do you think, do you want to write me back or you guess I am too difficult for you? Am I demanding? I think\nI am, but I know the borders of my demands and I think I don't ask for\nunreal things I just want to be the one, the only one and forever, finally this is what waits for all of us and there\nis nothing bad in knowing what you want to see in your partner and in wishing him to be the best in the world.\nAnd... I am here  http://foundthelove.com/caress\n\n\nYourth faithfully\n\nOlga\n\n\n"}