{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 133", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Austria. Stradivari wieder daWiener Polizei verhaftet mehrere\n      Georgier. (Museum Security Network Mailing list)\n   2. Italy. Nel 2006 ritrovati 2392 quadri rubati\n      (Museum Security Network Mailing list)\n   3. Bolivia. Roban seis lienzos coloniales de la Bas?lica Menor\n      \"Santa B?rbara\" de Caquingora. (Museum Security Network Mailing list)\n   4. Canada. Bedard's boyfriend says appeal likely after being\n      found guilty of art theft. (Museum Security Network Mailing list)\n   5. insurance company has offered a ?70,000 reward for\n      information on the armed gang that broke into a house in Cheadle\n      Hulme and escaped with five paintings by renowned artist LS\n      Lowry. (Museum Security Network Mailing list)\n   6. A man has been cleared of stealing several paintings worth\n      millions of liri, including one by Caravaggio,\tafter a magistrate\n      ruled that the police had not managed to establish\ta link between\n      the accused and the stolen works of art.\n      (Museum Security Network Mailing list)\n   7. The former president of the Independence Seaport Museum\n      pleaded guilty in federal court yesterday to fraud and tax\n      evasion. (Museum Security Network Mailing list)\n   8. Banksy sculpture is snatched from the garden of 'kidnapper'\n      (Museum Security Network Mailing list)\n   9. UK. Park's sculpture hauled away by thieves\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Wed, 6 Jun 2007 07:18:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Austria. Stradivari wieder daWiener Polizei verhaftet\n\tmehrere\tGeorgier.\nTo: \nMessage-ID: <01f901c7a7fa$25579d70$7006d850$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nStradivari wieder daWiener Polizei verhaftet mehrere Georgier \n\nDer Kunstkrimi um die Stradivari-Geige steht vor der Kl?rung! Nur neun Tage\nnach dem spektakul?ren Einbruch beim weltbekannten Solisten Christian\nAltenburger fanden Ermittler das gestohlene 2,5-Millionen-Euro-Instrument in\neiner Wiener Wohnung. Mehrere Georgier sind in Haft, Ermittlungen zu\nHinterm?nnern laufen. mehr zum Thema: Infopics - klick dich durch die Bilder\ndes Tages! Teste dein Wissen beim WochenquizAls der Spitzenmusiker nach dem\nPfingstwochenende in seine Wohnung in Wien-Mariahilf kam, erlebte er ?\nKrone.at berichtete - einen Riesenschock. Einbrecher hatten seinen Tresor\nhinter dem Wandteppich aufgeschnitten und waren mit einer der teuersten\nGeigen der Welt entkommen: einer Stradivari aus dem Jahr 1680 im Wert von\n2,5 Millionen Euro. Au?erdem fehlten Gewand und ein Koffer. Doch genau der\nwurde den T?ter zum Verh?ngnis. Denn das bei der Post aufgegebene, Paket mit\ndem Samsonite-Koffer des Musikers fischten die Polizisten heraus... \n\nPolizei st?rmte Wiener Wohnung\nErmittlungen zeigten, dass das Paket nach Georgien gehen sollte. Und: Der\nAbsender f?hrte zu einer Wiener Wohnung. Kriminalisten legten sich dort auf\ndie Lauer und st?rmten Dienstagnachmittag gegen 16 Uhr die Unterkunft. Dann\ndie Jubelmeldung: die Millionen-Stradivari ist da! F?r sechs Verd?chtige\nklickten die Handschellen. Weitere Details rund um den Kunstdiebstahl -\nZufallstreffer oder Auftragsarbeit - werden untersucht.\n\nStradivaris - es gibt nur mehr 600 St?ck\nStradivaris geh?ren zu den teuersten Musikinstrumenten der Welt. Antonio\nGiacomo Stradivari (1644-1737) gilt als der ber?hmteste Geigenbauer aller\nZeiten. Er fertigte im Laufe seines Lebens mehr als 1.000 Saiteninstrumente,\nau?er Violinen auch Bratschen, Cellos, wenige Gitarren und eine Harfe. Heute\nsind nach Sch?tzungen noch etwa 600 Instrumente erhalten.\n\nVon Christoph Budin, Christoph Matzl und Krone.at\n\nhttp://www.krone.at/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 2\nDate: Wed, 6 Jun 2007 07:18:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Italy. Nel 2006 ritrovati 2392 quadri rubati\nTo: \nMessage-ID: <01f801c7a7fa$253d1090$6fb731b0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nDiffusi i dati dell'Arma sulla tutela del patrimonio culturale\nIn un anno sottratti al mercato illegale pi? di 20mila falsi\nNel 2006 ritrovati 2392 quadri rubati\nArrestati dai carabinieri 46 \"ladri d'arte\"\nL'ultima operazione ieri: una tela di Tiepolo trovata al mercatino\n\n ROMA - I ladri d'arte nel 2006 hanno avuto vita dura: i carabinieri hanno\narrestato 46 persone coinvolte nel traffico di opere rubate, mentre 645 sono\nstate denunciate a piede libero. Molti i ritrovamenti, l'ultimo dei quali\nieri a Portogruaro (Venezia): pi? di novanta pezzi, tra cui una tela di\nGiandomenico Tiepolo da un milione di euro che ? stato scoperta in vendita a\npoche migliaia di euro in un mercatino. \n\nIn totale nel 2006 i carabinieri hanno recuperato 2392 dipinti, 301 sculture\ne ben 142.234 reperti archeologici. Sono stati sottratti alle organizzazioni\ncriminali anche 20.610 falsi, 200 opere di grafica, 6.202 pezzi di materiale\nbibliografico, 222 oggetti sacri e 173 di ebanisteria. (Le immagini di\nalcuni dei quadri recuperati). \n\nTra i dati resi noti durante i festeggiamenti per il 193? anniversario\ndell'Arma, anche quelli riguardanti il numero dei controlli effettuati (pi?\ndi 31mila) e delle contravvenzioni (233 in totale). \n\n(5 giugno 2007)  Torna su\n\nhttp://www.repubblica.it/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 3\nDate: Wed, 6 Jun 2007 07:18:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Bolivia. Roban seis lienzos coloniales de la Bas?lica\n\tMenor \"Santa B?rbara\" de Caquingora.\nTo: \nMessage-ID: <01fa01c7a7fa$28bc4c40$7a34e4c0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nRoban seis lienzos coloniales de la Bas?lica Menor ?Santa B?rbara? de\nCaquingora\n\nAPG Noticias\nJunio 5, 2007, 0:32 EDT\n\nLa Paz, Bolivia -- \nDos t?cnicos dependientes de la Unidad Nacional de Catalogaci?n del\nViceministerio de Desarrollo de Culturas evidenciaron la substracci?n de\nseis lienzos coloniales de la Bas?lica Menor ?Santa B?rbara? de la localidad\nde Caquingora, distante a 115 kil?metros de ciudad de la ciudad de La Paz.\nEl hecho se produjo la madrugada del 1 de junio.\n\nSeg?n las primeras investigaciones, los ladrones entraron en el citado\ntemplo cat?lico rompiendo el candado de la puerta principal durante la\nmadrugada de este ?ltimo viernes.\n\nSabino Carpio, sacrist?n de la Bas?lica Menor ?Santa B?rbara?, explic? que\naproximadamente a las seis de la ma?ana del 1 de junio, evidenci? que la\npuerta de mencionada iglesia se encontraba entreabierta y con el candado\nroto. Cuando ingres? al templo se percat? que faltaban los seis lienzos y\nposteriormente alerto a los pobladores sobre el hecho.\n \nUn d?a antes del hecho delictivo, los habitantes de Canquingora se\npercataron de que una movilidad  desconocida, (posiblemente una vagoneta\nguinda), con dos ocupantes merode? por aquella poblaci?n dando vueltas por\nla plaza principal. Los ocupantes de la camioneta se?alaron ser funcionarios\nde la empresa Trans Redes.\n\nDespu?s del hecho delictuoso los vecinos y autoridades de la poblaci?n de\nCaquingora se organizaron y empezaron a buscar pistas. Aparentemente, los\nladrones se quedaron  cerca de la poblaci?n a pernoctar y una vez cometido\nel delito se dirigieron a una casa abandonada, la cual se encuentra a dos\nkil?metros de Caquingora.\n \nDe acuerdo con la versi?n de los t?cnicos del Viceministerio de Desarrollo\nde Culturas, Lourdes Vallejos, Marianela Tarifa y vecinos de Caquingora, en\ndicha casa se encontr? los bastidores de los seis lienzos hurtados, incluso\nuno de los bastidores se encontraba roto porque en el intento de desprender\nlos ?leos con fuerza se da?? la obra y se hall? tambi?n los bordes de los\nlienzos. \n\nLos seis lienzos robados no tienen autor?a y son los siguientes: ?San\nGregorio Magno? t?cnica ?leo sobre lienzo con 159 cent?metros de alto y 106\ncent?metros de ancho; ?San Vicente Ferrel?, con165 por 95 cent?metros; ?San\nJos? con el Ni?o Jes?s? de 164 por 90 cent?metros; ?San Jos? con el Ni?o\nJes?s?, 167 por 112 cent?metros; ?San Miguel Arc?ngel? de 165 por 90\ncent?metros; y ?Mar?a Inmaculada? de 161 por 200 cent?metros.  \n \nA fines del a?o pasado, en un esfuerzo conjunto entre autoridades,\npobladores y residentes  de Caquingora, la Unidad Nacional de Catalogaci?n\ndel Viceministerio de Desarrollo de Culturas hizo el registro de los bienes\npatrimoniales y culturales que posee la Bas?lica Menor ?Santa B?rbara? de\nCaquingora.\n \nLa obras robadas se encuentran registradas y catalogadas en la mencionada\nunidad y seg?n normas vigentes son parte del Patrimonio Cultural Boliviano,\npor lo cual no pueden ser exportadas ni comercializadas de acuerdo con el\nArt?culo 191 de la Constituci?n Pol?tica del Estado y del Decreto Supremo\n5918 en sus art?culos 3 y 22 del 6 de noviembre de 1961.\n \nEn ese entendido, el Viceministerio de Desarrollo de Cultura advierte a los\ncoleccionistas, restauradores, anticuarios y comerciantes de obras de arte\nque tengan cuidado en adquirir esas obras debido a que las autoridades\npoliciales nacionales e internacionales fueron notificadas y proceder?n de\nacuerdo a lo que se?ala la ley. \n \nLa poblaci?n de Caquingora distante un centenar de kil?metros de la Sede de\nGobierno, est? situado  en la primera secci?n del municipio de Coro Coro,\nprovincia Pacajes del departamento de La Paz. Para llegar a este punto se\ndebe tomar la ruta de la poblaci?n de Viacha.\n\n\n\n----------------------------------------------------------------------------\n----\nEncuentre este art?culo en el siguiente nexo:\nhttp://www.redbolivia.com/noticias/Sociedad%20y%20Cultura/53365.html?SID=dec\nce610eff3dfcc216a5bc877eb3c77\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Wed, 6 Jun 2007 07:18:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Canada. Bedard's boyfriend says appeal likely after\n\tbeing\tfound guilty of art theft.\nTo: \nMessage-ID: <01fb01c7a7fa$294181d0$7bc48570$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nBedard's boyfriend says appeal likely after being found guilty of art theft \n\nTue, 2007-06-05 20:06 \nNational News \nBy: SIDHARTHA BANERJEE\n\nMONTREAL (CP) - A jury found the boyfriend of Olympic champion Myriam Bedard\nguilty of art theft on Tuesday but Nima Mazhari says he will appeal.\n\nMazhari was convicted Tuesday of stealing 20 paintings from the late Ghitta\nCaiserman-Roth between 2001 and 2003. He was also found guilty of possession\nof stolen goods worth $100,000. A jury of 10 women and two men deliberated\nfor two days before returning the verdict.\n\nThe normally talkative Mazhari offered brief answers after being surrounded\nby reporters while he waited for a city bus outside the Montreal courthouse.\n\nMazhari called the verdict \"ridiculous\" and said he fully expected to be\nacquitted of all charges.\n\nThe crimes came to light when Caiserman-Roth's daughter received a letter\nfrom Bedard's estranged father in 2004 accusing him of the theft.\n\nMazhari called the allegations ridiculous and said his problems started\nafter Bedard testified at the inquiry into the sponsorship scandal. He\ndenied stealing the paintings.\n\nThe three-week trial was tinged with elements of a family feud as Bedard\nfamily members and friends of the Olympian testified about their dislike of\nMazhari and his influence over Bedard. Mazhari said the same about the\nBedard family, calling them unreliable and his association with them a big\nmistake.\n\nBedard's father, Pierre, told the jury that he would have never sent the\nletter if he'd been able to rekindle a relationship with his daughter, who\nhad ignored his phone calls for about a year.\n\nPierre Bedard told French news network LCN in an interview that he is happy\nthe entire ordeal is over, but doesn't expect the rocky relationship with\nhis daughter will change.\n\nCrown prosecutor Mario Dufresne said he was pleased with the verdict.\nMazhari's lawyer, Yves Gratton declined to comment.\n\nMazhari said he was surprised by the verdict but that he felt good, \"as\nalways.\" He would not say whether he has the financial means to pay a fine.\nMazhari was represented by a legal aid lawyer.\n\nBedard, who has been by Mazhari's side all through the court proceedings,\nwas not with him on Tuesday. She has her own legal issues to deal with and\nis due in a Quebec City court this month to set a date for her own trial on\nchild abduction charges.\n\nBedard and Mazhari dominated news coverage at the end of last year after a\nCanada-wide warrant was issued for her arrest on charges of abducting her\n11-year-old daughter and taking her to Washington D.C., in violation of a\ncustody agreement with the girl's father.\n\nBedard won two gold medals in the biathlon at the 1994 Olympics.\n\nCaiserman-Roth died in 2005.\n\nhttp://www.cjad.com/node/538144\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 5\nDate: Wed, 6 Jun 2007 07:18:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] insurance company has offered a ?70,000 reward for\n\tinformation on the armed gang that broke into a house in Cheadle Hulme\n\tand escaped with five paintings by renowned artist LS Lowry.\nTo: \nMessage-ID: <01fc01c7a7fa$2970cf30$7c526d90$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\n?70k reward for stolen Lowry paintings \nTuesday, 05 Jun 2007 18:19 \nPolice are urging witnesses to come \n\n\nAn insurance company has offered a ?70,000 reward for information on the\narmed gang that broke into a house in Cheadle Hulme and escaped with five\npaintings by renowned artist LS Lowry.\n\nAXA has put up the reward for the first person who provides information\nleading to the arrest of the offenders and recovery of the paintings, which\ninclude The Viaduct, valued at ?600,000, and Tanker entering the Tyne,\nvalued at ?700,000.\n\nThe paintings were stolen from the home of Ivan Aird, a 41-year-old fine\narts dealer, in the early hours of May 3rd. \n\nGreater Manchester police Detective Superintendent Tony Cook said: \"This\nincident came as a great shock to the Cheadle Hulme community.\n\n\"The stolen paintings are extremely valuable but also hold a great deal of\nsentimental value for Mr Aird, as Mr Lowry was a close family friend. The\npaintings are also north-west treasures and are a major part of the heritage\nof the region.\"\n\nPolice have urged anyone with any information about the thieves or the\nwhereabouts of the paintings to contact the GMP major incident room or\nCrimestoppers.\n\n\"Any information, no matter how insignificant it may seem, could be the key\nto tracing these people,\" DS Cook added.\n\nhttp://www.inthenews.co.uk/ \n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Wed, 6 Jun 2007 07:18:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] A man has been cleared of stealing several paintings\n\tworth\tmillions of liri, including one by Caravaggio,\tafter a\n\tmagistrate ruled that the police had not managed to establish\ta link\n\tbetween the accused and the stolen works of art.\nTo: \nMessage-ID: <01fe01c7a7fa$29d165c0$7d743140$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nMan cleared of stealing valuable paintings  \nby Matthew Xuereb\n\n \n A man has been cleared of stealing several paintings worth millions of\nliri, including one by Caravaggio, after a magistrate ruled that the police\nhad not managed to establish a link between the accused and the stolen works\nof art. \n\nIan Farrugia, from Birkirkara, was charged with stealing the paintings from\nthe house of Mr Justice Giovanni Bonello in Old Bakery Street, Valletta, in\nApril 2004. The paintings were discovered by the police behind a false wall\nin a garage in Birkirkara and one was found inside a house close to the\ngarage. \n\nThe stolen paintings formed part of a larger collection of paintings that\nwere going to be sold abroad. The thief or thieves managed to dig a hole\nthrough a wine cellar and \n\nthe theft remained unnoticed for several weeks. \n\nHanding down his judgement, magistrate Anthony Vella ruled that the\nprosecution had failed to establish a link between the forensic evidence in\nits possession and the accused. He said that the only fingerprint that\nmatched that of the accused was found on a plastic bag used to cover the\npaintings, and added that anyone could have placed the bag there. \n\nMagistrate Vella said the prosecution's evidence left doubts which,\naccording to the law, had to favour the accused. He said the court could not\nsend someone to jail on the basis of probability or simply because of a\nsuspicion. \n\nAs a result, he acquitted Mr Farrugia of all the charges brought against\nhim. \n\nPolice Inspector Michael Mallia prosecuted while Dr Edward Gatt appeared for\nMr Farrugia. \n\nhttp://www.independent.com.mt/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 7\nDate: Wed, 6 Jun 2007 07:18:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The former president of the Independence Seaport Museum\n\tpleaded guilty in federal court yesterday to fraud and tax evasion.\nTo: \nMessage-ID: <01ff01c7a7fa$29ff0570$7dfd1050$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nEx-museum chief: I'm guilty\nBy MICHAEL HINKELMAN\nhinkelm@phillynews.com 215-854-2656\n\nALEJANDRO A. ALVAREZ/Daily News\nJohn S. Carter (right), former head of the Independence Seaport Musuem,\nleaves federal court with his attorney, Mark Cedrone.\nRELATED STORIES:\nhttp://www.philly.com/dailynews/local/20070605_Ex-museum_chief__Im_guilty.ht\nml  \n\n'Didn't touch' ticket writer, Susanna Foo insists\n\nThe former president of the Independence Seaport Museum pleaded guilty in\nfederal court yesterday to fraud and tax evasion.\nJohn S. Carter, 57, who headed the maritime museum at Penn's Landing for 17\nyears until he was canned in March 2006, admitted he had stolen from the\nmuseum to finance a flashy lifestyle.\n\nU.S. District Judge R. Barclay Surrick set sentencing for Sept. 4.\n\nProsecutors said Carter faces a prison sentence of at least five years, but\na key issue at sentencing will be the actual loss to the museum.\n\nThe feds contend that Carter stole $1.5 million and didn't pay income taxes\non it.\n\nDefense attorney Mark Cedrone said Carter \"was not prepared to admit to\nevery fact\" the government alleged in arriving at its $1.5 million figure.\n\nCarter could also be fined as much as $600,000. Much of what Carter bought\nwith museum money has been recovered by the feds and will be auctioned,\nprosecutors said, but they want Carter to make full restitution to the\nmuseum.\n\nCarter, who declined to speak with reporters, was released on $100,000\npersonal-recognizance bond.\n\nHe was paid $275,000 to $356,000 per year from 2001 to 2005 and lived\nrent-free in a Society Hill townhouse from 1998 to 2006.\n\nBut apparently that wasn't enough to support the high-flying lifestyle\nCarter craved.\n\nThe feds said Carter splurged on stereo equipment, fancy clothes and\noverseas trips and a $210,000 carriage house he had built next to his Cape\nCod home.\n\nHe then submitted bogus invoices to get the museum to pay for it all.\n\nCarter also used three museum boats for his personal benefit and even had\none of them refurbished at museum expense for more than $400,000. The feds\nsaid he sold it for $190,000 and pocketed the cash.\n\nCarter's name surfaced in the federal probe of state Sen. Vince Fumo, who\nwas indicted on fraud, conspiracy, obstruction and tax charges in February.\nFumo has pleaded not guilty to the charges.\n\nFumo, a former museum board member, allegedly bilked the museum out of\n$100,000 for free use of museum yachts during summer vacations to Martha's\nVineyard from 1996 to 2003.\n\nThe feds alleged in the Fumo indictment that Carter visited in August 1998\nand provided goodies for Fumo's party that Carter charged to the museum.\n\nThe tab included crew tips, dockage fees, meals, booze and newspapers.\n\nCarter was not charged in the Fumo case and is not expected to be a witness\nin Fumo's trial next year. *\n\n   \nFind this article at: \nhttp://www.philly.com/dailynews/local/20070605_Ex-museum_chief__Im_guilty.ht\nml  \n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n\n------------------------------\n\nMessage: 8\nDate: Wed, 6 Jun 2007 07:18:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Banksy sculpture is snatched from the garden of\n\t'kidnapper'\nTo: \nMessage-ID: <020001c7a7fa$2a3111f0$7e9335d0$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nBanksy sculpture is snatched from the garden of 'kidnapper'\nLast updated at 15:15pm on 5th June 2007\n \n\nWhen one of Banksy's art works was \"kidnapped\" from the streets of London,\nit seemed as if the graffiti artist had met his match. \n\nPhoto:\nhttp://www.dailymail.co.uk/pages/live/articles/news/news.html?in_article_id=\n460066&in_page_id=1770\n\nSwept under the carpet ... Red faces as another Banksy mural bites the dust \n\nSpirited away: The Drinker has disappeared again\nThe piece was The Drinker - a recreation of Rodin's statue The Thinker, with\na traffic cone on its head - and an \"arto-politico terrorist\" calling\nhimself AK47 demanded a ?5,000 ransom. \n\nBanksy offered ?2 and the deal was refused. Three years on, and thieves have\ngot into AK47's garden in Hackney and taken the statue, leaving the plinth\nand cone. \n\nAK47 today accused Banksy, or \"his people\", of being behind the theft. \"The\nstatue was there on Friday when I left for Holland,\" he said. \n\n\"If Banksy has got it back, I will treat it as a joke. But if it's someone\ntaking it for its financial value I'd be annoyed.\" \n\nThe bronze, said by AK47 to be worth about ?300,000, first appeared in 2004.\nIt was put on a concrete plinth with Banksy planning to move it from venue\nto venue. \n\nThen in April that year it disappeared from Shaftesbury Avenue. When Banksy\nrefused to pay a ransom the piece languished in a warehouse until AK47\ndecided that cost too much. \n\nAK47 claimed the piece was legally his, as it had essentially been dumped on\nthe streets of London without permission. \"I've reported the theft to the\npolice,\" he said. \n\nHe claimed that he had been in talks with auctioneers Bonhams over the sale\nof the statue, and Banksy had shown interest in buying it back. \n\nA spokeswoman for Banksy said: \"It is nothing to do with him and he does not\nwant to comment.\" \n\nMeanwhile, a mural by Banksy is to be preserved when the Bristol office\nblock it has adorned for five years is knocked down. \n\n\nThe Bristol Banksy wall which will be preserved\n\nMild Mild West, which shows a giant teddy bear hurling a petrol bomb at\npolice, will be put in a glass atrium for new offices. \n\nIt will be welcome good news for Banksy who had 9 of his limited edition\nprints stolen from a Brighton gallery last month. \n\nIn two raids at Artrepublic in Bond Street, Brighton, a total of 10 items\nvalued at about ?10,000 - nine of them by Banksy - were stolen. \n\nSussex Police said it appeared the gallery had been \"purposely targeted for\nthe Banksy works\".\n\nhttp://www.dailymail.co.uk/\n\n____________________________________\nMuseum Security Network\nMuseum Security Consultancy\nTon Cremers\nPostbus 3213\n3003 AE Rotterdam\n+31 10 2233897\n+31 6 242 246 20\ntoncremers@museum-security.org\n_______________________________________\n\n\n\n\n------------------------------\n\nMessage: 9\nDate: Wed, 6 Jun 2007 07:18:41 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] UK. Park's sculpture hauled away by thieves\nTo: \nMessage-ID: <01fd01c7a7fa$299bfde0$7cd3f9a0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nPark's sculpture hauled away by thieves\n\n\nDan Cordell's work depicted a squirrel, owl and snail.\n\nLarge 50kg work is stolen from Harrold-Odell Country Park.\n\nPhot: http://www.bedfordtoday.co.uk/bed-news?articleid=2929978\n\n\nDetermined thieves sneaked into a Bedfordshire beautyspot to steal a heavy\nwooden statue at the weekend.\n\nThey struck at Harrold-Odell Country Park on Friday night or Saturday\nmorning and broke the distinctive work - which depicts a squirrel, an owl\nand a snail - from its concrete base.\n\nThey then manhandled the 50kg piece nearly half-a-mile before apparently\nloading it into a vehicle and escaping.\n\nLyndsey Bignell, countryside sites officer for the county council, said the\nloss of the chainsaw-carved sculpture had come as a blow.\n\nShe said: \"It's not worth a tremendous amount of money, but we have been\ntrying to add different features for people as they are walking. It's a\nshame that this statue is not going to be here for people to enjoy any more.\n\n\"I think someone has seen it and decided it would look good in their garden.\nSomeone has just taken a fancy to it.\"\n\nThe statue was created by wood-carver Dan Cordell, who used only a chainsaw\nto hew it from cherry wood at an event at the Forest of Marston Vale last\nSeptember.\n\nHis appearance had been sponsored by the county council, and afterwards it\nreceived the three-feet high piece which had taken him a day to complete.\n\nIt was stored in a garage for a while and brought out for special events\nbefore it was given a permanent home at the park on the path around the\nnorthern edge of the lake.\n\nBut at some point between 6pm on Friday and 9am on Saturday, thieves smashed\nit from its foundations and moved it away from the site. They appear to have\nused muscle power for part of the job, as vehicles cannot be brought to\nwithin about half-a-mile of the statue's former position.\n\nMr Cordell expressed surprise at his work's disappearance.\n\nHe said: \"It's a strange thing to do - it's not something you could sell on,\nand it's not valuable.\n\n\"It's only the second piece I have had stolen, so it doesn't happen very\noften.\"\n\nAnyone with any information is asked to contact Sergeant Gary Baldwin at\nRiseley Police Station on 01234 275175, or the country park on 01234 720016.\nAlternatively, email the country park on hocp@bedscc.gov.uk\nLast Updated: 05 June 2007\n \nhttp://www.bedfordtoday.co.uk/\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 133\n****************************************\n\n"}