{"category": "ham", "to_address": "\"Dimitri Szerman\" <dimitrijoe@gmail.com>,\n   \"R-Help\" <r-help@stat.math.ethz.ch>", "from_address": "\"Greg Snow\" <Greg.Snow@intermountainmail.org>", "subject": "Re: [R] lm() intercept at the end, rather than at the beginning", "body": "Gabor has already showed you one way to make your own summary function\nthat does this. I want to address a different aspect of your question.\n\nYour question implies that less interesting things belong at the bottom\nof the summary output.  On the other hand, when I was teaching full time\nI tried to convince my students that the summary output for lm models\n(and others) should be read from the bottom up (and to some degree from\nright to left).  After all, you really should not be looking at the\np-values for the individual coefficients until after you look at the\noverall F-test p-value (at the very bottom), and you should not try to\ninterpret the coefficient values until you have looked at their standard\nerrors (and possibly p-values).  Anything that I want to know about the\nresiduals I learn from the diagnostic plots, not the 5 number summary\nthat is at the top of the output (I am not arguing for that to go away,\nothers may find it more useful than I do, and I do occasionally look at\nit, but it seems least important of the output).  If your model includes\ninteractions and/or polynomial terms, then these should be looked at\nbefore the main effects and linear terms (and the genererally are below\ntheir corresponding main effects/linear terms).  And looking at the\nsequential test from the anova function when given only 1 model really\nonly makes sense reading from the bottom up.\n\nSo, if you think in those terms (and I like it staying that way, with a\nscrolling computer screen, reading from the bottom up is quicker and\neasier), then having the uninteresting intercept at the top of the list\nof the coefficients is the best place for it.\n\nJust a couple of thougts, \n\n-- \nGregory (Greg) L. Snow Ph.D.\nStatistical Data Center\nIntermountain Healthcare\ngreg.snow@intermountainmail.org\n(801) 408-8111\n \n \n\n> -----Original Message-----\n> From: r-help-bounces@stat.math.ethz.ch \n> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Dimitri Szerman\n> Sent: Thursday, April 05, 2007 6:34 PM\n> To: R-Help\n> Subject: [R] lm() intercept at the end, rather than at the beginning\n> \n> Hi,\n> \n> I wonder if someone has already figured out a way of making\n> \n> summary(mylm)   # where mylm is an object of the class lm()\n> \n> to print the \"(Intercept)\" at  the last line, rather than the \n> first line of the output. I don't know about, say, \n> biostatistics, but in economics the intercept is usually the \n> least interesting of the parameters of a regression model. \n> That's why, say, Stata prints by default the intercept at the \n> end. Just a suggestion for R-developers...\n> \n> Thanks,\n> Dimitri\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide \n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}