{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "The War over the War....Congress defies the President; the President vows, \"VETO.\" ", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early\n    Show | CBS\n    Evening News | 48 Hours\n    | 60 Minutes\n    | The\n    Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nQUOTE\n  OF THE DAY\n\n\"In heaven all the\n  interesting people are missing.\" \n  - Friedrich Nietzsche \n\n\n\n\nDID YOU KNOW?\n\n  The rosy periwinkle plant, found in Madagascar, is used to cure\n  leukemia. \n\n\n\n\nTONIGHT ON THE CBS EVENING NEWS\n\nHere is an early preview\n  of what Awe are planning for tonight’s CBS EVENING NEWS from Anchor and\n  Managing Editor, Katie Couric… \n\n  Hi everyone, \n\n  The U.S. Congress and President Bush are facing off in a historic showdown.\n  Earlier today the Senate followed the House’s lead and passed\n  legislation that would begin the withdrawal of U.S.\n  troops from Iraq\n  this fall – but the president has promised to veto it. Sharyl Attkisson will report from Washington, D.C., on\n  the battle over Iraq.\n  \n\n  We’ll also show you some of the results of a new CBS News/New York Times poll, which includes\n  Americans’ opinions about the troop withdrawal bill as well as the\n  environment. For complete poll results this evening, go to CBSNews.com Click Here.\n  \n\n  Tonight is an important milestone in the race for 2008 – the first\n  debate of the Democratic presidential candidates. Our new Senior Political\n  Correspondent Jeff Greenfield\n  will report that this South Carolina\n  event will be a major test for the eight contenders, each of whom will only\n  have a short time to make a lasting impression. \n\nChina\n  is still denying that the chemical melamine contaminated pet food and led to\n  the deaths of dozens of pets. But Chinese officials have offered to cooperate\n  with broader inspections of these products. Nancy\n  Cordes will tell you what other foodstuffs enter the United States from China, and Barry Peterson will report on how those\n  products are inspected. What they’ve found might surprise you. \n\n  Finally, we’ll have the story of a gospel choir found in an unexpected\n  place. Steve Hartman will share\n  their songs in this special Thursday edition of Assignment America. \n\nI hope you’ll join us\n  tonight for these stories and an early look at Scott Pelley’s exclusive 60 Minutes interview with former CIA\n  director George Tenet. \n\n  Thanks, \n\nKatie \n\nFor more information on these stories,\n  please click on the following links: \n\nSenate Passes Iraq Withdrawal Bill\n\nClick\n  Here \n\nTenet: \"Slam Dunk\" Comment\n  Misused \nClick\n  Here \n\nAnd here’s a look at one of the\n  stories we’re working on for Friday’s broadcast: \n\n  Tomorrow, we broadcast from Chicago - a town legendary for hard-knuckle power\n  brokers, big personalities and broad shoulders. We'll give you a tour. All\n  that and much more, Friday, on the CBS Evening News. \n\n  If you would like more information on any of these stories or the broadcast,\n  please click on the following address and e-mail us: \nevening@cbsnews.com\n  \n\n\n\n\nTONIGHT ON DAVID\n  LETTERMAN\n\n  Join Dave tonight on The\n  Late Show with actor Steve Martin AND Dave Cota and A.J. the\n  parakeet... Don't miss a Top Ten List presented by New York Yankees star\n  Derek Jeter. Plus, musical guests Steve Martin, Tony Trischka and Bela Fleck!\n  \n\n\n\n\nFRIDAY MORNING ON THE EARLY SHOW\n\nHarry Smith,\n  Hannah Storm, Julie Chen and Tracy Smith anchor THE EARLY SHOW from New York. Dave Price will bring us the weather. Russ Mitchell is off. \n\nAlong with the top news of the day, we will\n  also have the following stories: \n\nCSI BEHIND THE SCENES: Thursday\n  night's episode of CSI features\n  a very unusual murder... in a rather a-typical setting. Our own Julie Chen recently visited the set to\n  ask the CSI cast about both.\n  She went behind the scenes to get a taste of the action first hand. And she\n  learned that the cast is not the only group with challenging roles. It was a\n  challenge for the creative wizards at CSI\n  to make a believable model of character Lorenzo \"Happy\" Morales, a\n  boxer who takes an arrow through the neck and gets shot with a hypodermic\n  filled with snake venom. We'll go behind the scenes Friday morning. \n\nHIGH SCHOOL FOOTBALL IN HARLEM: A JON\n  FRANKEL DOCUMENTARY: High school football has long been a part of Americana: the\n  rivalries, families gathering under the lights, cheerleaders flipping on the\n  field. But it hasn't always been an easy road, especially for some frustrated\n  guys from Harlem, New York. Jon Frankel is the director of a\n  new documentary, Hellfighters A Season in\n  Harlem, which follows a unique and inspiring team. The documentary\n  premieres Friday night at the Tribeca Film Festival in New York City. Friday morning, Jon Frankel\n  will join us with a sneak peek at his inspirational film. \n\nSURVIVOR CASTOFF: The\n  competition heats up on Survivor!\n  Stranded in Fiji,\n  the competition grows fierce for the remaining Survivors competing against\n  one another for the million-dollar prize. In one of the most shocking Tribal\n  Councils ever, alliances crumble and a hidden Immunity idol is brought into\n  play. Was it a successful gambit, or was it all for naught? And who will be\n  voted off the island? Friday morning, the latest castoff will join us. \n\nWEDDING IN A WEEK: WEDDING RECAP:\n  This week has been tons of fun! Before our lucky couple ties the knot, let's\n  take a quick look at how this Wedding in a\n  Week came together. Master event planner Colin Cowie will recap our Wedding in a Week -- elaborating on all\n  the elements that went into creating this ultimate wedding for couple Lisa\n  Mayo and Stephen Wilfong. \n\nWEDDING IN A WEEK: THE CEREMONY:\n  Finally the moment we've been waiting for. It's time for our Wedding in a Week couple to walk down\n  the aisle, and they'll be doing so to the music of Chrisette Michelle --\n  singing her new song Golden.\n  The celebration continues as Lisa and Stephen exchange their vows on our\n  plaza! \n\n  If you would like more information on any of these stories or the broadcast,\n  please click on the following address and e-mail us: \nearlyshow@cbs.com\n  \n\n\n\n \nSATURDAY ON 48 HOURS\n \nHere's a note from Bill Lagattuta on Saturday's 48 Hours Mystery, Murder in the Fast Lane: \n\n  \"The story of Mickey Thompson is the story of a genuine American\n  hero--the man who at one time was the fastest man on earth. He was a\n  down-to-earth racing icon, a tough businessman, an innovator and he was\n  married to the love of his life, Trudy. It all came to a horrible end almost\n  twenty years ago when Mickey and Trudy were gunned down, execution style, in\n  the driveway of their Los Angeles\n  area home. I remember covering this story as a young news reporter, and it's\n  fitting for me to be present at the final chapter. \n\n  From the beginning, the focus of the investigation was Mickey Thompson's\n  colorful business partner, Mike Goodwin. But there was no physical evidence\n  to tie him to the crimes. For the past two decades, through a series of\n  fascinating twists and turns, detectives and Thompson's hard-driving sister\n  Colleen have been pursuing Goodwin, hoping his flamboyant personality and his\n  big mouth would be his undoing. In our program this week, we will take you\n  step by step through this fascinating case... and you'll be able to watch\n  what many considered the surprise ending in court. Murder in the Fast Lane was an amazing story for me to\n  live, and to report. I hope you will join us on Saturday night.\" \n\n  - Bill Lagattuta \n\n(48 Hours Mystery\n  airs Saturday at 10pmET/9CT) \n\n  If you would like more information on any of these stories or the broadcast,\n  please click on the following address and e-mail us at: 48hours@cbsnews.com\n  \n\n\n\n \nSUNDAY ON 60 MINUTES\n \nAT THE CENTER OF THE STORM: Ex-CIA\n  Director George Tenet appears in his first network television interview to\n  talk about what it was like as the head of the security agency during 9/11,\n  the war on terror and the hunt for Osama bin Laden. He also says that the\n  Bush Administration acted dishonorably when it used his famous \"slam\n  dunk\" remark about WMD in Iraq to ruin his reputation and\n  his career. \n\nARMED AND DANGEROUS: Should\n  someone who has been deemed an imminent danger to himself, like Virginia Tech\n  shooter Seung Hui Cho, be allowed to own a gun? The law says no, but advocates\n  for the mentally ill say yes. Steve Kroft\n  reports. \n\n\n\n\nTO SUBSCRIBE\nClick here to\n  subscribe to the Inside Scoop.\n\nTO UNSUBSCRIBE\n  Unsubscribe information is included in each e-mail you receive. \n\nTRANSCRIPTS AND VHS TAPES\n  For transcripts of our CBS News broadcasts, please call 1-800-777-TEXT. To\n  order VHS copies, please call 1-800-934-NEWS\n\nCOMMENTS \n  Please know that we do read all the e-mails that are sent to this newsletter\n  and when appropriate, these e-mails are forwarded to the each of the\n  respective broadcasts. Email us at InsideScoop@cbsnews.com. While we\n  do try to answer each e-mail, please be advised that sometimes we are just\n  not able to. Thank you. Your friends at the Scoop. \n\n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\n  CBSNews.com, 524 W. 57th St.,\n  Room 514/1, New York, NY, 10019\nHelp | Advertise\n  | Terms of Service | Privacy Statement\n  ©MMVII, CBS Interactive Inc. All Rights Reserved. \n\n\n\n \n\n\n\n"}