{"category": "ham", "to_address": "globalizationandhealth@topica.com, ip-health@lists.essential.org", "from_address": "\"Ellen Shaffer\" <ershaffer@gmail.com>", "subject": "[Ip-health] WSJ: trade deal a small step for generics", "body": "--\n[ Picked text/plain from multipart/alternative ]\nIn Trade Deal, a Shift on Generics\n\n*Agreement Opens the Door To Cheaper Drugs Abroad,  Easing Some Patent Rules\n*\n\n*By SARAH LUECK*\n\n*Wall Street Journal, **May 17, 2007; Page A4*\n\nWASHINGTON -- A new trade agreement between Congress and the White House\ncontains provisions that open the door to more sales of generic drugs in\ndeveloping countries. The plan, reversing earlier gains for American drug\nmakers backed by President Bush, marks the first big setback for the\npharmaceutical industry since Democrats claimed Capitol Hill.\n\nFor now, the provisions likely only affect pending trade deals with Peru,\nPanama and Colombia. But the plan also signals a broader shift as\ncongressional leaders give greater weight in trade talks to providing\ncheaper medicines for the poor, even if it means denying the\nRepublican-friendly drug industry some of the protection it says it needs.\n\nThe administration \"has permitted the weakening of intellectual-property\nprotections in these agreements,\" said Billy Tauzin, president of the\nPharmaceutical Research and Manufacturers of America, the drug industry's\nmain trade group, in an interview. \"They were desperate to get continuing\ntrade authority\" from Democrats in Congress, he said. \"The fact is, their\nleverage changed since November.\"\n\nThe main focus of the bipartisan trade deal, announced last week, involves\nrequiring U.S. trade partners to meet new standards for giving their workers\nlabor rights and ensuring environmental protections. But the deal also\nallows developing countries more flexibility in dealing with U.S. drug\nmakers than they would have had under earlier versions.\n\nSpecifically, the policy would ease requirements on developing-country\nregulators to prevent the sale of patent-infringing products. It also\nreleases trading partners from a requirement to extend the time for patent\nprotections as a form of compensation for delays in drug approvals.\n\nPublic-health advocacy groups have argued for years that U.S. trade policy\nunder Mr. Bush often protected brand-name drug makers at the expense of poor\ncountries in need of more-affordable treatments. Many of those groups said\nthey weren't satisfied with last week's deal. Even with the changes, they\nsay, the Peru and Panama deals advance many of the protections the drug\nindustry wants -- just fewer than would have existed if the Bush\nadministration had stuck with its earlier trade stance.\n\n*\"Compared to the many steps backward that have been taken since 2003, this\nis a bit of relief for people who want access to affordable medicines,\" said\nEllen Shaffer, co-director of the Center for Policy Analysis on Trade and\nHealth in San Francisco. \"Compared to an actual policy that would provide\naffordable medicines for people and fairly balance that with innovation, it\nis a small step forward.\"*\n\nTrade is just one of many fronts where the pharmaceutical industry faces a\nless friendly policy environment, after enjoying strong support during years\nof undivided Republican rule. Some Democrats want to rewrite the Medicare\nprescription-drug benefit to allow the government to negotiate lower prices\nwith manufacturers. Some Democrats also want to legalize imports of cheaper\nmedications from Canada and other countries. The Bush administration has\nmaintained its support for the industry on those issues, and the Senate has\nblocked those policy changes.\n\nBut on exports, the administration last week changed course. For the last\nseveral years, U.S. trade officials and drug companies have worked to push\nnew protections for drug makers in countries such as signers of the Central\nAmerican Free Trade Agreement.\n\nCompanies say stronger safeguards for their patents and proprietary data are\nneeded in many countries, to delay generic competition and make it\nworthwhile for the industry to continue to invest in research and\ndevelopment of new treatments.\n\nUnder the new American trade strategy, the biggest loss for the industry is\na change that may shift more responsibility to drug makers for preventing\nthe marketing of patent-infringing products.\n\nUnder recent trade agreements, the U.S. pressed countries to agree to\n\"linkage,\" which requires local drug regulators to make sure a generic\nproduct doesn't violate any patents before allowing it on the market.\nPublic-health advocacy groups have said this puts makers of brand-name drugs\nat an advantage and burdens regulators. Drug companies support linkage\nbecause it prevents copies of their products from being sold during lengthy\ncourt battles. Without it, companies will have to be more vigilant. To take\nindustry concerns into account, the new policy calls for countries to set up\nfast procedures for resolving patent disputes.\n\nAnother change in the new trade policy would weaken a common provision in\npast trade agreements: that local regulators \"shall\" compensate drug makers\nfor delays in the process of approving their products, by awarding extra\ntime to sell their products free from competition.\n\nSome Democrats said this unfairly penalizes consumers in those countries for\nslow bureaucracies. A description of the changes to the Peru and Panama\nagreements says countries \"may\" extend a company's patent to make up for\ndelays, suggesting more flexibility on what they are required to do to\ncompensate drug makers.\n\nHealth-advocacy groups complain the new policy still preserves the\ndata-exclusivity provision used to block generic competition. In many\ncountries, including the U.S., makers of generic drugs can often win\napproval by proving their products are equivalent to the original drugs. In\nthat process, regulators use test data submitted by makers of brand-name\ndrugs. The data-exclusivity provision typically prevents such use of the\ndata for five years, acting as an effective hurdle for generics. The new\npolicy does, however, place more restrictions on the five-year data\nexclusivity than previously existed in the Panama and Peru agreements.\n\n*Write to *Sarah Lueck at sarah.lueck@wsj.com1\n\n\n\n*URL for this article:\nhttp://online.wsj.com/article/SB117936226237705632.html*\n\n\n\n*Hyperlinks in this Article:\n(1) mailto:sarah.lueck@wsj.com  *\n\n\n--\nEllen R. Shaffer, PhD MPH\nCo-Director, CPATH\nPhone 415-933-6204\nwww.cpath.org\ncell: 415-680-4603\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}