{"category": "ham", "to_address": "<R-help@stat.math.ethz.ch>", "from_address": "<ngottlieb@marinercapital.com>", "subject": "[R] R Book Advice Needed", "body": "I am new to using R and would appreciate some advice on\nwhich books to start with to get up to speed on using R.\n\nMy Background:\n1-C# programmer.\n2-Programmed directly using IMSL (Now Visual Numerics).\n3- Used in past SPSS and Statistica.\n\nI put together a list but would like to pick the \"best of\" \nand avoid redundancy.\n\nAny suggestions on these books would be helpful (i.e. too much overlap,\nporly written etc?)\n\nBooks:\n1-Analysis of Integrated and Co-integrated Time Series with R (Use R) -\nBernhard Pfaff\n2-An Introduction to R - W. N. Venables\n3-Statistics: An Introduction using R - Michael J. Crawley\n4-R Graphics (Computer Science and Data Analysis) - Paul Murrell\n5-A Handbook of Statistical Analyses Using R - Brian S. Everitt\n6-Introductory Statistics with R - Peter Dalgaard\n7-Using R for Introductory Statistics - John Verzani\n8-Data Analysis and Graphics Using R - John Maindonald;\n9-Linear Models with R (Texts in Statistical Science) - Julian J.\nFaraway\n10-Analysis of Financial Time Series (Wiley Series in Probability and\nStatistics)2nd edition - Ruey S. Tsay\n\nThanks.\n\nNeil Gottlieb\n--------------------------------------------------------\n\n \n \nThis information is being sent at the recipient's request or with their specific understanding. The recipient acknowledges that by sending this information via electronic means, there is no absolute assurance that the information will be free from third party access, use, or further dissemination. This e-mail contains information that is privileged and/or confidential and may be subject to legal restrictions and penalties regarding its unauthorized disclosure or other use. You are prohibited from copying, distributing or otherwise using this information if you are not the intended recipient. Past performance is not necessarily indicative of future results. This is not an offer of or the solicitation for any security which will be made only by private placement memorandum that may be obtained from the applicable hedge fund. If you have received this e-mail in error, please notify us immediately by return e-mail and delete this e-mail and all attachments from your system. Than!\n k You.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}