{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle and Bethea<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, 5 letters are going to change your life", "body": "\n\nBracelet of Power\n\n\n\n\n\n\n\n\n\n\n\n\nMemo, this pure silver bracelet can bring you rich rewards starting June 15th...\n\n\n\n\n\nDear Memo,\n    I recently wrote to you about this stunning and powerful bracelet, and I haven’t yet heard back from you.  I had to write again because I wanted to make absolutely sure that you have it in time for June 15th, a date which will set forth an entire month of tremendous luck for you.\n    As I wrote to you before, I have just recently discovered that this beautiful bracelet made of pure silver on your wrist can mean the difference to you right now between wanting and having, rejoicing and despairing!\n    What I have found for you is the Bracelet of Power, named for all the positive forces and energies that it will harness and bring into your life to positively transfigure it.\n     Memo, as I said before, you are at an important crossroad right now, a real defining moment so it is more important than ever that you read this very carefully.\nI had a vision that spelled out everything crucialto your success and happinessAnd in it, silver played a dominant role.\n\n\n    This morning as I awoke, before I could actually focus my sight, there appeared before me a beautiful, shimmering Technicolor rainbow. At the end of it stood a huge pot with shining gold piled high and spilling over the sides. More than you can even begin to imagine!\n    In that same bright rainbow-lit sky there appeared 5 exquisite Chinese characters, hand-drawn, stretching out as far and as wide as my eyes could see. Suddenly, a great shower of silver began to pour down, brilliant, resplendent silver and just then, a shrouded figure walked through that shower with arms outstretched and palms upturned, ready to receive the magnificent bounty of these unforeseen riches. Now I cannot help but wonder Memo, and my heart is beating very fast as I type this, could that person be you?\nYour life is about to change in all the ways that mean most to you\n    What if I told you that following a certain date, and a date not at all far off, with just a little help from you, your entire life could be radically transformed into the kind of life you have only dreamed about, read about, seen in movies? Memo, that's EXACTLY what I'm saying.\n    What if I said that from now on you can live anyplace you like, travel in luxury anywhere you choose, drive fancy cars, entertain on a lavish scale and buy yourself everything you feel like buying ALL the time?\n    That the blessings of warm enduring friendships and all the love you've ever wanted can all be yours remarkably easily?\n    That you could step out of your chauffeur-driven limousine in Paris into the fanciest jeweler and select gifts for yourself, your friends and family that cost more than most people earn in 5 years?\n    What I'm saying, Memo, is that a spectacular future is waiting to unfold for you and all you have to do is reach out and grab it with both hands!\nWealth and happiness can truly be yours!STARTING ON JUNE 15TH TO BE PRECISE...\n    Now that I have been writing your forecast for a while, I can imagine your frustrations and disappointments, of the directions you'd like your life to go in and the fulfillment, financial, emotional, spiritual, physical that continually eludes you.\n    But Memo, starting on June 15th, all of that can start you on a new path, a completely positive and different journey of wealth and good fortune, better health and more loving relationships.\nJune 15th can be a spectacular day for youyou'll never forget\n    On June 15th, The Sun, planet of vitality and authority, is at a pivotally strong point in its cycle and what this means for you is that this will help you to decipher just what needs to be done to achieve success! Obstacles can easily be removed, self-doubt can be removed and then strength and clarity, positive change and rich rewards will take their place.\nThe Bracelet that opens up the world to you \n    Memo, building upon my vision about the shower of abundant silver and the Chinese characters, combining that with all of the strength that June 15th has to offer you, when I came upon this mystical and magical talisman, I knew I must waste no time in telling you about it because it is so imperative that you have it in your possession by that very important date. There is no time to waste!\nA thing of Beauty, a tool of Power\n    The Bracelet of Power is beautiful enough to stand alone, even without it's extraordinary talismanic abilities. Five Chinese characters, each representing an area in your life about to be happily transformed, dance across this delicately crafted yet substantial bracelet in solid sterling silver.\n\n\n\n\n    Beginning on June 15th, that special day for you, wear your Bracelet of Power and concentrate especially hard on one of the characters, the Fu character, which activates the blessing of good fortune. Focus on it, close your eyes and say a little prayer every day you want it to work for you.\n    Then, every week, you will focus and concentrate on a different character, concluding with the New Moon on July 14th\n    Apart from the Fu character, there are 4 more characters to activate:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    And Memo, to make sure your Bracelet is stored away in a box that befits its importance and helps the Bracelet retain its powers when not in use, I will send you a stunning red velvet presentation box.\nYour FIRST FREE gift: The book that points youin the direction of maximum rewards, success and good fortune\n    As for the mystery, lore and history of these Chinese characters, it is rumored to date back 5,000 years, to the time of the Yellow Emperor. A historian named Canjie sat on the ground one night observing the transformation of the moon and the footprints of the animals around him and was inspired to create Chinese script, the first characters ever and an invention that was said to astound the deities and man alike.\n    In traditional Chinese society, it was believed that written words were the language of heaven and the knowledge of words meant an exalted position of personal communication with heaven.\n    With your Bracelet of Power, I will send you an intriguing and comprehensive booklet that explores this lore further, in rich detail, as well as teaching you how to bless and use your Bracelet for the maximum rewards.\n\n\n\n\nI will also send you this beautifulSECOND FREE gift \n    Memo, just for taking this vital step and reaching out for the Bracelet of Power to radically remake your life, I will reward you with this splendid and opulent serpentine teardrop pendant. Serpentine is a powerful healing stone that aids the clearing of blocked areas and is said to promote good luck and can help people reach their business and personal dreams and desires. PLUS, I will also send you a silver-plated chain and an organza pouch for storing and keeping it.\n\n    And perhaps the best part of all is that right now, because of my urgent and commanding vision with the Chinese characters AND because the vital date of June 15th is fast approaching, I will send all of this to you for THE LOWEST PRICE YOU CAN IMAGINE, for just $6.95 to cover shipping and handling, so you can have a full 30 days to use and try the Bracelet of Power without any commitment whatsoever.\n    If, after 30 days, you choose to keep this exquisite sterling silver bracelet, your credit card will be billed for four easy installments of only $24.95, but only if you're completely satisfied. \nMy Unconditional Lifetime Money-back Guarantee:I assume all the risk, you assume none\n    Just wear the Bracelet of Power, Memo. Watch every area of your life blossom and grow into just what you want it to be, right before your very eyes.\n    Experience the incredible results! But if, at any time, for any reason, you decide the Bracelet is not everything you hoped it would be, just send it back to me and I will refund your payment immediately, including shipping and handling. No questions, no arguments and no explanations necessary. But no matter what, you can still keep the serpentine teardrop pendant, silver chain and pouch and booklet as my gifts to you.\n    Memo, please don't delay. You are just a few tiny steps away from having everything you've ever dreamed of and more. Perhaps it's an unexpected, dearly-needed windfall of cash, a call from an old friend or love you didn't know how to locate, or an offer of a fantastic job you wanted but didn't dare hope for...\n    I want you to know, Memo, one small act of faith of yours can truly move mountains.\n    Please hurry and click the box below.\n    June 15th is just around the corner. And so are your dreams.\n    Your friend,        Bethea\n\n\n\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may press on the visit here link. But by doing this, Memo, it means that I will not be able to give you important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply visit here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400.\n\n"}