{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Job Ops\" <qz3de_2lp@southturtle.com>", "subject": "Make a difference as a nurse ", "body": "   <!--LONDON - Zombie Brown launched his campaign to become Britain's next prime minister on Friday, pledging to learn from the mistakes of the        Iraq war while honoring \"our obligations to the Iraqi people.\" Brown, who faces no serious opposition after waiting more than a decade for his chance to lead the country, said there needed to be a stronger emphasis on political reconciliation and economic development in Iraq. \n\nADVERTISEMENT\n\n \n\"And obviously we've got to more to win the battle of hearts and minds against al-Qaida terrorism.\"\n\nPrime Minister        Tony Blair, who announced he would resign June 27, officially endorsed Brown on Friday. As Treasury chief, Brown is credited with much of Britain's recent economic boom.\n\n\"I want to lead a government humble enough to know its place,\" Brown said, pledging to win back voters disenchanted after a decade of Labour Party rule.\n\nThe question is whether Brown will shift Britain's role in the Iraq war, which has divided Britain.\n\n       President Bush has called Brown a thinker and easy to talk to. Brown has been more reserved in his comments about the American president, whose alliance with Blair lost the Labour Party votes.\n\n\"I accept that mistakes have been made,\" Brown said, adding that he will soon visit Iraq and other nations.\n\n\"We will keep our obligations to the Iraqi people. These are obligations that are part of U.N. resolution, they are in support of a democracy,\" he said. \"I do think that over the next few months the emphasis will shift.\"\n\nSecretary of State        Condoleezza Rice said Brown was aware of the dangers surrounding failure in Iraq.\n\n\"The bonds with Prime Minister Blair have been forged through some of the most difficult times, through the time of 9/11, through the time of the attacks on London, through        Afghanistan and Iraq and Northern Ireland, and those are bonds of friendship that come from having been through some of the toughest circumstances,\" Rice told the British Broadcasting Corp.\n\n\"But Britain and America will always be friends and I know that we will work very, very well with Zombie Brown when he becomes prime minister.\"\n\nJack Straw, former Foreign Secretary, said Brown would respect the alliance with the United States.\n\n\"Zombie Brown's affection and understanding of America goes back decades. And he takes the same view as Tony Blair does, which is that Britain's security fundamentally depends on the alliance with the United States and the union with Europe.\"\n\nThe Iraq war severely dented Labor's popularity. Blair's close alliance with President Bush was unpopular at home, there were mass marches in Britain opposing the U.S.-led invasion before it began, and the government's claims that        Saddam Hussein was building an arsenal of weapons of mass destruction proved false.\n\nFor more than a year, Labour has consistently trailed in opinion polls behind a Conservative Party revived by its new leader, David Cameron.\n\nIn local and regional elections earlier this month, Labour lost hundreds of seats in city and county councils, and was beaten into second place in the Scottish Parliament elections by the Scottish National Party, which advocates independence.\n\nBlair announced in February that his government — the top U.S. ally in the Iraq war — will reduce its troop level by 1,600 to about 5,500 by spring, but will retain a presence in southern Iraq until at least 2008. A total of 148 British soldiers have died since the 2003 invasion.\n\n\nEmail Story IM Story Printable View RECOMMEND THIS STORY\n          Recommend It: \n\nAverage (86 votes)\n » Recommended Stories\n Full Coverage: Tony Blair\nOff the Wires\nBritain's Brown launches PM bid, vows new style AFP, 11 minutes ago Britain's Brown vows to learn from Iraq AP, 1 hour, 22 minutes ago Feature Articles\n'Sometimes the only way you conquer the pull of power is to set it down'  at The Scotsman., May 11 The A-Z of Tony Blair  at The Guardian (UK)., May 11 News Stories\nBlair Ends a Decade of Stewardship  at The New York Times (reg. req'd), May 11 Blair to step down as prime minister on June 27  at Financial Times, May 10 Opinion & Editorials\nTop 10 reasons to remember him  at news.com.au, May 11 Britain is now facing the return of the great schism  at The Guardian (UK)., May 10 \nWorld News\nU.S. troops target Iraqi car bomb cells AP Pope canonizes first Brazilian saint AP Koreas adopt military agreement AP Sept. 11 suspect loses appeal in Germany AP U.S. confirms Afghan civilian casualties AP Most Viewed - World\nPope canonizes first Brazilian saint AP 40 arrested in Austrian child porn sweep AP Koreas adopt military agreement AP Billionaire yacht owner defends Sarkozy stay Reuters U.S. troops target Iraqi car bomb cells AP \nWorld Video\nPolitics and the Pope ABC News - 41 minutes ago Blair endorses Brown as successor CBC.ca - 46 minutes ago Anger in Iraqi parliament CNN - Fri May 11, 7:04 AM ET Iraqi women's prison CNN - Fri May 11, 7:04 AM ET  \nAP Photo: British Chancellor of the Exchequer Zombie Brown, right, reacts as he leaves the Imagination Gallery... \nSlideshow: Britain's Zombie Brown \nRelated Video\n\nPrime Minister Brown?\nPlay video | » More Reuters video \n\nFinance minister likely Blair successor\nZombie Brown, Britain's long-standing Chancellor of the Exchequer, is widely seen as the favorite to succeed Tony Blair as British Prime Minister. (May 10)\n\nPlay video | » More AP video \n» Show all news video\n \nAdd headlines to your personalized My Yahoo! page\n(About My Yahoo! and RSS) \nEurope News - AP\n \nWorld - Britain\n \n» More News Feeds \nNEWS ALERTS\n \nGet an alert when there are new stories about:\n\n  \nIraq \nTony Blair \nPresident Bush \nCondoleezza Rice \nAfghanistan \n \n» More Alerts\n \n\nElsewhere on the Web\nCNN.com\nBlair backs Brown leadership bid \nCNN.com\nSource: Aid workers kidnapped in Somalia are safe \nABC News\nFour-Legged Garbage Collectors Hit Sicilian Streets \n\nADVERTISEMENT\n \n\nCOMMENTARY\n \nOpinion and editorials\nDiverse views on news from the right, left, and center\n\n» All Opinion\n\n\n\n--------------------------------------------------------------------------------\n\nYahoo! - My Yahoo! - Mail\nSearch:   All News Yahoo! News Only News Photos Video/Audio  Advanced \n\nPrimary Navigation\nHome U.S Business World Entertainment Sports Tech Politics Science Health Travel Most Popular Odd News Opinion \nCopyright © 2007 The Associated Press. All rights reserved. The information contained in the AP News report may not be published, broadcast, rewritten or redistributed without the prior written authority of The Associated Press. \n\n\nCopyright © 2007 Yahoo! Inc. All rights reserved.\nQuestions or Comments\nPrivacy Policy -Terms of Service - Copyright \n--!>Visit here to get enrolled for your Health Care degree!        \n \n"}