{"category": "ham", "to_address": "\"Paul Murrell\" <p.murrell@auckland.ac.nz>", "from_address": "\"hadley wickham\" <h.wickham@gmail.com>", "subject": "Re: [R] Unit Testing Frameworks: summary and brief discussion", "body": "On 5/10/07, Paul Murrell  wrote:\n> Hi\n>\n>\n> Paul Gilbert wrote:\n> > Tony\n> >\n> > Thanks for the summary.\n> >\n> > My ad hoc system is pretty good for catching flagged errors, and\n> > numerical errors when I have a check.  Could you (or someone else)\n> > comment on how easy it would be with one of these more formal frameworks\n> > to do three things I have not been able to accomplish easily:\n> >\n> > - My code gives error and warning messages in some situations. I want to\n> > test that the errors and warnings work, but these flags are the correct\n> > response to the test. In fact, it is an error if I don't get the flag.\n> > How easy is it to set up automatic tests to check warning and error\n> > messages work?\n> >\n> > - For some things it is the printed format that matters. How easy is it\n> > to set up a test of the printed output? (Something like the Rout files\n> > used in R CMD check.) I think this is what Tony Plate is calling\n> > transcript file tests, and I guess it is not automatically available. I\n> > am not really interested in something I would have to change with each\n> > new release of R, and I need it to work cross-platform. I want to know\n> > when something has changed, in R or my own code, without having to\n> > examine the output carefully.\n> >\n> > - (And now the hard one.) For some things it is the plotted output that\n> > matters. Is it possible to set up automatic tests of plotting? I can\n> > already test that plots run. I want to know if they \"look very\n> > different\". And no, I don't have a clue where to start on this one.\n>\n>\n> For text-based graphics formats, you can just use diff;  for raster\n> formats, you can do per pixel comparisons.  These days there is\n> ImageMagick to do a compare and it will even produce an image of the\n> difference.  I have an old package called graphicsQC (not on CRAN) that\n> implemented some of these ideas (there was a talk at DSC 2003, see\n> http://www.stat.auckland.ac.nz/~paul/index.html).  A student worked on a\n> much better approach more recently, but I haven't put that up on the web\n> yet.  Let me know if you'd like to take a look at the newer package (it\n> would help to have somebody nagging me to get it finished off).\n\nI'd be interested!\n\nHadley\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}