{"category": "spam", "to_address": "<catchall@speedy.uwaterloo.ca>", "from_address": "\"Hilda I. Childress\" <hhs@qualitywerks.com>", "subject": "This is the affidavit of Brent Hanson.", "body": "\n\n\n\n\n\n\n\nShe continued to see Dr. On or about September 29, \n11998 CTV, published on its program \"W5\", an interview with Dave Perron, a former \npatient of Dr.\nThe other is at 5025 Orbitor Drive, Suite 300, \nBldg.\nDefendant TLC Garden City provides laser vision \ncorrection services, including excimer laser eye surgery in Garden City, New \nYork.\n; MALONEY VISION INSTITUTE; PATRICK DOYLE, M. The \nremaining Defendants have not issued apologies.\nHolland:  I cannot see a situation where it would \nbe safe to proceed having a poor flap of any kind.\nStein perform enhancement surgery on both of my \neyes. Sutton referred those of his patients who experienced complications which \nrequired the assistance of a corneal sub-specialist to Dr. My night vision worsened \nand I can only drive at night with great difficulty. Plaintiff Joseph Dell Russo, \nM.\nThereafter, the follow-up treatment was conducted \nby defendant DOYLE. Plaintiff also has appeared on national television, a rarity for \nophthalmologists.\nLinda Foley of TLC Arlington in Texas.\nRalph in the CBC Broadcast are known to the \ndefendants to be false. Machat had corrected the vision in one of my \neyes.\nAt the Windsor TLC Clinic Dr.\nDefendants' advertisements are likely to cause \nconfusion, mistake or deception as to plaintiff's and defendants' services and With \nthe fitting of a rigid gas permeable contact lens to her right eye, there was an \nobjective and subjective improvement in visual acuity.\nOn about July 6, 1998 the Canadian Broadcasting \nCorporation, broadcast on its television program \"Broadcast 1\" an interview with \nMs.\nIn addition, following the Excimer Laser ablation \non March 20, 1997, there was a marked overcorrection with significant hyperopia and \nastigmatism created by an apparent decentered ablation. At the Windsor TLC Clinic \nDr. Jeffrey Machat, and other TLC Laser Eye Center executives sued by LASIK Vision \nCanada for engaging in dirty tricks campaign.\nAt night, vision in both of my eyes is poor. I also \ndeveloped hyperopia and scarring in my left eye. In this eye surgery - ophthalmology \n- malpractice lawsuit, which in actuality was two separate suits, the first \nplaintiff, Mr.\nFull particulars of the campaign of defamation are \nwithin the knowledge of the defendants. The next day he underwent a four-hour \nprocedure to repair the retinal detachment in his right eye and on the following \nDecember 9th, underwent a corneal transplant for his left. She told me that TLC had \na laser that could treat my decentered ablation complication.\nThe Plaintiff, Lasik Vision Canada \nInc.\nI continued to telephone Dr. Jeffrey Machat, the \nNational Medical Director for TLC.\nMy scheduled cornea transplant 18.\nand acts as its national medical director. Alberta \nRN is published by the Alberta Association of Registered Nurses.\nUpon information and belief, defendant Giuseppe \nDellorusso participated or allowed someone else to participate under his name, in \nthe acts complained of herein.\nIn either late December of 1998 or January of 1999, \nplaintiff received a so-called \"enhancement surgery at the hands of defendant \nMALONEY. The defendant Bart McRoberts (\"McRoberts\"), whose address is unknown, is an \noptometrist, and is a clinical director at the TLC Vancouver Clinic. Dellorusso has \na place of business within this district located at 58 Main Street, East Rockaway, \nNew York. In October 1997 and individual whom I knew as \"Joseph\" told me that the \ncompany would pay for my return trip to Toronto.\n"}