{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Ned Zombie\" <veccyberchatmanianos@cyberchatmania.org>", "subject": "Get your ideal weight with this natural method", "body": "\nCheck out the wonders of pound melting\n\n\n\n\n\n\nAnatrim – The newest and most exciting product for corpulent people available – As were seen on Oprah.\n\n\nDo you count up all the situations when you appeal to yourself to do any thing for being delivered from this desperately growing pounds of fat? Happily, now no great price is to be paid. With Anatrim, the ground-breaking pound-melting combination of elements, you can achieve naturally health lifestyle and become really thinner. Just look at what our customers state!\n\n\n\n\"It’s unbearably difficult to admit it but I was a junk food addict. \n\n\nI ate all this rubbish \n\n\nand was unable to stop. \n\n\n\n\nThis fatal passion stopped when I started course of taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my craving for food vanished, \n\n\nspirits increased and I’m the happiest person 25 pounds in 2.3 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nLusia R., Boston\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nIt’s difficult to fancy how I hated being ridiculed at school. \n\n\n\n\nI hated my plumpness and I detested myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nIt literally took me out of this nightmare! Thanks and thanks to you, my friends.\"\n\n\n\n\n\nRikky Martin, Washington\n\n\n\n\n\n\"Do you know what? Thanks to Anatrim my marriage was saved! I got into this circle, depression – more eating – even more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOnce my friend pointed at your web site and I ordered up my pack of Anatrim right away. \n\n\nThe result was excellent, my appetite became normal, I was in good spirits oftener, and, certainly, I became able to tighten my belt on some holes. And you see, the bedroom became cool, too!\"\n\n\n\n\n\nFrank\n\n\n\n\n There is a lot of sincere gratitudes happy people leave after trying Anatrim. Why don't you add yourself to the thousands and thousands of slim buyers and try this original appetite decreasing power increasing product now!\n\n\nDo not miss the opportunity!\n\n\n\n\n"}