{"category": "ham", "to_address": "sugar@lists.laptop.org", "from_address": "LodatoClan@aol.com", "subject": "[sugar] The Power of a Truly Low Cost Laptop for People in Need", "body": "\n\n\n\n\n\n\n\n  The Power of a Truly Low Cost \nLaptop for People in Need and Their Caregivers    \n\nby  \n Janine M Lodato \n~|__     \nOo\\_  \n\nLodatoClan@aol.com\n\n\n\n \nIn \na recent article in www.technologyreview.com , Dr. S. Simeonov  (www.polarisventures.com) eloquently \nargued that if information technology (IT) is provided to people on the full \ntime basis then their productivity explodes. Also their quality of life \nimproves significantly to which, as a disabled person I can personally attest. \nThis is especially true for people who are on the wrong side of the digital \ndivide: they do not have quality IT capability. \nA \nsignificant size subgroup of these people without adequate IT capability are the \n100 million people who are mostly homebound: the frail elderly, chronically ill \nand the disabled. This population sector is the fastest growing segment due to \nthe aging of the baby boomer population. There are 44 million informal \ncaregivers (family and friends) in the USA who attend to the 100 million \npeople in need of care-giving. The combination of these two groups \naccount for roughly half the population of the USA. It is the same \nratio in the populations of the group of ten developed nations. \nWhat these people need is a simplified version of the MIT Media Lab's \n(Dr. Negroponte's lab.) 100 dollar laptop. Now called OLPC: one laptop per \nchild. Currently priced at 150 dollars but it will come down with volume. It \nruns a very simple software called XO, offering a simple browser, email, \n meshed network and the capability to automatically sign up and log into \nthe Internet and the Web. This simplified and easy user interface is called \nSugar developed under Linux by www.RedHat.com. \nAlso please look at the www.laptop.org web-site for greater details of \nthe OLPC XO laptop capabilities..\nWhile, of course, the XO laptop can connect to any server on \nthe Internet, it should also be supported by local community based server \nportal we would like to call AbleryPortal  offering the \ndesired applications.\nThe AbleryPortal is equipped with a gesture recognition enhanced \nhigh performance voice recognition system thus the end user could simply use \ntheir voice and a few gestures. We call this the Signalish system and have \ndeveloped it over a period of time: details are available upon email request. \n\nNo \nWindows, please, only Linux. Windows is insanely unreliable, maddeningly complex \nand criminally expensive, that is what is wrong with Windows.  All \napplications will run in Webtop style (like www.youOS.com) on a group of servers offered by \nthe local government such as the AbleryPortal. \nThese Webtop server capabilities could also be offered by the \ncourageous companies who support Dr. Negroponte's project including AMD, Google, eBay, Red \nHat etc. \nThe 144 million people mentioned above also need \na political voice and political support by any \npolitical candidate, with courage and foresight. The XO laptop \nconnected to the AbleryPortal capability would allow these needy people to \nvoice their political needs.\nThe 08 presidential election could be just perfect. A perfect \nplatform for the independent political group: www.unity08.com.\nOf \ncourse the small businesses who employ caregivers would also support such \nenlightened campaign supported by this very large voting block. \nWe \nalso need a tax break for businesses, especially for small businesses, \nwhen they hire and retain an informal caregiver as an employee. Businesses \nalready have a tax break when they employ a disabled person. The same or similar \ntax break should be given to the business which hires informal caregivers or who \nalready employ such caregivers.\nIf \na politician candidate for a major office would create and \npush through the legislation which would provide a tax break to the employers of \ncaregivers, it would assure that such politician or candidate certainly would be \nsupported by much of the above 144 million population segment: the combination \nof the informal caregivers and the people who are in need of \ncare.\nWhat a campaign issue, indeed!\nThe US Department of Labor predicts that by 2008, 54 percent of the work \nforce will be involved in caring just for an elderly person making doctors' \nappointments, handling emergencies, giving transportation, buying and cooking \nfood, all the basic functions of life the elderly person has difficulties to \nperform.\nBut the informal caregivers who are also full time employed have a major \nproblem; not everyone is able to manage the conflicting demands of working and \ncare-giving.\nA \nMetLife study reported that 16 percent of employees who perform as caregivers \nquit their jobs and 13 percent retired early in order that they could provide \ncare-giving to the people in need. This study found that the average life-time \nloss per such person was an estimated $ 566 thousand in lost wages, $ 67 \nthousand in lower pension benefits plus $ 25 thousand loss of Soc. Sec. \nbenefits.\nAlso, many of the employees who are caregivers get passed over for \npromotions and are the first ones who are eliminated when a downsizing of the \nbusiness takes place. \nThese problems of the employees, who are also serving as caregivers, \ncould be almost eradicated if the employers of caregivers would let their \ncare-giving employees to perform tele-work style for some or much of their \nworkload. About only one in four businesses offers employees who are \ncaregivers such advantages as flexible hours, telecommuting, paid leave in case \nof emergencies and compassionate understanding.\nThe legislation which would support the employers of the caregivers could \nalso include a double or increased tax break for the employer if the business \nwould allow the employees, who are involved in care-giving, to perform most \nof their work with great degree of flexibility such as telecommuting and \nflexible time. One potential use of such tax break would be to supply the \ncaregiver employee with a high performance Linux based, safe and reliable, \nlaptop so they can perform their work from anyplace including the home of the \nneedy person they are performing the care-giving for.\nSo \nlet us organize a strong campaign for the independent third party online \nconvention, or the convention of the democrats, followed by an \nelection campaign in each of the 50 states and then onto the \nPresidential elections, which could include in their platforms the special tax \nbreak for the businesses who employ and appreciate employees who are also \ndedicated caregivers.\n \n \nJanine M. \nLodatoP.O.Box 838SAN ANDREAS,  CA.95249-838~|__( \no )\\_See what's free at AOL.com. \n"}