{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Gilberto Sinclair\" <naseasyboxpiv@easybox.it>", "subject": "Achieve picture perfect weight and enjoy life", "body": "\nMelt away pounds with Anatrim\n\n\n\n\n\nAnatrim – The very up-to-date and most delighting product for over-weight people is now readily available – As were seen on Oprah\n\n\n\nDo you see superfluous body kilograms kill a plenty of people around the world? We know you hate the unsightly appearance of people like those and the low status they obviously have in society. \n\nMoreover, you can’t resist an assault of baneful eating habits of yours. If it all sounds familiar, then we got something to propose to you!\n\n\n\n\n\nWe are proudly introduce you Anatrim, the later product for the reduction of your body’s extra weight. The greatest thing about Anatrim is it raises the quality of your life, making you feel no hungry and giving you better mood. Read what people say on this product:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of watching TV continually and stuffing myself with food \n\n\nI became keen on doing sport.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I have a great form now and there are lots of men around me!\"\n\n\n\n\n\n\nRita R., Bellevue WA\n\n\n\n\n\n\n\"I tried some passive weight losing, but all came in vain. I was rather difficult for me to hold in my ravenous hunger. \n\n\nOnce I heard about Anatrim from my very best friend and I rather liked the information.\n\n\n I had tried taking it, and my wife told me I'm a different person now, 4 months later. \n\n\n25 pounds have gone away and I continue to become slimmer! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nCharley Mock, Bellevue WA\n\n\n\n\n\nAnatrim gives you an opportunity to realize you got no such great need for that much food. It lifts your mood up, supplies you with extra energy, and attacks useless kilos. Great thanks to its powerful distinguished formula!!\n\n\n\nElicit more useful information!\n\n\n\n"}