{"category": "ham", "to_address": "beginners@perl.org, perl-beginners@moderators.isc.org", "from_address": "Brian <googleAcct@screenlight.com>", "subject": "Re: Array of Array refs", "body": "On May 29, 6:06 am, mri...@gmail.com (Paul Lalli) wrote:\n> On May 29, 4:58 am, googleA...@screenlight.com (Brian) wrote:\n>\n> > On May 28, 6:14 pm, mri...@gmail.com (Paul Lalli) wrote:\n>\n> > > >  oh yes, more important than all that minutiae... the push did not\n> > > > work for me in the working code.\n>\n> > > The push worked absolutely fine.  It just didn't do what you wanted it\n> > > to.  Learning how to parse your problem should be your first step\n> > > toward becoming a better programmer.\n>\n> >  hmmm, misunderstanding there. The push worked fine in the sample I\n> > posted, but not in the more complex working program I had simplified\n> > as an example.\n>\n> nope, sorry, you're wrong.  push() works perfectly well.  It adds\n> elements to an array.  If your program produced incorrect results, it\n> is because you did something wrong, not because \"push didn't work.\"\n\nugh. pedantic semantics...\n\n\n> Of\n> course, as you haven't shown any code that produces these undesired\n> results, we can only guess as to what your actual problem was.\n\nyes, the real code is beyond what I would think of as \"beginner\"\nI truly meant to just post a small, working piece pf code that worked\nwith\nsome basic data structures... The DBI client is a bit more\ncomplicated, yes?\n\n>\n> > > > The array was being rewritten.\n> > > Then you didn't delcare your variables in the correct scope.\n> > understandable misperception on your part, as above\n>\n> Nope.  If your array is being used in a loop, the contents of that\n> array are changing when you don't want them to be changing, and\n> instead want to be creating new arrays, you declared your array in the\n> wrong scope.\n>\n\nThe sample I put out and the code I was\nworking on are not identical. I declared my array in a different scope\nin\nthe sample. Neither is \"wrong\", they are different.\n\n> > > > I had to use an array copy\n>\n> > > >   push @tRespsA, [ @r1 ];   ## copy contents to an anonymous array,\n> > > > push array ref\n>\n> > > Do you understand *why* that was necessary?  Do you understand the\n> > > difference between these two pieces of code?\n>\n> >   actually, I do indeed. In C++, the concept of a deep copy, vs\n> > shallow copy vs ref\n> > comes up all the time. I am just learning the syntax here, not\n> > programming itself\n>\n> perhaps you should be. . .\n\nugh. insults. I am not trying to insulting you Paul, why resort to\nthat?\nYou have no idea how many programs I've written, well. I'd say its bad\nform\nto assume the worst or lowest in people.\n\n>\n> >   aha, a force to be reckoned with. Your point above about the docs is\n> > quite true.\n> > I dont have time to rewrite docs right now.. They do need work though\n>\n> You don't even have time to point out what you find to be \"wrong\" with\n> them?  But instead you do have time to create examples that you claim\n> to be in the service of newbies, all the while saying that the docs\n> are bad?  I'd suggest you could do with attending a few more time-\n> management seminars.\n>\n\nplease examine logic - rewriting core Perl docs vs a 10 line sample\nprogram\n\n> > This is sometimes appearing to be contentious\n>\n> No sometimes about it.  Every post you've made thus far is\n> contentious, and so I have answered in kind.\n>\n\nno, I'd suggest you read it that way.. Its notoriously difficult to\nconvey context\nand nuance in a few lines of ascii text. Please refer to your RTFM and\nthen\nessentially yelling at me for a modest sample program.\n\nI am not backing down from your brow-beating. I posted a small\nworking\nsample program then found out more about the context I was dealing\nwith\nand attempted to discuss it in an unassuming manner. For this I get\nthese\nresponses. phooey!\n\nI'll be posting again from time to time, and probably going to OSCon.\nHappy\nto talk with you anytime. May not respond every time though. I think I\nam\nsensing a pattern here...\n\nbest regards\n  -Brian\n\n\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}