{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Larry Cochran <dcuccio@glasshouse.net>", "subject": "Can you imagine that you are healthy?", "body": "\n\nIs there any reasons to pay more? Do you want to save your money? I bet you do! \nGo to the shop\nLicensed Viagra and Cialis we are offering would improve your sexual life in few moments.\nEverything for your sexual health\nMake secure and confidential purchases. Nobody will know that you are using medications.\nWith best regards,\nLarry Cochran\n \n \nPo spine snova probezhal oznob, kogda ia sravnil etu progalinu s toj chto Videl vo sne, oni okazalis zloveshche shozhimi. Voznica na obluchke, utonuv spinoj v pahuchem Raznotrave, kleval nosom, a starenkij toshchij drakh, kakoj-to sero-zelenyj ot Drevnosti, tozhe, kazalos, dremavshij, tashchilsia na avtopilote. Ia Sebe lishnih nepriiatnostej nikogda ne iskal i opytom chuzhih oshibok predpochital Ne prenebregat. Gde Eto menia tak ugorazdilo, diadiushka? Tut ego vzgliad skolznul po rasprostertomu Vozle steny kolodca telu Leksa, metnulsia k lezhavshej vozle Kruga Prichastiia Onni, I Gront porazhenno zamer. \nNadeius, ty menia pojmesh. A kak zhe togda tvoe prikrytie? Razve ono ne podozritelno? Ia ne prosto prikryvaiu tebia, ia eshche sozdaiu vtoroj, lozhnyj fon, tak, Nichego osobennogo, melkie myslishki melkogo chelovechka. Poniatno, temu luchshe smenit. Manery. On v liubom sluchae uzhe znaet napravlenie nashego Peredvizheniia, i v liubom sluchae nam ne vystoiat, kogda on nagrianet siuda so Vsemi svoimi liudmi, no snachala emu pridetsia potratit dopolnitelnoe vremia, Chtoby utochnit nashe mestopolozhenie. Predpochel proglotit svoe nedovolstvo. Ia eto zametil. Teper Zhe delo poshlo neskolko inache, tak kak za poimku zasfernika vzialsia sam Drahub. \nEto takie nebolshie shustrye tvari s zelenym mehom, poiasnila Taj. Bolee togo ia ne zhelal snova Bezrezultatno trepat nervy, razmyshliaia ob etom iavlenii. Ona s siloj vstriahnula golovoj. Potom obiasniu! Govori da! Net, upriamo skazal ia. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}