{"category": "ham", "to_address": "\"General Copyright Discussions (questions, organizing,\n\tetc)\" <discuss@list.digital-copyright.ca>", "from_address": "Russell McOrmond <russell@flora.ca>", "subject": "[d@DCC] Another Bloc members calls for swift copyright amendments\n to protect US special economic interests.", "body": "\n  There was debate today on Bill C-47 (An Act respecting the protection\nof marks related to the Olympic Games and the Paralympic Games and\nprotection against certain misleading business associations and making a\nrelated amendment to the Trade-marks Act).\n\nhttp://www2.parl.gc.ca/HouseBills/BillsGovernment.aspx?Language=E&Mode=1&Parl=39&Ses=1#C47\n\n\n  Charlie Angus gave a great speech talking about the problems with this\nbill, the need for balance, the potential chilling effects and\nunintended consequences, as well as the precedent of the reverse-onus\nthat he saw as mirroring some of the rhetoric from the infamous Bulte\nreport.\n\n\n  As a question to a later speaker (not Charlie, as he would have given\na great response) a Bloc MP asked a Liberal MP about why it is that this\nbill is moving so quickly, but that the Conservative Government isn't\ndoing anything to deal with counterfeiting -- specifically mentioning\nmovies in theaters.\n\n  I don't remember the name of the member, but her name will be within\nthe Hansard that will be available tomorrow.\n\n\n\n  Chris Brand sent a letter to Maka Kotto who asked a question in\nQuestion Period about the 1996 WIPO treaties\nhttp://www.digital-copyright.ca/node/3948  and the answer (paraphrasing)\nwas that they didn't want to Americanize the industry, but wanted to\ndiscover what the government was going to say that seemed to take\npositions in favor of the US.\n\n  Ironic given the Bloc seems to be spend all their time complaining\nthat the Conservatives aren't Americanizing Canadian law fast enough.\nThey claim to want to protect sovereignty, but I see little evidence of\nthis on technology law.\n\n  Are there any people in Quebec that want to approach the Bloc on this?\n We see some pretty good things being said by Charlie Angus of the NDP,\nand we see so many very bad things being said by the Bloc, even though\nhistorically both these parties had an interest in protecting Canadian\ncreativity.\n\n\n  It should be noted that the Appropriation Arts folks received an\nidentical reply to a related question that Chris did.  This is an\nimprovement, given I've never even received a reform letter from a Bloc\nMP as an anglophone Ontarian.\n\n-- \n Russell McOrmond, Internet Consultant: \n Please help us tell the Canadian Parliament to protect our property\n rights as owners of Information Technology. Sign the petition!\n http://www.digital-copyright.ca/petition/ict/\n\n \"The government, lobbied by legacy copyright holders and hardware\n  manufacturers, can pry my camcorder, computer, home theatre, or\n  portable media player from my cold dead hands!\"\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}