{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Liberal Media Smoking Gun?", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nThe \n      Public Eye Chat With .... Sharyl Attkisson\"When you call about a story a member of \n      Congress doesn't want covered, the press secretary will say 'That’s old news' no matter how recent the story is \n      or 'Everybody's already done \n      that story' even if nobody has. When \n      a press secretary does want a story covered, he/she will \n      say: 'There's interest from \n      other networks' or 'I can give you the exclusive now but if \n      you don't take it now I'll have to shop it around.'\" [+ Read More]\n\nThe \n      \"Liberal Media\" Smoking Gun? If you're at all interested in \n      the Great Media Bias Debate - and if you're here, there's a decent chance \n      you are - you've probably seen MSNBC's report about journalists \n      contributing to political campaigns. In a development that should shock \n      precisely no one, 125 of the 144 journos identified gave to \"Democrats and \n      liberal causes,\" while only 17 gave to Republicans. (Two gave to both \n      parties.) [+ Read More]\n\nDispatch \n      from Inside CBS NewsCBS cameraman Don Lee told a few \n      stories about what happens behind the scenes of a news segment from the \n      guy directly responsible for the visual images, most notably: “Don’t ever \n      let a producer bully you into bad work. Just remember that it may be his \n      story, but it’s your pictures. There’s never a caption at the bottom that \n      says ‘the cameraman was extremely rushed.’\" [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nLiberal \n      Bias in CBS News Poll Story?\n \nBias \n      Study Under Attack\n \nThat \n      Bias Dog Won't Hunt \n    Here\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}