{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 9, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESBush Tours Town Wiped Out By Tornado\nStepping through the rubble, President Bush got his first look at the Kansas farming town that was nearly obliterated after\n                        last week's killer tornado. The president said he hoped he could \"touch somebody's soul by representing the country.\" More...Watch: Bush In Tornado-Struck Kansas\n• Fed Leaves Key Interest Rate Unchanged• Cheney: Iraq Still A Dangerous Place\n                     \t\t\t\t\t| Watch• Failing Levees Spur Major Missouri Floods\n                     \t\t\t\t\t| WatchU.S.Indictment In 1965 Civil Rights Killing\nAn Alabama grand jury has returned a sealed indictment in the 1965 shooting death of a black man by a state trooper during\n                        a melee at a civil rights demonstration.   More...\n• Woman Sentenced For Antifreeze Murder• Report: Sosa, Palmeiro In Steroid Probe• Fort Dix Plot Called \"New\" Form Of Terror\n                     \t\t\t\t\t| Watch• More StoriesWorldCuba And Venezuela: U.S. Shields Terrorist\nVenezuela and Cuba have accused Washington of shielding a terrorist after a judge threw out immigration fraud charges against\n                        a man wanted in the 1976 bombing of a Cuban airliner. More...\n• Cheney: Iraq Still A Dangerous Place\n                     \t\t\t\t\t| Watch• Blair To Announce Plans For Future • 4 Arrested For 2005 U.K. Bombings• More StoriesPoliticsWhite House Vows Another Iraq Veto\nThe White House said President Bush would veto the Democrats' latest version of the Iraq war funding bill. The measure would\n                        provide funds for the war only through July, then give Congress the option to cut off money if conditions do not improve. More...\n• Bush Tours Town Wiped Out By Tornado\n                     \t\t\t\t\t| Watch• Maryland Governor Endorses Hillary Clinton• Sharpton Denies Questioning Romney's Faith• More StoriesHealthWeekend Births Riskier In Some Hospitals\nGiving birth on a weekend may be riskier to a newborn's life if relatively few babies are delivered at the hospital, according\n                        to a new Texas study. More...\n• China Makes Arrests In Pet Food Case• Women Suffer In Silence With ADHD• Study: Baby Aspirin Best For Heart• More StoriesSciTechSubtropical Storm Forms Off Atlantic Coast\nSubtropical Storm Andrea formed off the southeastern U.S. coast, more than three weeks before the official start of hurricane\n                        season, forecasters said. Subtropical systems are hybrid weather formations that are usually weaker than tropical storms. More...\n• Cheap Power For Northeast A Mixed Blessing• Australia Uses Aboriginal Weather Wisdom • Comcast Unveils Super-Fast Modem• More StoriesBusinessFed Leaves Key Interest Rate Unchanged\nThe Federal Reserve left a key interest rate unchanged as the economy signaled that it was on track for a soft landing in\n                        which growth slows enough to restrain inflation. More...\n• Scholarship Tips For High School Students• Gas Station Owner Ordered To Raise Prices• \"Trigger Lists\" Spur Privacy Worries\n                     \t\t\t\t\t| Watch• More StoriesEntertainment\"Georgia Rule\" Controversy Haunts Lohan\nOn Tuesday, producer James G. Robinson said the letter he sent Lindsay Lohan last year after she missed a day of work on the\n                        film \"Georgia Rule\" served its purpose at the time. \"She's a great actress,\" he said. More...Watch: Producer Explains Lohan Letter\n• O.J. Tossed From Steakhouse On Derby Eve• Diaz Doesn't Worry About Seeing Her Ex• Mirren Declines Queen's Dinner Invitation\n                     \t\t\t\t\t| Watch• More StoriesOpinionTenet Chose Power Over Honor\nGeorge Tenet now says the case he built for war was taken out of context. So why didn't he resign in protest if the U.S. was\n                        invading Iraq for no reason? The New Republic writes that, in government at least, it's the American way. More...Watch: Tenet: 'We Were Wrong'   \n• Pelosi Breaks Her Promise On Pork• Elizabeth II And George II• Why '08 Will Belong To The Democrats\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Sen. Graham's Secret Mission In Iraq\nWhile Congress continues to debate about how to proceed with the controversial war in Iraq, only one Senator, Lindsay Graham,\n                        R-S.C., has had first-hand experience in Iraq as an active-duty member of the military. More...Watch: Eye To Eye: Lindsey Graham\n• EARLY SHOW: \"Trigger Lists\" Spur Privacy Worries\n                     \t\t\t\t\t| Watch• EARLY SHOW: Cutting Edge Kitchen, Bath Products\n                     \t\t\t\t\t| Watch• EARLY SHOW: Women Suffer In Silence With ADHD\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nCoffee Roasting Goes GreenBrothers David and Mike Hartkop of Pueblo, Colo., have invented a coffee roaster that uses the rays of the sun. Their customers\n                                    say the Joe tastes better than ever. Jennifer Miller reports.\nTOP VIDEOS\nBush In Tornado-Struck Kansas\nL.A. Works To Contain Fires\nBush Visits Tornado Victims\nProtests Greet Cheney In Iraq\nLatest Home Tech Trends\nHappy To Be Alive In Kansas\n'Georgia Rule' Premieres In NY\nWeapons Amassed In Terror Plot\nRising Water Threatens Town\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesDoes fiery CNN anchor Lou Dobbs consider himself a journalist? Lesley Stahl finds out, Sunday, 7 p.m. ET/PT.48 Hours!\n  Mystery\nPower, Passion And Poison:An ambitious politician meets a suspicious death. Troy Roberts reports, Saturday at 10\n                           p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}