{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nI hope you had a great Fourth of July.\n \nThe holiday caused some travel snarls around the\n  country this week. But when traveling by air, how long could you wait for\n  your flight? Hours? Days? Even if a flight is only slightly delayed, that can\n  mean many extra hours in airports – and sometimes ruined plans – for\n  travelers. Nancy Cordes will have more tonight.\n \nOf course some air travel waits can be attributed to\n  extreme weather. In pockets of the United States this week, there’s\n  flooding, drought, storms and fire. Sandra Hughes and Hari Sreenivasan will\n  have reports on the havoc weather is unleashing on Americans.\n \nMilitary recruitment numbers have been unpredictable\n  during the U.S.\n  involvement in Iraq.\n  But now National Guard recruitment numbers are up. Our national security correspondent\n  David Martin will tell you how the guard turned their numbers around.\n \nAnd I’ll have a story about two leukemia\n  patients’ quests to find bone marrow donors. You’ll be surprised\n  how painless it can be these days to become a donor – and even to save\n  a life.\n \nWe’ll end tonight’s broadcast with a report\n  from Kimberly Dozier about some hand-crafted gifts that have touched the\n  hearts of many. They come from ordinary Americans – and go to wounded\n  war veterans. And they provide a comfort Dozier experienced firsthand.\n \nThanks. I hope you’ll join us,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}