{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Power Marketing Association<Power.Marketing.Association@calcium.netcontentinc.net>", "subject": "Outage Management Systems and  IEEE Distribution Reliability Indices  Sept 10-12  Atlanta", "body": "\n\n\n\n\nEUCI Newsletter\n\n\n\n\n\n\n\n\n\n\n\n\nOutage Management Systems\n\nand\n\nIEEE Guide for Electric Power Distribution Reliability Indices\n\n\n\n\nSeptember 10 - 12, 2007 / Atlanta, Georgia\n\n\n\nClick Here \n            To Download A Complete Conference Brochure\n Click Here For A Complete Listing\n              Of Upcoming Conferences\n \n\n\n\n\n\nOutage Management Systems\n\n\n \nAn Outage Management System (OMS) will certainly help utilities identify and restore outages sooner and more efficiently. But OMS can be so much more than just a tool for the utilities’ Operations Department. Customer Service, Planning, Asset Management, Engineering and Regulatory Affairs departments can all find significant value from information collected in the OMS database.\n \nThis EUCI conference will be a comprehensive educational experience on all things OMS. The first day will consist of an in-depth discussion on developing, building, maintaining and improving OMS. Facilitating this discussion will be managers of OMS systems at two major utilities, one small and one large. Through this discussion, attendees will have the opportunity to learn how to:\n\n Justify OMS purchases and upgrades\n Manage expectations of management and customers\n Improve existing processes and evaluate future needs\n Develop efficient communications between departments, customers, media and regulators\n Use OMS to measure and improve reliability\n Dispatch linemen and provide them necessary information in the field\n Measure customer service\n Manage assets through investment and component control\n Judge different approaches for large and small utilities\n Differ uses of OMS for routine vs. major outages\n\nTo further bridge the gap between the multiple departments involved in the different facets of these systems, specific breakout sessions have been designed to address the business benefits of moving data to useful information for customer service, IT and reliability engineers. The final morning will consist of a broad view of OMS in action. Several utilities will detail the use of OMS during major events, show the value of data quality and customer communications, systems efficiency and the value of OMS systems to a utility. At the close of each session, attendees will have an opportunity to visit with OMS vendors and interface directly with different products offered for use with OMS.\n \nIn conjunction with this conference, attendees may opt to attend an IEEE Reliability Indices course which will take place the morning September 10, 2007. A discount is available for attending both course and conference.\n \n\n\n\nIEEE Guide for Electric Power Distribution Reliability Indices September 10, 8 AM-2:45 PM \n\n\n \nThis EUCI course will provide each attendee with a deeper understanding of the methodologies set forth in the IEEE guide for calculating and comparing reliability indices. Further, the approach set forth in the guide to determine a utility's “major events” and “major event days” will be discussed in detail, as well as the regulatory acceptance of the guide throughout the United States.\n \nThis course is being offered as part of the EUCI Outage Management Conference and attendees will receive a discounted rate for attending both the course and conference.\n \n\n\nREGISTER\n\n\n\nClick Here \n                    To Download A Complete Conference Brochure\n Click Here For A Complete Listing\n                    Of Upcoming Conferences\n \n\n\n\n\n\n\nUpcoming Conferences \n\n\n \n \n  Carbon \n                            Sequestration Development & Finance Summit\n  Houston, TX\n July 11-13, 2007\n  Coal Combustion \n                            Products\n  Charlotte, NC\n July 16-17, 2007\n  T & D Asset \n                            Management\n  Charlotte, NC\n July 16-17, 2007\n  Wind Power \n                            Development Tutorial\n Denver, \n                            CO\n July 16-18, 2007\n  FERC Electric \n                            101\n Denver, \n                            CO\n July 17-18, 2007\n  Electric Power \n                            Planning\n San \n                            Francisco, CA\n July 23-24, 2007\n  NERC Reliability \n                            Standards\n San \n                            Francisco, CA\n July 23-24, 2007\n  Project Finance \n                            Tutorial\n New \n                            York, NY\n July 23-25, 2007\n  Diversity and \n                            Inclusion- Best Practices\n San \n                            Francisco, CA\n July 24-25, 2007\n  Energy \n                            Efficiency, Demand Response and Load Management\n San \n                            Francisco, CA\n July 24-27, 2007\n  Revenue \n                            Management\n San \n                            Francisco, CA\n July 26-27, 2007\n  New FERC Filing \n                            and FASB Fair Valuation Standards\n  Chicago, IL\n July 30-31, 2007\n  Power Delivery \n                            Planning: Managing the Distribution Planning Process to Maximize \n                            Value\n  Chicago, IL\n Aug 1-2, 2007\n  Electric Safety \n                            in Utilities\n  Washington, DC\n Aug 15-16, 2007\n  Protective \n                            Relaying\n  Washington, DC\n Aug 16-17, 2007\n\n\nPlease forward this invitation to \n                          colleagues who may benefit from attending.\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}