{"category": "ham", "to_address": "\"Beth Thomas\" <debian-laptop@lists.debian.org>", "from_address": "\"SatelliteSweeps\" <SatelliteSweeps@SatelliteSweeps.com>", "subject": "Beth, Your Password Change Has Been Processed", "body": "\n\nBeth-- \nThis is to confirm the password change you made to your SatelliteSweeps account. \n\nHere is your SatelliteSweeps member information: \n\nE-mail: debian-laptop@lists.debian.org\nNew Password: GRAY1SON \n\n\nStart earning free sweepstakes entries and Satellite Points right now!\nJust  click here to visit your Personal Page now. There you'll find lots of freebies and great deals and opportunities for hundreds of sweepstakes entries and Satellite Points!  Earn just 1,000 Satellite Points and a free Sirius or XM Satellite Radio is yours! OR get a free Sirius or XM Satellite Radio plus a free 6 month service subscription for just 2,500 Points or a free Sirius or XM Satellite Radio plus a free 12 month service subscription for just 3,000 Pod Points.\n\n\nClick on the link below to check out this great offer and get 1 entry in the daily drawing to win a free Satellite Radio.\n\nGet 36 Points just for requesting a free coupon to help relieve your sleeping disorder!  Insomnia can represent a variety of different things.  No matter what the cause there are solutions.  Get 36 Points just for requesting a free coupon to help relieve your sleeping disorder!\n\n Click Here For Your Free Sweepstakes Entry!\n\nClick on the link below to check out this great offer and get 1 entry in the daily drawing to win a free Satellite Radio.\n\nGet 28 Points when you try AmericanSingles for FREE!  AmericanSingles is here to help you find real people for real relationships, romance, friendships and more.  Why Join?  To jump-start your love life!  Plus, you will get 28 Points just for trying AmericanSingles for FREE!\n\n Click Here For Your Free Sweepstakes Entry!\n\nClick on the link below to check out this great offer and get 1 entry in the daily drawing to win a free Satellite Radio.\n\nGet 16 Points and $5 when you join InboxDollars for FREE and confirm your account!  InboxDollars is a site that pays its users to try products and services - many of which are free!  Plus, you will get 16 Points just for trying InboxDollars for FREE!\n\n Click Here For Your Free Sweepstakes Entry!\n\nGet another sweepstakes entry to win a free Satellite Radio by referring a friend to SatelliteSweeps.  Click here to refer a friend now. Your account will be automatically credited when your friend joins SatelliteSweeps.\n\nIf you have questions about your SatelliteSweeps account, please visit\n SatelliteSweeps Member Support for all the answers.\n\nThank you for being a member of SatelliteSweeps!\n\nYou have received this message as a member of SatelliteSweeps. If you no longer wish to receive email from us, click  here or write to us at 945 Clint Moore Road, Boca Raton, FL 33487.\n\n\n\n\n"}