{"category": "ham", "to_address": "debian-desktop@lists.debian.org", "from_address": "Sebastian Heinlein <debian@glatzor.de>", "subject": "Re: GNOME App Install", "body": "Am Mittwoch, den 27.06.2007, 16:05 -0300 schrieb Gustavo Franco:\n> On 6/25/07, Sebastian Heinlein  wrote:\n> > Am Sonntag, den 24.06.2007, 22:43 +0200 schrieb Julian Andres Klode:\n> > > > But there are still some open question that are worth a discussion. On\n> > > > of the main concepts of g-a-i is to make enabling additional and third\n> > > > party repositories as easy as possible. But do we want this in Debian?\n> > > I think we should do this.\n> > >\n> > > > The application data will be separated into three packages:\n> > > > app-install-data-debian-main, app-install-data-debian-contrib and\n> > > > app-install-data-non-free.\n> > >\n> > > the number of .desktop files in contrib and non-free is too low\n> >\n> > Actually there are people who don't want any references to non-free\n> > software on their system. I would like to still support this.\n> \n> Agreed.\n> \n> While we're at it, would be good deuglify and integrate tasksel\n> functionality into g-a-i. Upstream stuff I know, but I don't think\n> that will be too hard if you want to do more than packaging. I can\n> give guidance if you're interested.\n\nLuckily I am an upstream author and also plan to add some Debian only\nfeatures, like suggestions by combining popcon and detags data. As\nmentioned in a previous mail before I included some distribution\nspecific hooks.\n\nBut I am not sure about tasksel. It doesn't operate on the abstraction\nlevel of applications. Since tasksel doesn't allow to uninstall all\npackages of a task (but perhaps this could be implemented by using apt's\nnew automatically installed status) it belongs more into the installer.\nThere was support for tasksel in Synaptic some time ago, that is\ncurrently disabled. But the could should still be there.\n\nCheers,\n\nSebastian\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}