{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Sunday Morning <cbsnews___sunday_morning_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "\"Sunday Morning\" Child soldiers", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nJune 3, 2007\n \nEvery year \n      thousands of children die in wars all over the world. Most are innocent \n      bystanders, but a growing number of them are soldiers, impressed into \n      service by guerrilla and government armies alike. Ishmael Beah was one of \n      those child soldiers and is the author of a best-selling book that \n      describes his life as a fighter in Sierra \n      Leone’s civil war. He speaks with Harry \n      Smith for our Sunday Morning Cover Story. \n      \n \nThis year \n      marks yet another milestone in the lives of baby boomers… It was 40 years \n      ago, that’s right, 40…when a radical movement was born in San Francisco’s \n      Haight- Ashbury district which made the word “hippie” a part of our \n      vernacular -- and changed our world. Correspondent John Blackstone \n      remembers the “Summer of Love.” \n \nOur technology \n      correspondent Daniel Sieberg tells us that the spirit of experimentation \n      that made the Bay area famous in the 1960s is alive and well – as he \n      visits the annual “Maker Faire.” It’s a place where artists and inventors \n      from all over the country are free to “think outside the box” … displaying \n      an array of products that boggle the imagination.  \n \nTalk radio is \n      informative, controversial and -- as many stations across the country have \n      found out -- a real crowd pleaser. And actor Liev Schreiber is pleasing \n      crowds on Broadway as well in the play Talk Radio. Tracy Smith profiles \n      the man many are calling the best actor of his generation.  \n \nFinally, Bill \n      Geist finds out what it means to be a real celebrity as he spends the \n      day with the most revered trophy in professional sports… pro hockey’s \n      Stanley Cup.\n \nThose stories, and more, this Sunday \n      Morning.  Listen \n      for the trumpet.\n \n\n\n\nCharles OsgoodSundays@cbsnews.com\n\n\n\n\n\nAdvertisement\n\n\n\nTo \nunsubscribe or change your subscription options, click here.Contact: \nEmail Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n10019Help | Advertise | Terms of Service | Privacy Statement©MMVI, CBS Worldwide Inc, All Rights \nReserved. \n"}