{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Automotive Newsletter May 22, 2007", "body": "\nhowstuffworks® | automotive May 22, 2007\nRSS\n  \n How Muscle Cars Work  Muscle cars thundered across the landscape in the 1960s and\nearly 1970s -- loud, proud and uniquely American. From the Pontiac GTO to the\nDodge Challenger, these fast, powerful cars created their own culture. Learn\nall about the golden age of muscle cars and how they evolved into today's road\nrockets.\nAlso at HowStuffWorks\n \n\nAre we on the brink of the flying car?\n - A flying-car-style rescue vehicle called X-Hawk could be on\nthe market as early as 2012. If it's successful, it could be the\nproof-of-concept that opens the doors to other flying cars still in the\ndevelopment stage. Learn more.\n \n\nHow to Buy a Fuel-efficient Car\n- Buying a car with fuel economy in mind doesn't require you\nto own a vehicle you don't want. It means looking for the features you want\nwith the best available fuel economy. Learn more about how to buy a fuel-efficient\ncar.\n \n\nHow Torque Converters Work - In a car with an automatic transmission, an amazing device\ncalled a torque converter lets the engine turn while the wheels and gears in\nthe transmission come to a stop. Learn how a torque converter works and why\nit's needed.\n   \nThis Week's Video\n \n\nReview of 2008 Dodge Viper - After a 2007 model-year hiatus, a more powerful Dodge Viper\narrives as an early 2008 model. This high-performance two-seat sports car comes\nas a coupe or convertible, in a new array of colors, including Venom Red and\nSnakeskin Green. Find out more in this HowStuffWorks video.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved "}