{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: License concerns regarding package lft", "body": "Terry Hancock  wrote:\n> No, what I *said* is that \"tools\" are not \"materials\", which they are\n> not -- at least not unless you use them as such. If you build a house\n> out of hammers, *then* the hammers are \"materials\", otherwise, they are\n> \"tools\".\n\nSo, to be clear: you would claim that if one says 'this house is made using\nthese materials' then the tools are not included in 'materials'?\n\nWould you expect an art *materials* catalogue to include easels, brushes,\nknives and other things used to make the art but not included in it?\n\nHere are the top three results of a web search for art materials:\nhttp://www.dickblick.com/\nhttp://www.homecrafts.co.uk/html/categories.asp?cat1=3\nhttp://www.artdiscount.co.uk/\n\n> [...] foregone conclusion in a license text that definitions are\n> relative to the work being licensed! When a license says \"derivative\",\n> we all understand without being told that \"derivative of the work being\n> licensed\" is meant, and not \"derivative of some other, unrelated work\".\n\nI don't see the relevance of stating the obvious here.\n\n> Hence, when we say \"materials\", we mean \"used AS materials\", not \"things\n> that could in principle be used as materials but were in fact used as\n> tools\".\n\nBut they are used as materials IMO.  Returning to the house-building\nexample, I don't see hammers as consumed entirely by my construction,\nso I wouldn't expect to see them on my bill of materials, but they are\nmaterials used in the construction, so I'd expect them to be available\nfrom a building materials supplier.\n\n[...]\n> The strawman you are attempting to bait me with [...]\n\nPlease, get over this.  I'm not baiting anyone with any scarecrow.\nI'm trying to understand how it is possible to claim that compilers\ndon't fit the meaning of materials there - in fact, unlike most hammers,\nmost compilers even leave part of themselves in the construction - and\nwhether this is based on a misunderstanding like the one posted about\ncopyleft and upstream contributions recently.\n\nRegards,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}