{"category": "spam", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "\" Rushing\" <piizsxgd@rqyszgobqbnybk.com>", "subject": "How would you like to earn $200-$400 / day, every day?", "body": "\nEver heard of the google ca$h machine ?\n\nhttp://www.promote-biz.net/google/\n\n\"How would you like an extra\n$500 - $1000 a week with 15 minutes of your time ?\"\n\nI'm not pulling your leg!\n\nMake money 15 minutes from now!\n\nDiscover the secrets of the Google Ca$h Machine!\nNew foolproof methods revolutionize the power of Google's AdSense -never seen before!-\n\nBRAND NEW FOR 2007!\n\nHi, my name is Sebastian Foss. Are you like me? Trying to make money on the Internet but only\nexperiencing very few to no satisfying results ?\nAfter all, how many times a day are you BOMBARDED with some lame \"get-rich-quick\" scheme on the Internet?\n\nhttp://www.promote-biz.net/google/\n\nWell, I've got great news for you.\n\nOne day I had an idea. An amazing idea actually.\n\nI have found a foolproof method how anyone can easily\nmake an extra $500 or even $1.000 every week with 15 minutes of\ntheir time and create a substantial monthly income.\nThis method has never been released to the public before.\nVery few, if anyone has implemented this. I have decided to share my idea with you.\nThe only thing I ask is you do not share this information with anyone.\n\nThis well guarded Method hasn't been revealed until now\n\nWhy should I release this information you may ask ?\nAren't you arming your competition ?\n\nhttp://www.promote-biz.net/google/\n\nI have been so disappointed by the lack of kept promises that all those make money programs made.\nFor many years I have spent a fortune on MLMs, get-rich-quick, paid to read email,\nnewspaper & stuff envelope scams that I finally want to make and end to it. I know how you feel.\nThe Google Ca$h Machine will bring you a steady flow of money 15 minutes from NOW or your money back!\nI personally guarantee that if you do not make money using my method I will refund every single dime of your order.\n\nNow before I get to deep into the details let me tell you what the\nGoogle Ca$h Machine ISN'T.\n\nIt is NOT a promote my affiliate program to make money!\nIt is NOT a NOT A Get-Rich Quick Scheme!\nIt is NOT a Face To Face Selling program of Any Kind!\nIt is NOT a Trial Offer to sign up for!\nIt is NOT some garbage product that refers you to purchase other garbage products.\nIt is NOT a MLM, a Pyramid Scheme, Gifting or anything else like that.\nIt is NOT like anything you have ever seen.\n\nYOU DO NOT EVEN NEED TO SELL ANYTHING!\n\n \n\nhttp://www.promote-biz.net/google/\n\n \n\n \n\nunsubscribe by sending email:\nwebmaster@promote-biz.net\n\n\n"}