{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle Zombie<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, I see riches in your immediate future, and you've already taken the first steps...", "body": "\n\nMemo, I see riches in your immediate future, and you've already taken the first steps...\n\n\n\n\n\n\n\n\n\n\n\n\n    Memo, a life rich in Happiness, Love and Wealth is yoursfor the taking\n\nDear Memo,\n    Get ready to start living the life you've always dreamed of!  In fact, I guarantee you are just a few simple steps away from better health, more loving relationships and a wealth of good fortune.  And Memo, you've actually taken the very first steps already!\n    Have you ever noticed when your home is in disarray and last night's dishes are piled high in the sink, you feel uneasy, agitated, frustrated?  And when you clean your home and surround yourself with only the things you love, your feelings are much different?  You feel relaxed, happy and energized.  Well, Memo, this may surprise you, but at these moments you are actually practicing the ancient art of Feng Shui!\n    Perhaps you've heard about Feng Shui (pronounced fung shway) on TV... or read about how celebrities like Robert Redford, Demi Moore and John Travolta have used it to better their lives.\n    But believe me, Memo, what you've experienced, ...the occasional feelings of relaxation and energy is only the tip of the iceberg...because according to Feng Shui, by simply removing unwanted objects or adding certain elements in your home, such as a plant or mirror, things are bound to happen in a more dramatic way.\n\n\n\n    For instance -- you could receive a much needed sum of cash out of the blue or get an unexpected phone call with a fantastic job offer or see a nagging health problem simply disappear for good.\n    You will see, once you have all the secrets of Feng Shui at your fingertips, you can create an incredible energy flow that is so powerful that money, love and happiness will be drawn directly to you.  And amazing successes can be yours -- in just weeks -- without your ever having to leave your home.\n    The effects of Feng Shui are so powerful and immediate that it comes as no surprise that it is being used by multinational banks, large retail chains and housing developers, as well as in doctors' offices.  Feng Shui \"believers\" also include famous personalities such as Prince Charles, Donald Trump and \"E.R.\" creator Michael Crichton.\n    I could go on and on about all the people I know who have benefited from the power of Feng Shui.  But I think it would be even better to directly introduce you to the true master of Feng Shui, Benjamin Huntington, who showed me how easy it is to use the power of this ancient art to completely change your life!\n    I know you'll be amazed at how easy it is to get all the money, happiness and success you've ever dreamed of, so pay close attention to what Benjamin has to tell you. \n\n\n\n\n\n\nDear Memo, \n        I am so delighted Rochelle has brought us together.  Before I go into the details about the miraculous secrets of Feng Shui, please let me tell you a bit about myself. My name is Benjamin Huntington.  I am English by birth, but my father is American.  I studied architecture and graduated with honors from Kingston University in England.       Although I did quite well as a partner at an architectural firm in London, I wasn't satisfied. Something inside was telling me I was on the wrong path.  Then I became acquainted with Sarah Shurety, a Master of the ancient art of Feng Shui. What I began learning about Feng Shui and about the energy currents that surround and affect us all, changed my life. From then on, I realized my true calling was to become a Feng Shui Master. \n        Now, after many years of study, I've acquired the skills and reputation as an expert Feng Shui Professor.  I travel the world -- Paris, Spain, Greece, San Diego, New York -- and I'm grateful to say wherever I go, my clients become wealthier and have more personal success in their lives.  And to give you a taste of what may be in store for you, thanks to Feng Shui, let two of my clients tell you about their personal experiences:\n\n        \"Benjamin is superb!  He is very intuitive, sharp and right on -- no wasting time.  I followed his advice and the doors blew open!  Money, helpful people, life flowing again!  He helped me to get clear and clarity leads to peace and harmony -- thank you!\"\n\n--H.H. New York, NY\n        \"Benjamin Huntington has provided Feng Shui consulting services at my business offices and my home. The results have been dramatic in both places.  At work, although I was doing well, I wasn't getting many new clients.  So I implemented Benjamin's recommendations (only half of them, by the way).  I made a simple alteration to the entrance and straightened and cleaned some bookcases and files.  Now, I'm too busy fulfilling all the new orders that keep coming in to do the rest of what Benjamin suggested -- but believe me I'll get to it soon!\" \n        \"My experience with my home was equally as dramatic. My wife and I decided to sell our home.  We implemented Benjamin's Feng Shui recommendations.  We were astonished that our house sold for the asking price BEFORE it was even on the market.  Thanks Benjamin!\"\n\n--D.P., New Jersey\n        Memo, I've seen real success in my clients' lives as well as my own, but now I have a different goal.  My true calling is to help everyone -- not just celebrities or wealthy businessmen -- but people like you, who desire and deserve success and happiness, but who may not have thousands of dollars to spend.\n        That's why I want to pass on my extensive knowledge as a Feng Shui Professor to you -- at a very special low price -- in my new guide, \nFENG SHUI SOLUTIONS\n        Memo, FENG SHUI SOLUTIONS was written for you, with your needs in mind.  In it, you'll find answers to all your current problems and solutions that will truly change your life!\n        The fact is, Memo, your environment has a major effect on your state of mind and being.  And you can easily improve the quality of your life by paying attention to the subtle influences of your environment.\n        FENG SHUI SOLUTIONS will show you a new way to understand, and re-organize your living and work spaces so that they will welcome and keep Prosperity, Love, Health and Happiness right by your side!\nTHE NINE \"POWER AREAS\" OF YOUR HOME\n        In FENG SHUI SOLUTIONS, you'll learn how your home has in fact nine \"power areas,\" each corresponding to a particular aspect of your life, including Your Prosperity Area, which can help you triple your income... buy a new house... or put your debts permanently behind you!  Your Health Area, which can help you feel good, energetic and can even cure chronic illness!  Your Relationships Area, which can bring you true love... or can promote happy, harmonious relationships with your loved ones that will last a lifetime!\n        Once you discover where these power areas are located in your home you can start activating them with Feng Shui to bring the changes you want.  And what's more, you will have the great satisfaction of knowing that by using Feng Shui, you can also help your family and friends realize all their dreams!\n        At this point, you may be thinking: If Feng Shui can really make all this happen, won't it take a lot of money and effort?  My friend, this is what I tell my clients...\n\n\n\n\nIf you can't pay your bills, simply place a plant in this area of your home -- and watch your wealth grow along with it!\n\n\nIf the spice has gone out of your marriage, arrange these inexpensive pretty red objects in a particular corner of one room in your home and ignite the passion and love again!\n\n\nIf you have a hard time meeting people, burn this aromatic oil in your living room and you'll attract friends wherever you go!\n\n\nIf your spouse hasn't been able to find work for over a year, place this special light in your home's Work Power Center and watch the job offers pour in!        So you see, Feng Shui costs practically nothing and is so simple!  And what's more, the effects of Feng Shui will be powerful and immediate whether you believe in it or not. \n        Feng Shui is magical, yes, but it's down-to-earth, too. In fact, ancient Feng Shui tools such as light, colors, plants and scents have now been scientifically proven to work.  Many recent studies have confirmed what Feng Shui masters have known for centuries: A harmonious environment is vital to your health, your peace of mind and, ultimately, your success.\n        Now you can learn all the secrets that were previously available only to a privileged few.  And use this ancient knowledge to make a real difference in your own life immediately!  Create harmony, balance and prosperity for yourself and your loved ones... easily and quickly... thanks to FENG SHUI SOLUTIONS.\n        Best of all, FENG SHUI SOLUTIONS is tailor-made to your needs and desires.  It is like having me as your personal Feng Shui Consultant right by your side, in your very own home or work space.  I will show you step-by-step all the potential for wealth, happiness and harmony that's in your home right this very second. \n        In FENG SHUI SOLUTIONS, you will discover how you can...\n\nLocate the Wealth, Relationships, Family and Work areas of your home and reap the full measure of their magic.  For example, how can moving a desk bring money into your life?\nDraw happiness and prosperity to your side by performing powerful Feng Shui practices.  How can a Clearing Ritual banish negative energy from your life?\nDiscover the kind of luck that lies dormant in your home with Lucky Numbers. For instance, how can living in a home with the number 3 in the address help attract new friends?\nDispel any negative influences that have been plaguing your life with fast-acting solutions. For example, why will a wind chime put an end to fights with a neighbor?\nChange your outlook and lift your mood with the magic of colors.  Which colors should you use to calm a hyperactive child?\nTransform your life into what you've always wanted it to be by using the power of shapes.  For instance, what will placing circular objects in your Prosperity Area do for your bank account?\nCreate harmony and balance in your living and working spaces by using the basic tools of Feng Shui.  For instance, how can a mirror hung outside your bathroom door prevent you from losing money?\nFind out about your Personal Auspicious Directions to point you in the direction of fame, fortune and happiness. Which way should you face when making an important decision? \n...and much, much more!\n        My friend, I want so much for you to benefit from these incredible secrets that I am offering you something special... \nTwo fabulous FREE treasures to welcome youto the world of Feng Shui\nYour Magical Ba Gua\n\n\n\n\n        YES, it's true, Memo!  Your First Gift is the ancient Chinese device that will help you locate and energize every ounce of Love, Prosperity and Happiness contained in your home in seconds -- your very own Ba Gua. \n        Simply put, the BA GUA is a kind of Feng Shui map to riches.  As you can see from the picture of this powerful gift, the Ba Gua is divided into nine areas or \"Gua.\"  Each Gua represents a certain part of your life:  Prosperity, Future, Relationships, Creativity, Helpful People, Work, Knowledge, Family and Health. \n        You'll use the Ba Gua map to find out which areas of your home relate to the different areas of your life.  This way you will always know exactly what to do to bring luck, success and happiness right to your side!\nYour Ba Gua Guide, \"Unlocking the Secrets of The Ba Gua\"\n\n\n\n        Your Second Gift is a simple, easy-to-follow instruction guide called \"Unlocking the Secrets of the Ba Gua.\"  With this handy reference guide, you will be using the Ba Gua like a Feng Shui expert in no time so that you are setting up the proper conditions for positive change in your life!\n        UNLOCKING THE SECRETS OF THE BA GUA is your easy to understand guidebook that clearly highlights the essential steps in mastering the Ba Gua, allowing you to tap into the ancient wisdom of Feng Shui to bring you money, love and happiness. \n        Equipped with these two essential tools, your ability to attract and direct the power of Feng Shui will be unstoppable!  These FREE gifts are absolutely yours, with FENG SHUI SOLUTIONS.\nUNLOCK YOUR PATH TO LOVE, LUCK & WEALTH WITH FENG SHUI SOLUTIONS...\n        FENG SHUI SOLUTIONS is like having me right by your side, as your personal Feng Shui Consultant... whenever you need me!  I will show you step-by-step how to arrange your surroundings to be in harmony with Feng Shui principles so that the energy of your home or office works for you, not against you.  Feng Shui Solutions will attract all the positive energy directly to you, bringing happiness, money and success to every area of your life!\nAn exceptional value especially for you\n        To make it as easy as possible for you to discover the power of this ancient art to bring good fortune into your life, you can review and use \"Feng Shui Solutions\" FREE and without committing to anything.  Then, only if you are completely satisfied, after 30 days your card will be billed at a special discount I have made available only to you and a select list of Rochelle's friends. \n        As I said before, Memo, I want to share the secrets and benefits of Feng Shui with you so you can transform your life.  Normally, I charge clients hundreds of dollars to analyze their homes or offices.  But, because you are a friend of Rochelle's, I want you to have my advice in FENG SHUI SOLUTIONS for a very low special price of just $14.95.  And this is even at a $5.00 savings for you since the regular low price is $19.95.\n        And remember, this isn't just a \"quick fix.\" The guidance you will find in FENG SHUI SOLUTIONS will help bring you a lifetime of Luck, Love and Happiness.\n        I'm doing this, Memo, because I have had so much success and good fortune in my life thanks to Feng Shui that I want to give back... Nothing would give me more satisfaction than to see you turn your life around, and I'm certain Feng Shui will do just that.\n        In fact, I am so sure that FENG SHUI SOLUTIONS can help you create the kind of life for yourself that you've always dreamed of living, I'll even offer you\nMy Unconditional Lifetime Money-back Guarantee:\n\n\n\n\n        Try FENG SHUI SOLUTIONS for as long as you like. Experience the incredible results for yourself! If, at any time, for any reason, your life has not changed significantly for the better, simply jot me a note, and I will promptly refund your payment in full, immediately... with no explanation necessary.  No matter what, your two valuable free gifts are yours to keep.\n\n\n\n        Let me take this opportunity to bestow upon you the three Great Blessings of \"Health, Happiness and Prosperity,\" Memo. It is now up to you to take control of your Destiny.  All you have to do is just click the button below!\n        Sincerely,                Professor Benjamin Huntington\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may click on the link below. But by doing this, Memo, it means that I will not be able to send you exclusive opportunities for offers and discounts or important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford CT 06460-3400.\n\n"}