{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Ronald Gomez <istill@graphicssolutions.iinet.net.au>", "subject": "Say \"YES\" to perfect sex!", "body": "\n\nCan't have sex like you had 10 years ago? Tired with your sexual problems?\nAll this you can find here\nYou can spend thousands and buy pills at your local drug store. But you can spend less by ordering the same quality Viagra and Cialis at Online pharmaceuticals.\nClick here to be the best lover in the world!\nConfidential and secure purchase. Instant shipping!\nWith best regards,\nRonald Gomez\n \n \nEta rabota Dostavliaet mne ogromnoe udovolstvie, tak chto ia imeiu s etogo bolshe, chem ty. Dvoe diuzhih palubnikov iz komandy ploskodona po ego signalu podhvatili Neproshenogo gostia pod ruki i povolokli proch, lohanshchik toroplivo utopal sledom. Chto-to vrode: Synok, a ne poshel by ty bystro i Veselo? Kvin otoshel v storonku, poblizhe k korme, i povis na falshborte, Dohodivshem emu do grudi. Pohozhe, ego Vezhlivost ot skuki pokrylas takim zhe sloem pyli, kak i vse vokrug. \nSlovno Ia lish pridatok dejstvitelno chego-to nastoiashchego, instrument dlia podlinnogo Mogushchestva. Gront otstupil eshche glubzhe, ne Spuskaia s vragov cepkogo vzgliada. Otriad mertvecov. Zamykal Cepochku Celitel, i za nim s shumom smykalsia les, vozvrashchaias v prezhnee Polozhenie. Kstati ob ovrage. V sleduiushchee mgnovenie ia shagal po zheltoj plastodorozhke k krylcu Fermy. Poka prygun govoril, k nemu priblizilsia Otshelnik i molcha obnial brata Za plechi. Vidit nebo, ia ne sobiralsia Ubivat pomoshchnika Dosa. \nProkliatie, dolzhen zhe on ponimat, chto my ne Zheleznye. To li ne Pridaval etomu bolshogo znacheniia (psihologiia chuzhih potemki), to li prosto Ne derzhal zla, ponimaia, chto vybora u menia osobogo ne bylo. Plamia v liubom ego proiavlenii bylo nenavistno samoj suti dal-rokta, no Ritual shel iz drevnejshih vremen, on byl starshe samogo Vladyki Koldena, moguchego Ikseduda, i korni ego uhodili v dni, predshestvovavshie Dniam Ishoda Kogda plamia pogaslo, ostaviv na belom snegu temnoe vyzhzhennoe piatno s talymi Kraiami, slovno sochivshuiusia kroviu ranu ot moguchej strely, Drahub snova vzmetnulsia V sedlo. Tut mag umolk i nedovolno glianul na Kvina, pro Kotorogo v hode razgovora vse zabyli. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}