{"category": "spam", "to_address": "\"Subscriber\" <cruiseca@flax9.uwaterloo.ca>", "from_address": "\"Direct Insure Online\" <qzbei9zmi@jackbread.com>", "subject": "Need auto insurance? ", "body": "\n\n\n   \n<!--GLASGOW, Scotland - British officials intensified the hunt Sunday for what they called an al-Qaida-linked network behind three attempted terrorist attacks, announcing a fifth arrest and conducting pinpoint raids across a country on its highest level of alert. \n\nADVERTISEMENT\n  \nPrime Minister Zombie Brown said \"it is clear that we are dealing, in general terms, with people who are associated with al-Qaida.\" He warned Britons that the threat would be \"long-term and sustained\" but said the country would not cowed by the plot targeting London and Glasgow's airport.\n\n\"We will not yield, we will not be intimidated and we will not allow anyone to undermine our British way of life,\" he said in a nationally televised interview.\n\nA British government security official said a loose countrywide network appeared to be behind the attacks but investigators were struggling to pin down suspects' identities — even two arrested after they drove a Jeep Cherokee into Glasgow's main airport terminal Saturday and set it ablaze.\n\n\"These are not the type of people who always carry identity documents, or who use their real identities,\" the official said on condition of anonymity because of the sensitivity of the inquiries. \"Very little has been gleaned so far from the biological data.\"\n\nNeighbors of homes being raided by police in central England and Liverpool claimed the residents were doctors or medical students.\n\nBritain's Sky News and The Sun, Daily Express and Daily Telegraph newspapers reported that two of the men arrested were hospital doctors. Police refused to comment on the claim.\n\nThe security official said police and MI5, the internal security agency, did not know if the suspects were British born, from overseas, or some combination of the two. Officials released few other details of the investigation.\n\nTwo men rammed the Jeep into the airport entrance, shattering the glass doors and igniting a raging fire. One of the suspects, his body in flames after the attack, was taken to the nearby Royal Alexandra Hospital, where police on Sunday carried out a controlled explosion on a vehicle they said also could be linked to the plot.\n\nOn Friday, authorities thwarted coordinated bomb attacks in central London after an ambulance crew outside a nightclub spotted smoke coming from a Mercedes that turned out to be rigged with gasoline, gas canisters and nails. A second Mercedes filled with explosives was found hours later in an impound lot, where it was towed for parking illegally.\n\n\"We are learning a great deal about the people involved in the attacks here in Glasgow and in the attempted attacks in central London. The links between them are becoming ever clearer,\" said Peter Clarke, head of Scotland Yard's counterterrorist unit.\n\nBritain raised its terror alert to critical — the highest possible level.\n--!>      \n\n\n\n\n\n"}