{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Farmer A. Lesley\" <chdk@sify.com>", "subject": "Back to the way Africa always has been and always will be.", "body": "ERMX Goes Wild! Wallst.net Does Feature Interview!\n\nEntreMetrix Inc. (ERMX)\n$0.185 (12:19EST) UP 15.6%\n\nWallst.net releases a feature audio interview on ERMX via their site. Go\nread the news and listen to the interview and get on ERMX it is going\nthrough the roof!\n\nclose window  My Content My Tags My Comments My Watchlist My Saved\nSearches My Personal Page Recommendations Get Personalized\nRecommendations. you indulge for greener pastures no matter what it\ntakes, for there is no hope in a demoralised africa. Remove the boarders\nand pool the vast resources together, and African will transform from a\ncontinent of internal conflict to a central unified country.\n\nIn the same avenues people talk about their communities needs, what\ncould make most impact to improve their lives. BBC correspondent in\nJohannesburg Peter Biles says the strike has been hugely disruptive and\nmany workers are beginning to feel the impact caused by the loss of\nwages. Libya's Colonel Muammar Gaddafi is championing the idea, but many\nAfrican leaders do not support his initiative. As the local currency\nbecomes less valuable, the cost of importing raw materials becomes more\nexpensive in relative terms for Zimbabwean firms.\nIndustry and International Trade Minister Obert Mpofu told the AFP news\nagency the price rises were \"unscrupulous\".\n\nIt said courts should also give equal weight to the evidence of both men\nand women. I asked for the contact number of the person who had sent me\nto Lebanon. This follows a fierce battle for control of the party\nbetween two rival camps, which culminated in a leadership coup last\nyear. The Pfizer experiment was cited by many as a reason for the mass\nrejection of polio vaccinations in many parts of northern Nigeria in\nrecent years.\nThis year the focus is on the idea of a pan-African government.\n\nIn many African States including my beloved country, Tanzania, there are\nso many similar programmes being set but not well maintained and\nimplemented. Magistrate Arcade Niyongabo has told the BBC many of them\nthink they are seeking asylum in Europe, but end up working as\ngardeners, maids or prostitutes in Lebanon.\n\nParliament is to debate the Indigenisation and Economic Empowerment Bill\nshortly. And most surprising of all, the African Union, the region's\ncurrent peacekeepers, declined to attend. All that is in the past now,i\nam doing just fine here in Nigeria.\n\nWe will be featuring many in themed picture galleries running in the\nnext few months - just send to the email address below putting AFRICA\nPICS in the headline field.\n\n\"Iranian Quds Force is using Hezbollah as a proxy. The Victoria Falls\nare known as one of the seven wonders of the world At Thursday's\ngathering tourism ministers and environmental experts are hammering out\na joint conservation policy. Economists warn that the measures are\nlikely to lead to shortages, as companies either stop producing because\nthey cannot afford to, or sell their goods on the black market.\n\nIt is hoped the park will bring in tourists to such attractions as the\nVictoria Falls, Okavango swamps, Chobe National Park and Caprivi Strip.\nThe other two were Yemenis, police said, speaking on condition of\nanonymity because they were not authorized to speak to the media.\n\nHowever, Mr Kenyatta, the son of Kenya's first president, has not handed\nin his nomination papers to represent the opposition alliance. The\npractice is common among Muslim as well as Christian families in Egypt\nand other African countries,  but is rare in the Arab world.\n\n\"The United States will continue to argue that there must be\nconsequences for Sudan if it does not live up to the obligations that it\nhas undertaken.\n\nRhodesia had a thriving economy under British rule. I am saying this\nbecause their is no free media in liberia,the media appear that they are\nfree but they are not. If a lasting peace deal is to be made, Khartoum\nwill have to convince whoever they negotiate with that they are\ngenuinely committed to sharing wealth and power. The African continent\nis full of crisis after crisis, and so much needs to be done.\n\nRival commanders with widely ranging aspirations now control most of\nDarfur's arid countryside.\n\n"}