{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@flax9.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "SatCon Photovoltaic Inverters Installed at Largest US Commercial Site", "body": "\n\n\n\n\n\n\n\n\nSatCon Photovoltaic Inverters Installed at Largest US Commercial Site\n\nBOSTON, Jun 27, 2007 (BUSINESS WIRE) --  SatCon Technology Corporation(R) (Nasdaq CM: SATC), a developer of power management and system architecture solutions for the alternative energy and distributed power markets today announced that its PowerGate(R) commercial grade inverters have been installed as an integral part of Google's corporate headquarters in Mountain View, California. The 1.6MW system is the largest commercial photovoltaic system in the United States. Sharp provided 9,212 208-watt modules for the project, which was designed and installed by EI Solutions of San Rafael, California. SatCon's PowerGate(R) high-efficiency inverters are a critical component of the system, converting the sun's energy produced by the photovoltaic panels into alternating current electricity that is used to power the facility. To date, SatCon has shipped more than 50 MW of its industry leading commercial grade inverters in North America. The new system will spare the air nearly 3,637,627 lbs/year of harmful greenhouse gases annually. Over the next 30 years, the carbon dioxide reduction will be equivalent to eliminating over 128 million car driving miles. About PowerGate(TM) Inverters PowerGate(TM) inverters are designed for use with alternative energy power systems to generate distributed electrical power. Distributed, alternative energy power generation is a growing trend toward the production of clean, reliable power at the point of use. Alternative energy systems can alleviate congestion on highly loaded utility electrical distribution networks and offer an alternative to power line extensions in remote areas. Many alternative energy power systems require high-power, high-reliability inverters and controls to convert the power generated to useable AC power compatible with the electric power grid. About SatCon Technology Corporation SatCon Technology Corporation is a developer and manufacturer of electronics and generators/motors for the Renewable Energy, Hybrid-Electric Vehicle, Grid Support, High Reliability Electronics and Advanced Power Technology markets. For further information, please visit the SatCon website at www.satcon.com. (SATC-G) Statements made in this document that are not historical facts or which apply prospectively are forward-looking statements that involve risks and uncertainties. These forward-looking statements are identified by the use of terms and phrases such as \"will,\" \"intends,\" \"believes,\" \"expects,\" \"plans,\" \"anticipates\" and similar expressions. Investors should not rely on forward looking statements because they are subject to a variety of risks and uncertainties and other factors that could cause actual results to differ materially from the Company's expectation. Additional information concerning risk factors is contained from time to time in the Company's SEC filings. The Company expressly disclaims any obligation to update the information contained in this release. SOURCE: SatCon Technology Corporation SatCon Technology Corporation(R)\nDan Gladkowski, 617-897-2411\nVP, Administration\n\n\n\n\n\n\n\n\n\n\n You are subscribed to SatCon Technology Corporation Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n SatCon Technology Corporation \n 27 Drydock Ave. 6th Floor, South Boston, MA 02127\n Service provided by Shareholder.com \n\n\n\n\n\n"}