{"category": "ham", "to_address": "jiho <jo.irisson@gmail.com>", "from_address": "\"hadley wickham\" <h.wickham@gmail.com>", "subject": "Re: [R] quartz() on MAC OSX", "body": "On 5/21/07, jiho  wrote:\n> On 2007-May-21  , at 08:14 , Rolf Turner wrote:\n>\n> > I am (desperately) trying to get used to using a Mac here at my new\n> > location. (Why *anyone* would ever use anything other than Linux,\n> > except\n> > under duress as I am, totally escapes me, but that's another story.)\n> >\n>\n> Oh that's harsh, Mac OS X is quite a good citizen and probably one of\n> the best Unices out there. It is true that it has \"its own way of\n> doing things\" and that's actually why Mac users love their Mac (there\n> is kind of a Mac way of life ;) ). If you try to fight against it,\n> you'll loose, but if you try to do things the Mac way, it ends up\n> being a very efficient desktop (there are several things I know I\n> would really miss if I had to switch back to Linux: smart folders,\n> nice antialiased graphics, very good font management etc.)\n>\n>\n> > Fortunately much of the Mac OSX is actually Unix, so a civilized\n> > person can\n> > manage to carry on ... But there are some things.  (Like this\n> >  > deleted> mailer ... But that's another story.)\n> >\n>\n> If you want OS X to be really unix like, use DarwinPorts (or Fink).\n> But you need to install additional software and be able to sudo.\n>\n> OK back to R:\n>\n>\n> > When I ``open'' R using the icon on the ``dock'' several things are\n> > unsatisfactory; like I can't clear the screen using system\n> > (\"clear\"), nor can\n> > I use vi syntax in command line editing.  When I start R from the\n> > command\n> > line (as a civilized person would do) these unsatisfactory\n> > circumstances go\n> > away, but then a new one rears its ugly head:  I can't plot!!!  If\n> > I try a\n> > plot without explicitly opening a plotting device, a postscript\n> > device with\n> > file name ``Rplots.ps'' is silently opened.  If I try opening a\n> > device with\n> > quartz() to get an on-screen plot, I get a warning message\n> >\n> > quartz() device interactivity reduced without an event loop manager\n> > in:\n> > quartz()\n> >\n> > And a little coloured wheel spins round and round and the quartz()\n> > window\n> > that opens hides underneath the terminal window and appears to be\n> > frozen to\n> > the spot.\n> >\n> > Apparently ``it'' wants .Platform$GUI to be equal to \"AQUA\", but it is\n> > (under the circumstances) \"X11\".\n> >\n>\n> Yes, this is a known limitation: quartz() has to be started from RGUI\n> (or JGR also I think) and can't be started from the terminal without\n> some tinkering:\n> https://stat.ethz.ch/pipermail/r-sig-mac/2004-September/001269.html\n\nNot any more!  Check out the CarbonEL package by Simon Urbanek - this\nhas come up a few times on R-SIG-MAC.\n\nHadley\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}