{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nSaturday, 21 April, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nLive - Man Utd v Middlesbrough\nTop-of-the-table Man Utd aim to restore their six-point lead in the Premiership against Middlesbrough.\n\n\n\n \nWatford 1-1 Man City\nWatford are relegated from the Premiership after failing to beat Manchester City at Vicarage Road.\n\n\n\n \nCharlton 1-1 Sheff Utd\nJonathan Stead scores a priceless equaliser for Sheffield United which keeps Charlton in the bottom three.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nScot Yates makes Shanghai surge\nScotland's Simon Yates fires a 64 to surge into a tie for third after three rounds of the Asian Open in Shanghai.\n\n\n\n \nAsian Open leaderboard\nLatest scores from the third round of the BMW Asian Open in Shanghai.\n\n\n\n \nCalcavecchia shines in Louisiana\nMark Calcavecchia takes a one-shot lead after the second round of the New Orleans Classic.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nIstanbul pole for on-song Rossi\nValentino Rossi puts his Yamaha on pole for Sunday's Turkish MotoGP, just ahead of team-mate Colin Edwards.\n\n\n\n \nBMW may offer Heidfeld new deal\nNick Heidfeld's impressive start to the season could go a long way to landing a new deal with BMW Sauber.\n\n\n\n \nNascar honours Virginia victims\nNascar is to honour the 32 victims of the Virginia Tech shooting tragedy at its next three races.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nBMW may offer Heidfeld new deal\nNick Heidfeld's impressive start to the season could go a long way to landing a new deal with BMW Sauber.\n\n\n\n \nSchumacher vows to answer critics\nRalf Schumacher aims to turn around his season when his Toyota car is \"competitive again\"\n\n\n\n \nHamilton 'could become best ever'\nLewis Hamilton could go on to become the greatest racing driver of all time, his McLaren boss Martin Whitmarsh says.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nStar duo renew marathon rivalry\nHaile Gebrselassie and Paul Tergat head a star-studded field for this Sunday's London Marathon.\n\n\n\n \nGebrselassie targets London 2012\nDistance legend Haile Gebrselassie plans to extend his career and compete in the London 2012 Olympics.\n\n\n\n \nWeir confident of marathon repeat\nBritain's Dave Weir believes he can retain his London Marathon wheelchair title on Sunday.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nTour will snub dope-probe riders\nTour de France chief says riders implicated in the Spanish doping scandal will not be welcome at this year's race.\n\n\n\n \nLandis lines up return to racing\nFloyd Landis will ride in events in the US this summer despite the ongoing doping inquiry into his 2006 Tour de France win.\n\n\n\n \nCavendish claims Belgian success\nBritish cyclist Mark Cavendish held off a world-class field to win the Scheldeprijs Vlaanderen in Belgium.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nMarathon man bucks his ideas up\nA Harlequins rugby league fan is running the London Marathon dressed as Buck, the club's mascot.\n\n\n\n \nHolloway column\nGary's fiery and he says 'You what?' The bloke says '£500,000 for a midget?'\n\n\n\n \nReview of the week\nLionel Messi's wonder goal matches Maradona, while Fletcher feels the heat\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}