{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "Showbiz Tonight <showbiz@mail.cnn.com>", "subject": "TONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT", "body": "\n\n\nCNN.com - Showbiz Tonight\n\n\n\n\n\n\n\n\n\n\nTONIGHT ON SHOWBIZ TONIGHT- CNN HEADLINE PRIME 11pm ET/ 11pm PT\n\nPARIS HILTON APPEALS!\nParis Hilton's\nlawyers have taken the first steps toward appealing her 45-day\njail sentence for violating her probation. Will she win? What\nabout taking responsibility for her actions? And why is her\npublicist back at her side, after she blamed her legal troubles\non him? All the latest, tonight on TV's most provocative\nentertainment news show.\n\nHASSELHOFF'S HASSLE\nA judge suspends David Hasselhoff's visitation\nrights with his children, after a videotape is released showing\nHasselhoff drunk and incoherent. Did the judge make the\ndecision? Plus, Hasselhoff's wife speaks out, in one of the\nnastiest divorce battles ever!\n\nSECRETS TO BEING A\nBIG STAR!\nParis Hilton is the best example of \"famous\nfor nothing,\" so Showbiz Tonight has some advice for her -- the\nsecrets of how to be a real star. How do celebrities\nlike Angelina Jolie, George Clooney, and Nicole Kidman get on\ntop and stay on top? The answer tonight, on Showbiz\nTonight! \n\nSHOWBIZ TONIGHT QUESTION OF THE DAY:\nHasselhoff loses visitation rights: Was it the right call?\nVOTE AT CNN.COM/SHOWBIZ TONIGHT. \n\nSEND US A\nVIDEO EMAIL!\nSend your response to the Question Of The\nDay on video. Look into your camera and tell us what you think.\nResponses must be no longer than 30 seconds. To send your video\nemail, go to cnn.com/showbiztonight.Watch your video responses\non \"Showbiz Tonight\" at 11 p.m. ET/PT on CNN Headline Prime.\n\n\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the Showbiz Tonight list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=showbiz\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}