{"category": "ham", "to_address": "Pat Beyer <patrickbeyer@gmail.com>", "from_address": "Ladislav Ardo <Ladislav.Ardo@aoes.com>", "subject": "Re: [Samba] Roaming Profile & Folder Redirection Problems", "body": "Pat Beyer wrote:\n> I'm having trouble with my Samba PDC, the client machines wont download the default profile from the Samba PDC, I have read your article \"[Samba] Roaming Profile & Folder Redirection Problems\" and I'm not sure if the problem is on the client side, I suspect the server configuration but I'm new to Samba, and I'm using John Terpstra's book but I cant find the answer to my problem.\n>\n> Here is my scenario\n>   I am a teacher in South Africa, I have a completely isolated (network wise) computer lab with 40 windows 2000 professional workstations, and 5 completely different groups of users, requiring completely different software, I would like to restrict each group from using the other groups software, I am trying to set-up this up using samba 3.0.24 running as a PDC, and with mandatory default profiles. In addition to this each user/student requires his/her own folder on the server to save files.\n>\n>   I have read the Samba HOWTO and TOSHARG, I have successfully installed the PDC and I can connect to it from my client machines, I am also able to save files into different user directories, I am stuck on the profile default part.\n> Can you please help me, I have attached a copy of my smb.conf file?\n>\n> Thanks in advance for your help\n>\n> Kind regards\n> Pat Beyer\nPat,\n\nwent down this road and it ain't pretty. During of the month of \nfrustration (mostly due to lack of in-depth documentation from \nMicrosoft). I have came across the Flex Profile Kit \n(www.loginconsultants.com) which basically provides for workable \nsolution and did the complete trick for me. It comes with detailed \nmanual on how to set it up. I am not a developer, from the perspective \nof an sysadmin - it works and seem to work well (now in production for 4 \nmonths).\n\nregards,\nLadislav.\n\n"}