{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Google Alerts <googlealerts-noreply@google.com>", "subject": "Google Alert - bush", "body": "\nGoogle News Alert for: bush\n\n\nBush Has New Wrinkle in Insurance Plan\nForbes - NY,USA\nBy KEVIN FREKING 06.27.07, 8:10 PM ET The Bush administration sought\nWednesday to turn a coming debate over children's health insurance into\none that ...\n\nSee all stories on this topic\n\n\nTensions grow: Bush acknowledges rift with Russia\nUSA Today - USA\nBy David Jackson, USA TODAY PRAGUE, Czech Republic -- President\nBush raised the stakes Tuesday for his upcoming faceoff with Russian\ncounterpart Vladimir ...\n\nSee all stories on this topic\n\n\nBush ordered my death: Castro\nHindu - Chennai,India\nHAVANA: Cuban leader Fidel Castro has accused US President George W.\nBush of \"authorising and ordering\" an attempt on his life. Mr.\nCastro's essay noted ...\n\nSee all stories on this topic\n\n\nLaura Bush touts aid successes on Africa tour\nChristian Science Monitor - Boston,MA,USA\nBy Joseph J. Schatz | Correspondent of The Christian Science Monitor\nLusaka, Zambia - When first lady Laura Bush tours the Zambian\ncapital of Lusaka ...\n\nSee all stories on this topic\n\n\nBush hails 'strong guy' Blair, rejects 'poodle' talk\nDaily Times - Lahore,Pakistan\nLONDON: US President George W Bush wrote a lengthy tribute to Prime\nMinister Tony Blair on his last day in power on Wednesday, describing him\nas \"a strong ...\n\nSee all stories on this topic\n\n\nBush creates Muslim envoy post\nJerusalem Post - Israel\nBy HILARY LEILA KRIEGER Amid growing criticism that his administration\nhasn't focused enough on engagement in the Middle East, US President\nGeorge W. Bush ...\n\nSee all stories on this topic\n\n\nClinton, Richardson urge Bush administration to continue talking ...\nSan Diego Union Tribune - United States\nBy Nedra Pickler AP WASHINGTON - Democratic presidential contenders\nHillary Rodham Clinton and Bill Richardson on Wednesday urged the\nBush administration to ...\n\nSee all stories on this topic\n\n\nUS Senate Panel Subpoenas Documents from Bush Administration on ...\nVoice of America - USA\nPresident Bush defended the program, but many in Congress argued it\nviolated the 1978 Foreign Intelligence Surveillance Act, or FISA, which\nrequires ...\n\nSee all stories on this topic\n\n\nRepublicans break ranks with Bush over Iraq\nTelegraph.co.uk - United Kingdom\nBy Alex Spillius in Washington Two influential Republican senators have\nbroken ranks and called for President Bush to change his strategy in\nIraq and ...\n\nSee all stories on this topic\n\n\nWorld crisis of confidence in Bush\nTimes Online - UK\nGlobal distrust of President Bush is mutating into an almost\nworldwide sentiment of antiAmericanism, according to the world's most\ncomprehensive poll of ...\n\nSee all stories on this topic\nGoogle Blogs Alert for: bush\n\n\nA legal noose around Bush\n\nBy admin\n\nA devastating ruling from a conservative court has demolished George W Bush's \"war paradigm\", writes Sidney Blumenthal. read more.\n\n\nopenDemocracy - Free Thinking... - http://www.opendemocracy.net\n\n\n\nLeading Republicans urge Bush to reconsider Iraq 'surge'\n\nUS President George W Bush's fragile political firewall against Iraq war critics is under siege, as two Republican senators break ranks with renewed calls for changes in US strategy.\n\n\nABC News: Breaking Stories - http://www.abc.net.au/news/\n\n\n\nBush Suffers More Defections on Iraq\n\nBy Jim Lobe\n\nExcerpt: In a potentially significant setback to President George W. Bush's efforts to sustain Republican support for his \"surge\" in Iraq, three key senators this week have called on the White House to revise US strategy there before ...\n\n\nAntiWar.com - http://www.antiwar.com\n\n\n\nThank You, George W. Bush\n\nBy owillis@gmail.com (Oliver Willis)\n\nThey share with the public at large a negative view of President Bush, who has a 28 percent approval rating with this group, and of the Republican Party. They hold a markedly more positive view of Democrats than they do of Republicans. ...\n\n\nOliver Willis - http://www.oliverwillis.com/\n\n\n\nA Playground Lesson for Bush\n\nBy Tony\n\nOn May 8 of 2001, I published a piece on TIME.com -- now only available in cached form -- that foresaw some of the consequences of the by-then already obvious aggressive unilateralism of the Bush Administration (ie even six months before ...\n\n\nRootless Cosmopolitan - http://tonykaron.com\n\n\n This as-it-happens Google Alert is brought to you by Google.\n \nRemove this alert.\n  Create another alert.\nManage your alerts.\n\n"}