{"category": "ham", "to_address": "\"R. Villegas\" <villegas.ro@gmail.com>", "from_address": "Stefan Grosse <singularitaet@gmx.net>", "subject": "Re: [R] update packages with R on Vista: error", "body": "Thanks for pointing at this. But you know, the user is writable. R is\ninstalling Packages in /Documents/R/win-library which works fine so I\nfind it absolutely naturally that update should work as well. Especially\nsince when I install the packages it gets the latest version, library\nloads this latest version but update still does want to update this\nlatest package with the package I already installed and fails ...\n\nIn my opinion the update on windows is simply buggy.\n\nI think one should definitely not turn UAC off. ( its a good security\nfeature). Btw. MikTeX 2.6 is able to deal with UAC - I can update my\nlatex packages without any problems even though they are in the Program\nFile directory (and also on-the-fly installation does work) ...\n\nStefan\n\n-------- Original Message  --------\nSubject: Re:[R] update packages with R on Vista: error\nFrom: R. Villegas \nTo: Stefan Grosse \nDate: 07.06.2007 23:13\n> If R is installed within \"Program Files\", one of Vista's security\n> settings may interfere with the -update- process.\n>\n> The setting may be disabled globally by choosing:\n> Windows (Start) menu, Control Panels, User Accounts and Family\n> Safety (green title), User Accounts (green title), and\n> Turn User Account Control on or off (very bottom).  You will be\n> prompted for permission to continue; click continue.  On the\n> screen you will see a checkbox titled \"Use User Account Control\n> (UAC) to help protect your computer\".  Uncheck this and click\n> the OK button to save the changes.  Windows Vista will now allow\n> programs, including R, to update files in \"Program Files\".\n>\n> Rod.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}