{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Joe Smith\" <unknown_kev_cat@hotmail.com>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "\n\"Francesco Poli\"  wrote in message \nnews:20070531222302.4950f170.frx@firenze.linux.it...\n\n>I am sorry for not being clear enough: I meant to refer to the *thread*\n>that started from your message, not just to your message.\n>I now realize that, unfortunately, the rest thread was on the next month\n>and hence is not linked by the web archives!\n>I apologize, the rest of the thread starts here:\n>http://lists.debian.org/debian-legal/2007/04/msg00001.html\nNot a problem.\n\n\n\nThe Final draft of the GPL 3 is now out.\nAt least serveral of the issues you brought up have been addressed.\n\nFor example the part that began \" If the work has interactive user \ninterfaces, each must include a convenient feature that\"\nis now:\n>d) If the work has interactive user interfaces, each must display\n>Appropriate Legal Notices; however, if the Program has interactive\n>interfaces that do not display Appropriate Legal Notices, your\n>work need not make them do so.\n\nA new definition has been added:\n\n > An interactive user interface displays \"Appropriate Leal Notices\"\n>to the extent that it includes a convenient and prominently visible\n>feature that (1) displays an appropriate copyright notice, and (2)\n>tells the user that there is no warranty for the work (except to the\n>extent that warranties are provided), that licensees may convey the\n>work under this License, and how to view a copy of this License.  If\n>the interface presents a list of user commands or options, such as a\n>menu, a prominent item in the list meets this criterion.\n\nOne other potential issue with this is the \"additional terms\" section\nwhich a clause that reads:\n\n> b. requiring preservation of specified reasonable legal notices or\n>  author attributions in that material or in the Appropriate Legal\n>  Notices displayed by works containing it; or\n\nThis still places some slight restrictions on modification,\nbut it is limited. This does looks better overall IMHO,\nand is probably about as good as the FSF is willing to get,\non this issue.\n\nThere is also now a dissussion draft of the GNU AGPL (acoording to the\nchanges document, although there is no sign of it on the discussion site.\n\n\nThe reference to the \"Magnuson-Moss Warranty Act\" has been removed.\nThe basic interperation concepts that were desired have been explicitly \nstated,\nrather than referencing US caselaw.\n\n\nThey did not change anything in the anti-circumvention section,\nexcept for the title of the section.\n\n\n\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}