{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nWednesday, 23 May, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nLive - AC Milan v Liverpool\nAC Milan and Liverpool are set to go head-to-head in the Champions League final in Athens.\n\n\n\n \nMolby wants Crouch & Kuyt pairing\nFormer Liverpool star Jan Molby is backing Peter Crouch to start with Dirk Kuyt in attack against AC Milan.\n\n\n\n \nAC Milan v Liverpool\nTeam news ahead of Wednesday's Champions League final between AC Milan and Liverpool in Athens.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nRose ready for 'major' challenge\nJustin Rose is looking forward to tackling Ernie Els's beefed-up Wentworth at the BMW PGA Championship.\n\n\n\n \nFaldo picks Ryder Cup assistants\nEuropean Ryder Cup captain Nick Faldo names Jose Maria Olazabal and Paul McGinley as his two assistants for next year's competition in America.\n\n\n\n \nWoosnam to miss Wentworth event\nIllness forces Ian Woosnam out the PGA Championship at Wentworth.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nLauda 'stunned' by Hamilton start\nTriple world champion Niki Lauda says Lewis Hamilton has impressed him more than any other rookie driver he has seen.\n\n\n\n \nRaikkonen expects end to problems\nKimi Raikkonen hopes he has made a breakthrough in his struggles to adapt to his new Ferrari.\n\n\n\n \nHaydon splits with Virgin Yamaha\nJames Haydon parts company with British Superbikes team Virgin Yamaha by mutual consent after struggling to adapt to using Pirelli tyres.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nLauda 'stunned' by Hamilton start\nTriple world champion Niki Lauda says Lewis Hamilton has impressed him more than any other rookie driver he has seen.\n\n\n\n \nRaikkonen expects end to problems\nKimi Raikkonen hopes he has made a breakthrough in his struggles to adapt to his new Ferrari.\n\n\n\n \nHamilton plays down Monaco hopes\nLewis Hamilton says he is \"realistic\" about winning the Monaco Grand Prix on his Formula One debut in the Principality.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nPavey races to Manchester victory\nBritain's Jo Pavey produces a world-class performance to win the Great Manchester Run.\n\n\n\n \nSayers sets new UK javelin record\nGoldie Sayers breaks the British javelin record with a throw of 65.05m at the Loughborough International meeting.\n\n\n\n \nGB trio shine in Great Wall test\nBritain has three top-10 finishers in China's Great Wall Marathon as Salvador Calvo smashes the record in one of the world's toughest 26-mile races.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nPetacchi wins third Giro sprint\nAlessandro Petacchi wins a sprint finish to claim the 11th stage of the Giro d'Italia in Pinerolo.\n\n\n\n \nAce Cavendish continues to dazzle\nBritain's Mark Cavendish wins the second stage of the Tour of Catalunya, edging a mass sprint at the finish.\n\n\n\n \nNapolitano upsets rival Petacchi\nDanilo Napolitano spoils Alessandro Petacchi's hopes of taking a hometown win on stage nine of the Giro d'Italia.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nChampions League Ten to Tackle\nTest your knowledge of the competition with our special quiz\n\n\n\n \nQuotes of the Week\nLawro says what he thinks about the FA Cup final, plus Mourinho & Warnock\n\n\n\n \nVictory is sweet for Pete\nPete Doherty scores the winner as his side win football event\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}