{"category": "spam", "to_address": "captains@flax24.uwaterloo.ca", "from_address": "\"Vonda Laird\" <paxentgrattechniktuf@entgrattechnik.de>", "subject": "Anatrim will change your life", "body": "\nMelt away pounds with Anatrim\n\n\n\n\n\n\nAnatrim – The latest and most delighting flesh loss product available – As shown on ABC.\n\n\nDo you remember all the times when you plead to yourself to do any thing for being saved from this quickly growing number of kilos? Fortunately, now no big offering is demanded. With Anatrim, the ground-shaking kilos-melting medley, you can achieve healthier mode of life and become really slimmer. Have a look at what people state!\n\n\n\n\"It’s unbearably difficult to admit it but I was an awful food addict. \n\n\nI ate all this garbige \n\n\nand could not stop. \n\n\n\n\nThis torment left off after I started course of taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite vanished, \n\n\nspirits improved and I became the happiest person on the planet 19 pounds in 2.1 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person in the world!\"\n\n\n\n\n\nVictoria K., Boston\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nYou can't even fancy how I abhorred being ridiculed at school. \n\n\n\n\nI detested my weight and I abhorred even myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nIt literally pulled me out of this fearful nightmare! Many and many thanks to you, guys.\"\n\n\n\n\n\nMike Brown, Las Vegas\n\n\n\n\n\n\"You know what? Thanks to Anatrim my marriage was luckily saved! I fell down into the circle, depression – eating more – even more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nOne my best friend showed me web page and I ordered up Anatrim right off. \n\n\nThe results I achieved were great, my appetite came to admissible level, I was often in good spirits, and, certainly, I became able to tighten my belt on some holes. And the sex became fantastic, too!\"\n\n\n\n\n\nJoe\n\n\n\n\n There is a great number of gratitudes left by delighted people taking Anatrim. Don’t you gonna join the thousands and thousands of slim women and men and try this original appetite reducing energy increasing product now!\n\n\nDo not miss your chance!\n\n\n\n\n"}