{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] Bloomberg on Generics and the Trade Deal", "body": "http://www.bloomberg.com/apps/news?pid=20601087&sid=aaYycXo3bFyo&refer=home\n\nCongress, Bush Forge Deal on Peru, Panama Trade (Update1)\n\nBy Kim Chipman\nBloomberg\nMay 11\n\n[snip]\n\nGeneric Drugs\n\nThe agreement also would allow generic drugs to enter another country\nmore quickly. That provision would apply only to Peru, Panama and\nColombia, not South Korea, Schwab said.\n\nWhile Democrats have been seeking the labor provisions, business groups\nsaid the standards may rebound against the U.S., leading to challenges\nof U.S. law, including those that restrict strikes by government workers.\n\nU.S. drugmakers have objected to provisions that would make it easier\nfor foreign competitors to produce generic drugs. The U.S. manufacturers\nsay they should be protected from such competition because they bear the\ncost of developing the drugs.\n\n\"The pharmaceutical industry is being singled out and punished,\" [Bill\nMorley, senior vice president in Washington of MWW Group, a lobbying\nfirm representing clients with an interest in international trade,\nincluding the American Chamber of Commerce of Peru] said. The result may\nbe that they will do less business in those countries, hurting people's\nability to get needed drugs,\" he said.\n\n\"We will see what happens in the Senate,\" said Democratic Senator\nSherrod Brown of Ohio, who campaigned last year against Bush's trade\npolicy. \"I am not convinced yet that the House will be able to move\nforward on those agreements. This trade policy, it has failed American\nworkers.\"\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}