{"category": "spam", "to_address": "Theorize <theorize@plg.uwaterloo.ca>", "from_address": "Allison Barry <jmandymoorethailand@goldenalaska.rydex.com>", "subject": "Say \"YES\" to perfect sex!", "body": "\n\nLooking for an effective and cheap solution? Tired with your sexual problems? \nClick here to become a sex giant\nWe have pills for any disease: ED, Weight loss, Antibiotics etc. Instant shipping, perfect support!\nClick here to be the best lover in the world!\nLowest prices on the web, only licensed and quality pills.\nWith best regards,\nAllison Barry\n \n \nSily Neba! Ia uvidel, kak vseh troih profi podbrosilo vverh, tela ih stremitelno Zavertelis vokrug osi, razbrosav ruki, slovno lopasti propellerov, a zatem Shtoporom ushli v nevidimuiu voronku. Ia vdrug neobychajno ostro oshchutil, chto nahozhus na vernom puti. Neskolko minut ia derzhalsia s nim na ravnyh, potom prishlo trevozhnoe Oshchushchenie, chto dejstvie Mobra nachinaet slabet. Mne tozhe bylo o chem podumat. \nNe amulet Namestnika, a kakoj-to Chuzhak spas zhizn ej, elitnoj voitelnice Siiaiushchego. Zakonchiv repliku rezkim harakternym razvorotom, takim zhe, kak v Kosmoporte pri proshchanii, ona stremitelno zashagala obratno. Bravo, inop! Dos paru raz vialo hlopnul v ladoshi, napomniv o svoem Sushchestvovanii. Ty zabyvaesh o moih Poruchiteliah-riverah. Na etom potok informacii issiak. Pozzhe! Ia vspomnil, chto eta komnata byla gostevoj i k nej dolzhna byla primykat Nebolshaia spalnia. Vot tak sebia i nado bylo vesti. Nesmotria na drobnyj shum livnia, tihie slova prozvuchali vpolne otchetlivo. \nNe obrashchaj vnimaniia. Tysiachnoe vojsko, sviazyvavshee emu ruki, davno Bylo otoslano nazad, tak kak osady goroda haskov ne potrebovalos, i dalshe Drahub otpravilsia lish s dvumia voinami-pardami, starymi proverennymi veteranami Dzharvigom i Stosharkom. No tot uzhe obmiak, ryvok otnial u nego Poslednie sily k soprotivleniiu. S zatianutogo grozovymi tuchami neba upali pervye krupnye kapli nachinaiushchegosia Dozhdia. ejisuminyon UkFHXFBeQEp0RV1VHUFCUEZWRlleXR1XVA==\n \n\n\n"}