{"category": "spam", "to_address": "<ktwarwic@flax24.uwaterloo.ca>", "from_address": "\"The Bull Report\" <news@thebullreport.com>", "subject": "News update: Dhanoa Minerals Receives Equity Financing Commitment From Institutional Investors for Additional $2.3 Million", "body": "    To view this email as a web page, go    here.     \n\n\n\nThe Bull ReportJune 7th, 2007\nDhanoa Minerals Receives Equity Financing Commitment From Institutional Investors for Additional $2.3 Million\nFinancing to Complete Acquisition of Its Three Bella Rica Mines and New Central Processing and Refinery Facility\nTORONTO, ONTARIO--(MARKET WIRE)--Jun 7, 2007 -- Dhanoa Minerals Ltd. (OTC BB:DHNA.OB - News)(Frankfurt:\nD7Z.F - News\n) is pleased to announce that the company has received a financing commitment for $2.3 million. The financing will be used to complete the purchase of the company's three gold and silver mines located in Southern Ecuador as well as continue efforts to modernize mine operations. The three mines (Bonanza, Guanache, and Mollopongo) are believed to contain 850,000 ounces of gold and over 4 million ounces of silver.\nThe company will dedicate $1.3 million of the new equity financing to complete the acquisition of the mines. Dhanoa Minerals will have satisfied all of the cash obligations pursuant to the acquisition and will have officially acquired its 80% interest in the three Bella Rica mines. This will give Dhanoa Minerals full ownership of the revenue generated from all gold and silver production at these properties.\nUpon closing, the company will also realize ownership of an additional 2,100 ounces of gold and 10,000 ounces of silver in reserves, which has a current market value of over $1.5 million.\nThe remaining monies for the equity financing will be used to complete the recently announced acquisition of the \"Spanish Plant\", a new central processing and refining facility, as well as continue other modernization efforts to increase production.\n\"This equity financing commitment is the realization of our acquisition of these tremendously resource rich properties and represents a significant milestone for our company. Today is a very exciting day for our shareholders. Today Dhanoa Minerals has become a major force in gold and silver production in southern Ecuador,\" stated Lee Balak, President of Dhanoa Minerals.\nThe Company:Dhanoa Minerals Ltd. (OTCBB: DHNA) is a newly incorporated naturalresource exploration company. It is acquiring, exploring and developing existing and new natural resource properties thought to contain significant quantities of gold and other minerals. The Company was incorporated in July 2005 and is headquartered in Nevada,\nThe Company owns a 100% interest in two adjacent mineral projects in Canada - Close-Allies I and Close Allies II.  In addition, Dhanoa  holds an 80% interest in an Ecuador mining company, Promenasa. The Company also recently acquired four properties that are part of the Bonanza Project in the Bellarica gold mining camp in Ecuador. These are gold producing mines and Dhanoa plans to increase production byupgrading extraction operations.\nDhanoa is targeting production in its first year (ending June 2008) at approximately 100,000 ounces. At recent gold prices of approximately $680 per ounce, the value of 2008 production may approach $68 million.  In addition, the Company expects to double production the following year to approximately 250,000 ounces worth around $170 million at today's prices. Investments the Company is making in upgrading its processing faclities are expected to result in a 40% improvement in the production recovery rate from its existing faciliies.\nRead the full report\n\n\nRead the full disclaimer\n\n\n\n\n\n                                    This email was sent to:  ktwarwic@flax24.uwaterloo.ca\n\n\n\n\n                                                            This email was sent by: The Bull Report                                                                                                              \n                                                            1846 rosemeade 104 dallas, TX 75007 USA \n                                                            \n\n\n          \n                                    We respect your right to privacy - view our policy\n\n\n\n\n\n\n\n\n\nManage Subscriptions | \n                                    Update Profile | \n                                    One-Click Unsubscribe\n\n\n\n\n\n"}