{"category": "ham", "to_address": "\"\" <ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"The Internet Patrol\" <info@theinternetpatrol.com>", "subject": "\n The Internet Patrol -  Fake eBay Customer Notice is Really a Forged Phishing Attempt - See Pictures Here!", "body": "\n\n\nThe Internet Patrol\n\n\n The Internet Patrol\nhttp://www.theinternetpatrol.com\n\nFake eBay Customer Notice is Really a Forged Phishing Attempt - See Pictures Here!\n\nLots of people are receiving a purported \"customer notice\" from eBay.  It starts out \"Please note that this is a system generated email.\" And goes on to state that \"eBay has sent you this message to remind you its time to update your account details. To ensure your account continues to function normally it is recommended you update your details.\"  It looks very real, but it's actually a phish originating from Moldova. \n\nRead more here: Fake eBay Customer Notice is Really a Forged Phishing Attempt - See Pictures Here! \n\nPlease visit http://www.TheSiteForTheCure.com !  Pretty please??\n\nHere are some amazing deals we've found on the Internet for ourselves recently:\n\n\nSend Unlimited Newsletters to Your Customers, Friends, Family, and Others:  http://www.theinternetpatrol.com/the-perfect-way-to-send-email-newsletters\n\nUnlimited Calls to Any Phone in the U.S.:  http://www.theinternetpatrol.com/make-unlimited-phone-calls\n\nCheck out our online audio show, \"Three Things You Should Know\"!  http://www.ThreeThingsYouShouldKnow.com\n\n\nAnd check out the best collection of how to videos at http://www.LearnHowTo.TV !\n\n\nKnow somebody who would like to receive these alerts?  Forward this one to them and let them know\nthat they can sign up for free by sending email to \"internetpatrol@aweber.com\" with the \nword 'Subscribe' in the subject!\n\n\n\n\n\nThe Internet Patrol, \n302 W. El Camino Real, #411, \nSunnyvale, CA 94087, USA \n\n\n\nTo unsubscribe or change subscriber options visit:\nhttp://clients.suretymailings.com/z/r/?TBwMLMwctMzsTCxMTJzs\n\n\n"}