{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Power Marketing Association<Power.Marketing.Association@calcium.netcontentinc.net>", "subject": "Distributed Energy Resources-Emerging Business Models for Utilities  June 14-15   Austin, TX ", "body": "\n\n\n\n\nEUCI Newsletter\n\n\n\n\n\n\n\n\n\n\n\n\nDistributed Energy Resources \nEmerging Business\n                      Models\n\n\nJune 14 - 15, 2007  Austin, Texas\n\n\n\nClick Here \n            To Download A Complete Conference Brochure\n Click Here For A Complete Listing\n              Of Upcoming Conferences\n \n\n\n\n\n\nOVERVIEW\n\n\nAs utilities experience increased pressure to install more distributed energy resources (DER), whether such resources are renewable or more traditional combined heat and power (CHP) facilities, they are struggling to find a business model(s) that makes installation of these facilities profitable for all involved. The attributes of the various DER facilities currently available can address many of a utility’s needs, such as:\n \n\nSatisfying the renewable requirements being legislated through the Renewable Portfolio Standards (RPS)\nRelieving congestion on transmission lines\n\nDeferring capital investment in generation assets\n\n\n \nBut, even the most DER “friendly” utilities are rightfully concerned about loss of revenue, contractual arrangements and risk management.\n \nUtilities are facing new situations like:\n \n\nA DER facility may be positioned perfectly to provide VAR support, but the utility’s tariff arrangements do not provide for its customers to supply VARs\n\nA new CHP is proposed at a manufacturing facility that is located on a “soft” portion of a utility’s grid. How can the utility make arrangements for the potential support that may be provided by the new generation?\n\nA large pulp and paper facility wants to provide surplus power that may violate wheeling regulations. How can the surplus be accommodated?\n\nThe new frozen food packaging facility is looking at a site analysis that suggests a CHP facility will be the deciding factor on where to locate—inside your territory or on the grid of the competing utility in the next county—what rate structure\n                        will be profitable for both parties and keep the facility in your revenue stream?\n\nA children’s hospital needs to ensure power is available when disaster strikes, and has a need for increased thermal energy. What arrangements can be made to use a CHP facility as a standby energy resource?\n\n\n \nNew market opportunities are fueled by state interconnection standards, renewable portfolio standards, and municipalities that are moving toward sustainability programs. At the same time, new technologies are making small generating units more efficient and renewable qualified. Utilities are faced with a matrix of opportunities for distributed energy resources that will be shaped by regional situations. New ownership, operation and maintenance models may also provide the mechanism that makes a DER profitable for all involved. These market changes require a new business model that incorporates legislated requirements, greening efforts, and new technologies.\n \nThis conference is designed to summarize the factors that are reshaping the DER market and highlight business models that may create a favorable agreement for utilities.\n \nEUCI, a long-time provider of timely conferences and workshops for the electric industry, has assembled experts to explore new business models that utilities are using to profitably integrate distributed generation into their portfolio mix.\n \nWho Will Benefit From this Conference? \nThis conference will provide new and valuable information for all levels of utility staff and management. The content may be of specific interest to:\n\nUtility professionals in systems planning, DER rate design, or DER contracts\n\nMunicipalities considering or currently operating a DER program\n\nInstitutional facilities considering or currently operating a DER program\n\nDER developers, consultants, manufacturers and potential DER owners\n\n\n\nREGISTER\n\n\n\nClick Here \n            To Download A Complete Conference Brochure\n Click Here For A Complete Listing\n              Of Upcoming Conferences\n\n \n\n\n\n\n\n\nUpcoming Conferences \n\n\n \n   Realizing Maximum Value from Generation\nChicago, IL\n                            May 10-11, 2007\n  In-Depth \n                            introduction to the Natural Gas Industry\nDallas, TX\n                              May 15-16, 2007\n  Natural Gas \n                            Transactions, Trading and Origination for Non-Traders\nDallas, TX\n                              May 16-17, 2007\n  Developing and \n                            Launching New Products and Services for Utilities\nDallas, TX\n                              May 17-18, 2007\n   Carbon Finance \n                            and Investment Summit\n New \n                            York, NY\n May 21-23, 2007\n  Performance \n                            Benchmarking For Energy Utilities\nSeattle, WA\n                              May 23-24, 2007\n  Pandemic \n                            Preparedness For Utilities\nSeattle, WA\n                              May 23-24, 2007\n  Capacity \n                            Markets\n Washington, DC\n June  4-6, 2007\n  Coal-to-Liquids \n                            Finance and Development Summit\n New York, NY\n June  4-6, 2007\n   Strategies for \n                            Bidding Ancillary Services in LMP Markets\n Indianapolis, \n                IN\n June 6-7, 2007\n  Intro to Electric \n                            Utility Systems for Non Engineers\n Austin, \n                TX\n June 14-15, 2007\n   Distributed \n                            Energy Resources-Emerging Business Models for Utilities\n Austin, \n                TX\n June 14-15, 2007\n  Managing Physical \n                            & Financial Uncertainty in the Power Industry\n New York, \n                 NY\n June 19-20, 2007\n  Value \n                            and Risk in Energy Markets - Introduction & Principles (Program 8)\n San Diego, CA\n June 19-21, 2007\n  Alternative \n                            Regulation for Electric and Gas Utilities\n Boston, MA\n June 25-26, 2007\n  In Depth \n                            Introduction to Electricity Markets\n  Alexandria, VA\n June 25-26, 2007\n  Customer \n                            Communications for Utilities\n Boston, \n                            MA\n June 27-28, 2007\n  Implementation \n                            and Cost-Benefit of Workplace Weight Management Strategies\n  Chicago, IL\n June 28-29, 2007\n\n\nPlease forward this invitation to \n                          colleagues who may benefit from attending.\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}