{"category": "spam", "to_address": "Gnitpick <gnitpick@flax24.uwaterloo.ca>", "from_address": "Laura Cameron <extroluvsu@getglobe.com>", "subject": "Love accelerator", "body": "\n\nThere is no need to exert yourself with silly doubts while you are in bed.\nClick here to be the best lover in the world!\nViagra and Cialis will help you in any situation. \nClick here to become a sex giant\nSecure, confidential purchase!\nWith best regards,\nLaura Cameron\n \n \nDelo bylo ne v holode, kotoryj prihodil vmeste so Snegom. Vypiraiushchie iz zemli moshchnye uzlovatye korni, vysochennye svechi Serotelyh drevesnyh velikanov, tonuvshih verhushkami v nagromozhdenii lian, Gustye kusty, mertvye suhie suchia i pni, ostanki poverzhennyh derevev ves Etot ansambl sozdaval nepreryvnuiu i diavolski utomitelnuiu polosu Prepiatstvij, zastavliaia rabotat ne tolko nogami, no i golovoj, byt Predelno vnimatelnym, sobrannym, ostorozhnym, vovremia reagirovat na Siurprizy, predostavliaemye lesom shelty v izobilii. Esli ne proizojdet chuda, to alchnost shefira Pogubit vse delo i vse nashi usiliia pojdut galtu pod hvost. Da, pohozhe. \nNo dazhe nevziraia na ego moshch, sviaz vyshla slaboj, i poiavivsheesia v vozduhe pered Glazami lovchego maga izobrazhenie chernogo lica Vladyki neustojchivo kolebalos. Sevren nervno stisnul priklad arbaleta, otpustil i bezotchetno popravil Rukoiat mecha, neprivychno otiagoshchavshego poias. Pogodi. Ona stoiala sprava ot perekrestka prozrachnaia usechennaia plastikovaia Piramida, perevernutaia vverh shirokim osnovaniem, na udivlenie pohozhaia na Takie zhe budki na Nove-2. Nu-nu, paren, ne pytajsia byt zabotlivym bolshe, chem eto neobhodimo, Strogo skazala ta, ne osobenno soprotivliaias. Klianus, sdelaiu ego, chego by mne eto ni stoilo, Esli on ne prikonchit menia ranshe. O nebo, opiat! Kogda Zhe eto konchitsia! myslenno zavopil ia, ne v silah spravitsia s onemevshej Gortaniu. Dazhe pro to, chto kogda-to Proshel obuchenie osobomu iskusstvu vseobemliushchej samozashchity, iskusstvu, Iavliavshemusia sobstvennostiu zagadochnoj drevnej rasy, i kotoroe teper kovarno Pozhiralo !\nmenia iznutri. \nVot Tak siurpriz, sheltiane vse-taki vykrutilis iz etoj peredriagi, da eshche, po vsej Vidimosti, s naimenshimi poteriami. A vot teper chto-to poshlo ne tak Gilsveri pochuvstvoval ottok i napriagsia, preodolevaia soprotivlenie mechej. Ne vazhno, glavnoe sejchas vyzhit. 11. ejisuminyon VVFcRlhQUVh0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}