{"category": "ham", "to_address": "a2k@lists.essential.org, ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] AFP:  Thais protest against US copyright report amid drugs row", "body": "  Thais protest against US copyright report amid drugs row\n\nSome 30 Thai activists Thursday protested outside the US embassy here\nagainst a new report that ranked the kingdom among the world's worst\noffenders of intellectual property rights amid a patent row with\nWestern drug firms.\n\nThe activists accused the US Trade Representative's office of grouping\nThailand with copyright offenders such as China, Russia and India in\nretaliation for the government's decision to allow generic versions of\nAIDS drugs and heart medication.\n\nWearing black T-shirts with crossed-out pictures of US President George\nW. Bush, they unfurled a banner reading: \"Evil USA: Stop threatening\naccess to treatment in Thailand.\"\n\n\"This protest is to express our dismay and outrage at the USTR decision\nin response to Thailand's decision to issue three compulsory licences,\"\nthe activists said in a statement to the media.\n\nSo-called compulsory licences are allowed under World Trade\nOrganisation rules so that countries can temporarily suspend patent\nprotections on medicines to safeguard public health.\n\nThailand has issued compulsory licences for AIDS drugs Kaletra and\nEfavirenz and popular heart disease medicine Plavix. The government\nplans to import generic versions of the drugs from India, but could\nalso choose to manufacture them itself.\n\nIn an annual report released on Monday, the US trade office said it was\nconcerned by \"an overall deterioration in the protection and\nenforcement of intellectual property rights in Thailand.\"\n\nApart from rampant copyright violations on books, DVDs and apparel\nhere, the US report said Thailand's generic drug efforts were \"further\nindications of a weakening of respect for patents.\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}