{"category": "spam", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"Mayra Boyer\" <acquaint@comease.com>", "subject": "Greater volume better orgasms", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\nA balance needs to be struck between designer and\ncomputer - a blance where the computer is a tool for the designer\nand not the designer itself. Architects and draftspeople now have\nthe unique advantage of being able to conjure up their changing\nvisions quicker than they could possible recreate an intricate\ndrawing by hand.These quickly redrawn views however, only remain\nan advantage to the architect etc. if the designer is still the\nmotivating factor behind the design and is the major contributor\nexist yet. It has been able to avoid fading out of public view \nfor this long because of its' name, which sounds sufficiently\nofficial, and at the same time vague enough to allow its' use in\ncontext with anything one thinks is neat-o. In the forties, there\nwas a similar craze for things whose existence was in question,\nand it also had a misleading name that made people sound clever.\nThat name is Existentialism, and before it became popular, it\nactually meant something. But it was only taken seriously after a\ncouple hundred people who hadn't bothered to find out its'\nmeaning were put in situations where they had to pretend that\nthey had- hey, presto- 200 false definitions! This confusion is\nhappening to virtual reality, only not so romantically as it did\nin post-war France. A few months ago I had dinner with a good\nfriend. As we ate he asked me to explain to him what the whole\ndeal on virtual reality is and I told him, more or less, that it\nis the idea of general purpose simulation, and went on to explain\nthat simulators of this sort need detectors to sense body motions\nor speech, devices to stimulate our senses of sight, hearing,\ntouch, etc., and a computer to connect everything and vary the\ninteraction according to programs. Then I felt obliged to rehash\nthe monologue about the many possibilities of the potential\nmedium, and did, but my friend, who is an Economics major, just\nactually study that kind of stuff at school? I heard all this\ntalk on how important it is!\" He had been impressed by the\nvirtual Paul Reveres, the virtual exaggerators, the virtual\nnewspaper columns with titles like this. It is truly a pity that\nthe term 'virtual reality' isn't used sparingly, and that 'the\nstudy of simulation' or some like phrase doesn't get all the\nattention. Simulators already exist. Because of all this hype,\nvirtual reality is being made to sound a lot more important than\nit is. Virtual reality is being treated like some radical new\nscience. Ad agencies are cashing in on its' commerciality and\nconfusing the general population with the meaning of the term.\nFans of virtual reality are trying to convince people that its'\ndawn is ridiculously near and thus that its' study is pertinent.\nOther virtual reality enthusiasts are preaching that virtual\nreality is \"the way\" and will end racial inequality and give the\nrepressed a voice. Just as preposterously, academics are solemnly\nwarning that virtual reality will create a nation of violent\nthat thrilling. One spends all one's life in an interactive\nworld. A lot of it even bores one. Being inter-active is not\nnecessarily being virtual. It would be kind if advertising\nbe perfected in the next ten years are generally the same people\nwho talk a lot about terra-forming Mars and making it habitable.\nproducts, or real estate. They would not find it useful to\npretend to be a Virtual-prawn on the Cyberspace-Oceanfloor\nNetwork. People could do a lot of things on V.R. networks, not\nall of them brotherly. Thanks to V.R. it would be a lot easier\nfor racist people to form world-wide organizations.. they could\ncongregate daily if they chose. It is just about as likely that\nand so, when they grow older, they'll be conditioned, see, and\nthey'll go nuts and they'll lop off real peoples heads.\n\nchanged the way in which society views and values visual art.  \n\n"}