{"category": "ham", "to_address": "a2k@lists.essential.org, ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] FromGeneva: Pre-Development Agenda Meeting In Singapore", "body": "\nhttp://fromgeneva.blogspot.com/2007/04/pre-development-agenda-meeting-\nin.html\n\nPre-Development Agenda Meeting In Singapore\n\nFromGeneva\nThiru Balasubramaniam\n16 April 2007\n\nThe Government of Singapore will host a pre-Development Agenda meeting\nfrom 30 May to 1 June 2007. The meeting is being convened by the\nIntellectual Property Office of Singapore (IPOS) with invitations being\nsigned by Ms. Liew Woon Yin, Director-General (IPOS).\n\nAccording to the invitation which was sent out on 29 March 2007, the\nSingaporean Government is encouraged by positive outcomes achieved in\nthe 3rd Session of the Provisional Committee On Proposals Related to a\nWIPO Development Agenda (PCDA). In order to \"ensure that the PCDA\nsucceeds in its endeavor, to submit a report to the General Assembly,\nlater this year\", Singapore considers it imperative that the 71\nproposals on the table (including establishing a Treaty on Access to\nKnowledge and fostering discussion on a Medical R&D Treaty), be\n\"examined intensively and a proper understanding developed\" prior to\nthe 4th Session of the PCDA which takes places from 11-15 June 2007 in\nGeneva, Switzerland. This initiative appears similar in spirit to the\nNew Delhi pre-Development Agenda of February 2007 where key\nstakeholders were invited to frame a common consensus. It remains to be\nseen how this informal meeting of selected governments will tackle the\nthornier elements of Annex B of 71 proposals related to a Development\nAgenda.\n\nThe importance attached to achieving a favorable result at the PCDA\nmeeting in June is evidenced by Singapore's remark in the invitation\nletter that the\n\n     process to establish a WIPO Development Agenda has attracted\nconsiderable attention the world over and has raised the expectation of\nthe world IP community, particularly developing countries.\n\n\n\nAs the Singapore informal is intended to be representative, invitations\nhave been extended to developing and industrialized countries and\ntransition economies. In order to achieve geographic balance, it is\nunderstood that the regional coordinator will be requested to nominate\nrepresentatives (either at the capital level or the Geneva level) to\nattend the meeting. It appears that WIPO will fund the travel monies\nfor officials from developing countries and transition countries. Since\nthis meeting \"informal\", it is unlikely that there will be any\nrepresentation from NGOs although this is not explicilty mentioned in\nthe invitation letter. As the future success of the Development Agenda\nis at stake at the June PCDA meeting, the bar is set high for the\nSingapore informal to pave the way for WIPO to truly integrate the\ndevelopment dimension.\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}