{"category": "ham", "to_address": "Andrew <ktwarwic@flax9.UWATERLOO.CA>", "from_address": "\"Organic Consumers Association\" <ronniecummins@organicconsumers.org>", "subject": "Organic Bytes: Tainted Foods, Country of Origin Labels, & Green Shopping", "body": "\n\n\n\n\n\nOrganic Bytes: Tainted Foods, Country of Origin Labels, & Green Shopping\n\n\n\n\n\n\nHello Andrew,\nORGANIC \n      BYTES #108\n      Health, Justice and Sustainability News Tidbits with an Edge!\n\n5/4/2007\n\nWritten \n    and edited by Craig Minowa and Ronnie Cummins\n\nSafe \n    Unsubscribe: http://organicconsumers.org/unsuborganicbytes.cfm \n    \n    You are subscribed as: ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\nIN \n            THIS ISSUE\n\nALERT \n              OF THE WEEK: TELL CONGRESS WE WANT COUNTRY OF ORIGIN LABELS \n              ON OUR FOOD \nPRODUCT \n              PLUNDER OF THE WEEK: PET FOOD CONTAMINATION MOVES INTO USA \n              MEAT SUPPLY\nQUICK \n              FACTS OF THE WEEK:  MORE REASONS TO BUY LOCAL\nWEB \n              VIDEO OF THE WEEK: COMEDY CENTRAL PARODIES THE RBGH CONTROVERSY\nTIP \n              OF THE WEEK: FIVE TOP METHODS TO REDUCE YOUR ECOLOGICAL FOOTPRINT \n              WHEN SHOPPING\nORGANIC \n              BYTES READERS TALK BACK: IS THE FDA GOING TO START REGULATING \n              VEGGIE JUICE AND HOLY WATER? ----- WHY HAVEN'T I RECEIVED YOUR ORGANIC \n              BYTES EMAILS?\nALERT: \n              IT'S TIME TO PHASE OUT THE POISONOUS PLASTIC PVC\n\n\n\n\n\n\n___________________________________\n\n\n\n\n\n\n \n\n\n\n\nALERT \n            OF THE WEEK:\n            TELL CONGRESS WE WANT COUNTRY OF ORIGIN LABELS ON OUR FOOD \n            Concerns over long distance food transportation (food miles) and global \n            warming, compounded by recent food poisoning scandals, linked to contaminated \n            pet, poultry, and pig food ingredients from China, have taken away \n            many Americans' appetites for cheap imported foods. Shocked at media \n            reports that the U.S. Food and Drug Administration is inspecting approximately \n            one-percent of all imported food, health-minded consumers are demanding \n            that Congress implement mandatory Country of Origin Labels (COOL) \n            labels on food. Federal farm policy theoretically requires Country \n            of Origin Labeling for food. Reacting to polls indicating that 80% \n            of American consumers want to know where their food is coming from, \n            Congress incorporated COOL into the 2002 Farm Bill. COOL was supposed \n            to go into effect in September 2004. Unfortunately, corporate agribusiness, \n            Wal-Mart, and the supermarket chains bribed an ethically-impaired \n            Congress with millions of dollars to block implementation of COOL \n            labels. As a result, Americans are buying billions of dollars of imported \n            foods without knowing it. In order to promote health and sustainability, \n            and to save North American family farms, we need to restore our right \n            to know where our food is coming from. Tell Congress we want Country \n            of Origin Labels for both conventional and organic food, and we want \n            it now:http://www.organicconsumers.org/rd/cool.htm\n\n\n\n\n___________________________________\nWe \n    rely on your donations to continue our work on these important issues!\n\nhttp://www.organicconsumers.org/donations.htm\n___________________________________\n\n\n\n\n\nPRODUCT \n          PLUNDER OF THE WEEK:\n          PET FOOD CONTAMINATION MOVES INTO USA MEAT SUPPLY\n          The pet food poisoning scandal that has prompted the largest recall \n          of pet foods in history has spread into the livestock and meat sector. \n          This week, the USDA admitted that the contaminated food ingredients \n          that have killed thousands of pets across the U.S. were also used to \n          feed hogs and chickens that have already been processed and eaten by \n          several million Americans. Over three million chickens and pigs have \n          consumed the tainted food. Although there have been no government studies \n          done on the toxicity of this contamination, the FDA claims the risk \n          is low. It’s important to note that organic animal feed was not \n          contaminated in this latest incident, underlining the obvious point \n          that pet owners and meat eaters should give preference to safer, more \n          nutritious organic products (find \n          organic pet foods here).\nLearn more: http://www.organicconsumers.org/articles/article_5017.cfm\n\n\n\n__________________________________\n \n\n\n\n\n\n\n\nQUICK \n            FACTS OF THE WEEK: \n            MORE REASONS TO BUY LOCAL\n\nEach \n              year, the average American consumes 260 pounds of imported food.\n\n 98.7% \n              of foods imported into the U.S. are NOT inspected by the FDA for \n              safety.\nOf \n              the scant 1.3% of imported foods the FDA tests, over 200 shipments \n              of grains, fish, vegetables, nuts, spice, oils and other imported \n              foods are detained each month for issues ranging from filth to unsafe \n              food coloring to contamination with pesticides to salmonella. The \n              other 98.7% of untested food is immediately green-lighted for the \n              American diet.\nThe \n              U.S. imports almost twice as much food today as it did just ten \n              years ago, yet the FDA's budget for testing imports has been cut \n              nearly in half since 2000.\n\nSource:\n http://www.organicconsumers.org/articles/article_4897.cfm\n\n\n\n\n__________________________________\n\n\n\n\n\n \n\n\n\nWEB \n          VIDEO OF THE WEEK:\n          COMEDY CENTRAL PARODIES THE RBGH CONTROVERSY\nComedy \n          Central's Colbert Report takes a hilarious look at the rBGH controversy. \n          Although the synthetic hormone has been banned in most nations, due \n          to its links to endocrine disruption and cancer, it is still widely \n          used in the U.S.. Monsanto recently filed a formal complaint with the \n          FDA demanding that dairies that have banned the use of rBGH should not \n          be able to label their products as \"rBGH-free.\" Learn more \n          at OCA's \"Millions Against Monsanto\" campaign and watch the \n          short Colbert web video here (Note: Mr. Colbert's humor is irreverent \n          and for adult audiences. Viewer discretion is advised.): http://www.comedycentral.com/shows/the_colbert_report/\n\n\n\n\n___________________________________\n\n\n\n\n\n\n\nTIP \n            OF THE WEEK:\n            FIVE WAYS TO REDUCE YOUR ECOLOGICAL FOOTPRINT WHEN SHOPPING\nThis month's issue of E Magazine includes interviews with leading \n            advocates for ecological shopping, including OCA's Environmental Scientist \n            Craig Minowa. Here are five quick tips for becoming a green shopper:\n\nSwitch \n              to environmentally friendly cleaning supplies. The use of conventional \n              cleaners exposes your family and our environment to some very nasty \n              toxic chemicals.\nIf \n              you buy only one or two organic items, make them milk and meat. \n              Most conventional milk and meat are produced on factory farms that \n              feed their animals massive amounts of pesticide and fossil-fuel \n              intensive conventional corn, at the same time creating massive manure \n              lagoons that contaminate local ground water. \n\nBe \n              as conscious about the packaging as you are about the product. The \n              production and disposal of packaging takes a heavy environmental \n              toll. You can eliminate 1,200 pounds of carbon dioxide (CO2) every \n              year by simply reducing your waste by 10%. While you're at it, bring \n              your own shopping bags.\nBuy \n              local and regional, or at least USA-grown, whenever possible, to \n              reduce energy and pollution from long transportation. But of course \n              some products are not produced in the US.. For overseas products, \n              look for the organic and Fair Trade label.\nBuy \n              in bulk. If you regularly buy a certain product, consider buying \n              it in bulk. It usually has less packaging, is more affordable, and \n              requires fewer trips to the store.\n\nhttp://www.organicconsumers.org/articles/article_5006.cfm\n\n\n\n\n_____________________________\n\n\n\n\n\n\n\n\n\n\nORGANIC \n          BYTES READERS TALK BACK: \nIS \n            THE FDA GOING TO START REGULATING VEGGIE JUICE AND HOLY WATER? \nQUESTION FROM READER: \"I'm confused about your stance \n            on the FDA's new Guidance Document pertaining to alternative health \n            care products. I've seen an alert from another group that seems to \n            suggest the sky is falling, but the OCA's stance in your previous \n            issue of Organic Bytes seems mellow in comparison. Can you please \n            elaborate?\"\nANSWER \n            FROM OCA: There is only one group that has launched an alert on \n            this issue, while all other health freedom groups have taken a more \n            reserved stance. After much research and discussion with our allies \n            in the alternative health world, it is the opinion of the OCA that \n            although this FDA Guidance Document deserves attention, it does not \n            change any laws that are already in place, and, in fact, serves as \n            a distraction from some of the more important issues currently going \n            on in regards to alternative health care regulations. For an in-depth \n            review of this controversy, click here: http://www.organicconsumers.org/articles/article_4988.cfm\n-------------------\n\n\n\n\n\nWHY \n            HAVEN'T I RECEIVED YOUR ORGANIC BYTES EMAILS?\nQUESTION FROM READER: \"I used to get Organic Bytes regularly, \n            but lately it seems to arrive only sporadically. What's up?\"\nANSWER \n            FROM OCA: As our Organic Bytes subscriber list has grown larger, \n            we have run into more problems with getting blocked by various spam \n            filters. The best way to guarantee you'll receive each issue is to \n            add ronniecummins@organicconsumers.org to your email address book. \n            Thanks! Learn more about how to guarantee Organic Bytes will land \n            in your inbox: http://www.organicconsumers.org/whitelist.cfm\n\n\n\n\n_________________________________\n\n\n\n\n\n\n\n\n\n\n\n\nALERT:\n            IT'S TIME TO PHASE OUT THE POISONOUS PLASTIC PVC\n            Polyvinyl chloride is the most toxic plastic on the planet, yet it \n            is one of the most widely used plastics in the U.S. The World Health \n            Organization classifies it as a carcinogen; so many businesses are \n            voluntarily phasing it out. From production to disposal, PVC plastic \n            releases poisonous chemicals that can cause cancer and birth defects. \n            The good news is safer alternatives are available... we don't have \n            to use PVC in our kid's toys or shower curtains. Unfortunately, Target \n            lags behind Wal-Mart and other major retailers in phasing out this \n            unnecessary and dangerous plastic. Join a coalition of groups from \n            around the country fighting for safe and healthy communities at a \n            national PVC Day of Action on May 24th to urge retail giant Target \n            to phase out PVC. The May 24th day of action will take place in conjunction \n            with Target's annual shareholder meeting. Putting together an event \n            is fun and easy, and can be as small as you and a friend or as big \n            as dozens of people outside of your area Target. We'll help you set \n            it up. Get involved and sign up now: http://www.organicconsumers.org/rd/pvc.htm\n\n\n\n\n\n\n__________________________________\n\n\n\n \n \nWe \n    rely on your donations to continue our work on these important issues!\n\n\nhttp://www.organicconsumers.org/donations.htm\n \n******** messages from our \n    supporters*********\n\n\n\n\n\n\n\n Chia Seeds from \n            Good Cause Wellness \n\n\n\nCHIA \n            SEEDS: FUNNY NAME, SERIOUS NUTRITION\n            Superior to Flax Seed, Rich in Omega Acids\nChia \n            seeds have a funny name, but there’s nothing comical about the \n            nutritional benefits of this tiny seed. Want to learn more about chia \n            seeds? Good Cause Wellness has just published a free 16-page report \n            on the benefits of chia seeds with dozens of recipes. It can be downloaded \n            at http://www.GoodCauseWellness.com\n\n\n            If you’re using flax seeds, consider switching to chia seeds \n            for their superior nutrition and ease of use. Chia seeds have the \n            highest percent of combined Omega 3 and 6 fatty acids of any plant, \n            including flax seeds. Plus, chia seeds offer 38% more fiber and 247% \n            more calcium, with less calories and sodium than flax seeds and no \n            cholesterol. Chia seeds are easier to use and more versatile than \n            flax seeds. Because chia seeds have much higher antioxidant levels \n            than flax seeds, chia seeds don’t go rancid like flax.\n\n            Every order from Good Cause Wellness supports organizations like the \n            OCA because Good Cause Wellness pledges 10% of sales to Good Causes. \n            \nLearn more: http://www.GoodCauseWellness.com\n\n\n\n\n__________________________________\n\n\n\n\n\n\n\n\nIf \n            you’re eating pure foods, shouldn’t your vitamins and supplements \n            be completely plant or food-based, and free of synthetic chemicals? \n            \nBotani \n            Vitamins & Supplements invites you to experience the difference \n            between a synthetic based vitamin and a vitamin made of ingredients \n            you can only find in nature. Botani supplement category represents \n            a truly pure, food inherent, supplement with assayed vitamin, mineral \n            and nutrient potencies derived only and directly from food and botanical \n            extract sources. No synthetic vitamins (USP), minerals or nutrients \n            have been added to these supplements (either directly or indirectly). \n            BOTANI \n            Multi Vitamins is a multiple vitamin and mineral supplement that is \n            derived directly from NATURALLY OCCURRING, full-spectrum fruit, botanical, \n            and grain sources. Try Botani Vitamins & Supplements!\n\n \nPlease \n    forward this publication to family and friends, place it on websites, print \n    it, duplicate it and post it freely. Knowledge is power!\n__________________________________\nNOTE \n    TO CO-OP AND NATURAL FOOD STORE SUBSCRIBERS:\n    Organic Bytes is a great tool for keeping your staff and customers up to date \n    on the latest issues. Feel free to forward this email to your staff and print \n    for posting on bulletin boards and staff break tables. You are also welcome \n    to use this material for your newsletters. There's an attractive print-friendly \n    PDF version of this available for free download at http://www.organicconsumers.org/organicbytes.cfm\n\n_________________________________\nORGANIC \n    BYTES is a publication of:\n    ORGANIC CONSUMERS ASSOCIATION \n    6771 South Silver Hill Drive\n    Finland, Minnesota 55603\n    Phone: (218)- 226-4164 Fax: (218) 353-7652\n__________________________________\nSubscribe: \n    Safe Unsubscribe: \n    http://organicconsumers.org/unsuborganicbytes.cfm \n    \n    You are subscribed as: ktwarwic@SPEEDY.UWATERLOO.CA \nChange \n    your subscription settings to receive Organic Bytes as plain text here:\n__________________________________\n   \n\nxaxa1014138\n \n\n\n"}